#Область СлужебныйПрограммныйИнтерфейс

#Область ДатыЗапретаИзмененияДанных

// См. ДатыЗапретаИзмененияПереопределяемый.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения.
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	// Раздел НалогиВзносыОтчисления
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.СведенияОНеоблагаемыхДоходахФизическихЛиц",			"ПериодРегистрации", 	"НДФЛ", "Организация");
	
	// ВнешниеХозяйственныеОперации.НалогиВзносыОтчисленияВХО
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.НалогиВзносыОтчисленияВХО") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("УчетНалоговВзносовОтчисленийВХО");
		Модуль.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных);
	КонецЕсли;
	// Конец ВнешниеХозяйственныеОперации.НалогиВзносыОтчисленияВХО
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьДанныеПерерасчетаОтОбратного(ДанныеПерерасчета, Организация, МесяцНачисления, Сотрудники, ИсключаемыйРегистратор, ЕстьНачисленияПерерасчетОтОбратного) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МесяцНачисления", МесяцНачисления);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ИсключаемыйРегистратор);

	Если Сотрудники <> Неопределено Тогда
		
		Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
		
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Начисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|	Начисления.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	РегистрРасчета.Начисления КАК Начисления
		|ГДЕ
		|	Начисления.Организация = &Организация
		|	И Начисления.Регистратор <> &ИсключаемыйРегистратор
		|	И Начисления.ПериодДействия = &МесяцНачисления
		|	И Начисления.ВидРасчета.ОтОбратного " + ?(Сотрудники <> Неопределено, "И Начисления.Сотрудник В (&Сотрудники)", "") + "
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.Сотрудник,
		|	Начисления.ПериодДействияНачало
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Сотрудники.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТСписокСотрудников
		|ИЗ
		|	ВТСотрудники КАК Сотрудники
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		// необходимо определить размер МРП на начало финансового года
		|	НАЧАЛОПЕРИОДА(ВТСотрудники.ПериодДействияНачало, ГОД) КАК Период
		|ПОМЕСТИТЬ ВТДатыПоМесяцам
		|ИЗ
		|	ВТСотрудники КАК ВТСотрудники";
		
	Запрос.Выполнить();

	Описатель = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудники", "Сотрудник, ПериодДействияНачало");
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(Описатель, Истина, "Подразделение, ВидЗанятости, Должность, ДолжностьПоШтатномуРасписанию");
	
	УчетНалоговВзносовОтчислений.СоздатьВТРазмерыМРППоПериодам(МенеджерВременныхТаблиц);

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Начисления.ПериодРегистрации КАК ПериодРегистрации,
		|	Начисления.Регистратор КАК Регистратор,
		|	Начисления.НомерСтроки КАК НомерСтроки,
		|	Начисления.ВидРасчета КАК ВидРасчета,
		|	Начисления.ПериодДействия КАК ПериодДействия,
		|	Начисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|	Начисления.ПериодДействияКонец КАК ПериодДействияКонец,
		|	Начисления.БазовыйПериодНачало КАК БазовыйПериодНачало,
		|	Начисления.БазовыйПериодКонец КАК БазовыйПериодКонец,
		|	Начисления.Активность КАК Активность,
		|	МАКСИМУМ(Начисления.Сторно) КАК Сторно,
		|	Начисления.Сотрудник КАК Сотрудник,
		|	Начисления.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Начисления.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	Начисления.СторноТекущегоПериода КАК СторноТекущегоПериода,
		|	Начисления.Результат КАК Результат,
		|	Начисления.ОтработаноДней КАК ОтработаноДней,
		|	Начисления.ОтработаноЧасов КАК ОтработаноЧасов,
		|	Начисления.РезультатВТомЧислеЗаСчетФБ КАК РезультатВТомЧислеЗаСчетФБ,
		|	Начисления.ГрафикРаботы КАК ГрафикРаботы,
		|	Начисления.ВидУчетаВремени КАК ВидУчетаВремени,
		|	Начисления.ВремяВЧасах КАК ВремяВЧасах,
		|	Начисления.ГрафикРаботыНорма КАК ГрафикРаботыНорма,
		|	Начисления.Организация КАК Организация,
		|	Начисления.ФиксСтрока КАК ФиксСтрока,
		|	Начисления.ФиксЗаполнение КАК ФиксЗаполнение,
		|	Начисления.ФиксРасчетВремени КАК ФиксРасчетВремени,
		|	Начисления.ФиксРасчет КАК ФиксРасчет,
		|	Начисления.ФиксСторно КАК ФиксСторно,
		|	Начисления.РасчетнаяБазаЗаЕдиницуНормыВремени КАК РасчетнаяБазаЗаЕдиницуНормыВремени,
		|	Начисления.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	Начисления.ПериодРегистрацииВремени КАК ПериодРегистрацииВремени,
		|	Начисления.ПериодРегистрацииНормыВремени КАК ПериодРегистрацииНормыВремени,
		|	Начисления.ДоляРезультата КАК ДоляРезультата,
		|	Начисления.Месяц КАК Месяц,
		|	Начисления.ДокументОснование КАК ДокументОснование,
		|	Начисления.СторнируемыйДокумент КАК СторнируемыйДокумент,
		|	Начисления.ГоловнойСотрудник КАК ГоловнойСотрудник,
		|	Начисления.ОбщийГрафик КАК ОбщийГрафик
		|ПОМЕСТИТЬ ВТ_РасчетОтОбратногоМенее25МРП
		|ИЗ
		|	РегистрРасчета.Начисления КАК Начисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокСотрудников КАК СписокСотрудников
		|		ПО СписокСотрудников.Сотрудник = Начисления.Сотрудник
		// отрежем документы межрасчета с доходом больше 25 МРП (для таких сотрудников корректировка в месяце применяться не будет) 
		// межрасчетные выплаты также учитываем (расчет налогов и расчет сумм "от обратного" это разные области)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРазмерыМРППоПериодам КАК МесячныйРасчетныйПоказатель
		|		ПО (НАЧАЛОПЕРИОДА(Начисления.ПериодДействия, ГОД) = МесячныйРасчетныйПоказатель.МесяцНалоговогоПериода)
		|			И Начисления.Результат <= ЕСТЬNULL(МесячныйРасчетныйПоказатель.РазмерМРПНаНачалоГода * 25, -1)
		// отрежем (условие ГДЕ) заполнение начислений, по которым уже были сторнирования в текущем месяце в ранее созданных документах НачислениеЗарплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗарплаты.НачисленияПерерасчет КАК НачисленияПерерасчет
		|		ПО НачисленияПерерасчет.Ссылка <> &ИсключаемыйРегистратор 
		|			И ТИПЗНАЧЕНИЯ(НачисленияПерерасчет.Ссылка) = ТИП(Документ.НачислениеЗарплаты) 
		|			И НачисленияПерерасчет.ПериодДействия = &МесяцНачисления
		|			И НачисленияПерерасчет.Сотрудник = Начисления.Сотрудник
		|           И НачисленияПерерасчет.Начисление = Начисления.ВидРасчета 
		|           И НачисленияПерерасчет.Сторно
		|ГДЕ
		|	Начисления.Организация = &Организация
		|	И Начисления.Регистратор <> &ИсключаемыйРегистратор
		|	И ТИПЗНАЧЕНИЯ(Начисления.Регистратор) <> ТИП(Документ.НачислениеЗарплаты)
		|	И Начисления.ПериодДействия = &МесяцНачисления
		|	И Начисления.ВидРасчета.ОтОбратного
		|	И НачисленияПерерасчет.Ссылка ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.ФиксРасчет,
		|	Начисления.ВидРасчета,
		|	Начисления.Месяц,
		|	Начисления.БазовыйПериодНачало,
		|	Начисления.ФиксЗаполнение,
		|	Начисления.ФиксСторно,
		|	Начисления.ПериодРегистрацииНормыВремени,
		|	Начисления.СторнируемыйДокумент,
		|	Начисления.ПериодРегистрации,
		|	Начисления.ПериодРегистрацииВремени,
		|	Начисления.ФиксРасчетВремени,
		|	Начисления.ДокументОснование,
		|	Начисления.ПериодДействияКонец,
		|	Начисления.СторноТекущегоПериода,
		|	Начисления.ГоловнойСотрудник,
		|	Начисления.БазовыйПериодКонец,
		|	Начисления.Организация,
		|	Начисления.ОбщийГрафик,
		|	Начисления.ПериодДействия,
		|	Начисления.ПериодДействияНачало,
		|	Начисления.Регистратор,
		|	Начисления.ГрафикРаботыНорма,
		|	Начисления.ГоловнаяОрганизация,
		|	Начисления.ВидУчетаВремени,
		|	Начисления.ФизическоеЛицо,
		|	Начисления.ГрафикРаботы,
		|	Начисления.ВремяВЧасах,
		|	Начисления.Сотрудник,
		|	Начисления.ФиксСтрока,
		|	Начисления.Активность,
		|	Начисления.НомерСтроки,
		|	Начисления.Результат,
		|	Начисления.ОтработаноДней,
		|	Начисления.ОтработаноЧасов,
		|	Начисления.РезультатВТомЧислеЗаСчетФБ,
		|	Начисления.РасчетнаяБазаЗаЕдиницуНормыВремени,
		|	Начисления.ИдентификаторСтроки,
		|	Начисления.ДоляРезультата
		|
		// выберем строки, по которым вообще не было исправление МАКСИМУМ(Начисления.Сторно) при наличии ЛОЖЬ и ИСТИНА будет получена ИСТИНА
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(Начисления.Сторно) = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодРегистрации КАК ПериодРегистрации,
		|	ВТ_РасчетОтОбратногоМенее25МРП.Регистратор КАК СторнируемыйДокумент,
		|	ВТ_РасчетОтОбратногоМенее25МРП.НомерСтроки КАК НомерСтроки,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ВидРасчета КАК Начисление,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ВидРасчета.КатегорияНачисленияИлиНеоплаченногоВремени КАК Категория,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодДействия КАК ПериодДействия,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодДействияНачало КАК ДатаНачала,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодДействияКонец КАК ДатаОкончания,
		|	ВТ_РасчетОтОбратногоМенее25МРП.БазовыйПериодНачало КАК НачалоБазовогоПериода,
		|	ВТ_РасчетОтОбратногоМенее25МРП.БазовыйПериодКонец КАК ОкончаниеБазовогоПериода,
		|	ВТ_РасчетОтОбратногоМенее25МРП.Активность КАК Активность,
		|	ИСТИНА КАК Сторно,
		|	ВТ_РасчетОтОбратногоМенее25МРП.Сотрудник КАК Сотрудник,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ВТ_РасчетОтОбратногоМенее25МРП.РезультатВТомЧислеЗаСчетФБ КАК РезультатВТомЧислеЗаСчетФБ,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ГрафикРаботы КАК ГрафикРаботы,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ВидУчетаВремени КАК ВидУчетаВремени,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ВремяВЧасах КАК ВремяВЧасах,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ГрафикРаботыНорма КАК ГрафикРаботыНорма,
		|	ВТ_РасчетОтОбратногоМенее25МРП.Организация КАК Организация,
		|	ВТКадровыеДанныеСотрудников.Подразделение КАК Подразделение,
		|	ВТКадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,
		|	ВТКадровыеДанныеСотрудников.Должность КАК Должность,
		|	ВТКадровыеДанныеСотрудников.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
		|	ЛОЖЬ КАК ФиксСтрока,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ФиксЗаполнение КАК ФиксЗаполнение,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ФиксРасчетВремени КАК ФиксРасчетВремени,
		|	ЛОЖЬ КАК ФиксРасчет,
		|	ИСТИНА КАК ФиксСторно,
		|	ВТ_РасчетОтОбратногоМенее25МРП.РасчетнаяБазаЗаЕдиницуНормыВремени КАК РасчетнаяБазаЗаЕдиницуНормыВремени,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодРегистрацииВремени КАК ПериодРегистрацииВремени,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодРегистрацииНормыВремени КАК ПериодРегистрацииНормыВремени,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ДоляРезультата КАК ДоляРезультата,
		|	ВТ_РасчетОтОбратногоМенее25МРП.Месяц КАК Месяц,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ДокументОснование КАК ДокументОснование,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ГоловнойСотрудник КАК ГоловнойСотрудник,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ОбщийГрафик КАК ОбщийГрафик,
		|	-ВТ_РасчетОтОбратногоМенее25МРП.Результат КАК Результат,
		|	-ВТ_РасчетОтОбратногоМенее25МРП.ОтработаноДней КАК ОтработаноДней,
		|	-ВТ_РасчетОтОбратногоМенее25МРП.ОтработаноЧасов КАК ОтработаноЧасов
		|ИЗ
		|	ВТ_РасчетОтОбратногоМенее25МРП КАК ВТ_РасчетОтОбратногоМенее25МРП
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК ВТКадровыеДанныеСотрудников
		|		ПО ВТ_РасчетОтОбратногоМенее25МРП.Сотрудник = ВТКадровыеДанныеСотрудников.Сотрудник
		|			И ВТ_РасчетОтОбратногоМенее25МРП.ПериодДействияНачало = ВТКадровыеДанныеСотрудников.Период
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодРегистрации,
		|	ВТ_РасчетОтОбратногоМенее25МРП.Регистратор КАК СторнируемыйДокумент,
		|	ВТ_РасчетОтОбратногоМенее25МРП.НомерСтроки,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ВидРасчета КАК Начисление,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ВидРасчета.КатегорияНачисленияИлиНеоплаченногоВремени КАК Категория,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодДействия,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодДействияНачало,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодДействияКонец,
		|	ВТ_РасчетОтОбратногоМенее25МРП.БазовыйПериодНачало,
		|	ВТ_РасчетОтОбратногоМенее25МРП.БазовыйПериодКонец,
		|	ВТ_РасчетОтОбратногоМенее25МРП.Активность,
		|	ЛОЖЬ КАК Сторно,
		|	ВТ_РасчетОтОбратногоМенее25МРП.Сотрудник,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ФизическоеЛицо,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ГоловнаяОрганизация,
		|	ВТ_РасчетОтОбратногоМенее25МРП.РезультатВТомЧислеЗаСчетФБ,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ГрафикРаботы,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ВидУчетаВремени,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ВремяВЧасах,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ГрафикРаботыНорма,
		|	ВТ_РасчетОтОбратногоМенее25МРП.Организация,
		|	ВТКадровыеДанныеСотрудников.Подразделение КАК Подразделение,
		|	ВТКадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,
		|	ВТКадровыеДанныеСотрудников.Должность КАК Должность,
		|	ВТКадровыеДанныеСотрудников.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
		|	ЛОЖЬ КАК ФиксСтрока,
		|	ЛОЖЬ КАК ФиксЗаполнение,
		|	ЛОЖЬ КАК ФиксРасчетВремени,
		// если строка была вручную изменена пользователем, то при заполнении окончательного расчета будут проблемы с расчетом сумм в новых строках (будут нулевые)
		|	ЛОЖЬ КАК ФиксРасчет,
		|	ЛОЖЬ КАК ФиксСторно,
		|	ВТ_РасчетОтОбратногоМенее25МРП.РасчетнаяБазаЗаЕдиницуНормыВремени,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ИдентификаторСтроки,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодРегистрацииВремени,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ПериодРегистрацииНормыВремени,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ДоляРезультата,
		|	ВТ_РасчетОтОбратногоМенее25МРП.Месяц,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ДокументОснование,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ГоловнойСотрудник,
		|	ВТ_РасчетОтОбратногоМенее25МРП.ОбщийГрафик,
		|	0 КАК Результат,
		|	0 КАК ОтработаноДней,
		|	0 КАК ОтработаноЧасов
		|ИЗ
		|	ВТ_РасчетОтОбратногоМенее25МРП КАК ВТ_РасчетОтОбратногоМенее25МРП
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК ВТКадровыеДанныеСотрудников
		|		ПО ВТ_РасчетОтОбратногоМенее25МРП.Сотрудник = ВТКадровыеДанныеСотрудников.Сотрудник
		|			И ВТ_РасчетОтОбратногоМенее25МРП.ПериодДействияНачало = ВТКадровыеДанныеСотрудников.Период
		|";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПерерасчетыОтОбратного = РезультатЗапроса.Выбрать();
	
	// Сбор сведений о показателях
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СторнируемыеНачисления.Регистратор КАК Ссылка,
		|	ЗначенияПоказателейНачислений.*
		|ИЗ
		|	РегистрСведений.ЗначенияПоказателейНачислений КАК ЗначенияПоказателейНачислений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РасчетОтОбратногоМенее25МРП КАК СторнируемыеНачисления
		|		ПО ЗначенияПоказателейНачислений.РегистраторИзмерение = СторнируемыеНачисления.Регистратор
		|			И ЗначенияПоказателейНачислений.ИдентификаторСтроки = СторнируемыеНачисления.ИдентификаторСтроки";
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаПоказателей = Запрос.Выполнить().Выгрузить();
	ТаблицаПоказателей.Индексы.Добавить("Ссылка,ИдентификаторСтроки,Показатель");
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ДанныеПерерасчета.НачисленияПерерасчет.Колонки.Найти("Показатель1") = Неопределено Тогда
		ДобавитьКолонкиПоказателей(ДанныеПерерасчета.НачисленияПерерасчет);
	КонецЕсли;
	
	Если ВыборкаПерерасчетыОтОбратного.Количество() > 0 Тогда
		ЕстьНачисленияПерерасчетОтОбратного = Истина;
	КонецЕсли;
	
	// разрядность числа для того, чтобы идентифицировать строки начислений и перерасчетов
	ИдентификаторСтроки = 7000000;
	
	Пока ВыборкаПерерасчетыОтОбратного.Следующий() Цикл
		
		СтрокаПерерасчета = Обработки.МенеджерРасчетаЗарплаты.СтрокаТаблицыНачислений(ДанныеПерерасчета.НачисленияПерерасчет);
		ЗаполнитьЗначенияСвойств(СтрокаПерерасчета, ВыборкаПерерасчетыОтОбратного,, "ИдентификаторСтроки");
		
		ИдентификаторСтроки = ИдентификаторСтроки + 1;
		
		ЗаполнитьПоказатели(СтрокаПерерасчета, ТаблицаПоказателей, ВыборкаПерерасчетыОтОбратного.СторнируемыйДокумент, ВыборкаПерерасчетыОтОбратного.ИдентификаторСтроки);
		СтрокаПерерасчета.ИдентификаторСтроки = ИдентификаторСтроки;
		СтрокаПерерасчета.Показатели.ЗаполнитьЗначения(ИдентификаторСтроки, "ИдентификаторСтроки");
		
	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьКолонкиПоказателей(Таблица)
	
	Для Счетчик = 1 По ЗарплатаКадрыРасширенныйПовтИсп.МаксимальноеКоличествоПоказателейИспользуемыхПриРасчете() Цикл
		Таблица.Колонки.Добавить("Показатель" + Счетчик);
		Таблица.Колонки.Добавить("Значение" + Счетчик, Справочники.ПоказателиРасчетаЗарплаты.ОписаниеТиповЗначенияПоказателяРасчетаЗарплаты());
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоказатели(СтрокаСторноПерерасчет, ТаблицаПоказателей, Ссылка, ИдентификаторСтрокиВидаРасчета)
	
	НомерПоказателя = 1;
	ИнформацияОНачислении = ЗарплатаКадрыРасширенныйПовтИсп.ПолучитьИнформациюОВидеРасчета(СтрокаСторноПерерасчет.Начисление);
	Для каждого ОписаниеПоказателя Из ИнформацияОНачислении.Показатели Цикл
		
		СтруктураПоиска = Новый Структура("Ссылка,ИдентификаторСтроки,Показатель", Ссылка, ИдентификаторСтрокиВидаРасчета, ОписаниеПоказателя.Показатель);
		СтрокиПоказателей = ТаблицаПоказателей.НайтиСтроки(СтруктураПоиска);
		Если СтрокиПоказателей.Количество() > 0  Тогда
			
			НоваяСтрока = СтрокаСторноПерерасчет.Показатели.Добавить();
			НоваяСтрока.Показатель = ОписаниеПоказателя.Показатель;
			НоваяСтрока.Значение = СтрокиПоказателей[0].Значение;
			НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтрокиВидаРасчета;
			
			СтрокаСторноПерерасчет["Показатель" + НомерПоказателя] = ОписаниеПоказателя.Показатель;
			СтрокаСторноПерерасчет["Значение" + НомерПоказателя] = СтрокиПоказателей[0].Значение;
			
		КонецЕсли;
		
		НомерПоказателя = НомерПоказателя + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьОписаниеПрофиляАудитор(ОписаниеПрофиля) Экспорт
	
	// Раздел НалогиВзносыОтчисления
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеПеречисленныхВзносовОтчислений");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеНезачисленныхВзносовОтчислений");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеВнешнихОперацийРасчетовПоНалогам",			"ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.НалогиВзносыОтчисленияВХО");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеВнешнихОперацийРасчетовПоВзносамИОтчислениям","ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.НалогиВзносыОтчисленияВХО");

КонецПроцедуры

Процедура ДополнитьОписаниеПрофиляРасчетчик(ОписаниеПрофиля) Экспорт
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеПеречисленныхВзносовОтчислений");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеНезачисленныхВзносовОтчислений");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеОбменаСБанками");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеВнешнихОперацийРасчетовПоНалогам",			 "ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.НалогиВзносыОтчисленияВХО");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеВнешнихОперацийРасчетовПоВзносамИОтчислениям","ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.НалогиВзносыОтчисленияВХО");

КонецПроцедуры

#КонецОбласти