&НаКлиенте
Перем ОбработкаКС Экспорт;

&НаКлиенте
Перем ФормаДлительнойОперации;

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Обход ошибки платформы "Параметр сеанса отсутствует или удален".
	ТабличныйДокумент.Очистить();
	
	СформироватьСтруктуруРеквизитовФормы();
	
	СоответствиеЕдиницыИзмеренияДелителю = Новый Структура;
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1", 1);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000", 1000);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000000", 1000000);
	
	// ОПИСАНИЕ ПАРАМЕТРОВ МНОГОСТРОЧНЫХ ГРУПП
	// Идентификаторы многострочных групп
	СтруктураРеквизитовФормы.мИдГруппы21  = "П0002100005";
	СтруктураРеквизитовФормы.мИдГруппы22  = "П0002200005";
	СтруктураРеквизитовФормы.мИдГруппы23  = "П0002300005";
	
	//700.02
	КолИсхСтрокИдГруппы21  = 1;
	КолИсхСтрокИдГруппы22  = 1;
	КолИсхСтрокИдГруппы23  = 1;
	
	КолКолонокИдГруппы21 = 7; //7
	КолКолонокИдГруппы22 = 8;
	КолКолонокИдГруппы23 = 3;
	
	//700.02
	мСтруктураМногострочныхРазделов = Новый Структура;
	
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы21, СтруктураРеквизитовФормы.мИдГруппы21);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы22, СтруктураРеквизитовФормы.мИдГруппы22);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы23, СтруктураРеквизитовФормы.мИдГруппы23);
	
	// структура исходных строк (минимального кол-ва) многострочных разделов формы
	мСтруктураИсхКолвоСтрокРазделов = Новый Структура;
	
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы21, КолИсхСтрокИдГруппы21);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы22, КолИсхСтрокИдГруппы22);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы23, КолИсхСтрокИдГруппы23);
	
	мСтруктураКолвоКолонокРазделов = Новый Структура;
	
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы21, КолКолонокИдГруппы21);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы22, КолКолонокИдГруппы22);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы23, КолКолонокИдГруппы23);
	
	СтруктураДанныхФорма700Страница1           = Новый Структура;
	СтруктураДанныхФорма700Страница2           = Новый Структура;
	СтруктураДанныхФорма700_01Страница1        = Новый Структура;
	СтруктураДанныхФорма700_01Страница2        = Новый Структура;
	СтруктураДанныхФорма700_02Страница1   	   = Новый Структура;
	СтруктураДанныхФорма700_02Страница2        = Новый Структура;
	СтруктураДанныхФорма700_02Страница3        = Новый Структура;
	
	СтруктураДанных_D = Новый Структура();
	СтруктураДанных_K = Новый Структура();
	СтруктураДанных_L = Новый Структура();
	СтруктураДанных_M = Новый Структура();
	
	
	// Структура содержит данные дополнительных страниц
	//мСтруктураМногостраничныхРазделов = Новый Структура;
	
	СтруктураРеквизитовФормы.СписокПечатаемыхЛистов = Новый СписокЗначений;
	СтруктураРеквизитовФормы.мПечатныеформы = Новый СписокЗначений;
	
	СтруктураРеквизитовФормы.мВыбраннаяФорма          = Параметры.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета  = Параметры.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета = Параметры.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мПериодичность           = Параметры.мПериодичность;
	СтруктураРеквизитовФормы.мСкопированаФорма        = Параметры.мСкопированаФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок          = Параметры.мСохраненныйДок;
	СтруктураРеквизитовФормы.Организация              = Параметры.Организация;
	СтруктураРеквизитовФормы.ВидДокумента             = 0;
	СтруктураРеквизитовФормы.НалоговыйКомитет		  = Параметры.НалоговыйКомитет;
	НалоговыйКомитетФорма							  = Параметры.НалоговыйКомитет;
	
	ИмяРаздела = "Форма700Страница1";
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(
	ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяРаздела));
	
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	
	СформироватьОтчетныйПериод();
	
	Инициализация(Параметры.БезОткрытияФормы);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруРеквизитовФормы()
	
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("Организация");
	СтруктураРеквизитовФормы.Вставить("ЕдиницаИзмерения");
	СтруктураРеквизитовФормы.Вставить("ТочностьЕдиницыИзмерения");
	СтруктураРеквизитовФормы.Вставить("мКвартал");
	СтруктураРеквизитовФормы.Вставить("мГод");
	СтруктураРеквизитовФормы.Вставить("мДатаНачалаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мДатаКонцаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мПериодичность");
	СтруктураРеквизитовФормы.Вставить("мСкопированаФорма");
	СтруктураРеквизитовФормы.Вставить("мСохраненныйДок");
	СтруктураРеквизитовФормы.Вставить("мВыбраннаяФорма");
	СтруктураРеквизитовФормы.Вставить("мЗаписываетсяНовыйДокумент");
	СтруктураРеквизитовФормы.Вставить("мВариант");
	СтруктураРеквизитовФормы.Вставить("мПроверятьСоотношенияПриПечатиИВыгрузки");
	СтруктураРеквизитовФормы.Вставить("СписокПечатаемыхЛистов");
	СтруктураРеквизитовФормы.Вставить("мРежимПечати");
	СтруктураРеквизитовФормы.Вставить("мСчетчикСтраниц");
	СтруктураРеквизитовФормы.Вставить("мПечатныеФормы");
	СтруктураРеквизитовФормы.Вставить("НаимТекущегоРаздела");
	СтруктураРеквизитовФормы.Вставить("ВидДокумента");
	СтруктураРеквизитовФормы.Вставить("мМетодРасчета");
	СтруктураРеквизитовФормы.Вставить("НалоговыйКомитет");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы21");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы22");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы23");
	СтруктураРеквизитовФормы.Вставить("УспешноеАвтозаполнение");
	СтруктураРеквизитовФормы.Вставить("ВыводитьСтраницуВТаблДокНаСервере");
	СтруктураРеквизитовФормы.Вставить("ИдентификаторЗадания");
	СтруктураРеквизитовФормы.Вставить("ВерсияАвтозаполнения");
	СтруктураРеквизитовФормы.Вставить("АдресВоВременномХранилище");
	СтруктураРеквизитовФормы.Вставить("АдресВременногоХранилищаРасшифровки");
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСтраницОтчета() 
	
	// Дерево содержит коллекцию страниц отчета.
	мДеревоСтраницОтчета.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма700Страница1";
	СтрокаУровня1.Представление            = "Форма 700.00 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма700Страница2";
	СтрокаУровня1.Представление            = "Форма 700.00 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма700_01Страница1";
	СтрокаУровня1.Представление            = "Форма 700.01 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма700_01Страница2";
	СтрокаУровня1.Представление            = "Форма 700.01 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма700_02Страница1";
	СтрокаУровня1.Представление            = "Форма 700.02 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма700_02Страница2";
	СтрокаУровня1.Представление            = "Форма 700.02 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма700_02Страница3";
	СтрокаУровня1.Представление            = "Форма 700.02 Страница 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСвойствСтраниц() Экспорт
	
	мСвойстваРазделовДекларации.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	
	СтрокаУровня1.ИмяСтраницы                          = "Форма700Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма700Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма700_01Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма700_01Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма700_02Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы21;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма700_02Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы22;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма700_02Страница3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы23;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоРазделовОтчетаНаСервере() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДеревоРазделовОтчетаНаКлиенте() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьДеревоРазделовОтчета(Форма)
	
	Форма["РазделыОтчета"].ПолучитьЭлементы().Очистить();
	МассивНаименований = Новый Массив;
	
	Для Каждого ЭлементДереваСтраницОтчета Из Форма["мДеревоСтраницОтчета"].ПолучитьЭлементы() Цикл
		
		Если ЭлементДереваСтраницОтчета.ПоказатьСтраницу = 1 Тогда
			
			Если МассивНаименований.Найти(ЭлементДереваСтраницОтчета.ИмяСтраницы) = Неопределено Тогда 
				
				ЭлементРазделовОтчета = Форма["РазделыОтчета"].ПолучитьЭлементы().Добавить();
				ЭлементРазделовОтчета.КолонкаРазделыОтчета = Лев(ЭлементДереваСтраницОтчета.Представление,12);
				ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим = ЭлементДереваСтраницОтчета.ИмяСтраницы;
				ЭлементРазделовОтчета.РазделМногострочный = МногострочныйРаздел(ЭлементДереваСтраницОтчета.ИмяСтраницы);
				
				МассивНаименований.Добавить(ЭлементДереваСтраницОтчета.ИмяСтраницы);
				
				Если ЭтоРазделРодитель(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим) Тогда
					
					Для НомерПодраздела = 1 По ПолучитьКоличествоПодразделовПоРодителю(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим) Цикл
						
						СтраницаРазделаОтчета = ЭлементРазделовОтчета.ПолучитьЭлементы().Добавить();
						
						СтраницаРазделаОтчета.КолонкаРазделыОтчета              = Лев(ЭлементДереваСтраницОтчета.Представление,СтрДлина(ЭлементДереваСтраницОтчета.Представление)-1) + НомерПодраздела;
						СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим      = Лев(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим, СтрДлина(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим)-1) + НомерПодраздела;
						МассивНаименований.Добавить(СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим);
						СтраницаРазделаОтчета.РазделМногострочный               = ЭлементРазделовОтчета.РазделМногострочный;
						
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция МногострочныйРаздел(ИмяРаздела)
	
	Результат = (ИмяРаздела = "Форма700_02Страница1")
	ИЛИ (ИмяРаздела = "Форма700_02Страница2")
	ИЛИ (ИмяРаздела = "Форма700_02Страница3");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоРазделРодитель(ИмяРаздела)
	
	Результат = (ИмяРаздела = "Форма700Страница1")
	ИЛИ (ИмяРаздела = "Форма700_01Страница1")
	ИЛИ (ИмяРаздела = "Форма700_02Страница1");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьКоличествоПодразделовПоРодителю(Родитель)
	
	Если Родитель = "Форма700Страница1" Тогда
		Возврат 2;
	ИначеЕсли Родитель = "Форма700_01Страница1" Тогда
		Возврат 2;
	ИначеЕсли Родитель = "Форма700_02Страница1" Тогда
		Возврат 3;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура СформироватьОтчетныйПериод()
	
	СтрПериодОтчета = ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета,СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ФП = истина");
	
	СтруктураРеквизитовФормы.мГод = Лев(Прав(СтрПериодОтчета,7),4);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета()
	
	СтруктураЗависимыхЯчеекДляАвторасчета = Новый Структура;
	//700.00Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("ВидДекларации", "Первоначальная;Очередная;Дополнительная;ПоУведомлению;Ликвидационная");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("КатегорияНалПл", "Признак6A;Признак6B;Признак6C;Признак6D");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("НаличиеПриложений", "Приложение01;Приложение02;Приложение03");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010001001", "П000120034004;П000120035004;П000120036004;П000010001001");//зависимость самого от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010002001", "П000010002101;П000010002201;П000010002001;П000010002001_Рекурсия");//зависимость самого от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010002101", "П000230000104;П000230000105;П000010002101");//зависимость самого от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010002201", "П000230000105;П000230000104;П000010002201");//зависимость самого от себя
	
	//700.00Стр2
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020007001", "П000010005101;П000020006001;П000020007001");//зависимость самого от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020008001", "П000010005101;П000020006001;П000020008001");//зависимость самого от себя
	
	//700.01Стр2
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000120034004", "П000120035004;П000120036004;П000120034004;П000120034004_Рекурсия");//зависимость самого от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000120038004", "П000120035004;П000120034004;П000120034004_Рекурсия;П000120036004;П000120037004");//зависимость самого от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000120039004", "П000120035004;П000120034004;П000120034004_Рекурсия;П000120036004;П000120037004");//зависимость самого от себя
	
	//700.02Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("ЕдиницыИзмерения", "П000210000503;П000210000504");
	
	//700.02Стр3
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("ИтогРазница", "П000230000104;П000230000105;П000230000204;П000230000205;П000210000505;П000220000506;П000220000507;П000220000508");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000230000503", "П000210000505;П000220000506;П000220000507;П000220000508");
	
КонецПроцедуры

&НаСервере
Процедура Инициализация(БезОткрытияФормы = Ложь) Экспорт
	
	ФормироватьСтруктуруСтраницОтчета();
	ФормироватьСтруктуруСвойствСтраниц();
	СформироватьДеревоРазделовОтчетаНаСервере();
	ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета();
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
	Если СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		ЗаполнитьПустыеСтруктурыДанных();
		ЗаполнитьСведенияОбОрганизацииНаСервере();
		НачальныеОперацииСМногострочнымиБлоками();
		СтруктураРеквизитовФормы.ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
		СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 0;
		КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
		РасчетНаСервере("Форма700Страница1","Очередная");
		Модифицированность = Истина;	
	Иначе
		ВосстановитьСохраненныеДанные();
		ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма700Страница1");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НачальныеОперацииСМногострочнымиБлоками()
	
	Перем ИсходноеКоличествоСтрокГруппы;
	
	// создаем исходную структуру многострочных разделов
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		ИмяГруппы = ЭлементСтруктуры.Ключ;
		СтруктураГруппы = ЭтаФорма[ЭлементСтруктуры.Значение];
		
		мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
		
		Если ИсходноеКоличествоСтрокГруппы > СтруктураГруппы.Количество() Тогда 
			Для НСтр = 1 По ИсходноеКоличествоСтрокГруппы Цикл
				СтруктураГруппы.Добавить();
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизацииНаСервере()
	
	ЗаполнитьСведенияОбОрганизации(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизации(Форма)
	Перем ТаблицаСтраницРаздела;
	
	СтрокаСведений = "ИННЮЛ, НаимЮЛПол, ФИОРук";
	СведенияОбОрганизации = РегламентированнаяОтчетностьРК.ПолучитьСведенияОбОрганизации(СтруктураРеквизитовФормы.Организация,,СтрокаСведений);
	
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ИИН_БИН"].Значение) Тогда
		ТабличныйДокумент.Области["ИИН_БИН"].Значение = СведенияОбОрганизации.ИННЮЛ;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Год"].Значение) Тогда
		ТабличныйДокумент.Области["Год"].Значение = СтруктураРеквизитовФормы.мГод;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ОргНазв") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ОргНазв"].Значение) Тогда
		ТабличныйДокумент.Области["ОргНазв"].Значение = СведенияОбОрганизации.НаимЮЛПол;
		Если ТабличныйДокумент.Области.Найти("ОргНазв3") <> Неопределено Тогда
			КонецШага = 3;
		Иначе
			КонецШага = 2;
		КонецЕсли;
		НачПозиция = 1;
		Для Шаг = 1 По КонецШага Цикл
			ДлинаСтроки = ТабличныйДокумент.Области["ОргНазв" + Шаг].ТипЗначения.КвалификаторыСтроки.Длина;
			НазОрганизации = Сред(СведенияОбОрганизации.НаимЮЛПол, НачПозиция, ДлинаСтроки); 
			ТабличныйДокумент.Области["ОргНазв" + Шаг].Значение = НазОрганизации;
			НачПозиция =НачПозиция + ДлинаСтроки;
		КонецЦикла;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("Руководитель") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Руководитель"].Значение) Тогда
		ТабличныйДокумент.Области["Руководитель"].Значение = СведенияОбОрганизации.ФИОРук;
	КонецЕсли;
	
	//Если ТабличныйДокумент.Области.Найти("СтрПриложение02") <> Неопределено 
	//	И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["СтрПриложение02"].Значение) Тогда
	//	
	//	ЭтаФорма.мСтруктураФорма700_02Страница1.Свойство("Форма700_02", ТаблицаСтраницРаздела);
	//	ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
	//	КоличествоСтраниц = ТаблицаСтраницРаздела.Количество();
	//	
	//	ТабличныйДокумент.Области["СтрПриложение02"].Значение = Формат(КоличествоСтраниц,"ЧЦ=3; ЧВН=");
	//	
	//КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("СтрПриложение01") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["СтрПриложение01"].Значение) Тогда
		ТабличныйДокумент.Области["СтрПриложение01"].Значение = "001";
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ИИН_БИНГоловного") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ИИН_БИНГоловного"].Значение) Тогда
		ГоловнаяОрганизация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураРеквизитовФормы.Организация,"ГоловнаяОрганизация");
		ГоловнаяОрганизация = ?(ЗначениеЗаполнено(ГоловнаяОрганизация),ГоловнаяОрганизация,СтруктураРеквизитовФормы.Организация);
		Сведения = РегламентированнаяОтчетностьРК.ПолучитьСведенияОбОрганизации(ГоловнаяОрганизация,,"ИННЮЛ");
		ТабличныйДокумент.Области["ИИН_БИНГоловного"].Значение = Сведения.ИННЮЛ;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ИИН_БИНАкимат") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ИИН_БИНАкимат"].Значение) Тогда
		ТабличныйДокумент.Области["ИИН_БИНАкимат"].Значение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НалоговыйКомитетФорма.МестныйБюджет,"ИНН");
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("КодНалоговогоОргана") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["КодНалоговогоОргана"].Значение) Тогда
		ТабличныйДокумент.Области["КодНалоговогоОргана"].Значение = СтруктураРеквизитовФормы.НалоговыйКомитет.Код;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("КодВалюты") <> Неопределено Тогда
		ТабличныйДокумент.Области["КодВалюты"].Значение = "KZT";
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ПоУведомлению") <> Неопределено Тогда
		
		Если ТабличныйДокумент.Области["ПоУведомлению"].Значение = "Х" Тогда
			ТабличныйДокумент.Области.НомерУведомления.Защита = Ложь;
			ТабличныйДокумент.Области.ДатаУведомления.Защита = Ложь;
		ИначеЕсли ТабличныйДокумент.Области["Очередная"].Значение = "" И
			ТабличныйДокумент.Области["Дополнительная"].Значение = "" И 
			ТабличныйДокумент.Области["Ликвидационная"].Значение = "" И
			ТабличныйДокумент.Области["Первоначальная"].Значение = "" Тогда
			
			ТабличныйДокумент.Области["Очередная"].Значение = "Х";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ДатаПодачи") <> Неопределено Тогда
		ТабличныйДокумент.Области.ДатаПодачи.Значение = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьСохраненныеДанные()
	
	Перем ДанныеМногострочныхРазделов;
	Перем ПоказателиОтчета;
	Перем СписокСтруктурныхЕдиниц;
	Перем НалоговыйКомитет;
	
	// восстанавливаем сохраненные данные отчета
	СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	
	// восстановим сохраненные данные редактируемых ячеек
	СписокСохранения.Свойство("ПоказателиОтчета", ПоказателиОтчета);
	СписокСохранения.Свойство("СписокСтруктурныхЕдиниц", СписокСтруктурныхЕдиниц);
	СписокСохранения.Свойство("НалоговыйКомитет", НалоговыйКомитет);
	
	Если СписокСохранения.Свойство("ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов) Тогда
		
		Для Каждого ЭлементСтруктуры Из ДанныеМногострочныхРазделов Цикл
			
			НайденноеЗначение = Неопределено;
			мСтруктураМногострочныхРазделов.Свойство(ЭлементСтруктуры.Ключ, НайденноеЗначение);
			
			Если НЕ НайденноеЗначение = Неопределено Тогда
				ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, ЭтаФорма[НайденноеЗначение]);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы] = ПоказателиОтчета[Префикс + Раздел.ИмяСтраницы];
		
	КонецЦикла;
	
	Комментарий = СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий;
	СтруктураРеквизитовФормы.ЕдиницаИзмерения = СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения;
	СтруктураРеквизитовФормы.НалоговыйКомитет = НалоговыйКомитет;
	
	НалоговыйКомитетФорма  = НалоговыйКомитет;
	
	РегламентированнаяОтчетность.ОперацииПриВосстановленииРегламентированногоОтчета(ЭтаФорма);
	
	КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделыОтчетаПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ОчиститьТекущуюСтраницу.Видимость = НЕ Элемент.ТекущиеДанные.РазделМногострочный;
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, 1);
	
	ЗаполнитьСведенияОбОрганизацииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетСтраницыВТабличныйДокументНаСервере(ИмяТекРаздела, НомерСтраницыРазделаОтчета = 1)
	
	ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела);
	СтруктураРеквизитовФормы.НаимТекущегоРаздела  = ИмяТекРаздела;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела)
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(
	ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяТекРаздела));
	
	Если ИмяТекРаздела = "Форма700_02Страница1"
		ИЛИ ИмяТекРаздела = "Форма700_02Страница2"
		ИЛИ ИмяТекРаздела = "Форма700_02Страница3" Тогда
		
		СтруктураДанныхРаздела = ЭтаФорма["СтруктураДанных" + ИмяТекРаздела];
		
		Для Каждого ЭлСтруктуры Из СтруктураДанныхРаздела Цикл
			Попытка
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
		ТекТабличноеПоле = ЭтаФорма.ТабличныйДокумент;
		
		ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяТекРаздела);
		
		СтруктураГруппы = Неопределено;
		
		мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
		
		СтруктураГруппы = ЭтаФорма[СтруктураГруппы];
		
		ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
		
		ЕстьДопСтроки = Ложь;
		
		Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
			Если СтрЧислоВхождений(ОбластьТД.Имя, "_2") > 0 Тогда
				ЕстьДопСтроки = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьДопСтроки Тогда
			Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
				Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
					ОбластьТД.Гиперссылка = Истина;
					ОбластьТД.Текст = "х";
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
				Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
					ОбластьТД.Гиперссылка = Ложь;
					ОбластьТД.Текст = "";
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//обычные разделы
	ИначеЕсли ЭтаФорма["СтруктураДанных" + ИмяТекРаздела]<> Неопределено Тогда
		
		Для Каждого ЭлСтруктуры Из ЭтаФорма["СтруктураДанных" + ИмяТекРаздела] Цикл
			Попытка
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиРазделВТабличныйДокумент(Форма, ИмяГруппы, СтруктураГруппы)
	Перем ИсходноеКоличествоСтрокГруппы;
	
	#Если НаКлиенте Тогда
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИмяГруппы);
	#Иначе
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИмяГруппы);
	#КонецЕсли
	
	// определим исходное колво строк многострочного раздела,
	// соответствующее бумажной форме отчета
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
	
	// реальное кол-во строк (колво заполненных строк)
	ТекущееКоличествоСтрокГруппы = СтруктураГруппы.Количество();
	
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	ПерерисоватьСтроки = (НЕ ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы);
	
	Раздел = Форма[ТекТабличноеПолеИмя];
	
	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// При восстановлении сохраненных данных отчета сравниваем исходное кол-во
	// отображаемых в форме строк многострочного раздела с реальным количеством
	// созданных строк в сохраненном отчете.
	Если ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы Тогда
		
		// При превышении реального кол-ва строк над исходным кол-вом (по шаблону),
		// автоматически добавляем необходимое колво строк.
		Форма.ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки);
		
		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
	КонецЕсли;
	
	// выводим значения строк
	Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
		НомерСтрокиВТаблице      = СтруктураГруппы.Индекс(СтрокаТаблицы);
		НомерСтрокиВФормеТаблицыСтр = Формат(НомерСтрокиВТаблице + 1, "ЧГ=");
		
		Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
			
			КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
			
			Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
				
				ЗначениеЯчейки = СтрокаТаблицы[КолонкаТаблицыИмя];
				ИмяЯчейки      = КолонкаТаблицыИмя + "_" + НомерСтрокиВФормеТаблицыСтр;
				
				ОбластьЯчейкиТаблицы = ТекТабличноеПоле.Области[ИмяЯчейки];
				
				Если ОбластьЯчейкиТаблицы.СодержитЗначение = Истина Тогда
					ОбластьЯчейкиТаблицы.Значение = ЗначениеЯчейки;
				Иначе
					ОбластьЯчейкиТаблицы.Текст = ЗначениеЯчейки;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки) Экспорт
	
	ОбластьДопСтроки = ТекТабличноеПоле.ПолучитьОбласть("МногострочнаяЧасть");
	
	КоординатыОбластей = Новый Структура();
	
	Для Каждого Область Из ТекТабличноеПоле.Области Цикл
		
		Если СтрНайти(Область.Имя, "_") Тогда
			
			КоординатыОбластей.Вставить(Область.Имя, Область.Верх);
			
		КонецЕсли;
		
	КонецЦикла;
	
	МногострочнаяЧастьВерх = ТекТабличноеПоле.Области.МногострочнаяЧасть.Верх;
	
	МногострочнаяЧастьНиз = ТекТабличноеПоле.Области.МногострочнаяЧасть.Низ;
	
	ТекТабличноеПоле.ВставитьОбласть(ОбластьДопСтроки.Область(), ТекТабличноеПоле.Область(МногострочнаяЧастьНиз + 1, , МногострочнаяЧастьНиз + (ТекущееКоличествоСтрокГруппы - 1) * ВысотаСтроки), ТипСмещенияТабличногоДокумента.ПоВертикали);
	
	Для НомНовойСтроки = ИсходноеКоличествоСтрокГруппы По ТекущееКоличествоСтрокГруппы Цикл
		
		Постфикс = Формат(ТекущееКоличествоСтрокГруппы - НомНовойСтроки + 1, "ЧГ=");
		
		Для Каждого Область Из ОбластьДопСтроки.Области Цикл
			
			Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
				
				ОбластьТаблДок = ТекТабличноеПоле.Область(КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Лево, КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Право);
				
				Если ОбластьТаблДок.СодержитЗначение Тогда
					ОбластьТаблДок.Очистить();
				КонецЕсли;
				
				ОбластьТаблДок.Имя = Лев(Область.Имя, СтрНайти(Область.Имя, "_")) + Постфикс;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;	
	
	ТекТабличноеПоле.Область(ТекТабличноеПоле.Области.МногострочнаяЧасть.Верх, , ТекТабличноеПоле.Области.МногострочнаяЧасть.Низ).Имя = "";
	
	ТекТабличноеПоле.Область(МногострочнаяЧастьВерх, , МногострочнаяЧастьНиз).Имя = "МногострочнаяЧасть";
	
КонецПроцедуры

&НаКлиенте
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы21", СтруктураРеквизитовФормы.мИдГруппы21);
	ИдГрупп.Вставить("мИдГруппы22", СтруктураРеквизитовФормы.мИдГруппы22);
	ИдГрупп.Вставить("мИдГруппы23", СтруктураРеквизитовФормы.мИдГруппы23);
	
	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

&НаСервере
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы21", СтруктураРеквизитовФормы.мИдГруппы21);
	ИдГрупп.Вставить("мИдГруппы22", СтруктураРеквизитовФормы.мИдГруппы22);
	ИдГрупп.Вставить("мИдГруппы23", СтруктураРеквизитовФормы.мИдГруппы23);
	
	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп) Экспорт
	
	Перем ТекТабличноеПоле;
	
	Если ИдГруппы = ИдГрупп.мИдГруппы21 Тогда
		
		ТекТабличноеПоле = "Форма700_02Страница1";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы22 Тогда
		
		ТекТабличноеПоле = "Форма700_02Страница2";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы23 Тогда
		
		ТекТабличноеПоле = "Форма700_02Страница3";
		
	КонецЕсли;
	
	Возврат ТекТабличноеПоле;
	
КонецФункции

&НаСервере
Процедура СохранитьДанныеРаздела(НаимРаздела, ИзменятьАктивнуюСтраницу = Истина)
	
	Если НаимРаздела = "Форма700_02Страница1"
		ИЛИ НаимРаздела = "Форма700_02Страница2"
		ИЛИ НаимРаздела = "Форма700_02Страница3" Тогда
		
		ЭтаФорма["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");
		
		ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(НаимРаздела);
		
		ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппы);
		
	Иначе
		
		ЭтаФорма["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппы) Экспорт
	
	Перем СтруктураГруппы;
	
	РегламентированнаяОтчетностьКлиентСервер.ОбновитьСтруктуруМногострочногоРаздела(ЭтаФорма, ИмяГруппы);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	Модифицированность = Истина;
	
	ИмяРаздела = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
	
	РасчетНаСервере(ИмяРаздела,Область.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетНаКлиенте(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт
	
	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);
	
КонецПроцедуры

&НаСервере
Процедура РасчетНаСервере(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт
	
	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура Расчет(Форма, ИмяСтраницыПанели = "", ОбластьИмя = "")
	
	Перем ТаблицаСтраницРаздела;
	
	Если Форма.СтруктураРеквизитовФормы.мРежимПечати Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСтраницыПанели = "Форма700Страница1" Тогда
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.ВидДекларации, ОбластьИмя) > 0 Тогда
			
			Первоначальная = "";
			Очередная =      "";
			Дополнительная = "";
			ПоУведомлению =  "";
			Ликвидационная = "";
			
			
			Если ОбластьИмя = "Первоначальная" Тогда
				Первоначальная = "Х";
			ИначеЕсли ОбластьИмя = "Очередная" Тогда
				Очередная = "Х";
			ИначеЕсли ОбластьИмя = "Дополнительная" Тогда
				Дополнительная = "Х";
			ИначеЕсли ОбластьИмя = "ПоУведомлению" Тогда
				ПоУведомлению = "Х";
			ИначеЕсли ОбластьИмя = "Ликвидационная" Тогда
				Ликвидационная = "Х";
			Иначе
				Очередная = "Х";
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма700Страница1.Вставить("Первоначальная", Первоначальная);
			Форма.СтруктураДанныхФорма700Страница1.Вставить("Очередная",           Очередная);
			Форма.СтруктураДанныхФорма700Страница1.Вставить("Дополнительная", Дополнительная);
			Форма.СтруктураДанныхФорма700Страница1.Вставить("ПоУведомлению",   ПоУведомлению);
			Форма.СтруктураДанныхФорма700Страница1.Вставить("Ликвидационная", Ликвидационная);
			Если Не ПоУведомлению = "Х" Тогда
				Форма.СтруктураДанныхФорма700Страница1.Вставить("НомерУведомления", "");
				Форма.СтруктураДанныхФорма700Страница1.Вставить("ДатаУведомления", "");
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
				Форма.ТабличныйДокумент.Области.Первоначальная.Значение = Первоначальная;
				Форма.ТабличныйДокумент.Области.Очередная.Значение = Очередная;
				Форма.ТабличныйДокумент.Области.Дополнительная.Значение = Дополнительная;
				Форма.ТабличныйДокумент.Области.ПоУведомлению.Значение = ПоУведомлению;
				Форма.ТабличныйДокумент.Области.Ликвидационная.Значение = Ликвидационная;
				Если ПоУведомлению = "Х" Тогда
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Ложь;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Ложь;
				Иначе
					Форма.ТабличныйДокумент.Области.НомерУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Истина;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.НаличиеПриложений, ОбластьИмя) > 0 Тогда
			
			Приложение01 = "";
			Приложение02 = "";
			Приложение03 = "";
			
			Если ОбластьИмя = "Приложение01" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
					Приложение01 = Форма.ТабличныйДокумент.Области.Приложение01.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма700Страница1.Свойство("Приложение01") Тогда
					Приложение01 = Форма.СтруктураДанныхФорма700Страница1.Приложение01;
				КонецЕсли;
				
				Приложение01 = ?(Приложение01 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма700Страница1.Вставить("Приложение01", Приложение01);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение01.Значение = Приложение01;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение02" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
					Приложение02 = Форма.ТабличныйДокумент.Области.Приложение02.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма700Страница1.Свойство("Приложение02") Тогда
					Приложение02 = Форма.СтруктураДанныхФорма700Страница1.Приложение02;
				КонецЕсли;
				
				Приложение02 = ?(Приложение02 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма700Страница1.Вставить("Приложение02", Приложение02);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение02.Значение = Приложение02;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение03" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
					Приложение03 = Форма.ТабличныйДокумент.Области.Приложение03.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма700Страница1.Свойство("Приложение03") Тогда
					Приложение03 = Форма.СтруктураДанныхФорма700Страница1.Приложение03;
				КонецЕсли;
				
				Приложение03 = ?(Приложение03 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма700Страница1.Вставить("Приложение03", Приложение03);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение03.Значение = Приложение03;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.КатегорияНалПл, ОбластьИмя) > 0 Тогда
			
			ЗначениеТекЭлемента = "";
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
				ЗначениеТекЭлемента = Форма.ТабличныйДокумент.Области[ОбластьИмя].Значение;
			ИначеЕсли Форма.СтруктураДанныхФорма700Страница1.Свойство(ОбластьИмя) Тогда
				ЗначениеТекЭлемента = Форма.СтруктураДанныхФорма700Страница1[ОбластьИмя];
			КонецЕсли;
			
			ЗначениеТекЭлемента = ?(ЗначениеТекЭлемента = "Х","","Х");
			
			Форма.СтруктураДанныхФорма700Страница1.Вставить("Признак6A", "");
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
				Форма.ТабличныйДокумент.Области.Признак6A.Значение = "";
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма700Страница1.Вставить("Признак6B", "");
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
				Форма.ТабличныйДокумент.Области.Признак6B.Значение = "";
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма700Страница1.Вставить("Признак6C", "");
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
				Форма.ТабличныйДокумент.Области.Признак6C.Значение = "";
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма700Страница1.Вставить("Признак6D", "");
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
				Форма.ТабличныйДокумент.Области.Признак6D.Значение = "";
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма700Страница1.Вставить(ОбластьИмя, ЗначениеТекЭлемента);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
				Форма.ТабличныйДокумент.Области[ОбластьИмя].Значение = ЗначениеТекЭлемента;
			КонецЕсли;
			
			//контракт
			Если Не ОбластьИмя = "Признак6D" ИЛИ ЗначениеТекЭлемента = "" Тогда
				Форма.СтруктураДанныхФорма700Страница1.Вставить("НомерКонтракта", "");
				Форма.СтруктураДанныхФорма700Страница1.Вставить("ДатаКонтракта", "");
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
				Если ОбластьИмя = "Признак6D" И ЗначениеТекЭлемента = "Х" Тогда
					Форма.ТабличныйДокумент.Области.НомерКонтракта.Защита = Ложь;
					Форма.ТабличныйДокумент.Области.ДатаКонтракта.Защита = Ложь;
				Иначе
					Форма.ТабличныйДокумент.Области.НомерКонтракта.Значение = "";
					Форма.ТабличныйДокумент.Области.ДатаКонтракта.Значение = "";
					Форма.ТабличныйДокумент.Области.НомерКонтракта.Защита = Истина;
					Форма.ТабличныйДокумент.Области.ДатаКонтракта.Защита = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//700.00.005
		Если ОбластьИмя = "П000010005101" Тогда
			Расчет(Форма, "Форма700Страница2", ОбластьИмя);
		КонецЕсли;
		
		
		//700.00.001
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010001001, ОбластьИмя) > 0 Тогда
			
			ОкрП000120034004 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_01Страница2" Тогда
				ОкрП000120034004 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120034004.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма700_01Страница2.Свойство("П000120034004") Тогда
				ОкрП000120034004 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма700_01Страница2.П000120034004);
			КонецЕсли;
			
			П000010001001 = ОкрП000120034004;
			
			Форма.СтруктураДанныхФорма700Страница1.Вставить("П000010001001", П000010001001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010001001.Значение = П000010001001;
			КонецЕсли;
			
		КонецЕсли;
		
		//700.00.002
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010002001, ОбластьИмя) > 0 Тогда
			
			ОкрП000010002101 = 0;
			ОкрП000010002201 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
				ОкрП000010002101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010002101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма700Страница1.Свойство("П000010002101") Тогда
				ОкрП000010002101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма700Страница1.П000010002101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
				ОкрП000010002201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010002201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма700Страница1.Свойство("П000010002201") Тогда
				ОкрП000010002201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма700Страница1.П000010002201);
			КонецЕсли;
			
			П000010002001 = ОкрП000010002101 + ОкрП000010002201;
			
			Форма.СтруктураДанныхФорма700Страница1.Вставить("П000010002001", П000010002001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010002001.Значение = П000010002001;
			КонецЕсли;
			
		КонецЕсли;
		
		//700.00.002.I
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010002101, ОбластьИмя) > 0 Тогда
			
			ОкрП000230000104 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_02Страница3" Тогда
				ОкрП000230000104 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000230000104.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма700_02Страница3.Свойство("П000230000104") Тогда
				ОкрП000230000104 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма700_02Страница3.П000230000104);
			КонецЕсли;
			
			П000010002101 = ОкрП000230000104;
			
			Форма.СтруктураДанныхФорма700Страница1.Вставить("П000010002101", П000010002101);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010002101.Значение = П000010002101;
			КонецЕсли;
			
			Расчет(Форма, "Форма700Страница1", "П000010002001_Рекурсия");
			
		КонецЕсли;
		
		//700.00.002.II
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010002201, ОбластьИмя) > 0 Тогда
			
			ОкрП000230000105 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_02Страница3" Тогда
				ОкрП000230000105 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000230000105.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма700_02Страница3.Свойство("П000230000105") Тогда
				ОкрП000230000105 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма700_02Страница3.П000230000105);
			КонецЕсли;
			
			П000010002201 = ОкрП000230000105;
			
			Форма.СтруктураДанныхФорма700Страница1.Вставить("П000010002201", П000010002201);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010002201.Значение = П000010002201;
			КонецЕсли;
			
			Расчет(Форма, "Форма700Страница1", "П000010002001_Рекурсия"); //перерасчет 1й страницы
			
		КонецЕсли;
		
		
	ИначеЕсли ИмяСтраницыПанели = "Форма700Страница2" Тогда
		
		//700.00.007
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020007001, ОбластьИмя) > 0 Тогда
			
			ОкрП000010005101 = 0;
			ОкрП000020006001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
				ОкрП000010005101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010005101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма700Страница1.Свойство("П000010005101") Тогда
				ОкрП000010005101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма700Страница1.П000010005101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница2" Тогда
				ОкрП000020006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020006001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма700Страница2.Свойство("П000020006001") Тогда
				ОкрП000020006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма700Страница2.П000020006001);
			КонецЕсли;
			
			П000020007001 = ОкрП000010005101 - ОкрП000020006001;
			Если П000020007001 < 0 Тогда
				П000020007001 = 0;
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма700Страница2.Вставить("П000020007001", П000020007001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020007001.Значение = П000020007001;
			КонецЕсли;
			
		КонецЕсли;
		
		//700.00.008
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020008001, ОбластьИмя) > 0 Тогда
			
			ОкрП000010005101 = 0;
			ОкрП000020006001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
				ОкрП000010005101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010005101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма700Страница1.Свойство("П000010005101") Тогда
				ОкрП000010005101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма700Страница1.П000010005101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница2" Тогда
				ОкрП000020006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020006001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма700Страница2.Свойство("П000020006001") Тогда
				ОкрП000020006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма700Страница2.П000020006001);
			КонецЕсли;
			
			П000020008001 = ОкрП000020006001 - ОкрП000010005101;
			Если П000020008001 < 0 Тогда
				П000020008001 = 0;
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма700Страница2.Вставить("П000020008001", П000020008001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020008001.Значение = П000020008001;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма700_01Страница1" Тогда
		
		Если ЗначениеЗаполнено(ОбластьИмя) Тогда
			Форма.СтруктураДанныхФорма700Страница1.Вставить("КоличествоПриложений700_01", 1);
			Форма.СтруктураДанныхФорма700Страница1.Вставить("Приложение01", "Х");
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
				Форма.ТабличныйДокумент.Области.КоличествоПриложений700_01.Значение = 1;
				Форма.ТабличныйДокумент.Области.Приложение01.Значение = "Х";
			КонецЕсли;
			
		КонецЕсли;
		
		Если (Лев(ОбластьИмя,8) = "П0001100" И Прав(ОбластьИмя,3)= "002") ИЛИ ОбластьИмя = "" Тогда
			Расчет(Форма, "Форма700_01Страница2", ОбластьИмя);
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма700_01Страница2" Тогда
		
		Если ЗначениеЗаполнено(ОбластьИмя) Тогда
			Форма.СтруктураДанныхФорма700Страница1.Вставить("КоличествоПриложений700_01", 1);
			Форма.СтруктураДанныхФорма700Страница1.Вставить("Приложение01", "Х");
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
				Форма.ТабличныйДокумент.Области.КоличествоПриложений700_01.Значение = 1;
				Форма.ТабличныйДокумент.Области.Приложение01.Значение = "Х";
			КонецЕсли;
			
		КонецЕсли;
		
		//700.01.034
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000120034004, ОбластьИмя) > 0 Тогда
			
			ОкрП000120035004 = 0;
			ОкрП000120036004 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_01Страница2" Тогда
				ОкрП000120035004 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120035004.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма700_01Страница2.Свойство("П000120035004") Тогда
				ОкрП000120035004 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма700_01Страница2.П000120035004);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_01Страница2" Тогда
				ОкрП000120036004 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120036004.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма700_01Страница2.Свойство("П000120036004") Тогда
				ОкрП000120036004 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма700_01Страница2.П000120036004);
			КонецЕсли;
			
			П000120034004 = ОкрП000120035004 + ОкрП000120036004;
			
			Форма.СтруктураДанныхФорма700_01Страница2.Вставить("П000120034004", П000120034004);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_01Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000120034004.Значение = П000120034004;
				// Форма.ТабличныйДокумент.Области.П000120035004.Значение = ОкрП000120035004;
			КонецЕсли;
			
			Расчет(Форма, "Форма700Страница1", "П000010001001"); 
			
		КонецЕсли;
		
		//700.01.035
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ (Лев(ОбластьИмя,8) = "П0001100" И Прав(ОбластьИмя,3)= "002")
			ИЛИ (Лев(ОбластьИмя,8) = "П0001200" И Прав(ОбластьИмя,3)= "002") Тогда
			
			П000120035004 = 0;
			Для Индекс = 1 По 26 Цикл
				
				ТекЭлемент = ("П0001100"+Формат(Индекс,"ЧЦ=2; ЧВН=")+"002");
				ЗначениеТекЭлемента = 0;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_01Страница1" Тогда
					ЗначениеТекЭлемента = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области[ТекЭлемент].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма700_01Страница1.Свойство(ТекЭлемент) Тогда
					ЗначениеТекЭлемента = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма700_01Страница1[ТекЭлемент]);
				КонецЕсли;
				
				П000120035004 = П000120035004 + ЗначениеТекЭлемента;
				
			КонецЦикла;
			
			Для Индекс = 27 По 33 Цикл
				ТекЭлемент = ("П0001200"+Формат(Индекс,"ЧЦ=2; ЧВН=")+"002");
				ЗначениеТекЭлемента = 0;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_01Страница2" Тогда
					ЗначениеТекЭлемента = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области[ТекЭлемент].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма700_01Страница2.Свойство(ТекЭлемент) Тогда
					ЗначениеТекЭлемента = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма700_01Страница2[ТекЭлемент]);
				КонецЕсли;
				
				П000120035004 = П000120035004 + ЗначениеТекЭлемента;
				
			КонецЦикла;
			
			Форма.СтруктураДанныхФорма700_01Страница2.Вставить("П000120035004", П000120035004);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_01Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000120035004.Значение = П000120035004;
			КонецЕсли;
			
			Расчет(Форма, "Форма700_01Страница2", "П000120034004_Рекурсия");
				
		КонецЕсли;
		
		//700.01.038  
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000120038004, ОбластьИмя) > 0 Тогда
			
			ОкрП000120034004 = 0;
			ОкрП000120037004 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_01Страница2" Тогда
				ОкрП000120034004 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120034004.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма700_01Страница2.Свойство("П000120034004") Тогда
				ОкрП000120034004 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма700_01Страница2.П000120034004);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_01Страница2" Тогда
				ОкрП000120037004 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120037004.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма700_01Страница2.Свойство("П000120037004") Тогда
				ОкрП000120037004 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма700_01Страница2.П000120037004);
			КонецЕсли;
			
			П000120038004 = ОкрП000120034004 - ОкрП000120037004;
			Если П000120038004 < 0 Тогда
				П000120038004 = 0;				
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма700_01Страница2.Вставить("П000120038004", П000120038004);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_01Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000120038004.Значение = П000120038004;
			КонецЕсли;
			
		КонецЕсли;
		
		//700.01.039
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000120039004, ОбластьИмя) > 0 Тогда
			
			ОкрП000120034004 = 0;
			ОкрП000120037004 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_01Страница2" Тогда
				ОкрП000120034004 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120034004.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма700_01Страница2.Свойство("П000120034004") Тогда
				ОкрП000120034004 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма700_01Страница2.П000120034004);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_01Страница2" Тогда
				ОкрП000120037004 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120037004.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма700_01Страница2.Свойство("П000120037004") Тогда
				ОкрП000120037004 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма700_01Страница2.П000120037004);
			КонецЕсли;
			
			П000120039004 = ОкрП000120037004 - ОкрП000120034004;
			Если П000120039004 < 0 Тогда
				П000120039004 = 0;
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма700_01Страница2.Вставить("П000120039004", П000120039004);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_01Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000120039004.Значение = П000120039004;
			КонецЕсли;
			
		КонецЕсли;
		
		//700.02
	ИначеЕсли ИмяСтраницыПанели = "Форма700_02Страница1" Тогда
		
		Если ЗначениеЗаполнено(ОбластьИмя) Тогда
			Форма.СтруктураДанныхФорма700Страница1.Вставить("КоличествоПриложений700_02", 1);
			Форма.СтруктураДанныхФорма700Страница1.Вставить("Приложение02", "Х");
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
				Форма.ТабличныйДокумент.Области.КоличествоПриложений700_02.Значение = 1;
				Форма.ТабличныйДокумент.Области.Приложение02.Значение = "Х";
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.ЕдиницыИзмерения, Лев(ОбластьИмя, 13)) > 0 Тогда
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Если Лев(ОбластьИмя, 13) = "П000210000503" Тогда
					Га = "Х";
					Квм = "";
					НомерСтроки = Прав(ОбластьИмя, СтрДлина(ОбластьИмя) - СтрНайти(ОбластьИмя, "_"));
					Форма.ТабличныйДокумент.Области["П000210000503_" + НомерСтроки].Значение = Га;
					Форма.ТабличныйДокумент.Области["П000210000504_" + НомерСтроки].Значение = Квм;
				ИначеЕсли Лев(ОбластьИмя, 13) = "П000210000504" Тогда
					Га = "";
					Квм = "Х";
					НомерСтроки = Прав(ОбластьИмя, СтрДлина(ОбластьИмя) - СтрНайти(ОбластьИмя, "_"));
					Форма.ТабличныйДокумент.Области["П000210000503_" + НомерСтроки].Значение = Га;
					Форма.ТабличныйДокумент.Области["П000210000504_" + НомерСтроки].Значение = Квм;
				КонецЕсли;
			Иначе
				Если Лев(ОбластьИмя, 13) = "П000210000503" Тогда
					Га = "Х";
					Квм = "";
					НомерСтроки = Прав(ОбластьИмя, СтрДлина(ОбластьИмя) - СтрНайти(ОбластьИмя, "_"));
					Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы21]][НомерСтроки - 1].П000210000503 = Га;
					Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы21]][НомерСтроки - 1].П000210000504 = Квм;
				ИначеЕсли Лев(ОбластьИмя, 13) = "П000210000504" Тогда
					Га = "";
					Квм = "Х";
					НомерСтроки = Прав(ОбластьИмя, СтрДлина(ОбластьИмя) - СтрНайти(ОбластьИмя, "_"));
					Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы21]][НомерСтроки - 1].П000210000503 = Га;
					Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы21]][НомерСтроки - 1].П000210000504 = Квм;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Расчет(Форма, "Форма700_02Страница3", ОбластьИмя);
		
	ИначеЕсли ИмяСтраницыПанели = "Форма700_02Страница2" Тогда
		
		Если ЗначениеЗаполнено(ОбластьИмя) Тогда
			Форма.СтруктураДанныхФорма700Страница1.Вставить("КоличествоПриложений700_02", 1);
			Форма.СтруктураДанныхФорма700Страница1.Вставить("Приложение02", "Х");
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
				Форма.ТабличныйДокумент.Области.КоличествоПриложений700_02.Значение = 1;
				Форма.ТабличныйДокумент.Области.Приложение02.Значение = "Х";
			КонецЕсли;
		КонецЕсли;
		
		Расчет(Форма, "Форма700_02Страница3", ОбластьИмя);
		
	ИначеЕсли ИмяСтраницыПанели = "Форма700_02Страница3" Тогда
		
		Если ЗначениеЗаполнено(ОбластьИмя) Тогда
			Форма.СтруктураДанныхФорма700Страница1.Вставить("КоличествоПриложений700_02", 1);
			Форма.СтруктураДанныхФорма700Страница1.Вставить("Приложение02", "Х");
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700Страница1" Тогда
				Форма.ТабличныйДокумент.Области.КоличествоПриложений700_02.Значение = 1;
				Форма.ТабличныйДокумент.Области.Приложение02.Значение = "Х";
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000230000503, Лев(ОбластьИмя, 13)) > 0 Тогда
			
			O = 0;
			P1 = 0;
			S1 = 0;
			
			Если  Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_02Страница1" Тогда
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы23]].Количество() Цикл			
					
					D = РегламентированнаяОтчетностьКлиентСерверРК.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000210000505_" + Ном].Значение,2);
					
					ДанныеСтроки_Страница2 = Форма.П0002200005.Получить(Ном-1);
					ДанныеСтроки_Страница3 = Форма.П0002300005.Получить(Ном-1);
					
					K = ДанныеСтроки_Страница2.П000220000506;
					L = ДанныеСтроки_Страница2.П000220000507;
					M = ДанныеСтроки_Страница2.П000220000508;
					
					ДанныеСтроки_Страница2 = Форма.П0002200005.Получить(Ном-1);
					
					K = ДанныеСтроки_Страница2.П000220000506;
					L = ДанныеСтроки_Страница2.П000220000507;
					M = ДанныеСтроки_Страница2.П000220000508;
					
					O = D * K / 12 * L;
					
					Если M = 104302 Тогда
						P1 = P1 + O;
					ИначеЕсли M = 104309 Тогда
						S1 = S1 + O;
					КонецЕсли;
					
					Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы23]][Ном-1].П000230000503 = Формат(O, "ЧЦ=12; ЧДЦ=; ЧН=0");
					
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма700_02Страница3.Вставить("П000230000104", Формат(P1, "ЧЦ=9; ЧДЦ=; ЧН=0"));
				Форма.СтруктураДанныхФорма700_02Страница3.Вставить("П000230000105", Формат(S1, "ЧЦ=9; ЧДЦ=; ЧН=0"));
				
			КонецЕсли;
			
			Если  Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_02Страница2" Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы23]].Количество() Цикл			
					
					ДанныеСтроки_Страница1 = Форма.П0002100005.Получить(Ном-1);
					
					D = ДанныеСтроки_Страница1.П000210000505;
					
					K = РегламентированнаяОтчетностьКлиентСерверРК.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000220000506_" + Ном].Значение,2);
					L = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000220000507_" + Ном].Значение);
					M = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000220000508_" + Ном].Значение);
					
					O = D * K / 12 * L;
					
					Если M = 104302 Тогда
						P1 = P1 + O;
					ИначеЕсли M = 104309 Тогда
						S1 = S1 + O;
					КонецЕсли;
					
					Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы23]][Ном-1].П000230000503 = Формат(O, "ЧЦ=12; ЧДЦ=; ЧН=0");
					
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма700_02Страница3.Вставить("П000230000104", Формат(P1, "ЧЦ=9; ЧДЦ=; ЧН=0"));
				Форма.СтруктураДанныхФорма700_02Страница3.Вставить("П000230000105", Формат(S1, "ЧЦ=9; ЧДЦ=; ЧН=0"));
				
			КонецЕсли;
			
			Если  Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_02Страница3" ИЛИ  НЕ ЗначениеЗаполнено(ОбластьИмя) Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы23]].Количество() Цикл
					
					ДанныеСтроки_Страница1 = Форма.П0002100005.Получить(Ном-1);
					ДанныеСтроки_Страница2 = Форма.П0002200005.Получить(Ном-1);
					ДанныеСтроки_Страница3 = Форма.П0002300005.Получить(Ном-1);
					
					D = ДанныеСтроки_Страница1.П000210000505;
					K = ДанныеСтроки_Страница2.П000220000506;
					L = ДанныеСтроки_Страница2.П000220000507;
					M = ДанныеСтроки_Страница2.П000220000508;
					
					O = D * K / 12 * L;
					
					Если M = 104302 Тогда
						P1 = P1 + O;
					ИначеЕсли M = 104309 Тогда
						S1 = S1 + O;
					КонецЕсли;
					
					Если  Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_02Страница3" Тогда
						
						Форма.ТабличныйДокумент.Области["П000230000503_" + (Ном)].Значение = Формат(O, "ЧЦ=12; ЧДЦ=; ЧН=0");
						
					Иначе
						
						Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы23]][Ном-1].П000230000503 = Формат(O, "ЧЦ=12; ЧДЦ=; ЧН=0");
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если  Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_02Страница3" Тогда
					
					Форма.ТабличныйДокумент.Области.П000230000104.Значение = Формат(P1, "ЧЦ=9; ЧДЦ=; ЧН=0");
					Форма.ТабличныйДокумент.Области.П000230000105.Значение = Формат(S1, "ЧЦ=9; ЧДЦ=; ЧН=0");
					
				КонецЕсли;
			
				Форма.СтруктураДанныхФорма700_02Страница3.Вставить("П000230000104", Формат(P1, "ЧЦ=9; ЧДЦ=; ЧН=0"));
				Форма.СтруктураДанныхФорма700_02Страница3.Вставить("П000230000105", Формат(S1, "ЧЦ=9; ЧДЦ=; ЧН=0"));
				
			КонецЕсли;
			
			Расчет(Форма, "Форма700Страница1", "П000230000105");
			
		КонецЕсли;
		
		//Расчет итогов и разности
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.ИтогРазница, Лев(ОбластьИмя, 13)) > 0 Тогда
			
			ОкрП000230000104 = 0;
			ОкрП000230000204 = 0;
			ОкрП000230000105 = 0;
			ОкрП000230000205 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_02Страница3" Тогда
				ОкрП000230000104 = Форма.ТабличныйДокумент.Области.П000230000104.Значение;
			ИначеЕсли Форма.СтруктураДанныхФорма700_02Страница3.Свойство("П000230000104") Тогда
				ОкрП000230000104 = Форма.СтруктураДанныхФорма700_02Страница3.П000230000104;
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_02Страница3" Тогда
				ОкрП000230000204 = Форма.ТабличныйДокумент.Области.П000230000204.Значение;
			ИначеЕсли Форма.СтруктураДанныхФорма700_02Страница3.Свойство("П000230000204") Тогда
				ОкрП000230000204 = Форма.СтруктураДанныхФорма700_02Страница3.П000230000204;
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_02Страница3" Тогда
				ОкрП000230000105 = Форма.ТабличныйДокумент.Области.П000230000105.Значение;
			ИначеЕсли Форма.СтруктураДанныхФорма700_02Страница3.Свойство("П000230000105") Тогда
				ОкрП000230000105 = Форма.СтруктураДанныхФорма700_02Страница3.П000230000105;
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_02Страница3" Тогда
				ОкрП000230000205 = Форма.ТабличныйДокумент.Области.П000230000205.Значение;
			ИначеЕсли Форма.СтруктураДанныхФорма700_02Страница3.Свойство("П000230000205") Тогда
				ОкрП000230000205 = Форма.СтруктураДанныхФорма700_02Страница3.П000230000205;
			КонецЕсли;
			
			П000230000304 = ОкрП000230000104 - ОкрП000230000204;
			Если П000230000304 < 0 Тогда
				П000230000304 = 0;
			КонецЕсли;
			
			П000230000404 = ОкрП000230000204 - ОкрП000230000104;
			Если П000230000404 < 0 Тогда
				П000230000404 = 0;
			КонецЕсли;
			
			П000230000305 = ОкрП000230000105 - ОкрП000230000205;
			Если П000230000305 < 0 Тогда
				П000230000305 = 0;
			КонецЕсли;
			
			П000230000405 = ОкрП000230000205 - ОкрП000230000105;
			Если П000230000405 < 0 Тогда
				П000230000405 = 0;
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма700_02Страница3.Вставить("П000230000404", П000230000404);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_02Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000230000404.Значение = П000230000404;
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма700_02Страница3.Вставить("П000230000304", П000230000304);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_02Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000230000304.Значение = П000230000304;
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма700_02Страница3.Вставить("П000230000305", П000230000305);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_02Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000230000305.Значение = П000230000305;
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма700_02Страница3.Вставить("П000230000405", П000230000405);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма700_02Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000230000405.Значение = П000230000405;
			КонецЕсли;
			
		КонецЕсли;
		
		//Авторасчет
	ИначеЕсли ИмяСтраницыПанели = "" Тогда
		
		Расчет(Форма,"Форма700Страница1", "");
		Расчет(Форма,"Форма700Страница2", "");
		Расчет(Форма,"Форма700_01Страница1", "");
		Расчет(Форма,"Форма700_01Страница2", "");
		Расчет(Форма,"Форма700_02Страница1", "");
		Расчет(Форма,"Форма700_02Страница2", "");
		Расчет(Форма,"Форма700_02Страница3", "");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьЗавершение", ЭтотОбъект);
	
	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВыгрузитьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчет() Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьОтчетЗавершение", ЭтотОбъект);
	
	Если Модифицированность Тогда
		СохранитьНаКлиенте(,ОписаниеОповещения);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчетЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ФормаВыгрузкиРеглОтчета = ПолучитьФорму("Документ.ВыгрузкаРегламентированныхОтчетов.Форма.ФормаДокумента", , ЭтаФорма);
	
	СпДокОсн = Новый СписокЗначений;
	СпДокОсн.Добавить(СтруктураРеквизитовФормы.мСохраненныйДок);
	
	ФормаВыгрузкиРеглОтчета.СформироватьИЗаписать(СпДокОсн);
	
КонецПроцедуры

&НаКлиенте
Функция УниверсальнаяВыгрузка (ТекстВыгрузки = Неопределено, ПроверятьБлокировки = Истина, ИмяФайлаВыгрузки = "", ВыгружатьСОшибками = Ложь) Экспорт
	
	ИмяФайлаВыгрузки = СформироватьИмяФайла();
	
	СформироватьСписокФормБезИерархии();
	
	ТекстВыгрузки = УниверсальнаяВыгрузкаНаСервере();
	
	Если ТекстВыгрузки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция СформироватьИмяФайла()
	
	Перем ПолученноеЗначение;
	
	ИмяФайлаXML = "Форма700_"+ Прав(Этаформа.ИмяФормы,7)+ "_" + СтрЗаменить(СтрЗаменить(Строка(ТекущаяДата())," ","_"),":","-") + ".xml";
	
	Возврат ИмяФайлаXML;
	
КонецФункции

&НаСервере
Функция  УниверсальнаяВыгрузкаНаСервере()
	Возврат РегламентированнаяОтчетностьРК.ВыгрузитьОтчетВXMLДляСОНО(ЭтотОбъект);
КонецФункции

&НаСервере
Процедура СформироватьСписокФормБезИерархии()
	
	мСписокФормБезИерархии.ПолучитьЭлементы().Очистить();
	
	МакетПоказателей = Отчеты[Сред(Лев(ЭтотОбъект.ИмяФормы, СтрНайти(ЭтотОбъект.ИмяФормы, ".Форма.") - 1), 7)].ПолучитьМакет("Показатели");
	Префикс = Прав(ЭтаФорма.СтруктураРеквизитовФормы.мВыбраннаяФорма,7);
	
	Попытка
		ОбластьПоказателей = МакетПоказателей.Область("Форма700_" + Префикс);
	Исключение
		СообщениеТабл = ТаблицаСообщений.Добавить();
		СообщениеТабл.Описание = НСтр("ru = 'Отсутствует актуальный шаблон для выгрузки'");
	КонецПопытки;
	
	Для Ном = ОбластьПоказателей.Верх По ОбластьПоказателей.Низ Цикл
		
		НоваяСтрока = мСписокФормБезИерархии.ПолучитьЭлементы().Добавить();
		НоваяСтрока.ИмяФормы			= СокрП(МакетПоказателей.Область(Ном, 1).Текст);
		НоваяСтрока.Выгружать			= ?(СокрП(МакетПоказателей.Область(Ном, 2).Текст)= "1",Истина,Ложь);
		НоваяСтрока.Многострочность		= ?(СокрП(МакетПоказателей.Область(Ном, 3).Текст)= "1",Истина,Ложь);
		НоваяСтрока.КодФормы			= СокрП(МакетПоказателей.Область(Ном, 4).Текст);
		НоваяСтрока.КоличествоНаЛисте	= Число(СокрП(МакетПоказателей.Область(Ном, 5).Текст));
		НоваяСтрока.КоличествоСтраницПриложения = Число(СокрП(МакетПоказателей.Область(Ном, 6).Текст));
		
		Если НоваяСтрока.Многострочность <> Истина Тогда
			Для КолСтр = 1 По НоваяСтрока.КоличествоСтраницПриложения  Цикл
				Для Каждого Элемент Из ЭтаФорма["СтруктураДанных"+ НоваяСтрока.КодФормы + "Страница" + КолСтр] Цикл
					НовыйЭлемент = НоваяСтрока.Значение.Добавить();
					НовыйЭлемент.ИмяОбласти = Элемент.Ключ;
					НовыйЭлемент.Значение = Элемент.Значение;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьМногострочнуюСтруктуруДляВыгрузки (ТекущееИмяФормы, ТаблицаМногострочнойФормы = Неопределено) Экспорт
	
	Возврат СформироватьМногострочнуюСтруктуруДляВыгрузкиНаСервере(ТекущееИмяФормы, ТаблицаМногострочнойФормы);
	
КонецФункции

&НаСервере
Функция СформироватьМногострочнуюСтруктуруДляВыгрузкиНаСервере(ТекущееИмяФормы, ТаблицаМногострочнойФормы = Неопределено) Экспорт
	
	Перем ТаблицаСтраницРаздела;
	
	Если ТекущееИмяФормы = Неопределено тогда
		ТекущееИмяФормы = "Форма700_02";
	КонецЕсли;
	
	МногострочнаяСтруктура = Новый Структура;
	
	ТекущийЛист = Неопределено;
	НомерСтроки = 0;
	КоличествоСтрок = ТаблицаМногострочнойФормы.Количество();
	
	Пока Истина Цикл 
		
		Если НомерСтроки >= КоличествоСтрок Тогда 
			Прервать;
		КонецЕсли;
		
		СтрокаТЗ = ТаблицаМногострочнойФормы[НомерСтроки];
		
		Если Не СтрокаТЗ.ИмяЛиста = ТекущийЛист Тогда
			
			МногострочнаяСтруктура.Вставить(СтрокаТЗ.ИмяЛиста, Новый Структура);
			МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста].Вставить("Строки", Новый ТаблицаЗначений);
			МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста].Вставить("ШапкаИПодвал", Новый ТаблицаЗначений);
			
			МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("Значение");
			МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("ИмяОбласти");
			МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("ИмяПараметра");
			МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("Итог");
			
			
			ТекущийЛист = СтрокаТЗ.ИмяЛиста;
			
		КонецЕсли;
		
		Если СтрокаТЗ.КоличествоROW = "0" Тогда
			//Заполняем таблицу значений параметров шапки
			Если ЗначениеЗаполнено(СтрокаТЗ.ИмяЯчейки) Тогда
				//Добавим новую строку в ТЗ значений шапки таблицы
				НоваяСтрока = МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Добавить();
				
				//Получим значение параметра из структуры формы
				ЗначениеПараметра = ЭтаФорма["СтруктураДанных" + СтрокаТЗ.КодФормы + ?(СтрокаТЗ.КодФормы = "Форма700_02", СтрокаТЗ.ИмяЛиста, "Страница1")][СтрокаТЗ.ИмяЯчейки];
				
				НоваяСтрока.Значение 		= ЗначениеПараметра;
				НоваяСтрока.ИмяПараметра 	= СтрокаТЗ.ИмяЯчейки;
				НоваяСтрока.ИмяОбласти 		= СтрокаТЗ.ИмяЯчейки;
				НоваяСтрока.Итог 			= Ложь;
			КонецЕсли;
		Иначе 
			//А это уже строки таблицы
			//Определим состав колонок многострочной формы
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ИмяЛиста", СтрокаТЗ.ИмяЛиста);
			СтруктураПоиска.Вставить("КоличествоROW", "11");
			СтрокиТаблицы = ТаблицаМногострочнойФормы.НайтиСтроки(СтруктураПоиска);
			
			ИмяТаблицы = Сред(СтрокаТЗ.ИмяЯчейки, 1, 11);
			
			//Проверям есть ли у нас вообще записи в многострочной форме
			//И формируем набор колонок таблицы значений
			ЕстьЗаписи = Ложь;
			Если Не ЭтотОбъект[ИмяТаблицы].Количество() = 0 Тогда
				Для Каждого Строка Из СтрокиТаблицы Цикл
					ИмяЯчейки = Сред(Строка.ИмяЯчейки, 1, 13);
					МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["Строки"].Колонки.Добавить(ИмяЯчейки);
					Если ЗначениеЗаполнено(ЭтотОбъект[ИмяТаблицы][0][ИмяЯчейки]) Тогда 
						ЕстьЗаписи = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если ЕстьЗаписи Тогда
				//Если записи обнаружены то заполняем таблицу значений
				Для Каждого СтрокаТаблицы Из ЭтотОбъект[ИмяТаблицы] Цикл 
					НоваяСтрока = МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["Строки"].Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				КонецЦикла;
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + СтрокиТаблицы.Количество() - 1;
			
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	Возврат МногострочнаяСтруктура;
	
КонецФункции

&НаКлиенте
Процедура Расшифровать(Команда)
	
	Попытка
		ИмяЯчейки = ЭтотОбъект.ТекущийЭлемент.ТекущаяОбласть.Имя;
	Исключение
		Возврат;
	КонецПопытки;
	
	Если (Найти(ИмяЯчейки , "П000010002101") > 0)
		ИЛИ (Найти(ИмяЯчейки , "П000010002201") > 0)Тогда
		ОткрытьФормуРасшифровки("ЗемельныйНалог",ИмяЯчейки);
	ИначеЕсли (Найти(ИмяЯчейки , "П000010005101") > 0)Тогда
		ОткрытьФормуРасшифровки("ИмущественныйНалог",ИмяЯчейки);
	ИначеЕсли (Найти(ИмяЯчейки , "П00011") > 0)
		ИЛИ (Найти(ИмяЯчейки , "П00012") > 0)
		ИЛИ (Найти(ИмяЯчейки , "П000010001001") > 0) Тогда
		ОткрытьФормуРасшифровки("ТранспортныйНалог",ИмяЯчейки);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРасшифровки(ТипНалога,ИмяЯчейки)
	
	Если ТипНалога = "" Тогда
		Возврат;
	ИначеЕсли ТипНалога = "ИмущественныйНалог" Тогда
		
		ДатаОкончания = КонецГода(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
		
		ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
		
		ЕстьОтбор = ПользовательскиеНастройки.Элементы.Найти("Отбор") <> Неопределено;
		ЗаполняемыеНастройки = Новый Структура("Показатели, Группировка, Отбор, ВыводимыеДанные", Ложь, Ложь, ЕстьОтбор, Ложь);
		
		ДополнительныеСвойства = ПользовательскиеНастройки.ДополнительныеСвойства;
		ДополнительныеСвойства.Вставить("РежимРасшифровки",  Истина);
		ДополнительныеСвойства.Вставить("Организация",       СтруктураРеквизитовФормы.Организация);
		ДополнительныеСвойства.Вставить("НачалоПериода",     СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
		ДополнительныеСвойства.Вставить("КонецПериода",      ДатаОкончания);
		ДополнительныеСвойства.Вставить("ВыводитьЗаголовок", Истина);
		ДополнительныеСвойства.Вставить("КлючВарианта",     "РасчетНалогаНаИмущество");
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ВидРасшифровки", 2);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("ИДРасшифровки", "РасчетНалогаНаИмущество");
		ПараметрыФормы.Вставить("ЗаполняемыеНастройки", ЗаполняемыеНастройки);
		ПараметрыФормы.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
		
		ОткрытьФорму("Отчет.СправкаРасчетНалогаНаИмущество.Форма.ФормаОтчета", ПараметрыФормы,, Новый УникальныйИдентификатор);
		
	ИначеЕсли ТипНалога = "ЗемельныйНалог" Тогда
		
		ДатаОкончания = КонецГода(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
		ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
		
		ЕстьОтбор = ПользовательскиеНастройки.Элементы.Найти("Отбор") <> Неопределено;
		ЗаполняемыеНастройки = Новый Структура("Показатели, Группировка, Отбор, ВыводимыеДанные", Ложь, Ложь, ЕстьОтбор, Ложь);
		
		ДополнительныеСвойства = ПользовательскиеНастройки.ДополнительныеСвойства;
		ДополнительныеСвойства.Вставить("РежимРасшифровки",  Истина);
		ДополнительныеСвойства.Вставить("Организация",       СтруктураРеквизитовФормы.Организация);
		ДополнительныеСвойства.Вставить("НачалоПериода",     СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
		ДополнительныеСвойства.Вставить("КонецПериода",      ДатаОкончания);
		ДополнительныеСвойства.Вставить("КонецПериода",      ДатаОкончания);
		ДополнительныеСвойства.Вставить("ВыводитьЗаголовок", Истина);
		ДополнительныеСвойства.Вставить("КлючВарианта",      "РасчетЗемельногоНалога");
		
		ЭлементПользовательскихНастроек = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
		ЭлементПользовательскихНастроек.ИдентификаторПользовательскойНастройки = "Отбор";
		ЭлементОтбора = ЭлементПользовательскихНастроек.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КБК");
		ЭлементОтбора.ПравоеЗначение = ?(ИмяЯчейки = "П000010002201","104309","104302");
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ВидРасшифровки", 2);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("ИДРасшифровки", "РасчетЗемельногоНалога");
		ПараметрыФормы.Вставить("ЗаполняемыеНастройки", ЗаполняемыеНастройки);
		ПараметрыФормы.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
		
		ОткрытьФорму("Отчет.СправкаРасчетЗемельногоНалога.Форма.ФормаОтчета", ПараметрыФормы,, Новый УникальныйИдентификатор);
		
	ИначеЕсли ТипНалога = "ТранспортныйНалог" Тогда
		
		ДатаОкончания = КонецГода(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
		ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
		
		ЕстьОтбор = ПользовательскиеНастройки.Элементы.Найти("Отбор") <> Неопределено;
		ЗаполняемыеНастройки = Новый Структура("Показатели, Группировка, Отбор, ВыводимыеДанные", Ложь, Ложь, ЕстьОтбор, Ложь);
		
		ДополнительныеСвойства = ПользовательскиеНастройки.ДополнительныеСвойства;
		ДополнительныеСвойства.Вставить("РежимРасшифровки",  Истина);
		ДополнительныеСвойства.Вставить("Организация",       СтруктураРеквизитовФормы.Организация);
		ДополнительныеСвойства.Вставить("НачалоПериода",     СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
		ДополнительныеСвойства.Вставить("КонецПериода",      ДатаОкончания);
		ДополнительныеСвойства.Вставить("ВыводитьЗаголовок", Истина);
		ДополнительныеСвойства.Вставить("КлючВарианта",     "РасчетТранспортногоНалога");
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ВидРасшифровки", 2);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("ИДРасшифровки", "РасчетТранспортногоНалога");
		ПараметрыФормы.Вставить("ЗаполняемыеНастройки", ЗаполняемыеНастройки);
		
		ПолучитьОтборыРасшифровкиПоИмениЯчейки(ПользовательскиеНастройки, ИмяЯчейки);
		ПараметрыФормы.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
		
		ОткрытьФорму("Отчет.СправкаРасчетТранспортногоНалога.Форма.ФормаОтчета", ПараметрыФормы,, Новый УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьОтборыРасшифровкиПоИмениЯчейки(ПользовательскиеНастройки, ИмяЯчейки)
	
	ЭлементПользовательскихНастроек = Неопределено;
	ВидТС = Неопределено;
	НалоговаяБазаНижняяГраница = Неопределено;
	НалоговаяБазаВерхняяГраница = Неопределено;
	ЭксплуатацияВРКдо1апреля1999г = Неопределено;
	
	Если Найти(ИмяЯчейки ,"П0001100010")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.ГрузовойАвтомобиль");
		НалоговаяБазаВерхняяГраница = 1;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100020")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.ГрузовойАвтомобиль");
		НалоговаяБазаНижняяГраница = 1;
		НалоговаяБазаВерхняяГраница = 1.5;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100030")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.ГрузовойАвтомобиль");
		НалоговаяБазаНижняяГраница = 1.5;
		НалоговаяБазаВерхняяГраница = 5;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100040")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.ГрузовойАвтомобиль");
		НалоговаяБазаНижняяГраница = 5;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100050")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.СамоходнаяМашина");
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100060")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.Автобус");
		НалоговаяБазаВерхняяГраница = 12;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100070")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.Автобус");
		НалоговаяБазаНижняяГраница = 12;
		НалоговаяБазаВерхняяГраница = 25;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100080")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.Автобус");
		НалоговаяБазаНижняяГраница = 25;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100090")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.Мотоцикл");
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100100")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.Мотоцикл");
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100110")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.Катер");
		НалоговаяБазаВерхняяГраница = 160;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100120")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.Катер");
		НалоговаяБазаНижняяГраница = 160;
		НалоговаяБазаВерхняяГраница = 500;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100130")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.Катер");
		НалоговаяБазаНижняяГраница = 500;
		НалоговаяБазаВерхняяГраница = 1000;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100140")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.Катер");
		НалоговаяБазаНижняяГраница = 1000;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100150")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.ЛегковойАвтомобиль");
		НалоговаяБазаВерхняяГраница = 1100;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100160")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.ЛегковойАвтомобиль");
		НалоговаяБазаНижняяГраница = 1100;
		НалоговаяБазаВерхняяГраница = 1500;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100170")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.ЛегковойАвтомобиль");
		НалоговаяБазаНижняяГраница = 1500;
		НалоговаяБазаВерхняяГраница = 2000;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100180")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.ЛегковойАвтомобиль");
		НалоговаяБазаНижняяГраница = 2000;
		НалоговаяБазаВерхняяГраница = 2500;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100190")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.ЛегковойАвтомобиль");
		НалоговаяБазаНижняяГраница = 2500;
		НалоговаяБазаВерхняяГраница = 3000;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100200")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.ЛегковойАвтомобиль");
		НалоговаяБазаНижняяГраница = 3000;
		НалоговаяБазаВерхняяГраница = 4000;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100210")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.ЛегковойАвтомобиль");
		НалоговаяБазаНижняяГраница = 4000;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100220")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.ЛегковойАвтомобиль");
		НалоговаяБазаНижняяГраница = 3000;
		НалоговаяБазаВерхняяГраница = 3200;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100230")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.ЛегковойАвтомобиль");
		НалоговаяБазаНижняяГраница = 3200;
		НалоговаяБазаВерхняяГраница = 3500;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100240")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.ЛегковойАвтомобиль");
		НалоговаяБазаНижняяГраница = 3500;
		НалоговаяБазаВерхняяГраница = 4000;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100250")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.ЛегковойАвтомобиль");
		НалоговаяБазаНижняяГраница = 4000;
		НалоговаяБазаВерхняяГраница = 5000;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100260")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.ЛегковойАвтомобиль");
		НалоговаяБазаНижняяГраница = 5000;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001200270")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.ЛетательныйАппарат");
		ЭксплуатацияВРКдо1апреля1999г = Ложь;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001200280")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.ЛетательныйАппарат");
		ЭксплуатацияВРКдо1апреля1999г = Ложь;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001200290")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.ЛетательныйАппарат");
		ЭксплуатацияВРКдо1апреля1999г = Ложь;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001200300")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.ЛетательныйАппарат");
		ЭксплуатацияВРКдо1апреля1999г = Истина;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001200310")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.ЛетательныйАппарат");
		ЭксплуатацияВРКдо1апреля1999г = Истина;
	ИначеЕсли Найти(ИмяЯчейки ,"П0001200320")> 0 Тогда
		ВидТС = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.ЛетательныйАппарат");
		ЭксплуатацияВРКдо1апреля1999г = Истина;
	КонецЕсли;
	
	Если ВидТС <> Неопределено Тогда
		
		Если ЭлементПользовательскихНастроек = Неопределено Тогда
			ЭлементПользовательскихНастроек = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
			ЭлементПользовательскихНастроек.ИдентификаторПользовательскойНастройки = "Отбор";
		КонецЕсли;
		ЭлементОтбора = ЭлементПользовательскихНастроек.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КодВидаТранспортногоСредства");
		ЭлементОтбора.ПравоеЗначение = ВидТС;
		
	КонецЕсли;
	
	Если НалоговаяБазаНижняяГраница <> Неопределено И НалоговаяБазаВерхняяГраница <> Неопределено Тогда
		
		Если ЭлементПользовательскихНастроек = Неопределено Тогда
			ЭлементПользовательскихНастроек = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
			ЭлементПользовательскихНастроек.ИдентификаторПользовательскойНастройки = "Отбор";
		КонецЕсли;
		
		ГруппаОтбораИ = ЭлементПользовательскихНастроек.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		
		ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НалоговаяБаза");
		ЭлементОтбора.ПравоеЗначение = НалоговаяБазаВерхняяГраница;
		
		ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НалоговаяБаза");
		ЭлементОтбора.ПравоеЗначение = НалоговаяБазаНижняяГраница;
		
	ИначеЕсли НалоговаяБазаНижняяГраница <> Неопределено Тогда
		
		Если ЭлементПользовательскихНастроек = Неопределено Тогда
			ЭлементПользовательскихНастроек = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
			ЭлементПользовательскихНастроек.ИдентификаторПользовательскойНастройки = "Отбор";
		КонецЕсли;
		
		ЭлементОтбора = ЭлементПользовательскихНастроек.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НалоговаяБаза");
		ЭлементОтбора.ПравоеЗначение = НалоговаяБазаНижняяГраница;
		
	ИначеЕсли НалоговаяБазаВерхняяГраница <> Неопределено Тогда
		
		Если ЭлементПользовательскихНастроек = Неопределено Тогда
			ЭлементПользовательскихНастроек = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
			ЭлементПользовательскихНастроек.ИдентификаторПользовательскойНастройки = "Отбор";
		КонецЕсли;
		
		ЭлементОтбора = ЭлементПользовательскихНастроек.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НалоговаяБаза");
		ЭлементОтбора.ПравоеЗначение = НалоговаяБазаВерхняяГраница;
		
	КонецЕсли;
	
	Если ЭксплуатацияВРКдо1апреля1999г <> Неопределено Тогда
		
		Если ЭлементПользовательскихНастроек = Неопределено Тогда
			ЭлементПользовательскихНастроек = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
			ЭлементПользовательскихНастроек.ИдентификаторПользовательскойНастройки = "Отбор";
		КонецЕсли;
		
		ЭлементОтбора = ЭлементПользовательскихНастроек.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭксплуатацияВРКдо1апреля1999г");
		ЭлементОтбора.ПравоеЗначение = ЭксплуатацияВРКдо1апреля1999г;
		
	КонецЕсли;
	
	Если Найти(ИмяЯчейки ,"П0001100090")> 0 Тогда
		
		Если ЭлементПользовательскихНастроек = Неопределено Тогда
			ЭлементПользовательскихНастроек = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
			ЭлементПользовательскихНастроек.ИдентификаторПользовательскойНастройки = "Отбор";
		КонецЕсли;
		
		ГруппаОтбораИЛИ = ЭлементПользовательскихНастроек.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбораИЛИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		
		ГруппаОтбораИ = ГруппаОтбораИЛИ.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		
		ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЕдиницаИзмерения");
		ЭлементОтбора.ПравоеЗначение = "251";
		
		ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НалоговаяБаза");
		ЭлементОтбора.ПравоеЗначение = 75;
		
		ГруппаОтбораИ = ГруппаОтбораИЛИ.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		
		ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЕдиницаИзмерения");
		ЭлементОтбора.ПравоеЗначение = "251";
		
		ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НалоговаяБаза");
		ЭлементОтбора.ПравоеЗначение = 55;
		
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100100")> 0 Тогда
		
		Если ЭлементПользовательскихНастроек = Неопределено Тогда
			ЭлементПользовательскихНастроек = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
			ЭлементПользовательскихНастроек.ИдентификаторПользовательскойНастройки = "Отбор";
		КонецЕсли;
		
		ГруппаОтбораИЛИ = ЭлементПользовательскихНастроек.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбораИЛИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		
		ГруппаОтбораИ = ГруппаОтбораИЛИ.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		
		ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЕдиницаИзмерения");
		ЭлементОтбора.ПравоеЗначение = "251";
		
		ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НалоговаяБаза");
		ЭлементОтбора.ПравоеЗначение = 75;
		
		ГруппаОтбораИ = ГруппаОтбораИЛИ.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		
		ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЕдиницаИзмерения");
		ЭлементОтбора.ПравоеЗначение = "251";
		
		ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НалоговаяБаза");
		ЭлементОтбора.ПравоеЗначение = 55;
		
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100150")> 0
		ИЛИ Найти(ИмяЯчейки ,"П0001100160")> 0
		ИЛИ Найти(ИмяЯчейки ,"П0001100170")> 0
		ИЛИ Найти(ИмяЯчейки ,"П0001100180")> 0
		ИЛИ Найти(ИмяЯчейки ,"П0001100190")> 0
		ИЛИ Найти(ИмяЯчейки ,"П0001100200")> 0
		ИЛИ Найти(ИмяЯчейки ,"П0001100210")> 0 Тогда
		
		Если ЭлементПользовательскихНастроек = Неопределено Тогда
			ЭлементПользовательскихНастроек = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
			ЭлементПользовательскихНастроек.ИдентификаторПользовательскойНастройки = "Отбор";
		КонецЕсли;
		
		ГруппаОтбораИЛИ = ЭлементПользовательскихНастроек.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбораИЛИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		
		ЭлементОтбора = ГруппаОтбораИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаВвозаНаТерриториюРК");
		ЭлементОтбора.ПравоеЗначение = Дата("20131231");
		
		ГруппаОтбораИ = ГруппаОтбораИЛИ.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		
		ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаВыпуска");
		ЭлементОтбора.ПравоеЗначение = Дата("20131231");
		
		ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтранаПроизводитель");
		ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Справочник.СтраныМира.Казахстан");
		
	ИначеЕсли Найти(ИмяЯчейки ,"П0001100220")> 0
		ИЛИ Найти(ИмяЯчейки ,"П0001100230")> 0
		ИЛИ Найти(ИмяЯчейки ,"П0001100240")> 0
		ИЛИ Найти(ИмяЯчейки ,"П0001100250")> 0
		ИЛИ Найти(ИмяЯчейки ,"П0001100260")> 0 Тогда
		
		Если ЭлементПользовательскихНастроек = Неопределено Тогда
			ЭлементПользовательскихНастроек = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
			ЭлементПользовательскихНастроек.ИдентификаторПользовательскойНастройки = "Отбор";
		КонецЕсли;
		
		ГруппаОтбораИЛИ = ЭлементПользовательскихНастроек.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбораИЛИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		
		ЭлементОтбора = ГруппаОтбораИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаВвозаНаТерриториюРК");
		ЭлементОтбора.ПравоеЗначение = Дата("20131231");
		
		ГруппаОтбораИ = ГруппаОтбораИЛИ.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		
		ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаВыпуска");
		ЭлементОтбора.ПравоеЗначение = Дата("20131231");
		
		ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтранаПроизводитель");
		ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Справочник.СтраныМира.Казахстан");
		
	ИначеЕсли Найти(ИмяЯчейки ,"П0001200270")> 0
		ИЛИ Найти(ИмяЯчейки ,"П0001200300")> 0 Тогда
		
		ПроверочнаяДата =  Дата(Год(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), 07, 01);
		ПроверочнаяДата = ДобавитьМесяц(ПроверочнаяДата,(-1)*(5*12));
		
		Если ЭлементПользовательскихНастроек = Неопределено Тогда
			ЭлементПользовательскихНастроек = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
			ЭлементПользовательскихНастроек.ИдентификаторПользовательскойНастройки = "Отбор";
		КонецЕсли;
		
		ЭлементОтбора = ЭлементПользовательскихНастроек.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаВыпуска");
		ЭлементОтбора.ПравоеЗначение = ПроверочнаяДата;
		
	ИначеЕсли Найти(ИмяЯчейки ,"П0001200280")> 0
		ИЛИ Найти(ИмяЯчейки ,"П0001200310")> 0 Тогда
		
		ПроверочнаяДата =  Дата(Год(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), 07, 01);
		ПроверочнаяДатаНиз = ДобавитьМесяц(ПроверочнаяДата,(-1)*(15*12));
		ПроверочнаяДатаВерх  = ДобавитьМесяц(ПроверочнаяДата,(-1)*(5*12));
		
		Если ЭлементПользовательскихНастроек = Неопределено Тогда
			ЭлементПользовательскихНастроек = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
			ЭлементПользовательскихНастроек.ИдентификаторПользовательскойНастройки = "Отбор";
		КонецЕсли;
		
		ГруппаОтбораИ = ЭлементПользовательскихНастроек.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		
		ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаВыпуска");
		ЭлементОтбора.ПравоеЗначение = ПроверочнаяДатаВерх;
		
		ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаВыпуска");
		ЭлементОтбора.ПравоеЗначение = ПроверочнаяДатаНиз;
		
		
	ИначеЕсли Найти(ИмяЯчейки ,"П0001200290")> 0
		ИЛИ Найти(ИмяЯчейки ,"П0001200320")> 0 Тогда
		
		ПроверочнаяДата =  Дата(Год(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), 07, 01);
		ПроверочнаяДата = ДобавитьМесяц(ПроверочнаяДата,(-1)*(15*12));
		
		Если ЭлементПользовательскихНастроек = Неопределено Тогда
			ЭлементПользовательскихНастроек = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
			ЭлементПользовательскихНастроек.ИдентификаторПользовательскойНастройки = "Отбор";
		КонецЕсли;
		
		ЭлементОтбора = ЭлементПользовательскихНастроек.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаВыпуска");
		ЭлементОтбора.ПравоеЗначение = ПроверочнаяДата;
		
	ИначеЕсли Найти(ИмяЯчейки ,"П0001200330")> 0 Тогда
		
		Если ЭлементПользовательскихНастроек = Неопределено Тогда
			ЭлементПользовательскихНастроек = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
			ЭлементПользовательскихНастроек.ИдентификаторПользовательскойНастройки = "Отбор";
		КонецЕсли;
		
		ГруппаОтбораИЛИ = ЭлементПользовательскихНастроек.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбораИЛИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		
		ЭлементОтбора = ГруппаОтбораИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КодВидаТранспортногоСредства");
		ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.ЖелезнодорожныйТяговыйПодвижнойСостав");
		
		ЭлементОтбора = ГруппаОтбораИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КодВидаТранспортногоСредства");
		ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСредств.МотороВагонныйПодвижнойСостав");
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОчиститьТекущуюСтраницу(Команда)
	
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьТекущийЭкземплярМногостраничногоРаздела" + Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекущийРаздел(Команда)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтчет(Команда)
	
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьВесьОтчет");
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(ВыполняемоеОповещение = Неопределено) Экспорт
	
	РегламентированнаяОтчетностьКлиент.Очистить(ЭтаФорма, ВыполняемоеОповещение);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере() Экспорт
	
	СтруктураДанныхФорма700Страница1.Очистить();
	СтруктураДанныхФорма700Страница2.Очистить();
	СтруктураДанныхФорма700_01Страница1.Очистить();
	СтруктураДанныхФорма700_01Страница2.Очистить();
	СтруктураДанныхФорма700_02Страница1.Очистить();
	СтруктураДанныхФорма700_02Страница2.Очистить();
	СтруктураДанныхФорма700_02Страница3.Очистить();
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	ОчиститьТабличноеПолеНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма700Страница1", 1);
	
	НачальныеОперацииСМногострочнымиБлоками();

	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОчисткаРегламентированногоОтчетаНаСервере(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаСервере(ИмяСтраницы);
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаРегламентированногоОтчетаНаКлиенте(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаКлиенте(ИмяСтраницы);
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
	ОткрытьФормуВыбораСтраниц("ВыбратьДляНастройки");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраниц(ВариантВыбора)
	Перем ТекущийРазделОтчетаСокрНаим;
	Перем НомерСтраницыРазделаОтчета;
	
	// Запоминаем текущий раздел, установленный в дереве разделов отчета.
	Если НЕ Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		ТекущийРазделОтчетаСокрНаим = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
		НомерСтраницыРазделаОтчета  = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	КонецЕсли;
	
	мПараметры = Новый Структура;
	мПараметры.Вставить("Автосохранение", Ложь);
	мПараметры.Вставить("мАвтоВыборКодов", Ложь);
	мПараметры.Вставить("ЗначенияИзСписка", Ложь);
	мПараметры.Вставить("ОтключитьАвтоРасчет", Ложь);
	мПараметры.Вставить("СчетчикСтраниц", Ложь);
	мПараметры.Вставить("ПараметрыОтображенияСумм", Ложь);
	мПараметры.Вставить("ИмеетсяРеквизитДеревоВыбранныхСтраниц", Истина);
	мПараметры.Вставить("Выгрузка", Истина);
	мПараметры.Вставить("ИмяОтчета", ИмяОтчета(ЭтаФорма.ИмяФормы));
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("мПараметры",                              мПараметры);
	ПараметрыФормы.Вставить("НалоговыйКомитет", 		    НалоговыйКомитетФорма);
	
	ФормаНастройкиОтчета = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("НастройкиОтчета", ПараметрыФормы, ЭтаФорма);
	
	ПодготовитьДеревоСтраницДляНастройки();
	
	КопироватьДанныеФормы(мДеревоВыбранныхСтраниц, ФормаНастройкиОтчета.Дерево);
	
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
	
	ЗначениеЕдИзм       = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	ЗначениеЗпт         = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;
	
	ДополнительныеПараметры = Новый Структура("ЗначениеАвторасчета, ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим", , ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуВыбораСтраницЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ФормаНастройкиОтчета.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаНастройкиОтчета.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаНастройкиОтчета.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьДеревоСтраницДляНастройки()
	
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
	ДеревоСтраниц = РеквизитФормыВЗначение("мДеревоСтраницОтчета");
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма700Страница1";
	СтрокаУровня1.Представление            = "Форма 700.00";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма700Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма700_01Страница1";
	СтрокаУровня1.Представление            = "Форма 700.01";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма700_01Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма700_02Страница1";
	СтрокаУровня1.Представление            = "Форма 700.02";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма700_02Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраницЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	//ЗначениеАвторасчета = ДополнительныеПараметры.ЗначениеАвторасчета;
	ЗначениеЕдИзм = ДополнительныеПараметры.ЗначениеЕдИзм;
	ЗначениеЗпт = ДополнительныеПараметры.ЗначениеЗпт;
	НомерСтраницыРазделаОтчета = ДополнительныеПараметры.НомерСтраницыРазделаОтчета;
	ТекущийРазделОтчетаСокрНаим = ДополнительныеПараметры.ТекущийРазделОтчетаСокрНаим;
	
	//СформироватьПодменюПечать(ЭтаФорма);
	Модифицированность = Истина;
	
	флЗначенияИдентичны = Истина;
	
	флЗначенияИдентичны = ПеренестиДанныеДереваСтраниц();
	
	Если НЕ флЗначенияИдентичны Тогда
		
		СформироватьДеревоРазделовОтчетаНаКлиенте();
		
		Если НЕ ТекущийРазделОтчетаСокрНаим = Неопределено Тогда
			
			// Пытаемся найти ранее запомненный раздел.
			НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(РазделыОтчета.ПолучитьЭлементы(), "КолонкаРазделыОтчетаСокрНаим", ТекущийРазделОтчетаСокрНаим);
			
			Если НЕ НайденнаяСтрока = Неопределено 
				И НЕ НомерСтраницыРазделаОтчета = Неопределено 
				И НайденнаяСтрока.ПолучитьЭлементы().Количество() > 0 Тогда
				
				НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(НайденнаяСтрока.ПолучитьЭлементы(), "КолонкаНомерСтраницыРазделаОтчета", НомерСтраницыРазделаОтчета);
				
			КонецЕсли;
			
			// В случае успешного поиска, устанавливаем курсор на найденный раздел.
			Если НЕ НайденнаяСтрока = Неопределено Тогда
				Элементы.РазделыОтчета.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПеренестиДанныеДереваСтраниц()
	
	флЗначенияИдентичны = Истина;
	
	ДеревоВыбСтраниц = РеквизитФормыВЗначение("мДеревоВыбранныхСтраниц");
	
	Для Каждого ЭлементДерева Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		Строка = ДеревоВыбСтраниц.Строки.Найти(Лев(ЭлементДерева.Представление,12),"Представление");
		
		Если ЭлементДерева.ПоказатьСтраницу <> ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1) Тогда
			
			флЗначенияИдентичны = Ложь;
			
		КонецЕсли;
		
		ЭлементДерева.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
		ЭлементДерева.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
		ЭлементДерева.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
		
	КонецЦикла;
	
	Возврат флЗначенияИдентичны;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьАвто(Команда) Экспорт
	Отказ = Ложь;
	
	ОчиститьСообщения();
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоПредупредитьОСохранении", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередЗаполнениемРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьАвтоПредупредитьОСохранении(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоСохранениеОтчета", ЭтотОбъект, ДополнительныеПараметры);
	
	ТекстВопроса = НСтр("ru = 'Автоматическое заполнение приведет к сохранению отчета с новыми данными. Заполнить отчет?'");
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Заполнить", "Заполнить и сохранить");
	Кнопки.Добавить("НеЗаполнять", "Не заполнять");
	
	КнопкаПоУмолчанию = "НеЗаполнять";
	
	ЗаголовокВопроса = НСтр("ru = 'Автоматическое заполнение отчета'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , КнопкаПоУмолчанию, ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоСохранениеОтчета(ОтветПользователя, ДополнительныеПараметры) Экспорт
	
	Если ОтветПользователя <> "Заполнить" Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураРеквизитовФормы.УспешноеАвтозаполнение = Ложь;

	ОписаниеОповещения = Новый ОписаниеОповещения(
	"ЗаполнитьАвтоПослеСохранениеОтчета", 
	ЭтотОбъект, 
	ДополнительныеПараметры); 
	
	СохранитьНаКлиенте(,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоПослеСохранениеОтчета(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаданиеВыполнено = ЗаполнитьАвтоНаСервере();
	
	Если ЗаданиеВыполнено Тогда
		
		СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
		
		РегламентированнаяОтчетностьКлиент.ОбновитьДеревоРазделовВФормеОтчета(ЭтаФорма);
		
		Если Элементы.РазделыОтчета.ТекущиеДанные <> Неопределено И НЕ Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
			Элементы.РазделыОтчета.ТекущаяСтрока = Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы()[0].ПолучитьИдентификатор();
		КонецЕсли;
		
		Если Элементы.Расшифровать.Видимость Тогда
			Элементы.Расшифровать.Доступность = Истина;
			//	Элементы.ТабличныйДокументКонтекстноеМенюРасшифровать.Доступность = Истина;
		КонецЕсли;
		
		//ЗапуститьПроверки();
		
	Иначе
		
		// Операция еще не завершена, выполняется с помощью фонового задания (асинхронно).
		ПараметрыОбработчикаОжидания = Новый Структура;
		ПараметрыОбработчикаОжидания.Вставить("МинимальныйИнтервал", 1);
		ПараметрыОбработчикаОжидания.Вставить("МаксимальныйИнтервал", 15);
		ПараметрыОбработчикаОжидания.Вставить("ТекущийИнтервал", 1);
		ПараметрыОбработчикаОжидания.Вставить("КоэффициентУвеличенияИнтервала", 1.4);
		
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		
		ФормаДлительнойОперации = ОткрытьФорму("ОбщаяФорма.ДлительнаяОперация", Новый Структура("ИдентификаторЗадания", СтруктураРеквизитовФормы.ИдентификаторЗадания), ЭтаФорма);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		
		Если ПроверитьВыполнениеЗадания() Тогда 
			
			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			
			СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
			
			РегламентированнаяОтчетностьКлиент.ОбновитьДеревоРазделовВФормеОтчета(ЭтаФорма);
			
			Если НЕ Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
				Элементы.РазделыОтчета.ТекущаяСтрока = Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы()[0].ПолучитьИдентификатор();
			КонецЕсли;
			
			Если Элементы.Расшифровать.Видимость Тогда
				Элементы.Расшифровать.Доступность = Истина;
				//Элементы.ТабличныйДокументКонтекстноеМенюРасшифровать.Доступность = Истина;
			КонецЕсли;
			
			//ЗапуститьПроверки();
			
			Возврат;
			
		КонецЕсли;
		
	Исключение
		
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение;
		
	КонецПопытки;
	
	ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.ТекущийИнтервал * ПараметрыОбработчикаОжидания.КоэффициентУвеличенияИнтервала;
	
	Если ПараметрыОбработчикаОжидания.ТекущийИнтервал > ПараметрыОбработчикаОжидания.МаксимальныйИнтервал Тогда
		ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.МаксимальныйИнтервал;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВыполнениеЗадания()
	
	Если ДлительныеОперации.ЗаданиеВыполнено(СтруктураРеквизитовФормы.ИдентификаторЗадания) Тогда 
		
		РегламентированнаяОтчетностьУПК.ФоновыеСообщенияПользователю(СтруктураРеквизитовФормы.ИдентификаторЗадания, ЭтаФорма.УникальныйИдентификатор);

		ЗагрузитьПодготовленныеДанные();
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()
	
	СтруктураРеквизитовФормы.УспешноеАвтозаполнение = Истина;
	СтруктураРеквизитовФормы.ВерсияАвтозаполнения = "2018кв1";
	
	Контейнер = ПолучитьИзВременногоХранилища(СтруктураРеквизитовФормы.АдресВоВременномХранилище);
	
	Если ТипЗнч(Контейнер) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ВыпискаВЭлектронномВиде = Ложь;
	ПолучениеЭлектронномВиде = Ложь;
	
	Для Каждого ЭлементСтруктуры Из Контейнер Цикл
		ИмяЭлемента = ЭлементСтруктуры.Ключ;
		
		Если ИмяЭлемента = "Форма700_02Страница1_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0002100005);
			
		ИначеЕсли ИмяЭлемента = "Форма700_02Страница2_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0002200005);
			
		ИначеЕсли ИмяЭлемента = "Форма700_02Страница3_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0002300005);
			
		Иначе
			ЭтаФорма["СтруктураДанных" + ИмяЭлемента] = ЭлементСтруктуры.Значение;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВывестиМакетВТаблДокНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	РасчетНаСервере("Форма700Страница1", "");
	РасчетНаСервере("Форма700Страница2", "");
	РасчетНаСервере("Форма700_01Страница1", "");
	РасчетНаСервере("Форма700_01Страница2", "");
	РасчетНаСервере("Форма700_02Страница1", "");
	РасчетНаСервере("Форма700_02Страница2", "");
	РасчетНаСервере("Форма700_02Страница2", "");
		
	Модифицированность = Ложь;
	
	Сохранить();
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьАвтоНаСервере()
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	СтруктураРеквизитовФормы.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	СтруктураРеквизитовФормы.АдресВременногоХранилищаРасшифровки = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("Организация",              СтруктураРеквизитовФормы.Организация);
	ПараметрыОтчета.Вставить("мДатаНачалаПериодаОтчета", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	ПараметрыОтчета.Вставить("мДатаКонцаПериодаОтчета",  СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	ПараметрыОтчета.Вставить("НалоговыйКомитет",		 СтруктураРеквизитовФормы.НалоговыйКомитет);
	ПараметрыОтчета.Вставить("УникальныйИдентификаторФормы", ЭтаФорма.УникальныйИдентификатор);
	ПараметрыОтчета.Вставить("АдресВоВременномХранилище", СтруктураРеквизитовФормы.АдресВоВременномХранилище);
	ПараметрыОтчета.Вставить("АдресВременногоХранилищаРасшифровки", СтруктураРеквизитовФормы.АдресВременногоХранилищаРасшифровки);
	
	Контейнер = Новый Структура();
	Контейнер.Вставить("Форма700Страница1", СтруктураДанныхФорма700Страница1);
	Контейнер.Вставить("Форма700Страница2", СтруктураДанныхФорма700Страница2);
	Контейнер.Вставить("Форма700_01Страница1", СтруктураДанныхФорма700_01Страница1);
	Контейнер.Вставить("Форма700_01Страница2", СтруктураДанныхФорма700_01Страница2);
	Контейнер.Вставить("Форма700_02Страница1", СтруктураДанныхФорма700_02Страница1);
	Контейнер.Вставить("Форма700_02Страница1_ДанныеДопСтрок", ДанныеФормыВЗначение(П0002100005, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма700_02Страница2", СтруктураДанныхФорма700_02Страница2);
	Контейнер.Вставить("Форма700_02Страница2_ДанныеДопСтрок", ДанныеФормыВЗначение(П0002200005, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма700_02Страница3", СтруктураДанныхФорма700_02Страница3);
	Контейнер.Вставить("Форма700_02Страница3_ДанныеДопСтрок", ДанныеФормыВЗначение(П0002300005, Тип("ТаблицаЗначений")));
		
	ЗаданиеВыполнено = Ложь;
	
	НаименованиеЗадания = НСтр("ru = 'Автоматическое заполнение по данным информационной базы'");
	
	ПараметрыЗаполнения = Новый Массив;
	ПараметрыЗаполнения.Добавить(ИмяОтчета(ЭтаФорма.ИмяФормы));
	ПараметрыЗаполнения.Добавить(ИмяФормыОтчета(ЭтаФорма.ИмяФормы));
	ПараметрыЗаполнения.Добавить(ПараметрыОтчета);
	ПараметрыЗаполнения.Добавить(Контейнер);
	
	Если ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая Тогда
		ВремяОжидания = 4;
	Иначе
		ВремяОжидания = 2;
	КонецЕсли;
	
	Задание = ФоновыеЗадания.Выполнить("РегламентированнаяОтчетностьПереопределяемый.ЗаполнитьОтчет", ПараметрыЗаполнения, , НаименованиеЗадания);
	
	Попытка
		Задание.ОжидатьЗавершения(ВремяОжидания);
	Исключение
		// Специальная обработка не требуется. Предположительно, исключение вызвано истечением времени ожидания.
	КонецПопытки;
	
	СтруктураРеквизитовФормы.ИдентификаторЗадания = Задание.УникальныйИдентификатор;
	
	// Если операция уже завершилась, то сразу обрабатываем результат.
	Если ДлительныеОперации.ЗаданиеВыполнено(Задание.УникальныйИдентификатор) Тогда
		
		РегламентированнаяОтчетностьУПК.ФоновыеСообщенияПользователю(Задание.УникальныйИдентификатор, ЭтаФорма.УникальныйИдентификатор);

		ЗаданиеВыполнено = Истина;
		
		ЗагрузитьПодготовленныеДанные();
		
	КонецЕсли;
	
	ЗаполнитьСведенияОбОрганизацииНаСервере();
	НачальныеОперацииСМногострочнымиБлоками();
	
	Возврат ЗаданиеВыполнено;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПустыеСтруктурыДанных()
	
	СохрТабличныйДокумент = Новый ТабличныйДокумент;
	
	СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		ИмяГруппы = ЭлементСтруктуры.Ключ;
		СтруктураГруппы = ЭтаФорма[ЭлементСтруктуры.Значение];
		СтруктураГруппы.Очистить();
	КонецЦикла;
	
	Для Каждого Раздел Из мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
		
		ТабличныйДокумент.Очистить();
		ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + Раздел.ИмяСтраницы));
		
		СохранитьДанныеРаздела(Раздел.ИмяСтраницы);
		
	КонецЦикла;
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Если Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	Оповещение = Новый ОписаниеОповещения("ПослеСохраненияФормыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	СохранитьНаКлиенте(, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиенте(Автосохранение = Ложь, ВыполняемоеОповещение = Неопределено) Экспорт
	
	
	Вариант = СтруктураРеквизитовФормы.ВидДокумента;
	
	Если НЕ РегламентированнаяОтчетностьКлиент.ПриЗаписиРегламентированногоОтчетаНаКлиенте(ЭтаФорма, , Автосохранение, Вариант) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатСохранения = ПередСохранением();
	
	ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения);
	
КонецПроцедуры

&НаСервере
Функция ПередСохранением()
	
	Возврат Сохранить();
	
КонецФункции

&НаСервере
Функция Сохранить()
	
	Если НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.ПолучитьОбъект();
	КонецЕсли;
	
	Если НЕ РегламентированнаяОтчетность.ПриЗаписиРегламентированногоОтчетаНаСервере(ЭтаФорма, , ,СтруктураРеквизитовФормы.ВидДокумента, , СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ИсточникОтчета           = Метаданные.Отчеты[Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7)].Имя;
	СтруктураРеквизитовФормы.мСохраненныйДок.НаименованиеОтчета       = Метаданные.Отчеты[Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7)].ОсновнаяФорма.Синоним;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаНачала               = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаОкончания            = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.Периодичность            = СтруктураРеквизитовФормы.мПериодичность;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВыбраннаяФорма           = СтруктураРеквизитовФормы.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок.Организация              = СтруктураРеквизитовФормы.Организация;
	СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий              = Комментарий;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаПодписи              = ТекущаяДата(); 
	СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения         = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВидОтчетности            = Перечисления.ВидыОтчетности.РегламентированнаяОтчетность;
	СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий              = Комментарий;
	СтруктураРеквизитовФормы.мСохраненныйДок.КодНалоговогоОргана      = ?(СтруктураРеквизитовФормы.Организация.РегистрацияВНалоговомОргане = Неопределено,"",СтруктураРеквизитовФормы.Организация.РегистрацияВНалоговомОргане.Код);
	СтруктураРеквизитовФормы.мСохраненныйДок.КПП                      = "";
	СтруктураРеквизитовФормы.мСохраненныйДок.Вид                      = СтруктураРеквизитовФормы.ВидДокумента;
	СтруктураРеквизитовФормы.мСохраненныйДок.ПредставлениеВида        = РегламентированнаяОтчетность.ПредставлениеВидаДокумента(СтруктураРеквизитовФормы.мСохраненныйДок.Вид);
	СтруктураРеквизитовФормы.мВариант                                 = СтруктураРеквизитовФормы.ВидДокумента;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ФорматВыгрузки = "Автоматически";
	//сохранение данных текущего раздела
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела,Ложь);
	
	// формируем данные редактируемых ячеек таблицы
	ПоказателиОтчета = Новый Структура();
	
	ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета);
	// формируем список сохранения
	СписокСохранения = Новый Структура();
	
	// вставляем данные редактируемых ячеек таблицы
	СписокСохранения.Вставить("ПоказателиОтчета", 		 ПоказателиОтчета);
	СписокСохранения.Вставить("НалоговыйКомитет", 		 НалоговыйКомитетФорма);
	
	МассивТиповНеопределено = Новый Массив;
	МассивТиповНеопределено.Добавить(Тип("Неопределено"));
	ОписаниеТиповНеопределено = Новый ОписаниеТипов(МассивТиповНеопределено);
	
	ДанныеМногострочныхРазделов = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		
		ДанныеМногострочныхРазделов.Вставить(ЭлементСтруктуры.Ключ, ДанныеФормыВЗначение(ЭтаФорма[ЭлементСтруктуры.Значение], Тип("ТаблицаЗначений")));
		
	КонецЦикла;
	
	СписокСохранения.Вставить("ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов);
	
	ХранилищеДанных = Новый ХранилищеЗначения(СписокСохранения);
	СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета = ХранилищеДанных;
	
	Попытка
		СтруктураРеквизитовФормы.мСохраненныйДок.Записать();
	Исключение
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецПопытки;
	Модифицированность = Ложь;
	
	СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения)
	
	КлючУникальности = СтруктураРеквизитовФормы.мСохраненныйДок;
	
	Если РезультатСохранения Тогда
		
		РегламентированнаяОтчетностьКлиент.ПослеЗаписиРегламентированногоОтчета(ЭтаФорма);
		
		Если ВыполняемоеОповещение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ВыполняемоеОповещение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСохраненияФормыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.Форма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета)
	
	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		ПоказателиОтчета.Вставить(Префикс + Раздел.ИмяСтраницы, ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы]);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБланк(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБланкЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Команда = ДополнительныеПараметры.Команда;
	
	Если Команда <> Неопределено Тогда
		Печать(Команда.Имя);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьСразу(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьСразуЗавершение (Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Команда = ДополнительныеПараметры.Команда;
	
	ДополнительныеПараметрыПечати = Новый Структура;
	ДополнительныеПараметрыПечати.Вставить("ВидПечати", Команда.Имя);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПечатьЗавершение", ЭтотОбъект, ДополнительныеПараметрыПечати);
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
		
	Иначе
		
		СохранитьНаКлиенте(, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(ВидПечати, НеИзФормыОтчета = Ложь) Экспорт
	
	Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1. Формируется печатная форма...'"), ЭтаФорма.Заголовок), , , БиблиотекаКартинок.Печать);
	
	Если СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки <> Неопределено И СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки Тогда
		РегламентированнаяОтчетностьКлиент.ПроверитьКонтрольныеСоотношения(ЭтаФорма, ОбработкаКС);
	КонецЕсли;
	
	Если НЕ ПечатьНаСервере(ВидПечати) Тогда
		Возврат;
	КонецЕсли;
	
	
	ОбщиеРеквизитыРазделов = Новый Структура;
	
	
	РегламентированнаяОтчетностьКлиент.ОткрытьФормуПредварительногоПросмотра(ЭтаФорма, ВидПечати, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере(ВидПечати)
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	Раздел = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	СтруктураРеквизитовФормы.мПечатныеФормы.Очистить();
	СтруктураРеквизитовФормы.мРежимПечати = Истина;
	
	Для Каждого ЭлеменетДерева Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		Если ЭлеменетДерева.ВыводНаПечать = 1 Тогда
			
			ВывестиМакетСтраницыВТабличныйДокументНаСервере(ЭлеменетДерева.ИмяСтраницы);
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("НаименованиеЛиста",  ЭлеменетДерева.Представление);
			СтруктураПараметров.Вставить("ОриентацияЛиста",    ЭлеменетДерева.ОриентацияСтраницы);
			СтруктураПараметров.Вставить("ИмяСтраницы",        ЭлеменетДерева.ИмяСтраницы);
			Структурапараметров.Вставить("ИмяОбластиТаблПоля", "ТабличныйДокумент");
			СтруктураПараметров.Вставить("ВидПечати",          ВидПечати);
			
			РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, СтруктураПараметров, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(Раздел);
	
	РегламентированнаяОтчетностьКлиентСервер.ПроставлениеНомеровЛистов(ЭтаФорма, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	РегламентированнаяОтчетностьКлиент.ПередЗакрытиемРегламентированногоОтчета(ЭтаФорма, Отказ, СтандартнаяОбработка,ЗавершениеРаботы, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПриЗакрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	РегламентированнаяОтчетность.ПриЗакрытииРегламентированногоОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка);
	
	Если СтрЧислоВхождений(Область.Имя, "ДобавитьСтроку") > 0 Тогда
		ДобавитьСтроку("");
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "УдалитьСтроку") > 0 И Область.Гиперссылка Тогда
		УдалитьСтроку("");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	#Если ВебКлиент Тогда
		ВставитьДополнительнуюСтрокуНаСервере();
	#Иначе
		ВставитьДополнительнуюСтрокуНаКлиенте();
	#КонецЕсли
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура ВставитьДополнительнуюСтрокуНаСервере()
	
	ВставитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьДополнительнуюСтрокуНаКлиенте()
	
	ВставитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВставитьДополнительнуюСтроку(Форма, ИмяГруппыБлока = Неопределено, СпециальноеДобавление = Ложь, ИмяКолонкиНомера = Неопределено) Экспорт
	
	Перем СтруктураГруппы;
	Перем МаксимальноеКоличествоСтрокГруппы;
	
	Если ИмяГруппыБлока = Неопределено Тогда
		// Сначала выполним проверку на активную страницу панели формы,
		// которая содержит многострочный раздел
		#Если НаКлиенте Тогда
			ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		#Иначе
			ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		#КонецЕсли
		
		Если ИмяГруппы = Неопределено Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Не выбран многострочный раздел, в который необходимо добавить строку.'");
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли;
		
	Иначе
		ИмяГруппы = ИмяГруппыБлока;
	КонецЕсли;
	
	// Исходное количество строк группы
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, МаксимальноеКоличествоСтрокГруппы);
	
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = Форма[СтруктураГруппы];
	
	// определяем последнюю строку многострочной группы
	КолСтрок = СтруктураГруппы.Количество();
	КолСтрокСтр = Формат(КолСтрок, "ЧГ=");
	
	Если Не ЗначениеЗаполнено(КолСтрокСтр) Тогда 
		КолСтрокСтр = 1;
	КонецЕсли;

	ИмяПервойЯчейкиПоследнейСтроки = ИмяГруппы + "01_" + КолСтрокСтр;
	
	// область первой ячейки последней строки многострочного раздела
	ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяПервойЯчейкиПоследнейСтроки];
	
	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// номера строк исходной области
	НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;
	НомерНижнЯчейкиОбласти = ОбластьЯчейки.Верх + ВысотаСтроки - 1;
	
	СдвигСтрок = НомерНижнЯчейкиОбласти - НомерВерхЯчейкиОбласти + 1;
	
	// номера строк вставляемой области
	НомерВерхЯчейкиНовойОбласти = НомерВерхЯчейкиОбласти + СдвигСтрок;
	НомерНижнЯчейкиНовойОбласти = НомерНижнЯчейкиОбласти + СдвигСтрок;
	
	НазначитьИмяОбластиМЧ = Ложь;
	ВставляемаяОбласть = ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, );
	Если СтрНайти(ВставляемаяОбласть.Имя, "МногострочнаяЧасть") Тогда
		НазначитьИмяОбластиМЧ = Истина;
		ИмяМногострочнойЧасти = ВставляемаяОбласть.Имя;
	КонецЕсли;
	
	Если НЕ СпециальноеДобавление Тогда
		
		РегламентированнаяОтчетностьВызовСервера.ВставитьОбластьВТабличныйДокумент(ТекТабличноеПоле, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
		
		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
	КонецЕсли;
	
	Если НазначитьИмяОбластиМЧ Тогда
		ТекТабличноеПоле.Область(НомерНижнЯчейкиОбласти + 1, , НомерНижнЯчейкиОбласти + (НомерНижнЯчейкиОбласти - НомерВерхЯчейкиОбласти) + 1, ).Имя = "";
		ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, ).Имя = ИмяМногострочнойЧасти;
	КонецЕсли;
	
	КолСтрокСтр1 = Формат(КолСтрок + 1, "ЧГ=");
	
	Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
		
		ИмяКолонки = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
		
		
		// переопределяем имена вставленной области
		Если СтруктураГруппы[0].Свойство(ИмяКолонки) Тогда
			
			ИмяОбластиЯчейки    = ИмяКолонки + "_" + КолСтрокСтр;
			ИмяНовОбластиЯчейки = ИмяКолонки + "_" + КолСтрокСтр1;
			
			ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяОбластиЯчейки];
			ОбластьЯчейки.Имя = ИмяНовОбластиЯчейки;
			
			Если (НомерГрафы = 1) Тогда
				ТекТабличноеПоле.Области["УдалитьСтроку" + ИмяОбластиЯчейки].Имя = "УдалитьСтроку" + ИмяНовОбластиЯчейки;
			КонецЕсли;
			
			// определяем границы ячейки исходной области
			НомерВерхСтрокиЯчейки  = ОбластьЯчейки.Верх - СдвигСтрок;
			НомерНижнСтрокиЯчейки  = ОбластьЯчейки.Низ  - СдвигСтрок;
			НомерЛевоКолонкиЯчейки = ОбластьЯчейки.Лево;
			НомерПравКолонкиЯчейки = ОбластьЯчейки.Право;
			
			// Назначаем имя ячейки исходной области,
			// (т.к. в результате вставки новой области оно было очищено)
			ОбластьЯчейкиИсходнойОбласти = ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки, НомерНижнСтрокиЯчейки, НомерПравКолонкиЯчейки);
			ОбластьЯчейкиИсходнойОбласти.Имя = ИмяОбластиЯчейки;
			
			Если (НомерГрафы = 1) Тогда
				
				ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки - 1, НомерНижнСтрокиЯчейки, НомерЛевоКолонкиЯчейки - 1).Имя  = "УдалитьСтроку" + ИмяОбластиЯчейки;
				
			КонецЕсли;
			
			// очищаем значения ячеек вставленной области
			Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
				ОбластьЯчейки.Очистить();
			КонецЕсли;
			
			Если ИмяКолонкиНомера <> Неопределено Тогда
				Если ИмяКолонкиНомера = ИмяКолонки Тогда
					Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
						ОбластьЯчейки.Значение = КолСтрокСтр1;
					Иначе
						ОбластьЯчейки.Текст = КолСтрокСтр1;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИмяГруппыБлока = Неопределено Тогда
		
		
		ИмяТекущейОбласти = ИмяГруппы + "01_" + КолСтрокСтр1;
		
		Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];
		
		// установим фокус на поле табличн. документа
		ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
		
	КонецЕсли;
	
	// добавляем в структуру многострочной группы новую строку
	ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,Форма);
	
	//ПрописатьФункцию добавления по всем страницам приложения
	
	Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
		Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
			ОбластьТД.Гиперссылка = Истина;
			ОбластьТД.Текст = "х";
		КонецЕсли;
	КонецЦикла;
	
	Форма.Модифицированность = Истина;
	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы, Форма)
	
	
	Если Число(Сред(ИмяГруппы,5,1)) = 2 Тогда
		
		СтруктураГруппы = Форма["П0002100005"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0002200005"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0002300005"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
	КонецЕсли;
	
	ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма, СтруктураГруппы.Количество(), Ложь);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма, НомерСтроки, УдалитьСтроку)
	
	
	Если УдалитьСтроку = Ложь Тогда
		ИндексПересчета = НомерСтроки - 2
	Иначе
		ИндексПересчета = НомерСтроки;
	КонецЕсли;
	
	Если Число(Сред(ИмяГруппы,5,1)) = 2 Тогда
		
		СтруктураГруппы = Форма["П0002100005"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000210000501 = Индекс + 5;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0002200005"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000220000501 = Индекс + 5;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0002300005"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000230000501 = Индекс + 5;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	
	ТекТабличноеПоле = ЭтаФорма["ТабличныйДокумент"];
	
	ТекущаяОбласть = ТекТабличноеПоле.ТекущаяОбласть;
	
	ИмяГруппы = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(ЭтаФорма, ТекущаяОбласть);
	
	Если ИмяГруппы = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не выбрана удаляемая строка многострочного раздела.'");
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьСтрокуЗавершение", ЭтотОбъект);
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Удалить выбранную строку?'"), Символы.ПС);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	#Если ВебКлиент Тогда
		УдалитьДополнительнуюСтрокуНаСервере();
	#Иначе
		УдалитьДополнительнуюСтрокуНаКлиенте();
	#КонецЕсли
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДополнительнуюСтрокуНаСервере()
	
	УдалитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДополнительнуюСтрокуНаКлиенте()
	
	УдалитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьДополнительнуюСтроку(Форма, СпециальноеДобавление = Ложь, ИмяКолонкиНомера = Неопределено) Экспорт
	
	Перем ИсходноеКоличествоСтрокГруппы;
	Перем СтруктураГруппы;
	
	ТекущаяСтраница = Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	ТекТабличноеПоле = Форма.ТабличныйДокумент;
	
	ТекущаяОбласть = Форма.Элементы["ТабличныйДокумент"].ТекущаяОбласть;
	
	#Если НаКлиенте ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		ИмяГруппы = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(Форма, ТекущаяОбласть);
	#Иначе
		ИмяГруппы = РегламентированнаяОтчетностьВызовСервера.РазделТекущейОбластиНаСервере(Форма, ТекущаяОбласть);
	#КонецЕсли
	
	// исходное количество строк группы
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
	
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = Форма[СтруктураГруппы];
	
	// Выполним также проверку вхождения текущей (выделенной) ячейки в многострочный раздел
	ТекущаяОбласть = Форма.Элементы["ТабличныйДокумент"].ТекущаяОбласть;
	
	ИмяЯчейки = ТекущаяОбласть.Имя;
	
	// номер строки многострочного раздела определим
	// по имени выделенной ячейки
	НомУдаляемойСтроки = Число(Сред(ИмяЯчейки, СтрНайти(ИмяЯчейки, "_") + 1));
	НомерСтрокиТаблицы = НомУдаляемойСтроки - 1; // нумерация строк в таблице значений начинается с нуля
	
	Если СтруктураГруппы.Количество() > ИсходноеКоличествоСтрокГруппы Тогда
		
		ИмяПервойЯчейкиУдаляемойСтроки = "УдалитьСтроку" + ИмяГруппы + "01_" + Формат(НомУдаляемойСтроки, "ЧГ=0");
		
		// область первой ячейки удаляемой строки многострочного раздела
		ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяПервойЯчейкиУдаляемойСтроки];
		
		НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
		ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
		
		НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;
		НомерНижнЯчейкиОбласти = ОбластьЯчейки.Верх + ВысотаСтроки - 1;
		
		МногострочностьВРазделе = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе");
		МногострочностьВРазделеТип = ТипЗнч(МногострочностьВРазделе);
		Если МногострочностьВРазделеТип = Тип("Число") Тогда
			ИмяОбластиМнгЧ = "МногострочнаяЧасть";
		ИначеЕсли МногострочностьВРазделеТип = Тип("ДанныеФормыКоллекция") Тогда
			ИмяОбластиМнгЧ = МногострочностьВРазделе.НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0].Область;
		КонецЕсли;
		// Найдем координаты области, для последующего восстановления.
		
		Если ТекТабличноеПоле.Области.Найти(ИмяОбластиМнгЧ) <> Неопределено Тогда
			ОбластьВерх = ТекТабличноеПоле.Области[ИмяОбластиМнгЧ].Верх;
			ОбластьНиз = ТекТабличноеПоле.Области[ИмяОбластиМнгЧ].Низ;
		КонецЕсли;
		
		Если СпециальноеДобавление Тогда
			
		Иначе
			
			РегламентированнаяОтчетностьВызовСервера.УдалитьОбластьИзТабличногоДокумента(ТекТабличноеПоле, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
			
			Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
			
		КонецЕсли;
		// Восстановим область.
		ТекТабличноеПоле.Область(ОбластьВерх, 0, ОбластьНиз, 0).Имя = ИмяОбластиМнгЧ;
		
		КолвоСдвигаемыхСтрок = СтруктураГруппы.Количество() - НомУдаляемойСтроки;
		
		// обновим имена ячеек сдвинутых строк
		Если КолвоСдвигаемыхСтрок > 0 Тогда
			
			Для НСтр = НомУдаляемойСтроки + 1 По СтруктураГруппы.Количество() Цикл
				
				ТекСтрока = СтруктураГруппы[НСтр - 1];
				
				НСтрСтр = Формат(НСтр, "ЧГ=0");
				НСтрСтр1 = Формат(НСтр - 1, "ЧГ=0");
				
				Для НомерГрафы = 0 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
					
					Если НомерГрафы = 0 Тогда
						
						КолонкаИмя = "УдалитьСтроку" + ИмяГруппы + Формат( 1, "ЧЦ=2; ЧВН=");
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ИмяКолонкиНомера <> Неопределено Тогда
							Если ИмяКолонкиНомера = КолонкаИмя Тогда
								// обновляем порядковый номер строки
								
								СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
								НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
								ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер;
								
								// обновляем значение элемента таблицы значений
								ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
					КолонкаИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
					
					Если СтруктураГруппы[0].Свойство(КолонкаИмя) Тогда
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ИмяКолонкиНомера <> Неопределено Тогда
							Если ИмяКолонкиНомера = КолонкаИмя Тогда
								// обновляем порядковый номер строки
								
								СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
								НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
								ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер;
								
								// обновляем значение элемента таблицы значений
								ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
		КонецЕсли;
		// обновляем структуру многострочного раздела
		
		//Процедура удаления по всем страницам приложения
		УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма);
		
	Иначе
		// строка не удаляется в форме табличного документа,
		// а должна осуществляться сдвиг строк
		
		// обновляем структуру многострочного раздела
		// методом удаления выбранной строки и добавления пустой строки
		
		//Процедура удаления по всем страницам приложения
		УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма);
		
		//Процедура удаления по всем страницам приложения
		ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,Форма);
		
		// обновляем порядковые номера строк, выводимых в табличный документ
		Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
			
			НомерСтрокиВТаблице = СтруктураГруппы.Индекс(СтрокаТаблицы);
			НомерСтрокиВФормеТаблицы = Формат(НомерСтрокиВТаблице + 1, "ЧГ=0");
			
			Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
				
				КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
				
				Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
					
					Если ИмяКолонкиНомера <> Неопределено Тогда
						Если ИмяКолонкиНомера = КолонкаТаблицыИмя Тогда
							// обновляем порядковый номер строки
							СтрокаТаблицы[КолонкаТаблицыИмя] = НомерСтрокиВФормеТаблицы;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;	
				
			КонецЦикла;
			
		КонецЦикла;
		
		// Данные в многострочном блоке обновляются в декларациях!
		// Форма.ОбновитьСтруктуруМногострочногоРаздела(ИмяГруппы);
		// Обновляем экранную форму табличного документа
		#Если НаКлиенте Тогда
			Форма.ВывестиРазделВТабличныйДокументНаКлиенте(ИмяГруппы, СтруктураГруппы);
		#Иначе
			Форма.ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппы, СтруктураГруппы);
		#КонецЕсли
		
	КонецЕсли;
	
	// назначим текущей областью таблицы первую редактируемую ячейку
	// удаленной строки, если ее порядковый номер меньше кол-ва строк
	// многострочного раздела, или последней строки раздела в противном случае
	
	// определяем текущую область таблицы
	НомТекущейСтроки = Мин(НомУдаляемойСтроки, СтруктураГруппы.Количество());
	
	ИмяТекущейОбласти = "УдалитьСтроку" + ИмяГруппы + "01_" + Формат(НомТекущейСтроки, "ЧГ=0");
	
	Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];
	
	// установим фокус на поле табличн. документа
	ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
	
	ЕстьДопСтроки = Ложь;
	
	Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
		Если СтрЧислоВхождений(ОбластьТД.Имя, "_2") > 0 Тогда
			ЕстьДопСтроки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьДопСтроки Тогда
		Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
			Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
				ОбластьТД.Гиперссылка = Ложь;
				ОбластьТД.Текст = "";
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Форма.Модифицированность = Истина;
	
	#Если НаКлиенте Тогда
		Форма.РасчетНаКлиенте(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	#Иначе
		Форма.РасчетНаСервере(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма)
	
	Если Число(Сред(ИмяГруппы,5,1)) = 2 Тогда
		
		СтруктураГруппы = Форма["П0002100005"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0002200005"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0002300005"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
	КонецЕсли;
	
	ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма,НомерСтрокиТаблицы, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка)
	
	ИмяЯчейки = Область.Имя;
	
	Если (Найти(ИмяЯчейки, "Первоначальная") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Очередная") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Дополнительная") > 0)
		ИЛИ (Найти(ИмяЯчейки, "ПоУведомлению") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Ликвидационная") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Признак") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Приложение") > 0) 
		ИЛИ (Найти(ИмяЯчейки, "П000210000503") > 0) 
		ИЛИ (Найти(ИмяЯчейки, "П000210000504") > 0) Тогда
		РасчетНаКлиенте(СтруктураРеквизитовФормы.НаимТекущегоРаздела,ИмяЯчейки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТабличноеПолеНаКлиенте(ВыбТабличноеПолеИмя) Экспорт
	
	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличноеПолеНаСервере(ВыбТабличноеПолеИмя) Экспорт
	
	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьТабличноеПоле(Форма, ВыбТабличноеПолеИмя)
	
	ВыбТабличноеПоле = Форма.ТабличныйДокумент;
	
	// Непосредственно очищаем ячейки табличного документа.
	Для Инд = 0 По ВыбТабличноеПоле.Области.Количество() - 1 Цикл
		ТекущаяОбласть = ВыбТабличноеПоле.Области[Инд];
		
		Если Не ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекущаяОбласть.СодержитЗначение <> Истина Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущаяОбласть.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СобратьДанныеТекущегоТаблПоляНаСервере(ИмяТабличногоПоля) Экспорт
	
	Возврат СобратьДанныеТекущегоТаблПоля(ЭтаФорма, ИмяТабличногоПоля);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СобратьДанныеТекущегоТаблПоля(Форма, ИмяТабличногоПоля)

	СтруктураДанныхПоля = Новый Структура;
	Для Каждого ТекущаяОбласть Из Форма[ИмяТабличногоПоля].Области Цикл
		Если СтрЧислоВхождений(Тип(ТекущаяОбласть), "Рисунок") = 0 И ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник И ТекущаяОбласть.СодержитЗначение = Истина Тогда
			СтруктураДанныхПоля.Вставить(ТекущаяОбласть.Имя, ТекущаяОбласть.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураДанныхПоля;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяОтчета(ЭтаФормаИмя)
	Форма_Имя = СтрЗаменить(ЭтаФормаИмя, "Внешний", "");
	Возврат Сред(Лев(Форма_Имя, СтрНайти(Форма_Имя, ".Форма.") - 1), 7);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяФормыОтчета(ЭтаФормаИмя)
	Возврат Сред(ЭтаФормаИмя, СтрНайти(ЭтаФормаИмя, ".Форма.") + 7);
КонецФункции

&НаКлиенте
Процедура ПечатьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Печать(ДополнительныеПараметры.ВидПечати);
	
КонецПроцедуры


&НаСервере
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы21", СтруктураРеквизитовФормы.мИдГруппы21);
	ИдГрупп.Вставить("мИдГруппы22", СтруктураРеквизитовФормы.мИдГруппы22);
	ИдГрупп.Вставить("мИдГруппы23", СтруктураРеквизитовФормы.мИдГруппы23);
	
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста, , ИдГрупп);
	
КонецФункции

&НаКлиенте
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы21", СтруктураРеквизитовФормы.мИдГруппы21);
	ИдГрупп.Вставить("мИдГруппы22", СтруктураРеквизитовФормы.мИдГруппы22);
	ИдГрупп.Вставить("мИдГруппы23", СтруктураРеквизитовФормы.мИдГруппы23);
	
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста, , ИдГрупп);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста = Неопределено, ТекущаяСтраница, ИдГрупп)
	
	Перем ИмяГруппы;
	
	Если ИмяЛиста = Неопределено Тогда
		ИмяТекущейСтраницыПанели = ТекущаяСтраница.Имя;
	Иначе
		ИмяТекущейСтраницыПанели = ИмяЛиста;
	КонецЕсли;
	
	Если ИмяТекущейСтраницыПанели = "Форма700_02Страница1" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы21;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма700_02Страница2" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы22;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма700_02Страница3" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы23;
	КонецЕсли;
	
	Возврат ИмяГруппы;
	
КонецФункции
