#Область СлужебныеПроцедурыИФункции

// Добавляет отбор в коллекцию отборов компоновщика или группы отборов
//
// Параметры:
//		ЭлементСтруктуры - элемент структуры
//		Поле             - имя поля, по которому добавляется отбор
//		Значение         - значение отбора
//		ВидСравнения     - вид сравнений компоновки данных (по умолчанию: вид сравнения)
//		Использование    - признак использования отбора (по умолчанию: истина)
//
Функция ДобавитьОтбор(ЭлементСтруктуры, Знач Поле, Значение = Неопределено, ВидСравнения = Неопределено, Использование = Истина, ВПользовательскиеНастройки = Ложь) Экспорт
	
	Если ТипЗнч(Поле) = Тип("Строка") Тогда
		Поле = Новый ПолеКомпоновкиДанных(Поле);
	КонецЕсли;
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		Отбор = ЭлементСтруктуры.Настройки.Отбор;
		
		Если ВПользовательскиеНастройки Тогда
			Для Каждого ЭлементНастройки Из ЭлементСтруктуры.ПользовательскиеНастройки.Элементы Цикл	
				Если ЭлементНастройки.ИдентификаторПользовательскойНастройки = ЭлементСтруктуры.Настройки.Отбор.ИдентификаторПользовательскойНастройки Тогда
					Отбор = ЭлементНастройки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("НастройкиКомпоновкиДанных") Тогда
		Отбор = ЭлементСтруктуры.Отбор;
	Иначе
		Отбор = ЭлементСтруктуры;
	КонецЕсли;
		
	Если ВидСравнения = Неопределено Тогда
		ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	НовыйЭлемент = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлемент.Использование  = Использование;
	НовыйЭлемент.ЛевоеЗначение  = Поле;
	НовыйЭлемент.ВидСравнения   = ВидСравнения;
	НовыйЭлемент.ПравоеЗначение = Значение;
	
	Возврат НовыйЭлемент;
	
КонецФункции

// Добавляет параметр компановки данных в переденый элемент структуры 
//
// Параметры:
//		ЭлементСтруктуры - элемент структуры (массив)
//		Поле             - имя поля, по которому добавляется параметр
//		Значение         - значение параметра
//		Использование    - признак использования параметра (по умолчанию: истина)
//
Процедура ДобавитьПараметр(ЭлементСтруктуры, Знач Поле, Значение, Использовать = Истина) Экспорт
	
	Если ТипЗнч(Поле) = Тип("Строка") Тогда
		Поле = Новый ПараметрКомпоновкиДанных(Поле);
	КонецЕсли;
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("Массив") Тогда
		СтруктураПараметра = Новый Структура("Параметр, Значение, Использование", Поле, Значение, Использовать);
		ЭлементСтруктуры.Добавить(СтруктураПараметра);
	КонецЕсли;
	
КонецПроцедуры

// Добавляет группировку данных в переденый элемент структуры 
//
// Параметры:
//		ЭлементСтруктуры - элемент структуры (массив)
//		Поле             - имя поля, по которому добавляется группировка
//		Представление    - представление параметра
//		Использование    - признак использования параметра (по умолчанию: истина)
//		ТипГруппировки    - тип группировки(строка), доступные значения : "Элементы","Иерархия","ТолькоИерархия" (по умолчанию: Элементы)
//
Процедура ДобавитьГруппировку(ЭлементСтруктуры, Знач Поле, Представление, Использовать = Истина, ТипГруппировки = "Элементы") Экспорт
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("Массив") Тогда
		
		СтруктураПараметра = Новый Структура("Представление, Поле, Использование, ТипГруппировки");
		СтруктураПараметра.Представление = Представление;
		СтруктураПараметра.Использование = Использовать;
		СтруктураПараметра.Поле = Поле;
		Если ТипГруппировки = "Элементы" Тогда
			СтруктураПараметра.ТипГруппировки = 3;
		ИначеЕсли  ТипГруппировки = "Иерархия" Тогда
			СтруктураПараметра.ТипГруппировки = 1;
		ИначеЕсли  ТипГруппировки = "ТолькоИерархия" Тогда
			СтруктураПараметра.ТипГруппировки = 2;
		Иначе
			СтруктураПараметра.ТипГруппировки = 3;
		КонецЕсли;;
		
		ЭлементСтруктуры.Добавить(СтруктураПараметра);
		
	КонецЕсли;
	
КонецПроцедуры

// Функция добавляет выбранное поле и возвращает элемент выбранного поля. 
//
// Параметры:
//		ЭлементСтруктуры - компоновщик настроек, настройка СКД, элемент структуры настройки отчета
//		Поле - имя поля, которое нужно добавить в СКД
//		Заголовок - заголовок добавляемого поля
//
Функция ДобавитьВыбранноеПоле(ЭлементСтруктуры, Знач Поле, Заголовок = Неопределено) Экспорт
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		ВыбранныеПоля = ЭлементСтруктуры.Настройки.Выбор;
	ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("НастройкиКомпоновкиДанных") Тогда
		ВыбранныеПоля = ЭлементСтруктуры.Выбор;
	Иначе
		ВыбранныеПоля = ЭлементСтруктуры;
	КонецЕсли;
	
	Если ТипЗнч(Поле) = Тип("Строка") Тогда
		Поле = Новый ПолеКомпоновкиДанных(Поле);
	КонецЕсли;
	ВыбранноеПоле = ВыбранныеПоля.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле = Поле;
	Если Заголовок <> Неопределено Тогда
		ВыбранноеПоле.Заголовок = Заголовок;
	КонецЕсли;
	
	Возврат ВыбранноеПоле;
	
КонецФункции

// Функция округляет число по формату едениц измерения из формы отчета, возможно доп. указания точности и режима округления. 
//
// Параметры:
//		Форма - форма отчета
//		ИсходноеЧисло - число для округления
//		Точность - точность округления
//		РежимОкругления - режим округления
//
Функция ОкруглитьЧислоПоФормату(Форма, ИсходноеЧисло, Точность = 0, РежимОкругления = 0) Экспорт 
	
	Перем Делитель;
	
	Если Форма.СоответствиеЕдиницыИзмеренияДелителю.Свойство("Окр" + СтрЗаменить(Форма.СтруктураРеквизитовФормы.ЕдиницаИзмерения, " ", ""), Делитель) Тогда
		
		Возврат Окр(ИсходноеЧисло / Делитель, Точность, РежимОкругления) * Делитель;
		
	КонецЕсли;
	
КонецФункции


#КонецОбласти
