#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьЗначение(ИмяОбъекта, Ключ = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос	= Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка,
	|	Т.Значение КАК Значение,
	|	ДопЗначения.Значение КАК ДопЗначение,
	|	ДопЗначения.Ключ КАК Ключ
	|ИЗ
	|	ПланВидовХарактеристик.игр_ПроизвольныеПредопределенныеОбъекты КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.игр_ПроизвольныеПредопределенныеОбъекты.КлючЗначение КАК ДопЗначения
	|		ПО (ДопЗначения.Ссылка = Т.Ссылка)
	|			И (ДопЗначения.Ключ = &Ключ)
	|ГДЕ
	|	Т.ИмяПредопределенныхДанных = &ИмяПредопределенныхДанных"	
	;
	
	Запрос.УстановитьПараметр("ИмяПредопределенныхДанных", ИмяОбъекта);
	Запрос.УстановитьПараметр("Ключ", Ключ);
	
	Выборка	= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.ДопЗначение) Тогда
			Возврат Выборка.ДопЗначение;
		Иначе
			Возврат Выборка.Значение;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	              
КонецФункции

Функция ПолучитьДополнительныеЗначения(ИмяОбъекта) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат	= Новый Соответствие;
	
	Запрос	= Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	игр_ПроизвольныеПредопределенныеОбъектыКлючЗначение.Ключ КАК Ключ,
	|	игр_ПроизвольныеПредопределенныеОбъектыКлючЗначение.Значение КАК Значение
	|ИЗ
	|	ПланВидовХарактеристик.игр_ПроизвольныеПредопределенныеОбъекты.КлючЗначение КАК игр_ПроизвольныеПредопределенныеОбъектыКлючЗначение
	|ГДЕ
	|	игр_ПроизвольныеПредопределенныеОбъектыКлючЗначение.Ссылка.ИмяПредопределенныхДанных = &ИмяПредопределенныхДанных";
	
	Запрос.УстановитьПараметр("ИмяПредопределенныхДанных", ИмяОбъекта);
	
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Ключ, Выборка.Значение);
	КонецЦикла;
	
	Возврат Результат;
	              
КонецФункции

#КонецОбласти

#КонецЕсли
