
&НаСервере
Процедура КонтрагентыПриИзмененииНаСервере(Имя)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭКОМ_GLN.GLN,
		|	ЭКОМ_GLN.Ид_ОЭД КАК GUID
		|ИЗ
		|	РегистрСведений.ЭКОМ_GLN КАК ЭКОМ_GLN
		|ГДЕ
		|	ЭКОМ_GLN.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Запись[Имя]);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Запись["xml" + Имя]			= ВыборкаДетальныеЗаписи.GLN;
		Запись["xml" + Имя + "GUID"] = ВыборкаДетальныеЗаписи.GUID;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыПриИзменении(Элемент)
	КонтрагентыПриИзмененииНаСервере(Элемент.Имя);
КонецПроцедуры

&НаСервере
Процедура КонтрагентыОчисткаНаСервере(Имя)
	
	Запись["xml" + Имя]				= "";
	Запись["xml" + Имя + "GUID"] 	= "";
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыОчистка(Элемент, СтандартнаяОбработка)
	КонтрагентыОчисткаНаСервере(Элемент.Имя);
КонецПроцедуры

&НаСервере
Процедура СтатусПриИзмененииНаСервере()
	
	Запись.Действие = ?(Строка(Запись.Статус) = "Подписан контрагентом",
		ПредопределенноеЗначение("Перечисление.ЭКОМ_ТребуемоеДействиеCONDRA.ПодписанКонтрагентом"),
		ПредопределенноеЗначение("Перечисление.ЭКОМ_ТребуемоеДействиеCONDRA." + Строка(Запись.Статус)));
		
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	СтатусПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СтатусОчисткаНаСервере()
	
	Запись.Действие = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОчистка(Элемент, СтандартнаяОбработка)
	СтатусОчисткаНаСервере();
КонецПроцедуры
