#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// Первоначальное заполнение объекта.
	Если Параметры.Ключ.Пустая() И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ЗаполнитьПервоначальныеЗначения();
	Иначе
		ПриПолученииДанныхНаСервере();
	КонецЕсли;
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "Объект.ПериодРегистрации", "ПериодРегистрацииСтрокой");

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Обработчик подсистемы "ВерсионированиеОбъектов".
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПриПолученииДанныхНаСервере();
	 	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	Если НЕ ТекущийОбъект.ПроверитьЗаполнение() Тогда
		ОбработатьСообщенияПользователю();
		Отказ = Истина
	КонецЕсли;	
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПриПолученииДанныхНаСервере();
	
	СохраняемыеЗначения = Новый Структура;
	СохраняемыеЗначения.Вставить("Бухгалтер", ТекущийОбъект.Бухгалтер);
	
	ЗарплатаКадры.СохранитьЗначенияЗаполненияОтветственныхРаботников(ТекущийОбъект.Организация, СохраняемыеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ПлатежноеПоручение"
		ИЛИ ИмяСобытия = "Запись_СписаниеБезналичныхДенежныхСредств"
		ИЛИ ИмяСобытия = "ИзменениеОплатыВедомости" Тогда
		
		УстановитьДоступностьЭлементов();
		УстановитьПредставлениеОплаты();
		
	КонецЕсли

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РуководительПриИзменении(Элемент)
	ПодписантПриИзмененииНаСервере()
КонецПроцедуры

&НаКлиенте
Процедура ГлавныйБухгалтерПриИзменении(Элемент)
	ПодписантПриИзмененииНаСервере()
КонецПроцедуры

&НаКлиенте
Процедура БухгалтерПриИзменении(Элемент)
	ПодписантПриИзмененииНаСервере()
КонецПроцедуры

#Область РедактированиеМесяцаСтрокой

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "Объект.ПериодРегистрации", "ПериодРегистрацииСтрокой", Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "Объект.ПериодРегистрации", "ПериодРегистрацииСтрокой");
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "Объект.ПериодРегистрации", "ПериодРегистрацииСтрокой", Направление, Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормы

&НаКлиенте
Процедура СоставВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.Состав.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ФизическоеЛицо) Тогда
		Если Поле.ГиперссылкаЯчейки ИЛИ Поле.ТолькоПросмотр Тогда
			РедактироватьНалогиВзносыОтчисленияСтроки(ТекущиеДанные);
			СтандартнаяОбработка = Ложь;
		КонецЕсли	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоставОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СоставОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СоставПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не Копирование Тогда
		КадровыйУчетКлиент.ПодобратьФизическихЛицОрганизации(
		Элементы.Состав, 
		Объект.Организация, 
		АдресСпискаПодобранныхСотрудников());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставПередУдалением(Элемент, Отказ)
	
	СотрудникиМассив = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из Элемент.ВыделенныеСтроки Цикл
		
		Строка = Состав.НайтиПоИдентификатору(ВыделеннаяСтрока).ФизическоеЛицо;
		
		Если Строка <> Неопределено Тогда
			СотрудникиМассив.Добавить(Строка);
		КонецЕсли	
		
	КонецЦикла;	
	
	Сотрудники = Новый ФиксированныйМассив(СотрудникиМассив);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставПослеУдаления(Элемент)
	СоставПослеУдаленияНаСервере()
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Подобрать(Команда)
	
	ПодобратьНаСервере();
	
	ПараметрыОткрытияФормы = Новый Структура;
	
	СтруктураОтбора = Новый Структура;
	
	СтруктураОтбора.Вставить("Организация", Объект.Организация);
	
	МассивРолей = Новый Массив;
	МассивРолей.Добавить(ПредопределенноеЗначение("Перечисление.РолиФизическихЛиц.Сотрудник"));
	МассивРолей.Добавить(ПредопределенноеЗначение("Перечисление.РолиФизическихЛиц.ПрочийПолучательДоходов"));
	МассивРолей.Добавить(ПредопределенноеЗначение("Перечисление.РолиФизическихЛиц.БывшийСотрудник"));
	СтруктураОтбора.Вставить("Роль", Новый ФиксированныйМассив(МассивРолей));
	
	ПараметрыОткрытияФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыОткрытияФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыОткрытияФормы.Вставить("Отбор", СтруктураОтбора);
	
	ПараметрыОткрытияФормы.Вставить("АдресСпискаПодобранныхФизическихЛиц", АдресСпискаПодобранныхСотрудников());
	
	ОткрытьФорму("Справочник.ФизическиеЛица.Форма.ФормаВыбораПоРоли", ПараметрыОткрытияФормы, Элементы.Состав);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьНалогиВзносыОтчисления(Команда)
	РедактироватьНалогиВзносыОтчисленияСтроки(Элементы.Состав.ТекущиеДанные);	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыПредставлениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ОплатыСписок.Количество() = 0 Тогда
		Возврат
	ИначеЕсли ОплатыСписок.Количество() = 1 Тогда
		ПоказатьЗначение(, ОплатыСписок[0].Значение)
	Иначе
		Оповещение = Новый ОписаниеОповещения("ВедомостьОплатаПоказатьОповещение", ЭтотОбъект, ЭтаФорма);
		ПоказатьВыборИзМеню(Оповещение, ОплатыСписок, Элемент);
	КонецЕсли	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область ВызовыСервера

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ЗначенияДляЗаполнения = ВедомостьЗначенияДляЗаполненияОтветственныхЛиц();
	Для Каждого ЗначениеДляЗаполнения Из ЗначенияДляЗаполнения Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(ЭтаФорма, ЗначениеДляЗаполнения.Значение, Неопределено);
	КонецЦикла;
	ЗначенияДляЗаполнения.Вставить("Организация", "Объект.Организация");
	ЗарплатаКадры.ЗаполнитьЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Организация"))
	
КонецПроцедуры
	
&НаСервере
Функция ВедомостьЗначенияДляЗаполненияОтветственныхЛиц()Экспорт
	
	МенеджерВедомости = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	РеквизитыОтветственныхЛиц = МенеджерВедомости.РеквизитыОтветственныхЛиц();
	
	ЗначенияДляЗаполнения = Новый Структура;
	Для Каждого Реквизит Из РеквизитыОтветственныхЛиц Цикл
		ПутьРеквизита = "Объект."+Реквизит;
		ЗначенияДляЗаполнения.Вставить(Реквизит, ПутьРеквизита);
	КонецЦикла;
	
	Возврат ЗначенияДляЗаполнения
	
КонецФункции

&НаСервере
Процедура ПодписантПриИзмененииНаСервере()
	НастроитьОтображениеГруппыПодписей();
КонецПроцедуры

&НаСервере
Процедура СоставОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
		ВыбранныеСотрудники = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбранноеЗначение);
	Иначе
		ВыбранныеСотрудники = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВыбранноеЗначение)
	КонецЕсли;
	
	СотрудникиМассив = Новый Массив;
	Для Каждого Сотрудник Из ВыбранныеСотрудники Цикл
		
		СтрокиСотрудника = Состав.НайтиСтроки(Новый Структура("ФизическоеЛицо", Сотрудник));
		
		Если СтрокиСотрудника.Количество() = 0 Тогда
			СотрудникиМассив.Добавить(Сотрудник)
		КонецЕсли;
		
	КонецЦикла;
	
	Если СотрудникиМассив.Количество() > 0 Тогда
		ВедомостьДополнитьНаСервере(СотрудникиМассив);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоставПослеУдаленияНаСервере()
	
	Для Каждого Сотрудник Из Сотрудники Цикл
		
		УдаляемыеСтроки = Объект.НалогиВзносыОтчисления.НайтиСтроки(Новый Структура("ФизическоеЛицо", Сотрудник));
		Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
			Объект.НалогиВзносыОтчисления.Удалить(УдаляемаяСтрока);
		КонецЦикла;	
		
	КонецЦикла
	
КонецПроцедуры

&НаСервере
Процедура ВедомостьДополнитьНаСервере(СотрудникиМассив) Экспорт
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	Если ТекущийОбъект.МожноЗаполнитьНалогиВзносыОтчисления() Тогда
		ТекущийОбъект.ДополнитьНалогиВзносыОтчисления(СотрудникиМассив);
	КонецЕсли;

	ОбработатьСообщенияПользователю();
	
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	
	ПриПолученииДанныхНаСервере();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбратныеВызовы

&НаСервере
Процедура ЗаполнитьПервоначальныеЗначения() Экспорт
	
	ЗначенияДляЗаполнения = Новый Структура;
	Для Каждого ЗначениеДляЗаполнения Из ВедомостьЗначенияДляЗаполненияОтветственныхЛиц() Цикл
		ЗначенияДляЗаполнения.Вставить(ЗначениеДляЗаполнения.Ключ, ЗначениеДляЗаполнения.Значение);
	КонецЦикла;	
	ЗначенияДляЗаполнения.Вставить("ПредыдущийМесяц",	"Объект.ПериодРегистрации");
	ЗначенияДляЗаполнения.Вставить("Организация",		"Объект.Организация");
	ЗначенияДляЗаполнения.Вставить("Подразделение",		"Объект.Подразделение");
	ЗначенияДляЗаполнения.Вставить("Ответственный",		"Объект.Ответственный");
	
	ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ВыполнятьРасчетЗарплатыПоПодразделениям") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(ЭтаФорма, "Объект.Подразделение", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриПолученииДанныхНаСервере() Экспорт
	
	ПериодРегистрацииВедомости = Объект.ПериодРегистрации;
	
	ТЗНалогиВзносыОтчисления = Объект.НалогиВзносыОтчисления.Выгрузить(, "ФизическоеЛицо, МесяцНалоговогоПериода, НалогВзнос, НомерСтроки");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НалогиВзносыОтчисления", ТЗНалогиВзносыОтчисления);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НалогиВзносыОтчисления.ФизическоеЛицо,
	|	НалогиВзносыОтчисления.МесяцНалоговогоПериода,
	|	НалогиВзносыОтчисления.НалогВзнос,
	|	НалогиВзносыОтчисления.НомерСтроки
	|ПОМЕСТИТЬ ВТ_НалогиВзносыОтчисления
	|ИЗ
	|	&НалогиВзносыОтчисления КАК НалогиВзносыОтчисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НалогиВзносыОтчисления.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_НалогиВзносыОтчисления.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	СУММА(ВТ_НалогиВзносыОтчисления.НалогВзнос) КАК НалогВзнос,
	|	МИНИМУМ(ВТ_НалогиВзносыОтчисления.НомерСтроки) КАК НомерСтроки
	|ИЗ
	|	ВТ_НалогиВзносыОтчисления КАК ВТ_НалогиВзносыОтчисления
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_НалогиВзносыОтчисления.ФизическоеЛицо,
	|	ВТ_НалогиВзносыОтчисления.МесяцНалоговогоПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(НалогВзнос)
	|ПО
	|	ФизическоеЛицо";
		
	ВыборкаПоФизическомуЛицу = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СоставТЗ = Новый ТаблицаЗначений;
	СоставТЗ.Колонки.Добавить("ФизическоеЛицо");
	СоставТЗ.Колонки.Добавить("КВыплате");
	СоставТЗ.Колонки.Добавить("Расшифровка");
	
	Пока ВыборкаПоФизическомуЛицу.Следующий() Цикл
		СоставСтрока = СоставТЗ.Добавить();
		СоставСтрока.ФизическоеЛицо = ВыборкаПоФизическомуЛицу.ФизическоеЛицо;
		СоставСтрока.КВыплате 		= ВыборкаПоФизическомуЛицу.НалогВзнос;
		
		Выборка = ВыборкаПоФизическомуЛицу.Выбрать();
		ПредставлениеПериодов = "";
		Индекс = 1;
		Пока Выборка.Следующий() Цикл
			Если Выборка.МесяцНалоговогоПериода = ПериодРегистрацииВедомости Тогда
				// период ведомости в комментарий не включаем
				Продолжить;
			КонецЕсли;
			
			ПредставлениеПериодов = ПредставлениеПериодов + ?(Индекс = 1, "", ", ") 
					+ НРег(ЗарплатаКадрыКлиентСервер.ПолучитьПредставлениеМесяца(Выборка.МесяцНалоговогоПериода));
			
			Если Индекс = 3 Тогда
				ПредставлениеПериодов = ПредставлениеПериодов + "...";
				Прервать;
			КонецЕсли;
			
			Индекс = Индекс + 1;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ПредставлениеПериодов) Тогда
			РасшифровкаПериодов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'в т.ч. за %1'"), ПредставлениеПериодов); 
		Иначе
			РасшифровкаПериодов = ""; 
		КонецЕсли;
		
		СоставСтрока.Расшифровка = "";
		Если ЗначениеЗаполнено(РасшифровкаПериодов) Тогда
			СоставСтрока.Расшифровка = СоставСтрока.Расшифровка + РасшифровкаПериодов
		КонецЕсли;
		
	КонецЦикла;  
	
	Состав.Загрузить(СоставТЗ);	
	
	НастроитьОтображениеГруппыПодписей();
	УстановитьДоступностьЭлементов();
	УстановитьПредставлениеОплаты();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьСообщенияПользователю() Экспорт
	
	Сообщения = ПолучитьСообщенияПользователю(Ложь);
	
	Для Каждого Сообщение Из Сообщения Цикл
		Если СтрНайти(Сообщение.Поле, "ПериодРегистрации") Тогда
			Сообщение.Поле = "";
			Сообщение.ПутьКДанным = "ПериодРегистрацииСтрокой";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов() Экспорт
	
	ТаблицаОплатыПоВедомости = ОплатыПоВедомости();
	
	ОплатыСписок.Очистить();
	
	Для Каждого СтрокаОплаты Из ТаблицаОплатыПоВедомости Цикл
		ОплатыСписок.Добавить(СтрокаОплаты.Ссылка, СтрокаОплаты.ПредставлениеСсылки);
	КонецЦикла;
	
	ЭтаФорма.ТолькоПросмотр = ОплатыСписок.Количество() > 0;
			
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставлениеОплаты() Экспорт
	
	ОплатыПредставление = ПредставлениеОплаты();
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеОплаты()  
	
	Если ОплатыСписок.Количество() = 0 Тогда
		
		ПредставлениеОплаты = Новый ФорматированнаяСтрока(НСтр("ru = 'Выплаты по ведомости не выполнялись'"));
		
	ИначеЕсли ОплатыСписок.Количество() = 1 Тогда	
		
		ПредставлениеДокумента = 
			НРег(Лев(ОплатыСписок[0], 1))
			+ Сред(ОплатыСписок[0], 2, СтрНайти(ОплатыСписок[0], " - ") - 2);
			
		ПредставлениеОплаты = Новый ФорматированнаяСтрока(
			НСтр("ru = 'Выплата по ведомости выполнена документом'"),
			" ",
			Новый ФорматированнаяСтрока(ПредставлениеДокумента, , , , "ссылка"));
		
	Иначе
		
		ПредставлениеОплаты = Новый ФорматированнаяСтрока(
			НСтр("ru = 'Выплаты по ведомости:'"),
			" ",
			Новый ФорматированнаяСтрока(
				НРег(ЧислоПрописью(ОплатыСписок.Количество(),,НСтр("ru = 'документ, документа, документов, м, ,,,,0'"))),
				, , , "ссылка"));
				
			КонецЕсли;	
	
	Возврат ПредставлениеОплаты
	
КонецФункции

&НаСервере
Функция ОплатыПоВедомости() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ведомость", Объект.Ссылка);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВнешниеХозяйственныеОперацииЗарплатаКадры") Тогда 
		
		Документ = "ПеречислениеВзносовИОтчислений";
		ТабличнаяЧасть = "ВедомостиНаПеречислениеВзносовИОтчислений";
		
	Иначе
		
		Документ = "СписаниеБезналичныхДенежныхСредств";
		ТабличнаяЧасть = "РасшифровкаПлатежа";
		
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОплатаВедомостей.Ссылка КАК Ссылка,
	|	ОплатаВедомостей.Ссылка.Представление КАК ПредставлениеСсылки
	|ИЗ
	|	Документ.СведенияОНезачисленныхВзносахОтчислениях КАК ОплатаВедомостей
	|ГДЕ
	|	ОплатаВедомостей.Ведомость = &Ведомость
	|	И ОплатаВедомостей.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОплатаВедомостей.Ссылка,
	|	Документ.Ссылка.Представление
	|ИЗ
	|	Документ." + Документ + "." + ТабличнаяЧасть + " КАК ОплатаВедомостей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ." + Документ + " КАК Документ
	|		ПО Документ.Ссылка = ОплатаВедомостей.Ссылка
	|ГДЕ
	|	ОплатаВедомостей.Ведомость = &Ведомость
	|	И Документ.Проведен";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

&НаКлиенте
Процедура ВедомостьОплатаПоказатьОповещение(ВыбранныйЭлемент, Форма) Экспорт
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ПоказатьЗначение(, ВыбранныйЭлемент.Значение)
	КонецЕсли	
КонецПроцедуры

&НаСервере
Процедура НастроитьОтображениеГруппыПодписей() Экспорт
	ЗарплатаКадры.НастроитьОтображениеГруппыПодписей(Элементы.ПодписиГруппа, "Объект.Руководитель", "Объект.ГлавныйБухгалтер", "Объект.Бухгалтер");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере() Экспорт

	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	Если ТекущийОбъект.МожноЗаполнитьНалогиВзносыОтчисления() Тогда
		ТекущийОбъект.ЗаполнитьНалогиВзносыОтчисления();
	КонецЕсли;

	ОбработатьСообщенияПользователю();
	
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	
	ПриПолученииДанныхНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура ПодобратьНаСервере() Экспорт
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	Если НЕ ТекущийОбъект.МожноЗаполнитьНалогиВзносыОтчисления() Тогда
		  Возврат		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция АдресСпискаПодобранныхСотрудников() Экспорт
	Возврат ПоместитьВоВременноеХранилище(Объект.НалогиВзносыОтчисления.Выгрузить(,"ФизическоеЛицо").ВыгрузитьКолонку("ФизическоеЛицо"), УникальныйИдентификатор);
КонецФункции

&НаСервере
Функция АдресВХранилищеНалогиВзносыОтчисленияПоСтроке(ФизическоеЛицо) Экспорт
	Возврат ПоместитьВоВременноеХранилище(Объект.НалогиВзносыОтчисления.Выгрузить(Новый Структура("ФизическоеЛицо", ФизическоеЛицо)), УникальныйИдентификатор);
КонецФункции	

#КонецОбласти

#Область ПроцедурыФормыРедактированияНалоговВзносовОтчесленийСтрокиВедомости

&НаКлиенте
Процедура РедактироватьНалогиВзносыОтчисленияСтроки(ДанныеСтроки) Экспорт
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	
	ПараметрыОткрытия.Вставить("Организация",			ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));
	ПараметрыОткрытия.Вставить("Подразделение",			ПредопределенноеЗначение("Справочник.ПодразделенияОрганизаций.ПустаяСсылка"));
	ПараметрыОткрытия.Вставить("ПериодРегистрации",		Дата(1,1,1));
	ЗаполнитьЗначенияСвойств(ПараметрыОткрытия, Объект);
	
	ПараметрыОткрытия.Вставить("ФизическоеЛицо", 		ДанныеСтроки.ФизическоеЛицо);
	ПараметрыОткрытия.Вставить("АдресВХранилищеНалогиВзносыОтчисленияПоСтроке", АдресВХранилищеНалогиВзносыОтчисленияПоСтроке(ДанныеСтроки.ФизическоеЛицо));
	
	ПараметрыОткрытия.Вставить("ТолькоПросмотр",		ЭтаФорма.ТолькоПросмотр);
	
	Оповещение = Новый ОписаниеОповещения("ВедомостьРедактироватьНалогиВзносыОтчисленияСтрокиЗавершение", ЭтотОбъект);
	ОткрытьФорму("Документ.ВедомостьНаПеречислениеВзносовОтчислений.Форма.РедактированиеСтрокиВедомости", ПараметрыОткрытия, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВедомостьРедактироватьНалогиВзносыОтчисленияСтрокиЗавершение(РезультатыРедактирования, ДополнительныеПараметры) Экспорт
	
	Если РезультатыРедактирования <> Неопределено И РезультатыРедактирования.Модифицированность Тогда
		РедактироватьНалогиВзносыОтчисленияСтрокиЗавершениеНаСервере(РезультатыРедактирования);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РедактироватьНалогиВзносыОтчисленияСтрокиЗавершениеНаСервере(РезультатыРедактирования) Экспорт
	
	ФизическоеЛицо = РезультатыРедактирования.ФизическоеЛицо;
	
	УдаляемыеСтроки = Объект.НалогиВзносыОтчисления.НайтиСтроки(Новый Структура("ФизическоеЛицо", ФизическоеЛицо));
	Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
		Объект.НалогиВзносыОтчисления.Удалить(УдаляемаяСтрока);
	КонецЦикла;	
	
	НалогиВзносыОтчисленияСтроки = ПолучитьИзВременногоХранилища(РезультатыРедактирования.АдресВХранилищеНалогиВзносыОтчисленияПоСтроке);

	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НалогиВзносыОтчисленияСтроки, Объект.НалогиВзносыОтчисления);

	ПриПолученииДанныхНаСервере();
		
	Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти

#КонецОбласти        