#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция АктуализироватьКодыТНВЭД(Знач ПараметрыВызова, Знач АдресХранилища) Экспорт

	ОсталисьНеобработанныеСтроки = Ложь;
	
	НовыеКодыТНВЭД = Новый Соответствие();
	
	Для Каждого ТекСтрока Из ПараметрыВызова.ТаблицаАктуализации Цикл
		Если ТекСтрока.Пометка И Не ТекСтрока.Номенклатура.Пустая() И Не ТекСтрока.ТекущийКодТНВЭД.Пустая() И Не ПустаяСтрока(ТекСтрока.НовыйКодТНВЭД) Тогда
				
			НачатьТранзакцию();
			
			Попытка
				
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить(ТекСтрока.Номенклатура.Метаданные().ПолноеИмя());
				ЭлементБлокировки.УстановитьЗначение("Ссылка", ТекСтрока.Номенклатура);
				Блокировка.Заблокировать();
				
				НоменклатураОбъект = ТекСтрока.Номенклатура.ПолучитьОбъект();
				Если НоменклатураОбъект = Неопределено Тогда
					ОтменитьТранзакцию();
					Продолжить;
				КонецЕсли;
				
				НовыйКодТНВЭД = НовыеКодыТНВЭД.Получить(ТекСтрока.НовыйКодТНВЭД);
				Если НовыйКодТНВЭД = Неопределено Тогда
					НовыйКодТНВЭД = Справочники.КлассификаторТНВЭД.НайтиПоКоду(ТекСтрока.НовыйКодТНВЭД);
					Если НовыйКодТНВЭД.Пустая() Тогда
						НовыйКодТНВЭД = ТекСтрока.ТекущийКодТНВЭД.Скопировать();
						НовыйКодТНВЭД.Код = ТекСтрока.НовыйКодТНВЭД;
						НовыйКодТНВЭД.Записать();
						НовыйКодТНВЭД = НовыйКодТНВЭД.Ссылка;
					КонецЕсли;
					НовыеКодыТНВЭД.Вставить(ТекСтрока.НовыйКодТНВЭД, НовыйКодТНВЭД);
				КонецЕсли;
				
				НоменклатураОбъект.КодТНВЭД = НовыйКодТНВЭД;
				
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НоменклатураОбъект);
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				ТекстСообщения = НСтр("ru = 'Не удалось обработать %Ссылка% по причине: %Причина%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", ТекСтрока.Номенклатура);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
					ТекСтрока.Номенклатура.Метаданные(), ТекСтрока.Номенклатура, ТекстСообщения);
			
			КонецПопытки;
			
		Иначе
			ОсталисьНеобработанныеСтроки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		ПоместитьВоВременноеХранилище(Новый Структура("ОсталисьНеобработанныеСтроки", ОсталисьНеобработанныеСтроки), АдресХранилища);
	КонецЕсли;
	
	Возврат Истина

КонецФункции

#КонецЕсли