
&После("ПриЗаписи")
Процедура игр_ПриЗаписи(Отказ, Замещение)
	
	ТаблицаТоваров	= ЭтотОбъект.Выгрузить(); 
	
	Запрос	= Новый Запрос;  
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыНаСкладах.Период КАК Период,
	|	ТоварыНаСкладах.Регистратор КАК Регистратор,
	|	ТоварыНаСкладах.НомерСтроки КАК НомерСтроки,
	|	ТоварыНаСкладах.Активность КАК Активность,
	|	ТоварыНаСкладах.ВидДвижения КАК ВидДвижения,
	|	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладах.Характеристика КАК Характеристика,
	|	ТоварыНаСкладах.Назначение КАК Назначение,
	|	ТоварыНаСкладах.Склад КАК Склад,
	|	ТоварыНаСкладах.Помещение КАК Помещение,
	|	ТоварыНаСкладах.Серия КАК Серия,
	|	ТоварыНаСкладах.ВНаличии КАК ВНаличии,
	|	ТоварыНаСкладах.КОтгрузке КАК КОтгрузке,
	|	ТоварыНаСкладах.КонтролироватьОстатки КАК КонтролироватьОстатки
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&Таблица КАК ТоварыНаСкладах
	|ГДЕ
	|	ТоварыНаСкладах.Помещение <> ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.Характеристика КАК Характеристика,
	|	ВТ_Товары.Назначение КАК Назначение,
	|	ВТ_Товары.Склад КАК Склад,
	|	ВТ_Товары.Помещение КАК Помещение,
	|	ВТ_Товары.Серия КАК Серия,
	|	ВТ_Товары.ВНаличии КАК ВНаличии,
	|	ВТ_Товары.КОтгрузке КАК КОтгрузке,
	|	ВТ_Товары.КонтролироватьОстатки КАК КонтролироватьОстатки
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ВТ_Товары.Номенклатура = СпрНоменклатура.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
	|		ПО ВТ_Товары.Период > СпрСклады.ДатаНачалаИспользованияСкладскихПомещений
	|			И ВТ_Товары.Склад = СпрСклады.Ссылка
	|ГДЕ
	|	СпрНоменклатура.ВидНоменклатуры <> &ВидНоменклатуры"
	;
	
	Запрос.УстановитьПараметр("Таблица", ТаблицаТоваров);
	Запрос.УстановитьПараметр("ВидНоменклатуры", Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("df262673-42b8-11f1-b774-00155d659100")));
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Нельзя учитывать %1 на %2", Выборка.Номенклатура, Выборка.Склад));
		
		Отказ	= Истина;
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладах.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&Таблица КАК ТоварыНаСкладах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.Характеристика КАК Характеристика
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ВТ_Товары.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	СпрНоменклатура.ВыгруженНаКаспи = ИСТИНА"
	;     
	
	МассивВыгрузки	= Новый Массив;
	
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		МассивВыгрузки.Добавить(Новый Структура("Номенклатура,Характеристика", 
			Выборка.Номенклатура, Выборка.Характеристика));
	КонецЦикла;
		
	РегистрыСведений.игр_НоменклатураКВыгрузке.ЗаписатьНоменклатуруКВыгрузке(МассивВыгрузки);
	
КонецПроцедуры
