
&ИзменениеИКонтроль("ДобавитьПредставленияПараметраВМассив")
Процедура игр_ДобавитьПредставленияПараметраВМассив(СхемаКомпоновкиДанных, КомпоновщикНастроек, Параметры, ИмяПараметра)
	Параметр = СхемаКомпоновкиДанных.Параметры.Найти(ИмяПараметра);
	Если Не Параметр = Неопределено Тогда
		ЗаголовокПараметра = Параметр.Заголовок;
		
		#Удаление
		ПользовательскоеПредставлениеПараметра = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, ИмяПараметра).ПредставлениеПользовательскойНастройки;
		#КонецУдаления
		#Вставка
		ПользовательскоеПредставлениеПараметра = ЗаголовокПараметра;
		#КонецВставки

		Параметры.Добавить(ЗаголовокПараметра);
		Параметры.Добавить(ПользовательскоеПредставлениеПараметра);
	КонецЕсли;
КонецПроцедуры
