#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СоздатьФайлВФорматеМТ(НастройкиВыгрузки, УникальныйИдентификатор) Экспорт 
	
	ПараметрыВыгрузки = ЗаполнитьСтруктуруПараметрыВыгрузки(НастройкиВыгрузки);
	СтруктураПередаваемыхФайлов = Новый Соответствие();
	ДанныеДокумента = ЗаполнитьДанныеДокумента(ПараметрыВыгрузки.ДанныеДокумента);
	
	Если ДанныеДокумента.ВидОперации = "ВыплатаЗарплатыПоЗарплатномуПроекту"
        ИЛИ ДанныеДокумента.ВидОперации = "ВыплатаЗарплатыПеречислением" Тогда
		СформироватьФайлЗачисленияЗарплаты(ДанныеДокумента, ПараметрыВыгрузки, СтруктураПередаваемыхФайлов, УникальныйИдентификатор);
	ИначеЕсли ДанныеДокумента.ВидОперации = "ПеречислениеВзносов" Тогда
		СформироватьФайлОтчислений(ДанныеДокумента, ПараметрыВыгрузки, СтруктураПередаваемыхФайлов, УникальныйИдентификатор);
	ИначеЕсли ДанныеДокумента.ВидОперации = "ПеречислениеДенежныхСредствПодотчетникам" Тогда
		СформироватьФайлЗачисленияЗарплаты(ДанныеДокумента, ПараметрыВыгрузки, СтруктураПередаваемыхФайлов, УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураПередаваемыхФайлов, УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаполнитьСтруктуруПараметрыВыгрузки(НастройкиВыгрузки)
	Возврат Новый Структура(
		"КаталогВыгрузки, Кодировка, ДанныеДокумента, ФормироватьОтдельныефайлы,
		|ВключатьПолеFT, ВключатьПолеPRT, ВключатьПолеPSO, ПолеPERIODВЗаголовке,
		|ПриоритетСообщения, НомерФайла",
		КаталогВыгрузки,
		Кодировка,
		НастройкиВыгрузки.ДанныеДокумента,
		НастройкиВыгрузки.ФормироватьОтдельныеФайлы,
		НастройкиВыгрузки.ВключатьПолеFT,
		НастройкиВыгрузки.ВключатьПолеPRT,
		НастройкиВыгрузки.ВключатьПолеPSO,
		НастройкиВыгрузки.ПолеPERIODВЗаголовке,
		НастройкиВыгрузки.ПриоритетСообщения,
		1);
КонецФункции

Функция ЗаполнитьДанныеДокумента(ПараметрыВыгрузки)
	
	ДанныеДокумента = Новый Структура("ВидОперации, ВидНалогаВзносаОтчисления, Дата, Номер, КодНазначенияПлатежа, НазначениеПлатежа, Ведомости, БуквенныйКодВалюты,
									|Организация, БанковскийСчет, ОрганизацияНаименованиеСокращенное, ОрганизацияИдентификационныйНомер,
									|ОрганизацияНомерСчета, ОрганизацияБИК, ОрганизацияПризнакРезидентства, ОрганизацияСекторЭкономики,
									|Получатель, БанковскийСчетПолучателя, ПолучательНаименованиеПолное, ПолучательИдентификационныйНомер,
									|ПолучательПризнакРезидентства, ПолучательСекторЭкономики, ПолучательНомерСчета, ПолучательБИК,
									|ФИОРуководителя, ДолжностьРуководителя, ФИОГлавногоБухгалтера");
	
	ЗаполнитьЗначенияСвойств(ДанныеДокумента, ПараметрыВыгрузки);
	
	СтруктураРеквизитовОрганизации                     = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеДокумента.Организация, "ИНН, НаименованиеСокращенное, КБЕ");
	ДанныеДокумента.ОрганизацияИдентификационныйНомер  = СтруктураРеквизитовОрганизации.ИНН;
	ДанныеДокумента.ОрганизацияНаименованиеСокращенное = СтруктураРеквизитовОрганизации.НаименованиеСокращенное;
	ДанныеДокумента.ОрганизацияПризнакРезидентства     = Лев(СтруктураРеквизитовОрганизации.КБЕ, 1);
	ДанныеДокумента.ОрганизацияСекторЭкономики         = Прав(СтруктураРеквизитовОрганизации.КБЕ, 1);
	
	СтруктураРеквизитовПолучателя                      = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеДокумента.Получатель, "ИНН, НаименованиеПолное, КБЕ");
	ДанныеДокумента.ПолучательНаименованиеПолное       = СтруктураРеквизитовПолучателя.НаименованиеПолное;
	ДанныеДокумента.ПолучательИдентификационныйНомер   = СтруктураРеквизитовПолучателя.ИНН;
	ДанныеДокумента.ПолучательПризнакРезидентства      = Лев(СтруктураРеквизитовПолучателя.КБЕ, 1);
	ДанныеДокумента.ПолучательСекторЭкономики          = Прав(СтруктураРеквизитовПолучателя.КБЕ, 1);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПодсистемы") Тогда
		МодульЗарплатаКадры                            = ОбщегоНазначения.ОбщийМодуль("ЗарплатаКадры");
		ДанныеДокумента.БуквенныйКодВалюты             = МодульЗарплатаКадры.ВалютаУчетаЗаработнойПлаты();
		МодульЗарплатаКадрыПереопределяемый            = ОбщегоНазначения.ОбщийМодуль("ЗарплатаКадрыПереопределяемый");
		СтруктураОтветственных                         = МодульЗарплатаКадрыПереопределяемый.СведенияОбОтветственныхЛицах(
			ДанныеДокумента.Организация,"Руководитель, ДолжностьРуководителя, ГлавныйБухгалтер", ДанныеДокумента.Дата);
		ДанныеДокумента.ФИОРуководителя                = СтруктураОтветственных.Руководитель;
		ДанныеДокумента.ДолжностьРуководителя          = СтруктураОтветственных.ДолжностьРуководителя;
		ДанныеДокумента.ФИОГлавногоБухгалтера          = СтруктураОтветственных.ГлавныйБухгалтер;
	Иначе
		МодульЗначениеНастроекПовтИсп = ОбщегоНазначения.ОбщийМодуль("ЗначениеНастроекПовтИсп");
		ДанныеДокумента.БуквенныйКодВалюты             = МодульЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета();
		
		МодульОтветственныеЛицаСервер = ОбщегоНазначения.ОбщийМодуль("ОтветственныеЛицаСервер");
		СтруктураОтветственных                         = МодульОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(ДанныеДокумента.Организация, ДанныеДокумента.Дата);
		ДанныеДокумента.ФИОРуководителя                = СтруктураОтветственных.РуководительНаименование;
		ДанныеДокумента.ДолжностьРуководителя          = СтруктураОтветственных.РуководительДолжность;
		ДанныеДокумента.ФИОГлавногоБухгалтера          = СтруктураОтветственных.ГлавныйБухгалтерНаименование;
	КонецЕсли;
	
	СтруктураРеквизитовБанкаОрганизации                = Справочники.БанковскиеСчетаОрганизаций.ПолучитьРеквизитыБанковскогоСчетаОрганизации(ДанныеДокумента.БанковскийСчет);
	ДанныеДокумента.ОрганизацияНомерСчета              = СтруктураРеквизитовБанкаОрганизации.НомерСчета;
	ДанныеДокумента.ОрганизацияБИК                     = СтруктураРеквизитовБанкаОрганизации.БИК;
	
	СтруктураРеквизитовБанкаКонтрагента                = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьРеквизитыБанковскогоСчета(ДанныеДокумента.БанковскийСчетПолучателя);
	ДанныеДокумента.ПолучательНомерСчета               = СтруктураРеквизитовБанкаКонтрагента.НомерСчета;
	ДанныеДокумента.ПолучательБИК                      = СтруктураРеквизитовБанкаКонтрагента.БИК;
	
	Возврат ДанныеДокумента;

КонецФункции

Функция ВыбратьСписокРаботников(ДатаДокумента, ВидОперации, Ведомости)
	
	Запрос = Новый Запрос();
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СписокКПеречислению.ФизическоеЛицо,
		|	СписокКПеречислению.ФизическоеЛицо.Наименование КАК ФизическоеЛицоНаименование,
		|	СписокКПеречислению.ФизическоеЛицо.ИНН КАК ИИН,
		|	СУММА(ВЫБОР
		|			КОГДА СписокКПеречислению.КВыплате ЕСТЬ NULL 
		|				ТОГДА 0
		|			ИНАЧЕ СписокКПеречислению.КВыплате
		|		КОНЕЦ) КАК СуммаКПеречислению,
		|	&ПоляВыборки,
		|	ФИОФизЛиц.Фамилия КАК Фамилия,
		|	ФИОФизЛиц.Имя КАК Имя,
		|	ФИОФизЛиц.Отчество КАК Отчество
		|
		|ИЗ
		|	&Источник КАК СписокКПеречислению
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛиц
		|		ПО ФИОФизЛиц.ФизическоеЛицо = СписокКПеречислению.ФизическоеЛицо
		|ГДЕ
		|	СписокКПеречислению.Ссылка В(&Ведомости)
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокКПеречислению.ФизическоеЛицо,
		|	СписокКПеречислению.ФизическоеЛицо.Наименование,
		|	СписокКПеречислению.ФизическоеЛицо.ИНН,
		|	ФИОФизЛиц.Фамилия,
		|	ФИОФизЛиц.Имя,
		|	ФИОФизЛиц.Отчество,
		|	&ПоляГруппировки
		|";
	
	Запрос.УстановитьПараметр("Ведомости", Ведомости);
	Если ВидОперации = "ВыплатаЗарплатыПоЗарплатномуПроекту" Тогда
		Источник1 = "Документ.ВедомостьНаВыплатуЗарплатыВБанк.Зарплата";
		Источник2 = "Документ.ВедомостьПрочихДоходовВБанк.Выплаты";
		ПоляВыборки = "СписокКПеречислению.НомерЛицевогоСчета КАК НомерЛицевогоСчета";
		ПоляГруппировки = "СписокКПеречислению.НомерЛицевогоСчета";
		
    ИначеЕсли ВидОперации = "ВыплатаЗарплатыПеречислением" Тогда
		Источник1 = "Документ.ВедомостьНаВыплатуЗарплатыПеречислением.Зарплата";
		Источник2 = "Документ.ВедомостьПрочихДоходовПеречислением.Выплаты";
		ПоляВыборки = "СписокКПеречислению.БанковскийСчет.НомерСчета КАК НомерЛицевогоСчета";
		ПоляГруппировки = "СписокКПеречислению.БанковскийСчет.НомерСчета";
    
	ИначеЕсли ВидОперации = "ПеречислениеВзносов" Тогда
		Источник1 = "Документ.ВедомостьНаПеречислениеВзносовОтчислений.НалогиВзносыОтчисления";
		ПоляВыборки = "
			|	СписокКПеречислению.Ссылка.ВидНалогаВзносаОтчисления КАК ВидОперации,
			|	СписокКПеречислению.ФизическоеЛицо.ДатаРождения КАК ДатаРождения,
			|	МИНИМУМ(СписокКПеречислению.МесяцНалоговогоПериода) КАК ПериодПлатежаТЧ";

		ПоляГруппировки = "
			|	СписокКПеречислению.Ссылка.ВидНалогаВзносаОтчисления,
			|	СписокКПеречислению.ФизическоеЛицо.ДатаРождения";
			//|	СписокКПеречислению.МесяцНалоговогоПериода";
			
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КВыплате", "НалогВзнос");
		
	ИначеЕсли ВидОперации = "ПеречислениеДенежныхСредствПодотчетникам" Тогда
		Источник1 = "Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа";
		ПоляВыборки = "
			|	СписокКПеречислению.БанковскийСчетПодотчетногоЛица.НомерСчета КАК НомерЛицевогоСчета";

		ПоляГруппировки = "
			|	СписокКПеречислению.БанковскийСчетПодотчетногоЛица.НомерСчета";
			
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СписокКПеречислению.ФизическоеЛицо", "СписокКПеречислению.ПодотчетноеЛицо");
		
	КонецЕсли;
	
	ТекстЗапросаДопДанные = ТекстЗапроса;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Источник", Источник1);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляВыборки", ПоляВыборки);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляГруппировки", ПоляГруппировки);
	
	// дополним ВедомостьПрочихДоходовВБанк
	Если ВидОперации = "ВыплатаЗарплатыПоЗарплатномуПроекту"
		ИЛИ ВидОперации = "ВыплатаЗарплатыПеречислением" Тогда
		
		ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&Источник", Источник2);
		ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "РАЗРЕШЕННЫЕ", "");
		ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ПоляВыборки", ПоляВыборки);
		ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ПоляГруппировки", ПоляГруппировки);
		
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|"
		+ ТекстЗапросаДопДанные + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФИОФизЛиц.Фамилия,
		|	ФИОФизЛиц.Имя,
		|	ФИОФизЛиц.Отчество";
		
	КонецЕсли;

	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выбрать();
	
КонецФункции

Процедура ПроверитьЗаполнениеРеквизитовПлатежногоПоручения(ДанныеДокумента, Отказ)
	
	Если НЕ ЗначениеЗаполнено(ДанныеДокумента.Организация) Тогда
		ТекстОшибки = НСтр("ru = 'В документе не указана организация, по которой формируется Swift-файл'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	ИначеЕсли НЕ ЗначениеЗаполнено(ДанныеДокумента.ОрганизацияНаименованиеСокращенное) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'У организации %1 не заполнено поле ""Полное наименование""'"),
			ДанныеДокумента.Организация);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Организация, , , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ОрганизацияИдентификационныйНомер) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'У организации %1 не заполнено поле ""БИН/ИИН""'"),
			ДанныеДокумента.Организация);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Организация, , , Отказ);
	ИначеЕсли СтрДлина(СокрЛП(ДанныеДокумента.ОрганизацияИдентификационныйНомер)) < 12 Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Длина БИН/ИИН организации %1 меньше 12 знаков'"),
			ДанныеДокумента.Организация);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Организация, , , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ОрганизацияПризнакРезидентства) ИЛИ
		НЕ ЗначениеЗаполнено(ДанныеДокумента.ОрганизацияСекторЭкономики) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'У организации %1 заполнено некорректно поле ""КБе"". КБе должен содержать 2 цифры'"),
			ДанныеДокумента.Организация);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Организация, , , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеДокумента.БанковскийСчет) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'В документе не указан банковский счет организации'"),
			ДанныеДокумента.Организация);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	Иначе
		Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ОрганизацияНомерСчета) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='В банковском счете %1 не указан номер счета'"),
				ДанныеДокумента.БанковскийСчет);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ОрганизацияБИК) Тогда
			ТекстОшибки = НСтр("ru='Не указан БИК банка, в котором открыт банковский счет организации'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ФИОРуководителя) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='У организации %1 не указан руководитель'"),
			ДанныеДокумента.Организация);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Организация, , , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеДокумента.Получатель) Тогда
		ТекстОшибки = НСтр("ru='В документе не указан получатель платежа'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	Иначе
		Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ПолучательНаименованиеПолное) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='У контрагента %1 не заполнено поле ""Сокращенное наименование""'"),
				ДанныеДокумента.Получатель);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Получатель, , , Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ПолучательИдентификационныйНомер) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'У контрагента %1 не заполнено поле ""БИН/ИИН""'"),
				ДанныеДокумента.Получатель);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Получатель, , , Отказ);
		ИначеЕсли СтрДлина(СокрЛП(ДанныеДокумента.ПолучательИдентификационныйНомер)) < 12 Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Длина БИН/ИИН контрагента %1 меньше 12 знаков'"),
				ДанныеДокумента.Получатель);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Получатель, , , Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ПолучательПризнакРезидентства) ИЛИ
			НЕ ЗначениеЗаполнено(ДанныеДокумента.ПолучательСекторЭкономики) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'У контрагента %1 заполнено некорректно поле ""КБе"". КБе должен содержать 2 цифры'"),
				ДанныеДокумента.Получатель);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Получатель, , , Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеДокумента.БанковскийСчетПолучателя) Тогда
		ТекстОшибки = НСтр("ru='В документе не указан банковский счет получателя платежа'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	Иначе
		Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ПолучательНомерСчета) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='В банковском счете %1 не указан номер счета'"),
				ДанныеДокумента.БанковскийСчетПолучателя);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ПолучательБИК) Тогда
			ТекстОшибки = НСтр("ru='Не указан БИК банка, в котором открыт счет получателя'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		КонецЕсли;
	
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(ДанныеДокумента.КодНазначенияПлатежа) Тогда
		ТекстОшибки = НСтр("ru='Не указан ""Код назначения платежа"" в выгружаемом документе.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеРеквизитовСтрокиСпискаРаботников(ДанныеДокумента, ВыборкаПоСпискуРаботников, Отказ)
	
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСпискуРаботников.ИИН) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не указан ИИН физ.лица %1'"),
			ВыборкаПоСпискуРаботников.ФизическоеЛицоНаименование);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ВыборкаПоСпискуРаботников.ФизическоеЛицо, , , Отказ);
	ИначеЕсли СтрДлина(СокрЛП(ВыборкаПоСпискуРаботников.ИИН)) < 12 Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Длина ИИН физ. лица %1 меньше 12 знаков'"),
			ВыборкаПоСпискуРаботников.ФизическоеЛицоНаименование);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ВыборкаПоСпискуРаботников.ФизическоеЛицо, , , Отказ);
	КонецЕсли;
	
	Если ДанныеДокумента.ВидОперации = "ВыплатаЗарплатыПоЗарплатномуПроекту" Тогда
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСпискуРаботников.НомерЛицевогоСчета) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не указан номер счета физ. лица %1'"),
				ВыборкаПоСпискуРаботников.ФизическоеЛицоНаименование);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ВыборкаПоСпискуРаботников.ФизическоеЛицо, , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область ПроцедурыИФункцииФормированияТранспортныхФайлов

Процедура СформироватьФайлЗачисленияЗарплаты(ДанныеДокумента, ПараметрыВыгрузки, СтруктураПередаваемыхФайлов, УникальныйИдентификатор)
	
	Отказ = Ложь;
	КоличествоРаботниковВФайле = 500;
	
	ПроверитьЗаполнениеРеквизитовПлатежногоПоручения(ДанныеДокумента, Отказ);
	ВыборкаПоСпискуРаботников = ВыбратьСписокРаботников(ДанныеДокумента.Дата, ДанныеДокумента.ВидОперации, ДанныеДокумента.Ведомости);
	
	Пока ВыборкаПоСпискуРаботников.Следующий() Цикл
		ПроверитьЗаполнениеРеквизитовСтрокиСпискаРаботников(ДанныеДокумента, ВыборкаПоСпискуРаботников, Отказ);
	КонецЦикла;
	
	Если Отказ Тогда
		ВызватьИсключение НСтр("ru='Произошли ошибки при выгрузке. Выгрузка не выполнена.'");
	КонецЕсли;
	
	// Транспортный файл в формате МТ-102
	ФайлМТ102 = Новый ТекстовыйДокумент;
	
	СформироватьЗаголовокТранспортногоФайла(ФайлМТ102, ДанныеДокумента, ПараметрыВыгрузки);
	
	НомерСтроки = 1; ОбщаяСумма = 0; 
	ПараметрыВыгрузки.НомерФайла = 1;
	
	ВыборкаПоСпискуРаботников.Сбросить();
	Пока ВыборкаПоСпискуРаботников.Следующий() Цикл
		
		Если ВыборкаПоСпискуРаботников.СуммаКПеречислению <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если (НомерСтроки > КоличествоРаботниковВФайле) И (ПараметрыВыгрузки.ФормироватьОтдельныеФайлы) Тогда
			
			СформироватьКонецТранспортногоФайла(ФайлМТ102, ДанныеДокумента, НомерСтроки, ОбщаяСумма, ПараметрыВыгрузки);
			
			СохранитьТранспортныйФайл(ФайлМТ102, ДанныеДокумента, ПараметрыВыгрузки, СтруктураПередаваемыхФайлов, УникальныйИдентификатор);
			
			СформироватьЗаголовокТранспортногоФайла(ФайлМТ102, ДанныеДокумента, ПараметрыВыгрузки);
			
			НомерСтроки = 1; ОбщаяСумма  = 0;
			ПараметрыВыгрузки.НомерФайла = ПараметрыВыгрузки.НомерФайла + 1;
			
		КонецЕсли;
		
		СформироватьСтрокуРаботникаТранспортногоФайла(ФайлМТ102, ДанныеДокумента, ВыборкаПоСпискуРаботников, НомерСтроки, ПараметрыВыгрузки);
		ОбщаяСумма  = ОбщаяСумма + ВыборкаПоСпискуРаботников.СуммаКПеречислению;
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	СформироватьКонецТранспортногоФайла(ФайлМТ102, ДанныеДокумента, НомерСтроки, ОбщаяСумма, ПараметрыВыгрузки);
	СохранитьТранспортныйФайл(ФайлМТ102, ДанныеДокумента, ПараметрыВыгрузки, СтруктураПередаваемыхФайлов, УникальныйИдентификатор);
	
	ВыборкаПоСпискуРаботников.Сбросить();
	
КонецПроцедуры

Процедура СформироватьФайлОтчислений(ДанныеДокумента, ПараметрыВыгрузки, СтруктураПередаваемыхФайлов, УникальныйИдентификатор)
	
	Отказ = Ложь;
	КоличествоРаботниковВФайле = 500;
	
	ПроверитьЗаполнениеРеквизитовПлатежногоПоручения(ДанныеДокумента, Отказ);
	ВыборкаПоСпискуРаботников = ВыбратьСписокРаботников(ДанныеДокумента.Дата, ДанныеДокумента.ВидОперации, ДанныеДокумента.Ведомости);
	
	Пока ВыборкаПоСпискуРаботников.Следующий() Цикл
		ПроверитьЗаполнениеРеквизитовСтрокиСпискаРаботников(ДанныеДокумента, ВыборкаПоСпискуРаботников, Отказ);
	КонецЦикла;
	
	Если Отказ Тогда
		ВызватьИсключение НСтр("ru='Произошли ошибки при выгрузке. Выгрузка не выполнена.'");
	КонецЕсли;
	
	// Транспортный файл в формате МТ-102
	ФайлМТ102 = Новый ТекстовыйДокумент;
	
	СформироватьЗаголовокФайлаОтчислений(ФайлМТ102, ДанныеДокумента, ПараметрыВыгрузки);
	
	НомерСтроки = 1; ОбщаяСумма = 0; 
	ПараметрыВыгрузки.НомерФайла = 1;
	
	ВыборкаПоСпискуРаботников.Сбросить();
	Пока ВыборкаПоСпискуРаботников.Следующий() Цикл
		
		Если ВыборкаПоСпискуРаботников.СуммаКПеречислению <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если (НомерСтроки > КоличествоРаботниковВФайле) И (ПараметрыВыгрузки.ФормироватьОтдельныеФайлы) Тогда
			
			СформироватьКонецТранспортногоФайла(ФайлМТ102, ДанныеДокумента, НомерСтроки, ОбщаяСумма, ПараметрыВыгрузки);
			
			СохранитьТранспортныйФайл(ФайлМТ102, ДанныеДокумента, ПараметрыВыгрузки, СтруктураПередаваемыхФайлов, УникальныйИдентификатор);
			
			СформироватьЗаголовокФайлаОтчислений(ФайлМТ102, ДанныеДокумента, ПараметрыВыгрузки);
			
			НомерСтроки = 1; ОбщаяСумма  = 0;
			ПараметрыВыгрузки.НомерФайла = ПараметрыВыгрузки.НомерФайла + 1;
			
		КонецЕсли;
		
		СформироватьСтрокуРаботникаФайлаОтчислений(ФайлМТ102, ДанныеДокумента, ВыборкаПоСпискуРаботников, НомерСтроки, ПараметрыВыгрузки);
		ОбщаяСумма  = ОбщаяСумма + ВыборкаПоСпискуРаботников.СуммаКПеречислению;
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	СформироватьКонецТранспортногоФайла(ФайлМТ102, ДанныеДокумента, НомерСтроки, ОбщаяСумма, ПараметрыВыгрузки);
	СохранитьТранспортныйФайл(ФайлМТ102, ДанныеДокумента, ПараметрыВыгрузки, СтруктураПередаваемыхФайлов, УникальныйИдентификатор);
	
	ВыборкаПоСпискуРаботников.Сбросить();

КонецПроцедуры

Процедура СформироватьЗаголовокТранспортногоФайла(ФайлМТ102, ДанныеДокумента, ПараметрыВыгрузки)
	
	// Паспорт банка.
	ПаспортБанка = ?(СокрЛП(ДанныеДокумента.ОрганизацияБИК) = "", "F01K059560000000001000001", "F01" + СокрЛП(ДанныеДокумента.ОрганизацияБИК) + "00000001000001");
	
	// Номер платежного поручения без префикса и ведущих нулей.
	НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(СокрЛП(ДанныеДокумента.Номер), Истина, Истина);
	
	// Заголовок транспортного сообщения.
	ЗаголовокФайла = 
	"{1:"      + ПаспортБанка + "}
	|{2:I102SGROSS000000"+?(ПараметрыВыгрузки.ПриоритетСообщения, "U", "")+"3003}
	|{4:
	|:20:REFERENCE
	|:50:/D/"  + СокрЛП(ДанныеДокумента.ОрганизацияНомерСчета) + "
	|/NAME/"   + СокрЛП(ВРег(ДанныеДокумента.ОрганизацияНаименованиеСокращенное)) + "
	|/IDN/"    + ДанныеДокумента.ОрганизацияИдентификационныйНомер + "
	|/CHIEF/"  + СокрЛП(ВРег(ДанныеДокумента.ФИОРуководителя)) + "
	|/MAINBK/" + СокрЛП(ВРег(?(НЕ ЗначениеЗаполнено(ДанныеДокумента.ФИОГлавногоБухгалтера), НСтр("ru = 'Не предусмотрен'"), ДанныеДокумента.ФИОГлавногоБухгалтера))) + "
	|/IRS/"    + ДанныеДокумента.ОрганизацияПризнакРезидентства + "
	|/SECO/"   + ДанныеДокумента.ОрганизацияСекторЭкономики + "
	|:52B:"    + СокрЛП(ДанныеДокумента.ОрганизацияБИК) + "
	|:57B:"    + СокрЛП(ДанныеДокумента.ПолучательБИК) + "
	|:59:"     + СокрЛП(ДанныеДокумента.ПолучательНомерСчета) + "
	|/NAME/"   + СокрЛП(ДанныеДокумента.ПолучательНаименованиеПолное) + "
	|/IDN/"    + ДанныеДокумента.ПолучательИдентификационныйНомер + "
	|/IRS/"    + ДанныеДокумента.ПолучательПризнакРезидентства + "
	|/SECO/"   + ДанныеДокумента.ПолучательСекторЭкономики + "
	|:70:
	|/NUM/"    + СокрЛП(НомерДокумента) + "
	|/DATE/"   + Формат(ДанныеДокумента.Дата, "ДФ=""ггММдд""") + "
	|/VO/01
	|/SEND/07
	|/KNP/"    + ДанныеДокумента.КодНазначенияПлатежа;
	
	ФайлМТ102.ДобавитьСтроку(ЗаголовокФайла);
	
	ТекстНазначенияПлатежа = "/ASSIGN/" + СокрЛП(ДанныеДокумента.НазначениеПлатежа);
	Пока СтрДлина(ТекстНазначенияПлатежа) > 0 Цикл
		ФайлМТ102.ДобавитьСтроку(Сред(ТекстНазначенияПлатежа, 1, 60));
		ТекстНазначенияПлатежа = СокрЛП(Сред(ТекстНазначенияПлатежа, 61));
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьСтрокуРаботникаТранспортногоФайла(ФайлМТ102, ДанныеДокумента, ВыборкаПоСпискуРаботников, НомерСтроки, ПараметрыВыгрузки)
	
	Если ЗначениеЗаполнено(ВыборкаПоСпискуРаботников.Фамилия) Тогда
		
		ФИОРаботника = Новый Массив;
		ФИОРаботника.Добавить(ВыборкаПоСпискуРаботников.Фамилия);
		ФИОРаботника.Добавить(ВыборкаПоСпискуРаботников.Имя);
		
		Если ЗначениеЗаполнено(ВыборкаПоСпискуРаботников.Отчество) Тогда
			ФИОРаботника.Добавить(ВыборкаПоСпискуРаботников.Отчество);
		КонецЕсли;
			
	Иначе
		
		ФИОРаботника = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВыборкаПоСпискуРаботников.ФизическоеЛицоНаименование, " ");
		
	КонецЕсли;
	
	СтрокаФайла = 
	":21:"  + Формат(НомерСтроки, "ЧГ=") + "
	|:32B:" + СокрЛП(ДанныеДокумента.БуквенныйКодВалюты) + Формат(ВыборкаПоСпискуРаботников.СуммаКПеречислению, "ЧЦ=10; ЧДЦ=2; ЧРД=,; ЧРГ=; ЧГ=0,0") + "
	|:70:
	|/FM/"  + СокрЛП(ВРег(ФИОРаботника[0])) + "
	|/NM/"  + СокрЛП(ВРег(ФИОРаботника[1]));
	
	Если ФИОРаботника.Количество()>2 Тогда
		СтрокаФайла = СтрокаФайла + "
		|/FT/" + СокрЛП(ВРег(ФИОРаботника[2]));
	Иначе
		Если ПараметрыВыгрузки.ВключатьПолеFT Тогда
			СтрокаФайла = СтрокаФайла + "
			|/FT/";
		КонецЕсли;
	КонецЕсли;
	
	СтрокаФайла = СтрокаФайла + "
	|/IDN/" + ВыборкаПоСпискуРаботников.ИИН + "
	|/LA/"  + СокрЛП(ВыборкаПоСпискуРаботников.НомерЛицевогоСчета);
	
	ФайлМТ102.ДобавитьСтроку(СтрокаФайла);
	
КонецПроцедуры

Процедура СформироватьКонецТранспортногоФайла(ФайлМТ102, ДанныеДокумента, НомерСтроки, ОбщаяСумма, ПараметрыВыгрузки)

	СтрокаКонцаФайла = 
	":32A:" + Формат(ДанныеДокумента.Дата, "ДФ=""ггММдд""") + СокрЛП(ДанныеДокумента.БуквенныйКодВалюты) + Формат(ОбщаяСумма, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧРГ=; ЧГ=0,0") + "
	|-}";
	
	ФайлМТ102.ДобавитьСтроку(СтрокаКонцаФайла);
	
КонецПроцедуры

Процедура СформироватьЗаголовокФайлаОтчислений(ФайлМТ102, ДанныеДокумента, ПараметрыВыгрузки)
	
	// Паспорт банка.
	ПаспортБанка = ?(СокрЛП(ДанныеДокумента.ОрганизацияБИК) = "", "F01K059560000000001000001", "F01" + СокрЛП(ДанныеДокумента.ОрганизацияБИК) + "00000001000001");
	
	// Номер платежного поручения без префикса и ведущих нулей.
	НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(СокрЛП(ДанныеДокумента.Номер), Истина, Истина);
	
	// Заголовок транспортного сообщения.
	ЗаголовокФайла = 
	"{1:"      + ПаспортБанка + "}
	|{2:I102SGROSS000000"+?(ПараметрыВыгрузки.ПриоритетСообщения, "U", "")+"3003}
	|{4:
	|:20:REFERENCE
	|:50:/D/"  + СокрЛП(ДанныеДокумента.ОрганизацияНомерСчета) + "
	|/NAME/"   + СокрЛП(ВРег(ДанныеДокумента.ОрганизацияНаименованиеСокращенное)) + "
	|/IDN/"    + ДанныеДокумента.ОрганизацияИдентификационныйНомер + "
	|/CHIEF/"  + СокрЛП(ВРег(ДанныеДокумента.ФИОРуководителя)) + "
	|/MAINBK/" + СокрЛП(ВРег(?(НЕ ЗначениеЗаполнено(ДанныеДокумента.ФИОГлавногоБухгалтера), НСтр("ru = 'Не предусмотрен'"), ДанныеДокумента.ФИОГлавногоБухгалтера))) + "
	|/IRS/"    + ДанныеДокумента.ОрганизацияПризнакРезидентства + "
	|/SECO/"   + ДанныеДокумента.ОрганизацияСекторЭкономики + "
	|:52B:"    + СокрЛП(ДанныеДокумента.ОрганизацияБИК) + "
	|:57B:"    + СокрЛП(ДанныеДокумента.ПолучательБИК) + "
	|:59:"     + СокрЛП(ДанныеДокумента.ПолучательНомерСчета) + "
	|/NAME/"   + СокрЛП(ДанныеДокумента.ПолучательНаименованиеПолное) + "
	|/IDN/"    + ДанныеДокумента.ПолучательИдентификационныйНомер + "
	|/IRS/"    + ДанныеДокумента.ПолучательПризнакРезидентства + "
	|/SECO/"   + ДанныеДокумента.ПолучательСекторЭкономики + "
	|:70:
	|/NUM/"    + СокрЛП(НомерДокумента) + "
	|/DATE/"   + Формат(ДанныеДокумента.Дата, "ДФ=""ггММдд""") + "
	|/VO/01
	|/SEND/07
	|/KNP/"    + ДанныеДокумента.КодНазначенияПлатежа;
	
	Если ПараметрыВыгрузки.ВключатьПолеPSO Тогда
		ЗаголовокФайла = ЗаголовокФайла + "
		|/PSO/01";
	КонецЕсли;
	
	Если ПараметрыВыгрузки.ВключатьПолеPRT Тогда
		ЗаголовокФайла = ЗаголовокФайла + "
		|/PRT/05";
	КонецЕсли;

	Ведомости = ДанныеДокумента.Ведомости;
	Если Ведомости.Количество() > 0 Тогда
		ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ведомости[0], "ВидНалогаВзносаОтчисления"); 
		ПериодПлатежа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ведомости[0], "ПериодРегистрации"); 
	КонецЕсли;
	
	Если ВидОперации <> Неопределено 
	 	И (ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.СО")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ООСМС"))
		И ПараметрыВыгрузки.ПолеPERIODвЗаголовке = 1 Тогда
		ЗаголовокФайла = ЗаголовокФайла + "
		|/PERIOD/" + Формат(ПериодПлатежа, "ДФ=""ММгггг""");
	КонецЕсли;

	ФайлМТ102.ДобавитьСтроку(ЗаголовокФайла);
	
	ТекстНазначенияПлатежа = "/ASSIGN/" + СокрЛП(ДанныеДокумента.НазначениеПлатежа);
	Пока СтрДлина(ТекстНазначенияПлатежа) > 0 Цикл
		ФайлМТ102.ДобавитьСтроку(Сред(ТекстНазначенияПлатежа, 1, 60));
		ТекстНазначенияПлатежа = СокрЛП(Сред(ТекстНазначенияПлатежа, 61));
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьСтрокуРаботникаФайлаОтчислений(ФайлМТ102, ДанныеДокумента, ВыборкаПоСпискуРаботников, НомерСтроки, ПараметрыВыгрузки)
	
	Если ВыборкаПоСпискуРаботников.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.СО") Тогда
		ПрефиксПоля =  "S";
	ИначеЕсли ВыборкаПоСпискуРаботников.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОПВ") Тогда
		ПрефиксПоля =  "C";
	ИначеЕсли ВыборкаПоСпискуРаботников.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОППВ") Тогда
		ПрефиксПоля =  "P";
	ИначеЕсли ВыборкаПоСпискуРаботников.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС") Тогда
		ПрефиксПоля =  "M";
	ИначеЕсли ВыборкаПоСпискуРаботников.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ООСМС") Тогда
		ПрефиксПоля =  "R";
	КонецЕсли;

	Если ЗначениеЗаполнено(ВыборкаПоСпискуРаботников.Фамилия) Тогда
		
		ФИОРаботника = Новый Массив;
		ФИОРаботника.Добавить(ВыборкаПоСпискуРаботников.Фамилия);
		ФИОРаботника.Добавить(ВыборкаПоСпискуРаботников.Имя);
		
		Если ЗначениеЗаполнено(ВыборкаПоСпискуРаботников.Отчество) Тогда
			ФИОРаботника.Добавить(ВыборкаПоСпискуРаботников.Отчество);
		КонецЕсли;
		
	Иначе
		
		ФИОРаботника = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВыборкаПоСпискуРаботников.ФизическоеЛицоНаименование, " ");
		
	КонецЕсли;
	СтрокаФайла = 
	":21:"  + Формат(НомерСтроки, "ЧГ=") + "
	|:32B:" + СокрЛП(ДанныеДокумента.БуквенныйКодВалюты) + Формат(ВыборкаПоСпискуРаботников.СуммаКПеречислению, "ЧЦ=10; ЧДЦ=2; ЧРД=,; ЧРГ=; ЧГ=0,0") + "
	|:70:
	|/OPV/" + ПрефиксПоля + "
	|/FM/"  + СокрЛП(ВРег(ФИОРаботника[0])) + "
	|/NM/"  + СокрЛП(ВРег(ФИОРаботника[1]));
	
	Если ФИОРаботника.Количество()>2 Тогда
		СтрокаФайла = СтрокаФайла + "
		|/FT/" + СокрЛП(ВРег(ФИОРаботника[2]));
	Иначе
		Если ПараметрыВыгрузки.ВключатьПолеFT Тогда
			СтрокаФайла = СтрокаФайла + "
			|/FT/";
		КонецЕсли;
	КонецЕсли;
	
	СтрокаФайла = СтрокаФайла + "
	|/DT/"  + Формат(ВыборкаПоСпискуРаботников.ДатаРождения, "ДФ=""ггггММдд""") + "
	|/IDN/" + ВыборкаПоСпискуРаботников.ИИН;
	
	Ведомости = ДанныеДокумента.Ведомости;
	Если Ведомости.Количество() > 0 Тогда
		ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ведомости[0], "ВидНалогаВзносаОтчисления"); 
	КонецЕсли;
	
	Если ВидОперации <> Неопределено 
		И (ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.СО")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОПВ")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОППВ")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ООСМС"))
		И ПараметрыВыгрузки.ПолеPERIODвЗаголовке = 0 Тогда
		СтрокаФайла = СтрокаФайла + "
		|/PERIOD/" + Формат(ВыборкаПоСпискуРаботников.ПериодПлатежаТЧ, "ДФ=""ММгггг""");
	КонецЕсли;

	ФайлМТ102.ДобавитьСтроку(СтрокаФайла);
	
КонецПроцедуры

Процедура СохранитьТранспортныйФайл(ФайлМТ102, ДанныеДокумента, ПараметрыВыгрузки, СтруктураПередаваемыхФайлов, УникальныйИдентификатор)
	
	ПолныйКаталогВыгрузки = ПараметрыВыгрузки.КаталогВыгрузки + Формат(ТекущаяДатаСеанса(), "ДФ=""дд-ММ-гг""") + "." + ПараметрыВыгрузки.НомерФайла + "\";
	
	// Номер платежного поручения без префикса и ведущих нулей.
	НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(СокрЛП(ДанныеДокумента.Номер), Истина, Истина);
	
	Если ДанныеДокумента.ВидОперации = "ПеречислениеВзносов" Тогда
		ВидПеречисления = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1_%2'"), НСтр("ru = 'Перечисление'"), ДанныеДокумента.ВидНалогаВзносаОтчисления);
	Иначе
		ВидПеречисления = ДанныеДокумента.ВидОперации;
	КонецЕсли;
	
	ИмяТранспортногоФайла = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1_%2_%3.txt'"), ВидПеречисления, НомерДокумента, "Swift");
	
	ИмяФайла = ПолныйКаталогВыгрузки + ИмяТранспортногоФайла;
	
	ВременныйФайл = ПолучитьИмяВременногоФайла();
	
	ЗаписатьДанныеВФайл(ФайлМТ102, ВременныйФайл, ПараметрыВыгрузки);
	
	СтруктураПередаваемыхФайлов.Вставить(ИмяФайла, ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВременныйФайл), УникальныйИдентификатор));
	
	ФайлМТ102.Очистить();
	
	Попытка
		УдалитьФайлы(ВременныйФайл);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выгрузка данных в МТ-102'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Предупреждение,,,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось удалить временный файл
			|%1
			|по причине: %2'"), ВременныйФайл, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаписатьДанныеВФайл(СохраняемыйТекстовыйДокумент, ПолноеИмяФайла, ПараметрыВыгрузки)
	
	Если ПараметрыВыгрузки.Кодировка = "Windows" Тогда
		ЗаписатьФайлЧерезКомпоненту(СохраняемыйТекстовыйДокумент.ПолучитьТекст(), ПолноеИмяФайла);
	ИначеЕсли ПараметрыВыгрузки.Кодировка = "DOS" Тогда
		СохраняемыйТекстовыйДокумент.Записать(ПолноеИмяФайла, КодировкаТекста.OEM);
	ИначеЕсли ПараметрыВыгрузки.Кодировка = "UTF8" Тогда
		СохраняемыйТекстовыйДокумент.Записать(ПолноеИмяФайла, КодировкаТекста.UTF8);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьФайлЧерезКомпоненту(СохраняемыйТекст, ПолноеИмяФайла)
	
	Если Не ПодключитьВнешнююКомпоненту("Обработка.ВыгрузкаДанныхМТ102.Макет.TextWriter1048KZ_dll", "TextWriter1048KZ") Тогда
		ВызватьИсключение НСтр("ru = 'Не удалось подключить компоненту сохранения файла в кодировке ANSI'");
	КонецЕсли;
	
	Попытка
		TextWriter1048KZ = Новый("AddIn.TextWriter1048KZ.TextWriter1048KZ");
		ЗаписьПрошлаУспешно = TextWriter1048KZ.Записать(СохраняемыйТекст, ПолноеИмяФайла, , );
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выгрузка данных в МТ-102'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Предупреждение,,,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось записать файл в выбранной кодировке
			|по причине: %2
			|Воспользуйтесь другой кодировкой для выгрузки файла.'"), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
