#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	СозданиеНаОснованииПереопределяемый.ДобавитьКомандуСоздатьНаОснованииБизнесПроцессЗадание(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Добавляет команду создания документа "Распределение НДС".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.РаспределениеНДС) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РаспределениеНДС.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.РаспределениеНДС);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьНДС0,РаспределятьНДС,УправлениеПредприятием,КомплекснаяАвтоматизация";
	

		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
	
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

//++ НЕ УТ

// Функция возвращает текст запроса для отражения документа в регламентированном учете.
//
// Возвращаемое значение:
//	ТекстЗапроса - Строка - Текст запроса отражения в регл. учете.
//
Функция ТекстОтраженияВРеглУчете() Экспорт

#Область ПередачаНДСВСтоимостьОС                 // (Дт <08.04.2> :: Кт <19.1, 19.3>)
	ПередачаНДСВСтоимостьОС = "
	|ВЫБРАТЬ //// Передача НДС в стоимость ОС (Дт <08.04.2> :: Кт <19.1, 19.3>)
	|	ПартииПрочихРасходов.Регистратор КАК Ссылка,
	|	ПартииПрочихРасходов.Период КАК Период,
	|	ПартииПрочихРасходов.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	ПартииПрочихРасходов.НДСРегл КАК Сумма,
	|	ПартииПрочихРасходов.НДСУпр КАК СуммаУУ,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ПартииПрочихРасходов.СтатьяРасходов КАК АналитикаУчетаДт,
	|	ПартииПрочихРасходов.Подразделение КАК МестоУчетаДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	ПартииПрочихРасходов.Подразделение КАК ПодразделениеДт,
	|	ПартииПрочихРасходов.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|
	|	ПартииПрочихРасходов.СтатьяРасходов КАК СубконтоДт1,
	|	ПартииПрочихРасходов.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|		ТОГДА ОбъектыСтроительства.СпособСтроительства
	|	ИНАЧЕ 
	|		ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НДСпоПриобретеннымЦенностям) КАК ВидСчетаКт,
	|	ПартииПрочихРасходов.НалогообложениеФинПартии КАК АналитикаУчетаКт, 
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(Аналитика.Номенклатура.ТипНоменклатуры, НЕОПРЕДЕЛЕНО) В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|			ТОГДА ЕСТЬNULL(ГруппыФинансовогоУчетаНоменклатуры.ВидЦенностиНДС, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары))
	|		ИНАЧЕ Статьи.ВидЦенностиНДС
	|	КОНЕЦ КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	
	|	ПартииПрочихРасходов.АналитикаУчетаПартий.Контрагент КАК СубконтоКт1,
	|	ПартииПрочихРасходов.ДокументПоступленияРасходов КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Передача НДС в стоимость ОС"" КАК Содержание
	|ИЗ
	|	ПартииПрочихРасходов КАК ПартииПрочихРасходов
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|	ПО
	|		ПартииПрочихРасходов.СтатьяРасходов = Статьи.Ссылка
	|		И Статьи.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|	ПО 
	|		Аналитика.Ссылка = ПартииПрочихРасходов.АналитикаУчетаНоменклатуры
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.ГруппыФинансовогоУчетаНоменклатуры КАК ГруппыФинансовогоУчетаНоменклатуры
	|	ПО
	|		Аналитика.Номенклатура.ГруппаФинансовогоУчета = ГруппыФинансовогоУчетаНоменклатуры.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		Справочник.КлючиАналитикиУчетаПартий КАК АналитикаПартий
	|	ПО 
	|		АналитикаПартий.Ссылка = ПартииПрочихРасходов.АналитикаУчетаПартий
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|	ПО 
	|		ОбъектыСтроительства.Ссылка = ПартииПрочихРасходов.АналитикаРасходов
	|ГДЕ
	|	ПартииПрочихРасходов.НалогообложениеПартии = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|	И ПартииПрочихРасходов.НалогообложениеФинПартии <> ПартииПрочихРасходов.НалогообложениеПартии
	|	И ТИПЗНАЧЕНИЯ(ПартииПрочихРасходов.АналитикаРасходов) В (
	|		ТИП(Справочник.ОбъектыЭксплуатации),
	|		ТИП(Справочник.ОбъектыСтроительства),
	|		ТИП(Справочник.НематериальныеАктивы))
	|	И ПартииПрочихРасходов.НДСРегл <> 0
	|";
#КонецОбласти
	
#Область ИсключениеНДСИзСтоимостиОС              // (Дт <19.1, 19.3> :: Кт <08.04.2>)
	ИсключениеНДСИзСтоимостиОС = "
	|ВЫБРАТЬ //// Исключение НДС из стоимости ОС (Дт <19.1, 19.3> :: Кт <08.04.2>)
	|	ПартииПрочихРасходов.Регистратор КАК Ссылка,
	|	ПартииПрочихРасходов.Период КАК Период,
	|	ПартииПрочихРасходов.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	ПартииПрочихРасходов.НДСРегл КАК Сумма,
	|	ПартииПрочихРасходов.НДСУпр КАК СуммаУУ,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НДСпоПриобретеннымЦенностям) КАК ВидСчетаДт,
	|	ПартииПрочихРасходов.НалогообложениеПартии КАК АналитикаУчетаДт,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(Аналитика.Номенклатура.ТипНоменклатуры, НЕОПРЕДЕЛЕНО) В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|			ТОГДА ЕСТЬNULL(ГруппыФинансовогоУчетаНоменклатуры.ВидЦенностиНДС, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)) 
	|		ИНАЧЕ Статьи.ВидЦенностиНДС
	|	КОНЕЦ КАК МестоУчетаДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	
	|	ПартииПрочихРасходов.АналитикаУчетаПартий.Контрагент КАК СубконтоДт1,
	|	ПартииПрочихРасходов.ДокументПоступленияРасходов КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаКт,
	|	ПартииПрочихРасходов.СтатьяРасходов КАК АналитикаУчетаКт,
	|	ПартииПрочихРасходов.Подразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	ПартииПрочихРасходов.Подразделение КАК ПодразделениеКт,
	|	ПартииПрочихРасходов.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	
	|	ПартииПрочихРасходов.АналитикаРасходов КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Исключение НДС из стоимости ОС"" КАК Содержание
	|ИЗ
	|	ПартииПрочихРасходов КАК ПартииПрочихРасходов
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|	ПО
	|		ПартииПрочихРасходов.СтатьяРасходов = Статьи.Ссылка
	|		И Статьи.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|	ПО 
	|		Аналитика.Ссылка = ПартииПрочихРасходов.АналитикаУчетаНоменклатуры
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.ГруппыФинансовогоУчетаНоменклатуры КАК ГруппыФинансовогоУчетаНоменклатуры
	|	ПО
	|		Аналитика.Номенклатура.ГруппаФинансовогоУчета = ГруппыФинансовогоУчетаНоменклатуры.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		Справочник.КлючиАналитикиУчетаПартий КАК АналитикаПартий
	|	ПО 
	|		АналитикаПартий.Ссылка = ПартииПрочихРасходов.АналитикаУчетаПартий
	|ГДЕ
	|	ПартииПрочихРасходов.НалогообложениеФинПартии = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|	И ПартииПрочихРасходов.НалогообложениеФинПартии <> ПартииПрочихРасходов.НалогообложениеПартии
	|	И ТИПЗНАЧЕНИЯ(ПартииПрочихРасходов.АналитикаРасходов) В (
	|			ТИП(Справочник.ОбъектыЭксплуатации), 
	|			ТИП(Справочник.ОбъектыСтроительства),
	|			ТИП(Справочник.НематериальныеАктивы))
	|	И ПартииПрочихРасходов.НДСРегл <> 0
	|";
#КонецОбласти

#Область УчетВнеоборотныхАктивов2_2

#Область СтоимостьОСНаСчетУчета                  // (Дт <СчетУчетаОС/НМА> :: Кт <08.04.2>)
	СтоимостьОСНаСчетУчета_2_2 = "
	|ВЫБРАТЬ ////Стоимость ОС на счет учета (Дт <СчетУчетаОС/НМА> :: Кт <08.04.2>)
	|	ПартииПрочихРасходов.Регистратор КАК Ссылка,
	|	ПартииПрочихРасходов.Период КАК Период,
	|	ПартииПрочихРасходов.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	ПартииПрочихРасходов.НДСРегл КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	ЕСТЬNULL(МестонахождениеОС.Местонахождение, МестонахождениеНМА.Местонахождение) КАК ПодразделениеДт,
	|	ПартииПрочихРасходов.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ПартииПрочихРасходов.АналитикаРасходов) = ТИП(Справочник.ОбъектыЭксплуатации)
	|			ТОГДА ЕСТЬNULL(СчетаОтражения.ГруппаФинансовогоУчета.СчетУчета, СчетаОтражения.СчетУчета)
	|		ИНАЧЕ СчетаОтраженияНМА.СчетУчета
	|	КОНЕЦ КАК СчетДт,
	|	
	|	ПартииПрочихРасходов.АналитикаРасходов КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаКт,
	|	ПартииПрочихРасходов.СтатьяРасходов КАК АналитикаУчетаКт,
	|	ПартииПрочихРасходов.Подразделение КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ПартииПрочихРасходов.Подразделение КАК ПодразделениеКт,
	|	ПартииПрочихРасходов.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	
	|	ПартииПрочихРасходов.АналитикаРасходов КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Стоимость ОС на счет учета"" КАК Содержание
	|ИЗ
	|	ПартииПрочихРасходов КАК ПартииПрочихРасходов
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО
	|		ПартииПрочихРасходов.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ),
	|				(Организация, ОсновноеСредство) В
	|						(ВЫБРАТЬ
	|							Т.Организация,
	|							Т.Актив
	|						ИЗ
	|							ПартииПрочихРасходов_ВНА КАК Т)
	|		) КАК СчетаОтражения
	|	ПО
	|		ПартииПрочихРасходов.АналитикаРасходов = СчетаОтражения.ОсновноеСредство
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ),
	|				(Организация, НематериальныйАктив) В
	|						(ВЫБРАТЬ
	|							Т.Организация,
	|							Т.Актив
	|						ИЗ
	|							ПартииПрочихРасходов_ВНА КАК Т)
	|		) КАК СчетаОтраженияНМА
	|	ПО
	|		ПартииПрочихРасходов.АналитикаРасходов = СчетаОтраженияНМА.НематериальныйАктив
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ),
	|				(Организация, ОсновноеСредство) В
	|						(ВЫБРАТЬ
	|							Т.Организация,
	|							Т.Актив
	|						ИЗ
	|							ПартииПрочихРасходов_ВНА КАК Т)
	|		) КАК МестонахождениеОС
	|	ПО
	|		ПартииПрочихРасходов.АналитикаРасходов = МестонахождениеОС.ОсновноеСредство
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		(ВЫБРАТЬ
	|			ПУ.НематериальныйАктив,
	|			ПУ.Подразделение КАК Местонахождение
	|		ИЗ
	|			Документ.ПринятиеКУчетуНМА КАК ПУ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ),
	|				Организация В 
	|					(ВЫБРАТЬ
	|						Т.Организация
	|					ИЗ
	|						ПартииПрочихРасходов_ВНА КАК Т)
	|				И Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА) КАК ПервоначальныеСведения
	|			ПО ПУ.Ссылка = ПервоначальныеСведения.Регистратор
	|				И ПУ.НематериальныйАктив = ПервоначальныеСведения.НематериальныйАктив
	|		) КАК МестонахождениеНМА
	|	ПО
	|		ПартииПрочихРасходов.АналитикаРасходов = МестонахождениеНМА.НематериальныйАктив
	|
	|ГДЕ
	|	&ИспользоватьВнеоборотныеАктивы2_2 
	|	И (&Дата < &ДатаНачалаУчетаВнеоборотныхАктивов2_4 ИЛИ НЕ &ИспользоватьВнеоборотныеАктивы2_4)
	|	И НЕ (СчетаОтражения.СчетУчета ЕСТЬ NULL И СчетаОтраженияНМА.СчетУчета ЕСТЬ NULL)
	|	И ПартииПрочихРасходов.НалогообложениеПартии = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|	И ПартииПрочихРасходов.НалогообложениеПартии <> ПартииПрочихРасходов.НалогообложениеФинПартии
	|	И ТИПЗНАЧЕНИЯ(ПартииПрочихРасходов.АналитикаРасходов) В (
	|		ТИП(Справочник.ОбъектыЭксплуатации), 
	|		ТИП(Справочник.НематериальныеАктивы))
	|	И ПартииПрочихРасходов.НДСРегл <> 0
	|";
#КонецОбласти

#Область СтоимостьОСВРасходыНУ                  // (Дт <СчетРасходов> :: Кт <01>)
	СтоимостьОСВРасходыНУ_2_2 = "
	|ВЫБРАТЬ ////Стоимость ОС на счет учета (Дт <СчетУчетаОС/НМА> :: Кт <01>)
	|	ПартииПрочихРасходов.Регистратор КАК Ссылка,
	|	ПартииПрочихРасходов.Период КАК Период,
	|	ПартииПрочихРасходов.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ЕСТЬNULL(ПринятиеКУчетуОС.СтатьяРасходов, ПринятиеКУчетуНМА.СтатьяРасходов) КАК АналитикаУчетаДт,
	|	ЕСТЬNULL(ПринятиеКУчетуОС.Местонахождение, ПринятиеКУчетуНМА.Подразделение) КАК МестоУчетаДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	ЕСТЬNULL(ПринятиеКУчетуОС.Местонахождение, ПринятиеКУчетуНМА.Подразделение) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	
	|	ЕСТЬNULL(ПринятиеКУчетуОС.СтатьяРасходов, ПринятиеКУчетуНМА.СтатьяРасходов) КАК СубконтоДт1,
	|	ЕСТЬNULL(ПринятиеКУчетуОС.АналитикаРасходов, ПринятиеКУчетуНМА.АналитикаРасходов) КАК СубконтоДт2,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	ПартииПрочихРасходов.НДСРегл КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	-ПартииПрочихРасходов.НДСРегл КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	ЕСТЬNULL(ПринятиеКУчетуОС.Местонахождение, ПринятиеКУчетуНМА.Подразделение) КАК ПодразделениеКт,
	|	ПартииПрочихРасходов.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ПартииПрочихРасходов.АналитикаРасходов) = ТИП(Справочник.ОбъектыЭксплуатации)
	|			ТОГДА ЕСТЬNULL(СчетаОтражения.ГруппаФинансовогоУчета.СчетУчета, СчетаОтражения.СчетУчета)
	|		ИНАЧЕ СчетаОтраженияНМА.СчетУчета
	|	КОНЕЦ КАК СчетКт,
	|	
	|	ПартииПрочихРасходов.АналитикаРасходов КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	ПартииПрочихРасходов.НДСРегл КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	-ПартииПрочихРасходов.НДСРегл КАК СуммаВРКт,
	|	""Включение в расходы при принятии к учету"" КАК Содержание
	|ИЗ
	|	ПартииПрочихРасходов КАК ПартииПрочихРасходов
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ),
	|				(Организация, ОсновноеСредство) В
	|						(ВЫБРАТЬ
	|							Т.Организация,
	|							Т.Актив
	|						ИЗ
	|							ПартииПрочихРасходов_ВНА КАК Т)
	|			) КАК СчетаОтражения
	|	ПО
	|		ПартииПрочихРасходов.АналитикаРасходов = СчетаОтражения.ОсновноеСредство
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ),
	|				(Организация, НематериальныйАктив) В
	|						(ВЫБРАТЬ
	|							Т.Организация,
	|							Т.Актив
	|						ИЗ
	|							ПартииПрочихРасходов_ВНА КАК Т)
	|		) КАК СчетаОтраженияНМА
	|	ПО
	|		ПартииПрочихРасходов.АналитикаРасходов = СчетаОтраженияНМА.НематериальныйАктив
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ПервоначальныеСведенияНМАНалоговыйУчет.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ),
	|				(НематериальныйАктив, Организация) В 
	|						(ВЫБРАТЬ
	|							Т.Актив,
	|							Т.Организация
	|						ИЗ
	|							ПартииПрочихРасходов_ВНА КАК Т)
	|				И Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА
	|				) КАК ПервоначальныеСведенияНМА
	|	ПО
	|		ПартииПрочихРасходов.АналитикаРасходов = ПервоначальныеСведенияНМА.НематериальныйАктив
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.ПринятиеКУчетуНМА КАК ПринятиеКУчетуНМА
	|	ПО
	|		ПервоначальныеСведенияНМА.Регистратор = ПринятиеКУчетуНМА.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ),
	|				(ОсновноеСредство, Организация) В 
	|					(ВЫБРАТЬ
	|						Т.Актив,
	|						Т.Организация
	|					ИЗ
	|						ПартииПрочихРасходов_ВНА КАК Т)
	|				И Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС
	|				) КАК ПервоначальныеСведенияОС
	|	ПО
	|		ПартииПрочихРасходов.АналитикаРасходов = ПервоначальныеСведенияОС.ОсновноеСредство
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.ПринятиеКУчетуОС КАК ПринятиеКУчетуОС
	|	ПО
	|		ПервоначальныеСведенияОС.Регистратор = ПринятиеКУчетуОС.Ссылка
	|		
	|ГДЕ
	|	&ИспользоватьВнеоборотныеАктивы2_2
	|	И (&Дата < &ДатаНачалаУчетаВнеоборотныхАктивов2_4 ИЛИ НЕ &ИспользоватьВнеоборотныеАктивы2_4)
	|	И НЕ (СчетаОтражения.СчетУчета ЕСТЬ NULL И СчетаОтраженияНМА.СчетУчета ЕСТЬ NULL)
	|	И НЕ (ПринятиеКУчетуОС.Ссылка ЕСТЬ NULL И ПринятиеКУчетуНМА.Ссылка ЕСТЬ NULL)
	|	И ПартииПрочихРасходов.НалогообложениеПартии = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|	И ПартииПрочихРасходов.НалогообложениеФинПартии <> ПартииПрочихРасходов.НалогообложениеПартии
	|	И ТИПЗНАЧЕНИЯ(ПартииПрочихРасходов.АналитикаРасходов) В (
	|		ТИП(Справочник.ОбъектыЭксплуатации), 
	|		ТИП(Справочник.НематериальныеАктивы))
	|	И ВЫБОР 
	|		КОГДА НЕ ПринятиеКУчетуОС.Ссылка ЕСТЬ NULL
	|				И ПринятиеКУчетуОС.ПорядокУчетаНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.ВключениеВРасходыПриПринятииКУчету)
	|				И ПринятиеКУчетуОС.СтатьяРасходов.ПринятиеКналоговомуУчету
	|			ТОГДА ИСТИНА
	|		КОГДА НЕ ПринятиеКУчетуНМА.Ссылка ЕСТЬ NULL
	|				И ПринятиеКУчетуНМА.ПорядокСписанияНИОКРНаРасходыНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокСписанияНИОКРНУ.ПриПринятииКУчету)
	|				И ПринятиеКУчетуНМА.СтатьяРасходов.ПринятиеКналоговомуУчету
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|	И ПартииПрочихРасходов.НДСРегл <> 0
	|";
#КонецОбласти

#Область ИсключениеНДССоСчетаУчетаОС             // (Дт <08.04.2> :: Кт <СчетУчетаОС/НМА>)
	ИсключениеНДССоСчетаУчетаОС_2_2 = "
	|ВЫБРАТЬ ////Исключение НДС со счета учета ОС (Дт <08.04.2> :: Кт <СчетУчетаОС/НМА>)
	|	ПартииПрочихРасходов.Регистратор КАК Ссылка,
	|	ПартииПрочихРасходов.Период КАК Период,
	|	ПартииПрочихРасходов.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	ПартииПрочихРасходов.НДСРегл КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	ПартииПрочихРасходов.СтатьяРасходов КАК АналитикаУчетаДт,
	|	ПартииПрочихРасходов.Подразделение КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ПартииПрочихРасходов.Подразделение КАК ПодразделениеДт,
	|	ПартииПрочихРасходов.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|
	|	ПартииПрочихРасходов.СтатьяРасходов КАК СубконтоДт1,
	|	ПартииПрочихРасходов.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|		ТОГДА ОбъектыСтроительства.СпособСтроительства
	|	ИНАЧЕ 
	|		ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	ЕСТЬNULL(МестонахождениеОС.Местонахождение, МестонахождениеНМА.Местонахождение) КАК ПодразделениеКт,
	|	ПартииПрочихРасходов.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ПартииПрочихРасходов.АналитикаРасходов) = ТИП(Справочник.ОбъектыЭксплуатации)
	|			ТОГДА ЕСТЬNULL(СчетаОтражения.ГруппаФинансовогоУчета.СчетУчета, СчетаОтражения.СчетУчета)
	|		ИНАЧЕ СчетаОтраженияНМА.СчетУчета
	|	КОНЕЦ КАК СчетКт,
	|	
	|	ПартииПрочихРасходов.АналитикаРасходов КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Исключение НДС со счета учета ОС"" КАК Содержание
	|ИЗ
	|	ПартииПрочихРасходов КАК ПартииПрочихРасходов
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО
	|		ПартииПрочихРасходов.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ),
	|				(Организация, ОсновноеСредство) В
	|						(ВЫБРАТЬ
	|							Т.Организация,
	|							Т.Актив
	|						ИЗ
	|							ПартииПрочихРасходов_ВНА КАК Т)
	|		) КАК СчетаОтражения
	|	ПО
	|		ПартииПрочихРасходов.АналитикаРасходов = СчетаОтражения.ОсновноеСредство
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ),
	|				(Организация, НематериальныйАктив) В
	|						(ВЫБРАТЬ
	|							Т.Организация,
	|							Т.Актив
	|						ИЗ
	|							ПартииПрочихРасходов_ВНА КАК Т)
	|		) КАК СчетаОтраженияНМА
	|	ПО
	|		ПартииПрочихРасходов.АналитикаРасходов = СчетаОтраженияНМА.НематериальныйАктив
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ),
	|				(Организация, ОсновноеСредство) В
	|						(ВЫБРАТЬ
	|							Т.Организация,
	|							Т.Актив
	|						ИЗ
	|							ПартииПрочихРасходов_ВНА КАК Т)
	|		) КАК МестонахождениеОС
	|	ПО
	|		ПартииПрочихРасходов.АналитикаРасходов = МестонахождениеОС.ОсновноеСредство
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		(ВЫБРАТЬ
	|			ПУ.НематериальныйАктив,
	|			ПУ.Подразделение КАК Местонахождение
	|		ИЗ
	|			Документ.ПринятиеКУчетуНМА КАК ПУ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ),
	|				Организация В 
	|					(ВЫБРАТЬ
	|						Т.Организация
	|					ИЗ
	|						ПартииПрочихРасходов_ВНА КАК Т)
	|				И Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА) КАК ПервоначальныеСведения
	|			ПО ПУ.Ссылка = ПервоначальныеСведения.Регистратор
	|				И ПУ.НематериальныйАктив = ПервоначальныеСведения.НематериальныйАктив
	|		) КАК МестонахождениеНМА
	|	ПО
	|		ПартииПрочихРасходов.АналитикаРасходов = МестонахождениеНМА.НематериальныйАктив
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|	ПО 
	|		ОбъектыСтроительства.Ссылка = ПартииПрочихРасходов.АналитикаРасходов
	|ГДЕ
	|	&ИспользоватьВнеоборотныеАктивы2_2
	|	И (&Дата < &ДатаНачалаУчетаВнеоборотныхАктивов2_4 ИЛИ НЕ &ИспользоватьВнеоборотныеАктивы2_4)
	|	И НЕ (СчетаОтражения.СчетУчета ЕСТЬ NULL И СчетаОтраженияНМА.СчетУчета ЕСТЬ NULL)
	|	И ПартииПрочихРасходов.НалогообложениеФинПартии = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|	И ПартииПрочихРасходов.НалогообложениеПартии <> ПартииПрочихРасходов.НалогообложениеФинПартии
	|	И ТИПЗНАЧЕНИЯ(ПартииПрочихРасходов.АналитикаРасходов) В (
	|			ТИП(Справочник.ОбъектыЭксплуатации), 
	|			ТИП(Справочник.НематериальныеАктивы))
	|	И ПартииПрочихРасходов.НДСРегл <> 0
	|";
#КонецОбласти
	
#Область КорректировкаАмортизационнойПремии      // (Дт <КВ> :: Кт <ПустаяСсылка>)
	КорректировкаАмортизационнойПремии_2_2 = "
	|ВЫБРАТЬ ////Корректировка амортизационной премии с учетом изменения стоимости ОС (Дт <КВ> :: Кт <ПустаяСсылка>)
	|	ПартииПрочихРасходов.Регистратор КАК Ссылка,
	|	ПартииПрочихРасходов.Период КАК Период,
	|	ПартииПрочихРасходов.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	МестонахождениеОС.Местонахождение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаКапитальныеВложения) КАК СчетДт,
	|
	|	ПартииПрочихРасходов.АналитикаРасходов КАК СубконтоДт1,
	|	Операция.Ссылка КАК СубконтоДт2,
	|	ВЫБОР КОГДА ОбъектыСтроительства.СпособСтроительства <> ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.ПустаяСсылка) 
	|		ТОГДА ОбъектыСтроительства.СпособСтроительства
	|	ИНАЧЕ 
	|		ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный) 
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	ВЫБОР КОГДА ПартииПрочихРасходов.НалогообложениеПартии = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|			И ПартииПрочихРасходов.НалогообложениеПартии <> ПартииПрочихРасходов.НалогообложениеФинПартии ТОГДА
	|		// Увеличиваем амортизационную премию
	|		ВЫРАЗИТЬ((ПартииПрочихРасходов.НДСРегл)*(Операция.ПроцентКапитальныхВложенийВключаемыхВРасходыНУ / 100) КАК ЧИСЛО(15, 2))
	|	ИНАЧЕ
	|		// Уменьшаем амортизационную премию
	|		-ВЫРАЗИТЬ((ПартииПрочихРасходов.НДСРегл)*(Операция.ПроцентКапитальныхВложенийВключаемыхВРасходыНУ / 100) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Корректировка амортизационной премии с учетом изменения стоимости ОС"" КАК Содержание
	|	
	|ИЗ
	|	ПартииПрочихРасходов КАК ПартииПрочихРасходов
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОС.ОС КАК Строки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОС КАК Операция
	|			ПО Строки.Ссылка = Операция.Ссылка
	|			И Операция.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
	|			И Операция.Проведен
	|		ПО ПартииПрочихРасходов.АналитикаРасходов = Строки.ОсновноеСредство
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|		ПО ПартииПрочихРасходов.СтатьяРасходов = СтатьиРасходов.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ),
	|				(Организация, ОсновноеСредство) В
	|						(ВЫБРАТЬ
	|							Т.Организация,
	|							Т.Актив
	|						ИЗ
	|							ПартииПрочихРасходов_ВНА КАК Т)
	|		) КАК МестонахождениеОС
	|	ПО
	|		ПартииПрочихРасходов.АналитикаРасходов = МестонахождениеОС.ОсновноеСредство
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
	|	ПО 
	|		ОбъектыСтроительства.Ссылка = ПартииПрочихРасходов.АналитикаРасходов
	|
	|ГДЕ
	|	&ИспользоватьВнеоборотныеАктивы2_2
	|	И (&Дата < &ДатаНачалаУчетаВнеоборотныхАктивов2_4 ИЛИ НЕ &ИспользоватьВнеоборотныеАктивы2_4)
	|	И Операция.ВключитьАмортизационнуюПремиюВСоставРасходов
	|	И Операция.ПроцентКапитальныхВложенийВключаемыхВРасходыНУ <> 0
	|	И СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|	И ТИПЗНАЧЕНИЯ(ПартииПрочихРасходов.АналитикаРасходов) = ТИП(Справочник.ОбъектыЭксплуатации)
	|	И ПартииПрочихРасходов.НДСРегл <> 0
	|	И ПартииПрочихРасходов.НалогообложениеФинПартии <> ПартииПрочихРасходов.НалогообложениеПартии 
	|	И (ПартииПрочихРасходов.НалогообложениеПартии = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|		ИЛИ ПартииПрочихРасходов.НалогообложениеФинПартии = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС))
	|";
#КонецОбласти

#Область СтоимостьПрочегоАктиваНаОСиНМА              // (Дт <СчетУчетаОС/НМА> :: Кт <08.04.2>)
	СтоимостьПрочегоАктиваНаОСиНМА_2_2 = "
	|ВЫБРАТЬ ////Стоимость ОС на счет учета (Дт <СчетУчетаОС/НМА> :: Кт <08.04.2>)
	|	ПартииПрочихРасходов.Регистратор КАК Ссылка,
	|	ПартииПрочихРасходов.Период КАК Период,
	|	ПартииПрочихРасходов.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	ПартииПрочихРасходов.НДСРегл КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	ЕСТЬNULL(МестонахождениеОС.Местонахождение, МестонахождениеНМА.Местонахождение) КАК ПодразделениеДт,
	|	ПартииПрочихРасходов.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	ВЫБОР 
	|		КОГДА ТИПЗНАЧЕНИЯ(ПартииПрочихРасходов.АналитикаАктивовПассивов) = ТИП(Справочник.ОбъектыЭксплуатации)
	|			ТОГДА ЕСТЬNULL(СчетаОтражения.ГруппаФинансовогоУчета.СчетУчета, СчетаОтражения.СчетУчета)
	|		ИНАЧЕ СчетаОтраженияНМА.СчетУчета
	|	КОНЕЦ КАК СчетДт,
	|	
	|	ПартииПрочихРасходов.АналитикаАктивовПассивов КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	ПартииПрочихРасходов.Подразделение КАК ПодразделениеКт,
	|	ПартииПрочихРасходов.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|
	|	СчетаУчетаПрочихАктивов.СчетУчета КАК СчетКт,
	|
	|	СчетаУчетаПрочихАктивов.Субконто1 КАК СубконтоКт1,
	|	СчетаУчетаПрочихАктивов.Субконто2 КАК СубконтоКт2,
	|	СчетаУчетаПрочихАктивов.Субконто3 КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""НДС в стоимость актива"" КАК Содержание
	|ИЗ
	|	ПартииПрочихРасходов КАК ПартииПрочихРасходов
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиАктивовПассивов КАК СтатьиАктивовПассивов
	|	ПО
	|		ПартииПрочихРасходов.СтатьяРасходов = СтатьиАктивовПассивов.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ),
	|				(Организация, ОсновноеСредство) В
	|						(ВЫБРАТЬ
	|							Т.Организация,
	|							Т.Актив
	|						ИЗ
	|							ПартииПрочихРасходов_ВНА КАК Т)
	|		) КАК СчетаОтражения
	|	ПО
	|		ПартииПрочихРасходов.АналитикаАктивовПассивов = СчетаОтражения.ОсновноеСредство
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ),
	|				(Организация, НематериальныйАктив) В
	|						(ВЫБРАТЬ
	|							Т.Организация,
	|							Т.Актив
	|						ИЗ
	|							ПартииПрочихРасходов_ВНА КАК Т)
	|		) КАК СчетаОтраженияНМА
	|	ПО
	|		ПартииПрочихРасходов.АналитикаАктивовПассивов = СчетаОтраженияНМА.НематериальныйАктив
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ),
	|				(Организация, ОсновноеСредство) В
	|						(ВЫБРАТЬ
	|							Т.Организация,
	|							Т.Актив
	|						ИЗ
	|							ПартииПрочихРасходов_ВНА КАК Т)
	|		) КАК МестонахождениеОС
	|	ПО
	|		ПартииПрочихРасходов.АналитикаАктивовПассивов = МестонахождениеОС.ОсновноеСредство
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		(ВЫБРАТЬ
	|			ПУ.НематериальныйАктив,
	|			ПУ.Подразделение КАК Местонахождение
	|		ИЗ
	|			Документ.ПринятиеКУчетуНМА КАК ПУ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ),
	|				Организация В 
	|					(ВЫБРАТЬ
	|						Т.Организация
	|					ИЗ
	|						ПартииПрочихРасходов_ВНА КАК Т)
	|				И Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА) КАК ПервоначальныеСведения
	|			ПО ПУ.Ссылка = ПервоначальныеСведения.Регистратор
	|				И ПУ.НематериальныйАктив = ПервоначальныеСведения.НематериальныйАктив
	|		) КАК МестонахождениеНМА
	|	ПО
	|		ПартииПрочихРасходов.АналитикаАктивовПассивов = МестонахождениеНМА.НематериальныйАктив
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		СчетаУчетаПрочихАктивов КАК СчетаУчетаПрочихАктивов
	|	ПО
	|		ПартииПрочихРасходов.Организация = СчетаУчетаПрочихАктивов.Организация
	|		И ПартииПрочихРасходов.Подразделение = СчетаУчетаПрочихАктивов.Подразделение
	|		И ПартииПрочихРасходов.СтатьяРасходов = СчетаУчетаПрочихАктивов.Статья
	|		И ПартииПрочихРасходов.АналитикаАктивовПассивов = СчетаУчетаПрочихАктивов.АналитикаАктивовПассивов
	|		И ПартииПрочихРасходов.ДокументПоступленияРасходов = СчетаУчетаПрочихАктивов.ДокументПоступленияРасходов
	|		И ПартииПрочихРасходов.АналитикаУчетаПартий = СчетаУчетаПрочихАктивов.АналитикаУчетаПартий
	|		И ПартииПрочихРасходов.НаправлениеДеятельности = СчетаУчетаПрочихАктивов.НаправлениеДеятельности
	|		И ПартииПрочихРасходов.АналитикаУчетаНоменклатуры = СчетаУчетаПрочихАктивов.АналитикаУчетаНоменклатуры
	|	
	|ГДЕ
	|	&ИспользоватьВнеоборотныеАктивы2_2
	|	И (&Дата < &ДатаНачалаУчетаВнеоборотныхАктивов2_4 ИЛИ НЕ &ИспользоватьВнеоборотныеАктивы2_4)
	|	И НЕ (СчетаОтражения.СчетУчета ЕСТЬ NULL И СчетаОтраженияНМА.СчетУчета ЕСТЬ NULL)
	|	И ПартииПрочихРасходов.НалогообложениеПартии = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС) 
	|	И ПартииПрочихРасходов.НалогообложениеФинПартии <> ПартииПрочихРасходов.НалогообложениеПартии
	|	И ПартииПрочихРасходов.СтатьяРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|	И ТИПЗНАЧЕНИЯ(ПартииПрочихРасходов.АналитикаАктивовПассивов) В (
	|				ТИП(Справочник.ОбъектыЭксплуатации), 
	|				ТИП(Справочник.НематериальныеАктивы))
	|	И ПартииПрочихРасходов.НДСРегл <> 0
	|";
#КонецОбласти

#КонецОбласти

#Область УчетВнеоборотныхАктивов2_4

	#Область УвеличениеСтоимостиОС_Дт_СчетУчета__Кт_08_04_2_или_08_03
	
	УвеличениеСтоимостиОС_2_4 =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Принятие к учету ОС (Дт СчетУчета:: Кт 08.04.2, 08.03)
	|//
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьРегл КАК Сумма,
	|	Строки.Стоимость КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА) КАК ВидСчетаДт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СтоимостьНУ КАК СуммаНУДт,
	|	Строки.СтоимостьПР КАК СуммаПРДт,
	|	Строки.СтоимостьВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаКт,
	|	Строки.КорСтатьяРасходов КАК АналитикаУчетаКт,
	|	Строки.КорПодразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.КорПодразделение КАК ПодразделениеКт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	
	|	Строки.ОсновноеСредство КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.СтоимостьНУ КАК СуммаНУКт,
	|	Строки.СтоимостьПР КАК СуммаПРКт,
	|	Строки.СтоимостьВР КАК СуммаВРКт,
	|	""НДС в стоимость актива"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|	ПО Строки.Регистратор = ДокументыКОтражению.Ссылка";
	
	
	#КонецОбласти

	#Область  УвеличениеСтоимостиНМА_Дт_СчетУчета__Кт_СчетаКапитальныхЗатрат
	УвеличениеСтоимостиНМА_2_4 =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Принятие к учету  (Дт СчетУчета:: Кт СчетаКапитальныхЗатрат)
	|
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьРегл КАК Сумма,
	|	Строки.Стоимость КАК СуммаУУ,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА) КАК ВидСчетаДт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	
	|	Строки.НематериальныйАктив КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СтоимостьНУ КАК СуммаНУДт,
	|	Строки.СтоимостьПР КАК СуммаПРДт,
	|	Строки.СтоимостьВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаКт,
	|	Строки.КорСтатьяРасходов КАК АналитикаУчетаКт,
	|	Строки.КорПодразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.КорПодразделение КАК ПодразделениеКт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	
	|	Строки.НематериальныйАктив КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.СтоимостьНУ КАК СуммаНУКт,
	|	Строки.СтоимостьПР КАК СуммаПРКт,
	|	Строки.СтоимостьВР КАК СуммаВРКт,
	|	""НДС в стоимость актива"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьНМА КАК Строки
	|	ПО Строки.Регистратор = ДокументыКОтражению.Ссылка";
	#КонецОбласти

	#Область АмортизационнаяПремия_Дт_КВ__Кт_ПустаяСсылка
	
	АмортизационнаяПремия2_4 =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизационная премия (Дт КВ :: Кт <ПустаяСсылка>)
	|//
	|ВЫБРАТЬ
	|
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаКапитальныеВложения) КАК СчетДт,
	|	
	|	Строки.ОсновноеСредство КАК СубконтоДт1,
	|	ПервоначальныеСведенияОС.ДокументВводаВЭксплуатациюБУ КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.АмортизационнаяПремия КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Амортизационная премия"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС КАК Строки
	|	ПО Строки.Регистратор = ДокументыКОтражению.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОС.СрезПоследних КАК ПервоначальныеСведенияОС
	|	ПО ПервоначальныеСведенияОС.ОсновноеСредство = Строки.ОсновноеСредство
	|		И ПервоначальныеСведенияОС.Организация = Строки.Организация
	|
	|ГДЕ
	|	Строки.АмортизационнаяПремия <> 0";
	
	#КонецОбласти
	
#КонецОбласти

#Область ПередачаНДСВСтоимостьПрочегоАктива               // (Дт <08.04.2>, ХХ :: Кт <19.1, 19.3>)
	ПередачаНДСВСтоимостьПрочегоАктива_2_2 = "
	|ВЫБРАТЬ //// Передача НДС в стоимость ОС (Дт <08.04.2>, ХХ :: Кт <19.1, 19.3>)
	|	ПартииПрочихРасходов.Регистратор КАК Ссылка,
	|	ПартииПрочихРасходов.Период КАК Период,
	|	ПартииПрочихРасходов.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	ПартииПрочихРасходов.НДСРегл КАК Сумма,
	|	ПартииПрочихРасходов.НДСУпр КАК СуммаУУ,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	ПартииПрочихРасходов.Подразделение КАК ПодразделениеДт,
	|	ПартииПрочихРасходов.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|
	|	СчетаУчетаПрочихАктивов.СчетУчета КАК СчетДт,
	|
	|	СчетаУчетаПрочихАктивов.Субконто1 КАК СубконтоДт1,
	|	СчетаУчетаПрочихАктивов.Субконто2 КАК СубконтоДт2,
	|	СчетаУчетаПрочихАктивов.Субконто3 КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НДСпоПриобретеннымЦенностям) КАК ВидСчетаКт,
	|	ПартииПрочихРасходов.НалогообложениеФинПартии КАК АналитикаУчетаКт,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(АналитикаПартий.ВидЦенности, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПустаяСсылка)
	|			ТОГДА АналитикаПартий.ВидЦенности
	|		КОГДА ЕСТЬNULL(Аналитика.Номенклатура.ТипНоменклатуры, НЕОПРЕДЕЛЕНО) В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|			ТОГДА ЕСТЬNULL(ГруппыФинансовогоУчетаНоменклатуры.ВидЦенностиНДС, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)) 
	|		КОГДА ПартииПрочихРасходов.АналитикаАктивовПассивов ССЫЛКА Справочник.ОбъектыЭксплуатации
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ОС)
	|		КОГДА ПартииПрочихРасходов.АналитикаАктивовПассивов ССЫЛКА Справочник.НематериальныеАктивы
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НМА)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|	КОНЕЦ КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	
	|	АналитикаПартий.Контрагент КАК СубконтоКт1,
	|	ПартииПрочихРасходов.ДокументПоступленияРасходов КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Передача НДС в стоимость активы"" КАК Содержание
	|ИЗ
	|	ПартииПрочихРасходов КАК ПартииПрочихРасходов
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиАктивовПассивов КАК Статьи
	|	ПО
	|		ПартииПрочихРасходов.СтатьяРасходов = Статьи.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|	ПО 
	|		Аналитика.Ссылка = ПартииПрочихРасходов.АналитикаУчетаНоменклатуры
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		Справочник.КлючиАналитикиУчетаПартий КАК АналитикаПартий
	|	ПО 
	|		АналитикаПартий.Ссылка = ПартииПрочихРасходов.АналитикаУчетаПартий
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.ГруппыФинансовогоУчетаНоменклатуры КАК ГруппыФинансовогоУчетаНоменклатуры
	|	ПО
	|		Аналитика.Номенклатура.ГруппаФинансовогоУчета = ГруппыФинансовогоУчетаНоменклатуры.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		СчетаУчетаПрочихАктивов КАК СчетаУчетаПрочихАктивов
	|	ПО
	|		ПартииПрочихРасходов.Организация = СчетаУчетаПрочихАктивов.Организация
	|		И ПартииПрочихРасходов.Подразделение = СчетаУчетаПрочихАктивов.Подразделение
	|		И ПартииПрочихРасходов.СтатьяРасходов = СчетаУчетаПрочихАктивов.Статья
	|		И ПартииПрочихРасходов.АналитикаАктивовПассивов = СчетаУчетаПрочихАктивов.АналитикаАктивовПассивов
	|		И ПартииПрочихРасходов.ДокументПоступленияРасходов = СчетаУчетаПрочихАктивов.ДокументПоступленияРасходов
	|		И ПартииПрочихРасходов.АналитикаУчетаПартий = СчетаУчетаПрочихАктивов.АналитикаУчетаПартий
	|		И ПартииПрочихРасходов.НаправлениеДеятельности = СчетаУчетаПрочихАктивов.НаправлениеДеятельности
	|		И ПартииПрочихРасходов.АналитикаУчетаНоменклатуры = СчетаУчетаПрочихАктивов.АналитикаУчетаНоменклатуры
	|
	|ГДЕ
	|	ПартииПрочихРасходов.НалогообложениеПартии = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС) 
	|	И ПартииПрочихРасходов.НалогообложениеФинПартии <> ПартииПрочихРасходов.НалогообложениеПартии
	|	И ПартииПрочихРасходов.СтатьяРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|	И ПартииПрочихРасходов.НДСРегл <> 0
	|";
#КонецОбласти

#Область ЗачетПоНДС                              // (Дт <3131> :: Кт <1421.1>)
	ЗачетПоНДС = "
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Операция.СуммаНДСРазрешенногоКЗачету, 0) + ЕСТЬNULL(Операция.СуммаНДСПереносимыйЗачет,0) > ЕСТЬNULL(Операция.СуммаНДСНачисленного, 0) - ЕСТЬNULL(Операция.СуммаНДСМетодомЗачета,0)
	|			ТОГДА ЕСТЬNULL(Операция.СуммаНДСНачисленного, 0) - ЕСТЬNULL(Операция.СуммаНДСМетодомЗачета,0)
	|		ИНАЧЕ ЕСТЬNULL(Операция.СуммаНДСРазрешенногоКЗачету, 0) + ЕСТЬNULL(Операция.СуммаНДСПереносимыйЗачет,0) 
	|	КОНЕЦ КАК Сумма,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Операция.СуммаНДСРазрешенногоКЗачету, 0) + ЕСТЬNULL(Операция.СуммаНДСПереносимыйЗачет,0) > ЕСТЬNULL(Операция.СуммаНДСНачисленного, 0) - ЕСТЬNULL(Операция.СуммаНДСМетодомЗачета,0)
	|			ТОГДА (ЕСТЬNULL(Операция.СуммаНДСНачисленного, 0) - ЕСТЬNULL(Операция.СуммаНДСМетодомЗачета,0)) / КурсВалютыУпрУчета.Курс
	|		ИНАЧЕ (ЕСТЬNULL(Операция.СуммаНДСРазрешенногоКЗачету, 0) + ЕСТЬNULL(Операция.СуммаНДСПереносимыйЗачет,0)) / КурсВалютыУпрУчета.Курс 
	|	КОНЕЦ КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС) КАК СчетДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалогНаДобавленнуюСтоимостьКВозмещению) КАК СчетКт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Зачет по НДС"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспределениеНДС КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(Операция.Дата, День)
	|
	|";

#КонецОбласти

#Область СторноЗачетаПоНДСПрошлыхПериодов                              // (Дт <3131> :: Кт <1421.1>)
	СторноЗачетаПоНДСПрошлыхПериодов = "
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Ссылка.Дата КАК Период,
	|	Операция.Ссылка.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ВЫБОР
	|		КОГДА (ЕСТЬNULL(Операция.СуммаНДСРазрешенногоКЗачетуСторно, 0) + ЕСТЬNULL(Операция.СуммаНДСПереносимыйЗачетСторно,0))*(-1) > (ЕСТЬNULL(Операция.СуммаНДСНачисленногоСторно, 0) - ЕСТЬNULL(Операция.СуммаНДСМетодомЗачетаСторно,0))*(-1)
	|			ТОГДА ЕСТЬNULL(Операция.СуммаНДСНачисленногоСторно, 0) - ЕСТЬNULL(Операция.СуммаНДСМетодомЗачетаСторно,0)
	|		ИНАЧЕ ЕСТЬNULL(Операция.СуммаНДСРазрешенногоКЗачетуСторно, 0) + ЕСТЬNULL(Операция.СуммаНДСПереносимыйЗачетСторно,0) 
	|	КОНЕЦ КАК Сумма,
	|
	|	ВЫБОР
	|		КОГДА (ЕСТЬNULL(Операция.СуммаНДСРазрешенногоКЗачетуСторно, 0) + ЕСТЬNULL(Операция.СуммаНДСПереносимыйЗачетСторно,0))*(-1) > (ЕСТЬNULL(Операция.СуммаНДСНачисленногоСторно, 0) - ЕСТЬNULL(Операция.СуммаНДСМетодомЗачетаСторно,0))*(-1)
	|			ТОГДА (ЕСТЬNULL(Операция.СуммаНДСНачисленногоСторно, 0) - ЕСТЬNULL(Операция.СуммаНДСМетодомЗачетаСторно,0)) / КурсВалютыУпрУчета.Курс
	|		ИНАЧЕ (ЕСТЬNULL(Операция.СуммаНДСРазрешенногоКЗачетуСторно, 0) + ЕСТЬNULL(Операция.СуммаНДСПереносимыйЗачетСторно,0)) / КурсВалютыУпрУчета.Курс 
	|	КОНЕЦ КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС) КАК СчетДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалогНаДобавленнуюСтоимостьКВозмещению) КАК СчетКт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Сторно зачета по НДС за "" + Операция.ОписаниеПериодаКорректировки КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспределениеНДС.КорректировкаНДСПрошлыхПериодов КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(Операция.Ссылка.Дата, День)
	|
	|ГДЕ 
	|	(ВЫБОР
	|		КОГДА (ЕСТЬNULL(Операция.СуммаНДСРазрешенногоКЗачетуСторно, 0) + ЕСТЬNULL(Операция.СуммаНДСПереносимыйЗачетСторно,0))*(-1) > (ЕСТЬNULL(Операция.СуммаНДСНачисленногоСторно, 0) - ЕСТЬNULL(Операция.СуммаНДСМетодомЗачетаСторно,0))*(-1)
	|			ТОГДА ЕСТЬNULL(Операция.СуммаНДСНачисленногоСторно, 0) - ЕСТЬNULL(Операция.СуммаНДСМетодомЗачетаСторно,0)
	|		ИНАЧЕ ЕСТЬNULL(Операция.СуммаНДСРазрешенногоКЗачетуСторно, 0) + ЕСТЬNULL(Операция.СуммаНДСПереносимыйЗачетСторно,0) 
	|	КОНЕЦ)*(-1) <> ВЫБОР
	|		КОГДА ЕСТЬNULL(Операция.СуммаНДСРазрешенногоКЗачетуКорректировка, 0) + ЕСТЬNULL(Операция.СуммаНДСПереносимыйЗачетКорректировка,0) > ЕСТЬNULL(Операция.СуммаНДСНачисленногоКорректировка, 0) - ЕСТЬNULL(Операция.СуммаНДСМетодомЗачетаКорректировка,0)
	|			ТОГДА ЕСТЬNULL(Операция.СуммаНДСНачисленногоКорректировка, 0) - ЕСТЬNULL(Операция.СуммаНДСМетодомЗачетаКорректировка,0)
	|		ИНАЧЕ ЕСТЬNULL(Операция.СуммаНДСРазрешенногоКЗачетуКорректировка, 0) + ЕСТЬNULL(Операция.СуммаНДСПереносимыйЗачетКорректировка,0) 
	|	КОНЕЦ
	|";

#КонецОбласти

#Область КорректировкаЗачетаПоНДСПрошлыхПериодов                              // (Дт <3131> :: Кт <1421.1>)
	КорректировкаЗачетаПоНДСПрошлыхПериодов = "
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Ссылка.Дата КАК Период,
	|	Операция.Ссылка.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Операция.СуммаНДСРазрешенногоКЗачетуКорректировка, 0) + ЕСТЬNULL(Операция.СуммаНДСПереносимыйЗачетКорректировка,0) > ЕСТЬNULL(Операция.СуммаНДСНачисленногоКорректировка, 0) - ЕСТЬNULL(Операция.СуммаНДСМетодомЗачетаКорректировка,0)
	|			ТОГДА ЕСТЬNULL(Операция.СуммаНДСНачисленногоКорректировка, 0) - ЕСТЬNULL(Операция.СуммаНДСМетодомЗачетаКорректировка,0)
	|		ИНАЧЕ ЕСТЬNULL(Операция.СуммаНДСРазрешенногоКЗачетуКорректировка, 0) + ЕСТЬNULL(Операция.СуммаНДСПереносимыйЗачетКорректировка,0) 
	|	КОНЕЦ КАК Сумма,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Операция.СуммаНДСРазрешенногоКЗачетуКорректировка, 0) + ЕСТЬNULL(Операция.СуммаНДСПереносимыйЗачетКорректировка,0) > ЕСТЬNULL(Операция.СуммаНДСНачисленногоКорректировка, 0) - ЕСТЬNULL(Операция.СуммаНДСМетодомЗачетаКорректировка,0)
	|			ТОГДА (ЕСТЬNULL(Операция.СуммаНДСНачисленногоКорректировка, 0) - ЕСТЬNULL(Операция.СуммаНДСМетодомЗачетаКорректировка,0)) / КурсВалютыУпрУчета.Курс
	|		ИНАЧЕ (ЕСТЬNULL(Операция.СуммаНДСРазрешенногоКЗачетуКорректировка, 0) + ЕСТЬNULL(Операция.СуммаНДСПереносимыйЗачетКорректировка,0)) / КурсВалютыУпрУчета.Курс 
	|	КОНЕЦ КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС) КАК СчетДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалогНаДобавленнуюСтоимостьКВозмещению) КАК СчетКт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Корректировка зачета по НДС за "" + Операция.ОписаниеПериодаКорректировки КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспределениеНДС.КорректировкаНДСПрошлыхПериодов КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(Операция.Ссылка.Дата, День)
	|
	|ГДЕ 
	|	(ВЫБОР
	|		КОГДА (ЕСТЬNULL(Операция.СуммаНДСРазрешенногоКЗачетуСторно, 0) + ЕСТЬNULL(Операция.СуммаНДСПереносимыйЗачетСторно,0))*(-1) > (ЕСТЬNULL(Операция.СуммаНДСНачисленногоСторно, 0) - ЕСТЬNULL(Операция.СуммаНДСМетодомЗачетаСторно,0))*(-1)
	|			ТОГДА ЕСТЬNULL(Операция.СуммаНДСНачисленногоСторно, 0) - ЕСТЬNULL(Операция.СуммаНДСМетодомЗачетаСторно,0)
	|		ИНАЧЕ ЕСТЬNULL(Операция.СуммаНДСРазрешенногоКЗачетуСторно, 0) + ЕСТЬNULL(Операция.СуммаНДСПереносимыйЗачетСторно,0) 
	|	КОНЕЦ)*(-1) <> ВЫБОР
	|		КОГДА ЕСТЬNULL(Операция.СуммаНДСРазрешенногоКЗачетуКорректировка, 0) + ЕСТЬNULL(Операция.СуммаНДСПереносимыйЗачетКорректировка,0) > ЕСТЬNULL(Операция.СуммаНДСНачисленногоКорректировка, 0) - ЕСТЬNULL(Операция.СуммаНДСМетодомЗачетаКорректировка,0)
	|			ТОГДА ЕСТЬNULL(Операция.СуммаНДСНачисленногоКорректировка, 0) - ЕСТЬNULL(Операция.СуммаНДСМетодомЗачетаКорректировка,0)
	|		ИНАЧЕ ЕСТЬNULL(Операция.СуммаНДСРазрешенногоКЗачетуКорректировка, 0) + ЕСТЬNULL(Операция.СуммаНДСПереносимыйЗачетКорректировка,0) 
	|	КОНЕЦ
	|";

#КонецОбласти

#Область СписаниеНДСНеРазрешенногоКЗачету        // (Дт <7210> :: Кт <1421.1>)
	СписаниеНДСНеРазрешенногоКЗачету = "
	|ВЫБРАТЬ //// Зачет разрешенной суммы по НДС (Дт <7210> :: Кт <1421.1>)
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ЕСТЬNULL(Операция.СуммаНДСНеРазрешенногоКЗачету, 0)  КАК Сумма,
	|	ЕСТЬNULL(Операция.СуммаНДСНеРазрешенногоКЗачету, 0) / КурсВалютыУпрУчета.Курс  КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаДт,
	|	Операция.СтатьяРасходовНеНДС КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Операция.АналитикаРасходовНеНДС) = ТИП(Справочник.СтруктураПредприятия)
	|			ТОГДА Операция.АналитикаРасходовНеНДС
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|
	|	Операция.СтатьяРасходовНеНДС КАК СубконтоДт1,
	|	Операция.АналитикаРасходовНеНДС КАК СубконтоДт2,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалогНаДобавленнуюСтоимостьКВозмещению) КАК СчетКт,
	|
	|	ЗНАЧЕНИЕ (Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Списание НДС не разрешенного к зачету"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспределениеНДС КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(Операция.Дата, День)
	|
	|ГДЕ
	|	ЕСТЬNULL(Операция.СуммаНДСНеРазрешенногоКЗачету, 0) <> 0
	|";

#КонецОбласти

#Область СторноСписанияНДСНеРазрешенногоКЗачетуПрошлыхПериодо        // (Дт <7210> :: Кт <1421.1>)
	СторноСписанияНДСНеРазрешенногоКЗачетуПрошлыхПериодо = "
	|ВЫБРАТЬ //// Зачет разрешенной суммы по НДС (Дт <7210> :: Кт <1421.1>)
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ЕСТЬNULL(Корректировка.СуммаНДСНеРазрешенногоКЗачетуСторно, 0)  КАК Сумма,
	|	ЕСТЬNULL(Корректировка.СуммаНДСНеРазрешенногоКЗачетуСторно, 0) / КурсВалютыУпрУчета.Курс  КАК СуммаУУ,
	|
	|	ВЫБОР
	|		КОГДА Операция.ВариантКорректировкиРаспределенияНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыКорректировкиРаспределенияНДС.НаРасходахТекущегоПериода)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВидСчетаДт,
	|	ВЫБОР
	|		КОГДА Операция.ВариантКорректировкиРаспределенияНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыКорректировкиРаспределенияНДС.НаРасходахТекущегоПериода)
	|			ТОГДА Операция.СтатьяРасходовНеНДС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ВЫБОР
	|		КОГДА Операция.ВариантКорректировкиРаспределенияНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыКорректировкиРаспределенияНДС.НаРасходахТекущегоПериода)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|		ИНАЧЕ 
	|			ВЫБОР
	|				КОГДА НАЧАЛОПЕРИОДА(Корректировка.КорректируемыйПериод, ГОД) = НАЧАЛОПЕРИОДА(Операция.Дата, ГОД)
	|					ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода)
	|				ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НераспределеннаяПрибыльНепокрытыйУбытокПредыдущихЛет)
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетДт,
	|
	|	ВЫБОР
	|		КОГДА Операция.ВариантКорректировкиРаспределенияНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыКорректировкиРаспределенияНДС.НаРасходахТекущегоПериода)
	|			ТОГДА Операция.СтатьяРасходовНеНДС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СубконтоДт1,
	|	ВЫБОР
	|		КОГДА Операция.ВариантКорректировкиРаспределенияНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыКорректировкиРаспределенияНДС.НаРасходахТекущегоПериода)
	|			ТОГДА Операция.АналитикаРасходовНеНДС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СубконтоДт2,
	|	ВЫБОР
	|		КОГДА Операция.ВариантКорректировкиРаспределенияНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыКорректировкиРаспределенияНДС.НаРасходахТекущегоПериода)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалогНаДобавленнуюСтоимостьКВозмещению) КАК СчетКт,
	|
	|	ЗНАЧЕНИЕ (Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Сторно списания НДС не разрешенного к зачету за период "" + Корректировка.ОписаниеПериодаКорректировки КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспределениеНДС КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспределениеНДС.КорректировкаНДСПрошлыхПериодов КАК Корректировка
	|	ПО
	|		ДокументыКОтражению.Ссылка = Корректировка.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(Операция.Дата, День)
	|
	|ГДЕ
	|	ЕСТЬNULL(Корректировка.СуммаНДСНеРазрешенногоКЗачетуСторно, 0) <> 0
	|	И ЕСТЬNULL(Корректировка.СуммаНДСНеРазрешенногоКЗачетуСторно, 0)*(-1) <> ЕСТЬNULL(Корректировка.СуммаНДСНеРазрешенногоКЗачетуКорректировка, 0)
	|";

#КонецОбласти

#Область КорректировкаСписанияНДСНеРазрешенногоКЗачетуПрошлыхПериодо        // (Дт <7210> :: Кт <1421.1>)
	КорректировкаСписанияНДСНеРазрешенногоКЗачетуПрошлыхПериодо = "
	|ВЫБРАТЬ //// Зачет разрешенной суммы по НДС (Дт <7210> :: Кт <1421.1>)
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ЕСТЬNULL(Корректировка.СуммаНДСНеРазрешенногоКЗачетуКорректировка, 0)  КАК Сумма,
	|	ЕСТЬNULL(Корректировка.СуммаНДСНеРазрешенногоКЗачетуКорректировка, 0) / КурсВалютыУпрУчета.Курс  КАК СуммаУУ,
	|
	|	ВЫБОР
	|		КОГДА Операция.ВариантКорректировкиРаспределенияНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыКорректировкиРаспределенияНДС.НаРасходахТекущегоПериода)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВидСчетаДт,
	|	ВЫБОР
	|		КОГДА Операция.ВариантКорректировкиРаспределенияНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыКорректировкиРаспределенияНДС.НаРасходахТекущегоПериода)
	|			ТОГДА Операция.СтатьяРасходовНеНДС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ВЫБОР
	|		КОГДА Операция.ВариантКорректировкиРаспределенияНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыКорректировкиРаспределенияНДС.НаРасходахТекущегоПериода)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|		ИНАЧЕ 
	|			ВЫБОР
	|				КОГДА НАЧАЛОПЕРИОДА(Корректировка.КорректируемыйПериод, ГОД) = НАЧАЛОПЕРИОДА(Операция.Дата, ГОД)
	|					ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода)
	|				ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НераспределеннаяПрибыльНепокрытыйУбытокПредыдущихЛет)
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетДт,
	|
	|	ВЫБОР
	|		КОГДА Операция.ВариантКорректировкиРаспределенияНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыКорректировкиРаспределенияНДС.НаРасходахТекущегоПериода)
	|			ТОГДА Операция.СтатьяРасходовНеНДС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СубконтоДт1,
	|	ВЫБОР
	|		КОГДА Операция.ВариантКорректировкиРаспределенияНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыКорректировкиРаспределенияНДС.НаРасходахТекущегоПериода)
	|			ТОГДА Операция.АналитикаРасходовНеНДС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СубконтоДт2,
	|	ВЫБОР
	|		КОГДА Операция.ВариантКорректировкиРаспределенияНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыКорректировкиРаспределенияНДС.НаРасходахТекущегоПериода)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалогНаДобавленнуюСтоимостьКВозмещению) КАК СчетКт,
	|
	|	ЗНАЧЕНИЕ (Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Корректировка списания НДС не разрешенного к зачету за период "" + Корректировка.ОписаниеПериодаКорректировки КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспределениеНДС КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспределениеНДС.КорректировкаНДСПрошлыхПериодов КАК Корректировка
	|	ПО
	|		ДокументыКОтражению.Ссылка = Корректировка.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(Операция.Дата, День)
	|
	|ГДЕ
	|	ЕСТЬNULL(Корректировка.СуммаНДСНеРазрешенногоКЗачетуСторно, 0) <> 0
	|	И ЕСТЬNULL(Корректировка.СуммаНДСНеРазрешенногоКЗачетуСторно, 0)*(-1) <> ЕСТЬNULL(Корректировка.СуммаНДСНеРазрешенногоКЗачетуКорректировка, 0)
	|";

#КонецОбласти

#Область ЗачетПоНДСМетодомЗачета                 // (Дт <3130> :: Кт <1421>)
	ЗачетПоНДСМетодомЗачета = "
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ЕСТЬNULL(Операция.СуммаНДСМетодомЗачета, 0) КАК Сумма,
	|	ЕСТЬNULL(Операция.СуммаНДСМетодомЗачета, 0) / КурсВалютыУпрУчета.Курс КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС) КАК СчетДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалогНаДобавленнуюСтоимостьКВозмещению) КАК СчетКт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Зачет по НДС методом зачета"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Документ.РаспределениеНДС КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(Операция.Дата, День)
	|";

#КонецОбласти

#Область СторноЗачетаПоНДСМетодомЗачетаПрошлыхПериодов                 // (Дт <3130> :: Кт <1421>)
	СторноЗачетаПоНДСМетодомЗачетаПрошлыхПериодов = "
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ЕСТЬNULL(Корректировка.СуммаНДСМетодомЗачетаСторно, 0) КАК Сумма,
	|	ЕСТЬNULL(Корректировка.СуммаНДСМетодомЗачетаСторно, 0) / КурсВалютыУпрУчета.Курс КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС) КАК СчетДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалогНаДобавленнуюСтоимостьКВозмещению) КАК СчетКт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Сторно зачета по НДС методом зачета за период "" + Корректировка.ОписаниеПериодаКорректировки КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Документ.РаспределениеНДС КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Документ.РаспределениеНДС.КорректировкаНДСПрошлыхПериодов КАК Корректировка
	|	ПО
	|		ДокументыКОтражению.Ссылка = Корректировка.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(Операция.Дата, День)
	|ГДЕ
	|	ЕСТЬNULL(Корректировка.СуммаНДСМетодомЗачетаСторно, 0)*(-1) <> ЕСТЬNULL(Корректировка.СуммаНДСМетодомЗачетаКорректировка, 0)
	|";

#КонецОбласти

#Область КорректировкаЗачетаПоНДСМетодомЗачетаПрошлыхПериодов                 // (Дт <3130> :: Кт <1421>)
	КорректировкаЗачетаПоНДСМетодомЗачетаПрошлыхПериодов = "
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ЕСТЬNULL(Корректировка.СуммаНДСМетодомЗачетаКорректировка, 0) КАК Сумма,
	|	ЕСТЬNULL(Корректировка.СуммаНДСМетодомЗачетаКорректировка, 0) / КурсВалютыУпрУчета.Курс КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС) КАК СчетДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалогНаДобавленнуюСтоимостьКВозмещению) КАК СчетКт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Корректировка зачета по НДС методом зачета за период "" + Корректировка.ОписаниеПериодаКорректировки КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Документ.РаспределениеНДС КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Документ.РаспределениеНДС.КорректировкаНДСПрошлыхПериодов КАК Корректировка
	|	ПО
	|		ДокументыКОтражению.Ссылка = Корректировка.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(Операция.Дата, День)
	|ГДЕ
	|	ЕСТЬNULL(Корректировка.СуммаНДСМетодомЗачетаСторно, 0)*(-1) <> ЕСТЬNULL(Корректировка.СуммаНДСМетодомЗачетаКорректировка, 0)
	|";

#КонецОбласти

#Область НДСОбособленныхПодразделений            // (Дт <1240/3131> :: Кт <3131/3340>
	НДСОбособленныхПодразделений = "
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ЕСТЬNULL(Строки.СуммаНДС, 0) КАК Сумма,
	|	ЕСТЬNULL(Строки.СуммаНДС, 0) / КурсВалютыУпрУчета.Курс КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочнаяДебиторскаяЗадолженностьФилиаловИСтруктурныхПодразделений) КАК СчетДт,
	|
	|	Строки.ОбособленноеПодразделение КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	Строки.СчетУчетаНДС КАК СчетКт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""НДС обособленных подразделений"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспределениеНДС КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспределениеНДС.НДСОбособленныхПодразделений КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(Операция.Дата, День)
	|
	|	ГДЕ
	|	Строки.СчетУчетаНДС.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Строки.ОбособленноеПодразделение КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ЕСТЬNULL(Строки.СуммаНДС, 0) КАК Сумма,
	|	ЕСТЬNULL(Строки.СуммаНДС, 0) / КурсВалютыУпрУчета.Курс КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	Строки.СчетУчетаНДС КАК СчетДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочнаяКредиторскаяЗадолженностьФилиаламИСтруктурнымПодразделениям) КАК СчетКт,
	|
	|	Операция.Организация КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""НДС обособленных подразделений"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспределениеНДС КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспределениеНДС.НДСОбособленныхПодразделений КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(Операция.Дата, День)
	|
	|ГДЕ
	|	Строки.СчетУчетаНДС.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|
	|";

#КонецОбласти

#Область НДСКВозмещениюОбособленныхПодразделений  // (Дт <1421/3340> :: Кт <1240/1421>
	НДСКВозмещениюОбособленныхПодразделений = "
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Строки.ОбособленноеПодразделение КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ЕСТЬNULL(Строки.СуммаНДС, 0) КАК Сумма,
	|	ЕСТЬNULL(Строки.СуммаНДС, 0) / КурсВалютыУпрУчета.Курс КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочнаяДебиторскаяЗадолженностьФилиаловИСтруктурныхПодразделений) КАК СчетДт,
	|
	|	Операция.Организация КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	Строки.СчетУчетаНДС КАК СчетКт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""НДС обособленных подразделений"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспределениеНДС КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспределениеНДС.НДСОбособленныхПодразделений КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(Операция.Дата, День)
	|
	|	ГДЕ
	|	Строки.СчетУчетаНДС.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	ЕСТЬNULL(Строки.СуммаНДС, 0) КАК Сумма,
	|	ЕСТЬNULL(Строки.СуммаНДС, 0) / КурсВалютыУпрУчета.Курс КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	Строки.СчетУчетаНДС КАК СчетДт,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог) КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочнаяКредиторскаяЗадолженностьФилиаламИСтруктурнымПодразделениям) КАК СчетКт,
	|
	|	Строки.ОбособленноеПодразделение КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""НДС обособленных подразделений"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспределениеНДС КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспределениеНДС.НДСОбособленныхПодразделений КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		КурсыВалют КАК КурсВалютыУпрУчета
	|	ПО
	|		КурсВалютыУпрУчета.Валюта = &ВалютаУпрУчета
	|		И КурсВалютыУпрУчета.Дата = НАЧАЛОПЕРИОДА(Операция.Дата, День)
	|
	|ГДЕ
	|	Строки.СчетУчетаНДС.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|
	|";

#КонецОбласти

	ТекстыОтражения = Новый Массив;
	// Общие фрагменты
	ТекстыОтражения.Добавить(ЗачетПоНДС);
	ТекстыОтражения.Добавить(СторноЗачетаПоНДСПрошлыхПериодов);
	ТекстыОтражения.Добавить(КорректировкаЗачетаПоНДСПрошлыхПериодов);
	ТекстыОтражения.Добавить(СписаниеНДСНеРазрешенногоКЗачету);
	ТекстыОтражения.Добавить(СторноСписанияНДСНеРазрешенногоКЗачетуПрошлыхПериодо);
	ТекстыОтражения.Добавить(КорректировкаСписанияНДСНеРазрешенногоКЗачетуПрошлыхПериодо);
	ТекстыОтражения.Добавить(ЗачетПоНДСМетодомЗачета);
	ТекстыОтражения.Добавить(СторноЗачетаПоНДСМетодомЗачетаПрошлыхПериодов);
	ТекстыОтражения.Добавить(КорректировкаЗачетаПоНДСМетодомЗачетаПрошлыхПериодов);
	ТекстыОтражения.Добавить(НДСОбособленныхПодразделений);
	ТекстыОтражения.Добавить(НДСКВозмещениюОбособленныхПодразделений);
	//ТекстыОтражения.Добавить(ПередачаНДСВСтоимостьОС);
	//ТекстыОтражения.Добавить(ИсключениеНДСИзСтоимостиОС);
	//// Учет внеоборотных активов 2_2
	//ТекстыОтражения.Добавить(СтоимостьОСНаСчетУчета_2_2);
	//ТекстыОтражения.Добавить(ИсключениеНДССоСчетаУчетаОС_2_2);
	//ТекстыОтражения.Добавить(КорректировкаАмортизационнойПремии_2_2);
	//ТекстыОтражения.Добавить(ПередачаНДСВСтоимостьПрочегоАктива_2_2);
	//ТекстыОтражения.Добавить(СтоимостьПрочегоАктиваНаОСиНМА_2_2);
	//ТекстыОтражения.Добавить(СтоимостьОСВРасходыНУ_2_2);
	//// Учет внеоборотных активов 2_4
	//ТекстыОтражения.Добавить(УвеличениеСтоимостиОС_2_4);
	//ТекстыОтражения.Добавить(УвеличениеСтоимостиНМА_2_4);
	//ВнеоборотныеАктивыСлужебный.ТекстЗапросаНачислениеАмортизацииОС(ТекстыОтражения);
	//ТекстыОтражения.Добавить(АмортизационнаяПремия2_4);
	
	Возврат СтрСоединить(ТекстыОтражения, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
КонецФункции

// Функция возвращает текст запроса дополнительных временных таблиц, 
// необходимых для отражения в регламентированном учете.
//
// Возвращаемое значение:
//	ТекстЗапроса - Строка - Текст запроса создания временных таблиц.
//
Функция ТекстЗапросаВТОтраженияВРеглУчете() Экспорт
	
	СписокЗапросов = Новый Массив;
	
	ВнеоборотныеАктивыСлужебный.ТекстЗапросаВТНачислениеАмортизацииОС(СписокЗапросов);
	
	#Область ПартииПрочихРасходов
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Партии.Регистратор                 КАК Регистратор,
	|	Партии.Период                      КАК Период,
	|	Партии.Организация                 КАК Организация,
	|	Партии.Подразделение               КАК Подразделение,
	|	Партии.НаправлениеДеятельности     КАК НаправлениеДеятельности,
	|	Партии.СтатьяРасходов              КАК СтатьяРасходов,
	|	Партии.АналитикаРасходов           КАК АналитикаРасходов,
	|	Партии.АналитикаАктивовПассивов    КАК АналитикаАктивовПассивов,
	|	Партии.ДокументПоступленияРасходов КАК ДокументПоступленияРасходов,
	|	ВЫБОР
	|		КОГДА Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров)
	|				И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаНачалаДействия150ФЗ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|		КОГДА Партии.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|		ИНАЧЕ Партии.НалогообложениеНДС
	|	КОНЕЦ КАК НалогообложениеПартии,
	|	
	|	ВЫБОР 
	|		КОГДА Партии.ВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|			ТОГДА // Партионный учет версия 2.2
	|				ВЫБОР
	|					КОГДА Партии.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров)
	|							И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаНачалаДействия150ФЗ
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|					КОГДА Партии.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|					ИНАЧЕ Партии.ВидДеятельностиНДС
	|				КОНЕЦ
	|			ИНАЧЕ  // Партионный учет версия 2.1
	|				ВЫБОР
	|					КОГДА АналитикаПартий.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭкспортНесырьевыхТоваров)
	|							И ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1,1,1)) >= &ДатаНачалаДействия150ФЗ
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|					КОГДА АналитикаПартий.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|					ИНАЧЕ АналитикаПартий.НалогообложениеНДС
	|				КОНЕЦ
	|	КОНЕЦ                              КАК НалогообложениеФинПартии,
	|	Партии.АналитикаУчетаПартий        КАК АналитикаУчетаПартий,
	|	Партии.АналитикаУчетаНоменклатуры  КАК АналитикаУчетаНоменклатуры,
	|	Партии.СтатьяОтраженияРасходов     КАК СтатьяОтраженияРасходов,
	|	Партии.НДСРегл                     КАК НДСРегл,
	|	Партии.НДСУпр                     КАК НДСУпр
	|ПОМЕСТИТЬ ПартииПрочихРасходов
	|ИЗ
	|	РегистрНакопления.ПартииПрочихРасходов КАК Партии
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Справочник.КлючиАналитикиУчетаПартий КАК АналитикаПартий
	|	ПО 
	|		АналитикаПартий.Ссылка = Партии.АналитикаУчетаПартий
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|	ПО
	|		ДанныеПервичныхДокументов.Организация = Партии.Организация
	|		И ДанныеПервичныхДокументов.Документ = Партии.ДокументПоступленияРасходов
	|
	|ГДЕ
	|	Партии.Регистратор = &Ссылка
	|;
	|
	|///////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПартииПрочихРасходов.Организация КАК Организация,
	|	ПартииПрочихРасходов.АналитикаРасходов КАК Актив
	|ПОМЕСТИТЬ ПартииПрочихРасходов_ВНА
	|ИЗ
	|	ПартииПрочихРасходов КАК ПартииПрочихРасходов
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ПартииПрочихРасходов.АналитикаРасходов) В (
	|			ТИП(Справочник.ОбъектыЭксплуатации),
	|			ТИП(Справочник.НематериальныеАктивы))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПартииПрочихРасходов.Организация КАК Организация,
	|	ПартииПрочихРасходов.АналитикаАктивовПассивов КАК Актив
	|ИЗ
	|	ПартииПрочихРасходов КАК ПартииПрочихРасходов
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ПартииПрочихРасходов.АналитикаАктивовПассивов) В (
	|			ТИП(Справочник.ОбъектыЭксплуатации),
	|			ТИП(Справочник.НематериальныеАктивы))
	|;
	|
	|ВЫБРАТЬ
	|	ПартииПрочихРасходов.Организация КАК Организация,
	|	ПартииПрочихРасходов.Подразделение КАК Подразделение,
	|	ПартииПрочихРасходов.СтатьяРасходов КАК Статья,
	|	ПартииПрочихРасходов.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|	ПартииПрочихРасходов.ДокументПоступленияРасходов КАК ДокументПоступленияРасходов,
	|	ПартииПрочихРасходов.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	ПартииПрочихРасходов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ПартииПрочихРасходов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	МАКСИМУМ(ЕСТЬNULL(ПриобретениеУслугПрочихАктивов.СчетУчета, ЕСТЬNULL(КорректировкаПриобретения.СчетУчета ,ВнутреннееПотреблениеТоваров.СчетУчета))) КАК СчетУчета,
	|	МАКСИМУМ(ЕСТЬNULL(ПриобретениеУслугПрочихАктивов.Субконто1, ЕСТЬNULL(КорректировкаПриобретения.Субконто1 ,ВнутреннееПотреблениеТоваров.Субконто1))) КАК Субконто1,
	|	МАКСИМУМ(ЕСТЬNULL(ПриобретениеУслугПрочихАктивов.Субконто2, ЕСТЬNULL(КорректировкаПриобретения.Субконто2 ,ВнутреннееПотреблениеТоваров.Субконто2))) КАК Субконто2,
	|	МАКСИМУМ(ЕСТЬNULL(ПриобретениеУслугПрочихАктивов.Субконто3, ЕСТЬNULL(КорректировкаПриобретения.Субконто3 ,ВнутреннееПотреблениеТоваров.Субконто3))) КАК Субконто3
	|ПОМЕСТИТЬ СчетаУчетаПрочихАктивов
	|ИЗ
	|	ПартииПрочихРасходов КАК ПартииПрочихРасходов
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ПартииПрочихРасходов КАК ПартииПрочихРасходовПриход
	|	ПО
	|		ПартииПрочихРасходовПриход.Организация = ПартииПрочихРасходов.Организация
	|		И ПартииПрочихРасходовПриход.Подразделение = ПартииПрочихРасходов.Подразделение
	|		И ПартииПрочихРасходовПриход.СтатьяРасходов = ПартииПрочихРасходов.СтатьяРасходов
	|		И ПартииПрочихРасходовПриход.АналитикаАктивовПассивов = ПартииПрочихРасходов.АналитикаАктивовПассивов
	|		И ПартииПрочихРасходовПриход.ДокументПоступленияРасходов = ПартииПрочихРасходов.ДокументПоступленияРасходов
	|		И ПартииПрочихРасходовПриход.АналитикаУчетаПартий = ПартииПрочихРасходов.АналитикаУчетаПартий
	|		И ПартииПрочихРасходовПриход.НаправлениеДеятельности = ПартииПрочихРасходов.НаправлениеДеятельности
	|		И ПартииПрочихРасходовПриход.АналитикаУчетаНоменклатуры = ПартииПрочихРасходов.АналитикаУчетаНоменклатуры
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.ПриобретениеУслугПрочихАктивов.Расходы КАК ПриобретениеУслугПрочихАктивов
	|	ПО
	|		ПартииПрочихРасходовПриход.Регистратор = ПриобретениеУслугПрочихАктивов.Ссылка
	|		И ПартииПрочихРасходовПриход.СтатьяРасходов = ПриобретениеУслугПрочихАктивов.СтатьяРасходов
	|		И ПартииПрочихРасходовПриход.АналитикаАктивовПассивов = ПриобретениеУслугПрочихАктивов.АналитикаАктивовПассивов
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.КорректировкаПриобретения.Расхождения КАК КорректировкаПриобретения
	|	ПО
	|		ПартииПрочихРасходовПриход.Регистратор = КорректировкаПриобретения.Ссылка
	|		И ПартииПрочихРасходовПриход.СтатьяРасходов = КорректировкаПриобретения.СтатьяРасходов
	|		И ПартииПрочихРасходовПриход.АналитикаАктивовПассивов = КорректировкаПриобретения.АналитикаАктивовПассивов
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.ВнутреннееПотреблениеТоваров.Товары КАК ВнутреннееПотреблениеТоваров
	|	ПО
	|		ПартииПрочихРасходовПриход.Регистратор = ВнутреннееПотреблениеТоваров.Ссылка
	|		И ПартииПрочихРасходовПриход.СтатьяРасходов = ВнутреннееПотреблениеТоваров.СтатьяРасходов
	|		И ПартииПрочихРасходовПриход.АналитикаАктивовПассивов = ВнутреннееПотреблениеТоваров.АналитикаАктивовПассивов
	|	
	|ГДЕ
	|	ПартииПрочихРасходов.СтатьяРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|	И ПартииПрочихРасходов.СтатьяОтраженияРасходов = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	И ПартииПрочихРасходов.НалогообложениеПартии = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииПрочихРасходов.Организация,
	|	ПартииПрочихРасходов.Подразделение,
	|	ПартииПрочихРасходов.СтатьяРасходов,
	|	ПартииПрочихРасходов.АналитикаАктивовПассивов,
	|	ПартииПрочихРасходов.ДокументПоступленияРасходов,
	|	ПартииПрочихРасходов.АналитикаУчетаПартий,
	|	ПартииПрочихРасходов.НаправлениеДеятельности,
	|	ПартииПрочихРасходов.АналитикаУчетаНоменклатуры";
	СписокЗапросов.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	СписокЗапросов.Добавить(Символы.ПС);
	
	Возврат СтрСоединить(СписокЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВПакете());
	
КонецФункции

//-- НЕ УТ

// Возвращает признак необходимости распределения НДС по товарам
//
// Параметры:
// 	Организация -  СправочникСсылка.Организации - Организация, в которой выполняется распределение НДС.
// 	Период -  Дата - Период выполнения распределения НДС.
//
// Возвращаемое значение:
// 	Результат - Булево - Признак необходимости распределения НДС по товарам.
//
Функция НеобходимоРаспределениеНДСПоТоварам(Организация, Знач Период) Экспорт
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1
	|ИЗ
	|	РегистрНакопления.ПартииПрочихРасходов КАК ПартииПрочихРасходов
	|ГДЕ
	|	ПартииПрочихРасходов.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПартииПрочихРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ПартииПрочихРасходов.Организация = &Организация
	|	И ПартииПрочихРасходов.СтатьяРасходов = НЕОПРЕДЕЛЕНО
	|	И ПартииПрочихРасходов.НДСРегл <> 0
	|";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоКвартала(Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	
	Результат = НЕ Запрос.Выполнить().Пустой();
	
	Возврат Результат;
	
КонецФункции

// Возвращает признак необходимости распределения НДС за период
//
// Параметры:
// 	Организация -  СправочникСсылка.Организации - Организация, в которой выполняется распределение НДС.
// 	Период -  Дата - Период выполнения распределения НДС.
//
// Возвращаемое значение:
// 	Результат - Булево - Признак необходимости распределения НДС.
//
Функция НеобходимоРаспределениеНДС(Организация, Знач Период) Экспорт
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатьиРасходов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СтатьиДопРасходов
	|ИЗ
	|	ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|ГДЕ
	|	СтатьиРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1 
	|	1
	|ИЗ
	|	РегистрНакопления.ПартииПрочихРасходов КАК ПартииПрочихРасходов
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтатьиДопРасходов КАК СтатьиДопРасходов
	|		ПО ПартииПрочихРасходов.СтатьяРасходов = СтатьиДопРасходов.Ссылка
	|ГДЕ
	|	ПартииПрочихРасходов.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПартииПрочихРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ПартииПрочихРасходов.Организация = &Организация
	|	И СтатьиДопРасходов.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПартииПрочихРасходовОстатки.Организация
	|ИЗ
	|	РегистрНакопления.ПартииПрочихРасходов.Остатки(
	|			&НачалоПериода,
	|			Организация = &Организация
	|				И НЕ СтатьяРасходов В
	|						(ВЫБРАТЬ Т.Ссылка ИЗ СтатьиДопРасходов КАК Т)) КАК ПартииПрочихРасходовОстатки
	|";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоКвартала(Период));
	Запрос.УстановитьПараметр("КонецПериода", КонецКвартала(Период));
	
	Результат = НЕ Запрос.Выполнить().Пустой();
	
	Возврат Результат;
	
КонецФункции

// Возвращают данные для оценки возможности применения "правила 5%"
//
// Параметры:
// 	 МассивОрганизаций - Массив, СправочникСсылка.Организация - организации, для которых надо выполнить оценку
// 	 Период - Дата - квартал для оценки.
//
// Возвращаемое значение:
// 	 Оценка - Таблица значений с колонками
//		* Организация - СправочникСсылка.Организации
// 	 	* РасходыПоДеятельностиНеОблагаемойНДС - Число - Расходы по реализации не облагаемой НДС.
// 		* РасходыВсего - Число - Обшая сумма расходов.
// 		* Доля - Число - Процент расходов, относящихся к реализации не облагаемой НДС.
//
Функция ОценкаПримененияПравила5Процентов(МассивОрганизаций, Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АналитикаУчета.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА СебестоимостьПродаж.НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС), ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НеОблагаетсяНДС,
	|	СУММА(СебестоимостьПродаж.СтоимостьРегл) КАК Себестоимость
	|ПОМЕСТИТЬ СебестоимостьПродаж
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК СебестоимостьПродаж
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Справочник.КлючиАналитикиУчетаПоПартнерам КАК АналитикаУчета
	|	ПО 
	|		СебестоимостьПродаж.АналитикаУчетаПоПартнерам = АналитикаУчета.Ссылка
	|ГДЕ
	|	СебестоимостьПродаж.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, КВАРТАЛ) И КОНЕЦПЕРИОДА(&Период, КВАРТАЛ)
	|	И АналитикаУчета.Организация В(&МассивОрганизаций)
	|	И СебестоимостьПродаж.СтоимостьРегл <> 0
	|	И СебестоимостьПродаж.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга))
	|
	|СГРУППИРОВАТЬ ПО
	|	АналитикаУчета.Организация,
	|	ВЫБОР
	|		КОГДА СебестоимостьПродаж.НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС), ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СебестоимостьПродаж.Организация КАК Организация,
	|	СебестоимостьПродаж.РасходыПоДеятельностиНеОблагаемойНДС КАК РасходыПоДеятельностиНеОблагаемойНДС,
	|	СебестоимостьПродаж.РасходыВсего КАК РасходыВсего,
	|	ВЫБОР
	|		КОГДА СебестоимостьПродаж.РасходыВсего = 0
	|			ТОГДА 0
	|		ИНАЧЕ 100 * СебестоимостьПродаж.РасходыПоДеятельностиНеОблагаемойНДС / СебестоимостьПродаж.РасходыВсего
	|	КОНЕЦ КАК Доля
	|ИЗ
	|	(ВЫБРАТЬ
	|		Организации.Ссылка КАК Организация,
	|		ЕСТЬNULL(СУММА(ВЫБОР
	|					КОГДА СебестоимостьПродаж.НеОблагаетсяНДС
	|						ТОГДА СебестоимостьПродаж.Себестоимость
	|					ИНАЧЕ 0
	|				КОНЕЦ), 0) КАК РасходыПоДеятельностиНеОблагаемойНДС,
	|		ЕСТЬNULL(СУММА(СебестоимостьПродаж.Себестоимость), 0) КАК РасходыВсего
	|	ИЗ
	|		Справочник.Организации КАК Организации
	|			ЛЕВОЕ СОЕДИНЕНИЕ СебестоимостьПродаж КАК СебестоимостьПродаж
	|			ПО Организации.Ссылка = СебестоимостьПродаж.Организация
	|	ГДЕ
	|		Организации.Ссылка В(&МассивОрганизаций)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Организации.Ссылка) КАК СебестоимостьПродаж";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("МассивОрганизаций", ОбщегоНазначенияУТКлиентСервер.Массив(МассивОрганизаций));
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Индексы.Добавить("Организация");
	
	Возврат Результат;
	
КонецФункции

// Выполняет распределение НДС за указанный период в указанных организациях. Предназначена для вызова в рамках.
//
// Параметры:
//	Период - Дата - месяц, за который необходимо создать документы РаспределениеНДС.
//	Организация - Массив, СправочникСсылка.Организации, Неопределено - отбор организаций, по которым создаются документы.
//		Если передан пустой параметр, то документы будут созданы по всем организациям.
//	ИмяСобытияЖР - Строка - имя события об ошибке для записи журнала регистрации
//	МенеджерВТКэшейРегистров - МенеджерВременныхТаблиц - содержит кэш оборотов/остатков регистров.
//		Используется только при вызове этого метода в ходе выполнения расчета механизмом партионного учета версии 2.2.
//	ИдетРасчетСебестоимости - Булево - признак вызова распределения НДС из механизма расчета партий и себестоимости.
//
// Возвращаемое значение:
//		Структура - результат распределения НДС; ключи структуры
//		  - МассивДокументов - Массив - ссылки на все обработанные документы распределения НДС (независимо от наличия в них ошибок)
//		  - РассчитанныеОрганизации - Массив - ссылки на организации, по которым распределение НДС было выполнено без ошибок
//		  - ТекстОшибки - Строка - текст всех ошибок, зафиксированных при распределении НДС.
//
Функция РаспределитьНДС(Период, Организация, ИмяСобытияЖР = "", МенеджерВТКэшейРегистров = Неопределено, ИдетРасчетСебестоимости = Ложь) Экспорт
	
	РезультатРаспределенияНДС = Новый Структура;
	РезультатРаспределенияНДС.Вставить("МассивДокументов", 		  Новый Массив);
	РезультатРаспределенияНДС.Вставить("РассчитанныеОрганизации", Новый Массив);
	РезультатРаспределенияНДС.Вставить("ТекстОшибки", 	   		  "");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСправочника.Ссылка КАК Организация
	|ПОМЕСТИТЬ ВТОрганизации
	|ИЗ
	|	Справочник.Организации КАК ДанныеСправочника
	|ГДЕ
	|	(ДанныеСправочника.Ссылка В (&МассивОрганизаций)
	|		ИЛИ &ПоВсемОрганизациям)
	|	И (ДанныеСправочника.Ссылка <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|		ИЛИ &УчитыватьУпрОрганизацию)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОрганизации.Организация	 	 КАК Организация,
	|	МАКСИМУМ(ЕСТЬNULL(РаспределениеНДСПроведен.Ссылка, РаспределениеНДССоздан.Ссылка)) КАК Документ
	|ИЗ
	|	ВТОрганизации КАК ВТОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеНДС КАК РаспределениеНДСПроведен
	|		ПО ВТОрганизации.Организация = РаспределениеНДСПроведен.Организация
	|			И РаспределениеНДСПроведен.Проведен
	|			И РаспределениеНДСПроведен.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеНДС КАК РаспределениеНДССоздан
	|		ПО ВТОрганизации.Организация = РаспределениеНДССоздан.Организация
	|			И НЕ РаспределениеНДССоздан.ПометкаУдаления
	|			И РаспределениеНДССоздан.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	
	|СГРУППИРОВАТЬ ПО
	|	ВТОрганизации.Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация";
	
	Запрос.УстановитьПараметр("ДатаНачала",    			 НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ДатаОкончания", 			 КонецМесяца(Период));
	Запрос.УстановитьПараметр("УчитыватьУпрОрганизацию", ПолучитьФункциональнуюОпцию("ИспользоватьУправленческуюОрганизацию"));
	Запрос.УстановитьПараметр("МассивОрганизаций",  	 ОбщегоНазначенияУТКлиентСервер.Массив(Организация));
	Запрос.УстановитьПараметр("ПоВсемОрганизациям", 	 НЕ ЗначениеЗаполнено(Организация));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОшибкиДатЗапретаИзменения = "";
	ОшибкиПроверкиЗаполнения  = "";
	ОшибкиПроведения		  = "";
	
	Пока Выборка.Следующий() Цикл 
		
		Состояние = ЗакрытиеМесяцаСервер.ОпределитьСостояниеЭтаповРасчета(
			Перечисления.ОперацииЗакрытияМесяца.РаспределениеНДС,
			Период,
			Выборка.Организация,
			НЕ ИдетРасчетСебестоимости);
		
		Если Состояние <> Перечисления.СостоянияОперацийЗакрытияМесяца.НеВыполнено
		 И Состояние <> Перечисления.СостоянияОперацийЗакрытияМесяца.ВыполненоСОшибками Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемыРасчета(
			?(ИдетРасчетСебестоимости,
				Перечисления.ОперацииЗакрытияМесяца.РасчетПартийИСебестоимости,
				Перечисления.ОперацииЗакрытияМесяца.РаспределениеНДС),
			Выборка.Организация,
			НачалоМесяца(Период));
			
		ТекстРегистрацииОшибки = СтрЗаменить(
			НСтр("ru='При %операция% по организации ""%1"" за период %2 были диагностированы ошибки'"),
			"%операция%",
			?(ИдетРасчетСебестоимости, НСтр("ru='распределении НДС'"), НСтр("ru='выполнении расчета'")));
			
		НачатьТранзакцию();
		
		Попытка
			
			ПараметрыУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаОрганизаций.ПараметрыУчетнойПолитики(Выборка.Организация, КонецМесяца(Период));
			
			Если НЕ ЗначениеЗаполнено(Выборка.Документ) Тогда
				
				ДокументОбъект = Документы.РаспределениеНДС.СоздатьДокумент();
				ДокументОбъект.Дата 		 = КонецМесяца(Период);
				ДокументОбъект.Организация 	 = Выборка.Организация;
				ДокументОбъект.НачалоПериода = ПолучитьНачалоРасширенногоНалоговогоПериода(Период, Выборка.Организация);
				ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
				
				ПравилаСписанияНДС = Документы.РаспределениеНДС.ЗаполнитьПравилаСписанияНДС(Выборка.Организация);
				ЗаполнитьЗначенияСвойств(ДокументОбъект, ПравилаСписанияНДС);
				
				ДокументОбъект.КорректироватьРаспределениеНДСПрошлыхПериодов 	= ?(ПараметрыУчетнойПолитики = Неопределено, Ложь, ПараметрыУчетнойПолитики.КорректироватьРаспределениеНДСПрошлыхПериодов);
				ДокументОбъект.ВариантКорректировкиРаспределенияНДС				= ?(ПараметрыУчетнойПолитики = Неопределено, Перечисления.ВариантыКорректировкиРаспределенияНДС.НаРасходахТекущегоПериода, ПараметрыУчетнойПолитики.ВариантКорректировкиРаспределенияНДС);

			Иначе
				
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить("Документ.РаспределениеНДС");
				ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Документ);
				Блокировка.Заблокировать();
				
				ДокументОбъект = Выборка.Документ.ПолучитьОбъект();
				
			КонецЕсли;
			
			// Проверим, что документ находится в доступном для изменения периоде.
			ОписаниеОшибкиДаты = "";
			
			Если ДатыЗапретаИзменения.ИзменениеЗапрещено(ДокументОбъект, , ОписаниеОшибкиДаты) Тогда
				
				ОшибкиДатЗапретаИзменения = ОшибкиДатЗапретаИзменения + ?(ОшибкиДатЗапретаИзменения = "", "", "
					|") + ПротоколРасчетаПартийИСебестоимости.ПредставлениеМногострочногоТекста(ОписаниеОшибкиДаты);
				
				ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемуВыполненияРасчета(
					ПараметрыРегистрации,
					ТекстРегистрацииОшибки,
					Перечисления.ВариантыВажностиПроблемыСостоянияСистемы.Ошибка,
					ОписаниеОшибкиДаты);
				
				ОтменитьТранзакцию();
				
				Продолжить;
				
			КонецЕсли;
			
			// Заполним дополнительные свойства документа.
			ДокументОбъект.ДополнительныеСвойства.Вставить("РегламентныеОперации");
			
			УниверсальныеМеханизмыПартийИСебестоимости.УстановитьПризнакВыполненияРасчетаПартийИСебестоимости(ДокументОбъект);
			
			Если МенеджерВТКэшейРегистров <> Неопределено Тогда
				// Вызвано из партионного учета версии 2.2.
				ДокументОбъект.ДополнительныеСвойства.Вставить("МенеджерВТКэшейРегистров", МенеджерВТКэшейРегистров);
				ДокументОбъект.ДополнительныеСвойства.Вставить("ПериодРасчетаПартий", 	   Период);
			КонецЕсли;
			
			Если НЕ ДокументОбъект.БазаРаспределенияУстанавливаетсяВручную Тогда
				
				Результат = Документы.РаспределениеНДС.ПолучитьБазуРаспределения(ДокументОбъект.Дата, ДокументОбъект.НачалоПериода, ДокументОбъект.Организация, , ДокументОбъект.КорректироватьРаспределениеНДСПрошлыхПериодов);
				
				ЗаполнитьЗначенияСвойств(
					ДокументОбъект, 
					Результат, 
					"ВыручкаНДС, ВыручкаНеНДС, ВыручкаЕНВД, ВыручкаНДС0, ВыручкаНДС0НесырьевыеТовары, ВыручкаНДС0СырьевыеТоварыУслуги, СуммаНДСНачисленного");
					
				ДокументОбъект.ДокументыЭкспорт.Загрузить(Результат.ДокументыЭкспорт);
				ДокументОбъект.НДСОбособленныхПодразделений.Загрузить(Результат.ТаблицаНДСОбособленныхПодразделений);
				
				ТаблицыСуммыЗачета = Документы.РаспределениеНДС.ПолучитьСуммыЗачета(ДокументОбъект.Дата, ДокументОбъект.Организация, Результат.ТаблицаВыручка.Итог("ВыручкаНДС"), Результат.ТаблицаВыручка.Итог("ВыручкаНеНДС"), ДокументОбъект.КорректироватьРаспределениеНДСПрошлыхПериодов);
				ЗаполнитьЗначенияСвойств(
					ДокументОбъект, 
					ТаблицыСуммыЗачета, 
					"СуммаНДСРазрешенногоКЗачету, СуммаНДСНеРазрешенногоКЗачету, СуммаНДСМетодомЗачета, СуммаНДСПереносимыйЗачет");
				
			КонецЕсли;
			
			ДокументОбъект.КорректировкаНДСПрошлыхПериодов.Очистить();
			СтруктураКорректировкиНДС = ПолучитьТаблицуКорректировкиНДС(ДокументОбъект.Дата, ДокументОбъект.НачалоПериода, ДокументОбъект.Организация, ДокументОбъект.КорректироватьРаспределениеНДСПрошлыхПериодов);
			Если НЕ СтруктураКорректировкиНДС = Неопределено Тогда
				ДокументОбъект.КорректировкаНДСПрошлыхПериодов.Загрузить(СтруктураКорректировкиНДС.ТаблицаКорректировкиНДС);
				Для каждого ТекСтрокаКорректировкаОбособленныеПодразделения Из СтруктураКорректировкиНДС.ТаблицаНДСОбособленныхПодразделений Цикл
					СтруктураПоиска = Новый Структура;
					СтруктураПоиска.Вставить("ОбособленноеПодразделение", ТекСтрокаКорректировкаОбособленныеПодразделения.ОбособленноеПодразделение);
					СтруктураПоиска.Вставить("СчетУчетаНДС", ТекСтрокаКорректировкаОбособленныеПодразделения.СчетУчетаНДС);
					СтрокиТаблицы = ДокументОбъект.НДСОбособленныхПодразделений.НайтиСтроки(СтруктураПоиска);
					Если СтрокиТаблицы.Количество() = 0 Тогда
						НоваяСтрока = ДокументОбъект.НДСОбособленныхПодразделений.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаКорректировкаОбособленныеПодразделения);
					Иначе
						ТекСтрока = СтрокиТаблицы[0];
						ТекСтрока.СуммаНДС = ТекСтрока.СуммаНДС + ТекСтрокаКорректировкаОбособленныеПодразделения.СуммаНДС;
					КонецЕсли;
				КонецЦикла; 
			КонецЕсли;
			
			Если ДокументОбъект.ЭтоНовый() Тогда
				// Регламентный документ должен остаться в ИБ независимо от того, удастся его провести или нет.
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
			// Проверим корректность заполнения документа.
			СообщенияПроверки = УниверсальныеМеханизмыПартийИСебестоимости.ПроверитьЗаполнениеОбъектаСПерехватомСообщений(ДокументОбъект);
			
			Если ЗначениеЗаполнено(СообщенияПроверки) Тогда
				
				// Проверка заполнения документа обнаружила ошибки.
				ОшибкиПроверкиЗаполнения = ОшибкиПроверкиЗаполнения	+ ?(ОшибкиПроверкиЗаполнения = "", "", "
					|") + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'При проверке документа ""%1"" были обнаружены ошибки:
								|%2'"),
							СокрЛП(ДокументОбъект),
							ПротоколРасчетаПартийИСебестоимости.ПредставлениеМногострочногоТекста(СообщенияПроверки, " - "));
				
				ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемуВыполненияРасчета(
					ПараметрыРегистрации,
					ТекстРегистрацииОшибки,
					Перечисления.ВариантыВажностиПроблемыСостоянияСистемы.Ошибка,
					ОшибкиПроверкиЗаполнения,
					ДокументОбъект.Ссылка);
				
			Иначе
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				РезультатРаспределенияНДС.РассчитанныеОрганизации.Добавить(Выборка.Организация); // распределение выполнено успешно
			КонецЕсли;
			
			РезультатРаспределенияНДС.МассивДокументов.Добавить(ДокументОбъект.Ссылка);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ОшибкиПроведения = ОшибкиПроведения + ?(ОшибкиПроведения = "", "", "
				|") + ТекстОшибки;
			
			ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемуВыполненияРасчета(
				ПараметрыРегистрации,
				ТекстРегистрацииОшибки,
				Перечисления.ВариантыВажностиПроблемыСостоянияСистемы.Ошибка,
				ТекстОшибки);
			
		КонецПопытки;
		
	КонецЦикла;
	
	// Обработаем информацию об ошибках.
	Если ЗначениеЗаполнено(ОшибкиДатЗапретаИзменения)
	 ИЛИ ЗначениеЗаполнено(ОшибкиПроверкиЗаполнения)
	 ИЛИ ЗначениеЗаполнено(ОшибкиПроведения) Тогда
		
		РезультатРаспределенияНДС.ТекстОшибки = ОшибкиДатЗапретаИзменения;
		
		РезультатРаспределенияНДС.ТекстОшибки =
			?(РезультатРаспределенияНДС.ТекстОшибки = "", "", РезультатРаспределенияНДС.ТекстОшибки + "
				|") + ОшибкиПроверкиЗаполнения;
		
		РезультатРаспределенияНДС.ТекстОшибки =
			?(РезультатРаспределенияНДС.ТекстОшибки = "", "", РезультатРаспределенияНДС.ТекстОшибки + "
				|") + ОшибкиПроведения;
		
		Если ЗначениеЗаполнено(ИмяСобытияЖР) Тогда
			
			ТекстДляЖурнала = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось выполнить распределение НДС по причине:
					|%1'"),
				РезультатРаспределенияНДС.ТекстОшибки);
			
			ЗаписьЖурналаРегистрации(
				ИмяСобытияЖР,
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Документы.РаспределениеНДС,
				,
				ТекстДляЖурнала);
			
		КонецЕсли;
		
 	КонецЕсли;
	
	Возврат РезультатРаспределенияНДС;
	
КонецФункции

Процедура СформироватьЗадание(ПараметрыЗадания) Экспорт
	
	Запись = РегистрыСведений.ЗаданияКЗакрытиюМесяца.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, ПараметрыЗадания);
	Запись.Операция = Перечисления.ОперацииЗакрытияМесяца.РаспределениеНДС;
	Запись.НомерЗадания = Константы.НомерЗаданияКЗакрытиюМесяца.Получить();
	Запись.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	Если Регистры <> Неопределено Тогда
		ПроведениеСерверУТ.ЗапретВыборочногоПроведенияПоРегистрам(ДокументСсылка);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка							КАК Ссылка,
	|	ДанныеДокумента.Дата							КАК Период,
	|	ДанныеДокумента.НачалоПериода					КАК НачалоПериода,
	|	КОНЕЦПЕРИОДА(ДанныеДокумента.Дата, МЕСЯЦ)		КАК ПериодБазы,
	|	ДанныеДокумента.Организация						КАК Организация,
	|	ДанныеДокумента.ВыручкаНДС						КАК ВыручкаНДС,
	|	ДанныеДокумента.ВыручкаНеНДС					КАК ВыручкаНеНДС,
	|	ДанныеДокумента.ВыручкаЕНВД						КАК ВыручкаЕНВД,
	|	ДанныеДокумента.ВыручкаНДС0						КАК ВыручкаНДС0,
	|	ДанныеДокумента.ВыручкаНДС0СырьевыеТоварыУслуги	КАК ВыручкаНДС0СырьевыеТоварыУслуги,
	|	ДанныеДокумента.ВыручкаНДС0НесырьевыеТовары		КАК ВыручкаНДС0НесырьевыеТовары,
	|	ДанныеДокумента.СтатьяРасходовНеНДС				КАК СтатьяРасходовНеНДС,
	|	ДанныеДокумента.АналитикаРасходовНеНДС			КАК АналитикаРасходовНеНДС,
	|	ДанныеДокумента.СтатьяРасходовЕНВД				КАК СтатьяРасходовЕНВД,
	|	ДанныеДокумента.АналитикаРасходовЕНВД			КАК АналитикаРасходовЕНВД,
	|	ДанныеДокумента.СписатьНДСПоРасходамАктивамНаСтатьиОтражения КАК СписатьНДСПоРасходамАктивамНаСтатьиОтражения,
	|	ДанныеДокумента.ПрименитьПравило5Процентов		КАК ПрименитьПравило5Процентов
	|,	ДанныеДокумента.СуммаНДСРазрешенногоКЗачету + ДанныеДокумента.СуммаНДСПереносимыйЗачет КАК СуммаНДСРазрешенногоКЗачету,
	|	ДанныеДокумента.СуммаНДСНеРазрешенногоКЗачету КАК СуммаНДСНеРазрешенногоКЗачету,
	|	ДанныеДокумента.СуммаНДСМетодомЗачета		КАК СуммаНДСМетодомЗачета,
	|	ДанныеДокумента.СуммаНДСНачисленного		КАК СуммаНДСНачисленного
	|ИЗ
	|	Документ.РаспределениеНДС КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка", Выборка.Ссылка);
	Реквизиты.Вставить("Период", Выборка.Период);
	Реквизиты.Вставить("ПериодБазы", Выборка.ПериодБазы);
	Реквизиты.Вставить("Организация", Выборка.Организация);
	Реквизиты.Вставить("ВыручкаНДС", Выборка.ВыручкаНДС);
	Реквизиты.Вставить("ВыручкаНеНДС", Выборка.ВыручкаНеНДС);
	Реквизиты.Вставить("ВыручкаЕНВД", Выборка.ВыручкаЕНВД);
	Реквизиты.Вставить("ВыручкаНДС0", Выборка.ВыручкаНДС0);
	Реквизиты.Вставить("ВыручкаНДС0СырьевыеТоварыУслуги", Выборка.ВыручкаНДС0СырьевыеТоварыУслуги);
	Реквизиты.Вставить("ВыручкаНДС0НесырьевыеТовары", Выборка.ВыручкаНДС0НесырьевыеТовары);
	Реквизиты.Вставить("СтатьяРасходовНеНДС", Выборка.СтатьяРасходовНеНДС);
	Реквизиты.Вставить("АналитикаРасходовНеНДС", Выборка.АналитикаРасходовНеНДС);
	Реквизиты.Вставить("СтатьяРасходовЕНВД", Выборка.СтатьяРасходовЕНВД);
	Реквизиты.Вставить("АналитикаРасходовЕНВД", Выборка.АналитикаРасходовЕНВД);
	Реквизиты.Вставить("СписатьНДСПоРасходамАктивамНаСтатьиОтражения", Выборка.СписатьНДСПоРасходамАктивамНаСтатьиОтражения);
	Реквизиты.Вставить("ПрименитьПравило5Процентов", Выборка.ПрименитьПравило5Процентов);
	Реквизиты.Вставить("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	
	ПериодОкончание = КонецКвартала(Выборка.Период);
	//++ НЕ УТ
	Если Месяц(Выборка.Период)%3 <> 0 Тогда
		ПериодОкончание = КонецМесяца(Выборка.Период);
	КонецЕсли;
	//-- НЕ УТ
	Реквизиты.Вставить("ВыборкаПоКварталу", (Месяц(Выборка.Период)%3=0));
	Реквизиты.Вставить("ПериодНачало",    Выборка.НачалоПериода);
	Реквизиты.Вставить("ПериодОкончание", ПериодОкончание);
	
	//++ НЕ УТ
	СформироватьДвижения(Реквизиты, ДополнительныеСвойства);
	//ТаблицаОтражениеДокументовВРеглУчете(Реквизиты, ДополнительныеСвойства.ТаблицыДляДвижений);
	//-- НЕ УТ
	
КонецПроцедуры

Функция ДанныеДляРаспределения(Реквизиты, ДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ВыборкаПоКварталу",  Реквизиты.ВыборкаПоКварталу);
	Запрос.УстановитьПараметр("Период",             Реквизиты.Период);
	Запрос.УстановитьПараметр("ПериодБазы",         Реквизиты.ПериодБазы);
	Запрос.УстановитьПараметр("ПериодНачало",       Реквизиты.ПериодНачало);
	Запрос.УстановитьПараметр("ПериодОкончание",    Реквизиты.ПериодОкончание);
	Запрос.УстановитьПараметр("Организация",        Реквизиты.Организация);
	Запрос.УстановитьПараметр("Граница",            Новый Граница(Реквизиты.ПериодОкончание, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДокументСсылка",     Реквизиты.Ссылка);
	
	Если ДополнительныеСвойства.Свойство("МенеджерВТКэшейРегистров") Тогда
		
		// Вызвано из партионного учета версии 2.2.
		// Необходимо скорректировать остатки на конец периода:
		// вычесть из них "расчетные" движения, хранящиеся в ИБ (результаты прошлого расчета партий)
		// и добавить "расчетные" движения, хранящиеся во временной таблице (результаты выполняющего сейчас расчета партий).
		
		Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВТКэшейРегистров; // содержит ВТКэшПартииПрочихРасходов
		
		// Период расчета партий (месяц) может отличаться от периода выборки данных для распределения (месяц или квартал).
		Запрос.УстановитьПараметр("НачалоПериодаРасчетаПартий", НачалоМесяца(ДополнительныеСвойства.ПериодРасчетаПартий));
		Запрос.УстановитьПараметр("КонецПериодаРасчетаПартий",  КонецМесяца(ДополнительныеСвойства.ПериодРасчетаПартий));
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫБОР КОГДА Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ 						  КАК Знак,
		|	Т.Организация                 КАК Организация,
		|	Т.Подразделение               КАК Подразделение,
		|	Т.СтатьяРасходов              КАК СтатьяРасходов,
		|	Т.АналитикаРасходов           КАК АналитикаРасходов,
		|	Т.АналитикаАктивовПассивов    КАК АналитикаАктивовПассивов,
		|	Т.ДокументПоступленияРасходов КАК ДокументПоступленияРасходов,
		|	Т.АналитикаУчетаПартий        КАК АналитикаУчетаПартий,
		|	Т.НаправлениеДеятельности     КАК НаправлениеДеятельности,
		|	Т.АналитикаУчетаНоменклатуры  КАК АналитикаУчетаНоменклатуры,
		|	Т.ВидДеятельностиНДС          КАК ВидДеятельностиНДС,
		|	Т.СтоимостьРегл			  	  КАК СтоимостьРегл,
		|	Т.НДСРегл			  	  	  КАК НДСРегл,
		|	Т.НДСУпр			  	  	  КАК НДСУпр
		|ПОМЕСТИТЬ ВТКорректировкаОстатковПартииПрочихРасходов
		|ИЗ
		|	РегистрНакопления.ПартииПрочихРасходов КАК Т
		|ГДЕ
		|	Т.Период МЕЖДУ &НачалоПериодаРасчетаПартий И &КонецПериодаРасчетаПартий
		|	И Т.Организация = &Организация
		|	И Т.Активность
		|	И Т.РасчетПартий
		|	И Т.Регистратор <> &ДокументСсылка
		|	И (Т.СтоимостьРегл <> 0 
		|		ИЛИ Т.НДСРегл <> 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР КОГДА Т.СлужебноеВидДвиженияПриход
		|		ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ 						  КАК Знак,
		|	Т.Организация                 КАК Организация,
		|	Т.Подразделение               КАК Подразделение,
		|	Т.СтатьяРасходов              КАК СтатьяРасходов,
		|	Т.АналитикаРасходов           КАК АналитикаРасходов,
		|	Т.АналитикаАктивовПассивов    КАК АналитикаАктивовПассивов,
		|	Т.ДокументПоступленияРасходов КАК ДокументПоступленияРасходов,
		|	Т.АналитикаУчетаПартий        КАК АналитикаУчетаПартий,
		|	Т.НаправлениеДеятельности     КАК НаправлениеДеятельности,
		|	Т.АналитикаУчетаНоменклатуры  КАК АналитикаУчетаНоменклатуры,
		|	Т.ВидДеятельностиНДС          КАК ВидДеятельностиНДС,
		|	Т.СтоимостьРегл			  	  КАК СтоимостьРегл,
		|	Т.НДСРегл			  	  	  КАК НДСРегл,
		|	Т.НДСУпр			  	  	  КАК НДСУпр
		|ИЗ
		|	ВТКэшПартииПрочихРасходов КАК Т
		|ГДЕ
		|	Т.Период МЕЖДУ &НачалоПериодаРасчетаПартий И &КонецПериодаРасчетаПартий
		|	И Т.Организация = &Организация
		|	И Т.РасчетПартий
		|	И Т.Регистратор <> &ДокументСсылка
		|	И (Т.СтоимостьРегл <> 0 
		|		ИЛИ Т.НДСРегл <> 0)";
		
	Иначе
		
		// Вызвано не из партионного учета версии 2.2.
		// Корректировать остатки на конец периода не надо - "расчетные" движения хранятся только в ИБ.
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	0							  КАК Знак,
		|	Т.Организация                 КАК Организация,
		|	Т.Подразделение               КАК Подразделение,
		|	Т.СтатьяРасходов              КАК СтатьяРасходов,
		|	Т.АналитикаРасходов           КАК АналитикаРасходов,
		|	Т.АналитикаАктивовПассивов    КАК АналитикаАктивовПассивов,
		|	Т.ДокументПоступленияРасходов КАК ДокументПоступленияРасходов,
		|	Т.АналитикаУчетаПартий        КАК АналитикаУчетаПартий,
		|	Т.НаправлениеДеятельности     КАК НаправлениеДеятельности,
		|	Т.АналитикаУчетаНоменклатуры  КАК АналитикаУчетаНоменклатуры,
		|	Т.ВидДеятельностиНДС          КАК ВидДеятельностиНДС,
		|	Т.СтоимостьРегл			  	  КАК СтоимостьРегл,
		|	Т.НДСРегл			  	  	  КАК НДСРегл,
		|	Т.НДСУпр			  	  	  КАК НДСУпр
		|ПОМЕСТИТЬ ВТКорректировкаОстатковПартииПрочихРасходов
		|ИЗ
		|	РегистрНакопления.ПартииПрочихРасходов КАК Т";
		
	КонецЕсли;
	
	Запрос.Выполнить(); // формируется ВТКорректировкаОстатковПартииПрочихРасходов
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КОНЕЦПЕРИОДА(ЕСТЬNULL(ДанныеОснованияКорректировки.ДатаРегистратора, &ПериодБазы), КВАРТАЛ)  КАК ПериодБазы,
	|	КорректировкаПриобретения.ДокументОснование  КАК ОснованиеКорректировки,
	|	ПартииПрочихРасходов.Организация  КАК Организация,
	|	ПартииПрочихРасходов.Подразделение  КАК Подразделение,
	|	ПартииПрочихРасходов.СтатьяРасходов  КАК СтатьяРасходов,
	|	ПартииПрочихРасходов.АналитикаРасходов  КАК АналитикаРасходов,
	|	ПартииПрочихРасходов.АналитикаАктивовПассивов  КАК АналитикаАктивовПассивов,
	|	ПартииПрочихРасходов.ДокументПоступленияРасходов  КАК ДокументПоступленияРасходов,
	|	ПартииПрочихРасходов.АналитикаУчетаПартий  КАК АналитикаУчетаПартий,
	|	ПартииПрочихРасходов.НаправлениеДеятельности  КАК НаправлениеДеятельности,
	|	ПартииПрочихРасходов.АналитикаУчетаНоменклатуры  КАК АналитикаУчетаНоменклатуры,
	|	ПартииПрочихРасходов.ВидДеятельностиНДС  КАК ВидДеятельностиНДС
	|ПОМЕСТИТЬ ПартииПрочихРасходовКорректировка
	|ИЗ
	|	РегистрНакопления.ПартииПрочихРасходов КАК ПартииПрочихРасходов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.КорректировкаПриобретения КАК КорректировкаПриобретения
	|	ПО
	|		ПартииПрочихРасходов.Регистратор = КорректировкаПриобретения.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеОснованияКорректировки
	|	ПО
	|		КорректировкаПриобретения.Организация = ДанныеОснованияКорректировки.Организация
	|		И КорректировкаПриобретения.ДокументОснование = ДанныеОснованияКорректировки.Документ
	|ГДЕ
	|	ПартииПрочихРасходов.Период МЕЖДУ &ПериодНачало И &ПериодОкончание 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПоступленияРасходов
	|;
	|
	|//////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Организация                   КАК Организация,
	|	Т.Подразделение                 КАК Подразделение,
	|	Т.СтатьяРасходов                КАК СтатьяРасходов,
	|	Т.АналитикаРасходов             КАК АналитикаРасходов,
	|	Т.АналитикаАктивовПассивов      КАК АналитикаАктивовПассивов,
	|	Т.ДокументПоступленияРасходов   КАК ДокументПоступленияРасходов,
	|	Т.АналитикаУчетаПартий          КАК АналитикаУчетаПартий,
	|	Т.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	|	Т.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
	|	Т.ВидДеятельностиНДС            КАК ВидДеятельностиНДС,
	|	СУММА(Т.Знак * Т.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(Т.Знак * Т.НДСРегл)       КАК НДСРегл,
	|	СУММА(Т.Знак * Т.НДСУпр)        КАК НДСУпр
	|ПОМЕСТИТЬ ПартииПрочихРасходовОстатки
	|ИЗ
	|	(ВЫБРАТЬ
	|		1 							  КАК Знак,
	|		Т.Организация                 КАК Организация,
	|		Т.Подразделение               КАК Подразделение,
	|		Т.СтатьяРасходов              КАК СтатьяРасходов,
	|		Т.АналитикаРасходов           КАК АналитикаРасходов,
	|		Т.АналитикаАктивовПассивов    КАК АналитикаАктивовПассивов,
	|		Т.ДокументПоступленияРасходов КАК ДокументПоступленияРасходов,
	|		Т.АналитикаУчетаПартий        КАК АналитикаУчетаПартий,
	|		Т.НаправлениеДеятельности     КАК НаправлениеДеятельности,
	|		Т.АналитикаУчетаНоменклатуры  КАК АналитикаУчетаНоменклатуры,
	|		Т.ВидДеятельностиНДС          КАК ВидДеятельностиНДС,
	|		Т.СтоимостьРеглОстаток        КАК СтоимостьРегл,
	|		Т.НДСРеглОстаток              КАК НДСРегл,
	|		Т.НДСУпрОстаток               КАК НДСУпр
	|	ИЗ
	|		РегистрНакопления.ПартииПрочихРасходов.Остатки(&Граница, Организация = &Организация) КАК Т
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		-1 							  КАК Знак,
	|		Т.Организация                 КАК Организация,
	|		Т.Подразделение               КАК Подразделение,
	|		Т.СтатьяРасходов              КАК СтатьяРасходов,
	|		Т.АналитикаРасходов           КАК АналитикаРасходов,
	|		Т.АналитикаАктивовПассивов    КАК АналитикаАктивовПассивов,
	|		Т.ДокументПоступленияРасходов КАК ДокументПоступленияРасходов,
	|		Т.АналитикаУчетаПартий        КАК АналитикаУчетаПартий,
	|		Т.НаправлениеДеятельности     КАК НаправлениеДеятельности,
	|		Т.АналитикаУчетаНоменклатуры  КАК АналитикаУчетаНоменклатуры,
	|		Т.ВидДеятельностиНДС          КАК ВидДеятельностиНДС,
	|		Т.СтоимостьРеглОборот		  КАК СтоимостьРегл,
	|		Т.НДСРеглОборот			  	  КАК НДСРегл,
	|		Т.НДСУпрОборот                КАК НДСУпр
	|	ИЗ
	|		РегистрНакопления.ПартииПрочихРасходов.Обороты(&ПериодНачало, &ПериодОкончание,
	|			Регистратор, Организация = &Организация) КАК Т
	|	ГДЕ
	|		Т.Регистратор = &ДокументСсылка
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Знак						  КАК Знак,
	|		Т.Организация                 КАК Организация,
	|		Т.Подразделение               КАК Подразделение,
	|		Т.СтатьяРасходов              КАК СтатьяРасходов,
	|		Т.АналитикаРасходов           КАК АналитикаРасходов,
	|		Т.АналитикаАктивовПассивов    КАК АналитикаАктивовПассивов,
	|		Т.ДокументПоступленияРасходов КАК ДокументПоступленияРасходов,
	|		Т.АналитикаУчетаПартий        КАК АналитикаУчетаПартий,
	|		Т.НаправлениеДеятельности     КАК НаправлениеДеятельности,
	|		Т.АналитикаУчетаНоменклатуры  КАК АналитикаУчетаНоменклатуры,
	|		Т.ВидДеятельностиНДС          КАК ВидДеятельностиНДС,
	|		Т.СтоимостьРегл		  		  КАК СтоимостьРегл,
	|		Т.НДСРегл			  	  	  КАК НДСРегл,
	|		Т.НДСУпр			  	  	  КАК НДСУпр
	|	ИЗ
	|		ВТКорректировкаОстатковПартииПрочихРасходов КАК Т
	|	
	|	) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Организация,
	|	Т.Подразделение,
	|	Т.СтатьяРасходов,
	|	Т.АналитикаРасходов,
	|	Т.АналитикаАктивовПассивов,
	|	Т.ДокументПоступленияРасходов,
	|	Т.АналитикаУчетаПартий,
	|	Т.НаправлениеДеятельности,
	|	Т.АналитикаУчетаНоменклатуры,
	|	Т.ВидДеятельностиНДС
	|
	|ИМЕЮЩИЕ
	|	СУММА(Т.Знак * Т.СтоимостьРегл) <> 0 
	|	ИЛИ СУММА(Т.Знак * Т.НДСРегл) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ДокументПоступленияРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОстатков.Организация                                   КАК Организация,
	|	ТаблицаОстатков.Подразделение                                 КАК Подразделение,
	|	ТаблицаОстатков.НаправлениеДеятельности                       КАК НаправлениеДеятельности,
	|	ТаблицаОстатков.СтатьяРасходов                                КАК СтатьяРасходов,
	|	ТаблицаОстатков.АналитикаРасходов                             КАК АналитикаРасходов,
	|	ТаблицаОстатков.АналитикаАктивовПассивов                      КАК АналитикаАктивовПассивов,
	|	ТаблицаОстатков.ДокументПоступленияРасходов                   КАК ДокументПоступленияРасходов,
	|	ТаблицаОстатков.АналитикаУчетаПартий                          КАК АналитикаУчетаПартий,
	|	ТаблицаОстатков.АналитикаУчетаНоменклатуры                    КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаОстатков.ВидДеятельностиНДС                            КАК ВидДеятельностиНДС,
	|	АналитикаПартий.Контрагент                                    КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ТаблицаОстатков.ВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|			ТОГДА ТаблицаОстатков.ВидДеятельностиНДС // Версия ПартионногоУчета 2.2
	|		ИНАЧЕ АналитикаПартий.НалогообложениеНДС     // Версия ПартионногоУчета 2.1             
	|	КОНЕЦ                                                         КАК НалогообложениеНДСПартии,
	|	АналитикаПартий.СтавкаНДС                                     КАК СтавкаНДС,
	|	
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, &Период) КАК ДатаПоступленияРасходов,
	|	
	|	СтатьиРасходов.ВариантРаспределенияРасходовРегл               КАК ВариантРаспределенияРасходовСтатьи,
	|	СтатьиРасходов.ВидЦенностиНДС                                 КАК ВидЦенностиНДССтатьиРасходов,
	|	СтатьиРасходов.ПринятиеКналоговомуУчету                       КАК ЭтоПринимаемаяСтатьяРасходовНУ,
	|	
	|	ВЫБОР
	|		КОГДА АналитикаПартий.ВидЦенности <> ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПустаяСсылка)
	|			ТОГДА АналитикаПартий.ВидЦенности        // Версия ПартионногоУчета 2.2
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаОстатков.ДокументПоступленияРасходов) = ТИП(Документ.ТаможеннаяДекларацияИмпорт)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ТаможенныеПлатежи)
	|		КОГДА АналитикаНоменклатуры.Номенклатура.ТипНоменклатуры В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|			ТОГДА ЕСТЬNULL(ГруппыФинансовогоУчетаНоменклатуры.ВидЦенностиНДС, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары))
	|		КОГДА НЕ СтатьиРасходов.ВидЦенностиНДС ЕСТЬ NULL
	|			ТОГДА СтатьиРасходов.ВидЦенностиНДС
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)
	|	КОНЕЦ                                                      КАК ВидЦенностиНДС,
	|	
	|	ТаблицаОстатков.СтоимостьРегл                              КАК СтоимостьРегл,
	|	ТаблицаОстатков.НДСРегл                                    КАК НДСРегл,
	|	ТаблицаОстатков.НДСУпр                                     КАК НДСУпр
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	ПартииПрочихРасходовОстатки КАК ТаблицаОстатков
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|	ПО
	|		ТаблицаОстатков.Организация =  ДанныеПервичныхДокументов.Организация
	|		И ТаблицаОстатков.ДокументПоступленияРасходов = ДанныеПервичныхДокументов.Документ
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		Справочник.КлючиАналитикиУчетаПартий КАК АналитикаПартий
	|	ПО 
	|		ТаблицаОстатков.АналитикаУчетаПартий = АналитикаПартий.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаНоменклатуры
	|	ПО 
	|		ТаблицаОстатков.АналитикаУчетаНоменклатуры = АналитикаНоменклатуры.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.ГруппыФинансовогоУчетаНоменклатуры КАК ГруппыФинансовогоУчетаНоменклатуры
	|	ПО
	|		АналитикаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета = ГруппыФинансовогоУчетаНоменклатуры.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|	ПО
	|		ТаблицаОстатков.СтатьяРасходов = СтатьиРасходов.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПоступленияРасходов
	|;
	|
	|///////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПартииПрочихРасходовОстатки
	|;
	|";
	
	Запрос.Выполнить(); // формируются таблицы ПартииПрочихРасходовКорректировка, ТаблицаОстатков
	
	//++ НЕ УТ
	// Формируется таблица принятых к учету активов ВтВнеоборотныеАктивы
	Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционал") И ВнеоборотныеАктивы.ИспользуетсяУправлениеВНА_2_4(Реквизиты.Период) Тогда
		ВнеоборотныеАктивы.СформироватьТаблицуПринятыхКУчетуВнеоборотныхАктивовДляРаспределенияНДС_2_4(
			?(НачалоМесяца(Реквизиты.ПериодНачало) = Реквизиты.ПериодНачало, НачалоМесяца(Реквизиты.ПериодНачало), НачалоМесяца(Реквизиты.ПериодОкончание)), 
			Реквизиты.ПериодОкончание, Запрос.МенеджерВременныхТаблиц);
	ИначеЕсли ПолучитьФункциональнуюОпцию("ОтключенныйФункционал") И ПолучитьФункциональнуюОпцию("ИспользоватьВнеоборотныеАктивы2_2") Тогда
		ВнеоборотныеАктивы.СформироватьТаблицуПринятыхКУчетуВнеоборотныхАктивовДляРаспределенияНДС_2_2(
			Реквизиты.ПериодНачало, Реквизиты.ПериодОкончание, Запрос.МенеджерВременныхТаблиц);
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДАТАВРЕМЯ(1,1,1) КАК ДатаПринятияКУчету,
		|	""ОС"" КАК ВнеоборотныйАктив,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
		|	ЗНАЧЕНИЕ(Справочник.ОбъектыЭксплуатации.ПустаяСсылка) КАК Объект,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК НалогообложениеНДС,
		|	ЛОЖЬ КАК РаспределятьНДС,
		|	ЛОЖЬ КАК ВключаетсяВРасходыНУПриПринятииКУчету,
		|	НЕОПРЕДЕЛЕНО КАК ПодразделениеРасходовНУ,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходовНУ,
		|	ЛОЖЬ КАК ЭтоПринимаемаяСтатьяРасходовНУ,
		|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходовНУ
		|ПОМЕСТИТЬ ВтВнеоборотныеАктивы
		|";
		Запрос.Выполнить();
	КонецЕсли;
	//-- НЕ УТ
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаОстатков.Организация                      КАК Организация,
	|	ТаблицаОстатков.Подразделение                    КАК Подразделение,
	|	ТаблицаОстатков.НаправлениеДеятельности          КАК НаправлениеДеятельности,
	|	ТаблицаОстатков.СтатьяРасходов                   КАК СтатьяРасходов,
	|	ТаблицаОстатков.АналитикаРасходов                КАК АналитикаРасходов,
	|	ТаблицаОстатков.АналитикаАктивовПассивов         КАК АналитикаАктивовПассивов,
	|	ТаблицаОстатков.ДокументПоступленияРасходов      КАК ДокументПоступленияРасходов,
	|	ТаблицаОстатков.АналитикаУчетаПартий             КАК АналитикаУчетаПартий,
	|	ТаблицаОстатков.АналитикаУчетаНоменклатуры       КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаОстатков.ВидДеятельностиНДС               КАК ВидДеятельностиНДС,                                            
	|
	|	&ОрганизацияПолучатель                           КАК ОрганизацияПолучатель,
	|	
	|	ТаблицаОстатков.Контрагент                       КАК Контрагент,
	|	ТаблицаОстатков.НалогообложениеНДСПартии         КАК НалогообложениеНДСПартии,
	|	ТаблицаОстатков.СтавкаНДС                        КАК СтавкаНДС,
	|	
	|	ТаблицаОстатков.ДатаПоступленияРасходов          КАК ДатаПоступленияРасходов,
	|	
	|	ИСТИНА                                           КАК РаспределятьНДС,
	|
	|	ЕСТЬNULL(ПартииПрочихРасходовКорректировка.ПериодБазы, &ПериодБазы) КАК ПериодБазы,
	|	ЕСТЬNULL(ПартииПрочихРасходовКорректировка.ОснованиеКорректировки, НЕОПРЕДЕЛЕНО) КАК ОснованиеКорректировки,
	|
	|	НЕОПРЕДЕЛЕНО                                     КАК НовоеНалогообложениеНДС,
	|	
	|	ВЫБОР КОГДА ТаблицаОстатков.ВидЦенностиНДССтатьиРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ОбъектыНезавершенногоСтроительства)
	|		ТОГДА ""ОбъектСтроительства""
	|	ИНАЧЕ """"
	|	КОНЕЦ                                 			 КАК ВнеоборотныйАктив,
	|	ЛОЖЬ                                             КАК ВключаетсяВРасходыНУПриПринятииКУчету,
	|	НЕОПРЕДЕЛЕНО                                     КАК ПодразделениеРасходовНУ,
	|	НЕОПРЕДЕЛЕНО                                     КАК СтатьяРасходовНУ,
	|	ТаблицаОстатков.ЭтоПринимаемаяСтатьяРасходовНУ   КАК ЭтоПринимаемаяСтатьяРасходовНУ,
	|	НЕОПРЕДЕЛЕНО                                     КАК АналитикаРасходовНУ,
	|	
	|	ТаблицаОстатков.ВидЦенностиНДС                   КАК ВидЦенностиНДС,
	|	
	|	ТаблицаОстатков.СтоимостьРегл                    КАК СтоимостьРегл,
	|	ТаблицаОстатков.НДСРегл                          КАК НДСРегл,
	|	ТаблицаОстатков.НДСУпр                           КАК НДСУпр
	|ИЗ
	|	ТаблицаОстатков КАК ТаблицаОстатков
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ПартииПрочихРасходовКорректировка КАК ПартииПрочихРасходовКорректировка
	|	ПО
	|		ТаблицаОстатков.ДокументПоступленияРасходов = ПартииПрочихРасходовКорректировка.ДокументПоступленияРасходов
	|		И ТаблицаОстатков.Организация = ПартииПрочихРасходовКорректировка.Организация  
	|		И ТаблицаОстатков.Организация = ПартииПрочихРасходовКорректировка.Организация  
	|		И ТаблицаОстатков.Подразделение = ПартииПрочихРасходовКорректировка.Подразделение
	|		И ТаблицаОстатков.СтатьяРасходов = ПартииПрочихРасходовКорректировка.СтатьяРасходов
	|		И ТаблицаОстатков.АналитикаРасходов = ПартииПрочихРасходовКорректировка.АналитикаРасходов
	|		И ТаблицаОстатков.АналитикаАктивовПассивов = ПартииПрочихРасходовКорректировка.АналитикаАктивовПассивов
	|		И ТаблицаОстатков.АналитикаУчетаПартий = ПартииПрочихРасходовКорректировка.АналитикаУчетаПартий
	|		И ТаблицаОстатков.НаправлениеДеятельности = ПартииПрочихРасходовКорректировка.НаправлениеДеятельности
	|		И ТаблицаОстатков.АналитикаУчетаНоменклатуры = ПартииПрочихРасходовКорректировка.АналитикаУчетаНоменклатуры
	|		И ТаблицаОстатков.ВидДеятельностиНДС = ПартииПрочихРасходовКорректировка.ВидДеятельностиНДС
	|	
	|ГДЕ
	|	(ТаблицаОстатков.ВариантРаспределенияРасходовСтатьи В (
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности),
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты),
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов),
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы))
	|		ИЛИ (ТаблицаОстатков.НалогообложениеНДСПартии = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
	//++ НЕ УТ
	|				И ЕСТЬNULL(ТаблицаОстатков.ВариантРаспределенияРасходовСтатьи, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.ПустаяСсылка)) 
	|						<> ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	//-- НЕ УТ
	|			))
	//++ НЕ УТ
	|	И &ВыборкаПоКварталу
	|
	|ОБЪЕДИНИТЬ ВСЕ 
	|
	|ВЫБРАТЬ
	|	ТаблицаОстатков.Организация                      КАК Организация,
	|	ТаблицаОстатков.Подразделение                    КАК Подразделение,
	|	ТаблицаОстатков.НаправлениеДеятельности          КАК НаправлениеДеятельности,
	|	ТаблицаОстатков.СтатьяРасходов                   КАК СтатьяРасходов,
	|	ТаблицаОстатков.АналитикаРасходов                КАК АналитикаРасходов,
	|	ТаблицаОстатков.АналитикаАктивовПассивов         КАК АналитикаАктивовПассивов,
	|	ТаблицаОстатков.ДокументПоступленияРасходов      КАК ДокументПоступленияРасходов,
	|	ТаблицаОстатков.АналитикаУчетаПартий             КАК АналитикаУчетаПартий,
	|	ТаблицаОстатков.АналитикаУчетаНоменклатуры       КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаОстатков.ВидДеятельностиНДС               КАК ВидДеятельностиНДС,   
	|
	|	&ОрганизацияПолучатель                           КАК ОрганизацияПолучатель,
	|	
	|	ТаблицаОстатков.Контрагент                       КАК Контрагент,
	|	ТаблицаОстатков.НалогообложениеНДСПартии         КАК НалогообложениеНДСПартии,
	|	ТаблицаОстатков.СтавкаНДС                        КАК СтавкаНДС,
	|	
	|	ТаблицаОстатков.ДатаПоступленияРасходов          КАК ДатаПоступленияРасходов,
	|	
	|	ВнеобАктивы.РаспределятьНДС                      КАК РаспределятьНДС,
	|	
	|	ВЫБОР 
	|		КОГДА НЕ ПартииПрочихРасходовКорректировка.ДокументПоступленияРасходов ЕСТЬ NULL
	|			ТОГДА КОНЕЦПЕРИОДА(ВнеобАктивы.ДатаПринятияКУчету, МЕСЯЦ)
	|		ИНАЧЕ &ПериодБазы
	|	КОНЕЦ КАК ПериодБазы,
	|	ЕСТЬNULL(ПартииПрочихРасходовКорректировка.ОснованиеКорректировки, НЕОПРЕДЕЛЕНО) КАК ОснованиеКорректировки,
	|	
	|	ВЫБОР 
	|		КОГДА НЕ ВнеобАктивы.РаспределятьНДС
	|			ТОГДА ВнеобАктивы.НалогообложениеНДС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ                                            КАК НовоеНалогообложениеНДС,
	|	ВнеобАктивы.ВнеоборотныйАктив                    КАК ВнеоборотныйАктив,
	|	
	|	ВнеобАктивы.ВключаетсяВРасходыНУПриПринятииКУчету КАК ВключаетсяВРасходыНУПриПринятииКУчету,
	|	ВнеобАктивы.ПодразделениеРасходовНУ               КАК ПодразделениеРасходовНУ,
	|	ВнеобАктивы.СтатьяРасходовНУ                      КАК СтатьяРасходовНУ,
	|	ВнеобАктивы.ЭтоПринимаемаяСтатьяРасходовНУ        КАК ЭтоПринимаемаяСтатьяРасходовНУ,
	|	ВнеобАктивы.АналитикаРасходовНУ                   КАК АналитикаРасходовНУ,
	|	
	|	ТаблицаОстатков.ВидЦенностиНДС                   КАК ВидЦенностиНДС,
	|	
	|	ТаблицаОстатков.СтоимостьРегл                    КАК СтоимостьРегл,
	|	ТаблицаОстатков.НДСРегл                          КАК НДСРегл,
	|	ТаблицаОстатков.НДСУпр                           КАК НДСУпр
	|ИЗ
	|	ТаблицаОстатков КАК ТаблицаОстатков
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		ВтВнеоборотныеАктивы КАК ВнеобАктивы
	|	ПО 
	|		ТаблицаОстатков.АналитикаРасходов = ВнеобАктивы.Объект
	|		ИЛИ ТаблицаОстатков.АналитикаАктивовПассивов = ВнеобАктивы.Объект 
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ПартииПрочихРасходовКорректировка КАК ПартииПрочихРасходовКорректировка
	|	ПО
	|		ТаблицаОстатков.ДокументПоступленияРасходов = ПартииПрочихРасходовКорректировка.ДокументПоступленияРасходов
	|		И ТаблицаОстатков.Организация = ПартииПрочихРасходовКорректировка.Организация  
	|		И ТаблицаОстатков.Подразделение = ПартииПрочихРасходовКорректировка.Подразделение
	|		И ТаблицаОстатков.СтатьяРасходов = ПартииПрочихРасходовКорректировка.СтатьяРасходов
	|		И ТаблицаОстатков.АналитикаРасходов = ПартииПрочихРасходовКорректировка.АналитикаРасходов
	|		И ТаблицаОстатков.АналитикаАктивовПассивов = ПартииПрочихРасходовКорректировка.АналитикаАктивовПассивов
	|		И ТаблицаОстатков.АналитикаУчетаПартий = ПартииПрочихРасходовКорректировка.АналитикаУчетаПартий
	|		И ТаблицаОстатков.НаправлениеДеятельности = ПартииПрочихРасходовКорректировка.НаправлениеДеятельности
	|		И ТаблицаОстатков.АналитикаУчетаНоменклатуры = ПартииПрочихРасходовКорректировка.АналитикаУчетаНоменклатуры
	|		И ТаблицаОстатков.ВидДеятельностиНДС = ПартииПрочихРасходовКорректировка.ВидДеятельностиНДС
	|	
	|ГДЕ
	|	(ТаблицаОстатков.ВариантРаспределенияРасходовСтатьи = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|		ИЛИ ТаблицаОстатков.НалогообложениеНДСПартии = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ВводОСВЭксплуатацию))
    //УПК По внеоборотным активам не ведется учет по налогообложению НДС
    |   И ЛОЖЬ
    |
	|ОБЪЕДИНИТЬ ВСЕ 
	|
	|ВЫБРАТЬ
	|	ТаблицаОстатков.Организация                      КАК Организация,
	|	ТаблицаОстатков.Подразделение                    КАК Подразделение,
	|	ТаблицаОстатков.НаправлениеДеятельности          КАК НаправлениеДеятельности,
	|	ТаблицаОстатков.СтатьяРасходов                   КАК СтатьяРасходов,
	|	ТаблицаОстатков.АналитикаРасходов                КАК АналитикаРасходов,
	|	ТаблицаОстатков.АналитикаАктивовПассивов         КАК АналитикаАктивовПассивов,
	|	ТаблицаОстатков.ДокументПоступленияРасходов      КАК ДокументПоступленияРасходов,
	|	ТаблицаОстатков.АналитикаУчетаПартий             КАК АналитикаУчетаПартий,
	|	ТаблицаОстатков.АналитикаУчетаНоменклатуры       КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаОстатков.ВидДеятельностиНДС               КАК ВидДеятельностиНДС,   
	|
	|	&ОрганизацияПолучатель                           КАК ОрганизацияПолучатель,
	|	
	|	ТаблицаОстатков.Контрагент                       КАК Контрагент,
	|	ТаблицаОстатков.НалогообложениеНДСПартии         КАК НалогообложениеНДСПартии,
	|	ТаблицаОстатков.СтавкаНДС                        КАК СтавкаНДС,
	|	
	|	ТаблицаОстатков.ДатаПоступленияРасходов          КАК ДатаПоступленияРасходов,
	|	
	|	ИСТИНА                                           КАК РаспределятьНДС,
	|	
	|	ЕСТЬNULL(ПартииПрочихРасходовКорректировка.ПериодБазы, &ПериодБазы) КАК ПериодБазы,
	|	ЕСТЬNULL(ПартииПрочихРасходовКорректировка.ОснованиеКорректировки, НЕОПРЕДЕЛЕНО) КАК ОснованиеКорректировки,
	|	
	|	НЕОПРЕДЕЛЕНО                                     КАК НовоеНалогообложениеНДС,
	|
	|	""ОбъектСтроительства""                          КАК ВнеоборотныйАктив,
	|	ЛОЖЬ                                             КАК ВключаетсяВРасходыНУПриПринятииКУчету,
	|	НЕОПРЕДЕЛЕНО                                     КАК ПодразделениеРасходовНУ,
	|	НЕОПРЕДЕЛЕНО                                     КАК СтатьяРасходовНУ,
	|	ТаблицаОстатков.ЭтоПринимаемаяСтатьяРасходовНУ   КАК ЭтоПринимаемаяСтатьяРасходовНУ,
	|	НЕОПРЕДЕЛЕНО                                     КАК АналитикаРасходовНУ,
	|
	|	ТаблицаОстатков.ВидЦенностиНДС                   КАК ВидЦенностиНДС,
	|	
	|	ТаблицаОстатков.СтоимостьРегл                    КАК СтоимостьРегл,
	|	ТаблицаОстатков.НДСРегл                          КАК НДСРегл,
	|	ТаблицаОстатков.НДСУпр                           КАК НДСУпр
	|ИЗ
	|	ТаблицаОстатков КАК ТаблицаОстатков
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ПартииПрочихРасходовКорректировка КАК ПартииПрочихРасходовКорректировка
	|	ПО
	|		ТаблицаОстатков.ДокументПоступленияРасходов = ПартииПрочихРасходовКорректировка.ДокументПоступленияРасходов
	|		И ТаблицаОстатков.Организация = ПартииПрочихРасходовКорректировка.Организация  
	|		И ТаблицаОстатков.Подразделение = ПартииПрочихРасходовКорректировка.Подразделение
	|		И ТаблицаОстатков.СтатьяРасходов = ПартииПрочихРасходовКорректировка.СтатьяРасходов
	|		И ТаблицаОстатков.АналитикаРасходов = ПартииПрочихРасходовКорректировка.АналитикаРасходов
	|		И ТаблицаОстатков.АналитикаАктивовПассивов = ПартииПрочихРасходовКорректировка.АналитикаАктивовПассивов
	|		И ТаблицаОстатков.АналитикаУчетаПартий = ПартииПрочихРасходовКорректировка.АналитикаУчетаПартий
	|		И ТаблицаОстатков.НаправлениеДеятельности = ПартииПрочихРасходовКорректировка.НаправлениеДеятельности
	|		И ТаблицаОстатков.АналитикаУчетаНоменклатуры = ПартииПрочихРасходовКорректировка.АналитикаУчетаНоменклатуры
	|		И ТаблицаОстатков.ВидДеятельностиНДС = ПартииПрочихРасходовКорректировка.ВидДеятельностиНДС
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		ВтВнеоборотныеАктивы КАК ВнеобАктивы
	|	ПО 
	|		ТаблицаОстатков.АналитикаРасходов = ВнеобАктивы.Объект
	|
	|ГДЕ
	|	ТаблицаОстатков.ВариантРаспределенияРасходовСтатьи = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|	И ТаблицаОстатков.ВидЦенностиНДССтатьиРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ОбъектыНезавершенногоСтроительства)
	|	И ВнеобАктивы.Объект ЕСТЬ NULL
	|	И &ВыборкаПоКварталу
	|;
	|
	|///////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВнеоборотныеАктивы.Организация КАК Организация,
	|	ВнеоборотныеАктивы.Объект КАК Объект
	|ИЗ
	|	ВтВнеоборотныеАктивы КАК ВнеоборотныеАктивы
	//-- НЕ УТ
	|";
	
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&ОрганизацияПолучатель",
		РегистрыНакопления.ПартииПрочихРасходов.ТекстЗапросаЗначениеПоляОрганизацияПолучатель("ТаблицаОстатков"));
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	КоличествоЭлементов = РезультатыЗапроса.Количество();
	
	Результат = Новый Структура;
	
	Результат.Вставить("ПартииПрочихРасходов", РезультатыЗапроса[0].Выгрузить());
	//++ НЕ УТ
	Результат.Вставить("ВнеоборотныеАктивы",   РезультатыЗапроса[1].Выгрузить());
	//-- НЕ УТ

	// Уничтожим все сформированные временные таблицы.
	// Если этого не сделать, то при вызове этого метода из партионного учета версии 2.2
	// возможно возникновение ошибки вида "Временная таблица уже существует".
	
	Запрос.Текст = "
	//++ НЕ УТ
	|УНИЧТОЖИТЬ ВтВнеоборотныеАктивы
	|;
	//-- НЕ УТ
	|УНИЧТОЖИТЬ ВТКорректировкаОстатковПартииПрочихРасходов
	|;
	|УНИЧТОЖИТЬ ТаблицаОстатков
	|;
	|УНИЧТОЖИТЬ ПартииПрочихРасходовКорректировка
	|";
	
	Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеДляПрочихРасходов(Реквизиты)

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДокументСсылка",     Реквизиты.Ссылка);
	Коэффициенты = РаботаСКурсамивалютУТ.ПолучитьКоэффициентыПересчетаВалюты(Реквизиты.ВалютаРегламентированногоУчета, Реквизиты.ВалютаРегламентированногоУчета, Реквизиты.Период);
		
	Запрос.УстановитьПараметр("КоэффициентПересчетаВВалютуУПР", Коэффициенты.КоэффициентПересчетаВВалютуУПР);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	РаспределениеНДС.Организация КАК Организация,
	|	РаспределениеНДС.СтатьяРасходовНеНДС КАК СтатьяРасходов,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеНДС.АналитикаРасходовНеНДС) = ТИП(Справочник.СтруктураПредприятия)
	|			ТОГДА РаспределениеНДС.АналитикаРасходовНеНДС
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	РаспределениеНДС.АналитикаРасходовНеНДС КАК АналитикаРасходов,
	|	РаспределениеНДС.СуммаНДСНеРазрешенногоКЗачету КАК Сумма,
	|	РаспределениеНДС.СуммаНДСНеРазрешенногоКЗачету КАК СуммаБезНДС,
	|	РаспределениеНДС.СуммаНДСНеРазрешенногоКЗачету КАК СуммаРегл,
	|	ВЫРАЗИТЬ(РаспределениеНДС.СуммаНДСНеРазрешенногоКЗачету * &КоэффициентПересчетаВВалютуУпр КАК ЧИСЛО(15, 2)) КАК СуммаУпр
	|ИЗ
	|	Документ.РаспределениеНДС КАК РаспределениеНДС
	|ГДЕ
	|	РаспределениеНДС.Ссылка = &ДокументСсылка
	|	И РаспределениеНДС.СуммаНДСНеРазрешенногоКЗачету <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаспределениеНДС.Организация КАК Организация,
	|	РаспределениеНДС.СтатьяРасходовНеНДС КАК СтатьяРасходов,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеНДС.АналитикаРасходовНеНДС) = ТИП(Справочник.СтруктураПредприятия)
	|			ТОГДА РаспределениеНДС.АналитикаРасходовНеНДС
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	РаспределениеНДС.АналитикаРасходовНеНДС КАК АналитикаРасходов,
	|	КорректировкаРаспределенияНДС.СуммаНДСНеРазрешенногоКЗачетуСторно КАК Сумма,
	|	КорректировкаРаспределенияНДС.СуммаНДСНеРазрешенногоКЗачетуСторно КАК СуммаБезНДС,
	|	КорректировкаРаспределенияНДС.СуммаНДСНеРазрешенногоКЗачетуСторно КАК СуммаРегл,
	|	ВЫРАЗИТЬ(КорректировкаРаспределенияНДС.СуммаНДСНеРазрешенногоКЗачетуСторно * &КоэффициентПересчетаВВалютуУпр КАК ЧИСЛО(15, 2)) КАК СуммаУпр
	|ИЗ
	|	Документ.РаспределениеНДС.КорректировкаНДСПрошлыхПериодов КАК КорректировкаРаспределенияНДС
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеНДС КАК РаспределениеНДС
	|		ПО КорректировкаРаспределенияНДС.Ссылка = РаспределениеНДС.Ссылка
	|ГДЕ
	|	КорректировкаРаспределенияНДС.Ссылка = &ДокументСсылка
	|	И КорректировкаРаспределенияНДС.СуммаНДСНеРазрешенногоКЗачетуСторно <> 0
	|	И -КорректировкаРаспределенияНДС.СуммаНДСНеРазрешенногоКЗачетуСторно <> КорректировкаРаспределенияНДС.СуммаНДСНеРазрешенногоКЗачетуКорректировка
	|	И РаспределениеНДС.ВариантКорректировкиРаспределенияНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыКорректировкиРаспределенияНДС.НаРасходахТекущегоПериода)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаспределениеНДС.Организация КАК Организация,
	|	РаспределениеНДС.СтатьяРасходовНеНДС КАК СтатьяРасходов,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(РаспределениеНДС.АналитикаРасходовНеНДС) = ТИП(Справочник.СтруктураПредприятия)
	|			ТОГДА РаспределениеНДС.АналитикаРасходовНеНДС
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	РаспределениеНДС.АналитикаРасходовНеНДС КАК АналитикаРасходов,
	|	КорректировкаРаспределенияНДС.СуммаНДСРазрешенногоКЗачетуКорректировка КАК Сумма,
	|	КорректировкаРаспределенияНДС.СуммаНДСРазрешенногоКЗачетуКорректировка КАК СуммаБезНДС,
	|	КорректировкаРаспределенияНДС.СуммаНДСРазрешенногоКЗачетуКорректировка КАК СуммаРегл,
	|	ВЫРАЗИТЬ(КорректировкаРаспределенияНДС.СуммаНДСРазрешенногоКЗачетуКорректировка * &КоэффициентПересчетаВВалютуУпр КАК ЧИСЛО(15, 2)) КАК СуммаУпр
	|ИЗ
	|	Документ.РаспределениеНДС.КорректировкаНДСПрошлыхПериодов КАК КорректировкаРаспределенияНДС
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеНДС КАК РаспределениеНДС
	|		ПО КорректировкаРаспределенияНДС.Ссылка = РаспределениеНДС.Ссылка
	|ГДЕ
	|	КорректировкаРаспределенияНДС.Ссылка = &ДокументСсылка
	|	И КорректировкаРаспределенияНДС.СуммаНДСРазрешенногоКЗачетуКорректировка <> 0
	|	И -КорректировкаРаспределенияНДС.СуммаНДСНеРазрешенногоКЗачетуСторно <> КорректировкаРаспределенияНДС.СуммаНДСНеРазрешенногоКЗачетуКорректировка
	|	И РаспределениеНДС.ВариантКорректировкиРаспределенияНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыКорректировкиРаспределенияНДС.НаРасходахТекущегоПериода)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция СформироватьДвижения(Реквизиты, ДополнительныеСвойства)
	
	ТаблицыДляДвижений     = ДополнительныеСвойства.ТаблицыДляДвижений;
	
	ДанныеДляРаспределения = ДанныеДляРаспределения(Реквизиты, ДополнительныеСвойства);
	
	РезультатРаспределения = РаспределитьПартииПрочихРасходовПоБазе(ДанныеДляРаспределения.ПартииПрочихРасходов, Реквизиты);
	
	ТаблицыДляДвижений.Вставить("ТаблицаПартииПрочихРасходов",  ТаблицаПартииПрочихРасходов(РезультатРаспределения, Реквизиты));
	
	ДанныеДляПрочихРасходов = ДанныеДляПрочихРасходов(Реквизиты);
	ТаблицаПрочиеРасходы = ТаблицаПрочиеРасходы(ДанныеДляПрочихРасходов, Реквизиты);
	
	ТаблицыДляДвижений.Вставить("ТаблицаПрочиеРасходы", ТаблицаПрочиеРасходы);
	//++ НЕ УТ
	ТаблицаОтражениеДокументовВРеглУчете(Реквизиты, ДополнительныеСвойства.ТаблицыДляДвижений);
	
	Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционал") Тогда
		ТаблицыДляДвижений.Вставить("ТаблицаПараметрыАмортизацииОСБухгалтерскийУчет", Новый ТаблицаЗначений);
		ТаблицыДляДвижений.Вставить("ТаблицаПервоначальныеСведенияОСБухгалтерскийУчет", Новый ТаблицаЗначений);
		ТаблицыДляДвижений.Вставить("ТаблицаПервоначальныеСведенияОСНалоговыйУчет", Новый ТаблицаЗначений);
		ТаблицыДляДвижений.Вставить("ТаблицаПервоначальныеСведенияНМАБухгалтерскийУчет", Новый ТаблицаЗначений);
		ТаблицыДляДвижений.Вставить("ТаблицаПервоначальныеСведенияНМАНалоговыйУчет", Новый ТаблицаЗначений);
		
		ВнеоборотныеАктивы.ВключитьВСтоимостьВнеоборотныхАктивовРезультатРаспределенияНДС(
				ДанныеДляРаспределения.ВнеоборотныеАктивы,
				ТаблицыДляДвижений.ТаблицаПрочиеРасходы, 
				РезультатРаспределения,
				Реквизиты,
				ТаблицыДляДвижений);
	КонецЕсли;
	//-- НЕ УТ

КонецФункции

Функция РаспределитьПартииПрочихРасходовПоБазе(ПартииПрочихРасходов, Реквизиты)
	
	ТипыНалогообложения = Перечисления.ТипыНалогообложенияНДС;
	
	ПартииПрочихРасходовОблагаетсяНДС               = ТаблицаРезультатРаспределения();
	ПартииПрочихРасходовНеОблагаетсяНДС             = ТаблицаРезультатРаспределения();
	ПартииПрочихРасходовОблагаетсяЕНВД              = ТаблицаРезультатРаспределения();
	ПартииПрочихРасходовЭкспорт                     = ТаблицаРезультатРаспределения();
	ПартииПрочихРасходовЭкспортНесырьевыхТоваров    = ТаблицаРезультатРаспределения();
	ПартииПрочихРасходовЭкспортСырьевыхТоваровУслуг = ТаблицаРезультатРаспределения();
	
	
	ТаблицыРаспределения = Новый Соответствие;
	ТаблицыРаспределения.Вставить(ТипыНалогообложения.ПродажаОблагаетсяНДС,        ПартииПрочихРасходовОблагаетсяНДС);
	ТаблицыРаспределения.Вставить(ТипыНалогообложения.ПродажаНеОблагаетсяНДС,      ПартииПрочихРасходовНеОблагаетсяНДС);
	ТаблицыРаспределения.Вставить(ТипыНалогообложения.ПродажаОблагаетсяЕНВД,       ПартииПрочихРасходовОблагаетсяЕНВД);
	ТаблицыРаспределения.Вставить(ТипыНалогообложения.ПродажаНаЭкспорт,            ПартииПрочихРасходовЭкспорт);
	ТаблицыРаспределения.Вставить(ТипыНалогообложения.ЭкспортНесырьевыхТоваров,    ПартииПрочихРасходовЭкспортНесырьевыхТоваров);
	ТаблицыРаспределения.Вставить(ТипыНалогообложения.ЭкспортСырьевыхТоваровУслуг, ПартииПрочихРасходовЭкспортСырьевыхТоваровУслуг);
	
	БазаРаспределения = БазаРаспределения(ПартииПрочихРасходов, Реквизиты);
	
	Для каждого СтрокаПрочихРасходов Из ПартииПрочихРасходов Цикл
		
		УпрощенныйПорядокВычетаНДСПоНесырьевомуЭкспорту = УчетНДСУТ.УпрощенныйПорядокВычетаНДСПоНесырьевомуЭкспорту(СтрокаПрочихРасходов.ДатаПоступленияРасходов);
		
		Если СтрокаПрочихРасходов.РаспределятьНДС Тогда
			
			БазаПериода = БазаРаспределения.Найти(СтрокаПрочихРасходов.ПериодБазы, "ПериодБазы");
			
			БараРаспределенияПериода = Новый Соответствие;
			БараРаспределенияПериода.Вставить(ТипыНалогообложения.ПродажаОблагаетсяНДС,   БазаПериода.НеНДС);
			БараРаспределенияПериода.Вставить(ТипыНалогообложения.ПродажаНеОблагаетсяНДС, БазаПериода.НДС - БазаПериода.НеНДС);
			БараРаспределенияПериода.Вставить(ТипыНалогообложения.ПродажаОблагаетсяЕНВД,  БазаПериода.ЕНВД);
			Если УпрощенныйПорядокВычетаНДСПоНесырьевомуЭкспорту Тогда
				// Партия поступила после 01.07.2016 - действует упрощенный порядок вычета НДС по несырьевому экспорт.
				БараРаспределенияПериода.Вставить(ТипыНалогообложения.ПродажаНаЭкспорт, 0);
				БараРаспределенияПериода.Вставить(ТипыНалогообложения.ЭкспортНесырьевыхТоваров,    БазаПериода.НДС0НесырьевыеТовары);
				БараРаспределенияПериода.Вставить(ТипыНалогообложения.ЭкспортСырьевыхТоваровУслуг, БазаПериода.НДС0СырьевыеТоварыУслуги);
			Иначе
				// Партия поступила после 01.07.2016 - действует старый порядок вычета НДС по экспорту.
				БараРаспределенияПериода.Вставить(ТипыНалогообложения.ПродажаНаЭкспорт, БазаПериода.НДС0);
				БараРаспределенияПериода.Вставить(ТипыНалогообложения.ЭкспортНесырьевыхТоваров,    0);
				БараРаспределенияПериода.Вставить(ТипыНалогообложения.ЭкспортСырьевыхТоваровУслуг, 0);
			КонецЕсли;
			
			Коэффициенты = Новый Массив;
			Для каждого КлючИЗначение Из БараРаспределенияПериода Цикл
				Коэффициенты.Добавить(КлючИЗначение.Значение);
			КонецЦикла;
			
			РаспределениеСтоимостьРегл = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СтрокаПрочихРасходов.СтоимостьРегл, Коэффициенты); 
			РаспределениеНДСРегл = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СтрокаПрочихРасходов.НДСРегл, Коэффициенты);
			РаспределениеНДСУпр = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СтрокаПрочихРасходов.НДСУпр, Коэффициенты);
			
			Индекс = 0;
			Для каждого КлючИЗначение Из ТаблицыРаспределения Цикл
				
				Налогообложение = КлючИЗначение.Ключ;
				Таблица = КлючИЗначение.Значение;
				
				СтоимостьРегл = ?(РаспределениеСтоимостьРегл <> Неопределено, РаспределениеСтоимостьРегл[Индекс], 0);
				НДСРегл       = ?(РаспределениеНДСРегл       <> Неопределено, РаспределениеНДСРегл[Индекс], 0);
				НДСУпр        = ?(РаспределениеНДСУпр       <> Неопределено, РаспределениеНДСУпр[Индекс], 0);
				
				Индекс = Индекс + 1;
				Если СтоимостьРегл = 0 И НДСРегл = 0 И НДСУпр = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = Таблица.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПрочихРасходов, , "СтоимостьРегл, НДСРегл");
				НоваяСтрока.СтоимостьРегл = СтоимостьРегл;
				НоваяСтрока.НДСРегл       = НДСРегл;
				НоваяСтрока.НДСУпр        = НДСУпр;
				
				Если ЗначениеЗаполнено(СтрокаПрочихРасходов.ВнеоборотныйАктив) Тогда
					Продолжить;
				КонецЕсли;
				
				Если Налогообложение = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС Тогда
					Если НЕ БазаПериода.СписатьНДСПоРасходамАктивамНаСтатьиОтражения 
							ИЛИ НоваяСтрока.СтатьяРасходов = Неопределено Тогда
						НоваяСтрока.СтатьяОтраженияРасходов = БазаПериода.СтатьяРасходовНеНДС;
						НоваяСтрока.АналитикаОтраженияРасходов = БазаПериода.АналитикаРасходовНеНДС;
						НоваяСтрока.СтатьяРасходовНУ = БазаПериода.СтатьяРасходовНеНДС;
						НоваяСтрока.ЭтоПринимаемаяСтатьяРасходовНУ = БазаПериода.СтатьяРасходовНеНДС_ПринимаетсяКНУ;
					КонецЕсли;
				ИначеЕсли Налогообложение = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД Тогда
					Если НЕ БазаПериода.СписатьНДСПоРасходамАктивамНаСтатьиОтражения 
							ИЛИ НоваяСтрока.СтатьяРасходов = Неопределено Тогда
						НоваяСтрока.СтатьяОтраженияРасходов = БазаПериода.СтатьяРасходовЕНВД;
						НоваяСтрока.АналитикаОтраженияРасходов = БазаПериода.АналитикаРасходовЕНВД;
						НоваяСтрока.СтатьяРасходовНУ = БазаПериода.СтатьяРасходовЕНВД;
						НоваяСтрока.ЭтоПринимаемаяСтатьяРасходовНУ = БазаПериода.СтатьяРасходовЕНВД_ПринимаетсяКНУ;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			
			Таблица = ТаблицыРаспределения[СтрокаПрочихРасходов.НовоеНалогообложениеНДС];
			Если Таблица = Неопределено Тогда
				ТекстСообщения = СтрШаблон(
					НСтр("ru = 'Не определено налогообложение по внеоборотнуму активу %1.'"), 
					СтрокаПрочихРасходов.АналитикаРасходов);
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(Таблица.Добавить(), СтрокаПрочихРасходов);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Если 
	// - распределение выполняется после 01.07.2016
	// - партия поступила ранее 01.07.2016, 
	// то распределение также необходимо выполнить на документы несыерьвого экспорта.
	РаспределятьНаВесьЭкспорт = УчетНДСУТ.УпрощенныйПорядокВычетаНДСПоНесырьевомуЭкспорту(Реквизиты.ПериодБазы);
	РаспределитьПартииПрочихРасходовЭкспортПоДокументам(ПартииПрочихРасходовЭкспорт, Реквизиты, РаспределятьНаВесьЭкспорт);
	
	РаспределитьПартииПрочихРасходовЭкспортПоДокументам(ПартииПрочихРасходовЭкспортСырьевыхТоваровУслуг, Реквизиты, Ложь);
	
	Для Каждого КлючИЗначение Из ТаблицыРаспределения Цикл
		Налогообложение = КлючИЗначение.Ключ;
		Таблица = КлючИЗначение.Значение;
		Таблица.ЗаполнитьЗначения(Налогообложение, "НалогообложениеНДС");
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("ПартииПрочихРасходовОблагаетсяНДС",               ПартииПрочихРасходовОблагаетсяНДС);
	Результат.Вставить("ПартииПрочихРасходовНеОблагаетсяНДС",             ПартииПрочихРасходовНеОблагаетсяНДС);
	Результат.Вставить("ПартииПрочихРасходовОблагаетсяЕНВД",              ПартииПрочихРасходовОблагаетсяЕНВД);
	Результат.Вставить("ПартииПрочихРасходовЭкспорт",                     ПартииПрочихРасходовЭкспорт);
	Результат.Вставить("ПартииПрочихРасходовЭкспортНесырьевыхТоваров",    ПартииПрочихРасходовЭкспортНесырьевыхТоваров);
	Результат.Вставить("ПартииПрочихРасходовЭкспортСырьевыхТоваровУслуг", ПартииПрочихРасходовЭкспортСырьевыхТоваровУслуг);
	
	Возврат Результат;
	
КонецФункции

Процедура РаспределитьПартииПрочихРасходовЭкспортПоДокументам(ПартииПрочихРасходовЭкспорт, Реквизиты, РаспределятьНаВесьЭкспорт)
	
	Если ПартииПрочихРасходовЭкспорт.Итог("НДСРегл") = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ИменаКолонок = УниверсальныеМеханизмыПартийИСебестоимости.ПолучитьИменаКолонокСтрокой(ПартииПрочихРасходовЭкспорт);
	УниверсальныеМеханизмыПартийИСебестоимости.ПоместитьТаблицуЗначенийВоВременнуюТаблицу(
		МенеджерВременныхТаблиц, "ПартииПрочихРасходовЭкспорт", ПартииПрочихРасходовЭкспорт, ИменаКолонок);
		
	ПартииПрочихРасходовЭкспорт.Очистить();
	
	РаспределитьПартииПрочихРасходовЭкспортПоДокументамТекущегоПериода(
		ПартииПрочихРасходовЭкспорт, 
		Реквизиты, 
		МенеджерВременныхТаблиц, 
		РаспределятьНаВесьЭкспорт);
		
	РаспределитьПартииПрочихРасходовЭкспортПоДокументамПрошлыхПериодов(
		ПартииПрочихРасходовЭкспорт, 
		Реквизиты, 
		МенеджерВременныхТаблиц);
	
КонецПроцедуры

Процедура РаспределитьПартииПрочихРасходовЭкспортПоДокументамТекущегоПериода(ПартииПрочихРасходовЭкспорт, Реквизиты, МенеджерВременныхТаблиц, РаспределятьНаВесьЭкспорт)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументыЭкспорт.Документ             КАК Документ,
	|	ДокументыЭкспорт.СуммаВыручки         КАК СуммаНесырьевыеТовары,
	|	ДокументыЭкспорт.КорректировкаВыручки КАК КорректировкаНесырьевыеТовары
	|ПОМЕСТИТЬ ДокументыЭкспортНесырьевыхТоваров
	|ИЗ
	|	&ДокументыЭкспорт КАК ДокументыЭкспорт
	|ГДЕ
	|	ДокументыЭкспорт.СуммаВыручки > 0
	|;
	|
	|/////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	База.Дата КАК Дата,
	|	База.Документ КАК Документ,
	|	СУММА(База.Сумма) КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДокументыЭкспорт.Документ.Дата             КАК Дата,
	|		ДокументыЭкспорт.Документ                  КАК Документ,
	|		(ДокументыЭкспорт.СуммаВыручки 
	|			+ ДокументыЭкспорт.КорректировкаВыручки)  КАК Сумма
	|	ИЗ
	|		Документ.РаспределениеНДС.ДокументыЭкспорт КАК ДокументыЭкспорт
	|	ГДЕ
	|		ДокументыЭкспорт.Ссылка = &Ссылка
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ДокументыЭкспорт.Документ.Дата КАК Дата,
	|		ДокументыЭкспорт.Документ      КАК Документ,
	|		(ДокументыЭкспорт.СуммаНесырьевыеТовары 
	|			+ ДокументыЭкспорт.КорректировкаНесырьевыеТовары) КАК Сумма
	|	ИЗ
	|		ДокументыЭкспортНесырьевыхТоваров КАК ДокументыЭкспорт) База
	|
	|СГРУППИРОВАТЬ ПО
	|	База.Дата,
	|	База.Документ
	|
	|ИМЕЮЩИЕ
	|	СУММА(База.Сумма) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|;
	|
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	ПартииПрочихРасходовЭкспорт КАК ПартииПрочихРасходовЭкспорт
	|ГДЕ
	|	ПартииПрочихРасходовЭкспорт.ПериодБазы = &ПериодБазы
	|	И ПартииПрочихРасходовЭкспорт.НДСРегл >= 0
	|
	|УПОРЯДОЧИТЬ ПО 
	|	ПартииПрочихРасходовЭкспорт.ДатаПоступленияРасходов
	|;
	|
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	ПартииПрочихРасходовЭкспорт КАК ПартииПрочихРасходовЭкспорт
	|ГДЕ
	|	ПартииПрочихРасходовЭкспорт.ПериодБазы = &ПериодБазы
	|	И ПартииПрочихРасходовЭкспорт.НДСРегл < 0
	|
	|УПОРЯДОЧИТЬ ПО 
	|	ПартииПрочихРасходовЭкспорт.ДатаПоступленияРасходов
	|";
	
	Запрос.УстановитьПараметр("ПериодБазы", Реквизиты.ПериодБазы);
	Запрос.УстановитьПараметр("Ссылка", Реквизиты.Ссылка);
	Если РаспределятьНаВесьЭкспорт Тогда
		База = ПолучитьБазуРаспределения(Реквизиты.ПериодБазы, Реквизиты.ПериодНачало, Реквизиты.Организация, Истина);
		Запрос.УстановитьПараметр("ДокументыЭкспорт", База.ДокументыЭкспорт);
	Иначе
		ДокументыЭкспорт = Новый ТаблицаЗначений;
		ДокументыЭкспорт.Колонки.Добавить("Документ", Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));
		ДокументыЭкспорт.Колонки.Добавить("СуммаВыручки", Новый ОписаниеТипов("Число"));
		ДокументыЭкспорт.Колонки.Добавить("КорректировкаВыручки", Новый ОписаниеТипов("Число"));
		Запрос.УстановитьПараметр("ДокументыЭкспорт", ДокументыЭкспорт);
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();
	
	ДокументыРеализации                         = Результат[Результат.Количество() - 3].Выгрузить();
	ДокументыРеализации.Колонки.Добавить("НДС");
	
	// Положительные и отрицательные остатки распределим отдельно.
	ТаблицыДляРаспределения = Новый Массив;
	ТаблицыДляРаспределения.Добавить(Результат[Результат.Количество() - 2].Выгрузить()); // Положительные суммы по СФ и ИСФ, КСФ
	ТаблицыДляРаспределения.Добавить(Результат[Результат.Количество() - 1].Выгрузить()); // Отрицательные суммы по КСФ
	
	Для каждого ПартииПрочихРасходовЭкспортДляРаспределения Из ТаблицыДляРаспределения Цикл
	
		Если ПартииПрочихРасходовЭкспортДляРаспределения.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Если ДокументыРеализации.Количество() = 0 Тогда
			// Нет документов для распределения, вернет таблицу как есть
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ПартииПрочихРасходовЭкспортДляРаспределения, ПартииПрочихРасходовЭкспорт);
			Возврат;
		КонецЕсли;
		
		НДСВсего         = ПартииПрочихРасходовЭкспортДляРаспределения.Итог("НДСРегл");
		Коэффициенты     = ДокументыРеализации.ВыгрузитьКолонку("Сумма");
		НДСПоРеализациям = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(НДСВсего, Коэффициенты); 
		
		ДокументыРеализации.ЗагрузитьКолонку(НДСПоРеализациям, "НДС");
		
		Для каждого СтрокаДокумент Из ДокументыРеализации Цикл
			
			НДСОсталосьРаспределить = СтрокаДокумент.НДС;
			
			РаспределенныеПартии = Новый Массив();
			
			Для каждого ПартияПрочихРасходов Из ПартииПрочихРасходовЭкспортДляРаспределения Цикл
				
				Если НДСОсталосьРаспределить = 0 Тогда
					Прервать;
				КонецЕсли;
				
				Если ПартияПрочихРасходов.НДСРегл = 0 Тогда
					
					Если ПартияПрочихРасходов.СтоимостьРегл > 0 Тогда
						// Распределять по реализациям не требуется, но остаток по регитстру необходимо закрыть.
						НоваяСтрока = ПартииПрочихРасходовЭкспорт.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ПартияПрочихРасходов);
					КонецЕсли;
					
					РаспределенныеПартии.Добавить(ПартияПрочихРасходов);
					
					Продолжить;
					
				КонецЕсли;
				
				Если НДСОсталосьРаспределить < 0 Тогда
					НДСРегл = Макс(НДСОсталосьРаспределить, ПартияПрочихРасходов.НДСРегл);
				Иначе
					НДСРегл = Мин(НДСОсталосьРаспределить, ПартияПрочихРасходов.НДСРегл);
				КонецЕсли;
				 
				СтоимостьРегл = Окр(ПартияПрочихРасходов.СтоимостьРегл * НДСРегл / ПартияПрочихРасходов.НДСРегл, 2);
				НДСУпр =  Окр(ПартияПрочихРасходов.НДСУпр * НДСРегл / ПартияПрочихРасходов.НДСРегл, 2);
				
				НоваяСтрока = ПартииПрочихРасходовЭкспорт.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ПартияПрочихРасходов, , "НДСРегл, СтоимостьРегл");
				
				НоваяСтрока.ДокументРеализации = СтрокаДокумент.Документ;
				
				НоваяСтрока.НДСРегл = НДСРегл;
				НоваяСтрока.СтоимостьРегл = СтоимостьРегл;
				НоваяСтрока.НДСУпр = НДСУпр;
				
				ПартияПрочихРасходов.НДСРегл = ПартияПрочихРасходов.НДСРегл - НДСРегл;
				ПартияПрочихРасходов.СтоимостьРегл = ПартияПрочихРасходов.СтоимостьРегл - СтоимостьРегл;
				ПартияПрочихРасходов.НДСУпр = ПартияПрочихРасходов.НДСУпр - НДСУпр;
				
				НДСОсталосьРаспределить = НДСОсталосьРаспределить - НДСРегл;
				
			КонецЦикла;
			
			Для каждого РаспределеннаяПартия Из РаспределенныеПартии Цикл
				ПартииПрочихРасходовЭкспортДляРаспределения.Удалить(РаспределеннаяПартия);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РаспределитьПартииПрочихРасходовЭкспортПоДокументамПрошлыхПериодов(ПартииПрочихРасходовЭкспорт, Реквизиты, МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПартииПрочихРасходовЭкспорт.ПериодБазы                  КАК ПериодБазы,
	|	ПартииПрочихРасходовЭкспорт.ДокументПоступленияРасходов КАК ДокументПоступленияРасходов,
	|	ПартииПрочихРасходовЭкспорт.ОснованиеКорректировки      КАК ОснованиеКорректировки
	|ПОМЕСТИТЬ ПартииПоДокументамПрошлыхПериодов
	|ИЗ
	|	ПартииПрочихРасходовЭкспорт КАК ПартииПрочихРасходовЭкспорт
	|ГДЕ
	|	ПартииПрочихРасходовЭкспорт.ПериодБазы < &ПериодБазы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПериодБазы,
	|	ОснованиеКорректировки
	|;
	|
	|ВЫБРАТЬ
	|	ПартииПоДокументамПрошлыхПериодов.ДокументПоступленияРасходов КАК ДокументПоступленияРасходов,
	|	ПартииПрочихРасходов.ДокументРеализации КАК ДокументРеализации,
	|	ПартииПрочихРасходов.НДСРегл КАК Сумма
	|ИЗ
	|	ПартииПоДокументамПрошлыхПериодов КАК ПартииПоДокументамПрошлыхПериодов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ПартииПрочихРасходов КАК ПартииПрочихРасходов
	|	ПО
	|		КОНЕЦПЕРИОДА(ПартииПрочихРасходов.Период, МЕСЯЦ) = ПартииПоДокументамПрошлыхПериодов.ПериодБазы
	|		И ПартииПрочихРасходов.Регистратор ССЫЛКА Документ.РаспределениеНДС 
	|		И ПартииПрочихРасходов.ДокументПоступленияРасходов = ПартииПоДокументамПрошлыхПериодов.ОснованиеКорректировки
	|		И ПартииПрочихРасходов.ДокументРеализации <> НЕОПРЕДЕЛЕНО
	|;
	|
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	ПартииПрочихРасходовЭкспорт КАК ПартииПрочихРасходовЭкспорт
	|ГДЕ
	|	ПартииПрочихРасходовЭкспорт.ПериодБазы < &ПериодБазы
	|";
	
	Запрос.УстановитьПараметр("ПериодБазы", Реквизиты.ПериодБазы);
	Запрос.УстановитьПараметр("Ссылка", Реквизиты.Ссылка);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ДокументыРеализации                         = Результат[Результат.Количество() - 2].Выгрузить();
	ПартииПрочихРасходовЭкспортДляРаспределения = Результат[Результат.Количество() - 1].Выгрузить();
	
	Если ПартииПрочихРасходовЭкспортДляРаспределения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыРеализации.Индексы.Добавить("ДокументПоступленияРасходов");
	ОтборДокументов = Новый Структура("ДокументПоступленияРасходов");
	
	Для каждого Партия Из ПартииПрочихРасходовЭкспортДляРаспределения Цикл
		
		ЗаполнитьЗначенияСвойств(ОтборДокументов, Партия);
		ДокументыПоПартии = ДокументыРеализации.НайтиСтроки(ОтборДокументов);
		
		Если ДокументыПоПартии.Количество() = 0 Тогда
			// Не удалось найти документы реализации, добавим строку без распределения по документам.
			НоваяСтрока = ПартииПрочихРасходовЭкспорт.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Партия); 
			Продолжить;
		КонецЕсли;
		
		МассивКоэффициентов = Новый Массив();
		Для каждого Документ Из ДокументыПоПартии Цикл
			МассивКоэффициентов.Добавить(Документ.Сумма);
		КонецЦикла;
		
		РаспределениеСтоимостьРегл = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(Партия.СтоимостьРегл, МассивКоэффициентов);
		РаспределениеНДСРегл = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(Партия.НДСРегл, МассивКоэффициентов);
		РаспределениеНДСУпр = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(Партия.НДСУпр, МассивКоэффициентов);
			
		Индекс = 0;
		Для каждого Документ Из ДокументыПоПартии Цикл
			
			СтоимостьРегл = ?(РаспределениеСтоимостьРегл <> Неопределено, РаспределениеСтоимостьРегл[Индекс], 0);
			НДСРегл       = ?(РаспределениеНДСРегл       <> Неопределено, РаспределениеНДСРегл[Индекс], 0);
			НДСУпр        = ?(РаспределениеНДСУпр       <> Неопределено, РаспределениеНДСУпр[Индекс], 0);

			НоваяСтрока = ПартииПрочихРасходовЭкспорт.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Партия);
			НоваяСтрока.СтоимостьРегл = СтоимостьРегл;
			НоваяСтрока.НДСРегл = НДСРегл;
			НоваяСтрока.НДСУпр = НДСУпр;
			НоваяСтрока.ДокументРеализации = Документ.ДокументРеализации;
			
			Индекс = Индекс + 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция БазаРаспределения(ПартииПрочихРасходов, Реквизиты)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПериодыБазы.ПериодБазы
	|ПОМЕСТИТЬ ПериодыБазы
	|ИЗ
	|	&ПериодыБазы КАК ПериодыБазы
	|;
	|
	|////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыБазы.ПериодБазы,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(РаспределениеНДС.ПрименитьПравило5Процентов, &ПрименитьПравило5Процентов) ТОГДА
	|			ЕСТЬNULL(РаспределениеНДС.ВыручкаНДС,   &ВыручкаНДС)
	|				+ ЕСТЬNULL(РаспределениеНДС.ВыручкаНеНДС, &ВыручкаНеНДС)
	|				+ ЕСТЬNULL(РаспределениеНДС.ВыручкаЕНВД,  &ВыручкаЕНВД)
	|			ИНАЧЕ ЕСТЬNULL(РаспределениеНДС.ВыручкаНДС, &ВыручкаНДС)
	|	КОНЕЦ КАК НДС,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(РаспределениеНДС.ПрименитьПравило5Процентов, &ПрименитьПравило5Процентов)
	|			ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(РаспределениеНДС.ВыручкаНеНДС, &ВыручкаНеНДС)
	|	КОНЕЦ КАК НеНДС,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(РаспределениеНДС.ПрименитьПравило5Процентов, &ПрименитьПравило5Процентов)
	|			ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(РаспределениеНДС.ВыручкаЕНВД, &ВыручкаЕНВД)
	|	КОНЕЦ КАК ЕНВД,
	|	ЕСТЬNULL(РаспределениеНДС.ВыручкаНДС0, &ВыручкаНДС0) КАК НДС0,
	|	ЕСТЬNULL(РаспределениеНДС.ВыручкаНДС0СырьевыеТоварыУслуги, &ВыручкаНДС0СырьевыеТоварыУслуги) КАК НДС0СырьевыеТоварыУслуги,
	|	ЕСТЬNULL(РаспределениеНДС.ВыручкаНДС0НесырьевыеТовары, &ВыручкаНДС0НесырьевыеТовары) КАК НДС0НесырьевыеТовары,
	|	
	|	ЕСТЬNULL(РаспределениеНДС.СписатьНДСПоРасходамАктивамНаСтатьиОтражения, 
	|				&СписатьНДСПоРасходамАктивамНаСтатьиОтражения) КАК СписатьНДСПоРасходамАктивамНаСтатьиОтражения,
	|	ЕСТЬNULL(РаспределениеНДС.СтатьяРасходовНеНДС, 
	|				&СтатьяРасходовНеНДС) КАК СтатьяРасходовНеНДС,
	|	ЕСТЬNULL(РаспределениеНДС.АналитикаРасходовНеНДС, 
	|				&АналитикаРасходовНеНДС) КАК АналитикаРасходовНеНДС,
	|	ЕСТЬNULL(РаспределениеНДС.СтатьяРасходовЕНВД, 
	|				&СтатьяРасходовЕНВД) КАК СтатьяРасходовЕНВД,
	|	ЕСТЬNULL(РаспределениеНДС.АналитикаРасходовЕНВД, 
	|				&АналитикаРасходовЕНВД) КАК АналитикаРасходовЕНВД,
	|	
	|	ВЫРАЗИТЬ(ЕСТЬNULL(РаспределениеНДС.СтатьяРасходовНеНДС, 
	|				&СтатьяРасходовНеНДС) КАК ПланВидовХарактеристик.СтатьиРасходов).ПринятиеКналоговомуУчету КАК СтатьяРасходовНеНДС_ПринимаетсяКНУ,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(РаспределениеНДС.СтатьяРасходовЕНВД, 
	|				&СтатьяРасходовЕНВД) КАК ПланВидовХарактеристик.СтатьиРасходов).ПринятиеКналоговомуУчету КАК СтатьяРасходовЕНВД_ПринимаетсяКНУ
	|ИЗ
	|	ПериодыБазы КАК ПериодыБазы
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.РаспределениеНДС КАК РаспределениеНДС
	|	ПО
	|		ПериодыБазы.ПериодБазы = КОНЕЦПЕРИОДА(РаспределениеНДС.Дата, МЕСЯЦ)
	|		И РаспределениеНДС.Организация = &Организация 
	|		И РаспределениеНДС.Проведен
	|";
	
	ПериодыБазы = ПартииПрочихРасходов.Скопировать();
	ПериодыБазы.Свернуть("ПериодБазы");
	
	Запрос.УстановитьПараметр("ПериодыБазы",                     ПериодыБазы);
	Запрос.УстановитьПараметр("Организация",                     Реквизиты.Организация);
	Запрос.УстановитьПараметр("ПрименитьПравило5Процентов",      Реквизиты.ПрименитьПравило5Процентов);
	Запрос.УстановитьПараметр("ВыручкаНДС",                      Реквизиты.ВыручкаНДС);
	Запрос.УстановитьПараметр("ВыручкаНеНДС",                    Реквизиты.ВыручкаНеНДС);
	Запрос.УстановитьПараметр("ВыручкаЕНВД",                     Реквизиты.ВыручкаЕНВД);
	Запрос.УстановитьПараметр("ВыручкаНДС0",                     Реквизиты.ВыручкаНДС0);
	Запрос.УстановитьПараметр("ВыручкаНДС0СырьевыеТоварыУслуги", Реквизиты.ВыручкаНДС0СырьевыеТоварыУслуги);
	Запрос.УстановитьПараметр("ВыручкаНДС0НесырьевыеТовары",     Реквизиты.ВыручкаНДС0НесырьевыеТовары);
	
	Запрос.УстановитьПараметр("СписатьНДСПоРасходамАктивамНаСтатьиОтражения", Реквизиты.СписатьНДСПоРасходамАктивамНаСтатьиОтражения);
	Запрос.УстановитьПараметр("СтатьяРасходовНеНДС",                          Реквизиты.СтатьяРасходовНеНДС);
	Запрос.УстановитьПараметр("АналитикаРасходовНеНДС",                       Реквизиты.АналитикаРасходовНеНДС);
	Запрос.УстановитьПараметр("СтатьяРасходовЕНВД",                           Реквизиты.СтатьяРасходовЕНВД);
	Запрос.УстановитьПараметр("АналитикаРасходовЕНВД",                        Реквизиты.АналитикаРасходовЕНВД);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаРезультатРаспределения()
	
	НаборЗаписей = РегистрыНакопления.ПартииПрочихРасходов.СоздатьНаборЗаписей();
	Результат = НаборЗаписей.ВыгрузитьКолонки();
	
	Результат.Колонки.Удалить("Активность");
	Результат.Колонки.Удалить("МоментВремени");
	
	Результат.Колонки.Добавить("ОснованиеКорректировки",  Метаданные.Документы.КорректировкаПриобретения.Реквизиты.ДокументОснование.Тип);
	Результат.Колонки.Добавить("ДатаПоступленияРасходов", Новый ОписаниеТипов("Дата"));
	
	Результат.Колонки.Добавить("НалогообложениеНДСПартии",         Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНалогообложенияНДС"));
	Результат.Колонки.Добавить("Контрагент",                       Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	Результат.Колонки.Добавить("СтавкаНДС",                        Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	Результат.Колонки.Добавить("ВидЦенностиНДС",                   Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЦенностей"));
	Результат.Колонки.Добавить("ОрганизацияПолучатель",            Новый ОписаниеТипов("СправочникСсылка.Организации"));
	
	Результат.Колонки.Добавить("ВнеоборотныйАктив",                     Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ВключаетсяВРасходыНУПриПринятииКУчету", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ПодразделениеРасходовНУ",               Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	Результат.Колонки.Добавить("СтатьяРасходовНУ",                      Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
	Результат.Колонки.Добавить("ЭтоПринимаемаяСтатьяРасходовНУ",        Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("АналитикаРасходовНУ",                   Новый ОписаниеТипов(Метаданные.ПланыВидовХарактеристик.СтатьиРасходов.Тип, "NULL"));
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаПартииПрочихРасходов(РезультатРаспределения, Реквизиты)
	
	ПартииПрочихРасходов = РегистрыНакопления.ПартииПрочихРасходов.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	ПартииПрочихРасходов.Колонки.Удалить("Активность");
	
	Для каждого ТаблицаРаспределения Из РезультатРаспределения Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаРаспределения.Значение, ПартииПрочихРасходов);
	КонецЦикла;
	
	ПартииПрочихРасходов.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход, "ВидДвижения");
	ПартииПрочихРасходов.ЗаполнитьЗначения(Реквизиты.Период,             "Период");
	
	Возврат ПартииПрочихРасходов;
	
КонецФункции

Функция ТаблицаПрочиеРасходы(РезультатРаспределения, Реквизиты)
	
	ПрочиеРасходы = РегистрыНакопления.ПрочиеРасходы.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	ПрочиеРасходы.Колонки.Удалить("Активность");
	
	Для каждого Строка Из РезультатРаспределения Цикл
		НоваяСтрока = ПрочиеРасходы.Добавить();
		НоваяСтрока.Период = Реквизиты.Период;
		НоваяСтрока.ХозяйственнаяОперация	= Перечисления.ХозяйственныеОперации.РаспределениеНДС;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	Возврат ПрочиеРасходы;
	
КонецФункции

Процедура ПрочиеРасходыДобавитьСтрокиВключениеВСтоимость(ПрочиеРасходы, ТаблицаИсточник, Реквизиты, ЭтоРасходыЕНВД = Ложь)
	
	ИспользоватьВНА2_2 = ПолучитьФункциональнуюОпцию("ИспользоватьВнеоборотныеАктивы2_2");
	ИспользоватьВНА2_4 = Ложь;
	//++ НЕ УТ
	ИспользоватьВНА2_4 = ВнеоборотныеАктивы.ИспользуетсяУправлениеВНА_2_4(Реквизиты.Период);
	//-- НЕ УТ
	
	Для каждого Строка Из ТаблицаИсточник Цикл
		
		Если НЕ ПустаяСтрока(Строка.ВнеоборотныйАктив) 
			 И НЕ Строка.ВключаетсяВРасходыНУПриПринятииКУчету
			 И ИспользоватьВНА2_2 И НЕ ИспользоватьВНА2_4 Тогда 
			// В учете внеоборотные активов версии 2.2 данные хранятся в проводках
			Продолжить;
		КонецЕсли;
		
		Если Строка.НалогообложениеНДСПартии = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС
				ИЛИ Строка.НалогообложениеНДСПартии = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД Тогда
			// Уже в расходах
			Продолжить;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(Строка.ВнеоборотныйАктив) И Строка.ВключаетсяВРасходыНУПриПринятииКУчету Тогда
			Подразделение       = Строка.ПодразделениеРасходовНУ;
			СтатьяРасходов		= Строка.СтатьяРасходовНУ;
			АналитикаРасходов	= Строка.АналитикаРасходовНУ;
		ИначеЕсли ЗначениеЗаполнено(Строка.СтатьяОтраженияРасходов) Тогда
			Подразделение		= Строка.Подразделение;
			СтатьяРасходов		= Строка.СтатьяОтраженияРасходов;
			АналитикаРасходов	= Строка.АналитикаОтраженияРасходов;
		Иначе
			Подразделение		= Строка.Подразделение;
			СтатьяРасходов		= Строка.СтатьяРасходов;
			АналитикаРасходов	= Строка.АналитикаРасходов;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтатьяРасходов) 
				ИЛИ ТипЗнч(СтатьяРасходов) <> Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов") Тогда
			// Это не расходы
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ПрочиеРасходы.Добавить();
		НоваяСтрока.Период					= Реквизиты.Период;
		НоваяСтрока.Организация				= Реквизиты.Организация;
		НоваяСтрока.ХозяйственнаяОперация	= Перечисления.ХозяйственныеОперации.РаспределениеНДС;
		НоваяСтрока.НаправлениеДеятельности = Строка.НаправлениеДеятельности;
		НоваяСтрока.Подразделение			= Подразделение;
		НоваяСтрока.СтатьяРасходов			= СтатьяРасходов;
		НоваяСтрока.АналитикаРасходов		= АналитикаРасходов;
		
		Если НЕ ПустаяСтрока(Строка.ВнеоборотныйАктив) И Строка.ВключаетсяВРасходыНУПриПринятииКУчету Тогда
			НоваяСтрока.ВременнаяРазница = -Строка.НДСРегл;
		Иначе
			НоваяСтрока.СуммаРегл = Строка.НДСРегл;
		КонецЕсли;
		Если НЕ Строка.ЭтоПринимаемаяСтатьяРасходовНУ Тогда
			НоваяСтрока.ПостояннаяРазница = Строка.НДСРегл;
		КонецЕсли;
		НоваяСтрока.СуммаУпр = Строка.НДСУпр;
		
		Если ЗначениеЗаполнено(Строка.ОрганизацияПолучатель)
		 И Строка.ОрганизацияПолучатель <> Строка.Организация Тогда
		 
			НоваяСтрокаУпр = ПрочиеРасходы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаУпр, НоваяСтрока);
			НоваяСтрокаУпр.СуммаРегл = 0;
			НоваяСтрокаУпр.ПостояннаяРазница = 0;
			НоваяСтрокаУпр.ВременнаяРазница = 0;
			НоваяСтрокаУпр.СуммаУпр = -Строка.НДСУпр;
			НоваяСтрокаУпр.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторнированиеРасходовУУ;
			
			НоваяСтрокаУпр = ПрочиеРасходы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаУпр, НоваяСтрока);
			НоваяСтрокаУпр.Организация = Строка.ОрганизацияПолучатель;
			НоваяСтрокаУпр.СуммаРегл = 0;
			НоваяСтрокаУпр.ПостояннаяРазница = 0;
			НоваяСтрокаУпр.ВременнаяРазница = 0;
			НоваяСтрокаУпр.СуммаУпр = Строка.НДСУпр;
			НоваяСтрокаУпр.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РегистрацияРасходовУУ;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрочиеРасходыДобавитьСтрокиИсключениеИзСтоимости(ПрочиеРасходы, ТаблицаИсточник, Реквизиты)
	
	ИспользоватьВНА2_2 = ПолучитьФункциональнуюОпцию("ИспользоватьВнеоборотныеАктивы2_2");
	ИспользоватьВНА2_4 = Ложь;
	//++ НЕ УТ
	ИспользоватьВНА2_4 = ВнеоборотныеАктивы.ИспользуетсяУправлениеВНА_2_4(Реквизиты.Период);
	//-- НЕ УТ
	
	Для каждого Строка Из ТаблицаИсточник Цикл
		
		Если Не ПустаяСтрока(Строка.ВнеоборотныйАктив)
			 И ИспользоватьВНА2_2 И НЕ ИспользоватьВНА2_4 Тогда 
			// В учете внеоборотные активов версии 2.2 данные хранятся в проводках
			// Внеоборотные активы хранят данные в проводках
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Строка.СтатьяРасходов) Тогда
			// Это не расходы
			Продолжить;
		КонецЕсли;
		
		Если Строка.НалогообложениеНДСПартии <> Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС
			И Строка.НалогообложениеНДСПартии <> Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ПрочиеРасходы.Добавить();
		НоваяСтрока.Период					= Реквизиты.Период;
		НоваяСтрока.Организация				= Реквизиты.Организация;
		НоваяСтрока.Подразделение			= Строка.Подразделение;
		НоваяСтрока.НаправлениеДеятельности = Строка.НаправлениеДеятельности;
		НоваяСтрока.ХозяйственнаяОперация	= Перечисления.ХозяйственныеОперации.РаспределениеНДС;
		НоваяСтрока.СтатьяРасходов			= Строка.СтатьяРасходов;
		НоваяСтрока.АналитикаРасходов		= Строка.АналитикаРасходов;
		
		НоваяСтрока.СуммаРегл = -Строка.НДСРегл;
		Если НЕ Строка.ЭтоПринимаемаяСтатьяРасходовНУ Тогда
			НоваяСтрока.ПостояннаяРазница = -Строка.НДСРегл;
		КонецЕсли;
		НоваяСтрока.СуммаУпр = -Строка.НДСУпр;
		
		Если ЗначениеЗаполнено(Строка.ОрганизацияПолучатель)
		 И Строка.ОрганизацияПолучатель <> Строка.Организация Тогда
		 
			НоваяСтрокаУпр = ПрочиеРасходы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаУпр, НоваяСтрока);
			НоваяСтрокаУпр.СуммаРегл = 0;
			НоваяСтрокаУпр.ПостояннаяРазница = 0;
			НоваяСтрокаУпр.ВременнаяРазница = 0;
			НоваяСтрокаУпр.СуммаУпр = Строка.НДСУпр;
			НоваяСтрокаУпр.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторнированиеРасходовУУ;
			
			НоваяСтрокаУпр = ПрочиеРасходы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаУпр, НоваяСтрока);
			НоваяСтрокаУпр.Организация = Строка.ОрганизацияПолучатель;
			НоваяСтрокаУпр.СуммаРегл = 0;
			НоваяСтрокаУпр.ПостояннаяРазница = 0;
			НоваяСтрокаУпр.ВременнаяРазница = 0;
			НоваяСтрокаУпр.СуммаУпр = -Строка.НДСУпр;
			НоваяСтрокаУпр.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РегистрацияРасходовУУ;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//++ НЕ УТ

Функция ТаблицаОтражениеДокументовВРеглУчете(Реквизиты, ТаблицыДляДвижений)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	РаспределениеНДС.Организация КАК Организация,
	|	НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) КАК ДатаОтражения,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыОтраженияДокументовВРеглУчете.КОтражениюВРеглУчете) КАК Статус
	|ИЗ
	|	Документ.РаспределениеНДС КАК РаспределениеНДС
	|ГДЕ
	|	РаспределениеНДС.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&Период КАК Период,
	|	НДСОбособленныхПодразделений.ОбособленноеПодразделение КАК Организация,
	|	НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) КАК ДатаОтражения,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыОтраженияДокументовВРеглУчете.КОтражениюВРеглУчете)
	|ИЗ
	|	Документ.РаспределениеНДС.НДСОбособленныхПодразделений КАК НДСОбособленныхПодразделений
	|ГДЕ
	|	НДСОбособленныхПодразделений.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Реквизиты.Ссылка);
	Запрос.УстановитьПараметр("Период", Реквизиты.Период);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда 
		
		ТаблицаОтражения = Результат.Выгрузить();
		ТаблицыДляДвижений.Вставить("ТаблицаОтражениеДокументовВРеглУчете", ТаблицаОтражения);
		
	КонецЕсли;
	
КонецФункции

//-- НЕ УТ

#КонецОбласти

#Область ИнициализацияИЗаполнение

Функция ЗаполнитьПравилаСписанияНДС(Организация = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДанныеДокумента.СписатьНДСПоРасходамАктивамНаСтатьиОтражения КАК СписатьНДСПоРасходамАктивамНаСтатьиОтражения,
	|	ДанныеДокумента.СтатьяРасходовНеНДС КАК СтатьяРасходовНеНДС,
	|	ДанныеДокумента.АналитикаРасходовНеНДС КАК АналитикаРасходовНеНДС,
	|	ДанныеДокумента.СтатьяРасходовЕНВД КАК СтатьяРасходовЕНВД,
	|	ДанныеДокумента.АналитикаРасходовЕНВД КАК АналитикаРасходовЕНВД
	|ИЗ
	|	Документ.РаспределениеНДС КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И (ВЫБОР
	|		КОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ДанныеДокумента.Организация = &Организация
	|	КОНЕЦ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.Дата УБЫВ
	|";
	
	Запрос.УстановитьПараметр("Организация",?(Организация = Неопределено,Справочники.Организации.ПустаяСсылка(),Организация));
	
	Выборка = Запрос.Выполнить().Выбрать();
	ПравилаСписания = Новый Структура("СписатьНДСПоРасходамАктивамНаСтатьиОтражения,СтатьяРасходовНеНДС,АналитикаРасходовНеНДС,СтатьяРасходовЕНВД,АналитикаРасходовЕНВД");
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПравилаСписания,Выборка);
	Иначе
		ПравилаСписания.СписатьНДСПоРасходамАктивамНаСтатьиОтражения	= 1;
	КонецЕсли;
	
	Возврат ПравилаСписания
	
КонецФункции

Функция ПолучитьБазуРаспределения(Дата, НачалоПериода, Организация, ВключатьВсеДокументыЭкспорта = Ложь, КорректироватьРаспределениеНДСПрошлыхПериодов = Ложь, 
									КорректировкаРаспределенияНДС = Ложь, ПериодКорректировки = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДанных.Организация                      КАК Организация,
	|	ТаблицаДанных.Ссылка                           КАК Документ,
	|	СУММА(ТаблицаДанных.СуммаНесырьевыеТовары)             КАК СуммаНесырьевыеТовары,
	|	СУММА(ТаблицаДанных.СуммаСырьевыеТоварыУслуги)         КАК СуммаСырьевыеТоварыУслуги,
	|	СУММА(ТаблицаДанных.КорректировкаНесырьевыеТовары)     КАК КорректировкаНесырьевыеТовары,
	|	СУММА(ТаблицаДанных.КорректировкаСырьевыеТоварыУслуги) КАК КорректировкаСырьевыеТоварыУслуги
	|ПОМЕСТИТЬ ДокументыЭкспорт
	|ИЗ
	|	(ВЫБРАТЬ
	|		НДССостояниеРеализации0.Организация КАК Организация,
	|		ДанныеДокумента.Ссылка              КАК Ссылка,
	|		0                                   КАК СуммаНесырьевыеТовары,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(СуммыВВалютеРегл.СуммаБезНДСРегл,0) = 0
	|				ТОГДА ДанныеДокумента.СуммаСНДС
	|			ИНАЧЕ СуммыВВалютеРегл.БазаНДСРегл
	|		КОНЕЦ                               КАК СуммаСырьевыеТоварыУслуги,
	|		0                                   КАК КорректировкаНесырьевыеТовары,
	|		0                                   КАК КорректировкаСырьевыеТоварыУслуги
	|	ИЗ
	|		Документ.АктВыполненныхРабот.Услуги КАК ДанныеДокумента
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|		ПО 
	|			ДанныеДокумента.Ссылка = НДССостояниеРеализации0.ДокументРеализации
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СуммыДокументовВВалютеРегл КАК СуммыВВалютеРегл
	|		ПО 
	|			ДанныеДокумента.Ссылка = СуммыВВалютеРегл.Регистратор
	|			И ДанныеДокумента.ИдентификаторСтроки = СуммыВВалютеРегл.ИдентификаторСтроки
	|	ГДЕ
	|		НДССостояниеРеализации0.Организация В (&Организация)
	|		И НДССостояниеРеализации0.ДатаРеализации МЕЖДУ &ПериодНачало И &ПериодОкончание
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		НДССостояниеРеализации0.Организация  КАК Организация,
	|		ДанныеДокумента.Ссылка               КАК Ссылка,
	|		ВЫБОР 
	|			КОГДА НЕ ЕСТЬNULL(ДанныеДокумента.КодТНВЭД.СырьевойТовар, ЛОЖЬ)
	|				ТОГДА
	|					ВЫБОР КОГДА ЕСТЬNULL(СуммыВВалютеРегл.СуммаБезНДСРегл,0) = 0
	|						ТОГДА ДанныеДокумента.СуммаСНДС
	|						ИНАЧЕ СуммыВВалютеРегл.БазаНДСРегл
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ                                КАК СуммаНесырьевыеТовары,
	|		ВЫБОР 
	|			КОГДА ЕСТЬNULL(ДанныеДокумента.КодТНВЭД.СырьевойТовар, ЛОЖЬ)
	|				ТОГДА
	|					ВЫБОР КОГДА ЕСТЬNULL(СуммыВВалютеРегл.СуммаБезНДСРегл,0) = 0
	|						ТОГДА ДанныеДокумента.СуммаСНДС
	|						ИНАЧЕ СуммыВВалютеРегл.СуммаБезНДСРегл
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ                                КАК СуммаСырьевыеТоварыУслуги,
	|		0                                    КАК КорректировкаНесырьевыеТовары,
	|		0                                    КАК КорректировкаСырьевыеТоварыУслуги
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК ДанныеДокумента
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|		ПО 
	|			ДанныеДокумента.Ссылка = НДССостояниеРеализации0.ДокументРеализации
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.СуммыДокументовВВалютеРегл КАК СуммыВВалютеРегл
	|		ПО 
	|			ДанныеДокумента.Ссылка = СуммыВВалютеРегл.Регистратор
	|			И ДанныеДокумента.ИдентификаторСтроки = СуммыВВалютеРегл.ИдентификаторСтроки
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО 
	|			ДанныеДокумента.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			Справочник.Номенклатура КАК СпрНоменклатура 
	|		ПО
	|			СпрНоменклатура.Ссылка = Аналитика.Номенклатура
	|	ГДЕ
	|		НДССостояниеРеализации0.Организация В (&Организация)
	|		И НДССостояниеРеализации0.ДатаРеализации МЕЖДУ &ПериодНачало И &ПериодОкончание
	|		И ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		НДССостояниеРеализации0.Организация КАК Организация,
	|		ДанныеДокумента.Ссылка              КАК Ссылка,
	|		0                                   КАК СуммаНесырьевыеТовары,
	|		ВЫБОР
	|			КОГДА СуммыВВалютеРегл.СуммаБезНДСРегл ЕСТЬ NULL 
	|					ИЛИ СуммыВВалютеРегл.СуммаБезНДСРегл = 0
	|				ТОГДА ДанныеДокумента.СуммаСНДС
	|			ИНАЧЕ СуммыВВалютеРегл.БазаНДСРегл
	|		КОНЕЦ                               КАК СуммаСырьевыеТоварыУслуги,
	|		0                                   КАК КорректировкаНесырьевыеТовары,
	|		0                                   КАК КорректировкаСырьевыеТоварыУслуги
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК ДанныеДокумента
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|			ПО ДанныеДокумента.Ссылка = НДССостояниеРеализации0.ДокументРеализации
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СуммыДокументовВВалютеРегл КАК СуммыВВалютеРегл
	|			ПО ДанныеДокумента.Ссылка = СуммыВВалютеРегл.Регистратор
	|				И ДанныеДокумента.ИдентификаторСтроки = СуммыВВалютеРегл.ИдентификаторСтроки
	|	ГДЕ
	|		НДССостояниеРеализации0.Организация В (&Организация)
	|		И НДССостояниеРеализации0.ДатаРеализации МЕЖДУ &ПериодНачало И &ПериодОкончание
	|		И ДанныеДокумента.Номенклатура.ТипНоменклатуры НЕ В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КорректировкаРеализации.Организация КАК Организация,
	|		КорректировкаРеализации.ДокументОснование      КАК Ссылка,
	|		0                                   КАК СуммаНесырьевыеТовары,
	|		0                                   КАК СуммаСырьевыеТоварыУслуги,
	|		0                                   КАК КорректировкаНесырьевыеТовары,
	|		ВЫБОР
	|			КОГДА СуммыВВалютеРегл.СуммаБезНДСРегл ЕСТЬ NULL 
	|					ИЛИ СуммыВВалютеРегл.СуммаБезНДСРегл = 0
	|				ТОГДА ДанныеДокумента.СуммаСНДС
	|			ИНАЧЕ СуммыВВалютеРегл.БазаНДСРегл
	|		КОНЕЦ                               КАК КорректировкаСырьевыеТоварыУслуги
	|	ИЗ
	|		Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			Документ.КорректировкаРеализации.Расхождения КАК ДанныеДокумента
	|		ПО 
	|			КорректировкаРеализации.Ссылка = ДанныеДокумента.Ссылка
	|			
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|		ПО 
	|			КорректировкаРеализации.ДокументОснование = НДССостояниеРеализации0.ДокументРеализации
	|			И НДССостояниеРеализации0.Организация В (&Организация)
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СуммыДокументовВВалютеРегл КАК СуммыВВалютеРегл
	|		ПО 
	|			ДанныеДокумента.Ссылка = СуммыВВалютеРегл.Регистратор
	|			И ДанныеДокумента.ИдентификаторСтроки = СуммыВВалютеРегл.ИдентификаторСтроки
	|	ГДЕ
	|		КорректировкаРеализации.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	|		И КорректировкаРеализации.Проведен
	|		И КорректировкаРеализации.Организация В (&Организация) 
	|		И ДанныеДокумента.Номенклатура.ТипНоменклатуры НЕ В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КорректировкаРеализации.Организация КАК Организация,
	|		КорректировкаРеализации.ДокументОснование      КАК Ссылка,
	|		0                                   КАК СуммаНесырьевыеТовары,
	|		0                                   КАК СуммаСырьевыеТоварыУслуги,
	|		ВЫБОР 
	|			КОГДА НЕ ЕСТЬNULL(ДанныеДокумента.КодТНВЭД.СырьевойТовар, ЛОЖЬ)
	|				ТОГДА
	|					ВЫБОР КОГДА ЕСТЬNULL(СуммыВВалютеРегл.СуммаБезНДСРегл,0) = 0
	|						ТОГДА ДанныеДокумента.СуммаСНДС
	|						ИНАЧЕ СуммыВВалютеРегл.БазаНДСРегл
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ                                КАК КорректировкаНесырьевыеТовары,
	|		ВЫБОР 
	|			КОГДА ЕСТЬNULL(ДанныеДокумента.КодТНВЭД.СырьевойТовар, ЛОЖЬ)
	|				ТОГДА
	|					ВЫБОР КОГДА ЕСТЬNULL(СуммыВВалютеРегл.СуммаБезНДСРегл,0) = 0
	|						ТОГДА ДанныеДокумента.СуммаСНДС
	|						ИНАЧЕ СуммыВВалютеРегл.СуммаБезНДСРегл
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ                                КАК КорректировкаСырьевыеТоварыУслуги
	|	ИЗ
	|		Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			Документ.КорректировкаРеализации.ВидыЗапасовКорректировкаВыручки КАК ДанныеДокумента
	|		ПО 
	|			КорректировкаРеализации.Ссылка = ДанныеДокумента.Ссылка
	|			
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|		ПО 
	|			КорректировкаРеализации.ДокументОснование = НДССостояниеРеализации0.ДокументРеализации
	|			И НДССостояниеРеализации0.Организация В (&Организация)
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СуммыДокументовВВалютеРегл КАК СуммыВВалютеРегл
	|		ПО 
	|			ДанныеДокумента.Ссылка = СуммыВВалютеРегл.Регистратор
	|			И ДанныеДокумента.ИдентификаторСтроки = СуммыВВалютеРегл.ИдентификаторСтроки
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО 
	|			ДанныеДокумента.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			Справочник.Номенклатура КАК СпрНоменклатура 
	|		ПО
	|			СпрНоменклатура.Ссылка = Аналитика.Номенклатура
	|	
	|	ГДЕ
	|		КорректировкаРеализации.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	|		И КорректировкаРеализации.Проведен
	|		И КорректировкаРеализации.Организация В (&Организация) 
	|		И ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КорректировкаРеализации.Организация КАК Организация,
	|		КорректировкаРеализации.ДокументОснование      КАК Ссылка,
	|		0                                   КАК СуммаНесырьевыеТовары,
	|		0                                   КАК СуммаСырьевыеТоварыУслуги,
	|		ВЫБОР 
	|			КОГДА НЕ ЕСТЬNULL(ДанныеДокумента.КодТНВЭД.СырьевойТовар, ЛОЖЬ)
	|				ТОГДА
	|					ВЫБОР КОГДА ЕСТЬNULL(СуммыВВалютеРегл.СуммаБезНДСРегл,0) = 0
	|						ТОГДА ДанныеДокумента.СуммаСНДС
	|						ИНАЧЕ СуммыВВалютеРегл.БазаНДСРегл
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ                                КАК КорректировкаНесырьевыеТовары,
	|		ВЫБОР 
	|			КОГДА ЕСТЬNULL(ДанныеДокумента.КодТНВЭД.СырьевойТовар, ЛОЖЬ)
	|				ТОГДА
	|					ВЫБОР КОГДА ЕСТЬNULL(СуммыВВалютеРегл.СуммаБезНДСРегл,0) = 0
	|						ТОГДА ДанныеДокумента.СуммаСНДС
	|						ИНАЧЕ СуммыВВалютеРегл.СуммаБезНДСРегл
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ                                КАК КорректировкаСырьевыеТоварыУслуги
	|	ИЗ
	|		Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			Документ.КорректировкаРеализации.ВидыЗапасовСписание КАК ДанныеДокумента
	|		ПО 
	|			КорректировкаРеализации.Ссылка = ДанныеДокумента.Ссылка
	|			
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|		ПО 
	|			КорректировкаРеализации.ДокументОснование = НДССостояниеРеализации0.ДокументРеализации
	|			И НДССостояниеРеализации0.Организация В (&Организация)
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СуммыДокументовВВалютеРегл КАК СуммыВВалютеРегл
	|		ПО 
	|			ДанныеДокумента.Ссылка = СуммыВВалютеРегл.Регистратор
	|			И ДанныеДокумента.ИдентификаторСтроки = СуммыВВалютеРегл.ИдентификаторСтроки
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО 
	|			ДанныеДокумента.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			Справочник.Номенклатура КАК СпрНоменклатура 
	|		ПО
	|			СпрНоменклатура.Ссылка = Аналитика.Номенклатура
	|	
	|	ГДЕ
	|		КорректировкаРеализации.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	|		И КорректировкаРеализации.Проведен
	|		И КорректировкаРеализации.Организация В (&Организация) 
	|		И ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КорректировкаРеализации.Организация       КАК Организация,
	|		КорректировкаРеализации.ДокументОснование КАК Ссылка,
	|		0                                         КАК СуммаНесырьевыеТовары,
	|		0                                         КАК СуммаСырьевыеТоварыУслуги,
	|		ВЫБОР 
	|			КОГДА НЕ ЕСТЬNULL(ДанныеДокумента.КодТНВЭД.СырьевойТовар, ЛОЖЬ)
	|				ТОГДА
	|					ВЫБОР КОГДА ЕСТЬNULL(СуммыВВалютеРегл.СуммаБезНДСРегл,0) = 0
	|						ТОГДА -ДанныеДокумента.СуммаСНДС
	|						ИНАЧЕ -СуммыВВалютеРегл.БазаНДСРегл
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ                                КАК КорректировкаНесырьевыеТовары,
	|		ВЫБОР 
	|			КОГДА ЕСТЬNULL(ДанныеДокумента.КодТНВЭД.СырьевойТовар, ЛОЖЬ)
	|				ТОГДА
	|					ВЫБОР КОГДА ЕСТЬNULL(СуммыВВалютеРегл.СуммаБезНДСРегл,0) = 0
	|						ТОГДА -ДанныеДокумента.СуммаСНДС
	|						ИНАЧЕ -СуммыВВалютеРегл.СуммаБезНДСРегл
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ                                КАК КорректировкаСырьевыеТоварыУслуги
	|	ИЗ
	|		Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			Документ.КорректировкаРеализации.ВидыЗапасовОприходование КАК ДанныеДокумента
	|		ПО 
	|			КорректировкаРеализации.Ссылка = ДанныеДокумента.Ссылка
	|			
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|		ПО 
	|			КорректировкаРеализации.ДокументОснование = НДССостояниеРеализации0.ДокументРеализации
	|			И НДССостояниеРеализации0.Организация В (&Организация)
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СуммыДокументовВВалютеРегл КАК СуммыВВалютеРегл
	|		ПО 
	|			ДанныеДокумента.Ссылка = СуммыВВалютеРегл.Регистратор
	|			И ДанныеДокумента.ИдентификаторСтроки = СуммыВВалютеРегл.ИдентификаторСтроки
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО 
	|			ДанныеДокумента.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			Справочник.Номенклатура КАК СпрНоменклатура 
	|		ПО
	|			СпрНоменклатура.Ссылка = Аналитика.Номенклатура
	|	
	|	ГДЕ
	|		КорректировкаРеализации.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	|		И КорректировкаРеализации.Проведен
	|		И КорректировкаРеализации.Организация В (&Организация) 
	|		И ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|	
	|	) КАК ТаблицаДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДанных.Организация,
	|	ТаблицаДанных.Ссылка
	|;
	|
	|///////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанных.Организация КАК Организация,
	|	СУММА(ТаблицаДанных.ВыручкаНДС) КАК ВыручкаНДС,
	|	СУММА(ТаблицаДанных.ВыручкаНеНДС) КАК ВыручкаНеНДС,
	|	СУММА(ТаблицаДанных.ВыручкаЕНВД) КАК ВыручкаЕНВД,
	|	СУММА(ТаблицаДанных.ВыручкаНДС0) КАК ВыручкаНДС0,
	|	СУММА(ТаблицаДанных.ВыручкаНДС0СырьевыеТоварыУслуги) КАК ВыручкаНДС0СырьевыеТоварыУслуги,
	|	СУММА(ТаблицаДанных.ВыручкаНДС0НесырьевыеТовары) КАК ВыручкаНДС0НесырьевыеТовары
	|,	СУММА(ТаблицаДанных.СуммаНДСОборот) КАК СуммаНДСНачисленного,
	|	СУММА(ТаблицаДанных.СуммаНДСМетодомЗачета)
	|ИЗ
	|	(ВЫБРАТЬ
	|		НДСЗаписиКнигиПродажОбороты.Организация КАК Организация,
	|		ЕстьNULL(НДСЗаписиКнигиПродажОбороты.ОборотПоРеализацииОборот,0) КАК ВыручкаНДС,
	|		ВЫБОР
	|			КОГДА НЕ НДСЗаписиКнигиПродажОбороты.СтавкаНДС.ДляОсвобожденногоОборота 
	|				И НЕ НДСЗаписиКнигиПродажОбороты.СтавкаНДС.МестоРеализацииНеРК
	|				ТОГДА ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.ОборотПоРеализацииОборот, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ВыручкаНеНДС,
	|		0 КАК ВыручкаЕНВД,
	|		0 КАК ВыручкаНДС0,
	|		0 КАК ВыручкаНДС0СырьевыеТоварыУслуги,
	|		0 КАК ВыручкаНДС0НесырьевыеТовары
	|,		НДСЗаписиКнигиПродажОбороты.СуммаНДСОборот КАК СуммаНДСОборот,
	|		0 КАК СуммаНДСМетодомЗачета
	|	ИЗ
	|		РегистрНакопления.НДС.Обороты(
	|				&ПериодНачало,
	|				&ПериодОкончание,
	|				Квартал,
	|				Организация В (&Организация) И &УсловиеНалоговыйПериод) КАК НДСЗаписиКнигиПродажОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСЗаписиКнигиПродажОбороты.Организация,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|,		0,
	|		НДСЗаписиКнигиПродажОбороты.СуммаНДСОборот
	|	ИЗ
	|		РегистрНакопления.НДС.Обороты(
	|				&ПериодНачало,
	|				&ПериодОкончание,
	|				Квартал,
	|				Организация В (&Организация) И &УсловиеНалоговыйПериод) КАК НДСЗаписиКнигиПродажОбороты
	|	
	|	ГДЕ
	|		НДСЗаписиКнигиПродажОбороты.ВидОперацииРеализации.ВидНДС = ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДСУплачиваемыйПриИмпортеМетодомЗачета)
	|		И НДСЗаписиКнигиПродажОбороты.ВидОперацииРеализации.НеЯвляетсяОборотомПоРеализации <> ИСТИНА
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НачисленияПоЗаймамВыданным.Организация,
	|		0,
	|		НачисленияПоЗаймамВыданным.СуммаРеглОборот,
	|		0,
	|		0,
	|		0,
	|		0
	|,		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.ДвиженияКонтрагентДоходыРасходы.Обороты(
	|			&ПериодНачало, 
	|			&ПериодОкончание,
	|			Квартал,
	|			ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.НачисленияПоЗаймамВыданным)
	|				И Организация В (&Организация) И ЛОЖЬ) КАК НачисленияПоЗаймамВыданным //НЕ РК
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НачисленияПоЗаймамВыданным.Организация,
	|		0,
	|		НачисленияПоЗаймамВыданным.СуммаРеглОборот,
	|		0,
	|		0,
	|		0,
	|		0
	|,		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.ДвиженияДоходыРасходыПрочиеАктивыПассивы.Обороты(
	|			&ПериодНачало, 
	|			&ПериодОкончание,
	|			Квартал,
	|			ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.НачисленияПоЗаймамВыданным)
	|				И Организация В (&Организация) И ЛОЖЬ) КАК НачисленияПоЗаймамВыданным //НЕ РК
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АналитикаПоПартнерам.Организация,
	|		0,
	|		0,
	|		ЕстьNULL(ВыручкаИСебестоимостьПродаж.СуммаВыручкиРегл,0),
	|		0,
	|		0,
	|		0
	|,		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			Справочник.КлючиАналитикиУчетаПоПартнерам КАК АналитикаПоПартнерам
	|		ПО 
	|			ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.Ссылка
	|	ГДЕ
	|		АналитикаПоПартнерам.Организация В (&Организация)
	|		И ВыручкаИСебестоимостьПродаж.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|		И ВыручкаИСебестоимостьПродаж.Период МЕЖДУ &ПериодНачало И &ПериодОкончание
	|		И ВыручкаИСебестоимостьПродаж.Активность
	|		И ВыручкаИСебестоимостьПродаж.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДокументыЭкспорт.Организация КАК Организация,
	|		0 КАК ВыручкаНДС,
	|		0 КАК ВыручкаНеНДС,
	|		0 КАК ВыручкаЕНВД,
	|		(ДокументыЭкспорт.СуммаНесырьевыеТовары             
	|			+ ДокументыЭкспорт.СуммаСырьевыеТоварыУслуги         
	|			+ ДокументыЭкспорт.КорректировкаНесырьевыеТовары     
	|			+ ДокументыЭкспорт.КорректировкаСырьевыеТоварыУслуги) КАК ВыручкаНДС0,
	|		(ДокументыЭкспорт.СуммаСырьевыеТоварыУслуги 
	|			+ ДокументыЭкспорт.КорректировкаСырьевыеТоварыУслуги) КАК ВыручкаНДС0СырьевыеТоварыУслуги,
	|		(ДокументыЭкспорт.СуммаНесырьевыеТовары
	|			+ ДокументыЭкспорт.КорректировкаНесырьевыеТовары)     КАК ВыручкаНДС0НесырьевыеТовары
	|,		0,
	|		0
	|	ИЗ
	|		ДокументыЭкспорт КАК ДокументыЭкспорт
	|	) КАК ТаблицаДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДанных.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыЭкспорт.Организация   КАК Организация,
	|	ДокументыЭкспорт.Документ      КАК Документ,
	|	ВЫБОР 
	|		КОГДА &УпрощенныйПорядокВычетаНДСПоНесырьевомуЭкспорту И НЕ &ВключатьВсеДокументыЭкспорта
	|			ТОГДА СУММА(ДокументыЭкспорт.СуммаСырьевыеТоварыУслуги)
	|			ИНАЧЕ СУММА(ДокументыЭкспорт.СуммаНесырьевыеТовары + ДокументыЭкспорт.СуммаСырьевыеТоварыУслуги) 
	|	КОНЕЦ КАК СуммаВыручки,
	|	ВЫБОР 
	|		КОГДА &УпрощенныйПорядокВычетаНДСПоНесырьевомуЭкспорту И НЕ &ВключатьВсеДокументыЭкспорта
	|			ТОГДА СУММА(ДокументыЭкспорт.КорректировкаСырьевыеТоварыУслуги)
	|			ИНАЧЕ СУММА(ДокументыЭкспорт.КорректировкаНесырьевыеТовары + ДокументыЭкспорт.КорректировкаСырьевыеТоварыУслуги) 
	|	КОНЕЦ КАК КорректировкаВыручки
	|ИЗ
	|	ДокументыЭкспорт КАК ДокументыЭкспорт
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументыЭкспорт.Организация,
	|	ДокументыЭкспорт.Документ
	|
	|ИМЕЮЩИЕ
	|	ВЫБОР 
	|		КОГДА &УпрощенныйПорядокВычетаНДСПоНесырьевомуЭкспорту И НЕ &ВключатьВсеДокументыЭкспорта
	|			ТОГДА СУММА(ДокументыЭкспорт.СуммаСырьевыеТоварыУслуги)
	|			ИНАЧЕ СУММА(ДокументыЭкспорт.СуммаНесырьевыеТовары + ДокументыЭкспорт.СуммаСырьевыеТоварыУслуги) 
	|	КОНЕЦ <> 0
	|	ИЛИ ВЫБОР 
	|		КОГДА &УпрощенныйПорядокВычетаНДСПоНесырьевомуЭкспорту И НЕ &ВключатьВсеДокументыЭкспорта
	|			ТОГДА СУММА(ДокументыЭкспорт.КорректировкаСырьевыеТоварыУслуги)
	|			ИНАЧЕ СУММА(ДокументыЭкспорт.КорректировкаНесырьевыеТовары + ДокументыЭкспорт.КорректировкаСырьевыеТоварыУслуги) 
	|	КОНЕЦ <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалогНаДобавленнуюСтоимостьКВозмещению) КАК СчетУчетаНДС,
	|	НДСКВозмещениюОбороты.СуммаНДСОборот КАК СуммаНДС,
	|	НДСКВозмещениюОбороты.Организация  КАК ОбособленноеПодразделение
	|ИЗ
	|	РегистрНакопления.НДСКВозмещению.Обороты(
	|			&ПериодНачало,
	|			&ПериодОкончание,
	|			Квартал,
	|			Организация В
	|					(ВЫБРАТЬ
	|						Организации.Ссылка
	|					ИЗ
	|						Справочник.Организации КАК Организации
	|					ГДЕ
	|						Организации.ГоловнаяОрганизация В (&Организация)
	|						И Организации.ОбособленноеПодразделение)
	|				И КорректируемыйПериод = ДАТАВРЕМЯ(1, 1, 1) И &УсловиеНалоговыйПериод) КАК НДСКВозмещениюОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС) КАК СчетУчетаНДС,
	|	НДСОбороты.СуммаНДСОборот,
	|	НДСОбороты.Организация
	|ИЗ
	|	РегистрНакопления.НДС.Обороты(
	|			&ПериодНачало,
	|			&ПериодОкончание,
	|			Квартал,
	|			Организация В
	|					(ВЫБРАТЬ
	|						Организации.Ссылка
	|					ИЗ
	|						Справочник.Организации КАК Организации
	|					ГДЕ
	|						Организации.ГоловнаяОрганизация В (&Организация)
	|						И Организации.ОбособленноеПодразделение)
	|				И КорректируемыйПериод = ДАТАВРЕМЯ(1, 1, 1) И &УсловиеНалоговыйПериод) КАК НДСОбороты
	|";
	
	ПараметрыУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаОрганизаций.ПараметрыУчетнойПолитики(Организация, Дата);
	УчитыватьКорректировкуРаспределенияНДС= ?(ПараметрыУчетнойПолитики = Неопределено, Ложь, ПараметрыУчетнойПолитики.КорректироватьРаспределениеНДСПрошлыхПериодов)
												И КорректироватьРаспределениеНДСПрошлыхПериодов;

	Если УчитыватьКорректировкуРаспределенияНДС Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеНалоговыйПериод", "И НалоговыйПериод >= &ПериодНачало И НалоговыйПериод <= &ПериодОкончание");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеНалоговыйПериод", "");
	КонецЕсли;
	
	Если КорректировкаРаспределенияНДС Тогда
		Запрос.Текст = ПолучитьЗапросБазыРаспределенияКорректировка();
		Запрос.УстановитьПараметр("ПериодКорректировки", ПериодКорректировки);
	КонецЕсли;
	
	ПериодНачало = НачалоПериода;
	ПериодОкончание = КонецКвартала(Дата);
	//++ НЕ УТ
	Если Месяц(Дата)%3 <> 0 Тогда
		ПериодОкончание = КонецМесяца(Дата);
	КонецЕсли;
	//-- НЕ УТ
	
	Запрос.УстановитьПараметр("ПериодНачало", ПериодНачало);
	Запрос.УстановитьПараметр("ПериодОкончание", ПериодОкончание);
	
	Если ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		МассивОрганизаций = Новый Массив();
		МассивОрганизаций.Добавить(Организация);
		Запрос.УстановитьПараметр("Организация", МассивОрганизаций);
		
		ЗапросОбособленныхПодразделений = Новый Запрос();
		ЗапросОбособленныхПодразделений.Текст = 
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Организация
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ОбособленноеПодразделение
		|	И Организации.ГоловнаяОрганизация = &ГоловнаяОрганизация";
		ЗапросОбособленныхПодразделений.УстановитьПараметр("ГоловнаяОрганизация", Организация);
		ВыборкаПодразделений = ЗапросОбособленныхПодразделений.Выполнить().Выбрать();
		
		Пока ВыборкаПодразделений.Следующий() Цикл
			МассивОрганизаций.Добавить(ВыборкаПодразделений.Организация);
		КонецЦикла; 
		
	Иначе
		Запрос.УстановитьПараметр("Организация", Организация)
	КонецЕсли;
	
	УпрощенныйПорядокВычетаНДСПоНесырьевомуЭкспорту = УчетНДСУТ.УпрощенныйПорядокВычетаНДСПоНесырьевомуЭкспорту(Дата);
	Запрос.УстановитьПараметр("УпрощенныйПорядокВычетаНДСПоНесырьевомуЭкспорту", УпрощенныйПорядокВычетаНДСПоНесырьевомуЭкспорту);
	Запрос.УстановитьПараметр("ВключатьВсеДокументыЭкспорта", ВключатьВсеДокументыЭкспорта);
	
	Результат = Запрос.ВыполнитьПакет();
	ТаблицаВыручка          = Результат[1].Выгрузить(); 
	ТаблицаДокументыЭкспорт = Результат[2].Выгрузить();
	
	БазаРаспределения = Новый Структура();
	БазаРаспределения.Вставить("ВыручкаНДС",                      ТаблицаВыручка.Итог("ВыручкаНДС"));
	БазаРаспределения.Вставить("ВыручкаНеНДС",                    ТаблицаВыручка.Итог("ВыручкаНеНДС"));
	БазаРаспределения.Вставить("ВыручкаЕНВД",                     ТаблицаВыручка.Итог("ВыручкаЕНВД"));
	
	БазаРаспределения.Вставить("ВыручкаНДС0",                     ТаблицаВыручка.Итог("ВыручкаНДС0"));
	БазаРаспределения.Вставить("ВыручкаНДС0НесырьевыеТовары",     ТаблицаВыручка.Итог("ВыручкаНДС0НесырьевыеТовары"));
	БазаРаспределения.Вставить("ВыручкаНДС0СырьевыеТоварыУслуги", ТаблицаВыручка.Итог("ВыручкаНДС0СырьевыеТоварыУслуги"));
	БазаРаспределения.Вставить("СуммаНДСНачисленного", 			  ТаблицаВыручка.Итог("СуммаНДСНачисленного"));
	БазаРаспределения.Вставить("ТаблицаВыручка", ТаблицаВыручка);
	БазаРаспределения.Вставить("ТаблицаНДСОбособленныхПодразделений", Результат[3].Выгрузить());
	
	БазаРаспределения.Вставить("ДокументыЭкспорт", ТаблицаДокументыЭкспорт);

	Возврат БазаРаспределения
	
КонецФункции

Функция ПолучитьЗапросБазыРаспределенияКорректировка()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДанных.Организация                      КАК Организация,
	|	ТаблицаДанных.Ссылка                           КАК Документ,
	|	СУММА(ТаблицаДанных.СуммаНесырьевыеТовары)             КАК СуммаНесырьевыеТовары,
	|	СУММА(ТаблицаДанных.СуммаСырьевыеТоварыУслуги)         КАК СуммаСырьевыеТоварыУслуги,
	|	СУММА(ТаблицаДанных.КорректировкаНесырьевыеТовары)     КАК КорректировкаНесырьевыеТовары,
	|	СУММА(ТаблицаДанных.КорректировкаСырьевыеТоварыУслуги) КАК КорректировкаСырьевыеТоварыУслуги
	|ПОМЕСТИТЬ ДокументыЭкспорт
	|ИЗ
	|	(ВЫБРАТЬ
	|		НДССостояниеРеализации0.Организация КАК Организация,
	|		ДанныеДокумента.Ссылка              КАК Ссылка,
	|		0                                   КАК СуммаНесырьевыеТовары,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(СуммыВВалютеРегл.СуммаБезНДСРегл,0) = 0
	|				ТОГДА ДанныеДокумента.СуммаСНДС
	|			ИНАЧЕ СуммыВВалютеРегл.БазаНДСРегл
	|		КОНЕЦ                               КАК СуммаСырьевыеТоварыУслуги,
	|		0                                   КАК КорректировкаНесырьевыеТовары,
	|		0                                   КАК КорректировкаСырьевыеТоварыУслуги
	|	ИЗ
	|		Документ.АктВыполненныхРабот.Услуги КАК ДанныеДокумента
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|		ПО 
	|			ДанныеДокумента.Ссылка = НДССостояниеРеализации0.ДокументРеализации
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СуммыДокументовВВалютеРегл КАК СуммыВВалютеРегл
	|		ПО 
	|			ДанныеДокумента.Ссылка = СуммыВВалютеРегл.Регистратор
	|			И ДанныеДокумента.ИдентификаторСтроки = СуммыВВалютеРегл.ИдентификаторСтроки
	|	ГДЕ
	|		НДССостояниеРеализации0.Организация В (&Организация)
	|		И НДССостояниеРеализации0.ДатаРеализации МЕЖДУ &ПериодНачало И &ПериодОкончание
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		НДССостояниеРеализации0.Организация  КАК Организация,
	|		ДанныеДокумента.Ссылка               КАК Ссылка,
	|		ВЫБОР 
	|			КОГДА НЕ ЕСТЬNULL(ДанныеДокумента.КодТНВЭД.СырьевойТовар, ЛОЖЬ)
	|				ТОГДА
	|					ВЫБОР КОГДА ЕСТЬNULL(СуммыВВалютеРегл.СуммаБезНДСРегл,0) = 0
	|						ТОГДА ДанныеДокумента.СуммаСНДС
	|						ИНАЧЕ СуммыВВалютеРегл.БазаНДСРегл
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ                                КАК СуммаНесырьевыеТовары,
	|		ВЫБОР 
	|			КОГДА ЕСТЬNULL(ДанныеДокумента.КодТНВЭД.СырьевойТовар, ЛОЖЬ)
	|				ТОГДА
	|					ВЫБОР КОГДА ЕСТЬNULL(СуммыВВалютеРегл.СуммаБезНДСРегл,0) = 0
	|						ТОГДА ДанныеДокумента.СуммаСНДС
	|						ИНАЧЕ СуммыВВалютеРегл.СуммаБезНДСРегл
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ                                КАК СуммаСырьевыеТоварыУслуги,
	|		0                                    КАК КорректировкаНесырьевыеТовары,
	|		0                                    КАК КорректировкаСырьевыеТоварыУслуги
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК ДанныеДокумента
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|		ПО 
	|			ДанныеДокумента.Ссылка = НДССостояниеРеализации0.ДокументРеализации
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.СуммыДокументовВВалютеРегл КАК СуммыВВалютеРегл
	|		ПО 
	|			ДанныеДокумента.Ссылка = СуммыВВалютеРегл.Регистратор
	|			И ДанныеДокумента.ИдентификаторСтроки = СуммыВВалютеРегл.ИдентификаторСтроки
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО 
	|			ДанныеДокумента.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			Справочник.Номенклатура КАК СпрНоменклатура 
	|		ПО
	|			СпрНоменклатура.Ссылка = Аналитика.Номенклатура
	|	ГДЕ
	|		НДССостояниеРеализации0.Организация В (&Организация)
	|		И НДССостояниеРеализации0.ДатаРеализации МЕЖДУ &ПериодНачало И &ПериодОкончание
	|		И ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		НДССостояниеРеализации0.Организация КАК Организация,
	|		ДанныеДокумента.Ссылка              КАК Ссылка,
	|		0                                   КАК СуммаНесырьевыеТовары,
	|		ВЫБОР
	|			КОГДА СуммыВВалютеРегл.СуммаБезНДСРегл ЕСТЬ NULL 
	|					ИЛИ СуммыВВалютеРегл.СуммаБезНДСРегл = 0
	|				ТОГДА ДанныеДокумента.СуммаСНДС
	|			ИНАЧЕ СуммыВВалютеРегл.БазаНДСРегл
	|		КОНЕЦ                               КАК СуммаСырьевыеТоварыУслуги,
	|		0                                   КАК КорректировкаНесырьевыеТовары,
	|		0                                   КАК КорректировкаСырьевыеТоварыУслуги
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК ДанныеДокумента
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|			ПО ДанныеДокумента.Ссылка = НДССостояниеРеализации0.ДокументРеализации
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СуммыДокументовВВалютеРегл КАК СуммыВВалютеРегл
	|			ПО ДанныеДокумента.Ссылка = СуммыВВалютеРегл.Регистратор
	|				И ДанныеДокумента.ИдентификаторСтроки = СуммыВВалютеРегл.ИдентификаторСтроки
	|	ГДЕ
	|		НДССостояниеРеализации0.Организация В (&Организация)
	|		И НДССостояниеРеализации0.ДатаРеализации МЕЖДУ &ПериодНачало И &ПериодОкончание
	|		И ДанныеДокумента.Номенклатура.ТипНоменклатуры НЕ В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КорректировкаРеализации.Организация КАК Организация,
	|		КорректировкаРеализации.ДокументОснование      КАК Ссылка,
	|		0                                   КАК СуммаНесырьевыеТовары,
	|		0                                   КАК СуммаСырьевыеТоварыУслуги,
	|		0                                   КАК КорректировкаНесырьевыеТовары,
	|		ВЫБОР
	|			КОГДА СуммыВВалютеРегл.СуммаБезНДСРегл ЕСТЬ NULL 
	|					ИЛИ СуммыВВалютеРегл.СуммаБезНДСРегл = 0
	|				ТОГДА ДанныеДокумента.СуммаСНДС
	|			ИНАЧЕ СуммыВВалютеРегл.БазаНДСРегл
	|		КОНЕЦ                               КАК КорректировкаСырьевыеТоварыУслуги
	|	ИЗ
	|		Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			Документ.КорректировкаРеализации.Расхождения КАК ДанныеДокумента
	|		ПО 
	|			КорректировкаРеализации.Ссылка = ДанныеДокумента.Ссылка
	|			
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|		ПО 
	|			КорректировкаРеализации.ДокументОснование = НДССостояниеРеализации0.ДокументРеализации
	|			И НДССостояниеРеализации0.Организация В (&Организация)
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СуммыДокументовВВалютеРегл КАК СуммыВВалютеРегл
	|		ПО 
	|			ДанныеДокумента.Ссылка = СуммыВВалютеРегл.Регистратор
	|			И ДанныеДокумента.ИдентификаторСтроки = СуммыВВалютеРегл.ИдентификаторСтроки
	|	ГДЕ
	|		КорректировкаРеализации.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	|		И КорректировкаРеализации.Проведен
	|		И КорректировкаРеализации.Организация В (&Организация) 
	|		И ДанныеДокумента.Номенклатура.ТипНоменклатуры НЕ В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КорректировкаРеализации.Организация КАК Организация,
	|		КорректировкаРеализации.ДокументОснование      КАК Ссылка,
	|		0                                   КАК СуммаНесырьевыеТовары,
	|		0                                   КАК СуммаСырьевыеТоварыУслуги,
	|		ВЫБОР 
	|			КОГДА НЕ ЕСТЬNULL(ДанныеДокумента.КодТНВЭД.СырьевойТовар, ЛОЖЬ)
	|				ТОГДА
	|					ВЫБОР КОГДА ЕСТЬNULL(СуммыВВалютеРегл.СуммаБезНДСРегл,0) = 0
	|						ТОГДА ДанныеДокумента.СуммаСНДС
	|						ИНАЧЕ СуммыВВалютеРегл.БазаНДСРегл
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ                                КАК КорректировкаНесырьевыеТовары,
	|		ВЫБОР 
	|			КОГДА ЕСТЬNULL(ДанныеДокумента.КодТНВЭД.СырьевойТовар, ЛОЖЬ)
	|				ТОГДА
	|					ВЫБОР КОГДА ЕСТЬNULL(СуммыВВалютеРегл.СуммаБезНДСРегл,0) = 0
	|						ТОГДА ДанныеДокумента.СуммаСНДС
	|						ИНАЧЕ СуммыВВалютеРегл.СуммаБезНДСРегл
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ                                КАК КорректировкаСырьевыеТоварыУслуги
	|	ИЗ
	|		Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			Документ.КорректировкаРеализации.ВидыЗапасовКорректировкаВыручки КАК ДанныеДокумента
	|		ПО 
	|			КорректировкаРеализации.Ссылка = ДанныеДокумента.Ссылка
	|			
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|		ПО 
	|			КорректировкаРеализации.ДокументОснование = НДССостояниеРеализации0.ДокументРеализации
	|			И НДССостояниеРеализации0.Организация В (&Организация)
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СуммыДокументовВВалютеРегл КАК СуммыВВалютеРегл
	|		ПО 
	|			ДанныеДокумента.Ссылка = СуммыВВалютеРегл.Регистратор
	|			И ДанныеДокумента.ИдентификаторСтроки = СуммыВВалютеРегл.ИдентификаторСтроки
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО 
	|			ДанныеДокумента.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			Справочник.Номенклатура КАК СпрНоменклатура 
	|		ПО
	|			СпрНоменклатура.Ссылка = Аналитика.Номенклатура
	|	
	|	ГДЕ
	|		КорректировкаРеализации.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	|		И КорректировкаРеализации.Проведен
	|		И КорректировкаРеализации.Организация В (&Организация) 
	|		И ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КорректировкаРеализации.Организация КАК Организация,
	|		КорректировкаРеализации.ДокументОснование      КАК Ссылка,
	|		0                                   КАК СуммаНесырьевыеТовары,
	|		0                                   КАК СуммаСырьевыеТоварыУслуги,
	|		ВЫБОР 
	|			КОГДА НЕ ЕСТЬNULL(ДанныеДокумента.КодТНВЭД.СырьевойТовар, ЛОЖЬ)
	|				ТОГДА
	|					ВЫБОР КОГДА ЕСТЬNULL(СуммыВВалютеРегл.СуммаБезНДСРегл,0) = 0
	|						ТОГДА ДанныеДокумента.СуммаСНДС
	|						ИНАЧЕ СуммыВВалютеРегл.БазаНДСРегл
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ                                КАК КорректировкаНесырьевыеТовары,
	|		ВЫБОР 
	|			КОГДА ЕСТЬNULL(ДанныеДокумента.КодТНВЭД.СырьевойТовар, ЛОЖЬ)
	|				ТОГДА
	|					ВЫБОР КОГДА ЕСТЬNULL(СуммыВВалютеРегл.СуммаБезНДСРегл,0) = 0
	|						ТОГДА ДанныеДокумента.СуммаСНДС
	|						ИНАЧЕ СуммыВВалютеРегл.СуммаБезНДСРегл
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ                                КАК КорректировкаСырьевыеТоварыУслуги
	|	ИЗ
	|		Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			Документ.КорректировкаРеализации.ВидыЗапасовСписание КАК ДанныеДокумента
	|		ПО 
	|			КорректировкаРеализации.Ссылка = ДанныеДокумента.Ссылка
	|			
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|		ПО 
	|			КорректировкаРеализации.ДокументОснование = НДССостояниеРеализации0.ДокументРеализации
	|			И НДССостояниеРеализации0.Организация В (&Организация)
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СуммыДокументовВВалютеРегл КАК СуммыВВалютеРегл
	|		ПО 
	|			ДанныеДокумента.Ссылка = СуммыВВалютеРегл.Регистратор
	|			И ДанныеДокумента.ИдентификаторСтроки = СуммыВВалютеРегл.ИдентификаторСтроки
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО 
	|			ДанныеДокумента.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			Справочник.Номенклатура КАК СпрНоменклатура 
	|		ПО
	|			СпрНоменклатура.Ссылка = Аналитика.Номенклатура
	|	
	|	ГДЕ
	|		КорректировкаРеализации.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	|		И КорректировкаРеализации.Проведен
	|		И КорректировкаРеализации.Организация В (&Организация) 
	|		И ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КорректировкаРеализации.Организация       КАК Организация,
	|		КорректировкаРеализации.ДокументОснование КАК Ссылка,
	|		0                                         КАК СуммаНесырьевыеТовары,
	|		0                                         КАК СуммаСырьевыеТоварыУслуги,
	|		ВЫБОР 
	|			КОГДА НЕ ЕСТЬNULL(ДанныеДокумента.КодТНВЭД.СырьевойТовар, ЛОЖЬ)
	|				ТОГДА
	|					ВЫБОР КОГДА ЕСТЬNULL(СуммыВВалютеРегл.СуммаБезНДСРегл,0) = 0
	|						ТОГДА -ДанныеДокумента.СуммаСНДС
	|						ИНАЧЕ -СуммыВВалютеРегл.БазаНДСРегл
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ                                КАК КорректировкаНесырьевыеТовары,
	|		ВЫБОР 
	|			КОГДА ЕСТЬNULL(ДанныеДокумента.КодТНВЭД.СырьевойТовар, ЛОЖЬ)
	|				ТОГДА
	|					ВЫБОР КОГДА ЕСТЬNULL(СуммыВВалютеРегл.СуммаБезНДСРегл,0) = 0
	|						ТОГДА -ДанныеДокумента.СуммаСНДС
	|						ИНАЧЕ -СуммыВВалютеРегл.СуммаБезНДСРегл
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ                                КАК КорректировкаСырьевыеТоварыУслуги
	|	ИЗ
	|		Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			Документ.КорректировкаРеализации.ВидыЗапасовОприходование КАК ДанныеДокумента
	|		ПО 
	|			КорректировкаРеализации.Ссылка = ДанныеДокумента.Ссылка
	|			
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|		ПО 
	|			КорректировкаРеализации.ДокументОснование = НДССостояниеРеализации0.ДокументРеализации
	|			И НДССостояниеРеализации0.Организация В (&Организация)
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрСведений.СуммыДокументовВВалютеРегл КАК СуммыВВалютеРегл
	|		ПО 
	|			ДанныеДокумента.Ссылка = СуммыВВалютеРегл.Регистратор
	|			И ДанныеДокумента.ИдентификаторСтроки = СуммыВВалютеРегл.ИдентификаторСтроки
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО 
	|			ДанныеДокумента.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			Справочник.Номенклатура КАК СпрНоменклатура 
	|		ПО
	|			СпрНоменклатура.Ссылка = Аналитика.Номенклатура
	|	
	|	ГДЕ
	|		КорректировкаРеализации.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	|		И КорректировкаРеализации.Проведен
	|		И КорректировкаРеализации.Организация В (&Организация) 
	|		И ДанныеДокумента.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|	
	|	) КАК ТаблицаДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДанных.Организация,
	|	ТаблицаДанных.Ссылка
	|;
	|
	|///////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанных.Организация КАК Организация,
	|	СУММА(ТаблицаДанных.ВыручкаНДС) КАК ВыручкаНДС,
	|	СУММА(ТаблицаДанных.ВыручкаНеНДС) КАК ВыручкаНеНДС,
	|	СУММА(ТаблицаДанных.ВыручкаЕНВД) КАК ВыручкаЕНВД,
	|	СУММА(ТаблицаДанных.ВыручкаНДС0) КАК ВыручкаНДС0,
	|	СУММА(ТаблицаДанных.ВыручкаНДС0СырьевыеТоварыУслуги) КАК ВыручкаНДС0СырьевыеТоварыУслуги,
	|	СУММА(ТаблицаДанных.ВыручкаНДС0НесырьевыеТовары) КАК ВыручкаНДС0НесырьевыеТовары
	|,	СУММА(ТаблицаДанных.СуммаНДСОборот) КАК СуммаНДСНачисленного,
	|	СУММА(ТаблицаДанных.СуммаНДСМетодомЗачета)
	|ИЗ
	|	(ВЫБРАТЬ
	|		НДСЗаписиКнигиПродажОбороты.Организация КАК Организация,
	|		ЕстьNULL(НДСЗаписиКнигиПродажОбороты.ОборотПоРеализацииОборот,0) КАК ВыручкаНДС,
	|		ВЫБОР
	|			КОГДА НЕ НДСЗаписиКнигиПродажОбороты.СтавкаНДС.ДляОсвобожденногоОборота 
	|				И НЕ НДСЗаписиКнигиПродажОбороты.СтавкаНДС.МестоРеализацииНеРК
	|				ТОГДА ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.ОборотПоРеализацииОборот, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ВыручкаНеНДС,
	|		0 КАК ВыручкаЕНВД,
	|		0 КАК ВыручкаНДС0,
	|		0 КАК ВыручкаНДС0СырьевыеТоварыУслуги,
	|		0 КАК ВыручкаНДС0НесырьевыеТовары
	|,		НДСЗаписиКнигиПродажОбороты.СуммаНДСОборот КАК СуммаНДСОборот,
	|		0 КАК СуммаНДСМетодомЗачета
	|	ИЗ
	|		РегистрНакопления.НДС.Обороты(
	|				,
	|				,
	|				Квартал,
	|				Организация В (&Организация) И НалоговыйПериод >= &ПериодНачало И НалоговыйПериод <= &ПериодОкончание) КАК НДСЗаписиКнигиПродажОбороты
	|ГДЕ
	|	НДСЗаписиКнигиПродажОбороты.Период <= &ПериодКорректировки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСЗаписиКнигиПродажОбороты.Организация,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|,		0,
	|		НДСЗаписиКнигиПродажОбороты.СуммаНДСОборот
	|	ИЗ
	|		РегистрНакопления.НДС.Обороты(
	|				,
	|				,
	|				Квартал,
	|				Организация В (&Организация) И НалоговыйПериод >= &ПериодНачало И НалоговыйПериод <= &ПериодОкончание) КАК НДСЗаписиКнигиПродажОбороты
	|	
	|	ГДЕ
	|		НДСЗаписиКнигиПродажОбороты.ВидОперацииРеализации.ВидНДС = ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДСУплачиваемыйПриИмпортеМетодомЗачета)
	|		И НДСЗаписиКнигиПродажОбороты.ВидОперацииРеализации.НеЯвляетсяОборотомПоРеализации <> ИСТИНА
	|		И НДСЗаписиКнигиПродажОбороты.Период <= &ПериодКорректировки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НачисленияПоЗаймамВыданным.Организация,
	|		0,
	|		НачисленияПоЗаймамВыданным.СуммаРеглОборот,
	|		0,
	|		0,
	|		0,
	|		0
	|,		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.ДвиженияКонтрагентДоходыРасходы.Обороты(
	|			&ПериодНачало, 
	|			&ПериодОкончание,
	|			Квартал,
	|			ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.НачисленияПоЗаймамВыданным)
	|				И Организация В (&Организация)) КАК НачисленияПоЗаймамВыданным
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НачисленияПоЗаймамВыданным.Организация,
	|		0,
	|		НачисленияПоЗаймамВыданным.СуммаРеглОборот,
	|		0,
	|		0,
	|		0,
	|		0
	|,		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.ДвиженияДоходыРасходыПрочиеАктивыПассивы.Обороты(
	|			&ПериодНачало, 
	|			&ПериодОкончание,
	|			Квартал,
	|			ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.НачисленияПоЗаймамВыданным)
	|				И Организация В (&Организация)) КАК НачисленияПоЗаймамВыданным
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АналитикаПоПартнерам.Организация,
	|		0,
	|		0,
	|		ЕстьNULL(ВыручкаИСебестоимостьПродаж.СуммаВыручкиРегл,0),
	|		0,
	|		0,
	|		0
	|,		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|			Справочник.КлючиАналитикиУчетаПоПартнерам КАК АналитикаПоПартнерам
	|		ПО 
	|			ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам = АналитикаПоПартнерам.Ссылка
	|	ГДЕ
	|		АналитикаПоПартнерам.Организация В (&Организация)
	|		И ВыручкаИСебестоимостьПродаж.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|		И ВыручкаИСебестоимостьПродаж.Период МЕЖДУ &ПериодНачало И &ПериодОкончание
	|		И ВыручкаИСебестоимостьПродаж.Активность
	|		И ВыручкаИСебестоимостьПродаж.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДокументыЭкспорт.Организация КАК Организация,
	|		0 КАК ВыручкаНДС,
	|		0 КАК ВыручкаНеНДС,
	|		0 КАК ВыручкаЕНВД,
	|		(ДокументыЭкспорт.СуммаНесырьевыеТовары             
	|			+ ДокументыЭкспорт.СуммаСырьевыеТоварыУслуги         
	|			+ ДокументыЭкспорт.КорректировкаНесырьевыеТовары     
	|			+ ДокументыЭкспорт.КорректировкаСырьевыеТоварыУслуги) КАК ВыручкаНДС0,
	|		(ДокументыЭкспорт.СуммаСырьевыеТоварыУслуги 
	|			+ ДокументыЭкспорт.КорректировкаСырьевыеТоварыУслуги) КАК ВыручкаНДС0СырьевыеТоварыУслуги,
	|		(ДокументыЭкспорт.СуммаНесырьевыеТовары
	|			+ ДокументыЭкспорт.КорректировкаНесырьевыеТовары)     КАК ВыручкаНДС0НесырьевыеТовары
	|,		0,
	|		0
	|	ИЗ
	|		ДокументыЭкспорт КАК ДокументыЭкспорт
	|	) КАК ТаблицаДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДанных.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыЭкспорт.Организация   КАК Организация,
	|	ДокументыЭкспорт.Документ      КАК Документ,
	|	ВЫБОР 
	|		КОГДА &УпрощенныйПорядокВычетаНДСПоНесырьевомуЭкспорту И НЕ &ВключатьВсеДокументыЭкспорта
	|			ТОГДА СУММА(ДокументыЭкспорт.СуммаСырьевыеТоварыУслуги)
	|			ИНАЧЕ СУММА(ДокументыЭкспорт.СуммаНесырьевыеТовары + ДокументыЭкспорт.СуммаСырьевыеТоварыУслуги) 
	|	КОНЕЦ КАК СуммаВыручки,
	|	ВЫБОР 
	|		КОГДА &УпрощенныйПорядокВычетаНДСПоНесырьевомуЭкспорту И НЕ &ВключатьВсеДокументыЭкспорта
	|			ТОГДА СУММА(ДокументыЭкспорт.КорректировкаСырьевыеТоварыУслуги)
	|			ИНАЧЕ СУММА(ДокументыЭкспорт.КорректировкаНесырьевыеТовары + ДокументыЭкспорт.КорректировкаСырьевыеТоварыУслуги) 
	|	КОНЕЦ КАК КорректировкаВыручки
	|ИЗ
	|	ДокументыЭкспорт КАК ДокументыЭкспорт
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументыЭкспорт.Организация,
	|	ДокументыЭкспорт.Документ
	|
	|ИМЕЮЩИЕ
	|	ВЫБОР 
	|		КОГДА &УпрощенныйПорядокВычетаНДСПоНесырьевомуЭкспорту И НЕ &ВключатьВсеДокументыЭкспорта
	|			ТОГДА СУММА(ДокументыЭкспорт.СуммаСырьевыеТоварыУслуги)
	|			ИНАЧЕ СУММА(ДокументыЭкспорт.СуммаНесырьевыеТовары + ДокументыЭкспорт.СуммаСырьевыеТоварыУслуги) 
	|	КОНЕЦ <> 0
	|	ИЛИ ВЫБОР 
	|		КОГДА &УпрощенныйПорядокВычетаНДСПоНесырьевомуЭкспорту И НЕ &ВключатьВсеДокументыЭкспорта
	|			ТОГДА СУММА(ДокументыЭкспорт.КорректировкаСырьевыеТоварыУслуги)
	|			ИНАЧЕ СУММА(ДокументыЭкспорт.КорректировкаНесырьевыеТовары + ДокументыЭкспорт.КорректировкаСырьевыеТоварыУслуги) 
	|	КОНЕЦ <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалогНаДобавленнуюСтоимостьКВозмещению) КАК СчетУчетаНДС,
	|	НДСКВозмещениюОбороты.СуммаНДСОборот КАК СуммаНДС,
	|	НДСКВозмещениюОбороты.Организация  КАК ОбособленноеПодразделение
	|ИЗ
	|	РегистрНакопления.НДСКВозмещению.Обороты(
	|			,
	|			,
	|			Квартал,
	|			Организация В
	|					(ВЫБРАТЬ
	|						Организации.Ссылка
	|					ИЗ
	|						Справочник.Организации КАК Организации
	|					ГДЕ
	|						Организации.ГоловнаяОрганизация В (&Организация)
	|						И Организации.ОбособленноеПодразделение)
	|				И КорректируемыйПериод = ДАТАВРЕМЯ(1, 1, 1) И НалоговыйПериод >= &ПериодНачало И НалоговыйПериод <= &ПериодОкончание) КАК НДСКВозмещениюОбороты
	|ГДЕ
	|	НДСКВозмещениюОбороты.Период <= &ПериодКорректировки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС) КАК СчетУчетаНДС,
	|	НДСОбороты.СуммаНДСОборот,
	|	НДСОбороты.Организация
	|ИЗ
	|	РегистрНакопления.НДС.Обороты(
	|			,
	|			,
	|			Квартал,
	|			Организация В
	|					(ВЫБРАТЬ
	|						Организации.Ссылка
	|					ИЗ
	|						Справочник.Организации КАК Организации
	|					ГДЕ
	|						Организации.ГоловнаяОрганизация В (&Организация)
	|						И Организации.ОбособленноеПодразделение)
	|				И КорректируемыйПериод = ДАТАВРЕМЯ(1, 1, 1) И НалоговыйПериод >= &ПериодНачало И НалоговыйПериод <= &ПериодОкончание) КАК НДСОбороты
	|ГДЕ
	|	НДСОбороты.Период <= &ПериодКорректировки
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьНачалоРасширенногоНалоговогоПериода(Дата, Организация) Экспорт
	
	БлижайшийНалоговыйПериод = УчетНДСПереопределяемый.БлижайшийНалоговыйПериод(
		Организация,
		Дата);
	
	Если БлижайшийНалоговыйПериод.Начало <> БлижайшийНалоговыйПериод.Период Тогда
		НачалоНалоговогоПериода = БлижайшийНалоговыйПериод.Начало;
	Иначе
		НачалоНалоговогоПериода = НачалоКвартала(Дата);
	КонецЕсли;
	
	Если НачалоКвартала(Дата) < НачалоНалоговогоПериода Тогда
		НачалоПериода = НачалоКвартала(Дата);
	Иначе
		Если НачалоМесяца(Дата) = НачалоКвартала(Дата) Тогда
			// В первом месяце квартала производится распределение НДС по ОС и НМА
			// принятым к учету в этом месяце.
			// В случае расширенного налогового периода по НДС (п.2 ст.55 НК) необходимо
			// учесть ОС и НМА, приобретенные с момента регистрации до конца предыдущего квартала.
			НачалоПериода = НачалоНалоговогоПериода;
		ИначеЕсли КонецМесяца(Дата) <> КонецКвартала(Дата) Тогда
			// Во втором месяце квартала производится распределение НДС по ОС и НМА
			// принятым к учету в этом месяце. 
			// Для распределения необходимо учитывать выручку за месяц ввода в эксплуатацию.
			НачалоПериода = НачалоМесяца(Дата);
		Иначе
			НачалоПериода = НачалоНалоговогоПериода;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НачалоПериода;

КонецФункции

Функция ПолучитьСуммыЗачета(Дата, Организация, ВыручкаНДС, ВыручкаНеНДС, КорректироватьРаспределениеНДСПрошлыхПериодов = Ложь,КорректировкаРаспределенияНДС = Ложь, ПериодКорректировки = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	ТаблицаДанных.Организация КАК Организация,
	|	СУММА(ТаблицаДанных.СуммаРазрешенногоКЗачету) КАК СуммаНДСРазрешенногоКЗачету,
	|	СУММА(ТаблицаДанных.СуммаНДСОборот - ТаблицаДанных.СуммаРазрешенногоКЗачету) КАК СуммаНДСНеРазрешенногоКЗачету,
	|	СУММА(ТаблицаДанных.СуммаНДСМетодомЗачета) КАК СуммаНДСМетодомЗачета,
	|	СУММА(ТаблицаДанных.СуммаПереносимогоЗачета) КАК СуммаНДСПереносимыйЗачет
	|ИЗ
	|	(ВЫБРАТЬ
	|		НДСКВозмещению.Организация КАК Организация,
	|		ЕСТЬNULL(НДСКВозмещению.СуммаНДСОборот, 0) КАК СуммаНДСКВозмещению,
	|		ВЫБОР
	|			КОГДА НДСКВозмещению.ВидОборота = ЗНАЧЕНИЕ(Перечисление.ВидыОборотовПоРеализации.Общий)
	|				ТОГДА ЕСТЬNULL(НДСКВозмещению.СуммаНДСОборот, 0) * &ДоляОблагаемогоОборота
	|			ИНАЧЕ ВЫБОР
	|					КОГДА НДСКВозмещению.ВидОборота = ЗНАЧЕНИЕ(Перечисление.ВидыОборотовПоРеализации.Облагаемый)
	|						ТОГДА ЕСТЬNULL(НДСКВозмещению.СуммаНДСОборот, 0)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ КАК СуммаРазрешенногоКЗачету,
	|		ЕСТЬNULL(НДСКВозмещению.СуммаНДСОборот, 0) КАК СуммаНДСОборот,
	|		0 КАК СуммаНДСМетодомЗачета,
	|		0 КАК СуммаПереносимогоЗачета
	|	ИЗ
	|		РегистрНакопления.НДСКВозмещению.Обороты(&ПериодНачало, &ПериодОкончание, Квартал, Организация В (&Организация) И &УсловиеНалоговыйПериод) КАК НДСКВозмещению
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&ПериодНачало, Организация В (&Организация)) КАК УчетнаяПолитикаОрганизацийСрезПоследних
	|			ПО НДСКВозмещению.Организация = УчетнаяПолитикаОрганизацийСрезПоследних.Организация
	|	ГДЕ
	|		(НЕ ЕСТЬNULL(УчетнаяПолитикаОрганизацийСрезПоследних.УчетнаяПолитика.РаспределятьНДСМетодомЗачета, ЛОЖЬ)
	|					И НДСКВозмещению.ВидОперацииПоступления.ВидНДС <> ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДСУплачиваемыйПриИмпортеМетодомЗачета)
	|				ИЛИ ЕСТЬNULL(УчетнаяПолитикаОрганизацийСрезПоследних.УчетнаяПолитика.РаспределятьНДСМетодомЗачета, ЛОЖЬ))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСКВозмещениюОбороты.Организация,
	|		0,
	|		0,
	|		0,
	|		НДСКВозмещениюОбороты.СуммаНДСОборот,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСКВозмещению.Обороты(&ПериодНачало, &ПериодОкончание, Квартал, Организация В (&Организация) И &УсловиеНалоговыйПериод) КАК НДСКВозмещениюОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&ПериодНачало, Организация В (&Организация)) КАК УчетнаяПолитикаОрганизацийСрезПоследних
	|			ПО НДСКВозмещениюОбороты.Организация = УчетнаяПолитикаОрганизацийСрезПоследних.Организация
	|	ГДЕ
	|		НЕ ЕСТЬNULL(УчетнаяПолитикаОрганизацийСрезПоследних.УчетнаяПолитика.РаспределятьНДСМетодомЗачета, ЛОЖЬ)
	|					И НДСКВозмещениюОбороты.ВидОперацииПоступления.ВидНДС = ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДСУплачиваемыйПриИмпортеМетодомЗачета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ХозрасчетныйОстатки.Организация,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ХозрасчетныйОстатки.СуммаОстаток
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Остатки(&ПериодНачало, Счет В(ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалогНаДобавленнуюСтоимостьКВозмещению)), ,  Организация В (&Организация)) КАК ХозрасчетныйОстатки) КАК ТаблицаДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДанных.Организация";
	
	ПараметрыУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаОрганизаций.ПараметрыУчетнойПолитики(Организация, Дата);
	УчитыватьКорректировкуРаспределенияНДС= ?(ПараметрыУчетнойПолитики = Неопределено, Ложь, ПараметрыУчетнойПолитики.КорректироватьРаспределениеНДСПрошлыхПериодов)
												И КорректироватьРаспределениеНДСПрошлыхПериодов;

	Если УчитыватьКорректировкуРаспределенияНДС Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеНалоговыйПериод", "И НалоговыйПериод >= &ПериодНачало И НалоговыйПериод <= &ПериодОкончание");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеНалоговыйПериод", "");
	КонецЕсли;

	Если КорректировкаРаспределенияНДС Тогда
		Запрос.Текст = ПолучитьЗапросСуммыЗачетаКорректировка();
		Запрос.УстановитьПараметр("ПериодКорректировки", ПериодКорректировки);
	КонецЕсли;

	ПериодНачало = НачалоКвартала(Дата);
	ПериодОкончание = КонецКвартала(Дата);
	//++ НЕ УТ
	Если Месяц(Дата)%3 <> 0 Тогда
		ПериодНачало = НачалоМесяца(Дата);
		ПериодОкончание = КонецМесяца(Дата);
	КонецЕсли;
	//-- НЕ УТ
	
	Запрос.УстановитьПараметр("ПериодНачало", ПериодНачало);
	Запрос.УстановитьПараметр("ПериодОкончание", ПериодОкончание);
	
	ДоляОблагаемогоОборота = ?(ВыручкаНДС = 0, 1, ВыручкаНеНДС / ВыручкаНДС);
		
	Запрос.УстановитьПараметр("ДоляОблагаемогоОборота", ДоляОблагаемогоОборота);
	
	Если ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		МассивОрганизаций = Новый Массив();
		МассивОрганизаций.Добавить(Организация);
		
		ЗапросОбособленныхПодразделений = Новый Запрос();
		ЗапросОбособленныхПодразделений.Текст = 
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Организация
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ОбособленноеПодразделение
		|	И Организации.ГоловнаяОрганизация = &ГоловнаяОрганизация";
		ЗапросОбособленныхПодразделений.УстановитьПараметр("ГоловнаяОрганизация", Организация);
		ВыборкаПодразделений = ЗапросОбособленныхПодразделений.Выполнить().Выбрать();
		
		Пока ВыборкаПодразделений.Следующий() Цикл
			МассивОрганизаций.Добавить(ВыборкаПодразделений.Организация);
		КонецЦикла; 
		
		Запрос.УстановитьПараметр("Организация", МассивОрганизаций);
	Иначе
		Запрос.УстановитьПараметр("Организация", Организация)
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();
	СуммыЗачета = Новый Структура();
	ТаблицаСуммЗачета = Результат[0].Выгрузить();
	СуммыЗачета = Новый Структура();
	СуммыЗачета.Вставить("ТаблицаСуммЗачета", ТаблицаСуммЗачета);
	СуммыЗачета.Вставить("СуммаНДСРазрешенногоКЗачету",   ТаблицаСуммЗачета.Итог("СуммаНДСРазрешенногоКЗачету"));
	СуммыЗачета.Вставить("СуммаНДСНеРазрешенногоКЗачету", ТаблицаСуммЗачета.Итог("СуммаНДСНеРазрешенногоКЗачету"));
	СуммыЗачета.Вставить("СуммаНДСМетодомЗачета", 		  ТаблицаСуммЗачета.Итог("СуммаНДСМетодомЗачета"));
	СуммыЗачета.Вставить("СуммаНДСПереносимыйЗачет", 	  ТаблицаСуммЗачета.Итог("СуммаНДСПереносимыйЗачет"));
	
	Возврат СуммыЗачета;
	
КонецФункции

Функция ПолучитьЗапросСуммыЗачетаКорректировка()
	
	ТекстЗапроса ="ВЫБРАТЬ
	|	ТаблицаДанных.Организация КАК Организация,
	|	СУММА(ТаблицаДанных.СуммаРазрешенногоКЗачету) КАК СуммаНДСРазрешенногоКЗачету,
	|	СУММА(ТаблицаДанных.СуммаНДСОборот - ТаблицаДанных.СуммаРазрешенногоКЗачету) КАК СуммаНДСНеРазрешенногоКЗачету,
	|	СУММА(ТаблицаДанных.СуммаНДСМетодомЗачета) КАК СуммаНДСМетодомЗачета,
	|	СУММА(ТаблицаДанных.СуммаПереносимогоЗачета) КАК СуммаНДСПереносимыйЗачет
	|ИЗ
	|	(ВЫБРАТЬ
	|		НДСКВозмещению.Организация КАК Организация,
	|		ЕСТЬNULL(НДСКВозмещению.СуммаНДСОборот, 0) КАК СуммаНДСКВозмещению,
	|		ВЫБОР
	|			КОГДА НДСКВозмещению.ВидОборота = ЗНАЧЕНИЕ(Перечисление.ВидыОборотовПоРеализации.Общий)
	|				ТОГДА ЕСТЬNULL(НДСКВозмещению.СуммаНДСОборот, 0) * &ДоляОблагаемогоОборота
	|			ИНАЧЕ ВЫБОР
	|					КОГДА НДСКВозмещению.ВидОборота = ЗНАЧЕНИЕ(Перечисление.ВидыОборотовПоРеализации.Облагаемый)
	|						ТОГДА ЕСТЬNULL(НДСКВозмещению.СуммаНДСОборот, 0)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ КАК СуммаРазрешенногоКЗачету,
	|		ЕСТЬNULL(НДСКВозмещению.СуммаНДСОборот, 0) КАК СуммаНДСОборот,
	|		0 КАК СуммаНДСМетодомЗачета,
	|		0 КАК СуммаПереносимогоЗачета
	|	ИЗ
	|		РегистрНакопления.НДСКВозмещению.Обороты(, , Квартал, Организация В (&Организация)
	|												И НалоговыйПериод >= &ПериодНачало И НалоговыйПериод <= &ПериодОкончание) КАК НДСКВозмещению
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&ПериодНачало, Организация В (&Организация)) КАК УчетнаяПолитикаОрганизацийСрезПоследних
	|			ПО НДСКВозмещению.Организация = УчетнаяПолитикаОрганизацийСрезПоследних.Организация
	|	ГДЕ
	|		(НЕ ЕСТЬNULL(УчетнаяПолитикаОрганизацийСрезПоследних.УчетнаяПолитика.РаспределятьНДСМетодомЗачета, ЛОЖЬ)
	|					И НДСКВозмещению.ВидОперацииПоступления.ВидНДС <> ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДСУплачиваемыйПриИмпортеМетодомЗачета)
	|				ИЛИ ЕСТЬNULL(УчетнаяПолитикаОрганизацийСрезПоследних.УчетнаяПолитика.РаспределятьНДСМетодомЗачета, ЛОЖЬ))
	|		И НДСКВозмещению.Период <= &ПериодКорректировки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСКВозмещениюОбороты.Организация,
	|		0,
	|		0,
	|		0,
	|		НДСКВозмещениюОбороты.СуммаНДСОборот,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСКВозмещению.Обороты(, , Квартал, Организация В (&Организация)
	|												И НалоговыйПериод >= &ПериодНачало И НалоговыйПериод <= &ПериодОкончание) КАК НДСКВозмещениюОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&ПериодНачало, Организация В (&Организация)) КАК УчетнаяПолитикаОрганизацийСрезПоследних
	|			ПО НДСКВозмещениюОбороты.Организация = УчетнаяПолитикаОрганизацийСрезПоследних.Организация
	|	ГДЕ
	|		НЕ ЕСТЬNULL(УчетнаяПолитикаОрганизацийСрезПоследних.УчетнаяПолитика.РаспределятьНДСМетодомЗачета, ЛОЖЬ)
	|					И НДСКВозмещениюОбороты.ВидОперацииПоступления.ВидНДС = ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДСУплачиваемыйПриИмпортеМетодомЗачета)
	|		И НДСКВозмещениюОбороты.Период <= &ПериодКорректировки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ХозрасчетныйОстатки.Организация,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ХозрасчетныйОстатки.СуммаОстаток
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Остатки(&ПериодНачало, Счет В(ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалогНаДобавленнуюСтоимостьКВозмещению)), ,  Организация В (&Организация)) КАК ХозрасчетныйОстатки) КАК ТаблицаДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДанных.Организация";
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТаблицуКорректировкиНДС(Дата, НачалоПериода, Организация, КорректироватьРаспределениеНДСПрошлыхПериодов = Ложь) Экспорт
	
	ПараметрыУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаОрганизаций.ПараметрыУчетнойПолитики(Организация, Дата);
	КорректироватьРаспределениеНДС 	= ?(ПараметрыУчетнойПолитики = Неопределено, Ложь, ПараметрыУчетнойПолитики.КорректироватьРаспределениеНДСПрошлыхПериодов)
										И КорректироватьРаспределениеНДСПрошлыхПериодов;
	
	Если Не КорректироватьРаспределениеНДС Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаКорректировкиНДС = Новый ТаблицаЗначений;
	ТаблицаКорректировкиНДС.Колонки.Добавить("КорректируемыйПериод", Новый ОписаниеТипов("Дата",Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаКорректировкиНДС.Колонки.Добавить("ОписаниеПериодаКорректировки", Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(20)));
	ТаблицаКорректировкиНДС.Колонки.Добавить("ВыручкаНДССторно", 							Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаКорректировкиНДС.Колонки.Добавить("ВыручкаНДСКорректировка", 					Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаКорректировкиНДС.Колонки.Добавить("ВыручкаНеНДССторно", 							Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаКорректировкиНДС.Колонки.Добавить("ВыручкаНеНДСКорректировка", 					Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаКорректировкиНДС.Колонки.Добавить("ВыручкаНДС0Сторно", 							Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаКорректировкиНДС.Колонки.Добавить("ВыручкаНДС0Корректировка", 					Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаКорректировкиНДС.Колонки.Добавить("СуммаНДСНачисленногоСторно", 					Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаКорректировкиНДС.Колонки.Добавить("СуммаНДСНачисленногоКорректировка", 			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаКорректировкиНДС.Колонки.Добавить("СуммаНДСРазрешенногоКЗачетуСторно", 			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаКорректировкиНДС.Колонки.Добавить("СуммаНДСРазрешенногоКЗачетуКорректировка",	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаКорректировкиНДС.Колонки.Добавить("СуммаНДСНеРазрешенногоКЗачетуСторно", 		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаКорректировкиНДС.Колонки.Добавить("СуммаНДСНеРазрешенногоКЗачетуКорректировка", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаКорректировкиНДС.Колонки.Добавить("СуммаНДСМетодомЗачетаСторно", 				Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаКорректировкиНДС.Колонки.Добавить("СуммаНДСМетодомЗачетаКорректировка", 			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаКорректировкиНДС.Колонки.Добавить("СуммаНДСПереносимыйЗачетСторно", 				Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаКорректировкиНДС.Колонки.Добавить("СуммаНДСПереносимыйЗачетКорректировка", 		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	
	ТаблицаНДСОбособленныхПодразделений = Новый ТаблицаЗначений;
	ТаблицаНДСОбособленныхПодразделений.Колонки.Добавить("ОбособленноеПодразделение");
	ТаблицаНДСОбособленныхПодразделений.Колонки.Добавить("СчетУчетаНДС");
	ТаблицаНДСОбособленныхПодразделений.Колонки.Добавить("СуммаНДС");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НДСОбороты.НалоговыйПериод, КВАРТАЛ) КАК КорректируемыйПериод
	|ПОМЕСТИТЬ ВТ_ПериодыРегистровККорректировке
	|ИЗ
	|	РегистрНакопления.НДС.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация В (&Организация)
	|				И НалоговыйПериод < &НачалоПериода) КАК НДСОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НДСКВозмещениюОбороты.НалоговыйПериод, КВАРТАЛ)
	|ИЗ
	|	РегистрНакопления.НДСКВозмещению.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация В (&Организация)
	|				И НалоговыйПериод < &НачалоПериода) КАК НДСКВозмещениюОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ПериодыРегистровККорректировке.КорректируемыйПериод КАК НачалоПериодаКорректировки,
	|	КОНЕЦПЕРИОДА(ВТ_ПериодыРегистровККорректировке.КорректируемыйПериод, КВАРТАЛ) КАК ОкончаниеПериодаКорректировки
	|ИЗ
	|	ВТ_ПериодыРегистровККорректировке КАК ВТ_ПериодыРегистровККорректировке";
	
	ПериодНачало = НачалоКвартала(Дата);
	ПериодОкончание = КонецКвартала(Дата);

	Если Месяц(Дата)%3 <> 0 Тогда
		ПериодОкончание = КонецМесяца(Дата);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  Новый Граница(ПериодОкончание, ВидГраницы.Включая));
	
	Если ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		МассивОрганизаций = Новый Массив();
		МассивОрганизаций.Добавить(Организация);
		Запрос.УстановитьПараметр("Организация", МассивОрганизаций);
		
		ЗапросОбособленныхПодразделений = Новый Запрос();
		ЗапросОбособленныхПодразделений.Текст = 
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Организация
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ОбособленноеПодразделение
		|	И Организации.ГоловнаяОрганизация = &ГоловнаяОрганизация";
		ЗапросОбособленныхПодразделений.УстановитьПараметр("ГоловнаяОрганизация", Организация);
		ВыборкаПодразделений = ЗапросОбособленныхПодразделений.Выполнить().Выбрать();
		
		Пока ВыборкаПодразделений.Следующий() Цикл
			МассивОрганизаций.Добавить(ВыборкаПодразделений.Организация);
		КонецЦикла; 
		
	Иначе
		Запрос.УстановитьПараметр("Организация", Организация)
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрокаКорректировки = ТаблицаКорректировкиНДС.Добавить();
		НоваяСтрокаКорректировки.КорректируемыйПериод = Выборка.НачалоПериодаКорректировки;
		НоваяСтрокаКорректировки.ОписаниеПериодаКорректировки = Формат(Выборка.НачалоПериодаКорректировки, "ДФ=""к ' квартал ' гггг 'г.'"""); 
		
		//Исходные сторнируемые показатели
		ПериодСторно = КонецМесяца(ДобавитьМесяц(ПериодОкончание,-3));
		Если ПериодСторно = Выборка.ОкончаниеПериодаКорректировки Тогда
			Результат = Документы.РаспределениеНДС.ПолучитьБазуРаспределения(Выборка.ОкончаниеПериодаКорректировки, Выборка.НачалоПериодаКорректировки, Организация, , Истина);
		Иначе
			Результат = Документы.РаспределениеНДС.ПолучитьБазуРаспределения(Выборка.ОкончаниеПериодаКорректировки, Выборка.НачалоПериодаКорректировки, Организация, , , Истина, ПериодСторно);
		КонецЕсли;
		
		НоваяСтрокаКорректировки.ВыручкаНДССторно 			= -Результат.ВыручкаНДС;
		НоваяСтрокаКорректировки.ВыручкаНеНДССторно 		= -Результат.ВыручкаНеНДС;
		НоваяСтрокаКорректировки.ВыручкаНДС0Сторно 			= -Результат.ВыручкаНДС0;
		НоваяСтрокаКорректировки.СуммаНДСНачисленногоСторно = -Результат.СуммаНДСНачисленного;
		
		Для каждого СтрокаНДСОбособленныхПодразделений Из Результат.ТаблицаНДСОбособленныхПодразделений Цикл
			НоваяСтрокаНДСОбособленныхПодразделений = ТаблицаНДСОбособленныхПодразделений.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаНДСОбособленныхПодразделений, СтрокаНДСОбособленныхПодразделений);
			НоваяСтрокаНДСОбособленныхПодразделений.СуммаНДС = -СтрокаНДСОбособленныхПодразделений.СуммаНДС;
		КонецЦикла; 
		
		Если ПериодСторно = Выборка.ОкончаниеПериодаКорректировки Тогда
			ТаблицыСуммыЗачета = Документы.РаспределениеНДС.ПолучитьСуммыЗачета(Выборка.ОкончаниеПериодаКорректировки, Организация, НоваяСтрокаКорректировки.ВыручкаНДССторно, НоваяСтрокаКорректировки.ВыручкаНеНДССторно, Истина);
		Иначе
			ТаблицыСуммыЗачета = Документы.РаспределениеНДС.ПолучитьСуммыЗачета(Выборка.ОкончаниеПериодаКорректировки, Организация, НоваяСтрокаКорректировки.ВыручкаНДССторно, НоваяСтрокаКорректировки.ВыручкаНеНДССторно, , Истина, ПериодСторно);
		КонецЕсли;
		
		НоваяСтрокаКорректировки.СуммаНДСРазрешенногоКЗачетуСторно 	= -ТаблицыСуммыЗачета.СуммаНДСРазрешенногоКЗачету;
		НоваяСтрокаКорректировки.СуммаНДСНеРазрешенногоКЗачетуСторно= -ТаблицыСуммыЗачета.СуммаНДСНеРазрешенногоКЗачету;
		НоваяСтрокаКорректировки.СуммаНДСМетодомЗачетаСторно 		= -ТаблицыСуммыЗачета.СуммаНДСМетодомЗачета;
		НоваяСтрокаКорректировки.СуммаНДСПереносимыйЗачетСторно 	= -ТаблицыСуммыЗачета.СуммаНДСПереносимыйЗачет;
		
		//Показатели с учетом корректировки НДС по данным налогового периода регистров учета НДС
		РезультатКорректировка = Документы.РаспределениеНДС.ПолучитьБазуРаспределения(Выборка.ОкончаниеПериодаКорректировки, Выборка.НачалоПериодаКорректировки, Организация, , , Истина, ПериодОкончание);
		
		НоваяСтрокаКорректировки.ВыручкаНДСКорректировка 			= РезультатКорректировка.ВыручкаНДС;
		НоваяСтрокаКорректировки.ВыручкаНеНДСКорректировка 			= РезультатКорректировка.ВыручкаНеНДС;
		НоваяСтрокаКорректировки.ВыручкаНДС0Корректировка 			= РезультатКорректировка.ВыручкаНДС0;
		НоваяСтрокаКорректировки.СуммаНДСНачисленногоКорректировка 	= РезультатКорректировка.СуммаНДСНачисленного;

		Для каждого СтрокаНДСОбособленныхПодразделений Из РезультатКорректировка.ТаблицаНДСОбособленныхПодразделений Цикл
			НоваяСтрокаНДСОбособленныхПодразделений = ТаблицаНДСОбособленныхПодразделений.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаНДСОбособленныхПодразделений, СтрокаНДСОбособленныхПодразделений);
		КонецЦикла;
		
		ТаблицыСуммыЗачетаКорректировка = Документы.РаспределениеНДС.ПолучитьСуммыЗачета(Выборка.ОкончаниеПериодаКорректировки, Организация, НоваяСтрокаКорректировки.ВыручкаНДССторно, НоваяСтрокаКорректировки.ВыручкаНеНДССторно, , Истина, ПериодОкончание);
		
		НоваяСтрокаКорректировки.СуммаНДСРазрешенногоКЗачетуКорректировка 	= ТаблицыСуммыЗачетаКорректировка.СуммаНДСРазрешенногоКЗачету;
		НоваяСтрокаКорректировки.СуммаНДСНеРазрешенногоКЗачетуКорректировка	= ТаблицыСуммыЗачетаКорректировка.СуммаНДСНеРазрешенногоКЗачету;
		НоваяСтрокаКорректировки.СуммаНДСМетодомЗачетаКорректировка 		= ТаблицыСуммыЗачетаКорректировка.СуммаНДСМетодомЗачета;
		НоваяСтрокаКорректировки.СуммаНДСПереносимыйЗачетКорректировка 		= ТаблицыСуммыЗачетаКорректировка.СуммаНДСПереносимыйЗачет;

	КонецЦикла;

	ТаблицаНДСОбособленныхПодразделений.Свернуть("ОбособленноеПодразделение, СчетУчетаНДС", "СуммаНДС");
	
	СтруктураКорректировкиНДС = Новый Структура;
	СтруктураКорректировкиНДС.Вставить("ТаблицаКорректировкиНДС", ТаблицаКорректировкиНДС);
	СтруктураКорректировкиНДС.Вставить("ТаблицаНДСОбособленныхПодразделений", ТаблицаНДСОбособленныхПодразделений);
	
	Возврат  СтруктураКорректировкиНДС;
	
КонецФункции
#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Обработчик обновления УТ 11.4.2
// заполняется реквизит "Начало периода".
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	РаспределениеНДС.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РаспределениеНДС КАК РаспределениеНДС
	|ГДЕ
	|	РаспределениеНДС.НачалоПериода = ДАТАВРЕМЯ(1, 1, 1)");
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "Документ.РаспределениеНДС";
	МетаданныеДокумента = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъекта);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Результат = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуСсылокДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта, МенеджерВременныхТаблиц);
	
	Если НЕ Результат.ЕстьДанныеДляОбработки Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	Если НЕ Результат.ЕстьЗаписиВоВременнойТаблице Тогда
		Параметры.ОбработкаЗавершена = Ложь;
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаспределениеНДС.Ссылка КАК Ссылка,
	|	РаспределениеНДС.ВерсияДанных КАК ВерсияДанных,
	|	РаспределениеНДС.Дата КАК Дата
	|ИЗ
	|	&ВТДокументыДляОбработки КАК КОбработке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеНДС КАК РаспределениеНДС
	|		ПО РаспределениеНДС.Ссылка = КОбработке.Ссылка
	|";
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&ВТДокументыДляОбработки", Результат.ИмяВременнойТаблицы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
				
			ДокументОбъект = ОбновлениеИнформационнойБазыУТ.ПроверитьПолучитьОбъект(Выборка.Ссылка, Выборка.ВерсияДанных, Параметры.Очередь);
			Если ДокументОбъект = Неопределено Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			Если Месяц(Выборка.Дата)%3 = 0 Тогда // это последний месяц квартала
				ДокументОбъект.НачалоПериода = НачалоКвартала(Выборка.Дата);
			Иначе
				ДокументОбъект.НачалоПериода = НачалоМесяца(Выборка.Дата);
			КонецЕсли;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru = 'Не удалось обработать документ: %Ссылка% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", Выборка.Ссылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				МетаданныеДокумента,
				Выборка.Ссылка,
				ТекстСообщения);
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
