
&ИзменениеИКонтроль("СформироватьПечатнуюФормуМаршрутныйЛист")
Функция игр_СформироватьПечатнуюФормуМаршрутныйЛист(МассивОбъектов, ОбъектыПечати)

	УстановитьПривилегированныйРежим(Истина);

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаданиеНаПеревозку_МаршрутныйЛист";

	#Удаление
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаданиеНаПеревозку.ПФ_MXL_МаршрутныйЛист");
	#КонецУдаления
	#Вставка
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаданиеНаПеревозку.ПФ_MXL_МаршрутныйЛистКорректировка");
	#КонецВставки

	ОбластьЗаголовокДокумента		= Макет.ПолучитьОбласть("ЗаголовокДокумента");
	ОбластьШапкаДокумента 			= Макет.ПолучитьОбласть("ШапкаДокумента");
	ОбластьДополнительнаяИнформация = Макет.ПолучитьОбласть("ДополнительнаяИнформация");

	ЗапросПоДокументу = Новый Запрос;
	ЗапросПоДокументу.Текст = 
	"ВЫБРАТЬ
	|	ЗаданиеНаПеревозку.Номер КАК НомерЗадания,
	|	ЗаданиеНаПеревозку.ДатаВремяРейсаПланС КАК НачалоРейсаПлан,
	|	ЗаданиеНаПеревозку.ДатаВремяРейсаПланПо КАК ОкончаниеРейсаПлан,
	|	ПРЕДСТАВЛЕНИЕ(ЗаданиеНаПеревозку.Водитель) КАК Водитель,
	|	ПРЕДСТАВЛЕНИЕ(ЗаданиеНаПеревозку.КурьерЭкспедитор) КАК КурьерЭкспедитор,
	|	ПРЕДСТАВЛЕНИЕ(ЗаданиеНаПеревозку.ТранспортноеСредство) КАК ТранспортноеСредство,
	|	ЗаданиеНаПеревозку.Приоритет,
	|	ЗаданиеНаПеревозку.Дата КАК Дата,
	|	ЗаданиеНаПеревозку.ДатаВремяРейсаФактС КАК НачалоРейсаФакт,
	|	ЗаданиеНаПеревозку.ДатаВремяРейсаФактПо КАК ОкончаниеРейсаФакт,
	|	ЗаданиеНаПеревозку.ДополнительнаяИнформация КАК ДопИнформация,
	|	ЗаданиеНаПеревозку.Ссылка,
	|	ЗаданиеНаПеревозку.Вес КАК ИтогоВес,
	|	ЗаданиеНаПеревозку.Объем КАК ИтогоОбъем
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку
	|ГДЕ
	|	ЗаданиеНаПеревозку.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаданиеНаПеревозку.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданиеНаПеревозкуМаршрут.Адрес,
	|	ЗаданиеНаПеревозкуМаршрут.Зона,
	|	ЗаданиеНаПеревозкуМаршрут.ВремяС КАК ВремяС,
	|	ЗаданиеНаПеревозкуМаршрут.ВремяПо КАК ВремяПо,
	|	СУММА(ЗаданиеНаПеревозкуРаспоряжения.Вес) КАК Вес,
	|	СУММА(ЗаданиеНаПеревозкуРаспоряжения.Объем) КАК Объем,
	|	ВЫРАЗИТЬ(ЗаданиеНаПеревозкуМаршрут.ДополнительнаяИнформация КАК СТРОКА(1000)) КАК ДополнительнаяИнформация,
	|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение,
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка КАК Ссылка,
	|	ЗаданиеНаПеревозкуРаспоряжения.ПолучательОтправитель КАК Получатель,
	|	СУММА(ВЫБОР
	|			КОГДА РасходныйОрдерНаТоварыОтгружаемыеТовары.УпаковочныйЛистРодитель = ЗНАЧЕНИЕ(Документ.УпаковочныйЛист.ПустаяСсылка)
	|				ТОГДА ЕСТЬNULL(РасходныйОрдерНаТоварыОтгружаемыеТовары.КоличествоУпаковок, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоМест
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Маршрут КАК ЗаданиеНаПеревозкуМаршрут
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК РасходныйОрдерНаТоварыОтгружаемыеТовары
	|			ПО ЗаданиеНаПеревозкуРаспоряжения.Ссылка = РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.ЗаданиеНаПеревозку
	|				И ЗаданиеНаПеревозкуРаспоряжения.ПолучательОтправитель = РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.Получатель
	|				И (НЕ РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка.ПометкаУдаления)
	|		ПО ЗаданиеНаПеревозкуМаршрут.КлючСвязи = ЗаданиеНаПеревозкуРаспоряжения.КлючСвязи
	|ГДЕ
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданиеНаПеревозкуМаршрут.Адрес,
	|	ЗаданиеНаПеревозкуМаршрут.Зона,
	|	ЗаданиеНаПеревозкуМаршрут.ВремяС,
	|	ЗаданиеНаПеревозкуМаршрут.ВремяПо,
	|	ВЫРАЗИТЬ(ЗаданиеНаПеревозкуМаршрут.ДополнительнаяИнформация КАК СТРОКА(1000)),
	|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение,
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка,
	|	ЗаданиеНаПеревозкуМаршрут.НомерСтроки,
	|	ЗаданиеНаПеревозкуМаршрут.КлючСвязи,
	|	ЗаданиеНаПеревозкуРаспоряжения.ПолучательОтправитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаданиеНаПеревозкуМаршрут.Ссылка,
	|	ЗаданиеНаПеревозкуМаршрут.НомерСтроки,
	|	МИНИМУМ(ЗаданиеНаПеревозкуРаспоряжения.НомерСтроки)
	|ИТОГИ ПО
	|	Ссылка,
	|	ЗаданиеНаПеревозкуМаршрут.НомерСтроки,
	|	ЗаданиеНаПеревозкуМаршрут.КлючСвязи,
	|	Получатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Склад,
	|	ВЫБОР
	|		КОГДА Т.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
	|				И Т.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= Т.Распоряжение.Дата
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОрдернаяСхемаПриОтгрузке
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК Т
	|ГДЕ
	|	Т.Ссылка В(&МассивОбъектов)
	|	И НЕ Т.Склад.ЭтоГруппа";

	ЗапросПоДокументу.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	РезультатЗапросаПоДокументу = ЗапросПоДокументу.ВыполнитьПакет();

	РезультатШапкаДокументов = РезультатЗапросаПоДокументу[0].Выбрать();
	ВыборкаПоСсылкам = РезультатЗапросаПоДокументу[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	СкладыПогрузкиВыборка = РезультатЗапросаПоДокументу[2].Выбрать();

	Пока РезультатШапкаДокументов.Следующий() Цикл

		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		РеквизитыДокумента = Новый Структура;
		РеквизитыДокумента.Вставить("Номер", РезультатШапкаДокументов.НомерЗадания);
		РеквизитыДокумента.Вставить("Дата", РезультатШапкаДокументов.Дата);

		ЗаголовокДокумента = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента, НСтр("ru='Маршрутный лист'"));
		ОбластьЗаголовокДокумента.Параметры.ЗаголовокДокумента = ЗаголовокДокумента;

		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(
		ТабличныйДокумент,
		Макет,
		ОбластьЗаголовокДокумента,
		РезультатШапкаДокументов.Ссылка);

		ТабличныйДокумент.Вывести(ОбластьЗаголовокДокумента);

		ОбластьШапкаДокумента.Параметры.Заполнить(РезультатШапкаДокументов);

		СтрокаСкладыПогрузки = "";

		ЕстьОрдерныеСклады = Ложь;

		Пока СкладыПогрузкиВыборка.Следующий() Цикл
			Если СкладыПогрузкиВыборка.ОрдернаяСхемаПриОтгрузке И Не ЕстьОрдерныеСклады Тогда
				ЕстьОрдерныеСклады = Истина;
			КонецЕсли;
			СтрокаСкладыПогрузки = СтрокаСкладыПогрузки + СкладыПогрузкиВыборка.Склад + "," + " ";	

		КонецЦикла;

		Если ЕстьОрдерныеСклады Тогда 
			ОбластьШапкаТаблицы				= Макет.ПолучитьОбласть("ШапкаТаблицы");
			ОбластьСтрокаТаблицы			= Макет.ПолучитьОбласть("СтрокаТаблицы");
			ОбластьДопСтрокаТаблицы			= Макет.ПолучитьОбласть("ДопСтрокаТаблицы");
			ОбластьПодвалТаблицы 			= Макет.ПолучитьОбласть("ПодвалТаблицы");
			ОбластьИтоги 					= Макет.ПолучитьОбласть("Итоги"); 
		Иначе
			ОбластьШапкаТаблицы				= Макет.ПолучитьОбласть("ШапкаТаблицыБезМест");
			ОбластьСтрокаТаблицы			= Макет.ПолучитьОбласть("СтрокаТаблицыБезМест");
			ОбластьДопСтрокаТаблицы			= Макет.ПолучитьОбласть("ДопСтрокаТаблицыБезМест");
			ОбластьПодвалТаблицы 			= Макет.ПолучитьОбласть("ПодвалТаблицыБезМест");
			ОбластьИтоги 					= Макет.ПолучитьОбласть("ИтогиБезМест");
		КонецЕсли;

		Если СтрокаСкладыПогрузки <> "" Тогда 

			СтрокаСкладыПогрузки = Лев(СтрокаСкладыПогрузки, СтрДлина(СтрокаСкладыПогрузки) - 2);
			ОбластьШапкаДокумента.Параметры.СкладыПогрузки = СтрокаСкладыПогрузки;

		КонецЕсли;

		ТабличныйДокумент.Вывести(ОбластьШапкаДокумента);

		Пока ВыборкаПоСсылкам.НайтиСледующий(Новый Структура ("Ссылка", РезультатШапкаДокументов.Ссылка)) Цикл

			ИмяСтолбцаВес = НСтр("ru = 'Вес, %ЕдиницаИзмеренияВес%'");
			ИмяСтолбцаОбъем = НСтр("ru = 'Объем, %ЕдиницаИзмеренияОбъем%'");
			ИмяСтолбцаВес = СтрЗаменить(ИмяСтолбцаВес, "%ЕдиницаИзмеренияВес%", Константы.ЕдиницаИзмеренияВеса.Получить());
			ИмяСтолбцаОбъем = СтрЗаменить(ИмяСтолбцаОбъем, "%ЕдиницаИзмеренияОбъем%", Константы.ЕдиницаИзмеренияОбъема.Получить());

			ОбластьШапкаТаблицы.Параметры.ВесШапка = ИмяСтолбцаВес;
			ОбластьШапкаТаблицы.Параметры.ОбъемШапка = ИмяСтолбцаОбъем;

			ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);

			ВыборкаПоНомерамСтрок = ВыборкаПоСсылкам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

			НомерСтроки = 0;

			Пока ВыборкаПоНомерамСтрок.Следующий() Цикл

				ВыборкаПоКодамСтрок = ВыборкаПоНомерамСтрок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

				Пока ВыборкаПоКодамСтрок.Следующий() Цикл

					НомерСтроки = НомерСтроки + 1;
					ОбластьСтрокаТаблицы.Параметры.НомерЗаказа = НомерСтроки;

					ВыборкаПоПолучателям = ВыборкаПоКодамСтрок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

					ПервыйПолучатель = Истина;

					КоличествоПолучателей = ВыборкаПоПолучателям.Количество();
					ИтогоКоличествомест = 0;

					Пока ВыборкаПоПолучателям.Следующий() Цикл

						Если ПервыйПолучатель Тогда 
							ЗаполняемаяОбласть = ОбластьСтрокаТаблицы;
							ПервыйПолучатель = Ложь;
						Иначе
							ЗаполняемаяОбласть = ОбластьДопСтрокаТаблицы;
						КонецЕсли;

						ИтогоВес = 0;
						ИтогоОбъем = 0;

						ИтогоКоличествомест = ИтогоКоличествомест + ВыборкаПоПолучателям.КоличествоМест;

						Выборка = ВыборкаПоПолучателям.Выбрать();

						Распоряжения = Новый Соответствие;
						#Вставка
						МестПоРаспоряжениям = "";
						#КонецВставки

						Пока Выборка.Следующий() Цикл

							ИтогоВес = ИтогоВес + Выборка.Вес;
							ИтогоОбъем = ИтогоОбъем + Выборка.Объем;

							ЗаполняемаяОбласть.Параметры.Заполнить(Выборка);

							СтрокаРаспоряжения = Распоряжения.Получить(Выборка.Распоряжение.Метаданные());
							Если СтрокаРаспоряжения = Неопределено Тогда
								СтрокаРаспоряжения = Выборка.Распоряжение.Метаданные().ПредставлениеСписка + ": "
								+ ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Распоряжение.Номер);	
							Иначе
								СтрокаРаспоряжения = СтрокаРаспоряжения + "," + " "
								+ ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Распоряжение.Номер);
							КонецЕсли;	

							Распоряжения.Вставить(Выборка.Распоряжение.Метаданные(), СтрокаРаспоряжения);
							#Вставка
							МестПоРаспоряжениям = МестПоРаспоряжениям + игр_ПолучиМестаПоРаспоряжениям(Выборка.Распоряжение);
							#КонецВставки
						КонецЦикла;

						ЗаполняемаяОбласть.Параметры.Вес = ИтогоВес;
						ЗаполняемаяОбласть.Параметры.Объем = ИтогоОбъем;
						#Вставка
						Если ЗначениеЗаполнено(МестПоРаспоряжениям) Тогда
							ЗаполняемаяОбласть.Параметры.КоличествоМест = МестПоРаспоряжениям;
						КонецЕсли;
						#КонецВставки

						ЗаполняемаяОбласть.Параметры.Распоряжения = "";
						Для Каждого РаспоряжениеКлючЗначение Из Распоряжения Цикл

							ЗаполняемаяОбласть.Параметры.Распоряжения = ЗаполняемаяОбласть.Параметры.Распоряжения + РаспоряжениеКлючЗначение.Значение + Символы.ПС;

						КонецЦикла;

						ТабличныйДокумент.Вывести(ЗаполняемаяОбласть);

					КонецЦикла;

					Если ЕстьОрдерныеСклады Тогда 
						ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент, "НомерЗаказа", КоличествоПолучателей - 1);
						ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент, "Адрес", КоличествоПолучателей - 1);
						ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент, "Зона", КоличествоПолучателей - 1);
						#Удаление
						ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент, "ВремяС", КоличествоПолучателей - 1);
						ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент, "ВремяПо", КоличествоПолучателей - 1);
						#КонецУдаления
						ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент, "ДополнительнаяИнформацияСтрока", КоличествоПолучателей - 1);
					Иначе
						ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент, "НомерЗаказаБезМест", КоличествоПолучателей - 1);
						ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент, "АдресБезМест", КоличествоПолучателей - 1);
						ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент, "ЗонаБезМест", КоличествоПолучателей - 1);
						#Удаление
						ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент, "ВремяСБезМест", КоличествоПолучателей - 1);
						ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент, "ВремяПоБезМест", КоличествоПолучателей - 1);
						#КонецУдаления
						ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент, "ДополнительнаяИнформацияСтрокаБезМест", КоличествоПолучателей - 1);
					КонецЕсли;

				КонецЦикла;

			КонецЦикла;

			ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);

			ОбластьИтоги.Параметры.ИтогоВес = РезультатШапкаДокументов.ИтогоВес / НоменклатураСервер.КоэффициентПересчетаВТонны(Константы.ЕдиницаИзмеренияВеса.Получить());
			ОбластьИтоги.Параметры.ИтогоОбъем = РезультатШапкаДокументов.ИтогоОбъем;
			Если ЕстьОрдерныеСклады Тогда 
				ОбластьИтоги.Параметры.ИтогоКоличествоМест = ИтогоКоличествомест;
			КонецЕсли;

			ТабличныйДокумент.Вывести(ОбластьИтоги);

			Если ЗначениеЗаполнено(РезультатШапкаДокументов.ДопИнформация) Тогда

				ОбластьДополнительнаяИнформация.Параметры.ДопИнформация = СокрЛП(РезультатШапкаДокументов.ДопИнформация);
				ТабличныйДокумент.Вывести(ОбластьДополнительнаяИнформация);

			КонецЕсли;

		КонецЦикла;
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
		ТабличныйДокумент,
		НомерСтрокиНачало,
		ОбъектыПечати,
		РезультатШапкаДокументов.Ссылка);
	КонецЦикла;

	ТабличныйДокумент.АвтоМасштаб = Истина;

	Возврат ТабличныйДокумент;

КонецФункции

#Область СлужебныеПроцедурыиФункции

Функция игр_ПолучиМестаПоРаспоряжениям(Распоряжение)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос	= Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыКОтгрузке.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_РОТ
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
	|ГДЕ
	|	ТоварыКОтгрузке.ДокументОтгрузки = &Распоряжение
	|	И ТоварыКОтгрузке.Регистратор ССЫЛКА Документ.РасходныйОрдерНаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходныйОрдерНаТоварыДополнительныеРеквизиты.Ссылка.Склад КАК Склад,
	|	РасходныйОрдерНаТоварыДополнительныеРеквизиты.Значение КАК Значение
	|ИЗ
	|	ВТ_РОТ КАК ВТ_РОТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ДополнительныеРеквизиты КАК РасходныйОрдерНаТоварыДополнительныеРеквизиты
	|		ПО ВТ_РОТ.Регистратор = РасходныйОрдерНаТоварыДополнительныеРеквизиты.Ссылка
	|ГДЕ
	|	РасходныйОрдерНаТоварыДополнительныеРеквизиты.Свойство.Имя = &Имя"
	;
	
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
	Запрос.УстановитьПараметр("Имя", "КоличествоМест_dd02e60bf8d74879873a9270896f4376");
	
	Выборка	= Запрос.Выполнить().Выбрать();
	
	Результат = "";
	
	Пока Выборка.Следующий() Цикл
		Результат = Результат + СтрШаблон("%1: %2", Выборка.Склад, Выборка.Значение) + Символы.ПС;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти