
&ИзменениеИКонтроль("СформироватьПечатнуюФормуУстановкиЦенНоменклатуры")
Функция игр_СформироватьПечатнуюФормуУстановкиЦенНоменклатуры(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УстановкаЦенНоменклатуры";

	#Удаление
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.УстановкаЦенНоменклатуры.ПФ_MXL_УстановкаЦенНоменклатуры");
	#КонецУдаления
	#Вставка
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.УстановкаЦенНоменклатуры.ПФ_MXL_УстановкаЦенНоменклатурыОстаток");
	#КонецВставки

	ВидыЦен = Новый Массив;
	ДеревоНастроек = ПолучитьИзВременногоХранилища(ПараметрыПечати.ДеревоНастроек);
	Для Каждого СтрокаДерева Из ДеревоНастроек.Строки Цикл
		Если СтрокаДерева.ВыводитьНаПечать Тогда
			ВидыЦен.Добавить(СтрокаДерева.Параметр);
		КонецЕсли;
	КонецЦикла;

	ДанныеДляПечати = Неопределено;
	Если ЗначениеЗаполнено(ПараметрыПечати.АдресДанныеДляПечатиВоВременномХранилище) Тогда
		ДанныеДляПечати = ПолучитьИзВременногоХранилища(ПараметрыПечати.АдресДанныеДляПечатиВоВременномХранилище);
	КонецЕсли;

	Если ДанныеДляПечати = Неопределено Тогда

		ПервыйДокумент = Истина;
		Для Каждого УстановкаЦенНоменклатуры Из МассивОбъектов Цикл

			Если Не ПервыйДокумент Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;

			ПервыйДокумент = Ложь;

			НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	УстановкаЦенНоменклатуры.Ссылка       КАК Ссылка,
			|	УстановкаЦенНоменклатуры.Ссылка.Номер КАК Номер,
			|	УстановкаЦенНоменклатуры.Ссылка.Дата  КАК Дата,
			|	Представление(УстановкаЦенНоменклатуры.Ссылка.Ответственный) КАК ОтветственныйПредставление
			|ИЗ
			|	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
			|ГДЕ
			|	УстановкаЦенНоменклатуры.Ссылка = &УстановкаЦенНоменклатуры
			|;
			|
			|ВЫБРАТЬ
			|	Товары.НомерСтроки                       КАК НомерСтроки,
			|	Товары.Номенклатура                      КАК Номенклатура,
			|	Товары.Характеристика                    КАК Характеристика,
			|	Товары.Упаковка                          КАК Упаковка,
			|	Товары.Цена                              КАК Цена,
			|	Товары.ВидЦены                           КАК ВидЦены,
			|	
			|	ВЫБОР КОГДА ЦеныНоменклатурыСрезПоследних.Упаковка = Товары.Упаковка ТОГДА
			|		ЦеныНоменклатурыСрезПоследних.Цена
			|	ИНАЧЕ
			|		ЦеныНоменклатурыСрезПоследних.Цена/ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1,1)*ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3,1)
			|	КОНЕЦ КАК ДействующаяЦена,
			|	
			|	ВЫРАЗИТЬ(ВЫБОР КОГДА ЦеныНоменклатурыСрезПоследних.Цена <> 0 ТОГДА 100*(Товары.Цена - ВЫБОР КОГДА ЦеныНоменклатурыСрезПоследних.Упаковка = Товары.Упаковка ТОГДА
			|		ЦеныНоменклатурыСрезПоследних.Цена
			|	ИНАЧЕ
			|		ЦеныНоменклатурыСрезПоследних.Цена/ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1,1)*ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3,1)
			|	КОНЕЦ)/ 
			|	
			|	ВЫБОР КОГДА ЦеныНоменклатурыСрезПоследних.Упаковка = Товары.Упаковка ТОГДА
			|		ЦеныНоменклатурыСрезПоследних.Цена
			|	ИНАЧЕ
			|		ЦеныНоменклатурыСрезПоследних.Цена/ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1,1)*ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3,1)
			|	КОНЕЦ ИНАЧЕ 0.00 КОНЕЦ КАК Число(10,2)) КАК ПроцентИзменения
			|	
			|ПОМЕСТИТЬ Товары
			|ИЗ
			|	Документ.УстановкаЦенНоменклатуры.Товары КАК Товары
			|	
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаСреза, (Номенклатура, Характеристика, ВидЦены) В (ВЫБРАТЬ Т.Номенклатура, Т.Характеристика, Т.ВидЦены ИЗ Документ.УстановкаЦенНоменклатуры.Товары КАК Т ГДЕ Т.Ссылка = &УстановкаЦенНоменклатуры И Т.ВидЦены В (&ВидыЦен))) КАК ЦеныНоменклатурыСрезПоследних
			|
			|		ПО Товары.Номенклатура      = ЦеныНоменклатурыСрезПоследних.Номенклатура
			|			И Товары.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
			|			И Товары.ВидЦены        = ЦеныНоменклатурыСрезПоследних.ВидЦены
			|
			|ГДЕ
			|	Товары.Ссылка = &УстановкаЦенНоменклатуры
			|	И Товары.ВидЦены В (&ВидыЦен)
			|	И (
			|		ВЫБОР
			|			КОГДА Товары.Номенклатура.ИспользованиеХарактеристик <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
			|				И Товары.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) ТОГДА ЛОЖЬ
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|	)
			|;
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Товары.ВидЦены КАК ВидЦены
			|ИЗ
			|	Товары КАК Товары
			|ГДЕ
			|	Товары.ВидЦены В (&ВидыЦен)
			|	И Товары.ПроцентИзменения <> 0 ИЛИ &Все
			|УПОРЯДОЧИТЬ ПО
			|	Товары.ВидЦены.РеквизитДопУпорядочивания
			|;
			|
			|ВЫБРАТЬ
			|	Товары.Номенклатура                      КАК Номенклатура,
			|	Товары.Характеристика                    КАК Характеристика,
			|	Товары.Номенклатура.НаименованиеПолное   КАК ПолноеНаименованиеНоменклатуры,
			|	Товары.Характеристика.НаименованиеПолное КАК ПолноеНаименованиеХарактеристики,
			|	Товары.Номенклатура.Код                  КАК Код,
			|	Товары.Номенклатура.Артикул              КАК Артикул,
			|	Товары.Упаковка                          КАК Упаковка,
			|	Товары.Номенклатура.ЕдиницаИзмерения     КАК ЕдиницаИзмерения,
			|	Товары.Цена                              КАК Цена,
			|	Товары.ВидЦены                           КАК ВидЦены,
			|	ЕСТЬNULL(Товары.ДействующаяЦена,0)       КАК СтараяЦена,
			#Вставка
			|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) КАК Остаток,
			#КонецВставки
			|	Товары.ПроцентИзменения                  КАК ПроцентИзменения
			|	
			|ИЗ
			|	Товары КАК Товары
			#Вставка
			|	ЛЕВОЕ СОЕДИНЕНИЕ
			|		РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
			|		ПО Товары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура 
			|		И Товары.Характеристика = ТоварыНаСкладахОстатки.Характеристика 
			#КонецВставки
			|ГДЕ
			|	Товары.ПроцентИзменения <> 0 ИЛИ &Все
			|УПОРЯДОЧИТЬ ПО
			|	Товары.НомерСтроки
			|
			#Удаление
			|ИТОГИ ПО
			#КонецУдаления
			#Вставка
			|ИТОГИ СУММА(Остаток) ПО
			#КонецВставки
			|	Номенклатура, Характеристика");

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки1",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ЦеныНоменклатурыСрезПоследних.Упаковка",
			"ЦеныНоменклатурыСрезПоследних.Номенклатура"));
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки3",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"Товары.Упаковка",
			"Товары.Номенклатура"));
			Запрос.УстановитьПараметр("УстановкаЦенНоменклатуры", УстановкаЦенНоменклатуры);
			Запрос.УстановитьПараметр("ДатаСреза",                УстановкаЦенНоменклатуры.Дата - 1);
			Запрос.УстановитьПараметр("ВидыЦен",                  ВидыЦен);
			Запрос.УстановитьПараметр("Все",                      Не ПараметрыПечати.ПечататьТолькоИзмененныеЦены);
			#Вставка
			Запрос.УстановитьПараметр("Склад", ?(ПараметрыПечати.Свойство("Склад"), ПараметрыПечати.Склад, Неопределено));
			#КонецВставки
			РезультатЗапроса = Запрос.ВыполнитьПакет();

			РезультатыЗапроса = Новый Структура;
			РезультатыЗапроса.Вставить("Шапка",        РезультатЗапроса[0]);
			РезультатыЗапроса.Вставить("ВидыЦен",      РезультатЗапроса[2]);
			РезультатыЗапроса.Вставить("Номенклатура", РезультатЗапроса[3]);

			Параметры = Новый Структура;
			Параметры.Вставить("НомерСтрокиНачало",        НомерСтрокиНачало);
			Параметры.Вставить("ТабДокумент",              ТабДокумент);
			Параметры.Вставить("Макет",                    Макет);
			Параметры.Вставить("ДеревоНастроек",           ДеревоНастроек);
			Параметры.Вставить("УстановкаЦенНоменклатуры", УстановкаЦенНоменклатуры);
			Параметры.Вставить("ОбъектыПечати",            ОбъектыПечати);
			Параметры.Вставить("ПараметрыПечати",          ПараметрыПечати);
			Параметры.Вставить("РезультатЗапроса",         РезультатыЗапроса);

			Шапка = Параметры.РезультатЗапроса.Шапка.Выбрать();
			Шапка.Следующий();

			Если Параметры.ПараметрыПечати.ВыводитьШапку Тогда
				ОбластьМакета = Параметры.Макет.ПолучитьОбласть("Заголовок");
				ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(
				Параметры.ТабДокумент, Параметры.Макет, ОбластьМакета, Шапка.Ссылка);
				ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(
				Шапка, НСтр("ru = 'Установка цен номенклатуры'"));
				Параметры.ТабДокумент.Вывести(ОбластьМакета);
			КонецЕсли;

			ВывестиТабличнуюЧастьВПечатнуюФормуУстановкаЦенНоменклатуры(Параметры);

			Если Параметры.ПараметрыПечати.ВыводитьШапку Тогда
				ОбластьМакета = Параметры.Макет.ПолучитьОбласть("Подписи");
				ОбластьМакета.Параметры.Заполнить(Шапка);
				Параметры.ТабДокумент.Вывести(ОбластьМакета);
			КонецЕсли;

			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(Параметры.ТабДокумент, Параметры.НомерСтрокиНачало, Параметры.ОбъектыПечати, Параметры.УстановкаЦенНоменклатуры);

		КонецЦикла;

	Иначе

		ОбщегоНазначенияУТ.ПронумероватьТаблицуЗначений(ДанныеДляПечати.Товары, "НомерСтроки");

		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Неопределено КАК Ссылка,
		|	Неопределено КАК Номер,
		|	Неопределено КАК Дата,
		|	Неопределено КАК ОтветственныйПредставление
		|;
		|
		|ВЫБРАТЬ
		|	Товары.НомерСтроки    КАК НомерСтроки,
		|	Товары.Номенклатура   КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Упаковка       КАК Упаковка,
		|	Товары.Цена           КАК Цена,
		|	Товары.ВидЦены        КАК ВидЦены
		|ПОМЕСТИТЬ ТаблицаДанных
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|ВЫБРАТЬ
		|	Товары.НомерСтроки                       КАК НомерСтроки,
		|	Товары.Номенклатура                      КАК Номенклатура,
		|	Товары.Характеристика                    КАК Характеристика,
		|	Товары.Упаковка                          КАК Упаковка,
		|	Товары.Цена                              КАК Цена,
		|	Товары.ВидЦены                           КАК ВидЦены,
		|	
		|	ВЫБОР КОГДА ЦеныНоменклатурыСрезПоследних.Упаковка = Товары.Упаковка ТОГДА
		|		ЦеныНоменклатурыСрезПоследних.Цена
		|	ИНАЧЕ
		|		ЦеныНоменклатурыСрезПоследних.Цена/ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1,1)*ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3,1)
		|	КОНЕЦ КАК ДействующаяЦена,
		|	
		|	ВЫРАЗИТЬ(ВЫБОР КОГДА ЦеныНоменклатурыСрезПоследних.Цена <> 0 ТОГДА 100*(Товары.Цена - ВЫБОР КОГДА ЦеныНоменклатурыСрезПоследних.Упаковка = Товары.Упаковка ТОГДА
		|		ЦеныНоменклатурыСрезПоследних.Цена
		|	ИНАЧЕ
		|		ЦеныНоменклатурыСрезПоследних.Цена/ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1,1)*ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3,1)
		|	КОНЕЦ)/ 
		|	
		|	ВЫБОР КОГДА ЦеныНоменклатурыСрезПоследних.Упаковка = Товары.Упаковка ТОГДА
		|		ЦеныНоменклатурыСрезПоследних.Цена
		|	ИНАЧЕ
		|		ЦеныНоменклатурыСрезПоследних.Цена/ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1,1)*ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3,1)
		|	КОНЕЦ ИНАЧЕ 0.00 КОНЕЦ КАК Число(10,2)) КАК ПроцентИзменения
		|	
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	ТаблицаДанных КАК Товары
		|	
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаСреза, (Номенклатура, Характеристика, ВидЦены) В (ВЫБРАТЬ Т.Номенклатура, Т.Характеристика, Т.ВидЦены ИЗ ТаблицаДанных КАК Т ГДЕ Т.ВидЦены В (&ВидыЦен))) КАК ЦеныНоменклатурыСрезПоследних
		|
		|		ПО Товары.Номенклатура      = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И Товары.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
		|			И Товары.ВидЦены        = ЦеныНоменклатурыСрезПоследних.ВидЦены
		|
		|ГДЕ
		|	Товары.ВидЦены В (&ВидыЦен)
		|	И (
		|		ВЫБОР
		|			КОГДА Товары.Номенклатура.ИспользованиеХарактеристик <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
		|				И Товары.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	)
		|;
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Товары.ВидЦены КАК ВидЦены
		|ИЗ
		|	Товары КАК Товары
		|ГДЕ
		|	Товары.ВидЦены В (&ВидыЦен)
		|	И Товары.ПроцентИзменения <> 0 ИЛИ &Все
		|УПОРЯДОЧИТЬ ПО
		|	Товары.ВидЦены.РеквизитДопУпорядочивания
		|;
		|
		|ВЫБРАТЬ
		|	Товары.Номенклатура                      КАК Номенклатура,
		|	Товары.Характеристика                    КАК Характеристика,
		|	Товары.Номенклатура.НаименованиеПолное   КАК ПолноеНаименованиеНоменклатуры,
		|	Товары.Характеристика.НаименованиеПолное КАК ПолноеНаименованиеХарактеристики,
		|	Товары.Номенклатура.Код                  КАК Код,
		|	Товары.Номенклатура.Артикул              КАК Артикул,
		|	Товары.Упаковка                          КАК Упаковка,
		|	Товары.Номенклатура.ЕдиницаИзмерения     КАК ЕдиницаИзмерения,
		|	Товары.Цена                              КАК Цена,
		|	Товары.ВидЦены                           КАК ВидЦены,
		|	ЕСТЬNULL(Товары.ДействующаяЦена,0)       КАК СтараяЦена,
		#Вставка
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) КАК Остаток,
		#КонецВставки
		|	Товары.ПроцентИзменения                  КАК ПроцентИзменения
		|	
		|ИЗ
		|	Товары КАК Товары
		#Вставка
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
		|		ПО Товары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура 
		|		И Товары.Характеристика = ТоварыНаСкладахОстатки.Характеристика 
		#КонецВставки
		|ГДЕ
		|	Товары.ПроцентИзменения <> 0 ИЛИ &Все
		|УПОРЯДОЧИТЬ ПО
		|	Товары.НомерСтроки
		|
		#Удаление
		|ИТОГИ ПО
		#КонецУдаления
		#Вставка
		|ИТОГИ СУММА(Остаток) ПО
		#КонецВставки
		|	Номенклатура, Характеристика");

		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки1",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"ЦеныНоменклатурыСрезПоследних.Упаковка",
		"ЦеныНоменклатурыСрезПоследних.Номенклатура"));
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки3",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"Товары.Упаковка",
		"Товары.Номенклатура"));
		Запрос.УстановитьПараметр("ДатаСреза",                ДанныеДляПечати.ДатаДействующихЦен);
		Запрос.УстановитьПараметр("ВидыЦен",                  ВидыЦен);
		Запрос.УстановитьПараметр("Товары",                   ДанныеДляПечати.Товары);
		Запрос.УстановитьПараметр("Все",                      Не ПараметрыПечати.ПечататьТолькоИзмененныеЦены);
		#Вставка
		Запрос.УстановитьПараметр("Склад", ?(ПараметрыПечати.Свойство("Склад"), ПараметрыПечати.Склад, Неопределено));
		#КонецВставки
		РезультатЗапроса = Запрос.ВыполнитьПакет();

		РезультатыЗапроса = Новый Структура;
		РезультатыЗапроса.Вставить("Шапка",        РезультатЗапроса[0]);
		РезультатыЗапроса.Вставить("ВидыЦен",      РезультатЗапроса[3]);
		РезультатыЗапроса.Вставить("Номенклатура", РезультатЗапроса[4]);

		Параметры = Новый Структура;
		Параметры.Вставить("НомерСтрокиНачало",        НомерСтрокиНачало);
		Параметры.Вставить("ТабДокумент",              ТабДокумент);
		Параметры.Вставить("Макет",                    Макет);
		Параметры.Вставить("ДеревоНастроек",           ДеревоНастроек);
		Параметры.Вставить("УстановкаЦенНоменклатуры", УстановкаЦенНоменклатуры);
		Параметры.Вставить("ОбъектыПечати",            ОбъектыПечати);
		Параметры.Вставить("ПараметрыПечати",          ПараметрыПечати);
		Параметры.Вставить("РезультатЗапроса",         РезультатыЗапроса);

		Шапка = Параметры.РезультатЗапроса.Шапка.Выбрать();
		Шапка.Следующий();

		Если Параметры.ПараметрыПечати.ВыводитьШапку Тогда
			ОбластьМакета = Параметры.Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.ТекстЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Изменение цен номенклатуры за %1'"),
			Формат(ДанныеДляПечати.ДатаДействующихЦен, НСтр("ru = 'ДФ=dd.MM.yyyy'")));
			Параметры.ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;

		ВывестиТабличнуюЧастьВПечатнуюФормуУстановкаЦенНоменклатуры(Параметры);

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(Параметры.ТабДокумент, Параметры.НомерСтрокиНачало, Параметры.ОбъектыПечати, Параметры.УстановкаЦенНоменклатуры);

	КонецЕсли;

	Возврат ТабДокумент;

КонецФункции

&ИзменениеИКонтроль("ВывестиТабличнуюЧастьВПечатнуюФормуУстановкаЦенНоменклатуры")
Процедура игр_ВывестиТабличнуюЧастьВПечатнуюФормуУстановкаЦенНоменклатуры(Параметры)

	// Шапка таблицы
	ИмяДополнительнойКолонки = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	ВыводитьКоды = ?(ЗначениеЗаполнено(ИмяДополнительнойКолонки), Истина, Ложь);

	ШапкаНомера  = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|ОбластьНомера");
	ШапкаКодов   = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|ОбластьКодов");
	ШапкаТовар   = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|ОбластьТовар");
	#Вставка
	ШапкаОстаток   = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|Остаток");
	#КонецВставки
	ШапкаВидЦены = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|ОбластьВидЦены" + ?(Не Параметры.ПараметрыПечати.ВыводитьШапку,"УникальныйИдентификатор",""));
	ШапкаУникальныеИдентификаторы = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|УникальныеИдентификаторы");

	Параметры.ТабДокумент.Вывести(ШапкаНомера);
	Если ВыводитьКоды Тогда
		ШапкаКодов.Параметры.ИмяКолонкиКодов = ИмяДополнительнойКолонки;
		Параметры.ТабДокумент.Присоединить(ШапкаКодов);
	КонецЕсли;
	Если Не Параметры.ПараметрыПечати.ВыводитьШапку Тогда
		Параметры.ТабДокумент.Присоединить(ШапкаУникальныеИдентификаторы);
	КонецЕсли;
	Параметры.ТабДокумент.Присоединить(ШапкаТовар);
	#Вставка
	Параметры.ТабДокумент.Присоединить(ШапкаОстаток);
	#КонецВставки

	Табл = Новый ТаблицаЗначений;
	Табл.Колонки.Добавить("ВидЦены");
	Табл.Колонки.Добавить("МакетОбласти");
	Табл.Колонки.Добавить("ВыводитьСуммуИзменения");
	Табл.Колонки.Добавить("ВыводитьПроцентИзменения");
	Табл.Колонки.Добавить("ВыводитьСтаруюЦену");

	ВыборкаПоВидамЦен = Параметры.РезультатЗапроса.ВидыЦен.Выбрать();
	Пока ВыборкаПоВидамЦен.Следующий() Цикл

		Новая                          = Табл.Добавить();
		Новая.ВидЦены                  = ВыборкаПоВидамЦен.ВидЦены;
		Новая.ВыводитьПроцентИзменения = Ложь;
		Новая.ВыводитьСуммуИзменения   = Ложь;
		Новая.ВыводитьСтаруюЦену       = Ложь;

		НайденныеСтроки = Параметры.ДеревоНастроек.Строки.НайтиСтроки(Новый Структура("Параметр", ВыборкаПоВидамЦен.ВидЦены), Ложь);
		Для Каждого ВидЦены Из НайденныеСтроки Цикл

			Для Каждого Колонка Из ВидЦены.Строки Цикл

				Если Колонка.Параметр = "СтараяЦена" И Колонка.ВыводитьНаПечать Тогда
					Новая.ВыводитьСтаруюЦену = Истина;
				КонецЕсли;

				Если Колонка.Параметр = "СуммаИзменения" И Колонка.ВыводитьНаПечать Тогда
					Новая.ВыводитьСуммуИзменения = Истина;
				КонецЕсли;

				Если Колонка.Параметр = "ПроцентИзменения" И Колонка.ВыводитьНаПечать Тогда
					Новая.ВыводитьПроцентИзменения = Истина;
				КонецЕсли;

			КонецЦикла;

		КонецЦикла;

		Если Новая.ВыводитьСуммуИзменения Тогда

			Если Новая.ВыводитьПроцентИзменения И Новая.ВыводитьСтаруюЦену Тогда
				ШапкаВидЦены       = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|ОбластьВидЦеныСтараяЦенаПроцентИзмененияСуммаИзменения" + ?(Не Параметры.ПараметрыПечати.ВыводитьШапку,"УникальныйИдентификатор",""));
				Новая.МакетОбласти = Параметры.Макет.ПолучитьОбласть("Строка|ОбластьВидЦеныСтараяЦенаПроцентИзмененияСуммаИзменения" + ?(Не Параметры.ПараметрыПечати.ВыводитьШапку,"УникальныйИдентификатор",""));
			ИначеЕсли Новая.ВыводитьПроцентИзменения И Не Новая.ВыводитьСтаруюЦену Тогда
				ШапкаВидЦены       = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|ОбластьВидЦеныПроцентИзмененияСуммаИзменения" + ?(Не Параметры.ПараметрыПечати.ВыводитьШапку,"УникальныйИдентификатор",""));
				Новая.МакетОбласти = Параметры.Макет.ПолучитьОбласть("Строка|ОбластьВидЦеныПроцентИзмененияСуммаИзменения");
			ИначеЕсли Не Новая.ВыводитьПроцентИзменения И Новая.ВыводитьСтаруюЦену Тогда
				ШапкаВидЦены       = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|ОбластьВидЦеныСтараяЦенаСуммаИзменения" + ?(Не Параметры.ПараметрыПечати.ВыводитьШапку,"УникальныйИдентификатор",""));
				Новая.МакетОбласти = Параметры.Макет.ПолучитьОбласть("Строка|ОбластьВидЦеныСтараяЦенаСуммаИзменения" + ?(Не Параметры.ПараметрыПечати.ВыводитьШапку,"УникальныйИдентификатор",""));
			ИначеЕсли Не Новая.ВыводитьПроцентИзменения И Не Новая.ВыводитьСтаруюЦену Тогда
				ШапкаВидЦены       = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|ОбластьВидЦеныСуммаИзменения" + ?(Не Параметры.ПараметрыПечати.ВыводитьШапку,"УникальныйИдентификатор",""));
				Новая.МакетОбласти = Параметры.Макет.ПолучитьОбласть("Строка|ОбластьВидЦеныСуммаИзменения" + ?(Не Параметры.ПараметрыПечати.ВыводитьШапку,"УникальныйИдентификатор",""));
			КонецЕсли;

		Иначе

			Если Новая.ВыводитьПроцентИзменения И Новая.ВыводитьСтаруюЦену Тогда
				ШапкаВидЦены       = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|ОбластьВидЦеныСтараяЦенаПроцентИзменения" + ?(Не Параметры.ПараметрыПечати.ВыводитьШапку,"УникальныйИдентификатор",""));
				Новая.МакетОбласти = Параметры.Макет.ПолучитьОбласть("Строка|ОбластьВидЦеныСтараяЦенаПроцентИзменения" + ?(Не Параметры.ПараметрыПечати.ВыводитьШапку,"УникальныйИдентификатор",""));
			ИначеЕсли Новая.ВыводитьПроцентИзменения И Не Новая.ВыводитьСтаруюЦену Тогда
				ШапкаВидЦены       = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|ОбластьВидЦеныПроцентИзменения" + ?(Не Параметры.ПараметрыПечати.ВыводитьШапку,"УникальныйИдентификатор",""));
				Новая.МакетОбласти = Параметры.Макет.ПолучитьОбласть("Строка|ОбластьВидЦеныПроцентИзменения");
			ИначеЕсли Не Новая.ВыводитьПроцентИзменения И Новая.ВыводитьСтаруюЦену Тогда
				ШапкаВидЦены       = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|ОбластьВидЦеныСтараяЦена" + ?(Не Параметры.ПараметрыПечати.ВыводитьШапку,"УникальныйИдентификатор",""));
				Новая.МакетОбласти = Параметры.Макет.ПолучитьОбласть("Строка|ОбластьВидЦеныСтараяЦена" + ?(Не Параметры.ПараметрыПечати.ВыводитьШапку,"УникальныйИдентификатор",""));
			ИначеЕсли Не Новая.ВыводитьПроцентИзменения И Не Новая.ВыводитьСтаруюЦену Тогда
				ШапкаВидЦены       = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|ОбластьВидЦены" + ?(Не Параметры.ПараметрыПечати.ВыводитьШапку,"УникальныйИдентификатор",""));
				Новая.МакетОбласти = Параметры.Макет.ПолучитьОбласть("Строка|ОбластьВидЦены" + ?(Не Параметры.ПараметрыПечати.ВыводитьШапку,"УникальныйИдентификатор",""));
			КонецЕсли;

		КонецЕсли;

		ШапкаВидЦены.Параметры.ВидЦены = ВыборкаПоВидамЦен.ВидЦены;
		Параметры.ТабДокумент.Присоединить(ШапкаВидЦены);

	КонецЦикла;

	ОбластьНомера = Параметры.Макет.ПолучитьОбласть("Строка|ОбластьНомера");
	ОбластьКодов  = Параметры.Макет.ПолучитьОбласть("Строка|ОбластьКодов");
	ОбластьТовар  = Параметры.Макет.ПолучитьОбласть("Строка|ОбластьТовар");
	#Вставка
	ОбластьОстаток   = Параметры.Макет.ПолучитьОбласть("Строка|Остаток");
	#КонецВставки
	ОбластьУникальныеИдентификаторы = Параметры.Макет.ПолучитьОбласть("Строка|УникальныеИдентификаторы");

	НомерСтроки = 0;
	ВыборкаПоНоменклатуре = Параметры.РезультатЗапроса.Номенклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоНоменклатуре.Следующий() Цикл

		Если Не ЗначениеЗаполнено(ВыборкаПоНоменклатуре.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;

		ВыборкаПоХарактеристикам = ВыборкаПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоХарактеристикам.Следующий() Цикл

			НомерСтроки = НомерСтроки + 1;

			ОбластьНомера.Параметры.НомерСтроки = НомерСтроки;
			Параметры.ТабДокумент.Вывести(ОбластьНомера);
			Если ВыводитьКоды Тогда

				Если ИмяДополнительнойКолонки = "Артикул" Тогда
					ОбластьКодов.Параметры.Артикул = ВыборкаПоХарактеристикам.Артикул;
				Иначе
					ОбластьКодов.Параметры.Артикул = ВыборкаПоХарактеристикам.Код;
				КонецЕсли;

				Параметры.ТабДокумент.Присоединить(ОбластьКодов);

			КонецЕсли;

			Если Не Параметры.ПараметрыПечати.ВыводитьШапку Тогда
				ОбластьУникальныеИдентификаторы.Параметры.УникальныйИдентификаторНоменклатура   = Строка(ВыборкаПоХарактеристикам.Номенклатура.УникальныйИдентификатор());
				ОбластьУникальныеИдентификаторы.Параметры.УникальныйИдентификаторХарактеристика = Строка(ВыборкаПоХарактеристикам.Характеристика.УникальныйИдентификатор());
				Параметры.ТабДокумент.Присоединить(ОбластьУникальныеИдентификаторы);
			КонецЕсли;

			ОбластьТовар.Параметры.Заполнить(ВыборкаПоХарактеристикам);
			ОбластьТовар.Параметры.Товар = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			ВыборкаПоХарактеристикам.ПолноеНаименованиеНоменклатуры,
			ВыборкаПоХарактеристикам.ПолноеНаименованиеХарактеристики);
			Параметры.ТабДокумент.Присоединить(ОбластьТовар);
			#Вставка
			ОбластьОстаток.Параметры.Заполнить(ВыборкаПоХарактеристикам);
			Параметры.ТабДокумент.Присоединить(ОбластьОстаток);
			#КонецВставки

			ВыборкаПоВидамЦен = ВыборкаПоХарактеристикам.Выбрать();
			Для Каждого СтрокаТЗ Из Табл Цикл

				ВыборкаПоВидамЦен.Сбросить();
				Если ВыборкаПоВидамЦен.НайтиСледующий(Новый Структура("ВидЦены", СтрокаТЗ.ВидЦены)) Тогда

					ОбластьВидЦены = СтрокаТЗ.МакетОбласти;

					ОбластьВидЦены.Параметры.Цена = ВыборкаПоВидамЦен.Цена;

					Если СтрокаТЗ.ВыводитьСтаруюЦену Тогда
						ОбластьВидЦены.Параметры.СтараяЦена = ВыборкаПоВидамЦен.СтараяЦена;
					КонецЕсли;

					Если СтрокаТЗ.ВыводитьСуммуИзменения Тогда
						ОбластьВидЦены.Параметры.СуммаИзменения = ВыборкаПоВидамЦен.Цена - ВыборкаПоВидамЦен.СтараяЦена;
					КонецЕсли;

					Если СтрокаТЗ.ВыводитьПроцентИзменения Тогда
						ОбластьВидЦены.Параметры.ПроцентИзменения = ВыборкаПоВидамЦен.ПроцентИзменения;
					КонецЕсли;

					Если ЗначениеЗаполнено(ВыборкаПоВидамЦен.Упаковка) Тогда
						ОбластьВидЦены.Параметры.ЕдиницаИзмерения = ВыборкаПоВидамЦен.Упаковка;
					Иначе
						ОбластьВидЦены.Параметры.ЕдиницаИзмерения = ВыборкаПоВидамЦен.ЕдиницаИзмерения;
					КонецЕсли;

					Если Не Параметры.ПараметрыПечати.ВыводитьШапку Тогда
						ОбластьВидЦены.Параметры.УникальныйИдентификаторЕдиницаИзмерения = Строка(ВыборкаПоВидамЦен.Упаковка.УникальныйИдентификатор());
					КонецЕсли;

				Иначе

					ОбластьВидЦены = СтрокаТЗ.МакетОбласти;

					ОбластьВидЦены.Параметры.Цена = 0;

					Если СтрокаТЗ.ВыводитьСтаруюЦену Тогда
						ОбластьВидЦены.Параметры.СтараяЦена = 0;
					КонецЕсли;

					Если СтрокаТЗ.ВыводитьСуммуИзменения Тогда
						ОбластьВидЦены.Параметры.СуммаИзменения = 0;
					КонецЕсли;

					Если СтрокаТЗ.ВыводитьПроцентИзменения Тогда
						ОбластьВидЦены.Параметры.ПроцентИзменения = 0;
					КонецЕсли;

					ОбластьВидЦены.Параметры.ЕдиницаИзмерения = Неопределено;

					Если Не Параметры.ПараметрыПечати.ВыводитьШапку Тогда
						ОбластьВидЦены.Параметры.УникальныйИдентификаторЕдиницаИзмерения = Строка(Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка().УникальныйИдентификатор());
					КонецЕсли;

				КонецЕсли;

				Параметры.ТабДокумент.Присоединить(ОбластьВидЦены);

			КонецЦикла;

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

&После("ДобавитьКомандыОтчетов")
Процедура игр_ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры)
	
	ВариантыОтчетовУТПереопределяемый.игр_ДобавитьКомандуПрайсЛист(КомандыОтчетов);
	
КонецПроцедуры
