#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура игр_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	игр_ПроверитьНоменклатуруВАкциях(Отказ);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура игр_ПроверитьНоменклатуруВАкциях(Отказ) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос	= Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	игр_НоменклатураМаркетинговыхАкций.Ссылка КАК Ссылка,
	|	игр_НоменклатураМаркетинговыхАкций.ДатаНачала КАК ДатаНачала,
	|	игр_НоменклатураМаркетинговыхАкций.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_Документ
	|ИЗ
	|	Документ.игр_НоменклатураМаркетинговыхАкций КАК игр_НоменклатураМаркетинговыхАкций
	|ГДЕ
	|	игр_НоменклатураМаркетинговыхАкций.Проведен
	|	И игр_НоменклатураМаркетинговыхАкций.ДатаНачала <= &ДатаДокумента
	|	И игр_НоменклатураМаркетинговыхАкций.ДатаОкончания >= &ДатаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документ.Ссылка КАК Ссылка,
	|	ВТ_Документ.ДатаНачала КАК ДатаНачала,
	|	ВТ_Документ.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ДокументыСЦенами
	|ИЗ
	|	ВТ_Документ КАК ВТ_Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.игр_НоменклатураМаркетинговыхАкций.ВидыЦен КАК игр_НоменклатураМаркетинговыхАкцийВидыЦен
	|		ПО ВТ_Документ.Ссылка = игр_НоменклатураМаркетинговыхАкцийВидыЦен.Ссылка
	|ГДЕ
	|	игр_НоменклатураМаркетинговыхАкцийВидыЦен.ВидЦены В(&ВидыЦены)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДокументыСЦенами.Ссылка КАК Ссылка,
	|	ВТ_ДокументыСЦенами.ДатаНачала КАК ДатаНачала,
	|	ВТ_ДокументыСЦенами.ДатаОкончания КАК ДатаОкончания,
	|	игр_НоменклатураМаркетинговыхАкцийТовары.Номенклатура КАК Номенклатура
	|ИЗ
	|	ВТ_ДокументыСЦенами КАК ВТ_ДокументыСЦенами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.игр_НоменклатураМаркетинговыхАкций.Товары КАК игр_НоменклатураМаркетинговыхАкцийТовары
	|		ПО ВТ_ДокументыСЦенами.Ссылка = игр_НоменклатураМаркетинговыхАкцийТовары.Ссылка
	|ГДЕ
	|	игр_НоменклатураМаркетинговыхАкцийТовары.Номенклатура В(&Номенклатура)"
	;
	
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Товары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("ВидыЦены", Товары.ВыгрузитьКолонку("ВидЦены"));
	
	Результат	= Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Отказ = Истина;
		
		Выборка	= Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон(НСтр("ru='%1 с %3 по %4 участвует в акции %2';"),
					Выборка.Номенклатура, 
					Выборка.Ссылка,
					Формат(Выборка.ДатаНачала, "ДФ=dd.MM.yyyy"),
					Формат(Выборка.ДатаОкончания, "ДФ=dd.MM.yyyy")));
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли