&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ВерсияОбработки = ОбработкаОбъект.ПолучитьВерсиюОбработки();
	
	СтруктураФайлаXMLНаФорме = Неопределено;
	ЭтаФорма.Параметры.Свойство("ТипГибкихНастроек", ЭтаФорма.ТипГибкихНастроек);
	
	Если ЭтаФорма.ТипГибкихНастроек = "Исходящие настройки" Тогда
	     ЭтаФорма.Параметры.Свойство("СтруктураФайлаXMLИсходящие", СтруктураФайлаXMLНаФорме);
		 КопироватьДанныеФормы(СтруктураФайлаXMLНаФорме, СтруктураФайлаXMLИсходящие);
	ИначеЕсли ЭтаФорма.ТипГибкихНастроек = "Входящие настройки" Тогда
	     ЭтаФорма.Параметры.Свойство("СтруктураФайлаXMLВходящие", СтруктураФайлаXMLНаФорме);
		 КопироватьДанныеФормы(СтруктураФайлаXMLНаФорме, СтруктураФайлаXMLВходящие);
    ИначеЕсли ЭтаФорма.ТипГибкихНастроек = "Настройки по созданию документов" Тогда
	     ЭтаФорма.Параметры.Свойство("СтруктураФайлаXMLДокументы", СтруктураФайлаXMLНаФорме);
		 КопироватьДанныеФормы(СтруктураФайлаXMLНаФорме, СтруктураФайлаXMLДокументы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 	
	ЭтаФорма.Заголовок = "Docrobot - " + ЭтаФорма.ТипГибкихНастроек + ", версия обработки  - " + ВерсияОбработки;
	
	ДоступенВыборВетви = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ВыборВетвиРепозитория", Ложь);
	Если ДоступенВыборВетви Тогда
		ОтветСервера = ОбработатьПолучениеДанныхGITНаСервере("/repos/1cdevelopexite/FlexibleSetting/branches", Новый Массив);
		Если ТипЗнч(ОтветСервера) = Тип("Массив") Тогда
			Для Каждого Ветвь Из ОтветСервера Цикл
				ИмяВетви = Ветвь.Получить("name");
				Если ИмяВетви <> Неопределено тогда
					Элементы.ВетвьРепозитория.СписокВыбора.Добавить(ИмяВетви);
				КонецЕсли;
			КонецЦикла;
			
			Если Элементы.ВетвьРепозитория.СписокВыбора.НайтиПоЗначению("master") <> Неопределено Тогда
				ВетвьРепозитория = "master";
				ОбновитьТабличнуюЧасть();
			Иначе
				ЭКОМ_ОбщегоНазначенияКлиент.СообщитьПользователю("Выберите ветвь репозитория для загрузки настроек");
			КонецЕсли;
		КонецЕсли;
	Иначе
		Элементы.ВетвьРепозитория.Видимость = Ложь;
		ОбновитьТабличнуюЧасть();
	КонецЕсли;
	
	ЭтаФорма.ФильтрПоКонфигурации = ЭКОМ_ОбщегоНазначения.ПолучитьКраткуюИнформацияОКонфигурации();
	СписокПараметровОтбора.Добавить(ЭтаФорма.ФильтрПоКонфигурации, "Конфигурация");
	
	ТипыОбмена = Новый Массив;
	ЭКОМ_ОбменСеть = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ОбменСеть");	
	Если ЭКОМ_ОбменСеть = Истина Тогда
		ТипыОбмена.Добавить("Покупатель");
	КонецЕсли;
	
	ЭКОМ_ОбменПоставщик = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ОбменПоставщик");
	Если ЭКОМ_ОбменПоставщик = Истина Тогда
		ТипыОбмена.Добавить("Поставщик");
	КонецЕсли;

	Если ТипыОбмена.Количество() = 1 Тогда
	    ЭтаФорма.ФильтрПоТипуОбмена = ТипыОбмена[0];
	    СписокПараметровОтбора.Добавить(ЭтаФорма.ФильтрПоТипуОбмена, "ТипОбмена");
	КонецЕсли;
	
	Если Не ДоступенВыборВетви ИЛИ ЗначениеЗаполнено(ВетвьРепозитория) Тогда
		Фильтр();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	ОбновитьТабличнуюЧасть();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТабличнуюЧасть()
	ПараметрВетвь = ПолучитьПараметрВетвьРепозитория(ВетвьРепозитория);	
	
	ЭтаФорма.ТабличноеПоле.Очистить();
	
	КомандаЗапроса = "";
	Если ЭтаФорма.ТипГибкихНастроек = "Исходящие настройки" Тогда
	     КомандаЗапроса    = "/repos/1cdevelopexite/FlexibleSetting/contents/Out" + ПараметрВетвь;
	ИначеЕсли ЭтаФорма.ТипГибкихНастроек = "Входящие настройки" Тогда
	     КомандаЗапроса    = "/repos/1cdevelopexite/FlexibleSetting/contents/In" + ПараметрВетвь;
    ИначеЕсли ЭтаФорма.ТипГибкихНастроек = "Настройки по созданию документов" Тогда
	     КомандаЗапроса    = "/repos/1cdevelopexite/FlexibleSetting/contents/DocumentCreation" + ПараметрВетвь;
	ИначеЕсли ЭтаФорма.ТипГибкихНастроек = "Настройки табличной части" Тогда	
	     КомандаЗапроса    = "/repos/1cdevelopexite/FlexibleSetting/contents/TablePart" + ПараметрВетвь;
	ИначеЕсли ЭтаФорма.ТипГибкихНастроек = "Настройки по подписке документов" Тогда	
	     КомандаЗапроса    = "/repos/1cdevelopexite/FlexibleSetting/contents/DocumentSubscription" + ПараметрВетвь;	
	КонецЕсли;
	
	Если КомандаЗапроса = "" Тогда
		
		Сообщение = Новый СообщениеПользователю;		
		Сообщение.Текст = "Не выбран тип гибких настроек";
		Сообщение.Сообщить();
		
	Иначе
		МассивЛогаСобытий = Новый Массив;
		ОтветСервера = ОбработатьПолучениеДанныхGITНаСервере(КомандаЗапроса, МассивЛогаСобытий);
		
		ОтмечатьИзмененныеШаблоны = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ОтмечатьИзмененныеШаблоны", Ложь);
		ИспользоватьПредставления = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ИспользоватьПредставленияШаблонов", Истина);
		МассивИзмененных = Новый Массив;
		СоответствиеПредставлений = Новый Соответствие;
		Если ОтмечатьИзмененныеШаблоны ИЛИ ИспользоватьПредставления Тогда
			ПрочиеФайлы = ОбработатьПолучениеДанныхGITНаСервере("/repos/1cdevelopexite/FlexibleSetting/contents/Other"  + ПараметрВетвь, МассивЛогаСобытий);
			
			Если ТипЗнч(ПрочиеФайлы) = Тип("Массив") Тогда
				Для Каждого ФайлСоответствие Из ПрочиеФайлы Цикл
					НаименованиеФайла = ФайлСоответствие.Получить("name");
					ПутьКФайлу        = ФайлСоответствие.Получить("path");
					Если НаименованиеФайла = "ChangedFiles.txt" И ОтмечатьИзмененныеШаблоны Тогда
						МассивИзмененных = ПолучитьИнформациюОбИзмененныхШаблонах(ПутьКФайлу);					
					ИначеЕсли НаименованиеФайла = "SettingsRepresentation.txt" И ИспользоватьПредставления Тогда
						СоответствиеПредставлений = СоответствиеПредставленийГибкихНастроек(ПутьКФайлу);					
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		СоответствияТиповОбмена  = Новый Соответствие;
		СоответствияКонфигурации = Новый Соответствие;
		СоответствияПоОперациям  = Новый Соответствие;
		СоответствияПоВерсиям    = Новый Соответствие;

		Если ТипЗнч(ОтветСервера) = Тип("Массив") Тогда
			
			Для каждого Стр Из ОтветСервера Цикл
				НаименованиеФайла = Стр.Получить("name");
				
				Результат = Новый Массив;
				Строка  = НаименованиеФайла;
				Позиция = Найти(НаименованиеФайла, "_");
				Пока Позиция > 0 Цикл
					Подстрока = Лев(Строка, Позиция - 1);
					Результат.Добавить(Подстрока);
					Строка    = Сред(Строка, Позиция + 1);
					Позиция   = Найти(Строка, "_");
				КонецЦикла;
				
				ТипОбмена    = СтрЗаменить(Строка, ".xml", "");
				ТипОбмена    = СтрЗаменить(ТипОбмена, ".txt", "");
				
				Если Результат.Количество() = 3 Тогда
					Конфигурация   = Результат.Получить(Результат.Количество()-1);
					ДатаЗаписи     = Результат.Получить(Результат.Количество()-2);
					ТипОперации    = Результат.Получить(0);
					ВерсияНастроек = "1.12.0";
				Иначе	
					Конфигурация   = Результат.Получить(Результат.Количество()-1);
					ДатаЗаписи     = Результат.Получить(Результат.Количество()-2);
					ТипОперации    = Результат.Получить(0);
					ВерсияНастроек = Результат.Получить(1);
				КонецЕсли;

				НовСтр = ЭтаФорма.ТабличноеПоле.Добавить();
				
				ИмяДоИзменений = НаименованиеФайла;
				ПредставлениеФайла = СоответствиеПредставлений.Получить(НаименованиеФайла); 
				Если ПредставлениеФайла <> Неопределено  Тогда
					Если ПредставлениеФайла.Количество() >= 2 И ПредставлениеФайла[1] <> "" Тогда
						НаименованиеФайла = ПредставлениеФайла[1];  
					КонецЕсли;
					Если ПредставлениеФайла.Количество() >= 3 И ПредставлениеФайла[2] <> "" Тогда
						ДатаЗаписи = ПредставлениеФайла[2];       
					КонецЕсли;
					Если ПредставлениеФайла.Количество() >= 4 И ПредставлениеФайла[3] <> "" Тогда    
						ВерсияНастроек = ПредставлениеФайла[3];
					КонецЕсли;
				КонецЕсли;
				
				Если МассивИзмененных.Найти(ИмяДоИзменений) <> Неопределено Тогда
					НаименованиеФайла = "new " + НаименованиеФайла;
				КонецЕсли;	
				НовСтр.НаименованиеФайла = НаименованиеФайла;
				НовСтр.ТипОбмена         = ТипОбмена;
				НовСтр.Конфигурация      = Конфигурация;
				НовСтр.ДатаЗаписи        = ДатаЗаписи;
				НовСтр.ТипОперации       = ТипОперации;
				НовСтр.path              = Стр.Получить("path");
				НовСтр.ВерсияНастроек    = ВерсияНастроек;
				
				СоответствияТиповОбмена.Вставить(ТипОбмена, ТипОбмена);
				СоответствияКонфигурации.Вставить(Конфигурация, Конфигурация);
				СоответствияПоОперациям.Вставить(ТипОперации, ТипОперации);
				СоответствияПоВерсиям.Вставить(ВерсияНастроек, ВерсияНастроек);

			КонецЦикла;
			
		КонецЕсли;
		
		Элементы.ФильтрПоТипуОбмена.СписокВыбора.Очистить();
		Для каждого Стр Из СоответствияТиповОбмена Цикл
			Элементы.ФильтрПоТипуОбмена.СписокВыбора.Добавить(Стр.Ключ);
		КонецЦикла;
		Элементы.ФильтрПоТипуОбмена.СписокВыбора.СортироватьПоЗначению();
		
		Элементы.ФильтрПоКонфигурации.СписокВыбора.Очистить();
		Для каждого Стр Из СоответствияКонфигурации Цикл
			Элементы.ФильтрПоКонфигурации.СписокВыбора.Добавить(Стр.Ключ);
		КонецЦикла;
		Элементы.ФильтрПоКонфигурации.СписокВыбора.СортироватьПоЗначению();
		
		Элементы.ФильтрПоТипамОпераций.СписокВыбора.Очистить();
		Для каждого Стр Из СоответствияПоОперациям Цикл
			Элементы.ФильтрПоТипамОпераций.СписокВыбора.Добавить(Стр.Ключ);
		КонецЦикла;
		Элементы.ФильтрПоТипамОпераций.СписокВыбора.СортироватьПоЗначению();
		
		Элементы.ФильтрПоВерсииНастроек.СписокВыбора.Очистить();
		Для каждого Стр Из СоответствияПоВерсиям Цикл
			Элементы.ФильтрПоВерсииНастроек.СписокВыбора.Добавить(Стр.Ключ);
		КонецЦикла;
		Элементы.ФильтрПоВерсииНастроек.СписокВыбора.СортироватьПоЗначению();

		КопироватьДанныеФормы(ЭтаФорма.ТабличноеПоле, ЭтаФорма.ИсходнаяТЗ);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ОбработатьПолучениеДанныхGITНаСервере(КомандаЗапроса, МассивЛогаСобытий)
	
	ОтветСервера = ЭКОМ_ОбщегоНазначения.ПолучениеДанныхGITНаСервере(КомандаЗапроса, МассивЛогаСобытий);
	
	Возврат ОтветСервера;
	
КонецФункции

&НаКлиенте
Процедура ТабличноеПолеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = ЭтаФорма.ТабличноеПоле.НайтиПоИдентификатору(Элементы.ТабличноеПоле.ТекущаяСтрока);
	
	Если Поле.Имя = "ТабличноеПолеСкачатьНаДиск" Тогда
		СтандартнаяОбработка = Ложь;
		
		Если ЭтаФорма.ТипГибкихНастроек = "Исходящие настройки" 
			ИЛИ ЭтаФорма.ТипГибкихНастроек = "Входящие настройки"  
			ИЛИ ЭтаФорма.ТипГибкихНастроек = "Настройки по созданию документов" Тогда
			СкачатьНастройкуНаДиск(ТекущиеДанные.path, ".xml");		
		ИначеЕсли ЭтаФорма.ТипГибкихНастроек = "Настройки табличной части" 
			ИЛИ ЭтаФорма.ТипГибкихНастроек = "Настройки по подписке документов" Тогда			
			СкачатьНастройкуНаДиск(ТекущиеДанные.path, ".txt");	
		КонецЕсли;

   	ИначеЕсли Поле.Имя = "ТабличноеПолеЗагрузитьВБазу" Тогда
		СтандартнаяОбработка = Ложь;
		
		Если ЭтаФорма.ТипГибкихНастроек = "Исходящие настройки" Тогда
			ЗагрузитьНастройкуВДеревоЗначенийНаСервере(ТекущиеДанные.path, "СтруктураФайлаXMLИсходящие", ТекущиеДанные.НаименованиеФайла);
			
		ИначеЕсли ЭтаФорма.ТипГибкихНастроек = "Входящие настройки" Тогда
			ЗагрузитьНастройкуВДеревоЗначенийНаСервере(ТекущиеДанные.path, "СтруктураФайлаXMLВходящие", ТекущиеДанные.НаименованиеФайла);
			
		ИначеЕсли ЭтаФорма.ТипГибкихНастроек = "Настройки по созданию документов" Тогда
			ЗагрузитьНастройкуВДеревоЗначенийНаСервере(ТекущиеДанные.path, "СтруктураФайлаXMLДокументы", ТекущиеДанные.НаименованиеФайла);
			
		ИначеЕсли ЭтаФорма.ТипГибкихНастроек = "Настройки табличной части" Тогда
			ТекстЗапроса = ПрочитатьТекстЗапросаПодписки(ТекущиеДанные.path);
			
			ПараметрыВосстановления = Новый Структура;
			ПараметрыВосстановления.Вставить("НачалоКонстанты", "СлужебныйЗапросДляФормы"); 
			ПараметрыВосстановления.Вставить("ТипОперации", ТекущиеДанные.ТипОперации);
			ПараметрыВосстановления.Вставить("ТекстЗапроса", ТекстЗапроса);
			ПараметрыВосстановления.Вставить("НаименованиеФайла", ТекущиеДанные.НаименованиеФайла);

			ВосстановитьТекстЗапросаПодписки(ПараметрыВосстановления)
		
		ИначеЕсли ЭтаФорма.ТипГибкихНастроек = "Настройки по подписке документов" Тогда			
			ТекстПодписки = ПрочитатьТекстЗапросаПодписки(ТекущиеДанные.path);
			
			ПараметрыВосстановления = Новый Структура;
			ПараметрыВосстановления.Вставить("НачалоКонстанты", "СлужебныйЗапросДляПодписки"); 
			ПараметрыВосстановления.Вставить("ТипОперации", ?(ТекущиеДанные.ТипОперации = "Подписка на документы",ТекущиеДанные.ТипОперации + ТекущиеДанные.ТипОбмена, ТекущиеДанные.ТипОперации));
			ПараметрыВосстановления.Вставить("ТекстЗапроса", ТекстПодписки);
			ПараметрыВосстановления.Вставить("НаименованиеФайла", ТекущиеДанные.НаименованиеФайла);
			
			ВосстановитьТекстЗапросаПодписки(ПараметрыВосстановления)
			
		КонецЕсли;
   		
	КонецЕсли;
		
КонецПроцедуры

&Насервере
Процедура ВосстановитьТекстЗапросаПодписки(ПараметрыВосстановления)
	
	ИменаПрочихНастроек = Новый Соответствие;
	ИменаПрочихНастроек.Вставить("Запрос для сети", "Покупателя");
	ИменаПрочихНастроек.Вставить("Запрос для поставщика", "Поставщика");
	ИменаПрочихНастроек.Вставить("Запрос для прайс-листа", "ПрайсЛист");
	ИменаПрочихНастроек.Вставить("Запрос для неструктурированного документа", "Condra");
	ИменаПрочихНастроек.Вставить("Запрос для ЭТРН-Отправитель", "ЭТРН");
	
	ИменаПрочихНастроек.Вставить("Подписка на документыПокупатель", "ДокументовСеть");
	ИменаПрочихНастроек.Вставить("Подписка на документыПоставщик", "ДокументовПоставщик");
	//ИменаПрочихНастроек.Вставить("Прайс-листПодписка", "ПрайсЛист");	
	//ИменаПрочихНастроек.Вставить("Неструкт. докум.Подписка", "ДокументовCondra");	
	ИменаПрочихНастроек.Вставить("Подписка на документы (ЭТРН-отправитель)", "ДокументовЭТРН");
	
	КонецКонстанты = ИменаПрочихНастроек.Получить(ПараметрыВосстановления.ТипОперации);
	
	Если КонецКонстанты = Неопределено Тогда		
		Сообщить("Найстройки не загружены. Тип запроса не определен.");		
	Иначе
		ИмяТекстаЗапроса = ПараметрыВосстановления.НачалоКонстанты + ИменаПрочихНастроек.Получить(ПараметрыВосстановления.ТипОперации);	
		
		ТекстЗапроса = ПараметрыВосстановления.ТекстЗапроса;
		
		Если ЗначениеЗаполнено(ТекстЗапроса) тогда
			ОбъектЭтаОбработка = РеквизитФормыВЗначение("Объект");
			ОбъектЭтаОбработка.Настройка_Параметр_Записать("_" + ИмяТекстаЗапроса, ТекстЗапроса, "Служебный");
			Сообщить("Настройки загружены в базу по алгоритму - " + ПараметрыВосстановления.НаименованиеФайла);
			ОбновитьВсеРолиНаСервере();
		Иначе
			Сообщить("Найстройки не загружены. Текст запроса пустой.");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ОбновитьВсеРолиНаСервере()

	ОбъектЭтаОбработка = РеквизитФормыВЗначение("Объект");
	ОбъектЭтаОбработка.ОбновитьВсеРоли(Ложь);

КонецПроцедуры // ОбновитьВсеРолиНаСервере()

&НаКлиенте
Процедура СкачатьНастройкуНаДиск(ПутьКФайлу, ТипРасширения)
	
	ДанныеПоФайлу  = СкачатьГибкиеНастройкиНаGITНаСервере(ПутьКФайлу);
	СохранениеФайла(ДанныеПоФайлу.НаКлиенте, ДанныеПоФайлу.ИмяФайла, ТипРасширения);
		
КонецПроцедуры

&НаСервере
Функция СкачатьГибкиеНастройкиНаGITНаСервере(ПутьКФайлу)
	ПараметрВетвь = ПолучитьПараметрВетвьРепозитория(ВетвьРепозитория);
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");	
	ДанныеПоФайлу = ОбработкаОбъект.СкачатьГибкиеНастройкиНаGIT(ПутьКФайлу + ПараметрВетвь);
	
	Возврат ДанныеПоФайлу;
	
КонецФункции

&НаСервере
Функция ПолучитьИнформациюОбИзмененныхШаблонах(ПутьКФайлу)
	МассивИзмененных = Новый Массив; 
	ПараметрВетвь    = ПолучитьПараметрВетвьРепозитория(ВетвьРепозитория);
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");	
	ДанныеПоФайлу = ОбработкаОбъект.СкачатьГибкиеНастройкиНаGIT(ПутьКФайлу + ПараметрВетвь);
	
	ЧтениеТекста = Новый ЧтениеТекста(ДанныеПоФайлу.НаСервере, КодировкаТекста.UTF8);
	Строка = ЧтениеТекста.ПрочитатьСтроку();
	Пока Строка <> Неопределено Цикл
		МассивИзмененных.Добавить(Строка);		
		Строка = ЧтениеТекста.ПрочитатьСтроку();
	КонецЦикла;
	
	Возврат МассивИзмененных;
КонецФункции

&НаСервере
Функция СоответствиеПредставленийГибкихНастроек(ПутьКФайлу)
	Результат = Новый Соответствие; 
	ПараметрВетвь    = ПолучитьПараметрВетвьРепозитория(ВетвьРепозитория);
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");	
	ДанныеПоФайлу = ОбработкаОбъект.СкачатьГибкиеНастройкиНаGIT(ПутьКФайлу + ПараметрВетвь);
	
	ЧтениеТекста = Новый ЧтениеТекста(ДанныеПоФайлу.НаСервере, КодировкаТекста.UTF8);
	Строка = ЧтениеТекста.ПрочитатьСтроку();
	Пока Строка <> Неопределено Цикл
		МассивСтрок = ЭКОМ_ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Строка, "|", Ложь);
		Если МассивСтрок.Количество() > 1  Тогда
			Результат.Вставить(МассивСтрок[0], МассивСтрок);
		КонецЕсли;
		Строка = ЧтениеТекста.ПрочитатьСтроку();
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура СохранениеФайла(АдресВоВременномХранилище, ИмяСохранения, ТипРасширения)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	// создаем на клиенте текстовый файл
	ИмяВременногоФайлаXML = ПолучитьИмяВременногоФайла(ТипРасширения);
	
    Если ДвоичныеДанные = Неопределено Тогда
        ПоказатьПредупреждение(Новый ОписаниеОповещения, "Не удалось получить данные настроек из временного хранилища", , "Сохранение в файл");
        Возврат;
	КонецЕсли;
	
	Если ТипРасширения = ".xml" Тогда
	     Фильтр = ИмяСохранения + "(*.xml)|*.xml";
	Иначе	
	     Фильтр = ИмяСохранения + "(*.txt)|*.txt"; 
	КонецЕсли;

	// создаем диалог сохранения файла
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогОткрытияФайла.Заголовок          = "Сохраните файл";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Расширение         = ТипРасширения;
    ДиалогОткрытияФайла.Фильтр             = Фильтр;
	ДиалогОткрытияФайла.ИндексФильтра      = 0; //укажем фильтр по умолчанию (нумерация с нуля)
	
	ДиалогОткрытияФайла.ПолноеИмяФайла = ИмяСохранения;
	
	ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("ЗавершениеДиалогаВыбораФайлаСохранение", ЭтаФорма, ДвоичныеДанные));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеДиалогаВыбораФайлаСохранение(ВыбранныеФайлы, ДвоичныеДанные) Экспорт
    
	Если ВыбранныеФайлы = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Отмена сохранения файла";	
		Сообщение.Сообщить();

        Возврат;
    КонецЕсли;
    
    ВсегоФайлов = ВыбранныеФайлы.Количество();
    Прогресс = 0;
    ТекущийНомерФайла = 0;
	Если ВыбранныеФайлы <> Неопределено Или ТипЗнч(ВыбранныеФайлы) = Тип("Массив") Тогда
        Для каждого ИмяФайла Из ВыбранныеФайлы Цикл
            ТекущийНомерФайла = ТекущийНомерФайла + 1;
            Попытка
                Прогресс = Окр(ТекущийНомерФайла * 100 / ВсегоФайлов, 0);
                ДвоичныеДанные.Записать(ИмяФайла);
            Исключение
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка записи в файл [" + "] " + ИмяФайла;	
				Сообщение.Сообщить();
			
            КонецПопытки;
            Состояние("Сохранено в " + ИмяФайла, Прогресс,, БиблиотекаКартинок.ЭКОМ_Информация);
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Настройки сохранены на диск  - " + ИмяФайла;	
			Сообщение.Сообщить();
			
        КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкуВДеревоЗначенийНаСервере(ПутьКФайлу, ИмяДереваЗначений, НаименованиеФайла)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ДЗ = ДанныеФормыВЗначение(ЭтаФорма[ИмяДереваЗначений], Тип("ДеревоЗначений"));
	
	ПараметрВетвь = ПолучитьПараметрВетвьРепозитория(ВетвьРепозитория);
	ОбработкаОбъект.ЗагрузитьНастройкуВДеревоЗначений(ПутьКФайлу + ПараметрВетвь, ДЗ, НаименованиеФайла, ИмяДереваЗначений); //Docrobot 1.21.0 MOD-280 [Добавлено ИмяДереваЗначений]
		
	ЗначениеВРеквизитФормы(ДЗ, ИмяДереваЗначений);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Структура = Новый Структура; 
    Структура.Вставить("СтруктураФайлаXMLИсходящие", ЭтаФорма.СтруктураФайлаXMLИсходящие);
	Структура.Вставить("СтруктураФайлаXMLВходящие" , ЭтаФорма.СтруктураФайлаXMLВходящие);
	Структура.Вставить("СтруктураФайлаXMLДокументы", ЭтаФорма.СтруктураФайлаXMLДокументы);
	
	ЭтаФорма.Закрыть(Структура);

КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоКонфигурацииПриИзменении(Элемент)
	СписокПараметровОтбора.Добавить(ЭтаФорма.ФильтрПоКонфигурации, "Конфигурация");
	Фильтр();
КонецПроцедуры

&НаСервере
Процедура Фильтр()
	
	ТЗ = ДанныеФормыВЗначение(ЭтаФорма.ИсходнаяТЗ, Тип("ТаблицаЗначений"));
	
	ПараметрыОтбора = Новый Структура;
	Для каждого Стр Из СписокПараметровОтбора Цикл
		Если ЗначениеЗаполнено(Стр.Значение) Тогда
		     ПараметрыОтбора.Вставить(Стр.Представление, Стр.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.ТабличноеПоле.Очистить();
	Если НЕ ПараметрыОтбора.Количество() = 0 Тогда
		Результат = ТЗ.НайтиСтроки(ПараметрыОтбора);	
		Для Каждого Выборка Из Результат Цикл
			НовСтр = ЭтаФорма.ТабличноеПоле.Добавить();		
			ЗаполнитьЗначенияСвойств(НовСтр, Выборка);	
		КонецЦикла;
		
	Иначе
		КопироватьДанныеФормы(ЭтаФорма.ИсходнаяТЗ, ЭтаФорма.ТабличноеПоле);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоКонфигурацииОчистка(Элемент, СтандартнаяОбработка)
	ОчисткаТабличногоПоля("Конфигурация");
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоТипуОбменаПриИзменении(Элемент)
	СписокПараметровОтбора.Добавить(ЭтаФорма.ФильтрПоТипуОбмена, "ТипОбмена");
	Фильтр();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоТипуОбменаОчистка(Элемент, СтандартнаяОбработка)
	ОчисткаТабличногоПоля("ТипОбмена");
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаТабличногоПоля(ТипФильтра)
	
	КопияСписокПараметровОтбора = СписокПараметровОтбора.Скопировать();
	Для каждого Стр Из КопияСписокПараметровОтбора Цикл
	    Если Стр.Представление = ТипФильтра Тогда
			ЭлСтр = СписокПараметровОтбора.НайтиПоЗначению(Стр.Значение);
			СписокПараметровОтбора.Удалить(ЭлСтр);
  		КонецЕсли;			
	КонецЦикла;		
	Фильтр();
	
КонецПроцедуры

&НаКлиенте
Функция ПрочитатьТекстЗапросаПодписки(ПутьКФайлу) Экспорт
	
	Текст = Неопределено;
	
	ДанныеПоФайлу  = СкачатьГибкиеНастройкиНаGITНаСервере(ПутьКФайлу);	
		
	ВременныйКаталог = КаталогВременныхФайлов() + "TempECOM" + ПолучитьРазделительПути();
	ПолноеИмяФайлаXML = ВременныйКаталог + ДанныеПоФайлу.ИмяФайла;
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДанныеПоФайлу.НаКлиенте);
	ДвоичныеДанные.Записать(ПолноеИмяФайлаXML);
	
	Файл = Новый Файл(ПолноеИмяФайлаXML);
	Если Файл.Существует() Тогда
		Если НРег(Файл.Расширение) = ".txt" Тогда
			ЧтениеТекста =  Новый ЧтениеТекста(ПолноеИмяФайлаXML, КодировкаТекста.UTF8);
			Текст = ЧтениеТекста.Прочитать();
			ЧтениеТекста.Закрыть();
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Формат <" + НРег(Файл.Расширение) + "> не поддерживается!";
			Сообщение.Сообщить(); 
				
		КонецЕсли;
		УдалитьФайлы(ПолноеИмяФайлаXML);
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

&НаКлиенте
Процедура ФильтрПоТипамОперацийПриИзменении(Элемент)
	СписокПараметровОтбора.Добавить(ЭтаФорма.ФильтрПоТипамОпераций, "ТипОперации");
	Фильтр();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоТипамОперацийОчистка(Элемент, СтандартнаяОбработка)
	ОчисткаТабличногоПоля("ТипОперации");
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоВерсииНастроекПриИзменении(Элемент)
	СписокПараметровОтбора.Добавить(ЭтаФорма.ФильтрПоВерсииНастроек, "ВерсияНастроек");
	Фильтр();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоВерсииНастроекОчистка(Элемент, СтандартнаяОбработка)
	ОчисткаТабличногоПоля("ВерсияНастроек");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрВетвьРепозитория(ВетвьРепозитория)
	ДоступенВыборВетви = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ВыборВетвиРепозитория", Ложь);
	ПараметрВетвь = "";
	Если ДоступенВыборВетви Тогда
		Если ВетвьРепозитория = "" Тогда
			ЭКОМ_ОбщегоНазначения.СообщитьПользователю("Не выбрана ветвь репозитория github");
			ПараметрВетвь = Неопределено;
		КонецЕсли;     		
		ПараметрВетвь = "?ref=" + ВетвьРепозитория;
	КонецЕсли;
	
	Возврат ПараметрВетвь;
КонецФункции

&НаКлиенте
Процедура ВетвьРепозиторияПриИзменении(Элемент)
	ОбновитьТабличнуюЧасть();
	Фильтр();
КонецПроцедуры
