
Процедура ПриЗаписи(Отказ, Замещение)
	
	ИзменитьСтатусы();
	
КонецПроцедуры

Процедура ИзменитьСтатусыДляПоставщика()
	
	ИмяРегистраЦепочки = "ЭКОМ_ЦепочкиДокументовПоставщика";
	Если НЕ Метаданные.РегистрыСведений.Найти(ИмяРегистраЦепочки) = Неопределено Тогда
		
		//ЮЗД         
		МетаданныеРегистра = Метаданные.РегистрыСведений[ИмяРегистраЦепочки];
		ТипСЧФ = МетаданныеРегистра.Измерения.Найти("СЧФ").Тип;
		
		Для Каждого ТекущаяЗапись Из ЭтотОбъект Цикл
			
			ДанныеОтбора = Новый Структура;
            ДанныеОтбора.Вставить("ORDERDATE"  , ТекущаяЗапись.ЗаказДата);
			ДанныеОтбора.Вставить("ORDERNUMBER", ТекущаяЗапись.ЗаказНомер);
			ДанныеОтбора.Вставить("Организация", ТекущаяЗапись.Организация);
			ДанныеОтбора.Вставить("Контрагент", ТекущаяЗапись.Контрагент);
			
			Если ТипЗнч(ТекущаяЗапись.Документ_Основание) = Тип("ДокументСсылка.ЭКОМ_Документы") Тогда			
				ДанныеОтбора.Вставить("ТочкаДоставки", ТекущаяЗапись.Документ_Основание.ТочкаДоставки);		
			КонецЕсли;
						
			//ORDRSP Исходящий
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ORDRSP_Исходящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_ORDRSP", ТекущаяЗапись.СтатусЭлектронногоДокумента);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				Если ТипЗнч(ТекущаяЗапись.Документ_Основание) = Тип("ДокументСсылка.ЭКОМ_Документы")
					И ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ORDRSP_Исходящий Тогда
					
					Измерение = "ORDER";
				Иначе   
					
					ТипЗаказа 		= МетаданныеРегистра.Измерения.Найти("Заказ").Тип;
					ТипРеализации 	= МетаданныеРегистра.Измерения.Найти("Накладная").Тип;
					Если (ТипЗнч(ТипЗаказа) = Тип("ОписаниеТипов")
						И ТипЗаказа.СодержитТип(ТипЗнч(ТекущаяЗапись.Документ_Основание)))
						ИЛИ ТипЗнч(ТекущаяЗапись.Документ_Основание) = ТипЗаказа Тогда
						Измерение = "Заказ";
					ИначеЕсли (ТипЗнч(ТипРеализации) = Тип("ОписаниеТипов")
						И ТипРеализации.СодержитТип(ТипЗнч(ТекущаяЗапись.Документ_Основание)))
						ИЛИ ТипЗнч(ТекущаяЗапись.Документ_Основание) = ТипРеализации Тогда
						Измерение = "Накладная";
					Иначе                                                          
						ТекстЛогаСобытий = "Не найдено измерение для установки отбора по документу-основанию " + Строка(ТекущаяЗапись.Документ_Основание);
						ЭКОМ_ОбщегоНазначения.ЗаписатьСтрокуЛогаСобытийвРегистрЛогирование(
						ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(
						ТекстЛогаСобытий,
						Перечисления.ЭКОМ_УровниЛогирования.Ошибка,
						"Добавление/редактирование записи регистра сведений " + ИмяРегистраЦепочки));
						Возврат;
					КонецЕсли;
					
				КонецЕсли;
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента(ИмяРегистраЦепочки, Измерение, ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
			
			//DESADV Исходящий
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DESADV_Исходящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_DESADV", ТекущаяЗапись.СтатусЭлектронногоДокумента);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента(ИмяРегистраЦепочки, "Накладная", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
			
			//RETORD Исходящий //Docrobot 1.21.0 MOD-1648
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.RETORD_Исходящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_RETORD", ТекущаяЗапись.СтатусЭлектронногоДокумента);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента(ИмяРегистраЦепочки, "ORDER", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
			
			//DESSCC Исходящий
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DESSCC_Исходящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_DESSCC", ТекущаяЗапись.СтатусЭлектронногоДокумента);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента(ИмяРегистраЦепочки, "Накладная", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
						
			//RETINS Исходящий
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.RETINS_Исходящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_RETINS", ТекущаяЗапись.СтатусЭлектронногоДокумента);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента(ИмяРегистраЦепочки, "ВозвратнаяНакладная", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
									
			//INVOICE Исходящий
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.INVOICE Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_INVOICE", ТекущаяЗапись.СтатусЭлектронногоДокумента);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента(ИмяРегистраЦепочки, "Накладная", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
			
			//STATUS Входящий
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.STATUS 
				И ТекущаяЗапись.НаправлениеОбмена = Перечисления.ЭКОМ_НаправлениеОбмена.Входящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_STATUS", ТекущаяЗапись.СтатусЭлектронногоДокумента);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента(ИмяРегистраЦепочки, "ORDER", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
			
			//DP_REZRUISP Исходящий
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_REZRUISP_Исходящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_DP_REZRUISP", ТекущаяЗапись.СтатусЭлектронногоДокумента);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента(ИмяРегистраЦепочки, "Накладная", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
			
			//DP_REZRUZAK Входящий
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_REZRUZAK_Входящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_DP_REZRUZAK", ТекущаяЗапись.СтатусЭлектронногоДокумента);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента(ИмяРегистраЦепочки, "Накладная", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
			
			//RETANN Входящий
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.RETANN_Входящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_RETANN", ТекущаяЗапись.СтатусЭлектронногоДокумента);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента(ИмяРегистраЦепочки, "RETANN", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
			
			Если ТипСЧФ.СодержитТип(ТипЗнч(ТекущаяЗапись.Документ_Основание)) Тогда	
				
				ВидыДокументовЮЗД = Новый Массив;
				ЭКОМ_ОбщегоНазначения.ПолучитьПервичныеВидыДокументовЮЗД(ВидыДокументовЮЗД);

				ВидыДокументовКоррИспрЮЗД = Новый Массив;
				ЭКОМ_ОбщегоНазначения.ПолучитьКорректировочныеВидыДокументовЮЗД(ВидыДокументовКоррИспрЮЗД);
				ЭКОМ_ОбщегоНазначения.ПолучитьИсправительныеВидыДокументовЮЗД(ВидыДокументовКоррИспрЮЗД);
								
				Результат = ПолучитьСтатусЮЗД(ИмяРегистраЦепочки, ТекущаяЗапись);
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("СчитатьКоличествоКвитанций", Результат.СчитатьКоличествоКвитанций); 
				ДанныеРесурсов.Вставить("СтатусЮЗД",                  Результат.СтатусЮЗД);

				Если НЕ ВидыДокументовЮЗД.Найти(ТекущаяЗапись.ВидДокумента) = Неопределено Тогда				
					ДанныеРесурсов.Вставить("ИдентификаторСчФ", ТекущаяЗапись.Идентификатор);
										
				ИначеЕсли НЕ ВидыДокументовКоррИспрЮЗД.Найти(ТекущаяЗапись.ВидДокумента) = Неопределено Тогда				
					ДанныеРесурсов.Вставить("ИдентификаторСчФ_Кор", ТекущаяЗапись.Идентификатор);
					
				КонецЕсли;	
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента(ИмяРегистраЦепочки, "СЧФ", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
                ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента(ИмяРегистраЦепочки, "СЧФ_Кор", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);

			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьСтатусыДляСети()
	
	ИмяРегистраЦепочки = "ЭКОМ_ЦепочкиДокументовПокупателя";
	Если НЕ Метаданные.РегистрыСведений.Найти(ИмяРегистраЦепочки) = Неопределено Тогда
		
		//ЮЗД
		Тип_ДокументЭКОМ = Метаданные.РегистрыСведений[ИмяРегистраЦепочки].Измерения.Найти("ЮЗД").Тип;
		
		Для Каждого ТекущаяЗапись Из ЭтотОбъект Цикл
			
			ДанныеОтбора = Новый Структура;
            ДанныеОтбора.Вставить("ORDERDATE"  , ТекущаяЗапись.ЗаказДата);
			ДанныеОтбора.Вставить("ORDERNUMBER", ТекущаяЗапись.ЗаказНомер);
			ДанныеОтбора.Вставить("Организация", ТекущаяЗапись.Организация);
			ДанныеОтбора.Вставить("Контрагент", ТекущаяЗапись.Контрагент);

			//ORDER Исходящий
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ORDER_Исходящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_ORDER", ТекущаяЗапись.СтатусЭлектронногоДокумента);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента(ИмяРегистраЦепочки, "Заказ", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
				
			//RECADV Исходящий
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.RECADV_Исходящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_RECADV", ТекущаяЗапись.СтатусЭлектронногоДокумента);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента(ИмяРегистраЦепочки, "Накладная", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
						
			//RETANN Исходящий
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.RETANN_Исходящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_RETANN", ТекущаяЗапись.СтатусЭлектронногоДокумента);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента(ИмяРегистраЦепочки, "ВозвратнаяНакладная", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
			
			//STATUS Исходящий
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.STATUS 
				И ТекущаяЗапись.НаправлениеОбмена = Перечисления.ЭКОМ_НаправлениеОбмена.Исходящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_STATUS", ТекущаяЗапись.СтатусЭлектронногоДокумента);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента(ИмяРегистраЦепочки, "Заказ", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
			
			//INVOICE Входящий
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.INVOICE 
				И ТекущаяЗапись.НаправлениеОбмена = Перечисления.ЭКОМ_НаправлениеОбмена.Входящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_INVOICE", ТекущаяЗапись.СтатусЭлектронногоДокумента);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента(ИмяРегистраЦепочки, "INVOICE", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
			
			//ЮЗД Входящая  
			Если Тип_ДокументЭКОМ.СодержитТип(ТипЗнч(ТекущаяЗапись.Документ_Основание))
				И ЭКОМ_ОбщегоНазначения.ОтноситсяКЮЗД(ТекущаяЗапись.Документ_Основание.ВидДокумента)     Тогда //Docrobot 29.11.21 MOD-1451 [получение статуса ЮЗД по приоритету]
				
				Результат = ПолучитьСтатусЮЗД(ИмяРегистраЦепочки, ТекущаяЗапись);
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("СчитатьКоличествоКвитанций", Результат.СчитатьКоличествоКвитанций); 
				ДанныеРесурсов.Вставить("СтатусЮЗД",                  Результат.СтатусЮЗД);
					
				Если Результат.ЭтоЮЗД = Истина Тогда
				    ДанныеРесурсов.Вставить("ИдентификаторСчФ", ТекущаяЗапись.Идентификатор);						
				КонецЕсли;
								
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента(ИмяРегистраЦепочки, "ЮЗД", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
				
			КонецЕсли;
			
			//RETINS Входящий
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.RETINS_Входящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_RETINS", ТекущаяЗапись.СтатусЭлектронногоДокумента);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента(ИмяРегистраЦепочки, "RETINS", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
			
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ИзменитьСтатусыДляЭТРН()
	
	Если НЕ Метаданные.РегистрыСведений.Найти("ЭКОМ_ЦепочкиДокументовЭТРН") = Неопределено Тогда
		Для Каждого ТекущаяЗапись Из ЭтотОбъект Цикл
			
			ДанныеОтбора = Новый Структура;
   						
			//WHGOV_01_Исходящий - Отправитель
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.WHGOV_01_Исходящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_WHGOV_01", Истина);
				ДанныеРесурсов.Вставить("ТекстОшибки"    , ТекущаяЗапись.ТекстОшибки);
				ДанныеРесурсов.Вставить("ИдФайлПервичн"  , ТекущаяЗапись.Идентификатор);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента("ЭКОМ_ЦепочкиДокументовЭТРН", "Накладная", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
				
			КонецЕсли;
						
			//DRVGOV_02_Исходящий - Перевозчик
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DRVGOV_02_Исходящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_DRVGOV_02", Истина);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента("ЭКОМ_ЦепочкиДокументовЭТРН", "ДокументЭКОМ", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
			
			//DRVGOV_02_Входящий - Отправитель и получатель
			//Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DRVGOV_02_Входящий Тогда
			//	
			//	ДанныеРесурсов = Новый Структура;
			//	ДанныеРесурсов.Вставить("Статус_DRVGOV_02", Истина);
			//	ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
			//	
			//	ЭКОМ_ТипОбменаЭТРН_Отправитель = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ТипОбменаЭТРН_Отправитель", Ложь);
			//	Если ЭКОМ_ТипОбменаЭТРН_Отправитель = Истина Тогда
			//		ИмяДокумента = "Накладная";
			//	Иначе	
			//		ИмяДокумента = "ДокументЭКОМ";
			//	КонецЕсли;
			//	
			//	ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента("ЭКОМ_ЦепочкиДокументовЭТРН", ИмяДокумента, ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			//КонецЕсли;
			
			//DRVGOU_03_Входящий - Отправитель и получатель 
			//Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DRVGOU_03_Входящий Тогда
			//	
			//	ДанныеРесурсов = Новый Структура;
			//	ДанныеРесурсов.Вставить("Статус_DRVGOU_03", Истина);
			//	ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
			//	
			//	ЭКОМ_ТипОбменаЭТРН_Отправитель = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ТипОбменаЭТРН_Отправитель", Ложь);
			//	Если ЭКОМ_ТипОбменаЭТРН_Отправитель = Истина Тогда
			//		ИмяДокумента = "Накладная";
			//	Иначе	
			//		ИмяДокумента = "ДокументЭКОМ";
			//	КонецЕсли;
			//	
			//	ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента("ЭКОМ_ЦепочкиДокументовЭТРН", ИмяДокумента, ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			//КонецЕсли;
			
			//DRVGOU_03_Исходящий - Перевозчик
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DRVGOU_03_Исходящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_DRVGOU_03", Истина);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента("ЭКОМ_ЦепочкиДокументовЭТРН", "ДокументЭКОМ", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
						
			//WHGOU_04_Исходящий Отправитель
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.WHGOU_04_Исходящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_WHGOU_04", Истина);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента("ЭКОМ_ЦепочкиДокументовЭТРН", "Накладная", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
			
			//WHGPV_05_Входящий - Перевозчик 
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.WHGPV_05_Входящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_WHGPV_05", Истина);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента("ЭКОМ_ЦепочкиДокументовЭТРН", "ДокументЭКОМ", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
			
			//WHGPV_05_Исходящий - получатель 
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.WHGPV_05_Исходящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_WHGPV_05", Истина);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента("ЭКОМ_ЦепочкиДокументовЭТРН", "Накладная", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
			
			//DRVGPV_06_Входящий - Отправитель и получатель
			//Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DRVGPV_06_Входящий Тогда
			//	
			//	ДанныеРесурсов = Новый Структура;
			//	ДанныеРесурсов.Вставить("Статус_DRVGPV_06", Истина);
			//	ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
			//	
			//	ЭКОМ_ТипОбменаЭТРН_Отправитель = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ТипОбменаЭТРН_Отправитель", Ложь);
			//	Если ЭКОМ_ТипОбменаЭТРН_Отправитель = Истина Тогда
			//		ИмяДокумента = "Накладная";
			//	Иначе	
			//		ИмяДокумента = "ДокументЭКОМ";
			//	КонецЕсли;
			//	
			//	ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента("ЭКОМ_ЦепочкиДокументовЭТРН", ИмяДокумента, ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			//КонецЕсли;
			
			//DRVGPV_06_Исходящий - Перевозчик
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DRVGPV_06_Исходящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_DRVGPV_06", Истина);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента("ЭКОМ_ЦепочкиДокументовЭТРН", "ДокументЭКОМ", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
			
			//Статус_DRVGPU_07_Входящий - Отправитель и получатель 
			//Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DRVGPU_07_Входящий Тогда
			//	
			//	ДанныеРесурсов = Новый Структура;
			//	ДанныеРесурсов.Вставить("Статус_DRVGPU_07", Истина);
			//	ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
			//	
			//	ЭКОМ_ТипОбменаЭТРН_Отправитель = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ТипОбменаЭТРН_Отправитель", Ложь);
			//	Если ЭКОМ_ТипОбменаЭТРН_Отправитель = Истина Тогда
			//		ИмяДокумента = "Накладная";
			//	Иначе	
			//		ИмяДокумента = "ДокументЭКОМ";
			//	КонецЕсли;
			//	
			//	ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента("ЭКОМ_ЦепочкиДокументовЭТРН", ИмяДокумента, ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			//КонецЕсли;
			
			//Статус_DRVGPU_07_Исходящий - Перевозчик
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DRVGPU_07_Исходящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_DRVGPU_07", Истина);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента("ЭКОМ_ЦепочкиДокументовЭТРН", "ДокументЭКОМ", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
			
			//Статус_WHGPU_08_Входящий - Перевозчик и Отправитель 
			//Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.WHGPU_08_Входящий Тогда
			//	
			//	ДанныеРесурсов = Новый Структура;
			//	ДанныеРесурсов.Вставить("Статус_WHGPU_08", Истина);
			//	ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
			//	
			//	ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента("ЭКОМ_ЦепочкиДокументовЭТРН", "Накладная", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			//КонецЕсли;
			
			//Статус_WHGPU_08_Исходящий - получатель
			Если ТекущаяЗапись.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.WHGPU_08_Исходящий Тогда
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_WHGPU_08", Истина);
				ДанныеРесурсов.Вставить("ТекстОшибки", ТекущаяЗапись.ТекстОшибки);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента("ЭКОМ_ЦепочкиДокументовЭТРН", "Накладная", ТекущаяЗапись.Документ_Основание, ДанныеРесурсов, ДанныеОтбора);
			КонецЕсли;
			
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ИзменитьСтатусы()
	
	ЭКОМ_ОбменСеть      = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ОбменСеть"     , Ложь);
	ЭКОМ_ОбменПоставщик = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ОбменПоставщик", Ложь);
	ЭКОМ_ОбменЭТРН      = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ОбменЭТРН"     , Ложь);
	
	Если ЭКОМ_ОбменПоставщик = Истина  Тогда
		ИзменитьСтатусыДляПоставщика();			
	КонецЕсли;
	
	Если ЭКОМ_ОбменСеть = Истина Тогда
		ИзменитьСтатусыДляСети();		
	КонецЕсли;	
	
	Если ЭКОМ_ОбменЭТРН = Истина Тогда
		ИзменитьСтатусыДляЭТРН();					
	КонецЕсли;			
	
КонецПроцедуры

Функция ПолучитьСтатусЮЗД(ИмяРегистраЦепочки, ТекущаяЗапись)
	
	ВидДокумента      = ТекущаяЗапись.ВидДокумента; 
	НаправлениеОбмена = ТекущаяЗапись.НаправлениеОбмена;
	СтатусЮЗД         = Перечисления.ЭКОМ_Статусы.ПустаяСсылка();
	СчитатьКоличествоКвитанций = ЭтотОбъект.ДополнительныеСвойства.Свойство("ПерваяЗапись"); // Записываем первый раз запись регистра
	ЭтоЮЗД                     = ЭКОМ_ОбщегоНазначения.ОтноситсяКЮЗД(ВидДокумента);
	
	Если ИмяРегистраЦепочки = "ЭКОМ_ЦепочкиДокументовПоставщика" Тогда
		
		ДокФункция = Вычислить("ЭКОМ_ОбщегоНазначения.ПолучитьФункциюЮЗД(,ТекущаяЗапись.Контрагент)");
		
		Если ЭтоЮЗД = Истина Тогда		
			СчитатьКоличествоКвитанций = Ложь;
			СтатусЮЗД = Перечисления.ЭКОМ_Статусы.Отправлен;
			
		ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_PDPOL_02
			ИЛИ ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_IZVPOL_04
			ИЛИ ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_PDOTPR_03 Тогда
			
			СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ОжиданиеПодтверждения;			
			
		ИначеЕсли (ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_IZVPOL_06 
			ИЛИ ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_PDOTPR_08)  Тогда
			
			Если ДокФункция = "СЧФ" Тогда
				СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ПодписаноПокупателем;
			Иначе
				СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ОжиданиеПодтверждения;
			КонецЕсли;
			
		ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_UVUTOCH_09
			ИЛИ ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_IZVPOL_10
			ИЛИ ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_PDOTPR_13 Тогда
			
			СтатусЮЗД = Перечисления.ЭКОМ_Статусы.Уточнение_Получено;
			
		ИначеЕсли ЭКОМ_ОбщегоНазначения.ЯвляетсяПодписьюЮЗД(ВидДокумента)
			ИЛИ ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_REZRUZAK_Входящий Тогда
			
			СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ПодписаноПокупателем;
			
		ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_PRANNUL_22
			И НаправлениеОбмена = Перечисления.ЭКОМ_НаправлениеОбмена.Исходящий Тогда			
			СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ОтправленоАннулирование;
			
		ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_PRANNUL_22
			И НаправлениеОбмена = Перечисления.ЭКОМ_НаправлениеОбмена.Входящий Тогда			
			СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ПредложеноАннулирование;
			
		ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_IZVPOL_23 Тогда			
			СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ПринятоАннулирование;
			
		ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_UVUTOCH_24 Тогда		
			СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ОтклоненоАннулирование;
			
		КонецЕсли;
		
	//Docrobot 29.11.21 MOD-1451 [получение статуса ЮЗД по приоритету]
	ИначеЕсли ИмяРегистраЦепочки = "ЭКОМ_ЦепочкиДокументовПокупателя" Тогда	
		
			СчитатьКоличествоКвитанций = Ложь;
	
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА ЭКОМ_Объекты_События.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.DP_UVUTOCH_24)
			|				И ЭКОМ_Объекты_События.НаправлениеОбмена = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_НаправлениеОбмена.Исходящий)
			|			ТОГДА 13
			|		КОГДА ЭКОМ_Объекты_События.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.DP_UVUTOCH_24)
			|				И ЭКОМ_Объекты_События.НаправлениеОбмена = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_НаправлениеОбмена.Входящий)
			|			ТОГДА 12
			|		КОГДА ЭКОМ_Объекты_События.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.DP_IZVPOL_23)
			|				И ЭКОМ_Объекты_События.НаправлениеОбмена = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_НаправлениеОбмена.Исходящий)
			|			ТОГДА 11
			|		КОГДА ЭКОМ_Объекты_События.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.DP_IZVPOL_23)
			|				И ЭКОМ_Объекты_События.НаправлениеОбмена = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_НаправлениеОбмена.Входящий)
			|			ТОГДА 10
			|		КОГДА ЭКОМ_Объекты_События.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.DP_PRANNUL_22)
			|				И ЭКОМ_Объекты_События.НаправлениеОбмена = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_НаправлениеОбмена.Исходящий)
			|			ТОГДА 9
			|		КОГДА ЭКОМ_Объекты_События.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.DP_PRANNUL_22)
			|				И ЭКОМ_Объекты_События.НаправлениеОбмена = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_НаправлениеОбмена.Входящий)
			|			ТОГДА 8
			|		КОГДА ЭКОМ_Объекты_События.ВидДокумента В (ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPOK_11), ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPOKMARK_11), ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPOK_11), ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPOKMARK_11))
			|				И DP_UVUTOCH_09.Документ_Основание ЕСТЬ НЕ NULL 
			|			ТОГДА 7
			|		КОГДА ЭКОМ_Объекты_События.ВидДокумента В (ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPOK_11), ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPOKMARK_11), ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPOK_11), ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPOKMARK_11))
			|			ТОГДА 6
			|		КОГДА ЭКОМ_Объекты_События.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.DP_PDOTPR_13)
			|			ТОГДА 5
			|		КОГДА ЭКОМ_Объекты_События.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.DP_UVUTOCH_09)
			|			ТОГДА 4
			|		КОГДА (ВЫРАЗИТЬ(ЭКОМ_Объекты_События.Документ_Основание.Комментарий КАК СТРОКА(100))) <> """"
			|				И ЭКОМ_Объекты_События.Документ_Основание.СтатусОбработкиДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_Статусы.Обработан)
			|			ТОГДА 3
			|		КОГДА ЭКОМ_Объекты_События.Документ_Основание.СтатусОбработкиДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_Статусы.Обработан)
			|			ТОГДА 2
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК Приоритет
			|ПОМЕСТИТЬ ВТ_Приоритет
			|ИЗ
			|	РегистрСведений.ЭКОМ_Объекты_События КАК ЭКОМ_Объекты_События
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭКОМ_Объекты_События КАК DP_UVUTOCH_09
			|		ПО ((ВЫРАЗИТЬ(ЭКОМ_Объекты_События.Документ_Основание КАК Документ.ЭКОМ_Документы)) = (ВЫРАЗИТЬ(DP_UVUTOCH_09.Документ_Основание КАК Документ.ЭКОМ_Документы)))
			|			И (DP_UVUTOCH_09.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.DP_UVUTOCH_09))
			|ГДЕ
			|	(ВЫРАЗИТЬ(ЭКОМ_Объекты_События.Документ_Основание КАК Документ.ЭКОМ_Документы)) = &ДокументЮЗД
			|
			|СГРУППИРОВАТЬ ПО
			|	ВЫБОР
			|		КОГДА ЭКОМ_Объекты_События.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.DP_UVUTOCH_24)
			|				И ЭКОМ_Объекты_События.НаправлениеОбмена = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_НаправлениеОбмена.Исходящий)
			|			ТОГДА 13
			|		КОГДА ЭКОМ_Объекты_События.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.DP_UVUTOCH_24)
			|				И ЭКОМ_Объекты_События.НаправлениеОбмена = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_НаправлениеОбмена.Входящий)
			|			ТОГДА 12
			|		КОГДА ЭКОМ_Объекты_События.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.DP_IZVPOL_23)
			|				И ЭКОМ_Объекты_События.НаправлениеОбмена = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_НаправлениеОбмена.Исходящий)
			|			ТОГДА 11
			|		КОГДА ЭКОМ_Объекты_События.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.DP_IZVPOL_23)
			|				И ЭКОМ_Объекты_События.НаправлениеОбмена = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_НаправлениеОбмена.Входящий)
			|			ТОГДА 10
			|		КОГДА ЭКОМ_Объекты_События.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.DP_PRANNUL_22)
			|				И ЭКОМ_Объекты_События.НаправлениеОбмена = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_НаправлениеОбмена.Исходящий)
			|			ТОГДА 9
			|		КОГДА ЭКОМ_Объекты_События.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.DP_PRANNUL_22)
			|				И ЭКОМ_Объекты_События.НаправлениеОбмена = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_НаправлениеОбмена.Входящий)
			|			ТОГДА 8
			|		КОГДА ЭКОМ_Объекты_События.ВидДокумента В (ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPOK_11), ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPOKMARK_11), ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPOK_11), ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPOKMARK_11))
			|				И DP_UVUTOCH_09.Документ_Основание ЕСТЬ НЕ NULL 
			|			ТОГДА 7
			|		КОГДА ЭКОМ_Объекты_События.ВидДокумента В (ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPOK_11), ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPOKMARK_11), ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPOK_11), ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPOKMARK_11))
			|			ТОГДА 6
			|		КОГДА ЭКОМ_Объекты_События.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.DP_PDOTPR_13)
			|			ТОГДА 5
			|		КОГДА ЭКОМ_Объекты_События.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.DP_UVUTOCH_09)
			|			ТОГДА 4
			|		КОГДА (ВЫРАЗИТЬ(ЭКОМ_Объекты_События.Документ_Основание.Комментарий КАК СТРОКА(100))) <> """"
			|				И ЭКОМ_Объекты_События.Документ_Основание.СтатусОбработкиДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_Статусы.Обработан)
			|			ТОГДА 3
			|		КОГДА ЭКОМ_Объекты_События.Документ_Основание.СтатусОбработкиДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_Статусы.Обработан)
			|			ТОГДА 2
			|		ИНАЧЕ 1
			|	КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ВЫБОР
			|		КОГДА ВТ_Приоритет.Приоритет = 13
			|				ИЛИ ВТ_Приоритет.Приоритет = 12
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЭКОМ_Статусы.ОтклоненоАннулирование)
			|		КОГДА ВТ_Приоритет.Приоритет = 11
			|				ИЛИ ВТ_Приоритет.Приоритет = 10
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЭКОМ_Статусы.ПринятоАннулирование)
			|		КОГДА ВТ_Приоритет.Приоритет = 9
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЭКОМ_Статусы.ОтправленоАннулирование)
			|		КОГДА ВТ_Приоритет.Приоритет = 8
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЭКОМ_Статусы.ПредложеноАннулирование)
			|		КОГДА ВТ_Приоритет.Приоритет = 7
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЭКОМ_Статусы.ЗавершенСУточнением)
			|		КОГДА ВТ_Приоритет.Приоритет = 6
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЭКОМ_Статусы.ДокументооборотЗавершен)
			|		КОГДА ВТ_Приоритет.Приоритет = 5
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЭКОМ_Статусы.Уточнение_Получено)
			|		КОГДА ВТ_Приоритет.Приоритет = 4
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЭКОМ_Статусы.ОтправленоУточнение)
			|		КОГДА ВТ_Приоритет.Приоритет = 3
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЭКОМ_Статусы.Уточнение)
			|		КОГДА ВТ_Приоритет.Приоритет = 2
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЭКОМ_Статусы.ТребуетсяПодписатьУПД)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ЭКОМ_Статусы.НеОбработан)
			|	КОНЕЦ КАК СтатусЮЗД,
			|	ВТ_Приоритет.Приоритет КАК Приоритет
			|ИЗ
			|	ВТ_Приоритет КАК ВТ_Приоритет
			|
			|УПОРЯДОЧИТЬ ПО
			|	Приоритет УБЫВ";
			
			Запрос.УстановитьПараметр("ДокументЮЗД", ТекущаяЗапись.Документ_Основание);
			
			ВыборкаСтатусаЮЗД = Запрос.Выполнить().Выбрать();
			
			Если ВыборкаСтатусаЮЗД.Следующий() Тогда
				СтатусЮЗД = ВыборкаСтатусаЮЗД.СтатусЮЗД;
			Иначе 
				СтатусЮЗД = Перечисления.ЭКОМ_Статусы.НеОбработан;
			КонецЕсли;
						
		//Docrobot 29.11.21 MOD-1451 [получение статуса ЮЗД по приоритету]
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("СчитатьКоличествоКвитанций", СчитатьКоличествоКвитанций);
	Результат.Вставить("СтатусЮЗД",                  СтатусЮЗД);
	Результат.Вставить("ЭтоЮЗД",                     ЭтоЮЗД);
	
	Возврат Результат;
	
КонецФункции
