#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОписаниеПеременных

Перем ВременныеФайлы;

// Пространства имен (xmlns)
Перем xmlnsXML;
перем xmlnsV8XDTO;
Перем xmlnsОписанияТиповКлассификаторов;
Перем xmlnsКлассификатор;

Перем ФабрикаXDTOКлассификаторов;
Перем МассивОбщихПакетовXDTO;
Перем xdtoТипыКлассификаторов;

Перем МетаданныеКонфигурации;
Перем СвойстваОбъектовМетаданных;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Загружает классификатор из файла или временного хранилища.
//
// Параметры:
//  ИмяФайла - Строка - путь к файлу классификатора.
//  Хранение - Строка - адрес временного хранилища
//  УникальныйИдентификатор - УникальныйИдентификатор - 
//   уникальный идентификатор экземпляра формы,
//   из которой инициирована загрузка.
//
Процедура ДобавитьНовыйКлассификатор(ИмяФайла, Хранение, УникальныйИдентификатор) Экспорт
	
	Файл = Новый Файл(ИмяФайла);
	
	Если ЭтоАдресВременногоХранилища(Хранение) Тогда
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Файл.Расширение);
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(Хранение);
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		РабФайл = Новый Файл(ИмяВременногоФайла);
		ВременныеФайлы.Добавить(ИмяВременногоФайла);
		
	Иначе
		РабФайл = Файл;
	КонецЕсли;
	
    ДобавитьКлассификатор(РабФайл, УникальныйИдентификатор, РабФайл.ПолноеИмя);
	
КонецПроцедуры

// Записывает в базу загруженные классификаторы.
//
// Параметры:
//  Прогресс - Число - значение индикатора формы прогресса.
//
Процедура ЗаписатьКлассификаторы(Прогресс = 0) Экспорт
	
	xdtoТипКлассификатора = xdtoТипКлассификатора(ИдентификаторКлассификатора);
		
	ОбъектЗагрузки = ПолучитьСодержаниеКлассификатора(Истина);
		
	СохранитьКлассификатор(ОбъектЗагрузки,
		"ОбщероссийскийКлассификаторОсновныхФондов",
		УдалятьНеактуальные,
		Неопределено,
		"ОбщероссийскийКлассификаторОсновныхФондов",
		Прогресс);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает объект-описатель типа классификатора.
//
// Параметры:
//  Идентификатор - Строка; идентификатор типа.
//
// Возвращаемое значение:
//  ОбъектXDTO типа {xmlnsОписанияТиповКлассификаторов}ClassifierTypeType.
// Содержит свойства: xmlid - идентификатор (атрибут
// {http://www.w3.org/XML/1998/namespace}id), ИмяСправочника - строка
// (<catalog-name>), ИмяРеквизитаПолнНаименование - строка
// (<full-name-property>). 
//  Неопределено, если тип не найден.
//
Функция xdtoТипКлассификатора(Идентификатор) Экспорт
	Попытка
		МакетТипов ="<?xml version=""1.0"" encoding=""Windows-1251""?>
					|<classifier-type-list xmlns=""urn:uuid:101fa9a0-ea86-11dc-afc4-0002a5d5c51b"">
					|	<classifier-type xml:id=""ОКОФ"">
					|		<catalog-name>ОбщероссийскийКлассификаторОсновныхФондов</catalog-name>
					|		<full-name-property>НаименованиеГруппировки</full-name-property>
					|		<filename-mask>okof.xml</filename-mask>
					|		<filename-mask>okof.aml</filename-mask>
					|		<filename-mask>okof.finf</filename-mask>
					|		<filename-mask>okof.zip</filename-mask>
					|	</classifier-type>
			   		|</classifier-type-list>";

		xdtoТипыКлассификаторов = xdtoПрочитать(МакетТипов,
			ФабрикаXDTOКлассификаторов(),
			xmlnsОписанияТиповКлассификаторов, "ClassifierTypeListType");

		Возврат xdtoТипыКлассификаторов().Получить("ТипыКлассификаторов[xmlid='" + Идентификатор + "']");
	Исключение
		Возврат Неопределено
	КонецПопытки;
КонецФункции  

Функция ПолучитьСодержаниеКлассификатора(ЧитатьПринудительно = Ложь) Экспорт
	
	Если РежимОбновления = 2 Тогда
		
		Если ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда
			Данные = ПолучитьИзВременногоХранилища(АдресВХранилище);
		КонецЕсли;
		
		Если Данные = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Возврат Данные.Содержание
		
	Иначе
		
		ТекстМакета = Справочники.ОбщероссийскийКлассификаторОсновныхФондов.ПолучитьМакет("КлассификаторОсновныхФондов").ПолучитьТекст();
		
		Возврат ОбщегоНазначения.ЗначениеИзСтрокиXML(ТекстМакета);
		
	КонецЕсли;

КонецФункции // ПолучитьСодержаниеКлассификатора() 

// Процедура, инициирующая сохранение классификатора из дерева значений
// или объекта XDTO в справочник. Вызывается из процедуры
// ЗаписатьКлассификаторыВФорме формы помощника.
//
// Параметры:
//  Источник     - ДеревоЗначений, ОбъектXDTO; объект-источник, содержащий
//                 классификатор;
//  ИмяСправочника - Строка; идентификатор справочника, в который нужно
//                 записать классификатор;
//  УдалятьНеактуальные - Булево; означает, что после загрузки справочника
//                 нужно пометить на удаление оставшиеся элементы. Эффективно
//                 только если загружается классификатор целиком;
//  Владелец     - Ссылка; ссылка на элемент справочника-владельца, который
//                 будет применен для всего классификатора; //!!!
//  ИмяРеквизитаПолнНаименование - Строка; идентификатор реквизита справочника-
//                 приемника, в который дополнительно к Наименованию будет
//                 записываться наименование позиции классификатора;
//  Прогресс     - Число; переменная-реквизит формы, служащий источником
//                 данных для элемента управления Индикатор (свойство
//                 максимальное значение уже должно быть установлено).
//
Процедура СохранитьКлассификатор(Источник, ИмяСправочника, УдалятьНеактуальные, Владелец, ИмяРеквизитаПолнНаименование, Прогресс) Экспорт
	
	Перем МассивСсылок;
		
	МД               = МетаданныеКонфигурации.Справочники.Найти(ИмяСправочника);
	БываютГруппы     = МД.Иерархический И МД.ВидИерархии = СвойстваОбъектовМетаданных.ВидИерархии.ИерархияГруппИЭлементов;
	Менеджер         = Справочники[ИмяСправочника];
	
	ПараметрыЗаписиСправочника = Новый Структура;
	ПараметрыЗаписиСправочника.Вставить("ИскатьПоКоду", 	МД.СерииКодов);
	ПараметрыЗаписиСправочника.Вставить("ПолнНаимен", 		ИмяРеквизитаПолнНаименование);
	ПараметрыЗаписиСправочника.Вставить("Родитель",   		?(МД.Иерархический, Менеджер.ПустаяСсылка(), Неопределено));
	ПараметрыЗаписиСправочника.Вставить("Владелец", 		Владелец);
	ПараметрыЗаписиСправочника.Вставить("Менеджер", 		Менеджер);
		
	Прогресс = 0;
	
	Если УдалятьНеактуальные Тогда
		МассивСсылок = Новый Массив
	КонецЕсли;
	
	АктуальныеЭлементы = ПолучитьАктуальныеЭлементы();
	
	НачатьТранзакцию();
	
	Попытка
		
		ТекущееСостояние = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Сохранение классификатора в справочник «%1»…'"),
			МД.Синоним);
		
		БылиНепомеченные = Ложь;
		
		ПараметрыЗаписиСправочника.Вставить("ЕстьПометка", 		Истина);
		ПараметрыЗаписиСправочника.Вставить("ЕстьСтроки",  		Истина);
		ПараметрыЗаписиСправочника.Вставить("ЕстьЭлементы", 	Источник.Колонки.Найти("Элементы") <> Неопределено);
		ПараметрыЗаписиСправочника.Вставить("ЭтоОбъектXDTO", 	Ложь);
		ПараметрыЗаписиСправочника.Вставить("ЭтоГруппа", 		?(БываютГруппы, Неопределено, Ложь));
	
		ЗаписатьКоллекциюВСправочник(АктуальныеЭлементы, Источник.Строки, ПараметрыЗаписиСправочника, Прогресс, МассивСсылок, БылиНепомеченные);
		
		ПометитьНеНайденныеЭлементы(АктуальныеЭлементы, 5000, Прогресс);

		ТекущееСостояние = "";
		
		ЗафиксироватьТранзакцию();

	Исключение
		
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Загрузка КОФ'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ТекущееСостояние = "";
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	ТекущееСостояние = "";
	
КонецПроцедуры // СохранитьКлассификатор()

Функция ДобавитьКлассификатор(СтрокаXMLИлиФайл, УникальныйИдентификатор, ПервичныйИсточник = "", MIMEТип = "") Экспорт
	
	Перем ТипЧитателя, Идентификатор, Наименование, НормАкт, Строка;
	
	Классификаторы.Очистить();
	
	ФайлПоврежден = Ложь;
	Загружать = Ложь;
	
	Данные = Новый Структура("Содержание,
	|ФабрикаXDTO,
	|СтрокаXMLИлиФайл,
	|ТипЧитателя,
	|ДатаМодификации,
	|КоличествоЭлементов,
	|МаксимальноеЗначениеПрогрессора");
	
	Файл = ПроверитьРазархивироватьФайл(СтрокаXMLИлиФайл, ТипЧитателя, УникальныйИдентификатор, ПервичныйИсточник, MIMEТип);
	
	Если Файл = Неопределено Тогда
		ФайлПоврежден = Истина;
		Возврат Неопределено;
	КонецЕсли; 
	
	Дата = Файл.ПолучитьВремяИзменения();
	//Данные.ДатаМодификации = Файл.ПолучитьВремяИзменения();
	Данные.ТипЧитателя = ТипЧитателя;
	
	ЧтениеXML = Новый(ТипЧитателя);
	Попытка
		ЧтениеXML.ОткрытьФайл(Файл.ПолноеИмя)
	Исключение
		#Если Не ВнешнееСоединение Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Файл (%1) поврежден или имеет неверный формат.'"), СтрокаXMLИлиФайл.Имя));
			ФайлПоврежден = Истина;
		#КонецЕсли
		ЗаписьЖурналаРегистрации(
			СтрШаблон(НСтр("ru = 'Файл (%1) поврежден или имеет неверный формат.'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			СтрокаXMLИлиФайл.Имя), УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
		
	Попытка
		ДеревоКлассификаторов = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
		Идентификатор = "КОФ";
		УдалятьНеактуальные = Ложь;
		Данные.Содержание = ДеревоКлассификаторов;
	Исключение
		#Если Клиент Тогда
		ПоказатьИнформациюОбОшибке(ИнформацияОбОшибке());
	#КонецЕсли
		ФайлПоврежден = Истина;
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Загрузка КОФ'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Данные.ФабрикаXDTO = Неопределено Тогда
		Данные.ФабрикаXDTO = ФабрикаXDTOКлассификаторов()
	КонецЕсли;
	
	ИдентификаторКлассификатора  	= Идентификатор;
	Загружать               		= Истина;
	ПерезаписыватьОбъекты   		= Истина;
	ПерезаписыватьЭтоГруппа 		= Истина;
	Источник                		= СтрокаXMLИлиФайл;
	НаименованиеКлассификатора      = "Классификатор основных фондов";
	
										
	Если НормАкт = Неопределено Тогда
		Редакция = НСтр("ru = '<не указана>'");
	Иначе
		Редакция = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 %2%3 от %4'"),
			НормАкт.Вид,
			НормАкт.ВыпустившийОрган,
			?(ПустаяСтрока(НормАкт.Название), "", " " + НормАкт.Название),
			Формат(НормАкт.ДатаОпубликования, "ДЛФ=D"));
	КонецЕсли;
	
	Данные.СтрокаXMLИлиФайл = Файл;
	АдресВХранилище  = ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор);
		
	Возврат Загружать;
	
КонецФункции // ДобавитьКлассификатор()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция создает объект XDTO из XML.
//
// Параметры:
//  XML          - Строка, ЧтениеXML, ЧтениеFastInfoset, ЧтениеУзловDOM;
//                 источник - строка XML или уже созданный читатель;
//  Фабрика      - ФабрикаXDTO; фабрика, содержащая пакеты типов, которые
//                 будем читать;
//  ТипURI       - Строка; URI пространства имен типа, объект которого мы
//                 собрались читать;
//  ТипИмя       - Строка; локальное имя типа считываемого объекта.
//
// Возвращаемое значение:
//  ОбъектXDTO.
//
Функция xdtoПрочитать(Знач XML, 
					  Знач Фабрика,
                      Знач ТипURI = "",
                      Знач ТипИмя = "")
					  
	Если Не ПустаяСтрока(ТипИмя) Тогда
		Тип = Фабрика.Тип(ТипURI, ТипИмя)
	Иначе
		Тип = Неопределено
	КонецЕсли;
	
	Если ТипЗнч(XML) = Тип("Строка") Тогда
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(XML)
	Иначе
		ЧтениеXML = XML;
	КонецЕсли;
	
	Возврат Фабрика.ПрочитатьXML(ЧтениеXML, Тип);
	
КонецФункции // ПрочитатьXDTO() 

// Функция формирует, если нужно, и возвращает фабрику XDTO, содержащую пакеты
// типов пространства имен {xmlnsКлассификатор}. Объект XDTO типа
// {http://v8.1c.ru/8.1/xdto}Model - модель типов - считывается из макета.
//
// Возвращаемое значение:
//  ФабрикаXDTO.
//
Функция ФабрикаXDTOКлассификаторов()
	Если ФабрикаXDTOКлассификаторов = Неопределено Тогда
		Если МассивОбщихПакетовXDTO = Неопределено Тогда
			МассивОбщихПакетовXDTO = Новый Массив;
			xdtoМодельXDTOТипов = xdtoПрочитать(ПолучитьМакет("МодельXDTO").ПолучитьТекст(),
				ФабрикаXDTO,
				xmlnsV8XDTO, "Model");
			Для Каждого xdtoПакет Из xdtoМодельXDTOТипов.Package Цикл
				МассивОбщихПакетовXDTO.Добавить(xdtoПакет);
			КонецЦикла;
		Иначе
			xdtoМодельXDTOТипов = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(xmlnsV8XDTO, "Model"));
			Для Каждого xdtoПакет Из МассивОбщихПакетовXDTO Цикл
				xdtoМодельXDTOТипов.Package.Добавить(xdtoПакет);
			КонецЦикла;
		КонецЕсли;
		ФабрикаXDTOКлассификаторов = Новый ФабрикаXDTO(xdtoМодельXDTOТипов);
	КонецЕсли;
	Возврат ФабрикаXDTOКлассификаторов
КонецФункции // ФабрикаXDTOКлассификаторов()

// Функция получает объект-список поддерживаемых конфигурацией типов
// классификаторов.
//
// Возвращаемое значение:
//  ОбъектXDTO типа {xmlnsОписанияТиповКлассификаторов}ClassifierTypeListType.
// Содержит свойства: ТипыКлассификаторов - список (<classifier-type>).
//
Функция xdtoТипыКлассификаторов()
	Если xdtoТипыКлассификаторов = Неопределено Тогда
		МакетТипов ="<?xml version=""1.0"" encoding=""Windows-1251""?>
					|<classifier-type-list xmlns=""urn:uuid:101fa9a0-ea86-11dc-afc4-0002a5d5c51b"">
					|	<classifier-type xml:id=""ОКОФ"">
					|		<catalog-name>ОбщероссийскийКлассификаторОсновныхФондов</catalog-name>
					|		<full-name-property>НаименованиеГруппировки</full-name-property>
					|		<filename-mask>okof.xml</filename-mask>
					|		<filename-mask>okof.aml</filename-mask>
					|		<filename-mask>okof.finf</filename-mask>
					|		<filename-mask>okof.zip</filename-mask>
					|	</classifier-type>
			   		|</classifier-type-list>";

		xdtoТипыКлассификаторов = xdtoПрочитать(МакетТипов,
			ФабрикаXDTOКлассификаторов(),
			xmlnsОписанияТиповКлассификаторов, "ClassifierTypeListType");
	КонецЕсли;
	Возврат xdtoТипыКлассификаторов;
КонецФункции // xdtoТипыКлассификаторов() 

// Процедура записи иерархической коллекции в справочник (рекурсивная).
//
// Параметры:
//  Коллекция    - КоллекцияСтрокДереваЗначений, ТаблицаЗначений, СписокXDTO;
//                 коллекция, элементы которой содержат свойства позиции
//                 классификатора;
//
//  ПараметрыЗаписи   - Структура с ключами:
//  	ЕстьПометка   - Булево; означает, что у эл. колл. есть свойство Пометка,
//                 	    которое нужно проверять, иначе - безусловно;
//  	ЕстьСтроки    - Булево; означает, что у эл. колл. есть свойство-коллекция
//                 	    Строки, и нужен рекурсивный вызов для него;
//  	ЕстьЭлементы  - Булево; означает, что у эл. колл. есть свойство-коллекция
//                 	    Элементы, и нужен рекурсивный вызов для него (коллекция не
//                      иерархическая);
//  	ЭтоОбъектXDTO - Булево; если Истина, то Коллекция есть СписокXDTO;
//  	ЭтоГруппа     - Булево, Неопределено; если Неопределено, значит у эл. колл.
//                 	    есть свойство ЭтоГруппа, его надо проверять;
//  	ИскатьПоКоду  - ПСОМД.СерииКодовСправочника; если ЕстьСсылка = Ложь,
//                 	    пытаться найти соответствующий эл. справочника по коду;
//  	ПолнНаимен    - Строка; имя реквизита справочника, хранящего полное
//                 	    наименование; если пустая - не устанавливать;
//  	Родитель      - Ссылка, Неопределено; ссылка на элемент справочника -
//                 	    родителя элементов, создаваемых на основе коллекции;
//                 	    для неиерархического справочника - Неопределено,
//                 	    для корневых элементов - пустая ссылка;
//  	Владелец      - Ссылка, Неопределено; ссылка на элемент справочника -
//                 	    владельца, для неподчиненного - Неопределено;
//  	Менеджер      - соответствующий СправочникМенеджер;
//
//  РазмерТранзакции - 0 или кол-во элементов, после обработки которого
//                     нужно фиксировать транзакцию;
//
//  Прогресс     - Число; инкрементируемая переменная (реквизит формы,
//                 для обновления прогресс-бара).
//
Процедура ЗаписатьКоллекциюВСправочник(АктуальныеЭлементы, Коллекция, ПараметрыЗаписи, Прогресс, МассивСсылок, БылиНепомеченные) Экспорт
	
	// Константы
	Пробелы = "                                                  "; // 50 пробелов (для «добивки» до длины кода)
	// Определить, поддерживает ли данный справочник группы
	МетаданныеСправочника 	= ПараметрыЗаписи.Менеджер.ПустаяСсылка().Метаданные();
	ПоддерживаетГруппы 		= (МетаданныеСправочника.ВидИерархии = СвойстваОбъектовМетаданных.ВидИерархии.ИерархияГруппИЭлементов);
		
	ЗаписыватьСправочник = Ложь;
		
	Для Каждого Строка Из Коллекция Цикл
		
		// РазмерТранзакции, Прогресс
		Прогресс = Прогресс + 1;
				
		#Если Клиент Тогда
		ОбработкаПрерыванияПользователя();
		#КонецЕсли
		
		// ЭтоГруппа
		СоздаватьГруппу = ПоддерживаетГруппы
		                И ПараметрыЗаписи.Родитель <> Неопределено
		                И ?(ПараметрыЗаписи.ЭтоГруппа = Неопределено, Строка.ЭтоГруппа, ПараметрыЗаписи.ЭтоГруппа);
		
		
		ПоставщикЗначенийРеквизитов = Строка;
		
		ЕстьСтроки	= ПоставщикЗначенийРеквизитов.Строки.Количество() > 0;
		НайденнаяСтрока = АктуальныеЭлементы.Найти(ПоставщикЗначенийРеквизитов.КодКОФ, "КодКОФ");
		Если НайденнаяСтрока <> Неопределено Тогда
			ТекСсылка = НайденнаяСтрока.Ссылка;
			НайденнаяСтрока.НайденВФайле = Истина;
		Иначе
			ТекСсылка = ПараметрыЗаписи.Менеджер.ПустаяСсылка();
		КонецЕсли;
		
		Если ТекСсылка = Неопределено Тогда
			ТекСсылка = ПараметрыЗаписи.Менеджер.ПустаяСсылка();
		КонецЕсли;
		
		// Создание элемента
		Если ТекСсылка.Пустая() Тогда
			Объект = ?(СоздаватьГруппу, ПараметрыЗаписи.Менеджер.СоздатьГруппу(), ПараметрыЗаписи.Менеджер.СоздатьЭлемент());
		Иначе
			Объект = ТекСсылка.ПолучитьОбъект();
			// Если элемент справочника удалили, пока ссылка на него хранилась в дереве.
			Если Объект = Неопределено Тогда
				Объект.УстановитьСсылкуНового(ТекСсылка)
			КонецЕсли;
		КонецЕсли;

		Попытка
			Объект.Заблокировать();
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Загрузка КОФ'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
			ВызватьИсключение;
		КонецПопытки;
		
		СсылкаРодитель = Объект.Ссылка;
		
		Если Объект.Заблокирован() Тогда
			
			// Заполнение элемента
			ОбъектИзменен = Ложь;
			Если ПерезаписыватьОбъекты ИЛИ Объект.ЭтоНовый() Тогда
				Если ПараметрыЗаписи.Родитель <> Неопределено Тогда УстановитьНовоеЗначение(Объект.Родитель, ПараметрыЗаписи.Родитель) КонецЕсли;
				УстановитьНовоеЗначение(Объект.ПометкаУдаления, Ложь);
				УстановитьНовоеЗначение(Объект.КодКОФ, ПоставщикЗначенийРеквизитов.КодКОФ);
				УстановитьНовоеЗначение(Объект.Наименование, ПоставщикЗначенийРеквизитов.Наименование);
				
			Иначе

				Если ПараметрыЗаписи.Родитель <> Объект.Родитель Тогда ОбъектИзменен = Истина КонецЕсли;
				Если Объект.ПометкаУдаления Тогда ОбъектИзменен = Истина КонецЕсли;
				Если ПоставщикЗначенийРеквизитов.КодКОФ <> Объект.КодКОФ Тогда ОбъектИзменен = Истина КонецЕсли;
				Если ПоставщикЗначенийРеквизитов.Наименование <> Объект.Наименование Тогда ОбъектИзменен = Истина КонецЕсли;
				
				Если ОбъектИзменен Тогда
					УстановитьНовоеЗначение(Объект.Неактуальный, Истина);
				КонецЕсли;
				
			КонецЕсли;
			
			Объект.ОбменДанными.Загрузка = Истина;
			Объект.ДополнительныеСвойства.Вставить("ЗагрузкаКлассификаторов", Истина);
			
			Если Объект.Модифицированность() Или Объект.ЭтоНовый() Тогда
				Если Объект.ЭтоНовый() Тогда
					Объект.УстановитьНовыйКод();
				КонецЕсли;
				Объект.Записать();
			КонецЕсли;
			
			СсылкаРодитель = Объект.Ссылка;
			
			Если Не ПерезаписыватьОбъекты И ОбъектИзменен Тогда 
				НовыйОбъект = ?(СоздаватьГруппу, ПараметрыЗаписи.Менеджер.СоздатьГруппу(), ПараметрыЗаписи.Менеджер.СоздатьЭлемент());
				НовыйОбъект.Родитель = ПараметрыЗаписи.Родитель;
				НовыйОбъект.КодКОФ = ПоставщикЗначенийРеквизитов.КодКОФ;
				НовыйОбъект.Наименование = ПоставщикЗначенийРеквизитов.Наименование;
				НовыйОбъект.ОбменДанными.Загрузка = Истина;
				НовыйОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаКлассификаторов", Истина);
				НовыйОбъект.УстановитьНовыйКод();
				НовыйОбъект.Записать();
				
				СсылкаРодитель = НовыйОбъект.Ссылка;
				
			КонецЕсли;
			
		КонецЕсли; // Объект.Заблокирован()
	
		// ЕстьСтроки
		Если ПараметрыЗаписи.ЕстьСтроки Тогда
			
			ПараметрыЗаписиСправочника = Новый Структура;
			ПараметрыЗаписиСправочника.Вставить("ЕстьПометка", 		ПараметрыЗаписи.ЕстьПометка); 
			ПараметрыЗаписиСправочника.Вставить("ЕстьСтроки", 		Истина); 
			ПараметрыЗаписиСправочника.Вставить("ЕстьЭлементы", 	ПараметрыЗаписи.ЕстьЭлементы);
			ПараметрыЗаписиСправочника.Вставить("ЭтоОбъектXDTO", 	ПараметрыЗаписи.ЭтоОбъектXDTO);
			ПараметрыЗаписиСправочника.Вставить("ЭтоГруппа",  		?(ПараметрыЗаписи.ЭтоГруппа = Неопределено, Неопределено, Истина));
			ПараметрыЗаписиСправочника.Вставить("ИскатьПоКоду", 	ПараметрыЗаписи.ИскатьПоКоду);
			ПараметрыЗаписиСправочника.Вставить("ПолнНаимен",   	ПараметрыЗаписи.ПолнНаимен);
			ПараметрыЗаписиСправочника.Вставить("Родитель",   		?(ПараметрыЗаписи.Родитель = Неопределено, Неопределено, Объект.Ссылка));
			ПараметрыЗаписиСправочника.Вставить("Владелец", 		ПараметрыЗаписи.Владелец);
			ПараметрыЗаписиСправочника.Вставить("Менеджер", 		ПараметрыЗаписи.Менеджер);

			ЗаписатьКоллекциюВСправочник(АктуальныеЭлементы, Строка.Строки,	ПараметрыЗаписиСправочника, Прогресс, МассивСсылок, БылиНепомеченные);
			
		КонецЕсли;
		
		// ЕстьЭлементы
		Если ПараметрыЗаписи.ЕстьЭлементы И Строка.Элементы <> Неопределено Тогда
			
			ПараметрыЗаписиСправочника = Новый Структура;
			ПараметрыЗаписиСправочника.Вставить("ЕстьПометка", 		Ложь); 
			ПараметрыЗаписиСправочника.Вставить("ЕстьСтроки", 		Ложь); 
			ПараметрыЗаписиСправочника.Вставить("ЕстьЭлементы", 	Ложь);
			ПараметрыЗаписиСправочника.Вставить("ЭтоОбъектXDTO", 	ПараметрыЗаписи.ЭтоОбъектXDTO);
			ПараметрыЗаписиСправочника.Вставить("ЭтоГруппа",  		Ложь);
			ПараметрыЗаписиСправочника.Вставить("ИскатьПоКоду", 	ПараметрыЗаписи.ИскатьПоКоду);
			ПараметрыЗаписиСправочника.Вставить("ПолнНаимен",   	ПараметрыЗаписи.ПолнНаимен);
			ПараметрыЗаписиСправочника.Вставить("Родитель",   		?(ПараметрыЗаписи.Родитель = Неопределено, Неопределено, Объект.Ссылка));
			ПараметрыЗаписиСправочника.Вставить("Владелец", 		ПараметрыЗаписи.Владелец);
			ПараметрыЗаписиСправочника.Вставить("Менеджер", 		ПараметрыЗаписи.Менеджер);
			
			ЗаписатьКоллекциюВСправочник(АктуальныеЭлементы, Строка.Элементы, ПараметрыЗаписиСправочника, Прогресс, МассивСсылок, БылиНепомеченные);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаписатьКоллекциюВСправочник()

// Процедура обрабатывает файл и решает, похож ли он на файл классификатора.
//
// Параметры:
//  Файл         - Файл; файл-источник;
//  ТипЧитателя  - Тип; переменная, принимающая тип объекта, который нужно
//                 создать, чтобы прочесть файл (ЧтениеXML или
//                 ЧтениеFastInfoset);
//  ПервичныйИсточник - Строка; первичное имя файла (Файл может быть
//                 временным) или URL для отображения в сообщениях об ошибках;
//  MIMEТип      - Строка; MIME-тип файла (в случае, если принят по протоколу
//                 HTTP), также используется для определения типа файла.
Функция ПроверитьРазархивироватьФайл(Файл, ТипЧитателя, УникальныйИдентификатор, ПервичныйИсточник, MIMEТип = "")
	
	Если НРег(Файл.Расширение) = ".aml" Тогда
		
		ИмяРаспакованногоФайла = ПолучитьИмяВременногоФайла("xml");
		ТекущееСостояние = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Распаковка файла (%1)…'"),
			Файл.Имя);
		РаспаковкаФайла        = Новый ЧтениеТекста(Файл.Имя, КодировкаТекста.UTF8);
		Попытка
			Хранилище              = XMLЗначение(Тип("ХранилищеЗначения"), РаспаковкаФайла.Прочитать());
			ДвоичныеДанные         = Хранилище.Получить();
			ДвоичныеДанные.Записать(ИмяРаспакованногоФайла);
		Исключение
			#Если Не ВнешнееСоединение Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Файл (%1) не удалось распаковать: файл поврежден, имеет неверный формат, или не достаточно места на диске.'"),
			Файл.Имя));
			#КонецЕсли
			Возврат Неопределено
		КонецПопытки;
		ВременныеФайлы.Добавить(ИмяРаспакованногоФайла);
		Результат = Новый Файл(ИмяРаспакованногоФайла);
		Результат.УстановитьВремяИзменения(Файл.ПолучитьВремяИзменения());
		ТипЧитателя = Тип("ЧтениеXML");
		
	ИначеЕсли НРег(Файл.Расширение) = ".zip"
	      Или MIMEТип = "application/zip"
	      Или MIMEТип = "multipart/x-zip" Тогда
		
		ТекущееСостояние = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Распаковка файла (%1)…'"),
			Файл.Имя);
		Zip = Новый ЧтениеZipФайла;
		Zip.Открыть(Файл.ПолноеИмя);
		Для Каждого Элемент Из Zip.Элементы Цикл
			Если СтрНайти(".aml.xml.fin.finf.zip", НРег(Элемент.Расширение)) = 0
			 Или Элемент.Зашифрован Тогда
				Продолжить;
			КонецЕсли;
			ТемпКаталог = ПолучитьИмяВременногоФайла();
			Попытка
				Zip.Извлечь(Элемент, ТемпКаталог, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
			Исключение
				#Если Не ВнешнееСоединение Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Файл (%1) не удалось извлечь из (%2): архив поврежден, имеет неверный формат, или не достаточно места на диске.'"),
				Элемент.Имя,Файл.Имя));
				#КонецЕсли
				Продолжить
			КонецПопытки;
			НовоеИмя = ТемпКаталог + "\" + Элемент.Имя;
			ВременныеФайлы.Добавить(НовоеИмя);
			ВременныеФайлы.Добавить(ТемпКаталог);
			НовыйФайл = Новый Файл(НовоеИмя);
			ДобавитьКлассификатор(НовыйФайл, УникальныйИдентификатор, ПервичныйИсточник);
		КонецЦикла;
		Результат = Неопределено;
		
	ИначеЕсли НРег(Файл.Расширение) = ".finf"
	      Или НРег(Файл.Расширение) = ".fin"
	      Или MIMEТип = "application/fastinfoset" Тогда
		
		Результат = Файл;
		ТипЧитателя = Тип("ЧтениеFastInfoset");
		
	ИначеЕсли НРег(Файл.Расширение) = ".xml"
	      Или MIMEТип = "text/xml"
	      Или MIMEТип = "text/plain"
	      Или MIMEТип = "application/xml"
	      Или MIMEТип = "" Тогда
		
		Результат = Файл;
		ТипЧитателя = Тип("ЧтениеXML");
		
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Файл (%1) не является файлом классификатора.'"),
			Файл.Имя);
		Результат = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПроверитьРазархивироватьФайл()

// Процедура проверяет переданный параметр, если он не соответствует значению, 
// то присваивает ему указанное значение.
//
// Параметры:
//  Параметр - параметр, значение которого проверяется и заполняется.
//  Значение - значение для заполнения пустого параметра.
//
Процедура УстановитьНовоеЗначение(Параметр, Значение)
	
	Если Параметр <> Значение Тогда
		Параметр = Значение;
	КонецЕсли;
	
КонецПроцедуры // УстановитьНовоеЗначение()

Функция ПолучитьАктуальныеЭлементы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбщероссийскийКлассификаторОсновныхФондов.Ссылка,
		|	ОбщероссийскийКлассификаторОсновныхФондов.КодКОФ,
		|	ЛОЖЬ КАК НайденВФайле
		|ИЗ
		|	Справочник.ОбщероссийскийКлассификаторОсновныхФондов КАК ОбщероссийскийКлассификаторОсновныхФондов
		|ГДЕ
		|	ОбщероссийскийКлассификаторОсновныхФондов.Неактуальный = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбщероссийскийКлассификаторОсновныхФондов.Код УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Процедура ПометитьНеНайденныеЭлементы(ТаблицаЭлементов, РазмерТранзакции, Прогресс)
	
	Для Каждого ТекСтрока Из ТаблицаЭлементов Цикл 
		Если ТекСтрока.НайденВФайле Тогда Продолжить; КонецЕсли;
		
		Прогресс = Прогресс + 1;
		Если РазмерТранзакции <> 0 Тогда
			Если Прогресс % РазмерТранзакции = 0 Тогда
				ЗафиксироватьТранзакцию();
				НачатьТранзакцию();
			КонецЕсли;
		КонецЕсли;
		#Если Клиент Тогда
		ОбработкаПрерыванияПользователя();
		#КонецЕсли
		
		Объект = ТекСтрока.Ссылка.ПолучитьОбъект();
		
		Попытка 
			Объект.Заблокировать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		Если Объект.Заблокирован() Тогда
			УстановитьНовоеЗначение(Объект.Неактуальный, Истина);
			Объект.ОбменДанными.Загрузка = Истина;
			Объект.ДополнительныеСвойства.Вставить("ЗагрузкаКлассификаторов", Истина);
			Если Объект.Модифицированность() Тогда
				Объект.Записать();
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОператорыОсновнойПрограммы

xmlnsXML                			= "http://www.w3.org/XML/1998/namespace";
xmlnsV8XDTO             			= "http://v8.1c.ru/8.1/xdto";
xmlnsОписанияТиповКлассификаторов 	= "urn:uuid:101fa9a0-ea86-11dc-afc4-0002a5d5c51b";
xmlnsКлассификатор      			= "urn:uuid:be515360-d4a7-11dc-8abf-0002a5d5c51b";

ДопДанные = Новый Соответствие;

// Запоминаем временные файлы, чтобы стереть по окончании работы.
ВременныеФайлы = Новый Массив;

МетаданныеКонфигурации = Метаданные;

СвойстваОбъектовМетаданных = МетаданныеКонфигурации.СвойстваОбъектов;

#КонецОбласти


#КонецЕсли