#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

Функция ПолучитьТекстЗапросаПоЭлементамСправочника(УсловиеОтбора)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВидыПоступления.Ссылка,
	|	ВЫБОР
	|		КОГДА ВидыПоступления.Ссылка В (&Корректировка)
	|				ИЛИ ВидыПоступления.ПризнакКорректировки
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПризнакКорректировки,
	|	ВЫБОР
	|		КОГДА ВидыПоступления.ПолноеНаименование = &ПустаяСтрока
	|			ТОГДА ВидыПоступления.Наименование
	|		ИНАЧЕ ВидыПоступления.ПолноеНаименование
	|	КОНЕЦ КАК ПолноеНаименование,
	|	ВЫБОР
	|		КОГДА ВидыПоступления.Ссылка В (&ВидНДС_НДС)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДС)
	|		КОГДА ВидыПоступления.Ссылка В (&ВидНДС_МетодомЗачета)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДСУплачиваемыйПриИмпортеМетодомЗачета)
	|		КОГДА ВидыПоступления.Ссылка В (&ВидНДС_НалоговымАгентом)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДСУплачиваемыйНалоговымАгентом)
	|		КОГДА ВидыПоступления.Ссылка В (&ВидНДС_НалоговымАгентом)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДСУплачиваемыйПриИмпортеИзТаможенногоСоюза)
	|		КОГДА ВидыПоступления.Ссылка В (&ВидНДС_ТаможеннымОрганам)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДСуплачиваемыйТаможеннымОрганам)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДС)
	|	КОНЕЦ КАК ВидНДС
	|ИЗ
	|	Справочник.ВидыПоступления КАК ВидыПоступления" + УсловиеОтбора);
	
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	
	МассивКорректировок = Новый Массив;
	МассивКорректировок.Добавить(Справочники.ВидыПоступления.ВозвратТМЗ);
	МассивКорректировок.Добавить(Справочники.ВидыПоступления.ИзменениеУсловийСделки);
	МассивКорректировок.Добавить(Справочники.ВидыПоступления.ИсправлениеОшибок);
	МассивКорректировок.Добавить(Справочники.ВидыПоступления.СписаниеТМЗ);
	
	МассивНДСМетодомЗачета = Новый Массив;
	МассивНДСМетодомЗачета.Добавить(Справочники.ВидыПоступления.ИмпортТМЗМетодомЗачета);
	
	МассивВидНДС_НДС = Новый Массив;
	МассивВидНДС_НДС.Добавить(Справочники.ВидыПоступления.ВозвратТМЗ);
	МассивВидНДС_НДС.Добавить(Справочники.ВидыПоступления.ИзменениеУсловийСделки);
	МассивВидНДС_НДС.Добавить(Справочники.ВидыПоступления.ИсправлениеОшибок);
	МассивВидНДС_НДС.Добавить(Справочники.ВидыПоступления.КомиссияБанка);
	МассивВидНДС_НДС.Добавить(Справочники.ВидыПоступления.СписаниеТМЗ);
	МассивВидНДС_НДС.Добавить(Справочники.ВидыПоступления.ПриобретениеТМЗБезНДС);
	МассивВидНДС_НДС.Добавить(Справочники.ВидыПоступления.ПриобретениеТМЗпоНулевойСтавке);
	МассивВидНДС_НДС.Добавить(Справочники.ВидыПоступления.ПриобретениеТМЗ);
	МассивВидНДС_НДС.Добавить(Справочники.ВидыПоступления.УслугиПоКомиссионнойТорговле);
	
	МассивВидНДС_МетодомЗачета = Новый Массив;
	МассивВидНДС_МетодомЗачета.Добавить(Справочники.ВидыПоступления.ИмпортТМЗМетодомЗачета);

	МассивВидНДС_НалоговымАгентом = Новый Массив;
	МассивВидНДС_НалоговымАгентом.Добавить(Справочники.ВидыПоступления.НДСЗаНерезидента);

	МассивВидНДС_ТаможенногоСоюза = Новый Массив;
	МассивВидНДС_ТаможенногоСоюза.Добавить(Справочники.ВидыПоступления.НДСПриИмпортеИзТаможенногоСоюза);

	МассивВидНДС_ТаможеннымОрганам = Новый Массив;
	МассивВидНДС_ТаможеннымОрганам.Добавить(Справочники.ВидыПоступления.ПрочийОблагаемыйИмпорт);
	
	Запрос.УстановитьПараметр("Корректировка", МассивКорректировок);
	Запрос.УстановитьПараметр("ИмпортНДСМетодомЗачета", МассивНДСМетодомЗачета);
	Запрос.УстановитьПараметр("ВидНДС_НДС", МассивВидНДС_НДС);
	Запрос.УстановитьПараметр("ВидНДС_МетодомЗачета", МассивВидНДС_МетодомЗачета);
	Запрос.УстановитьПараметр("ВидНДС_НалоговымАгентом", МассивВидНДС_НалоговымАгентом);
	Запрос.УстановитьПараметр("ВидНДС_ТаможенногоСоюза", МассивВидНДС_ТаможенногоСоюза);
	Запрос.УстановитьПараметр("ВидНДС_ТаможеннымОрганам", МассивВидНДС_ТаможеннымОрганам);
	
	Возврат Запрос;
	
КонецФункции

// Обработчик первоначального заполнения
// Заполняет реквизит "ПолноеНаименование" по реквизиту "Наименование" и реквизит "ПризнакКорректировки" для ряда элементов.
//
Процедура ЗаполнитьПредопределенныеВидыПоступлений() Экспорт
	
	УсловиеОтбора = "
	|ГДЕ
	|	ВидыПоступления.ПолноеНаименование = &ПустаяСтрока
	|	ИЛИ ВидыПоступления.Предопределенный";
	
	Запрос = ПолучитьТекстЗапросаПоЭлементамСправочника(УсловиеОтбора);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(СправочникОбъект, Выборка);
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура обновления ИБ для 2.1.2.12.
// Заполняет предопределённые данные.
//
Процедура ЗаполнитьВидНДС() Экспорт
	
	УсловиеОтбора = "";
	
	Запрос = ПолучитьТекстЗапросаПоЭлементамСправочника(УсловиеОтбора);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Ссылка.ВидНДС) Тогда
			
			НачатьТранзакцию();
			Попытка
				СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
				Если СправочникОбъект.Ссылка = Справочники.ВидыПоступления.НДСЗаНерезидента
					Или СправочникОбъект.Ссылка = Справочники.ВидыПоступления.НДСПриИмпортеИзТаможенногоСоюза
					Или СправочникОбъект.Ссылка = Справочники.ВидыПоступления.ПрочийОблагаемыйИмпорт Тогда
					
					ЗаполнитьЗначенияСвойств(СправочникОбъект, Выборка);
					
				Иначе
					СправочникОбъект.ВидНДС = Выборка.ВидНДС;
				КонецЕсли;
				
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
				
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				ВызватьИсключение;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли