
&ИзменениеИКонтроль("ПриДобавленииОбработчиковУстановкиПараметровСеанса")
Процедура игр_ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики)

	//++ НЕ ГИСМ

	//ИнтеграцияС1СДокументооборот
	ИнтеграцияС1СДокументооборот.ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики);
	//Конец ИнтеграцияС1СДокументооборот

	//-- НЕ ГИСМ

	//ПодключаемоеОборудование
	Обработчики.Вставить("РабочееМестоКлиента", "МенеджерОборудованияВызовСервера.УстановитьПараметрыСеансаПодключаемогоОборудования");
	//Конец ПодключаемоеОборудование

	// ИнтеграцияЕГАИС
	Обработчики.Вставить("ИдентификаторСеансаЕГАИС" , "ИнтеграцияЕГАИС.УстановитьПараметрыСеанса");
	// Конец ИнтеграцияЕГАИС

	//++ НЕ ГИСМ

	// ИнтернетПоддержкаПользователей
	ИнтернетПоддержкаПользователей.ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики);
	// Конец ИнтернетПоддержкаПользователей

	//++ НЕ УТ
	// ЗарплатаКадрыРасширенный
	ЗарплатаКадрыРасширенный.ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики);
	// Конец ЗарплатаКадрыРасширенный

	ОбщегоНазначенияБРО.ОбработчикиИнициализацииПараметровСеанса(Обработчики);
	//-- НЕ УТ

	// БиблиотекаЭлектронныхДокументов
	ЭлектронноеВзаимодействие.ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики);
	// Конец БиблиотекаЭлектронныхДокументов

	Обработчики.Вставить("ПроводитьБезКонтроляОстатковТоваровОрганизаций" , "ЗапасыСервер.УстановитьПараметрыСеанса");

	//-- НЕ ГИСМ
	#Вставка
	Обработчики.Вставить("игр_ДоступныеКассы" , "игр_ПродажиОбщегоНазначения.УстановкаПараметровСеанса");
	#КонецВставки

КонецПроцедуры
