
#Область ПрограммныйИнтерфейс

// Заполняет массив структур, которые будут использованы для начального заполнения и
// восстановления начального заполнения профилей.
//
// Параметры:
// ОписанияПрофилей	- Массив
//
Процедура ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
#Область Описание_профилей_Учет_производства
	ДобавитьПрофильЛокальногоДиспетчера(ОписанияПрофилей);
	ДобавитьПрофильТехнолог(ОписанияПрофилей);
	ДобавитьПрофильМенеджераПоПроизводствуНаСтороне(ОписанияПрофилей);
	ДобавитьПрофильЭкономистПроизводства(ОписанияПрофилей);
#КонецОбласти
	
#Область Описание_профилей_Регламентированный_учет
	ДобавитьПрофильБухгалтерВнеоборотныхАктивов(ОписанияПрофилей);
#КонецОбласти
	
#Область Описание_профилей_Зарплата_и_кадры
	ДобавитьПрофилиЗарплатаИКадры(ОписанияПрофилей, ПараметрыОбновления);
#КонецОбласти
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Общие

// Служебная фунция. Сделана экспортной для удобства внедренцев.
//
Процедура ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля) Экспорт
	
	УправлениеДоступомУТ.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
КонецПроцедуры

#КонецОбласти

#Область Учет_производства

Процедура ДобавитьПрофильЛокальногоДиспетчера(ОписанияПрофилей)

	// Профиль "Локальный диспетчер производства".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ЛокальныйДиспетчер";
	ОписаниеПрофиля.Идентификатор = "2c1871fb-5fef-408d-adf8-4edcb6ab6c5c";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Локальный диспетчер производства'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Роли к элементарным функциям.
	ДобавитьРолиЛокальногоДиспетчера(ОписаниеПрофиля);
	
	// КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПроизводство");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Зона ответственности - один или несколько этапов производства.
											|Под профилем выполняются задачи:
											|1. формирование маршрутных листов по графику производства;
											|2. управление незначительными отклонениями внутри этапа;
											|3. корректировка состава технологических операций внутри этапа;
											|4. корректировка используемых ресурсов внутри этапа;
											|5. оперативный анализ загрузки оборудования и наличия ресурсов при выполнении этапа;
											|6. анализ наличия ТМЦ на центральных складах и в цеховой кладовой;
											|7. формирование заявок на перемещение с центральных складов;
											|8. ввод данных инвентаризации НЗП;
											|9. уведомление Главного диспетчера о возникновении глобальных отклонений.'");

	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофильТехнолог(ОписанияПрофилей)
	
	// Профиль "Технолог".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Технолог";
	ОписаниеПрофиля.Идентификатор = "fd7b587b-ad0a-486e-9512-ad99447c8b89";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Технолог'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПроизводстваВПанелиНавигацииНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКалендарей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБригад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтатейКалькуляции");
	
	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаршрутныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовИНастроекНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРазрешенийНаЗаменуМатериалов");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПередачиМатериаловВПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭтаповПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	
	// Регистры, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОсновныхМаршрутныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОсновныхСпецификаций");
	
	// Обработки, отчеты.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеДереваРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРедактированиеСпецификацииСтрокиЗаказа");
	
	// КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПроизводство");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Под профилем выполняются задачи:
	|1. анализ существующих, доработка и разработка новых технологических процессов;
	|2. расчет расходования сырья и материалов;
	|3. разработка технологической документации (технологических нормативов, инструкций, маршрутных карт и др.);
	|4. разработка технических заданий на проектирование и производство оборудования;
	|5. проведение экспериментальных работ по освоению новых технологических процессов;
	|6. выявление брака, нарушений при работе оборудования на технологических линиях (новых и существующих), анализ причин и их устранение;
	|7. контроль соблюдения технологии производственного процесса и эксплуатации оборудования.'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофильМенеджераПоПроизводствуНаСтороне(ОписанияПрофилей)
	
	// Профиль "Менеджер по производству на стороне".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "МенеджерПоПроизводствуНаСтороне";
	ОписаниеПрофиля.Идентификатор = "7387da7a-e932-11e2-a832-c86000df10d3";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по производству на стороне'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	///////////////////////////////////////////////////////////////////////
	// Базовые права.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваУТ");
	
	///////////////////////////////////////////////////////////////////////
	// Справочники, чтение.
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСделок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКалендарей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтатейКалькуляции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	
	///////////////////////////////////////////////////////////////////////
	// Справочники, добавление изменение.
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("РегистрацияШтрихкодовНоменклатуры");
	
	///////////////////////////////////////////////////////////////////////
	// Регистры, чтение.
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭтаповПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПотреблениеМатериаловИУслугВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровКОформлениюТаможенныхДеклараций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыпускаПродукцииРегистр");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОсновныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОсновныхМаршрутныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаВыпускПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафикаПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводствоСпецификации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПереданнойВозвратнойТары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровПереданныхПереработчику");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровПолученныхОтПереработчика");
	
	
	///////////////////////////////////////////////////////////////////////
	// Документы, чтение.
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийНаПеревозку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДенежныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАвансовыхОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаРасходДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыданныхДоверенностей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокОбособленногоУчетаЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийУслугПрочихАктивов"); 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегламентныхОпераций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспределенийРасходовБудущихПериодов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоПереработкеДавальческогоСырья");
	
	///////////////////////////////////////////////////////////////////////
	// Документы, добавление изменение.
	
	ОписаниеПрофиля.Роли.Добавить("ЗачетОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовПереработчикам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовПереработчиков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачСырьяПереработчикам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоступленийОтПереработчиков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовОтПереработчиков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыданныхДоверенностей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");

	///////////////////////////////////////////////////////////////////////
	// Обработки, отчеты.
	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбеспечениеПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыПроизводстваНаСтороне");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	
	///////////////////////////////////////////////////////////////////////
	// Видимые подсистемы КИ
	
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПроизводство");
	ОписаниеПрофиля.Роли.Добавить("РазделПроизводствоПроизводствоНаСтороне");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	
	///////////////////////////////////////////////////////////////////////
	// Виды доступа
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен",				"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров",		"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц",	"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры",	"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации",			"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады",				"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен",				"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения",		"ВначалеВсеРазрешены");
	
	///////////////////////////////////////////////////////////////////////
	// Дополнительные права.
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастройкиПечатиОбъектов");
	ОписаниеПрофиля.Роли.Добавить("СохранениеНастроекПечатиОбъектовПоУмолчанию");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеКурсаВДокументахЗакупки");
	
	///////////////////////////////////////////////////////////////////////
	// Описание поставляемого профиля.
	
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Под профилем выполняются задачи:
					|1. Оформление заказов переработчикам;
					|2. Отражения поступлений от переработчиков и передач переработчикам;
					|3. Оформление отчетов переработчиков о выполнении услуг по переработке.'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьРолиЛокальногоДиспетчера(ОписаниеПрофиля) Экспорт
	
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПроизводстваВПанелиНавигацииНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБригад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаВыпускПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКалендарей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТМЦВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевПланирования");
	
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОсновныхМаршрутныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОсновныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафикаПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыпускаПродукцииРегистр");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТрудозатратПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекРаспределенияЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭтаповПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоступностиВидовРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРемонтовРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводствоСпецификации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводствоТрудозатраты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковМатериаловИРаботВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПотреблениеМатериаловИУслугВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗначенийПоказателейДляРаспределенияРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасценокРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровПолученныхОтПереработчика");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоПереработкеДавальческогоСырья");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоПроизводствуНаСторонеБезПросмотра");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботыРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановыхКалькуляций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФормированийСоставовБригад");
	
	
	// Справочники, добавление.
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыпускаПродукции");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаршрутныхЛистовПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовМатериаловВПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачМатериаловВПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовМатериаловИзПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенияМатериаловВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИзделияИЗатратыНЗП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокЗаказаМатериаловВПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыработкиСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктаВыполненныхВнутреннихРабот");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДвиженийПродукцииИМатериалов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводстваБезЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспределенияВозвратныхОтходов");
	
	// Регистры, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекПередачиМатериаловВПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасписанияРабочихЦентров");
	
	// Обработки, отчеты.
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ПравоНаВводГрафиковРаботыРЦДляФормированияРасписанияРаботыРЦ");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыЛокальногоДиспетчера");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПолученияМатериаловПоЗаказамНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПараметрыОбеспеченияПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетовПоВыполнениюМаршрутныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетовОЗагрузкеРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОформленияПроизводстваБезЗаказов");
	
	
		
КонецПроцедуры

Процедура ДобавитьПрофильЭкономистПроизводства(ОписанияПрофилей)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ЭкономистПроизводства";
	ОписаниеПрофиля.Идентификатор = "86f1e49f-7c35-11e7-9719-708bcd551b9e";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Экономист производства'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПроизводстваВПанелиНавигацииНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБригад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаВыпускПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКалендарей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТМЦВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНематериальныхАктивов");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктаВыполненныхВнутреннихРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводстваБезЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспределенияВозвратныхОтходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыпускаПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыработкиСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенияМатериаловВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспределенияПроизводственныхЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоПереработкеДавальческогоСырья");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоПроизводствуНаСтороне");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботыРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановыхКалькуляций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегламентныхОпераций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРегламентированногоУчета");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИзделияИЗатратыНЗП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктаВыполненныхВнутреннихРабот");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводстваБезЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспределенияВозвратныхОтходов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановПроизводства");
	ОписаниеПрофиля.Роли.Добавить("УтверждениеПлановПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановыхКалькуляций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспределенияПрочихЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспределенияПроизводственныхЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписанийМатериаловПоНормативам");
	
	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсточниковДанныхПланирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекРаспределенияЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовНастроекДоходовРасходов");
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭтаповПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасписанияРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаВыпускПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаСписаниеПоНормативам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафикаПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийОбеспеченияМаршрутныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТрудозатратНезавершенногоПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихДоходовРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасценокРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОсновныхМаршрутныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОсновныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыпускаПродукцииРегистр");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТрудозатратПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоступностиВидовРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРемонтовРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводствоСпецификации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводствоТрудозатраты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковМатериаловИРаботВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПотреблениеМатериаловИУслугВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗначенийПоказателейДляРаспределенияРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровПолученныхОтПереработчика");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровУПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	
	// Регистры расширенной аналитики управленческого учета
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураНоменклатура");
	
	// Регистры, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеНастроекРаспределенияПостатейныхРасходов");
	
	// Обработки, отчеты.
	ОписаниеПрофиля.Роли.Добавить("ОтчетыГлавногоДиспетчера");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсполнениеПланаПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеДереваРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОформленияПроизводстваБезЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетовПлановойПотребности");
	
	
	// КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПроизводство");
	ОписаниеПрофиля.Роли.Добавить("РазделПроизводствоПроизводствоНаСтороне");
	ОписаниеПрофиля.Роли.Добавить("РазделБюджетированиеИПланирование");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены");
	
	ОписаниеПрофиля.Описание = НСтр("ru = 'Зона ответственности - планирование и анализ производственной деятельности.
											|Под профилем выполняются задачи:
											|1. управление распределением расходов на себестоимость продукции;
											|2. формирование и контроль исполнения планов производства;
											|3. план-фактный анализ производственной деятельности;
											|4. анализ себестоимости произведенной продукции.'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
		
КонецПроцедуры

#КонецОбласти

#Область Регламентированный_учет

Процедура ДобавитьПрофильБухгалтерВнеоборотныхАктивов(ОписанияПрофилей)
	
	// Профиль "Бухгалтер по внеоборотным активам".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "БухгалтерПоВнеоборотнымАктивам";
	ОписаниеПрофиля.Идентификатор = "ddb10492-ea5e-11e3-b754-c86000df10d3";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Бухгалтер по внеоборотным активам'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("РазделРегламентированныйУчет");
	ОписаниеПрофиля.Роли.Добавить("РазделВнеоборотныеАктивы");
	
	// Справочники, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНематериальныхАктивов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъектовСтроительства");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГруппФинансовогоУчетаВнеоборотныхАктивов");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоказателейНаработки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассовОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБухгалтерскойНСИ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУзловОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКатегорийЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПрочихОприходованийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриобретенийУслугПрочихАктивов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОператораСистемыПлатон");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРеализацийУслугПрочихАктивов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовНМА");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРегистрацийНаработок");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатковВнеоборотныхАктивов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАмортизацииОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАмортизацииНМА");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовОСОтАрендатора");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИзмененийПараметровОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИзмененийПараметровНМА");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМодернизацийОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенийОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенийНМА");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачиОСАрендатору");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПереоценкиОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПереоценкиНМА");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодготовкиКПередачеОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодготовкиКПередачеНМА");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПринятийКУчетуОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПринятийКУчетуНМА");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписанийОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписанийНМА");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	
	// Добавление/изменение регистров
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРегистрацииЗемельныхУчастков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРегистрацииТранспортныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорядкаОтраженияДоходов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорядкаОтраженияПрочихОпераций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорядкаОтраженияРасходов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорядкаОтраженияРасчетовСПартнерами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовРеглУчетаТребующихНастройки");
	
	// Чтение регистров.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРегламентированногоУчета");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПорядкаОтраженияНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПорядкаОтраженияНоменклатурыПереданной");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПорядкаОтраженияТМЦВЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПорядкаОтраженияПодарочныхСертификатов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтоимостиОС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтоимостиНМА");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАмортизацииОС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАмортизацииНМА");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСписанийОС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоОсновнымСредствам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНематериальнымАктивам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихДоходовРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихАктивовПассивов");
	
	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекОтраженияДокументовВРеглУчете");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовОС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовНМА");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовЛизинга");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПомощникПереходаНаУчетВнеоборотныхАктивовВерсии24");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = 
		НСтр("ru = 'Дополнительный профиль, назначаемый пользователям для выполнения задач учета внеоборотных активов:
		|1. Сопровождения нормативно-справочной информации
		|2. Ведения документов движений внеоборотных активов
		|3. Получение отчетов по данным бухгалтерского и налогового учета.'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

#КонецОбласти

#Область Зарплата_и_кадры

Процедура ДобавитьПрофилиЗарплатаИКадры(ОписанияПрофилей, ПараметрыОбновления, ДополнятьОбязательнымиРолями = Истина)
	
	КоличествоПрофилейУТУП = ОписанияПрофилей.Количество();
	
	Для НомерПрофиля = 1 По ОписанияПрофилей.Количество() Цикл
		
		ОписаниеПрофиля = ОписанияПрофилей[НомерПрофиля - 1];
		
		Если ОписаниеПрофиля.Роли.Найти("ЧтениеДанныхФизическихЛицЗарплатаКадры") <> Неопределено Тогда
			ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадрыРасширенная");
		КонецЕсли;
		
		Если ОписаниеПрофиля.Роли.Найти("ДобавлениеИзменениеДанныхФизическихЛицЗарплатаКадры") <> Неопределено Тогда
			ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхФизическихЛицЗарплатаКадрыРасширенная");
		КонецЕсли;
		
	КонецЦикла;
	
	ЗарплатаКадрыРасширенный.ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления);
	
	Для НомерПрофиля = КоличествоПрофилейУТУП + 1 По ОписанияПрофилей.Количество() Цикл
		
		ОписаниеПрофиля = ОписанияПрофилей[НомерПрофиля - 1];
		
		// Добавим в профиль БЗКР обязательные права УТ/УП
		ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
		
		ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
		
		// Добавим в профиль БЗКР роли на просмотр интерфейсных подсистем
		Если ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляКадровик()
		 ИЛИ ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляСтаршийКадровик() Тогда
			ОписаниеПрофиля.Роли.Добавить("РазделКадры");
		ИначеЕсли ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляРасчетчик()
		 ИЛИ ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляСтаршийРасчетчик()
		 ИЛИ ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляТабельщик() Тогда
			ОписаниеПрофиля.Роли.Добавить("РазделЗарплата");
		Иначе
			// Аудитор, КадровикРасчетчик, СтаршийКадровикРасчетчик
			ОписаниеПрофиля.Роли.Добавить("РазделКадры");
			ОписаниеПрофиля.Роли.Добавить("РазделЗарплата");
		КонецЕсли;
		
		// Исключим не используемые в УТ/УП роли
		ИндексРоли = ОписаниеПрофиля.Роли.Найти("ПросмотрОписанияИзмененийПрограммы");
		Если ИндексРоли <> Неопределено Тогда
			ОписаниеПрофиля.Роли.Удалить(ИндексРоли);
		КонецЕсли;
		
		Если ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляРасчетчик()
			ИЛИ ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляСтаршийРасчетчик()
			ИЛИ ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляКадровикРасчетчик()
			ИЛИ ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляСтаршийКадровикРасчетчик() Тогда
			
			ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДепонированнойЗарплаты");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеДепонированнойЗарплаты");
			
			ОписаниеПрофиля.Роли.Добавить("ОтражениеЗарплатыВФинансовомУчете");
			ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтраженияЗарплатыВФинансовомУчете");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеОтраженияЗарплатыВФинансовомУчете");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеВыполненныхРаботСотрудников");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРаботСотрудников");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеРасценокРаботСотрудников");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРегламентированногоУчета");
			
		ИначеЕсли ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляАудитор() Тогда
			
			ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
			
		КонецЕсли;
		
		// Привязка к предопределенным элементам.
		Если ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляАудитор() Тогда
			ОписаниеПрофиля.Имя = "Аудитор";
		ИначеЕсли ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляКадровик() Тогда
			ОписаниеПрофиля.Имя = "Кадровик";
		ИначеЕсли ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляКадровикБезДоступаКЗарплате() Тогда
			ОписаниеПрофиля.Имя = "КадровикБезДоступаКЗарплате";
		ИначеЕсли ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляКадровикРасчетчик() Тогда
			ОписаниеПрофиля.Имя = "КадровикРасчетчик";
		ИначеЕсли ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляРасчетчик() Тогда
			ОписаниеПрофиля.Имя = "Расчетчик";
		ИначеЕсли ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляСтаршийКадровик() Тогда
			ОписаниеПрофиля.Имя = "СтаршийКадровик";
		ИначеЕсли ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляСтаршийКадровикРасчетчик() Тогда
			ОписаниеПрофиля.Имя = "СтаршийКадровикРасчетчик";
		ИначеЕсли ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляСтаршийРасчетчик() Тогда
			ОписаниеПрофиля.Имя = "СтаршийРасчетчик";
		ИначеЕсли ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляТабельщик() Тогда
			ОписаниеПрофиля.Имя = "Табельщик";
		КонецЕсли;
		
		// локальное исправление ошибки 50007048
		Если ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляСтаршийКадровик() Или
			ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляСтаршийРасчетчик() Или
			ОписаниеПрофиля.Идентификатор = ЗарплатаКадрыРасширенный.ИдентификаторПрофиляСтаршийКадровикРасчетчик() Тогда
			ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодразделенийОрганизации");
			ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДолжностей");
		Иначе
			ОписаниеПрофиля.Роли.Добавить("ЧтениеПодразделенийОрганизации");
			ОписаниеПрофиля.Роли.Добавить("ЧтениеДолжностей");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Обработчик первого запуска.
// Помещает профили подсистемы "Зарплата и кадры" в предопределенную группу.
//
Процедура УстановитьРодителяПрофилейДоступаЗарплатаИКадры() Экспорт
	
	// Подготовим вспомогательные данные
	ГруппаПрофилей      = Справочники.ПрофилиГруппДоступа.ЗарплатаИКадры;
	ОписанияПрофилей    = Новый Массив;
	ПараметрыОбновления = Новый Структура(
		"ОбновлятьИзмененныеПрофили, ЗапретитьИзменениеПрофилей,
		|ОбновлятьГруппыДоступа, ОбновлятьГруппыДоступаСУстаревшимиНастройками");
		
	// Получим описания профилей "Зарплата и кадры"
	ДобавитьПрофилиЗарплатаИКадры(ОписанияПрофилей, ПараметрыОбновления, Ложь);
	
	// Получим массив их идентификаторов
	МассивИдентификаторов = Новый Массив;
	Для Каждого ОписаниеПрофиля Из ОписанияПрофилей Цикл
		МассивИдентификаторов.Добавить(Новый УникальныйИдентификатор(ОписаниеПрофиля.Идентификатор));
	КонецЦикла;
	
	// Выберем профили "Зарплата и кадры" с неверно заполненным родителем
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрофилиГруппДоступа.Ссылка,
	|   ПрофилиГруппДоступа.ИдентификаторПоставляемыхДанных
	|ИЗ
	|	Справочник.ПрофилиГруппДоступа КАК ПрофилиГруппДоступа
	|ГДЕ
	|	НЕ ПрофилиГруппДоступа.ЭтоГруппа
	|	И НЕ ПрофилиГруппДоступа.Предопределенный
	|	И ПрофилиГруппДоступа.ИдентификаторПоставляемыхДанных В(&МассивИдентификаторов)
	|	И ПрофилиГруппДоступа.Родитель <> &ГруппаПрофилей";
	
	Запрос.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторов);
	Запрос.УстановитьПараметр("ГруппаПрофилей",        ГруппаПрофилей);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Установим в качестве родителя группу "Зарплата и кадры"
	Пока Выборка.Следующий() Цикл
		ОбъектПрофиль = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектПрофиль.Родитель = ГруппаПрофилей;
		ОбъектПрофиль.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
