
&ИзменениеИКонтроль("ТекстЗапросаРаспоряженияНаДоставку")
Функция игр_ТекстЗапросаРаспоряженияНаДоставку(ВыборочноеОбновление, ЕстьОрдерныйСклад, ЕстьНеОрдерныйСклад, ДоставкаПолучателям)

	Если ВыборочноеОбновление Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ОбновляемыеРаспоряжения.Распоряжение,
		|	ОбновляемыеРаспоряжения.Склад
		|ПОМЕСТИТЬ ОбновляемыеРаспоряжения
		|ИЗ
		|	&ОбновляемыеРаспоряжения КАК ОбновляемыеРаспоряжения";
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО КАК Распоряжение,
		|	НЕОПРЕДЕЛЕНО КАК Склад
		|ПОМЕСТИТЬ ОбновляемыеРаспоряжения";
	КонецЕсли;

	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
	ТекстЗапросаВтРаспоряженияНаДоставку(ДоставкаПолучателям);

	ШаблонВыборкаДвиженийКРаспределению = ?(ДоставкаПолучателям,
	"ВЫБРАТЬ
	|	ТаблицыИсточника.Склад                  КАК Склад,
	|	ТаблицыИсточника.Распоряжение           КАК Распоряжение,
	|	ТаблицыИсточника.ПолучательОтправитель  КАК ПолучательОтправитель,
	|	ТаблицыИсточника.СпособДоставки         КАК СпособДоставки,
	|	ТаблицыИсточника.Зона                   КАК Зона,
	|	ТаблицыИсточника.Перевозчик             КАК Перевозчик,
	|	ТаблицыИсточника.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ТаблицыИсточника.Номенклатура           КАК Номенклатура,
	|	ТаблицыИсточника.Характеристика         КАК Характеристика,
	|	ТаблицыИсточника.Назначение             КАК Назначение,
	|	ТаблицыИсточника.Серия                  КАК Серия,
	|	ТаблицыИсточника.Количество             КАК Количество
	|ИЗ
	|	ИмяТаблицыИсточника КАК ТаблицыИсточника",
	"ВЫБРАТЬ
	|	ТаблицыИсточника.Период         КАК Период,
	|	ТаблицыИсточника.Распоряжение   КАК Распоряжение,
	|	ТаблицыИсточника.Номенклатура   КАК Номенклатура,
	|	ТаблицыИсточника.Характеристика КАК Характеристика,
	|	ТаблицыИсточника.Назначение     КАК Назначение,
	|	ТаблицыИсточника.Склад          КАК Склад,
	|	ТаблицыИсточника.Количество     КАК Количество,
	|	ТаблицыИсточника.Вес            КАК Вес,
	|	ТаблицыИсточника.Объем          КАК Объем
	|ИЗ
	|	ИмяТаблицыИсточника КАК ТаблицыИсточника");

	ШаблонВыборкаРаспоряжений = 
	"ВЫБРАТЬ
	|	ТаблицыИсточника.Дата                   КАК Дата,
	|	ТаблицыИсточника.Номенклатура           КАК Номенклатура,  
	#Удаление
	|	ТаблицыИсточника.МернаяЕдиницаИзмерения КАК МернаяЕдиницаИзмерения,
	#КонецУдаления
	#Вставка
	|	ЕСТЬNULL(ТаблицыИсточника.МернаяЕдиницаИзмерения, ЛОЖЬ) КАК МернаяЕдиницаИзмерения,
	#КонецВставки
	|	ТаблицыИсточника.Характеристика         КАК Характеристика,
	|	ТаблицыИсточника.Назначение             КАК Назначение,
	|	ТаблицыИсточника.Серия                  КАК Серия,
	|	ТаблицыИсточника.Количество             КАК Количество,
	|	ТаблицыИсточника.Вес                    КАК Вес,
	|	ТаблицыИсточника.Объем                  КАК Объем,
	|	ТаблицыИсточника.Склад                  КАК Склад,
	|	ТаблицыИсточника.Распоряжение           КАК Распоряжение,
	|	ТаблицыИсточника.ПолучательОтправитель  КАК ПолучательОтправитель,
	|	ТаблицыИсточника.ВидРаспоряжения        КАК ВидРаспоряжения,
	|	ТаблицыИсточника.Номер                  КАК Номер,
	|	ТаблицыИсточника.Адрес                  КАК Адрес,
	|	ТаблицыИсточника.АдресЗначенияПолей     КАК АдресЗначенияПолей,
	|	ТаблицыИсточника.СпособДоставки         КАК СпособДоставки,
	|	ТаблицыИсточника.Картинка               КАК Картинка,
	|	ТаблицыИсточника.Зона                   КАК Зона,
	|	ТаблицыИсточника.ЗонаПредставление      КАК ЗонаПредставление,
	|	ТаблицыИсточника.Перевозчик             КАК Перевозчик,
	|	ТаблицыИсточника.ВремяС                 КАК ВремяС,
	|	ТаблицыИсточника.ВремяПо                КАК ВремяПо,
	|	ТаблицыИсточника.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	ТаблицыИсточника.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ТаблицыИсточника.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	ТаблицыИсточника.ПолеУпорядочивания     КАК ПолеУпорядочивания
	|ИЗ
	|	ИмяТаблицыИсточника КАК ТаблицыИсточника";

	ТекстИсточникиДвиженийКРаспределению = "";
	ТекстИсточникиРаспоряжений = "";

	Если ЕстьОрдерныйСклад Тогда

		ТекстЗапроса = ТекстЗапроса
		+ ОбщегоНазначенияУТ.РазделительЗапросовПакета()
		+ ?(ДоставкаПолучателям,
		ТекстЗапросаРаспоряженияНаДоставкуПолучателямПоОрдернойСхеме(),
		ТекстЗапросаРаспоряженияНаДоставкуОтОтправителейПоОрдернойСхеме());

		ИмяТаблицыКРаспределению = "ВтДвиженияКРаспределениюПоОрдернойСхеме";
		ИмяТаблицыРаспоряжений = ?(ДоставкаПолучателям,
		"ВтРаспоряженияНаДоставкуПолучателямПоОрдернойСхеме",
		"ВтРаспоряженияНаДоставкуОтОтправителейПоОрдернойСхеме");

		ТекстИсточникДвиженийКРаспределению = СтрЗаменить(ШаблонВыборкаДвиженийКРаспределению,
		"ИмяТаблицыИсточника",
		ИмяТаблицыКРаспределению);
		ТекстИсточникРаспоряжений = СтрЗаменить(ШаблонВыборкаРаспоряжений,
		"ИмяТаблицыИсточника",
		ИмяТаблицыРаспоряжений);

		ТекстИсточникиДвиженийКРаспределению = ТекстИсточникДвиженийКРаспределению;
		ТекстИсточникиРаспоряжений = ТекстИсточникРаспоряжений;

	КонецЕсли;

	Если ЕстьНеОрдерныйСклад Тогда
		ТекстЗапроса = ТекстЗапроса
		+ ОбщегоНазначенияУТ.РазделительЗапросовПакета()
		+ ?(ДоставкаПолучателям,
		ТекстЗапросаРаспоряженияНаДоставкуПолучателямБезОрдернойСхемы(),
		ТекстЗапросаРаспоряженияНаДоставкуОтОтправителейБезОрдернойСхемы());

		ИмяТаблицыКРаспределению = "ВтДвиженияКРаспределениюБезОрдернойСхемы";
		ИмяТаблицыРаспоряжений = ?(ДоставкаПолучателям,
		"ВтРаспоряженияНаДоставкуПолучателямБезОрдернойСхемы",
		"ВтРаспоряженияНаДоставкуОтОтправителейБезОрдернойСхемы");

		ТекстИсточникДвиженийКРаспределению = СтрЗаменить(ШаблонВыборкаДвиженийКРаспределению,
		"ИмяТаблицыИсточника",
		ИмяТаблицыКРаспределению);
		ТекстИсточникРаспоряжений = СтрЗаменить(ШаблонВыборкаРаспоряжений,
		"ИмяТаблицыИсточника",
		ИмяТаблицыРаспоряжений);

		ТекстИсточникиДвиженийКРаспределению = ?(ПустаяСтрока(ТекстИсточникиДвиженийКРаспределению),
		ТекстИсточникДвиженийКРаспределению,
		ТекстИсточникиДвиженийКРаспределению
		+ "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|"
		+ ТекстИсточникДвиженийКРаспределению);

		ТекстИсточникиРаспоряжений = ?(ПустаяСтрока(ТекстИсточникиРаспоряжений),
		ТекстИсточникРаспоряжений,
		ТекстИсточникиРаспоряжений
		+ "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|"
		+ ТекстИсточникРаспоряжений);

	КонецЕсли;

	ФинальныйТекстЗапросаВыборкаДвиженийКРаспределению = 
	СтрЗаменить(ШаблонВыборкаДвиженийКРаспределению,
	"ИмяТаблицыИсточника",
	"("
	+ ТекстИсточникиДвиженийКРаспределению
	+ ")");
	Если Не ДоставкаПолучателям Тогда
		ФинальныйТекстЗапросаВыборкаДвиженийКРаспределению = ФинальныйТекстЗапросаВыборкаДвиженийКРаспределению
		+
		"
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицыИсточника.Период";
	КонецЕсли;

	ФинальныйТекстЗапросаИсточникиРаспоряжений = 
	СтрЗаменить(ШаблонВыборкаРаспоряжений,
	"ИмяТаблицыИсточника",
	"("
	+ ТекстИсточникиРаспоряжений
	+ ")");

	ТекстЗапросаУпорядочивание = "";
	Если Не ДоставкаПолучателям
		И ЕстьОрдерныйСклад Тогда
		ТекстЗапросаУпорядочивание = 
		"
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицыИсточника.ЗонаПредставление,
		|	ТаблицыИсточника.Зона,
		|	ТаблицыИсточника.Распоряжение,
		|	ТаблицыИсточника.Склад,
		|	ТаблицыИсточника.Номенклатура,
		|	ТаблицыИсточника.Характеристика,
		|	ТаблицыИсточника.Назначение,
		|	ТаблицыИсточника.Серия,
		|	ТаблицыИсточника.Дата";
	Иначе
		ТекстЗапросаУпорядочивание = 
		"
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицыИсточника.ЗонаПредставление,
		|	ТаблицыИсточника.Зона,
		|	ТаблицыИсточника.ПолеУпорядочивания,
		|	ТаблицыИсточника.ПолучательОтправитель,
		|	ТаблицыИсточника.Распоряжение,
		|	ТаблицыИсточника.Склад,
		|	ТаблицыИсточника.Номенклатура,
		|	ТаблицыИсточника.Характеристика,
		|	ТаблицыИсточника.Назначение,
		|	ТаблицыИсточника.Серия,
		|	ТаблицыИсточника.Дата";
	КонецЕсли;

	ФинальныйТекстЗапросаИсточникиРаспоряжений = ФинальныйТекстЗапросаИсточникиРаспоряжений
	+ ТекстЗапросаУпорядочивание;

	ТекстЗапроса = ТекстЗапроса
	+ ОбщегоНазначенияУТ.РазделительЗапросовПакета() 
	+ ФинальныйТекстЗапросаВыборкаДвиженийКРаспределению
	+ ОбщегоНазначенияУТ.РазделительЗапросовПакета() 
	+ ФинальныйТекстЗапросаИсточникиРаспоряжений;

	Если Не ВыборочноеОбновление Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбновляемыеРаспоряжения",
		"ЛЕВОЕ СОЕДИНЕНИЕ ОбновляемыеРаспоряжения");
	КонецЕсли;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаВесУпаковки", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки("СправочникНоменклатура.ЕдиницаИзмерения", "СправочникНоменклатура"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаОбъемУпаковки", Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки("СправочникНоменклатура.ЕдиницаИзмерения", "СправочникНоменклатура"));

	Возврат ТекстЗапроса;

КонецФункции
