
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");

	ЭтаФорма.Параметры.Свойство("ВерсияМодуля"   , ЭтаФорма.ВерсияМодуля);
	ЭтаФорма.Параметры.Свойство("ДатаОбработки"  , ЭтаФорма.ДатаОбработки);
	ЭтаФорма.Параметры.Свойство("СтатусОбработки", ЭтаФорма.СтатусОбработки);
	ЭтаФорма.Параметры.Свойство("Описание"       , ЭтаФорма.Описание);
	ЭтаФорма.Параметры.Свойство("ЭКОМОбъектыАктуальны", ЭтаФорма.ЭКОМОбъектыАктуальны);

	ЛокальныйКаталогUPDATE = "";
	Если ЭтаФорма.ЭКОМОбъектыАктуальны = Истина Тогда
	     ЛокальныйКаталогUPDATE = ОбработкаОбъект.Настройка_Параметр_Прочитать("ЭКОМ_Локальный_Каталог_UPDATE",,, Истина);
	Иначе	
		 ЭтаФорма.Параметры.Свойство("ЛокальныйКаталогUPDATE", ЛокальныйКаталогUPDATE);
	КонецЕсли;
	
	МаскаZIP = "E_COM_*" + ЭтаФорма.ВерсияМодуля + "*.zip";		
	ФайлыZIP = НайтиФайлы(ЛокальныйКаталогUPDATE, МаскаZIP);
	
	СтруктураФайла 	= Новый Структура;
	СтруктураФайла.Вставить("epf", "~");
	СтруктураФайла.Вставить("cf", "~");
	
	Если ФайлыZIP.Количество() > 0 Тогда
		
		ФайлZIP 		= ФайлыZIP[0];
		ЧтениеZIP 		= Новый ЧтениеZipФайла(ФайлZIP.ПолноеИмя);
		
		Для Каждого Элемент Из ЧтениеZIP.Элементы Цикл	
			
			ЧтениеZIP.Извлечь(Элемент, ЛокальныйКаталогUPDATE, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
			Ключ = НРег(Элемент.ИсходноеРасширение);
			Если СтруктураФайла.Свойство(Ключ) Тогда
				СтруктураФайла[Ключ] = Элемент.ПолноеИмя;
			Иначе
				СтруктураФайла.Вставить(Ключ, Элемент.ПолноеИмя);
			КонецЕсли;
			
		КонецЦикла;

		ЧтениеZIP.Закрыть();
		
	КонецЕсли;
	
	ФайлыEPF = НайтиФайлы(ЛокальныйКаталогUPDATE, СтруктураФайла.epf);
	Если ФайлыEPF.Количество() > 0 Тогда
		ФайлEPF = ФайлыEPF[0];
		ЭтаФорма.ФайлОбновленияИмя = ФайлEPF.ПолноеИмя;	
	КонецЕсли;
	
    ФайлыCF = НайтиФайлы(ЛокальныйКаталогUPDATE, СтруктураФайла.cf);
	Если ФайлыCF.Количество() > 0 Тогда
		ФайлCF = ФайлыCF[0];
		ЭтаФорма.ФайлКонфигурацииИмя = ФайлCF.ПолноеИмя;
	КонецЕсли;
	
	Попытка
		ИмяФайлаОбработки = ОбработкаОбъект.ИспользуемоеИмяФайла;
	Исключение
	КонецПопытки;	
		
	Если ИмяФайлаОбработки = "" 
		 ИЛИ ИмяФайлаОбработки = Неопределено Тогда
		 
		РежимИспользования = "Обработка в составе конфигурации";  
	ИначеЕсли Найти(ИмяФайлаОбработки, "e1cib") = 1 Тогда
		РежимИспользования = "Обработка в справочнике внешних обработок";
	Иначе
		РежимИспользования = "Файл внешней обработки";
	КонецЕсли;
		   
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ФормаОбновить.Доступность = ЭтаФорма.ЭКОМОбъектыАктуальны;
	Если Элементы.ФормаОбновить.Доступность = Истина 
		И ЭтаФорма.СтатусОбработки = "Установлена" Тогда
	    Элементы.ФормаОбновить.Доступность = Ложь;
    КонецЕсли;

	ПроверитьОбновленияОтобразитьРезультаты();

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ДанныеОбновления = ОбновитьНаСервере();
    
    Если ДанныеОбновления.Успешно = Истина Тогда
    	Оповещение = Новый ОписаниеОповещения("ПодтверждениеОЗакрытии", ЭтаФорма);
    Иначе
        Оповещение = Новый ОписаниеОповещения;
    КонецЕсли;
	ОписаниеОповещенияОЗавершении =  Оповещение;
	ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ДанныеОбновления.ТекстСообщения, РежимДиалогаВопрос.ОК, , , "Обработка обновлена!", ); 
			
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеОЗакрытии(Результат, Параметры) Экспорт 
	
	ПутьКФорме = СтрЗаменить(ЭтаФорма.ИмяФормы, "УФ_ФормаОбновления", "");

	Если ЭтаФорма.Открыта() Тогда
		ЭтаФорма.Закрыть();	
	КонецЕсли;
	Если НЕ ЭтаФорма.ВладелецФормы = Неопределено Тогда 
		Если ЭтаФорма.ВладелецФормы.Открыта() Тогда
			ЭтаФорма.ВладелецФормы.Закрыть();	
		КонецЕсли;
	КонецЕсли;
	Попытка
		Если НЕ ЭтаФорма.ВладелецФормы.ВладелецФормы = Неопределено Тогда
			Если ЭтаФорма.ВладелецФормы.ВладелецФормы.Открыта() Тогда
				ЭтаФорма.ВладелецФормы.ВладелецФормы.Закрыть();	
			КонецЕсли;
		КонецЕсли;	
	Исключение
	КонецПопытки;
	
	Попытка
	     Форма = ПолучитьФорму(ПутьКФорме + "УФ_Форма");
		 Если Форма.Открыта() Тогда
			Форма.Закрыть();	
		КонецЕсли;
    Исключение	
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ОбновитьНаСервере()
	
	ИмяСобытия = "Форма обновления";
	МассивЛогаСобытий = Новый Массив;
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");

	ЛокальныйКаталогUPDATE  = ОбработкаОбъект.Настройка_Параметр_Прочитать("ЭКОМ_Локальный_Каталог_UPDATE",,, Истина);
    ВерсияОбработки = ОбработкаОбъект.ПолучитьВерсиюОбработки();
    
    ПутьАрхиваUpdate = ЛокальныйКаталогUPDATE + ?(Прав(ЛокальныйКаталогUPDATE, 1) = "\", "", "\") + "archive\";
    КаталогАрхивUpdate = Новый Файл(ПутьАрхиваUpdate);
    Если НЕ КаталогАрхивUpdate.Существует() Тогда
        Попытка
	        СоздатьКаталог(ПутьАрхиваUpdate);
        Исключение
            Ошибка = ОписаниеОшибки();
            Сообщить("Резервная копия обработки будет сохранена в каталог Update, указанный в настройках. Причина: " + " Ошибка создания каталога [archive] внутри [" + ЛокальныйКаталогUpdate + "]" + Символы.ПС + Ошибка = ОписаниеОшибки());
            КаталогАрхивUpdate = ЛокальныйКаталогUPDATE;
        КонецПопытки;
        КаталогАрхивUpdate = Неопределено;
    КонецЕсли;
    
	// Проверка каталога UPDATE
	Если НЕ Прав(ЛокальныйКаталогUPDATE,1) = "\" Тогда
		ЛокальныйКаталогUPDATE = ЛокальныйКаталогUPDATE + "\"; 
	КонецЕсли;
	
	ФайлыEPF = НайтиФайлы(ЛокальныйКаталогUPDATE, "E_COM_*" + ЭтаФорма.ВерсияМодуля + "*.epf");
	Если ФайлыEPF.Количество() > 0 Тогда
	     ФайлEPF  = ФайлыEPF[0];
	Иначе
		 Возврат Ложь;
	КонецЕсли;
	
	Попытка
		ИмяФайлаОбработки = ОбработкаОбъект.ИспользуемоеИмяФайла;
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ИмяФайлаОбработки) Тогда
		 ИмяФайлаОбработки = "";
	КонецЕсли;
	
	Массив = ОбработкаОбъект.Эком_РазложитьСтрокуВМассивПодстрок(ИмяФайлаОбработки, "\");
    ИмяТекОбработки  = Массив[Массив.Количество() - 1];	
	ПутьТекОбработки = СтрЗаменить(ИмяФайлаОбработки, ИмяТекОбработки, "");
    
    Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("ТекстСообщения", "");
    
	Если РежимИспользования = "Обработка в справочнике внешних обработок" Тогда
		// будем обновлять только типовые модули, 
		// ответственность за обновление измененных - на пользователе		
		
		// Сохраним текущую версию модуля
		СсылкаАвтообновления = ОбработкаОбъект.ПолучитьСсылкуВнешнейОбработкиДляАвтоматическогоОбновления();
		Если ЗначениеЗаполнено(СсылкаАвтообновления) Тогда
			// Для этого сохраним обработку на диск
			Времфайл = ПолучитьИмяВременногоФайла("epf");
			СсылкаАвтообновления.ХранилищеОбработки.Получить().Записать(Времфайл);
			// Переносим текущую обработку в UPDATE 
			ПереместитьФайл(Времфайл,
			ПутьАрхиваUpdate + "Архив E_COM_" + ВерсияОбработки + ".epf");
			УдалитьФайлы(Времфайл);
			
			// Запишем его в справочник "Внешние обработки" с комментарием.	
			СпрОбъект = СсылкаАвтообновления.ПолучитьОбъект();
			СпрОбъект.ХранилищеОбработки = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ФайлEPF.ПолноеИмя));
			Попытка
				СпрОбъект.Записать();
				
				ОбработкаОбъект.ЭКОМ_ИсторияОбмена_УдалитьЗапись(ЭтаФорма.ВерсияМодуля, МассивЛогаСобытий);
				
				Структура = Новый Структура;
				Структура.Вставить("Комментарий"  , ЭтаФорма.Описание);        // Описание
				Структура.Вставить("ДатаПолучения", ЭтаФорма.ДатаОбработки);
				Структура.Вставить("Причина", "Установлена");

				ОбработкаОбъект.ЭКОМ_ИсторияОбмена_Записать(Перечисления.ЭКОМ_НаправлениеОбмена.Входящий, Перечисления.ЭКОМ_ВидыДокументов.ПустаяСсылка(), ЭтаФорма.ВерсияМодуля, Структура);

				Сообщить("Модуль обновлен. Перезапустите его");			
				Результат.Успешно = Истина;
			Исключение
				Сообщить("Не удалось записать новый релиз в справочник ""Внешние обработки""");
			КонецПопытки;				
		КонецЕсли;				
	ИначеЕсли РежимИспользования = "Файл внешней обработки" Тогда
		// Переносим текущую обработку в UPDATE 
		ПереместитьФайл(ПутьТекОбработки + ИмяТекОбработки,
		ПутьАрхиваUpdate + "Архив E_COM_" + ВерсияОбработки + ".epf"); 
		
		// Переносим новую обработку в текущий каталог
		ПереместитьФайл(ЛокальныйКаталогUPDATE + ФайлEPF.Имя,
		ПутьТекОбработки + ИмяТекОбработки);
		
		ОбработкаОбъект.ЭКОМ_ИсторияОбмена_УдалитьЗапись(ЭтаФорма.ВерсияМодуля, МассивЛогаСобытий);
		
		Структура = Новый Структура;
		Структура.Вставить("Комментарий"  , ЭтаФорма.Описание);        // Описание
		Структура.Вставить("ДатаПолучения", ЭтаФорма.ДатаОбработки);
		Структура.Вставить("Причина", "Установлена");
		ОбработкаОбъект.ЭКОМ_ИсторияОбмена_Записать(Перечисления.ЭКОМ_НаправлениеОбмена.Входящий, Перечисления.ЭКОМ_ВидыДокументов.ПустаяСсылка(), ЭтаФорма.ВерсияМодуля, Структура);		
		
		Результат.ТекстСообщения = "Модуль 1С Docrobot обновлен. Пожалуйста перезапустите обработку!"; 
		Результат.Успешно = Истина;
	ИначеЕсли РежимИспользования = "Обработка в составе конфигурации" Тогда
		
		//ТекстСообщения = "Автоматическая установка новой версии модуля невозможна!";
        Результат.ТекстСообщения = "Автоматическая установка новой версии модуля невозможна!" + Символы.ПС + "Внесите обновление вручную через конфигуратор";
        
        ФайлОбновленияФС = Новый Файл(ЭтаФорма.ФайлОбновленияИмя);
        ПутьТекОбработки = ФайлОбновленияФС.Путь;
        Если ФайлОбновленияФС.Существует() Тогда
            //Предупреждение("Автоматическая установка новой версии модуля невозможна!" + Символы.ПС + "Внесите обновление вручную через конфигуратор");
            ЗапуститьПриложение(ПутьТекОбработки);
        Иначе
            //Предупреждение("Отсутствует информация о расположении файла обновлений");
        КонецЕсли;
		
	Иначе
		
		Результат.ТекстСообщения =  "Автоматическая установка новой версии модуля не настроена!"; 
		
	КонецЕсли;
	
	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Результат.ТекстСообщения = Вычислить("ЭКОМ_ОбщегоНазначения.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий, Результат.ТекстСообщения)");
	КонецЕсли;
	
    Возврат Результат;
 
КонецФункции

&НаКлиенте
Процедура ПроверитьОбновленияОтобразитьРезультаты() Экспорт
    
    ЗначениеПоУмолчанию = Неопределено;
	Измерение           = Неопределено; 
	Обязательно         = Истина;
	
	МассивЛогаСобытий = Новый Массив;
	РезультатПроверкиОбновлений = ПроверитьОбновлениеНаСервере();
	Если РезультатПроверкиОбновлений.ОбновлениеЗагружено = Истина Тогда
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(РезультатПроверкиОбновлений.ДанныеОбработки.АдресВоВременномХранилище);
		СохранитьОбновленияНаДиск(ДвоичныеДанныеФайла, РезультатПроверкиОбновлений.ДанныеОбработки.ФайлОбновленияИмя, ЛокальныйКаталогUPDATE, МассивЛогаСобытий);
	Иначе
		ДанныеНайдены = ПолучитьИнформациюОбОбновлении(РезультатПроверкиОбновлений.ДанныеОбработки, ЛокальныйКаталогUPDATE, МассивЛогаСобытий);
		Если НЕ ДанныеНайдены Тогда
			 
			 ДанныеСкачивания = СкачатьОбновленияПовторно(ЛогСобытий);
			 ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ДанныеСкачивания.АдресВоВременномХранилище);
			 СохранитьОбновленияНаДиск(ДвоичныеДанныеФайла, ДанныеСкачивания.ИмяФайлаНаFTP, ЛокальныйКаталогUPDATE, МассивЛогаСобытий);
			 ДанныеНайдены = ПолучитьИнформациюОбОбновлении(РезультатПроверкиОбновлений.ДанныеОбработки, ЛокальныйКаталогUPDATE, МассивЛогаСобытий);

		КонецЕсли;
	КонецЕсли;

	Если РезультатПроверкиОбновлений.НеобходимоОбновление = Истина Тогда		
	    ЗаполнитьЗначенияСвойств(ЭтаФорма, РезультатПроверкиОбновлений.ДанныеОбработки);
	    СтатусПроверкиОбновлений = "Обновления загружены в локальный каталог обновлений " + Строка(РезультатПроверкиОбновлений.ДанныеОбработки.ДатаУстановки);
	Иначе
	    СтатусПроверкиОбновлений = "Обновления отсутствуют " + Строка(ТекущаяДата());
    КонецЕсли;

	Если ТипЗнч(РезультатПроверкиОбновлений) = Тип("Структура") Тогда
        ЗаполнитьЗначенияСвойств(ЭтаФорма, РезультатПроверкиОбновлений.ДанныеОбработки);
    КонецЕсли;
	
	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий)");
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьОбновлениеНаСервере() Экспорт
    
    ЛогСобытий = "";
    ОбъектЭтаОбработка = РеквизитФормыВЗначение("Объект");
    
    РезультатПроверкиОбновлений = ОбъектЭтаОбработка.ПроверитьОбновление(ЭКОМОбъектыАктуальны, ЛогСобытий);
	    
    Возврат РезультатПроверкиОбновлений;
КонецФункции

&НаКлиенте
Процедура ОткрытьФайлИлиКаталог(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
    
	ПолныйПуть = Элемент.ТекстРедактирования;
	Если Не ЗначениеЗаполнено(ПолныйПуть) Тогда
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ПолныйПуть);
	Если НЕ Файл.Существует() Тогда
		Возврат;
	КонецЕсли;
    
    ПутьДляЗапуска = ?(Файл.ЭтоФайл(), Файл.Путь, ПолныйПуть);
	ЗапуститьПриложение(ПутьДляЗапуска);
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИнформациюОбОбновлении(ДанныеОбработки, ЛокальныйКаталогUPDATE, ЛогСобытий)
	
	ДанныеНайдены = Истина;
	
	Ошибка = ПроверкаКаталога(ЛокальныйКаталогUPDATE, ЛогСобытий);
	Если Ошибка = Ложь Тогда		
		
		ФайлыEPF = НайтиФайлы(ЛокальныйКаталогUPDATE, "*" + ДанныеОбработки.ВерсияМодуля + "*" + ".epf");
		Если ФайлыEPF.Количество() > 0 Тогда
			ФайлEPF = ФайлыEPF[0];
			ДанныеОбработки.ФайлОбновленияИмя = ФайлEPF.ПолноеИмя;	
		Иначе
			ДанныеНайдены = Ложь;
		КонецЕсли;
		
		ФайлыCF = НайтиФайлы(ЛокальныйКаталогUPDATE, "*" + ДанныеОбработки.ВерсияМодуля + "*" + ".cf");
		Если ФайлыCF.Количество() > 0 Тогда
			ФайлCF = ФайлыCF[0];
			ДанныеОбработки.ФайлКонфигурацииИмя = ФайлCF.ПолноеИмя;
		Иначе
			ДанныеНайдены = Ложь;
		КонецЕсли;
		
		// Описание изменений
		ФайлыTXT = НайтиФайлы(ЛокальныйКаталогUPDATE, "*" + ДанныеОбработки.ВерсияМодуля + "*" + ".txt");
		Если ФайлыTXT.Количество() > 0 Тогда
			ФайлTXT = ФайлыTXT[0];
			ТекстовыйФайл   = Новый ЧтениеТекста(ФайлTXT.ПолноеИмя);
			Описание        = ТекстовыйФайл.Прочитать();
			ТекстовыйФайл.Закрыть();
			ДанныеОбработки.Описание = Описание;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеНайдены;
	
КонецФункции

&НаКлиенте
Процедура СохранитьОбновленияНаДиск(ДвоичныеДанныеФайла, ИмяФайлаНаFTP, ЛокальныйКаталогUPDATE, МассивЛогаСобытий) Экспорт
	
	Ошибка = ПроверкаКаталога(ЛокальныйКаталогUPDATE, МассивЛогаСобытий);
	Если Ошибка = Ложь Тогда		
		ДвоичныеДанныеФайла.Записать(ЛокальныйКаталогUPDATE + ИмяФайлаНаFTP);	
		ЧтениеZIP 		= Новый ЧтениеZipФайла(ЛокальныйКаталогUPDATE + ИмяФайлаНаFTP);
		ЧтениеZIP.ИзвлечьВсе(ЛокальныйКаталогUPDATE);
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаКаталога(ПутьКаталога, МассивЛогаСобытий)
	
	ИмяСобытия = "Проверка каталога";
	Ошибка = Ложь;
	
	// Проверка каталога 
	Если НЕ ЗначениеЗаполнено(ПутьКаталога) Тогда
		ТекстЛогаСобытий = "Отсутствует значение каталога обновлений (239-2)";
		ЗаписьСтруктурыЛога = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение(""Перечисление.ЭКОМ_УровниЛогирования.Ошибка""), ИмяСобытия)");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

		Ошибка = Истина;
	Иначе
		КаталогНаДиске = Новый Файл(ПутьКаталога);
		Если НЕ КаталогНаДиске.Существует() Тогда
			ТекстЛогаСобытий = "Отсутствует каталог обновлений (239-3)";
			ЗаписьСтруктурыЛога = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение(""Перечисление.ЭКОМ_УровниЛогирования.Ошибка""), ИмяСобытия)");
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
			
			Ошибка = Истина;
		КонецЕсли;
		
	КонецЕсли;	
	
	Если Ошибка = Ложь Тогда
		Если НЕ Прав(ПутьКаталога, 1) = "\" Тогда
			ПутьКаталога = ПутьКаталога + "\"; 
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Ошибка;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьЛогСобытийНаКлиенте(ЛогСобытий, Знач ТекстЛогаСобытий) Экспорт
    
    Если ПустаяСтрока(ТекстЛогаСобытий) Тогда
        Возврат;
    Иначе
        ТекстЛогаСобытий = Строка(ТекущаяДата()) + ": " + ТекстЛогаСобытий;
    КонецЕсли;
    
    Если ТипЗнч(ЛогСобытий) = Тип("Строка") Тогда
        Если ЗначениеЗаполнено(ЛогСобытий) Тогда
            ЛогСобытий = ЛогСобытий + Символы.ПС +  ТекстЛогаСобытий;
        Иначе
            ЛогСобытий = ТекстЛогаСобытий;
        КонецЕсли;
    ИначеЕсли ТипЗнч(ЛогСобытий) = Тип("Массив") Тогда
		ЛогСобытий.Добавить(ТекстЛогаСобытий);
    КонецЕсли;
    
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкиПрочитатьНаСервере(ИмяНастройки, ЗначениеПоУмолчанию, Измерение, Обязательно)

	Возврат Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(ИмяНастройки, ЗначениеПоУмолчанию, Измерение, Обязательно)");
	
КонецФункции

&НаСервере
Функция СкачатьОбновленияПовторно(МассивЛогаСобытий)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ПараметрыFTP = ОбработкаОбъект.ПолучитьНастройкиОбновленийСервераFTP();
	СерверFTP = ОбработкаОбъект.ПолучитьСерверFTP(ПараметрыFTP, МассивЛогаСобытий);
	ДанныеСкачивания = ОбработкаОбъект.СкачатьОбновление(СерверFTP, МассивЛогаСобытий);

	Возврат ДанныеСкачивания;
	
КонецФункции

&НаКлиенте
Процедура ЛокальныйКаталогUPDATEОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    
	ПолныйПуть = Элемент.ТекстРедактирования;
	Если Не ЗначениеЗаполнено(ПолныйПуть) Тогда
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ПолныйПуть);
	Если НЕ Файл.Существует() Тогда
		Возврат;
	КонецЕсли;
    
    ПутьДляЗапуска = ?(Файл.ЭтоФайл(), Файл.Путь, ПолныйПуть);
	ЗапуститьПриложение(ПутьДляЗапуска);

КонецПроцедуры



