
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
		Если Параметры.ЗначенияЗаполнения.Свойство("Документ") Тогда
			ДокументПараметр = Параметры.ЗначенияЗаполнения.Документ;	
		КонецЕсли;	
	КонецЕсли;
	
	Если Параметры.Свойство("Документ") Тогда
		ДокументПараметр = Параметры.Документ;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(ДокументПараметр) Тогда
		Запись.Документ = ДокументПараметр;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы = Истина Тогда
		ТекстПредупреждения = "Необходимо закрыть форму!";
		Отказ = Истина;
	Иначе
		
		Если ЭтаФорма.ЗакрытьФормуПринудительно = Ложь Тогда
			
			ОбязательныеПоля = Новый Соответствие;
			ОбязательныеПоля.Вставить("Номер ТС"                  , Запись.Номер);
			ОбязательныеПоля.Вставить("Краткое наименование груза", Запись.КраткоеНаименованиеГруза);
			//ОбязательныеПоля.Вставить("Номер рейса"               , Запись.НомерРейса);
			ОбязательныеПоля.Вставить("Водитель фамилия"          , Запись.ВодительФамилия);
			ОбязательныеПоля.Вставить("Водитель имя"              , Запись.ВодительИмя);
			ОбязательныеПоля.Вставить("Водитель телефон"          , Запись.ВодительТелефон);
			//ОбязательныеПоля.Вставить("Водительское удостоверение", Запись.ВодительскоеУдостоверение);
			
			Текст = "";
			Для каждого Структура Из ОбязательныеПоля Цикл				
				Если НЕ ЗначениеЗаполнено(Структура.Значение) Тогда
					 Текст = ?(Текст = "", "", Символы.ПС)  + "Не заполнено поле - <<" + Структура.Ключ + ">>";
				КонецЕсли;			
			КонецЦикла;	
				
			Если ЗначениеЗаполнено(Текст) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = Текст;
				Сообщение.Сообщить();
				
				Данные     = Новый Структура;
				Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтаФорма, Данные); 		
				ПоказатьВопрос(Оповещение, "Не заполнены обязательные поля. Закрыть форму?", РежимДиалогаВопрос.ДаНетОтмена, 0);
				Отказ = Истина;
				
			КонецЕсли;	
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, Данные) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да  Тогда
		ЭтаФорма.ЗакрытьФормуПринудительно = Истина;
		ЭтаФорма.Закрыть();	   
	ИначеЕсли  Результат = КодВозвратаДиалога.Нет Тогда

		Возврат;
	Иначе
		
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ФормаДляОповещения", "Обработка.УФ_Форма");
	Оповестить("ОбновитьСписокЭТРН", ПараметрыОповещения);

КонецПроцедуры

