
&НаКлиенте
Процедура ДеревоНаправленийДеятельностиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНаправленийДеятельностиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДеревоНаправленийДеятельности();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоНаправленийДеятельности()
	
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	|	НаправленияДеятельности.Ссылка КАК Ссылка,
	|	НаправленияДеятельности.ЭтоГруппа,
	|	НаправленияДеятельности.УчетВнеоборотныхАктивов КАК УчетВнеоборотныхАктивов,
	|	ВЫБОР
	|		КОГДА НаправленияДеятельности.Ссылка В (&ОсновныеНД)
	|				И НЕ НаправленияДеятельности.ЭтоГруппа
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Пометка,
	|	НаправленияДеятельности.Наименование
	|ИЗ
	|	Справочник.НаправленияДеятельности КАК НаправленияДеятельности
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ОсновныеНД",Параметры.ОсновныеНаправленияДеятельности);
	
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией); 

	ЗначениеВРеквизитФормы(Дерево,"ДеревоНаправленийДеятельности");
	
	//На всякий случай добаим пустую ссылку.
    ТекЭлемент 							= ДеревоНаправленийДеятельности.ПолучитьЭлементы().Добавить();
	ТекЭлемент.Ссылка					= Справочники.НаправленияДеятельности.ПустаяСсылка();
	ТекЭлемент.Наименование				= "<Пустое значение>";
	ТекЭлемент.ЭтоГруппа				= Ложь;
	ТекЭлемент.Пометка					= ?(Параметры.ОсновныеНаправленияДеятельности.НайтиПоЗначению(ТекЭлемент.Ссылка) = Неопределено, Ложь, Истина);
	ТекЭлемент.УчетВнеоборотныхАктивов 	= Истина;
	
КонецПроцедуры

&НаСервере
Процедура ВыдатьРекурсивноДеревоНаправленийДеятельности(КорневаяСтрока,Выборка) 	
	
	Перем НоваяВыборка;
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Ссылка) ИЛИ Выборка.Ссылка = КорневаяСтрока.Ссылка Тогда 
			Продолжить;
		КонецЕсли;
		
		КорневаяСтрока.ЕстьПодчиненные = Истина;
		
		НоваяСтрока = КорневаяСтрока.ПолучитьЭлементы().Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		СпособВыборки = ОбходРезультатаЗапроса.ПоГруппировкамСИерархией;
		Если Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоИерархии Тогда
			НоваяВыборка  = Выборка.Выбрать(СпособВыборки, Выборка.Группировка());
		Иначе
			НоваяВыборка  = Выборка.Выбрать(СпособВыборки);
		КонецЕсли;
		ВыдатьРекурсивноДеревоНаправленийДеятельности(НоваяСтрока, НоваяВыборка);
	
	КонецЦикла;
	
КонецПроцедуры // ВыдатьРекурсивноДеревоСтруктурныхПодразделений()

&НаКлиенте
Процедура Выбрать(Команда)
	
	СписокОтмеченныхНаправленийДеятельности = Новый СписокЗначений;
	
	ВыгрузитьПомеченныеВСписок(СписокОтмеченныхНаправленийДеятельности, ДеревоНаправленийДеятельности);
	
	Закрыть(СписокОтмеченныхНаправленийДеятельности);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПомеченныеВСписок(СписокОтмеченных, ДеревоДляВыгрузки)
	
	ЭлементыДерева = ДеревоДляВыгрузки.ПолучитьЭлементы();
	
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		
		Если ЭлементДерева.Пометка Тогда
			СписокОтмеченных.Добавить(ЭлементДерева.Ссылка);
		КонецЕсли;	
		
		Если ЭлементДерева.ПолучитьЭлементы().Количество() Тогда
			ВыгрузитьПомеченныеВсписок(СписокОтмеченных, ЭлементДерева)
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

