#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

Процедура НачальноеЗаполнение () Экспорт
	
	ЗаполнитьКоэффициентыСтавкиРефинансированияНБ();
	
КонецПроцедуры

Процедура ЗаполнитьКоэффициентыСтавкиРефинансированияНБ() Экспорт
	
	НаборЗаписей = РегистрыСведений.КоэффициентыСтавкиРефинансированияНБ.СоздатьНаборЗаписей();

	// с 1 января 2015
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20150101', Перечисления.ВидыНалоговВзносовОтчислений.ОПВ, 	2.5);
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20150101', Перечисления.ВидыНалоговВзносовОтчислений.ОППВ, 	2.5);
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20150101', Перечисления.ВидыНалоговВзносовОтчислений.СО, 	2.5);
	
	// С 1 июля 2017
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20170701', Перечисления.ВидыНалоговВзносовОтчислений.ООСМС,	2.5);
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20170701', Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС,	2.5);
	
	// с 1 января 2018
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20180101', Перечисления.ВидыНалоговВзносовОтчислений.ОПВ, 	1.5);
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20180101', Перечисления.ВидыНалоговВзносовОтчислений.ОППВ, 	1.5);
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20180101', Перечисления.ВидыНалоговВзносовОтчислений.СО, 	1.5);
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20180101', Перечисления.ВидыНалоговВзносовОтчислений.ООСМС,	1.5);
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20180101', Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС,	1.5);

	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, Период, ВидНалогаВзносаОтчисления, Коэффициент)
	
   	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;  
	НоваяЗапись.ВидНалогаВзносаОтчисления = ВидНалогаВзносаОтчисления;
	НоваяЗапись.Коэффициент = Коэффициент;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли