
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		КодыСтрок.Отбор,
		"ВидОперации",
		Объект.Ссылка,
		ВидСравненияКомпоновкиДанных.Равно,
		"Вид реализации ТМЗ",
		Истина);
	
	Элементы.ГруппаПризнакКорректировки.Видимость = НЕ Объект.НеЯвляетсяОборотомПоРеализации;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		КодыСтрок.Отбор,
		"ВидОперации",
		Объект.Ссылка,
		ВидСравненияКомпоновкиДанных.Равно,
		"Вид реализации ТМЗ",
		Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПолноеНаименование) Тогда
		Объект.ПолноеНаименование = Объект.Наименование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодыСтрокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ТекстВопроса = НСтр("ru = 'Перед редактированием данных по Декларации необходимо записать элемент.
			|Записать?'");
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗаписатьВФорме", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0);
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НеЯвляетсяОборотомПоРеализацииПриИзменении(Элемент)
	НеЯвляетсяОборотомПоРеализацииПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияВопросаЗаписатьВФорме(Результат, Параметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если Записать() Тогда
			ЗначенияЗаполнения = Новый Структура("ВидОперации", Объект.Ссылка);
			ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
			ОткрытьФорму("РегистрСведений.КодыСтрокДекларацииПоНДС.ФормаЗаписи", ПараметрыФормы, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НеЯвляетсяОборотомПоРеализацииПриИзмененииНаСервере()
	
	Элементы.ГруппаПризнакКорректировки.Видимость = НЕ Объект.НеЯвляетсяОборотомПоРеализации;
	Если Объект.НеЯвляетсяОборотомПоРеализации Тогда
		Объект.ВидНДС = Перечисления.ВидыНДС.НДС;
		Объект.ПризнакКорректировки = Ложь;
	Иначе
		Объект.ВидНДС = Перечисления.ВидыНДС.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти