#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	//ограничим выбор значений только используемыми
	ДанныеВыбора.Добавить(Перечисления.СпособыНачисленияАмортизацииОС.Линейный);
	ДанныеВыбора.Добавить(Перечисления.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка);
	ДанныеВыбора.Добавить(Перечисления.СпособыНачисленияАмортизацииОС.ПоСуммеЧиселЛетИспользования);
	ДанныеВыбора.Добавить(Перечисления.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции);
	ДанныеВыбора.Добавить(Перечисления.СпособыНачисленияАмортизацииОС.ПоЕНАОФ);
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли