#Область СлужебныйПрограммныйИнтерфейс

// Возвращает признак необходимости контроля статусов кодов маркировок ИС МП.
//
// Параметры:
// Возвращаемое значение:
//  Произвольный - Истина, в случае необходимости контроля статусов.
Функция КонтролироватьСтатусыКодовМаркировки() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("КонтролироватьСтатусыКодовМаркировкиИСМП");
	
КонецФункции

// Возвращает признак необходимости контроля статусов кодов маркировок при розничной торговле.
//
// Параметры:
// Возвращаемое значение:
//  Булево - Истина, в случае необходимости контроля статусов.
Функция КонтролироватьСтатусыКодовМаркировкиВРознице() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("КонтролироватьСтатусыКодовМаркировкиВРозницеИСМП");
	
КонецФункции

// Возвращает признак наличия типа метаданных конфигурации в типе реквизита "ДокументОснование"
// Наличие типа означает то, что документ может иметь документ-основание
// 
// Параметры:
// Возвращаемое значение:
// 	Булево - Истина, в случае необходимости контроля статусов.
//
Функция ДокументМожетИметьДокументОснование(ПолноеИмяМетаданных) Экспорт
	
	ЭлементМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмяМетаданных);
	
	Если ЭлементМетаданных = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Реквизит = ЭлементМетаданных.Реквизиты.Найти("ДокументОснование");
	
	Если Реквизит = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаТип Из Реквизит.Тип.Типы() Цикл
		Если Метаданные.НайтиПоТипу(СтрокаТип) <> Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Проверяет на тестовый период текущую дату сеанса.
// 
// Возвращаемое значение:
//  Булево - Истина, если текущая дата сеанса находится в тестовом периоде.
Функция ЭтоТестовыйПериод() Экспорт
		
	ЭтоТестовыйПериод = ПолучитьФункциональнуюОпцию("ВестиУчетОбувнойПродукцииИСМП")
		И ДатаОбязательнойМаркировкиОбуви() > НачалоДня(ТекущаяДатаСеанса());
	
	Возврат ЭтоТестовыйПериод;

	
КонецФункции

// Возвращает дату обязательной маркировки табачных изделий.
// 
// Параметры:
// Возвращаемое значение:
// 	Дата - дата обязательной маркировки табачных изделий.
//
Функция ДатаОбязательнойМаркировкиОбуви()
	
	Возврат Константы.ДатаОбязательнойМаркировкиОбувиИСМП.Получить();

КонецФункции



#КонецОбласти