
&ИзменениеИКонтроль("ЗаполнитьТабличнуюЧастьТовары")
Процедура игр_ЗаполнитьТабличнуюЧастьТовары(ДокументОснование)

	Запрос = Новый Запрос;

	ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач = СкладыСервер.ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач(Склад);

	Если ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач Тогда 

		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТоварыКОформлению.Номенклатура КАК Номенклатура,
		|	ТоварыКОформлению.Характеристика КАК Характеристика,
		|	ТоварыКОформлению.Назначение КАК Назначение,
		|	ТоварыКОформлению.Серия КАК Серия,
		|	СУММА(ТоварыКОформлению.КОформлениюАктовОстаток) КАК Количество
		|ПОМЕСТИТЬ ТоварыКОформлению
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТоварыКОформлению.Номенклатура КАК Номенклатура,
		|		ТоварыКОформлению.Характеристика КАК Характеристика,
		|		ТоварыКОформлению.Назначение КАК Назначение,
		|		ТоварыКОформлению.Серия КАК Серия,
		|		-ТоварыКОформлению.КОформлениюАктовОстаток КАК КОформлениюАктовОстаток
		|	ИЗ
		|		РегистрНакопления.ТоварыКОформлениюИзлишковНедостач.Остатки(, Склад = &Склад) КАК ТоварыКОформлению
		|	ГДЕ
		|		ТоварыКОформлению.КОформлениюАктовОстаток < 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТоварыКОформлению.Номенклатура,
		|		ТоварыКОформлению.Характеристика,
		|		ТоварыКОформлению.Назначение,
		|		ТоварыКОформлению.Серия,
		|		ТоварыКОформлению.КОформлениюАктов
		|	ИЗ
		|		РегистрНакопления.ТоварыКОформлениюИзлишковНедостач КАК ТоварыКОформлению
		|	ГДЕ
		|		ТоварыКОформлению.Регистратор = &СписаниеНедостачТоваров
		|		И ТоварыКОформлению.Активность = ИСТИНА) КАК ТоварыКОформлению
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКОформлению.Номенклатура,
		|	ТоварыКОформлению.Характеристика,
		|	ТоварыКОформлению.Назначение,
		|	ТоварыКОформлению.Серия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТоварыКОформлению.Номенклатура,
		|	ТоварыКОформлению.Характеристика,
		|	ТоварыКОформлению.Серия,
		|	ТоварыКОформлению.Назначение,
		|	ТоварыКОформлению.Количество
		|ИЗ
		|	ТоварыКОформлению КАК ТоварыКОформлению
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПересчетТоваров.Товары КАК ПересчетТоваровТовары
		|		ПО (&НаОснованииПересчета)
		|			И ТоварыКОформлению.Номенклатура = ПересчетТоваровТовары.Номенклатура
		|			И ТоварыКОформлению.Характеристика = ПересчетТоваровТовары.Характеристика
		|			И ТоварыКОформлению.Назначение = ПересчетТоваровТовары.Назначение
		|			И (ПересчетТоваровТовары.СтатусУказанияСерий <> 14
		|				ИЛИ ТоварыКОформлению.Серия = ПересчетТоваровТовары.Серия)
		|			И (ПересчетТоваровТовары.Количество <> ПересчетТоваровТовары.КоличествоФакт)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОрдерНаОтражениеНедостачТоваров.Товары КАК ОрдерНаОтражениеНедостачТоваровТовары
		|		ПО (&НаОснованииОрдера)
		|			И ТоварыКОформлению.Номенклатура = ОрдерНаОтражениеНедостачТоваровТовары.Номенклатура
		|			И ТоварыКОформлению.Характеристика = ОрдерНаОтражениеНедостачТоваровТовары.Характеристика
		|			И ТоварыКОформлению.Назначение = ОрдерНаОтражениеНедостачТоваровТовары.Назначение
		|			И (ОрдерНаОтражениеНедостачТоваровТовары.СтатусУказанияСерий <> 14
		|				ИЛИ ТоварыКОформлению.Серия = ОрдерНаОтражениеНедостачТоваровТовары.Серия)
		|ГДЕ
		|	(НЕ &НаОснованииПересчета
		|			ИЛИ &НаОснованииПересчета
		|				И НЕ ПересчетТоваровТовары.Номенклатура ЕСТЬ NULL 
		|				И ПересчетТоваровТовары.Ссылка = &ДокументОснование)
		|	И (НЕ &НаОснованииОрдера
		|			ИЛИ &НаОснованииОрдера
		|				И НЕ ОрдерНаОтражениеНедостачТоваровТовары.Номенклатура ЕСТЬ NULL 
		|				И ОрдерНаОтражениеНедостачТоваровТовары.Ссылка = &ДокументОснование)";

		Запрос.УстановитьПараметр("СписаниеНедостачТоваров", Ссылка);
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
		НаОснованииПересчета = ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПересчетТоваров");
		Запрос.УстановитьПараметр("НаОснованииПересчета", НаОснованииПересчета);
		НаОснованииОрдера = ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОрдерНаОтражениеНедостачТоваров");
		Запрос.УстановитьПараметр("НаОснованииОрдера", НаОснованииОрдера);

	Иначе

		#Удаление
		// На неордерном складе ДокументОснование будет только пересчет
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПересчетТоваровТовары.Номенклатура,
		|	ПересчетТоваровТовары.Характеристика,
		|	ПересчетТоваровТовары.Назначение,
		|	ПересчетТоваровТовары.Серия,
		|	ПересчетТоваровТовары.Количество - ПересчетТоваровТовары.КоличествоФакт КАК Количество
		|ИЗ
		|	Документ.ПересчетТоваров.Товары КАК ПересчетТоваровТовары
		|ГДЕ
		|	ПересчетТоваровТовары.Ссылка = &Ссылка
		|	И ПересчетТоваровТовары.Количество - ПересчетТоваровТовары.КоличествоФакт > 0";
		#КонецУдаления
		#Вставка
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПересортицаТоваровТовары.Номенклатура КАК Номенклатура,
		|	ПересортицаТоваровТовары.Характеристика КАК Характеристика,
		|	СУММА(ПересортицаТоваровТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТПересортица
		|ИЗ
		|	Документ.ПересортицаТоваров.Товары КАК ПересортицаТоваровТовары
		|ГДЕ
		|	ПересортицаТоваровТовары.Ссылка.ПересчетТоваров = &Ссылка
		|	И ПересортицаТоваровТовары.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ПересортицаТоваровТовары.Номенклатура,
		|	ПересортицаТоваровТовары.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПересчетТоваровТовары.Номенклатура КАК Номенклатура,
		|	ПересчетТоваровТовары.Характеристика КАК Характеристика,
		|	ПересчетТоваровТовары.Назначение КАК Назначение,
		|	ПересчетТоваровТовары.Серия КАК Серия,
		|	ПересчетТоваровТовары.Количество - ПересчетТоваровТовары.КоличествоФакт - ЕСТЬNULL(ВТПересортица.Количество, 0) КАК Количество
		|ИЗ
		|	Документ.ПересчетТоваров.Товары КАК ПересчетТоваровТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПересортица КАК ВТПересортица
		|		ПО ПересчетТоваровТовары.Номенклатура = ВТПересортица.Номенклатура
		|			И ПересчетТоваровТовары.Характеристика = ВТПересортица.Характеристика
		|ГДЕ
		|	ПересчетТоваровТовары.Ссылка = &Ссылка
		|	И ПересчетТоваровТовары.Количество - ПересчетТоваровТовары.КоличествоФакт - ЕСТЬNULL(ВТПересортица.Количество, 0) > 0";
		#КонецВставки

		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);

	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	Если Не Результат.Пустой() Тогда

		Товары.Загрузить(Результат.Выгрузить());

	ИначеЕсли ЗначениеЗаполнено(ДокументОснование) Тогда  

		ТекстСообщения = НСтр("ru = 'В документе ""%ДокументОснование%"" отсутствуют товары, по которым необходимо оформить списание.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДокументОснование%", ДокументОснование);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект);

	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура игр_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ДокументОснование = Неопределено;
	ЗаполнитьТабличнуюЧастьТовары = Истина;

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда

		Если ДанныеЗаполнения.Свойство("АктОРасхождениях") 
			И ДанныеЗаполнения.Свойство("ОснованиеАкта") Тогда

			ЗаполнитьДокументНаОснованииАктаПриемки(ДанныеЗаполнения);
			ДокументОснование = ДанныеЗаполнения.АктОРасхождениях;
			ЗаполнитьТабличнуюЧастьТовары = Ложь;

		Иначе

			ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
			ЗаполнитьТабличнуюЧастьТовары = НЕ ДанныеЗаполнения.Свойство("НеЗаполнятьТаблинуюЧастьТовары");

		КонецЕсли;

	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ДанныеЗаполнения))
		И ДанныеЗаполнения <> Неопределено Тогда 	
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПересчетТоваров") Тогда 
			СтруктураРезультат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Статус, Склад");
			Если СтруктураРезультат.Статус <> Перечисления.СтатусыПересчетовТоваров.Выполнено Тогда 
				ТекстСообщения = НСтр("ru='Документ ""%ДокументПересчет%"" находится в статусе ""%СтатусПересчета%"". Ввод документа ""%ДокументАкт%"" на основании разрешен только в статусе ""%СтатусВыполнено%"".'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДокументПересчет%", ДанныеЗаполнения);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДокументАкт%", Метаданные.Документы.СписаниеНедостачТоваров.Синоним);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СтатусВыполнено%", Перечисления.СтатусыПересчетовТоваров.Выполнено);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СтатусПересчета%", СтруктураРезультат.Статус);
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;
			Склад = СтруктураРезультат.Склад;
			ПересчетТоваров = ДанныеЗаполнения;
		#Вставка     
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияПодарочныхСертификатов") Тогда
			игр_ЗаполнитьНаОснованииРеализацииСертификатов(ДанныеЗаполнения);	
			ЗаполнитьТабличнуюЧастьТовары	= Ложь;
		#КонецВставки
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Склад) Тогда
			Склад = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Склад");	
		КонецЕсли;

		ДокументОснование = ДанныеЗаполнения;

	КонецЕсли;

	ИнициализироватьДокумент(ДанныеЗаполнения);

	ОтветственныеЛицаСервер.ОтветственныеЛицаДокументаОбработкаЗаполнения(Ссылка, ДанныеЗаполнения, СтандартнаяОбработка);
	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьСвойстваОбъекта(ЭтотОбъект, ДанныеЗаполнения);

	Если ЗаполнитьТабличнуюЧастьТовары Тогда 
		ЗаполнитьТабличнуюЧастьТовары(ДокументОснование);
	КонецЕсли;

КонецПроцедуры

Процедура игр_ЗаполнитьНаОснованииРеализацииСертификатов(ДанныеЗаполнения)
	
	Основание	= ДанныеЗаполнения;
	
	Запрос	= Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияПодарочныхСертификатов.Организация КАК Организация,
	|	РеализацияПодарочныхСертификатов.КассаККМ КАК КассаККМ,
	|	РеализацияПодарочныхСертификатов.Дата КАК Дата,
	|	РеализацияПодарочныхСертификатов.Ссылка КАК Ссылка,
	|	Склады.Ссылка КАК Склад,
	|	Склады.Подразделение КАК Подразделение
	|ИЗ
	|	Документ.РеализацияПодарочныхСертификатов КАК РеализацияПодарочныхСертификатов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КассыККМ КАК КассыККМ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	|			ПО КассыККМ.Склад = Склады.Ссылка
	|		ПО РеализацияПодарочныхСертификатов.КассаККМ = КассыККМ.Ссылка
	|ГДЕ
	|	РеализацияПодарочныхСертификатов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодарочныеСертификаты.Сумма КАК Сумма,
	|	ПодарочныеСертификаты.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.РеализацияПодарочныхСертификатов.ПодарочныеСертификаты КАК ПодарочныеСертификаты
	|ГДЕ
	|	ПодарочныеСертификаты.Ссылка = &Ссылка"
	;
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Результаты	= Запрос.ВыполнитьПакет();
	
	Выборка	= Результаты[0].Выбрать();
	Если Выборка.Следующий() Тогда
		
		Организация	= Выборка.Организация;
		Дата		= Выборка.Дата;
		Склад		= Выборка.Склад;
		Подразделение	= Выборка.Подразделение;
		
	КонецЕсли; 
	
	СтатьяРасходов	= ПланыВидовХарактеристик.игр_ПроизвольныеПредопределенныеОбъекты.ПолучитьЗначение(
		"СтатьяСписанияПодарочных");
	
	Комментарий	= "Списание подарочных сертификатов";
	
	Товары.Очистить();
	
	НоменклатураСертификатов	= ПланыВидовХарактеристик.игр_ПроизвольныеПредопределенныеОбъекты.ПолучитьДополнительныеЗначения(
		"НоменклатураПодарочныхСертификатов");
	
	Выборка	= Результаты[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		КодСертификата	= Формат(Выборка.Сумма, "ЧГ=");
		Если НоменклатураСертификатов[КодСертификата] <> Неопределено Тогда
			НоваяСтрока	= Товары.Добавить();
			НоваяСтрока.Номенклатура	= НоменклатураСертификатов[КодСертификата]; 
			НоваяСтрока.Количество		= 1; 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
