
&НаКлиенте
Процедура ПодборИзКлассификатора(Команда)
	
	ПодборИзКлассификатораНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры

// Процедура заполняет справочник недостающими записями.
//
Процедура ПодборИзКлассификатораНаСервере()

	Справочники.ЭКОМ_ТипыНеструктДокументов.ОбновитьСправочникТиповНеструктурированныхДокументов();
	
КонецПроцедуры // ПодборИзКлассификатораНаСервере()

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Элементы.Список.Обновить();
	Элементы.Список.ТекущаяСтрока = ВыбранноеЗначение;
	
КонецПроцедуры
