////////////////////////////////////////////////////////////////////////////////
//
// ЗатратыСервер: Распределение производственных затрат и затрат незавершенного производства.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура выполняет запись движений производственных затрат.
//
// Параметры:
//	ДополнительныеСвойства - Структура - структура с данными для записи
//	Движения - Движения - Движения регистра "Производственные затраты"
//	Отказ - Булево - Признак отказа от записи движений.
//
Процедура ОтразитьМатериалыИРаботыВПроизводстве(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаМатериалыИРаботыВПроизводстве;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Набор = Движения.МатериалыИРаботыВПроизводстве;
	Набор.Записывать = Истина;
	Набор.Загрузить(Таблица);
	
КонецПроцедуры

// Процедура выполняет запись движений партий производственных затрат.
//
// Параметры:
//	ДополнительныеСвойства - Структура - структура с данными для записи
//	Движения - Движения - Движения регистра "Партии производственных затрат"
//	Отказ - Булево - Признак отказа от записи движений.
//
Процедура ОтразитьПартииПроизводственныхЗатрат(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПартииПроизводственныхЗатрат;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Набор = Движения.ПартииПроизводственныхЗатрат;
	Набор.Записывать = Истина;
	Набор.Загрузить(Таблица);
	
КонецПроцедуры

// Процедура проверяет дату документа на соответствие дате перехода на партионный учет версии 2.2.
// Проверка выполняется для документов нового производства.
//
// Параметры:
//	Объект - ДокументОбъект.ЭтапПроизводства2_2, ДокументОбъект.ДвижениеПродукцииИМатериалов - проверяемый документ,
//	Дата - Дата - дата, на которую выполняется проверка,
//	Отказ - Булево - устанавливается в ИСТИНА, если дата перехода на новый партионный учет больше переданной даты.
//
Процедура ПроверитьИспользованиеПартионногоУчета22(Объект, Дата, Отказ) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаПереходаНаПартионныйУчетВерсии22 = УниверсальныеМеханизмыПартийИСебестоимостиПовтИсп.ДатаПереходаНаПартионныйУчетВерсии22();
	
	ТекстОшибки = Неопределено;
	
	Если НЕ УниверсальныеМеханизмыПартийИСебестоимостиПовтИсп.ПартионныйУчетВерсии22() Тогда
		
		ТекстОшибки = НСтр("ru='Для операций, доступных с версии 2.2, требуется установить соответствующий режим партионного учета.'");
		
	ИначеЕсли ДатаПереходаНаПартионныйУчетВерсии22 > НачалоМесяца(Дата) Тогда
		
		ТекстОшибки = НСтр("ru='Регистрация операций, доступных с версии 2.2, раньше даты перехода на партионный учет версии 2.2 недоступна.
								|Требуется изменить дату операции (%1) или дату перехода на партионный учет 2.2 (%2).'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстОшибки,
			Формат(Дата, "ДЛФ=D"),
			Формат(ДатаПереходаНаПартионныйУчетВерсии22, "ДЛФ=D"));
			
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Объект,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

//++ НЕ УТ

// Устанавливает параметры выбора для правила распределения в зависимости от способа учета производственных затрат.
//
// Параметры:
//	Подразделение - СправочникСсылка.СтруктураПредприятия - подразделение, в котором выполняется распределение
//	ВариантРаспределения - ПеречислениеСсылка.СпособыРаспределенияСтатейРасходов - вариант распределения
//	ЭлементПравилоРаспределения - ПолеФормы - Поле для ввода правила распределения
//	Назначение - СправочникСсылка.Назначения - Назначение расхода.
//
Процедура НастроитьПараметрыВыбораПравилРаспределения(Подразделение, ВариантРаспределения, ЭлементПравилоРаспределения, Назначение) Экспорт
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.НазначениеПравила", Назначение));
	
	Если ЗначениеЗаполнено(Подразделение)
		И (ВариантРаспределения = Перечисления.СпособыРаспределенияСтатейРасходов.ПоЭтапамПоПравилуВДанномПодразделении Или ВариантРаспределения = Неопределено) Тогда
		
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Подразделение, "ПроизводствоПоЗаказам, ИспользуетсяСписаниеЗатратНаВыпуск");
		
		Если Не Реквизиты.ПроизводствоПоЗаказам И Не Реквизиты.ИспользуетсяСписаниеЗатратНаВыпуск Тогда
			
			МассивБазРаспределения = Новый Массив;
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.КоличествоПродукции);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.ВесПродукции);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.ОбъемПродукции);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.ПлановаяСтоимостьПродукции);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.КоличествоУказанныхМатериалов);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.ВесУказанныхМатериалов);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.ОбъемУказанныхМатериалов);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.НормативРасходаМатериала);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.КоличествоРаботУказанныхВидов);
			
			МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.БазаРаспределения", Новый ФиксированныйМассив(МассивБазРаспределения)));
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЭлементПравилоРаспределения.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
КонецПроцедуры

// Функция формирует таблицу выполненных этапов производства.
//
// Параметры:
//	Параметры - Структура - Структура передаваемых параметров.
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица этапов производства.
//
Функция ЭтапыПроизводстваДляРаспределенияЗатрат(Параметры) Экспорт
	
	Запрос = Новый Запрос("
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Распоряжение.Распоряжение КАК ЗаказНаПроизводство,
	|	ДД.Распоряжение.КодСтроки КАК КодСтроки
	|ПОМЕСТИТЬ втВыпускиПродукции
	|ИЗ
	|	РегистрНакопления.ВыпускПродукции.Обороты(&ПериодНачало, &ПериодОкончание) КАК ДД
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|;
	|
	|ВЫБРАТЬ
	|	Заказы.ЗаказПоставщику КАК ЗаказПоставщику,
	|	Заказы.Номенклатура КАК Номенклатура,
	|	Заказы.КодСтроки КАК КодСтроки,
	|	Заказы.КОформлениюНачальныйОстаток КАК НачальныйОстаток,
	|	Заказы.КОформлениюПриход КАК Приход
	|ПОМЕСТИТЬ ВТВТЗаказыПереработчикамВрем
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.ОстаткиИОбороты(&ПериодНачало,
	|									   &ПериодОкончание, , ,
	|									   ЗаказПоставщику ССЫЛКА Документ.ЗаказПереработчику
	|									   И (ЗаказПоставщику = &Заказ ИЛИ &ПоВсемЗаказам)) КАК Заказы
	|ГДЕ
	|	НЕ &ПартионныйУчетВерсии22
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказы.ЗаказПоставщику
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таб.ЗаказПоставщику,
	|	Таб.КодСтроки
	|
	|ПОМЕСТИТЬ ВТЗаказыПереработчикам
	|
	|ИЗ ВТВТЗаказыПереработчикамВрем КАК Таб
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПереработчику КАК ДокЗаказ
	|	ПО Таб.ЗаказПоставщику = ДокЗаказ.Ссылка
	|		И ДокЗаказ.Организация = &Организация
	|		И (ДокЗаказ.Подразделение = &Подразделение ИЛИ &ПоВсемПодразделениям)
	|		И (ДокЗаказ.Назначение = &Назначение ИЛИ &ПоВсемНазначениям)
	|		И (ДокЗаказ.Назначение.НаправлениеДеятельности = &НаправлениеДеятельности ИЛИ &ПоВсемНаправлениямДеятельности)
	|		И (&НеТолькоТекущийМесяц ИЛИ Таб.НачальныйОстаток = 0)
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|	ПО Таб.Номенклатура = СпрНоменклатура.Ссылка
	|		И (&ПоВсемГруппамПродукции ИЛИ СпрНоменклатура.ГруппаАналитическогоУчета = &ГруппаПродукции)
	|ГДЕ
	|	НЕ &ПартионныйУчетВерсии22
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таб.ЗаказПоставщику,
	|	Таб.КодСтроки
	|
	|;
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заказы.ЗаказПоставщику КАК ЗаказНаПроизводство,
	|	Заказы.КодСтроки КАК КодСтрокиПродукция,
	|	НЕОПРЕДЕЛЕНО КАК Этап,
	|	НЕОПРЕДЕЛЕНО КАК Спецификация,
	|	СУММА(ВЫБОР 
	|				КОГДА Заказы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА Заказы.КОформлению
	|				ИНАЧЕ 0
	|			   КОНЕЦ) КАК ЗапланированоЗаказом,
	|	СУММА(ВЫБОР 
	|				КОГДА Заказы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА Заказы.КОформлению
	|				ИНАЧЕ 0
	|			   КОНЕЦ) КАК Выполнено
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам КАК Заказы
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаказыПереработчикам КАК ВТЗаказы
	|	ПО Заказы.ЗаказПоставщику = ВТЗаказы.ЗаказПоставщику
	|		И Заказы.КодСтроки = ВТЗаказы.КодСтроки
	|		И (Заказы.Период >= &ПериодНачало)
	|		И (&НеТолькоТекущийМесяц
	|			ИЛИ Заказы.Период МЕЖДУ &ПериодНачало И &ПериодОкончание)
	|		И Заказы.Активность
	|ГДЕ
	|	НЕ &ПартионныйУчетВерсии22
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	Заказы.ЗаказПоставщику,
	|	Заказы.КодСтроки
	|
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказНаПроизводство");
	
	Назначение = Неопределено;
	НаправлениеДеятельности = Неопределено;
	Подразделение = Неопределено;
	ГруппаПродукции = Неопределено;
	Заказ = Неопределено;
	Параметры.Свойство("Назначение", Назначение);
	Параметры.Свойство("НаправлениеДеятельности", НаправлениеДеятельности);
	Параметры.Свойство("Подразделение", Подразделение);
	Параметры.Свойство("ГруппаПродукции", ГруппаПродукции);
	Параметры.Свойство("Заказ", Заказ);
	
	Запрос.УстановитьПараметр("ПериодНачало",	 Параметры.ПериодНачало);
	Запрос.УстановитьПараметр("ПериодОкончание", Параметры.ПериодОкончание);
	Запрос.УстановитьПараметр("Организация",     Параметры.Организация);
	Запрос.УстановитьПараметр("Назначение",       Назначение);
	Запрос.УстановитьПараметр("ПоВсемНазначениям", Не ЗначениеЗаполнено(Назначение));
	Запрос.УстановитьПараметр("НаправлениеДеятельности",        НаправлениеДеятельности);
	Запрос.УстановитьПараметр("ПоВсемНаправлениямДеятельности", Не ЗначениеЗаполнено(НаправлениеДеятельности));
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ПоВсемПодразделениям", Не ЗначениеЗаполнено(Подразделение));
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("ПоВсемЗаказам", Не ЗначениеЗаполнено(Заказ));
	Запрос.УстановитьПараметр("ГруппаПродукции", ГруппаПродукции);
	Запрос.УстановитьПараметр("ПоВсемГруппамПродукции", Не ЗначениеЗаполнено(ГруппаПродукции));
	Запрос.УстановитьПараметр("НеТолькоТекущийМесяц", НЕ Параметры.ТолькоТекущийМесяц);
	Запрос.УстановитьПараметр("ПартионныйУчетВерсии22", Параметры.ПартионныйУчетВерсии22);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Процедура выполняет запись движений в таблицу последовательности производственных затрат.
//
// Параметры:
//	ДополнительныеСвойства - Структура - структура с данными для записи
//	Движения - Движения - Движения регистра "Выпуск продукции"
//	Отказ - Булево - Признак отказа от записи движений.
//
Процедура ОтразитьВыпускПродукции(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВыпускПродукции;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.ВыпускПродукции.Записывать = Истина;
	Движения.ВыпускПродукции.Загрузить(Таблица);
	
КонецПроцедуры

// Процедура выполняет запись движений в таблицу последовательности производственных затрат.
//
// Параметры:
//	ДополнительныеСвойства - Структура - структура с данными для записи
//	Движения - Движения - Движения регистра "РаспоряженияНаСписаниеПоНормативам"
//	Отказ - Булево - Признак отказа от записи движений.
//
Процедура ОтразитьРаспоряженияНаСписаниеПоНормативам(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРаспоряженияНаСписаниеПоНормативам;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Движения.РаспоряженияНаСписаниеПоНормативам.Записывать = Истина;
	Движения.РаспоряженияНаСписаниеПоНормативам.Загрузить(Таблица);
	
КонецПроцедуры

// Процедура выполняет запись движений в таблицу последовательности производственных затрат.
//
// Параметры:
//	ДополнительныеСвойства - Структура - структура с данными для записи
//	Движения - Движения - Движения регистра "ПрочиеРасходыНезавершенногоПроизводства"
//	Отказ - Булево - Признак отказа от записи движений.
//
Процедура ОтразитьПрочиеРасходыНезавершенногоПроизводства(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПрочиеРасходыНезавершенногоПроизводства;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Набор = Движения.ПрочиеРасходыНезавершенногоПроизводства;
	Набор.Записывать = Истина;
	Набор.Загрузить(Таблица);
	
КонецПроцедуры

// Процедура выполняет запись движений в таблицу партий незавершенного производства.
//
// Параметры:
//	ДополнительныеСвойства - Структура - структура с данными для записи
//	Движения - Движения - Движения регистра "ПартииНезавершенногоПроизводства"
//	Отказ - Булево - Признак отказа от записи движений.
//
Процедура ОтразитьПартииНезавершенногоПроизводства(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПартииНезавершенногоПроизводства;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Набор = Движения.ПартииНезавершенногоПроизводства;
	Набор.Записывать = Истина;
	Набор.Загрузить(Таблица);
	
КонецПроцедуры

// Процедура используется для выполнения регламентного задания по формированию документов
// "Списание затрат на выпуск".
Процедура СписатьЗатратыНаВыпуск() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.СписаниеЗатратНаВыпуск);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПроизводство") Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(НСтр("ru='Списание затрат на выпуск без заказов'"));
	
	Документы.СписаниеЗатратНаВыпуск.ДокументыПоПараметрам(Новый Структура, , Истина);
	
КонецПроцедуры

// Возвращает соответствие аналитики учета партий номеру группы затрат по коллекции значений. Используется
//	в производстве без заказа и отчетах переработчику.
//
// Параметры:
//	Коллекция - ТабличнаяЧасть, ТаблицаЗначений - Коллекция строк.
//
// Возвращаемое значение:
//	Соответствие
//
Функция АналитикиУчетаПартийПоНомерамГруппЗатрат(Коллекция) Экспорт
	
	Результат = Новый Соответствие;
	
	Для Каждого Строка Из Коллекция Цикл
		Результат.Вставить(Строка.НомерГруппыЗатрат, Строка.АналитикаУчетаПартийПроизводства);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция формирует таблицу партий производства.
//
// Параметры:
//	Параметры - Структура - Структура отборов.
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица партий производства.
//
Функция ПартииПроизводстваДляРаспределенияЗатрат(Отборы) Экспорт
	
	Запрос = Новый Запрос(
	"
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаВыходныеИзделия.Ссылка КАК ПартияПроизводства,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ТаблицаВыходныеИзделия.Ссылка КАК Этап,
	|	ТаблицаВыходныеИзделия.Номенклатура КАК Номенклатура,
	|	ТаблицаВыходныеИзделия.Характеристика КАК Характеристика,
	|	ТаблицаВыходныеИзделия.Спецификация КАК Спецификация,
	|	ТаблицаВыходныеИзделия.Назначение КАК Назначение,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказНаПроизводство,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтапТекущегоМесяца,
	|	ТаблицаВыходныеИзделия.АналитикаУчетаПартийПроизводства КАК АналитикаУчетаПартийПроизводства,
	|	ИСТИНА КАК ЕстьВыпускПродукции
	|ПОМЕСТИТЬ ВтЭтапы
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ТаблицаВыходныеИзделия
	|		ПО ДанныеДокумента.Ссылка = ТаблицаВыходныеИзделия.Ссылка
	|ГДЕ
	|	ДанныеДокумента.Организация = &Организация
	|	И ДанныеДокумента.Проведен
	|	И ТаблицаВыходныеИзделия.ОсновноеИзделиеГруппыЗатрат
	|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И КОНЕЦПЕРИОДА(ДобавитьКДате(&ОкончаниеПериода, МЕСЯЦ, 1), МЕСЯЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка,
	|	Реквизиты.Подразделение,
	|	Реквизиты.Ссылка,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ТаблицаТовары.Спецификация,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА Реквизиты.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ТаблицаТовары.АналитикаУчетаПартийПроизводства,
	|	ИСТИНА
	|ИЗ
	|	Документ.ОтчетПереработчика КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика.Продукция КАК ТаблицаТовары
	|		ПО Реквизиты.Ссылка = ТаблицаТовары.Ссылка
	|ГДЕ
	|	Реквизиты.Организация = &Организация
	|	И Реквизиты.Проведен
	|	И Реквизиты.ГруппировкаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства)
	|	И ТаблицаТовары.ОсновноеИзделиеГруппыЗатрат
	|	И Реквизиты.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЭтапТекущегоМесяца,
	|	Подразделение,
	|	Назначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтЭтапы.ПартияПроизводства,
	|	ВтЭтапы.Подразделение,
	|	ВтЭтапы.Этап,
	|	ВтЭтапы.Номенклатура,
	|	ВтЭтапы.Характеристика,
	|	ВтЭтапы.Спецификация,
	|	ВтЭтапы.Назначение,
	|	ВтЭтапы.ЗаказНаПроизводство,
	|	ВтЭтапы.ЭтапТекущегоМесяца,
	|	ВтЭтапы.АналитикаУчетаПартийПроизводства
	|ИЗ
	|	ВтЭтапы КАК ВтЭтапы
	|ГДЕ
	|	(ВтЭтапы.ЭтапТекущегоМесяца
	|			ИЛИ &ЭтапыЗаВесьПериод)
	|	И (ВтЭтапы.Подразделение = &Подразделение
	|			ИЛИ &ВсеПодразделения)
	|	И (ВтЭтапы.ЗаказНаПроизводство = &ЗаказНаПроизводство
	|			ИЛИ &ВсеЗаказыНаПроизводство)
	|	И (ВтЭтапы.Назначение = &Назначение
	|			ИЛИ &ВсеНазначения)
	|	И (ВтЭтапы.Назначение.НаправлениеДеятельности = &НаправлениеДеятельности
	|			ИЛИ &ВсеНаправленияДеятельности)
	|	И (ВтЭтапы.ЕстьВыпускПродукции
	|			ИЛИ НЕ &ТолькоЭтапыСВыпуском)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтЭтапы.Характеристика,
	|	ВтЭтапы.ПартияПроизводства,
	|	ВтЭтапы.АналитикаУчетаПартийПроизводства,
	|	ВтЭтапы.Этап,
	|	ВтЭтапы.ЭтапТекущегоМесяца,
	|	ВтЭтапы.Спецификация,
	|	ВтЭтапы.Номенклатура,
	|	ВтЭтапы.Назначение,
	|	ВтЭтапы.ЗаказНаПроизводство,
	|	ВтЭтапы.Подразделение");
	
	Подразделение	= Неопределено;
	Назначение		= Неопределено;
	ЗаказНаПроизводство = Неопределено;

	НаправлениеДеятельности = Неопределено;
	ТолькоЭтапыСВыпуском = Отборы.Свойство("ТолькоЭтапыСВыпуском") И Отборы.ТолькоЭтапыСВыпуском;
	ВключатьПереработкуНаСтороне = Отборы.Свойство("ВключатьПереработкуНаСтороне") И Отборы.ВключатьПереработкуНаСтороне;
	
	Отборы.Свойство("Подразделение",           Подразделение);
	Отборы.Свойство("Назначение",              Назначение);

	Отборы.Свойство("ЗаказНаПроизводство",     ЗаказНаПроизводство);
	Отборы.Свойство("НаправлениеДеятельности", НаправлениеДеятельности);
	
	Запрос.УстановитьПараметр("НачалоПериода",                Отборы.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода",             Отборы.ОкончаниеПериода);
	
	Запрос.УстановитьПараметр("Организация",                  Отборы.Организация);
	Запрос.УстановитьПараметр("ДетализироватьПоЭтапам",       Отборы.ДетализироватьПоЭтапам);
	Запрос.УстановитьПараметр("ЭтапыЗаВесьПериод",            НЕ Отборы.ТолькоТекущийМесяц);
	
	Запрос.УстановитьПараметр("Подразделение",                Подразделение);
	Запрос.УстановитьПараметр("ВсеПодразделения",             Не ЗначениеЗаполнено(Подразделение));
	
	Запрос.УстановитьПараметр("Назначение",                   Назначение);
	Запрос.УстановитьПараметр("ВсеНазначения",                Не ЗначениеЗаполнено(Назначение));

	Запрос.УстановитьПараметр("ЗаказНаПроизводство",          ЗаказНаПроизводство);
	Запрос.УстановитьПараметр("ВсеЗаказыНаПроизводство",      Не ЗначениеЗаполнено(ЗаказНаПроизводство));
	
	Запрос.УстановитьПараметр("НаправлениеДеятельности",      НаправлениеДеятельности);
	Запрос.УстановитьПараметр("ВсеНаправленияДеятельности",   Не ЗначениеЗаполнено(НаправлениеДеятельности));
	
	Запрос.УстановитьПараметр("ТолькоЭтапыСВыпуском",         ТолькоЭтапыСВыпуском);
	Запрос.УстановитьПараметр("ВключатьПереработкуНаСтороне", ВключатьПереработкуНаСтороне);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Процедура заполняет характеристики основного изделия в коллекции для партии производства.
//
// Параметры:
//	Коллекция - ТаблицаЗначений - Таблица, в которой необходимо заполнить характеристики основного изделия.
//
Процедура ЗаполнитьХарактеристикиИзделийПоПартииПроизводства(Коллекция) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Коллекция.НомерСтроки,
	|	Коллекция.ПартияПроизводства,
	|	Коллекция.АналитикаУчетаПартийПроизводства
	|ПОМЕСТИТЬ Коллекция
	|ИЗ
	|	&Коллекция КАК Коллекция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Коллекция.НомерСтроки	КАК Индекс,
	|ВЫБОР
	|	КОГДА НЕ ТаблицаВыходныеИзделия.Номенклатура ЕСТЬ NULL
	|		ТОГДА ТаблицаВыходныеИзделия.Номенклатура
	|	КОГДА НЕ ПродукцияПереработчика.Номенклатура ЕСТЬ NULL
	|		ТОГДА ПродукцияПереработчика.Номенклатура
	|КОНЕЦ						КАК Номенклатура,
	|ВЫБОР
	|	КОГДА НЕ ТаблицаВыходныеИзделия.Характеристика ЕСТЬ NULL
	|		ТОГДА ТаблицаВыходныеИзделия.Характеристика
	|	КОГДА НЕ ПродукцияПереработчика.Характеристика ЕСТЬ NULL
	|		ТОГДА ПродукцияПереработчика.Характеристика
	|КОНЕЦ						КАК Характеристика,
	|ВЫБОР
	|	КОГДА НЕ ТаблицаВыходныеИзделия.Спецификация ЕСТЬ NULL
	|		ТОГДА ТаблицаВыходныеИзделия.Спецификация
	|	КОГДА НЕ ПродукцияПереработчика.Спецификация ЕСТЬ NULL
	|		ТОГДА ПродукцияПереработчика.Спецификация
	|КОНЕЦ						КАК Спецификация,
	|ВЫБОР
	|	КОГДА НЕ ТаблицаВыходныеИзделия.Назначение ЕСТЬ NULL
	|		ТОГДА ТаблицаВыходныеИзделия.Назначение
	|	КОГДА НЕ ПродукцияПереработчика.Назначение ЕСТЬ NULL
	|		ТОГДА ПродукцияПереработчика.Назначение
	|КОНЕЦ						КАК Назначение
	|ИЗ
	|	Коллекция КАК Коллекция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ТаблицаВыходныеИзделия
	|		ПО (ТаблицаВыходныеИзделия.АналитикаУчетаПартийПроизводства = Коллекция.АналитикаУчетаПартийПроизводства)
	|			И (ТаблицаВыходныеИзделия.ОсновноеИзделиеГруппыЗатрат)
	|			И Коллекция.ПартияПроизводства = ТаблицаВыходныеИзделия.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика.Продукция КАК ПродукцияПереработчика
	|		ПО (ПродукцияПереработчика.АналитикаУчетаПартийПроизводства = Коллекция.АналитикаУчетаПартийПроизводства)
	|			И (ПродукцияПереработчика.ОсновноеИзделиеГруппыЗатрат)
	|			И Коллекция.ПартияПроизводства = ПродукцияПереработчика.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Индекс");
	
	Запрос.УстановитьПараметр("Коллекция",	Коллекция.Выгрузить(, "НомерСтроки, ПартияПроизводства, АналитикаУчетаПартийПроизводства"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для Номер = 0 По Коллекция.Количество() - 1 Цикл
		Выборка.Следующий(); // Количество строк в выборке по запросу всегда равно количеству строк в ТЧ
		ЗаполнитьЗначенияСвойств(Коллекция[Номер], Выборка);
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаПроизводственныеЗатратыТМЦ() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Склад КАК Склад,
	|	ДД.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ СкладыПодразделения
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.Ссылка КАК Склад,
	|		Т.Подразделение КАК Подразделение
	|	ИЗ
	|		Справочник.Склады КАК Т
	|	ГДЕ
	|		Т.ЦеховаяКладовая
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Ссылка,
	|		Т.Ссылка
	|	ИЗ
	|		Справочник.СтруктураПредприятия КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДД.АналитикаУчетаНоменклатуры.Склад,
	|		НЕОПРЕДЕЛЕНО
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров.ОстаткиИОбороты(&НачалоПериода, &ОкончаниеПериода, , , АналитикаУчетаНоменклатуры.Склад ССЫЛКА Справочник.Партнеры) КАК ДД
	|	ГДЕ
	|		(ДД.КоличествоНачальныйОстаток <> 0
	|			ИЛИ ДД.КоличествоКонечныйОстаток <> 0
	|			ИЛИ ДД.КоличествоПриход <> 0
	|			ИЛИ ДД.КоличествоРасход <> 0)) КАК ДД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	СкладыПодразделения.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ Выпуски
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.Склад = СкладыПодразделения.Склад)
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|								ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДД.Таблица                                             КАК Таблица,
	|	ДД.Содержание                                          КАК Содержание,
	|	ДД.Организация                                         КАК Организация,
	|	ДД.Подразделение                                       КАК Подразделение,
	|	ДД.Отправитель                                         КАК Отправитель,
	|	ДД.Получатель                                          КАК Получатель,
	|	ДД.СкладПодразделение                                  КАК СкладПодразделение,
	|	ДД.Регистратор                                         КАК Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры                          КАК АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов                                          КАК ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета                           КАК АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий                                КАК АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС                                  КАК ВидДеятельностиНДС,
	|	ДД.Номенклатура                                        КАК Номенклатура,
	|	ДД.Характеристика                                      КАК Характеристика,
	|	ДД.Серия                                               КАК Серия,
	|	ДД.Назначение                                          КАК Назначение,
	|	ДД.НаправлениеДеятельности                             КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции                                   КАК СтатьяКалькуляции,
	|	ДД.Партия                                              КАК Партия,
	|	ДД.ПартияПроизводства                                  КАК ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство                                 КАК ЗаказНаПроизводство,
	
	|	СУММА(ДД.аНачальныйОстатокКоличество)                  КАК аНачальныйОстатокКоличество,
	|	СУММА(ДД.аНачальныйОстатокСтоимость)                   КАК аНачальныйОстатокСтоимость,
	|	СУММА(ДД.аНачальныйОстатокПР)                          КАК аНачальныйОстатокПР,
	|	СУММА(ДД.аНачальныйОстатокВР)                          КАК аНачальныйОстатокВР,
	|	СУММА(ДД.аНачальныйОстатокЗабалансовая)                КАК аНачальныйОстатокЗабалансовая,
	
	|	СУММА(ДД.бПоступилоКоличество) КАК бПоступилоКоличество,
	|	СУММА(ДД.бПоступилоСтоимость) КАК бПоступилоСтоимость,
	|	СУММА(ДД.бПоступилоПР) КАК бПоступилоПР,
	|	СУММА(ДД.бПоступилоВР) КАК бПоступилоВР,
	|	СУММА(ДД.бПоступилоЗабалансовая) КАК бПоступилоЗабалансовая,
	
	|	СУММА(ДД.вПеремещенияКоличество) КАК вПеремещенияКоличество,
	|	СУММА(ДД.вПеремещенияСтоимость) КАК вПеремещенияСтоимость,
	|	СУММА(ДД.вПеремещенияПР) КАК вПеремещенияПР,
	|	СУММА(ДД.вПеремещенияВР) КАК вПеремещенияВР,
	|	СУММА(ДД.вПеремещенияЗабалансовая) КАК вПеремещенияЗабалансовая,
	
	|	СУММА(ДД.гРасходНаПроизводствоКоличество) КАК гРасходНаПроизводствоКоличество,
	|	СУММА(ДД.гРасходНаПроизводствоСтоимость) КАК гРасходНаПроизводствоСтоимость,
	|	СУММА(ДД.гРасходНаПроизводствоПР) КАК гРасходНаПроизводствоПР,
	|	СУММА(ДД.гРасходНаПроизводствоВР) КАК гРасходНаПроизводствоВР,
	|	СУММА(ДД.гРасходНаПроизводствоЗабалансовая) КАК гРасходНаПроизводствоЗабалансовая,
	
	|	СУММА(ДД.дСписаноКоличество) КАК дСписаноКоличество,
	|	СУММА(ДД.дСписаноСтоимость) КАК дСписаноСтоимость,
	|	СУММА(ДД.дСписаноПР) КАК дСписаноПР,
	|	СУММА(ДД.дСписаноВР) КАК дСписаноВР,
	|	СУММА(ДД.дСписаноЗабалансовая) КАК дСписаноЗабалансовая,
	
	|	СУММА(ДД.еКонечныйОстатокКоличество) КАК еКонечныйОстатокКоличество,
	|	СУММА(ДД.еКонечныйОстатокСтоимость) КАК еКонечныйОстатокСтоимость,
	|	СУММА(ДД.еКонечныйОстатокПР) КАК еКонечныйОстатокПР,
	|	СУММА(ДД.еКонечныйОстатокВР) КАК еКонечныйОстатокВР,
	|	СУММА(ДД.еКонечныйОстатокЗабалансовая) КАК еКонечныйОстатокЗабалансовая,
	
	|	СУММА(ДД.жПереданоКоличество) КАК жПереданоКоличество,
	|	СУММА(ДД.жПереданоСтоимость) КАК жПереданоСтоимость,
	|	СУММА(ДД.жПереданоПР) КАК жПереданоПР,
	|	СУММА(ДД.жПереданоВР) КАК жПереданоВР,
	|	СУММА(ДД.жПереданоЗабалансовая) КАК жПереданоЗабалансовая
	|{ВЫБРАТЬ
	|Таблица,
	|Содержание,
	|Организация.*,
	|Подразделение.*,
	|Отправитель.*,
	|Получатель.*,
	|СкладПодразделение.*,
	|Регистратор.*,
	|АналитикаУчетаНоменклатуры.*,
	|ВидЗапасов.*,
	|АналитикаФинансовогоУчета.*,
	|АналитикаУчетаПартий.*,
	|ВидДеятельностиНДС.*,
	|Номенклатура.*,
	|Характеристика.*,
	|Серия.*,
	|Назначение.*,
	|НаправлениеДеятельности.*,
	|СтатьяКалькуляции.*,
	|Партия.*,
	|ПартияПроизводства.*,
	|ЗаказНаПроизводство.*,
	|аНачальныйОстатокКоличество,
	|аНачальныйОстатокСтоимость,
	|аНачальныйОстатокПР,
	|аНачальныйОстатокВР,
	|аНачальныйОстатокЗабалансовая,
	|бПоступилоКоличество,
	|бПоступилоСтоимость,
	|бПоступилоПР,
	|бПоступилоВР,
	|бПоступилоЗабалансовая,
	|вПеремещенияКоличество,
	|вПеремещенияСтоимость,
	|вПеремещенияПР,
	|вПеремещенияВР,
	|вПеремещенияЗабалансовая,
	|гРасходНаПроизводствоКоличество,
	|гРасходНаПроизводствоСтоимость,
	|гРасходНаПроизводствоПР,
	|гРасходНаПроизводствоВР,
	|гРасходНаПроизводствоЗабалансовая,
	|дСписаноКоличество,
	|дСписаноСтоимость,
	|дСписаноПР,
	|дСписаноВР,
	|дСписаноЗабалансовая,
	|еКонечныйОстатокКоличество,
	|еКонечныйОстатокСтоимость,
	|еКонечныйОстатокПР,
	|еКонечныйОстатокВР,
	|еКонечныйОстатокЗабалансовая,
	|жПереданоКоличество,
	|жПереданоСтоимость,
	|жПереданоПР,
	|жПереданоВР,
	|жПереданоЗабалансовая}
	|ИЗ
	|
	|(ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Выпуски.Подразделение ЕСТЬ NULL
	|			ТОГДА ""Материалы""
	|		ИНАЧЕ ""Продукция""
	|	КОНЕЦ                                                  КАК Таблица,
	|	""Начальный остаток""                                  КАК Содержание,
	|	ДД.Организация                                         КАК Организация,
	|	СкладыПодразделения.Подразделение                      КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО                                           КАК Отправитель,
	|	НЕОПРЕДЕЛЕНО                                           КАК Получатель,
	|	Аналитика.Склад                                        КАК СкладПодразделение,
	|	НЕОПРЕДЕЛЕНО                                           КАК Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры                          КАК АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов                                          КАК ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета                           КАК АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий                                КАК АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС                                  КАК ВидДеятельностиНДС,
	|	Аналитика.Номенклатура                                 КАК Номенклатура,
	|	Аналитика.Характеристика                               КАК Характеристика,
	|	Аналитика.Серия                                        КАК Серия,
	|	Аналитика.Назначение                                   КАК Назначение,
	|	Аналитика.Назначение.НаправлениеДеятельности           КАК НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции                            КАК СтатьяКалькуляции,
	|	ДД.Партия                                              КАК Партия,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ                                                  КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ                                                  КАК ЗаказНаПроизводство,
	|	ДД.КоличествоОстаток                                   КАК аНачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток + ДД.ДопРасходыОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеСНДСОстаток + ДД.ПостатейныеПеременныеСНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток + ДД.ДопРасходыРеглОстаток + ДД.ТрудозатратыРеглОстаток + ДД.ПостатейныеПостоянныеРеглОстаток + ДД.ПостатейныеПеременныеРеглОстаток
	|		ИНАЧЕ	
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ                                                  КАК аНачальныйОстатокСтоимость,
	|	ДД.ПостояннаяРазницаОстаток                            КАК аНачальныйОстатокПР,
	|	ДД.ВременнаяРазницаОстаток                             КАК аНачальныйОстатокВР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРеглОстаток
	|	КОНЕЦ                                                  КАК аНачальныйОстатокЗабалансовая,
	
	|	0 КАК бПоступилоКоличество,
	|	0 КАК бПоступилоСтоимость,
	|	0 КАК бПоступилоПР,
	|	0 КАК бПоступилоВР,
	|	0 КАК бПоступилоЗабалансовая,
	
	|	0 КАК вПеремещенияКоличество,
	|	0 КАК вПеремещенияСтоимость,
	|	0 КАК вПеремещенияПР,
	|	0 КАК вПеремещенияВР,
	|	0 КАК вПеремещенияЗабалансовая,
	
	|	0 КАК гРасходНаПроизводствоКоличество,
	|	0 КАК гРасходНаПроизводствоСтоимость,
	|	0 КАК гРасходНаПроизводствоПР,
	|	0 КАК гРасходНаПроизводствоВР,
	|	0 КАК гРасходНаПроизводствоЗабалансовая,
	
	|	0 КАК дСписаноКоличество,
	|	0 КАК дСписаноСтоимость,
	|	0 КАК дСписаноПР,
	|	0 КАК дСписаноВР,
	|	0 КАК дСписаноЗабалансовая,
	
	|	0 КАК еКонечныйОстатокКоличество,
	|	0 КАК еКонечныйОстатокСтоимость,
	|	0 КАК еКонечныйОстатокПР,
	|	0 КАК еКонечныйОстатокВР,
	|	0 КАК еКонечныйОстатокЗабалансовая,
	
	|	0 КАК жПереданоКоличество,
	|	0 КАК жПереданоСтоимость,
	|	0 КАК жПереданоПР,
	|	0 КАК жПереданоВР,
	|	0 КАК жПереданоЗабалансовая
	
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			{(&НачалоПериода)},
	|			НЕ &БезОтбораПоПериоду
	|				И (АналитикаУчетаНоменклатуры.Склад.ЦеховаяКладовая
	|					ИЛИ АналитикаУчетаНоменклатуры.Склад ССЫЛКА Справочник.СтруктураПредприятия)) КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.Склад = СкладыПодразделения.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Выпуски КАК Выпуски
	|		ПО ДД.АналитикаУчетаНоменклатуры = Выпуски.АналитикаУчетаНоменклатуры
	|			И (СкладыПодразделения.Подразделение = Выпуски.Подразделение)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Выпуски.Подразделение ЕСТЬ NULL
	|			ТОГДА ""Материалы""
	|		ИНАЧЕ ""Продукция""
	|	КОНЕЦ,
	|	""Поступило со склада или кладовых других цехов и приходы по перемещениям"",
	|	ДД.Организация,
	|	КорСкладыПодразделения.Подразделение,
	|	Аналитика.Склад,
	|	КорАналитика.Склад,
	|	КорАналитика.Склад,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	ДД.КорВидЗапасов,
	|	ДД.КорАналитикаФинансовогоУчета,
	|	ДД.КорАналитикаУчетаПартий,
	|	ДД.КорВидДеятельностиНДС,
	|	КорАналитика.Номенклатура,
	|	КорАналитика.Характеристика,
	|	КорАналитика.Серия,
	|	КорАналитика.Назначение,
	|	КорАналитика.Назначение.НаправлениеДеятельности,
	|	КорАналитика.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ СкладыПодразделения.Подразделение ЕСТЬ NULL
	|			ТОГДА ДД.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ СкладыПодразделения.Подразделение ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|					ИНАЧЕ	
	|						ВЫБОР КОГДА &ПоПредприятию
	|							ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|						ИНАЧЕ
	|							ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ СкладыПодразделения.Подразделение ЕСТЬ NULL
	|			ТОГДА ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ СкладыПодразделения.Подразделение ЕСТЬ NULL
	|			ТОГДА ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ СкладыПодразделения.Подразделение ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА 0
	|					КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|						ТОГДА СтоимостьЗабалансовая
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА СтоимостьЗабалансоваяРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,

	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|			ТОГДА ДД.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|					ИНАЧЕ	
	|						ВЫБОР КОГДА &ПоПредприятию
	|							ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|						ИНАЧЕ
	|							ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|			ТОГДА ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|			ТОГДА ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА 0
	|					КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьЗабалансовая
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК КорСкладыПодразделения
	|		ПО (КорАналитика.Склад = КорСкладыПодразделения.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.Склад = СкладыПодразделения.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Выпуски КАК Выпуски
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = Выпуски.АналитикаУчетаНоменклатуры
	|			И (КорСкладыПодразделения.Подразделение = Выпуски.Подразделение)
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И КорАналитика.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И Аналитика.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И (КорАналитика.Склад.ЦеховаяКладовая
	|			ИЛИ КорАналитика.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|			ИЛИ КорАналитика.Склад ССЫЛКА Справочник.Партнеры
	|			ИЛИ Аналитика.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|			ИЛИ Аналитика.Склад ССЫЛКА Справочник.Партнеры)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Выпуски.Подразделение ЕСТЬ NULL
	|			ТОГДА ""Материалы""
	|		ИНАЧЕ ""Продукция""
	|	КОНЕЦ,
	|	""Расходы по перемещениям, передачи на склад, в другие кладовые, в производство"",
	|	ДД.Организация,
	|	СкладыПодразделения.Подразделение,
	|	Аналитика.Склад,
	|	КорАналитика.Склад,
	|	Аналитика.Склад,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
	|			ТОГДА ДД.КорПартия
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
	|			ТОГДА ДД.КорПартия.Распоряжение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	
	// начальный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// поступило
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// перемещения
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|				И НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию))
	|			ТОГДА -1 * ДД.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|				И НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию))
	|			ТОГДА -1 * ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|					ИНАЧЕ	
	|						ВЫБОР КОГДА &ПоПредприятию
	|							ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|						ИНАЧЕ
	|							ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|				И НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию))
	|			ТОГДА -1 * ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|				И НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию))
	|			ТОГДА -1 * ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|				И НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию))
	|			ТОГДА -1 * ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА 0
	|					КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьЗабалансовая
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	
	// на производство
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|		И (Аналитика.Склад.ЦеховаяКладовая
	|			ИЛИ Аналитика.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|			ИЛИ Аналитика.Склад ССЫЛКА Справочник.Партнеры)
	|			ТОГДА ДД.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|		И (Аналитика.Склад.ЦеховаяКладовая
	|			ИЛИ Аналитика.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|			ИЛИ Аналитика.Склад ССЫЛКА Справочник.Партнеры)
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|					ИНАЧЕ	
	|						ВЫБОР КОГДА &ПоПредприятию
	|							ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|						ИНАЧЕ
	|							ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|		И (Аналитика.Склад.ЦеховаяКладовая
	|			ИЛИ Аналитика.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|			ИЛИ Аналитика.Склад ССЫЛКА Справочник.Партнеры)
	|			ТОГДА ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|			ТОГДА ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|		И (Аналитика.Склад.ЦеховаяКладовая
	|			ИЛИ Аналитика.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|			ИЛИ Аналитика.Склад ССЫЛКА Справочник.Партнеры)
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА 0
	|					КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьЗабалансовая
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	
	// списание
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// конечный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// передача на склад
	|	ВЫБОР
	|		КОГДА (СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ КорСкладыПодразделения.Подразделение ЕСТЬ NULL)
	|					И ДД.ХозяйственнаяОперация НЕ В(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|			ТОГДА ДД.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ КорСкладыПодразделения.Подразделение ЕСТЬ NULL)
	|					И ДД.ХозяйственнаяОперация НЕ В(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|					ИНАЧЕ	
	|						ВЫБОР КОГДА &ПоПредприятию
	|							ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|						ИНАЧЕ
	|							ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ КорСкладыПодразделения.Подразделение ЕСТЬ NULL)
	|					И ДД.ХозяйственнаяОперация НЕ В(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|			ТОГДА ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ КорСкладыПодразделения.Подразделение ЕСТЬ NULL)
	|					И ДД.ХозяйственнаяОперация НЕ В(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|			ТОГДА ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ КорСкладыПодразделения.Подразделение ЕСТЬ NULL)
	|					И ДД.ХозяйственнаяОперация НЕ В(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА 0
	|					КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьЗабалансовая
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ
	
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК КорСкладыПодразделения
	|		ПО (КорАналитика.Склад = КорСкладыПодразделения.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.Склад = СкладыПодразделения.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Выпуски КАК Выпуски
	|		ПО ДД.АналитикаУчетаНоменклатуры = Выпуски.АналитикаУчетаНоменклатуры
	|			И (СкладыПодразделения.Подразделение = Выпуски.Подразделение)
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И Аналитика.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И (Аналитика.Склад.ЦеховаяКладовая
	|			ИЛИ Аналитика.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|			ИЛИ Аналитика.Склад ССЫЛКА Справочник.Партнеры
	|			ИЛИ КорАналитика.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|			ИЛИ КорАналитика.Склад ССЫЛКА Справочник.Партнеры)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|	И НЕ (ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|		ИЛИ ДД.СтатьяРасходовСписания = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПогрешностьРасчетаСебестоимости))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Выпуски.Подразделение ЕСТЬ NULL
	|			ТОГДА ""Материалы""
	|		ИНАЧЕ ""Продукция""
	|	КОНЕЦ,
	|	""Списания на расходы"",
	|	ДД.Организация,
	|	СкладыПодразделения.Подразделение,
	|	Аналитика.Склад,
	|	ДД.СтатьяРасходовСписания,
	|	Аналитика.Склад,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	ДД.Партия,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	
	// начальный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// поступило
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// перемещения
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// на производство
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// списание
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ	
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	
	// конечный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// передача на склад
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК КорСкладыПодразделения
	|		ПО (КорАналитика.Склад = КорСкладыПодразделения.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.Склад = СкладыПодразделения.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Выпуски КАК Выпуски
	|		ПО ДД.АналитикаУчетаНоменклатуры = Выпуски.АналитикаУчетаНоменклатуры
	|			И (СкладыПодразделения.Подразделение = Выпуски.Подразделение)
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И Аналитика.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И (Аналитика.Склад.ЦеховаяКладовая
	|			ИЛИ Аналитика.Склад ССЫЛКА Справочник.СтруктураПредприятия)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И (ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|		ИЛИ ДД.СтатьяРасходовСписания = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПогрешностьРасчетаСебестоимости))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Выпуски.Подразделение ЕСТЬ NULL
	|			ТОГДА ""Материалы""
	|		ИНАЧЕ ""Продукция""
	|	КОНЕЦ,
	|	""Приходы от поставщика и выпуски продукции"",
	|	ДД.Организация,
	|	СкладыПодразделения.Подразделение,
	|	ЕСТЬNULL(РеквизитыПроизводстваБезЗаказа.Подразделение, ЕСТЬNULL(РеквизитыОтчетов.Подразделение, СкладыПодразделения.Подразделение)),
	|	Аналитика.Склад,
	|	Аналитика.Склад,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА ДД.Партия
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,

	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ	
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.Склад = СкладыПодразделения.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Выпуски КАК Выпуски
	|		ПО ДД.АналитикаУчетаНоменклатуры = Выпуски.АналитикаУчетаНоменклатуры
	|			И (СкладыПодразделения.Подразделение = Выпуски.Подразделение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК РеквизитыПроизводстваБезЗаказа
	|		ПО ДД.Регистратор = РеквизитыПроизводстваБезЗаказа.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика КАК РеквизитыОтчетов
	|		ПО ДД.Регистратор = РеквизитыОтчетов.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И (Аналитика.Склад.ЦеховаяКладовая
	|			ИЛИ Аналитика.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|			ИЛИ Аналитика.Склад ССЫЛКА Справочник.Партнеры)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Аналитика.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|								ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость),
	|								ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Выпуски.Подразделение ЕСТЬ NULL
	|			ТОГДА ""Материалы""
	|		ИНАЧЕ ""Продукция""
	|	КОНЕЦ,
	|	""Конечный остаток"",
	|	ДД.Организация,
	|	СкладыПодразделения.Подразделение,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	Аналитика.Склад,
	|	НЕОПРЕДЕЛЕНО,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,

	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	ДД.КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток + ДД.ДопРасходыОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеСНДСОстаток + ДД.ПостатейныеПеременныеСНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток + ДД.ДопРасходыРеглОстаток + ДД.ТрудозатратыРеглОстаток + ДД.ПостатейныеПостоянныеРеглОстаток + ДД.ПостатейныеПеременныеРеглОстаток
	|		ИНАЧЕ	
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазницаОстаток,
	|	ДД.ВременнаяРазницаОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРеглОстаток
	|	КОНЕЦ,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			АналитикаУчетаНоменклатуры.Склад.ЦеховаяКладовая
	|				ИЛИ АналитикаУчетаНоменклатуры.Склад ССЫЛКА Справочник.СтруктураПредприятия) КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.Склад = СкладыПодразделения.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Выпуски КАК Выпуски
	|		ПО ДД.АналитикаУчетаНоменклатуры = Выпуски.АналитикаУчетаНоменклатуры
	|			И (СкладыПодразделения.Подразделение = Выпуски.Подразделение)
	|) КАК ДД
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	ДД.Таблица,
	|	ДД.Содержание,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Отправитель,
	|	ДД.Получатель,
	|	ДД.СкладПодразделение,
	|	ДД.Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.Номенклатура,
	|	ДД.Характеристика,
	|	ДД.Серия,
	|	ДД.Назначение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ДД.ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство
	|";
	
	Ресурсы = Новый Массив;
	
	Ресурсы.Добавить("аНачальныйОстатокКоличество");
	Ресурсы.Добавить("аНачальныйОстатокСтоимость");
	Ресурсы.Добавить("аНачальныйОстатокПР");
	Ресурсы.Добавить("аНачальныйОстатокВР");
	Ресурсы.Добавить("аНачальныйОстатокЗабалансовая");
	
	Ресурсы.Добавить("бПоступилоКоличество");
	Ресурсы.Добавить("бПоступилоСтоимость");
	Ресурсы.Добавить("бПоступилоПР");
	Ресурсы.Добавить("бПоступилоВР");
	Ресурсы.Добавить("бПоступилоЗабалансовая");
	
	Ресурсы.Добавить("вПеремещенияКоличество");
	Ресурсы.Добавить("вПеремещенияСтоимость");
	Ресурсы.Добавить("вПеремещенияПР");
	Ресурсы.Добавить("вПеремещенияВР");
	Ресурсы.Добавить("вПеремещенияЗабалансовая");
	
	Ресурсы.Добавить("гРасходНаПроизводствоКоличество");
	Ресурсы.Добавить("гРасходНаПроизводствоСтоимость");
	Ресурсы.Добавить("гРасходНаПроизводствоПР");
	Ресурсы.Добавить("гРасходНаПроизводствоВР");
	Ресурсы.Добавить("гРасходНаПроизводствоЗабалансовая");
	
	Ресурсы.Добавить("дСписаноКоличество");
	Ресурсы.Добавить("дСписаноСтоимость");
	Ресурсы.Добавить("дСписаноПР");
	Ресурсы.Добавить("дСписаноВР");
	Ресурсы.Добавить("дСписаноЗабалансовая");
	
	Ресурсы.Добавить("еКонечныйОстатокКоличество");
	Ресурсы.Добавить("еКонечныйОстатокСтоимость");
	Ресурсы.Добавить("еКонечныйОстатокПР");
	Ресурсы.Добавить("еКонечныйОстатокВР");
	Ресурсы.Добавить("еКонечныйОстатокЗабалансовая");
	
	Ресурсы.Добавить("жПереданоКоличество");
	Ресурсы.Добавить("жПереданоСтоимость");
	Ресурсы.Добавить("жПереданоПР");
	Ресурсы.Добавить("жПереданоВР");
	Ресурсы.Добавить("жПереданоЗабалансовая");
	
	Возврат Новый Структура("ТекстЗапроса, Ресурсы", ТекстЗапроса, Ресурсы);
	
КонецФункции

Функция ТекстЗапросаПроизводственныеЗатратыПостатейные() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДД.Таблица                                             КАК Таблица,
	|	ДД.Содержание                                          КАК Содержание,
	|	ДД.Организация                                         КАК Организация,
	|	ДД.Подразделение                                       КАК Подразделение,
	|	ДД.Отправитель                                         КАК Отправитель,
	|	ДД.Получатель                                          КАК Получатель,
	|	ДД.Регистратор                                         КАК Регистратор,
	|	ДД.СтатьяРасходов                                      КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                                   КАК АналитикаРасходов,
	|	ДД.НаправлениеДеятельности                             КАК НаправлениеДеятельности,
	|	ДД.ПартияПроизводства                                  КАК ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство                                 КАК ЗаказНаПроизводство,
	
	|	СУММА(ДД.аНачальныйОстатокСтоимость)                   КАК аНачальныйОстатокСтоимость,
	|	СУММА(ДД.аНачальныйОстатокПР)                          КАК аНачальныйОстатокПР,
	|	СУММА(ДД.аНачальныйОстатокВР)                          КАК аНачальныйОстатокВР,
	
	|	СУММА(ДД.бПоступилоСтоимость)                          КАК бПоступилоСтоимость,
	|	СУММА(ДД.бПоступилоПР)                                 КАК бПоступилоПР,
	|	СУММА(ДД.бПоступилоВР)                                 КАК бПоступилоВР,
	
	|	СУММА(ДД.гРасходНаПроизводствоСтоимость)               КАК гРасходНаПроизводствоСтоимость,
	|	СУММА(ДД.гРасходНаПроизводствоПР)                      КАК гРасходНаПроизводствоПР,
	|	СУММА(ДД.гРасходНаПроизводствоВР)                      КАК гРасходНаПроизводствоВР,
	
	|	СУММА(ДД.еКонечныйОстатокСтоимость)                    КАК еКонечныйОстатокСтоимость,
	|	СУММА(ДД.еКонечныйОстатокПР)                           КАК еКонечныйОстатокПР,
	|	СУММА(ДД.еКонечныйОстатокВР)                           КАК еКонечныйОстатокВР
	|{ВЫБРАТЬ
	|Таблица,
	|Содержание,
	|Организация.*,
	|Подразделение.*,
	|Отправитель.*,
	|Получатель.*,
	|Регистратор.*,
	|СтатьяРасходов.*,
	|АналитикаРасходов.*,
	|НаправлениеДеятельности.*,
	|ПартияПроизводства.*,
	|ЗаказНаПроизводство.*,
	|аНачальныйОстатокСтоимость,
	|аНачальныйОстатокПР,
	|аНачальныйОстатокВР,
	|бПоступилоСтоимость,
	|бПоступилоПР,
	|бПоступилоВР,
	|гРасходНаПроизводствоСтоимость,
	|гРасходНаПроизводствоПР,
	|гРасходНаПроизводствоВР,
	|еКонечныйОстатокСтоимость,
	|еКонечныйОстатокПР,
	|еКонечныйОстатокВР}
	|	
	|ИЗ
	|
	|(ВЫБРАТЬ
	|	""Постатейные""                                        КАК Таблица,
	|	""Начальный остаток""                                  КАК Содержание,
	|	ДД.Организация                                         КАК Организация,
	|	ДД.Подразделение                                       КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Отправитель,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Получатель,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ                                                  КАК Регистратор,
	|	ДД.СтатьяРасходов                                      КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                                   КАК АналитикаРасходов,
	|	ДД.НаправлениеДеятельности                             КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО                                           КАК ПартияПроизводства,
	|	НЕОПРЕДЕЛЕНО                                           КАК ЗаказНаПроизводство,
	
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СуммаОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СуммаБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СуммаУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СуммаРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СуммаБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СуммаУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ                                                  КАК аНачальныйОстатокСтоимость,
	|	ДД.ПостояннаяРазницаОстаток                            КАК аНачальныйОстатокПР,
	|	ДД.ВременнаяРазницаОстаток                             КАК аНачальныйОстатокВР,
	
	|	0                                                      КАК бПоступилоСтоимость,
	|	0                                                      КАК бПоступилоПР,
	|	0                                                      КАК бПоступилоВР,
	
	|	0                                                      КАК гРасходНаПроизводствоСтоимость,
	|	0                                                      КАК гРасходНаПроизводствоПР,
	|	0                                                      КАК гРасходНаПроизводствоВР,
	
	|	0                                                      КАК еКонечныйОстатокСтоимость,
	|	0                                                      КАК еКонечныйОстатокПР,
	|	0                                                      КАК еКонечныйОстатокВР
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы.Остатки(
	|			{(&НачалоПериода)},
	|			НЕ &БезОтбораПоПериоду
	|				И (СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|					ИЛИ СтатьяРасходов.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты))) КАК ДД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Постатейные"",
	|	""Закупка услуг, регистрация, отражение зарплаты"",
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ДД.Подразделение,
	|	ДД.Регистратор,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	
	|	0,
	|	0,
	|	0,
	
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Сумма
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СуммаБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СуммаУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СуммаРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СуммаБезНДС
	|			ИНАЧЕ
	|				ДД.СуммаУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ДД
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И (ДД.СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|					ИЛИ ДД.СтатьяРасходов.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты))
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Постатейные"",
	|	""Распределение на производство"",
	|	ДД.Организация,
	|	Реквизиты.Подразделение,
	|	Реквизиты.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	Реквизиты.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.ПартияПроизводства
	|		ИНАЧЕ ДД.ЗаказНаПроизводство
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.ПартияПроизводства.Распоряжение
	|		ИНАЧЕ ДД.ЗаказНаПроизводство
	|	КОНЕЦ,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
	|		ПО ДД.Регистратор = Реквизиты.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Постатейные"",
	|	""Списание на другие статьи, выбытие"",
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.КорСтатьяРасходов,
	|	ДД.Регистратор,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	
	|	0,
	|	0,
	|	0,
	
	|	-1 * ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Сумма
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СуммаБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СуммаУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СуммаРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СуммаБезНДС
	|			ИНАЧЕ
	|				ДД.СуммаУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	-1 * ДД.ПостояннаяРазница,
	|	-1 * ДД.ВременнаяРазница,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ДД
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И (ДД.СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|					ИЛИ ДД.СтатьяРасходов.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты))
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Постатейные"",
	|	""Конечный остаток"",
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СуммаОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СуммаБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СуммаУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СуммаРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СуммаБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СуммаУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазницаОстаток,
	|	ДД.ВременнаяРазницаОстаток
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			(СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|					ИЛИ СтатьяРасходов.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты))) КАК ДД) КАК ДД
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	ДД.Таблица,
	|	ДД.Содержание,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Отправитель,
	|	ДД.Получатель,
	|	ДД.Регистратор,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	ДД.ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство";
	
	Ресурсы = Новый Массив;
	Ресурсы.Добавить("аНачальныйОстатокСтоимость");
	Ресурсы.Добавить("аНачальныйОстатокПР");
	Ресурсы.Добавить("аНачальныйОстатокВР");
	
	Ресурсы.Добавить("бПоступилоСтоимость");
	Ресурсы.Добавить("бПоступилоПР");
	Ресурсы.Добавить("бПоступилоВР");
	
	Ресурсы.Добавить("гРасходНаПроизводствоСтоимость");
	Ресурсы.Добавить("гРасходНаПроизводствоПР");
	Ресурсы.Добавить("гРасходНаПроизводствоВР");
	
	Ресурсы.Добавить("еКонечныйОстатокСтоимость");
	Ресурсы.Добавить("еКонечныйОстатокПР");
	Ресурсы.Добавить("еКонечныйОстатокВР");
	
	Возврат Новый Структура("ТекстЗапроса, Ресурсы", ТекстЗапроса, Ресурсы);
	
КонецФункции

Функция ТекстЗапросаПроизводственныеЗатратыПоПартиямПроизводства() Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДД.Таблица                                КАК Таблица,
	|	ДД.Содержание                             КАК Содержание,
	|	ДД.ТипЗатрат                              КАК ТипЗатрат,
	|	ДД.Организация                            КАК Организация,
	|	ДД.Подразделение                          КАК Подразделение,
	|	ДД.ПодразделениеОтправитель               КАК ПодразделениеОтправитель,
	|	ДД.ПодразделениеВыпуска                   КАК ПодразделениеВыпуска,
	|	ДД.Регистратор                            КАК Регистратор,
	|	ДД.НаправлениеДеятельности                КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции                      КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры             КАК АналитикаУчетаНоменклатуры,
	|	ДД.Номенклатура                           КАК Номенклатура,
	|	ДД.Характеристика                         КАК Характеристика,
	|	ДД.Серия                                  КАК Серия,
	|	ДД.Назначение                             КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот                               КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов                         КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                      КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.АналитикаУчетаПродукции                КАК АналитикаУчетаПродукции,
	|	ДД.Продукция                              КАК Продукция,
	|	ДД.ХарактеристикаПродукции                КАК ХарактеристикаПродукции,
	|	ДД.СерияПродукции                         КАК СерияПродукции,
	|	ДД.НазначениеПродукции                    КАК НазначениеПродукции,
	|	
	|	ДД.ПартияПроизводства                     КАК ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство                    КАК ЗаказНаПроизводство,
	
	|	СУММА(ДД.аНачальныйОстатокКоличество)     КАК аНачальныйОстатокКоличество,
	|	СУММА(ДД.аНачальныйОстатокСтоимость)      КАК аНачальныйОстатокСтоимость,
	|	СУММА(ДД.аНачальныйОстатокПР)             КАК аНачальныйОстатокПР,
	|	СУММА(ДД.аНачальныйОстатокВР)             КАК аНачальныйОстатокВР,
	|	СУММА(ДД.аНачальныйОстатокЗабалансовая)   КАК аНачальныйОстатокЗабалансовая,
	|	
	|	СУММА(ДД.бПоступилоКоличество)            КАК бПоступилоКоличество,
	|	СУММА(ДД.бПоступилоСтоимость)             КАК бПоступилоСтоимость,
	|	СУММА(ДД.бПоступилоПР)                    КАК бПоступилоПР,
	|	СУММА(ДД.бПоступилоВР)                    КАК бПоступилоВР,
	|	СУММА(ДД.бПоступилоЗабалансовая)          КАК бПоступилоЗабалансовая,
	|	
	|	СУММА(ДД.гРасходНаПроизводствоКоличество) КАК гРасходНаПроизводствоКоличество,
	|	СУММА(ДД.гРасходНаПроизводствоСтоимость)  КАК гРасходНаПроизводствоСтоимость,
	|	СУММА(ДД.гРасходНаПроизводствоПР)         КАК гРасходНаПроизводствоПР,
	|	СУММА(ДД.гРасходНаПроизводствоВР)         КАК гРасходНаПроизводствоВР,
	|	СУММА(ДД.гРасходНаПроизводствоЗабалансовая)КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	СУММА(ДД.еКонечныйОстатокКоличество)      КАК еКонечныйОстатокКоличество,
	|	СУММА(ДД.еКонечныйОстатокСтоимость)       КАК еКонечныйОстатокСтоимость,
	|	СУММА(ДД.еКонечныйОстатокПР)              КАК еКонечныйОстатокПР,
	|	СУММА(ДД.еКонечныйОстатокВР)              КАК еКонечныйОстатокВР,
	|	СУММА(ДД.еКонечныйОстатокЗабалансовая)    КАК еКонечныйОстатокЗабалансовая
	|{ВЫБРАТЬ
	|Таблица,
	|Содержание,
	|ТипЗатрат.*,
	|Организация.*,
	|Подразделение.*,
	|ПодразделениеОтправитель.*,
	|ПодразделениеВыпуска.*,
	|Регистратор.*,
	|НаправлениеДеятельности.*,
	|СтатьяКалькуляции.*,
	|АналитикаУчетаНоменклатуры.*,
	|Номенклатура.*,
	|Характеристика.*,
	|Серия.*,
	|Назначение.*,
	|ВидРабот.*,
	|СтатьяРасходов.*,
	|АналитикаРасходов.*,
	|АналитикаУчетаПродукции.*,
	|Продукция.*,
	|ХарактеристикаПродукции.*,
	|СерияПродукции.*,
	|НазначениеПродукции.*,
	|ПартияПроизводства.*,
	|ЗаказНаПроизводство.*,
	|аНачальныйОстатокКоличество,
	|аНачальныйОстатокСтоимость,
	|аНачальныйОстатокПР,
	|аНачальныйОстатокВР,
	|аНачальныйОстатокЗабалансовая,
	|бПоступилоКоличество,
	|бПоступилоСтоимость,
	|бПоступилоПР,
	|бПоступилоВР,
	|бПоступилоЗабалансовая,
	|гРасходНаПроизводствоКоличество,
	|гРасходНаПроизводствоСтоимость,
	|гРасходНаПроизводствоПР,
	|гРасходНаПроизводствоВР,
	|гРасходНаПроизводствоЗабалансовая,
	|еКонечныйОстатокКоличество,
	|еКонечныйОстатокСтоимость,
	|еКонечныйОстатокПР,
	|еКонечныйОстатокВР,
	|еКонечныйОстатокЗабалансовая}
	|ИЗ
	// материалы
	|(ВЫБРАТЬ
	|	""Производство"" КАК Таблица,
	|	""Начальный остаток (материалы)"" КАК Содержание,
	|	Значение(Перечисление.ТипыЗатрат.Материальные) КАК ТипЗатрат,
	|	ДД.Организация КАК Организация,
	|	Аналитика.Склад КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеОтправитель,
	|	ВЫБОР
	|		КОГДА ДД.Партия Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.Партия Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ КАК ПодразделениеВыпуска,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	Аналитика.Назначение.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура КАК Номенклатура,
	|	Аналитика.Характеристика КАК Характеристика,
	|	Аналитика.Серия КАК Серия,
	|	Аналитика.Назначение КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|	
	|	ДД.Партия КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	ДД.КоличествоОстаток        КАК аНачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток + ДД.ДопРасходыОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеСНДСОстаток + ДД.ПостатейныеПеременныеСНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток + ДД.ДопРасходыРеглОстаток + ДД.ТрудозатратыРеглОстаток + ДД.ПостатейныеПостоянныеРеглОстаток + ДД.ПостатейныеПеременныеРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ                       КАК аНачальныйОстатокСтоимость,
	|	ДД.ПостояннаяРазницаОстаток КАК аНачальныйОстатокПР,
	|	ДД.ВременнаяРазницаОстаток  КАК аНачальныйОстатокВР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРеглОстаток
	|	КОНЕЦ                       КАК аНачальныйОстатокЗабалансовая,
	|	
	|	0 КАК бПоступилоКоличество,
	|	0 КАК бПоступилоСтоимость,
	|	0 КАК бПоступилоПР,
	|	0 КАК бПоступилоВР,
	|	0 КАК бПоступилоЗабалансовая,
	|	
	|	0 КАК гРасходНаПроизводствоКоличество,
	|	0 КАК гРасходНаПроизводствоСтоимость,
	|	0 КАК гРасходНаПроизводствоПР,
	|	0 КАК гРасходНаПроизводствоВР,
	|	0 КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК еКонечныйОстатокКоличество,
	|	0 КАК еКонечныйОстатокСтоимость,
	|	0 КАК еКонечныйОстатокПР,
	|	0 КАК еКонечныйОстатокВР,
	|	0 КАК еКонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			{(&НачалоПериода)},
	|			НЕ &БезОтбораПоПериоду
	|				И АналитикаУчетаНоменклатуры.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|				И (АналитикаУчетаНоменклатуры.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|			)) КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Поступило на незавершенное производство (материалы) для 2.2"",
	|	Значение(Перечисление.ТипыЗатрат.Материальные),
	|	ДД.Организация,
	|	КорАналитика.Склад,
	|	Аналитика.Склад,
	|	ВЫБОР
	|		КОГДА ДД.КорПартия Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.КорПартия КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.КорПартия Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.КорПартия КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.Регистратор,
	|	КорАналитика.Назначение.НаправлениеДеятельности,
	|	КорАналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	КорАналитика.Номенклатура,
	|	КорАналитика.Характеристика,
	|	КорАналитика.Серия,
	|	КорАналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.КорПартия,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|			ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И КорАналитика.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Поступило на незавершенное производство (материалы) для 2.1"",
	|	Значение(Перечисление.ТипыЗатрат.Материальные),
	|	ДД.Организация,
	|	КорАналитика.Склад,
	|	Аналитика.Склад,
	|	КорАналитика.Склад,
	|	ДД.Регистратор,
	|	КорАналитика.Назначение.НаправлениеДеятельности,
	|	КорАналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	КорАналитика.Номенклатура,
	|	КорАналитика.Характеристика,
	|	КорАналитика.Серия,
	|	КорАналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.КорПартия,
	|	ДД.КорПартия,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|			ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ((ДД.Регистратор Ссылка Документ.ВыпускПродукции И НЕ ВЫРАЗИТЬ(ДД.Регистратор КАК Документ.ВыпускПродукции).ВыпускПоРаспоряжениям)
	|		ИЛИ (ДД.Регистратор Ссылка Документ.РаспределениеПроизводственныхЗатрат И НЕ ВЫРАЗИТЬ(ДД.Регистратор КАК Документ.РаспределениеПроизводственныхЗатрат).НовоеПроизводство)
	|		)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Поступило на незавершенное производство (отходы по фиксированной стоимости)"",
	|	Значение(Перечисление.ТипыЗатрат.Материальные),
	|	ДД.Организация,
	|	Аналитика.Склад,
	|	КорАналитика.Склад,
	|	ВЫБОР
	|		КОГДА ДД.Партия Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.Партия Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.Регистратор,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.Партия,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|			ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И Аналитика.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Расход из незавершенного производства (материалы) для 2.2"",
	|	Значение(Перечисление.ТипыЗатрат.Материальные),
	|	ДД.Организация,
	|	Аналитика.Склад,
	|	Аналитика.Склад,
	|	ВЫБОР
	|		КОГДА ДД.Партия Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.Партия Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.Регистратор,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|	
	|	ДД.Партия,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = АналитикаПродукции.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И Аналитика.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Расход из незавершенного производства (материалы) для 2.1"",
	|	Значение(Перечисление.ТипыЗатрат.Материальные),
	|	ДД.Организация,
	|	Аналитика.Склад,
	|	Аналитика.Склад,
	|	Аналитика.Склад,
	|	ДД.Регистратор,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|	
	|	ДД.Партия,
	|	ДД.Партия,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = АналитикаПродукции.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДД.Регистратор Ссылка Документ.ВыпускПродукции
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Конечный остаток (материалы)"",
	|	Значение(Перечисление.ТипыЗатрат.Материальные),
	|	ДД.Организация,
	|	Аналитика.Склад,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ДД.Партия Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.Партия Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.Партия,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток + ДД.ДопРасходыОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеСНДСОстаток + ДД.ПостатейныеПеременныеСНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток + ДД.ДопРасходыРеглОстаток + ДД.ТрудозатратыРеглОстаток + ДД.ПостатейныеПостоянныеРеглОстаток + ДД.ПостатейныеПеременныеРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазницаОстаток,
	|	ДД.ВременнаяРазницаОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРеглОстаток
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			АналитикаУчетаНоменклатуры.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|				И (АналитикаУчетаНоменклатуры.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|			)) КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	// трудозатраты
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Начальный остаток (трудозатраты) для 2.2"" КАК Содержание,
	|	Значение(Перечисление.ТипыЗатрат.ОплатаТруда),
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ КАК ПодразделениеВыпуска,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ПартияПроизводства КАК Партия,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	ДД.КоличествоОстаток КАК аНачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ДД.СтоимостьОстаток
	|	КОНЕЦ КАК аНачальныйОстатокСтоимость,
	|	0,
	|	0,
	|	0,
	|	
	|	0 КАК бПоступилоКоличество,
	|	0 КАК бПоступилоСтоимость,
	|	0 КАК бПоступилоПР,
	|	0 КАК бПоступилоВР,
	|	0 КАК бПоступилоЗабалансовая,
	|	
	|	0 КАК гРасходНаПроизводствоКоличество,
	|	0 КАК гРасходНаПроизводствоСтоимость,
	|	0 КАК гРасходНаПроизводствоПР,
	|	0 КАК гРасходНаПроизводствоВР,
	|	0 КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК еКонечныйОстатокКоличество,
	|	0 КАК еКонечныйОстатокСтоимость,
	|	0 КАК еКонечныйОстатокПР,
	|	0 КАК еКонечныйОстатокВР,
	|	0 КАК еКонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.Остатки(
	|			{(&НачалоПериода)},
	|			ПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			И НЕ &БезОтбораПоПериоду) КАК ДД
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Начальный остаток (трудозатраты) для 2.1"" КАК Содержание,
	|	Значение(Перечисление.ТипыЗатрат.ОплатаТруда),
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ДД.Подразделение КАК ПодразделениеВыпуска,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство КАК Партия,
	|	ДД.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	
	|	ДД.КоличествоОстаток КАК аНачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ДД.СтоимостьОстаток
	|	КОНЕЦ КАК аНачальныйОстатокСтоимость,
	|	0,
	|	0,
	|	0,
	|	
	|	0 КАК бПоступилоКоличество,
	|	0 КАК бПоступилоСтоимость,
	|	0 КАК бПоступилоПР,
	|	0 КАК бПоступилоВР,
	|	0 КАК бПоступилоЗабалансовая,
	|	
	|	0 КАК гРасходНаПроизводствоКоличество,
	|	0 КАК гРасходНаПроизводствоСтоимость,
	|	0 КАК гРасходНаПроизводствоПР,
	|	0 КАК гРасходНаПроизводствоВР,
	|	0 КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК еКонечныйОстатокКоличество,
	|	0 КАК еКонечныйОстатокСтоимость,
	|	0 КАК еКонечныйОстатокПР,
	|	0 КАК еКонечныйОстатокВР,
	|	0 КАК еКонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.Остатки(
	|			{(&НачалоПериода)},
	|			ПартияПроизводства = НЕОПРЕДЕЛЕНО
	|			И НЕ &БезОтбораПоПериоду) КАК ДД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Поступило на незавершенное производство (трудозатраты) для 2.2"",
	|	Значение(Перечисление.ТипыЗатрат.ОплатаТруда),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.Регистратор,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ЕСТЬNULL(ДД.АналитикаУчетаПартийПроизводства.Назначение.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ДД.Стоимость
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ДД
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Поступило на незавершенное производство (трудозатраты) для 2.1"",
	|	Значение(Перечисление.ТипыЗатрат.ОплатаТруда),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ДД.ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ДД.Стоимость
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ДД
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства = НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Расход из незавершенного производства (трудозатраты) для 2.2"",
	|	Значение(Перечисление.ТипыЗатрат.ОплатаТруда),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.Регистратор,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ЕСТЬNULL(ДД.АналитикаУчетаПартийПроизводства.Назначение.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.КорАналитикаУчетаПродукции,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|
	|	ДД.ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ДД.Стоимость
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|	ПО ДД.КорАналитикаУчетаПродукции = АналитикаПродукции.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Расход из незавершенного производства (трудозатраты) для 2.1"",
	|	Значение(Перечисление.ТипыЗатрат.ОплатаТруда),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.КорАналитикаУчетаПродукции,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА ДД.ДокументВыпуска
	|	КОНЕЦ КАК Партия,
	|	ДД.ЗаказНаПроизводство,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ДД.Стоимость
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|	ПО ДД.КорАналитикаУчетаПродукции = АналитикаПродукции.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства = НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Конечный остаток (трудозатраты) для 2.2"",
	|	Значение(Перечисление.ТипыЗатрат.ОплатаТруда),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ДД.СтоимостьОстаток
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			ПартияПроизводства <> НЕОПРЕДЕЛЕНО) КАК ДД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Конечный остаток (трудозатраты) для 2.1"",
	|	Значение(Перечисление.ТипыЗатрат.ОплатаТруда),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ДД.Подразделение,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка),
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ДД.ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ДД.СтоимостьОстаток
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			ПартияПроизводства = НЕОПРЕДЕЛЕНО) КАК ДД
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	// постатейные
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Начальный остаток (постатейные) для 2.2"" КАК Содержание,
	|	Значение(Перечисление.ТипыЗатрат.Прочее),
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	
	|	0                            КАК аНачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК аНачальныйОстатокСтоимость,
	|	ДД.ПостояннаяРазницаОстаток  КАК аНачальныйОстатокПР,
	|	ДД.ВременнаяРазницаОстаток   КАК аНачальныйОстатокВР,
	|	0                            КАК аНачальныйОстатокЗабалансовая,
	|	
	|	0 КАК бПоступилоКоличество,
	|	0 КАК бПоступилоСтоимость,
	|	0 КАК бПоступилоПР,
	|	0 КАК бПоступилоВР,
	|	0 КАК бПоступилоЗабалансовая,
	|	
	|	0 КАК гРасходНаПроизводствоКоличество,
	|	0 КАК гРасходНаПроизводствоСтоимость,
	|	0 КАК гРасходНаПроизводствоПР,
	|	0 КАК гРасходНаПроизводствоВР,
	|	0 КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК еКонечныйОстатокКоличество,
	|	0 КАК еКонечныйОстатокСтоимость,
	|	0 КАК еКонечныйОстатокПР,
	|	0 КАК еКонечныйОстатокВР,
	|	0 КАК еКонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(
	|			{(&НачалоПериода)},
	|			ПартияПроизводства <> НЕОПРЕДЕЛЕНО И НЕ &БезОтбораПоПериоду) КАК ДД
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Начальный остаток (постатейные) для 2.1"" КАК Содержание,
	|	Значение(Перечисление.ТипыЗатрат.Прочее),
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ДД.Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	ДД.ЗаказНаПроизводство.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ДД.ЗаказНаПроизводство,
	|	
	|	0                            КАК аНачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК аНачальныйОстатокСтоимость,
	|	ДД.ПостояннаяРазницаОстаток  КАК аНачальныйОстатокПР,
	|	ДД.ВременнаяРазницаОстаток   КАК аНачальныйОстатокВР,
	|	0                            КАК аНачальныйОстатокЗабалансовая,
	|	
	|	0 КАК бПоступилоКоличество,
	|	0 КАК бПоступилоСтоимость,
	|	0 КАК бПоступилоПР,
	|	0 КАК бПоступилоВР,
	|	0 КАК бПоступилоЗабалансовая,
	|	
	|	0 КАК гРасходНаПроизводствоКоличество,
	|	0 КАК гРасходНаПроизводствоСтоимость,
	|	0 КАК гРасходНаПроизводствоПР,
	|	0 КАК гРасходНаПроизводствоВР,
	|	0 КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК еКонечныйОстатокКоличество,
	|	0 КАК еКонечныйОстатокСтоимость,
	|	0 КАК еКонечныйОстатокПР,
	|	0 КАК еКонечныйОстатокВР,
	|	0 КАК еКонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(
	|			{(&НачалоПериода)},
	|			ПартияПроизводства = НЕОПРЕДЕЛЕНО И НЕ &БезОтбораПоПериоду) КАК ДД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Поступило на незавершенное производство (постатейные) для 2.2"",
	|	Значение(Перечисление.ТипыЗатрат.Прочее),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	Реквизиты.Подразделение,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.Регистратор,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
	|		ПО ДД.Регистратор = Реквизиты.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Поступило на незавершенное производство (постатейные) для 2.1"",
	|	Значение(Перечисление.ТипыЗатрат.Прочее),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	Реквизиты.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
	|	ДД.ЗаказНаПроизводство.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
	|		ПО ДД.Регистратор = Реквизиты.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства = НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Расход из незавершенного производства (постатейные) для 2.2"",
	|	Значение(Перечисление.ТипыЗатрат.Прочее),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.Регистратор,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.АналитикаУчетаПродукции,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|
	|	ДД.ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|	ПО ДД.АналитикаУчетаПродукции = АналитикаПродукции.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Расход из незавершенного производства (постатейные) для 2.1"",
	|	Значение(Перечисление.ТипыЗатрат.Прочее),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
	|	ДД.ЗаказНаПроизводство.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.АналитикаУчетаПродукции,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|	ПО ДД.АналитикаУчетаПродукции = АналитикаПродукции.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства = НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Конечный остаток (постатейные) для 2.2"",
	|	Значение(Перечисление.ТипыЗатрат.Прочее),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазницаОстаток,
	|	ДД.ВременнаяРазницаОстаток,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			ПартияПроизводства <> НЕОПРЕДЕЛЕНО) КАК ДД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Конечный остаток (постатейные) для 2.1"",
	|	Значение(Перечисление.ТипыЗатрат.Прочее),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ДД.Подразделение,
	|	НЕОПРЕДЕЛЕНО,
	|	ДД.ЗаказНаПроизводство.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазницаОстаток,
	|	ДД.ВременнаяРазницаОстаток,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			ПартияПроизводства = НЕОПРЕДЕЛЕНО) КАК ДД
	|) КАК ДД
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	ДД.Таблица,
	|	ДД.Содержание,
	|	ДД.ТипЗатрат,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.ПодразделениеОтправитель,
	|	ДД.ПодразделениеВыпуска,
	|	ДД.Регистратор,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.Номенклатура,
	|	ДД.Характеристика,
	|	ДД.Серия,
	|	ДД.Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.АналитикаУчетаПродукции,
	|	ДД.Продукция,
	|	ДД.ХарактеристикаПродукции,
	|	ДД.СерияПродукции,
	|	ДД.НазначениеПродукции,
	|	
	|	ДД.ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство
	|";
	
	Ресурсы = Новый Массив;
	
	Ресурсы.Добавить("аНачальныйОстатокКоличество");
	Ресурсы.Добавить("аНачальныйОстатокСтоимость");
	Ресурсы.Добавить("аНачальныйОстатокПР");
	Ресурсы.Добавить("аНачальныйОстатокВР");
	Ресурсы.Добавить("аНачальныйОстатокЗабалансовая");
	
	Ресурсы.Добавить("бПоступилоКоличество");
	Ресурсы.Добавить("бПоступилоСтоимость");
	Ресурсы.Добавить("бПоступилоПР");
	Ресурсы.Добавить("бПоступилоВР");
	Ресурсы.Добавить("бПоступилоЗабалансовая");

	Ресурсы.Добавить("гРасходНаПроизводствоКоличество");
	Ресурсы.Добавить("гРасходНаПроизводствоСтоимость");
	Ресурсы.Добавить("гРасходНаПроизводствоПР");
	Ресурсы.Добавить("гРасходНаПроизводствоВР");
	Ресурсы.Добавить("гРасходНаПроизводствоЗабалансовая");

	Ресурсы.Добавить("еКонечныйОстатокКоличество");
	Ресурсы.Добавить("еКонечныйОстатокСтоимость");
	Ресурсы.Добавить("еКонечныйОстатокПР");
	Ресурсы.Добавить("еКонечныйОстатокВР");
	Ресурсы.Добавить("еКонечныйОстатокЗабалансовая");
	
	Возврат Новый Структура("ТекстЗапроса, Ресурсы", ТекстЗапроса, Ресурсы);

КонецФункции

//-- НЕ УТ


Процедура ДобавитьОтборПоВыбраннымРесурсам(Ресурсы, НаборДанных) Экспорт
	
	Если СтрНайти(НаборДанных.Запрос, "ИМЕЮЩИЕ") > 0 Тогда
		// в запросе уже есть отбор
		Возврат;
	КонецЕсли;
	
	НачалоЗапроса = "
	|ИМЕЮЩИЕ
	|	СУММА(%1) <> 0";
	
	ШаблонРесурса = "
	|	ИЛИ СУММА(%1) <> 0";
	
	ТекстОтбора = "";
	
	Для Каждого Поле Из НаборДанных.Поля Цикл
		Если Ресурсы.Найти(Поле.Имя) <> Неопределено Тогда
			
			Если ТекстОтбора = "" Тогда
				ТекстОтбора = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НачалоЗапроса, Поле.Имя);
			Иначе
				ТекстОтбора = ТекстОтбора + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонРесурса, Поле.Имя);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	НаборДанных.Запрос = НаборДанных.Запрос + ТекстОтбора;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ НЕ УТ

#Область БлокировкаПриОбновленииИБ

Процедура ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(ПредставлениеОперации)
	
	ВходящиеДанные = Новый Соответствие;
	
	ВходящиеДанные.Вставить(Метаданные.Документы.ВыпускПродукции);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.РаспоряженияНаСписаниеПоНормативам);
	
	ЗакрытиеМесяцаСервер.ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(ВходящиеДанные, ПредставлениеОперации);
	
КонецПроцедуры

#КонецОбласти

//-- НЕ УТ

#КонецОбласти
