#Область ПрограммныйИнтерфейс

Процедура ЗаписатьНоменклатуруКВыгрузке(МассивДанных) Экспорт
	
	Для Каждого Строка Из МассивДанных Цикл
		
		Набор	= РегистрыСведений.игр_НоменклатураКВыгрузке.СоздатьНаборЗаписей();
		Набор.Отбор.Номенклатура.Установить(Строка.Номенклатура);
		Набор.Отбор.Характеристика.Установить(Строка.Характеристика);
		
		НоваяЗапись	= Набор.Добавить();
		
		НоваяЗапись.Номенклатура	= Строка.Номенклатура;
		НоваяЗапись.Характеристика	= Строка.Характеристика;
		
		НоваяЗапись.ДатаСобытия		= ТекущаяДатаСеанса();
		
		Набор.Записать();
		
	КонецЦикла;
	
КонецПроцедуры   

Процедура УдалитьНоменклатуруКВыгрузке(МассивДанных) Экспорт
	
	Для Каждого Строка Из МассивДанных Цикл
		
		Набор	= РегистрыСведений.игр_НоменклатураКВыгрузке.СоздатьНаборЗаписей();
		Набор.Отбор.Номенклатура.Установить(Строка.Номенклатура);
		Набор.Отбор.Характеристика.Установить(Строка.Характеристика);
		
		Набор.Записать();
		
	КонецЦикла;
	
КонецПроцедуры   

Процедура ВыгрузитьДанные() Экспорт
	
    ЛокальныйФайл	= ПолучитьИмяВременногоФайла("xml");
	МассивИмени		= СтрРазделить(ЛокальныйФайл, "\");
	ИмяФайлаНаСервере	= МассивИмени[МассивИмени.Количество()-1];
	
	НачатьТранзакцию();
	Попытка 
		
		ДанныеДляВыгрузки	= ПолучитьСформированныйФайл(Истина); 
		
		Настройки			= игр_ИнтеграцияКаспиПовтИсп.ПолучитьНастройкиВыгрузкиНоменклатуры();
		
	    АдресСервера 	= Настройки.Адрес;
	    Порт 			= 21; 
	    ИмяПользователя = Настройки.ИмяПользователя;
	    Пароль 			= Настройки.Пароль; 
		Папка			= Настройки.Папка;

        FTP = Новый FTPСоединение(АдресСервера, Порт, ИмяПользователя, Пароль, , Истина, 30);

		КаталогНаСервере = СтрШаблон("/%1/", Папка);
		
		ТекстФайл	= Новый ТекстовыйДокумент;
		ТекстФайл.УстановитьТекст(ДанныеДляВыгрузки);   
		ТекстФайл.Записать(ЛокальныйФайл);

        FTP.УстановитьТекущийКаталог(КаталогНаСервере);
        FTP.Записать(ЛокальныйФайл, ИмяФайлаНаСервере);
		
		ЗафиксироватьТранзакцию();
	Исключение                    
		
		ОтменитьТранзакцию(); 
		
		ЗаписьЖурналаРегистрации("Выгрузка номенклатуры", УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;   
		
	Если НайтиФайлы(ЛокальныйФайл).Количество() > 0 Тогда 
		УдалитьФайлы(ЛокальныйФайл);
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьСформированныйФайл(УдалятьЗаписи = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос	= Новый Запрос;
	Запрос.Текст	= ТекстЗапросаДанныеВыгрузки(); 
	
	Настройки		= игр_ИнтеграцияКаспиПовтИсп.ПолучитьНастройкиВыгрузкиНоменклатуры();
	
	Запрос.УстановитьПараметр("ВидЦеныПродажи", Настройки.ВидЦеныПродажа);   
	Запрос.УстановитьПараметр("ВидЦеныСебестоимость", Настройки.ВидЦеныСебестоимость);  
	
	Результаты	= Запрос.ВыполнитьПакет(); 
	
	ТаблицаНомеклатуры	= Результаты[1].Выгрузить();
	ТаблицаШК			= Результаты[2].Выгрузить();
	ТаблицаОстатки		= Результаты[3].Выгрузить();
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку("UTF-8");
	
	ТипОбъекты			= ФабрикаXDTO.Тип("http://igraika.kz/items", "Объекты");
	ТипНоменклатура		= ФабрикаXDTO.Тип("http://igraika.kz/items", "Номенклатура");   
	ТипШтрихкоды		= ФабрикаXDTO.Тип("http://igraika.kz/items", "Штрихкоды");   
	ТипОстатки			= ФабрикаXDTO.Тип("http://igraika.kz/items", "Остатки");   
	
	Объекты	= ФабрикаXDTO.Создать(ТипОбъекты); 
	
	МассивКУдалению	= Новый Массив;
	
	Для Каждого Строка Из ТаблицаНомеклатуры Цикл 
		
		ОбъектНоменклатура	= ФабрикаXDTO.Создать(ТипНоменклатура);
		
		ОбъектНоменклатура.ID				= СтрШаблон("%1#%2", XMLСтрока(Строка.Номенклатура), XMLСтрока(Строка.Характеристика));
		ОбъектНоменклатура.Артикул			= Строка.Артикул;
		ОбъектНоменклатура.Наименование		= Строка.Наименование;
		ОбъектНоменклатура.Категория		= Строка.Категория;
		ОбъектНоменклатура.ШтрихкодКаспи	= Строка.ШтрихкодКаспи;
		ОбъектНоменклатура.ЦенаПродажи		= Строка.ЦенаПродажи;
		ОбъектНоменклатура.Себестоимость	= Строка.ЦенаСебестоимость;
		Если ЗначениеЗаполнено(Строка.ВесЗнаменатель) Тогда
			ОбъектНоменклатура.Вес				= ОКР(Строка.ВесЧислитель/Строка.ВесЗнаменатель,3);
		Иначе
			ОбъектНоменклатура.Вес				= 0;
		КонецЕсли;
		
		НайденныеШтрикоды	= ТаблицаШК.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", Строка.Номенклатура, Строка.Характеристика));
		Для Каждого НайденнаяСтрока Из НайденныеШтрикоды Цикл
			Штрихкоды	= ФабрикаXDTO.Создать(ТипШтрихкоды);
			Штрихкоды.Штрихкод	= НайденнаяСтрока.Штрихкод;
			
			ОбъектНоменклатура.Штрихкоды.Добавить(Штрихкоды);
		КонецЦикла;
		
		НайденныеОстатки	= ТаблицаОстатки.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", Строка.Номенклатура, Строка.Характеристика));
		Для Каждого НайденнаяСтрока Из НайденныеОстатки Цикл
			Остатки	= ФабрикаXDTO.Создать(ТипОстатки);
			Остатки.Остаток	= НайденнаяСтрока.Остаток;
			Остатки.Склад		= Строка(НайденнаяСтрока.Склад);
			Остатки.IDСклада	= XMLСтрока(НайденнаяСтрока.Склад);
			
			ОбъектНоменклатура.Остатки.Добавить(Остатки);
		КонецЦикла;
		
		Объекты.Строка.Добавить(ОбъектНоменклатура);
		
		Если УдалятьЗаписи Тогда
			МассивКУдалению.Добавить(Новый Структура("Номенклатура, Характеристика", Строка.Номенклатура, Строка.Характеристика));
		КонецЕсли;
			
		
	КонецЦикла;
	
	ФабрикаXDTO.ЗаписатьXML(Запись, Объекты); 
	
	УдалитьНоменклатуруКВыгрузке(МассивКУдалению);
	
	Возврат Запись.Закрыть();	
	
КонецФункции 

Функция ТекстЗапросаДанныеВыгрузки() 
	
	ТекстЗапроса	= 
	"ВЫБРАТЬ ПЕРВЫЕ 500
	|	игр_НоменклатураКВыгрузке.Номенклатура КАК Номенклатура,
	|	игр_НоменклатураКВыгрузке.Характеристика КАК Характеристика,
	|	игр_НоменклатураКВыгрузке.ДатаСобытия КАК ДатаСобытия
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	РегистрСведений.игр_НоменклатураКВыгрузке КАК игр_НоменклатураКВыгрузке
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураСправочник.Ссылка КАК Номенклатура,
	|	НоменклатураСправочник.Наименование КАК Наименование,
	|	НоменклатураСправочник.Артикул КАК Артикул,
	|	НоменклатураСправочник.ВесЗнаменатель КАК ВесЗнаменатель,
	|	НоменклатураСправочник.ВесЧислитель КАК ВесЧислитель,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	ЕСТЬNULL(СвободныеОстатки.ВНаличииОстаток, 0) КАК ВНаличииОстаток,
	|	ЕСТЬNULL(ЦеныНоменклатурыПродажи.Цена, 0) КАК ЦенаПродажи,
	|	ЕСТЬNULL(ЦеныНоменклатурыСебестоимость.Цена, 0) КАК ЦенаСебестоимость,
	|	ПРЕДСТАВЛЕНИЕ(НоменклатураСправочник.Родитель) КАК Категория,
	|	ЕСТЬNULL(игр_ИдентификаторыСинхронизирумыхОбъектов.Идентификатор, """") КАК ШтрихкодКаспи
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
	|		ПО ВТ_Номенклатура.Номенклатура = НоменклатураСправочник.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО ВТ_Номенклатура.Характеристика = ХарактеристикиНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки КАК СвободныеОстатки
	|		ПО ВТ_Номенклатура.Номенклатура = СвободныеОстатки.Номенклатура
	|			И ВТ_Номенклатура.Характеристика = СвободныеОстатки.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыПродажи
	|		ПО ВТ_Номенклатура.Номенклатура = ЦеныНоменклатурыПродажи.Номенклатура
	|			И ВТ_Номенклатура.Характеристика = ЦеныНоменклатурыПродажи.Характеристика
	|			И (ЦеныНоменклатурыПродажи.ВидЦены = &ВидЦеныПродажи)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСебестоимость
	|		ПО ВТ_Номенклатура.Номенклатура = ЦеныНоменклатурыСебестоимость.Номенклатура
	|			И ВТ_Номенклатура.Характеристика = ЦеныНоменклатурыСебестоимость.Характеристика
	|			И (ЦеныНоменклатурыСебестоимость.ВидЦены = &ВидЦеныСебестоимость)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.игр_ИдентификаторыСинхронизирумыхОбъектов КАК игр_ИдентификаторыСинхронизирумыхОбъектов
	|		ПО ВТ_Номенклатура.Номенклатура = игр_ИдентификаторыСинхронизирумыхОбъектов.Объект
	|			И ВТ_Номенклатура.Характеристика = игр_ИдентификаторыСинхронизирумыхОбъектов.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО ВТ_Номенклатура.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
	|			И ВТ_Номенклатура.Характеристика = ШтрихкодыНоменклатуры.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СвободныеОстатки.Номенклатура КАК Номенклатура,
	|	СвободныеОстатки.Характеристика КАК Характеристика,
	|	СвободныеОстатки.Склад КАК Склад,
	|	СвободныеОстатки.ВНаличииОстаток КАК Остаток
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки КАК СвободныеОстатки
	|		ПО ВТ_Номенклатура.Номенклатура = СвободныеОстатки.Номенклатура
	|			И ВТ_Номенклатура.Характеристика = СвободныеОстатки.Характеристика"
	;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти