
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьРеквизиты();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаказы(Команда)
	
	СформироватьЗаказыНаСервере();
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗаказы;
	
КонецПроцедуры

&НаКлиенте
Процедура ПополнитьСклад(Команда)
	
	ТаблицаИсточников	= Новый СписокЗначений;
	Для Каждого Элемент Из КолонкиСкладов Цикл
		ТаблицаИсточников.Добавить(Элемент.Склад);
	КонецЦикла;
	
	ПараметрыФормы	= Новый Структура;
	ПараметрыФормы.Вставить("ТаблицаИсточников", ТаблицаИсточников);
	
	ОткрытьФорму("Обработка.игр_ФормированиеЗаказовНаПеремещение.Форма.ФормаНастройкаПополнения", 
		ПараметрыФормы, ЭтотОбъект,,,,
		Новый ОписаниеОповещения("ПополнитьСклад_Завершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементоыФормы

&НаКлиенте
Процедура ТаблицаОстатковНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ИсточникКолонка	= Элементы.ТаблицаОстатков.ТекущийЭлемент.Имя;
	Если НЕ СтрЗаканчиваетсяНа(ИсточникКолонка, "Доступно") Тогда
		Выполнение = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОстатковПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОстатковОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОстатковПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ТаблицаОстатков.ТекущиеДанные;
	ТекущаяСтрока = Элементы.ТаблицаОстатков.ТекущаяСтрока;
	
	ИсточникКолонка	= Элементы.ТаблицаОстатков.ТекущийЭлемент.Имя;
	ПриемникКолонка	= Поле.Имя;
	
	ПараметрыПемещения	= ПараметраПеремещения();
	ПараметрыПемещения.Вставить("ИсточникКолонка", ИсточникКолонка);
	ПараметрыПемещения.Вставить("ПриемникКолонка", ПриемникКолонка);
	ПараметрыПемещения.Вставить("ТекущаяСтрока", ТекущаяСтрока);
	
	Оповещение	= Новый ОписаниеОповещения("ВводКоличестваПеретаскиваниеЗавершение", ЭтотОбъект, ПараметрыПемещения);
	
	ПоказатьВводЧисла(Оповещение, ТекущиеДанные[ИсточникКолонка], "Количество", 10, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеСтроки	= ТаблицаЗаказов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ДанныеСтроки <> Неопределено Тогда
		ПоказатьЗначение(, ДанныеСтроки.Заказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОстатковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеСтроки	= ТаблицаОстатков.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ДанныеСтроки <> Неопределено Тогда
		ПоказатьЗначение(, ДанныеСтроки.Номенклатура);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ТаблицаОстатков.Очистить();
	ТаблицаДействий.Очистить();
	
	УдалитьКолонкиСкладов();
	ЗаполнитьТаблицуОстатков();
	СвернутьТаблицуОстатков();
	СоздатьЭлементыКолонкиСкладов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОстатков()
	
	РеквизитОбъект	= РеквизитФормыВЗначение("Объект");
	Схема			= РеквизитОбъект.ПолучитьМакет("СхемаПолученияОстатков");
	
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек.Настройки, "ДатаОстатков", КонецДня(ТекущаяДатаСеанса()), Истина);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек.Настройки, "ВидЦены", ВидЦен, Истина);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек.Настройки, "Сегмент", Сегмент, Истина);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек.Настройки, "ИспользуетсяОтборПоСегменту", ЗначениеЗаполнено(Сегмент), Истина);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек.Настройки, "Организация", Организация, Истина);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек.Настройки, "ДатаНачалаПродаж", ДатаНачала, Истина);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек.Настройки, "ДатаОкончанияПродаж", КонецДня(ДатаОкончания), Истина);
	
	КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки		= КомпоновщикМакета.Выполнить(Схема, КомпоновщикНастроек.ПолучитьНастройки(),,,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
	ПроцессорКомпоновки	= Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ТаблицаДанных	= Новый ТаблицаЗначений;
	
	ПроцессорВывода	= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаДанных);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Кэш	= Новый Соответствие;
	Кэш.Вставить("Рейтинги", Новый Соответствие);
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		Если Кэш[СтрокаТаблицы.Склад] = Неопределено Тогда
			Кэш.Вставить(СтрокаТаблицы.Склад, Новый Массив);
			СоздатьКолонкиСклада(СтрокаТаблицы.Склад);
			Описание = ОписаниеКолонкиСкладов(СтрокаТаблицы.Склад);
			Кэш[СтрокаТаблицы.Склад].Добавить(Описание[0].Значение);
			Кэш[СтрокаТаблицы.Склад].Добавить(Описание[1].Значение);
			Кэш[СтрокаТаблицы.Склад].Добавить(Описание[2].Значение);
			Кэш[СтрокаТаблицы.Склад].Добавить(Описание[3].Значение);
			Кэш[СтрокаТаблицы.Склад].Добавить(Описание[4].Значение);
			Кэш["Рейтинги"].Вставить(Описание[3].Значение, Новый Соответствие);
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаТаблицы.РейтингСклад) Тогда
			Кэш["Рейтинги"][Кэш[СтрокаТаблицы.Склад][3]].Вставить(СтрокаТаблицы.Номенклатура, СтрокаТаблицы.РейтингСклад);
		КонецЕсли;
		
		НоваяСтрока	= ТаблицаОстатков.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		
		НоваяСтрока[Кэш[СтрокаТаблицы.Склад][0]] = СтрокаТаблицы.Доступно;
		НоваяСтрока[Кэш[СтрокаТаблицы.Склад][2]] = СтрокаТаблицы.ВПути;
		НоваяСтрока[Кэш[СтрокаТаблицы.Склад][4]] = СтрокаТаблицы.Продажи;
		
	КонецЦикла;
	
	// проставим рейтинг
	Для Каждого ТекСтрока Из ТаблицаОстатков Цикл
		Для Каждого КлючЗначение Из Кэш["Рейтинги"] Цикл
			Если КлючЗначение.Значение[ТекСтрока.Номенклатура] <> Неопределено Тогда
				ТекСтрока[КлючЗначение.Ключ] = КлючЗначение.Значение[ТекСтрока.Номенклатура];
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СвернутьТаблицуОстатков()
	
	РеквизитТаблицы	= РеквизитФормыВЗначение("ТаблицаОстатков");
	
	СтрокаИтогов = "";
	СтрокаДопГруппировки = "";
	
	Для Каждого СтрокаТаблицы Из КолонкиСкладов Цикл
		
		ОписаниеКолонки	= ОписаниеКолонкиСкладов(СтрокаТаблицы.Склад);
		Для Каждого ЭлементКоллекции Из ОписаниеКолонки Цикл
			Если СтрЗаканчиваетсяНа(ЭлементКоллекции.Значение, "Рейтинг") Тогда
				СтрокаДопГруппировки = СтрокаДопГруппировки + ЭлементКоллекции.Значение + ","; 
			Иначе
				СтрокаИтогов = СтрокаИтогов + ЭлементКоллекции.Значение + ","; 
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;	
	
	СтрокаИтогов = СтрокаИтогов + "Итог";
	
	РеквизитТаблицы.Свернуть(СтрокаДопГруппировки + "Номенклатура, Характеристика, ОтображатьНоменклатуру, Цена, Рейтинг", СтрокаИтогов);
	ПредыдущаяНоменклатура	= Неопределено;
	Для Каждого СтрокаТаблицы Из РеквизитТаблицы Цикл
		
		Если СтрокаТаблицы.Номенклатура = ПредыдущаяНоменклатура Тогда
			СтрокаТаблицы.ОтображатьНоменклатуру = Ложь;
		Иначе
			СтрокаТаблицы.ОтображатьНоменклатуру = Истина;
		КонецЕсли;
		
		Для Каждого Колонка Из РеквизитТаблицы.Колонки Цикл
			Если СтрЗаканчиваетсяНа(Колонка.Имя, "Доступно") Тогда
				СтрокаТаблицы.Итог = СтрокаТаблицы.Итог + СтрокаТаблицы[Колонка.Имя];
			КонецЕсли;
		КонецЦикла;
		
		ПредыдущаяНоменклатура = СтрокаТаблицы.Номенклатура;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(РеквизитТаблицы, "ТаблицаОстатков");
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКолонкиСклада(Склад)
	
	ДобавляемыеРеквизиты	= Новый Массив;
	
	НоваяСтрока	= КолонкиСкладов.Добавить();
	НоваяСтрока.Склад	= Склад;
	
	ОписаниеТипа		= ОбщегоНазначения.ОписаниеТипаЧисло(10,0);
	ОписаниеТипаСтрока	= ОбщегоНазначения.ОписаниеТипаСтрока(3);
	
	ОписаниеКолонок	= ОписаниеКолонкиСкладов(Склад);
	Для Каждого ЭлементКоллекции Из ОписаниеКолонок Цикл
		
		ДобавляемыеРеквизиты.Добавить(
			Новый РеквизитФормы(ЭлементКоллекции.Значение, 
								?(СтрЗаканчиваетсяНа(ЭлементКоллекции.Значение, "Рейтинг"), ОписаниеТипаСтрока, ОписаниеТипа), 
								"ТаблицаОстатков", 
								ЭлементКоллекции.Представление));
		
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьРеквизиты()
	
	РеквизитОбъект	= РеквизитФормыВЗначение("Объект");
	Схема			= РеквизитОбъект.ПолучитьМакет("СхемаПолученияОстатков");
	
	#Если _ Тогда
		Схема = Новый СхемаКомпоновкиДанных;
	#КонецЕсли
	
	АдресСхемы	= ПоместитьВоВременноеХранилище(Схема, УникальныйИдентификатор);
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек.Настройки, "ДатаОстатков", ТекущаяДатаСеанса(), Истина);
	
	Организация   = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьКолонкиСкладов()
	
	УдаляемыеРеквизиты	= Новый Массив;
	
	УсловноеОформление.Элементы.Очистить();
	
	Для Каждого СтрокаТаблицы Из КолонкиСкладов Цикл
		
		Индекс	= КолонкиСкладов.Индекс(СтрокаТаблицы);
		Элементы.Удалить(Элементы[СтрШаблон("ГруппаСкладов%1", Индекс)]);
		
		ОписаниеКолонки	= ОписаниеКолонкиСкладов(СтрокаТаблицы.Склад);
		Для Каждого ЭлементКоллекции Из ОписаниеКолонки Цикл
			
			УдаляемыеРеквизиты.Добавить(СтрШаблон("ТаблицаОстатков.%1", ЭлементКоллекции.Значение));
			Если Элементы.Найти(ЭлементКоллекции.Значение) <> Неопределено Тогда
				Элементы.Удалить(Элементы[ЭлементКоллекции.Значение]);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если Элементы.Найти("ГруппаСкладовИтого") <> Неопределено Тогда
		Элементы.Удалить(Элементы["ГруппаСкладовИтого"]);
	КонецЕсли;
	
	КолонкиСкладов.Очистить();
	ИзменитьРеквизиты(, УдаляемыеРеквизиты);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыКолонкиСкладов()
	
	УстановитьУсловноеОформлениеПоля("ТаблицаОстатковНоменклатура");
	
	Для Каждого СтрокаТаблицы Из КолонкиСкладов Цикл
		
		Склад	= СтрокаТаблицы.Склад;
		Индекс	= КолонкиСкладов.Индекс(СтрокаТаблицы);
		
		ГруппаКолонок	= Элементы.Добавить(
			СтрШаблон("ГруппаСкладов%1", Индекс), Тип("ГруппаФормы"), Элементы.ТаблицаОстатков);
		ГруппаКолонок.Вид		= ВидГруппыФормы.ГруппаКолонок;
		ГруппаКолонок.Заголовок	= Строка(Склад);
		ГруппаКолонок.Группировка		= ГруппировкаКолонок.Горизонтальная;
		ГруппаКолонок.ОтображатьВШапке	= Истина;
		ГруппаКолонок.Ширина			= 10;
		ГруппаКолонок.РастягиватьПоГоризонтали	= Ложь;
		
		ОписаниеКолонок	= ОписаниеКолонкиСкладов(Склад);
		Для Каждого ЭлементКоллекции Из ОписаниеКолонок Цикл
			
			НовыйЭлемент	= Элементы.Добавить(ЭлементКоллекции.Значение, Тип("ПолеФормы"), ГруппаКолонок);
			НовыйЭлемент.Вид		= ВидПоляФормы.ПолеНадписи;
			НовыйЭлемент.Заголовок	= ЭлементКоллекции.Представление;
			НовыйЭлемент.ПутьКДанным	= СтрШаблон("ТаблицаОстатков.%1", ЭлементКоллекции.Значение);
			НовыйЭлемент.Ширина			= 5;
			НовыйЭлемент.РастягиватьПоГоризонтали	= Ложь;
			НовыйЭлемент.ГоризонтальноеПоложение	= ГоризонтальноеПоложениеЭлемента.Центр;
			Если СтрЗаканчиваетсяНа(ЭлементКоллекции.Значение, "Доступно") Тогда
				НовыйЭлемент.Шрифт	= Новый Шрифт(,,Истина);
			КонецЕсли;
			
			УстановитьУсловноеОформлениеПоля(ЭлементКоллекции.Значение);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ГруппаКолонок	= Элементы.Добавить(
		"ГруппаСкладовИтого", Тип("ГруппаФормы"), Элементы.ТаблицаОстатков);
	ГруппаКолонок.Вид		= ВидГруппыФормы.ГруппаКолонок;
	ГруппаКолонок.Заголовок	= "Итого";
	
	НовыйЭлемент	= Элементы.Добавить("ТаблицаОстатковИтог", Тип("ПолеФормы"), ГруппаКолонок);
	НовыйЭлемент.Вид			= ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным	= "ТаблицаОстатков.Итог";
	
//	Элементы.Переместить(Элементы.ТаблицаОстатковИтог, Элементы.ТаблицаОстатков, Элементы.ТаблицаОстатковРейтинг);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеПоля(ИмяПоля)
	
	Поле	= Элементы.Найти(ИмяПоля);
	
	Элемент	= УсловноеОформление.Элементы.Добавить();
		
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Поле.Имя);
	
	Если ИмяПоля = "ТаблицаОстатковНоменклатура" Тогда
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаОстатковЦена");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаОстатков.ОтображатьНоменклатуру");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Ложь;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "");
		
	ИначеЕсли СтрЗаканчиваетсяНа(ИмяПоля, "Доступно") Тогда
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаОстатков." + ИмяПоля);
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = 0;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЛососьСветлый);
		
	ИначеЕсли СтрЗаканчиваетсяНа(ИмяПоля, "ПриходРасход") Тогда
		
		Элемент.Оформление.УстановитьЗначениеПараметра("ВыделятьОтрицательные", Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОписаниеКолонкиСкладов(Склад)
	
	Результат = Новый СписокЗначений;
	
	Идентификатор	= СтрЗаменить(XMLСтрока(Склад),"-","_");
	
	Результат.Добавить(СтрШаблон("_%1_Доступно", Идентификатор), "Доступно");
	Результат.Добавить(СтрШаблон("_%1_ПриходРасход", Идентификатор), "+/-");
	Результат.Добавить(СтрШаблон("_%1_ВПути", Идентификатор), "В пути");
	Результат.Добавить(СтрШаблон("_%1_Рейтинг", Идентификатор), "Р");
	Результат.Добавить(СтрШаблон("_%1_Продажи", Идентификатор), "Пр");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СкладПоКолонке(ИмяКолонки)
	
	Идентификатор = СтрЗаменить(Сред(ИмяКолонки, 2, 36),"_","-");
	
	Результат = Неопределено;
	
	Попытка
		Результат = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));
	Исключение
		Результат = Неопределено;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПараметраПеремещения()
	
	ПараметрыПемещения	= Новый Структура;
	ПараметрыПемещения.Вставить("ИсточникКолонка", "");
	ПараметрыПемещения.Вставить("ПриемникКолонка", "");
	ПараметрыПемещения.Вставить("ТекущаяСтрока", 0);
	
	Возврат ПараметрыПемещения;
	
КонецФункции

&НаКлиенте
Процедура ВводКоличестваПеретаскиваниеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьПеремещениеНаСервере(Результат, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПеремещениеНаСервере(РезультатКоличество, ДополнительныеПараметры)
	
	ПараметрыПеремещения	= ПараметраПеремещения();
	ЗаполнитьЗначенияСвойств(ПараметрыПеремещения, ДополнительныеПараметры);
	
	СкладИсточник	= СкладПоКолонке(ПараметрыПеремещения.ИсточникКолонка);
	СкладПриемник	= СкладПоКолонке(ПараметрыПеремещения.ПриемникКолонка);
	
	Если ЗначениеЗаполнено(СкладИсточник) И ЗначениеЗаполнено(СкладПриемник)
		И СкладИсточник <> СкладПриемник Тогда
		ДанныеСтроки	= ТаблицаОстатков.НайтиПоИдентификатору(ПараметрыПеремещения.ТекущаяСтрока);
		Если ДанныеСтроки = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		КоличествоДляПеремещения	= Мин(РезультатКоличество, ДанныеСтроки[ПараметрыПеремещения.ИсточникКолонка]);
		
		НоваяСтрока	= ТаблицаДействий.Добавить();
		НоваяСтрока.Номенклатура	= ДанныеСтроки.Номенклатура;
		НоваяСтрока.Характеристика	= ДанныеСтроки.Характеристика;
		НоваяСтрока.Количество		= КоличествоДляПеремещения;
		НоваяСтрока.Источник		= СкладИсточник;
		НоваяСтрока.Приемник		= СкладПриемник;
		
		КолонкиИсточник = ОписаниеКолонкиСкладов(СкладИсточник);
		КолонкиПриемник = ОписаниеКолонкиСкладов(СкладПриемник);
		
		ДанныеСтроки[КолонкиИсточник[0].Значение] = ДанныеСтроки[КолонкиИсточник[0].Значение] - КоличествоДляПеремещения;
		ДанныеСтроки[КолонкиИсточник[1].Значение] = ДанныеСтроки[КолонкиИсточник[1].Значение] - КоличествоДляПеремещения;
		
		ДанныеСтроки[КолонкиПриемник[0].Значение] = ДанныеСтроки[КолонкиПриемник[0].Значение] + КоличествоДляПеремещения;
		ДанныеСтроки[КолонкиПриемник[1].Значение] = ДанныеСтроки[КолонкиПриемник[1].Значение] + КоличествоДляПеремещения;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаказыНаСервере()
	
	ТаблицаЗаказов.Очистить();
	
	ТаблицаДляФормирования	= СкорректированнаяТаблицаДействий(ТаблицаДействий.Выгрузить());
	
	ВременныйДокумент		= Документы.ЗаказНаПеремещение.СоздатьДокумент();
	ТаблицаТоваровДокумента	= ВременныйДокумент.Товары.Выгрузить();
	
	ТаблицаСкладов	= ТаблицаДляФормирования.Скопировать();
	ТаблицаСкладов.Свернуть("Источник, Приемник", "");
	
	ПараметрыЗаполнения	= Новый Соответствие;
	ПараметрыЗаполнения.Вставить("Источник", ТаблицаДляФормирования);
	ПараметрыЗаполнения.Вставить("Товары", ТаблицаТоваровДокумента);
	
	Для Каждого СтрокаСклада Из ТаблицаСкладов Цикл
		
		НачатьТранзакцию();
		Попытка
			
			НовыйДокумент	= Документы.ЗаказНаПеремещение.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(НовыйДокумент, ПолучитьРеквизитыШапки(СтрокаСклада));
			НовыйДокумент.Товары.Загрузить(ПолучитьТабличнуюЧастьТовары(ПараметрыЗаполнения, СтрокаСклада));
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			
			ЗафиксироватьТранзакцию();
			
			НоваяСтрока	= ТаблицаЗаказов.Добавить();
			НоваяСтрока.Заказ	= НовыйДокумент.Ссылка;
			
		Исключение
			ОтменитьТранзакцию();
			
			Информация	= ИнформацияОбОшибке();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ОбработкаОшибок.КраткоеПредставлениеОшибки(Информация));
				
			ЗаписьЖурналаРегистрации("Формирование заказа на перемещение",
				УровеньЖурналаРегистрации.Ошибка,
				,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(Информация));
			
		КонецПопытки;
		
	КонецЦикла;
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРеквизитыШапки(СтрокаСклада)
	
	Реквизиты	= Новый Структура;
	
	Реквизиты.Вставить("Дата", ТекущаяДатаСеанса());
	Реквизиты.Вставить("Организация", Организация);
	Реквизиты.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПеремещениеТоваров);
	Реквизиты.Вставить("Ответственный", Пользователи.АвторизованныйПользователь());
	Реквизиты.Вставить("СкладОтправитель", СтрокаСклада.Источник);
	Реквизиты.Вставить("СкладПолучатель", СтрокаСклада.Приемник);
	Реквизиты.Вставить("ВариантПриемкиТоваров", Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным);
	Реквизиты.Вставить("СпособДоставки", Перечисления.СпособыДоставки.Самовывоз);
	Реквизиты.Вставить("Статус", Перечисления.СтатусыВнутреннихЗаказов.Закрыт);
	
	Возврат Реквизиты;
	
КонецФункции

&НаСервере
Функция ПолучитьТабличнуюЧастьТовары(ПараметрыЗаполнения, СтрокаСклада)
	
	ТаблицаДляФормирования	= ПараметрыЗаполнения["Источник"];
	ТаблицаТоваровДокумента	= ПараметрыЗаполнения["Товары"].Скопировать();
	
	СтруктураПоиска	= Новый Структура("Источник, Приемник");
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаСклада);
	НайденныеСтроки	= ТаблицаДляФормирования.НайтиСтроки(СтруктураПоиска);
	Для Каждого ЭлементКоллекции Из НайденныеСтроки Цикл
		
		НоваяСтрока	= ТаблицаТоваровДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементКоллекции, "Номенклатура, Характеристика, Количество");
		
		НоваяСтрока.НачалоОтгрузки		= ТекущаяДатаСеанса();
		НоваяСтрока.КоличествоУпаковок	= НоваяСтрока.Количество;
		НоваяСтрока.ВариантОбеспечения	= Перечисления.ВариантыОбеспечения.СоСклада;
		
	КонецЦикла;
	
	Возврат ТаблицаТоваровДокумента;
	
КонецФункции

&НаСервере
Функция СкорректированнаяТаблицаДействий(ТаблицаДляКорректировки)
	
	Запрос	= Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДействий.Источник КАК Источник,
	|	ТаблицаДействий.Приемник КАК Приемник,
	|	ТаблицаДействий.Номенклатура КАК Номенклатура,
	|	ТаблицаДействий.Характеристика КАК Характеристика,
	|	ТаблицаДействий.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ТаблицаДействий
	|ИЗ
	|	&ТаблицаДействий КАК ТаблицаДействий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДействий.Источник КАК Источник,
	|	ВТ_ТаблицаДействий.Приемник КАК Приемник,
	|	ВТ_ТаблицаДействий.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаДействий.Характеристика КАК Характеристика,
	|	СУММА(ВТ_ТаблицаДействий.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТаблицаСводно
	|ИЗ
	|	ВТ_ТаблицаДействий КАК ВТ_ТаблицаДействий
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаДействий.Источник,
	|	ВТ_ТаблицаДействий.Приемник,
	|	ВТ_ТаблицаДействий.Номенклатура,
	|	ВТ_ТаблицаДействий.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСводно.Источник КАК Источник,
	|	ВТ_ТаблицаСводно.Приемник КАК Приемник,
	|	ВТ_ТаблицаСводно.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаСводно.Характеристика КАК Характеристика,
	|	ВТ_ТаблицаСводно.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ПерекрестныеДействия
	|ИЗ
	|	ВТ_ТаблицаСводно КАК ВТ_ТаблицаСводно
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСводно.Приемник,
	|	ВТ_ТаблицаСводно.Источник,
	|	ВТ_ТаблицаСводно.Номенклатура,
	|	ВТ_ТаблицаСводно.Характеристика,
	|	-ВТ_ТаблицаСводно.Количество
	|ИЗ
	|	ВТ_ТаблицаСводно КАК ВТ_ТаблицаСводно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПерекрестныеДействия.Источник КАК Источник,
	|	ВТ_ПерекрестныеДействия.Приемник КАК Приемник,
	|	ВТ_ПерекрестныеДействия.Номенклатура КАК Номенклатура,
	|	ВТ_ПерекрестныеДействия.Характеристика КАК Характеристика,
	|	СУММА(ВТ_ПерекрестныеДействия.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_Сводно
	|ИЗ
	|	ВТ_ПерекрестныеДействия КАК ВТ_ПерекрестныеДействия
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПерекрестныеДействия.Источник,
	|	ВТ_ПерекрестныеДействия.Приемник,
	|	ВТ_ПерекрестныеДействия.Номенклатура,
	|	ВТ_ПерекрестныеДействия.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сводно.Источник КАК Источник,
	|	ВТ_Сводно.Приемник КАК Приемник,
	|	ВТ_Сводно.Номенклатура КАК Номенклатура,
	|	ВТ_Сводно.Характеристика КАК Характеристика,
	|	ВТ_Сводно.Количество КАК Количество
	|ИЗ
	|	ВТ_Сводно КАК ВТ_Сводно
	|ГДЕ
	|	ВТ_Сводно.Количество > 0"
	;
	
	Запрос.УстановитьПараметр("ТаблицаДействий", ТаблицаДляКорректировки);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиенте
Процедура ПополнитьСклад_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ПополнитьСкладНаСервере(Результат.Склад, Результат.МассивИсточников, Результат.Процент);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ПополнитьСкладНаСервере(СкладПополнения, МассивИсточников, Процент)
	
	Если НЕ ЗначениеЗаполнено(СкладПополнения)
		ИЛИ МассивИсточников.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КолонкиПриемник	= ОписаниеКолонкиСкладов(СкладПополнения);
	
	Для Каждого СкладИсточник Из МассивИсточников Цикл
		
		КолонкиИсточник	= ОписаниеКолонкиСкладов(СкладИсточник);

		Для Каждого ДанныеСтроки Из ТаблицаОстатков Цикл
			
			Если ДанныеСтроки[КолонкиПриемник[0].Значение] < ДанныеСтроки[КолонкиПриемник[4].Значение] Тогда
				// если доступно меньше, чем продаж, тогда пытаемся пополнить
				
				ДоступноПополнения	= Макс(0, ДанныеСтроки[КолонкиИсточник[0].Значение] - ДанныеСтроки[КолонкиИсточник[4].Значение]);
				Если ДоступноПополнения < ДанныеСтроки[КолонкиИсточник[0].Значение] Тогда
					ДоступноПополнения = ДоступноПополнения + 
						ОКР((ДанныеСтроки[КолонкиИсточник[0].Значение] - ДоступноПополнения) / 100 * Процент,0);
				КонецЕсли;
				
				КоличествоПополнения	= Мин(ДанныеСтроки[КолонкиПриемник[4].Значение] - ДанныеСтроки[КолонкиПриемник[0].Значение], 
					ДоступноПополнения);
				
				Если КоличествоПополнения <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока	= ТаблицаДействий.Добавить();
				НоваяСтрока.Номенклатура	= ДанныеСтроки.Номенклатура;
				НоваяСтрока.Характеристика	= ДанныеСтроки.Характеристика;
				НоваяСтрока.Количество		= КоличествоПополнения;
				НоваяСтрока.Источник		= СкладИсточник;
				НоваяСтрока.Приемник		= СкладПополнения;
				
				ДанныеСтроки[КолонкиИсточник[0].Значение] = ДанныеСтроки[КолонкиИсточник[0].Значение] - КоличествоПополнения;
				ДанныеСтроки[КолонкиИсточник[1].Значение] = ДанныеСтроки[КолонкиИсточник[1].Значение] - КоличествоПополнения;
				
				ДанныеСтроки[КолонкиПриемник[0].Значение] = ДанныеСтроки[КолонкиПриемник[0].Значение] + КоличествоПополнения;
				ДанныеСтроки[КолонкиПриемник[1].Значение] = ДанныеСтроки[КолонкиПриемник[1].Значение] + КоличествоПополнения;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
