#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает имя константы, хранящей номер задания для данного регистра.
//
// Возвращаемое значение:
//	Строка - Строковое предствление имени константы НомерЗаданияКЗакрытиюМесяца.
//
Функция ИмяКонстантыНомераЗадания() Экспорт
	
	Возврат Метаданные.Константы.НомерЗаданияКЗакрытиюМесяца.Имя;
	
КонецФункции

// Увеличивает номер задания в константе.
//
// Возвращаемое значение:
//	Число - Предыдущий номер задания из константы "Номер задания к закрытию месяца".
//
Функция УвеличитьНомерЗадания() Экспорт
	
	Возврат ЗакрытиеМесяцаСервер.УвеличитьНомерЗадания(ИмяКонстантыНомераЗадания());
	
КонецФункции

// Возвращает номер задания из константы.
//
// Возвращаемое значение:
//	Число - Номер текущего задания из константы "Номер задания к закрытию месяца".
//
Функция ПолучитьНомерЗадания() Экспорт
	
	Возврат ЗакрытиеМесяцаСервер.ТекущийНомерЗадания(ИмяКонстантыНомераЗадания());
	
КонецФункции

// Метод создает запись регистра с заданными параметрами.
//
// Параметры:
//	ПериодЗадания   - Дата - Начало периода, для которого необходимо зарегистрировать задание к расчету
//	ДокументЗадания - ДокументСсылка - документ регистратор создавший движение в зависимых регистрах
//	Организация - СправочникСсылка.Организации - организация, по которой необходим перерасчет
//  Операция - Перечисление.ОперацииЗакрытияМесяца - регламентная операция 
//  НомерЗадания - Число - номер задания; если не задано, то будет установлено значение из соответствующей константы.
//
Процедура СоздатьЗаписьРегистра(ПериодЗадания, ДокументЗадания = Неопределено, Организация = Неопределено,
				Операция = Неопределено, НомерЗадания = Неопределено) Экспорт
				
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(ДокументЗадания) И НЕ ЗначениеЗаполнено(Организация) Тогда
		
		// Создаем задание для каждой организации ИБ
		МассивОрганизаций = Справочники.Организации.ДоступныеОрганизации();
		
	Иначе
		
		МассивОрганизаций = Новый Массив;
		
		Если НЕ ЗначениеЗаполнено(Организация) Тогда
			// Попытаемся определить организацию по умолчанию.
			// Если не удастся, то будет вызвано платформенное исключение при записи.
			МассивОрганизаций.Добавить(Справочники.Организации.ОрганизацияПоУмолчанию());
		Иначе
			МассивОрганизаций.Добавить(Организация);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Операция) Тогда
		
		// Создадим задание для каждой возможной операции
		МассивОпераций = Новый Массив;
	
		Для ИндексОперации = 0 По Перечисления.ОперацииЗакрытияМесяца.Количество() - 1 Цикл
			МассивОпераций.Добавить(Перечисления.ОперацииЗакрытияМесяца.Получить(ИндексОперации));
		КонецЦикла;
		
	Иначе
		
		МассивОпераций = ОбщегоНазначенияУТКлиентСервер.Массив(Операция)
		
	КонецЕсли;
	
	// Запишем задания.
	НачатьТранзакцию();
	
	Попытка
		
		Если НомерЗадания = Неопределено Тогда
			НомерЗадания = ПолучитьНомерЗадания();
		КонецЕсли;
		
		Для Каждого ТекущаяОрганизация Из МассивОрганизаций Цикл
			
			Для Каждого ТекущаяОперация Из МассивОпераций Цикл
				
				Месяц = НачалоМесяца(ПериодЗадания);
				
				//++ НЕ УТ
				Если ТекущаяОперация = Перечисления.ОперацииЗакрытияМесяца.РасчетНалогаНаИмущество 
						И НЕ РасчетИмущественныхНалогов.УплачиваютсяАвансыПоНалогуНаИмущество(ТекущаяОрганизация, Месяц)
					
					ИЛИ ТекущаяОперация = Перечисления.ОперацииЗакрытияМесяца.РасчетЗемельногоНалога 
						И НЕ РасчетИмущественныхНалогов.УплачиваютсяАвансыПоЗемельномуНалогу(ТекущаяОрганизация, Месяц)
						
					ИЛИ ТекущаяОперация = Перечисления.ОперацииЗакрытияМесяца.РасчетТранспортногоНалога 
						И НЕ РасчетИмущественныхНалогов.УплачиваютсяАвансыПоТранспортномуНалогу(ТекущаяОрганизация, Месяц) Тогда
					
					Месяц = НачалоМесяца(КонецГода(ПериодЗадания));
				КонецЕсли;
			
				Если  ТекущаяОперация = Перечисления.ОперацииЗакрытияМесяца.РаспределениеНДС Тогда
					НачалоНалоговогоПериода = УчетНДСПереопределяемый.БлижайшийНалоговыйПериод(ТекущаяОрганизация, Месяц).Период;
					Если НачалоНалоговогоПериода <> НачалоКвартала(Месяц) Тогда // ситуация расширенного налогового периода
						ТипыДокументовВНА = Новый ОписаниеТипов("ДокументСсылка.ПринятиеКУчетуОС,ДокументСсылка.ПринятиеКУчетуОС2_4,
																|ДокументСсылка.МодернизацияОС,ДокументСсылка.МодернизацияОС2_4,
																|ДокументСсылка.ПринятиеКУчетуНМА,ДокументСсылка.ПринятиеКУчетуНМА2_4,
																|ДокументСсылка.ВводОстатковВнеоборотныхАктивов,ДокументСсылка.ВводОстатковВнеоборотныхАктивов2_4");
						Если ДокументЗадания <> Неопределено 
						И ТипыДокументовВНА.СодержитТип(ТипЗнч(ДокументЗадания)) Тогда // переносим на первый месяц квартала
							Месяц = НачалоНалоговогоПериода;
						Иначе // переносим на последний месяц квартала
							Месяц = НачалоМесяца(КонецКвартала(НачалоНалоговогоПериода));
						КонецЕсли;
					КонецЕсли;	
					Если ТекущаяОрганизация.ОбособленноеПодразделение Тогда
						ТекущаяОрганизация = ТекущаяОрганизация.ГоловнаяОрганизация;
					КонецЕсли;
				КонецЕсли;
				//-- НЕ УТ
				
				НаборЗаписей = РегистрыСведений.ЗаданияКЗакрытиюМесяца.СоздатьМенеджерЗаписи();
				НаборЗаписей.Месяц        = Месяц;
				НаборЗаписей.Операция     = ТекущаяОперация;
				НаборЗаписей.Организация  = ТекущаяОрганизация;
				НаборЗаписей.Документ     = ДокументЗадания;
				НаборЗаписей.НомерЗадания = НомерЗадания;
				НаборЗаписей.Записать(Истина);
				
			КонецЦикла;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
КонецПроцедуры

// Метод создает записи регистра с параметрами, полученными запросом.
//
// Параметры:
//	Выборка - ВыборкаИзРезультатаЗапроса - выборка, содержащая данные для формирования записей.
//  НомерЗадания - Число - номер задания; если не задано, то будет установлено значение из соответствующей константы.
//
Процедура СоздатьЗаписиРегистраПоДаннымВыборки(Выборка, НомерЗадания = Неопределено) Экспорт
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		// В РИБ данный регистр обрабатывается только в главном узле.
		Возврат;
	КонецЕсли;
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		СтруктураПолей = Новый Структура("Месяц, Организация, Операция, Документ");
		
		Если НомерЗадания = Неопределено Тогда
			НомерЗадания = ПолучитьНомерЗадания();
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(СтруктураПолей, Выборка);
			
			СоздатьЗаписьРегистра(СтруктураПолей.Месяц, СтруктураПолей.Документ, СтруктураПолей.Организация, СтруктураПолей.Операция, НомерЗадания);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки    = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось сформировать задание к закрытию месяца за %1 в организации %2 по причине: %3'"),
			Выборка.Месяц,
			Выборка.Организация,
			ТекстОшибки);
			
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Закрытие месяца'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

// В РИБ закрытие месяца выполняется только в главном узле, при этом из подчиненных узлов
// записи регистра отправляются в главный узел. При получении в ГУ записей от ПУ,
// они регистрируются с текущим номером задания ГУ. Когда в ПУ приходит квитанция о получении
// данных в ГУ, в ПУ записи регистра снимаются с регистрации к обмену и удаляются, т.к. штатными
// средствами (после закрытия месяца, либо при получении удаления от ГУ) в ПУ они не могут быть удалены.
//
Процедура УдалитьЗаписиВПодчиненномУзлеРИБ() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданияКЗакрытиюМесяца.Месяц КАК Месяц,
		|	ЗаданияКЗакрытиюМесяца.Операция КАК Операция,
		|	ЗаданияКЗакрытиюМесяца.Организация КАК Организация,
		|	ЗаданияКЗакрытиюМесяца.Документ КАК Документ,
		|	ЗаданияКЗакрытиюМесяца.НомерЗадания КАК НомерЗадания
		|ИЗ
		|	РегистрСведений.ЗаданияКЗакрытиюМесяца КАК ЗаданияКЗакрытиюМесяца
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаданияКЗакрытиюМесяца.Изменения КАК ЗаданияКЗакрытиюМесяцаИзменения
		|		ПО ЗаданияКЗакрытиюМесяца.Месяц = ЗаданияКЗакрытиюМесяцаИзменения.Месяц
		|			И ЗаданияКЗакрытиюМесяца.Организация = ЗаданияКЗакрытиюМесяцаИзменения.Организация
		|			И ЗаданияКЗакрытиюМесяца.Операция = ЗаданияКЗакрытиюМесяцаИзменения.Операция
		|			И ЗаданияКЗакрытиюМесяца.Документ = ЗаданияКЗакрытиюМесяцаИзменения.Документ
		|			И ЗаданияКЗакрытиюМесяца.НомерЗадания = ЗаданияКЗакрытиюМесяцаИзменения.НомерЗадания
		|ГДЕ
		|	ЗаданияКЗакрытиюМесяцаИзменения.Месяц ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаЗаписей = РезультатЗапроса.Выгрузить();
	Для Сч = 1-ТаблицаЗаписей.Количество() По 0 Цикл
		Выборка = ТаблицаЗаписей[-Сч];
		НаборЗаписей = РегистрыСведений.ЗаданияКЗакрытиюМесяца.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Месяц.Установить(Выборка.Месяц);
		НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация);
		НаборЗаписей.Отбор.Операция.Установить(Выборка.Операция);
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Документ);
		НаборЗаписей.Отбор.НомерЗадания.Установить(Выборка.НомерЗадания);
		НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Формирует задания на следующий период.
//
// Параметры:
//  ВременныеТаблицы	- МенеджерВременныхТаблиц - Содержит таблицу КэшГраниц.
//  СледующийМесяц		- Дата - Дата, начиная с которой нужно сформировать задания.
//
Процедура СформироватьЗаданияНаСледующийПериод(ВременныеТаблицы, СледующийМесяц) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Задания.Операция,
	|	Задания.Организация,
	|	МАКСИМУМ(Задания.НомерЗадания) КАК НомерЗадания
	|ИЗ
	|	КэшГраниц КАК Задания
	|
	|СГРУППИРОВАТЬ ПО
	|	Задания.Операция,
	|	Задания.Организация";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		СледующийПериод = СледующийМесяц;
		
		//++ НЕ УТ
		
		Если Выборка.Операция = Перечисления.ОперацииЗакрытияМесяца.РасчетНалогаНаИмущество Тогда
			
			СледующийПериод = ВнеоборотныеАктивы.ПериодРасчетаНалогаНаИмущество(Выборка.Организация, СледующийМесяц);
			
		ИначеЕсли Выборка.Операция = Перечисления.ОперацииЗакрытияМесяца.РасчетЗемельногоНалога Тогда
			
			СледующийПериод = ВнеоборотныеАктивы.ПериодРасчетаЗемельногоНалога(Выборка.Организация, СледующийМесяц);
			
		ИначеЕсли Выборка.Операция = Перечисления.ОперацииЗакрытияМесяца.РасчетТранспортногоНалога Тогда
			
			СледующийПериод = ВнеоборотныеАктивы.ПериодРасчетаТранспортногоНалога(Выборка.Организация, СледующийМесяц);
			
		ИначеЕсли Выборка.Операция = Перечисления.ОперацииЗакрытияМесяца.ПризнаниеВНалоговомУчетеЛизинговыхПлатежей Тогда
			
			СледующийПериод = ВнеоборотныеАктивы.ПериодПризнанияВНУЛизинговыхПлатежей(Выборка.Организация, СледующийМесяц);
			
		ИначеЕсли Выборка.Операция = Перечисления.ОперацииЗакрытияМесяца.РасчетДоходовИВычетовПоФиксированнымАктивам Тогда
			
			СледующийПериод = ВнеоборотныеАктивы.ПериодРасчетаРегламентныхОперацийВНА_НУ(Выборка.Организация, СледующийМесяц);
			
		ИначеЕсли Выборка.Операция = Перечисления.ОперацииЗакрытияМесяца.ВключениеВСтоимостныйБалансАктивовУчитываемыхОтдельно Тогда
			
			СледующийПериод = НачалоМесяца(ДобавитьМесяц(КонецГода(СледующийМесяц),1))
			
		КонецЕсли;
		
		//-- НЕ УТ
		
		Если ЗначениеЗаполнено(СледующийПериод) Тогда
			НоваяЗапись = РегистрыСведений.ЗаданияКЗакрытиюМесяца.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			НоваяЗапись.Месяц = СледующийПериод;
			НоваяЗапись.Записать(Истина);
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет описания регистров для их подключения к механизму дат запрета изменения.
//
// Параметры:
//  Данные - ТаблицаЗначений - см. описание в механизме БСП.
//
Процедура ОписаниеРегистровДляКонтроляДатЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ДвиженияДенежныеСредстваДоходыРасходы", "Период", "РегламентныеОперации");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ДвиженияДоходыРасходыПрочиеАктивыПассивы", "Период", "РегламентныеОперации");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ДенежныеСредстваБезналичные", "Период", "РегламентныеОперации");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ДенежныеСредстваВКассахККМ", "Период", "РегламентныеОперации");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ДенежныеСредстваВПути", "Период", "РегламентныеОперации");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ДенежныеСредстваНаличные", "Период", "РегламентныеОперации");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц", "Период", "РегламентныеОперации");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ПартииПрочихРасходов", "Период", "РегламентныеОперации");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.РасчетыПоДоговорамКредитовИДепозитов", "Период", "РегламентныеОперации");
	
	//++ НЕ УТ
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ВыпускПродукции", "Период", "РегламентныеОперации");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ДенежныеДокументы", "Период", "РегламентныеОперации");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.КнигаУчетаДоходовИРасходов", "Период", "РегламентныеОперации");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.РасходыПриУСН", "Период", "РегламентныеОперации");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.РасходыПриУСНМатериалы", "Период", "РегламентныеОперации");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.РасходыПриУСНОСиНМА", "Период", "РегламентныеОперации");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.РасходыПриУСНТовары", "Период", "РегламентныеОперации");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СостоянияНМАОрганизаций", "Период", "РегламентныеОперации");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СостоянияОСОрганизаций", "Период", "РегламентныеОперации");
	//-- НЕ УТ
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	//++ НЕ УТ
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗаданияКЗакрытиюМесяца.Месяц КАК Месяц,
	|	ЗаданияКЗакрытиюМесяца.Операция КАК Операция,
	|	ЗаданияКЗакрытиюМесяца.Организация КАК Организация,
	|	ЗаданияКЗакрытиюМесяца.НомерЗадания КАК НомерЗадания,
	|	ЗаданияКЗакрытиюМесяца.Документ КАК Документ
	|ИЗ
	|	РегистрСведений.ЗаданияКЗакрытиюМесяца КАК ЗаданияКЗакрытиюМесяца
	|ГДЕ
	|	ЗаданияКЗакрытиюМесяца.Операция В (
	|		ЗНАЧЕНИЕ(Перечисление.ОперацииЗакрытияМесяца.НачислениеАмортизацииОС),
	|		ЗНАЧЕНИЕ(Перечисление.ОперацииЗакрытияМесяца.УдалитьАмортизацияОС),
	|		ЗНАЧЕНИЕ(Перечисление.ОперацииЗакрытияМесяца.НачислениеАмортизацииНМА))";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРеглУчет") Тогда
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		ДобавитьВременнуюТаблицуНовыхОперацийЗакрытияМесяца(Запрос.МенеджерВременныхТаблиц);
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЗаданияКЗакрытиюМесяца.Месяц КАК Месяц,
		|	ЗаданияКЗакрытиюМесяца.ОперацияЗакрытияМесяца КАК Операция,
		|	ЗаданияКЗакрытиюМесяца.Организация КАК Организация,
		|	Константы.НомерЗаданияКЗакрытиюМесяца КАК НомерЗадания,
		|	НЕОПРЕДЕЛЕНО КАК Документ
		|ИЗ
		|	НовыеЗаданияКЗакрытиюМесяца КАК ЗаданияКЗакрытиюМесяца
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
		|	ПО ЗаданияКЗакрытиюМесяца.Месяц >= НАЧАЛОПЕРИОДА(Константы.ДатаНачалаВеденияРеглУчета, МЕСЯЦ)";
		
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() + ТекстЗапроса;
		
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ДополнительныеПараметрыОтметкиОбработки = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметрыОтметкиОбработки.ЭтоНезависимыйРегистрСведений = Истина;
	ДополнительныеПараметрыОтметкиОбработки.ПолноеИмяРегистра = "РегистрСведений.ЗаданияКЗакрытиюМесяца";
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Результат, ДополнительныеПараметрыОтметкиОбработки);
	//-- НЕ УТ
	
	// В УТ пустой обработчик
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "РегистрСведений.ЗаданияКЗакрытиюМесяца";
	
	//++ НЕ УТ
	ДополнительныеПараметрыОтметкиОбработки = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметрыОтметкиОбработки.ЭтоНезависимыйРегистрСведений = Истина;
	ДополнительныеПараметрыОтметкиОбработки.ПолноеИмяРегистра = "РегистрСведений.ЗаданияКЗакрытиюМесяца";
	
	ВыборкаПоИзмерениям = ОбновлениеИнформационнойБазы.ВыбратьИзмеренияНезависимогоРегистраСведенийДляОбработки(
							Параметры.Очередь, "РегистрСведений.ЗаданияКЗакрытиюМесяца");
							
	Пока ВыборкаПоИзмерениям.Следующий() Цикл
		
		НачатьТранзакцию();
		
 		Попытка
			
 			Блокировка = Новый БлокировкаДанных;
 			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЗаданияКЗакрытиюМесяца");
 			ЭлементБлокировки.УстановитьЗначение("Месяц", ВыборкаПоИзмерениям.Месяц);
 			ЭлементБлокировки.УстановитьЗначение("Операция", ВыборкаПоИзмерениям.Операция);
 			ЭлементБлокировки.УстановитьЗначение("Организация", ВыборкаПоИзмерениям.Организация);
 			ЭлементБлокировки.УстановитьЗначение("НомерЗадания", ВыборкаПоИзмерениям.НомерЗадания);
 			ЭлементБлокировки.УстановитьЗначение("Документ", ВыборкаПоИзмерениям.Документ);
 			Блокировка.Заблокировать();
			
			РегистрИсточник = РегистрыСведений.ЗаданияКЗакрытиюМесяца.СоздатьНаборЗаписей();
			РегистрИсточник.Отбор.Месяц.Установить(ВыборкаПоИзмерениям.Месяц); 
			РегистрИсточник.Отбор.Операция.Установить(ВыборкаПоИзмерениям.Операция); 
			РегистрИсточник.Отбор.Организация.Установить(ВыборкаПоИзмерениям.Организация); 
			РегистрИсточник.Отбор.НомерЗадания.Установить(ВыборкаПоИзмерениям.НомерЗадания); 
			РегистрИсточник.Отбор.Документ.Установить(ВыборкаПоИзмерениям.Документ); 
			РегистрИсточник.Прочитать();
			
			Если РегистрИсточник.Количество() <> 0
				И (ВыборкаПоИзмерениям.Операция = Перечисления.ОперацииЗакрытияМесяца.НачислениеАмортизацииОС
				ИЛИ ВыборкаПоИзмерениям.Операция = Перечисления.ОперацииЗакрытияМесяца.УдалитьАмортизацияОС
				ИЛИ ВыборкаПоИзмерениям.Операция = Перечисления.ОперацииЗакрытияМесяца.НачислениеАмортизацииНМА) Тогда
				
				// Перенос данных в новые регистры.
				Если ВыборкаПоИзмерениям.Операция = Перечисления.ОперацииЗакрытияМесяца.НачислениеАмортизацииНМА Тогда
					МетаданныеПриемника = Метаданные.РегистрыСведений.ЗаданияКРасчетуАмортизацииНМА;
				Иначе
					МетаданныеПриемника = Метаданные.РегистрыСведений.ЗаданияКРасчетуАмортизацииОС;
				КонецЕсли; 
				
				ДокументПрименика = МетаданныеПриемника.Измерения.Документ.Тип.ПривестиЗначение(ВыборкаПоИзмерениям.Документ);
				РегистрПриемник   = РегистрыСведений[МетаданныеПриемника.Имя].СоздатьНаборЗаписей();
				
				РегистрПриемник.Отбор.Месяц.Установить(ВыборкаПоИзмерениям.Месяц); 
				РегистрПриемник.Отбор.Организация.Установить(ВыборкаПоИзмерениям.Организация); 
				РегистрПриемник.Отбор.НомерПакета.Установить(0); 
				РегистрПриемник.Отбор.НомерЗадания.Установить(ВыборкаПоИзмерениям.НомерЗадания); 
				РегистрПриемник.Отбор.Документ.Установить(ДокументПрименика); 
				
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РегистрИсточник, РегистрПриемник);
				
	 			ОбновлениеИнформационнойБазы.ЗаписатьДанные(РегистрПриемник);
				
				// Удаление данных из старого регистра.
				РегистрИсточник.Очистить();
	 			ОбновлениеИнформационнойБазы.ЗаписатьДанные(РегистрИсточник);
				
			ИначеЕсли РегистрИсточник.Количество() = 0
				И (ВыборкаПоИзмерениям.Операция = Перечисления.ОперацииЗакрытияМесяца.ФормированиеРезервовПоСомнительнымДолгам
				ИЛИ ВыборкаПоИзмерениям.Операция = Перечисления.ОперацииЗакрытияМесяца.ФормированиеФинансовогоРезультата) Тогда
				
				НоваяСтрока = РегистрИсточник.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоИзмерениям);
	 			ОбновлениеИнформационнойБазы.ЗаписатьДанные(РегистрИсточник);
				
			Иначе	
				
				ТаблицаРегистра = РегистрИсточник.ВыгрузитьКолонки();
				ЗаполнитьЗначенияСвойств(ТаблицаРегистра.Добавить(), ВыборкаПоИзмерениям);
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ТаблицаРегистра, ДополнительныеПараметрыОтметкиОбработки);
				
			КонецЕсли;
	
			ЗафиксироватьТранзакцию();
			
 		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru = 'Не удалось обработать регистр ЗаданияКЗакрытиюМесяца по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
									УровеньЖурналаРегистрации.Предупреждение,
									Метаданные.РегистрыСведений.ЗаданияКЗакрытиюМесяца,,
									ТекстСообщения);
									
 		КонецПопытки;
	
	КонецЦикла;
	
	//-- НЕ УТ
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

//++ НЕ УТ
	
Процедура ДобавитьВременнуюТаблицуРезервыПоСомнительнымДолгам(ВременныеТаблицы)
	
	ТипыСубконто = Новый Массив;
	ТипыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ТипыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	ТипыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ТипыСубконто", ТипыСубконто);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетнаяПолитикаОрганизацийФормированияРезервов.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитикаОрганизацийФормированияРезервов.Период < НАЧАЛОПЕРИОДА(Константы.ДатаНачалаВеденияРеглУчета, МЕСЯЦ)
	|		ТОГДА НАЧАЛОПЕРИОДА(Константы.ДатаНачалаВеденияРеглУчета, МЕСЯЦ)
	|		ИНАЧЕ УчетнаяПолитикаОрганизацийФормированияРезервов.Период
	|	КОНЕЦ КАК НачалоПериода,
	|	МИНИМУМ(ЕСТЬNULL(УчетнаяПолитикаОрганизацийБезФормированияРезервов.Период, &ТекущаяДата)) КАК КонецПериода
	|ПОМЕСТИТЬ ОрганизацииСФормированиемРезервовПоСомнительнымДолгам
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизацийФормированияРезервов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО ИСТИНА
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизацийБезФормированияРезервов
	|		ПО УчетнаяПолитикаОрганизацийФормированияРезервов.Организация = УчетнаяПолитикаОрганизацийБезФормированияРезервов.Организация
	|			И УчетнаяПолитикаОрганизацийФормированияРезервов.Период < УчетнаяПолитикаОрганизацийБезФормированияРезервов.Период
	|			И (НЕ УчетнаяПолитикаОрганизацийБезФормированияРезервов.УчетнаяПолитика.ФормироватьРезервыПоСомнительнымДолгамБУ)
	|			И (НЕ УчетнаяПолитикаОрганизацийБезФормированияРезервов.УчетнаяПолитика.ФормироватьРезервыПоСомнительнымДолгамНУ)
	|ГДЕ
	|	(УчетнаяПолитикаОрганизацийФормированияРезервов.УчетнаяПолитика.ФормироватьРезервыПоСомнительнымДолгамБУ
	|			ИЛИ УчетнаяПолитикаОрганизацийФормированияРезервов.УчетнаяПолитика.ФормироватьРезервыПоСомнительнымДолгамНУ)
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетнаяПолитикаОрганизацийФормированияРезервов.Организация,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитикаОрганизацийФормированияРезервов.Период < НАЧАЛОПЕРИОДА(Константы.ДатаНачалаВеденияРеглУчета, МЕСЯЦ)
	|		ТОГДА НАЧАЛОПЕРИОДА(Константы.ДатаНачалаВеденияРеглУчета, МЕСЯЦ)
	|		ИНАЧЕ УчетнаяПолитикаОрганизацийФормированияРезервов.Период
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(РасчетыСКлиентамиПоДокументам.Период, МЕСЯЦ) КАК Месяц,
	|	ОрганизацииСФормированиемРезервовПоСомнительнымДолгам.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРегламентныхОпераций.ФормированиеРезервовПоСомнительнымДолгам) КАК РегламентнаяОперация,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииЗакрытияМесяца.ФормированиеРезервовПоСомнительнымДолгам) КАК ОперацияЗакрытияМесяца
	|ПОМЕСТИТЬ РезервыПоСомнительнымДолгам
	|ИЗ
	|	ОрганизацииСФормированиемРезервовПоСомнительнымДолгам КАК ОрганизацииСФормированиемРезервовПоСомнительнымДолгам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|		ПО ОрганизацииСФормированиемРезервовПоСомнительнымДолгам.Организация = РасчетыСКлиентамиПоДокументам.АналитикаУчетаПоПартнерам.Организация
	|			И ОрганизацииСФормированиемРезервовПоСомнительнымДолгам.НачалоПериода <= РасчетыСКлиентамиПоДокументам.Период
	|			И ОрганизацииСФормированиемРезервовПоСомнительнымДолгам.КонецПериода > РасчетыСКлиентамиПоДокументам.Период
	|			И (РасчетыСКлиентамиПоДокументам.Активность)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ХозрасчетныйОстаткиИОбороты.Период, МЕСЯЦ),
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРегламентныхОпераций.ФормированиеРезервовПоСомнительнымДолгам),
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииЗакрытияМесяца.ФормированиеРезервовПоСомнительнымДолгам)
	|ИЗ
	|	ОрганизацииСФормированиемРезервовПоСомнительнымДолгам КАК ОрганизацииСФормированиемРезервовПоСомнительнымДолгам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(, &ТекущаяДата, Месяц, ДвиженияИГраницыПериода, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РезервыПоСомнительнымДолгам), &ТипыСубконто, Субконто3 <> НЕОПРЕДЕЛЕНО) КАК ХозрасчетныйОстаткиИОбороты
	|		ПО ОрганизацииСФормированиемРезервовПоСомнительнымДолгам.Организация = ХозрасчетныйОстаткиИОбороты.Организация
	|			И ОрганизацииСФормированиемРезервовПоСомнительнымДолгам.НачалоПериода <= ХозрасчетныйОстаткиИОбороты.Период
	|			И ОрганизацииСФормированиемРезервовПоСомнительнымДолгам.НачалоПериода > ХозрасчетныйОстаткиИОбороты.Период
	|ГДЕ
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток <> 0
	|	И ХозрасчетныйОстаткиИОбороты.СуммаНУКонечныйОстаток <> 0
	|	И ХозрасчетныйОстаткиИОбороты.СуммаПРКонечныйОстаток <> 0
	|	И ХозрасчетныйОстаткиИОбороты.СуммаВРКонечныйОстаток <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегламентнаяОперация,
	|	Организация,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОрганизацииСФормированиемРезервовПоСомнительнымДолгам";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьВременнуюТаблицуФормированиеФинансовогоРезультата(ВременныеТаблицы)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Организация,
	|	Т.ОбособленноеПодразделение,
	|	Т.ГоловнаяОрганизация
	|ПОМЕСТИТЬ ВТОрганизации
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЕСТЬNULL(ОбособПодр.Ссылка, Организации.Ссылка) КАК Организация, // Получим организации без обособ. подразделений и обособленные подразделения
	|		ЕСТЬNULL(ОбособПодр.ОбособленноеПодразделение, ЛОЖЬ) КАК ОбособленноеПодразделение,
	|		ЕСТЬNULL(ОбособПодр.ГоловнаяОрганизация, Организации.Ссылка) КАК ГоловнаяОрганизация
	|	ИЗ
	|		Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОбособПодр
	|		ПО Организации.Ссылка = ОбособПодр.ГоловнаяОрганизация
	|			И ОбособПодр.ОбособленноеПодразделение
	|	ГДЕ
	|		НЕ Организации.ОбособленноеПодразделение
	|		И Организации.Ссылка <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Организации.Ссылка КАК Организация, // Добавим ссылки на сами головные организации
	|		ЛОЖЬ КАК ОбособленноеПодразделение,
	|		Организации.Ссылка КАК ГоловнаяОрганизация
	|	ИЗ
	|		Справочник.Организации КАК Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОбособПодр
	|		ПО Организации.Ссылка = ОбособПодр.ГоловнаяОрганизация
	|	ГДЕ
	|		НЕ Организации.ОбособленноеПодразделение
	|		И ОбособПодр.ОбособленноеПодразделение
	|		И Организации.Ссылка <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)) КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетнаяПолитикаОрганизацийОСНО.Организация КАК Организация,
	|	УчетнаяПолитикаОрганизацийОСНО.Период КАК НачалоПериода,
	|	МИНИМУМ(ЕСТЬNULL(УчетнаяПолитикаОрганизацийНеОСНО.Период, &ТекущаяДата)) КАК КонецПериода
	|ПОМЕСТИТЬ ОрганизацииНаОСНО
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизацийОСНО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизацийНеОСНО
	|		ПО УчетнаяПолитикаОрганизацийОСНО.Организация = УчетнаяПолитикаОрганизацийНеОСНО.Организация
	|			И УчетнаяПолитикаОрганизацийОСНО.Период < УчетнаяПолитикаОрганизацийНеОСНО.Период
	|			И (ЕСТЬNULL(УчетнаяПолитикаОрганизацийНеОСНО.УчетнаяПолитика.СистемаНалогообложения, ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)) <> ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая))
	|ГДЕ
	|	(ЕСТЬNULL(УчетнаяПолитикаОрганизацийОСНО.УчетнаяПолитика.СистемаНалогообложения, ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)) = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая))
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетнаяПолитикаОрганизацийОСНО.Организация,
	|	УчетнаяПолитикаОрганизацийОСНО.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(ХозрасчетныйОстаткиИОбороты.Период, Месяц) КАК Месяц,
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	СУММА(ВЫБОР
	|		КОГДА Константы.ИсточникСуммыДляПересчетаВВалютуФинОтчетности = ЗНАЧЕНИЕ(Перечисление.ИсточникиСуммыДляПересчетаВВалютуФинОтчетности.УУ)
	|		ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаУУКонечныйОстаток ИНАЧЕ ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток КОНЕЦ) КАК СуммаДляПересчета,
	|	ВЫБОР
	|		КОГДА Константы.ИсточникСуммыДляПересчетаВВалютуФинОтчетности = ЗНАЧЕНИЕ(Перечисление.ИсточникиСуммыДляПересчетаВВалютуФинОтчетности.УУ)
	|		ТОГДА Константы.ВалютаУправленческогоУчета ИНАЧЕ Константы.ВалютаРегламентированногоУчета КОНЕЦ КАК ВалютаДляПересчета,
	|	СУММА(ХозрасчетныйОстаткиИОбороты.СуммаФОКонечныйОстаток) КАК СуммаДляСравнения,
	|	Константы.ВалютаФинОтчетности КАК ВалютаДляСравнения
	|ПОМЕСТИТЬ ТаблицаПереоценки
	|ИЗ
	|	ВТОрганизации КАК Организации
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
	|	ПО (ИСТИНА)
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(, &ТекущаяДата, Месяц, ДвиженияИГраницыПериода, НЕ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрибылиИУбытки)) И НЕ Счет.Забалансовый, , ) КАК ХозрасчетныйОстаткиИОбороты
	|	ПО
	|		Организации.Организация = ХозрасчетныйОстаткиИОбороты.Организация
	|ГДЕ
	|	Константы.ВестиУчетНаПланеСчетовХозрасчетныйВВалютеФинОтчетности
	|
	|СГРУППИРОВАТЬ ПО
	|	КОНЕЦПЕРИОДА(ХозрасчетныйОстаткиИОбороты.Период, Месяц),
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ВЫБОР
	|		КОГДА Константы.ИсточникСуммыДляПересчетаВВалютуФинОтчетности = ЗНАЧЕНИЕ(Перечисление.ИсточникиСуммыДляПересчетаВВалютуФинОтчетности.УУ)
	|		ТОГДА Константы.ВалютаУправленческогоУчета ИНАЧЕ Константы.ВалютаРегламентированногоУчета КОНЕЦ,
	|	Константы.ВалютаФинОтчетности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПереоценки.Месяц КАК Месяц,
	|	МАКСИМУМ(ВЫБОР КОГДА КурсыВалют.Валюта = ТаблицаПереоценки.ВалютаДляПересчета ТОГДА
	|		КурсыВалют.Валюта ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КОНЕЦ) КАК ВалютаДляПересчета,
	|	МАКСИМУМ(ВЫБОР КОГДА КурсыВалют.Валюта = ТаблицаПереоценки.ВалютаДляСравнения ТОГДА
	|		КурсыВалют.Валюта ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КОНЕЦ) КАК ВалютаДляСравнения,
	|	МАКСИМУМ(ВЫБОР КОГДА КурсыВалют.Валюта = ТаблицаПереоценки.ВалютаДляПересчета ТОГДА
	|		КурсыВалют.Период ИНАЧЕ ДАТАВРЕМЯ(1,1,1) КОНЕЦ) КАК ПериодКурсаДляПересчета,
	|	МАКСИМУМ(ВЫБОР КОГДА КурсыВалют.Валюта = ТаблицаПереоценки.ВалютаДляСравнения ТОГДА
	|		КурсыВалют.Период ИНАЧЕ ДАТАВРЕМЯ(1,1,1) КОНЕЦ) КАК ПериодКурсаДляСравнения
	|ПОМЕСТИТЬ ПериодыКурсовВалютПоМесяцам
	|ИЗ
	|	ТаблицаПереоценки КАК ТаблицаПереоценки
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.КурсыВалют КАК КурсыВалют
	|	ПО
	|		ТаблицаПереоценки.Месяц >= КурсыВалют.Период
	|		И (КурсыВалют.Валюта = ТаблицаПереоценки.ВалютаДляПересчета ИЛИ КурсыВалют.Валюта = ТаблицаПереоценки.ВалютаДляСравнения)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПереоценки.Месяц
	|;
	|
	|//////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыКурсовВалют.Месяц КАК Месяц,
	|	ВЫБОР 
	|		КОГДА КурсыВалютДляПересчета.Валюта = КурсыВалютДляСравнения.Валюта
	|			ТОГДА 1
	|		КОГДА КурсыВалютДляПересчета.Курс * КурсыВалютДляСравнения.Кратность = 0
	|			ТОГДА 0
	|		ИНАЧЕ КурсыВалютДляСравнения.Курс * КурсыВалютДляПересчета.Кратность/(КурсыВалютДляПересчета.Курс * КурсыВалютДляСравнения.Кратность)
	|	КОНЕЦ КАК Курс
	|ПОМЕСТИТЬ КурсыВалютПоМесяцам
	|ИЗ
	|	ПериодыКурсовВалютПоМесяцам КАК ПериодыКурсовВалют
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.КурсыВалют КАК КурсыВалютДляСравнения
	|	ПО
	|		ПериодыКурсовВалют.ВалютаДляСравнения = КурсыВалютДляСравнения.Валюта
	|		И ПериодыКурсовВалют.ПериодКурсаДляСравнения = КурсыВалютДляСравнения.Период
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.КурсыВалют КАК КурсыВалютДляПересчета
	|	ПО
	|		ПериодыКурсовВалют.ВалютаДляПересчета = КурсыВалютДляПересчета.Валюта
	|		И ПериодыКурсовВалют.ПериодКурсаДляПересчета = КурсыВалютДляПересчета.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц
	|;
	|
	|//////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПериодыКурсовВалютПоМесяцам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(ХозрасчетныйОбороты.Период, МЕСЯЦ) КАК Месяц,
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииЗакрытияМесяца.ФормированиеФинансовогоРезультата) КАК ОперацияЗакрытияМесяца
	|ПОМЕСТИТЬ ОрганизацииСОборотами
	|ИЗ
	|	ВТОрганизации КАК Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(, &ТекущаяДата, Месяц, , , , ) КАК ХозрасчетныйОбороты
	|		ПО Организации.Организация = ХозрасчетныйОбороты.Организация
	|ГДЕ
	|	КОНЕЦПЕРИОДА(ХозрасчетныйОбороты.Период, ГОД) = КОНЕЦПЕРИОДА(ХозрасчетныйОбороты.Период, МЕСЯЦ) ИЛИ НЕ Организации.ОбособленноеПодразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОрганизацииСОборотами.Месяц КАК Месяц,
	|	ОрганизацииСОборотами.Организация КАК Организация,
	|	ОрганизацииСОборотами.ОперацияЗакрытияМесяца,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРегламентныхОпераций.ФормированиеФинансовогоРезультата) КАК РегламентнаяОперация
	|ПОМЕСТИТЬ ФормированиеФинансовогоРезультата
	|ИЗ
	|	ВТОрганизации КАК Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОрганизацииСОборотами КАК ОрганизацииСОборотами
	|		ПО Организации.Организация = ОрганизацииСОборотами.Организация
	|ГДЕ
	|	НЕ Организации.ОбособленноеПодразделение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОрганизацииСОборотами.Месяц,
	|	ОрганизацииСОборотами.Организация,
	|	ОрганизацииСОборотами.ОперацияЗакрытияМесяца,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРегламентныхОпераций.РасчетНалогаНаПрибыль) КАК РегламентнаяОперация
	|ИЗ
	|	ОрганизацииСОборотами КАК ОрганизацииСОборотами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОрганизацииНаОСНО КАК ОрганизацииНаОСНО
	|	ПО
	|		ОрганизацииСОборотами.Организация = ОрганизацииНаОСНО.Организация
	|		И ОрганизацииНаОСНО.НачалоПериода <= КОНЕЦПЕРИОДА(ОрганизацииСОборотами.Месяц, Месяц)
	|		И ОрганизацииНаОСНО.КонецПериода > КОНЕЦПЕРИОДА(ОрганизацииСОборотами.Месяц, Месяц)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОрганизацииСОборотами.Месяц,
	|	ОрганизацииСОборотами.Организация,
	|	ОрганизацииСОборотами.ОперацияЗакрытияМесяца,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРегламентныхОпераций.СписаниеУбытковПрошлыхЛет) КАК РегламентнаяОперация
	|ИЗ
	|	ОрганизацииСОборотами КАК ОрганизацииСОборотами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(, &ТекущаяДата, ГОД, ДвиженияИГраницыПериода, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиПрошлыхЛет)), , ) КАК ХозрасчетныйОстаткиИОбороты
	|	ПО
	|		ОрганизацииСОборотами.Организация = ХозрасчетныйОстаткиИОбороты.Организация
	|		И НАЧАЛОПЕРИОДА(ОрганизацииСОборотами.Месяц, ГОД) = НАЧАЛОПЕРИОДА(ХозрасчетныйОстаткиИОбороты.Период, ГОД)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОрганизацииНаОСНО КАК ОрганизацииНаОСНО
	|	ПО
	|		ОрганизацииСОборотами.Организация = ОрганизацииНаОСНО.Организация
	|		И ОрганизацииНаОСНО.НачалоПериода <= КОНЕЦПЕРИОДА(ОрганизацииСОборотами.Месяц, Месяц)
	|		И ОрганизацииНаОСНО.КонецПериода > КОНЕЦПЕРИОДА(ОрганизацииСОборотами.Месяц, Месяц)
	|ГДЕ
	|	ХозрасчетныйОстаткиИОбороты.СуммаНУНачальныйОстаток <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ТаблицаПереоценки.Месяц, МЕСЯЦ),
	|	ТаблицаПереоценки.Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииЗакрытияМесяца.ФормированиеФинансовогоРезультата),
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРегламентныхОпераций.ПереоценкаСуммыВВалютеФинОтчетности)
	|ИЗ
	|	ТаблицаПереоценки КАК ТаблицаПереоценки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КурсыВалютПоМесяцам КАК КурсыВалютПоМесяцам
	|		ПО ТаблицаПереоценки.Месяц = КурсыВалютПоМесяцам.Месяц
	|ГДЕ
	|	(ВЫРАЗИТЬ(КурсыВалютПоМесяцам.Курс * ТаблицаПереоценки.СуммаДляПересчета
	|		   КАК ЧИСЛО(15, 2))) <> ТаблицаПереоценки.СуммаДляСравнения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОрганизацииСОборотами.Месяц,
	|	ОрганизацииСОборотами.Организация,
	|	ОрганизацииСОборотами.ОперацияЗакрытияМесяца,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРегламентныхОпераций.ЗакрытиеГода) КАК РегламентнаяОперация
	|ИЗ
	|	ОрганизацииСОборотами КАК ОрганизацииСОборотами
	|ГДЕ
	|	КОНЕЦПЕРИОДА(ОрганизацииСОборотами.Месяц, ГОД) = КОНЕЦПЕРИОДА(ОрганизацииСОборотами.Месяц, МЕСЯЦ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегламентнаяОперация,
	|	Организация,
	|	Месяц";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьВременнуюТаблицуНовыхОперацийЗакрытияМесяца(ВременныеТаблицы)
	
	ДобавитьВременнуюТаблицуРезервыПоСомнительнымДолгам(ВременныеТаблицы);
	ДобавитьВременнуюТаблицуФормированиеФинансовогоРезультата(ВременныеТаблицы);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РезервыПоСомнительнымДолгам.Месяц,
	|	РезервыПоСомнительнымДолгам.Организация,
	|	РезервыПоСомнительнымДолгам.ОперацияЗакрытияМесяца
	|ПОМЕСТИТЬ НовыеЗаданияКЗакрытиюМесяца
	|ИЗ
	|	РезервыПоСомнительнымДолгам КАК РезервыПоСомнительнымДолгам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегламентнаяОперация КАК РегламентныеОперации
	|	ПО
	|		РезервыПоСомнительнымДолгам.РегламентнаяОперация = РегламентныеОперации.ТипОперации
	|		И РезервыПоСомнительнымДолгам.Организация = РегламентныеОперации.Организация
	|		И КОНЕЦПЕРИОДА(РезервыПоСомнительнымДолгам.Месяц, МЕСЯЦ) = КОНЕЦПЕРИОДА(РегламентныеОперации.Дата, Месяц)
	|		И РегламентныеОперации.Проведен
	|ГДЕ
	|	РегламентныеОперации.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ФормированиеФинансовогоРезультата.Месяц,
	|	ФормированиеФинансовогоРезультата.Организация,
	|	ФормированиеФинансовогоРезультата.ОперацияЗакрытияМесяца
	|ИЗ
	|	ФормированиеФинансовогоРезультата КАК ФормированиеФинансовогоРезультата
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегламентнаяОперация КАК РегламентныеОперации
	|	ПО
	|		ФормированиеФинансовогоРезультата.РегламентнаяОперация = РегламентныеОперации.ТипОперации
	|		И ФормированиеФинансовогоРезультата.Организация = РегламентныеОперации.Организация
	|		И КОНЕЦПЕРИОДА(ФормированиеФинансовогоРезультата.Месяц, МЕСЯЦ) = КОНЕЦПЕРИОДА(РегламентныеОперации.Дата, Месяц)
	|		И РегламентныеОперации.Проведен
	|ГДЕ
	|	РегламентныеОперации.Ссылка ЕСТЬ NULL";
	
	Запрос.Выполнить();
	
КонецПроцедуры

//-- НЕ УТ

#КонецОбласти

#КонецОбласти

#КонецЕсли
