
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ЗагрузитьХарактеристики(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для загрузки сначала запишите элемент");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.НаименованиеКаспи) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено наименование Каспи");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьХарактеристикиНаСервере();
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Загрузка завершена");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьХарактеристикиНаСервере()
	
	игр_ИнтеграцияКаспи.ЗагрузитьХарактеристикиКатегорий(Объект.Ссылка, Объект.НаименованиеКаспи);
	
КонецПроцедуры

#КонецОбласти
