&НаКлиенте
Перем ЗНАЧЕНИЕ_ЗакрытьФорму;


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Параметры.Свойство("ЛевоеПолеДоступныеЗначения" , ЛевоеПолеДоступныеЗначения);
	ЭтаФорма.Параметры.Свойство("ПравоеПолеДоступныеЗначения", ПравоеПолеДоступныеЗначения);
	
	МассивСтрок = Новый Массив;
	ЭтаФорма.Параметры.Свойство("ТабличноеПоле" , МассивСтрок);
	Если НЕ МассивСтрок = Неопределено Тогда
		Для каждого ЭлМассива Из МассивСтрок Цикл
			НовСтр = ЭтаФорма.ТабличноеПоле.Добавить();
			НовСтр.ЛевоеПоле  = ЭлМассива.ЛевоеПоле;
			НовСтр.ПравоеПоле = ЭлМассива.ПравоеПоле;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для каждого Эл Из ЛевоеПолеДоступныеЗначения Цикл
	    Элементы.ТабличноеПоле.ПодчиненныеЭлементы.ТабличноеПолеЛевоеПоле.СписокВыбора.Добавить(Эл.Значение);
	КонецЦикла;	
	Для каждого Эл Из ПравоеПолеДоступныеЗначения Цикл
	    Элементы.ТабличноеПоле.ПодчиненныеЭлементы.ТабличноеПолеПравоеПоле.СписокВыбора.Добавить(Эл.Значение);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ Записать И Модифицированность И ЗНАЧЕНИЕ_ЗакрытьФорму = Ложь Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Все изменения будут утеряны. Продолжить?'; en = 'Do you want to continue?'");
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтаФорма); // Прописываем название процедуры-обработчика.
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,	
		0,                    // задержка (секунды). необязательно	
		КодВозвратаДиалога.Да,// задает кнопку по умолчанию. необязательно	
		"Закрытие формы.");   // устанавливаем заголовок. необязательно
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	
	Записать = Истина;
	
	Структура = Новый Структура;
	Структура.Вставить("ТабличноеПоле", ЭтаФорма.ТабличноеПоле);

	Закрыть(Структура);

КонецПроцедуры

#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, Параметры) Экспорт 
	               
	Если Результат = КодВозвратаДиалога.Да Тогда
		   ЗНАЧЕНИЕ_ЗакрытьФорму = Истина;
           Закрыть();	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
