#Область ПрограммныйИнтерфейс

Процедура ВыполнитьОбновлениеДанных(СтруктураПараметров, АдресРезультата) Экспорт
	
	Если НЕ СтруктураПараметров.Свойство("Период") Тогда
		Возврат;
	КонецЕсли;  

	Всего	= СтруктураПараметров.Подразделения.Количество() + 1;
	НПП 	= 0; 
	
	ДлительныеОперации.СообщитьПрогресс(0, "Заполнение данных по организации");
	
	Если ЗначениеЗаполнено(СтруктураПараметров.Организация) Тогда
		ТаблицаДанных	= ПолучитьТаблицуДанных(СтруктураПараметров.Период,, ?(СтруктураПараметров.ПоГруппам, 1, 0));
		СохранитьДанные(ТаблицаДанных, СтруктураПараметров.Организация, СтруктураПараметров.Период.ДатаОкончания);
	КонецЕсли;
	
	Для Каждого Элемент Из СтруктураПараметров.Подразделения Цикл
		НПП = НПП + 1;
		Если ЗначениеЗаполнено(Элемент.Значение) Тогда
			ДлительныеОперации.СообщитьПрогресс(ОКР(НПП/Всего, 0)*100, СтрШаблон("Заполнение данных %1", Элемент.Значение));
			ТаблицаДанных	= ПолучитьТаблицуДанных(СтруктураПараметров.Период, Элемент.Значение, ?(СтруктураПараметров.ПоГруппам, 1, 0));
			СохранитьДанные(ТаблицаДанных, Элемент.Значение, СтруктураПараметров.Период.ДатаОкончания);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуДанных(Период, Подразделение = Неопределено, ВариантФормирования = 0)
	
	Отчет	= Отчеты.игр_АВСАнализКалмыкова.Создать();
	
	СхемаКомпоновки	= Отчет.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	#Если _ Тогда
	СхемаКомпоновки	= Новый СхемаКомпоновкиДанных;
	#КонецЕсли
	
  	Настройки	= СхемаКомпоновки.НастройкиПоУмолчанию;
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Настройки, "ПериодАнализ", Период, Истина);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Настройки, "ПериодСравнение", Период, Истина);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Настройки, "ВариантФормирования", ВариантФормирования, Истина);
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ЭлементОтбора	= Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Подразделение");
		ЭлементОтбора.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение	= Подразделение;
		ЭлементОтбора.Использование		= Истина;
	КонецЕсли; 
	
	ОсновнаяГруппа	= Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("7fe2c479-e010-11e0-ab34-20cf30065c25"));
	ЭлементОтбора	= Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Номенклатура");
	ЭлементОтбора.ВидСравнения	= ВидСравненияКомпоновкиДанных.ВИерархии;
	ЭлементОтбора.ПравоеЗначение	= ОсновнаяГруппа;
	ЭлементОтбора.Использование		= Истина;
	
	ТаблицаДанных	= Отчет.ПолучитьТаблицуДанных(Настройки);
	ТаблицаАВС		= Отчет.ПолучитьСтруктуруТаблицыДляОтчета();
	
	Если ВариантФормирования = 1 Тогда
		Отчет.ЗаполнитьТаблицуДляОтчета(ТаблицаАВС, ТаблицаДанных, "Группа");
	Иначе
		Отчет.ЗаполнитьТаблицуДляОтчета(ТаблицаАВС, ТаблицаДанных, "Номенклатура");
	КонецЕсли;

	Возврат ТаблицаАВС;
	
КонецФункции

Процедура СохранитьДанные(ТаблицаДанных, Раздел, Период)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПериодЗаписи	= НачалоДня(Период + 86400);
	
	Набор	= РегистрыСведений.игр_АВСКлассификацияНоменклатуры.СоздатьНаборЗаписей();
	Набор.Отбор.Период.Установить(ПериодЗаписи);
	Набор.Отбор.Раздел.Установить(Раздел);  
	
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		
		НоваяСтрока	= Набор.Добавить();
		
		НоваяСтрока.Период	= ПериодЗаписи;
		НоваяСтрока.Раздел	= Раздел;
		НоваяСтрока.Номенклатура	= СтрокаДанных.ОбъектАнализа;
		НоваяСтрока.Класс			= СтрокаДанных.ГруппаАнализа;
		НоваяСтрока.КлассПредставление	= СтрокаДанных.Рейтинг1;
		
	КонецЦикла;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти