&НаКлиенте
Процедура КнопкаДиалогаДаНет(Элемент)
    Если Элемент = Элементы.КнопкаДа Тогда
        Результат = Истина;    
    ИначеЕсли Элемент = Элементы.КнопкаНет Тогда
        Результат = Ложь;
    КонецЕсли;    
    
    ЭтаФорма.Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьДетали(Команда)
    УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()
    
    ВидимостьДеталей = НЕ Элементы.ОсновнаяПанель.Видимость;
    
    Элементы.ОсновнаяПанель.Видимость = ВидимостьДеталей;
    
    ШиринаФормы = ?(ВидимостьДеталей, 200, 50);
    МаксВысотаФормы = 40;
    ЧислоСтрокОписания = СтрЧислоСтрок(ОписаниеИзмененийТекст);
    ВысотаФормыСРазвернутымОписанием = ?(СтрЧислоСтрок(ОписаниеИзмененийТекст) > МаксВысотаФормы - 5, МаксВысотаФормы, ЧислоСтрокОписания + 5);
    ВысотаФормы = ?(ВидимостьДеталей, ВысотаФормыСРазвернутымОписанием , 20);
    
    ЭтаФорма.Ширина = ШиринаФормы;
    ЭтаФорма.Высота = ВысотаФормы;
    
    Если ИзмененныеНастройки.Количество() > 0 Тогда
        Элементы.СтраницаВВидеТаблицы.Видимость = Истина;
        Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВВидеТаблицы;
        Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
    Иначе
        Элементы.СтраницаВВидеТаблицы.Видимость = Ложь;
        Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
    КонецЕсли;
    ИменаСинонимы();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДиалогаДа(Команда)
    КнопкаДиалогаДаНет(Элементы.КнопкаДа);
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДиалогаНет(Команда)
    КнопкаДиалогаДаНет(Элементы.КнопкаНет);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "ОписаниеИзмененийТекст");
    
    ИзмененныеНастройкиИзПараметра = Неопределено;
    Если Параметры.Свойство("ИзмененныеНастройки", ИзмененныеНастройкиИзПараметра) И ИзмененныеНастройкиИзПараметра <> Неопределено Тогда
        ИзмененныеНастройки.Загрузить(ИзмененныеНастройкиИзПараметра);
    КонецЕсли;
    
    Если ИзмененныеНастройки.Количество() > 0 Тогда
        Элементы.СтраницаВВидеТаблицы.Видимость = Истина;
        Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВВидеТаблицы;
        Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
    Иначе
        Элементы.СтраницаВВидеТаблицы.Видимость = Ложь;
        Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
    КонецЕсли;
    
    Элементы.ОсновнаяПанель.Видимость = Ложь;
КонецПроцедуры

&НаСервере
Процедура ИменаСинонимы()
    ИменаСинонимы = Не ИменаСинонимы;
    Элементы.ИзмененныеНастройкиИмя.Видимость     = ИменаСинонимы;
    Элементы.ИзмененныеНастройкиСиноним.Видимость = Не ИменаСинонимы;
КонецПроцедуры
&НаКлиенте
Процедура ИменаСинонимыПриИзменении(Элемент)
    ИменаСинонимы();
КонецПроцедуры

