
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ГоловнаяОрганизация = Параметры.ГоловнаяОрганизация;
	Организация 		= Параметры.ГоловнаяОрганизация;
	ФизическоеЛицо      = Параметры.ФизическоеЛицо;
	
	Если Год = 0 Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		|	МАКСИМУМ(ДоходыПредыдущегоМестаРаботы.МесяцНалоговогоПериода) КАК Месяц
		|ИЗ
		|	РегистрСведений.ДоходыПредыдущегоМестаРаботы КАК ДоходыПредыдущегоМестаРаботы
		|ГДЕ
		|	ДоходыПредыдущегоМестаРаботы.ФизическоеЛицо = &ФизическоеЛицо
		|	И ДоходыПредыдущегоМестаРаботы.Организация = &Организация";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Месяц = Null Тогда
				Год = Год(ТекущаяДатаСеанса());
			Иначе
				Год = Год(Выборка.Месяц);
			КонецЕсли;
		Иначе
			Год = Год(ТекущаяДатаСеанса());
		КонецЕсли;
	КонецЕсли;
	
	Если ФизическоеЛицо.Пустая() Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ПрочитатьДанные();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанные()
	
	Доходы.Очистить();
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ДоходыПредыдущегоМестаРаботы.СуммаДохода КАК Доход,
	               |	ДоходыПредыдущегоМестаРаботы.ПримененнаяЛьгота КАК ПримененнаяЛьгота,
	               |	ДоходыПредыдущегоМестаРаботы.ВОСМС КАК ВОСМС,
	               |	ДоходыПредыдущегоМестаРаботы.МесяцНалоговогоПериода КАК Месяц
	               |ИЗ
	               |	РегистрСведений.ДоходыПредыдущегоМестаРаботы КАК ДоходыПредыдущегоМестаРаботы
	               |ГДЕ
	               |	ДоходыПредыдущегоМестаРаботы.ФизическоеЛицо = &ФизическоеЛицо
	               |	И ДоходыПредыдущегоМестаРаботы.Организация = &Организация
	               |	И ГОД(ДоходыПредыдущегоМестаРаботы.МесяцНалоговогоПериода) = &Год";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Год", Год);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для Сч = 1 По 12 Цикл
		СтрокаДоходов       = Доходы.Добавить();
		СтрокаДоходов.Месяц = Дата(Год, Сч, 1);
		Выборка.Сбросить();
		Если Выборка.НайтиСледующий(Новый Структура("Месяц", СтрокаДоходов.Месяц)) Тогда
			СтрокаДоходов.Сумма             = Выборка.Доход;
			СтрокаДоходов.ПримененнаяЛьгота = Выборка.ПримененнаяЛьгота;
			СтрокаДоходов.ВОСМС 			= Выборка.ВОСМС;
		КонецЕсли;
	КонецЦикла;
	
	Если Год >= 2018 Тогда
		Элементы.ДоходыПримененнаяЛьгота.Заголовок = "Примененный вычет";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ДоходСНарастающимИтогом = 0;
	
	НаборЗаписей = РегистрыСведений.ДоходыПредыдущегоМестаРаботы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ФизическоеЛицо.Значение      = ФизическоеЛицо;
	НаборЗаписей.Отбор.ФизическоеЛицо.ВидСравнения  = ВидСравнения.Равно;
	НаборЗаписей.Отбор.ФизическоеЛицо.Использование = Истина;
	НаборЗаписей.Отбор.Организация.Значение      = Организация;
	НаборЗаписей.Отбор.Организация.ВидСравнения  = ВидСравнения.Равно;
	НаборЗаписей.Отбор.Организация.Использование = Истина;
	
	Для Каждого СтрокаДохода Из Доходы Цикл
		
		Если СтрокаДохода.Сумма = 0 И СтрокаДохода.ПримененнаяЛьгота = 0 И СтрокаДохода.ВОСМС = 0 Тогда
			Продолжить;
		КонецЕсли;
		ЗаписьОДоходах  = НаборЗаписей.Добавить();
		ЗаписьОДоходах.ФизическоеЛицо         = ФизическоеЛицо;
		ЗаписьОДоходах.Организация            = Организация;
		ЗаписьОДоходах.МесяцНалоговогоПериода = СтрокаДохода.Месяц;
		ЗаписьОДоходах.СуммаДохода            = СтрокаДохода.Сумма;
		ЗаписьОДоходах.ПримененнаяЛьгота      = СтрокаДохода.ПримененнаяЛьгота;
		ЗаписьОДоходах.ВОСМС      			  = СтрокаДохода.ВОСМС;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	ПрочитатьДанные();
КонецПроцедуры
	
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПрочитатьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьНаСервере();
	Закрыть();
КонецПроцедуры

#КонецОбласти
