&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	// Получаем данные по счет-фактуре
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭКОМ_ЦепочкиДокументовПокупателя.СтатусЮЗД
		|ИЗ
		|	РегистрСведений.ЭКОМ_ЦепочкиДокументовПокупателя КАК ЭКОМ_ЦепочкиДокументовПокупателя
		|ГДЕ
		|	ЭКОМ_ЦепочкиДокументовПокупателя.ЮЗД = &ЮЗД";		
		Запрос.УстановитьПараметр("ЮЗД", Объект.Ссылка);	
		РезультатЗапроса = Запрос.Выполнить();		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			 ВыборкаДетальныеЗаписи.Следующий();
		     ЭтаФорма.СтатусЮЗД = ВыборкаДетальныеЗаписи.СтатусЮЗД;
		КонецЕсли;
	
		РезультатВыполнения = ОбработкаОбъект.ПолучитьДанныеПоЮЗД(Объект.Ссылка);
		ЭтаФорма.ИдентификаторЮЗД = РезультатВыполнения.ИдентификаторЮЗД;
		ЭтаФорма.ПрофильОбмена    = РезультатВыполнения.ПрофильОбмена;
		
	КонецЕсли;
	
	Если Объект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.RECADV_Входящий  Тогда
	     // 1С документ - реализация
		 
		 СвязанныеДокументы = Объект.ДокументыСвязанные.Выгрузить(, "ДокументСвязанный");
		 ДокументыНеЗаполнены = СвязанныеДокументы.Количество() = 0;
		 
		 ТЗ_ДанныеРеализаций = ОбработкаОбъект.ПолучитьДанныеРеализации(Объект.ВидДокумента, СвязанныеДокументы, Объект.ЗаказДата, Объект.ЗаказНомер, Объект.Организация, Объект.Контрагент);
		 Если ДокументыНеЗаполнены = Истина Тогда
			 Для каждого Стр Из СвязанныеДокументы Цикл
				 СтрокаТЧ = Объект.ДокументыСвязанные.Добавить();
				 СтрокаТЧ.ДокументСвязанный = Стр.ДокументСвязанный;
			 КонецЦикла;
		 КонецЕсли;
		 
		 Если ТЗ_ДанныеРеализаций.Количество() > 0 Тогда
			 Для каждого СтрокаТовара Из Объект.ТЧ_Товары Цикл
				 НайденнаяСтрока = ТЗ_ДанныеРеализаций.Найти(СтрокаТовара.Номенклатура, "Номенклатура");
				 Если НЕ НайденнаяСтрока = Неопределено  Тогда
					 СтрокаТовара.НоменклатураИз1С = НайденнаяСтрока.Номенклатура;
					 СтрокаТовара.КоличествоИз1С   = НайденнаяСтрока.Количество;
					 СтрокаТовара.ЦенаИз1С 	       = НайденнаяСтрока.Цена;
				 КонецЕсли;
			 КонецЦикла;		 
		 КонецЕсли;
		 
		 ИмяДокумента = " (РТУ)";
		 Элементы.ТЧ_Товары.ПодчиненныеЭлементы.ТЧ_ТоварыНоменклатураИз1С.Видимость = Истина;
		 Элементы.ТЧ_Товары.ПодчиненныеЭлементы.ТЧ_ТоварыКоличествоИз1С.Видимость = Истина;
		 Элементы.ТЧ_Товары.ПодчиненныеЭлементы.ТЧ_ТоварыЦенаИз1С.Видимость = Истина;
		 
		 Элементы.ТЧ_Товары.ПодчиненныеЭлементы.ТЧ_ТоварыНоменклатураИз1С.Заголовок = "Номенклатура из 1С" + ИмяДокумента;
		 Элементы.ТЧ_Товары.ПодчиненныеЭлементы.ТЧ_ТоварыКоличествоИз1С.Заголовок = "Количество из 1С" + ИмяДокумента;
		 Элементы.ТЧ_Товары.ПодчиненныеЭлементы.ТЧ_ТоварыЦенаИз1С.Заголовок = "Цена из 1С" + ИмяДокумента;
		  
		 Записать();
		 
	КонецЕсли;
	
	СостояниеДокумента = ОбработкаОбъект.СостояниеДокумента(Объект);
	
	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Валюта
	Если ЗначениеЗаполнено(Объект.Валюта) Тогда	
		Элементы.ДекорацияВалюта.Заголовок = СокрЛП(Объект.Валюта);	
	КонецЕсли;
	
	// Товары
	КоличествоТоваров = Объект.ТЧ_Товары.Количество();
	Если КоличествоТоваров > 0 Тогда	
		Элементы.ГруппаТовары.Заголовок = "Товары (" + КоличествоТоваров + ")";	
	КонецЕсли;

	// Документы связанные
	КоличествоДокументов = Объект.ДокументыСвязанные.Количество() + ?(ЗначениеЗаполнено(Объект.Документ1С), 1, 0);
	Если КоличествоДокументов > 0 Тогда	
		Элементы.ГруппаДокументыСвязанные.Заголовок = "Документы связанные (" + КоличествоДокументов + ")";	
	КонецЕсли;

	// Прайс-лист
	КоличествоТоваров = Объект.ПрайсЛист.Количество();
	Если КоличествоТоваров > 0 Тогда	
		Элементы.ГруппаПрайсЛист.Заголовок = "Прайс-лист (" + КоличествоТоваров + ")";	
	КонецЕсли;

    УправлениеВидимостьюПредставлением();  
	ИзмененитьИмяВидимостьКолонокТабличнойЧасти();

	ТипПрайсЛиста = ПолучитьТипПрайсЛиста();	   
	НайденноеЗначение = ТипПрайсЛиста.НайтиПоЗначению(Объект.УточнениеОПоставке);
	Элементы.НадписьТипДействияПрайсЛиста.Заголовок = ПолучитьИмяТипДействияПрайсЛиста(НайденноеЗначение);

КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяТипДействияПрайсЛиста(НайденноеЗначение)
	
	ИмяТипДействияПрайсЛиста = "";
	Если НЕ НайденноеЗначение = Неопределено Тогда
	     ИмяТипДействияПрайсЛиста = СтрЗаменить(НайденноеЗначение.Представление, НайденноеЗначение.Значение, "");
	     ИмяТипДействияПрайсЛиста = СтрЗаменить(ИмяТипДействияПрайсЛиста, "—", "");
	КонецЕсли;
		
	Возврат СокрЛП(ИмяТипДействияПрайсЛиста);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьРасхожение(Команда)
	
	Элементы.ТЧ_Уточнение.Очистить();
	Для Каждого Стр Из Элементы.ТЧ_Товары Цикл
		НовСтр = Элементы.ТЧ_Уточнение.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		НовСтр.ЦенаДо                = Стр.Цена;
		НовСтр.СумБезНДСДо           = Стр.Сумма;
		НовСтр.СтавкаНДСДо           = Стр.СтавкаНДС;
		НовСтр.СтавкаНДСПосле        = Стр.СтавкаНДС;
		НовСтр.СумУчНДСДо            = Стр.Сумма_с_НДС;
		НовСтр.КоличествоФактическое = Стр.КоличествоПоставляемое;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяФайлаОткрытиеНаСервере(Элемент.ТекстРедактирования);
	
КонецПроцедуры

&НаСервере
Процедура ИмяФайлаОткрытиеНаСервере(пИмяКаталога)
	
	Если Не ЗначениеЗаполнено(пИмяКаталога) Тогда
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(пИмяКаталога);
	Если Не Файл.Существует() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Файл.ЭтоКаталог() Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьПриложение(пИмяКаталога);
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_УточнениеКоличествоФактическоеПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТЧ_Уточнение.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЦенаПосле) Тогда
	        СтрокаТабличнойЧасти.ЦенаПосле = СтрокаТабличнойЧасти.ЦенаДо;	
	КонецЕсли;
	РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти);   
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуТабЧасти(СтрТабЧасти)
	СтрТабЧасти.СумБезНДСПосле = СтрТабЧасти.ЦенаПосле * СтрТабЧасти.КоличествоФактическое;
	СуммаНДС = СтрТабЧасти.СтавкаНДСПосле * СтрТабЧасти.СумБезНДСПосле / 100;
	СтрТабЧасти.СумУчНДСПосле  = СуммаНДС + СтрТабЧасти.СумБезНДСПосле;
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_УточнениеЦенаПослеПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТЧ_Уточнение.ТекущиеДанные;
    РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти); 
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_УточнениеСтавкаНДСПослеПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТЧ_Уточнение.ТекущиеДанные;
    РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти); 
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_УточнениеСумБезНДСПослеПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТЧ_Уточнение.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЦенаПосле = Элемент.Значение / СтрокаТабличнойЧасти.КоличествоФактическое;
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_УточнениеСумУчНДСПослеПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТЧ_Уточнение.ТекущиеДанные;
	СуммаНДС = СтрокаТабличнойЧасти.СтавкаНДСПосле * СтрокаТабличнойЧасти.СумУчНДСПосле / (100 + СтрокаТабличнойЧасти.СтавкаНДСПосле);
    СтрокаТабличнойЧасти.СумБезНДСПосле = СтрокаТабличнойЧасти.СумУчНДСПосле - СуммаНДС;	
	СтрокаТабличнойЧасти.ЦенаПосле = СтрокаТабличнойЧасти.СумБезНДСПосле / СтрокаТабличнойЧасти.КоличествоФактическое;
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюПредставлением()
	
	Если ЗначениеЗаполнено(Объект.ТекстОшибки) Тогда
	     Элементы.ТекстОшибки.Видимость = Истина;
	Иначе	
	     Элементы.ТекстОшибки.Видимость = Ложь;
	КонецЕсли;

	ПредпросмотрДокумента = Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.Найти("ГруппаПредпросмотрДокументаCONDRA");			
	Если НЕ ПредпросмотрДокумента = Неопределено Тогда
		Если ЗначениеЗаполнено(ЭтаФорма.ИдентификаторЮЗД) Тогда
			ПредпросмотрДокумента.Видимость = Истина;
		Иначе	 
			ПредпросмотрДокумента.Видимость = Ложь;		
		КонецЕсли;		
	КонецЕсли;

	// По умолчанию
	Элементы.ГруппаМаркировка.Видимость = Ложь;
	Элементы.ГруппаУточнение.Видимость = Ложь;
	Элементы.ПричинаОтказа.Видимость = Ложь;
	Элементы.ТЧ_Товары.ПодчиненныеЭлементы.ТЧ_ТоварыПричинаОтказаТЧ.Видимость = Ложь;
	Элементы.ФормаСформироватьОтвет.Видимость = Ложь;
	Элементы.ФормаОтправить.Видимость = Ложь;
	Элементы.ФормаОтклонить.Видимость = Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.ORDER_Входящий");
	Элементы.ГруппаПрайсЛист.Видимость = Ложь;
	//Docrobot 1.21.0 MOD-1648
	Элементы.ГруппаТоварыОбратныйЗаказ.Видимость = Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.RETORD_Исходящий");
	
	Если ЗначениеЗаполнено(Объект.СобытиеПоДокументу) Тогда
		Элементы.СобытиеПоДокументу.Видимость = Истина;
	Иначе	
		Элементы.СобытиеПоДокументу.Видимость = Ложь;
	КонецЕсли;

	// Отображение шапки
	Элементы.ГруппаНеструктурированныйДокумент.Видимость = Ложь;
	Элементы.ГруппаПрайсЛистШапка.Видимость = Ложь;
	Элементы.ГруппаЭДО.Видимость = Ложь;
	Если Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.CONDRA_Входящий") Тогда
		Элементы.ГруппаНеструктурированныйДокумент.Видимость = Истина;
		ГруппаДокументыСвязанные = Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.Найти("ГруппаДокументыСвязанные");
		Если НЕ ГруппаДокументыСвязанные = Неопределено Тогда
			ГруппаДокументыСвязанные.Видимость = Ложь;
		КонецЕсли;
		
		Группа2 = Элементы.Найти("Группа2");
		Если НЕ Группа2 = Неопределено Тогда
			Группа2.Видимость = Ложь;
		КонецЕсли;
		
		Группа3 = Элементы.Найти("Группа3");
		Если НЕ Группа3 = Неопределено Тогда
			Группа3.Видимость = Истина;
		КонецЕсли;
		
		Если НЕ ПредпросмотрДокумента = Неопределено Тогда
			
			ПредпросмотрДокумента.Заголовок = "Предпросмотр документа CONDRA";
			ГруппаПолеHTML = ПредпросмотрДокумента.ПодчиненныеЭлементы.ГруппаПолеHTML;
			ГруппаПолеHTML.Видимость = Ложь;
			
			ТипЗаголовок = "";
			Если Объект.Тип = "1" Тогда
				ТипЗаголовок = "1 - оригинал";
			ИначеЕсли Объект.Тип = "2" Тогда
				ТипЗаголовок = "2 - принятие";
			ИначеЕсли Объект.Тип = "3" Тогда
				ТипЗаголовок = "3 - отклонение";
			ИначеЕсли Объект.Тип = "4" Тогда
				ТипЗаголовок = "4 - отзыв";
			КонецЕсли;
			
			Элементы.НадписьТипCONDRA.Заголовок 	= Элементы.НадписьТипCONDRA.Заголовок + " " + ТипЗаголовок;
			
			Элементы.НадписьТипCONDRA.Видимость = Истина;
			Элементы.ТочкаДоставки.Видимость 	= Ложь;
			Элементы.INVOICEPARTNER.Видимость = Ложь;
			Элементы.ГруппаТовары.Видимость 	= Ложь;
			
			// Заказ
			Элементы.ДекорацияЗаказ.Видимость = Ложь;
			Элементы.ЗаказНомер.Видимость 	  = Ложь;
			Элементы.ЗаказДата.Видимость 	  = Ложь;
				
			Элементы.ГруппаПравоCONDRA.Видимость 	= Истина;
			
			Элементы.Согласовано.Видимость         = Истина;
			Элементы.ОтветственныйCondra.Видимость = Истина;
			
			Если ЗначениеЗаполнено(Объект.ОтветственныйCondra) Тогда
				ДоступностьСогласовано = Ложь;
				ДоступностьСогласовано = ПроверитьНаДоступностьСогласовано();	
				Если ДоступностьСогласовано Тогда
					Элементы.Согласовано.Доступность = Истина;
				Иначе
					Элементы.Согласовано.Доступность = Ложь;
				КонецЕсли;
			КонецЕсли;
				
		КонецЕсли;
		
	ИначеЕсли Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.PRICAT_Входящий") 
		ИЛИ Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.PRICAT_Исходящий") Тогда		
		Элементы.ГруппаПрайсЛистШапка.Видимость = Истина;
		Элементы.ГруппаПрайсЛист.Видимость = Истина;
		Элементы.ГруппаТовары.Видимость = Ложь;
		Элементы.ГруппаИтогоРасчеты.Видимость = Ложь;
		
		Элементы.ДекорацияНомерФайла.Заголовок = "Прайс-лист №";
		Элементы.ДекорацияНомерНакладной.Заголовок = "Файл №";
		
	Иначе
		Элементы.ГруппаЭДО.Видимость = Истина;
		
		Элементы.ГруппаСчетФактура.Видимость = Ложь;
		Элементы.СЧФДата.Видимость = Ложь;
		
		Элементы.ГруппаИсправления.Видимость = Ложь;
		Элементы.ДатаИсправления.Видимость = Ложь;
		Элементы.СтатусЮЗД.Видимость = Ложь;
			
	КонецЕсли;
	Элементы.ГруппаСтраницыШапка.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;

	// Видимость по видам документов
	// Счет-фактура
	Если Найти(СокрЛП(Объект.ВидДокумента), "ON_") > 0 Тогда		
		Элементы.ГруппаСчетФактура.Видимость = Истина;
		Элементы.СЧФДата.Видимость = Истина;
		Элементы.СтатусЮЗД.Видимость = Истина;
		
	КонецЕсли; 

	// Исправление
	Если Найти(СокрЛП(Объект.ВидДокумента), "Испр") > 0 Тогда		
		Элементы.ГруппаИсправления.Видимость = Истина;
		Элементы.ДатаИсправления.Видимость = Истина;
		
	КонецЕсли; 
		
	// Корректировка
	Если Найти(СокрЛП(Объект.ВидДокумента), "ON_KORSCHFDOPPR") > 0 
		ИЛИ Найти(СокрЛП(Объект.ВидДокумента), "ON_NKORSCHFDOPPR") > 0 Тогда	
		Элементы.ГруппаУточнение.Видимость = Истина;

	КонецЕсли;
	
	// Маркировка
	Если Найти(СокрЛП(Объект.ВидДокумента), "ON_KORSCHFDOPPR") > 0 
		ИЛИ Найти(СокрЛП(Объект.ВидДокумента), "MARK") > 0 Тогда	
		Элементы.ГруппаМаркировка.Видимость = Истина;

	КонецЕсли;

	Если Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.ORDER_Входящий") Тогда
		Элементы.ПричинаОтказа.Видимость = Истина;
		Элементы.ТЧ_Товары.ПодчиненныеЭлементы.ТЧ_ТоварыПричинаОтказаТЧ.Видимость = Истина;
		Элементы.АктуальныйДокумент.Видимость = Истина;
		
	ИначеЕсли Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.PRICAT_Входящий") Тогда	
		//Docrobot 1.20.0 MOD-1574
		Если Объект.УточнениеОПоставке = "9" или Объект.УточнениеОПоставке = "13" Тогда
			Элементы.ФормаСформироватьОтвет.Видимость = Истина;
		КонецЕсли;
		Элементы.ПрайсЛистПринятьВсе.Видимость = Ложь;
		Элементы.ПрайсЛистОтклонитьВсе.Видимость = Ложь;
		//Docrobot 1.20.0 MOD-1576
		Элементы.УточнениеОПоставкеПрайсЛист.Доступность = Ложь;
		
	ИначеЕсли Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.PRICAT_Исходящий") Тогда	
		Элементы.ФормаОтправить.Видимость = Истина;	
		Элементы.ПрайсЛистПринятьВсе.Видимость = Истина;
		Элементы.ПрайсЛистОтклонитьВсе.Видимость = Истина;

	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ДокументыСвязанныеПриИзменении(Элемент)
    УправлениеВидимостьюПредставлением();
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
    УправлениеВидимостьюПредставлением();
	ИзмененитьИмяВидимостьКолонокТабличнойЧасти();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ТоварыПричинаОтказаТЧНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	СписокПричинОтказаТЧ = Новый СписокЗначений;	
	СписокПричинОтказаТЧ.Добавить("", "");
	
	ФорматУПД = "";
	СведенияОКонтрагенте = ЭКОМ_GLN_Прочитать(Объект.Контрагент);
    Если СведенияОКонтрагенте.СведенияЕсть = Истина Тогда
		 ФорматУПД = СведенияОКонтрагенте.Контрагент_ФорматЭСФ; 
	КонецЕсли;
	
	Если ФорматУПД = "УПД Х5" Тогда
		
		// Справочники X5
		СписокПричинОтказаТЧ.Добавить("FC1S", "FC1S - Нет на остатках у поставщика");
		СписокПричинОтказаТЧ.Добавить("W13" , "W13 - Блокированная позиция у поставщика");
		СписокПричинОтказаТЧ.Добавить("ZA7B", "ZA7B - Отклонения по квантам при заказе (Короб, Шт)");
		СписокПричинОтказаТЧ.Добавить("MD1B", "MD1B - Товар с некорректным штрихкодом в заказе");
		СписокПричинОтказаТЧ.Добавить("BS6S", "BS6S - Расхождение в цене между заказом и действующими условиями");
		СписокПричинОтказаТЧ.Добавить("FC2B", "FC2B - Превышение согласованной потребности (промо)");
		СписокПричинОтказаТЧ.Добавить("L15S", "L15S - Нет транспорта у поставщика");
		СписокПричинОтказаТЧ.Добавить("MD9S", "MD9S - ЕГАИС");
		
	ИначеЕсли ФорматУПД = "УПД Тандер" Тогда
		
		// Тандер
		СписокПричинОтказаТЧ.Добавить("S1" , "S1 - Высокая волатильность заказов");
		СписокПричинОтказаТЧ.Добавить("S2" , "S2 - Дефицит сырья");
		СписокПричинОтказаТЧ.Добавить("S3" , "S3 - Задержка пополнения стока");
		СписокПричинОтказаТЧ.Добавить("S4" , "S4 - Заказ с некорректной ценой");
		СписокПричинОтказаТЧ.Добавить("S5" , "S5 - Корректировка заказа по запросу Тандер");
		СписокПричинОтказаТЧ.Добавить("S6" , "S6 - Не согласованы цены");
		СписокПричинОтказаТЧ.Добавить("S7" , "S7 - Не учтен согласованный график заказов");
		СписокПричинОтказаТЧ.Добавить("S8" , "S8 - Несогласованный ассортимент");
		СписокПричинОтказаТЧ.Добавить("S9" , "S9 - Нехватка мощностей");
		СписокПричинОтказаТЧ.Добавить("S10", "S10 - ОСГ менее согласованного по договору");
		СписокПричинОтказаТЧ.Добавить("S11", "S11 - Отгрузка кратно вложению в короб");
		СписокПричинОтказаТЧ.Добавить("S12", "S12 - Отклонение от согласованной мин.партии");
		СписокПричинОтказаТЧ.Добавить("S13", "S13 - Отсутствие сетевого ШК (табачная продукция)");
		СписокПричинОтказаТЧ.Добавить("S14", "S14 - Отсутствие товара на складе производителя (табачная продукция)");
		СписокПричинОтказаТЧ.Добавить("S15", "S15 - Отсутствие упаковки");
		СписокПричинОтказаТЧ.Добавить("S16", "S16 - Перевыборка акционных объемов");
		СписокПричинОтказаТЧ.Добавить("S17", "S17 - Перевыборка контракта (сезонный ассортимент, табачная продукция)");
		СписокПричинОтказаТЧ.Добавить("S18", "S18 - Переименование поставщика");
		СписокПричинОтказаТЧ.Добавить("S19", "S19 - Превышение макс. веса заказа");
		СписокПричинОтказаТЧ.Добавить("S20", "S20 - Проблемы с финансированием КА");
		СписокПричинОтказаТЧ.Добавить("S21", "S21 - Продукция снята с производства");
		СписокПричинОтказаТЧ.Добавить("S22", "S22 - Расхождения по весовому товару");
		СписокПричинОтказаТЧ.Добавить("S23", "S23 - Технический сбой в системе КА");
		СписокПричинОтказаТЧ.Добавить("S24", "S24 - Технологический сбой на производстве");
		СписокПричинОтказаТЧ.Добавить("S25", "S25 - Форс-мажор (стихийное бедствие, обстоятельства непреодолимой силы)");
		
	КонецЕсли;
	
	НайденноеЗначение = СписокПричинОтказаТЧ.НайтиПоЗначению(Элемент.Родитель.ТекущиеДанные.ПричинаОтказаТЧ);
	Если НайденноеЗначение = Неопределено Тогда
	     НачальноеЗначение = 0;
	Иначе
		 НачальноеЗначение = СписокПричинОтказаТЧ.Индекс(НайденноеЗначение);
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Элемент", Элемент);
	ПараметрыОповещения.Вставить("ДанныеВыбора", ДанныеВыбора);

    ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьПослеВыбора", ЭтаФорма, ПараметрыОповещения);
	ПоказатьВыборИзСписка(ОписаниеОповещения, СписокПричинОтказаТЧ, Элемент, НачальноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаОтказаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокПричинОтказаШапка = Новый СписокЗначений;
	СписокПричинОтказаШапка.Добавить("", "");
	
	ФорматУПД = "";
	СведенияОКонтрагенте = ЭКОМ_GLN_Прочитать(Объект.Контрагент);
    Если СведенияОКонтрагенте.СведенияЕсть = Истина Тогда
		 ФорматУПД = СведенияОКонтрагенте.Контрагент_ФорматЭСФ; 
	КонецЕсли;
	
	Если ФорматУПД = "УПД Х5" Тогда
		
		//Справочники X5
		СписокПричинОтказаШапка.Добавить("MD4S", "MD4S - Нет действующего договора");
		СписокПричинОтказаШапка.Добавить("MD5S", "MD5S - Нет данных по заводу клиента. Техническая ошибка.");
		СписокПричинОтказаШапка.Добавить("MD6S", "MD6S - Техническая проблема (заказ не был передан по EDI)");
		СписокПричинОтказаШапка.Добавить("MD7S", "MD7S - Технические проблемы у Поставщика с учетной системой");
		СписокПричинОтказаШапка.Добавить("BS4S", "BS4S - Отмена по решению бизнеса поставщика");
		СписокПричинОтказаШапка.Добавить("BS1B", "BS1B - Не пройден кредитный контроль/превышен лимит поступлений");
		СписокПричинОтказаШапка.Добавить("ZA4B", "ZA4B - Задвоенный заказ - созданный заказ аналогичный предыдущему");
		СписокПричинОтказаШапка.Добавить("ZA2B", "ZA2B - Позднее размещение заказа");
		СписокПричинОтказаШапка.Добавить("ZA3B", "ZA3B - Несоблюдение графика заказов");
		СписокПричинОтказаШапка.Добавить("L15S", "L15S - Нет транспорта у поставщика");
		СписокПричинОтказаШапка.Добавить("FC1S", "FC1S - Нет на остатках у поставщика");
		СписокПричинОтказаШапка.Добавить("BS6S", "BS6S - Расхождение в цене между заказом и действующими условиями");
		СписокПричинОтказаШапка.Добавить("FC2B", "FC2B - Превышение согласованной потребности (промо)");
		
	ИначеЕсли ФорматУПД = "УПД Тандер" Тогда
		
		// Тандер
		СписокПричинОтказаШапка.Добавить("S1" , "S1 - Высокая волатильность заказов");
		СписокПричинОтказаШапка.Добавить("S2" , "S2 - Дефицит сырья");
		СписокПричинОтказаШапка.Добавить("S3" , "S3 - Задержка пополнения стока");
		СписокПричинОтказаШапка.Добавить("S4" , "S4 - Заказ с некорректной ценой");
		СписокПричинОтказаШапка.Добавить("S5" , "S5 - Корректировка заказа по запросу Тандер");
		СписокПричинОтказаШапка.Добавить("S6" , "S6 - Не согласованы цены");
		СписокПричинОтказаШапка.Добавить("S7" , "S7 - Не учтен согласованный график заказов");
		СписокПричинОтказаШапка.Добавить("S8" , "S8 - Несогласованный ассортимент");
		СписокПричинОтказаШапка.Добавить("S9" , "S9 - Нехватка мощностей");
		СписокПричинОтказаШапка.Добавить("S10", "S10 - ОСГ менее согласованного по договору");
		СписокПричинОтказаШапка.Добавить("S11", "S11 - Отгрузка кратно вложению в короб");
		СписокПричинОтказаШапка.Добавить("S12", "S12 - Отклонение от согласованной мин.партии");
		СписокПричинОтказаШапка.Добавить("S13", "S13 - Отсутствие сетевого ШК (табачная продукция)");
		СписокПричинОтказаШапка.Добавить("S14", "S14 - Отсутствие товара на складе производителя (табачная продукция)");
		СписокПричинОтказаШапка.Добавить("S15", "S15 - Отсутствие упаковки");
		СписокПричинОтказаШапка.Добавить("S16", "S16 - Перевыборка акционных объемов");
		СписокПричинОтказаШапка.Добавить("S17", "S17 - Перевыборка контракта (сезонный ассортимент, табачная продукция)");
		СписокПричинОтказаШапка.Добавить("S18", "S18 - Переименование поставщика");
		СписокПричинОтказаШапка.Добавить("S19", "S19 - Превышение макс. веса заказа");
		СписокПричинОтказаШапка.Добавить("S20", "S20 - Проблемы с финансированием КА");
		СписокПричинОтказаШапка.Добавить("S21", "S21 - Продукция снята с производства");
		СписокПричинОтказаШапка.Добавить("S22", "S22 - Расхождения по весовому товару");
		СписокПричинОтказаШапка.Добавить("S23", "S23 - Технический сбой в системе КА");
		СписокПричинОтказаШапка.Добавить("S24", "S24 - Технологический сбой на производстве");
		СписокПричинОтказаШапка.Добавить("S25", "S25 - Форс-мажор (стихийное бедствие, обстоятельства непреодолимой силы)");
	КонецЕсли;

	НайденноеЗначение = СписокПричинОтказаШапка.НайтиПоЗначению(Объект.ПричинаОтказа);
	Если НайденноеЗначение = Неопределено Тогда
	     НачальноеЗначение = 0;
	Иначе
		 НачальноеЗначение = СписокПричинОтказаШапка.Индекс(НайденноеЗначение);
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Элемент"     , Элемент);
	ПараметрыОповещения.Вставить("ДанныеВыбора", ДанныеВыбора);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьПослеВыбора", ЭтаФорма, ПараметрыОповещения);
	ПоказатьВыборИзСписка(ОписаниеОповещения, СписокПричинОтказаШапка, Элемент, НачальноеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбора(ВыбранныйЭлемент, ПараметрыОповещения) Экспорт 
	
	Элемент = ПараметрыОповещения.Элемент;
	
	Если НЕ ВыбранныйЭлемент = Неопределено Тогда
		
		Если Элемент.Имя = "ТЧ_ТоварыПричинаОтказаТЧ" Тогда			
			ЭтаФорма.Элементы.ТЧ_Товары.ТекущиеДанные.ПричинаОтказаТЧ = ВыбранныйЭлемент.Значение;
			 
		ИначеЕсли Элемент.Имя = "ПричинаОтказа" Тогда			
			Объект.ПричинаОтказа = ВыбранныйЭлемент.Значение;
			
		ИначеЕсли Элемент.Имя = "ПрайсЛистТребуемоеДействие" Тогда			
			ЭтаФорма.Элементы.ПрайсЛист.ТекущиеДанные.ТребуемоеДействие = ВыбранныйЭлемент.Значение;

		ИначеЕсли Элемент.Имя = "УточнениеОПоставкеПрайсЛист" Тогда			
			Объект.УточнениеОПоставке = ВыбранныйЭлемент.Значение;
            Элементы.НадписьТипДействияПрайсЛиста.Заголовок = ПолучитьИмяТипДействияПрайсЛиста(ВыбранныйЭлемент);;
			
		КонецЕсли;
           
	КонецЕсли;
	
КонецПроцедуры
 
&НаСервере
Функция ЭКОМ_GLN_Прочитать(п_Объект) Экспорт 
	Структура = Новый Структура;
	МенеджерЗаписи        = РегистрыСведений.ЭКОМ_GLN.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = п_Объект;
	МенеджерЗаписи.Прочитать();

	Если МенеджерЗаписи.Выбран() Тогда	
		Структура.Вставить("СведенияЕсть", Истина);
		Для каждого Данные Из Метаданные.РегистрыСведений.ЭКОМ_GLN.Ресурсы  Цикл
			        Структура.Вставить(Данные.Имя, МенеджерЗаписи[Данные.Имя]);		
		КонецЦикла;
		Структура.Вставить("Комментарий"                 , МенеджерЗаписи.Комментарий);		
	Иначе
		Структура.Вставить("СведенияЕсть"                , Ложь);
	КонецЕсли;
		
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Процедура ОтчетПоМаркировке(Команда)
	
    Результат = ОтчетПоМаркировкеНаСервере();

	Результат.ОтображатьЗаголовки = Ложь;
	Результат.ОтображатьСетку = Ложь;
	Результат.Показать();

КонецПроцедуры

&НаСервере
Функция ОтчетПоМаркировкеНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");

	//Получаем схему из макета
	СхемаКомпоновкиДанных = ОбработкаОбъект.ПолучитьМакет("ОтчетПоМаркировке");
	
	//создадим компоновщик настроек и загрузим настройки по умолчанию, вместо настроек по умолчанию можно использовать восстановленные настройки
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Настройки = КомпоновщикНастроек.Настройки;
	
	//установка параметров отчета, без КомпоновщикНастроекКомпоновкиДанных делать это гораздо сложнее
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок"  , "Отчет по маркировке");
	
	//Помещаем в переменную данные о расшифровке данных - здесь ненужный пункт, но пусть будет.
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	//Очищаем поле табличного документа
	Результат = Новый ТабличныйДокумент();
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура КомандаОткрытьКаталогCONDRA(Команда)
	
    Файл = Новый Файл(Объект.ИмяФайла);
	
	Если Файл.Существует() И Файл.ЭтоФайл() Тогда
		ЗапуститьПриложение("C:\Windows\explorer.exe /select, " + Файл.ПолноеИмя);
	Иначе
		Элементы.КомандаОткрытьКаталогCONDRA.Доступность = Ложь;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Файл не найден";
		Сообщение.Поле = "Объект.ИмяФайла";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмененитьИмяВидимостьКолонокТабличнойЧасти()
	
	Элементы.ТЧ_ТоварыКоличествоПринятое.Видимость = Истина;
	
	// Видимость колонок при маркировке
	Если Элементы.ГруппаМаркировка.Видимость = Истина Тогда
		Если Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.ON_KORSCHFDOPPR_01") 
			ИЛИ Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.ON_KORSCHFDOPPR_01_Испр")
			ИЛИ Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPRMARK_01") 
			ИЛИ Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPRMARK_01_Испр") Тогда   
			Элементы.ТЧ_Маркировка.ПодчиненныеЭлементы.ТЧ_МаркировкаГруппаКИН.ПодчиненныеЭлементы.ТЧ_МаркировкаНомУпак_До.Видимость         = Истина;
			Элементы.ТЧ_Маркировка.ПодчиненныеЭлементы.ТЧ_МаркировкаГруппаКИЗ.ПодчиненныеЭлементы.ТЧ_МаркировкаКИЗ_До.Видимость             = Истина;
			Элементы.ТЧ_Маркировка.ПодчиненныеЭлементы.ТЧ_МаркировкаГруппаКИТУ.ПодчиненныеЭлементы.ТЧ_МаркировкаИдентТрансУпак_До.Видимость = Истина;		
		Иначе
			Элементы.ТЧ_Маркировка.ПодчиненныеЭлементы.ТЧ_МаркировкаГруппаКИН.ПодчиненныеЭлементы.ТЧ_МаркировкаНомУпак_До.Видимость         = Ложь;
			Элементы.ТЧ_Маркировка.ПодчиненныеЭлементы.ТЧ_МаркировкаГруппаКИЗ.ПодчиненныеЭлементы.ТЧ_МаркировкаКИЗ_До.Видимость             = Ложь;
			Элементы.ТЧ_Маркировка.ПодчиненныеЭлементы.ТЧ_МаркировкаГруппаКИТУ.ПодчиненныеЭлементы.ТЧ_МаркировкаИдентТрансУпак_До.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	 
	Если Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.ORDER_Входящий") Тогда
		Элементы.ТЧ_ТоварыКоличествоЗаказанное.Заголовок   = "Заказанное"; // Количество заказанное покупателем 
		Элементы.ТЧ_ТоварыКоличествоПринятое.Видимость     = Ложь;
		Элементы.ТЧ_ТоварыКоличествоПоставляемое.Заголовок = "К отгрузке"; // Указываем количество для отгрузки покупателю		 
		
	ИначеЕсли Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.ORDRSP_Входящий") Тогда
		Элементы.ТЧ_ТоварыКоличествоЗаказанное.Заголовок   = "Заказанное";     // Количество заказанное ORDEREDQUANTITY  
		Элементы.ТЧ_ТоварыКоличествоПринятое.Видимость     = Ложь;           
		Элементы.ТЧ_ТоварыКоличествоПоставляемое.Заголовок = "Подтвержденное"; // Подтверженное количество поставщиком ACCEPTEDQUANTITY		
		
	ИначеЕсли Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.DESADV_Входящий") Тогда
		Элементы.ТЧ_ТоварыКоличествоЗаказанное.Заголовок   = "Заказанное";     // Количество заказанное ORDEREDQUANTITY  
		Элементы.ТЧ_ТоварыКоличествоПринятое.Видимость     = Ложь;          
		Элементы.ТЧ_ТоварыКоличествоПоставляемое.Заголовок = "Поставляемое"; // Поставляемое количество поставщиком DELIVEREDQUANTITY		
		
	ИначеЕсли Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.RECADV_Входящий") Тогда
		Элементы.ТЧ_ТоварыКоличествоЗаказанное.Заголовок = "Заказанное";     // Количество заказанное покупателем ORDEREDQUANTITY  
		Элементы.ТЧ_ТоварыКоличествоПринятое.Заголовок = "Принятое";         // Количество принятое покупателем ACCEPTEDQUANTITY
		Элементы.ТЧ_ТоварыКоличествоПоставляемое.Заголовок = "Поставляемое"; // Поставляемое количество поставщиком DELIVEREDQUANTITY	
		
	ИначеЕсли Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.RETORD_Исходящий") Тогда
		Элементы.ГруппаЭДО.Видимость = Ложь;
		Элементы.ГруппаТовары.Видимость = Ложь;
		Элементы.ГруппаДополнительно.Видимость = Ложь;
		Элементы.ГруппаДокументыСвязанные.Видимость = Ложь;
		
	Иначе	
		Элементы.ТЧ_ТоварыКоличествоЗаказанное.Заголовок = "Заказанное";
		Элементы.ТЧ_ТоварыКоличествоПринятое.Заголовок = "Принятое";          
		Элементы.ТЧ_ТоварыКоличествоПоставляемое.Заголовок = "Поставляемое"; 	
		
	КонецЕсли;
	
КонецПроцедуры

// Функция получает MIME тип по расширению файла
//
// Параметры:
//  Файл  - Файл - файл, для которого нужно получить MIME тип
//
// Возвращаемое значение:
//   Строка   - тип данных для переданного файла
//
&НаКлиенте
Функция РасширениеВ_MIME_Тип(Файл)

	ТипФайла = СтрЗаменить(Файл.Расширение, ".", "");
	ТипФайла = НРег(ТипФайла);
	ТипДанных = "";	
	
	ТипыMIME = Новый Структура;
	ТипыMIME.Вставить("aac", 	"audio/aac");
	ТипыMIME.Вставить("abw", 	"application/x-abiword");
	ТипыMIME.Вставить("arc", 	"application/x-freearc");
	ТипыMIME.Вставить("avi", 	"video/x-msvideo");
	ТипыMIME.Вставить("azw", 	"application/vnd.amazon.ebook");
	ТипыMIME.Вставить("bin", 	"application/octet-stream");
	ТипыMIME.Вставить("bmp", 	"image/bmp");
	ТипыMIME.Вставить("bz", 	"application/x-bzip");
	ТипыMIME.Вставить("bz2", 	"application/x-bzip2");
	ТипыMIME.Вставить("csh", 	"application/x-csh");
	ТипыMIME.Вставить("css", 	"text/css");
	ТипыMIME.Вставить("csv", 	"text/csv");
	ТипыMIME.Вставить("doc", 	"application/msword");
	ТипыMIME.Вставить("docx", 	"application/vnd.openxmlformats-officedocument.wordprocessingml.document");
	ТипыMIME.Вставить("eot", 	"application/vnd.ms-fontobject");
	ТипыMIME.Вставить("epub", 	"application/epub+zip");
	ТипыMIME.Вставить("gz", 	"application/gzip");
	ТипыMIME.Вставить("gif", 	"image/gif");
	ТипыMIME.Вставить("htm", 	"text/html");
	ТипыMIME.Вставить("html", 	"text/html");
	ТипыMIME.Вставить("ico", 	"image/vnd.microsoft.icon");
	ТипыMIME.Вставить("ics", 	"text/calendar");
	ТипыMIME.Вставить("jar", 	"application/java-archive");
	ТипыMIME.Вставить("jpeg", 	"image/jpeg");
	ТипыMIME.Вставить("jpg", 	"image/jpeg");
	ТипыMIME.Вставить("js", 	"text/javascript");
	ТипыMIME.Вставить("json", 	"application/json");
	ТипыMIME.Вставить("jsonld", "application/ld+json");
	ТипыMIME.Вставить("mid", 	"audio/midi audio/x-midi");
	ТипыMIME.Вставить("midi", 	"audio/midi audio/x-midi");
	ТипыMIME.Вставить("mjs", 	"text/javascript");
	ТипыMIME.Вставить("mp3", 	"audio/mpeg");
	ТипыMIME.Вставить("mpeg", 	"video/mpeg");
	ТипыMIME.Вставить("mpkg", 	"application/vnd.apple.installer+xml");
	ТипыMIME.Вставить("odp", 	"application/vnd.oasis.opendocument.presentation");
	ТипыMIME.Вставить("ods", 	"application/vnd.oasis.opendocument.spreadsheet");
	ТипыMIME.Вставить("odt", 	"application/vnd.oasis.opendocument.text");
	ТипыMIME.Вставить("oga", 	"audio/ogg");
	ТипыMIME.Вставить("ogv", 	"video/ogg");
	ТипыMIME.Вставить("ogx", 	"application/ogg");
	ТипыMIME.Вставить("opus", 	"audio/opus");
	ТипыMIME.Вставить("otf", 	"font/otf");
	ТипыMIME.Вставить("png", 	"image/png");
	ТипыMIME.Вставить("pdf", 	"application/pdf");
	ТипыMIME.Вставить("php", 	"application/php");
	ТипыMIME.Вставить("ppt", 	"application/vnd.ms-powerpoint");
	ТипыMIME.Вставить("pptx", 	"application/vnd.openxmlformats-officedocument.presentationml.presentation");
	ТипыMIME.Вставить("rar", 	"application/vnd.rar");
	ТипыMIME.Вставить("rtf", 	"application/rtf");
	ТипыMIME.Вставить("sh", 	"application/x-sh");
	ТипыMIME.Вставить("svg", 	"image/svg+xml");
	ТипыMIME.Вставить("swf", 	"application/x-shockwave-flash");
	ТипыMIME.Вставить("tar", 	"application/x-tar");
	ТипыMIME.Вставить("tif", 	"image/tiff");
	ТипыMIME.Вставить("tiff", 	"image/tiff");
	ТипыMIME.Вставить("ts", 	"video/mp2t");
	ТипыMIME.Вставить("ttf", 	"font/ttf");
	ТипыMIME.Вставить("txt", 	"text/plain");
	ТипыMIME.Вставить("vsd", 	"application/vnd.visio");
	ТипыMIME.Вставить("wav", 	"audio/wav");
	ТипыMIME.Вставить("weba", 	"audio/webm");
	ТипыMIME.Вставить("webm", 	"video/webm");
	ТипыMIME.Вставить("webp", 	"image/webp");
	ТипыMIME.Вставить("woff", 	"font/woff");
	ТипыMIME.Вставить("woff2", 	"font/woff2");
	ТипыMIME.Вставить("xhtml", 	"application/xhtml+xml");
	ТипыMIME.Вставить("xls", 	"application/vnd.ms-excel");
	ТипыMIME.Вставить("xlsx", 	"application/vnd.openxmlformats-officedocument.spreadsheetml.sheet");
	ТипыMIME.Вставить("xml", 	"application/xml if not readable from casual users (RFC 3023, section 3)");
	ТипыMIME.Вставить("xul", 	"application/vnd.mozilla.xul+xml");
	ТипыMIME.Вставить("zip", 	"application/zip");

	ТипыMIME.Свойство(ТипФайла, ТипДанных);
	
	Возврат ТипДанных;
	
КонецФункции // РасширениеВ_MIME_Тип()

&НаКлиенте
Процедура ПоказатьПечатнуюФормуЮЗД(Команда)
	
	ОбновитьПечатнуюФормуЮЗД();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПечатнуюФормуЮЗД()
	
	МассивЛогаСобытий = Новый Массив;
	
	ПоказатьИндикаторНТМL("");
	
	ТекстОшибкиПриПолученииЮЗД = "";	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.КаталогКартинкиЮЗД) Тогда
		РезультатВыполнения = КонвертацияPDF_в_JPGНаСервере(МассивЛогаСобытий);
		ТекстОшибкиПриПолученииЮЗД = РезультатВыполнения.ТекстОшибки;
		ЭтаФорма.КаталогКартинкиЮЗД  = РезультатВыполнения.КаталогКартинкиЮЗД;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибкиПриПолученииЮЗД) Тогда
		ПоказатьИндикаторНТМL(ТекстОшибкиПриПолученииЮЗД);
	КонецЕсли;
	
	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий);
		Сообщение.Сообщить();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОтобразитьЮЗД", 3);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьЮЗД()
	
	ТекстОшибкиПриПолученииЮЗД = "";
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Base64ДвоичныеДанныеСЧФ) Тогда
		РезультатВыполнения = ПоказатьПечатнуюФормуЮЗДНаСервере(ЭтаФорма.КаталогКартинкиЮЗД);	
		ЭтаФорма.Base64ДвоичныеДанныеСЧФ = РезультатВыполнения.Base64ДвоичныеДанныеСЧФ;
		ТекстОшибкиПриПолученииЮЗД = РезультатВыполнения.ТекстОшибки;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибкиПриПолученииЮЗД) Тогда
		 ПоказатьИндикаторНТМL(ТекстОшибкиПриПолученииЮЗД);
	Иначе
		 ПоказатьКартинкуЮЗДНТМL(Base64ДвоичныеДанныеСЧФ);
		 ОтключитьОбработчикОжидания("ОтобразитьЮЗД");
	 КонецЕсли;
	 
	 ЭтаФорма.Модифицированность = Ложь;
	 
КонецПроцедуры
 
&НаСервере
Функция КонвертацияPDF_в_JPGНаСервере(МассивЛогаСобытий)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    РезультатВыполнения = ОбработкаОбъект.КонвертацияPDF_в_JPG(Объект.СЧФНомер, Объект.СЧФДата, ЭтаФорма.ПрофильОбмена, ЭтаФорма.ИдентификаторЮЗД, МассивЛогаСобытий);

	Возврат РезультатВыполнения;    

КонецФункции

&НаСервере
Функция ПоказатьПечатнуюФормуЮЗДНаСервере(КаталогКартинкиЮЗД)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    РезультатВыполнения = ОбработкаОбъект.ПоказатьПечатнуюФормуЮЗД(КаталогКартинкиЮЗД);

	Возврат РезультатВыполнения;    

КонецФункции

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя = "ГруппаПредпросмотрДокументаCONDRA" 
		И НЕ Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.CONDRA_Входящий") Тогда
		
		ПоказатьИндикаторНТМL("");
		    
		ПодключитьОбработчикОжидания("ОбновитьПечатнуюФормуЮЗД", 3, Истина); // однократно
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИндикаторНТМL(ТекстОшибки)
	
	СтрокаНТМL = ПолучитьМакетНТМLНаСервере("ИндикаторHTML");
	
	СтрокаНТМL = СтрЗаменить(СтрокаНТМL,
		"<p style=""display: none; color: red; margin: 10px"">ТекстОшибки</p>"
		, "<p style=""color: red; margin: 10px"">" + ТекстОшибки + "</p>");

	ЭтаФорма.ПолеHTMLДокумента = СтрокаНТМL;
	Элементы.ПолеHTMLДокумента.Документ.body.innerHTML = СтрокаНТМL;
	ЭтаФорма.ОбновитьОтображениеДанных(Элементы.ПолеHTMLДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКартинкуЮЗДНТМL(Base64ДвоичныеДанныеСЧФ)
		
	СтрокаНТМL = "
	|<!DOCTYPE html>
	|<html> 
	|<center> 
	|<img src=""data:image/jpeg;base64, " + Base64ДвоичныеДанныеСЧФ + """ 
	|style=""max-width:100%; height:auto""; align-items:center; alt=""Счет-фактура"" />
	|</center> 
	|</html>
	|";
	
	ЭтаФорма.ПолеHTMLДокумента = СтрокаНТМL;
	Элементы.ПолеHTMLДокумента.Документ.body.innerHTML = СтрокаНТМL;
	ЭтаФорма.ОбновитьОтображениеДанных(Элементы.ПолеHTMLДокумента);

КонецПроцедуры

&НаСервере
Функция ПолучитьМакетНТМLНаСервере(ИмяМакетаНТМL)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    МакетНТМL = ОбработкаОбъект.ПолучитьМакет(ИмяМакетаНТМL);

	Возврат МакетНТМL.ПолучитьТекст(); 
	
КонецФункции

&НаКлиенте
Процедура СохранитьФормуЮЗД(Команда)
	
	ИмяСобытия = "Сохранение формы ЮЗД";

	Ошибка = Новый Структура;
	Ошибка.Вставить("ЕстьОшибка" , Ложь);
	Ошибка.Вставить("КодОшибки"  , "");
	Ошибка.Вставить("ТекстОшибки", "");  
	
	МассивЛогаСобытий = Новый Массив;

	ИД_Документа = Прав(ИдентификаторЮЗД, 36);
	СтрокаBase64PDF_Документа = ЭКОМ_ОбщегоНазначения.ИзвлечьPDF_ЭКОМ(ПрофильОбмена, ИД_Документа, Ошибка, МассивЛогаСобытий);
	ДвоичныеДанныеPDF_Документа = Base64Значение(СтрокаBase64PDF_Документа);
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанныеPDF_Документа, Новый УникальныйИдентификатор);
	
	Если Ошибка.ЕстьОшибка = Истина Тогда
		ТекстЛогаСобытий = "Не удлалось получить форму ЮЗД - " + Ошибка.КодОшибки + " - " + Ошибка.ТекстОшибки;
		ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначенияКлиент.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

	Иначе
		ИмяСохранения = "Счет-фактура № " +  Объект.СЧФНомер +" от " + Формат(Объект.СЧФДата, "ДФ=dd.MM.yyyy");;		
		СохранениеФайла(АдресВоВременномХранилище, ИмяСохранения);
	КонецЕсли;
	
	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий);
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранениеФайла(АдресВоВременномХранилище, ИмяСохранения)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	// создаем на клиенте текстовый файл
	ИмяВременногоФайлаXML = ПолучитьИмяВременногоФайла("pdf");
	
    Если ДвоичныеДанные = Неопределено Тогда
        ПоказатьПредупреждение(Новый ОписаниеОповещения, "Не удалось получить данные ЮЗД", , "Сохранение в файл");
        Возврат;
    КонецЕсли;
	// создаем диалог сохранения файла
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогОткрытияФайла.Заголовок          = "Сохраните файл";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Расширение         = "pdf";
    ДиалогОткрытияФайла.Фильтр             = "(*.pdf)|*.pdf";
	ДиалогОткрытияФайла.ИндексФильтра      = 0; //укажем фильтр по умолчанию (нумерация с нуля)	
	ДиалогОткрытияФайла.ПолноеИмяФайла = ИмяСохранения + ".pdf";;	
	ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("ЗавершениеДиалогаВыбораФайлаСохранение", ЭтаФорма, ДвоичныеДанные));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеДиалогаВыбораФайлаСохранение(ВыбранныеФайлы, ДвоичныеДанные) Экспорт
    
    Если ВыбранныеФайлы = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ВсегоФайлов = ВыбранныеФайлы.Количество();
    Прогресс = 0;
    ТекущийНомерФайла = 0;
	Если ВыбранныеФайлы <> Неопределено Или ТипЗнч(ВыбранныеФайлы) = Тип("Массив") Тогда
        Для каждого ИмяФайла Из ВыбранныеФайлы Цикл
            ТекущийНомерФайла = ТекущийНомерФайла + 1;
            Попытка
                Прогресс = Окр(ТекущийНомерФайла * 100 / ВсегоФайлов, 0);
                ДвоичныеДанные.Записать(ИмяФайла);
				ЗапуститьПриложение(ИмяФайла);

            Исключение
                Сообщить("Ошибка записи в файл [" + "] " + ИмяФайла);
            КонецПопытки;
            Состояние("Сохранено в " + ИмяФайла, Прогресс,, БиблиотекаКартинок.ЭКОМ_Информация);		
        КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеПросмотраТекстОшибки(Строка, Параметры) Экспорт
    //это заглушка, действия не нужны.
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ГруппаПредпросмотрДокументаCONDRA" 
		И НЕ Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.CONDRA_Входящий") Тогда
		ПоказатьИндикаторНТМL("");
		ПодключитьОбработчикОжидания("ОбновитьПечатнуюФормуЮЗД", 3, Истина); // однократно
		
	// MOD-1455	
	ИначеЕсли  ТекущаяСтраница.Имя = "ГруппаТовары" 
		И Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.ORDER_Входящий") Тогда 

		Для каждого Колонка из ТекущаяСтраница.ПодчиненныеЭлементы.ТЧ_Товары.ПодчиненныеЭлементы Цикл
			Если Колонка.Имя = "ТЧ_ТоварыКоличествоПоставляемое" Тогда
			Иначе
				Колонка.Доступность = Ложь;	
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура СтатусПриИзмененииНаСервере(ДокументОснование, ВидДокумента, Статус)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	СтруктураРегистраСобытий = Новый Структура;
	СтруктураРегистраСобытий.Вставить("Статус", Статус);
	
    ОбработкаОбъект.ЭКОМ_Объекты_События_Записать(ДокументОснование, ВидДокумента, СтруктураРегистраСобытий);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭКОМ_Объекты_СобытияНажатие(Элемент)
	
	СписокДокументов = Новый СписокЗначений;
	СписокДокументов.Добавить(Объект.Ссылка);
	
	Форма = ОткрытьФорму("РегистрСведений.ЭКОМ_Объекты_События.ФормаСписка");
	ОтборВладелец = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); //Добавлям отбор
	ОтборВладелец.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке; //Как будем сравнивать
	ОтборВладелец.Использование  = Истина; // Устанавливаем галку использованияНовый ПолеКомпоновкиДанных("Номенклатура")
	ОтборВладелец.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Документ_Основание"); //По какому реквизиту будем делать отбор
	ОтборВладелец.ПравоеЗначение = СписокДокументов; // И само значение отбора
	
	УсловиеСортировки = Форма.Список.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	УсловиеСортировки.Поле = Новый ПолеКомпоновкиДанных("ДатаЗаписи");
	УсловиеСортировки.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	УсловиеСортировки.Использование = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СостояниеДокумента = ОбработкаОбъект.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗакрыть(Команда)
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ВидыДокументов = Новый СписокЗначений;
    ВидыДокументов.Добавить(ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.PRICAT_Исходящий"));
    ВыбранныйЭлемент = ВыбратьИзСписка(ВидыДокументов, Элемент, ВидыДокументов.НайтиПоЗначению(Объект.ВидДокумента));
    Если НЕ ВыбранныйЭлемент = Неопределено Тогда
        Объект.ВидДокумента = ВыбранныйЭлемент.Значение;
	КонецЕсли;
    УправлениеВидимостьюПредставлением();

КонецПроцедуры

&НаКлиенте
Процедура УточнениеОПоставкеПрайсЛистНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТипПрайсЛиста = ПолучитьТипПрайсЛиста();
	   
	НайденноеЗначение = ТипПрайсЛиста.НайтиПоЗначению(Объект.УточнениеОПоставке);
	Если НайденноеЗначение = Неопределено Тогда
	     НачальноеЗначение = 0;
	Иначе
		 НачальноеЗначение = ТипПрайсЛиста.Индекс(НайденноеЗначение);
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Элемент"     , Элемент);
	ПараметрыОповещения.Вставить("ДанныеВыбора", ДанныеВыбора);

    ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьПослеВыбора", ЭтаФорма, ПараметрыОповещения);
	ПоказатьВыборИзСписка(ОписаниеОповещения, ТипПрайсЛиста, Элемент, НачальноеЗначение);

КонецПроцедуры

&НаКлиенте
Функция ПолучитьТипПрайсЛиста()
	
	ТипПрайсЛиста = Новый СписокЗначений;
    ТипПрайсЛиста.Добавить("9" , "9 — прайс-лист");
	ТипПрайсЛиста.Добавить("13", "13 — запрос прайс-листа");
	ТипПрайсЛиста.Добавить("51", "51 — подтверждение, ответ на прайс-лист");
	ТипПрайсЛиста.Добавить("99", "99 — отказ на прайс-листа");
	
	Возврат ТипПрайсЛиста;
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытии()
	Параметр = Новый Структура;
	Параметр.Вставить("ФормаДляОповещения", "Документы.ЭКОМ_Документы");
	Параметр.Вставить("СобытиеПоДокументу", Объект.СобытиеПоДокументу);
	Оповестить("ОбновитьТабличнуюЧасть", Параметр);
КонецПроцедуры

&НаКлиенте
Процедура ПрайсЛистТребуемоеДействиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	СписокТребуемыхДействий = Новый СписокЗначений;	
	СписокТребуемыхДействий.Добавить("2", "2 - добавление новых позиций");
	СписокТребуемыхДействий.Добавить("3", "3 - удаление");
	СписокТребуемыхДействий.Добавить("4", "4 - изменение");
	СписокТребуемыхДействий.Добавить("5", "5 - подорожание");
	СписокТребуемыхДействий.Добавить("6", "6 - удешевление");
	СписокТребуемыхДействий.Добавить("27", "27 - принято");
	СписокТребуемыхДействий.Добавить("29", "29 - не принято");
	
	НайденноеЗначение = СписокТребуемыхДействий.НайтиПоЗначению(Элемент.Родитель.ТекущиеДанные.ТребуемоеДействие);
	Если НайденноеЗначение = Неопределено Тогда
	     НачальноеЗначение = 0;
	Иначе
		 НачальноеЗначение = СписокТребуемыхДействий.Индекс(НайденноеЗначение);
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Элемент", Элемент);
	ПараметрыОповещения.Вставить("ДанныеВыбора", ДанныеВыбора);

    ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьПослеВыбора", ЭтаФорма, ПараметрыОповещения);
	ПоказатьВыборИзСписка(ОписаниеОповещения, СписокТребуемыхДействий, Элемент, НачальноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтвет(Команда)
	Форма = ПолучитьФорму("Документ.ЭКОМ_Документы.ФормаОбъекта");
	КопироватьДанныеФормы(Объект, Форма.Объект);
	Если Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.PRICAT_Входящий") Тогда
	     Форма.Объект.ВидДокумента       = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.PRICAT_Исходящий");
		 Форма.Объект.УточнениеОПоставке = "51"; // подтверждение, ответ на прайс-лист
		 Форма.Объект.Номер              = Неопределено;
		 Для каждого Стр Из Форма.Объект.ПрайсЛист Цикл
		        Стр.ТребуемоеДействие = "27"; // принято
		 КонецЦикла;
	КонецЕсли;
	Форма.Открыть();
	Форма.Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)	              
	Записать();	
	
	МассивЛогаСобытий = Новый Массив;
	
	ЭКОМ_ОбщегоНазначенияКлиент.ОтправитьДокументыНаКлиенте(МассивЛогаСобытий, Объект.ВидДокумента, Объект.Ссылка);

	Если МассивЛогаСобытий.Количество() > 0 Тогда
		СообщениеЛога = "";
		Для каждого ТекстЛога Из МассивЛогаСобытий Цикл
			СообщениеЛога = СообщениеЛога + ?(ЗначениеЗаполнено(СообщениеЛога), Символы.ПС, "") + ТекстЛога.Комментарий;
		КонецЦикла;
		Объект.СобытиеПоДокументу = СообщениеЛога;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПринятьВсе(Команда)
	Для каждого Стр Из Объект.ПрайсЛист Цикл
		Стр.ТребуемоеДействие = "27"; // принято
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьВсе(Команда)
	Для каждого Стр Из Объект.ПрайсЛист Цикл
		Стр.ТребуемоеДействие = "29"; // не принято
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	Если ПодтверждениеЗаказаРанееОтправлялось() Тогда
		Оповещение = Новый ОписаниеОповещения("ОтклонитьПродолжить", ЭтаФорма);
        ПоказатьВопрос(Оповещение, "Документ ORDRSP уже был отправлен. Отправить повторно?", РежимДиалогаВопрос.ДаНет, 0);
	Иначе
		ОтклонитьПродолжить(КодВозвратаДиалога.Да, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

// Продолжение отправки ORDRSP из ORDER после вопроса о повторной отправке
//
&НаКлиенте
Процедура ОтклонитьПродолжить(Результат, Данные) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	МассивЛогаСобытий = Новый Массив;
	Ответ = ОтклонитьНаСервере(МассивЛогаСобытий);
	Сообщение = Новый СообщениеПользователю;
	
	Если Ответ.Успешно Тогда
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(Ответ.АдресФайла);
		ДвоичныеДанныеФайла.Записать(Ответ.ИмяФайла);
		Сообщение.Текст = "Документ успешно отправлен";
		Объект.ПометкаУдаления = Истина;
		Записать();
	Иначе
		Сообщение.Текст = "Документ не отправлен.";
	КонецЕсли;
	
	Если МассивЛогаСобытий.Количество() > 0  Тогда
		ЭКОМ_ОбщегоНазначения.ЗаписатьЛогСобытийвРегистрЛогирование(МассивЛогаСобытий);
	КонецЕсли;
	
	Сообщение.Сообщить();
	
КонецПроцедуры // ОтклонитьПродолжить()


&НаСервере
Функция ОтклонитьНаСервере(МассивЛогаСобытий)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ОтклонитьЗаказ(МассивЛогаСобытий);
	
КонецФункции

// Проверяет, было ли ранее отправлено подтверждение заказа
//
// Возвращаемое значение:
//   Булево   - признак отправки подтверждения
//
&НаСервере
Функция ПодтверждениеЗаказаРанееОтправлялось()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ПодтверждениеЗаказаРанееОтправлялось();

КонецФункции // ПодтверждениеЗаказаРанееОтправлялось()


&НаКлиенте
Процедура ТЧ_ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	//MOD-1455
	Отказ=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ТоварыПередУдалением(Элемент, Отказ)
	//MOD-1455
	Отказ=Истина;
КонецПроцедуры

//Docrobot 1.21.0 MOD-1648
&НаКлиенте
Процедура ТЧ_ТоварыОбратныйЗаказСтрокаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.ТЧ_ТоварыОбратныйЗаказ.ТекущиеДанные;
	СтрокаТЧ.Сумма = СтрокаТЧ.КоличествоПоставляемое * СтрокаТЧ.Цена;
	СтрокаТЧ.ЦенаСНДС = СтрокаТЧ.Цена * (100 + СтрокаТЧ.СтавкаНДС)/100;
	СтрокаТЧ.Сумма_с_НДС = СтрокаТЧ.КоличествоПоставляемое * СтрокаТЧ.ЦенаСНДС;
	СтрокаТЧ.СуммаНДС = СтрокаТЧ.Сумма_с_НДС - СтрокаТЧ.Сумма;
КонецПроцедуры

&НаСервере
Процедура СогласованоПриИзмененииНаСервере()
	
	Если Объект.Согласовано = Истина Тогда 
		Объект.ОтветственныйCondra = Пользователи.ТекущийПользователь();
	Иначе
		Объект.ОтветственныйCondra = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СогласованоПриИзменении(Элемент)
	СогласованоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ПроверитьНаДоступностьСогласовано()
	Если Объект.ОтветственныйCondra = Пользователи.ТекущийПользователь() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

