#Область ПрограммныйИнтерфейс

Процедура ПроверитьВозможностьПроведенияПоКадровомуУчетуТаблицыСотрудников(Организация, СотрудникиДаты, ИсключаемыеСсылки, Отказ) Экспорт
	
	ЭтоЮридическоеЛицо = ЗарплатаКадрыПовтИсп.ЭтоЮридическоеЛицо(Организация);
	
	Если ЭтоЮридическоеЛицо Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СотрудникиДаты", СотрудникиДаты);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	&Организация КАК Организация,
		|	СотрудникиДаты.ДатаСобытия,
		|	СотрудникиДаты.Сотрудник,
		|	СотрудникиДаты.ВидСобытия,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаНачала,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТСотрудникиДаты
		|ИЗ
		|	&СотрудникиДаты КАК СотрудникиДаты";
	
	Запрос.Выполнить();
	
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТСотрудникиДаты", "Сотрудник");
	
	Если ТипЗнч(ИсключаемыеСсылки) <> Тип("Массив") Тогда
		ИсключаемыеСсылкиМассив = Новый Массив;
		ИсключаемыеСсылкиМассив.Добавить(ИсключаемыеСсылки);
	Иначе
		ИсключаемыеСсылкиМассив = ИсключаемыеСсылки;
	КонецЕсли;
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистра();
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПостроения.Отборы, "Регистратор", "НЕ В", ИсключаемыеСсылкиМассив);
	
	УстановитьПривилегированныйРежим(Истина);
		
	// физическое лицо ИП не может работать на себя
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сотрудники.Сотрудник КАК Сотрудник
		|ИЗ
		|	ВТСотрудникиДаты КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО Сотрудники.Организация = Организации.Ссылка
		|ГДЕ
		|	Организации.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
		|	И Сотрудники.Сотрудник.ФизическоеЛицо = Организации.ИндивидуальныйПредприниматель";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ТекстСообщенияПользователю = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Индивидуальный предприниматель %1 не может быть оформлен в свою организацию как сотрудник.'"),
				Выборка.Сотрудник);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстСообщенияПользователю, , , , Отказ);
				
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СторнироватьДанныеОперативногоУчетаКомандировки(ИспарвленныйДокумент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИспарвленныйДокумент) Тогда
		Возврат;
	КонецЕсли;
		
	ДанныеОперативногоУчетаРабочегоВремениСотрудников = РегистрыНакопления.ДанныеОперативногоУчетаРабочегоВремениСотрудников.СоздатьНаборЗаписей();
	ДанныеОперативногоУчетаРабочегоВремениСотрудников.Отбор.Регистратор.Установить(ИспарвленныйДокумент);
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеОперативногоУчетаРабочегоВремениСотрудников.Записать(Истина);
	УстановитьПривилегированныйРежим(Ложь);
		
КонецПроцедуры

Процедура ВосстановитьДанныеОперативногоУчетаКомандировки(ИспарвленныйДокумент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИспарвленныйДокумент) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыДляПроведения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИспарвленныйДокумент, "Сотрудник,ДатаНачала,ДатаОкончания,ВнутрисменнаяКомандировка,ПериодРегистрации,Ссылка,ОплачиватьЧасов,Смена,
																								|ВидРасчета,ПереходящаяЧастьПредыдущейСмены,ПереходящаяЧастьТекущейСмены,ДатаКомандировки,ВидВремениЗамещаемый");
	
	Движения = Новый Структура;
	
	НаборЗаписей = РегистрыНакопления.ДанныеОперативногоУчетаРабочегоВремениСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(РеквизитыДляПроведения.Ссылка);
	
	Движения.Вставить("ДанныеОперативногоУчетаРабочегоВремениСотрудников", НаборЗаписей);
	
	Если Документы.Командировка.НеобходимоРегистрироватьОперативныеДанныеВремени(РеквизитыДляПроведения.ВнутрисменнаяКомандировка) Тогда
		РегистрируемыеДанныеОВремени = Документы.Командировка.ДанныеОВремени(РеквизитыДляПроведения);
		Если РеквизитыДляПроведения.ВнутрисменнаяКомандировка Тогда
			УчетРабочегоВремениРасширенный.ЗарегистрироватьВнутрисменныеОтклонения(Движения, РегистрируемыеДанныеОВремени, РеквизитыДляПроведения.ПериодРегистрации);
		Иначе 
			УчетРабочегоВремени.ПроверитьРегистрируемыеДанныхОВремени(РеквизитыДляПроведения.Ссылка, РегистрируемыеДанныеОВремени, Ложь, Истина);
			УчетРабочегоВремени.ЗарегистрироватьРабочееВремяСотрудников(Движения, РегистрируемыеДанныеОВремени, РеквизитыДляПроведения.ПериодРегистрации);
		КонецЕсли;
	КонецЕсли;

	Если Движения.ДанныеОперативногоУчетаРабочегоВремениСотрудников.Количество() > 0 Тогда
		УстановитьПривилегированныйРежим(Истина);
		Движения.ДанныеОперативногоУчетаРабочегоВремениСотрудников.Записать(Истина);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура КомандировкаПроверитьЗаполнение(Объект, ПроверяемыеРеквизиты, Отказ, РежимИсправления = "РасчетЗарплаты", ПолеПериодРегистрации = "ПериодРегистрации") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ПериодРегистрацииИсправленногоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ИсправленныйДокумент, ПолеПериодРегистрации);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ПериодРегистрацииИсправленногоДокумента <> НеОпределено Тогда
		Если НЕ ПериодРегистрацииИсправленногоДокумента = Объект[ПолеПериодРегистрации] Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Неверно указан месяц. Месяц исправления должен быть равен месяцу исправляемого документа (%1 г.)'"),
				Формат(ПериодРегистрацииИсправленногоДокумента, "ДФ='ММММ гггг'"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,ПолеПериодРегистрации,,Отказ);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
