
&ИзменениеИКонтроль("УстановитьФиксированныеОтборы")
Процедура игр_УстановитьФиксированныеОтборы(СтруктураОтборов, НастройкиКД, НастройкиОтчета)
	Если ТипЗнч(НастройкиКД) <> Тип("НастройкиКомпоновкиДанных")
		Или СтруктураОтборов = Неопределено
		Или СтруктураОтборов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ПараметрыКД = НастройкиКД.ПараметрыДанных;
	ОтборыКД = НастройкиКД.Отбор;
	Недоступный = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Для Каждого КлючИЗначение Из СтруктураОтборов Цикл
		Имя = КлючИЗначение.Ключ;
		Значение = КлючИЗначение.Значение;
		Если ТипЗнч(Значение) = Тип("ФиксированныйМассив") Тогда
			Значение = Новый Массив(Значение);
		КонецЕсли;
		Если ТипЗнч(Значение) = Тип("Массив") Тогда
			Список = Новый СписокЗначений;
			Список.ЗагрузитьЗначения(Значение);
			Значение = Список;
		КонецЕсли;
		#Вставка
		ЭтоНоменклатураПрайсЛиста = 
			(НастройкиОтчета.ПолноеИмя = "Отчет.ПрайсЛист")
			И (Имя = "Номенклатура");
		#КонецВставки
		ПараметрКД = ПараметрыКД.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(Имя));
		#Удаление
		Если ТипЗнч(ПараметрКД) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
		#КонецУдаления
		#Вставка
		Если ТипЗнч(ПараметрКД) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных")
			И НЕ ЭтоНоменклатураПрайсЛиста Тогда
		#КонецВставки
			ПараметрКД.ИдентификаторПользовательскойНастройки = "";
			ПараметрКД.Использование    = Истина;
			ПараметрКД.РежимОтображения = Недоступный;
			ПараметрКД.Значение         = Значение;
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
			ВидСравненияКД = ВидСравненияКомпоновкиДанных.ВСписке;
		Иначе
			ВидСравненияКД = ВидСравненияКомпоновкиДанных.Равно;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборыКД, Имя, Значение, ВидСравненияКД, , Истина, Недоступный, "");
	КонецЦикла;
КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьПредставлениеИСостояниеНастройки")
Процедура игр_ЗаполнитьПредставлениеИСостояниеНастройки(СвойстваНастройки, НастройкаВариантаКД, ПользовательскаяНастройкаКД, ДоступнаяНастройкаКД)
	Если ПользовательскаяНастройкаКД = Неопределено Тогда
		ПользовательскаяНастройкаКД = НастройкаВариантаКД;
	КонецЕсли;

	СтруктураПредставлений = Новый Структура("Представление, ПредставлениеПользовательскойНастройки", "", "");
	ЗаполнитьЗначенияСвойств(СтруктураПредставлений, НастройкаВариантаКД);

	СвойстваНастройки.ВыводитьТолькоФлажок = ЗначениеЗаполнено(СтруктураПредставлений.Представление);

	Если ЗначениеЗаполнено(СтруктураПредставлений.ПредставлениеПользовательскойНастройки) Тогда
		Представление = СтруктураПредставлений.ПредставлениеПользовательскойНастройки;
	ИначеЕсли ЗначениеЗаполнено(СтруктураПредставлений.Представление) И СтруктураПредставлений.Представление <> "1" Тогда
		Представление = СтруктураПредставлений.Представление;
	Иначе
		Представление = "";
	КонецЕсли;
	СвойстваНастройки.Представление = СокрЛП(Представление);

	// Представление "По умолчанию".
	Если ДоступнаяНастройкаКД <> Неопределено И ЗначениеЗаполнено(ДоступнаяНастройкаКД.Заголовок) Тогда
		ПредставлениеПоУмолчанию = ДоступнаяНастройкаКД.Заголовок;
	ИначеЕсли ЗначениеЗаполнено(СвойстваНастройки.Подтип) Тогда
		Если СвойстваНастройки.Подтип = "ДиаграммаСерии" Тогда
			ПредставлениеПоУмолчанию = НСтр("ru = 'Серии'");
		ИначеЕсли СвойстваНастройки.Подтип = "ДиаграммаТочки" Тогда
			ПредставлениеПоУмолчанию = НСтр("ru = 'Точки'");
		ИначеЕсли СвойстваНастройки.Подтип = "ТаблицаСтроки" Тогда
			ПредставлениеПоУмолчанию = НСтр("ru = 'Строки'");
		ИначеЕсли СвойстваНастройки.Подтип = "ТаблицаКолонки" Тогда
			ПредставлениеПоУмолчанию = НСтр("ru = 'Колонки'");
		ИначеЕсли СвойстваНастройки.Подтип = "Отчет" Тогда
			ПредставлениеПоУмолчанию = НСтр("ru = 'Отчет'");
		Иначе
			ПредставлениеПоУмолчанию = Строка(СвойстваНастройки.Подтип);
		КонецЕсли;

		// Параметры и отборы.
	ИначеЕсли СвойстваНастройки.Тип = "Отбор" Тогда
		ПредставлениеПоУмолчанию = НСтр("ru = 'Отбор'");
	ИначеЕсли СвойстваНастройки.Тип = "ГруппаЭлементовОтбора" Тогда
		ПредставлениеПоУмолчанию = Строка(НастройкаВариантаКД.ТипГруппы);
	ИначеЕсли СвойстваНастройки.Тип = "ЭлементОтбора" Тогда
		ПредставлениеПоУмолчанию = Строка(НастройкаВариантаКД.ЛевоеЗначение);
	ИначеЕсли СвойстваНастройки.Тип = "ЗначениеПараметраНастроек" Тогда
		ПредставлениеПоУмолчанию = Строка(НастройкаВариантаКД.Параметр);

		// Сортировки.
	ИначеЕсли СвойстваНастройки.Тип = "Порядок" Тогда
		ПредставлениеПоУмолчанию = НСтр("ru = 'Сортировка'");
	ИначеЕсли СвойстваНастройки.Тип = "АвтоЭлементПорядка" Тогда
		ПредставлениеПоУмолчанию = НСтр("ru = 'Авто (сортировки родителя)'");
	ИначеЕсли СвойстваНастройки.Тип = "ЭлементПорядка" Тогда
		ПредставлениеПоУмолчанию = Строка(НастройкаВариантаКД.Поле);

		// Выбранные поля.
	ИначеЕсли СвойстваНастройки.Тип = "ВыбранныеПоля" Тогда
		ПредставлениеПоУмолчанию = НСтр("ru = 'Поля'");
	ИначеЕсли СвойстваНастройки.Тип = "ВыбранноеПоле" Тогда
		ПредставлениеПоУмолчанию = Строка(НастройкаВариантаКД.Поле);
	ИначеЕсли СвойстваНастройки.Тип = "АвтоВыбранноеПоле" Тогда
		ПредставлениеПоУмолчанию = НСтр("ru = 'Авто (поля родителя)'");
	ИначеЕсли СвойстваНастройки.Тип = "ГруппаВыбранныхПолей" Тогда
		ПредставлениеПоУмолчанию = НастройкаВариантаКД.Заголовок;
		Если НастройкаВариантаКД.Расположение <> РасположениеПоляКомпоновкиДанных.Авто Тогда
			ПредставлениеПоУмолчанию = ПредставлениеПоУмолчанию + " (" + Строка(НастройкаВариантаКД.Расположение) + ")";
		КонецЕсли;

		// Оформление.
	ИначеЕсли СвойстваНастройки.Тип = "УсловноеОформление" Тогда
		ПредставлениеПоУмолчанию = НСтр("ru = 'Оформление'");
	ИначеЕсли СвойстваНастройки.Тип = "ЭлементУсловногоОформления" Тогда
		#Удаление
		ПредставлениеПоУмолчанию = ОтчетыКлиентСервер.ПредставлениеЭлементаУсловногоОформления(
		ПользовательскаяНастройкаКД,
		НастройкаВариантаКД,
		СвойстваНастройки.Состояние);
		#КонецУдаления

		// Структура.
	ИначеЕсли СвойстваНастройки.Тип = "Группировка"
		Или СвойстваНастройки.Тип = "ГруппировкаТаблицы"
		Или СвойстваНастройки.Тип = "ГруппировкаДиаграммы" Тогда
		ПредставлениеПоУмолчанию = СокрЛП(Строка(НастройкаВариантаКД.ПоляГруппировки));
		Если ПустаяСтрока(ПредставлениеПоУмолчанию) Тогда
			ПредставлениеПоУмолчанию = НСтр("ru = '<Детальные записи>'");
		Иначе
			ДоступныеПоляКД = НастройкаВариантаКД.ПоляГруппировки.ДоступныеПоляПолейГруппировок;
			Для Каждого ПолеГруппировкиКД Из НастройкаВариантаКД.ПоляГруппировки.Элементы Цикл
				Если ТипЗнч(ПолеГруппировкиКД) = Тип("ПолеГруппировкиКомпоновкиДанных")
					И ДоступныеПоляКД.НайтиПоле(ПолеГруппировкиКД.Поле) = Неопределено Тогда
					СвойстваНастройки.Состояние = "ПометкаУдаления";
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли СвойстваНастройки.Тип = "Таблица" Тогда
		ПредставлениеПоУмолчанию = НСтр("ru = 'Таблица'");
	ИначеЕсли СвойстваНастройки.Тип = "Диаграмма" Тогда
		ПредставлениеПоУмолчанию = НСтр("ru = 'Диаграмма'");
	ИначеЕсли СвойстваНастройки.Тип = "НастройкиВложенногоОбъекта" Тогда
		ПредставлениеПоУмолчанию = Строка(ПользовательскаяНастройкаКД);
		Если ПустаяСтрока(ПредставлениеПоУмолчанию) Тогда
			ПредставлениеПоУмолчанию = НСтр("ru = 'Вложенная группировка'");
		КонецЕсли;
	ИначеЕсли СвойстваНастройки.Тип = "СтруктураНастроек" Тогда
		ПредставлениеПоУмолчанию = НСтр("ru = 'Структура'");
	Иначе
		ПредставлениеПоУмолчанию = Строка(СвойстваНастройки.Тип);
	КонецЕсли;
	СвойстваНастройки.ПредставлениеПоУмолчанию = СокрЛП(ПредставлениеПоУмолчанию);

	Если СвойстваНастройки.ДоступнаяНастройкаКД = Неопределено
		И (СвойстваНастройки.Тип = "ЭлементОтбора"
		Или СвойстваНастройки.Тип = "ЗначениеПараметраНастроек"
		Или СвойстваНастройки.Тип = "ЭлементПорядка"
		Или СвойстваНастройки.Тип = "ВыбранноеПоле")Тогда
		СвойстваНастройки.Состояние = "ПометкаУдаления";
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СвойстваНастройки.Представление) Тогда
		СвойстваНастройки.Представление = СвойстваНастройки.ПредставлениеПоУмолчанию;
	КонецЕсли;
КонецПроцедуры
