
#Область ОбработчикиКоманд

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	ОбновитьДанныеНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьДанныеНаКлиенте()
	
	ДлительнаяОперации	= НачатьОбновлениеДанных();
	
	ПараметрыОжидания	= ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал	= 3;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперации,
		Новый ОписаниеОповещения("ОбновитьДанные_Завершение", ЭтотОбъект),
		ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьОбновлениеДанных()
	
	СтруктураПараметров	= Новый Структура;
	СтруктураПараметров.Вставить("Период", Период);
	СтруктураПараметров.Вставить("Организация", Организация);
	СтруктураПараметров.Вставить("Подразделения", Подразделения);
	СтруктураПараметров.Вставить("ПоГруппам", ПоГруппам);
	
	ПараметрыВыполнения	= ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	ДлительнаяОперация	= ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.игр_АВСКлассификацияНоменклатуры.ВыполнитьОбновлениеДанных", 
		СтруктураПараметров, ПараметрыВыполнения);

	Возврат ДлительнаяОперация;		
		
КонецФункции

&НаКлиенте
Процедура ОбновитьДанные_Завершение(Результат, ДополнительныеПараметры) Экспорт
КонецПроцедуры


#КонецОбласти