Перем НеВыполнятьКодПриЗаписи Экспорт;

Функция ПолучитьДанныеРеализации(ВидДокумента, СвязанныеДокументы, ЗаказДата, ЗаказНомер, Организация, Контрагент) Экспорт  
	
	Если НЕ ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.RECADV_Входящий Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	ИмяДокументаРТУ = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ВидРеализацииПоставщик");
	Если НЕ ЗначениеЗаполнено(ИмяДокументаРТУ) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Если СвязанныеДокументы.Количество() = 0 Тогда
		ЗапросРТУ = Новый Запрос;
		ЗапросРТУ.Текст = 
		"ВЫБРАТЬ
		|   ЭКОМ_Объекты_События.Документ_Основание
		|ИЗ
		|   РегистрСведений.ЭКОМ_Объекты_События КАК ЭКОМ_Объекты_События
		|ГДЕ
		|   ЭКОМ_Объекты_События.ЗаказДата = &ЗаказДата
		|   И ЭКОМ_Объекты_События.ЗаказНомер = &ЗаказНомер
		|   И ЭКОМ_Объекты_События.Организация = &Организация
		|   И ЭКОМ_Объекты_События.Контрагент = &Контрагент
		|   И ЭКОМ_Объекты_События.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.DESADV_Исходящий)";
		ЗапросРТУ.УстановитьПараметр("ЗаказДата"  , ЗаказДата);
		ЗапросРТУ.УстановитьПараметр("ЗаказНомер" , ЗаказНомер);
		ЗапросРТУ.УстановитьПараметр("Организация", Организация);
		ЗапросРТУ.УстановитьПараметр("Контрагент" , Контрагент);
		РезультатЗапросаРТУ = ЗапросРТУ.Выполнить();
		ВыборкаРТУ = РезультатЗапросаРТУ.Выбрать();      
		Пока ВыборкаРТУ.Следующий() Цикл
			СтрокаСвязанныеДокументы = СвязанныеДокументы.Добавить();
			СтрокаСвязанныеДокументы.ДокументСвязанный = ВыборкаРТУ.Документ_Основание;
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РТУТовары.Ссылка КАК Реализация,
	|	РТУТовары.Номенклатура,
	|	РТУТовары.Количество,
	|	РТУТовары.Цена,
	|	РТУТовары.Сумма
	|ИЗ
	|	&ДокументИмяДокументаРТУТовары КАК РТУТовары
	|ГДЕ
	|	РТУТовары.Ссылка В(&РТУ)";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДокументИмяДокументаРТУТовары", "Документ." + ИмяДокументаРТУ + ".Товары");     
	Запрос.УстановитьПараметр("РТУ", СвязанныеДокументы);
	РезультатЗапроса = Запрос.Выполнить();    
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция КонвертацияPDF_в_JPG(СЧФНомер, СЧФДата, ПрофильОбмена, ИдентификаторЮЗД, МассивЛогаСобытий) Экспорт
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("ЕстьОшибка" , Ложь);
	РезультатВыполнения.Вставить("ТекстОшибки", ""); 
	РезультатВыполнения.Вставить("КаталогКартинкиЮЗД" , "");
	
	Если ЗначениеЗаполнено(ПрофильОбмена) Тогда
		
		Ошибка = Новый Структура;
		Ошибка.Вставить("ЕстьОшибка" , Ложь);
		Ошибка.Вставить("КодОшибки"  , "");
		Ошибка.Вставить("ТекстОшибки", "");  
		
		ИД_Документа = Прав(ИдентификаторЮЗД, 36);
		СтрокаBase64PDF_Документа = ЭКОМ_ОбщегоНазначения.ИзвлечьPDF_ЭКОМ(ПрофильОбмена, ИД_Документа, Ошибка, МассивЛогаСобытий);
		ДвоичныеДанныеPDF_Документа = Base64Значение(СтрокаBase64PDF_Документа);
		
		Если Ошибка.ЕстьОшибка = Ложь Тогда
			ВременныйКаталог = ЭКОМ_ОбщегоНазначения.ПутьВременногоКаталогаЭКОМ("pdf_to_jpg_" + ИД_Документа);
			
			КаталогСоздан = ЭКОМ_ОбщегоНазначения.ЭКОМ_СоздатьКаталогПроверитьНаЗапись(ВременныйКаталог, МассивЛогаСобытий);	
			РезультатВыполнения.ТекстОшибки = ЭКОМ_ОбщегоНазначения.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий);
			
			Если КаталогСоздан = Истина Тогда		
				ФайлПолноеИмя = ВременныйКаталог + ИД_Документа + ".pdf";
				ДвоичныеДанныеPDF_Документа.Записать(ФайлПолноеИмя);
				ДвоичныеДанныеМакета = ПолучитьМакет("КонвертаторPDF");
				ИмяФайлаКонвертатораPDF = ВременныйКаталог + "КонвертаторPDF.zip";
				ДвоичныеДанныеМакета.Записать(ИмяФайлаКонвертатораPDF);
				
				Файл = Новый ЧтениеZipФайла(ИмяФайлаКонвертатораPDF);
				Файл.ИзвлечьВсе(ВременныйКаталог);	
				
				КоманднаяСтрока = """""" + ВременныйКаталог + "gswin32c.exe""""" + " -dQUIET -dNOPROMPT -dBATCH -dNOPAUSE -sDEVICE=jpeg -r300 -sOutputFile=СЧФ.jpg " + ИД_Документа + ".pdf";
				СкриптVBS = новый ТекстовыйДокумент();	
				СкриптVBS.ДобавитьСтроку("Set WshShell = CreateObject(""WScript.Shell"")");
				СкриптVBS.ДобавитьСтроку("WshShell.Run """ + КоманднаяСтрока + """, 0");
				СкриптVBS.ДобавитьСтроку("Set WshShell = Nothing");
				СкриптVBS.Записать(ВременныйКаталог + "Скрипт.vbs", КодировкаТекста.ANSI);
				
				КодВозврата = Неопределено;
				Попытка
					ЗапуститьПриложение(ВременныйКаталог + "Скрипт.vbs", ВременныйКаталог, Истина, КодВозврата);
					
					РезультатВыполнения.Вставить("КаталогКартинкиЮЗД" , ВременныйКаталог);
					
				Исключение
					РезультатВыполнения.ЕстьОшибка = Истина;
					РезультатВыполнения.ТекстОшибки = "Отображение PDF на форме не поддерживается!";
					
				КонецПопытки;
				
			КонецЕсли;
			
		Иначе
			РезультатВыполнения.ЕстьОшибка = Истина;
			РезультатВыполнения.ТекстОшибки = "Не найден документ ЮЗД на платформе - " 
			+ СЧФНомер + " от " + СЧФДата + ". Попробуйте позже. " 
			+ "Код: " + Ошибка.КодОшибки + " - " + Ошибка.ТекстОшибки; 	
			
		КонецЕсли;
		
	Иначе
		РезультатВыполнения.ЕстьОшибка = Истина;
		РезультатВыполнения.ТекстОшибки = "Необходимо заполнить профиль обмена!"
		
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции  

Функция ПоказатьПечатнуюФормуЮЗД(КаталогКартинкиЮЗД) Экспорт
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("ТекстОшибки", ""); 
	РезультатВыполнения.Вставить("Base64ДвоичныеДанныеСЧФ", ""); 
	
	ФайлКартинкиСЧФ = Новый Файл(КаталогКартинкиЮЗД + "СЧФ.jpg");		
	Если ФайлКартинкиСЧФ.Существует() Тогда
		
		Попытка
			ДвоичныеДанныеСЧФ = Новый ДвоичныеДанные(ФайлКартинкиСЧФ.ПолноеИмя);
			РезультатВыполнения.Вставить("Base64ДвоичныеДанныеСЧФ", Base64Строка(ДвоичныеДанныеСЧФ));
		Исключение
			РезультатВыполнения.ТекстОшибки = "Нет доступа к файлу!";						
		КонецПопытки;
	Иначе
		РезультатВыполнения.ТекстОшибки = "Файла не существует!";	
	КонецЕсли;		
	
	Если НЕ ЗначениеЗаполнено(РезультатВыполнения.ТекстОшибки) Тогда
		Попытка
			УдалитьФайлы(КаталогКартинкиЮЗД);
		Исключение				
		КонецПопытки;						
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции  

Функция ПолучитьДанныеПоЮЗД(ЭкомДокумент) Экспорт
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("ЕстьОшибка"      , Ложь);
	РезультатВыполнения.Вставить("ПрофильОбмена"   , "");
	РезультатВыполнения.Вставить("ИдентификаторЮЗД", "");
	
	Запрос = Новый Запрос;
	Если ЭкомДокумент.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPR_01
		ИЛИ ЭкомДокумент.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPR_01_Испр
		ИЛИ ЭкомДокумент.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPRMARK_01
		ИЛИ ЭкомДокумент.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPRMARK_01_Испр
		ИЛИ ЭкомДокумент.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPRPROS_01		  
		ИЛИ ЭкомДокумент.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPRPROS_01_Испр 
		ИЛИ ЭкомДокумент.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPR_01
		ИЛИ ЭкомДокумент.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPR_01_Испр
		ИЛИ ЭкомДокумент.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPRMARK_01
		ИЛИ ЭкомДокумент.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPRMARK_01_Испр
		ИЛИ ЭкомДокумент.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPRPROS_01
		ИЛИ ЭкомДокумент.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPRPROS_01_Испр Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭКОМ_GLN.ПрофильОбмена КАК ПрофильОбмена,
		|	ЭКОМ_GLN.Объект КАК Организация,
		|	&ИдентификаторЮЗД КАК ИдентификаторЮЗД
		|ИЗ
		|	РегистрСведений.ЭКОМ_GLN КАК ЭКОМ_GLN
		|ГДЕ
		|	НЕ ЭКОМ_GLN.ПрофильОбмена = ЗНАЧЕНИЕ(Справочник.ЭКОМ_ПрофилиОбмена.ПустаяСсылка)
		|	И НЕ ЭКОМ_GLN.ПрофильОбмена.ПометкаУдаления И ЭКОМ_GLN.ПрофильОбмена.Активный = ИСТИНА 
		|	И ЭКОМ_GLN.Объект = &Организация";
		Запрос.УстановитьПараметр("Организация", ЭкомДокумент.Организация);
		Запрос.УстановитьПараметр("ИдентификаторЮЗД", ЭкомДокумент.НомерТранзакции);
		
	ИначеЕсли ЭкомДокумент.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ORDER_Входящий
		ИЛИ ЭкомДокумент.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.RECADV_Входящий Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭКОМ_GLN.ПрофильОбмена КАК ПрофильОбмена,
		|	ЭКОМ_GLN.Объект КАК Организация,
		|	ВЫБОР
		|		КОГДА ЭКОМ_ЦепочкиДокументовПоставщика.ИдентификаторСчФ_Кор = """"
		|				ИЛИ ЭКОМ_ЦепочкиДокументовПоставщика.ИдентификаторСчФ_Кор = НЕОПРЕДЕЛЕНО
		|				ИЛИ ЭКОМ_ЦепочкиДокументовПоставщика.ИдентификаторСчФ_Кор ЕСТЬ NULL
		|			ТОГДА ЭКОМ_ЦепочкиДокументовПоставщика.ИдентификаторСчФ
		|		ИНАЧЕ ЭКОМ_ЦепочкиДокументовПоставщика.ИдентификаторСчФ_Кор
		|	КОНЕЦ КАК ИдентификаторЮЗД
		|ИЗ
		|	РегистрСведений.ЭКОМ_ЦепочкиДокументовПоставщика КАК ЭКОМ_ЦепочкиДокументовПоставщика
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЭКОМ_GLN КАК ЭКОМ_GLN
		|		ПО ЭКОМ_ЦепочкиДокументовПоставщика.Организация = ЭКОМ_GLN.Объект
		|ГДЕ
		|	НЕ ЭКОМ_GLN.ПрофильОбмена = ЗНАЧЕНИЕ(Справочник.ЭКОМ_ПрофилиОбмена.ПустаяСсылка)
		|	И НЕ ЭКОМ_GLN.ПрофильОбмена.ПометкаУдаления И ЭКОМ_GLN.ПрофильОбмена.Активный = ИСТИНА
		|	И ВЫБОР
		|			КОГДА &ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.ORDER_Входящий)
		|				ТОГДА ЭКОМ_ЦепочкиДокументовПоставщика.ORDER = &ЭкомДок
		|			КОГДА &ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.RECADV_Входящий)
		|				ТОГДА ЭКОМ_ЦепочкиДокументовПоставщика.RECADV = &ЭкомДок
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ";
		Запрос.УстановитьПараметр("ЭкомДок", ЭкомДокумент.Ссылка);
		Запрос.УстановитьПараметр("ВидДокумента", ЭкомДокумент.ВидДокумента );
		
	ИначеЕсли ЭкомДокумент.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ORDRSP_Входящий
		ИЛИ ЭкомДокумент.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DESADV_Входящий Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭКОМ_GLN.ПрофильОбмена КАК ПрофильОбмена,
		|	ЭКОМ_GLN.Объект КАК Организация,
		|	ВЫБОР
		|		КОГДА ЭКОМ_ЦепочкиДокументовПокупателя.ИдентификаторСчФ_Основание = """"
		|				ИЛИ ЭКОМ_ЦепочкиДокументовПокупателя.ИдентификаторСчФ_Основание = НЕОПРЕДЕЛЕНО
		|				ИЛИ ЭКОМ_ЦепочкиДокументовПокупателя.ИдентификаторСчФ_Основание ЕСТЬ NULL
		|			ТОГДА ЭКОМ_ЦепочкиДокументовПокупателя.ИдентификаторСчФ
		|		ИНАЧЕ ЭКОМ_ЦепочкиДокументовПокупателя.ИдентификаторСчФ_Основание
		|	КОНЕЦ КАК ИдентификаторЮЗД
		|ИЗ
		|	РегистрСведений.ЭКОМ_ЦепочкиДокументовПокупателя КАК ЭКОМ_ЦепочкиДокументовПокупателя
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЭКОМ_GLN КАК ЭКОМ_GLN
		|		ПО ЭКОМ_ЦепочкиДокументовПокупателя.Организация = ЭКОМ_GLN.Объект
		|ГДЕ
		|	НЕ ЭКОМ_GLN.ПрофильОбмена = ЗНАЧЕНИЕ(Справочник.ЭКОМ_ПрофилиОбмена.ПустаяСсылка)
		|	И НЕ ЭКОМ_GLN.ПрофильОбмена.ПометкаУдаления
		|	И ЭКОМ_GLN.ПрофильОбмена.Активный = ИСТИНА
		|	И ВЫБОР
		|			КОГДА &ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.ORDRSP_Входящий)
		|				ТОГДА ЭКОМ_ЦепочкиДокументовПокупателя.ORDRSP = &ЭкомДок
		|			КОГДА &ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.DESADV_Входящий)
		|				ТОГДА ЭКОМ_ЦепочкиДокументовПокупателя.DESADV = &ЭкомДок
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ";
		Запрос.УстановитьПараметр("ЭкомДок", ЭкомДокумент.Ссылка);
		Запрос.УстановитьПараметр("ВидДокумента", ЭкомДокумент.ВидДокумента );
	Иначе
		РезультатВыполнения.ЕстьОшибка = Истина;
		
	КонецЕсли;
	
	Если РезультатВыполнения.ЕстьОшибка = Ложь Тогда
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			РезультатВыполнения.Вставить("ПрофильОбмена", Выборка.ПрофильОбмена);
			РезультатВыполнения.Вставить("ИдентификаторЮЗД", Выборка.ИдентификаторЮЗД);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

// Статус документа из регистра ЭКОМ_Объекты_События 
Функция ДанныеПоДокументу(ЭкомДокументСсылка) Экспорт
	
	ДанныеПоДокументу = Новый Структура;
	ДанныеПоДокументу.Вставить("Статус", Перечисления.ЭКОМ_Статусы.ПустаяСсылка());
	ДанныеПоДокументу.Вставить("ТекстОшибки", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЭКОМ_Объекты_События.Статус,
	|	ЭКОМ_Объекты_События.ТекстОшибки
	|ИЗ
	|	РегистрСведений.ЭКОМ_Объекты_События КАК ЭКОМ_Объекты_События
	|ГДЕ
	|	ЭКОМ_Объекты_События.Документ_Основание = &Документ_Основание
	|	И ЭКОМ_Объекты_События.ВидДокумента = &ВидДокумента";
	
	Запрос.УстановитьПараметр("ВидДокумента", ЭкомДокументСсылка.ВидДокумента);
	Запрос.УстановитьПараметр("Документ_Основание", ЭкомДокументСсылка);
	РезультатЗапроса = Запрос.Выполнить();	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		ВыборкаДетальныеЗаписи.Следующий();
		
		ДанныеПоДокументу.Вставить("Статус", ВыборкаДетальныеЗаписи.Статус);
		ДанныеПоДокументу.Вставить("ТекстОшибки", ВыборкаДетальныеЗаписи.ТекстОшибки);
	КонецЕсли;
	
	Возврат ДанныеПоДокументу;
	
КонецФункции 

Процедура ЭКОМ_Объекты_События_Записать(п_Регистратор, п_ВидДокумента, п_Структура, ЗаписыватьПустыеЗначения = Ложь) Экспорт
	
	Блокировать = ПолучитьРежимУправленияБлокировкойДанныхПоУмолчанию(); 	
	// Установка блокировки
	НачатьТранзакцию();
	Попытка
		
		Если Блокировать = Истина Тогда
			БлокировкаДанных 		= Новый БлокировкаДанных;
			ЭлементБлокировки 		= БлокировкаДанных.Добавить("РегистрСведений.ЭКОМ_Объекты_События");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("Документ_Основание", п_Регистратор);
			ЭлементБлокировки.УстановитьЗначение("ВидДокумента", п_ВидДокумента);
			БлокировкаДанных.Заблокировать();	
		КонецЕсли;
		
		МЗ = РегистрыСведений.ЭКОМ_Объекты_События.СоздатьМенеджерЗаписи();
		МЗ.Документ_Основание  = п_Регистратор;
		МЗ.ВидДокумента        = п_ВидДокумента;
		МЗ.Прочитать();
		
		Если НЕ МЗ.Выбран() Тогда
			МЗ.Документ_Основание  = п_Регистратор;
			МЗ.ВидДокумента = п_ВидДокумента;
			МЗ.ДатаЗаписи = ТекущаяДата();	
		КонецЕсли;
		
		Для Каждого Элемент Из п_Структура Цикл
			
			Если ЗаписыватьПустыеЗначения Тогда
				МЗ[Элемент.Ключ] = Элемент.Значение; 	
			Иначе
				Если ЗначениеЗаполнено(Элемент.Значение) Тогда
					МЗ[Элемент.Ключ] = Элемент.Значение; 	
				КонецЕсли;
			КонецЕсли;	
			
		КонецЦикла;
		
		МЗ.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();	
		ЗаписьЖурналаРегистрации("Обработка ""Интеграция ECOM""", УровеньЖурналаРегистрации.Ошибка, , , "Конфликт записи в регистр - " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры // ЭКОМ_Объекты_События_Записать()

Функция ПолучитьРежимУправленияБлокировкойДанныхПоУмолчанию() 
	
	// Автоматический - все транзакции, будут выполняться в автоматическом режиме.
	// АвтоматическийИУправляемый  - транзакции, будут выполняться в режиме, определяемом установкой соответствующего свойства объекта метаданных.
	// Управляемый - все транзакции, будут выполняться в управляемом режиме. 
	Блокировать = Ложь;
	Если Метаданные.РежимУправленияБлокировкойДанных = Метаданные.Свойстваобъектов.РежимУправленияБлокировкойДанныхПоУмолчанию.Управляемый Тогда
		Блокировать = Истина;
	КонецЕсли;
	
	Возврат Блокировать;
	
КонецФункции // ПолучитьРежимУправленияБлокировкойДанныхПоУмолчанию()

// Позволяет получить индекс картинки состояния документа из коллекции СостоянияДокумента
// по свойствам Проведен/ПометкаУдаления/РучнаяКорректировка
//
// Параметры:
// Объект - основной реквизит формы документа, с типом ДанныеФормыСтруктура
//
Функция СостояниеДокумента(Объект) Экспорт
	
	Если Объект.ПометкаУдаления Тогда
		СостояниеДокумента = 2;
	ИначеЕсли Объект.СтатусОбработкиДокумента = Перечисления.ЭКОМ_Статусы.Обработан Тогда
		СостояниеДокумента = 1;
	Иначе
		СостояниеДокумента = 0;
	КонецЕсли;
	
	Возврат СостояниеДокумента;
	
КонецФункции

// При записи запрещается изменять содержимое объекта, так как объект уже записан в базу, есть ссылка.
Процедура ПриЗаписи(Отказ)
	
	// Отказ от выполнения действий подписки, если нужно только записать документ.
	Если НеВыполнятьКодПриЗаписи = Истина Тогда
		Возврат;
	КонецЕсли;
	
	// ORDER входящий для поставщика.
	Если ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ORDER_Входящий Тогда
		//Docrobot 1.20.0 MOD-1602
		Если ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ВыполнятьПодпискиИзНастроек_ORDER_Входящий",Ложь) = Ложь Тогда 	
		
			Если ЭтотОбъект.АктуальныйДокумент Тогда
			
			ИмяЦепочки = "ЭКОМ_ЦепочкиДокументовПоставщика";
			
			ЗаписьНайдена = Ложь;
			
			// 1. Поиск по текущему документу
			НаборЗаписей = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ORDER.Установить(ЭтотОбъект.Ссылка); // поле проиндексировано
			// Выполним блокировку данных
			ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, ИмяЦепочки);				 
			НаборЗаписей.Прочитать();
			Если НЕ НаборЗаписей.Количество() = 0 Тогда
				ЗаписьНайдена = Истина;
			КонецЕсли;
			
			// 2. Для корректировок и удаленных ищем по точному совпадению даты, организации и контрагента с дальнейшим отбором по номеру заказа (полагаем, что дата заказа не менялась).
			// Обязательные
			Если НЕ ЗаписьНайдена Тогда
				КоличествоОбязательныхОтборов = 3;
				ОбязательныеДанныеОтбораЗаполнены = Новый Массив; 				
				Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказДата) Тогда
					ОбязательныеДанныеОтбораЗаполнены.Добавить("ORDERDATE");
				КонецЕсли;	
				Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказНомер) Тогда
					ОбязательныеДанныеОтбораЗаполнены.Добавить("ORDERNUMBER");
				КонецЕсли;
				Если ЗначениеЗаполнено(ЭтотОбъект.Контрагент) Тогда
					ОбязательныеДанныеОтбораЗаполнены.Добавить("Контрагент");
				КонецЕсли;
				
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("ORDERDATE"    , ЭтотОбъект.ЗаказДата);
				СтруктураОтбора.Вставить("ORDERNUMBER"  , ЭтотОбъект.ЗаказНомер);
				СтруктураОтбора.Вставить("Организация"  , ЭтотОбъект.Организация);
				СтруктураОтбора.Вставить("Контрагент"   , ЭтотОбъект.Контрагент);
				СтруктураОтбора.Вставить("ТочкаДоставки", ЭтотОбъект.ТочкаДоставки);
				Если ОбязательныеДанныеОтбораЗаполнены.Количество() = КоличествоОбязательныхОтборов Тогда 
					НаборЗаписей = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();
					Для каждого Данные Из СтруктураОтбора Цикл
						Если ЗначениеЗаполнено(Данные.Значение) Тогда
							НаборЗаписей.Отбор[Данные.Ключ].Установить(Данные.Значение);
						КонецЕсли;
					КонецЦикла;
					
					// Выполним блокировку данных
					ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, ИмяЦепочки);				 
					НаборЗаписей.Прочитать();
					Если НаборЗаписей.Количество() = 1 Тогда // Если запись одна, значит нет разделения заказа
						ЗаписьНайдена = Истина;
					КонецЕсли;									
				КонецЕсли;			
			КонецЕсли;
			
			// 3. Для корректировок и удаленных ищем по приблизительной дате и точным номеру, организаци и контрагенту.
			Если НЕ ЗаписьНайдена Тогда
				КоличествоОбязательныхОтборов = 3;
				ОбязательныеДанныеОтбораЗаполнены = Новый Массив; 				
				Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказНомер) Тогда
					ОбязательныеДанныеОтбораЗаполнены.Добавить("ORDERNUMBER");
				КонецЕсли;	
				Если ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
					ОбязательныеДанныеОтбораЗаполнены.Добавить("Организация");
				КонецЕсли;
				Если ЗначениеЗаполнено(ЭтотОбъект.Контрагент) Тогда
					ОбязательныеДанныеОтбораЗаполнены.Добавить("Контрагент");
				КонецЕсли;	
				
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("ORDERNUMBER"  , ЭтотОбъект.ЗаказНомер);
				СтруктураОтбора.Вставить("Организация"  , ЭтотОбъект.Организация);
				СтруктураОтбора.Вставить("Контрагент"   , ЭтотОбъект.Контрагент);
				СтруктураОтбора.Вставить("ТочкаДоставки", ЭтотОбъект.ТочкаДоставки);
				Если ОбязательныеДанныеОтбораЗаполнены.Количество() = КоличествоОбязательныхОтборов Тогда 
					НаборЗаписей = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();
					Для каждого Данные Из СтруктураОтбора Цикл
						Если ЗначениеЗаполнено(Данные.Значение) Тогда
							НаборЗаписей.Отбор[Данные.Ключ].Установить(Данные.Значение);
						КонецЕсли;
					КонецЦикла;
					
					// Выполним блокировку данных
					ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, ИмяЦепочки);				 
					НаборЗаписей.Прочитать();
					Если НЕ НаборЗаписей.Количество() = 0 Тогда
						ЗаписиДляУдаления = Новый Массив;
						Для Каждого НоваяЗапись Из НаборЗаписей Цикл
							Если НЕ ЭтотОбъект.ЗаказНомер = НоваяЗапись.ORDERNUMBER Тогда
								ЗаписиДляУдаления.Добавить(НоваяЗапись);
							КонецЕсли;
						КонецЦикла;
						
						Для Каждого ЗаписьДляУдаления Из ЗаписиДляУдаления Цикл
							НаборЗаписей.Удалить(ЗаписьДляУдаления);
						КонецЦикла;
						
						Для Каждого НоваяЗапись Из НаборЗаписей Цикл
							Если НачалоДня(ЭтотОбъект.ЗаказДата) >= ДобавитьМесяц(НачалоДня(НоваяЗапись.ORDERDATE), -2)  Тогда         
								ЗаписьНайдена = Истина;
								Прервать;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;							
				КонецЕсли;
			КонецЕсли;
			
			// 4. Для ситуации когда загрудыем документы после сопоставления (Контрагент/ТочкаДоставки). 
			//Ищем записи по точным Организации, ORDERNUMBER и приблизительной дате, с проверкой на значение xmlКонтрагент и xmlТочкаДоставки.
			Если НЕ ЗаписьНайдена Тогда
				КоличествоОбязательныхОтборов = 2;
				ОбязательныеДанныеОтбораЗаполнены = Новый Массив; 				
				Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказНомер) Тогда
					ОбязательныеДанныеОтбораЗаполнены.Добавить("ORDERNUMBER");
				КонецЕсли;	
				Если ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
					ОбязательныеДанныеОтбораЗаполнены.Добавить("Организация");
				КонецЕсли;
				
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("ORDERNUMBER"  , ЭтотОбъект.ЗаказНомер);
				СтруктураОтбора.Вставить("Организация"  , ЭтотОбъект.Организация);
				Если ОбязательныеДанныеОтбораЗаполнены.Количество() = КоличествоОбязательныхОтборов Тогда 
					НаборЗаписей = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();
					Для каждого Данные Из СтруктураОтбора Цикл
						Если ЗначениеЗаполнено(Данные.Значение) Тогда
							НаборЗаписей.Отбор[Данные.Ключ].Установить(Данные.Значение);
						КонецЕсли;
					КонецЦикла;
					
					// Выполним блокировку данных
					ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, ИмяЦепочки);				 
					НаборЗаписей.Прочитать();
					Если НЕ НаборЗаписей.Количество() = 0 Тогда
						ЗаписиДляУдаления = Новый Массив;
						Для Каждого НоваяЗапись Из НаборЗаписей Цикл
							Если НЕ ЭтотОбъект.ЗаказНомер = НоваяЗапись.ORDERNUMBER Тогда
								ЗаписиДляУдаления.Добавить(НоваяЗапись);
							КонецЕсли;
						КонецЦикла;
						
						Для Каждого ЗаписьДляУдаления Из ЗаписиДляУдаления Цикл
							НаборЗаписей.Удалить(ЗаписьДляУдаления);
						КонецЦикла;
						
						Для Каждого НоваяЗапись Из НаборЗаписей Цикл
							Если НачалоДня(ЭтотОбъект.ЗаказДата) >= ДобавитьМесяц(НачалоДня(НоваяЗапись.ORDERDATE), -2) И (ЭтотОбъект.xmlКонтрагент = НоваяЗапись.xmlКонтрагент) И (ЭтотОбъект.xmlТочкаДоставки = НоваяЗапись.xmlТочкаДоставки) Тогда         
								ЗаписьНайдена = Истина;
								Прервать;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;							
				КонецЕсли;
			КонецЕсли;

			ДанныеИзмерений = Новый Структура;
			ДанныеИзмерений.Вставить("ORDER"        , ЭтотОбъект.Ссылка);
			ДанныеИзмерений.Вставить("ТочкаДоставки", ЭтотОбъект.ТочкаДоставки);
			
			//Docrobot 1.20.0 MOD-1427 [Если корректировочный заказ, то переписываем дату заказа]
			Если ЭтотОбъект.ТипДокумента = "R" Тогда 
				ДанныеИзмерений.Вставить("ORDERDATE", ЭтотОбъект.ЗаказДата );	
			КонецЕсли;
			
			Если НЕ ЗаписьНайдена Тогда // Только для первичного документа, далее не меняем.
				ДанныеИзмерений.Вставить("ORDERDATE"    , ЭтотОбъект.ЗаказДата);
				ДанныеИзмерений.Вставить("ORDERNUMBER"  , ЭтотОбъект.ЗаказНомер);
				ДанныеИзмерений.Вставить("Организация"  , ЭтотОбъект.Организация);
				ДанныеИзмерений.Вставить("Контрагент"   , ЭтотОбъект.Контрагент);
			КонецЕсли;
			
			ДанныеРесурсов = Новый Структура;
			ДанныеРесурсов.Вставить("xmlОрганизация"  , ЭтотОбъект.xmlОрганизация);
			ДанныеРесурсов.Вставить("xmlКонтрагент"   , ЭтотОбъект.xmlКонтрагент);
			ДанныеРесурсов.Вставить("xmlТочкаДоставки", ЭтотОбъект.xmlТочкаДоставки);
			ДанныеРесурсов.Вставить("ДатаПоставки"    , ЭтотОбъект.ДатаПоставки);
			ДанныеРесурсов.Вставить("КоличествоORDER" , ЭтотОбъект.ТЧ_Товары.Итог("КоличествоЗаказанное"));
			ДанныеРесурсов.Вставить("СуммаORDER"      , ЭтотОбъект.ТЧ_Товары.Итог("Сумма_с_НДС"));
			ДанныеРесурсов.Вставить("ТекстОшибки"     , ЭтотОбъект.ТекстОшибки);
			ДанныеРесурсов.Вставить("Статус_ORDER"    , ПредопределенноеЗначение("Перечисление.ЭКОМ_СтатусыЭлектронныхДокументов.Получен"));
			
			Если ЗаписьНайдена Тогда // Если существует документ в регистре
				Для Каждого НоваяЗапись Из НаборЗаписей Цикл
						
					Если НЕ ЗначениеЗаполнено(НоваяЗапись.Контрагент) Тогда
						ДанныеИзмерений.Вставить("Контрагент"   , ЭтотОбъект.Контрагент);
					КонецЕсли;
					
					Если НЕ ЗначениеЗаполнено(НоваяЗапись.Организация) Тогда
						ДанныеИзмерений.Вставить("Организация"  , ЭтотОбъект.Организация);
					КонецЕсли;

					ЭКОМ_ПодпискаСобытий.СформироватьЗаписьВРегистр(НоваяЗапись, ДанныеИзмерений, ДанныеРесурсов);					
				КонецЦикла;
			Иначе // Записываем документ в первый раз
				
				//Docrobot 1.21.0 MOD-1648
				Если ЗначениеЗаполнено(ЭтотОбъект.СвязанныйDocrobotДокумент) Тогда
					ДанныеРесурсов.Вставить("Статус_RETORD", Перечисления.ЭКОМ_СтатусыЭлектронныхДокументов.Отправлен);
				КонецЕсли;
				
				НаборЗаписей = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();
				Для каждого Данные Из ДанныеИзмерений Цикл
					Если ЗначениеЗаполнено(Данные.Значение) Тогда
						НаборЗаписей.Отбор[Данные.Ключ].Установить(Данные.Значение);
					КонецЕсли;
				КонецЦикла;
				// Выполним блокировку данных
				ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, ИмяЦепочки);				 
				НаборЗаписей.Прочитать();
				
				ЭКОМ_ПодпискаСобытий.СформироватьЗаписьВРегистр(НаборЗаписей.Добавить(), ДанныеИзмерений, ДанныеРесурсов);				
			КонецЕсли;
			
			Если НаборЗаписей.Модифицированность() Тогда
				НаборЗаписей.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
		КонецЕсли;
		// RECADV входящий для поставщика.
	ИначеЕсли ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.RECADV_Входящий Тогда
		//Docrobot 1.20.0 MOD-1602
		Если ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ВыполнятьПодпискиИзНастроек_RECADV_Входящий",Ложь) = Ложь Тогда 	
		
			Если ЭтотОбъект.ЭтоПовторныйДокумент = Ложь Тогда
			ИмяЦепочки = "ЭКОМ_ЦепочкиДокументовПоставщика";
			
			ДокументНакладная = Неопределено;
			Если ЭтотОбъект.ДокументыСвязанные.Количество() > 0 Тогда
				ДокументНакладная = ЭтотОбъект.ДокументыСвязанные[0].ДокументСвязанный;
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();      
			
			ЗаписьНайдена = Ложь;
			
			// 1. Ищем по накладной
			Если ЗначениеЗаполнено(ДокументНакладная) Тогда
				НаборЗаписей.Отбор.Накладная.Установить(ДокументНакладная); // поле проиндексировано
				
				// Выполним блокировку данных
				ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, ИмяЦепочки);		
				
				НаборЗаписей.Прочитать();
				Если НЕ НаборЗаписей.Количество() = 0 Тогда
					ЗаписьНайдена = Истина;
				КонецЕсли;
			КонецЕсли;
			
			// 2. Поиск по дате и номеру заказа
			Если ЗаписьНайдена = Ложь Тогда
				КоличествоОбязательныхОтборов = 2;
				ОбязательныеДанныеОтбораЗаполнены = Новый Массив; 				
				Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказДата) Тогда
					ОбязательныеДанныеОтбораЗаполнены.Добавить("ORDERDATE");
				КонецЕсли;	
				Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказНомер) Тогда
					ОбязательныеДанныеОтбораЗаполнены.Добавить("ORDERNUMBER");
				КонецЕсли;	
				
				// Обязательные
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("ORDERDATE"    , ЭтотОбъект.ЗаказДата);
				СтруктураОтбора.Вставить("ORDERNUMBER"  , ЭтотОбъект.ЗаказНомер);
				СтруктураОтбора.Вставить("Организация"  , ЭтотОбъект.Организация);
				СтруктураОтбора.Вставить("Контрагент"   , ЭтотОбъект.Контрагент);
				СтруктураОтбора.Вставить("ТочкаДоставки", ЭтотОбъект.ТочкаДоставки);
				Если ОбязательныеДанныеОтбораЗаполнены.Количество() = КоличествоОбязательныхОтборов Тогда 
					НаборЗаписей = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();
					Для каждого Данные Из СтруктураОтбора Цикл
						Если ЗначениеЗаполнено(Данные.Значение) Тогда
							НаборЗаписей.Отбор[Данные.Ключ].Установить(Данные.Значение);
						КонецЕсли;
					КонецЦикла;
					
					// Выполним блокировку данных
					ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, ИмяЦепочки);				 
					НаборЗаписей.Прочитать();
					Если НаборЗаписей.Количество() = 1 Тогда // Если запись одна, значит нет разделения заказа 
						ЗаписьНайдена = Истина;
					КонецЕсли;								
				КонецЕсли;					
			КонецЕсли;
			
			Если ЗаписьНайдена = Истина Тогда			
				ДанныеИзмерений = Новый Структура;
				ДанныеИзмерений.Вставить("RECADV"       , ЭтотОбъект.Ссылка);
				ДанныеИзмерений.Вставить("Накладная"    , ДокументНакладная);			
				ДанныеИзмерений.Вставить("Организация"  , ЭтотОбъект.Организация);
				ДанныеИзмерений.Вставить("Контрагент"   , ЭтотОбъект.Контрагент);
				ДанныеИзмерений.Вставить("ТочкаДоставки", ЭтотОбъект.ТочкаДоставки);
				ДанныеИзмерений.Вставить("ORDERDATE"    , ЭтотОбъект.ЗаказДата);
				ДанныеИзмерений.Вставить("ORDERNUMBER"  , ЭтотОбъект.ЗаказНомер);
				ДанныеИзмерений.Вставить("Заказ"        , ЭтотОбъект.Документ1С);
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("КоличествоRECADV" , ЭтотОбъект.ТЧ_Товары.Итог("КоличествоПринятое"));
				ДанныеРесурсов.Вставить("СуммаRECADV"      , ЭтотОбъект.ТЧ_Товары.Итог("Сумма_с_НДС"));
				ДанныеРесурсов.Вставить("ТекстОшибки"      , ЭтотОбъект.ТекстОшибки);
				ДанныеРесурсов.Вставить("Статус_RECADV"    , ПредопределенноеЗначение("Перечисление.ЭКОМ_СтатусыЭлектронныхДокументов.Получен"));
				
				// Если существует документ в регистре
				Для Каждого НоваяЗапись Из НаборЗаписей Цикл					
					ЭКОМ_ПодпискаСобытий.СформироватьЗаписьВРегистр(НоваяЗапись, ДанныеИзмерений, ДанныеРесурсов);					
				КонецЦикла;
				
				НаборЗаписей.Записать();												
			КонецЕсли;
		КонецЕсли;
		
		КонецЕсли;		
		// ORDRSP входящий для сети
	ИначеЕсли ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ORDRSP_Входящий Тогда		
		//Docrobot 1.20.0 MOD-1602
		Если ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ВыполнятьПодпискиИзНастроек_ORDRSP_Входящий",Ложь) = Ложь Тогда 	
		
			// Повторные документы не записываем в цепочку
			Если ЭтотОбъект.ЭтоПовторныйДокумент = Ложь Тогда		
			ИмяЦепочки = "ЭКОМ_ЦепочкиДокументовПокупателя";
			
			ДокументЗаказа = Неопределено;
			Если ЗначениеЗаполнено(ЭтотОбъект.Документ1С) Тогда
				ДокументЗаказа = ЭтотОбъект.Документ1С;
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();      
			
			ЗаписьНайдена = Ложь;
			
			// 1. Ищем по заказу
			Если ЗначениеЗаполнено(ДокументЗаказа) Тогда
				НаборЗаписей.Отбор.Заказ.Установить(ДокументЗаказа); // поле проиндексировано
				
				// Выполним блокировку данных
				ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, ИмяЦепочки);		
				
				НаборЗаписей.Прочитать();
				Если НЕ НаборЗаписей.Количество() = 0 Тогда
					ЗаписьНайдена = Истина;
				КонецЕсли;
			КонецЕсли;
			
			// 2. Поиск по дате и номеру заказа
			Если ЗаписьНайдена = Ложь Тогда			 		
				КоличествоОбязательныхОтборов = 2;
				ОбязательныеДанныеОтбораЗаполнены = Новый Массив; 				
				Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказДата) Тогда
					ОбязательныеДанныеОтбораЗаполнены.Добавить("ORDERDATE");
				КонецЕсли;	
				Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказНомер) Тогда
					ОбязательныеДанныеОтбораЗаполнены.Добавить("ORDERNUMBER");
				КонецЕсли;	
				
				// Обязательные
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("ORDERDATE"    , ЭтотОбъект.ЗаказДата);
				СтруктураОтбора.Вставить("ORDERNUMBER"  , ЭтотОбъект.ЗаказНомер);
				СтруктураОтбора.Вставить("Организация"  , ЭтотОбъект.Организация);
				СтруктураОтбора.Вставить("Контрагент"   , ЭтотОбъект.Контрагент);
				СтруктураОтбора.Вставить("ТочкаДоставки", ЭтотОбъект.ТочкаДоставки);
				Если ОбязательныеДанныеОтбораЗаполнены.Количество() = КоличествоОбязательныхОтборов Тогда 
					НаборЗаписей = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();
					Для каждого Данные Из СтруктураОтбора Цикл
						Если ЗначениеЗаполнено(Данные.Значение) Тогда
							НаборЗаписей.Отбор[Данные.Ключ].Установить(Данные.Значение);
						КонецЕсли;
					КонецЦикла;
					
					// Выполним блокировку данных
					ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, ИмяЦепочки);				 
					НаборЗаписей.Прочитать();
					Если НаборЗаписей.Количество() = 0 Тогда 
						ЗаписьНайдена = Истина;
					КонецЕсли;			
				КонецЕсли;		
			КонецЕсли;	
			
			Если ЗаписьНайдена = Истина Тогда		
				ДанныеИзмерений = Новый Структура;
				ДанныеИзмерений.Вставить("ORDRSP"       , ЭтотОбъект.Ссылка);
				ДанныеИзмерений.Вставить("Заказ"        , ДокументЗаказа);		
				ДанныеИзмерений.Вставить("Организация"  , ЭтотОбъект.Организация);
				ДанныеИзмерений.Вставить("Контрагент"   , ЭтотОбъект.Контрагент);
				ДанныеИзмерений.Вставить("ТочкаДоставки", ЭтотОбъект.ТочкаДоставки);
				ДанныеИзмерений.Вставить("ORDERDATE"    , ЭтотОбъект.ЗаказДата);
				ДанныеИзмерений.Вставить("ORDERNUMBER"  , ЭтотОбъект.ЗаказНомер);;
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("КоличествоORDRSP" , ЭтотОбъект.ТЧ_Товары.Итог("КоличествоПоставляемое"));
				ДанныеРесурсов.Вставить("СуммаORDRSP"      , ЭтотОбъект.ТЧ_Товары.Итог("Сумма_с_НДС"));
				ДанныеРесурсов.Вставить("ТекстОшибки"      , ЭтотОбъект.ТекстОшибки);
				ДанныеРесурсов.Вставить("Статус_ORDRSP"    , ПредопределенноеЗначение("Перечисление.ЭКОМ_СтатусыЭлектронныхДокументов.Получен"));
				
				// Если существует документ в регистре
				Для Каждого НоваяЗапись Из НаборЗаписей Цикл					
					ЭКОМ_ПодпискаСобытий.СформироватьЗаписьВРегистр(НоваяЗапись, ДанныеИзмерений, ДанныеРесурсов);					
				КонецЦикла;
				
				НаборЗаписей.Записать();
				
			КонецЕсли;	
		КонецЕсли;
		
		КонецЕсли;
		// DESADV входящий для сети
	ИначеЕсли ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DESADV_Входящий Тогда
		//Docrobot 1.20.0 MOD-1602
		Если ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ВыполнятьПодпискиИзНастроек_DESADV_Входящий",Ложь) = Ложь Тогда 	
	
			// Повторные документы не записываем в цепочку
			Если ЭтотОбъект.ЭтоПовторныйДокумент = Ложь Тогда		
				ИмяЦепочки = "ЭКОМ_ЦепочкиДокументовПокупателя";
				Заказ = ЭтотОбъект.Документ1С;
				ДокументНакладная = Неопределено;
				ПерваяЗапись = Неопределено;
				ORDERSP = Документы.ЭКОМ_Документы.ПустаяСсылка();
					
				Если ЭтотОбъект.ДокументыСвязанные.Количество() > 0 Тогда
					ДокументНакладная = ЭтотОбъект.ДокументыСвязанные[0].ДокументСвязанный;
				КонецЕсли;
				
				НаборЗаписей = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();      
				ЗаписьНайдена = Ложь;
				
				// 1. Ищем по накладной
				Если ЗначениеЗаполнено(ДокументНакладная) Тогда
					НаборЗаписей.Отбор.Накладная.Установить(ДокументНакладная); // поле проиндексировано
					
					// Выполним блокировку данных
					ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, ИмяЦепочки);		
					
					НаборЗаписей.Прочитать();
					Если НЕ НаборЗаписей.Количество() = 0 Тогда
						ЗаписьНайдена = Истина;
					КонецЕсли;
				КонецЕсли;
				
				
				// 2. Поиск по заказу
				Если ЗначениеЗаполнено(Заказ) И Не ЗаписьНайдена Тогда
					НаборЗаписей = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();  
					НаборЗаписей.Отбор.Заказ.Установить(Заказ); // поле проиндексировано
					
					// Выполним блокировку данных
					ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, ИмяЦепочки);		
					
					НаборЗаписей.Прочитать();
					Если НЕ НаборЗаписей.Количество() = 0 Тогда
						ПерваяЗапись = НаборЗаписей[0];
						Если Не ЗначениеЗаполнено(НаборЗаписей[0].DESADV) Тогда
							ЗаписьНайдена = Истина; // Если запись одна, значит нет разделения заказа
						КонецЕсли;
					КонецЕсли;	
				КонецЕсли;
							
				// 3. Поиск по DESADV
				Если Не ЗаписьНайдена Тогда
					НаборЗаписей = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();  
					НаборЗаписей.Отбор.DESADV.Установить(ЭтотОбъект.Ссылка); // поле проиндексировано
					
					// Выполним блокировку данных
					ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, ИмяЦепочки);		
					
					НаборЗаписей.Прочитать();
					Если НЕ НаборЗаписей.Количество() = 0 Тогда
						ЗаписьНайдена = Истина; // Если запись одна, значит нет разделения заказа
					КонецЕсли;	
				КонецЕсли;	
				
			
				Если ЗаписьНайдена Тогда			
					ДанныеИзмерений = Новый Структура;
					ДанныеИзмерений.Вставить("DESADV"       , ЭтотОбъект.Ссылка);
					ДанныеИзмерений.Вставить("Накладная"    , ДокументНакладная);
					
					ДанныеРесурсов = Новый Структура;				
					ДанныеРесурсов.Вставить("КоличествоDESADV" , ЭтотОбъект.ТЧ_Товары.Итог("КоличествоПоставляемое"));
					ДанныеРесурсов.Вставить("СуммаDESADV"      , ЭтотОбъект.ТЧ_Товары.Итог("Сумма_с_НДС"));
					ДанныеРесурсов.Вставить("ТекстОшибки"      , ЭтотОбъект.ТекстОшибки);
					ДанныеРесурсов.Вставить("Статус_DESADV"    , ПредопределенноеЗначение("Перечисление.ЭКОМ_СтатусыЭлектронныхДокументов.Получен"));
					
					// Если существует документ в регистре
					Для Каждого НоваяЗапись Из НаборЗаписей Цикл					
						ЭКОМ_ПодпискаСобытий.СформироватьЗаписьВРегистр(НоваяЗапись, ДанныеИзмерений, ДанныеРесурсов);					
					КонецЦикла;
				Иначе
					
					
					ДанныеИзмерений = Новый Структура;
					ДанныеИзмерений.Вставить("DESADV"       , ЭтотОбъект.Ссылка);
					ДанныеИзмерений.Вставить("Накладная"    , ДокументНакладная);
					ДанныеИзмерений.Вставить("Организация"  , ЭтотОбъект.Организация);
					ДанныеИзмерений.Вставить("Контрагент"   , ЭтотОбъект.Контрагент);
					ДанныеИзмерений.Вставить("ТочкаДоставки", ЭтотОбъект.ТочкаДоставки);
					ДанныеИзмерений.Вставить("ORDERDATE"    , ЭтотОбъект.ЗаказДата);
					ДанныеИзмерений.Вставить("ORDERNUMBER"  , ЭтотОбъект.ЗаказНомер);
					
					ДанныеРесурсов = Новый Структура;
					ДанныеРесурсов.Вставить("xmlОрганизация", ЭтотОбъект.xmlОрганизация);
					ДанныеРесурсов.Вставить("xmlКонтрагент", ЭтотОбъект.xmlКонтрагент);
					ДанныеРесурсов.Вставить("xmlТочкаДоставки", ЭтотОбъект.xmlТочкаДоставки);	
					ДанныеРесурсов.Вставить("КоличествоDESADV" , ЭтотОбъект.ТЧ_Товары.Итог("КоличествоПоставляемое"));
					ДанныеРесурсов.Вставить("СуммаDESADV"      , ЭтотОбъект.ТЧ_Товары.Итог("Сумма_с_НДС"));
					ДанныеРесурсов.Вставить("ТекстОшибки"      , ЭтотОбъект.ТекстОшибки);
					ДанныеРесурсов.Вставить("Статус_DESADV"    , ПредопределенноеЗначение("Перечисление.ЭКОМ_СтатусыЭлектронныхДокументов.Получен"));
					
					Если ПерваяЗапись<>Неопределено Тогда
						
						ДанныеИзмерений.Вставить("Заказ"        ,   ПерваяЗапись.Заказ);	
						ДанныеИзмерений.Вставить("ORDRSP"       , ПерваяЗапись.ORDRSP); //Docrobot 1.19.0 MOD-1493 [Ошибка выявлена в рамках другой задачи. Было ПерваяЗапись.ORDERSP стало ПерваяЗапись.ORDRSP]
						
						ДанныеРесурсов.Вставить("КоличествоЗаказ"  , ПерваяЗапись.КоличествоЗаказ);
						ДанныеРесурсов.Вставить("СуммаЗаказ"       , ПерваяЗапись.СуммаЗаказ);	
						ДанныеРесурсов.Вставить("Статус_ORDER"    , ПерваяЗапись.Статус_ORDER);	
						
						ДанныеРесурсов.Вставить("КоличествоORDRSP" , ПерваяЗапись.КоличествоORDRSP);
						ДанныеРесурсов.Вставить("СуммаORDRSP"      , ПерваяЗапись.СуммаORDRSP);
						ДанныеРесурсов.Вставить("Статус_ORDRSP"    , ПерваяЗапись.Статус_ORDRSP);	
						
					КонецЕсли;	
					
					
					ЭКОМ_ПодпискаСобытий.СформироватьЗаписьВРегистр(НаборЗаписей.Добавить(), ДанныеИзмерений, ДанныеРесурсов);
					
					
				КонецЕсли;	
				
				НаборЗаписей.Записать();
			КонецЕсли;	

		КонецЕсли;
		// RETANN входящий для поставщика
	ИначеЕсли ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.RETANN_Входящий Тогда
		//Docrobot 1.20.0 MOD-1602
		Если ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ВыполнятьПодпискиИзНастроек_RETANN_Входящий",Ложь) = Ложь Тогда 	
			
			Если ЭтотОбъект.ДокументыСвязанные.Количество() > 0 Тогда
				ДокументПоиска = ЭтотОбъект.ДокументыСвязанные[0].ДокументСвязанный;
			Иначе
				ДокументПоиска = Неопределено;
			КонецЕсли;

			НайденныеЗаписи = ПолучитьНаборЗаписейПоОтбору(ДокументПоиска, "Накладная", "ЭКОМ_ЦепочкиДокументовПоставщика");
			Если НайденныеЗаписи.Получены Тогда
				ДанныеИзмерений = Новый Структура;
				ДанныеИзмерений.Вставить("RETANN"       , ЭтотОбъект.Ссылка);
				ДанныеИзмерений.Вставить("Накладная"    , ДокументНакладная);			
				ДанныеИзмерений.Вставить("Организация"  , ЭтотОбъект.Организация);
				ДанныеИзмерений.Вставить("Контрагент"   , ЭтотОбъект.Контрагент);
				ДанныеИзмерений.Вставить("ТочкаДоставки", ЭтотОбъект.ТочкаДоставки);
				ДанныеИзмерений.Вставить("ORDERDATE"    , ЭтотОбъект.ЗаказДата);
				ДанныеИзмерений.Вставить("ORDERNUMBER"  , ЭтотОбъект.ЗаказНомер);
				ДанныеИзмерений.Вставить("Заказ"        , ЭтотОбъект.Документ1С);
				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("КоличествоRETANN" , ЭтотОбъект.ТЧ_Товары.Итог("КоличествоПринятое"));
				ДанныеРесурсов.Вставить("СуммаRETANN"      , ЭтотОбъект.ТЧ_Товары.Итог("Сумма_с_НДС"));
				ДанныеРесурсов.Вставить("ТекстОшибки"      , ЭтотОбъект.ТекстОшибки);
				ДанныеРесурсов.Вставить("Статус_RETANN"    , Истина);
				
				// Если существует документ в регистре
				Для Каждого НоваяЗапись Из НайденныеЗаписи.Записи Цикл					
					ЭКОМ_ПодпискаСобытий.СформироватьЗаписьВРегистр(НоваяЗапись, ДанныеИзмерений, ДанныеРесурсов);					
				КонецЦикла;
				
				НайденныеЗаписи.Записи.Записать();												
			КонецЕсли;
			
		КонецЕсли;	
		// УПД входящий для сети
	ИначеЕсли ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPR_01
		ИЛИ ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPRMARK_01 
		ИЛИ ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPRPROS_01 Тогда
		//Docrobot 1.20.0 MOD-1602
		Если ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ВыполнятьПодпискиИзНастроек_ЮЗД_Входящий",Ложь) = Ложь Тогда
			
			ИмяЦепочки = "ЭКОМ_ЦепочкиДокументовПокупателя";
					
			// Записываем документ первый раз - для этого нужно найти цепочку
			ЗаписьНайдена = Ложь;
			
			ДокументНакладная = Неопределено;
			Если ЭтотОбъект.ДокументыСвязанные.Количество() > 0 Тогда
				ДокументНакладная = ЭтотОбъект.ДокументыСвязанные[0].ДокументСвязанный;
			КонецЕсли;
			
			// * Поиск по накладной для ЭДО
			Если ЗначениеЗаполнено(ДокументНакладная) тогда
				
				НаборЗаписей = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Накладная.Установить(ДокументНакладная); // поле проиндексировано
				// Выполним блокировку данных
				ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, ИмяЦепочки);		
				
				НаборЗаписей.Прочитать();
				Если НЕ НаборЗаписей.Количество() = 0 Тогда
					ЗаписьНайдена = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			
			// * Поиск по номеру и дате накладной для ЭДО 
			Если ЗаписьНайдена = Ложь И (ЗначениеЗаполнено(ЭтотОбъект.НакладнаяНомер)) Тогда			 								
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЭкомДокDESADV.Ссылка КАК Ссылка
				|ИЗ
				|	(ВЫБРАТЬ
				|		ЭКОМ_Документы.Ссылка КАК Ссылка
				|	ИЗ
				|		Документ.ЭКОМ_Документы КАК ЭКОМ_Документы
				|	ГДЕ
				|		ЭКОМ_Документы.НакладнаяДата = &НакладнаяДата
				|		И ЭКОМ_Документы.НакладнаяНомер = &НакладнаяНомер
				|		И ЭКОМ_Документы.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.DESADV_Входящий)
				|		И НЕ ЭКОМ_Документы.ПометкаУдаления) КАК ЭкомДокDESADV
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭКОМ_ЦепочкиДокументовПокупателя КАК ЭКОМ_ЦепочкиДокументовПокупателя
				|		ПО ЭкомДокDESADV.Ссылка = ЭКОМ_ЦепочкиДокументовПокупателя.DESADV";
				
				Запрос.УстановитьПараметр("НакладнаяДата" , ЭтотОбъект.НакладнаяДата);
				Запрос.УстановитьПараметр("НакладнаяНомер", ЭтотОбъект.НакладнаяНомер);
				
				РезультатЗапроса = Запрос.Выполнить();				
				Если НЕ РезультатЗапроса.Пустой() Тогда
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();				
					ВыборкаДетальныеЗаписи.Следующий();
					
					НаборЗаписей = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.DESADV.Установить(ВыборкаДетальныеЗаписи.Ссылка); // поле проиндексировано
					// Выполним блокировку данных
					ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, ИмяЦепочки);		
					
					НаборЗаписей.Прочитать();
					Если НЕ НаборЗаписей.Количество() = 0 Тогда
						ЗаписьНайдена = Истина;
					КонецЕсли;
				КонецЕсли;			
				
			КонецЕсли;
			
			
			// * Поиск по текущему документу
			Если ЗаписьНайдена = Ложь Тогда
				НаборЗаписей = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ЮЗД.Установить(ЭтотОбъект.Ссылка); // поле проиндексировано
				// Выполним блокировку данных
				ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, ИмяЦепочки);				 
				НаборЗаписей.Прочитать();
				Если НЕ НаборЗаписей.Количество() = 0 Тогда
					ЗаписьНайдена = Истина;
				КонецЕсли;
			КонецЕсли;
			
			
			ДанныеИзмерений = Новый Структура;
			ДанныеИзмерений.Вставить("ЮЗД"          , ЭтотОбъект.Ссылка);	
			ДанныеИзмерений.Вставить("Организация"  , ЭтотОбъект.Организация);
			ДанныеИзмерений.Вставить("Контрагент"   , ЭтотОбъект.Контрагент);
			ДанныеИзмерений.Вставить("ТочкаДоставки", ЭтотОбъект.ТочкаДоставки);
			ДанныеИзмерений.Вставить("СЧФ"          , ЭтотОбъект.Документ1С);
			ДанныеИзмерений.Вставить("Накладная"    , ДокументНакладная);
			
			ДанныеРесурсов = Новый Структура;
			ДанныеРесурсов.Вставить("xmlОрганизация"  , ЭтотОбъект.xmlОрганизация);
			ДанныеРесурсов.Вставить("xmlКонтрагент"   , ЭтотОбъект.xmlКонтрагент);
			ДанныеРесурсов.Вставить("xmlТочкаДоставки", ЭтотОбъект.xmlТочкаДоставки);
			ДанныеРесурсов.Вставить("СуммаСЧФ"        , ЭтотОбъект.ТЧ_Товары.Итог("Сумма_с_НДС"));
			ДанныеРесурсов.Вставить("ТекстОшибки"      , ЭтотОбъект.ТекстОшибки);
			
			Если ЗаписьНайдена = Ложь Тогда
				
				ДанныеИзмерений.Вставить("ORDERDATE"    , ЭтотОбъект.СЧФДата);
				ДанныеИзмерений.Вставить("ORDERNUMBER"  , ЭтотОбъект.СЧФНомер); 
				ДанныеРесурсов.Вставить("КоличествоКвитанций", 0);
				
				ЭКОМ_ПодпискаСобытий.СформироватьЗаписьВРегистр(НаборЗаписей.Добавить(), ДанныеИзмерений, ДанныеРесурсов);
				
			Иначе
				// Если существует документ в регистре
				Для Каждого НоваяЗапись Из НаборЗаписей Цикл
					
					// Если данные уже были заполнены тогда не перезаполняем 
					Если ЗначениеЗаполнено(НоваяЗапись.xmlОрганизация) Тогда
						ДанныеРесурсов.Удалить("xmlОрганизация");
					КонецЕсли;
					Если ЗначениеЗаполнено(НоваяЗапись.xmlКонтрагент) Тогда
						ДанныеРесурсов.Удалить("xmlКонтрагент");
					КонецЕсли;
					Если ЗначениеЗаполнено(НоваяЗапись.xmlТочкаДоставки) Тогда
						ДанныеРесурсов.Удалить("xmlТочкаДоставки");
					КонецЕсли;
					
					ЭКОМ_ПодпискаСобытий.СформироватьЗаписьВРегистр(НоваяЗапись, ДанныеИзмерений, ДанныеРесурсов);					
				КонецЦикла;			
			КонецЕсли;		
			НаборЗаписей.Записать();	
		
			////Удаляем дубли несопопоставленных цепочек при нахождении поступления
			//Если ЗначениеЗаполнено(ДокументНакладная) Тогда	
			//	НаборДублей = РегистрыСведений.ЭКОМ_ЦепочкиДокументовПокупателя.СоздатьНаборЗаписей();
			//	НаборДублей.Отбор.ЮЗД.Установить(ЭтотОбъект.Ссылка); // поле проиндексировано	 
			//	НаборДублей.Отбор.Накладная.Установить(Неопределено); 
			//	НаборДублей.Записать();
			//КонецЕсли;
		КонецЕсли;
																
	// УКД, иУПД входящий для сети
	ИначеЕсли ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPR_01_Испр 
		ИЛИ ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPRMARK_01_Испр
		ИЛИ ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPRPROS_01_Испр
		ИЛИ ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_KORSCHFDOPPR_01 
		ИЛИ ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_KORSCHFDOPPR_01_Испр
		ИЛИ ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPR_01
		ИЛИ ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPRMARK_01
		ИЛИ ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPRPROS_01
		ИЛИ ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPR_01_Испр
		ИЛИ ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPRMARK_01_Испр
		ИЛИ ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPRPROS_01_Испр Тогда
		
		//Docrobot 1.20.0 MOD-1602
		Если ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ВыполнятьПодпискиИзНастроек_ЮЗД_Входящий",Ложь) = Ложь Тогда
			
			ИмяЦепочки = "ЭКОМ_ЦепочкиДокументовПокупателя";
			
		    // Записываем документ первый раз - для этого нужно найти цепочку
			ЗаписьНайдена = Ложь;
			СуммаОснованияСЧФ = 0;
			
			// * Поиск по текущему документу
			НаборЗаписей = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ЮЗД.Установить(ЭтотОбъект.Ссылка); // поле проиндексировано
			// Выполним блокировку данных
			ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, ИмяЦепочки);				 
			НаборЗаписей.Прочитать();
			Если НЕ НаборЗаписей.Количество() = 0 Тогда
				ЗаписьНайдена = Истина;
			КонецЕсли;
			
			ДокументНакладная = Неопределено;
			ДокументОснованиеЭКОМ = Неопределено;
			Если ЭтотОбъект.ДокументыСвязанные.Количество() > 0 Тогда
				Для каждого СтрДокумента Из ЭтотОбъект.ДокументыСвязанные Цикл
					Если ТипЗнч(СтрДокумента.ДокументСвязанный) = Тип("ДокументСсылка.ЭКОМ_Документы") Тогда
						ДокументОснованиеЭКОМ = СтрДокумента.ДокументСвязанный;
						СуммаОснованияСЧФ = ДокументОснованиеЭКОМ.ТЧ_Товары.Итог("Сумма_с_НДС");
					Иначе
						ДокументНакладная = СтрДокумента.ДокументСвязанный;
					КонецЕсли;		    
				КонецЦикла;
			КонецЕсли;
			
			// * Поиск по номеру и дате первоначальной счет-фактуре в документе при загрузке
			Если ЗаписьНайдена = Ложь 
				И ЗначениеЗаполнено(ДокументОснованиеЭКОМ) Тогда
				НаборЗаписейПоОснованию = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();
				НаборЗаписейПоОснованию.Отбор.ЮЗД.Установить(ДокументОснованиеЭКОМ); // поле проиндексировано
				// Выполним блокировку данных
				ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписейПоОснованию.Отбор, ИмяЦепочки);		
				
				НаборЗаписейПоОснованию.Прочитать();
				Если НЕ НаборЗаписейПоОснованию.Количество() = 0 Тогда
					Для каждого ЗаписьПоОснованию Из НаборЗаписейПоОснованию Цикл
						НоваяЗапись = НаборЗаписей.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяЗапись, ЗаписьПоОснованию);
						НоваяЗапись.КоличествоКвитанций = 0;
						
						// Запись документа основания
						НоваяЗапись.ЮЗД_Основание = ДокументОснованиеЭКОМ;
						НоваяЗапись.ИдентификаторСчФ_Основание = ДокументОснованиеЭКОМ.НомерТранзакции;
						
						// Меняем статусы
						НоваяЗапись.СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ПустаяСсылка();	 
						
					КонецЦикла;
					ЗаписьНайдена = Истина;
				КонецЕсли;
			КонецЕсли;
			
			// * Поиск по номеру и дате первоначальной счет-фактуре
			Если ЗаписьНайдена = Ложь Тогда
				
				ВидыДокументовЮЗД = Новый Массив;
				ЭКОМ_ОбщегоНазначения.ПолучитьПервичныеВидыДокументовЮЗД(ВидыДокументовЮЗД);
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЭкомДокЮЗД.Ссылка КАК ЭКОМДокОснование,
				|	ЭКОМ_ЦепочкиДокументовПокупателя.Накладная КАК Накладная
				|ИЗ
				|	(ВЫБРАТЬ
				|		ЭКОМ_Документы.Ссылка КАК Ссылка
				|	ИЗ
				|		Документ.ЭКОМ_Документы КАК ЭКОМ_Документы
				|	ГДЕ
				|		ЭКОМ_Документы.СЧФДата = &СЧФДата
				|		И ЭКОМ_Документы.СЧФНомер = &СЧФНомер
				|		И ЭКОМ_Документы.ВидДокумента В(&ВидыДокументовЮЗД)) КАК ЭкомДокЮЗД
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭКОМ_ЦепочкиДокументовПокупателя КАК ЭКОМ_ЦепочкиДокументовПокупателя
				|		ПО ЭкомДокЮЗД.Ссылка = ЭКОМ_ЦепочкиДокументовПокупателя.ЮЗД";
				
				Запрос.УстановитьПараметр("СЧФДата" , ЭтотОбъект.СЧФДата);
				Запрос.УстановитьПараметр("СЧФНомер", ЭтотОбъект.СЧФНомер);
				Запрос.УстановитьПараметр("ВидыДокументовЮЗД", ВидыДокументовЮЗД);
				
				РезультатЗапроса = Запрос.Выполнить();				
				Если НЕ РезультатЗапроса.Пустой() Тогда
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();				
					ВыборкаДетальныеЗаписи.Следующий();
					
					НаборЗаписейПоОснованию = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();
					НаборЗаписейПоОснованию.Отбор.ЮЗД.Установить(ВыборкаДетальныеЗаписи.ЭКОМДокОснование); // поле проиндексировано
					// Выполним блокировку данных
					ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписейПоОснованию.Отбор, ИмяЦепочки);		
					
					НаборЗаписейПоОснованию.Прочитать();
					Если НЕ НаборЗаписейПоОснованию.Количество() = 0 Тогда
						Для каждого ЗаписьПоОснованию Из НаборЗаписейПоОснованию Цикл
							НоваяЗапись = НаборЗаписей.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяЗапись, ЗаписьПоОснованию);
							НоваяЗапись.КоличествоКвитанций = 0;
							
							// Запись документа основания
							НоваяЗапись.ЮЗД_Основание = ВыборкаДетальныеЗаписи.ЭКОМДокОснование;
							
							// Меняем статусы
							НоваяЗапись.СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ПустаяСсылка();
							
						КонецЦикла;
						ЗаписьНайдена = Истина;
					КонецЕсли;
				КонецЕсли;		
			КонецЕсли;
			
			
			ДанныеИзмерений = Новый Структура;
			ДанныеИзмерений.Вставить("ЮЗД"          , ЭтотОбъект.Ссылка);	
			ДанныеИзмерений.Вставить("Организация"  , ЭтотОбъект.Организация);
			ДанныеИзмерений.Вставить("Контрагент"   , ЭтотОбъект.Контрагент);
			ДанныеИзмерений.Вставить("ТочкаДоставки", ЭтотОбъект.ТочкаДоставки);
			ДанныеИзмерений.Вставить("СЧФ"          , ЭтотОбъект.Документ1С);
			ДанныеИзмерений.Вставить("Накладная"    , ДокументНакладная);
				
			ДанныеРесурсов = Новый Структура;
			ДанныеРесурсов.Вставить("СуммаСЧФ"      , ЭтотОбъект.ТЧ_Товары.Итог("Сумма_с_НДС"));
			ДанныеРесурсов.Вставить("ТекстОшибки"   , ЭтотОбъект.ТекстОшибки);
			
			Если ЗаписьНайдена = Ложь Тогда	
				
				// Записываем документ в первый раз
				ДанныеИзмерений.Вставить("ORDERDATE"    , ЭтотОбъект.СЧФДата);
				ДанныеИзмерений.Вставить("ORDERNUMBER"  , ЭтотОбъект.СЧФНомер);
				
				ДанныеРесурсов.Вставить("xmlОрганизация"  ,    ЭтотОбъект.xmlОрганизация);
				ДанныеРесурсов.Вставить("xmlКонтрагент"   ,    ЭтотОбъект.xmlКонтрагент);
				ДанныеРесурсов.Вставить("xmlТочкаДоставки",    ЭтотОбъект.xmlТочкаДоставки);
				ДанныеРесурсов.Вставить("КоличествоКвитанций", 0);
				
					
				ЭКОМ_ПодпискаСобытий.СформироватьЗаписьВРегистр(НаборЗаписей.Добавить(), ДанныеИзмерений, ДанныеРесурсов);
				
			Иначе
				// Если существует документ в регистре
				Для Каждого НоваяЗапись Из НаборЗаписей Цикл
					
					// Если данные уже были заполнены тогда не перезаполняем 
					Если ЗначениеЗаполнено(НоваяЗапись.xmlОрганизация) Тогда
						ДанныеРесурсов.Удалить("xmlОрганизация");
					КонецЕсли;
					Если ЗначениеЗаполнено(НоваяЗапись.xmlКонтрагент) Тогда
						ДанныеРесурсов.Удалить("xmlКонтрагент");
					КонецЕсли;
					Если ЗначениеЗаполнено(НоваяЗапись.xmlТочкаДоставки) Тогда
						ДанныеРесурсов.Удалить("xmlТочкаДоставки");
					КонецЕсли;
					
					ЭКОМ_ПодпискаСобытий.СформироватьЗаписьВРегистр(НоваяЗапись, ДанныеИзмерений, ДанныеРесурсов);					
				КонецЦикла;			
			КонецЕсли;		
			НаборЗаписей.Записать();														
		КонецЕсли;
		
    // Получатель - входящий ЭКОМ документ WHGOU_04_Входящий
	ИначеЕсли ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.WHGOU_04_Входящий Тогда
		ИмяЦепочки = "ЭКОМ_ЦепочкиДокументовЭТРН";
		
		НаборЗаписей = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументЭКОМ.Установить(ЭтотОбъект.Ссылка);
		
		ДанныеИзмерений = Новый Структура;
		ДанныеИзмерений.Вставить("ДокументЭКОМ"  , ЭтотОбъект.Ссылка);
		ДанныеИзмерений.Вставить("ИдФайлПервичн" , ЭтотОбъект.НомерТранзакции);
		ДанныеИзмерений.Вставить("ДатаЭТРН"      , ЭтотОбъект.ФайлДата);
		ДанныеИзмерений.Вставить("НомерЭТРН"     , ЭтотОбъект.ФайлНомер);		
		ДанныеИзмерений.Вставить("Организация"   , ЭтотОбъект.Организация);
		ДанныеИзмерений.Вставить("Контрагент"    , ЭтотОбъект.Контрагент);
		ДанныеИзмерений.Вставить("Перевозчик"    , ЭтотОбъект.ТочкаДоставки);
		ДанныеИзмерений.Вставить("Накладная"     , ЭтотОбъект.Документ1С);
		
		ДанныеРесурсов = Новый Структура;
		ДанныеРесурсов.Вставить("xmlОрганизация"        , ЭтотОбъект.xmlОрганизация);
		ДанныеРесурсов.Вставить("xmlКонтрагент"         , ЭтотОбъект.xmlКонтрагент);
		ДанныеРесурсов.Вставить("xmlТочкаДоставки"      , ЭтотОбъект.xmlТочкаДоставки);
		ДанныеРесурсов.Вставить("КоличествоORDER"       , ЭтотОбъект.ТЧ_Товары.Итог("КоличествоЗаказанное"));
		ДанныеРесурсов.Вставить("КоличествоГрузовыхМест", ЭтотОбъект.ТЧ_Товары.Итог("КоличествоПоставляемое"));
		ДанныеРесурсов.Вставить("Статус_WHGOU_04"       , Истина);
		ДанныеРесурсов.Вставить("ТекстОшибки"           , ЭтотОбъект.ТекстОшибки);
		
		//Выполним блокировку данных
		ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, ИмяЦепочки);
		
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда										
			// Записываем документ в первый раз
			
			НаборЗаписей = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();
			Для каждого Данные Из ДанныеИзмерений Цикл
				Если ЗначениеЗаполнено(Данные.Значение) Тогда
					НаборЗаписей.Отбор[Данные.Ключ].Установить(Данные.Значение);
				КонецЕсли;
			КонецЦикла;
			// Выполним блокировку данных
			ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, ИмяЦепочки);				 
			НаборЗаписей.Прочитать();
			
			ЭКОМ_ПодпискаСобытий.СформироватьЗаписьВРегистр(НаборЗаписей.Добавить(), ДанныеИзмерений, ДанныеРесурсов);
			
		Иначе													
			// Если существует документ в регистре
			Для Каждого НоваяЗапись Из НаборЗаписей Цикл					
				ЭКОМ_ПодпискаСобытий.СформироватьЗаписьВРегистр(НоваяЗапись, ДанныеИзмерений, ДанныеРесурсов);					
			КонецЦикла;
			
		КонецЕсли;		
		НаборЗаписей.Записать();	
		
		// CONDRA 
	ИначеЕсли ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.CONDRA_Входящий Тогда
		ИмяЦепочки = "ЭКОМ_ЦепочкиНеструктурированныхДокументов";
		
		МенеджерЗаписи = РегистрыСведений[ИмяЦепочки].СоздатьМенеджерЗаписи();
		МенеджерЗаписи.TRANSGUID = ЭтотОбъект.TRANSGUID;
		МенеджерЗаписи.Прочитать();
		
		Если НЕ МенеджерЗаписи.Выбран() Тогда // Новая запись
			МенеджерЗаписи.НаправлениеОбмена = Перечисления.ЭКОМ_НаправлениеОбмена.Входящий;
			МенеджерЗаписи.TRANSGUID		= ЭтотОбъект.TRANSGUID;
			МенеджерЗаписи.NUMBER			= ЭтотОбъект.ФайлНомер;
			МенеджерЗаписи.DATE				= ЭтотОбъект.ФайлДата;
			МенеджерЗаписи.DOCGUID			= ЭтотОбъект.DOCGUID;
			МенеджерЗаписи.DOCTYPE			= ЭтотОбъект.ТипДокумента;
			МенеджерЗаписи.ТипДокумента		= ЭтотОбъект.ТипДокументаCONDRA; 
			
			Разделитель = ЭКОМ_ОбщегоНазначения.ЭКОМ_Общее_ПолучитьРазделительПутиНаСервере();
			FILENAME = ЭтотОбъект.ИмяФайла;
			Позиция = 1;
			Пока Позиция > 0 Цикл 
				Позиция = Найти(FILENAME, Разделитель);  
				FILENAME = Сред(FILENAME, Позиция+1);
			КонецЦикла;         
			
			МенеджерЗаписи.FILENAME			= FILENAME;
			МенеджерЗаписи.xmlКонтрагент	= ЭтотОбъект.xmlКонтрагент;
			МенеджерЗаписи.Контрагент		= ЭтотОбъект.Контрагент;
			МенеджерЗаписи.xmlОрганизация 	= ЭтотОбъект.xmlОрганизация;
			МенеджерЗаписи.Организация		= ЭтотОбъект.Организация;
			МенеджерЗаписи.Сумма			= ЭтотОбъект.СуммаДокументаВсего;
			МенеджерЗаписи.CONTRACTNUMBER	= ЭтотОбъект.НомерДоговораНаПоставку;
			//Docrobot Сергей 
			МенеджерЗаписи.СрокПодписания	= ЭтотОбъект.СрокПодписания;
			//Docrobot Сергей
			
			Статус = Перечисления.ЭКОМ_СтатусыCONDRA.Получен;
			МенеджерЗаписи.ДокументОригинала = ЭтотОбъект.Ссылка;
		КонецЕсли;
		
		МенеджерЗаписи.ТекстОшибки 				= ЭтотОбъект.ТекстОшибки;
		МенеджерЗаписи.ДатаПоследнейТранзакции	= ЭтотОбъект.ДатаПринятияДокумента;
		
		Если ЭтотОбъект.Тип = "1" Тогда
			Статус = Перечисления.ЭКОМ_СтатусыCONDRA.Получен;
			МенеджерЗаписи.ДокументОригинала 	= ЭтотОбъект.Ссылка;
		ИначеЕсли ЭтотОбъект.Тип = "2" Тогда
			Статус = Перечисления.ЭКОМ_СтатусыCONDRA.Принят;
			МенеджерЗаписи.ДокументПринятия		= ЭтотОбъект.Ссылка;
		ИначеЕсли ЭтотОбъект.Тип = "3" Тогда
			Статус = Перечисления.ЭКОМ_СтатусыCONDRA.Отклонён;
			МенеджерЗаписи.ДокументОтклонения 	= ЭтотОбъект.Ссылка;
		ИначеЕсли ЭтотОбъект.Тип = "4" Тогда
			Статус = Перечисления.ЭКОМ_СтатусыCONDRA.Отозван;
			МенеджерЗаписи.ДокументОтзыва 		= ЭтотОбъект.Ссылка;
		КонецЕсли;
		
		МенеджерЗаписи.Статус = Статус;
		
		Если ЗначениеЗаполнено(Статус) Тогда
			МенеджерЗаписи.Действие = Перечисления.ЭКОМ_ТребуемоеДействиеCONDRA[Строка(Статус)];
		КонецЕсли;
		
		Если (МенеджерЗаписи.ДокументОригинала.Пустая() ИЛИ МенеджерЗаписи.ДокументОригинала.ПометкаУдаления)
			И (МенеджерЗаписи.ДокументПринятия.Пустая() ИЛИ МенеджерЗаписи.ДокументПринятия.ПометкаУдаления)
			И (МенеджерЗаписи.ДокументОтклонения.Пустая() ИЛИ МенеджерЗаписи.ДокументОтклонения.ПометкаУдаления)
			И (МенеджерЗаписи.ДокументОтзыва.Пустая() ИЛИ МенеджерЗаписи.ДокументОтзыва.ПометкаУдаления) Тогда
			// Удаляем запись если все документы цепочки помечены на удаление или отсутствуют.
			МенеджерЗаписи.Удалить();
		Иначе
			МенеджерЗаписи.Записать();
		КонецЕсли;
		
		// Прайс-Лист
	ИначеЕсли ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.PRICAT_Исходящий
		ИЛИ ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.PRICAT_Входящий Тогда 
		ИзменитьСтатусСобытияПоДокументуПрайсЛист();
		
		// RETINS входящий
	ИначеЕсли ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.RETINS_Входящий Тогда
		//Docrobot 1.20.0 MOD-1602
		Если ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ВыполнятьПодпискиИзНастроек_RETINS_Входящий",Ложь) = Ложь Тогда 	

			НайденныеЗаписи = ПолучитьНаборЗаписейПоОтбору(ЭтотОбъект.Документ1С, "ВозвратнаяНакладная", "ЭКОМ_ЦепочкиДокументовПокупателя");
			Если НайденныеЗаписи.Получены Тогда
			ДанныеИзмерений = Новый Структура;
			ДанныеИзмерений.Вставить("RETINS"       , ЭтотОбъект.Ссылка);
			ДанныеИзмерений.Вставить("Организация"  , ЭтотОбъект.Организация);
			ДанныеИзмерений.Вставить("Контрагент"   , ЭтотОбъект.Контрагент);
			ДанныеИзмерений.Вставить("ТочкаДоставки", ЭтотОбъект.ТочкаДоставки);
			ДанныеИзмерений.Вставить("ORDERDATE"    , ЭтотОбъект.ЗаказДата);
			ДанныеИзмерений.Вставить("ORDERNUMBER"  , ЭтотОбъект.ЗаказНомер);
			
			ДанныеРесурсов = Новый Структура;
			ДанныеРесурсов.Вставить("КоличествоRETINS" , ЭтотОбъект.ТЧ_Товары.Итог("КоличествоПринятое"));
			ДанныеРесурсов.Вставить("СуммаRETINS"      , ЭтотОбъект.ТЧ_Товары.Итог("Сумма_с_НДС"));
			ДанныеРесурсов.Вставить("ТекстОшибки"      , ЭтотОбъект.ТекстОшибки);
			ДанныеРесурсов.Вставить("Статус_RETINS"    , Истина);
			
			Для Каждого НоваяЗапись Из НайденныеЗаписи.Записи Цикл					
				ЭКОМ_ПодпискаСобытий.СформироватьЗаписьВРегистр(НоваяЗапись, ДанныеИзмерений, ДанныеРесурсов);					
			КонецЦикла;
			
			НайденныеЗаписи.Записи.Записать();												
		КонецЕсли;  		

		КонецЕсли;
		
		//RETORD_Исходящий
	ИначеЕсли ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.RETORD_Исходящий Тогда
		
		Если Не ЗначениеЗаполнено(ЭтотОбъект.СвязанныйDocrobotДокумент) Тогда
			//и не заполнено поле ордер
			
			ИмяЦепочки = "ЭКОМ_ЦепочкиДокументовПоставщика";
			
			ЗаписьНайдена = Ложь;
			
			// 1. Поиск по текущему документу
			НаборЗаписей = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ORDER.Установить(ЭтотОбъект.Ссылка); // поле проиндексировано
			// Выполним блокировку данных
			ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, ИмяЦепочки);				 
			НаборЗаписей.Прочитать();
			Если НЕ НаборЗаписей.Количество() = 0 Тогда
				ЗаписьНайдена = Истина;
			КонецЕсли;
			
			ДанныеИзмерений = Новый Структура;
			ДанныеИзмерений.Вставить("ORDER"        , ЭтотОбъект.Ссылка);
			ДанныеИзмерений.Вставить("ТочкаДоставки", ЭтотОбъект.ТочкаДоставки);
			
			Если НЕ ЗаписьНайдена Тогда // Только для первичного документа, далее не меняем.
				ДанныеИзмерений.Вставить("ORDERDATE"    , ЭтотОбъект.Дата);
				ДанныеИзмерений.Вставить("ORDERNUMBER"  , ЭтотОбъект.Номер);
				ДанныеИзмерений.Вставить("Организация"  , ЭтотОбъект.Организация);
				ДанныеИзмерений.Вставить("Контрагент"   , ЭтотОбъект.Контрагент);
			КонецЕсли;
			
			ДанныеРесурсов = Новый Структура;
			ДанныеРесурсов.Вставить("xmlОрганизация"  , ЭтотОбъект.xmlОрганизация);
			ДанныеРесурсов.Вставить("xmlКонтрагент"   , ЭтотОбъект.xmlКонтрагент);
			ДанныеРесурсов.Вставить("xmlТочкаДоставки", ЭтотОбъект.xmlТочкаДоставки);
			ДанныеРесурсов.Вставить("ДатаПоставки"    , ЭтотОбъект.ДатаПоставки);
			ДанныеРесурсов.Вставить("КоличествоORDER" , ЭтотОбъект.ТЧ_Товары.Итог("КоличествоЗаказанное"));
			ДанныеРесурсов.Вставить("СуммаORDER"      , ЭтотОбъект.ТЧ_Товары.Итог("Сумма_с_НДС"));
			ДанныеРесурсов.Вставить("ТекстОшибки"     , ЭтотОбъект.ТекстОшибки);
			//ДанныеРесурсов.Вставить("Статус_ORDER"    , ПредопределенноеЗначение("Перечисление.ЭКОМ_СтатусыЭлектронныхДокументов.Получен"));
			
			Если ЗаписьНайдена Тогда // Если существует документ в регистре
				Для Каждого НоваяЗапись Из НаборЗаписей Цикл
					
					Если НЕ ЗначениеЗаполнено(НоваяЗапись.Контрагент) Тогда
						ДанныеИзмерений.Вставить("Контрагент"   , ЭтотОбъект.Контрагент);
					КонецЕсли;
					
					Если НЕ ЗначениеЗаполнено(НоваяЗапись.Организация) Тогда
						ДанныеИзмерений.Вставить("Организация"  , ЭтотОбъект.Организация);
					КонецЕсли;
					
					ЭКОМ_ПодпискаСобытий.СформироватьЗаписьВРегистр(НоваяЗапись, ДанныеИзмерений, ДанныеРесурсов);					
				КонецЦикла;
			Иначе // Записываем документ в первый раз
				
				НаборЗаписей = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();
				Для каждого Данные Из ДанныеИзмерений Цикл
					Если ЗначениеЗаполнено(Данные.Значение) Тогда
						НаборЗаписей.Отбор[Данные.Ключ].Установить(Данные.Значение);
					КонецЕсли;
				КонецЦикла;
				// Выполним блокировку данных
				ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, ИмяЦепочки);				 
				НаборЗаписей.Прочитать();
				
				ЭКОМ_ПодпискаСобытий.СформироватьЗаписьВРегистр(НаборЗаписей.Добавить(), ДанныеИзмерений, ДанныеРесурсов);				
			КонецЕсли;
			
			Если НаборЗаписей.Модифицированность() Тогда
				НаборЗаписей.Записать();
			КонецЕсли;
		Конецесли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьСтатусСобытияПоДокументуПрайсЛист()
	
	Запрос = Новый Запрос;
	Если ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.PRICAT_Исходящий 
		И НЕ ЭтотОбъект.УточнениеОПоставке = "9" Тогда				
		// Исходящий ответ на входящий прайс-лист
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭКОМ_ДокументыВхПрайс.Ссылка,
		|	ЭКОМ_ДокументыВхПрайс.ВидДокумента,
		|	ВЫБОР
		|		КОГДА ЭКОМ_ДокументыИсхОтвет.УточнениеОПоставке = ""99""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЭКОМ_Статусы.ОтклоненПолностью)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ЭКОМ_Статусы.Подтвержден)
		|	КОНЕЦ КАК Статус
		|ИЗ
		|	Документ.ЭКОМ_Документы КАК ЭКОМ_ДокументыИсхОтвет
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭКОМ_Документы КАК ЭКОМ_ДокументыВхПрайс
		|		ПО ЭКОМ_ДокументыИсхОтвет.ФайлДата = ЭКОМ_ДокументыВхПрайс.ФайлДата
		|			И ЭКОМ_ДокументыИсхОтвет.ФайлНомер = ЭКОМ_ДокументыВхПрайс.ФайлНомер
		|			И (ЭКОМ_ДокументыВхПрайс.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.PRICAT_Входящий))
		|ГДЕ
		|	ЭКОМ_ДокументыИсхОтвет.Ссылка = &Ссылка";
		
	ИначеЕсли ЭтотОбъект.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.PRICAT_Входящий 
		И НЕ ЭтотОбъект.УточнениеОПоставке = "9" Тогда	
		// Входящий ответ на исходящий прайс-лист		
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭКОМ_ДокументыИсхПрайс.Ссылка,
		|	ЭКОМ_ДокументыИсхПрайс.ВидДокумента,
		|	ВЫБОР
		|		КОГДА ЭКОМ_ДокументыВхОтвет.УточнениеОПоставке = ""99""
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЭКОМ_Статусы.ОтклоненПолностью)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ЭКОМ_Статусы.Подтвержден)
		|	КОНЕЦ КАК Статус
		|ИЗ
		|	Документ.ЭКОМ_Документы КАК ЭКОМ_ДокументыВхОтвет
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭКОМ_Документы КАК ЭКОМ_ДокументыИсхПрайс
		|		ПО ЭКОМ_ДокументыВхОтвет.ФайлДата = ЭКОМ_ДокументыИсхПрайс.ФайлДата
		|			И ЭКОМ_ДокументыВхОтвет.ФайлНомер = ЭКОМ_ДокументыИсхПрайс.ФайлНомер
		|			И (ЭКОМ_ДокументыИсхПрайс.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.PRICAT_Исходящий))
		|ГДЕ
		|	ЭКОМ_ДокументыВхОтвет.Ссылка = &Ссылка";			
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			Структура = Новый Структура;
			Структура.Вставить("Статус", Выборка.Статус);
			ЭКОМ_ОбщегоНазначения.ЭКОМ_Объекты_События_Записать(Выборка.Ссылка, Выборка.ВидДокумента, Структура);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Сформировать и отправить отклонение заказа (ORDRSP)

// Формирует и отправляет электронный документ ORDRSP из формы входящего ЭКОМ документа ORDER
//	Для успешной отправки обработка должна находиться либо в составе конфигурации, либо добавлена
//	в базу в качестве внешней обработки
//
// Параметры:
//  МассивЛогаСобытий  - Массив - коллекция записей лога событий
//
// Возвращаемое значение:
//   Структура   - результат отправки файла
//
Функция ОтклонитьЗаказ(МассивЛогаСобытий) Экспорт

	Ответ = Новый Структура("Успешно, АдресФайла, ИмяФайла", Ложь, "", "");
	
	СтруктураДокумента 	= СтруктураЭлектронногоДокумента();
	ЭлектронныйДокумент = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("ORDRSP", "ORDRSP"));
	МассивТегов = Новый Массив; 
	Попытка
		ЗаполнитьЭлектронныйДокумент(ЭлектронныйДокумент, СтруктураДокумента, МассивТегов);
		ЭлектронныйДокумент.Проверить();
	Исключение
		ТекстЛогаСобытий = "Ошибка при отклонении заказа " + Строка(Ссылка) + ". " + ОписаниеОшибки();
		ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, "Отклонение заказа в документе Docrobot");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		Возврат Ответ;
	КонецПопытки;

	КодировкаXML = "UTF-8";
	
	ЗаписьXML  = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку(КодировкаXML);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ЭлектронныйДокумент);
	СтрокаXML = ЗаписьXML.Закрыть();
	
	ЭКОМ_ОбщегоНазначения.ОчиститьСтрокуXMLОтПустыхТегов(СтрокаXML, МассивТегов);
	
    Идентификатор	= "ORDRSP_" + Формат(ТекущаяДатаСеанса(), "ДФ=ггггММддЧЧммсс000") + "-OUT-"
		+ Формат(ЭКОМ_ОбщегоНазначения.НовыйНомерТранзакции(0), "ЧГ=0");
	ФайлИмя			= Идентификатор + ".xml";
	
	СтруктураEDI = Новый Структура;
	
	СтруктураEDI.Вставить("СтрокаXML", 			СтрокаXML);
	СтруктураEDI.Вставить("КодировкаФайла", 	КодировкаXML);
	СтруктураEDI.Вставить("Документ",           Ссылка);
	СтруктураEDI.Вставить("СтруктураДокумента", СтруктураДокумента);
	СтруктураEDI.Вставить("Отправлен",          Неопределено);
	СтруктураEDI.Вставить("Сообщение",          "");
	СтруктураEDI.Вставить("ЗаказДата",          ЗаказДата);					
	СтруктураEDI.Вставить("ЗаказНомер",         ЗаказНомер);
	СтруктураEDI.Вставить("Контрагент",         Контрагент);
	СтруктураEDI.Вставить("Организация",        Организация);
	СтруктураEDI.Вставить("ВидДокумента",       Перечисления.ЭКОМ_ВидыДокументов.ORDRSP_Исходящий);
	СтруктураEDI.Вставить("ИмяФайлаXML",        ФайлИмя);
	СтруктураEDI.Вставить("Статус",             Перечисления.ЭКОМ_Статусы.Отправлен);
	СтруктураEDI.Вставить("ТипФайла",           "ORDRSP");
	СтруктураEDI.Вставить("Идентификатор",      Идентификатор);
	СтруктураEDI.Вставить("НомерДокумента",     Номер);
	СтруктураEDI.Вставить("ДатаДокумента",      Дата);
	
	МассивСтруктур = Новый Массив;
	МассивСтруктур.Добавить(СтруктураEDI);
	
	ИмяХранилищаОбработки = "ХранилищеВнешнейОбработки";
	
	ОбработкаМетаданные = Метаданные.Обработки.Найти("ЭКОМ_Интеграция_EDI_ЮЗД");
	Если Метаданные.Справочники.Найти("ВнешниеОбработки") <> Неопределено Тогда 
		ВнешняяОбработка = Справочники.ВнешниеОбработки.НайтиПоНаименованию("Docrobot: Интеграция EDI", Истина);
	ИначеЕсли Метаданные.Справочники.Найти("ДополнительныеОтчетыИОбработки") <> Неопределено Тогда
		ВнешняяОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Docrobot: Интеграция EDI", Истина);
		ИмяХранилищаОбработки = "ХранилищеОбработки";
	Иначе
		ВнешняяОбработка = Неопределено;
	КонецЕсли;
	СтруктураЛога		= ЭКОМ_ОбщегоНазначения.ПолучитьСтруктуруЛогаНаСервере();
	Если ОбработкаМетаданные <> Неопределено Тогда
		ОбработкаОбъект = Обработки.ЭКОМ_Интеграция_EDI_ЮЗД.Создать();
		ОбработкаОбъект.ОтправитьФайлы(МассивСтруктур, "ORDRSP", МассивЛогаСобытий, Ложь, Истина, СтруктураЛога);
		Ответ.Успешно = НЕ СтруктураЛога.ЕстьОшибка;
	ИначеЕсли ЗначениеЗаполнено(ВнешняяОбработка) Тогда
		ИмяФайла 	= ПолучитьИмяВременногоФайла(); 
		ДвоичныеДанные = ВнешняяОбработка[ИмяХранилищаОбработки].Получить(); 
		ДвоичныеДанные.Записать(ИмяФайла);
		ОбработкаОбъект = ВнешниеОбработки.Создать(ИмяФайла, Ложь);
		ОбработкаОбъект.ОтправитьФайлы(МассивСтруктур, "ORDRSP", МассивЛогаСобытий, Ложь, Истина, СтруктураЛога);
		УдалитьФайлы(ИмяФайла);
		Ответ.Успешно = НЕ СтруктураЛога.ЕстьОшибка;
	Иначе
		ТекстЛогаСобытий = "Обработка - 'Docrobot: Интеграция EDI' не найдена! Для успешного выполнения обработка должна быть либо в составе конфигурации, либо в числе внешних обработок базы.";
		ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Информация, "Отклонение заказа в документе Docrobot");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
	КонецЕсли;
	
	Если Ответ.Успешно Тогда
		
		Ответ.АдресФайла 	= ПоместитьВоВременноеХранилище(ПолучитьДвоичныеДанныеФайла(СтрокаXML), Новый УникальныйИдентификатор);
		Каталог = ОбработкаОбъект.Настройка_Параметр_Прочитать("ЭКОМ_Локальный_Каталог_OUTBOX_Архив",,,Истина);
		РазделительПути = ЭКОМ_ОбщегоНазначения.ЭКОМ_Общее_ПолучитьРазделительПутиНаСервере();
		Если Прав(Каталог, 1) <> РазделительПути Тогда
			Каталог = Каталог + РазделительПути;
		КонецЕсли;
		Ответ.ИмяФайла = Каталог + "ORDRSP" + РазделительПути + Формат(ТекущаяДатаСеанса(), "ДФ=yyyyMMdd") + РазделительПути + ФайлИмя;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции // ОтклонитьЗаказ()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьДвоичныеДанныеФайла(ТекстФайла)

	ДвоиченыеДанные = Неопределено;
	
	Если ЭКОМ_ОбщегоНазначения.ВерсияПлатформыНаСервере() >= 8390 Тогда
	
		ПотокВПамяти = Новый ПотокВПамяти();
		ЗаписьДанных = Новый ЗаписьДанных(ПотокВПамяти);
		
		ЗаписьДанных.ЗаписатьСтроку(ТекстФайла);
		ЗаписьДанных.Закрыть();
		ДвоиченыеДанные = ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные();
		
	Иначе
		
		Файл = Новый ТекстовыйДокумент;
		Файл.УстановитьТекст(ТекстФайла);
		ИмяФайла = ПолучитьИмяВременногоФайла();
		Файл.Записать(ИмяФайла);
		ДвоиченыеДанные = Новый ДвоичныеДанные(ИмяФайла);
		УдалитьФайлы(ИмяФайла);
		
	КонецЕсли;

	Возврат ДвоиченыеДанные;
	
КонецФункции // ПолучитьДвоичныеДанныеФайла()

// Рекурсивный метод для заполнения объекта XDTO по данным структуры исходящего электронного документа
//
// Параметры:
//  ОбъектXDTO  - ОбъектXDTO - объект для заполнения
//  Данные  - Структура - данные формируемого электронного документа
//
Процедура ЗаполнитьЭлектронныйДокумент(ОбъектXDTO, Данные, МассивТегов)

	Включить = "";
	Исключить = "";
	// Разделение значений на примитивные и комплексные типы.
	Для Каждого Элемент Из Данные Цикл
		Если ТипЗнч(Элемент.Значение) = Тип("Строка") Тогда
			Включить = Включить + ?(ПустаяСтрока(Включить), "", ", ") + Элемент.Ключ;
			МассивТегов.Добавить(Элемент.Ключ);
		Иначе
			Исключить = Исключить + ?(ПустаяСтрока(Исключить), "", ", ") + Элемент.Ключ;
		КонецЕсли;
	КонецЦикла;
	// Заполнение примитивных типов.
	ЗаполнитьЗначенияСвойств(ОбъектXDTO, Данные, Включить, Исключить);
	//Заполнение комплексных типов.
	Имена = СтрЗаменить(Исключить, ", " , Символы.ПС);
	Для НомерСтроки = 1 По СтрЧислоСтрок(Имена) Цикл
		Имя = СтрПолучитьСтроку(Имена, НомерСтроки);
		
		Значение = Неопределено;
		
		Если ПустаяСтрока(Имя)
			ИЛИ НЕ Данные.Свойство(Имя, Значение)
			ИЛИ Значение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МассивТегов.Добавить(Имя);
		
		Если ТипЗнч(Значение) = Тип("Структура") Тогда // Подветви документа.
			ДочернийОбъектXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("ORDRSP", Имя));
			ЗаполнитьЭлектронныйДокумент(ДочернийОбъектXDTO, Значение, МассивТегов);
			ОбъектXDTO[Имя] = ДочернийОбъектXDTO;
		ИначеЕсли ТипЗнч(Значение) = Тип("Массив") Тогда // Списки документа.
			Для Каждого Строка Из Значение Цикл
				ДочернийОбъектXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("ORDRSP", Имя));
				ЗаполнитьЭлектронныйДокумент(ДочернийОбъектXDTO, Строка, МассивТегов);
				ОбъектXDTO[Имя].Добавить(ДочернийОбъектXDTO);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗаполнитьЭлектронныйДокумент()

// Возвращает структуру ORDRSP для отправки из ЭКОМ документа
//
// Возвращаемое значение:
//   Структура   - данные для создания электронного документа
//
Функция СтруктураЭлектронногоДокумента()

	POSITION = Новый Массив;
	
	Для Каждого Строка Из ТЧ_Товары Цикл
		
		СтруктураPOSITION = Новый Структура;
		
		СтруктураPOSITION.Вставить("POSITIONNUMBER", 		XMLСтрока(Строка.НомерСтроки));
		СтруктураPOSITION.Вставить("PRODUCT", 				XMLСтрока(Строка.НомерПродукта));
		СтруктураPOSITION.Вставить("DESCRIPTION", 			XMLСтрока(Строка.ОписаниеПродукта));
		СтруктураPOSITION.Вставить("PRODUCTTYPE", 			XMLСтрока(3));
		СтруктураPOSITION.Вставить("ORDEREDQUANTITY",		XMLСтрока(Строка.КоличествоЗаказанное));
		СтруктураPOSITION.Вставить("ACCEPTEDQUANTITY", 		XMLСтрока(0));
		СтруктураPOSITION.Вставить("REASONDECREACEQUANTITY",XMLСтрока(Строка.ПричинаОтказаТЧ));
		СтруктураPOSITION.Вставить("PACKINGQUANTITY",		XMLСтрока(Строка.КоличествоВФасовке));
		СтруктураPOSITION.Вставить("ORDRSPUNIT",			XMLСтрока(Строка.xmlЕдиницаИзмерения));
		
		POSITION.Добавить(СтруктураPOSITION);
		
	КонецЦикла;
	
	СтруктураHEAD = Новый Структура;
	
	СтруктураHEAD.Вставить("BUYER", 		XMLСтрока(xmlКонтрагент));
	СтруктураHEAD.Вставить("SUPPLIER", 		XMLСтрока(xmlОрганизация));
	СтруктураHEAD.Вставить("DELIVERYPLACE", XMLСтрока(xmlТочкаДоставки));
	СтруктураHEAD.Вставить("SENDER", 		XMLСтрока(xmlОрганизация));
	СтруктураHEAD.Вставить("RECIPIENT", 	XMLСтрока(xmlКонтрагент));
	СтруктураHEAD.Вставить("POSITION", 		POSITION);
	
	СтруктураЭД = Новый Структура;
	
	СтруктураЭД.Вставить("NUMBER", 						XMLСтрока(Номер));
	СтруктураЭД.Вставить("DATE", 						Формат(Дата, "ДФ=yyyy-MM-dd"));
	СтруктураЭД.Вставить("ORDERNUMBER", 				XMLСтрока(ЗаказНомер));
	СтруктураЭД.Вставить("ORDERDATE", 					Формат(ЗаказДата, "ДФ=yyyy-MM-dd"));
	СтруктураЭД.Вставить("ACTION", 						XMLСтрока(27));
	СтруктураЭД.Вставить("REASONDECREACEQUANTITYALL", 	XMLСтрока(ПричинаОтказа));
	СтруктураЭД.Вставить("HEAD", 						СтруктураHEAD);
	
	Возврат СтруктураЭД;
	
КонецФункции // СтруктураЭлектронногоДокумента()

// Проверяет, отправлялся ли ранее документ ORDRSP
//
// Возвращаемое значение:
//   Булево   - Истина, если отправка была
//
Функция ПодтверждениеЗаказаРанееОтправлялось() Экспорт
	
	НачатьТранзакцию();
	НайденныеЗаписи = ПолучитьНаборЗаписейПоОтбору(Ссылка, "ORDER", "ЭКОМ_ЦепочкиДокументовПоставщика");
	ЗафиксироватьТранзакцию();
	
	Если НЕ НайденныеЗаписи.Получены Тогда
		Возврат Ложь;
	Иначе
		Статус = НайденныеЗаписи.Записи.Получить(0).Статус_ORDRSP;
		Возврат Статус <> Перечисления.ЭКОМ_СтатусыЭлектронныхДокументов.ПустаяСсылка()
			И 	Статус <> Неопределено;
	КонецЕсли;

КонецФункции // ПодтверждениеЗаказаРанееОтправлялось()

Функция ПолучитьНаборЗаписейПоОтбору(ДокументПоискаСсылка, ИмяИзмеренияОтбора, ИмяЦепочки)
	Результат = Новый Структура;
	Результат.Вставить("Получены", Ложь);  	
	
	ДокументПоиска = Неопределено;
	Если ЗначениеЗаполнено(ДокументПоискаСсылка) Тогда
		ДокументПоиска = ДокументПоискаСсылка;
	КонецЕсли;
	
	
	НаборЗаписей = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();      
	
	ЗаписьНайдена = Ложь;
	
	// 1. Поиск по документу
	Если ЗначениеЗаполнено(ДокументПоиска) Тогда
		НаборЗаписей.Отбор[ИмяИзмеренияОтбора].Установить(ДокументПоиска); //TODO: проверить индексируемость измерения ВозвратнаяНакладная /mod-1129
		
		ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, ИмяЦепочки);		
		
		НаборЗаписей.Прочитать();
		Если НЕ НаборЗаписей.Количество() = 0 Тогда
			ЗаписьНайдена = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// 2. Поиск по дате и номеру заказа
	Если ЗаписьНайдена = Ложь Тогда		
		КоличествоОбязательныхОтборов = 2;
		ОбязательныеДанныеОтбораЗаполнены = Новый Массив; 				
		Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказДата) Тогда
			ОбязательныеДанныеОтбораЗаполнены.Добавить("ORDERDATE");
		КонецЕсли;	
		Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказНомер) Тогда
			ОбязательныеДанныеОтбораЗаполнены.Добавить("ORDERNUMBER");
		КонецЕсли;	
		
		// Обязательные отборы
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ORDERDATE"    , ЭтотОбъект.ЗаказДата);
		СтруктураОтбора.Вставить("ORDERNUMBER"  , ЭтотОбъект.ЗаказНомер);
		СтруктураОтбора.Вставить("Организация"  , ЭтотОбъект.Организация);
		СтруктураОтбора.Вставить("Контрагент"   , ЭтотОбъект.Контрагент);
		СтруктураОтбора.Вставить("ТочкаДоставки", ЭтотОбъект.ТочкаДоставки);
		Если ОбязательныеДанныеОтбораЗаполнены.Количество() = КоличествоОбязательныхОтборов Тогда 
			НаборЗаписей = РегистрыСведений[ИмяЦепочки].СоздатьНаборЗаписей();
			Для каждого Данные Из СтруктураОтбора Цикл
				Если ЗначениеЗаполнено(Данные.Значение) Тогда
					НаборЗаписей.Отбор[Данные.Ключ].Установить(Данные.Значение);
				КонецЕсли;
			КонецЦикла;
			
			// Выполним блокировку данных
			ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, ИмяЦепочки);				 
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 1 Тогда // Если запись одна, значит нет разделения заказа
				ЗаписьНайдена = Истина;
			КонецЕсли;											
		КонецЕсли;				
	КонецЕсли;
	
	Если ЗаписьНайдена Тогда
		Результат.Получены = Истина;
		Результат.Вставить("Записи", НаборЗаписей);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции


// Сформировать и отправить отклонение заказа (ORDRSP)

НеВыполнятьКодПриЗаписи = Ложь;

