
&Вместо("ПриУстановкеНачальныхНастроек")
Процедура игр_ПриУстановкеНачальныхНастроек(НачальныеНастройки)

	НастройкиКлиента = НачальныеНастройки.НастройкиКлиента;
	
	// Первый запуск до установки начальных значений констант выполняется в режиме по умолчанию
	Если ОбновлениеИнформационнойБазыСлужебный.ВерсияИБ("СтандартныеПодсистемы",
		ОбщегоНазначения.РазделениеВключено()) <> "0.0.0.0" Тогда
		
		Если Константы.ИнтерфейсВерсии82.Получить() Тогда
			НастройкиКлиента.ВариантИнтерфейсаКлиентскогоПриложения = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_2;
		Иначе
			НастройкиКлиента.ВариантИнтерфейсаКлиентскогоПриложения = ВариантИнтерфейсаКлиентскогоПриложения.Такси;
		КонецЕсли;
		
	КонецЕсли;
	
	НачальныеНастройки.НастройкиТакси = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
	НастройкиСостава = Новый НастройкиСоставаИнтерфейсаКлиентскогоПриложения;
	Если НачальныеНастройки.ЭтоВнешнийПользователь Тогда
		НастройкиСостава.Лево.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельФункцийТекущегоРаздела"));
	Иначе
		ГруппаВерх = Новый ГруппаНастройкиСоставаИнтерфейсаКлиентскогоПриложения;
		ГруппаВерх.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельОткрытых"));
		НастройкиСостава.Верх.Добавить(ГруппаВерх);
		НастройкиСостава.Лево.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельРазделов"));
	КонецЕсли;
	НачальныеНастройки.НастройкиТакси.УстановитьСостав(НастройкиСостава);
	
	Если НЕ НастройкиКлиента.ВариантИнтерфейсаКлиентскогоПриложения = ВариантИнтерфейсаКлиентскогоПриложения.Такси Тогда
	
		НачальныеНастройки.НастройкиИнтерфейса.ОтображениеПанелиРазделов = ОтображениеПанелиРазделов.Текст;
	
	КонецЕсли;

КонецПроцедуры
