&НаКлиенте
Перем ОбработкаКС Экспорт;

&НаКлиенте
Перем ФормаДлительнойОперации;

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Обход ошибки платформы "Параметр сеанса отсутствует или удален".
	ТабличныйДокумент.Очистить();
	
	СформироватьСтруктуруРеквизитовФормы();
	
	СоответствиеЕдиницыИзмеренияДелителю = Новый Структура;
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1", 1);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000", 1000);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000000", 1000000);
	
	// ОПИСАНИЕ ПАРАМЕТРОВ МНОГОСТРОЧНЫХ ГРУПП
	// Идентификаторы многострочных групп
	СтруктураРеквизитовФормы.мИдГруппы31  = "П0003100003";
	СтруктураРеквизитовФормы.мИдГруппы32  = "П0003200003";
	СтруктураРеквизитовФормы.мИдГруппы33  = "П0003300003";
	СтруктураРеквизитовФормы.мИдГруппы71  = "П0007100001";
	СтруктураРеквизитовФормы.мИдГруппы72  = "П0007200001";
	СтруктураРеквизитовФормы.мИдГруппы73  = "П0007300002";
	СтруктураРеквизитовФормы.мИдГруппы74  = "П0007400001";
	СтруктураРеквизитовФормы.мИдГруппы81  = "П0008100001";
	СтруктураРеквизитовФормы.мИдГруппы82  = "П0008200001";
	СтруктураРеквизитовФормы.мИдГруппы83  = "П0008300002";
	СтруктураРеквизитовФормы.мИдГруппы84  = "П0008400001";
	СтруктураРеквизитовФормы.мИдГруппы911 = "П0009110001";
	СтруктураРеквизитовФормы.мИдГруппы912 = "П0009120002";
	СтруктураРеквизитовФормы.мИдГруппы921 = "П0009210001";
	СтруктураРеквизитовФормы.мИдГруппы922 = "П0009220002";
	СтруктураРеквизитовФормы.мИдГруппы931 = "П0009310001";
	СтруктураРеквизитовФормы.мИдГруппы932 = "П0009320002";
	СтруктураРеквизитовФормы.мИдГруппы941 = "П0009410001";
	СтруктураРеквизитовФормы.мИдГруппы942 = "П0009420002";
	
	//300.03
	КолИсхСтрокИдГруппы31  = 1;
	КолИсхСтрокИдГруппы32  = 1;
	КолИсхСтрокИдГруппы33  = 1;
	
	//300.07
	КолИсхСтрокИдГруппы71  = 1;
	КолИсхСтрокИдГруппы72  = 1;
	КолИсхСтрокИдГруппы73  = 1;
	КолИсхСтрокИдГруппы74  = 1;
	
	//300.07
	КолИсхСтрокИдГруппы81  = 1;
	КолИсхСтрокИдГруппы82  = 1;
	КолИсхСтрокИдГруппы83  = 1;
	КолИсхСтрокИдГруппы84  = 1;
	
	//300.09
	КолИсхСтрокИдГруппы911 = 1;
	КолИсхСтрокИдГруппы912 = 1;
	КолИсхСтрокИдГруппы921 = 1;
	КолИсхСтрокИдГруппы922 = 1;
	КолИсхСтрокИдГруппы931 = 1;
	КолИсхСтрокИдГруппы932 = 1;
	КолИсхСтрокИдГруппы941 = 1;
	КолИсхСтрокИдГруппы942 = 1;
	
	//300.03
	КолКолонокИдГруппы31 = 5;
	КолКолонокИдГруппы32 = 4;
	КолКолонокИдГруппы33 = 5;
	
	//300.07
	КолКолонокИдГруппы71 = 4;
	КолКолонокИдГруппы72 = 4;
	КолКолонокИдГруппы73 = 4;
	КолКолонокИдГруппы74 = 4;
	
	//300.07
	КолКолонокИдГруппы81 = 4;
	КолКолонокИдГруппы82 = 4;
	КолКолонокИдГруппы83 = 4;
	КолКолонокИдГруппы84 = 4;
	
	//300.09
	КолКолонокИдГруппы911 = 4;
	КолКолонокИдГруппы912 = 6;
	КолКолонокИдГруппы921 = 4;
	КолКолонокИдГруппы922 = 6;
	КолКолонокИдГруппы931 = 4;
	КолКолонокИдГруппы932 = 6;
	КолКолонокИдГруппы941 = 4;
	КолКолонокИдГруппы942 = 6;
	
	СтруктураДанныхФорма300Страница1        = Новый Структура;
	СтруктураДанныхФорма300Страница2        = Новый Структура;
	СтруктураДанныхФорма300Страница3        = Новый Структура;
	СтруктураДанныхФорма300Страница4        = Новый Структура;
	СтруктураДанныхФорма300_01Страница1     = Новый Структура;
	СтруктураДанныхФорма300_02Страница1     = Новый Структура;
	СтруктураДанныхФорма300_02Страница2     = Новый Структура;
	СтруктураДанныхФорма300_03Страница1     = Новый Структура;
	СтруктураДанныхФорма300_03Страница2     = Новый Структура;
	СтруктураДанныхФорма300_03Страница3     = Новый Структура;
	СтруктураДанныхФорма300_04Страница1     = Новый Структура;
	СтруктураДанныхФорма300_05Страница1     = Новый Структура;
	СтруктураДанныхФорма300_06Страница1     = Новый Структура;
	СтруктураДанныхФорма300_06Страница2     = Новый Структура;
	СтруктураДанныхФорма300_07Страница1     = Новый Структура;
	СтруктураДанныхФорма300_07Страница2     = Новый Структура;
	СтруктураДанныхФорма300_07Страница3     = Новый Структура;
	СтруктураДанныхФорма300_07Страница4     = Новый Структура;
	СтруктураДанныхФорма300_08Страница1     = Новый Структура;
	СтруктураДанныхФорма300_08Страница2     = Новый Структура;
	СтруктураДанныхФорма300_08Страница3     = Новый Структура;
	СтруктураДанныхФорма300_08Страница4     = Новый Структура;
	СтруктураДанныхФорма300_09_01Страница1  = Новый Структура;
	СтруктураДанныхФорма300_09_01Страница2  = Новый Структура;
	СтруктураДанныхФорма300_09_02Страница1  = Новый Структура;
	СтруктураДанныхФорма300_09_02Страница2  = Новый Структура;
	СтруктураДанныхФорма300_09_03Страница1  = Новый Структура;
	СтруктураДанныхФорма300_09_03Страница2  = Новый Структура;
	СтруктураДанныхФорма300_09_04Страница1  = Новый Структура;
	СтруктураДанныхФорма300_09_04Страница2  = Новый Структура;
	
	
	
	// структура многострочных разделов формы
	мСтруктураМногострочныхРазделов = Новый Структура;
	//300.03
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы31, СтруктураРеквизитовФормы.мИдГруппы31);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы32, СтруктураРеквизитовФормы.мИдГруппы32);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы33, СтруктураРеквизитовФормы.мИдГруппы33);
	//300.07
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы71, СтруктураРеквизитовФормы.мИдГруппы71);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы72, СтруктураРеквизитовФормы.мИдГруппы72);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы73,  СтруктураРеквизитовФормы.мИдГруппы73);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы74,  СтруктураРеквизитовФормы.мИдГруппы74);
	//300.08
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы81, СтруктураРеквизитовФормы.мИдГруппы81);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы82, СтруктураРеквизитовФормы.мИдГруппы82);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы83,  СтруктураРеквизитовФормы.мИдГруппы83);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы84,  СтруктураРеквизитовФормы.мИдГруппы84);
	//300.09
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы911, СтруктураРеквизитовФормы.мИдГруппы911);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы912, СтруктураРеквизитовФормы.мИдГруппы912);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы921, СтруктураРеквизитовФормы.мИдГруппы921);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы922, СтруктураРеквизитовФормы.мИдГруппы922);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы931, СтруктураРеквизитовФормы.мИдГруппы931);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы932, СтруктураРеквизитовФормы.мИдГруппы932);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы941, СтруктураРеквизитовФормы.мИдГруппы941);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы942, СтруктураРеквизитовФормы.мИдГруппы942);
	
	// Структура содержит данные дополнительных страниц
	мСтруктураМногостраничныхРазделов = Новый Структура;
	
	// структура исходных строк (минимального кол-ва) многострочных разделов формы
	мСтруктураИсхКолвоСтрокРазделов = Новый Структура;
	//300.03
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы31, КолИсхСтрокИдГруппы31);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы32, КолИсхСтрокИдГруппы32);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы33, КолИсхСтрокИдГруппы33);
	//300.07
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы71, КолИсхСтрокИдГруппы71);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы72, КолИсхСтрокИдГруппы72);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы73, КолИсхСтрокИдГруппы73);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы74, КолИсхСтрокИдГруппы74);
	//300.08
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы81, КолИсхСтрокИдГруппы81);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы82, КолИсхСтрокИдГруппы82);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы83, КолИсхСтрокИдГруппы83);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы84, КолИсхСтрокИдГруппы84);
	//300.09
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы911, КолИсхСтрокИдГруппы911);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы912, КолИсхСтрокИдГруппы912);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы921, КолИсхСтрокИдГруппы921);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы922, КолИсхСтрокИдГруппы922);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы931, КолИсхСтрокИдГруппы931);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы932, КолИсхСтрокИдГруппы932);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы941, КолИсхСтрокИдГруппы941);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы942, КолИсхСтрокИдГруппы942);
	
	
	мСтруктураКолвоКолонокРазделов = Новый Структура;
	//300.03
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы31, КолКолонокИдГруппы31);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы32, КолКолонокИдГруппы32);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы33, КолКолонокИдГруппы33);
	//300.07
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы71, КолКолонокИдГруппы71);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы72, КолКолонокИдГруппы72);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы73, КолКолонокИдГруппы73);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы74, КолКолонокИдГруппы74);
	//300.08
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы81, КолКолонокИдГруппы81);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы82, КолКолонокИдГруппы82);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы83, КолКолонокИдГруппы83);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы84, КолКолонокИдГруппы84);
	//300.09
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы911, КолКолонокИдГруппы911);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы912, КолКолонокИдГруппы912);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы921, КолКолонокИдГруппы921);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы922, КолКолонокИдГруппы922);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы931, КолКолонокИдГруппы931);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы932, КолКолонокИдГруппы932);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы941, КолКолонокИдГруппы941);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы942, КолКолонокИдГруппы942);
	
	
	СтруктураРеквизитовФормы.СписокПечатаемыхЛистов = Новый СписокЗначений;
	СтруктураРеквизитовФормы.мПечатныеформы = Новый СписокЗначений;
	
	СтруктураРеквизитовФормы.мВыбраннаяФорма          = Параметры.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета  = Параметры.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета = Параметры.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мПериодичность           = Параметры.мПериодичность;
	СтруктураРеквизитовФормы.мСкопированаФорма        = Параметры.мСкопированаФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок          = Параметры.мСохраненныйДок;
	СтруктураРеквизитовФормы.Организация              = Параметры.Организация;
	СтруктураРеквизитовФормы.ВидДокумента = 0;
	СтруктураРеквизитовФормы.мМетодРасчета = ПолучитьМетодОтнесенияНДСВЗачет();
	
	НалоговыйКомитет = СтруктураРеквизитовФормы.Организация.РегистрацияВНалоговомОргане;
	СтруктураРеквизитовФормы.НалоговыйКомитет = ?(ЗначениеЗаполнено(НалоговыйКомитет),НалоговыйКомитет,Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка());
	
	ИмяРаздела = "Форма300Страница1";
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(
	ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяРаздела));
	
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	
	СформироватьОтчетныйПериод();
	
	Инициализация(Параметры.БезОткрытияФормы);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруРеквизитовФормы()
	
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("Организация");
	СтруктураРеквизитовФормы.Вставить("ЕдиницаИзмерения");
	СтруктураРеквизитовФормы.Вставить("ТочностьЕдиницыИзмерения");
	СтруктураРеквизитовФормы.Вставить("мКвартал");
	СтруктураРеквизитовФормы.Вставить("мГод");
	СтруктураРеквизитовФормы.Вставить("мДатаНачалаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мДатаКонцаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мПериодичность");
	СтруктураРеквизитовФормы.Вставить("мСкопированаФорма");
	СтруктураРеквизитовФормы.Вставить("мСохраненныйДок");
	СтруктураРеквизитовФормы.Вставить("мВыбраннаяФорма");
	СтруктураРеквизитовФормы.Вставить("мЗаписываетсяНовыйДокумент");
	СтруктураРеквизитовФормы.Вставить("мВариант");
	СтруктураРеквизитовФормы.Вставить("мПроверятьСоотношенияПриПечатиИВыгрузки");
	СтруктураРеквизитовФормы.Вставить("СписокПечатаемыхЛистов");
	СтруктураРеквизитовФормы.Вставить("мРежимПечати");
	СтруктураРеквизитовФормы.Вставить("мСчетчикСтраниц");
	СтруктураРеквизитовФормы.Вставить("мПечатныеФормы");
	СтруктураРеквизитовФормы.Вставить("НаимТекущегоРаздела");
	СтруктураРеквизитовФормы.Вставить("ВидДокумента");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы31");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы32");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы33");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы71");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы72");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы73");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы74");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы81");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы82");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы83");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы84");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы911");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы912");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы921");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы922");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы931");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы932");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы941");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы942");
	СтруктураРеквизитовФормы.Вставить("мМетодРасчета");
	СтруктураРеквизитовФормы.Вставить("АдресВоВременномХранилище");
	СтруктураРеквизитовФормы.Вставить("АдресВременногоХранилищаРасшифровки");
	СтруктураРеквизитовФормы.Вставить("ГруппаОрганизаций", Новый СписокЗначений);
	СтруктураРеквизитовФормы.Вставить("ИдентификаторЗадания");
	СтруктураРеквизитовФормы.Вставить("УспешноеАвтозаполнение");
	СтруктураРеквизитовФормы.Вставить("ВерсияАвтозаполнения");
	СтруктураРеквизитовФормы.Вставить("ВыводитьСтраницуВТаблДокНаСервере");
	СтруктураРеквизитовФормы.Вставить("НалоговыйКомитет");
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСтраницОтчета() 
	
	// Дерево содержит коллекцию страниц отчета.
	мДеревоСтраницОтчета.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300Страница1";
	СтрокаУровня1.Представление            = "Форма 300.00 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300Страница2";
	СтрокаУровня1.Представление            = "Форма 300.00 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300Страница3";
	СтрокаУровня1.Представление            = "Форма 300.00 Страница 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300Страница4";
	СтрокаУровня1.Представление            = "Форма 300.00 Страница 4";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_01Страница1";
	СтрокаУровня1.Представление            = "Форма 300.01 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_02Страница1";
	СтрокаУровня1.Представление            = "Форма 300.02 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_02Страница2";
	СтрокаУровня1.Представление            = "Форма 300.02 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_03Страница1";
	СтрокаУровня1.Представление            = "Форма 300.03 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_03Страница2";
	СтрокаУровня1.Представление            = "Форма 300.03 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_03Страница3";
	СтрокаУровня1.Представление            = "Форма 300.03 Страница 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_04Страница1";
	СтрокаУровня1.Представление            = "Форма 300.04 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_05Страница1";
	СтрокаУровня1.Представление            = "Форма 300.05 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_06Страница1";
	СтрокаУровня1.Представление            = "Форма 300.06 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_06Страница2";
	СтрокаУровня1.Представление            = "Форма 300.06 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_07Страница1";
	СтрокаУровня1.Представление            = "Форма 300.07 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_07Страница2";
	СтрокаУровня1.Представление            = "Форма 300.07 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_07Страница3";
	СтрокаУровня1.Представление            = "Форма 300.07 Страница 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_07Страница4";
	СтрокаУровня1.Представление            = "Форма 300.07 Страница 4";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_08Страница1";
	СтрокаУровня1.Представление            = "Форма 300.08 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_08Страница2";
	СтрокаУровня1.Представление            = "Форма 300.08 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_08Страница3";
	СтрокаУровня1.Представление            = "Форма 300.08 Страница 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_08Страница4";
	СтрокаУровня1.Представление            = "Форма 300.08 Страница 4";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_09_01Страница1";
	СтрокаУровня1.Представление            = "Форма 300.09_01 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_09_01Страница2";
	СтрокаУровня1.Представление            = "Форма 300.09_01 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_09_02Страница1";
	СтрокаУровня1.Представление            = "Форма 300.09_02 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_09_02Страница2";
	СтрокаУровня1.Представление            = "Форма 300.09_02 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_09_03Страница1";
	СтрокаУровня1.Представление            = "Форма 300.09_03 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_09_03Страница2";
	СтрокаУровня1.Представление            = "Форма 300.09_03 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_09_04Страница1";
	СтрокаУровня1.Представление            = "Форма 300.09_04 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_09_04Страница2";
	СтрокаУровня1.Представление            = "Форма 300.09_04 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСвойствСтраниц() Экспорт
	
	мСвойстваРазделовДекларации.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	
	СтрокаУровня1.ИмяСтраницы                          = "Форма300Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300Страница3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300Страница4";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_01Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_02Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_02Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_03Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы31;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_03Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы32;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_03Страница3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы33;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_04Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_05Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_06Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_06Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_07Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы71;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_07Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы72;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_07Страница3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы73;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_07Страница4";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы74;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_08Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы81;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_08Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы82;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_08Страница3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы83;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_08Страница4";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы84;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_09_01Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы911;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_09_01Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы912;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_09_02Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы921;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_09_02Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы922;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_09_03Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы931;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_09_03Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы932;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_09_04Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы941;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_09_04Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы942;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПустыеСтруктурыДанных()
	
	СохрТабличныйДокумент = Новый ТабличныйДокумент;
	
	СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		ИмяГруппы = ЭлементСтруктуры.Ключ;
		СтруктураГруппы = ЭтаФорма[ЭлементСтруктуры.Значение];
		СтруктураГруппы.Очистить();
	КонецЦикла;
	
	Для Каждого Раздел Из мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
		
		ТабличныйДокумент.Очистить();
		ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + Раздел.ИмяСтраницы));
		
		СохранитьДанныеРаздела(Раздел.ИмяСтраницы);
		
	КонецЦикла;
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоРазделовОтчетаНаСервере() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДеревоРазделовОтчетаНаКлиенте() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьДеревоРазделовОтчета(Форма)
	
	Форма["РазделыОтчета"].ПолучитьЭлементы().Очистить();
	МассивНаименований = Новый Массив;
	
	Для Каждого ЭлементДереваСтраницОтчета Из Форма["мДеревоСтраницОтчета"].ПолучитьЭлементы() Цикл
		
		Если ЭлементДереваСтраницОтчета.ПоказатьСтраницу = 1 Тогда
			
			Если МассивНаименований.Найти(ЭлементДереваСтраницОтчета.ИмяСтраницы) = Неопределено Тогда 
				
				ЭлементРазделовОтчета = Форма["РазделыОтчета"].ПолучитьЭлементы().Добавить();
				ЭлементРазделовОтчета.КолонкаРазделыОтчета = Лев(ЭлементДереваСтраницОтчета.Представление,12);
				ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим = ЭлементДереваСтраницОтчета.ИмяСтраницы;
				МассивНаименований.Добавить(ЭлементДереваСтраницОтчета.ИмяСтраницы);
				ЭлементРазделовОтчета.РазделМногострочный = МногострочныйРаздел(ЭлементДереваСтраницОтчета.ИмяСтраницы);
				
				Если ЭтоРазделРодитель(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим) Тогда
					
					Для НомерПодраздела = 1 По ПолучитьКоличествоПодразделовПоРодителю(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим) Цикл
						
						СтраницаРазделаОтчета = ЭлементРазделовОтчета.ПолучитьЭлементы().Добавить();
						
						СтраницаРазделаОтчета.КолонкаРазделыОтчета              = Лев(ЭлементДереваСтраницОтчета.Представление,СтрДлина(ЭлементДереваСтраницОтчета.Представление)-1) + НомерПодраздела;
						СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим      = Лев(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим, СтрДлина(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим)-1) + НомерПодраздела;
						МассивНаименований.Добавить(СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим);
						СтраницаРазделаОтчета.РазделМногострочный               = ЭлементРазделовОтчета.РазделМногострочный;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоРазделРодитель(ИмяРаздела)
	
	Результат = (ИмяРаздела = "Форма300Страница1")
	ИЛИ (ИмяРаздела = "Форма300_01Страница1")
	ИЛИ (ИмяРаздела = "Форма300_02Страница1")
	ИЛИ (ИмяРаздела = "Форма300_03Страница1")
	ИЛИ (ИмяРаздела = "Форма300_04Страница1")
	ИЛИ (ИмяРаздела = "Форма300_05Страница1")
	ИЛИ (ИмяРаздела = "Форма300_06Страница1")
	ИЛИ (ИмяРаздела = "Форма300_07Страница1")
	ИЛИ (ИмяРаздела = "Форма300_08Страница1")
	ИЛИ (ИмяРаздела = "Форма300_09_01Страница1")
	ИЛИ (ИмяРаздела = "Форма300_09_02Страница1")
	ИЛИ (ИмяРаздела = "Форма300_09_03Страница1")
	ИЛИ (ИмяРаздела = "Форма300_09_04Страница1");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МногострочныйРаздел(ИмяРаздела)
	
	Результат = (ИмяРаздела = "Форма300_03Страница1")
			ИЛИ (ИмяРаздела = "Форма300_03Страница2")
			ИЛИ (ИмяРаздела = "Форма300_03Страница3")
			ИЛИ (ИмяРаздела = "Форма300_07Страница1")
			ИЛИ (ИмяРаздела = "Форма300_07Страница2")
			ИЛИ (ИмяРаздела = "Форма300_07Страница3")
			ИЛИ (ИмяРаздела = "Форма300_07Страница4")
			ИЛИ (ИмяРаздела = "Форма300_08Страница1")
			ИЛИ (ИмяРаздела = "Форма300_08Страница2")
			ИЛИ (ИмяРаздела = "Форма300_08Страница3")
			ИЛИ (ИмяРаздела = "Форма300_08Страница4")
			ИЛИ (ИмяРаздела = "Форма300_09_01Страница1")
			ИЛИ (ИмяРаздела = "Форма300_09_01Страница2")
			ИЛИ (ИмяРаздела = "Форма300_09_02Страница1")
			ИЛИ (ИмяРаздела = "Форма300_09_02Страница2")
			ИЛИ (ИмяРаздела = "Форма300_09_03Страница1")
			ИЛИ (ИмяРаздела = "Форма300_09_03Страница2")
			ИЛИ (ИмяРаздела = "Форма300_09_04Страница1")
			ИЛИ (ИмяРаздела = "Форма300_09_04Страница2");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьКоличествоПодразделовПоРодителю(Родитель)
	
	Если Родитель = "Форма300Страница1" Тогда
		Возврат 4;
	ИначеЕсли Родитель = "Форма300_01Страница1" Тогда
		Возврат 1;
	ИначеЕсли Родитель = "Форма300_02Страница1" Тогда
		Возврат 2;
	ИначеЕсли Родитель = "Форма300_03Страница1" Тогда
		Возврат 3;
	ИначеЕсли Родитель = "Форма300_04Страница1" Тогда
		Возврат 1;
	ИначеЕсли Родитель = "Форма300_05Страница1" Тогда
		Возврат 1;
	ИначеЕсли Родитель = "Форма300_06Страница1" Тогда
		Возврат 2;
	ИначеЕсли Родитель = "Форма300_07Страница1" Тогда
		Возврат 4;
	ИначеЕсли Родитель = "Форма300_08Страница1" Тогда
		Возврат 4;
	ИначеЕсли Родитель = "Форма300_09_01Страница1" Тогда
		Возврат 2;
	ИначеЕсли Родитель = "Форма300_09_02Страница1" Тогда
		Возврат 2;
	ИначеЕсли Родитель = "Форма300_09_03Страница1" Тогда
		Возврат 2;
	ИначеЕсли Родитель = "Форма300_09_04Страница1" Тогда
		Возврат 2;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьМетодОтнесенияНДСВЗачет()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Не УчетнаяПолитикаОрганизацийСрезПоследних.УчетнаяПолитика.ПрименяетсяУчетНДСПоФактическомуИспользованию ЕСТЬ NULL 
	|				И УчетнаяПолитикаОрганизацийСрезПоследних.УчетнаяПолитика.ПрименяетсяУчетНДСПоФактическомуИспользованию = ИСТИНА
	|			ТОГДА ""Пропорциональный""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ИспользоватьРаздельныйУчетПоНалогообложению.Значение
	|					ТОГДА ""Раздельный""
	|				ИНАЧЕ ""Пропорциональный""
	|			КОНЕЦ
	|	КОНЕЦ КАК МетодОтнесенияНДСВЗачет
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&Дата, Организация = &Организация) КАК УчетнаяПолитикаОрганизацийСрезПоследних,
	|	Константа.ИспользоватьРаздельныйУчетПоНалогообложению КАК ИспользоватьРаздельныйУчетПоНалогообложению";
	
	Запрос.УстановитьПараметр("Организация", СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("Дата", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.МетодОтнесенияНДСВЗачет;
	
КонецФункции

&НаСервере
Процедура СформироватьОтчетныйПериод()
	
	СтрПериодОтчета = ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета,СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ФП = истина");
	
	СтруктураРеквизитовФормы.мКвартал = Лев(СтрПериодОтчета,1);
	СтруктураРеквизитовФормы.мГод = Лев(Прав(СтрПериодОтчета,7),4);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета()
	
	СтруктураЗависимыхЯчеекДляАвторасчета = Новый Структура;
	//300.00Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("ВидДекларации", "Первоначальная;Очередная;Дополнительная;ПоУведомлению;Ликвидационная");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("КатегорияНалПл", "Условие_A;Условие_B");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("НаличиеПриложений", "Приложение01;Приложение02;Приложение03;Приложение04;Приложение05;Приложение06;Приложение07;Приложение08;Приложение09");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010002001", "П000110004001;П000610010001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010003001", "П000610009001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010003002", "П000610009002");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010005001", "П000210006001;П000610011001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010006001", "П000010001001;П000010002001;П000010003001;П000010004001;П000010005001");
	//300.00Стр2
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020007002", "П000010001001;П000010002001;П000010003001;П000010006001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020008002", "П000010002001;П000010001001;П000010002001;П000010003001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020011002", "П000410001002");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020012002", "П000010001002;П000010003002;П000020010002;П000020011002");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020014001", "П000510001001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020014002", "П000510007001;П000020007002;Пропорциональный;Раздельный;ПропорцИРаздел");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020017001", "П000220011001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020019002", "П000330000103;П000330000203");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020021001", "П000020013001;П000020014001;П000020015001;П000020016101;П000020016201;П000020017001;П000020018001;П000020020001;П000030026001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020022002", "П000620024002");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020023002", "П000020013002;П000020014002;П000020016102;П000020016202;П000020019002;П000020020002;П000020022002");
	//300.00Стр3
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030024002", "П000030024102;П000030024202;П000030024302");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030025102", "П000020023002;П000030025102;Раздельный");  //зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030025202", "П000020023002;П000020007002;П000030025202;Пропорциональный");  //зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030025302", "П000030024102;П000020009002;П000030024302;П000020007002;П000030024202;П000030025302;ПропорцИРаздел");  //зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030026001", "П000410001001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030026002", "П000410001002");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030027102", "П000020012002;П000030025102;П000030026002;Раздельный;П000030025202;Пропорциональный;П000030025302;ПропорцИРаздел;П000030027102");  //зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030027202", "П000030025102;П000030026002;П000020012002;Раздельный;П000030025202;Пропорциональный;П000030025302;ПропорцИРаздел;П000030027202");  //зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030032002", "П000110008001");
	//300.01Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000110001001", "П000110001101;П000110001201;П000110001301;П000110001401;П000110001501;П000110001001");  //сложная зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000110004001", "П000110001001;П000110002001;П000110003001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000110008001", "П000110005001;П000110006001;П000110007001");
	//300.02Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000210006001", "П000210001001;П000210002001;П000210003001;П000210004001;П000210005001;П000210006001");  //зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000210007001", "П000210007101;П000210007201;П000210007301;П000210007401;П000210007501;П000210007001");  //сложная зависимость самой от себя
	//300.02Стр2
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000220011001", "П000210007001;П000220008001;П000220009001;П000220010001;П000220011001");  //зависимость самой от себя
	//300.03Стр2
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000320000104", "П000310000104;П000320000102;П000320000103");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000320000204", "П000310000204;П000320000202;П000320000203");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000320000304", "П000310000304;П000320000302;П000320000303");
	//300.03Стр3
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000330000105", "П000310000104;П000320000102;П000320000103;П000330000103;П000330000104");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000330000205", "П000310000204;П000320000202;П000320000203;П000330000203;П000330000204");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000330000305", "П000310000304;П000320000302;П000320000303;П000330000303;П000330000304");
	//300.04Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000410001001", "П000410001101;П000410001201;П000410001301;П000410001401;П000410001501;П000410001601;П000410001701;П000410001801;П000410001901;П000410001001");  //сложная зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000410001002", "П000410001102;П000410001202;П000410001302;П000410001402;П000410001502;П000410001602;П000410001702;П000410001802;П000410001902;П000410001002");  //сложная зависимость самой от себя
	//300.05Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000510007001", "П000510003001;П000510006001;П000510007001");  //зависимость самой от себя
	//300.06Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000610009001", "П000610001001;П000610002001;П000610003001;П000610004001;П000610005001;П000610006001;П000610007001;П000610008001;П000610010001;П000610011001;П000610009001");  //зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000610009002", "П000610001002;П000610002002;П000610003002;П000610004002;П000610005002;П000610006002;П000610007002;П000610008002;П000610009002");  //зависимость самой от себя
	//300.06Стр2
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000620024001", "П000610012001;П000610013001;П000610014001;П000610015001;П000610016001;П000610017001;П000610018001;П000610019001;П000610020001;П000620021001;П000620022001;П000620023001;П000620024001");  //зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000620024002", "П000610012002;П000610013002;П000610014002;П000610015002;П000610016002;П000610017002;П000610018002;П000610019002;П000610020002;П000620021002;П000620022002;П000620023002;П000620024002");  //зависимость самой от себя
	
	//СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("", "");
	
КонецПроцедуры

&НаСервере
Процедура Инициализация(БезОткрытияФормы = Ложь) Экспорт
	
	ФормироватьСтруктуруСтраницОтчета();
	ФормироватьСтруктуруСвойствСтраниц();
	СформироватьДеревоРазделовОтчетаНаСервере();
	ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета();
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
	Если СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		ЗаполнитьПустыеСтруктурыДанных();
		ЗаполнитьСведенияОбОрганизацииНаСервере();
		НачальныеОперацииСМногострочнымиБлоками();
		СтруктураРеквизитовФормы.ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
		СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 0;
		КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
		РасчетНаСервере("Форма300Страница1","Очередная");
	Иначе
		ВосстановитьСохраненныеДанные();
		ВывестиМакетВТаблДокНаСервере("Форма300Страница1");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизацииНаСервере()
	
	ЗаполнитьСведенияОбОрганизации(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизации(Форма)
	
	СтрокаСведений = "ИННЮЛ, НаимЮЛПол, ФИОРук, СерияСвидетельстваПоНДС, НомерСвидетельстваПоНДС";
	СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(СтруктураРеквизитовФормы.Организация,,СтрокаСведений);
	
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ИИН_БИН"].Значение) Тогда
		ТабличныйДокумент.Области["ИИН_БИН"].Значение = СведенияОбОрганизации.ИННЮЛ;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Квартал"].Значение) Тогда
		ТабличныйДокумент.Области["Квартал"].Значение = СтруктураРеквизитовФормы.мКвартал;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Год"].Значение) Тогда
		ТабличныйДокумент.Области["Год"].Значение = СтруктураРеквизитовФормы.мГод;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ОргНазв") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ОргНазв"].Значение) Тогда
		ТабличныйДокумент.Области["ОргНазв"].Значение = СведенияОбОрганизации.НаимЮЛПол;
		Если ТабличныйДокумент.Области.Найти("ОргНазв3") <> Неопределено Тогда
			КонецШага = 3;
		Иначе
			КонецШага = 2;
		КонецЕсли;
		НачПозиция = 1;
		Для Шаг = 1 По КонецШага Цикл
			ДлинаСтроки = ТабличныйДокумент.Области["ОргНазв" + Шаг].ТипЗначения.КвалификаторыСтроки.Длина;
			НазОрганизации = Сред(СведенияОбОрганизации.НаимЮЛПол, НачПозиция, ДлинаСтроки); 
			ТабличныйДокумент.Области["ОргНазв" + Шаг].Значение = НазОрганизации;
			НачПозиция =НачПозиция + ДлинаСтроки;
		КонецЦикла;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("Руководитель") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Руководитель"].Значение) Тогда
		ТабличныйДокумент.Области["Руководитель"].Значение = СведенияОбОрганизации.ФИОРук;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти(СтруктураРеквизитовФормы.мМетодРасчета) <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области[СтруктураРеквизитовФормы.мМетодРасчета].Значение) Тогда
		ТабличныйДокумент.Области.Раздельный.Значение = "";
		ТабличныйДокумент.Области.Пропорциональный.Значение = "";
		ТабличныйДокумент.Области.ПропорцИРаздел.Значение = "";
		ТабличныйДокумент.Области[СтруктураРеквизитовФормы.мМетодРасчета].Значение = "Х";
	КонецЕсли;

	
	Если ТабличныйДокумент.Области.Найти("СерияСвидетельства") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["СерияСвидетельства"].Значение) Тогда
		ТабличныйДокумент.Области["СерияСвидетельства"].Значение = СведенияОбОрганизации.СерияСвидетельстваПоНДС;
	КонецЕсли;
	Если ТабличныйДокумент.Области.Найти("НомерСвидетельства") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["НомерСвидетельства"].Значение)Тогда
		ТабличныйДокумент.Области["НомерСвидетельства"].Значение = СведенияОбОрганизации.НомерСвидетельстваПоНДС;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("КодЧленаТС") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["КодЧленаТС"].Значение) Тогда
		ТабличныйДокумент.Области.КодЧленаТС.Значение = ОпределитьКодЧленаТС(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("КодНалоговогоОргана") <> Неопределено 
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["КодНалоговогоОргана"].Значение) Тогда
		КодНалоговогоОргана = ?(СтруктураРеквизитовФормы.НалоговыйКомитет = Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка(),"",СтруктураРеквизитовФормы.НалоговыйКомитет.Код);
		ТабличныйДокумент.Области["КодНалоговогоОргана"].Значение = КодНалоговогоОргана;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ПоУведомлению") <> Неопределено Тогда
		
		Если ТабличныйДокумент.Области["ПоУведомлению"].Значение = "Х" Тогда
			ТабличныйДокумент.Области.НомерУведомления.Защита = Ложь;
			ТабличныйДокумент.Области.ДатаУведомления.Защита = Ложь;
		ИначеЕсли ТабличныйДокумент.Области["Очередная"].Значение = "" И
			ТабличныйДокумент.Области["Дополнительная"].Значение = "" И 
			ТабличныйДокумент.Области["Ликвидационная"].Значение = "" И
			ТабличныйДокумент.Области["Первоначальная"].Значение = "" Тогда
			
			ТабличныйДокумент.Области["Очередная"].Значение = "Х";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьКодЧленаТС(НаимТекущегоРаздела)
	
	Если НаимТекущегоРаздела = "Форма300_09_01Страница1" 
		ИЛИ НаимТекущегоРаздела = "Форма300_09_01Страница2" Тогда
		//Россия
		Возврат "643";
		
	ИначеЕсли НаимТекущегоРаздела = "Форма300_09_02Страница1" 
		ИЛИ НаимТекущегоРаздела = "Форма300_09_02Страница2" Тогда
		//Белорусь
		Возврат "112";
		
	ИначеЕсли НаимТекущегоРаздела = "Форма300_09_03Страница1" 
		ИЛИ НаимТекущегоРаздела = "Форма300_09_03Страница2" Тогда
		//Армения
		Возврат "051";
		
	ИначеЕсли НаимТекущегоРаздела = "Форма300_09_04Страница1" 
		ИЛИ НаимТекущегоРаздела = "Форма300_09_04Страница2" Тогда
		//Киргизия
		Возврат "417";
		
	Иначе
		
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ВосстановитьСохраненныеДанные()
	
	Перем ДанныеМногострочныхРазделов;
	Перем ПоказателиОтчета;
	Перем НалоговыйКомитет;
	
	// восстанавливаем сохраненные данные отчета
	СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	
	// восстановим сохраненные данные редактируемых ячеек
	СписокСохранения.Свойство("ПоказателиОтчета", ПоказателиОтчета);
	СписокСохранения.Свойство("НалоговыйКомитет", НалоговыйКомитет);
	
	Если СписокСохранения.Свойство( "ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов) Тогда
		
		Для Каждого ЭлементСтруктуры Из ДанныеМногострочныхРазделов Цикл
			
			НайденноеЗначение = Неопределено;
			мСтруктураМногострочныхРазделов.Свойство(ЭлементСтруктуры.Ключ, НайденноеЗначение);
			
			Если НЕ НайденноеЗначение = Неопределено Тогда
				ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, ЭтаФорма[НайденноеЗначение]);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы] = ПоказателиОтчета[Префикс + Раздел.ИмяСтраницы];
	КонецЦикла;
	
	Комментарий = СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий;
	СтруктураРеквизитовФормы.НалоговыйКомитет = НалоговыйКомитет;
	СтруктураРеквизитовФормы.ЕдиницаИзмерения = СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения;
	
	РегламентированнаяОтчетность.ОперацииПриВосстановленииРегламентированногоОтчета(ЭтаФорма);
	////ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма300Страница1");
	КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
	
КонецПроцедуры

&НаСервере
Процедура НачальныеОперацииСМногострочнымиБлоками()
	Перем ИсходноеКоличествоСтрокГруппы;
	
	// создаем исходную структуру многострочных разделов
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		ИмяГруппы = ЭлементСтруктуры.Ключ;
		СтруктураГруппы = ЭтаФорма[ЭлементСтруктуры.Значение];
		
		мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
		
		Если ИсходноеКоличествоСтрокГруппы > СтруктураГруппы.Количество() Тогда 
			Для НСтр = 1 По ИсходноеКоличествоСтрокГруппы Цикл
				СтруктураГруппы.Добавить();
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазделыОтчетаПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ОчиститьТекущуюСтраницу.Видимость = НЕ Элемент.ТекущиеДанные.РазделМногострочный;
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, 1);
	
	ЗаполнитьСведенияОбОрганизацииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетСтраницыВТабличныйДокументНаСервере(ИмяТекРаздела)
	
	ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела);
	СтруктураРеквизитовФормы.НаимТекущегоРаздела  = ИмяТекРаздела;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела)
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(
	ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяТекРаздела));
	
	//многострочные разделы
	Если ИмяТекРаздела = "Форма300_03Страница1"
		ИЛИ ИмяТекРаздела = "Форма300_03Страница2"
		ИЛИ ИмяТекРаздела = "Форма300_03Страница3"
		ИЛИ ИмяТекРаздела = "Форма300_07Страница1"
		ИЛИ ИмяТекРаздела = "Форма300_07Страница2"
		ИЛИ ИмяТекРаздела = "Форма300_07Страница3"
		ИЛИ ИмяТекРаздела = "Форма300_07Страница4"
		ИЛИ ИмяТекРаздела = "Форма300_08Страница1"
		ИЛИ ИмяТекРаздела = "Форма300_08Страница2"
		ИЛИ ИмяТекРаздела = "Форма300_08Страница3"
		ИЛИ ИмяТекРаздела = "Форма300_08Страница4"
		ИЛИ ИмяТекРаздела = "Форма300_09_01Страница1"
		ИЛИ ИмяТекРаздела = "Форма300_09_01Страница2"
		ИЛИ ИмяТекРаздела = "Форма300_09_02Страница1"
		ИЛИ ИмяТекРаздела = "Форма300_09_02Страница2"
		ИЛИ ИмяТекРаздела = "Форма300_09_03Страница1"
		ИЛИ ИмяТекРаздела = "Форма300_09_03Страница2"
		ИЛИ ИмяТекРаздела = "Форма300_09_04Страница1"
		ИЛИ ИмяТекРаздела = "Форма300_09_04Страница2" Тогда
		
		СтруктураДанныхРаздела = ЭтаФорма["СтруктураДанных" + ИмяТекРаздела];
		
		Для Каждого ЭлСтруктуры Из СтруктураДанныхРаздела Цикл
			Попытка
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
		ТекТабличноеПоле = ЭтаФорма.ТабличныйДокумент;
		
		ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяТекРаздела);
		
		СтруктураГруппы = Неопределено;
		
		мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
		
		СтруктураГруппы = ЭтаФорма[СтруктураГруппы];
		
		ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
		
		ЕстьДопСтроки = Ложь;
		
		Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
			Если СтрЧислоВхождений(ОбластьТД.Имя, "_2") > 0 Тогда
				ЕстьДопСтроки = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьДопСтроки Тогда
			Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
				Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
					ОбластьТД.Гиперссылка = Истина;
					ОбластьТД.Текст = "х";
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
				Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
					ОбластьТД.Гиперссылка = Ложь;
					ОбластьТД.Текст = "";
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//обычные разделы
	ИначеЕсли ЭтаФорма["СтруктураДанных" + ИмяТекРаздела]<> Неопределено Тогда
		
		Для Каждого ЭлСтруктуры Из ЭтаФорма["СтруктураДанных" + ИмяТекРаздела] Цикл
			Попытка
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиРазделВТабличныйДокумент(Форма, ИмяГруппы, СтруктураГруппы)
	Перем ИсходноеКоличествоСтрокГруппы;
	
	#Если НаКлиенте Тогда
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИмяГруппы);
	#Иначе
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИмяГруппы);
	#КонецЕсли
	
	// определим исходное колво строк многострочного раздела,
	// соответствующее бумажной форме отчета
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
	
	// реальное кол-во строк (колво заполненных строк)
	ТекущееКоличествоСтрокГруппы = СтруктураГруппы.Количество();
	
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	ПерерисоватьСтроки = (НЕ ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы);
	
	Раздел = Форма[ТекТабличноеПолеИмя];
	
	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// При восстановлении сохраненных данных отчета сравниваем исходное кол-во
	// отображаемых в форме строк многострочного раздела с реальным количеством
	// созданных строк в сохраненном отчете.
	Если ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы Тогда
		
		// При превышении реального кол-ва строк над исходным кол-вом (по шаблону),
		// автоматически добавляем необходимое колво строк.
		Форма.ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки);
		
		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
	КонецЕсли;
	
	// выводим значения строк
	Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
		НомерСтрокиВТаблице      = СтруктураГруппы.Индекс(СтрокаТаблицы);
		НомерСтрокиВФормеТаблицыСтр = Формат(НомерСтрокиВТаблице + 1, "ЧГ=");
		
		Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
			
			КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
			
			Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
				
				ЗначениеЯчейки = СтрокаТаблицы[КолонкаТаблицыИмя];
				ИмяЯчейки      = КолонкаТаблицыИмя + "_" + НомерСтрокиВФормеТаблицыСтр;
				
				ОбластьЯчейкиТаблицы = ТекТабличноеПоле.Области[ИмяЯчейки];
				
				Если ОбластьЯчейкиТаблицы.СодержитЗначение = Истина Тогда
					ОбластьЯчейкиТаблицы.Значение = ЗначениеЯчейки;
				Иначе
					ОбластьЯчейкиТаблицы.Текст = ЗначениеЯчейки;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки) Экспорт
	
	ОбластьДопСтроки = ТекТабличноеПоле.ПолучитьОбласть("МногострочнаяЧасть");
	
	КоординатыОбластей = Новый Структура();
	
	Для Каждого Область Из ТекТабличноеПоле.Области Цикл
		
		Если СтрНайти(Область.Имя, "_") Тогда
			
			КоординатыОбластей.Вставить(Область.Имя, Область.Верх);
			
		КонецЕсли;
		
	КонецЦикла;
	
	МногострочнаяЧастьВерх = ТекТабличноеПоле.Области.МногострочнаяЧасть.Верх;
	
	МногострочнаяЧастьНиз = ТекТабличноеПоле.Области.МногострочнаяЧасть.Низ;
	
	ТекТабличноеПоле.ВставитьОбласть(ОбластьДопСтроки.Область(), ТекТабличноеПоле.Область(МногострочнаяЧастьНиз + 1, , МногострочнаяЧастьНиз + (ТекущееКоличествоСтрокГруппы - 1) * ВысотаСтроки), ТипСмещенияТабличногоДокумента.ПоВертикали);
	
	Для НомНовойСтроки = ИсходноеКоличествоСтрокГруппы По ТекущееКоличествоСтрокГруппы Цикл
		
		Постфикс = Формат(ТекущееКоличествоСтрокГруппы - НомНовойСтроки + 1, "ЧГ=");
		
		Для Каждого Область Из ОбластьДопСтроки.Области Цикл
			
			Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
				
				ОбластьТаблДок = ТекТабличноеПоле.Область(КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Лево, КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Право);
				
				Если ОбластьТаблДок.СодержитЗначение Тогда
					ОбластьТаблДок.Очистить();
				КонецЕсли;
				
				ОбластьТаблДок.Имя = Лев(Область.Имя, СтрНайти(Область.Имя, "_")) + Постфикс;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;	
	
	ТекТабличноеПоле.Область(ТекТабличноеПоле.Области.МногострочнаяЧасть.Верх, , ТекТабличноеПоле.Области.МногострочнаяЧасть.Низ).Имя = "";
	
	ТекТабличноеПоле.Область(МногострочнаяЧастьВерх, , МногострочнаяЧастьНиз).Имя = "МногострочнаяЧасть";
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеРаздела(НаимРаздела)
	
	// Многострочные разделы.
	Если НаимРаздела = "Форма300_03Страница1"
		ИЛИ НаимРаздела = "Форма300_03Страница2"
		ИЛИ НаимРаздела = "Форма300_03Страница3"
		ИЛИ НаимРаздела = "Форма300_07Страница1"
		ИЛИ НаимРаздела = "Форма300_07Страница2"
		ИЛИ НаимРаздела = "Форма300_07Страница3"
		ИЛИ НаимРаздела = "Форма300_07Страница4"
		ИЛИ НаимРаздела = "Форма300_08Страница1"
		ИЛИ НаимРаздела = "Форма300_08Страница2"
		ИЛИ НаимРаздела = "Форма300_08Страница3"
		ИЛИ НаимРаздела = "Форма300_08Страница4"
		ИЛИ НаимРаздела = "Форма300_09_01Страница1"
		ИЛИ НаимРаздела = "Форма300_09_01Страница2"
		ИЛИ НаимРаздела = "Форма300_09_02Страница1"
		ИЛИ НаимРаздела = "Форма300_09_02Страница2"
		ИЛИ НаимРаздела = "Форма300_09_03Страница1"
		ИЛИ НаимРаздела = "Форма300_09_03Страница2"
		ИЛИ НаимРаздела = "Форма300_09_04Страница1"
		ИЛИ НаимРаздела = "Форма300_09_04Страница2" Тогда
		
		ЭтаФорма["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");
		
		ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(НаимРаздела);
		
		ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппы);
		
		// Обычные разделы.
	Иначе
		
		ЭтаФорма["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СобратьДанныеТекущегоТаблПоля(Форма, ТабличноеПоле) Экспорт
	
	СтруктураДанныхПоля = Новый Структура;
	Для Каждого ТекущаяОбласть Из Форма[ТабличноеПоле].Области Цикл
		Если СтрЧислоВхождений(Тип(ТекущаяОбласть), "Рисунок") = 0 И ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник И ТекущаяОбласть.СодержитЗначение = Истина Тогда
			СтруктураДанныхПоля.Вставить(ТекущаяОбласть.Имя, ТекущаяОбласть.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураДанныхПоля;
	
КонецФункции

&НаСервере
Процедура ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппы) Экспорт
	
	Перем СтруктураГруппы;
	
	РегламентированнаяОтчетностьКлиентСервер.ОбновитьСтруктуруМногострочногоРаздела(ЭтаФорма, ИмяГруппы);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область)
	Модифицированность = Истина;
	
	ИмяРаздела = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
	
	//СохранитьДанныеРаздела(ИмяРаздела);
	
	РасчетНаКлиенте(ИмяРаздела,Область.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетНаКлиенте(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт
	
	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);
	
КонецПроцедуры

&НаСервере
Процедура РасчетНаСервере(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт
	
	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура Расчет(Форма, ИмяСтраницыПанели = "", ОбластьИмя = "")
	
	Если Форма.СтруктураРеквизитовФормы.мРежимПечати Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСтраницыПанели = "Форма300Страница1" Тогда
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.ВидДекларации, ОбластьИмя) > 0 Тогда
			
			Первоначальная = "";
			Очередная =      "";
			Дополнительная = "";
			ПоУведомлению =  "";
			Ликвидационная = "";
			
			
			Если ОбластьИмя = "Первоначальная" Тогда
				Первоначальная = "Х";
			ИначеЕсли ОбластьИмя = "Очередная" Тогда
				Очередная = "Х";
			ИначеЕсли ОбластьИмя = "Дополнительная" Тогда
				Дополнительная = "Х";
			ИначеЕсли ОбластьИмя = "ПоУведомлению" Тогда
				ПоУведомлению = "Х";
			ИначеЕсли ОбластьИмя = "Ликвидационная" Тогда
				Ликвидационная = "Х";
			Иначе
				Очередная = "Х";
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма300Страница1.Вставить("Первоначальная", Первоначальная);
			Форма.СтруктураДанныхФорма300Страница1.Вставить("Очередная",           Очередная);
			Форма.СтруктураДанныхФорма300Страница1.Вставить("Дополнительная", Дополнительная);
			Форма.СтруктураДанныхФорма300Страница1.Вставить("ПоУведомлению",   ПоУведомлению);
			Форма.СтруктураДанныхФорма300Страница1.Вставить("Ликвидационная", Ликвидационная);
			Если Не ПоУведомлению = "Х" Тогда
				Форма.СтруктураДанныхФорма300Страница1.Вставить("НомерУведомления", "");
				Форма.СтруктураДанныхФорма300Страница1.Вставить("ДатаУведомления", "");
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				Форма.ТабличныйДокумент.Области.Первоначальная.Значение = Первоначальная;
				Форма.ТабличныйДокумент.Области.Очередная.Значение = Очередная;
				Форма.ТабличныйДокумент.Области.Дополнительная.Значение = Дополнительная;
				Форма.ТабличныйДокумент.Области.ПоУведомлению.Значение = ПоУведомлению;
				Форма.ТабличныйДокумент.Области.Ликвидационная.Значение = Ликвидационная;
				Если ПоУведомлению = "Х" Тогда
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Ложь;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Ложь;
				Иначе
					Форма.ТабличныйДокумент.Области.НомерУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Истина;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.КатегорияНалПл, ОбластьИмя) > 0 Тогда
			
			Условие_A = "";
			Условие_B = "";
			
			Если ОбластьИмя = "Условие_A" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Условие_A = Форма.ТабличныйДокумент.Области.Условие_A.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("Условие_A") Тогда
					Условие_A = Форма.СтруктураДанныхФорма300Страница1.Условие_A;
				КонецЕсли;
				
				Условие_A = ?(Условие_A = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("Условие_A", Условие_A);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Условие_A.Значение = Условие_A;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Условие_B" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Условие_B = Форма.ТабличныйДокумент.Области.Условие_B.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("Условие_B") Тогда
					Условие_B = Форма.СтруктураДанныхФорма300Страница1.Условие_B;
				КонецЕсли;
				
				Условие_B = ?(Условие_B = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("Условие_B", Условие_B);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Условие_B.Значение = Условие_B;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.НаличиеПриложений, ОбластьИмя) > 0 Тогда
			
			Приложение01 = "";
			Приложение02 = "";
			Приложение03 = "";
			Приложение04 = "";
			Приложение05 = "";
			Приложение06 = "";
			Приложение07 = "";
			Приложение08 = "";
			Приложение09 = "";
			
			Если ОбластьИмя = "Приложение01" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Приложение01 = Форма.ТабличныйДокумент.Области.Приложение01.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("Приложение01") Тогда
					Приложение01 = Форма.СтруктураДанныхФорма300Страница1.Приложение01;
				КонецЕсли;
				
				Приложение01 = ?(Приложение01 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение01", Приложение01);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение01.Значение = Приложение01;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение02" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Приложение02 = Форма.ТабличныйДокумент.Области.Приложение02.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("Приложение02") Тогда
					Приложение02 = Форма.СтруктураДанныхФорма300Страница1.Приложение02;
				КонецЕсли;
				
				Приложение02 = ?(Приложение02 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение02", Приложение02);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение02.Значение = Приложение02;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение03" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Приложение03 = Форма.ТабличныйДокумент.Области.Приложение03.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("Приложение03") Тогда
					Приложение03 = Форма.СтруктураДанныхФорма300Страница1.Приложение03;
				КонецЕсли;
				
				Приложение03 = ?(Приложение03 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение03", Приложение03);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение03.Значение = Приложение03;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение04" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Приложение04 = Форма.ТабличныйДокумент.Области.Приложение04.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("Приложение04") Тогда
					Приложение04 = Форма.СтруктураДанныхФорма300Страница1.Приложение04;
				КонецЕсли;
				
				Приложение04 = ?(Приложение04 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение04", Приложение04);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение04.Значение = Приложение04;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение05" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Приложение05 = Форма.ТабличныйДокумент.Области.Приложение05.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("Приложение05") Тогда
					Приложение05 = Форма.СтруктураДанныхФорма300Страница1.Приложение05;
				КонецЕсли;
				
				Приложение05 = ?(Приложение05 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение05", Приложение05);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение05.Значение = Приложение05;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение06" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Приложение06 = Форма.ТабличныйДокумент.Области.Приложение06.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("Приложение06") Тогда
					Приложение06 = Форма.СтруктураДанныхФорма300Страница1.Приложение06;
				КонецЕсли;
				
				Приложение06 = ?(Приложение06 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение06", Приложение06);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение06.Значение = Приложение06;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение07" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Приложение07 = Форма.ТабличныйДокумент.Области.Приложение07.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("Приложение07") Тогда
					Приложение07 = Форма.СтруктураДанныхФорма300Страница1.Приложение07;
				КонецЕсли;
				
				Приложение07 = ?(Приложение07 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение07", Приложение07);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение07.Значение = Приложение07;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение08" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Приложение08 = Форма.ТабличныйДокумент.Области.Приложение08.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("Приложение08") Тогда
					Приложение08 = Форма.СтруктураДанныхФорма300Страница1.Приложение08;
				КонецЕсли;
				
				Приложение08 = ?(Приложение08 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение08", Приложение08);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение08.Значение = Приложение08;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение09" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Приложение09 = Форма.ТабличныйДокумент.Области.Приложение09.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("Приложение09") Тогда
					Приложение09 = Форма.СтруктураДанныхФорма300Страница1.Приложение09;
				КонецЕсли;
				
				Приложение09 = ?(Приложение09 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение09", Приложение09);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение09.Значение = Приложение09;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//300.00.002
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010002001, ОбластьИмя) > 0 Тогда
			
			ОкрП000110004001 = 0;
			ОкрП000610010001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110004001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110004001") Тогда
				ОкрП000110004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110004001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610010001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610010001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610010001") Тогда
				ОкрП000610010001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610010001);
			КонецЕсли;
			
			П000010002001 = ОкрП000110004001 + ОкрП000610010001;
			
			Форма.СтруктураДанныхФорма300Страница1.Вставить("П000010002001", П000010002001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010002001.Значение = П000010002001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница1", "П000010002001");  //перерасчет 1й стр. форма 300.00
			
			Расчет(Форма, "Форма300Страница2", "П000010002001");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.003A
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010003001, ОбластьИмя) > 0 Тогда
			
			ОкрП000610009001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610009001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610009001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610009001") Тогда
				ОкрП000610009001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610009001);
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма300Страница1.Вставить("П000010003001", ОкрП000610009001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010003001.Значение = ОкрП000610009001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница1", "П000010003001");  //перерасчет 1й стр. форма 300.00
			
			Расчет(Форма, "Форма300Страница2", "П000010003001");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.003B
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010003002, ОбластьИмя) > 0 Тогда
			
			ОкрП000610009002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610009002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610009002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610009002") Тогда
				ОкрП000610009002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610009002);
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма300Страница1.Вставить("П000010003002", ОкрП000610009002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010003002.Значение = ОкрП000610009002;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000010003002");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.005
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010005001, ОбластьИмя) > 0 Тогда
			
			ОкрП000210006001 = 0;
			ОкрП000610011001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210006001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210006001") Тогда
				ОкрП000210006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210006001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610011001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610011001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610011001") Тогда
				ОкрП000610011001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610011001);
			КонецЕсли;
			
			П000010005001 = ОкрП000210006001 + ОкрП000610011001;
			
			Форма.СтруктураДанныхФорма300Страница1.Вставить("П000010005001", П000010005001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010005001.Значение = П000010005001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница1", "П000010005001");  //перерасчет 1й стр. форма 300.00
			
		КонецЕсли;
		
		// 300.00.006А
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010006001, ОбластьИмя) > 0 Тогда
			
			ОкрП000010001001 = 0;
			ОкрП000010002001 = 0;
			ОкрП000010003001 = 0;
			ОкрП000010004001 = 0;
			ОкрП000010005001 = 0;
			
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010001001") Тогда
				ОкрП000010001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010001001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010002001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010002001") Тогда
				ОкрП000010002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010002001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010003001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010003001") Тогда
				ОкрП000010003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010003001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010004001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010004001") Тогда
				ОкрП000010004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010004001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010005001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010005001") Тогда
				ОкрП000010005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010005001);
			КонецЕсли;
			
			П000010006001 =  ОкрП000010001001 + ОкрП000010002001 + ОкрП000010003001 + ОкрП000010004001 + ОкрП000010005001;
			
			Форма.СтруктураДанныхФорма300Страница1.Вставить("П000010006001", П000010006001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010006001.Значение = П000010006001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000010006001");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
		
		Если    "П000010001001" = ОбластьИмя 
			ИЛИ "П000010002001" = ОбластьИмя 
			ИЛИ "П000010003001" = ОбластьИмя 
			ИЛИ "П000010006001" = ОбластьИмя 
			ИЛИ "П000010001002" = ОбластьИмя 
			ИЛИ "П000010003002" = ОбластьИмя Тогда
			
			Расчет(Форма, "Форма300Страница2", ОбластьИмя);
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300Страница2" Тогда
		
		
		//300.00.007
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020007002, ОбластьИмя) > 0 Тогда
			
			ОкрП000010001001 = 0;
			ОкрП000010002001 = 0;
			ОкрП000010003001 = 0;
			ОкрП000010006001 = 0;  //деление на 0
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010001001") Тогда
				ОкрП000010001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010001001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010002001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010002001") Тогда
				ОкрП000010002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010002001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010003001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010003001") Тогда
				ОкрП000010003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010003001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010006001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010006001") Тогда
				ОкрП000010006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010006001);
			КонецЕсли;
			
			П000020007002 = (ОкрП000010001001 + ОкрП000010002001 + ОкрП000010003001) / ?(ОкрП000010006001 = 0,1,ОкрП000010006001) * 100;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020007002", Окр(П000020007002,2));
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020007002.Значение = Окр(П000020007002,2);
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000020007002");  //перерасчет 2й стр. форма 300.00
			
			Расчет(Форма, "Форма300Страница3", "П000020007002");  //перерасчет 3й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.008
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020008002, ОбластьИмя) > 0 Тогда
			
			ОкрП000010001001 = 0;
			ОкрП000010002001 = 0;
			ОкрП000010003001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010001001") Тогда
				ОкрП000010001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010001001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010002001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010002001") Тогда
				ОкрП000010002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010002001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010003001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010003001") Тогда
				ОкрП000010003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010003001);
			КонецЕсли;
			
			СуммаДляП000020008002 = ОкрП000010001001 + ОкрП000010002001 + ОкрП000010003001;
			П000020008002 = ОкрП000010002001 / ?(СуммаДляП000020008002 = 0,1,СуммаДляП000020008002) * 100;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020008002", Окр(П000020008002,2));
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020008002.Значение = Окр(П000020008002,2);
			КонецЕсли;
			
		КонецЕсли;
		
		//300.00.011
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020011002, ОбластьИмя) > 0 Тогда
			
			ОкрП000410001002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001002") Тогда
				ОкрП000410001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001002);
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020011002", ОкрП000410001002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020011002.Значение = ОкрП000410001002;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000020011002");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.012
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020012002, ОбластьИмя) > 0 Тогда
			
			ОкрП000010001002 = 0;
			ОкрП000010003002 = 0;
			ОкрП000020010002 = 0;
			ОкрП000020011002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010001002") Тогда
				ОкрП000010001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010001002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010003002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010003002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010003002") Тогда
				ОкрП000010003002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010003002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020010002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020010002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020010002") Тогда
				ОкрП000020010002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020010002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020011002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020011002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020011002") Тогда
				ОкрП000020011002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020011002);
			КонецЕсли;
			
			П000020012002 = ОкрП000010001002 + ОкрП000010003002 + ОкрП000020010002 + ОкрП000020011002;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020012002", П000020012002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020012002.Значение = П000020012002;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница3", "П000020012002");  //перерасчет 3й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.014A
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020014001, ОбластьИмя) > 0 Тогда
			
			ОкрП000510001001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_05Страница1" Тогда
				ОкрП000510001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000510001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_05Страница1.Свойство("П000510001001") Тогда
				ОкрП000510001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_05Страница1.П000510001001);
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020014001", ОкрП000510001001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020014001.Значение = ОкрП000510001001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000020014001");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.014B
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020014002, ОбластьИмя) > 0 Тогда
			
			ОкрП000510007001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.мМетодРасчета = "Пропорциональный" ИЛИ Форма.СтруктураРеквизитовФормы.мМетодРасчета = "ПропорцИРаздел" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_05Страница1" Тогда
					ОкрП000510007001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000510007001.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300_05Страница1.Свойство("П000510007001") Тогда
					ОкрП000510007001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_05Страница1.П000510007001);
				КонецЕсли;
				
				Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020014002", ОкрП000510007001);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					Форма.ТабличныйДокумент.Области.П000020014002.Значение = ОкрП000510007001;
				КонецЕсли;
				
			Иначе
				
				ОкрП000020007002 = 0;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020007002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020007002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020007002") Тогда
					ОкрП000020007002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020007002);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_05Страница1" Тогда
					ОкрП000510007001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000510007001.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300_05Страница1.Свойство("П000510007001") Тогда
					ОкрП000510007001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_05Страница1.П000510007001);
				КонецЕсли;
				
				П000020014002 = ОкрП000510007001 * ОкрП000020007002 / 100;
				
				Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020014002", П000020014002);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					Форма.ТабличныйДокумент.Области.П000020014002.Значение = П000020014002;
				КонецЕсли;
				
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000020014002");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.017
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020017001, ОбластьИмя) > 0 Тогда
			
			ОкрП000220011001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница2" Тогда
				ОкрП000220011001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220011001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница2.Свойство("П000220011001") Тогда
				ОкрП000220011001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница2.П000220011001);
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020017001", ОкрП000220011001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020017001.Значение = ОкрП000220011001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000020017001");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.019
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020019002, ОбластьИмя) > 0 Тогда
			
			ОкрП000330000103 = 0;
			ОкрП000330000203 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница3" Тогда
				ОкрП000330000103 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000330000103.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница3.Свойство("П000330000103") Тогда
				ОкрП000330000103 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница3.П000330000103);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница3" Тогда
				ОкрП000330000203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000330000203.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница3.Свойство("П000330000203") Тогда
				ОкрП000330000203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница3.П000330000203);
			КонецЕсли;
			
			П000020019002 = ОкрП000330000103 + ОкрП000330000203;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020019002", П000020019002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020019002.Значение = П000020019002;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000020019002");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.021
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020021001, ОбластьИмя) > 0 Тогда
			
			ОкрП000020013001 = 0;
			ОкрП000020014001 = 0;
			ОкрП000020015001 = 0;
			ОкрП000020016001 = 0;
			ОкрП000020017001 = 0;
			ОкрП000020018001 = 0;
			ОкрП000020020001 = 0;
			ОкрП000030026001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020013001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020013001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020013001") Тогда
				ОкрП000020013001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020013001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020014001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020014001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020014001") Тогда
				ОкрП000020014001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020014001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020015001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020015001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020015001") Тогда
				ОкрП000020015001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020015001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020016001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020016101.Значение)
				 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020016201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020016001") Тогда
				ОкрП000020016001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020016101)
				+ РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020016201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020017001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020017001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020017001") Тогда
				ОкрП000020017001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020017001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020018001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020018001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020018001") Тогда
				ОкрП000020018001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020018001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020020001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020020001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020020001") Тогда
				ОкрП000020020001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020020001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				ОкрП000030026001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030026001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030026001") Тогда
				ОкрП000030026001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030026001);
			КонецЕсли;
			
			П000020021001 =  ОкрП000020013001 + ОкрП000020014001 + ОкрП000020015001 + ОкрП000020016001 + ОкрП000020017001 + ОкрП000020018001 + ОкрП000020020001 + ОкрП000030026001;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020021001", П000020021001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020021001.Значение = П000020021001;
			КонецЕсли;
			
		КонецЕсли;
		
		//300.00.022
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020022002, ОбластьИмя) > 0 Тогда
			
			ОкрП000620024002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница2" Тогда
				ОкрП000620024002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000620024002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница2.Свойство("П000620024002") Тогда
				ОкрП000620024002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница2.П000620024002);
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020022002", ОкрП000620024002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020022002.Значение = ОкрП000620024002;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000020022002");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.023
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020023002, ОбластьИмя) > 0 Тогда
			
			ОкрП000020013002 = 0;
			ОкрП000020014002 = 0;
			ОкрП000020016002 = 0;
			ОкрП000020019002 = 0;
			ОкрП000020020002 = 0;
			ОкрП000020022002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020013002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020013002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020013002") Тогда
				ОкрП000020013002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020013002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020014002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020014002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020014002") Тогда
				ОкрП000020014002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020014002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020016002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020016102.Значение)
				+ РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020016202.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020016002") Тогда
				ОкрП000020016002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020016102)
				+ РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020016202);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020019002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020019002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020019002") Тогда
				ОкрП000020019002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020019002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020020002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020020002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020020002") Тогда
				ОкрП000020020002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020020002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020022002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020022002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020022002") Тогда
				ОкрП000020022002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020022002);
			КонецЕсли;
			
			П000020023002 = ОкрП000020013002 + ОкрП000020014002 + ОкрП000020016002 + ОкрП000020019002 + ОкрП000020020002 + ОкрП000020022002;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020023002", П000020023002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020023002.Значение = П000020023002;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница3", "П000020023002");  //перерасчет 3й стр. форма 300.00
			
		КонецЕсли;
		
		Если "П000020023002" = ОбластьИмя 
			ИЛИ "П000020007002" = ОбластьИмя
			ИЛИ "П000020009002" = ОбластьИмя 
			ИЛИ "П000020012002" = ОбластьИмя Тогда
			
			Расчет(Форма, "Форма300Страница3", ОбластьИмя); //перерасчет 3й стр. форма 300.00
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300Страница3" Тогда
		
		//300.00.024
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030024002, ОбластьИмя) > 0 Тогда
			
			ОкрП000030024102 = 0;
			ОкрП000030024202 = 0;
			ОкрП000030024302 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				ОкрП000030024102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030024102.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030024102") Тогда
				ОкрП000030024102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030024102);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				ОкрП000030024202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030024202.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030024202") Тогда
				ОкрП000030024202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030024202);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				ОкрП000030024302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030024302.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030024302") Тогда
				ОкрП000030024302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030024302);
			КонецЕсли;
			
			П000030024002 = ОкрП000030024102 + ОкрП000030024202 + ОкрП000030024302;
			
			Форма.СтруктураДанныхФорма300Страница3.Вставить("П000030024002", П000030024002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030024002.Значение = П000030024002;
			КонецЕсли;
			
		КонецЕсли;
		
		//300.00.025 I
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030025102, ОбластьИмя) > 0 Тогда
			
			ОкрП000020023002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.мМетодРасчета = "Раздельный" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020023002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020023002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020023002") Тогда
					ОкрП000020023002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020023002);
				КонецЕсли;
				
			КонецЕсли;
			
			П000030025102 = ОкрП000020023002;
			
			Форма.СтруктураДанныхФорма300Страница3.Вставить("П000030025102", П000030025102);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030025102.Значение = П000030025102;
			КонецЕсли;
			
		КонецЕсли;
		
		//300.00.025 II
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030025202, ОбластьИмя) > 0 Тогда
			
			ОкрП000020023002 = 0;
			ОкрП000020007002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.мМетодРасчета = "Пропорциональный" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020023002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020023002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020023002") Тогда
					ОкрП000020023002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020023002);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020007002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020007002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020007002") Тогда
					ОкрП000020007002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020007002);
				КонецЕсли;
				
			КонецЕсли;
			
			П000030025202 = ОкрП000020023002 * ОкрП000020007002;
			
			Форма.СтруктураДанныхФорма300Страница3.Вставить("П000030025202", П000030025202);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030025202.Значение = П000030025202;
			КонецЕсли;
			
		КонецЕсли;
		
		//300.00.025 III
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030025302, ОбластьИмя) > 0 Тогда
			
			ОкрП000030024102 = 0;
			ОкрП000020009002 = 0;
			ОкрП000030024302 = 0;
			ОкрП000020007002 = 0;
			ОкрП000030024202 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.мМетодРасчета = "ПропорцИРаздел" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030024102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030024102.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030024102") Тогда
					ОкрП000030024102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030024102);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020009002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020009002") Тогда
					ОкрП000020009002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020009002);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030024302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030024302.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030024302") Тогда
					ОкрП000030024302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030024302);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020007002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020007002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020007002") Тогда
					ОкрП000020007002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020007002);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030024202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030024202.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030024202") Тогда
					ОкрП000030024202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030024202);
				КонецЕсли;
				
			КонецЕсли;
			
			П000030025302 = (ОкрП000030024102 * ОкрП000020009002)+(ОкрП000030024302 * ОкрП000020007002) + ОкрП000030024202;
			
			Форма.СтруктураДанныхФорма300Страница3.Вставить("П000030025302", П000030025302);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030025302.Значение = П000030025302;
			КонецЕсли;
			
		КонецЕсли;
		
		//300.00.026A 
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030026001, ОбластьИмя) > 0 Тогда
			
			ОкрП000410001001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001001") Тогда
				ОкрП000410001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001001);
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма300Страница3.Вставить("П000030026001", ОкрП000410001001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030026001.Значение = ОкрП000410001001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница3", "П000030026001");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.026B
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030026002, ОбластьИмя) > 0 Тогда
			
			ОкрП000410001002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001002") Тогда
				ОкрП000410001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001002);
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000030026002", ОкрП000410001002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000030026002.Значение = ОкрП000410001002;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница3", "П000030026002");  //перерасчет 3й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.027 I
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030027102, ОбластьИмя) > 0 Тогда
			
			Если Форма.СтруктураРеквизитовФормы.мМетодРасчета = "Раздельный" Тогда
				
				ОкрП000020012002 = 0;
				ОкрП000030025102 = 0;
				ОкрП000030026002 = 0;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020012002") Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020012002);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030025102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030025102.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030025102") Тогда
					ОкрП000030025102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030025102);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030026002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030026002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030026002") Тогда
					ОкрП000030026002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030026002);
				КонецЕсли;
				
				П000030027102 = ОкрП000020012002 - ОкрП000030025102 - ОкрП000030026002;
				
				//Форма.СтруктураДанныхФорма300Страница3.Вставить("П000030027102", П000030027102);
				//Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				//	Форма.ТабличныйДокумент.Области.П000030027102.Значение = П000030027102;
				//КонецЕсли;
				
				
			ИначеЕсли Форма.СтруктураРеквизитовФормы.мМетодРасчета = "Пропорциональный" Тогда
				
				ОкрП000020012002 = 0;
				ОкрП000030025202 = 0;
				ОкрП000030026002 = 0;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020012002") Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020012002);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030025202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030025202.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030025202") Тогда
					ОкрП000030025202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030025202);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030026002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030026002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030026002") Тогда
					ОкрП000030026002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030026002);
				КонецЕсли;
				
				П000030027102 = ОкрП000020012002 - ОкрП000030025202- ОкрП000030026002;
				
				//Форма.СтруктураДанныхФорма300Страница3.Вставить("П000030027102", П000030027102);
				//Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				//	Форма.ТабличныйДокумент.Области.П000030027102.Значение = П000030027102;
				//КонецЕсли;
				
				
			ИначеЕсли Форма.СтруктураРеквизитовФормы.мМетодРасчета = "ПропорцИРаздел" Тогда
				
				ОкрП000020012002 = 0;
				ОкрП000030025302 = 0;
				ОкрП000030026002 = 0;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020012002") Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020012002);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030025302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030025302.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030025302") Тогда
					ОкрП000030025302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030025302);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030026002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030026002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030026002") Тогда
					ОкрП000030026002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030026002);
				КонецЕсли;
				
				П000030027102 = ОкрП000020012002 - ОкрП000030025302- ОкрП000030026002;
				
				//Форма.СтруктураДанныхФорма300Страница3.Вставить("П000030027102", П000030027102);
				//Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				//	Форма.ТабличныйДокумент.Области.П000030027102.Значение = П000030027102;
				//КонецЕсли;
				
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма300Страница3.Вставить("П000030027102", П000030027102);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030027102.Значение = ?(П000030027102 > 0, П000030027102, 0);
			КонецЕсли;

			
		КонецЕсли;
		
		//300.00.027 II
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030027202, ОбластьИмя) > 0 Тогда
			
			//Если Форма.СтруктураРеквизитовФормы.мМетодРасчета = "Раздельный" Тогда
			//	
			//	ОкрП000030025102 = 0;
			//	ОкрП000030026002 = 0;
			//	ОкрП000020012002 = 0;
			//	
			//	Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
			//		ОкрП000030025102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030025102.Значение);
			//	ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030025102") Тогда
			//		ОкрП000030025102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030025102);
			//	КонецЕсли;
			//	
			//	Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
			//		ОкрП000030026002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030026002.Значение);
			//	ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030026002") Тогда
			//		ОкрП000030026002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030026002);
			//	КонецЕсли;
			//	
			//	Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
			//		ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012002.Значение);
			//	ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020012002") Тогда
			//		ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020012002);
			//	КонецЕсли;
			//	
			//	П000030027202 = ОкрП000030025102 + ОкрП000030026002 - ОкрП000020012002;
			//	
			//	//Форма.СтруктураДанныхФорма300Страница3.Вставить("П000030027202", П000030027202);
			//	//Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
			//	//	Форма.ТабличныйДокумент.Области.П000030027202.Значение = П000030027202;
			//	//КонецЕсли;
			//	
			//ИначеЕсли Форма.СтруктураРеквизитовФормы.мМетодРасчета = "Пропорциональный" Тогда
			//	
			//	ОкрП000030025202 = 0;
			//	ОкрП000030026002 = 0;
			//	ОкрП000020012002 = 0;
			//	
			//	Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
			//		ОкрП000030025202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030025202.Значение);
			//	ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030025202") Тогда
			//		ОкрП000030025202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030025202);
			//	КонецЕсли;
			//	
			//	Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
			//		ОкрП000030026002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030026002.Значение);
			//	ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030026002") Тогда
			//		ОкрП000030026002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030026002);
			//	КонецЕсли;
			//	
			//	Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
			//		ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012002.Значение);
			//	ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020012002") Тогда
			//		ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020012002);
			//	КонецЕсли;
			//	
			//	П000030027202 = ОкрП000030025202 + ОкрП000030026002 - ОкрП000020012002;
			//	
			//	//Форма.СтруктураДанныхФорма300Страница3.Вставить("П000030027202", П000030027202);
			//	//Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
			//	//	Форма.ТабличныйДокумент.Области.П000030027202.Значение = П000030027202;
			//	//КонецЕсли;
			//	
			//	
			//ИначеЕсли Форма.СтруктураРеквизитовФормы.мМетодРасчета = "ПропорцИРаздел" Тогда
			//	
			//	ОкрП000030025302 = 0;
			//	ОкрП000030026002 = 0;
			//	ОкрП000020012002 = 0;
			//	
			//	Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
			//		ОкрП000030025302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030025302.Значение);
			//	ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030025302") Тогда
			//		ОкрП000030025302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030025302);
			//	КонецЕсли;
			//	
			//	Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
			//		ОкрП000030026002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030026002.Значение);
			//	ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030026002") Тогда
			//		ОкрП000030026002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030026002);
			//	КонецЕсли;
			//	
			//	Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
			//		ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012002.Значение);
			//	ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020012002") Тогда
			//		ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020012002);
			//	КонецЕсли;
			//	
			//	П000030027202 = ОкрП000030025302 + ОкрП000030026002 - ОкрП000020012002;
			//	
			//	//Форма.СтруктураДанныхФорма300Страница3.Вставить("П000030027202", П000030027202);
			//	//Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
			//	//	Форма.ТабличныйДокумент.Области.П000030027202.Значение = П000030027202;
			//	//КонецЕсли;
			//	
			//КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.мМетодРасчета = "Раздельный" Тогда
				
				ОкрП000020012002 = 0;
				ОкрП000030025102 = 0;
				ОкрП000030026002 = 0;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020012002") Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020012002);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030025102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030025102.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030025102") Тогда
					ОкрП000030025102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030025102);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030026002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030026002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030026002") Тогда
					ОкрП000030026002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030026002);
				КонецЕсли;
				
				П000030027202 = ОкрП000020012002 - ОкрП000030025102 - ОкрП000030026002;
				
			ИначеЕсли Форма.СтруктураРеквизитовФормы.мМетодРасчета = "Пропорциональный" Тогда
				
				ОкрП000020012002 = 0;
				ОкрП000030025202 = 0;
				ОкрП000030026002 = 0;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020012002") Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020012002);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030025202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030025202.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030025202") Тогда
					ОкрП000030025202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030025202);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030026002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030026002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030026002") Тогда
					ОкрП000030026002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030026002);
				КонецЕсли;
				
				П000030027202 = ОкрП000020012002 - ОкрП000030025202- ОкрП000030026002;
				
			ИначеЕсли Форма.СтруктураРеквизитовФормы.мМетодРасчета = "ПропорцИРаздел" Тогда
				
				ОкрП000020012002 = 0;
				ОкрП000030025302 = 0;
				ОкрП000030026002 = 0;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020012002") Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020012002);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030025302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030025302.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030025302") Тогда
					ОкрП000030025302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030025302);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030026002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030026002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030026002") Тогда
					ОкрП000030026002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030026002);
				КонецЕсли;
				
				П000030027202 = ОкрП000020012002 - ОкрП000030025302- ОкрП000030026002;
				
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма300Страница3.Вставить("П000030027202", П000030027202);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030027202.Значение = ?(П000030027202 < 0, -П000030027202, 0);
			КонецЕсли
				
		КонецЕсли;
		
		//300.00.032
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030032002, ОбластьИмя) > 0 Тогда
			
			ОкрП000110008001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110008001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110008001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110008001") Тогда
				ОкрП000110008001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110008001);
			КонецЕсли;
			
			П000030032002 = ОкрП000110008001;
			
			Форма.СтруктураДанныхФорма300Страница3.Вставить("П000030032002", П000030032002);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030032002.Значение = П000030032002;
			КонецЕсли;
			
			
		КонецЕсли;
		
		
		Если "П000030026001" = ОбластьИмя Тогда
			
			Расчет(Форма, "Форма300Страница2", ОбластьИмя);
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300Страница4" Тогда
		
		Если ОбластьИмя = "ОтказОтВозврата" Тогда
			
			ОтказОтВозврата = Форма.ТабличныйДокумент.Области.ОтказОтВозврата.Значение;
			
			Если ОтказОтВозврата = "" Тогда 
				ОтказОтВозврата = "Х";
			Иначе 
				ОтказОтВозврата = "";
			КонецЕсли;
			
			Форма.ТабличныйДокумент.Области.ОтказОтВозврата.Значение = ОтказОтВозврата;
			Форма.СтруктураДанныхФорма300Страница4.Вставить("ОтказОтВозврата", ОтказОтВозврата);
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_01Страница1" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение01", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение01.Значение = "Х";
		КонецЕсли;
		
		//300.01.001
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000110001001, ОбластьИмя) > 0 Тогда
			
			ОкрП000110001101 = 0;
			ОкрП000110001201 = 0;
			ОкрП000110001301 = 0;
			ОкрП000110001401 = 0;
			ОкрП000110001501 = 0;
			ОкрП000110001001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110001101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110001101") Тогда
				ОкрП000110001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110001101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110001201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110001201") Тогда
				ОкрП000110001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110001201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110001301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110001301") Тогда
				ОкрП000110001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110001301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110001401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110001401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110001401") Тогда
				ОкрП000110001401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110001401);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110001501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110001501.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110001501") Тогда
				ОкрП000110001501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110001501);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110001001") Тогда
				ОкрП000110001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110001001);
			КонецЕсли;
			
			СуммаДляП000110001001 = ОкрП000110001101 + ОкрП000110001201 + ОкрП000110001301 + ОкрП000110001401 + ОкрП000110001501;
			
			
			Если ОбластьИмя = "П000110001001" Тогда //Изменили итоговую строку
				
				Форма.СтруктураДанныхФорма300_01Страница1.Вставить("П000110001001", ОкрП000110001001);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
					Форма.ТабличныйДокумент.Области.П000110001001.Значение = ОкрП000110001001;
				КонецЕсли;
				
				Если СуммаДляП000110001001 > ОкрП000110001001 Тогда
					Форма.СтруктураДанныхФорма300_01Страница1.Вставить("П000110001101", 0);
					Форма.СтруктураДанныхФорма300_01Страница1.Вставить("П000110001201", 0);
					Форма.СтруктураДанныхФорма300_01Страница1.Вставить("П000110001301", 0);
					Форма.СтруктураДанныхФорма300_01Страница1.Вставить("П000110001401", 0);
					Форма.СтруктураДанныхФорма300_01Страница1.Вставить("П000110001501", 0);
					
					Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
						Форма.ТабличныйДокумент.Области.П000110001101.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000110001201.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000110001301.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000110001401.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000110001501.Значение = 0;
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе //Изменили подстроки I-V
				
				Если Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110001101") Тогда
					П000110001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110001101);
				Иначе
					П000110001101 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110001201") Тогда
					П000110001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110001201);
				Иначе
					П000110001201 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110001301") Тогда
					П000110001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110001301);
				Иначе
					П000110001301 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110001401") Тогда
					П000110001401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110001401);
				Иначе
					П000110001401 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110001501") Тогда
					П000110001501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110001501);
				Иначе
					П000110001501 = 0;
				КонецЕсли;
				
				П000110001001= СуммаДляП000110001001 + ОкрП000110001001 - (П000110001101 + П000110001201 + П000110001301 + П000110001401 + П000110001501);
				
				Форма.СтруктураДанныхФорма300_01Страница1.Вставить("П000110001001", П000110001001);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
					Форма.ТабличныйДокумент.Области.П000110001001.Значение = П000110001001;
				КонецЕсли;
				
				//Дозапишем данные в структуру по изменяемой ячейке.
				ЗначениеИзСтруктуры = ?(Форма.СтруктураДанныхФорма300_01Страница1.Свойство(ОбластьИмя),
				РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1[ОбластьИмя]),0);
				
				Форма.СтруктураДанныхФорма300_01Страница1.Вставить(ОбластьИмя,ЗначениеИзСтруктуры +(П000110001001 - ОкрП000110001001));
				
			КонецЕсли;
			
			
		КонецЕсли;
		
		//300.01.004
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000110004001, ОбластьИмя) > 0 Тогда
			
			ОкрП000110001001 = 0;
			ОкрП000110002001 = 0;
			ОкрП000110003001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110001001") Тогда
				ОкрП000110001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110001001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110002001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110002001") Тогда
				ОкрП000110002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110002001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110003001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110003001") Тогда
				ОкрП000110003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110003001);
			КонецЕсли;
			
			П000110004001 = ОкрП000110001001 + ОкрП000110002001 + ОкрП000110003001;
			
			Форма.СтруктураДанныхФорма300_01Страница1.Вставить("П000110004001", П000110004001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000110004001.Значение = П000110004001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница1", "П000110004001");  //перерасчет 1й стр. форма 300.00
			
		КонецЕсли;
		
		//300.01.008
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000110008001, ОбластьИмя) > 0 Тогда
			
			ОкрП000110005001 = 0;
			ОкрП000110006001 = 0;
			ОкрП000110007001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110005001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110005001") Тогда
				ОкрП000110005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110005001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110006001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110006001") Тогда
				ОкрП000110006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110006001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110007001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110007001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110007001") Тогда
				ОкрП000110007001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110007001);
			КонецЕсли;
			
			П000110008001 = ОкрП000110005001 + ОкрП000110006001 + ОкрП000110007001;
			
			Форма.СтруктураДанныхФорма300_01Страница1.Вставить("П000110008001", П000110008001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000110008001.Значение = П000110008001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница3", "П000110008001");  //перерасчет 3й стр. форма 300.00
			
		КонецЕсли;
		
		Если "П000610010001" = ОбластьИмя Тогда
			
			Расчет(Форма, "Форма300Страница1", ОбластьИмя);
			
		ИначеЕсли "П000110008001" = ОбластьИмя Тогда
			
			Расчет(Форма, "Форма300Страница3", ОбластьИмя);
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_02Страница1" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение02", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение02.Значение = "Х";
		КонецЕсли;
		
		//300.02.006
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210006001, ОбластьИмя) > 0 Тогда
			
			ОкрП000210001001 = 0;
			ОкрП000210002001 = 0;
			ОкрП000210003001 = 0;
			ОкрП000210004001 = 0;
			ОкрП000210005001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210001001") Тогда
				ОкрП000210001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210001001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210002001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210002001") Тогда
				ОкрП000210002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210002001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210003001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210003001") Тогда
				ОкрП000210003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210003001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210004001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210004001") Тогда
				ОкрП000210004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210004001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210005001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210005001") Тогда
				ОкрП000210005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210005001);
			КонецЕсли;
			
			П000210006001 = ОкрП000210001001 + ОкрП000210002001 + ОкрП000210003001 + ОкрП000210004001 + ОкрП000210005001;
			
			Форма.СтруктураДанныхФорма300_02Страница1.Вставить("П000210006001", П000210006001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000210006001.Значение = П000210006001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница1", "П000210006001");  //перерасчет 1й стр. форма 300.00
			
		КонецЕсли;
		
		//300.02.007
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210007001, ОбластьИмя) > 0 Тогда
			
			ОкрП000210007001 = 0;
			ОкрП000210007101 = 0;
			ОкрП000210007201 = 0;
			ОкрП000210007301 = 0;
			ОкрП000210007401 = 0;
			ОкрП000210007501 = 0;
			
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210007001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210007001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210007001") Тогда
				ОкрП000210007001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210007001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210007101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210007101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210007101") Тогда
				ОкрП000210007101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210007101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210007201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210007201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210007201") Тогда
				ОкрП000210007201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210007201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210007301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210007301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210007301") Тогда
				ОкрП000210007301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210007301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210007401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210007401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210007401") Тогда
				ОкрП000210007401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210007401);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210007501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210007501.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210007501") Тогда
				ОкрП000210007501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210007501);
			КонецЕсли;
			
			СуммаДляП000210007001 = ОкрП000210007101 + ОкрП000210007201 + ОкрП000210007301 + ОкрП000210007401 + ОкрП000210007501;
			
			Если ОбластьИмя = "П000210007001" Тогда //Изменили итоговую строку
				
				Форма.СтруктураДанныхФорма300_02Страница1.Вставить("П000210007001", ОкрП000210007001);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
					Форма.ТабличныйДокумент.Области.П000210007001.Значение = ОкрП000210007001;
				КонецЕсли;
				
				Если СуммаДляП000210007001 > ОкрП000210007001 Тогда
					Форма.СтруктураДанныхФорма300_02Страница1.Вставить("П000210007101", 0);
					Форма.СтруктураДанныхФорма300_02Страница1.Вставить("П000210007201", 0);
					Форма.СтруктураДанныхФорма300_02Страница1.Вставить("П000210007301", 0);
					Форма.СтруктураДанныхФорма300_02Страница1.Вставить("П000210007401", 0);
					Форма.СтруктураДанныхФорма300_02Страница1.Вставить("П000210007501", 0);
					
					Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
						
						Форма.ТабличныйДокумент.Области.П000210007101.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000210007201.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000210007301.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000210007401.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000210007501.Значение = 0;
						
					КонецЕсли;
					
					
				КонецЕсли;
				
			Иначе //Изменили подстроки I-V
				
				Если Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210007101") Тогда
					П000210007101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210007101);
				Иначе
					П000210007101 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210007201") Тогда
					П000210007201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210007201);
				Иначе
					П000210007201 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210007301") Тогда
					П000210007301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210007301);
				Иначе
					П000210007301 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210007401") Тогда
					П000210007401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210007401);
				Иначе
					П000210007401 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210007501") Тогда
					П000210007501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210007501);
				Иначе
					П000210007501 = 0;
				КонецЕсли;
				
				П000210007001= СуммаДляП000210007001 + ОкрП000210007001 - (П000210007101 + П000210007201 + П000210007301 + П000210007401 + П000210007501);
				
				Форма.СтруктураДанныхФорма300_02Страница1.Вставить("П000210007001", П000210007001);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
					Форма.ТабличныйДокумент.Области.П000210007001.Значение = П000210007001;
				КонецЕсли;
				
				//Дозапишем данные в структуру по изменяемой ячейке.
				ЗначениеИзСтруктуры = ?(Форма.СтруктураДанныхФорма300_02Страница1.Свойство(ОбластьИмя),
				РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1[ОбластьИмя]),0);
				
				Форма.СтруктураДанныхФорма300_02Страница1.Вставить(ОбластьИмя,ЗначениеИзСтруктуры +(П000210007001 - ОкрП000210007001));
				
			КонецЕсли;
			
			Расчет(Форма, "Форма300_02Страница2", "П000210007001");  //перерасчет 2й стр. форма 300.02
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_02Страница2" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение02", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение02.Значение = "Х";
		КонецЕсли;
		
		//300.02.011
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000220011001, ОбластьИмя) > 0 Тогда
			
			ОкрП000210007001 = 0;
			ОкрП000220008001 = 0;
			ОкрП000220009001 = 0;
			ОкрП000220010001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210007001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210007001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210007001") Тогда
				ОкрП000210007001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210007001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница2" Тогда
				ОкрП000220008001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220008001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница2.Свойство("П000220008001") Тогда
				ОкрП000220008001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница2.П000220008001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница2" Тогда
				ОкрП000220009001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220009001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница2.Свойство("П000220009001") Тогда
				ОкрП000220009001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница2.П000220009001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница2" Тогда
				ОкрП000220010001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220010001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница2.Свойство("П000220010001") Тогда
				ОкрП000220010001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница2.П000220010001);
			КонецЕсли;
			
			П000220011001 = ОкрП000210007001 + ОкрП000220008001 + ОкрП000220009001 + ОкрП000220010001;
			
			Форма.СтруктураДанныхФорма300_02Страница2.Вставить("П000220011001", П000220011001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000220011001.Значение = П000220011001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000220011001");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_03Страница1" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение03", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение03.Значение = "Х";
		КонецЕсли;
		
		Если    "П000310000104" = ОбластьИмя 
			ИЛИ "П000310000204" = ОбластьИмя 
			ИЛИ "П000310000304" = Лев(ОбластьИмя,13) Тогда
			
			Расчет(Форма, "Форма300_03Страница2", ОбластьИмя);  //перерасчет 2й стр. форма 300.03
			Расчет(Форма, "Форма300_03Страница3", ОбластьИмя);  //перерасчет 3й стр. форма 300.03
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_03Страница2" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение03", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение03.Значение = "Х";
		КонецЕсли;
		
		//00000001H
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000320000104, ОбластьИмя) > 0 Тогда
			
			ОкрП000310000104 = 0;
			ОкрП000320000102 = 0;
			ОкрП000320000103 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница1" Тогда
				ОкрП000310000104 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000310000104.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница1.Свойство("П000310000104") Тогда
				ОкрП000310000104 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница1.П000310000104);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				ОкрП000320000102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320000102.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница2.Свойство("П000320000102") Тогда
				ОкрП000320000102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница2.П000320000102);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				ОкрП000320000103 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320000103.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница2.Свойство("П000320000103") Тогда
				ОкрП000320000103 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница2.П000320000103);
			КонецЕсли;
			
			П000320000104 = ОкрП000310000104 - (ОкрП000320000102 + ОкрП000320000103);
			
			Форма.СтруктураДанныхФорма300_03Страница2.Вставить("П000320000104", П000320000104);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000320000104.Значение = П000320000104;
			КонецЕсли;
			
		КонецЕсли;
		
		//00000002H
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000320000204, ОбластьИмя) > 0 Тогда
			
			ОкрП000310000204 = 0;
			ОкрП000320000202 = 0;
			ОкрП000320000203 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница1" Тогда
				ОкрП000310000204 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000310000204.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница1.Свойство("П000310000204") Тогда
				ОкрП000310000204 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница1.П000310000204);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				ОкрП000320000202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320000202.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница2.Свойство("П000320000202") Тогда
				ОкрП000320000202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница2.П000320000202);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				ОкрП000320000203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320000203.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница2.Свойство("П000320000203") Тогда
				ОкрП000320000203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница2.П000320000203);
			КонецЕсли;
			
			П000320000204 = ОкрП000310000204 - (ОкрП000320000202 + ОкрП000320000203);
			
			Форма.СтруктураДанныхФорма300_03Страница2.Вставить("П000320000204", П000320000204);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000320000204.Значение = П000320000204;
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000320000304, Лев(ОбластьИмя,13)) > 0 Тогда
			
			Префикс = Сред(ОбластьИмя,Найти(ОбластьИмя,"_"),СтрДлина(ОбластьИмя) - (Найти(ОбластьИмя,"_")-1));
			Индекс = Число(Прав(Префикс,СтрДлина(Префикс)-1)) - 1;
			
			ОкрП000310000304 = 0;
			ОкрП000320000302 = 0;
			ОкрП000320000303 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница1" Тогда
				ОкрП000310000304 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000310000304" + Префикс].Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница1.Свойство("П000310000304" + Префикс) Тогда
				ОкрП000310000304 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница1["П000310000304" + Префикс]);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				ОкрП000320000302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000320000302" + Префикс].Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница2.Свойство("П000320000302" + Префикс) Тогда
				ОкрП000320000302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница2["П000320000302" + Префикс]);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				ОкрП000320000303 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000320000303" + Префикс].Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница2.Свойство("П000320000303" + Префикс) Тогда
				ОкрП000320000303 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница2["П000320000303" + Префикс]);
			КонецЕсли;
			
			П000320000304 = ОкрП000310000304 - (ОкрП000320000302 + ОкрП000320000303);
			
			Форма.СтруктураДанныхФорма300_03Страница2.Вставить("П000320000304" + Префикс, П000320000304);
			
			Форма.П0003200003[Индекс].П000320000304 = П000320000304;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				Форма.ТабличныйДокумент.Области["П000320000304" + Префикс].Значение = П000320000304;
			КонецЕсли;
			
		КонецЕсли;
		
		
		Если    "П000320000102" = ОбластьИмя 
			ИЛИ "П000320000103" = ОбластьИмя 
			ИЛИ "П000320000202" = ОбластьИмя 
			ИЛИ "П000320000203" = ОбластьИмя
			ИЛИ "П000320000302" = Лев(ОбластьИмя,13)
			ИЛИ "П000320000303" = Лев(ОбластьИмя,13) Тогда
			
			Расчет(Форма, "Форма300_03Страница3", ОбластьИмя);  //перерасчет 3й стр. форма 300.03
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_03Страница3" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение03", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение03.Значение = "Х";
		КонецЕсли;
		
		//00000001L
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000330000105, ОбластьИмя) > 0 Тогда
			
			ОкрП000310000104 = 0;
			ОкрП000320000102 = 0;
			ОкрП000320000103 = 0;
			ОкрП000330000103 = 0;
			ОкрП000330000104 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница1" Тогда
				ОкрП000310000104 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000310000104.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница1.Свойство("П000310000104") Тогда
				ОкрП000310000104 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница1.П000310000104);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				ОкрП000320000102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320000102.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница2.Свойство("П000320000102") Тогда
				ОкрП000320000102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница2.П000320000102);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				ОкрП000320000103 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320000103.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница2.Свойство("П000320000103") Тогда
				ОкрП000320000103 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница2.П000320000103);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница3" Тогда
				ОкрП000330000103 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000330000103.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница3.Свойство("П000330000103") Тогда
				ОкрП000330000103 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница3.П000330000103);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница3" Тогда
				ОкрП000330000104 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000330000104.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница3.Свойство("П000330000104") Тогда
				ОкрП000330000104 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница3.П000330000104);
			КонецЕсли;
			
			П000330000105 = ОкрП000310000104 - (ОкрП000320000102 + ОкрП000320000103 + ОкрП000330000103 + ОкрП000330000104);
			
			Форма.СтруктураДанныхФорма300_03Страница3.Вставить("П000330000105", П000330000105);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000330000105.Значение = П000330000105;
			КонецЕсли;
			
		КонецЕсли;
		
		//00000002L
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000330000205, ОбластьИмя) > 0 Тогда
			
			ОкрП000310000204 = 0;
			ОкрП000320000202 = 0;
			ОкрП000320000203 = 0;
			ОкрП000330000203 = 0;
			ОкрП000330000204 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница1" Тогда
				ОкрП000310000204 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000310000204.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница1.Свойство("П000310000204") Тогда
				ОкрП000310000204 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница1.П000310000204);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				ОкрП000320000202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320000202.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница2.Свойство("П000320000202") Тогда
				ОкрП000320000202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница2.П000320000202);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				ОкрП000320000203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320000203.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница2.Свойство("П000320000203") Тогда
				ОкрП000320000203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница2.П000320000203);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница3" Тогда
				ОкрП000330000203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000330000203.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница3.Свойство("П000330000203") Тогда
				ОкрП000330000203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница3.П000330000203);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница3" Тогда
				ОкрП000330000204 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000330000204.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница3.Свойство("П000330000204") Тогда
				ОкрП000330000204 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница3.П000330000204);
			КонецЕсли;
			
			П000330000205 = ОкрП000310000204 - (ОкрП000320000202 + ОкрП000320000203 + ОкрП000330000203 + ОкрП000330000204);
			
			Форма.СтруктураДанныхФорма300_03Страница3.Вставить("П000330000205", П000330000205);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000330000205.Значение = П000330000205;
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000330000305, Лев(ОбластьИмя,13)) > 0 Тогда
			
			Префикс = Сред(ОбластьИмя,Найти(ОбластьИмя,"_"),СтрДлина(ОбластьИмя) - (Найти(ОбластьИмя,"_")-1));
			Индекс = Число(Прав(Префикс,СтрДлина(Префикс)-1)) - 1;
			
			ОкрП000310000304 = 0;
			ОкрП000320000302 = 0;
			ОкрП000320000303 = 0;
			ОкрП000330000303 = 0;
			ОкрП000330000304 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница1" Тогда
				ОкрП000310000304 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000310000304"+Префикс].Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница1.Свойство("П000310000304" + Префикс) Тогда
				ОкрП000310000304 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница1["П000310000304"+Префикс]);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				ОкрП000320000302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000320000302"+Префикс].Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница2.Свойство("П000320000302" + Префикс) Тогда
				ОкрП000320000302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница2["П000320000302"+Префикс]);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				ОкрП000320000303 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000320000303"+Префикс].Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница2.Свойство("П000320000203" + Префикс) Тогда
				ОкрП000320000303 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница2["П000320000303"+Префикс]);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница3" Тогда
				ОкрП000330000303 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000330000303"+Префикс].Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница3.Свойство("П000330000303" + Префикс) Тогда
				ОкрП000330000303 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница3["П000330000303"+Префикс]);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница3" Тогда
				ОкрП000330000304 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000330000304"+Префикс].Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница3.Свойство("П000330000304" + Префикс) Тогда
				ОкрП000330000304 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница3["П000330000304"+Префикс]);
			КонецЕсли;
			
			П000330000305 = ОкрП000310000304 - (ОкрП000320000302 + ОкрП000320000303 + ОкрП000330000303 + ОкрП000330000304);
			
			Форма.СтруктураДанныхФорма300_03Страница3.Вставить("П000330000305" + Префикс, П000330000305);
			
			Форма.П0003300003[Индекс].П000330000305 = П000330000305;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница3" Тогда
				Форма.ТабличныйДокумент.Области["П000330000305"+Префикс].Значение = П000330000305;
			КонецЕсли;
			
		КонецЕсли;
		
		Если    "П000330000103" = ОбластьИмя 
			ИЛИ "П000330000203" = ОбластьИмя Тогда
			
			Расчет(Форма, "Форма300Страница2", ОбластьИмя);  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_04Страница1" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение04", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение04.Значение = "Х";
		КонецЕсли;
		
		//300.04.001A
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000410001001, ОбластьИмя) > 0 Тогда
			
			ОкрП000410001001 = 0;
			ОкрП000410001101 = 0;
			ОкрП000410001201 = 0;
			ОкрП000410001301 = 0;
			ОкрП000410001401 = 0;
			ОкрП000410001501 = 0;
			ОкрП000410001601 = 0;
			ОкрП000410001701 = 0;
			ОкрП000410001801 = 0;
			ОкрП000410001901 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001001") Тогда
				ОкрП000410001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001101") Тогда
				ОкрП000410001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001201") Тогда
				ОкрП000410001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001301") Тогда
				ОкрП000410001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001401") Тогда
				ОкрП000410001401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001401);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001501.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001501") Тогда
				ОкрП000410001501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001501);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001601.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001601") Тогда
				ОкрП000410001601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001601);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001701 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001701.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001701") Тогда
				ОкрП000410001701 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001701);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001801 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001801.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001801") Тогда
				ОкрП000410001801 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001801);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001901 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001901.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001901") Тогда
				ОкрП000410001901 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001901);
			КонецЕсли;
			
			СуммаДляП000410001001 = ОкрП000410001101 + ОкрП000410001201 + ОкрП000410001301 + ОкрП000410001401 + ОкрП000410001501 + ОкрП000410001601 + ОкрП000410001701 + ОкрП000410001801 + ОкрП000410001901;
			
			Если ОбластьИмя = "П000410001001" Тогда //Изменили итоговую строку
				
				Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001001", ОкрП000410001001);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
					Форма.ТабличныйДокумент.Области.П000410001001.Значение = ОкрП000410001001;
				КонецЕсли;
				
				Если СуммаДляП000410001001 > ОкрП000410001001 Тогда
					
					Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001101", 0);
					Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001201", 0);
					Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001301", 0);
					Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001401", 0);
					Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001501", 0);
					Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001601", 0);
					Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001701", 0);
					Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001801", 0);
					Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001901", 0);
					
					
					Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
						
						Форма.ТабличныйДокумент.Области.П000410001101.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000410001201.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000410001301.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000410001401.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000410001501.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000410001601.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000410001701.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000410001801.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000410001901.Значение = 0;
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе //Изменили подстроки I-IX
				
				Если Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001101") Тогда
					П000410001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001101);
				Иначе
					П000410001101 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001201") Тогда
					П000410001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001201);
				Иначе
					П000410001201 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001301") Тогда
					П000410001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001301);
				Иначе
					П000410001301 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001401") Тогда
					П000410001401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001401);
				Иначе
					П000410001401 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001501") Тогда
					П000410001501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001501);
				Иначе
					П000410001501 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001601") Тогда
					П000410001601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001601);
				Иначе
					П000410001601 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001701") Тогда
					П000410001701 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001701);
				Иначе
					П000410001701 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001801") Тогда
					П000410001801 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001801);
				Иначе
					П000410001801 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001901") Тогда
					П000410001901 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001901);
				Иначе
					П000410001901 = 0;
				КонецЕсли;
				
				П000410001001 = СуммаДляП000410001001 + ОкрП000410001001 - (П000410001101 + П000410001201 + П000410001301 + П000410001401 + П000410001501 + П000410001601 + П000410001701 + П000410001801 + П000410001901);
				
				Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001001", П000410001001);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
					Форма.ТабличныйДокумент.Области.П000410001001.Значение = П000410001001;
				КонецЕсли;
				
				//Дозапишем данные в структуру по изменяемой ячейке.
				ЗначениеИзСтруктуры = ?(Форма.СтруктураДанныхФорма300_04Страница1.Свойство(ОбластьИмя),
				РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1[ОбластьИмя]),0);
				
				Форма.СтруктураДанныхФорма300_04Страница1.Вставить(ОбластьИмя,ЗначениеИзСтруктуры +(П000410001001 - ОкрП000410001001));
				
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница3", "П000410001001");  //перерасчет 3й стр. форма 300.00
			
		КонецЕсли;
		
		//300.04.001B
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000410001002, ОбластьИмя) > 0 Тогда
			
			ОкрП000410001002 = 0;
			ОкрП000410001102 = 0;
			ОкрП000410001202 = 0;
			ОкрП000410001302 = 0;
			ОкрП000410001402 = 0;
			ОкрП000410001502 = 0;
			ОкрП000410001602 = 0;
			ОкрП000410001702 = 0;
			ОкрП000410001802 = 0;
			ОкрП000410001902 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001002") Тогда
				ОкрП000410001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001102.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001102") Тогда
				ОкрП000410001102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001102);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001202.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001202") Тогда
				ОкрП000410001202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001202);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001302.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001302") Тогда
				ОкрП000410001302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001302);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001402 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001402.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001402") Тогда
				ОкрП000410001402 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001402);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001502 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001502.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001502") Тогда
				ОкрП000410001502 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001502);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001602 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001602.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001602") Тогда
				ОкрП000410001602 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001602);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001702 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001702.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001702") Тогда
				ОкрП000410001702 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001702);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001802 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001802.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001802") Тогда
				ОкрП000410001802 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001802);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001902 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001902.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001902") Тогда
				ОкрП000410001902 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001902);
			КонецЕсли;
			
			СуммаДляП000410001002 = ОкрП000410001102 + ОкрП000410001202 + ОкрП000410001302 + ОкрП000410001402 + ОкрП000410001502 + ОкрП000410001602 + ОкрП000410001702 + ОкрП000410001802 + ОкрП000410001902;
			
			Если ОбластьИмя = "П000410001002" Тогда //Изменили итоговую строку
				
				Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001002", ОкрП000410001002);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
					Форма.ТабличныйДокумент.Области.П000410001002.Значение = ОкрП000410001002;
				КонецЕсли;
				
				Если СуммаДляП000410001002 > ОкрП000410001002 Тогда
					
					Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001102", 0);
					Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001202", 0);
					Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001302", 0);
					Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001402", 0);
					Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001502", 0);
					Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001602", 0);
					Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001702", 0);
					Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001802", 0);
					Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001902", 0);
					
					
					Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
						
						Форма.ТабличныйДокумент.Области.П000410001102.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000410001202.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000410001302.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000410001402.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000410001502.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000410001602.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000410001702.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000410001802.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000410001902.Значение = 0;
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе //Изменили подстроки I-IX
				
				Если Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001102") Тогда
					П000410001102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001102);
				Иначе
					П000410001102 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001202") Тогда
					П000410001202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001202);
				Иначе
					П000410001202 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001302") Тогда
					П000410001302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001302);
				Иначе
					П000410001302 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001402") Тогда
					П000410001402 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001402);
				Иначе
					П000410001402 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001502") Тогда
					П000410001502 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001502);
				Иначе
					П000410001502 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001602") Тогда
					П000410001602 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001602);
				Иначе
					П000410001602 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001702") Тогда
					П000410001702 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001702);
				Иначе
					П000410001702 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001802") Тогда
					П000410001802 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001802);
				Иначе
					П000410001802 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001902") Тогда
					П000410001902 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001902);
				Иначе
					П000410001902 = 0;
				КонецЕсли;
				
				П000410001002 = СуммаДляП000410001002 + ОкрП000410001002 - (П000410001102 + П000410001202 + П000410001302 + П000410001402 + П000410001502 + П000410001602 + П000410001702 + П000410001802 + П000410001902);
				
				Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001002", П000410001002);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
					Форма.ТабличныйДокумент.Области.П000410001002.Значение = П000410001002;
				КонецЕсли;
				
				//Дозапишем данные в структуру по изменяемой ячейке.
				ЗначениеИзСтруктуры = ?(Форма.СтруктураДанныхФорма300_04Страница1.Свойство(ОбластьИмя),
				РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1[ОбластьИмя]),0);
				
				Форма.СтруктураДанныхФорма300_04Страница1.Вставить(ОбластьИмя,ЗначениеИзСтруктуры +(П000410001002 - ОкрП000410001002));
				
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница3", "П000410001002");  //перерасчет 3й стр. форма 300.00
			
			Расчет(Форма, "Форма300Страница2", "П000410001002");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_05Страница1" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение05", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение05.Значение = "Х";
		КонецЕсли;
		
		//300.05.007
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000510007001, ОбластьИмя) > 0 Тогда
			
			ОкрП000510003001 = 0;
			ОкрП000510006001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_05Страница1" Тогда
				ОкрП000510003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000510003001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_05Страница1.Свойство("П000510003001") Тогда
				ОкрП000510003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_05Страница1.П000510003001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_05Страница1" Тогда
				ОкрП000510006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000510006001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_05Страница1.Свойство("П000510006001") Тогда
				ОкрП000510006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_05Страница1.П000510006001);
			КонецЕсли;
			
			П000510007001 = ОкрП000510003001 + ОкрП000510006001;
			
			Форма.СтруктураДанныхФорма300_05Страница1.Вставить("П000510007001", П000510007001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_05Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000510007001.Значение = П000510007001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000510007001");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
		Если    "П000510001001" = ОбластьИмя Тогда
			
			Расчет(Форма, "Форма300Страница2", ОбластьИмя);  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_06Страница1" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение06", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение06.Значение = "Х";
		КонецЕсли;
		
		//300.06.009А
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000610009001, ОбластьИмя) > 0 Тогда
			
			ОкрП000610001001 = 0;
			ОкрП000610002001 = 0;
			ОкрП000610003001 = 0;
			ОкрП000610004001 = 0;
			ОкрП000610005001 = 0;
			ОкрП000610006001 = 0;
			ОкрП000610007001 = 0;
			ОкрП000610008001 = 0;
			ОкрП000610010001 = 0;
			ОкрП000610011001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610001001") Тогда
				ОкрП000610001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610001001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610002001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610002001") Тогда
				ОкрП000610002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610002001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610003001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610003001") Тогда
				ОкрП000610003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610003001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610004001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610004001") Тогда
				ОкрП000610004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610004001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610005001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610005001") Тогда
				ОкрП000610005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610005001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610006001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610006001") Тогда
				ОкрП000610006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610006001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610007001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610007001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610007001") Тогда
				ОкрП000610007001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610007001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610008001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610008001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610008001") Тогда
				ОкрП000610008001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610008001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610010001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610010001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610010001") Тогда
				ОкрП000610010001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610010001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610011001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610011001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610011001") Тогда
				ОкрП000610011001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610011001);
			КонецЕсли;
			
			П000610009001 = ОкрП000610001001 + ОкрП000610002001 + ОкрП000610003001 + ОкрП000610004001 + ОкрП000610005001 + ОкрП000610006001 + ОкрП000610007001 + ОкрП000610008001 - ОкрП000610010001 - ОкрП000610011001;
			
			Форма.СтруктураДанныхФорма300_06Страница1.Вставить("П000610009001", П000610009001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000610009001.Значение = П000610009001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница1", "П000610009001");  //перерасчет 1й стр. форма 300.00
			
		КонецЕсли;
		
		//300.06.009B
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000610009002, ОбластьИмя) > 0 Тогда
			
			ОкрП000610001002 = 0;
			ОкрП000610002002 = 0;
			ОкрП000610003002 = 0;
			ОкрП000610004002 = 0;
			ОкрП000610005002 = 0;
			ОкрП000610006002 = 0;
			ОкрП000610007002 = 0;
			ОкрП000610008002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610001002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610001002") Тогда
				ОкрП000610001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610001002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610002002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610002002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610002002") Тогда
				ОкрП000610002002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610002002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610003002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610003002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610003002") Тогда
				ОкрП000610003002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610003002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610004002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610004002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610004002") Тогда
				ОкрП000610004002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610004002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610005002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610005002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610005002") Тогда
				ОкрП000610005002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610005002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610006002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610006002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610006002") Тогда
				ОкрП000610006002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610006002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610007002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610007002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610007002") Тогда
				ОкрП000610007002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610007002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610008002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610008002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610008002") Тогда
				ОкрП000610008002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610008002);
			КонецЕсли;
			
			П000610009002 = ОкрП000610001002 + ОкрП000610002002 + ОкрП000610003002 + ОкрП000610004002 + ОкрП000610005002 + ОкрП000610006002 + ОкрП000610007002 + ОкрП000610008002;
			
			Форма.СтруктураДанныхФорма300_06Страница1.Вставить("П000610009002", П000610009002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000610009002.Значение = П000610009002;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница1", "П000610009002");  //перерасчет 1й стр. форма 300.00
			
		КонецЕсли;
		
		Если    "П00061001200" = Лев(ОбластьИмя,СтрДлина(ОбластьИмя)-1) 
			ИЛИ "П00061001300" = Лев(ОбластьИмя,СтрДлина(ОбластьИмя)-1)
			ИЛИ "П00061001400" = Лев(ОбластьИмя,СтрДлина(ОбластьИмя)-1) 
			ИЛИ "П00061001500" = Лев(ОбластьИмя,СтрДлина(ОбластьИмя)-1) 
			ИЛИ "П00061001600" = Лев(ОбластьИмя,СтрДлина(ОбластьИмя)-1) 
			ИЛИ "П00061001700" = Лев(ОбластьИмя,СтрДлина(ОбластьИмя)-1) 
			ИЛИ "П00061001800" = Лев(ОбластьИмя,СтрДлина(ОбластьИмя)-1) 
			ИЛИ "П00061001900" = Лев(ОбластьИмя,СтрДлина(ОбластьИмя)-1) 
			ИЛИ "П00061002000" = Лев(ОбластьИмя,СтрДлина(ОбластьИмя)-1) Тогда
			
			Расчет(Форма, "Форма300_06Страница2", ОбластьИмя);
			
		КонецЕсли;
		
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_06Страница2" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение06", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение06.Значение = "Х";
		КонецЕсли;
		
		//300.06.024A
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000620024001, ОбластьИмя) > 0 Тогда
			
			ОкрП000610012001 = 0;
			ОкрП000610013001 = 0;
			ОкрП000610014001 = 0;
			ОкрП000610015001 = 0;
			ОкрП000610016001 = 0;
			ОкрП000610017001 = 0;
			ОкрП000610018001 = 0;
			ОкрП000610019001 = 0;
			ОкрП000610020001 = 0;
			ОкрП000620021001 = 0;
			ОкрП000620022001 = 0;
			ОкрП000620023001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610012001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610012001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610012001") Тогда
				ОкрП000610012001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610012001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610013001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610013001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610013001") Тогда
				ОкрП000610013001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610013001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610014001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610014001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610014001") Тогда
				ОкрП000610014001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610014001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610015001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610015001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610015001") Тогда
				ОкрП000610015001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610015001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610016001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610016001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610016001") Тогда
				ОкрП000610016001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610016001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610017001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610017001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610017001") Тогда
				ОкрП000610017001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610017001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610018001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610018001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610018001") Тогда
				ОкрП000610018001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610018001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610019001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610019001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610019001") Тогда
				ОкрП000610019001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610019001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610020001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610020001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610020001") Тогда
				ОкрП000610020001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610020001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница2" Тогда
				ОкрП000620021001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000620021001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница2.Свойство("П000620021001") Тогда
				ОкрП000620021001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница2.П000620021001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница2" Тогда
				ОкрП000620022001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000620022001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница2.Свойство("П000620022001") Тогда
				ОкрП000620022001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница2.П000620022001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница2" Тогда
				ОкрП000620023001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000620023001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница2.Свойство("П000620023001") Тогда
				ОкрП000620023001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница2.П000620023001);
			КонецЕсли;
			
			П000620024001 = ОкрП000610012001 + ОкрП000610013001 + ОкрП000610014001 + ОкрП000610015001 + ОкрП000610016001 + ОкрП000610017001 + ОкрП000610018001 + 
			ОкрП000610019001 + ОкрП000610020001 + ОкрП000620021001 + ОкрП000620022001 + ОкрП000620023001;
			
			Форма.СтруктураДанныхФорма300_06Страница2.Вставить("П000620024001", П000620024001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000620024001.Значение = П000620024001;
			КонецЕсли;
			
		КонецЕсли;
		
		//300.06.024B
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000620024002, ОбластьИмя) > 0 Тогда
			
			ОкрП000610012002 = 0;
			ОкрП000610013002 = 0;
			ОкрП000610014002 = 0;
			ОкрП000610015002 = 0;
			ОкрП000610016002 = 0;
			ОкрП000610017002 = 0;
			ОкрП000610018002 = 0;
			ОкрП000610019002 = 0;
			ОкрП000610020002 = 0;
			ОкрП000620021002 = 0;
			ОкрП000620022002 = 0;
			ОкрП000620023002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610012002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610012002") Тогда
				ОкрП000610012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610012002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610013002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610013002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610013002") Тогда
				ОкрП000610013002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610013002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610014002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610014002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610014002") Тогда
				ОкрП000610014002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610014002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610015002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610015002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610015002") Тогда
				ОкрП000610015002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610015002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610016002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610016002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610016002") Тогда
				ОкрП000610016002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610016002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610017002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610017002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610017002") Тогда
				ОкрП000610017002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610017002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610018002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610018002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610018002") Тогда
				ОкрП000610018002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610018002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610019002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610019002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610019002") Тогда
				ОкрП000610019002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610019002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610020002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610020002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610020002") Тогда
				ОкрП000610020002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610020002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница2" Тогда
				ОкрП000620021002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000620021002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница2.Свойство("П000620021002") Тогда
				ОкрП000620021002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница2.П000620021002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница2" Тогда
				ОкрП000620022002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000620022002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница2.Свойство("П000620022002") Тогда
				ОкрП000620022002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница2.П000620022002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница2" Тогда
				ОкрП000620023002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000620023002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница2.Свойство("П000620023002") Тогда
				ОкрП000620023002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница2.П000620023002);
			КонецЕсли;
			
			П000620024002 = ОкрП000610012002 + ОкрП000610013002 + ОкрП000610014002 + ОкрП000610015002 + ОкрП000610016002 + ОкрП000610017002 + ОкрП000610018002 + 
			ОкрП000610019002 + ОкрП000610020002 + ОкрП000620021002 + ОкрП000620022002 + ОкрП000620023002;
			
			Форма.СтруктураДанныхФорма300_06Страница2.Вставить("П000620024002", П000620024002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000620024002.Значение = П000620024002;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000620024002");
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_07Страница1" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение07", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение07.Значение = "Х";
		КонецЕсли;
		
		Расчет(Форма, "Форма300_07Страница3", ОбластьИмя);
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_07Страница2" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение07", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение07.Значение = "Х";
		КонецЕсли;
		
		Расчет(Форма, "Форма300_07Страница3", ОбластьИмя);
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_07Страница3" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение07", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение07.Значение = "Х";
		КонецЕсли;
		
		//00000001H
		//00000001I
		//00000001J
		
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
			
			СуммаП000730000102 = 0;
			СуммаП000730000103 = 0;
			СуммаП000730000104 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы73]].Количество() Цикл
				
				СуммаП000730000102 = СуммаП000730000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000730000202_" + Ном].Значение);
				СуммаП000730000103 = СуммаП000730000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000730000203_" + Ном].Значение);
				СуммаП000730000104 = СуммаП000730000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000730000204_" + Ном].Значение);
				
			КонецЦикла;
			
			Форма.ТабличныйДокумент.Области.П000730000102.Значение = СуммаП000730000102;
			Форма.ТабличныйДокумент.Области.П000730000103.Значение = СуммаП000730000103;
			Форма.ТабличныйДокумент.Области.П000730000104.Значение = СуммаП000730000104;
			
			
		Иначе
			
			СуммаП000730000102 = 0;
			СуммаП000730000103 = 0;
			СуммаП000730000104 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы73]].Количество() Цикл
				
				СуммаП000730000102 = СуммаП000730000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы73]][Ном - 1].П000730000202);
				СуммаП000730000103 = СуммаП000730000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы73]][Ном - 1].П000730000203);
				СуммаП000730000104 = СуммаП000730000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы73]][Ном - 1].П000730000204);
				
			КонецЦикла;
			
			Форма.СтруктураДанныхФорма300_07Страница3.Вставить("П000730000102", СуммаП000730000102);
			Форма.СтруктураДанныхФорма300_07Страница3.Вставить("П000730000103", СуммаП000730000103);
			Форма.СтруктураДанныхФорма300_07Страница3.Вставить("П000730000104", СуммаП000730000104);
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_07Страница4" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение07", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение07.Значение = "Х";
		КонецЕсли;
		
		Расчет(Форма, "Форма300_07Страница3", ОбластьИмя);
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_08Страница1" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение08", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение08.Значение = "Х";
		КонецЕсли;
		
		Расчет(Форма, "Форма300_08Страница3", ОбластьИмя);
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_08Страница2" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение08", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение08.Значение = "Х";
		КонецЕсли;
		
		Расчет(Форма, "Форма300_08Страница3", ОбластьИмя);
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_08Страница3" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение08", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение08.Значение = "Х";
		КонецЕсли;
		
		//00000001H
		//00000001I
		//00000001J
		
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
			
			СуммаП000830000102 = 0;
			СуммаП000830000103 = 0;
			СуммаП000830000104 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы83]].Количество() Цикл
				
				СуммаП000830000102 = СуммаП000830000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000830000202_" + Ном].Значение);
				СуммаП000830000103 = СуммаП000830000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000830000203_" + Ном].Значение);
				СуммаП000830000104 = СуммаП000830000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000830000204_" + Ном].Значение);
				
			КонецЦикла;
			
			Форма.ТабличныйДокумент.Области.П000830000102.Значение = СуммаП000830000102;
			Форма.ТабличныйДокумент.Области.П000830000103.Значение = СуммаП000830000103;
			Форма.ТабличныйДокумент.Области.П000830000104.Значение = СуммаП000830000104;
			
			
		Иначе
			
			СуммаП000830000102 = 0;
			СуммаП000830000103 = 0;
			СуммаП000830000104 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы83]].Количество() Цикл
				
				СуммаП000830000102 = СуммаП000830000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы83]][Ном - 1].П000830000202);
				СуммаП000830000103 = СуммаП000830000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы83]][Ном - 1].П000830000203);
				СуммаП000830000104 = СуммаП000830000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы83]][Ном - 1].П000830000204);
				
			КонецЦикла;
			
			Форма.СтруктураДанныхФорма300_08Страница3.Вставить("П000830000102", СуммаП000830000102);
			Форма.СтруктураДанныхФорма300_08Страница3.Вставить("П000830000103", СуммаП000830000103);
			Форма.СтруктураДанныхФорма300_08Страница3.Вставить("П000830000104", СуммаП000830000104);
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_08Страница4" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение08", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение08.Значение = "Х";
		КонецЕсли;
		
		Расчет(Форма, "Форма300_08Страница3", ОбластьИмя);
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_09_01Страница1" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение09", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение09.Значение = "Х";
		КонецЕсли;
		
		Расчет(Форма, "Форма300_09_01Страница2", ОбластьИмя);
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_09_01Страница2" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение09", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение09.Значение = "Х";
		КонецЕсли;
		
		//00000001I
		
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
			
			СуммаП000912000106 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы912]].Количество() Цикл
				
				СуммаП000912000106 = СуммаП000912000106 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000912000206_" + Ном].Значение);
				
			КонецЦикла;
			
			Форма.ТабличныйДокумент.Области.П000912000106.Значение = СуммаП000912000106;
			
		Иначе
			
			СуммаП000912000106 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы912]].Количество() Цикл
				
				СуммаП000912000106 = СуммаП000912000106 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы912]][Ном - 1].П000912000206);
				
			КонецЦикла;
			
			Форма.СтруктураДанныхФорма300_09_01Страница2.П000912000106 = СуммаП000912000106;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_09_02Страница1" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение09", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение09.Значение = "Х";
		КонецЕсли;
		
		Расчет(Форма, "Форма300_09_02Страница2", ОбластьИмя);
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_09_02Страница2" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение09", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение09.Значение = "Х";
		КонецЕсли;
		
		//00000001I
		
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
			
			СуммаП000922000106 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы922]].Количество() Цикл
				
				СуммаП000922000106 = СуммаП000922000106 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000922000206_" + Ном].Значение);
				
			КонецЦикла;
			
			Форма.ТабличныйДокумент.Области.П000922000106.Значение = СуммаП000922000106;
			
		Иначе
			
			СуммаП000922000106 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы922]].Количество() Цикл
				
				СуммаП000922000106 = СуммаП000922000106 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы922]][Ном - 1].П000922000206);
				
			КонецЦикла;
			
			Форма.СтруктураДанныхФорма300_09_02Страница2.П000922000106 = СуммаП000922000106;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_09_03Страница1" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение09", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение09.Значение = "Х";
		КонецЕсли;
		
		Расчет(Форма, "Форма300_09_03Страница2", ОбластьИмя);
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_09_03Страница2" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение09", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение09.Значение = "Х";
		КонецЕсли;
		
		//00000001I
		
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
			
			СуммаП000932000106 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы932]].Количество() Цикл
				
				СуммаП000932000106 = СуммаП000932000106 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000932000206_" + Ном].Значение);
				
			КонецЦикла;
			
			Форма.ТабличныйДокумент.Области.П000932000106.Значение = СуммаП000932000106;
			
		Иначе
			
			СуммаП000932000106 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы932]].Количество() Цикл
				
				СуммаП000932000106 = СуммаП000932000106 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы932]][Ном - 1].П000932000206);
				
			КонецЦикла;
			
			Форма.СтруктураДанныхФорма300_09_03Страница2.П000932000106 = СуммаП000932000106;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_09_04Страница1" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение09", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение09.Значение = "Х";
		КонецЕсли;
		
		Расчет(Форма, "Форма300_09_04Страница2", ОбластьИмя);
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_09_04Страница2" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение09", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение09.Значение = "Х";
		КонецЕсли;
		
		//00000001I
		
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
			
			СуммаП000942000106 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы942]].Количество() Цикл
				
				СуммаП000942000106 = СуммаП000942000106 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000942000206_" + Ном].Значение);
				
			КонецЦикла;
			
			Форма.ТабличныйДокумент.Области.П000942000106.Значение = СуммаП000942000106;
			
		Иначе
			
			СуммаП000942000106 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы942]].Количество() Цикл
				
				СуммаП000942000106 = СуммаП000942000106 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы942]][Ном - 1].П000942000206);
				
			КонецЦикла;
			
			Форма.СтруктураДанныхФорма300_09_04Страница2.П000942000106 = СуммаП000942000106;
			
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьЗавершение", ЭтотОбъект);
	
	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВыгрузитьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчет() Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьОтчетЗавершение", ЭтотОбъект);
	
	Если Модифицированность Тогда
		СохранитьНаКлиенте(,ОписаниеОповещения);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчетЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ФормаВыгрузкиРеглОтчета = ПолучитьФорму("Документ.ВыгрузкаРегламентированныхОтчетов.Форма.ФормаДокумента", , ЭтаФорма);
	
	СпДокОсн = Новый СписокЗначений;
	СпДокОсн.Добавить(СтруктураРеквизитовФормы.мСохраненныйДок);
	
	ФормаВыгрузкиРеглОтчета.СформироватьИЗаписать(СпДокОсн);
	
КонецПроцедуры

&НаКлиенте
Функция УниверсальнаяВыгрузка(ТекстВыгрузки = Неопределено, ПроверятьБлокировки = Истина, ИмяФайлаВыгрузки = "", ВыгружатьСОшибками = Ложь) Экспорт
	
	Перем ПараметрыВыгрузки;
	
	Если Модифицированность Тогда
		ТекстЗаголовка = ЗаголовокРегламентированногоОтчета(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
		
		ОргСтр = " (" + СтруктураРеквизитовФормы.Организация + ")";
		Если СтрНайти(ТекстЗаголовка, ОргСтр) = 0 Тогда
			ТекстЗаголовка = ТекстЗаголовка + ОргСтр;
		КонецЕсли;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Отчет """ + ТекстЗаголовка + """ не сохранен.";
		Сообщение.Сообщить();
		
		Возврат Ложь;
	КонецЕсли;
	
	ИмяФайлаВыгрузки = "Форма300_" + Прав(СтруктураРеквизитовФормы.мВыбраннаяФорма,7) + ".xml";
	
	Если НЕ УниверсальнаяВыгрузкаXMLНаСервере(ТекстВыгрузки, ПараметрыВыгрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // УниверсальнаяВыгрузка()

&НаКлиенте
Функция ЗаголовокРегламентированногоОтчета(ДатаНач, ДатаКон, Периодичность = Неопределено) Экспорт
	
	СтрПериодОтчета = ПредставлениеПериода( НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета), КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ФП = Истина" );
	
	Если СтрНайти(ЭтаФорма.Заголовок, СтрПериодОтчета) = 0 Тогда
		Возврат ЭтаФорма.Заголовок + " за " + СтрПериодОтчета;
	Иначе
		Возврат ЭтаФорма.Заголовок;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция УниверсальнаяВыгрузкаXMLНаСервере(ТекстВыгрузки, ПараметрыВыгрузки)
	
	Префикс = Прав(СтруктураРеквизитовФормы.мВыбраннаяФорма,7);
	
	// запишем общие атрибуты (code, version) и создадим элемент form
	Запись = РегламентированнаяОтчетность.СоздатьНовыйПотокXML("UTF-8");
	
	// Запишем корневой элемент
	Запись.ЗаписатьНачалоЭлемента("fno");
	
	МакетВыгрузки = ЭтотОбъект.РеквизитФормыВЗначение("Отчет").ПолучитьМакет("СхемаВыгрузкиВXML");
	
	ТаблОбщиеРеквизиты = Новый ТаблицаЗначений;
	ТаблОбщиеРеквизиты.Колонки.Добавить("ИмяАтрибута");
	ТаблОбщиеРеквизиты.Колонки.Добавить("ЗначениеАтрибута");
	
	ОбластьОбщихРеквизитов = МакетВыгрузки.Область("ОбщиеРеквизиты" + Префикс);
	Для Ном = ОбластьОбщихРеквизитов.Верх По ОбластьОбщихРеквизитов.Низ Цикл
		Строка = ТаблОбщиеРеквизиты.Добавить();
		Строка.ИмяАтрибута		 = СокрП(МакетВыгрузки.Область(Ном, 1).Текст);
		Строка.ЗначениеАтрибута	 = СокрП(МакетВыгрузки.Область(Ном, 2).Текст);
	КонецЦикла;
	
	// Запишем атрибуты корневого элемента
	Для Каждого Строка Из ТаблОбщиеРеквизиты Цикл
		Запись.ЗаписатьАтрибут(Строка.ИмяАтрибута,Строка.ЗначениеАтрибута);
	КонецЦикла;
	
	// создадим таблицу для выгрузки
	ТаблицаВыгрузки = Новый ТаблицаЗначений;
	ТаблицаВыгрузки.Колонки.Добавить("Форма");
	ТаблицаВыгрузки.Колонки.Добавить("Страница");
	ТаблицаВыгрузки.Колонки.Добавить("ИмяАтрибута");
	ТаблицаВыгрузки.Колонки.Добавить("ИмяЯчейки");
	ТаблицаВыгрузки.Колонки.Добавить("КоличествоROW");
	ТаблицаВыгрузки.Колонки.Добавить("ИмяФормы");
	ТаблицаВыгрузки.Колонки.Добавить("ИмяЛиста");
	ТаблицаВыгрузки.Колонки.Добавить("Отображение");
	ТаблицаВыгрузки.Колонки.Добавить("ВыгружатьНулевыеЗначения");
	
	ТаблицаВыгрузки.Колонки.Добавить("КодФормы");
	ТаблицаВыгрузки.Колонки.Добавить("Выгружать");
	ТаблицаВыгрузки.Колонки.Добавить("Многострочность");
	ТаблицаВыгрузки.Колонки.Добавить("ЗаголовокФормы"); 
	ТаблицаВыгрузки.Колонки.Добавить("КоличествоНаЛисте");
	ТаблицаВыгрузки.Колонки.Добавить("Значение");    
	
	ОбластьВыгрузки = МакетВыгрузки.Область("Выгрузка" + Префикс);
	
	Для Ном = ОбластьВыгрузки.Верх По ОбластьВыгрузки.Низ Цикл
		
		Строка = ТаблицаВыгрузки.Добавить();
		Строка.Форма 	       			= СокрП(МакетВыгрузки.Область(Ном, 1).Текст);
		Строка.Страница        			= СокрП(МакетВыгрузки.Область(Ном, 2).Текст);
		Строка.ИмяАтрибута     			= СокрП(МакетВыгрузки.Область(Ном, 3).Текст);
		Строка.ИмяЯчейки      	 		= СокрП(МакетВыгрузки.Область(Ном, 4).Текст);
		Строка.КоличествоROW   			= СокрП(МакетВыгрузки.Область(Ном, 5).Текст);
		Строка.ИмяФормы        			= СокрП(МакетВыгрузки.Область(Ном, 6).Текст);
		Строка.ИмяЛиста        			= СокрП(МакетВыгрузки.Область(Ном, 7).Текст);
		Строка.Отображение     			= СокрП(МакетВыгрузки.Область(Ном, 8).Текст);
		
		Строка.ВыгружатьНулевыеЗначения = ?(СокрП(МакетВыгрузки.Область(Ном, 9).Текст) = "1", Истина, Ложь);
		
	КонецЦикла;
	
	Форма300_09УдалитьПустыеПриложенияИзТаблицыВыгрузки(ТаблицаВыгрузки);
	
	// выгрузка в XML 
	КоличествоСтрокВТаблице = ТаблицаВыгрузки.Количество();
	НомерСтроки = 0;
	
	ТекущаяФорма = Неопределено;
	ТекущаяСтраница = Неопределено;
	
	Пока Истина Цикл
		
		Если НомерСтроки >= КоличествоСтрокВТаблице Тогда
			Прервать;
		КонецЕсли;
		
		Если Не ТекущаяФорма = ТаблицаВыгрузки[НомерСтроки].Форма Тогда
			
			ТекущаяФорма = ТаблицаВыгрузки[НомерСтроки].Форма;
			
			Если НомерСтроки > 0 Тогда 
				Запись.ЗаписатьКонецЭлемента();
			КонецЕсли;
			Запись.ЗаписатьНачалоЭлемента("form");
			Запись.ЗаписатьАтрибут("name", ТекущаяФорма);
			
		КонецЕсли;
		
		Если ТаблицаВыгрузки[НомерСтроки].КоличествоROW = "0" Тогда
			//Если не многострочная форма, просто добавляем значение реквизита
			Запись.ЗаписатьНачалоЭлемента("field");
			Запись.ЗаписатьАтрибут("name", ТаблицаВыгрузки[НомерСтроки].ИмяАтрибута);
			//Проверим есть ли возможность заполнить данный параметр
			Если ЗначениеЗаполнено(ТаблицаВыгрузки[НомерСтроки].ИмяЯчейки) Тогда
				
				Если ТаблицаВыгрузки[НомерСтроки].ИмяЯчейки = "КодВалюты" Тогда
					Запись.ЗаписатьТекст("KZT");
				Иначе
					//Получим и обработаем значение параметра и запишем его
					Если ТаблицаВыгрузки[НомерСтроки].ИмяЯчейки = "НомерСтраницы" Тогда
						Значение = "1";
					Иначе 
						Значение = ОпределитьЗначениеПараметра(ЭтотОбъект[ТаблицаВыгрузки[НомерСтроки].ИмяФормы][ТаблицаВыгрузки[НомерСтроки].ИмяЯчейки], ТаблицаВыгрузки[НомерСтроки].ИмяЯчейки);
					КонецЕсли;
					
					Если Не ЗначениеЗаполнено(Значение) И ТаблицаВыгрузки[НомерСтроки].ВыгружатьНулевыеЗначения Тогда
						Значение = "0";
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Значение) Тогда
						Запись.ЗаписатьТекст(Строка(Значение));
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
			Запись.ЗаписатьКонецЭлемента();
			
		Иначе
			
			//Определим состав колонок многострочной формы
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Форма", ТаблицаВыгрузки[НомерСтроки].Форма);
			СтруктураПоиска.Вставить("КоличествоROW", "99999");
			СтрокиТаблицы = ТаблицаВыгрузки.НайтиСтроки(СтруктураПоиска);
			
			//Проверям есть ли у нас вообще записи в многострочной форме
			ЕстьЗаписи = Ложь;
			Для Каждого Строка Из СтрокиТаблицы Цикл
				Если ЗначениеЗаполнено(ЭтотОбъект[Строка.ИмяФормы][0][Строка.ИмяЯчейки]) Тогда 
					ЕстьЗаписи = Истина;
				КонецЕсли;
			КонецЦикла;
			
			Если ЕстьЗаписи Тогда 
				
				Для Счетчик = 0 По ЭтотОбъект[ТаблицаВыгрузки[НомерСтроки].ИмяФормы].Количество() - 1 Цикл
					//Начинаем запись по строкам
					Запись.ЗаписатьНачалоЭлемента("row");
					//Номер строки всегда первая колонка
					ЭтоНомерСтроки = Истина;
					Для Каждого Строка Из СтрокиТаблицы Цикл
						//Записываем значения элементов строки
						Запись.ЗаписатьНачалоЭлемента("field");
						Запись.ЗаписатьАтрибут("name", Строка.ИмяАтрибута);
						Значение = ОпределитьЗначениеПараметра(ЭтотОбъект[Строка.ИмяФормы][Счетчик][Строка.ИмяЯчейки], , ЭтоНомерСтроки);
						ЭтоНомерСтроки = Ложь;
						Запись.ЗаписатьТекст(Значение);
						Запись.ЗаписатьКонецЭлемента();
					КонецЦикла;
					
					Запись.ЗаписатьКонецЭлемента();
					
				КонецЦикла;
				
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + СтрокиТаблицы.Количество() - 1;
			
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	Запись.ЗаписатьКонецЭлемента();// </form> 
	Запись.ЗаписатьКонецЭлемента();// fno
	// получаем текст XML
	ТекстВыгрузки = Запись.Закрыть();
	
	Возврат Истина;
	
КонецФункции // УниверсальнаяВыгрузкаXMLНаСервере()

&НаСервере
Функция ПроверитьПоказатели() Экспорт
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ОпределитьЗначениеПараметра(ЗначениеПараметра, ИмяАтрибута = Неопределено, НомерСтроки = Ложь)
	
	МассивОпций = Новый Массив;
	МассивОпций.Добавить("Пропорциональный");
	МассивОпций.Добавить("Раздельный");
	МассивОпций.Добавить("ПропорцИРаздел");
	МассивОпций.Добавить("Дополнительная");
	МассивОпций.Добавить("Ликвидационная");
	МассивОпций.Добавить("Первоначальная");
	МассивОпций.Добавить("ПоУведомлению");
	МассивОпций.Добавить("Очередная");
	МассивОпций.Добавить("Условие_B");
	МассивОпций.Добавить("Условие_A");
	МассивОпций.Добавить("ОтказОтВозврата");
	
	Если Не МассивОпций.Найти(ИмяАтрибута) = Неопределено Тогда
		Значение = ?(ЗначениеПараметра = "Х", Истина, Ложь);
	Иначе 
		Значение = ?(Не ЗначениеЗаполнено(ЗначениеПараметра), "", ЗначениеПараметра);
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Дата") Тогда
		Если Значение = Дата("00010101000000") Тогда 
			Значение = "";
		Иначе 
			Значение = Формат(Значение, "ДЛФ=Д");
		КонецЕсли;
	КонецЕсли;
	Если ТипЗнч(Значение) = Тип("Булево") Тогда 
		Значение = ?(Значение, "true", "");
	КонецЕсли;
	Если ТипЗнч(Значение) = Тип("Число") Тогда 
		Значение = Окр(Значение, 2);
		
		Если НомерСтроки Тогда
			Значение = Строка(Значение);
			ДлиннаНомера = СтрДлина(Значение);
			
			Для Счетчик = ДлиннаНомера По 7 Цикл 
				Значение = "0" + Значение;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Строка(Значение);
	
КонецФункции

&НаСервере
Процедура Форма300_09УдалитьПустыеПриложенияИзТаблицыВыгрузки(ТаблицаВыгрузки);
	
	//////////////////////////////////////////////////////////////////////////////
	// Определить какие формы 300_09_0X заполнены, а какие пустые.
	
	МассивЗаполненных = Новый Массив;
	
	Счетчик = 1;
	Для Счетчик = 1 По 4 Цикл
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Форма", "form_300_09_0" + Счетчик);
		СтруктураПоиска.Вставить("КоличествоROW", "99999");
		МассивНайденныхСтрок = ТаблицаВыгрузки.НайтиСтроки(СтруктураПоиска);
		
		ЕстьЗаписи = Ложь;
		
		Для Каждого НайденнаяСтрока Из МассивНайденныхСтрок Цикл
			Если ЗначениеЗаполнено(ЭтотОбъект[НайденнаяСтрока.ИмяФормы][0][НайденнаяСтрока.ИмяЯчейки]) Тогда
				ЕстьЗаписи = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьЗаписи Тогда 
			МассивЗаполненных.Добавить(Счетчик);
		КонецЕсли;
		
	КонецЦикла;
	
	//////////////////////////////////////////////////////////////////////////////
	// Удалить пустые формы 300_09_0X.
	
	Если МассивЗаполненных.Количество() = 0 Тогда
		
		// В форме 300 всегда должен оставаться один раздел 300.09,
		// поэтому удалим все разделы 300_09_0X, кроме 300_09_01.
		
		Для Счетчик = 2 По 4 Цикл
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Форма", "form_300_09_0" + Счетчик);
			МассивНайденныхСтрок = ТаблицаВыгрузки.НайтиСтроки(ПараметрыОтбора);
			
			Для Каждого НайденнаяСтрока Из МассивНайденныхСтрок Цикл
				ТаблицаВыгрузки.Удалить(НайденнаяСтрока);
			КонецЦикла;
			
		КонецЦикла;
		
	Иначе
		
		// Удалить пустые формы 300_09_0X.
		
		Для Счетчик = 1 По 4 Цикл
			
			Форма300_09_0XПустая = ?(МассивЗаполненных.Найти(Счетчик) = Неопределено, Истина, Ложь);
			
			Если Форма300_09_0XПустая Тогда
				
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("Форма", "form_300_09_0" + Счетчик);
				МассивНайденныхСтрок = ТаблицаВыгрузки.НайтиСтроки(ПараметрыОтбора);
				
				Для Каждого НайденнаяСтрока Из МассивНайденныхСтрок Цикл
					ТаблицаВыгрузки.Удалить(НайденнаяСтрока);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура Расшифровать(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекущуюСтраницу(Команда)
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьТекущийЭкземплярМногостраничногоРаздела" + Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекущийРаздел(Команда)
	//РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьТекущийРаздел" + Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтчет(Команда)
	
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьВесьОтчет");
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(ВыполняемоеОповещение = Неопределено) Экспорт
	
	РегламентированнаяОтчетностьКлиент.Очистить(ЭтаФорма, ВыполняемоеОповещение);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере() Экспорт
	
	СтруктураДанныхФорма300Страница1.Очистить();
	СтруктураДанныхФорма300Страница2.Очистить();
	СтруктураДанныхФорма300Страница3.Очистить();
	СтруктураДанныхФорма300Страница4.Очистить();
	СтруктураДанныхФорма300_01Страница1.Очистить();
	СтруктураДанныхФорма300_02Страница1.Очистить();
	СтруктураДанныхФорма300_02Страница2.Очистить();
	СтруктураДанныхФорма300_03Страница1.Очистить();
	СтруктураДанныхФорма300_03Страница2.Очистить();
	СтруктураДанныхФорма300_03Страница3.Очистить();
	СтруктураДанныхФорма300_04Страница1.Очистить();
	СтруктураДанныхФорма300_05Страница1.Очистить();
	СтруктураДанныхФорма300_06Страница1.Очистить();
	СтруктураДанныхФорма300_06Страница2.Очистить();
	СтруктураДанныхФорма300_07Страница1.Очистить();
	СтруктураДанныхФорма300_07Страница2.Очистить();
	СтруктураДанныхФорма300_07Страница3.Очистить();
	СтруктураДанныхФорма300_07Страница4.Очистить();
	СтруктураДанныхФорма300_08Страница1.Очистить();
	СтруктураДанныхФорма300_08Страница2.Очистить();
	СтруктураДанныхФорма300_08Страница3.Очистить();
	СтруктураДанныхФорма300_08Страница4.Очистить();
	СтруктураДанныхФорма300_09_01Страница1.Очистить();
	СтруктураДанныхФорма300_09_01Страница2.Очистить();
	СтруктураДанныхФорма300_09_02Страница1.Очистить();
	СтруктураДанныхФорма300_09_02Страница2.Очистить();
	СтруктураДанныхФорма300_09_03Страница1.Очистить();
	СтруктураДанныхФорма300_09_03Страница2.Очистить();
	СтруктураДанныхФорма300_09_04Страница1.Очистить();
	СтруктураДанныхФорма300_09_04Страница2.Очистить();
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	ОчиститьТабличноеПолеНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма300Страница1");
	
	НачальныеОперацииСМногострочнымиБлоками();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОчисткаРегламентированногоОтчетаНаСервере(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаСервере(ИмяСтраницы);
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаРегламентированногоОтчетаНаКлиенте(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаКлиенте(ИмяСтраницы);
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьТабличноеПолеНаКлиенте(ВыбТабличноеПолеИмя) Экспорт
	
	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличноеПолеНаСервере(ВыбТабличноеПолеИмя) Экспорт
	
	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьТабличноеПоле(Форма, ВыбТабличноеПолеИмя)
	
	ВыбТабличноеПоле = Форма.ТабличныйДокумент;
	
	// Непосредственно очищаем ячейки табличного документа.
	Для Инд = 0 По ВыбТабличноеПоле.Области.Количество() - 1 Цикл
		ТекущаяОбласть = ВыбТабличноеПоле.Области[Инд];
		
		Если Не ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;
	
		Если ТекущаяОбласть.СодержитЗначение <> Истина Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекущаяОбласть.Защита Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущаяОбласть.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
	ОткрытьФормуВыбораСтраниц("ВыбратьДляНастройки");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраниц(ВариантВыбора)
	Перем ТекущийРазделОтчетаСокрНаим;
	Перем НомерСтраницыРазделаОтчета;
	
	// Запоминаем текущий раздел, установленный в дереве разделов отчета.
	Если НЕ Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		ТекущийРазделОтчетаСокрНаим = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
		НомерСтраницыРазделаОтчета  = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	КонецЕсли;
	
	мПараметры = Новый Структура;
	мПараметры.Вставить("Автосохранение", Ложь);
	мПараметры.Вставить("мАвтоВыборКодов", Ложь);
	мПараметры.Вставить("ЗначенияИзСписка", Ложь);
	мПараметры.Вставить("ОтключитьАвтоРасчет", Ложь);
	мПараметры.Вставить("СчетчикСтраниц", Ложь);
	мПараметры.Вставить("ПараметрыОтображенияСумм", Ложь);
	мПараметры.Вставить("ИмеетсяРеквизитДеревоВыбранныхСтраниц", Истина);
	мПараметры.Вставить("Выгрузка", Истина);
	мПараметры.Вставить("ИмяОтчета", ИмяОтчета(ЭтаФорма.ИмяФормы));
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("мПараметры",                              мПараметры);
	
	ФормаНастройкиОтчета = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("НастройкиОтчета", ПараметрыФормы, ЭтаФорма);
	
	ПодготовитьДеревоСтраницДляНастройки();
	
	КопироватьДанныеФормы(мДеревоВыбранныхСтраниц, ФормаНастройкиОтчета.Дерево);
	
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
	
	ЗначениеЕдИзм       = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	ЗначениеЗпт         = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;
	
	ДополнительныеПараметры = Новый Структура("ЗначениеАвторасчета, ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим", , ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуВыбораСтраницЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ФормаНастройкиОтчета.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаНастройкиОтчета.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаНастройкиОтчета.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьДеревоСтраницДляНастройки()
	
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
	ДеревоСтраниц = РеквизитФормыВЗначение("мДеревоСтраницОтчета");
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300Страница1";
	СтрокаУровня1.Представление            = "Форма 300.00";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма300Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);

	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_01Страница1";
	СтрокаУровня1.Представление            = "Форма 300.01";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма300_01Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_02Страница1";
	СтрокаУровня1.Представление            = "Форма 300.02";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма300_02Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_03Страница1";
	СтрокаУровня1.Представление            = "Форма 300.03";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма300_03Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_04Страница1";
	СтрокаУровня1.Представление            = "Форма 300.04";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма300_04Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_05Страница1";
	СтрокаУровня1.Представление            = "Форма 300.05";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма300_05Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_06Страница1";
	СтрокаУровня1.Представление            = "Форма 300.06";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма300_06Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_07Страница1";
	СтрокаУровня1.Представление            = "Форма 300.07";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма300_07Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_08Страница1";
	СтрокаУровня1.Представление            = "Форма 300.08";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма300_08Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_09_01Страница1";
	СтрокаУровня1.Представление            = "Форма 300.09_01";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма300_09_01Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_09_02Страница1";
	СтрокаУровня1.Представление            = "Форма 300.09_02";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма300_09_02Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_09_03Страница1";
	СтрокаУровня1.Представление            = "Форма 300.09_03";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма300_09_03Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_09_04Страница1";
	СтрокаУровня1.Представление            = "Форма 300.09_04";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма300_09_04Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраницЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	//ЗначениеАвторасчета = ДополнительныеПараметры.ЗначениеАвторасчета;
	ЗначениеЕдИзм = ДополнительныеПараметры.ЗначениеЕдИзм;
	ЗначениеЗпт = ДополнительныеПараметры.ЗначениеЗпт;
	НомерСтраницыРазделаОтчета = ДополнительныеПараметры.НомерСтраницыРазделаОтчета;
	ТекущийРазделОтчетаСокрНаим = ДополнительныеПараметры.ТекущийРазделОтчетаСокрНаим;
	
	//СформироватьПодменюПечать(ЭтаФорма);
	Модифицированность = Истина;
	
	флЗначенияИдентичны = Истина;
	
	флЗначенияИдентичны = ПеренестиДанныеДереваСтраниц();
	
	Если НЕ флЗначенияИдентичны Тогда
		
		СформироватьДеревоРазделовОтчетаНаКлиенте();
		
		Если НЕ ТекущийРазделОтчетаСокрНаим = Неопределено Тогда
			
			// Пытаемся найти ранее запомненный раздел.
			НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(РазделыОтчета.ПолучитьЭлементы(), "КолонкаРазделыОтчетаСокрНаим", ТекущийРазделОтчетаСокрНаим);
			
			Если НЕ НайденнаяСтрока = Неопределено 
				И НЕ НомерСтраницыРазделаОтчета = Неопределено 
				И НайденнаяСтрока.ПолучитьЭлементы().Количество() > 0 Тогда
				
				НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(НайденнаяСтрока.ПолучитьЭлементы(), "КолонкаНомерСтраницыРазделаОтчета", НомерСтраницыРазделаОтчета);
				
			КонецЕсли;
			
			// В случае успешного поиска, устанавливаем курсор на найденный раздел.
			Если НЕ НайденнаяСтрока = Неопределено Тогда
				Элементы.РазделыОтчета.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПеренестиДанныеДереваСтраниц()
	
	флЗначенияИдентичны = Истина;
	
	ДеревоВыбСтраниц = РеквизитФормыВЗначение("мДеревоВыбранныхСтраниц");
	
	Для Каждого ЭлементДерева Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		
		Если  Сред(ЭлементДерева.Представление,13,1) = "_" Тогда
			Строка = ДеревоВыбСтраниц.Строки.Найти(Лев(ЭлементДерева.Представление,15),"Представление");
		Иначе
			Строка = ДеревоВыбСтраниц.Строки.Найти(Лев(ЭлементДерева.Представление,12),"Представление");
		КонецЕсли;
		
		Если ЭлементДерева.ПоказатьСтраницу <> ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1) Тогда
			
			флЗначенияИдентичны = Ложь;
			
		КонецЕсли;
		
		ЭлементДерева.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
		ЭлементДерева.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
		ЭлементДерева.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
		
	КонецЦикла;
	
	Возврат флЗначенияИдентичны;
	
КонецФункции


&НаКлиенте
Процедура Обновить(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПериодЗаполнения(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвто(Команда) Экспорт
	
	Отказ = Ложь;
	
	ОчиститьСообщения();
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоПредупредитьОСохранении", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередЗаполнениемРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоПредупредитьОСохранении(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоСохранениеОтчета", ЭтотОбъект, ДополнительныеПараметры);
	
	ТекстВопроса = НСтр("ru = 'Автоматическое заполнение приведет к сохранению отчета с новыми данными. Заполнить отчет?'");
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Заполнить", "Заполнить и сохранить");
	Кнопки.Добавить("НеЗаполнять", "Не заполнять");
	
	КнопкаПоУмолчанию = "НеЗаполнять";
	
	ЗаголовокВопроса = НСтр("ru = 'Автоматическое заполнение отчета'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , КнопкаПоУмолчанию, ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоСохранениеОтчета(ОтветПользователя, ДополнительныеПараметры) Экспорт
	
	Если ОтветПользователя <> "Заполнить" Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураРеквизитовФормы.УспешноеАвтозаполнение = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
	"ЗаполнитьАвтоПослеСохранениеОтчета", 
	ЭтотОбъект, 
	ДополнительныеПараметры); 
	
	СохранитьНаКлиенте(,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоПослеСохранениеОтчета(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаданиеВыполнено = ЗаполнитьАвтоНаСервере();
	
	Если ЗаданиеВыполнено Тогда
		СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
		
		РегламентированнаяОтчетностьКлиент.ОбновитьДеревоРазделовВФормеОтчета(ЭтаФорма);
		
		Если НЕ Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
			Элементы.РазделыОтчета.ТекущаяСтрока = Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы()[0].ПолучитьИдентификатор();
		КонецЕсли;
		
		Если Элементы.Расшифровать.Видимость Тогда
			Элементы.Расшифровать.Доступность = Истина;
			//	Элементы.ТабличныйДокументКонтекстноеМенюРасшифровать.Доступность = Истина;
		КонецЕсли;
		
		//ЗапуститьПроверки();
		
	Иначе
		
		// Операция еще не завершена, выполняется с помощью фонового задания (асинхронно).
		ПараметрыОбработчикаОжидания = Новый Структура;
		ПараметрыОбработчикаОжидания.Вставить("МинимальныйИнтервал", 1);
		ПараметрыОбработчикаОжидания.Вставить("МаксимальныйИнтервал", 15);
		ПараметрыОбработчикаОжидания.Вставить("ТекущийИнтервал", 1);
		ПараметрыОбработчикаОжидания.Вставить("КоэффициентУвеличенияИнтервала", 1.4);
		
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		
		ФормаДлительнойОперации = ОткрытьФорму("ОбщаяФорма.ДлительнаяОперация", Новый Структура("ИдентификаторЗадания", СтруктураРеквизитовФормы.ИдентификаторЗадания), ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		
		Если ПроверитьВыполнениеЗадания() Тогда 
			
			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			
			СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
			
			РегламентированнаяОтчетностьКлиент.ОбновитьДеревоРазделовВФормеОтчета(ЭтаФорма);
			
			Если НЕ Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
				Элементы.РазделыОтчета.ТекущаяСтрока = Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы()[0].ПолучитьИдентификатор();
			КонецЕсли;
			
			Если Элементы.Расшифровать.Видимость Тогда
				Элементы.Расшифровать.Доступность = Истина;
				//Элементы.ТабличныйДокументКонтекстноеМенюРасшифровать.Доступность = Истина;
			КонецЕсли;
			
			//ЗапуститьПроверки();
			
			Возврат;
			
		КонецЕсли;
		
	Исключение
		
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение;
		
	КонецПопытки;
	
	ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.ТекущийИнтервал * ПараметрыОбработчикаОжидания.КоэффициентУвеличенияИнтервала;
	
	Если ПараметрыОбработчикаОжидания.ТекущийИнтервал > ПараметрыОбработчикаОжидания.МаксимальныйИнтервал Тогда
		ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.МаксимальныйИнтервал;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВыполнениеЗадания()
	
	Если ДлительныеОперации.ЗаданиеВыполнено(СтруктураРеквизитовФормы.ИдентификаторЗадания) Тогда 
		РегламентированнаяОтчетностьУПК.ФоновыеСообщенияПользователю(СтруктураРеквизитовФормы.ИдентификаторЗадания, ЭтаФорма.УникальныйИдентификатор);
		ЗагрузитьПодготовленныеДанные();
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗаполнитьАвтоНаСервере()
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	СтруктураРеквизитовФормы.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	СтруктураРеквизитовФормы.АдресВременногоХранилищаРасшифровки = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("Организация",              СтруктураРеквизитовФормы.Организация);
	ПараметрыОтчета.Вставить("ГруппаОрганизаций",        СтруктураРеквизитовФормы.ГруппаОрганизаций);
	ПараметрыОтчета.Вставить("мДатаНачалаПериодаОтчета", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	ПараметрыОтчета.Вставить("мДатаКонцаПериодаОтчета",  СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	ПараметрыОтчета.Вставить("УникальныйИдентификаторФормы", ЭтаФорма.УникальныйИдентификатор);
	ПараметрыОтчета.Вставить("АдресВоВременномХранилище", СтруктураРеквизитовФормы.АдресВоВременномХранилище);
	ПараметрыОтчета.Вставить("АдресВременногоХранилищаРасшифровки", СтруктураРеквизитовФормы.АдресВременногоХранилищаРасшифровки);
	ПараметрыОтчета.Вставить("Декларация", СтруктураРеквизитовФормы.мСохраненныйДок);
	ПараметрыОтчета.Вставить("МетодОтнесенияНДСВЗачет", СтруктураРеквизитовФормы.мМетодРасчета);
	
	Контейнер = Новый Структура();
	Контейнер.Вставить("Форма300Страница1", СтруктураДанныхФорма300Страница1);
	Контейнер.Вставить("Форма300Страница2", СтруктураДанныхФорма300Страница2);
	Контейнер.Вставить("Форма300Страница3", СтруктураДанныхФорма300Страница3);
	Контейнер.Вставить("Форма300Страница4", СтруктураДанныхФорма300Страница4);
	Контейнер.Вставить("Форма300_01Страница1", СтруктураДанныхФорма300_01Страница1);
	Контейнер.Вставить("Форма300_03Страница1", СтруктураДанныхФорма300_03Страница1);
	Контейнер.Вставить("Форма300_02Страница1", СтруктураДанныхФорма300_02Страница1);
	Контейнер.Вставить("Форма300_02Страница2", СтруктураДанныхФорма300_02Страница2);
	Контейнер.Вставить("Форма300_04Страница1", СтруктураДанныхФорма300_04Страница1);
	Контейнер.Вставить("Форма300_05Страница1", СтруктураДанныхФорма300_05Страница1);
	Контейнер.Вставить("Форма300_06Страница1", СтруктураДанныхФорма300_06Страница1);
	Контейнер.Вставить("Форма300_06Страница2", СтруктураДанныхФорма300_06Страница2);
	Контейнер.Вставить("Форма300_07Страница1", СтруктураДанныхФорма300_07Страница1);
	Контейнер.Вставить("Форма300_07Страница1_ДанныеДопСтрок", ДанныеФормыВЗначение(П0007100001, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма300_07Страница2", СтруктураДанныхФорма300_07Страница2);
	Контейнер.Вставить("Форма300_07Страница2_ДанныеДопСтрок", ДанныеФормыВЗначение(П0007200001, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма300_07Страница3", СтруктураДанныхФорма300_07Страница3);
	Контейнер.Вставить("Форма300_07Страница3_ДанныеДопСтрок", ДанныеФормыВЗначение(П0007300002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма300_07Страница4", СтруктураДанныхФорма300_07Страница4);
	Контейнер.Вставить("Форма300_07Страница4_ДанныеДопСтрок", ДанныеФормыВЗначение(П0007400001, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма300_08Страница1", СтруктураДанныхФорма300_08Страница1);
	Контейнер.Вставить("Форма300_08Страница1_ДанныеДопСтрок", ДанныеФормыВЗначение(П0008100001, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма300_08Страница2", СтруктураДанныхФорма300_08Страница2);
	Контейнер.Вставить("Форма300_08Страница2_ДанныеДопСтрок", ДанныеФормыВЗначение(П0008200001, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма300_08Страница3", СтруктураДанныхФорма300_08Страница3);
	Контейнер.Вставить("Форма300_08Страница3_ДанныеДопСтрок", ДанныеФормыВЗначение(П0008300002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма300_08Страница4", СтруктураДанныхФорма300_08Страница4);
	Контейнер.Вставить("Форма300_08Страница4_ДанныеДопСтрок", ДанныеФормыВЗначение(П0008400001, Тип("ТаблицаЗначений")));
	
	ЗаданиеВыполнено = Ложь;
	
	НаименованиеЗадания = НСтр("ru = 'Автоматическое заполнение по данным информационной базы'");
	
	ПараметрыЗаполнения = Новый Массив;
	ПараметрыЗаполнения.Добавить(ИмяОтчета(ЭтаФорма.ИмяФормы));
	ПараметрыЗаполнения.Добавить(ИмяФормыОтчета(ЭтаФорма.ИмяФормы));
	ПараметрыЗаполнения.Добавить(ПараметрыОтчета);
	ПараметрыЗаполнения.Добавить(Контейнер);
	
	Если ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая Тогда
		ВремяОжидания = 4;
	Иначе
		ВремяОжидания = 2;
	КонецЕсли;
	
	Задание = ФоновыеЗадания.Выполнить("РегламентированнаяОтчетностьПереопределяемый.ЗаполнитьОтчет", ПараметрыЗаполнения, , НаименованиеЗадания);
	
	Попытка
		Задание.ОжидатьЗавершения(ВремяОжидания);
	Исключение
		// Специальная обработка не требуется. Предположительно, исключение вызвано истечением времени ожидания.
	КонецПопытки;
	
	СтруктураРеквизитовФормы.ИдентификаторЗадания = Задание.УникальныйИдентификатор;
	
	// Если операция уже завершилась, то сразу обрабатываем результат.
	Если ДлительныеОперации.ЗаданиеВыполнено(Задание.УникальныйИдентификатор) Тогда
		
		ЗаданиеВыполнено = Истина;
		
		РегламентированнаяОтчетностьУПК.ФоновыеСообщенияПользователю(Задание.УникальныйИдентификатор, ЭтаФорма.УникальныйИдентификатор);
		
		ЗагрузитьПодготовленныеДанные();
		
	КонецЕсли;
	
	ЗаполнитьСведенияОбОрганизацииНаСервере();
	НачальныеОперацииСМногострочнымиБлоками();
	
	Возврат ЗаданиеВыполнено;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()
	
	СтруктураРеквизитовФормы.УспешноеАвтозаполнение = Истина;
	СтруктураРеквизитовФормы.ВерсияАвтозаполнения = "2016кв3";
	
	Контейнер = ПолучитьИзВременногоХранилища(СтруктураРеквизитовФормы.АдресВоВременномХранилище);
	
	Если ТипЗнч(Контейнер) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементСтруктуры Из Контейнер Цикл
		ИмяЭлемента = ЭлементСтруктуры.Ключ;
		
		Если ИмяЭлемента = "Форма300_07Страница1_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0007100001);
			
		ИначеЕсли ИмяЭлемента = "Форма300_07Страница2_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0007200001);
			
		ИначеЕсли ИмяЭлемента = "Форма300_07Страница3_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0007300002);
			
		ИначеЕсли ИмяЭлемента = "Форма300_07Страница4_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0007400001);
			
		ИначеЕсли ИмяЭлемента = "Форма300_08Страница1_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0008100001);
			
		ИначеЕсли ИмяЭлемента = "Форма300_08Страница2_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0008200001);
			
		ИначеЕсли ИмяЭлемента = "Форма300_08Страница3_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0008300002);
			
		ИначеЕсли ИмяЭлемента = "Форма300_08Страница4_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0008400001);
			
		ИначеЕсли ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ТаблицаЗначений") Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, ЭтаФорма["СтруктураДанных" + ИмяЭлемента]);
			
		Иначе
			ЭтаФорма["СтруктураДанных" + ИмяЭлемента] = ЭлементСтруктуры.Значение;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВывестиМакетВТаблДокНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	РасчетНаСервере("Форма300_07Страница3", "");
	РасчетНаСервере("Форма300_08Страница3", "");
	РасчетНаСервере("Форма300_06Страница1", "");
	
	Модифицированность = Ложь;
	
	Сохранить();
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Если Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	Оповещение = Новый ОписаниеОповещения("ПослеСохраненияФормыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	СохранитьНаКлиенте(, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиенте(Автосохранение = Ложь, ВыполняемоеОповещение = Неопределено) Экспорт
	
	
	Вариант = СтруктураРеквизитовФормы.ВидДокумента;
	
	Если НЕ РегламентированнаяОтчетностьКлиент.ПриЗаписиРегламентированногоОтчетаНаКлиенте(ЭтаФорма, , Автосохранение, Вариант) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатСохранения = ПередСохранением();
	
	ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения);
	
КонецПроцедуры

&НаСервере
Функция ПередСохранением()
	
	Возврат Сохранить();
	
КонецФункции

&НаСервере
Функция Сохранить()
	
	Если НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.ПолучитьОбъект();
	КонецЕсли;
	
	Если НЕ РегламентированнаяОтчетность.ПриЗаписиРегламентированногоОтчетаНаСервере(ЭтаФорма, , ,СтруктураРеквизитовФормы.ВидДокумента, , СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ИсточникОтчета           = Метаданные.Отчеты[Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7)].Имя;
	СтруктураРеквизитовФормы.мСохраненныйДок.НаименованиеОтчета       = Метаданные.Отчеты[Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7)].ОсновнаяФорма.Синоним;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаНачала               = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаОкончания            = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.Периодичность            = СтруктураРеквизитовФормы.мПериодичность;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВыбраннаяФорма           = СтруктураРеквизитовФормы.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок.Организация              = СтруктураРеквизитовФормы.Организация;
	СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий              = Комментарий;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаПодписи              = ТекущаяДата(); 
	СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения         = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВидОтчетности            = Перечисления.ВидыОтчетности.РегламентированнаяОтчетность;
	СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий              = Комментарий;
	СтруктураРеквизитовФормы.мСохраненныйДок.КодНалоговогоОргана      = ?(СтруктураРеквизитовФормы.Налоговыйкомитет = Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка(),"",СтруктураРеквизитовФормы.Налоговыйкомитет.Код);
	СтруктураРеквизитовФормы.мСохраненныйДок.КПП                      = "";
	СтруктураРеквизитовФормы.мСохраненныйДок.Вид                      = СтруктураРеквизитовФормы.ВидДокумента;
	СтруктураРеквизитовФормы.мСохраненныйДок.ПредставлениеВида        = РегламентированнаяОтчетность.ПредставлениеВидаДокумента(СтруктураРеквизитовФормы.мСохраненныйДок.Вид);
	СтруктураРеквизитовФормы.мВариант                                 = СтруктураРеквизитовФормы.ВидДокумента;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ФорматВыгрузки = "Автоматически";
	//сохранение данных текущего раздела
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	// формируем данные редактируемых ячеек таблицы
	ПоказателиОтчета = Новый Структура();
	
	ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета);
	// формируем список сохранения
	СписокСохранения = Новый Структура();
	
	// вставляем данные редактируемых ячеек таблицы
	СписокСохранения.Вставить("ПоказателиОтчета", ПоказателиОтчета);
	СписокСохранения.Вставить("НалоговыйКомитет", СтруктураРеквизитовФормы.НалоговыйКомитет);
	
	ДанныеМногострочныхРазделов = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		
		ДанныеМногострочныхРазделов.Вставить(ЭлементСтруктуры.Ключ, ДанныеФормыВЗначение(ЭтаФорма[ЭлементСтруктуры.Значение], Тип("ТаблицаЗначений")));
		
	КонецЦикла;
	
	СписокСохранения.Вставить("ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов);
	
	ДанныеМногостраничныхРазделов = Новый Структура;
	
	МассивТиповНеопределено = Новый Массив; 
	МассивТиповНеопределено.Добавить(Тип("Неопределено"));
	ОписаниеТиповНеопределено = Новый ОписаниеТипов(МассивТиповНеопределено);
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногостраничныхРазделов Цикл
		ИмяРаздела = ЭлементСтруктуры.Ключ;
		ИмяСтруктурыДанных = ЭлементСтруктуры.Значение;
		ДанныеВТаблицеЗначений = СведенияМногостраничногоРазделаВТаблице(ИмяСтруктурыДанных);
		Если ДанныеВТаблицеЗначений <> Неопределено Тогда
			ДанныеМногостраничныхРазделов.Вставить(ИмяРаздела, ДанныеВТаблицеЗначений);
		КонецЕсли;
	КонецЦикла;
	
	ХранилищеДанных = Новый ХранилищеЗначения(СписокСохранения);
	СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета = ХранилищеДанных;
	
	Попытка
		СтруктураРеквизитовФормы.мСохраненныйДок.Записать();
	Исключение
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецПопытки;
	Модифицированность = Ложь;
	
	СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения)
	
	КлючУникальности = СтруктураРеквизитовФормы.мСохраненныйДок;
	
	Если РезультатСохранения Тогда
		
		РегламентированнаяОтчетностьКлиент.ПослеЗаписиРегламентированногоОтчета(ЭтаФорма);
		
		Если ВыполняемоеОповещение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ВыполняемоеОповещение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСохраненияФормыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.Форма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета)
	
	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		ПоказателиОтчета.Вставить(Префикс + Раздел.ИмяСтраницы, ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы]);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СведенияМногостраничногоРазделаВТаблице(ИмяСтруктурыДанных)
	
	ОписаниеТиповНеопределено = Новый ОписаниеТипов("Неопределено");
	
	ТаблицаЗначенийСДанными = ДанныеФормыВЗначение(ЭтаФорма[ИмяСтруктурыДанных], Тип("ТаблицаЗначений"));
	
	Если ТаблицаЗначенийСДанными <> Неопределено Тогда
		
		Если ТаблицаЗначенийСДанными.Колонки.Найти("Данные") <> Неопределено Тогда
			ТаблицаЗначенийСДанными.Колонки.Удалить("Данные");
			ТаблицаЗначенийСДанными.Колонки.Добавить("Данные", ОписаниеТиповНеопределено);
			
			Ном = 0;
			Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначенийСДанными Цикл
				СтрокаТаблицыЗначений.Данные = ЭтаФорма[ИмяСтруктурыДанных][Ном].Данные[0].Значение;
				Ном = Ном + 1;
			КонецЦикла;
		КонецЕсли;
		
		Если ТаблицаЗначенийСДанными.Колонки.Найти("ДанныеДопСтрок") <> Неопределено Тогда
			ТаблицаЗначенийСДанными.Колонки.Удалить("ДанныеДопСтрок");
			ТаблицаЗначенийСДанными.Колонки.Добавить("ДанныеДопСтрок", ОписаниеТиповНеопределено);
			
			Ном = 0;
			Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначенийСДанными Цикл
				
				Если ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок.Количество() > 0
					И ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок[0].Представление = "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела" Тогда
					СтрокаТаблицыЗначений.ДанныеДопСтрок = ДанныеФормыВЗначение(ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок[0].Значение, Тип("ТаблицаЗначений"));
					
					Ном = Ном + 1;
					Продолжить;
				КонецЕсли;
				
				СтруктураДанныхДопСтрок = Новый Структура;
				
				Для Каждого ЭлСтруктуры Из ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок Цикл
					СтруктураДанныхДопСтрок.Вставить(ДанныеФормыВЗначение(ЭлСтруктуры.Значение, Тип("ТаблицаЗначений")));
				КонецЦикла;
				
				СтрокаТаблицыЗначений.ДанныеДопСтрок = СтруктураДанныхДопСтрок;
				
				Ном = Ном + 1;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаЗначенийСДанными;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьБланк(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБланкЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Команда = ДополнительныеПараметры.Команда;
	
	ДополнительныеПараметрыПечати = Новый Структура;
	ДополнительныеПараметрыПечати.Вставить("ВидПечати", Команда.Имя);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПечатьЗавершение", ЭтотОбъект, ДополнительныеПараметрыПечати);
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
						
	Иначе
		
		СохранитьНаКлиенте(, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьСразу(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьСразуЗавершение (Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Команда = ДополнительныеПараметры.Команда;
	
	Если Команда <> Неопределено Тогда
		Печать(Команда.Имя);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(ВидПечати, НеИзФормыОтчета = Ложь) Экспорт
	
	Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1. Формируется печатная форма...'"), ЭтаФорма.Заголовок), , , БиблиотекаКартинок.Печать);
	
	Если СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки <> Неопределено И СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки Тогда
		РегламентированнаяОтчетностьКлиент.ПроверитьКонтрольныеСоотношения(ЭтаФорма, ОбработкаКС);
	КонецЕсли;
	
	Если НЕ ПечатьНаСервере(ВидПечати) Тогда
		Возврат;
	КонецЕсли;
	
	
	ОбщиеРеквизитыРазделов = Новый Структура;
	
	
	РегламентированнаяОтчетностьКлиент.ОткрытьФормуПредварительногоПросмотра(ЭтаФорма, ВидПечати, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере(ВидПечати)
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	Раздел = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	СтруктураРеквизитовФормы.мПечатныеФормы.Очистить();
	СтруктураРеквизитовФормы.мРежимПечати = Истина;
	
	Для Каждого ЭлеменетДерева Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		Если ЭлеменетДерева.ВыводНаПечать = 1 Тогда
			ВывестиМакетСтраницыВТабличныйДокументНаСервере(ЭлеменетДерева.ИмяСтраницы);
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("НаименованиеЛиста",  ЭлеменетДерева.Представление);
			СтруктураПараметров.Вставить("ОриентацияЛиста",    ЭлеменетДерева.ОриентацияСтраницы);
			СтруктураПараметров.Вставить("ИмяСтраницы",        ЭлеменетДерева.ИмяСтраницы);
			Структурапараметров.Вставить("ИмяОбластиТаблПоля", "ТабличныйДокумент");
			СтруктураПараметров.Вставить("ВидПечати",          ВидПечати);
			
			РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, СтруктураПараметров, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(Раздел);
	
	РегламентированнаяОтчетностьКлиентСервер.ПроставлениеНомеровЛистов(ЭтаФорма, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	РегламентированнаяОтчетностьКлиент.ПередЗакрытиемРегламентированногоОтчета(ЭтаФорма, Отказ, СтандартнаяОбработка,ЗавершениеРаботы, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПриЗакрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	РегламентированнаяОтчетность.ПриЗакрытииРегламентированногоОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка);
	
	Если СтрЧислоВхождений(Область.Имя, "ДобавитьСтроку") > 0 Тогда
		ДобавитьСтроку("");
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "УдалитьСтроку") > 0 И Область.Гиперссылка Тогда
		УдалитьСтроку("");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка)
	
	//Если РегламентированнаяОтчетностьКлиент.ВыбраннаяОбластьРегламентированногоОтчетаНеВерна(ЭтаФорма, Область, СтандартнаяОбработка) Тогда
	//	Возврат;
	//КонецЕсли;
	
	ИмяЯчейки = Область.Имя;
	
	Если (Найти(ИмяЯчейки, "Первоначальная") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Очередная") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Дополнительная") > 0)
		ИЛИ (Найти(ИмяЯчейки, "ПоУведомлению") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Ликвидационная") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Условие_A") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Условие_B") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Условие_B") > 0) 
		ИЛИ (Найти(ИмяЯчейки, "Приложение01") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Приложение02") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Приложение03") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Приложение04") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Приложение05") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Приложение06") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Приложение07") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Приложение08") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Приложение09") > 0) Тогда
		РасчетНаКлиенте("Форма300Страница1",ИмяЯчейки);
	КонецЕсли;
	
	Если (Найти(ИмяЯчейки, "ОтказОтВозврата") > 0) Тогда
		РасчетНаКлиенте("Форма300Страница4",ИмяЯчейки);
	КонецЕсли;		
	
	Если (Найти(ИмяЯчейки, "КодНалоговогоОргана") > 0) Тогда 
		
		ЗначенияОтборов = Новый Структура;
		ЗначенияОтборов.Вставить("Владелец", СтруктураРеквизитовФормы.Организация);
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", ЗначенияОтборов);
		ОповещениеВыбора = Новый ОписаниеОповещения("ПослеВыбораНалоговогоКомитета", ЭтаФорма);
		ОткрытьФорму("Справочник.РегистрацииВНалоговомОргане.Форма.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОповещениеВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНалоговогоКомитета(ВыбЭлемент, Параметры) Экспорт
	
	ПоменялсяНалоговыйКомитет = Ложь;
	
	Если ЗначениеЗаполнено(ВыбЭлемент) Тогда
		ПоменялсяНалоговыйКомитет = НЕ(СтруктураРеквизитовФормы.НалоговыйКомитет = ВыбЭлемент);
		СтруктураРеквизитовФормы.НалоговыйКомитет = ВыбЭлемент;
	КонецЕсли;
	
	Если ПоменялсяНалоговыйКомитет Тогда
		ЗаполнитьСведенияОбОрганизацииНаСервере();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	#Если ВебКлиент Тогда
		ВставитьДополнительнуюСтрокуНаСервере();
	#Иначе
		ВставитьДополнительнуюСтрокуНаКлиенте();
	#КонецЕсли
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура ВставитьДополнительнуюСтрокуНаСервере()
	
	ВставитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьДополнительнуюСтрокуНаКлиенте()
	
	ВставитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВставитьДополнительнуюСтроку(Форма, ИмяГруппыБлока = Неопределено, СпециальноеДобавление = Ложь, ИмяКолонкиНомера = Неопределено) Экспорт
	
	Перем СтруктураГруппы;
	Перем МаксимальноеКоличествоСтрокГруппы;
	
	Если ИмяГруппыБлока = Неопределено Тогда
		// Сначала выполним проверку на активную страницу панели формы,
		// которая содержит многострочный раздел
		#Если НаКлиенте Тогда
			ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		#Иначе
			ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		#КонецЕсли
		
		Если ИмяГруппы = Неопределено Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Не выбран многострочный раздел, в который необходимо добавить строку.'");
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли;
		
	Иначе
		ИмяГруппы = ИмяГруппыБлока;
	КонецЕсли;
	
	// Исходное количество строк группы
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, МаксимальноеКоличествоСтрокГруппы);
	
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = Форма[СтруктураГруппы];
	
	// определяем последнюю строку многострочной группы
	КолСтрок = СтруктураГруппы.Количество();
	КолСтрокСтр = Формат(КолСтрок, "ЧГ=");
	
	
	ИмяПервойЯчейкиПоследнейСтроки = ИмяГруппы + "01_" + КолСтрокСтр;
	
	// область первой ячейки последней строки многострочного раздела
	ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяПервойЯчейкиПоследнейСтроки];
	
	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// номера строк исходной области
	НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;
	НомерНижнЯчейкиОбласти = ОбластьЯчейки.Верх + ВысотаСтроки - 1;
	
	СдвигСтрок = НомерНижнЯчейкиОбласти - НомерВерхЯчейкиОбласти + 1;
	
	// номера строк вставляемой области
	НомерВерхЯчейкиНовойОбласти = НомерВерхЯчейкиОбласти + СдвигСтрок;
	НомерНижнЯчейкиНовойОбласти = НомерНижнЯчейкиОбласти + СдвигСтрок;
	
	НазначитьИмяОбластиМЧ = Ложь;
	ВставляемаяОбласть = ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, );
	Если СтрНайти(ВставляемаяОбласть.Имя, "МногострочнаяЧасть") Тогда
		НазначитьИмяОбластиМЧ = Истина;
		ИмяМногострочнойЧасти = ВставляемаяОбласть.Имя;
	КонецЕсли;
	
	Если НЕ СпециальноеДобавление Тогда
		
		РегламентированнаяОтчетностьВызовСервера.ВставитьОбластьВТабличныйДокумент(ТекТабличноеПоле, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
		
		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
	КонецЕсли;
	
	Если НазначитьИмяОбластиМЧ Тогда
		ТекТабличноеПоле.Область(НомерНижнЯчейкиОбласти + 1, , НомерНижнЯчейкиОбласти + (НомерНижнЯчейкиОбласти - НомерВерхЯчейкиОбласти) + 1, ).Имя = "";
		ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, ).Имя = ИмяМногострочнойЧасти;
	КонецЕсли;
	
	КолСтрокСтр1 = Формат(КолСтрок + 1, "ЧГ=");
	
	Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
		
		ИмяКолонки = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
		
		
		// переопределяем имена вставленной области
		Если СтруктураГруппы[0].Свойство(ИмяКолонки) Тогда
			
			ИмяОбластиЯчейки    = ИмяКолонки + "_" + КолСтрокСтр;
			ИмяНовОбластиЯчейки = ИмяКолонки + "_" + КолСтрокСтр1;
			
			ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяОбластиЯчейки];
			ОбластьЯчейки.Имя = ИмяНовОбластиЯчейки;
			
			Если (НомерГрафы = 1) Тогда
				ТекТабличноеПоле.Области["УдалитьСтроку" + ИмяОбластиЯчейки].Имя = "УдалитьСтроку" + ИмяНовОбластиЯчейки;
			КонецЕсли;
			
			// определяем границы ячейки исходной области
			НомерВерхСтрокиЯчейки  = ОбластьЯчейки.Верх - СдвигСтрок;
			НомерНижнСтрокиЯчейки  = ОбластьЯчейки.Низ  - СдвигСтрок;
			НомерЛевоКолонкиЯчейки = ОбластьЯчейки.Лево;
			НомерПравКолонкиЯчейки = ОбластьЯчейки.Право;
			
			// Назначаем имя ячейки исходной области,
			// (т.к. в результате вставки новой области оно было очищено)
			ОбластьЯчейкиИсходнойОбласти = ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки, НомерНижнСтрокиЯчейки, НомерПравКолонкиЯчейки);
			ОбластьЯчейкиИсходнойОбласти.Имя = ИмяОбластиЯчейки;
			
			Если (НомерГрафы = 1) Тогда
				
				ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки - 1, НомерНижнСтрокиЯчейки, НомерЛевоКолонкиЯчейки - 1).Имя  = "УдалитьСтроку" + ИмяОбластиЯчейки;
				
			КонецЕсли;
			
			// очищаем значения ячеек вставленной области
			Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
				ОбластьЯчейки.Очистить();
			КонецЕсли;
			
			Если ИмяКолонкиНомера <> Неопределено Тогда
				Если ИмяКолонкиНомера = ИмяКолонки Тогда
					Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
						ОбластьЯчейки.Значение = КолСтрокСтр1;
					Иначе
						ОбластьЯчейки.Текст = КолСтрокСтр1;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИмяГруппыБлока = Неопределено Тогда
		
		
		ИмяТекущейОбласти = ИмяГруппы + "01_" + КолСтрокСтр1;
		
		Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];
		
		// установим фокус на поле табличн. документа
		ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
		
	КонецЕсли;
	
	// добавляем в структуру многострочной группы новую строку
	ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,Форма);
	
	//ПрописатьФункцию добавления по всем страницам приложения
	
	Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
		Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
			ОбластьТД.Гиперссылка = Истина;
			ОбластьТД.Текст = "х";
		КонецЕсли;
	КонецЦикла;
	
	Форма.Модифицированность = Истина;
	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	
	ТекТабличноеПоле = ЭтаФорма["ТабличныйДокумент"];
	
	ТекущаяОбласть = ТекТабличноеПоле.ТекущаяОбласть;
	
	ИмяГруппы = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(ЭтаФорма, ТекущаяОбласть);
	
	Если ИмяГруппы = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не выбрана удаляемая строка многострочного раздела.'");
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьСтрокуЗавершение", ЭтотОбъект);
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Удалить выбранную строку?'"), Символы.ПС);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	#Если ВебКлиент Тогда
		УдалитьДополнительнуюСтрокуНаСервере();
	#Иначе
		УдалитьДополнительнуюСтрокуНаКлиенте();
	#КонецЕсли
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДополнительнуюСтрокуНаСервере()
	
	УдалитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДополнительнуюСтрокуНаКлиенте()
	
	УдалитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьДополнительнуюСтроку(Форма, СпециальноеДобавление = Ложь, ИмяКолонкиНомера = Неопределено) Экспорт
	
	Перем ИсходноеКоличествоСтрокГруппы;
	Перем СтруктураГруппы;
	
	ТекущаяСтраница = Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	ТекТабличноеПоле = Форма.ТабличныйДокумент;
	
	ТекущаяОбласть = Форма.Элементы["ТабличныйДокумент"].ТекущаяОбласть;
	
	#Если НаКлиенте ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		ИмяГруппы = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(Форма, ТекущаяОбласть);
	#Иначе
		ИмяГруппы = РегламентированнаяОтчетностьВызовСервера.РазделТекущейОбластиНаСервере(Форма, ТекущаяОбласть);
	#КонецЕсли
	
	// исходное количество строк группы
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
	
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = Форма[СтруктураГруппы];
	
	// Выполним также проверку вхождения текущей (выделенной) ячейки в многострочный раздел
	ТекущаяОбласть = Форма.Элементы["ТабличныйДокумент"].ТекущаяОбласть;
	
	ИмяЯчейки = ТекущаяОбласть.Имя;
	
	// номер строки многострочного раздела определим
	// по имени выделенной ячейки
	НомУдаляемойСтроки = Число(Сред(ИмяЯчейки, СтрНайти(ИмяЯчейки, "_") + 1));
	НомерСтрокиТаблицы = НомУдаляемойСтроки - 1; // нумерация строк в таблице значений начинается с нуля
	
	Если СтруктураГруппы.Количество() > ИсходноеКоличествоСтрокГруппы Тогда
		
		ИмяПервойЯчейкиУдаляемойСтроки = "УдалитьСтроку" + ИмяГруппы + "01_" + Формат(НомУдаляемойСтроки, "ЧГ=0");
		
		// область первой ячейки удаляемой строки многострочного раздела
		ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяПервойЯчейкиУдаляемойСтроки];
		
		НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
		ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
		
		НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;
		НомерНижнЯчейкиОбласти = ОбластьЯчейки.Верх + ВысотаСтроки - 1;
		
		МногострочностьВРазделе = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе");
		МногострочностьВРазделеТип = ТипЗнч(МногострочностьВРазделе);
		Если МногострочностьВРазделеТип = Тип("Число") Тогда
			ИмяОбластиМнгЧ = "МногострочнаяЧасть";
		ИначеЕсли МногострочностьВРазделеТип = Тип("ДанныеФормыКоллекция") Тогда
			ИмяОбластиМнгЧ = МногострочностьВРазделе.НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0].Область;
		КонецЕсли;
		// Найдем координаты области, для последующего восстановления.
		
		Если ТекТабличноеПоле.Области.Найти(ИмяОбластиМнгЧ) <> Неопределено Тогда
			ОбластьВерх = ТекТабличноеПоле.Области[ИмяОбластиМнгЧ].Верх;
			ОбластьНиз = ТекТабличноеПоле.Области[ИмяОбластиМнгЧ].Низ;
		КонецЕсли;
		
		Если СпециальноеДобавление Тогда
			
		Иначе
			
			РегламентированнаяОтчетностьВызовСервера.УдалитьОбластьИзТабличногоДокумента(ТекТабличноеПоле, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
			
			Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
			
		КонецЕсли;
		// Восстановим область.
		ТекТабличноеПоле.Область(ОбластьВерх, 0, ОбластьНиз, 0).Имя = ИмяОбластиМнгЧ;
		
		КолвоСдвигаемыхСтрок = СтруктураГруппы.Количество() - НомУдаляемойСтроки;
		
		// обновим имена ячеек сдвинутых строк
		Если КолвоСдвигаемыхСтрок > 0 Тогда
			
			Для НСтр = НомУдаляемойСтроки + 1 По СтруктураГруппы.Количество() Цикл
				
				ТекСтрока = СтруктураГруппы[НСтр - 1];
				
				НСтрСтр = Формат(НСтр, "ЧГ=0");
				НСтрСтр1 = Формат(НСтр - 1, "ЧГ=0");
				
				Для НомерГрафы = 0 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
					
					Если НомерГрафы = 0 Тогда
						
						КолонкаИмя = "УдалитьСтроку" + ИмяГруппы + Формат( 1, "ЧЦ=2; ЧВН=");
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ИмяКолонкиНомера <> Неопределено Тогда
							Если ИмяКолонкиНомера = КолонкаИмя Тогда
								// обновляем порядковый номер строки
								
								СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
								НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
								ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер;
								
								// обновляем значение элемента таблицы значений
								ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
					КолонкаИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
					
					Если СтруктураГруппы[0].Свойство(КолонкаИмя) Тогда
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ИмяКолонкиНомера <> Неопределено Тогда
							Если ИмяКолонкиНомера = КолонкаИмя Тогда
								// обновляем порядковый номер строки
								
								СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
								НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
								ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер;
								
								// обновляем значение элемента таблицы значений
								ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
		КонецЕсли;
		// обновляем структуру многострочного раздела
		
		//Процедура удаления по всем страницам приложения
		УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма);
		
	Иначе
		// строка не удаляется в форме табличного документа,
		// а должна осуществляться сдвиг строк
		
		// обновляем структуру многострочного раздела
		// методом удаления выбранной строки и добавления пустой строки
		
		//Процедура удаления по всем страницам приложения
		УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма);
		
		//Процедура удаления по всем страницам приложения
		ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,Форма);
		
		// обновляем порядковые номера строк, выводимых в табличный документ
		Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
			
			НомерСтрокиВТаблице = СтруктураГруппы.Индекс(СтрокаТаблицы);
			НомерСтрокиВФормеТаблицы = Формат(НомерСтрокиВТаблице + 1, "ЧГ=0");
			
			Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
				
				КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
				
				Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
					
					Если ИмяКолонкиНомера <> Неопределено Тогда
						Если ИмяКолонкиНомера = КолонкаТаблицыИмя Тогда
							// обновляем порядковый номер строки
							СтрокаТаблицы[КолонкаТаблицыИмя] = НомерСтрокиВФормеТаблицы;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;	
				
			КонецЦикла;
			
		КонецЦикла;
		
		// Данные в многострочном блоке обновляются в декларациях!
		// Форма.ОбновитьСтруктуруМногострочногоРаздела(ИмяГруппы);
		// Обновляем экранную форму табличного документа
		#Если НаКлиенте Тогда
			Форма.ВывестиРазделВТабличныйДокументНаКлиенте(ИмяГруппы, СтруктураГруппы);
		#Иначе
			Форма.ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппы, СтруктураГруппы);
		#КонецЕсли
		
	КонецЕсли;
	
	// назначим текущей областью таблицы первую редактируемую ячейку
	// удаленной строки, если ее порядковый номер меньше кол-ва строк
	// многострочного раздела, или последней строки раздела в противном случае
	
	// определяем текущую область таблицы
	НомТекущейСтроки = Мин(НомУдаляемойСтроки, СтруктураГруппы.Количество());
	
	ИмяТекущейОбласти = "УдалитьСтроку" + ИмяГруппы + "01_" + Формат(НомТекущейСтроки, "ЧГ=0");
	
	Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];
	
	// установим фокус на поле табличн. документа
	ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
	
	ЕстьДопСтроки = Ложь;
	
	Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
		Если СтрЧислоВхождений(ОбластьТД.Имя, "_2") > 0 Тогда
			ЕстьДопСтроки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьДопСтроки Тогда
		Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
			Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
				ОбластьТД.Гиперссылка = Ложь;
				ОбластьТД.Текст = "";
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Форма.Модифицированность = Истина;
	
	#Если НаКлиенте Тогда
		Форма.РасчетНаКлиенте(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	#Иначе
		Форма.РасчетНаСервере(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы31", СтруктураРеквизитовФормы.мИдГруппы31);
	ИдГрупп.Вставить("мИдГруппы32", СтруктураРеквизитовФормы.мИдГруппы32);
	ИдГрупп.Вставить("мИдГруппы33", СтруктураРеквизитовФормы.мИдГруппы33);
	ИдГрупп.Вставить("мИдГруппы71", СтруктураРеквизитовФормы.мИдГруппы71);
	ИдГрупп.Вставить("мИдГруппы72", СтруктураРеквизитовФормы.мИдГруппы72);
	ИдГрупп.Вставить("мИдГруппы73", СтруктураРеквизитовФормы.мИдГруппы73);
	ИдГрупп.Вставить("мИдГруппы74", СтруктураРеквизитовФормы.мИдГруппы74);
	ИдГрупп.Вставить("мИдГруппы81", СтруктураРеквизитовФормы.мИдГруппы81);
	ИдГрупп.Вставить("мИдГруппы82", СтруктураРеквизитовФормы.мИдГруппы82);
	ИдГрупп.Вставить("мИдГруппы83", СтруктураРеквизитовФормы.мИдГруппы83);
	ИдГрупп.Вставить("мИдГруппы84", СтруктураРеквизитовФормы.мИдГруппы84);
	ИдГрупп.Вставить("мИдГруппы911", СтруктураРеквизитовФормы.мИдГруппы911);
	ИдГрупп.Вставить("мИдГруппы912", СтруктураРеквизитовФормы.мИдГруппы912);
	ИдГрупп.Вставить("мИдГруппы921", СтруктураРеквизитовФормы.мИдГруппы921);
	ИдГрупп.Вставить("мИдГруппы922", СтруктураРеквизитовФормы.мИдГруппы922);
	ИдГрупп.Вставить("мИдГруппы931", СтруктураРеквизитовФормы.мИдГруппы931);
	ИдГрупп.Вставить("мИдГруппы932", СтруктураРеквизитовФормы.мИдГруппы932);
	ИдГрупп.Вставить("мИдГруппы941", СтруктураРеквизитовФормы.мИдГруппы941);
	ИдГрупп.Вставить("мИдГруппы942", СтруктураРеквизитовФормы.мИдГруппы942);
	
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста, , ИдГрупп);
	
КонецФункции

&НаКлиенте
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы31", СтруктураРеквизитовФормы.мИдГруппы31);
	ИдГрупп.Вставить("мИдГруппы32", СтруктураРеквизитовФормы.мИдГруппы32);
	ИдГрупп.Вставить("мИдГруппы33", СтруктураРеквизитовФормы.мИдГруппы33);
	ИдГрупп.Вставить("мИдГруппы71", СтруктураРеквизитовФормы.мИдГруппы71);
	ИдГрупп.Вставить("мИдГруппы72", СтруктураРеквизитовФормы.мИдГруппы72);
	ИдГрупп.Вставить("мИдГруппы73", СтруктураРеквизитовФормы.мИдГруппы73);
	ИдГрупп.Вставить("мИдГруппы74", СтруктураРеквизитовФормы.мИдГруппы74);
	ИдГрупп.Вставить("мИдГруппы81", СтруктураРеквизитовФормы.мИдГруппы81);
	ИдГрупп.Вставить("мИдГруппы82", СтруктураРеквизитовФормы.мИдГруппы82);
	ИдГрупп.Вставить("мИдГруппы83", СтруктураРеквизитовФормы.мИдГруппы83);
	ИдГрупп.Вставить("мИдГруппы84", СтруктураРеквизитовФормы.мИдГруппы84);
	ИдГрупп.Вставить("мИдГруппы911", СтруктураРеквизитовФормы.мИдГруппы911);
	ИдГрупп.Вставить("мИдГруппы912", СтруктураРеквизитовФормы.мИдГруппы912);
	ИдГрупп.Вставить("мИдГруппы921", СтруктураРеквизитовФормы.мИдГруппы921);
	ИдГрупп.Вставить("мИдГруппы922", СтруктураРеквизитовФормы.мИдГруппы922);
	ИдГрупп.Вставить("мИдГруппы931", СтруктураРеквизитовФормы.мИдГруппы931);
	ИдГрупп.Вставить("мИдГруппы932", СтруктураРеквизитовФормы.мИдГруппы932);
	ИдГрупп.Вставить("мИдГруппы941", СтруктураРеквизитовФормы.мИдГруппы941);
	ИдГрупп.Вставить("мИдГруппы942", СтруктураРеквизитовФормы.мИдГруппы942);
	
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста, , ИдГрупп);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста = Неопределено, ТекущаяСтраница, ИдГрупп)
	
	Перем ИмяГруппы;
	
	Если ИмяЛиста = Неопределено Тогда
		ИмяТекущейСтраницыПанели = ТекущаяСтраница.Имя;
	Иначе
		ИмяТекущейСтраницыПанели = ИмяЛиста;
	КонецЕсли;
	
	Если ИмяТекущейСтраницыПанели = "Форма300_03Страница1" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы31;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_03Страница2" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы32;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_03Страница3" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы33;
	ИначеЕсли ИмяТекущейСтраницыПанели = "Форма300_07Страница1" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы71;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_07Страница2" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы72;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_07Страница3" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы73;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_07Страница4" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы74;
	ИначеЕсли ИмяТекущейСтраницыПанели = "Форма300_08Страница1" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы81;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_08Страница2" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы82;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_08Страница3" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы83;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_08Страница4" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы84;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_09_01Страница1" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы911;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_09_01Страница2" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы912;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_09_02Страница1" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы921;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_09_02Страница2" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы922;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_09_03Страница1" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы931;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_09_03Страница2" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы932;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_09_04Страница1" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы941;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_09_04Страница2" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы942;
	КонецЕсли;
	
	Возврат ИмяГруппы;
	
КонецФункции

&НаКлиенте
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы31", СтруктураРеквизитовФормы.мИдГруппы31);
	ИдГрупп.Вставить("мИдГруппы32", СтруктураРеквизитовФормы.мИдГруппы32);
	ИдГрупп.Вставить("мИдГруппы33", СтруктураРеквизитовФормы.мИдГруппы33);
	ИдГрупп.Вставить("мИдГруппы71", СтруктураРеквизитовФормы.мИдГруппы71);
	ИдГрупп.Вставить("мИдГруппы72", СтруктураРеквизитовФормы.мИдГруппы72);
	ИдГрупп.Вставить("мИдГруппы73", СтруктураРеквизитовФормы.мИдГруппы73);
	ИдГрупп.Вставить("мИдГруппы74", СтруктураРеквизитовФормы.мИдГруппы74);
	ИдГрупп.Вставить("мИдГруппы81", СтруктураРеквизитовФормы.мИдГруппы81);
	ИдГрупп.Вставить("мИдГруппы82", СтруктураРеквизитовФормы.мИдГруппы82);
	ИдГрупп.Вставить("мИдГруппы83", СтруктураРеквизитовФормы.мИдГруппы83);
	ИдГрупп.Вставить("мИдГруппы84", СтруктураРеквизитовФормы.мИдГруппы84);
	ИдГрупп.Вставить("мИдГруппы911", СтруктураРеквизитовФормы.мИдГруппы911);
	ИдГрупп.Вставить("мИдГруппы912", СтруктураРеквизитовФормы.мИдГруппы912);
	ИдГрупп.Вставить("мИдГруппы921", СтруктураРеквизитовФормы.мИдГруппы921);
	ИдГрупп.Вставить("мИдГруппы922", СтруктураРеквизитовФормы.мИдГруппы922);
	ИдГрупп.Вставить("мИдГруппы931", СтруктураРеквизитовФормы.мИдГруппы931);
	ИдГрупп.Вставить("мИдГруппы932", СтруктураРеквизитовФормы.мИдГруппы932);
	ИдГрупп.Вставить("мИдГруппы941", СтруктураРеквизитовФормы.мИдГруппы941);
	ИдГрупп.Вставить("мИдГруппы942", СтруктураРеквизитовФормы.мИдГруппы942);
	
	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

&НаСервере
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы31", СтруктураРеквизитовФормы.мИдГруппы31);
	ИдГрупп.Вставить("мИдГруппы32", СтруктураРеквизитовФормы.мИдГруппы32);
	ИдГрупп.Вставить("мИдГруппы33", СтруктураРеквизитовФормы.мИдГруппы33);
	ИдГрупп.Вставить("мИдГруппы71", СтруктураРеквизитовФормы.мИдГруппы71);
	ИдГрупп.Вставить("мИдГруппы72", СтруктураРеквизитовФормы.мИдГруппы72);
	ИдГрупп.Вставить("мИдГруппы73", СтруктураРеквизитовФормы.мИдГруппы73);
	ИдГрупп.Вставить("мИдГруппы74", СтруктураРеквизитовФормы.мИдГруппы74);
	ИдГрупп.Вставить("мИдГруппы81", СтруктураРеквизитовФормы.мИдГруппы81);
	ИдГрупп.Вставить("мИдГруппы82", СтруктураРеквизитовФормы.мИдГруппы82);
	ИдГрупп.Вставить("мИдГруппы83", СтруктураРеквизитовФормы.мИдГруппы83);
	ИдГрупп.Вставить("мИдГруппы84", СтруктураРеквизитовФормы.мИдГруппы84);
	ИдГрупп.Вставить("мИдГруппы911", СтруктураРеквизитовФормы.мИдГруппы911);
	ИдГрупп.Вставить("мИдГруппы912", СтруктураРеквизитовФормы.мИдГруппы912);
	ИдГрупп.Вставить("мИдГруппы921", СтруктураРеквизитовФормы.мИдГруппы921);
	ИдГрупп.Вставить("мИдГруппы922", СтруктураРеквизитовФормы.мИдГруппы922);
	ИдГрупп.Вставить("мИдГруппы931", СтруктураРеквизитовФормы.мИдГруппы931);
	ИдГрупп.Вставить("мИдГруппы932", СтруктураРеквизитовФормы.мИдГруппы932);
	ИдГрупп.Вставить("мИдГруппы941", СтруктураРеквизитовФормы.мИдГруппы941);
	ИдГрупп.Вставить("мИдГруппы942", СтруктураРеквизитовФормы.мИдГруппы942);
	
	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп) Экспорт
	
	Перем ТекТабличноеПоле;
	
	Если ИдГруппы = ИдГрупп.мИдГруппы31 Тогда
		
		ТекТабличноеПоле = "Форма300_03Страница1";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы32 Тогда
		
		ТекТабличноеПоле = "Форма300_03Страница2";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы33 Тогда
		
		ТекТабличноеПоле = "Форма300_03Страница3";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы71 Тогда
		
		ТекТабличноеПоле = "Форма300_07Страница1";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы72 Тогда
		
		ТекТабличноеПоле = "Форма300_07Страница2";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы73 Тогда
		
		ТекТабличноеПоле = "Форма300_07Страница3";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы74 Тогда
		
		ТекТабличноеПоле = "Форма300_07Страница4";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы81 Тогда
		
		ТекТабличноеПоле = "Форма300_08Страница1";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы82 Тогда
		
		ТекТабличноеПоле = "Форма300_08Страница2";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы83 Тогда
		
		ТекТабличноеПоле = "Форма300_08Страница3";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы84 Тогда
		
		ТекТабличноеПоле = "Форма300_08Страница4";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы911 Тогда
		
		ТекТабличноеПоле = "Форма300_09_01Страница1";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы912 Тогда
		
		ТекТабличноеПоле = "Форма300_09_01Страница2";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы921 Тогда
		
		ТекТабличноеПоле = "Форма300_09_02Страница1";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы922 Тогда
		
		ТекТабличноеПоле = "Форма300_09_02Страница2";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы931 Тогда
		
		ТекТабличноеПоле = "Форма300_09_03Страница1";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы932 Тогда
		
		ТекТабличноеПоле = "Форма300_09_03Страница2";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы941 Тогда
		
		ТекТабличноеПоле = "Форма300_09_04Страница1";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы942 Тогда
		
		ТекТабличноеПоле = "Форма300_09_04Страница2";
		
	КонецЕсли;
	
	Возврат ТекТабличноеПоле;
	
КонецФункции

&НаКлиенте
Процедура ВывестиРазделВТабличныйДокументНаКлиенте(ИмяГруппы, СтруктураГруппы) Экспорт
	ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
КонецПроцедуры

&НаСервере
Процедура ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппы, СтруктураГруппы) Экспорт
	ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма)
	
	Если Число(Сред(ИмяГруппы,5,1)) = 3 Тогда
		
		СтруктураГруппы = Форма["П0003100003"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0003200003"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0003300003"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,1)) = 7 Тогда
		
		СтруктураГруппы = Форма["П0007100001"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0007200001"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0007300002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0007400001"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,1)) = 8 Тогда
		
		СтруктураГруппы = Форма["П0008100001"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0008200001"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0008300002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0008400001"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,2)) = 91 Тогда
		
		СтруктураГруппы = Форма["П0009110001"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0009120002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,2)) = 92 Тогда
		
		СтруктураГруппы = Форма["П0009210001"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0009220002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,2)) = 93 Тогда
		
		СтруктураГруппы = Форма["П0009310001"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0009320002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,2)) = 94 Тогда
		
		СтруктураГруппы = Форма["П0009410001"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0009420002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		
	КонецЕсли;
	
	ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма,НомерСтрокиТаблицы, Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы, Форма)
	
	
	Если Число(Сред(ИмяГруппы,5,1)) = 3 Тогда
		
		СтруктураГруппы = Форма["П0003100003"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0003200003"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0003300003"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,1)) = 7 Тогда
		
		СтруктураГруппы = Форма["П0007100001"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0007200001"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0007300002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0007400001"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,1)) = 8 Тогда
		
		СтруктураГруппы = Форма["П0008100001"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0008200001"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0008300002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0008400001"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,2)) = 91 Тогда
		
		СтруктураГруппы = Форма["П0009110001"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0009120002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,2)) = 92 Тогда
		
		СтруктураГруппы = Форма["П0009210001"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0009220002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,2)) = 93 Тогда
		
		СтруктураГруппы = Форма["П0009310001"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0009320002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,2)) = 94 Тогда
		
		СтруктураГруппы = Форма["П0009410001"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0009420002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		
	КонецЕсли;
	
	ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма, СтруктураГруппы.Количество(), Ложь);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма, НомерСтроки, УдалитьСтроку)
	
	
	Если УдалитьСтроку = Ложь Тогда
		ИндексПересчета = НомерСтроки - 2
	Иначе
		ИндексПересчета = НомерСтроки;
	КонецЕсли;
	
	Если Число(Сред(ИмяГруппы,5,1)) = 3 Тогда
		
		СтруктураГруппы = Форма["П0003100003"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000310000301 = Индекс + 3;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0003200003"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000320000301 = Индекс + 3;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0003300003"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000330000301 = Индекс + 3;
		КонецЦикла;
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,1)) = 7 Тогда
		
		СтруктураГруппы = Форма["П0007100001"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000710000101 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0007200001"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000720000101 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0007300002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000730000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0007400001"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000740000101 = Индекс + 2;
		КонецЦикла;
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,1)) = 8 Тогда
		
		СтруктураГруппы = Форма["П0008100001"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000810000101 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0008200001"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000820000101 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0008300002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000830000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0008400001"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000840000101 = Индекс + 2;
		КонецЦикла;
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,2)) = 91 Тогда
		
		СтруктураГруппы = Форма["П0009110001"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000911000101 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0009120002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000912000201 = Индекс + 2;
		КонецЦикла;
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,2)) = 92 Тогда
		
		СтруктураГруппы = Форма["П0009210001"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000921000101 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0009220002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000922000201 = Индекс + 2;
		КонецЦикла;
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,2)) = 93 Тогда
		
		СтруктураГруппы = Форма["П0009310001"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000931000101 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0009320002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000932000201 = Индекс + 2;
		КонецЦикла;
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,2)) = 94 Тогда
		
		СтруктураГруппы = Форма["П0009410001"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000941000101 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0009420002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000942000201 = Индекс + 2;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяОтчета(ЭтаФормаИмя)
	Форма_Имя = СтрЗаменить(ЭтаФормаИмя, "Внешний", "");
	Возврат Сред(Лев(Форма_Имя, СтрНайти(Форма_Имя, ".Форма.") - 1), 7);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяФормыОтчета(ЭтаФормаИмя)
	Возврат Сред(ЭтаФормаИмя, СтрНайти(ЭтаФормаИмя, ".Форма.") + 7);
КонецФункции

&НаКлиенте
Процедура ПечатьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Печать(ДополнительныеПараметры.ВидПечати);
	
КонецПроцедуры