#Область СлужебныйПрограммныйИнтерфейс

//См. РасчетЗарплатыРасширенный.СоздатьДанныеДляПроведенияНачисленияЗарплаты
Процедура ДополнитьПоляСтруктурыДляПроведения(ПоляСтруктуры) Экспорт
	
	ПоляСтруктуры = ПоляСтруктуры + ",
		|НалогиВзносыОтчисления,
		|ДоходыНеПодлежащиеНалогообложению,
		|ВычетыИПН";
	
КонецПроцедуры

//См. РасчетЗарплатыРасширенный.СоздатьДанныеДляПроведенияНачисленияЗарплаты
Процедура ДополнитьОписаниеДанныхДляПроведения(ДанныеДляПроведения) Экспорт
	
	ДанныеДляПроведения.Вставить("СведенияОбИсчисленииНалоговВзносовОтчислений");
	ДанныеДляПроведения.Вставить("НалогиВзносыОтчисленияРасчетыСБюджетомИФондами");
	ДанныеДляПроведения.Вставить("СведенияОНеоблагаемыхДоходахФизическихЛиц");
	ДанныеДляПроведения.Вставить("СведенияОбИсчисленииВычетовИПН");
	
КонецПроцедуры

//См. РасчетЗарплатыРасширенный.ОписаниеДанныхДляЗаполненияТаблицДокумента
Процедура ДополнитьОписаниеДанныхДляЗаполненияТаблицДокумента(ДанныеЗаполнения) Экспорт
	
	ДанныеЗаполнения.Вставить("НалогиВзносыОтчисления",Новый ТаблицаЗначений);
	ДанныеЗаполнения.Вставить("ДоходыНеПодлежащиеНалогообложению",Новый ТаблицаЗначений);
	ДанныеЗаполнения.Вставить("ВычетыИПН",Новый ТаблицаЗначений);
	
КонецПроцедуры

Функция РассчитатьНалогиВзносыОтчисления(ОкончательныйРасчетЗарплаты, НаборыЗаписей,Организация,ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, Начисления, ДоговорыПодряда, УдалитьВТ, ИсправленныйДокумент = Неопределено) Экспорт
	
	СоздатьВТНачисленияДляРассчетаНалоговВзносовОтчислений(Начисления, МенеджерВременныхТаблиц, УдалитьВТ, ДокументСсылка, ИсправленныйДокумент);
	СоздатьВТДоговорыПодрядаДляРассчетаНалоговВзносовОтчислений(ДоговорыПодряда, МенеджерВременныхТаблиц, УдалитьВТ, ДокументСсылка);

	УчетНалоговВзносовОтчислений.СформироватьСведенияОДоходах(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты, НаборыЗаписей);
	ЗарплатаКадры.СоздатьВТПоНаборуЗаписей(МенеджерВременныхТаблиц, НаборыЗаписей.СведенияОДоходахФизическихЛиц, Истина);

	РезультатРасчетаНалоговВзносовОтчислений = РезультатРасчетаНалоговВзносовОтчислений(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	ЗарплатаКадры.СоздатьВТПоНаборуЗаписей(МенеджерВременныхТаблиц, НаборыЗаписей.СведенияОНеоблагаемыхДоходахФизическихЛиц, Истина);
	
	Возврат РезультатРасчетаНалоговВзносовОтчислений;
	
КонецФункции

Процедура СоздатьВТНачисленияДляРассчетаНалоговВзносовОтчислений(Начисления, МенеджерВременныхТаблиц, УдалитьВТ, ДокументСсылка, ИсправленныйДокумент)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Начисления", Начисления);
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	Если ЗначениеЗаполнено(ИсправленныйДокумент) Тогда
		Запрос.УстановитьПараметр("ИсправленныйДокумент", ИсправленныйДокумент);
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("ИсправленныйДокумент", МетаданныеДокумента) Тогда
		ИсправленныйДокументСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка,"ИсправленныйДокумент");
		Если ЗначениеЗаполнено(ИсправленныйДокументСсылка) Тогда
			Запрос.УстановитьПараметр("ИсправленныйДокумент", ИсправленныйДокументСсылка);
		Иначе 
			Запрос.УстановитьПараметр("ИсправленныйДокумент", Документы[МетаданныеДокумента.Имя].ПустаяСсылка())
		КонецЕсли;
	Иначе	
		Запрос.УстановитьПараметр("ИсправленныйДокумент", Документы[МетаданныеДокумента.Имя].ПустаяСсылка())
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Начисления.Начисление КАК Начисление,
	|	Начисления.ДатаНачала КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА Начисления.Сторно
	|				ИЛИ Начисления.ФиксСторно
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Сторно,
	|	Начисления.СторнируемыйДокумент КАК СторнируемыйДокумент,
	|	Начисления.Результат КАК СуммаДохода,
	|	Начисления.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТНачисленияТаблица
	|ИЗ
	|	&Начисления КАК Начисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНачисленияТаблица.Сотрудник КАК Сотрудник,
	|	ВТНачисленияТаблица.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТНачисленияТаблица.Начисление КАК Начисление,
	|	ВТНачисленияТаблица.ДатаНачала КАК ДатаНачала,
	|	ВТНачисленияТаблица.Сторно КАК Сторно,
	|	ВТНачисленияТаблица.СторнируемыйДокумент КАК СторнируемыйДокумент,
	|	ВТНачисленияТаблица.СуммаДохода КАК СуммаДохода,
	|	&ИсправленныйДокумент КАК ИсправленныйДокумент,
	|	ВТНачисленияТаблица.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТНачисления
	|ИЗ
	|	ВТНачисленияТаблица КАК ВТНачисленияТаблица";
	
	Запрос.Выполнить();
	УдалитьВТ.Добавить("ВТНачисленияТаблица");
	УдалитьВТ.Добавить("ВТНачисления");
	
КонецПроцедуры

Процедура СоздатьВТДоговорыПодрядаДляРассчетаНалоговВзносовОтчислений(ДоговорыПодряда, МенеджерВременныхТаблиц, УдалитьВТ, ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДоговорыПодряда", ДоговорыПодряда);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачисленияПоДоговорам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НачисленияПоДоговорам.Результат КАК Сумма,
	|	НачисленияПоДоговорам.Подразделение,
	|	НачисленияПоДоговорам.Сотрудник,
	|	НачисленияПоДоговорам.ВидДохода
	|ПОМЕСТИТЬ ВТНачисленияПоДоговорам
	|ИЗ
	|	&ДоговорыПодряда КАК НачисленияПоДоговорам";
	
	Запрос.Выполнить();
	УдалитьВТ.Добавить("ВТНачисленияПоДоговорам");
	
КонецПроцедуры

Функция РезультатРасчетаНалоговВзносовОтчислений(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты = Истина)
	
	УстановитьПривилегированныйРежим(Истина);
	
	УчетНалоговВзносовОтчислений.ПодготовитьДанныеДляРасчетаНалоговВзносов(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	
	// Расчитать необлагаемые доходы начислений
	ДоходыНеПодлежащиеНалогообложению = УчетНалоговВзносовОтчислений.РассчитатьНеоблагаемыеДоходы(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	
	// ОПВ
	РезультатРасчетаОПВ = РезультатРасчетаОПВ(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	
	Если ЗарплатаКадрыРКПовтИсп.ПрименятьКорректировкуПрочихНалоговВзносовОтчислений(ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(Организация), МесяцНачисления) Тогда
		
		Если ЗарплатаКадрыРКПовтИсп.ПрименятьВычетОПВиВОСМСДляГПХ(ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(Организация), МесяцНачисления) Тогда
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ТолькоДоходОтНалоговогоАгента", Истина);
			УчетНалоговВзносовОтчислений.РассчитатьВОСМСПосле2020(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты,, ДополнительныеПараметры);	
			ДополнительныеПараметры.Удалить("ТолькоДоходОтНалоговогоАгента");
		КонецЕсли;		
		
		РезультатРасчетаИПН = РезультатРасчетаИПН(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
		РезультатРасчетаВОСМС = РезультатРасчетаВОСМС(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);

	Иначе
		
		РезультатРасчетаВОСМС = РезультатРасчетаВОСМС(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
		РезультатРасчетаИПН = РезультатРасчетаИПН(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);

	КонецЕсли;
		
	НалогиВзносыОтчисления = РезультатРасчетаИПН.ИПН.СкопироватьКолонки();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатРасчетаИПН.ИПН, НалогиВзносыОтчисления);
	
	УчетНалоговВзносовОтчислений.ДополнитьТаблицуНалогиВзносыОтчисления(РезультатРасчетаОПВ.ОПВ, НалогиВзносыОтчисления);
	
	Если РезультатРасчетаВОСМС <> Неопределено Тогда
		УчетНалоговВзносовОтчислений.ДополнитьТаблицуНалогиВзносыОтчисления(РезультатРасчетаВОСМС.ВОСМС, НалогиВзносыОтчисления);
	КонецЕсли;	

	// Налоги, взносы и отчисления за счет работодателя расчитываются 
	// только при окончательном расчете начислений
	// только в документе "Начисление зарплаты" и "Увольнение"
	Если ОкончательныйРасчетЗарплаты Тогда
		// СО
		РезультатРасчетаСО = РезультатРасчетаСО(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
		УчетНалоговВзносовОтчислений.ДополнитьТаблицуНалогиВзносыОтчисления(РезультатРасчетаСО.СО, НалогиВзносыОтчисления);
		// СН
		РезультатРасчетаСН = РезультатРасчетаСН(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
		УчетНалоговВзносовОтчислений.ДополнитьТаблицуНалогиВзносыОтчисления(РезультатРасчетаСН.СН, НалогиВзносыОтчисления);
		// ОППВ
		Если ПолучитьФункциональнуюОпцию("ПлательщикОППВЗарплатаКадры", Новый Структура("Организация", Организация)) Тогда
			РезультатРасчетаОППВ = РезультатРасчетаОППВ(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
			УчетНалоговВзносовОтчислений.ДополнитьТаблицуНалогиВзносыОтчисления(РезультатРасчетаОППВ.ОППВ, НалогиВзносыОтчисления);
		КонецЕсли;
		//ООСМС
		РезультатРасчетаООСМС = РезультатРасчетаООСМС(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
		Если РезультатРасчетаООСМС <> Неопределено Тогда
			УчетНалоговВзносовОтчислений.ДополнитьТаблицуНалогиВзносыОтчисления(РезультатРасчетаООСМС.ООСМС, НалогиВзносыОтчисления);
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	// Упорядочим таблицу налогов, взносов и отчислений по тем же правилам, что и начисления (для этого получаем основных сотрудников).
	Физлица = ОбщегоНазначения.ВыгрузитьКолонку(НалогиВзносыОтчисления, "ФизическоеЛицо", Истина);
	СотрудникиФизическиеЛица = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(Физлица, Истина, Организация, МесяцНачисления);
	Сотрудники = ОбщегоНазначения.ВыгрузитьКолонку(СотрудникиФизическиеЛица, "Сотрудник", Истина);
	
	// По основным сотрудникам запрашиваем сведения о рабочих местах на конец месяца.
	МенеджерВТУпорядочивания = Новый МенеджерВременныхТаблиц;
	КадровыйУчет.СоздатьНаДатуВТКадровыеДанныеСотрудников(МенеджерВТУпорядочивания, Истина, Сотрудники, "Подразделение,Должность", КонецМесяца(МесяцНачисления));
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КадровыеДанныеСотрудников.Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	КадровыеДанныеСотрудников.Подразделение,
	|	КадровыеДанныеСотрудников.Должность,
	|	Должности.РеквизитДопУпорядочивания КАК ПорядокДолжности,
	|	Подразделения.РеквизитДопУпорядочивания КАК ПорядокПодразделения,
	|	Сотрудники.Наименование
	|ИЗ
	|	ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должности КАК Должности
	|		ПО (Должности.Ссылка = КадровыеДанныеСотрудников.Должность)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК Подразделения
	|		ПО (Подразделения.Ссылка = КадровыеДанныеСотрудников.Подразделение)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО (Сотрудники.Ссылка = КадровыеДанныеСотрудников.Сотрудник)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокДолжности,
	|	ПорядокПодразделения,
	|	Сотрудники.Наименование";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТУпорядочивания;
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПорядокПоФизическимЛицам = Новый Соответствие;
	Порядок = 0;
	Пока Выборка.Следующий() Цикл
		ПорядокПоФизическимЛицам.Вставить(Выборка.ФизическоеЛицо, Порядок);
		Порядок = Порядок + 1;
	КонецЦикла;
	
	// На основе полученного соответствия сортируем строки таблицы.
	НалогиВзносыОтчисления.Колонки.Добавить("ПорядокСтрок");
	Для Каждого Строка Из НалогиВзносыОтчисления Цикл
		Строка.ПорядокСтрок = ПорядокПоФизическимЛицам[Строка.ФизическоеЛицо];
	КонецЦикла;
	НалогиВзносыОтчисления.Сортировать("ПорядокСтрок,МесяцНалоговогоПериода,Подразделение,ВидНалогаВзносаОтчисления");
	
	Возврат Новый Структура("НалогиВзносыОтчисления, ДоходыНеПодлежащиеНалогообложению, ВычетыИПН", НалогиВзносыОтчисления, ДоходыНеПодлежащиеНалогообложению, РезультатРасчетаИПН.ВычетыИПН);
	
КонецФункции

Функция РезультатРасчетаОПВ(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты = Истина)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Рассчитываем ОПВ
	РезультатРасчетаОПВ = УчетНалоговВзносовОтчислений.РезультатРасчетаОПВ(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат РезультатРасчетаОПВ;
	
КонецФункции

Функция РезультатРасчетаИПН(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты = Истина)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Рассчитываем ИПН
	РезультатРасчетаИПН = УчетНалоговВзносовОтчислений.РезультатРасчетаИПН(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат РезультатРасчетаИПН;
	
КонецФункции

Функция РезультатРасчетаСО(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты = Истина)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Рассчитываем СО
	РезультатРасчетаСО = УчетНалоговВзносовОтчислений.РезультатРасчетаСО(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат РезультатРасчетаСО;
	
КонецФункции

Функция РезультатРасчетаСН(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты = Истина)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Рассчитываем СН
	РезультатРасчетаСН = УчетНалоговВзносовОтчислений.РезультатРасчетаСН(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РезультатРасчетаСН;
	
КонецФункции

Функция РезультатРасчетаОППВ(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты = Истина)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Рассчитываем ОППВ
	РезультатРасчетаОППВ = УчетНалоговВзносовОтчислений.РезультатРасчетаОППВ(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат РезультатРасчетаОППВ;
	
КонецФункции

Функция РезультатРасчетаВОСМС(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты = Истина)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Рассчитываем ВОСМС
	РезультатРасчетаВОСМС = УчетНалоговВзносовОтчислений.РезультатРасчетаВОСМС(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат РезультатРасчетаВОСМС;
	
КонецФункции

Функция РезультатРасчетаООСМС(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты = Истина)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Рассчитываем ООСМС
	РезультатРасчетаООСМС = УчетНалоговВзносовОтчислений.РезультатРасчетаООСМС(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат РезультатРасчетаООСМС;
	
КонецФункции

//См. РасчетЗарплатыРасширенный.СодержимоеДокументаРасчетаЗарплаты
Процедура ДополнитьСодержимоеДокументаРасчетаЗарплаты(СодержимоеДокумента) Экспорт
	
	СодержимоеДокумента.Вставить("НалогиВзносыОтчисления", ПустаяТаблицаНалогиВзносыОтчисления());
	СодержимоеДокумента.Вставить("ДоходыНеПодлежащиеНалогообложению", ПустаяТаблицаДоходыНеПодлежащиеНалогообложению());
	СодержимоеДокумента.Вставить("ВычетыИПН", ПустаяТаблицаВычетыИПН());
	
КонецПроцедуры

Функция ОписаниеТиповЧисло()

	ОписаниеТиповЧисло = Новый Структура;
	ОписаниеТиповЧисло.Вставить("ТипЧисло15_2", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ОписаниеТиповЧисло.Вставить("ТипЧисло7_2", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7, 2)));
	ОписаниеТиповЧисло.Вставить("ТипЧисло15_3", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	ОписаниеТиповЧисло.Вставить("ТипЧисло7_0", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7, 0)));
	ОписаниеТиповЧисло.Вставить("ТипЧисло10_0", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
	ОписаниеТиповЧисло.Вставить("ТипЧисло12_2", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(12, 2)));
	
	Возврат ОписаниеТиповЧисло;

КонецФункции

Функция ПустаяТаблицаНалогиВзносыОтчисления() Экспорт
	
	ОписаниеТиповЧисло = ОписаниеТиповЧисло();
	
	ТаблицаНалогиВзносыОтчисления = Новый ТаблицаЗначений;
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов("Дата"));
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("ВидДохода", Новый ОписаниеТипов("СправочникСсылка.ВидыДоходов")); 
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("ВидНалогаВзносаОтчисления", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалоговВзносовОтчислений")); 
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("ОблагаемыйДоход", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("НеоблагаемыйДоход", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("НалогВзнос", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("ОбъектИсчисления", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("РазрешенныйВычет", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("ПримененныйВычет", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("ПримененнаяЛьгота", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("ПрочиеВычеты", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("ФиксРасчет", Новый ОписаниеТипов("Булево"));
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("ФиксСтрока", Новый ОписаниеТипов("Булево"));
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("ИдентификаторСтрокиНалогиВзносыОтчисления", ОписаниеТиповЧисло.ТипЧисло7_0);
	Возврат ТаблицаНалогиВзносыОтчисления;
	
КонецФункции

Функция ПустаяТаблицаДоходыНеПодлежащиеНалогообложению() Экспорт
	
	ОписаниеТиповЧисло = ОписаниеТиповЧисло();
	
	ТаблицаДоходыНеПодлежащиеНалогообложению = Новый ТаблицаЗначений;
	ТаблицаДоходыНеПодлежащиеНалогообложению.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаДоходыНеПодлежащиеНалогообложению.Колонки.Добавить("ПодразделениеОрганизации", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ТаблицаДоходыНеПодлежащиеНалогообложению.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов("Дата"));
	ТаблицаДоходыНеПодлежащиеНалогообложению.Колонки.Добавить("ДоходНеПодлежащийНалогообложению", Новый ОписаниеТипов("СправочникСсылка.ДоходыНеПодлежащиеНалогообложениюЧастично")); 
	ТаблицаДоходыНеПодлежащиеНалогообложению.Колонки.Добавить("ВидНалогаВзносаОтчисления", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалоговВзносовОтчислений")); 
	ТаблицаДоходыНеПодлежащиеНалогообложению.Колонки.Добавить("Начисление", Новый ОписаниеТипов("ПланВидовРасчетаСсылка.Начисления")); 
	ТаблицаДоходыНеПодлежащиеНалогообложению.Колонки.Добавить("СуммаДохода", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаДоходыНеПодлежащиеНалогообложению.Колонки.Добавить("НеоблагаемыйДоход", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаДоходыНеПодлежащиеНалогообложению.Колонки.Добавить("ФиксРасчет", Новый ОписаниеТипов("Булево"));
	ТаблицаДоходыНеПодлежащиеНалогообложению.Колонки.Добавить("ФиксСтрока", Новый ОписаниеТипов("Булево"));
	
	Возврат ТаблицаДоходыНеПодлежащиеНалогообложению;
	
КонецФункции

Функция ПустаяТаблицаВычетыИПН() Экспорт
	
	ОписаниеТиповЧисло = ОписаниеТиповЧисло();
	
	ТаблицаВычетыИПН = Новый ТаблицаЗначений;
	ТаблицаВычетыИПН.Колонки.Добавить("ИдентификаторСтрокиНалогиВзносыОтчисления", ОписаниеТиповЧисло.ТипЧисло7_0);
	ТаблицаВычетыИПН.Колонки.Добавить("ВидВычетаИПН", Новый ОписаниеТипов("СправочникСсылка.ВидыВычетовИПН"));
	ТаблицаВычетыИПН.Колонки.Добавить("РазрешенныйВычет", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаВычетыИПН.Колонки.Добавить("ПримененныйВычет", ОписаниеТиповЧисло.ТипЧисло15_2);
	
	Возврат ТаблицаВычетыИПН;
	
КонецФункции

Функция СведенияОНалогахВзносахОтчислениях(Форма, ВидНалогаВзносаОтчисления, ФизическоеЛицо = Неопределено, ПутьКДаннымАдресРаспределенияРезультатовВХранилище = Неопределено, ТаблицаНачислений= Неопределено) Экспорт
	
	ДанныеОНалогеВзносеОтчислении = Новый Структура;
	
	СтруктураОтбора = Новый Структура("ВидНалогаВзносаОтчисления", ВидНалогаВзносаОтчисления);
	КоллекцияСтрокОПВ = Форма.Объект.НалогиВзносыОтчисления.Выгрузить(СтруктураОтбора);
	
	ДанныеОНалогеВзносеОтчислении.Вставить("НалогиВзносыОтчисления", КоллекцияСтрокОПВ);
	
	Если ПутьКДаннымАдресРаспределенияРезультатовВХранилище <> Неопределено Тогда
		ДанныеОНалогеВзносеОтчислении.Вставить("АдресРаспределенияРезультатовВХранилище", Форма[ПутьКДаннымАдресРаспределенияРезультатовВХранилище]);
	КонецЕсли; 
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеОНалогеВзносеОтчислении, Форма.УникальныйИдентификатор);
	
КонецФункции

Функция ВычетыИПН(Форма, ПутьКДаннымАдресРаспределенияРезультатовВХранилище = Неопределено, ТаблицаНачислений= Неопределено) Экспорт
	
	ВычетыИПН = Новый Структура;
	
	ТаблицаВычетыИПН = Форма.Объект.ВычетыИПН.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаВычетыИПН", ТаблицаВычетыИПН);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаВычетыИПН.ИдентификаторСтрокиНалогиВзносыОтчисления,
	|	ТаблицаВычетыИПН.ВидВычетаИПН,
	|	ТаблицаВычетыИПН.РазрешенныйВычет,
	|	ТаблицаВычетыИПН.ПримененныйВычет,
	|	ТаблицаВычетыИПН.ФиксСтрока,
	|	ТаблицаВычетыИПН.ФиксРасчет
	|ПОМЕСТИТЬ ВТ_ТаблицаВычетыИПН
	|ИЗ
	|	&ТаблицаВычетыИПН КАК ТаблицаВычетыИПН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВычетыИПН.ИдентификаторСтрокиНалогиВзносыОтчисления,
	|	ВычетыИПН.ВидВычетаИПН,
	|	ВычетыИПН.РазрешенныйВычет,
	|	ВычетыИПН.ПримененныйВычет,
	|	ВычетыИПН.ФиксСтрока,
	|	ВычетыИПН.ФиксРасчет
	|ИЗ
	|	ВТ_ТаблицаВычетыИПН КАК ВычетыИПН";
	
	ВычетыИПН.Вставить("ВычетыИПН",Запрос.Выполнить().Выгрузить());
	
	
	Возврат ПоместитьВоВременноеХранилище(ВычетыИПН, Форма.УникальныйИдентификатор);
	
КонецФункции

Функция ДоходыНеПодлежащиеНалогообложению(Форма, ВидНалогаВзносаОтчисления = Неопределено) Экспорт
	
	ДоходыНеПодлежащиеНалогообложению = Новый Структура;
	
	ТаблицаВычетыДоходыНеПодлежащиеНалогообложению = Форма.Объект.ДоходыНеПодлежащиеНалогообложению.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДоходыНеПодлежащиеНалогообложению", ТаблицаВычетыДоходыНеПодлежащиеНалогообложению);
	Если ВидНалогаВзносаОтчисления = Неопределено Тогда
		БезОтбораПоВиду = Истина;
		Запрос.УстановитьПараметр("БезОтбораПоВиду", БезОтбораПоВиду);
	Иначе
		БезОтбораПоВиду = Ложь;
		Запрос.УстановитьПараметр("БезОтбораПоВиду", БезОтбораПоВиду);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидНалогаВзносаОтчисления", ВидНалогаВзносаОтчисления);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДоходыНеПодлежащиеНалогообложению.Подразделение,
	|	ТаблицаДоходыНеПодлежащиеНалогообложению.ФизическоеЛицо,
	|	ТаблицаДоходыНеПодлежащиеНалогообложению.МесяцНалоговогоПериода,
	|	ТаблицаДоходыНеПодлежащиеНалогообложению.ДоходНеПодлежащийНалогообложению,
	|	ТаблицаДоходыНеПодлежащиеНалогообложению.ВидНалогаВзносаОтчисления,
	|	ТаблицаДоходыНеПодлежащиеНалогообложению.Начисление,
	|	ТаблицаДоходыНеПодлежащиеНалогообложению.СуммаДохода,
	|	ТаблицаДоходыНеПодлежащиеНалогообложению.НеоблагаемыйДоход,
	|	ТаблицаДоходыНеПодлежащиеНалогообложению.ФиксСтрока,
	|	ТаблицаДоходыНеПодлежащиеНалогообложению.ФиксРасчет
	|ПОМЕСТИТЬ ВТ_ТаблицаДоходыНеПодлежащиеНалогообложению
	|ИЗ
	|	&ТаблицаДоходыНеПодлежащиеНалогообложению КАК ТаблицаДоходыНеПодлежащиеНалогообложению
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыНеПодлежащиеНалогообложению.Подразделение,
	|	ДоходыНеПодлежащиеНалогообложению.ФизическоеЛицо,
	|	ДоходыНеПодлежащиеНалогообложению.МесяцНалоговогоПериода,
	|	ДоходыНеПодлежащиеНалогообложению.ДоходНеПодлежащийНалогообложению,
	|	ДоходыНеПодлежащиеНалогообложению.ВидНалогаВзносаОтчисления,
	|	ДоходыНеПодлежащиеНалогообложению.Начисление,
	|	ДоходыНеПодлежащиеНалогообложению.СуммаДохода,
	|	ДоходыНеПодлежащиеНалогообложению.НеоблагаемыйДоход,
	|	ДоходыНеПодлежащиеНалогообложению.ФиксСтрока,
	|	ДоходыНеПодлежащиеНалогообложению.ФиксРасчет
	|ИЗ
	|	ВТ_ТаблицаДоходыНеПодлежащиеНалогообложению КАК ДоходыНеПодлежащиеНалогообложению
	|ГДЕ 
	|	ДоходыНеПодлежащиеНалогообложению.ВидНалогаВзносаОтчисления = &ВидНалогаВзносаОтчисления
	|	ИЛИ &БезОтбораПоВиду";
	
	ДоходыНеПодлежащиеНалогообложению.Вставить("ДоходыНеПодлежащиеНалогообложению", Запрос.Выполнить().Выгрузить());
	
	Возврат ПоместитьВоВременноеХранилище(ДоходыНеПодлежащиеНалогообложению, Форма.УникальныйИдентификатор);
	
КонецФункции

Процедура УдалитьДанныеПоНалогамВзносамОтчислениямФизическоголица(Объект, ФизическоеЛицо) Экспорт
	
	СтрокиНалогиВзносыОтчисления = Объект.НалогиВзносыОтчисления.НайтиСтроки(Новый Структура("ФизическоеЛицо", ФизическоеЛицо));
	Для Каждого СтрокаНалогиВзносыОтчисления Из СтрокиНалогиВзносыОтчисления Цикл
		
		СтрокиВычетовИПН = Объект.ВычетыИПН.НайтиСтроки(
			Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", СтрокаНалогиВзносыОтчисления.ИдентификаторСтрокиНалогиВзносыОтчисления));
			
		Для Каждого СтрокаВычетов Из СтрокиВычетовИПН Цикл
			Объект.ВычетыИПН.Удалить(СтрокаВычетов);
		КонецЦикла;
		
		Объект.НалогиВзносыОтчисления.Удалить(СтрокаНалогиВзносыОтчисления);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьДанныеПоНалогамВзносамОтчислениямПоИдентификатору(Объект, ИдентификаторСтрокиНалогиВзносыОтчисления) Экспорт
	
	СтрокиВычетовИПН = Объект.ВычетыИПН.НайтиСтроки(
		Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", ИдентификаторСтрокиНалогиВзносыОтчисления));
		
	Для Каждого СтрокаВычетов Из СтрокиВычетовИПН Цикл
		Объект.ВычетыИПН.Удалить(СтрокаВычетов);
	КонецЦикла;
	
КонецПроцедуры

Процедура НалогиВзносыОтчисленияДанныеВМенеджераРасчета(ТаблицаНалогиВзносыОтчисления, ТаблицаВычетыИПН, ТаблицаДоходыНеПодлежащиеНалогообложению, МенеджерРасчета, Отбор = Неопределено, НачальныеПозицииВставки = Неопределено, ДанныеРезультатовРаспределения = Неопределено) Экспорт
	
	НалогиВзносыОтчисления = МенеджерРасчета.Зарплата.НалогиВзносыОтчисления;
	СтрокиРасчетаНалогиВзносыОтчисления = Новый Массив;
	СтрокиРасчетаВычетыИПН = Новый Массив;
	СтрокиРасчетаДоходыНеПодлежащиеНалогообложению = Новый Массив;
	НачальныеПозицииСотрудников = Новый Соответствие;
	НачальныеПозицииДоходыНеПодлежащиеНалогообложению = Новый Соответствие;
	
	Для Каждого СтрокаФормы Из ТаблицаНалогиВзносыОтчисления Цикл
		
		Если Отбор <> Неопределено Тогда
			ФизическоеЛицо = Отбор.ФизическиеЛицаОтбор[СтрокаФормы.ФизическоеЛицо];
			Если ФизическоеЛицо = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			УстановитьНачальнуюПозициюПоСотруднику(НачальныеПозицииСотрудников, СтрокаФормы.ФизическоеЛицо, ТаблицаНалогиВзносыОтчисления.Индекс(СтрокаФормы));
			СтрокиРасчетаНалогиВзносыОтчисления.Добавить(СтрокаФормы);
			
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", СтрокаФормы.ИдентификаторСтрокиНалогиВзносыОтчисления);
		СтрокиВычетыИПН = ТаблицаВычетыИПН.НайтиСтроки(СтруктураПоиска);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокиРасчетаВычетыИПН, СтрокиВычетыИПН);
		ЗаполнитьЗначенияСвойств(МенеджерРасчета.Зарплата.НалогиВзносыОтчисления.Добавить(), СтрокаФормы);
		Для Каждого СтрокаВычетов Из СтрокиВычетыИПН Цикл
			ЗаполнитьЗначенияСвойств(МенеджерРасчета.Зарплата.ВычетыИПН.Добавить(), СтрокаВычетов);
		КонецЦикла;
		
	КонецЦикла;
		
	Если НачальныеПозицииВставки <> Неопределено Тогда	
		НачальныеПозицииВставки.Вставить("НалогиВзносыОтчисления", НачальныеПозицииСотрудников);
	КонецЕсли;
	
	Для Каждого СтрокаФормы Из ТаблицаДоходыНеПодлежащиеНалогообложению Цикл
		Если Отбор <> Неопределено Тогда
			ФизическоеЛицо = Отбор.ФизическиеЛицаОтбор[СтрокаФормы.ФизическоеЛицо];
			Если ФизическоеЛицо = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			УстановитьНачальнуюПозициюПоСотруднику(НачальныеПозицииДоходыНеПодлежащиеНалогообложению, СтрокаФормы.ФизическоеЛицо, ТаблицаДоходыНеПодлежащиеНалогообложению.Индекс(СтрокаФормы));
			СтрокиРасчетаДоходыНеПодлежащиеНалогообложению.Добавить(СтрокаФормы);
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(МенеджерРасчета.Зарплата.ДоходыНеПодлежащиеНалогообложению.Добавить(), СтрокаФормы);
	КонецЦикла;
	
	Если НачальныеПозицииВставки <> Неопределено Тогда	
		НачальныеПозицииВставки.Вставить("ДоходыНеПодлежащиеНалогообложению", НачальныеПозицииДоходыНеПодлежащиеНалогообложению);
	КонецЕсли;
	
	УдалитьСтрокиРасчета(ТаблицаНалогиВзносыОтчисления, СтрокиРасчетаНалогиВзносыОтчисления, Отбор = Неопределено);
	УдалитьСтрокиРасчета(ТаблицаВычетыИПН, СтрокиРасчетаВычетыИПН, Отбор = Неопределено);
	УдалитьСтрокиРасчета(ТаблицаДоходыНеПодлежащиеНалогообложению, СтрокиРасчетаДоходыНеПодлежащиеНалогообложению, Отбор = Неопределено);
	
КонецПроцедуры

Процедура УстановитьНачальнуюПозициюПоСотруднику(НачальныеПозицииВставкиТаблицы, Сотрудник, Индекс) Экспорт
	
	НачальныеПозицииСотрудника = НачальныеПозицииВставкиТаблицы.Получить(Сотрудник);
	Если НачальныеПозицииСотрудника = Неопределено Тогда
		Позиции = Новый Структура("НачальнаяПозиция, КоличествоСтрок", Индекс, 1);
		НачальныеПозицииВставкиТаблицы.Вставить(Сотрудник, Позиции);
	Иначе
		НачальныеПозицииСотрудника.КоличествоСтрок = НачальныеПозицииСотрудника.КоличествоСтрок + 1;
	КонецЕсли;
	
КонецПроцедуры

Процедура РасчетЗарплатыНалогиВзносыОтчисленияВДанныеФормы(ДанныеДляЗаполнения, Объект, НачальныеПозицииВставки = Неопределено) Экспорт
	
	МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления = УчетНалоговВзносовОтчислений.МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления(Объект.НалогиВзносыОтчисления) + 1;
	
	НалогиВзносыОтчисления = ДанныеДляЗаполнения.НалогиВзносыОтчисления.Скопировать();
	Если НачальныеПозицииВставки <> Неопределено Тогда
		
		ПозицииСотрудников = РасчетЗарплатыРасширенныйФормы.ТаблицаПозицииСотрудников(НачальныеПозицииВставки["НалогиВзносыОтчисления"]);

		Сдвиг = 0;
		СтруктураПоиска = Новый Структура("ФизическоеЛицо");
		СтрокиКУдалению = Новый Массив;

		Для Каждого СтрокаПозиций Из ПозицииСотрудников Цикл
			
			СтруктураПоиска.ФизическоеЛицо = СтрокаПозиций.Сотрудник;
			СтрокиНалогиВзносыОтчисления = НалогиВзносыОтчисления.НайтиСтроки(СтруктураПоиска);
			ПозицияВставки = СтрокаПозиций.НачальнаяПозиция + Сдвиг;
			КоличествоСтрок = 0;
			
			Для Каждого СтрокаИсточник Из СтрокиНалогиВзносыОтчисления Цикл
				
				ПараметрыОтбора = Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", СтрокаИсточник.ИдентификаторСтрокиНалогиВзносыОтчисления);
				МассивСтрокВычетыИПН = ДанныеДляЗаполнения.ВычетыИПН.НайтиСтроки(ПараметрыОтбора);
				
				СтрокаИсточник.ИдентификаторСтрокиНалогиВзносыОтчисления = МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления;
				СтрокаНалогиВзносыОтчисления = РасчетЗарплатыРасширенныйФормы.СтрокаТаблицыПоНачальнойПозиции(Объект.НалогиВзносыОтчисления, ПозицияВставки);
				СтрокаНалогиВзносыОтчисленияВДанныеФормы(СтрокаНалогиВзносыОтчисления, СтрокаИсточник, МассивСтрокВычетыИПН, Объект);
				КоличествоСтрок = КоличествоСтрок + 1;
				ПозицияВставки = ПозицияВставки + 1;
				СтрокиКУдалению.Добавить(СтрокаИсточник);
				МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления = МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления + 1;
				
			КонецЦикла; 
			
			Сдвиг = Сдвиг + КоличествоСтрок - СтрокаПозиций.КоличествоСтрок;
			
		КонецЦикла;
		
		УдалитьСтрокиРасчета(НалогиВзносыОтчисления, СтрокиКУдалению);
		
	КонецЕсли;
	
	Для Каждого СтрокаИсточник Из НалогиВзносыОтчисления Цикл
		
		ПараметрыОтбора = Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", СтрокаИсточник.ИдентификаторСтрокиНалогиВзносыОтчисления);
		МассивСтрокВычетыИПН = ДанныеДляЗаполнения.ВычетыИПН.НайтиСтроки(ПараметрыОтбора);
		
		СтрокаИсточник.ИдентификаторСтрокиНалогиВзносыОтчисления = МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления;
		СтрокаНалогиВзносыОтчисления = Объект.НалогиВзносыОтчисления.Добавить();
		СтрокаНалогиВзносыОтчисленияВДанныеФормы(СтрокаНалогиВзносыОтчисления, СтрокаИсточник, МассивСтрокВычетыИПН, Объект);
		МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления = МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления + 1;
		
	КонецЦикла;
	
	
	ДоходыНеПодлежащиеНалогообложению = ДанныеДляЗаполнения.ДоходыНеПодлежащиеНалогообложению.Скопировать();
	Если НачальныеПозицииВставки <> Неопределено Тогда
		
		ПозицииСотрудников = РасчетЗарплатыРасширенныйФормы.ТаблицаПозицииСотрудников(НачальныеПозицииВставки["ДоходыНеПодлежащиеНалогообложению"]);

		Сдвиг = 0;
		СтруктураПоиска = Новый Структура("ФизическоеЛицо");
		СтрокиКУдалению = Новый Массив;

		Для Каждого СтрокаПозиций Из ПозицииСотрудников Цикл
			
			СтруктураПоиска.ФизическоеЛицо = СтрокаПозиций.Сотрудник;
			СтрокиДоходыНеПодлежащиеНалогообложению = ДоходыНеПодлежащиеНалогообложению.НайтиСтроки(СтруктураПоиска);
			ПозицияВставки = СтрокаПозиций.НачальнаяПозиция + Сдвиг;
			КоличествоСтрок = 0;
			
			Для Каждого СтрокаИсточник Из СтрокиДоходыНеПодлежащиеНалогообложению Цикл
			
				НоваяСтрока = РасчетЗарплатыРасширенныйФормы.СтрокаТаблицыПоНачальнойПозиции(Объект.ДоходыНеПодлежащиеНалогообложению, ПозицияВставки);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсточник);
				КоличествоСтрок = КоличествоСтрок + 1;
				ПозицияВставки = ПозицияВставки + 1;
				СтрокиКУдалению.Добавить(СтрокаИсточник);
				
			КонецЦикла; 
			
			Сдвиг = Сдвиг + КоличествоСтрок - СтрокаПозиций.КоличествоСтрок;
			
		КонецЦикла;
		УдалитьСтрокиРасчета(ДоходыНеПодлежащиеНалогообложению, СтрокиКУдалению);
		
	КонецЕсли;
	
	Для Каждого СтрокаИсточник Из ДоходыНеПодлежащиеНалогообложению Цикл
		
		НоваяСтрока = Объект.ДоходыНеПодлежащиеНалогообложению.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсточник);
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура НалогиВзносыОтчисленияВДанныеМенеджераРасчета(ТаблицаНалогиВзносыОтчисления, ТаблицаВычетыИПН, ТаблицаДоходыНеПодлежащиеНалогообложению, МенеджерРасчета, Отбор = Неопределено, НачальныеПозицииВставки = Неопределено) Экспорт
	
	НалогиВзносыОтчисления = МенеджерРасчета.Зарплата.НалогиВзносыОтчисления;
	ДоходыНеПодлежащиеНалогообложению = МенеджерРасчета.Зарплата.ДоходыНеПодлежащиеНалогообложению;
	
	СтрокиРасчетаНалогиВзносыОтчисления = Новый Массив;
	СтрокиРасчетаВычетыИПН = Новый Массив;
	НачальныеПозицииСотрудников = Новый Соответствие;
	
	Для Каждого СтрокаФормы Из ТаблицаНалогиВзносыОтчисления Цикл
		
		Если Отбор <> Неопределено Тогда
			ФизическоеЛицо = Отбор.ФизическиеЛицаОтбор[СтрокаФормы.ФизическоеЛицо];
			Если ФизическоеЛицо = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			УстановитьНачальнуюПозициюПоСотруднику(НачальныеПозицииСотрудников, СтрокаФормы.ФизическоеЛицо, ТаблицаНалогиВзносыОтчисления.Индекс(СтрокаФормы));
			СтрокиРасчетаНалогиВзносыОтчисления.Добавить(СтрокаФормы);
			
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", СтрокаФормы.ИдентификаторСтрокиНалогиВзносыОтчисления);
		СтрокиПримененныеВычеты = ТаблицаВычетыИПН.НайтиСтроки(СтруктураПоиска);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокиРасчетаВычетыИПН, СтрокиПримененныеВычеты);
		СтрокаНалогиВзносыОтчисленияВДанныеМенеджераРасчета(МенеджерРасчета, СтрокаФормы, СтрокиПримененныеВычеты);
		
	КонецЦикла;
	
	Если НачальныеПозицииВставки <> Неопределено Тогда
		НачальныеПозицииВставки.Вставить("НалогиВзносыОтчисления", НачальныеПозицииСотрудников);
	КонецЕсли;
	
	СтрокиРасчетаДоходыНеПодлежащиеНалогообложению = Новый Массив;
	НачальныеПозицииСотрудников = Новый Соответствие;
	
	Для Каждого СтрокаФормы Из ТаблицаДоходыНеПодлежащиеНалогообложению Цикл
		
		Если Отбор <> Неопределено Тогда
			ФизическоеЛицо = Отбор.ФизическиеЛицаОтбор[СтрокаФормы.ФизическоеЛицо];
			Если ФизическоеЛицо = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			УстановитьНачальнуюПозициюПоСотруднику(НачальныеПозицииСотрудников, СтрокаФормы.ФизическоеЛицо, ТаблицаДоходыНеПодлежащиеНалогообложению.Индекс(СтрокаФормы));
			СтрокиРасчетаДоходыНеПодлежащиеНалогообложению.Добавить(СтрокаФормы);
			
		КонецЕсли;
		
		СтрокаДоходыНеПодлежащиеНалогообложениюВДанныеМенеджераРасчета(МенеджерРасчета, СтрокаФормы);
		
	КонецЦикла;
	
	Если НачальныеПозицииВставки <> Неопределено Тогда
		НачальныеПозицииВставки.Вставить("ДоходыНеПодлежащиеНалогообложению", НачальныеПозицииСотрудников);
	КонецЕсли;
	
	УдалитьСтрокиРасчета(ТаблицаНалогиВзносыОтчисления, СтрокиРасчетаНалогиВзносыОтчисления, Отбор = Неопределено);
	УдалитьСтрокиРасчета(ТаблицаДоходыНеПодлежащиеНалогообложению, СтрокиРасчетаДоходыНеПодлежащиеНалогообложению, Отбор = Неопределено);
	УдалитьСтрокиРасчета(ТаблицаВычетыИПН, СтрокиРасчетаВычетыИПН, Отбор = Неопределено);
	
КонецПроцедуры

Процедура СтрокаНалогиВзносыОтчисленияВДанныеМенеджераРасчета(МенеджерРасчета, СтрокаИсточник, СтрокиПримененныеВычеты) Экспорт
	
	СтрокаПриемник = МенеджерРасчета.Зарплата.НалогиВзносыОтчисления.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаПриемник, СтрокаИсточник);
	
КонецПроцедуры

Процедура СтрокаДоходыНеПодлежащиеНалогообложениюВДанныеМенеджераРасчета(МенеджерРасчета, СтрокаИсточник) Экспорт
	
	СтрокаПриемник = МенеджерРасчета.Зарплата.ДоходыНеПодлежащиеНалогообложению.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаПриемник, СтрокаИсточник);
	
КонецПроцедуры

Процедура СтрокаНалогиВзносыОтчисленияВДанныеФормы(СтрокаНалогиВзносыОтчисления, СтрокаИсточник, МассивСтрок, Объект)
	
	ЗаполнитьЗначенияСвойств(СтрокаНалогиВзносыОтчисления, СтрокаИсточник);
	
	Для Каждого СтрокаИсточникВычетИПН Из МассивСтрок Цикл
		СтрокаВычетИПН = Объект.ВычетыИПН.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаВычетИПН, СтрокаИсточникВычетИПН);
		СтрокаВычетИПН.ИдентификаторСтрокиНалогиВзносыОтчисления = СтрокаИсточник.ИдентификаторСтрокиНалогиВзносыОтчисления;
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьСтрокиРасчета(Таблица, СтрокиРасчета, ПолноеУдаление = Ложь)
	
	Если ПолноеУдаление Тогда
		Таблица.Очистить();
	Иначе
		Для Каждого СтрокаУдаления Из СтрокиРасчета Цикл
			Таблица.Удалить(СтрокаУдаления);
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеВычеты(Форма, ИмяМесяцНачисления = "МесяцНачисления") Экспорт
	
	ДатаКонтроля = '2018-01-01';
	ДатаПримененияКорректировкиДохода = '2019-01-01';
	
	Объект = Форма.Объект;
	
	//
	ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяМесяцНачисления);
	ЭлементОтбора.ПравоеЗначение = ДатаКонтроля;
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НалогиВзносыОтчисленияРазрешенныйВычет");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НалогиВзносыОтчисленияПримененныйВычет");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НалогиВзносыОтчисленияПрочиеВычеты");
	
	ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяМесяцНачисления);
	ЭлементОтбора.ПравоеЗначение = ДатаКонтроля;

	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяМесяцНачисления);
	ЭлементОтбора.ПравоеЗначение = ДатаПримененияКорректировкиДохода;

	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НалогиВзносыОтчисленияПримененнаяЛьгота");

	//
	ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяМесяцНачисления);
	ЭлементОтбора.ПравоеЗначение = ДатаКонтроля;
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НалогиВзносыОтчисленияПредставлениеПримененныеВычеты");
	
	//
	ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "");
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления");
	ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ИПН");
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НалогиВзносыОтчисленияПредставлениеПримененныеВычеты");
	
КонецПроцедуры

// Формирует сторно записи отменяющие движения исправленного документа по регистрам подсистемы.
//
// Параметры:
//  Движения				 - КоллекцияДвижений, Структура	 - Коллекция движений в которую будут добавлены сторно записи.
//  ИсправленныйДокумент	 - ДокументСсылка				 - Документ, записи которого необходимо сторнировать.
//  ПараметрыИсправления	 - Структура					 - Свойства см. в описании функции СторнироватьПоУчетам модулей менеджеров документов.
//  ИсключаемыйРегистратор	 - ДокументСсылка				 - Документ, движения которого не следует учитывать при расчете движений.
//  Записывать				 - Булево						 - Если Истина, то наборы будут записаны сразу, если Ложь, то наборам будет установлен признак Записывать = Истина.
//
Процедура СторнироватьДвиженияДокумента(Движения, ИсправленныйДокумент, ПараметрыИсправления = Неопределено, ИсключаемыйРегистратор = Неопределено, Записывать = Ложь) Экспорт
	
	ИмяУчета = "УчетНалоговВзносовОтчисленийРасширенный";
	МетаданныеРегистров = МетаданныеРегистровПодсистемы();
	
	ДвиженияВСтруктуре = ТипЗнч(Движения) = Тип("Структура");
	Набор = Неопределено;
	
	ИсправлениеВТекущемПериоде = ПараметрыИсправления <> Неопределено И ПараметрыИсправления.Свойство("ИсправлениеВТекущемПериоде") И ПараметрыИсправления.ИсправлениеВТекущемПериоде;
	ОтменаДокумента = ПараметрыИсправления <> Неопределено И ПараметрыИсправления.Свойство("ОтменаДокумента") И ПараметрыИсправления.ОтменаДокумента;

	Если ОтменаДокумента И Не ИсправлениеВТекущемПериоде Тогда
		ИсключаемыеРегистры = Новый Массив;
		ИсключаемыеРегистры.Добавить(Метаданные.РегистрыНакопления.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами);
		ИсключаемыеРегистры.Добавить(Метаданные.РегистрыНакопления.СведенияОбИсчисленииНалоговВзносовОтчислений);
		ИсключаемыеРегистры.Добавить(Метаданные.РегистрыНакопления.СведенияОНеоблагаемыхДоходахФизическихЛиц);
		ИсключаемыеРегистры.Добавить(Метаданные.РегистрыНакопления.СведенияОбИсчисленииВычетовИПН);
		
		Для Каждого МетаданныеРегистра Из ИсключаемыеРегистры Цикл
			Если ДвиженияВСтруктуре Тогда
				Движения.Свойство(МетаданныеРегистра.Имя, Набор);
			Иначе
				Набор = Движения.Найти(МетаданныеРегистра.Имя);
			КонецЕсли;
			
			Если Набор <> Неопределено Тогда
				// Наборы для исключаемых регистров изолируются, но не сторнируются.
				ИсправлениеДокументовЗарплатаКадры.ИзолироватьУчетом(Набор, ИмяУчета);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого МетаданныеРегистра Из МетаданныеРегистров Цикл
		
		ИмяРегистра = МетаданныеРегистра.Имя;
		
		Если ДвиженияВСтруктуре Тогда
			Движения.Свойство(ИмяРегистра, Набор);
		Иначе
			Набор = Движения.Найти(ИмяРегистра);
		КонецЕсли;
		
		Если Набор = Неопределено Или Не ИсправлениеДокументовЗарплатаКадры.ИзолироватьУчетом(Набор, ИмяУчета) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЭтоРегистрНакопления(МетаданныеРегистра) Тогда
			ИсправлениеДокументовЗарплатаКадры.СторнироватьДвиженияВРегистреНакопления(Набор, ИсправленныйДокумент, МетаданныеРегистра, Записывать);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьУдержанныеНалогиВзносы(Документ, Отказ) Экспорт
	
	Если Документ.Метаданные().ТабличныеЧасти.Найти("НалогиВзносы") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НалогиВзносы.ФизическоеЛицо,
	|	НалогиВзносы.МесяцНалоговогоПериода,
	|	НалогиВзносы.РегистрацияВНалоговомОргане,
	|	НалогиВзносы.ВидНалогаВзносаОтчисления,
	|	НалогиВзносы.ВидДохода,
	|	НалогиВзносы.НалогВзнос
	|ПОМЕСТИТЬ ВТ_ДокументНалогиВзносы
	|ИЗ
	|	#Документ КАК НалогиВзносы
	|ГДЕ
	|	НалогиВзносы.Ссылка = &Ссылка";
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "#Документ", Документ.Метаданные().ПолноеИмя() + ".НалогиВзносы");
	Запрос.Выполнить();
	
	УчетНалоговВзносовОтчислений.СформироватьУдержаниеНалогиВзносыПоВременнойТаблице(Документ.Движения, Отказ, Документ.Организация, Документ.ПериодРегистрации, МенеджерВременныхТаблиц, Истина);
	
КонецПроцедуры

Процедура УстановитьПараметрыВыбораСотрудниковВДокументахПредоставленияВычетов(Форма, ИмяЭлементаСотрудник) Экспорт
	
	ЭлементФормы = Форма.Элементы.Найти(ИмяЭлементаСотрудник);
	Если ЭлементФормы <> Неопределено Тогда
		
		ОтборУстановлен = Ложь;
		
		ПараметрыВыбора = Новый Массив(ЭлементФормы.ПараметрыВыбора);
		Для каждого ПараметрВыбора Из ПараметрыВыбора Цикл
			
			Если ВРег(ПараметрВыбора.Имя) = ВРег("Отбор.Роль") Тогда
				
				ОтборУстановлен = Истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ОтборУстановлен Тогда
			
			РолиСотрудника = Новый Массив;
			РолиСотрудника.Добавить(Перечисления.РолиФизическихЛиц.Сотрудник);
			РолиСотрудника.Добавить(Перечисления.РолиФизическихЛиц.БывшийСотрудник);
			РолиСотрудника.Добавить(Перечисления.РолиФизическихЛиц.ПрочийПолучательДоходов);
			
			ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Роль", Новый ФиксированныйМассив(РолиСотрудника)));
			
			ЭлементФормы.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНазначениеПлатежаСервер(Контрагент, БанковскийСчетКонтрагента, ВедомостиНаПеречисление, НазначениеПлатежа, КодНазначенияПлатежа) Экспорт
	
	СтрокаТекста = "";
	
	Если ЗначениеЗаполнено(БанковскийСчетКонтрагента) Тогда
		СтрокаТекста = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанковскийСчетКонтрагента, "ТекстНазначения");
	КонецЕсли;
	
	ТекстПериодыПеречисления = "";	
	
	ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ПустаяСсылка();
	ВидПлатежа = Перечисления.ВидыПлатежейВГосБюджет.ПустаяСсылка();
	
	ЗаполнятьДаннымВедомостей = НЕ ЗначениеЗаполнено(СтрокаТекста) И ВедомостиНаПеречисление.Количество() > 0;
	
	Если ЗаполнятьДаннымВедомостей Тогда
		
		МассивРазличныхМесяцев = Новый Массив;
		
		СчетчикСтрок = 1;
		
		Для Каждого СтрокаВедомости Из ВедомостиНаПеречисление Цикл
			
			Если ЗначениеЗаполнено(СтрокаВедомости.Ведомость) Тогда
				
				ДанныеВедомости = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаВедомости.Ведомость, "ПериодРегистрации, ВидНалогаВзносаОтчисления, ВидПлатежа");
				
				Если СчетчикСтрок = 1 Тогда
					
					ВидНалогаВзносаОтчисления = ДанныеВедомости.ВидНалогаВзносаОтчисления;
					ВидПлатежа = ДанныеВедомости.ВидПлатежа;
					
				КонецЕсли;
				
				Если МассивРазличныхМесяцев.Найти(ДанныеВедомости.ПериодРегистрации) = Неопределено Тогда
					
					МассивРазличныхМесяцев.Добавить(ДанныеВедомости.ПериодРегистрации);
					
				КонецЕсли;
				
				СчетчикСтрок = СчетчикСтрок + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
		СчетчикСтрок = 1;

		Для Каждого ПериодРегистрации Из МассивРазличныхМесяцев Цикл
			
			ТекстПериодыПеречисления = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПериодыПеречисления + "%1 %2 %3", ?(СчетчикСтрок = 1, " за период", ","), НРег(Формат(ПериодРегистрации, "ДФ='ММММ гггг'")), НСтр("ru = 'г.'"));	
			СчетчикСтрок = СчетчикСтрок + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ВидПлатежа = Перечисления.ВидыПлатежейВГосБюджет.ПениАкт
		Или ВидПлатежа = Перечисления.ВидыПлатежейВГосБюджет.ПениСам Тогда
		
		Если ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ОПВ Тогда
			СтрокаТекста = НСтр("ru = 'Пеня за несвоевременное перечисление обязательных пенсионных взносов%1%2%3'");
			КодНазначенияПлатежа = "019";
		ИначеЕсли ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ОППВ Тогда
			СтрокаТекста = НСтр("ru = 'Пеня за несвоевременное перечисление обязательных профессиональных пенсионных взносов%1%2%3'");
			КодНазначенияПлатежа = "009";
		ИначеЕсли ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.СО Тогда
			СтрокаТекста = НСтр("ru = 'Пеня за несвоевременное перечисление обязательных социальных отчислений%1%2%3'");
			КодНазначенияПлатежа = "017";
		ИначеЕсли ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ООСМС Тогда
			СтрокаТекста = НСтр("ru = 'Пеня за несвоевременное перечисление отчислений на обязательное социальное медицинское страхование%1%2%3'");
			КодНазначенияПлатежа = "123";
		ИначеЕсли ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС Тогда
			СтрокаТекста = НСтр("ru = 'Пеня за несвоевременное перечисление взносов на обязательное социальное медицинское страхование%1%2%3'");
			КодНазначенияПлатежа = "124";
		КонецЕсли;
		
	ИначеЕсли ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ОПВ Тогда
		СтрокаТекста = НСтр("ru = 'Обязательные пенсионные взносы%1%2%3'");
		КодНазначенияПлатежа = "010"; 
	ИначеЕсли ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ОППВ Тогда
		СтрокаТекста = НСтр("ru = 'Обязательные профессиональные пенсионные взносы%1%2%3'");
		КодНазначенияПлатежа = "015"; 
	ИначеЕсли ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.СО Тогда
		СтрокаТекста = НСтр("ru = 'Обязательные социальные отчисления%1%2%3'");
		КодНазначенияПлатежа = "012";
	ИначеЕсли ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС Тогда
		СтрокаТекста = НСтр("ru = 'Взносы на обязательное социальное медицинское страхование%1%2%3'");
		КодНазначенияПлатежа = "122";
	ИначеЕсли ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ООСМС Тогда
		СтрокаТекста = НСтр("ru = 'Отчисления на обязательное социальное медицинское страхование%1%2%3'");
		КодНазначенияПлатежа = "121";
	КонецЕсли;

	Если ЗаполнятьДаннымВедомостей Тогда
	
		ТекстНазначение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаТекста, НСтр(" ru = ' в '"), СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "НаименованиеПолное")) + " ", ТекстПериодыПеречисления);
		
	Иначе
		
		ТекстНазначение = СтрокаТекста;
		
	КонецЕсли;

	НазначениеПлатежа = ТекстНазначение;	

КонецПроцедуры

Процедура ЗаменитьСтрокиНалогиВзносыОтчисления(ОбновляемаяКоллекцияНВО, ОбновляемаяКоллекцияВычетыИПН, ОбновляемаяКоллекцияДНН, ПараметрыДанных, КонтролируемыеПоля, ОписаниеДокумента, ОтборСтрок = Неопределено, СохранятьИсправления = Истина, КлючевыеКолонки = "ФизическоеЛицо") Экспорт
	
	НалогиВзносыОтчисления = ПараметрыДанных.НалогиВзносыОтчисления;
	ВычетыИПН = ПараметрыДанных.ВычетыИПН;
	ДоходыНеПодлежащиеНалогообложению = ПараметрыДанных.ДоходыНеПодлежащиеНалогообложению;
	
	Если НЕ ОтборСтрок = Неопределено
		И ОтборСтрок.Свойство("ВидНалогаВзносаОтчисления") Тогда
		
		ВидНалогаВзносаОтчисления = ОтборСтрок.ВидНалогаВзносаОтчисления;
		
	Иначе
		
		ВидНалогаВзносаОтчисления = Неопределено;
		
	КонецЕсли;
	
	МаксимальныйИдентификаторСтрокиНВО = УчетНалоговВзносовОтчислений.МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления(ОбновляемаяКоллекцияНВО);
	
	// Заполняем строки идентификатором увеличенным на единицу, относительно максимального.
	УчетНалоговВзносовОтчислений.НазначитьИдентификаторыНовымСтрокамТаблицамНалогиВзносыОтчисленияИВычетыИПН(
		МаксимальныйИдентификаторСтрокиНВО + 1, НалогиВзносыОтчисления, ВычетыИПН);
	
	УсловияЗаменыСтрок = Неопределено;
	
	// Сохранение идентификаторов заменяемых строк НалогиВзносыОтчисления.
	ИдентификаторыСтрокНВО = Новый Массив;
	
	Если ОтборСтрок = Неопределено Тогда
		ЗаменяемыеСтрокиНВО = ОбновляемаяКоллекцияНВО;
	Иначе
		ЗаменяемыеСтрокиНВО = РасчетЗарплатыРасширенный.НайтиСтрокиОтборПоМассиву(ОбновляемаяКоллекцияНВО, "ФизическоеЛицо", ОтборСтрок.ФизическоеЛицо);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИдентификаторыСтрокНВО, 
		ОбщегоНазначения.ВыгрузитьКолонку(ЗаменяемыеСтрокиНВО, "ИдентификаторСтрокиНалогиВзносыОтчисления"));
		
	// Обновление строк таблицы НалогиВзносыОтчисления.
	Если СохранятьИсправления Тогда
		УсловияЗаменыСтрок = РасчетЗарплатыРасширенный.УсловияЗаменыСтрокКонтролируемымиПолями(КонтролируемыеПоля, ОписаниеДокумента.НалогиВзносыОтчисленияИмя);
	КонецЕсли;
	
	// Таблица ПримененныеВычеты, является расширением строк таблицы НалогиВзносыОтчисления,
	// поэтому замена строк в таблицы ПримененныеВычеты, должна выполняться на тех же условиях, что
	// и замена строк таблицы НалогиВзносыОтчисления.
	
	// Сбор информации об идентификаторах строка НалогиВзносыОтчисления принимающих участие в замене.
	ИдентификаторыСтрокНВОУчаствующихВЗамене = ОбщегоНазначения.ВыгрузитьКолонку(ЗаменяемыеСтрокиНВО, "ИдентификаторСтрокиНалогиВзносыОтчисления");
	
	РасчетЗарплатыРасширенный.ЗаменитьСтрокиНаНовыеДанные(ОбновляемаяКоллекцияНВО, НалогиВзносыОтчисления, КлючевыеКолонки, УсловияЗаменыСтрок, ОтборСтрок);
	
	Если НЕ ОписаниеДокумента.ВычетыИПНИмя = Неопределено
		И ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ИПН Тогда
		
		// Удаление из коллекции ИдентификаторыСтрокНВОУчаствующихВЗамене, идентификаторов
		// строк, не подвергшихся замене, добавление в коллекцию идентификаторов 
		// новых строк НалогиВзносыОтчисления.
		
		Если ОтборСтрок = Неопределено Тогда
			ЗаменяемыеСтрокиНВО = ОбновляемаяКоллекцияНВО;
		Иначе
			ЗаменяемыеСтрокиНВО = РасчетЗарплатыРасширенный.НайтиСтрокиОтборПоМассиву(ОбновляемаяКоллекцияНВО, "ФизическоеЛицо", ОтборСтрок.ФизическоеЛицо);
		КонецЕсли;
		
		ОбновленныеИдентификаторыСтрокНВОУчаствующихВЗамене = ОбщегоНазначения.ВыгрузитьКолонку(ЗаменяемыеСтрокиНВО, "ИдентификаторСтрокиНалогиВзносыОтчисления");
		Для каждого ИдентификаторСтрокиНВО Из ОбновленныеИдентификаторыСтрокНВОУчаствующихВЗамене Цикл
			
			ИндексЭлемента = ИдентификаторыСтрокНВОУчаствующихВЗамене.Найти(ИдентификаторСтрокиНВО);
			Если ИндексЭлемента = Неопределено Тогда
				ИдентификаторыСтрокНВОУчаствующихВЗамене.Добавить(ИдентификаторСтрокиНВО);
			Иначе
				ИдентификаторыСтрокНВОУчаствующихВЗамене.Удалить(ИндексЭлемента);
			КонецЕсли;
			
		КонецЦикла;
			
		// Обновление строк таблицы ПримененныеВычеты.
		РасчетЗарплатыРасширенный.ЗаменитьСтрокиНаНовыеДанные(
			ОбновляемаяКоллекцияВычетыИПН, 
			ВычетыИПН, 
			"ИдентификаторСтрокиНалогиВзносыОтчисления", , 
			Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", ИдентификаторыСтрокНВОУчаствующихВЗамене));
			
	КонецЕсли;
	
	Если НЕ ОписаниеДокумента.ДоходыНеПодлежащиеНалогообложениюИмя = Неопределено Тогда
		
		// Удаление из коллекции ИдентификаторыСтрокНВОУчаствующихВЗамене, идентификаторов
		// строк, не подвергшихся замене, добавление в коллекцию идентификаторов 
		// новых строк НалогиВзносыОтчисления.
		
		// Обновление строк таблицы ДоходыНеПодлежащиеНалогообложениюИмя.
		РасчетЗарплатыРасширенный.ЗаменитьСтрокиНаНовыеДанные(
			ОбновляемаяКоллекцияДНН, 
			ДоходыНеПодлежащиеНалогообложению, 
			"ФизическоеЛицо", , 
			Новый Структура("ФизическоеЛицо", ОтборСтрок.ФизическоеЛицо));
			
	КонецЕсли;
	
КонецПроцедуры

Функция КонтролируемыеПоляДляФиксацииРезультатов() Экспорт

	НалогиВзносыОтчисленияФиксРасчет = Новый Массив;
	НалогиВзносыОтчисленияФиксРасчет.Добавить("Налог");
	НалогиВзносыОтчисленияФиксРасчет.Добавить("ЗачтеноАвансовыхПлатежей");
	НалогиВзносыОтчисленияФиксРасчет.Добавить("НалогКЗачетуВозврату");
	НалогиВзносыОтчисленияФиксРасчет.Добавить("ПримененныйВычетЛичный");
	НалогиВзносыОтчисленияФиксРасчет.Добавить("ПримененныйВычетЛичныйКодВычета");
	НалогиВзносыОтчисленияФиксРасчет.Добавить("ПримененныйВычетЛичныйКЗачетуВозврату");
	НалогиВзносыОтчисленияФиксРасчет.Добавить("ПримененныйВычетЛичныйКЗачетуВозвратуКодВычета");

	НалогиВзносыОтчисленияФиксСтрока = Новый Массив;
	НалогиВзносыОтчисленияФиксСтрока.Добавить("ФизическоеЛицо");
	НалогиВзносыОтчисленияФиксСтрока.Добавить("МесяцНалоговогоПериода");
	НалогиВзносыОтчисленияФиксСтрока.Добавить("Подразделение");
	
	Возврат Новый Структура("ФиксРасчет, ФиксСтрока", НалогиВзносыОтчисленияФиксРасчет, НалогиВзносыОтчисленияФиксСтрока)
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеФункцииИПроцедуры

Функция МетаданныеРегистровПодсистемы()
	
	Регистры = Новый Массив;
	Регистры.Добавить(Метаданные.РегистрыНакопления.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами);
	Регистры.Добавить(Метаданные.РегистрыНакопления.СведенияОбИсчисленииНалоговВзносовОтчислений);
	Регистры.Добавить(Метаданные.РегистрыНакопления.СведенияОДоходахФизическихЛиц);
	Регистры.Добавить(Метаданные.РегистрыНакопления.СведенияОНеоблагаемыхДоходахФизическихЛиц);
	Регистры.Добавить(Метаданные.РегистрыНакопления.СведенияОбИсчисленииВычетовИПН);
	
	Возврат Регистры;
	
КонецФункции

#КонецОбласти