&НаКлиенте
Процедура ЗаполнитьДерево(Команда)
	ЗакрытьСПараметром();
КонецПроцедуры

&НаКлиенте 
Процедура ЗакрытьСПараметром()
	Если ТипОперации = "Сохранение" Тогда
		Если ЗначениеЗаполнено(КаталогСохранения) Тогда
			КаталогДоступенНаЗапись = ЭКОМ_ОбщегоНазначенияКлиент.КаталогДоступенНаЗапись(КаталогСохранения, Новый Массив);
			Если Не КаталогДоступенНаЗапись Тогда
				ТексСообщения = "Отсутствуют права на запись файлов в указанный каталог или каталог указан не верно.";
			КонецЕсли;
		Иначе
			ТексСообщения = "Не указан каталог для сохранения настроек";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТексСообщения) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТексСообщения;
			Сообщение.Сообщить();
			
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеДерева 	   		 = НастройкиДляСохранения.ПолучитьЭлементы();
	СоответствиеИменНастроек = ЭКОМ_ОбщегоНазначения.ПолучитьСоответствиеИменНастроек();	

	МассивНастроек = Новый Массив;
	МассивКонстант = Новый Массив;
	ВсегоФайлов	   = 0;
	
	Для Каждого Элемент Из ДанныеДерева Цикл
		НастройкиВыбраны = Ложь;
		
		МассивПодчиненных = Элемент.ПолучитьЭлементы();
		Если МассивПодчиненных.Количество() Тогда
			// сведения о прочих настройках записываются в отбор как константы
			Если Найти(Элемент.Имя, "Прочие настройки") Тогда
				Для Каждого ПодчиненныйЭлемент Из МассивПодчиненных Цикл
					Если ПодчиненныйЭлемент.Сохранить Тогда
						ИмяКонстанты = СоответствиеИменНастроек.СинонимКИмени.Получить(ПодчиненныйЭлемент.Имя);
						
						ВсегоФайлов = ВсегоФайлов + 1;
						МассивКонстант.Добавить(?(ИмяКонстанты = Неопределено, ПодчиненныйЭлемент.Имя, ИмяКонстанты));
					КонецЕсли;
				КонецЦикла;
			Иначе
				// сведения о гибких настройках документов
				// родитель - записывается в отбор как константа
				// подчиненные элементы - в отбор настроек
				Для Каждого ПодчиненныйЭлемент Из МассивПодчиненных Цикл
					Если ПодчиненныйЭлемент.Сохранить Тогда
						ВсегоФайлов = ВсегоФайлов + 1;
						МассивНастроек.Добавить(ПодчиненныйЭлемент.Имя);
						НастройкиВыбраны = Истина;
					КонецЕсли;
				КонецЦикла;
				Если НастройкиВыбраны Тогда
					ИмяКонстанты = СоответствиеИменНастроек.СинонимКИмени.Получить(Элемент.Имя);
					МассивКонстант.Добавить(?(ИмяКонстанты = Неопределено, Элемент.Имя, ИмяКонстанты));  				
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивКонстант.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрано ни одной настройки.";
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;    
	
	СтруктураРезультат = Новый Структура("ВыбранныеТипы, МассивКонстант, КаталогСохранения, СохранятьПоОтдельности, ВсегоФайлов",
												МассивНастроек, МассивКонстант, КаталогСохранения, СохранятьПоОтдельности, ВсегоФайлов); 
	ЗакрытьПоУмолчанию = Истина;
	Закрыть(СтруктураРезультат);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТипыТранзакций = Неопределено;
	Если Параметры.Свойство("ТипОперации", ТипОперации) = Ложь
		ИЛИ Параметры.Свойство("ТипыТранзакций", ТипыТранзакций) = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеИменНастроек = ЭКОМ_ОбщегоНазначения.ПолучитьСоответствиеИменНастроек();	
	ДанныеДерева  			 = НастройкиДляСохранения.ПолучитьЭлементы();
	
	Для Каждого Элемент Из ТипыТранзакций Цикл
		Если Не ТипЗнч(Элемент.Значение) = Тип("Массив") 
			ИЛИ ТипЗнч(Элемент.Значение) = Тип("Массив") И Элемент.Значение.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

		ИмяНастройки = СоответствиеИменНастроек.ИмяКСинониму.Получить(Элемент.Ключ);
		
		НовСтрДерева = ДанныеДерева.Добавить();
		НовСтрДерева.Имя = ?(ИмяНастройки = Неопределено,Элемент.Ключ, ИмяНастройки);
		
		Для Каждого Транзакция Из Элемент.Значение Цикл
			ИмяТранзакции = СоответствиеИменНастроек.ИмяКСинониму.Получить(Транзакция);
			
			ЭнементыНовойСтроки   = НовСтрДерева.ПолучитьЭлементы();
			ПодчиненнаяСтрока	  = ЭнементыНовойСтроки.Добавить();
			ПодчиненнаяСтрока.Имя = ?(ИмяТранзакции = Неопределено, Транзакция, ИмяТранзакции);
		КонецЦикла;             
	КонецЦикла;  
	
	Если ТипОперации = "Загрузка" Тогда
		Элементы.КаталогСохранения.Видимость = Ложь;
		Элементы.СохранятьПоОтдельности.Видимость = Ложь;
		Элементы.ФормаЗаполнитьДерево.Заголовок = "Загрузить настройки";
		Элементы.НастройкиДляСохраненияСохранить.Заголовок = "Загрузить";
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура ПолучитьТолькоНужныеНастройки()
	//НастройкиЭКОМ = ПолучитьСписокНастроекНаСервере();
	//Для каждого Настройка Из НастройкиЭКОМ Цикл
	//	СоответствиеРеквизитаФормы = СоответствиеРеквизитовФормы.Получить(Настройка.Ключ);
	//	Если НЕ СоответствиеРеквизитаФормы = Неопределено Тогда
	//		УстановитьЗначениеРеквизитаФормы(Настройка.Ключ, Настройка.Значение); 
	//	Иначе
	//		Если Прав(Настройка.Ключ, 9) = "Служебный" Тогда
	//			ИмяРеквизитаФормы = Лев(Настройка.Ключ, СтрДлина(Настройка.Ключ)-9);
	//			СоответствиеРеквизитаФормы = СоответствиеРеквизитовФормы.Получить(ИмяРеквизитаФормы);
	//			Если НЕ СоответствиеРеквизитаФормы = Неопределено Тогда
	//				УстановитьЗначениеРеквизитаФормы(ИмяРеквизитаФормы, Настройка.Значение); 
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;   	
	//КонецЦикла;
	//
КонецПроцедуры

&НаКлиенте
Процедура КаталогСохраненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок          = "Выберите папку сохранения файлов";
	Диалог.МножественныйВыбор = Ложь;
	
	
	Диалог.Показать(Новый ОписаниеОповещения("СохранениеНастроекСВыбором", ЭтаФорма));   	
КонецПроцедуры

&НаКлиенте
Процедура СохранениеНастроекСВыбором(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Или ТипЗнч(ВыбранныеФайлы) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	КаталогСохранения = ВыбранныеФайлы[0]; 	
 
КонецПроцедуры

&НаКлиенте
Процедура НастройкиДляСохраненияПриИзменении(Элемент)
	 СтрокаДерева	   = Элемент.ТекущиеДанные;
	 СтрокаРодитель    = СтрокаДерева.ПолучитьРодителя();
	 Если Не СтрокаРодитель = Неопределено И СтрокаРодитель.Сохранить И Не СтрокаДерева.Сохранить Тогда
		 СтрокаРодитель.Сохранить = Ложь;
	 КонецЕсли;
	 
	 ПодчиненныеСтроки = СтрокаДерева.ПолучитьЭлементы();
	 Для Каждого Строка Из ПодчиненныеСтроки Цикл
		Строка.Сохранить = СтрокаДерева.Сохранить; 
	 КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не ЗакрытьПоУмолчанию Тогда
		Если ТипОперации = "Загрузка" Тогда
			Результат = Новый Структура("Отменить", Истина);
			ЗакрытьПоУмолчанию = Истина;
			Закрыть(Результат);
		Иначе
			СтандартнаяОбработка = Ложь;
			Отказ = Истина;
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтветаОЗакрытии", ЭтаФорма);
			ПоказатьВопрос(ОписаниеОповещения, "Сохранить выбранные настройки?", РежимДиалогаВопрос.ДаНетОтмена,, КодВозвратаДиалога.Отмена); 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаОЗакрытии(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗакрытьСПараметром();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Результат = Новый Структура("Отменить", Истина);
		ЗакрытьПоУмолчанию = Истина;
		Закрыть(Результат);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкиДляСохраненияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПометкуВДереве(Флажок)
	ДанныеДерева 	   		 = НастройкиДляСохранения.ПолучитьЭлементы();  	
	Для Каждого Элемент Из ДанныеДерева Цикл
		Элемент.Сохранить = Флажок;
		МассивПодчиненных = Элемент.ПолучитьЭлементы();
		Для Каждого ПодчиненныйЭлемент Из МассивПодчиненных Цикл
			ПодчиненныйЭлемент.Сохранить = Флажок;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НастройкиДляСохраненияСнятьВсеФлажки(Команда)
	ИзменитьПометкуВДереве(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиДляСохраненияУстановитьВсеФлажки(Команда)
	ИзменитьПометкуВДереве(Истина);
КонецПроцедуры


