#Область ВыручкаИСебестоимостьПродаж

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//
Функция игр_ДобавитьКомандуПрайсЛист(КомандыОтчетов) Экспорт

	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.ПрайсЛист) Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		
		КомандаОтчет.Менеджер = Метаданные.Отчеты.ПрайсЛист.ПолноеИмя();
		КомандаОтчет.Представление = НСтр("ru = 'Прайс-лист'");
		
		КомандаОтчет.МножественныйВыбор = Истина;
		КомандаОтчет.Важность = "СмТакже";
		КомандаОтчет.ДополнительныеПараметры.Вставить("ИмяКоманды", "ПрайсЛист");
		КомандаОтчет.ДополнительныеПараметры.Вставить("ВидимостьКомандВариантовОтчетов", Истина);
		КомандаОтчет.КлючВарианта = "ПрайсЛист";
		
		Возврат КомандаОтчет;
		
	КонецЕсли;

	Возврат Неопределено;

КонецФункции


#КонецОбласти