
#Область ПрограммныйИнтерфейс

Функция ПолучитьНастройки() Экспорт
	
	Результат	= Новый Структура("СтатьиПКО, СтатьиРКО", Новый Соответствие, Новый Соответствие);
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыОбмена = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(КлючНастроекПодключения(), "СтатьиПКО, СтатьиРКО");
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ЗначениеЗаполнено(ПараметрыОбмена.СтатьиПКО) Тогда
		Результат.СтатьиПКО	= ПараметрыОбмена.СтатьиПКО;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыОбмена.СтатьиРКО) Тогда
		Результат.СтатьиРКО	= ПараметрыОбмена.СтатьиРКО;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КлючНастроекПодключения() Экспорт
	
	Возврат "НастройкиОбменаРозница";
	
КонецФункции

#КонецОбласти