//Блок подписки
Функция ПолучитьПодпискуСобытия(Источник, Отказ) Экспорт
	
	ЭКОМ_ОбменСеть      = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ОбменСеть"     , Ложь);
	ЭКОМ_ОбменПоставщик = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ОбменПоставщик", Ложь);
	ЭКОМ_ОбменЭТРН      = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ОбменЭТРН"     , Ложь);
	ЭКОМ_ОбменCONDRA    = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ОбменCONDRA"     , Ложь);
	
	Если ЭКОМ_ОбменЭТРН = Истина Тогда
		 ПолучитьПодпискуСобытияЭТРН(Источник);
	КонецЕсли;
	
	Если ЭКОМ_ОбменСеть = Истина Тогда
		 ПолучитьПодпискуСобытияСеть(Источник);
	КонецЕсли;

	Если ЭКОМ_ОбменПоставщик = Истина Тогда
		 ПолучитьПодпискуСобытияПоставщик(Источник);
	КонецЕсли;
	
	Если ЭКОМ_ОбменCONDRA = Истина Тогда
		 ПолучитьПодпискуСобытияCONDRA(Источник);
	КонецЕсли;
	
КонецФункции	

Функция ПолучитьПодпискуСобытияЭТРН(Источник) Экспорт
	
	Алгоритм = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("СлужебныйЗапросДляПодпискиДокументовЭТРН", ,"Служебный");	
	Если НЕ ЗначениеЗаполнено(Алгоритм) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка			
		// Примерный код для гибких настроек
		// ПримерШаблоновЭТРН(Источник);
		ЭКОМ_ОбщегоНазначения.ВыполнитьПодпискуВПривелигированномРежиме(Источник.Ссылка, Алгоритм);
		
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка в подписке:'"), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка в подписке. " + ОписаниеОшибки();
		Сообщение.Сообщить();
		
		ВызватьИсключение;	

	КонецПопытки;	
	
КонецФункции	

Функция ПолучитьПодпискуСобытияСеть(Источник) Экспорт
	
	// Типы документов	
	Тип_Заказ         = Метаданные.РегистрыСведений.ЭКОМ_ЦепочкиДокументовПокупателя.Измерения.Найти("Заказ").Тип;
	Тип_ДокументЭКОМ  = Метаданные.РегистрыСведений.ЭКОМ_ЦепочкиДокументовПокупателя.Измерения.Найти("ORDRSP").Тип;
	Тип_Накладная     = Метаданные.РегистрыСведений.ЭКОМ_ЦепочкиДокументовПокупателя.Измерения.Найти("Накладная").Тип;
	Тип_Возврат       = Метаданные.РегистрыСведений.ЭКОМ_ЦепочкиДокументовПокупателя.Измерения.Найти("ВозвратнаяНакладная").Тип;
	Тип_СЧФ           = Метаданные.РегистрыСведений.ЭКОМ_ЦепочкиДокументовПокупателя.Измерения.Найти("СЧФ").Тип;
	
	Алгоритм = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("СлужебныйЗапросДляПодпискиДокументовСеть", ,"Служебный");
	
	Если НЕ ЗначениеЗаполнено(Алгоритм) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка		
		// Примерный код для гибких настроек
		// ПримерШаблоновСеть(Источник, Тип_Заказ, Тип_Накладная, Тип_Возврат, Тип_СЧФ)
		ЭКОМ_ОбщегоНазначения.ВыполнитьПодпискуВПривелигированномРежиме(Источник.Ссылка, Алгоритм);
		
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка в подписке:'"), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка в подписке. " + ОписаниеОшибки();
		Сообщение.Сообщить();
		
		ВызватьИсключение;	

	КонецПопытки;
	
КонецФункции	

Функция ПолучитьПодпискуСобытияПоставщик(Источник) Экспорт
	
	// Типы документов
	Тип_ДокументЭКОМ  = Метаданные.РегистрыСведений.ЭКОМ_ЦепочкиДокументовПоставщика.Измерения.Найти("ORDER").Тип;
	Тип_Заказ         = Метаданные.РегистрыСведений.ЭКОМ_ЦепочкиДокументовПоставщика.Измерения.Найти("Заказ").Тип;
	Тип_Накладная     = Метаданные.РегистрыСведений.ЭКОМ_ЦепочкиДокументовПоставщика.Измерения.Найти("Накладная").Тип;
	Тип_Накладная_Кор = Метаданные.РегистрыСведений.ЭКОМ_ЦепочкиДокументовПоставщика.Измерения.Найти("Накладная_Кор").Тип;
	Тип_Возврат       = Метаданные.РегистрыСведений.ЭКОМ_ЦепочкиДокументовПоставщика.Измерения.Найти("ВозвратнаяНакладная").Тип;
	Тип_СЧФ           = Метаданные.РегистрыСведений.ЭКОМ_ЦепочкиДокументовПоставщика.Измерения.Найти("СЧФ").Тип;

	Алгоритм = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("СлужебныйЗапросДляПодпискиДокументовПоставщик", ,"Служебный");
	
	Если НЕ ЗначениеЗаполнено(Алгоритм) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка			
		// Примерный код для гибких настроек
		// ПримерШаблоновПоставщик(Источник, Тип_Заказ, Тип_Накладная, Тип_Накладная_Кор, Тип_Возврат, Тип_СЧФ)
		ЭКОМ_ОбщегоНазначения.ВыполнитьПодпискуВПривелигированномРежиме(Источник.Ссылка, Алгоритм);
		
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка в подписке:'"), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка в подписке. " + ОписаниеОшибки();
		Сообщение.Сообщить();
		
		ВызватьИсключение;	
	КонецПопытки;	

КонецФункции	

Функция ПолучитьПодпискуСобытияCONDRA(Источник) Экспорт
			
	Алгоритм = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("СлужебныйЗапросДляПодпискиДокументовCONDRA", ,"Служебный");	
	Если НЕ ЗначениеЗаполнено(Алгоритм) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
				
		ЭКОМ_ОбщегоНазначения.ВыполнитьПодпискуВПривелигированномРежиме(Источник.Ссылка, Алгоритм);
		
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка в подписке:'"), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка в подписке. " + ОписаниеОшибки();
		Сообщение.Сообщить();
		
		ВызватьИсключение;	

	КонецПопытки;
	
КонецФункции

// В конфигурации не вызывается. Если не используется в гибких настройках - необходимо удалить
//
Функция ПолучитьЦепочкаДокументов(СтруктураПоиска, ТипОбмена) Экспорт
	
	ЗапросЦепочкаДокументов = Новый Запрос;
	Если ТипОбмена = "ЭТРН" Тогда
		
		ТекстПолучить =  "ВЫБРАТЬ
		                 |	ЭКОМ_ЦепочкиДокументовЭТРН.ДатаЭТРН КАК ДатаЭТРН,
		                 |	ЭКОМ_ЦепочкиДокументовЭТРН.НомерЭТРН КАК НомерЭТРН,
		                 |	ЭКОМ_ЦепочкиДокументовЭТРН.Накладная КАК Накладная
		                 |ИЗ
		                 |	РегистрСведений.ЭКОМ_ЦепочкиДокументовЭТРН КАК ЭКОМ_ЦепочкиДокументовЭТРН
		                 |ГДЕ
		                 |	ИСТИНА";
		
		ТекстУсловие = "";
		Для Каждого ЭлементСтруктуры Из СтруктураПоиска Цикл
			ТекстУсловие = ТекстУсловие + "
			|	И ЭКОМ_ЦепочкиДокументовЭТРН." + ЭлементСтруктуры.Ключ + " = &" + ЭлементСтруктуры.Ключ;
			
			ЗапросЦепочкаДокументов.УстановитьПараметр(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
			
		КонецЦикла;
		
	ИначеЕсли ТипОбмена = "Поставщик" Тогда
		
		ТекстПолучить =  "ВЫБРАТЬ
		                 |	ЭКОМ_ЦепочкиДокументовПоставщика.ORDERDATE,
		                 |	ЭКОМ_ЦепочкиДокументовПоставщика.xmlОрганизация,
		                 |	ЭКОМ_ЦепочкиДокументовПоставщика.xmlКонтрагент,
		                 |	ЭКОМ_ЦепочкиДокументовПоставщика.xmlТочкаДоставки,
		                 |	ЭКОМ_ЦепочкиДокументовПоставщика.ORDERNUMBER,
		                 |	ЭКОМ_ЦепочкиДокументовПоставщика.ORDER,
		                 |	ЭКОМ_ЦепочкиДокументовПоставщика.Заказ,
		                 |	ЭКОМ_ЦепочкиДокументовПоставщика.Накладная,
		                 |	ЭКОМ_ЦепочкиДокументовПоставщика.СЧФ,
		                 |	ЭКОМ_ЦепочкиДокументовПоставщика.RECADV,
		                 |	ЭКОМ_ЦепочкиДокументовПоставщика.Накладная_Кор,
		                 |	ЭКОМ_ЦепочкиДокументовПоставщика.RETANN,
		                 |	ЭКОМ_ЦепочкиДокументовПоставщика.ВозвратнаяНакладная
		                 |ИЗ
		                 |	РегистрСведений.ЭКОМ_ЦепочкиДокументовПоставщика КАК ЭКОМ_ЦепочкиДокументовПоставщика
		                 |ГДЕ
		                 |	ИСТИНА";
		
		ТекстУсловие = "";
		Для Каждого ЭлементСтруктуры Из СтруктураПоиска Цикл
			ТекстУсловие = ТекстУсловие + "
			|	И ЭКОМ_ЦепочкиДокументовПоставщика." + ЭлементСтруктуры.Ключ + " = &" + ЭлементСтруктуры.Ключ;
			
			ЗапросЦепочкаДокументов.УстановитьПараметр(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
			
		КонецЦикла;
		
	ИначеЕсли ТипОбмена = "Сеть" Тогда
		
		ТекстПолучить =  "ВЫБРАТЬ
		                 |	ЭКОМ_ЦепочкиДокументовПокупателя.ORDERDATE,
		                 |	ЭКОМ_ЦепочкиДокументовПокупателя.xmlОрганизация,
		                 |	ЭКОМ_ЦепочкиДокументовПокупателя.xmlКонтрагент,
		                 |	ЭКОМ_ЦепочкиДокументовПокупателя.xmlТочкаДоставки,
		                 |	ЭКОМ_ЦепочкиДокументовПокупателя.ORDERNUMBER,
		                 |	ЭКОМ_ЦепочкиДокументовПокупателя.Заказ,
		                 |	ЭКОМ_ЦепочкиДокументовПокупателя.Накладная,
		                 |	ЭКОМ_ЦепочкиДокументовПокупателя.СЧФ,
		                 |	ЭКОМ_ЦепочкиДокументовПокупателя.ВозвратнаяНакладная
		                 |ИЗ
		                 |	РегистрСведений.ЭКОМ_ЦепочкиДокументовПокупателя КАК ЭКОМ_ЦепочкиДокументовПокупателя
		                 |ГДЕ
		                 |	ИСТИНА";
		
		ТекстУсловие = "";
		Для Каждого ЭлементСтруктуры Из СтруктураПоиска Цикл
			ТекстУсловие = ТекстУсловие + "
			|	И ЭКОМ_ЦепочкиДокументовПокупателя." + ЭлементСтруктуры.Ключ + " = &" + ЭлементСтруктуры.Ключ;
			
			ЗапросЦепочкаДокументов.УстановитьПараметр(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
			
		КонецЦикла;

	КонецЕсли;
	
	ЗапросЦепочкаДокументов.Текст = ТекстПолучить + ТекстУсловие;
	
	Возврат ЗапросЦепочкаДокументов.Выполнить().Выгрузить();
	
КонецФункции	

// Функция перенесена в ЭКОМ_ОбщегоНазначения.КонтрагентУчаствуетВЭДО(). Если не используется где-то кроме подписки - удалить.
//
Функция КонтрагентУчаствуетВЭДО(Организация, Контрагент, ТочкаДоставки = Неопределено) Экспорт
	
	ЗапроcПроверкаКлиента = Новый Запрос;
	ЗапроcПроверкаКлиента.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                              |	ЭКОМ_Организации.GLN КАК GLN_Организация,
	                              |	ЭКОМ_Контрагенты.GLN КАК GLN_Контрагент,
	                              |	ЭКОМ_ТочкиДоставки.GLN КАК GLN_ТочкаДоставки,
	                              |	ЭКОМ_Контрагенты.Ид_ОЭД КАК ИдентификаторКонтрагент,
	                              |	ЭКОМ_Организации.Ид_ОЭД КАК ИдентификаторОрганизация,
	                              |	ЭКОМ_ТочкиДоставки.Ид_ОЭД КАК ИдентификаторТочкаДоставки
	                              |ИЗ
	                              |	РегистрСведений.ЭКОМ_GLN КАК ЭКОМ_Организации
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭКОМ_GLN КАК ЭКОМ_Контрагенты
	                              |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭКОМ_ТочкиДоставки КАК ЭКОМ_ТочкиДоставки
	                              |			ПО (ИСТИНА)
	                              |		ПО (ИСТИНА)
	                              |ГДЕ
	                              |	ЭКОМ_Организации.Объект = &Организация
	                              |	И ЭКОМ_Контрагенты.Объект = &Контрагент
	                              |	И ВЫБОР
	                              |			КОГДА &ТочкаДоставки = НЕОПРЕДЕЛЕНО
	                              |				ТОГДА ИСТИНА
	                              |			ИНАЧЕ ЭКОМ_ТочкиДоставки.Объект = &ТочкаДоставки
	                              |		КОНЕЦ";
	ЗапроcПроверкаКлиента.УстановитьПараметр("ТочкаДоставки", ТочкаДоставки);
	ЗапроcПроверкаКлиента.УстановитьПараметр("Организация", Организация);
	ЗапроcПроверкаКлиента.УстановитьПараметр("Контрагент", Контрагент);
	РезультатЗапроса = ЗапроcПроверкаКлиента.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка;

КонецФункции

Функция УчаствуетВЭТРН(Организация, Контрагент, Перевозчик) Экспорт
	
	ЯвляютсяУчастникамиДокументооборота = Ложь;
	ЗапроcПроверкаКлиента = Новый Запрос;
	ЗапроcПроверкаКлиента.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                              |	ЭКОМ_Организации.GLN КАК GLN_Организация,
	                              |	ЭКОМ_Контрагенты.GLN КАК GLN_Контрагент,
	                              |	ЭКОМ_Перевозчик.GLN КАК GLN_Перевозчика,
	                              |	ЭКОМ_Контрагенты.Ид_ОЭД КАК ИдентификаторКонтрагент,
	                              |	ЭКОМ_Организации.Ид_ОЭД КАК ИдентификаторОрганизация,
	                              |	ЭКОМ_Перевозчик.Ид_ОЭД КАК ИдентификаторПеревозчика
	                              |ИЗ
	                              |	РегистрСведений.ЭКОМ_GLN КАК ЭКОМ_Организации
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭКОМ_GLN КАК ЭКОМ_Контрагенты
	                              |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭКОМ_GLN КАК ЭКОМ_Перевозчик
	                              |			ПО (ИСТИНА)
	                              |		ПО (ИСТИНА)
	                              |ГДЕ
	                              |	ЭКОМ_Организации.Объект = &Организация
	                              |	И ЭКОМ_Контрагенты.Объект = &Контрагент
	                              |	И ЭКОМ_Перевозчик.Объект = &Перевозчик";
	ЗапроcПроверкаКлиента.УстановитьПараметр("Перевозчик" , Перевозчик);
	ЗапроcПроверкаКлиента.УстановитьПараметр("Организация", Организация);
	ЗапроcПроверкаКлиента.УстановитьПараметр("Контрагент" , Контрагент);
	РезультатЗапроса = ЗапроcПроверкаКлиента.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
	     ЯвляютсяУчастникамиДокументооборота = Истина;
	КонецЕсли;
		
	Возврат ЯвляютсяУчастникамиДокументооборота;

КонецФункции

Процедура ВыполнитьБлокировкуНабораЗаписей(ОтборБлокировки, ИмяРегистра) Экспорт
	
	// Автоматический - все транзакции, будут выполняться в автоматическом режиме.
	// АвтоматическийИУправляемый  - транзакции, будут выполняться в режиме, определяемом установкой соответствующего свойства объекта метаданных.
	// Управляемый - все транзакции, будут выполняться в управляемом режиме. 
	Блокировать = Ложь;
	Если Метаданные.РежимУправленияБлокировкойДанных = Метаданные.Свойстваобъектов.РежимУправленияБлокировкойДанныхПоУмолчанию.Управляемый Тогда
		Блокировать = Истина;
	КонецЕсли;
	
	Если Блокировать = Истина Тогда
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений." + ИмяРегистра);
		
		Для Каждого ЭлементОтбораБлокировки Из ОтборБлокировки Цикл
			Если ЭлементОтбораБлокировки.Использование Тогда
				ЭлементБлокировкиДанных.УстановитьЗначение(ЭлементОтбораБлокировки.Имя, ЭлементОтбораБлокировки.Значение);
			КонецЕсли;
		КонецЦикла;
		
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
	КонецЕсли;
			
КонецПроцедуры	

// Функция перенесена в ЭКОМ_ОбщегоНазначения.ПолучитьИсправляемыйДокументРеализации(). Если не используется где-то кроме подписки - удалить.
//
Функция ПолучитьИсправляемыйДокументРеализации(Док, Исходный = Ложь, ИмяРеквизита = "ДокументРеализации") Экспорт
   
    Если  Док.Метаданные().Имя = "КорректировкаРеализации"	Тогда       
        Возврат ПолучитьИсправляемыйДокументРеализации(Док[ИмяРеквизита], Исходный);       
    Иначе
        Возврат Док;
    КонецЕсли;   
КонецФункции

Функция ПолучитьИсправляемыйДокументПоступления(Док, Исходный = Ложь, ИмяРеквизита = "ДокументПоступления") Экспорт
   
    Если  Док.Метаданные().Имя = "КорректировкаПоступления"	Тогда       
        Возврат ПолучитьИсправляемыйДокументПоступления(Док[ИмяРеквизита], Исходный);       
    Иначе
        Возврат Док;
    КонецЕсли;   
КонецФункции

// Записываем данные в регистр цепочки, если они заполнены
Процедура СформироватьЗаписьВРегистр(НоваяЗапись, ДанныеИзмерений, ДанныеРесурсов) Экспорт

	// Измерения
	Для Каждого СтрокаИзмерения Из ДанныеИзмерений Цикл
		Если НЕ НоваяЗапись[СтрокаИзмерения.Ключ] = СтрокаИзмерения.Значение 
			И ЗначениеЗаполнено(СтрокаИзмерения.Значение) Тогда
			НоваяЗапись[СтрокаИзмерения.Ключ] = СтрокаИзмерения.Значение;		
		КонецЕсли;			    		
	КонецЦикла;
	
	// Ресурсы		
	Для Каждого СтрокаРесурсов Из ДанныеРесурсов Цикл
		Если (НЕ НоваяЗапись[СтрокаРесурсов.Ключ] = СтрокаРесурсов.Значение 
			И ЗначениеЗаполнено(СтрокаРесурсов.Значение)) 
			ИЛИ СтрокаРесурсов.Ключ = "ТекстОшибки" Тогда
			НоваяЗапись[СтрокаРесурсов.Ключ] = СтрокаРесурсов.Значение;		
		КонецЕсли;			    		
	КонецЦикла;
	
КонецПроцедуры

// Шаблоны

Процедура ПримерШаблоновЭТРН(Источник)
	
	ТипДокументаРеализации  = "ДокументСсылка.РеализацияТоваровУслуг";
	ТипДокументаПоступления = "ДокументСсылка.ПоступлениеТоваровУслуг";
	
	//УТ 10.3
	ИмяЗаказа1С          = "Сделка";
	ИмяОрганизации		 = "Организация";
	ИмяКонтрагента		 = "Контрагент";
	ИмяТочкиДоставки	 = "Грузополучатель";
	НомерЗаказа1С        = "НомерВходящегоДокументаЭлектронногоОбмена";
	ДатаЗаказа1С         = "ДатаВходящегоДокументаЭлектронногоОбмена";
	ДокументОснованиеСЧФ = "ДокументОснование";
	КодСчетФактуры       = "СчетФактура = УчетНДС.НайтиПодчиненныйСчетФактуру(Источник.Ссылка, ""СчетФактураВыданный"");";      
	ИмяПеревозчика       = "Грузоотправитель";
	// Отправитель
	НомерЭТРН            = "Номер";
	ДатаЭТРН             = "Дата";
    // Получатель
	НомерЭТРН            = "НомерВходящегоДокумента";
	ДатаЭТРН             = "ДатаВходящегоДокумента";

	
	//УТ 11.4                          
	//ИмяОрганизации   = "Организация";
	//ИмяКонтрагента   = "Контрагент";
	//ИмяПеревозчика   = "Перевозчик";
	//ИмяТочкиДоставки = "Грузополучатель";
	//ИмяЗаказа1С	   = "ЗаказКлиента";
	//НомерЗаказа1С    = "НомерВходящегоДокумента";
	//ДатаЗаказа1С     = "ДатаВходящегоДокумента";
	//НомерЭТРН        = "Номер";
	//ДатаЭТРН         = "Дата";
	//КодСчетФактуры   = "СчетФактура = УчетНДСПереопределяемый.НайтиПодчиненныйСчетФактуруВыданныйНаРеализацию(Источник.Ссылка);";
		
	Если ТипЗнч(Источник.Ссылка) = Тип(ТипДокументаРеализации) Тогда
		
		ЯвляютсяУчастникамиДокументооборота = УчаствуетВЭТРН(Источник[ИмяОрганизации], Источник[ИмяКонтрагента], Источник[ИмяПеревозчика]);
		
		Если ЯвляютсяУчастникамиДокументооборота = Истина Тогда
			
			НаборЗаписей = РегистрыСведений.ЭКОМ_ЦепочкиДокументовЭТРН.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Накладная.Установить(Источник.Ссылка);
			
			//Выполним блокировку данных
			ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, "ЭКОМ_ЦепочкиДокументовЭТРН");
			
			НаборЗаписей.Прочитать();
			
			СчетФактура = Неопределено;
			Выполнить(КодСчетФактуры);
			
			// Если существует документ в регистре 
			Для Каждого НоваяЗапись Из НаборЗаписей Цикл
				НоваяЗапись.Перевозчик             = Источник[ИмяПеревозчика];
				НоваяЗапись.СчетФактура            = СчетФактура;
				НоваяЗапись.Заказ                  = Источник[ИмяЗаказа1С];
				НоваяЗапись.КоличествоГрузовыхМест = Источник.Товары.Итог("Количество");
				НоваяЗапись.Организация = Источник[ИмяОрганизации];
				НоваяЗапись.Контрагент  = Источник[ИмяКонтрагента];
				НоваяЗапись.ДатаЭТРН    = Источник[ДатаЭТРН];
				НоваяЗапись.НомерЭТРН   = Источник[НомерЭТРН];		
			КонецЦикла;	
			
			// Записываем документ в первый раз
			Если НаборЗаписей.Количество() = 0 Тогда
				
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Накладная   = Источник.Ссылка;
				
				НоваяЗапись.Организация = Источник[ИмяОрганизации];
				НоваяЗапись.Контрагент  = Источник[ИмяКонтрагента];
				НоваяЗапись.ДатаЭТРН    = Источник[ДатаЭТРН];
				НоваяЗапись.НомерЭТРН   = Источник[НомерЭТРН];					
				НоваяЗапись.СчетФактура            = СчетФактура;
				НоваяЗапись.Заказ                  = Источник[ИмяЗаказа1С];
				НоваяЗапись.Перевозчик             = Источник[ИмяПеревозчика];
				НоваяЗапись.КоличествоГрузовыхМест = Источник.Товары.Итог("Количество");
			КонецЕсли;
			
			НаборЗаписей.Записать();		
			
			НаборЗаписейТИ = РегистрыСведений.ЭКОМ_ТранспортнаяИнформация.СоздатьНаборЗаписей();
			НаборЗаписейТИ.Отбор.Документ.Установить(Источник.Ссылка);
			
			// Выполним блокировку данных
			ВыполнитьБлокировкуНабораЗаписей(НаборЗаписейТИ.Отбор, "ЭКОМ_ТранспортнаяИнформация");
			
			НаборЗаписейТИ.Прочитать();
			
			Данные = Новый Структура;
			Данные.Вставить("Перевозчик", Источник[ИмяПеревозчика]);
			
			// Транспортная информация для УТ 11
			//Если ЗначениеЗаполнено(Источник.Водитель) Тогда
			
			//ДлинаСтроки = СтрДлина(Источник.Водитель);
			//ПервыйСимволПробела = Найти(Источник.Водитель, " ");
			
			//ИмяОтчество = Сред(Источник.Водитель, ПервыйСимволПробела + 1, ДлинаСтроки-ПервыйСимволПробела);
			//ВторойСимволПробела = Найти(ИмяОтчество, " ");
			
			//ВодительФамилия  = Лев(Источник.Водитель, ПервыйСимволПробела-1);
			//ВодительИмя      = Лев(ИмяОтчество, ВторойСимволПробела-1);
			//ВодительОтчество = Прав(ИмяОтчество, ДлинаСтроки - ВторойСимволПробела - ПервыйСимволПробела);
			
			//Иначе
			
			//ВодительФамилия  = "";
			//ВодительИмя      = "";
			//ВодительОтчество = "";
			
			//КонецЕсли;
			
			//Данные.Вставить("Марка"                    , Источник.МаркаАвтомобиля);
			//Данные.Вставить("Номер"                    , Источник.РегистрационныйЗнакАвтомобиля);
			//Данные.Вставить("ВодительФамилия"          , ВодительФамилия);
			//Данные.Вставить("ВодительИмя"              , ВодительИмя);
			//Данные.Вставить("ВодительОтчество"         , ВодительОтчество);
			//Данные.Вставить("ВодительскоеУдостоверение", Источник.ВодительскоеУдостоверение);
			
			// Если существует документ в регистре 
			Для Каждого НоваяЗапись Из НаборЗаписейТИ Цикл
				
				Для каждого Эл Из Данные Цикл
					Если ЗначениеЗаполнено(Эл.Значение) Тогда
						НоваяЗапись[Эл.Ключ] = Эл.Значение;		 
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;	
			
			// Записываем документ в первый раз
			Если НаборЗаписейТИ.Количество() = 0 Тогда
				
				НоваяЗапись = НаборЗаписейТИ.Добавить();
				НоваяЗапись.Документ   = Источник.Ссылка;
				
				Для каждого Эл Из Данные Цикл
					Если ЗначениеЗаполнено(Эл.Значение) Тогда
						НоваяЗапись[Эл.Ключ] = Эл.Значение;		 
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
			НаборЗаписейТИ.Записать();	
			
		КонецЕсли;
		
	КонецЕсли;         
	
	// Получатель - входящий 1С документ WHGOU_04_Входящий
	Если  ТипЗнч(Источник.Ссылка) = Тип(ТипДокументаПоступления) Тогда
		
		НаборЗаписей = РегистрыСведений.ЭКОМ_ЦепочкиДокументовЭТРН.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Накладная.Установить(Источник.Ссылка);
		
		//Выполним блокировку данных
		ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, "ЭКОМ_ЦепочкиДокументовЭТРН");
		
		НаборЗаписей.Прочитать();
		
		// Если существует документ в регистре 
		Для Каждого НоваяЗапись Из НаборЗаписей Цикл				
			НоваяЗапись.КоличествоГрузовыхМест = Источник.Товары.Итог("Количество");
		КонецЦикла;	
		
		НаборЗаписей.Записать();		
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПримерШаблоновСеть(Источник, Тип_ДокументЭКОМ, Тип_Заказ, Тип_Накладная, Тип_Возврат, Тип_СЧФ)
	                                          
	// БП 3.0
	ИмяОрганизации   = "Организация";
	ИмяКонтрагента   = "Контрагент";
	ИмяТочкиДоставки = "ДоговорКонтрагента";
	ИмяЗаказа1С      = "СчетНаОплатуПоставщика";
	ИмяДатаПоставки  = "Дата";
	ДатаЗаказа1С     = "Дата";
	НомерЗаказа1С    = "Номер";
	ДокументОснованиеСЧФ = "ДокументОснование";
	
	//УТ 10.3
	//ИмяОрганизации		 = "Организация";       
	//ИмяКонтрагента		 = "Контрагент";
	//ИмяТочкиДоставки	 = "Склад";
	//ИмяЗаказа1С	         = "Сделка";
	//НомерЗаказа1С        = "Номер";
	//ДатаЗаказа1С         = "Дата";
	//ДокументОснованиеСЧФ = "ДокументОснование";
	//ИмяДатаПоставки      = "Дата";
	
	//УТ 11.4
	//ИмяОрганизации   = "Организация";
	//ИмяКонтрагента   = "Контрагент";
	//ИмяТочкиДоставки = "Склад";
	//ИмяЗаказа1С      = "ЗаказПоставщику";
	//ИмяДатаПоставки  = "ЖелаемаяДатаПоступления";
	//ДатаЗаказа1С     = "ДатаПоДаннымКлиента";
	//НомерЗаказа1С    = "НомерПоДаннымКлиента";
	
	//Заказ поставщику
	Если Тип_Заказ.СодержитТип(ТипЗнч(Источник.Ссылка)) Тогда
		
		НаборЗаписей = РегистрыСведений.ЭКОМ_ЦепочкиДокументовПокупателя.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ORDERDATE.Установить(Источник[ДатаЗаказа1С]);
		НаборЗаписей.Отбор.Организация.Установить(Источник[ИмяОрганизации]);
		НаборЗаписей.Отбор.Контрагент.Установить(Источник[ИмяКонтрагента]);
		НаборЗаписей.Отбор.ТочкаДоставки.Установить(Источник[ИмяТочкиДоставки]);
		НаборЗаписей.Отбор.ORDERNUMBER.Установить(Источник[НомерЗаказа1С]);
		НаборЗаписей.Отбор.Заказ.Установить(Источник.Ссылка);
		
		//Выполним блокировку данных
		ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, "ЭКОМ_ЦепочкиДокументовПокупателя");
		
		НаборЗаписей.Прочитать();
		
		// Если существует документ в регистре
		Для Каждого НоваяЗапись Из НаборЗаписей Цикл
			НоваяЗапись.ДатаПоставки    = Источник[ИмяДатаПоставки];
			НоваяЗапись.КоличествоЗаказ = Источник.Товары.Итог("Количество");
			НоваяЗапись.СуммаЗаказ      = Источник.Товары.Итог("Сумма");
		КонецЦикла;	
		
		// Записываем документ в первый раз
		Если НаборЗаписей.Количество() = 0 Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			
			НоваяЗапись.ORDERDATE     = Источник[ДатаЗаказа1С];
			НоваяЗапись.Организация   = Источник[ИмяОрганизации];
			НоваяЗапись.Контрагент    = Источник[ИмяКонтрагента];
			НоваяЗапись.ТочкаДоставки = Источник[ИмяТочкиДоставки];
			НоваяЗапись.ORDERNUMBER   = Источник[НомерЗаказа1С];
			НоваяЗапись.Заказ         = Источник.Ссылка;
			
			НоваяЗапись.ДатаПоставки = Источник[ИмяДатаПоставки];
			НоваяЗапись.КоличествоЗаказ = Источник.Товары.Итог("Количество");
			НоваяЗапись.СуммаЗаказ      = Источник.Товары.Итог("Сумма");
		КонецЕсли;
		
		НаборЗаписей.Записать();	
		
	КонецЕсли;	
		
	//Поступления товаров и услуг или корректировка
	Если Тип_Накладная.СодержитТип(ТипЗнч(Источник.Ссылка)) Тогда
		
		Заказ1С = Источник[ИмяЗаказа1С];
		
		НаборЗаписей = РегистрыСведений.ЭКОМ_ЦепочкиДокументовПокупателя.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ORDERDATE.Установить(Заказ1С[ДатаЗаказа1С]);
		НаборЗаписей.Отбор.Организация.Установить(Источник[ИмяОрганизации]);
		НаборЗаписей.Отбор.Контрагент.Установить(Источник[ИмяКонтрагента]);
		НаборЗаписей.Отбор.ТочкаДоставки.Установить(Источник[ИмяТочкиДоставки]);
		НаборЗаписей.Отбор.ORDERNUMBER.Установить(Заказ1С[НомерЗаказа1С]);
		НаборЗаписей.Отбор.Заказ.Установить(Заказ1С);
		
		//Выполним блокировку данных
		ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, "ЭКОМ_ЦепочкиДокументовПокупателя");
		
		НаборЗаписей.Прочитать();
		
		// Если существует запись в регистре
		Для Каждого НоваяЗапись Из НаборЗаписей Цикл
			
			НоваяЗапись.Накладная           = Источник.Ссылка;
			НоваяЗапись.КоличествоНакладная = Источник.Товары.Итог("Количество");
			НоваяЗапись.СуммаНакладная      = Источник.Товары.Итог("Сумма"); 
			НоваяЗапись.СуммаНДСНакладная   = Источник.Товары.Итог("СуммаНДС"); 
			
			НаборЗаписей.Записать();
		КонецЦикла;	
		
		// Запись не найдена в цепочке
		Если НаборЗаписей.Количество() = 0 Тогда
			// Сообщать только для тестирования 
			//Сообщить("Не найден документ Заказ покупателя или не все измерения заполнены для регистра сведений ""ЭКОМ_ЦепочкиДокументовПоставщика""", СтатусСообщения.ОченьВажное);			
		КонецЕсли;		
		
	КонецЕсли;
	
	//СчетФактураПолученный
	Если Тип_СЧФ.СодержитТип(ТипЗнч(Источник.Ссылка)) Тогда
		
		ДокументОснование = Источник[ДокументОснованиеСЧФ];
		
		Если Тип_Накладная.СодержитТип(ТипЗнч(ДокументОснование)) Тогда
			
			ПТУ     = ДокументОснование;
			Заказ1С = ПТУ[ИмяЗаказа1С];
			
			НаборЗаписей = РегистрыСведений.ЭКОМ_ЦепочкиДокументовПокупателя.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ORDERDATE.Установить(Заказ1С[ДатаЗаказа1С]);
			НаборЗаписей.Отбор.Организация.Установить(Источник[ИмяОрганизации]);
			НаборЗаписей.Отбор.Контрагент.Установить(Источник[ИмяКонтрагента]);
			НаборЗаписей.Отбор.ТочкаДоставки.Установить(Источник[ИмяТочкиДоставки]);
			НаборЗаписей.Отбор.ORDERNUMBER.Установить(Заказ1С[НомерЗаказа1С]);
			НаборЗаписей.Отбор.Заказ.Установить(Заказ1С);
			НаборЗаписей.Отбор.Накладная.Установить(ПТУ);
			
			//Выполним блокировку данных
			ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, "ЭКОМ_ЦепочкиДокументовПокупателя");
			
			НаборЗаписей.Прочитать();
			
			// Если существует запись в регистре
			Для Каждого НоваяЗапись Из НаборЗаписей Цикл
				
				НоваяЗапись.СЧФ = Источник.Ссылка;
				НоваяЗапись.СуммаСЧФ = Источник.СуммаДокумента;
				
				НаборЗаписей.Записать();
			КонецЦикла;	
			
			// Запись не найдена в цепочке
			Если НаборЗаписей.Количество() = 0 Тогда
				// Сообщать только для тестирования 
				//Сообщить("Не найден документ Поступления товаров и услуг или не все измерения заполнены для регистра сведений ""ЭКОМ_ЦепочкиДокументовПокупателя""", СтатусСообщения.ОченьВажное);			
			КонецЕсли;		
			
		КонецЕсли;
				
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПримерШаблоновПоставщик(Источник, Тип_ДокументЭКОМ, Тип_Заказ, Тип_Накладная, Тип_Накладная_Кор, Тип_Возврат, Тип_СЧФ)
	
	//УТ 11.4
	//ИмяОрганизация	 = "Организация";
	//ИмяКонтрагент		 = "Контрагент";
	//ИмяТочкаДоставки	 = "Грузополучатель";
	//ИмяЗаказа1С    	 = "ЗаказКлиента";
	//НомерЗаказа1С      = "НомерПоДаннымКлиента";
	//ДатаЗаказа1С       = "ДатаПоДаннымКлиента";
	
	//УТ 10.3
	ТипДокументаСЧФ           = "ДокументСсылка.СчетФактураВыданный";
	ТипДокументаКорректировки = "ДокументСсылка.КорректировкаРеализации";
	ТипДокументаРеализации    = "ДокументСсылка.РеализацияТоваровУслуг";
	ТипДокументаПоступления   = "ДокументСсылка.ПоступлениеТоваровУслуг";

	ТабЧастьКоличество = "Количество";
	ТабЧастьСумма      = "Сумма";
	ТабЧастьСуммаНДС   = "СуммаНДС";
	
	НомерИсправления      = "НомерИсправления";
	СуммаДокументаСЧФ     = "СуммаДокумента";	
	ИмяЗаказа1С          = "Сделка";
	ИмяОрганизации		 = "Организация";
	ИмяКонтрагента		 = "Контрагент";
	ИмяТочкиДоставки	 = "Грузополучатель";
	НомерЗаказа1С        = "НомерВходящегоДокументаЭлектронногоОбмена";
	ДатаЗаказа1С         = "ДатаВходящегоДокументаЭлектронногоОбмена";
	ДокументОснованиеСЧФ = "ДокументОснование";
	
	//Заказ покупателя
	Если Тип_Заказ.СодержитТип(ТипЗнч(Источник.Ссылка)) Тогда
					
		НаборЗаписей = РегистрыСведений.ЭКОМ_ЦепочкиДокументовПоставщика.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ORDERDATE.Установить(Источник[ДатаЗаказа1С]);
		НаборЗаписей.Отбор.Организация.Установить(Источник[ИмяОрганизации]);
		НаборЗаписей.Отбор.Контрагент.Установить(Источник[ИмяКонтрагента]);
		НаборЗаписей.Отбор.ТочкаДоставки.Установить(Источник[ИмяТочкиДоставки]);
		НаборЗаписей.Отбор.ORDERNUMBER.Установить(Источник[НомерЗаказа1С]);
		
		//Выполним блокировку данных
		ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, "ЭКОМ_ЦепочкиДокументовПоставщика");
		
		НаборЗаписей.Прочитать();
		
		// Если существует запись в регистре
		Для Каждого НоваяЗапись Из НаборЗаписей Цикл
			
			НоваяЗапись.Организация   = Источник.Организация;
			НоваяЗапись.Контрагент    = Источник.Контрагент;
			НоваяЗапись.ТочкаДоставки = Источник.ТочкаДоставки;
			
			НоваяЗапись.Заказ           = Источник.Ссылка;
			НоваяЗапись.КоличествоЗаказ = Источник.Товары.Итог("Количество");
			НоваяЗапись.СуммаЗаказ      = Источник.Товары.Итог("Сумма");
			
			НаборЗаписей.Записать();
		КонецЦикла;	

		// Запись не найдена в цепочке
		Если НаборЗаписей.Количество() = 0 Тогда
			// Сообщать только для тестирования 
			//Сообщить("Не найден документ ЭКОМ(ORDER) или не все измерения заполнены для регистра сведений ""ЭКОМ_ЦепочкиДокументовПоставщика""", СтатусСообщения.ОченьВажное);			
		КонецЕсли;		
		
	КонецЕсли;	
	
	//Реализация товаров и услуг
	Если Тип_Накладная.СодержитТип(ТипЗнч(Источник.Ссылка)) Тогда
		
		НаборЗаписей = РегистрыСведений.ЭКОМ_ЦепочкиДокументовПоставщика.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Источник[ИмяОрганизации]);
		НаборЗаписей.Отбор.Контрагент.Установить(Источник[ИмяКонтрагента]);
		НаборЗаписей.Отбор.ТочкаДоставки.Установить(Источник[ИмяТочкиДоставки]);
        НаборЗаписей.Отбор.Заказ.Установить(Источник[ИмяЗаказа1С]); 					
		
		//Выполним блокировку данных
		ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, "ЭКОМ_ЦепочкиДокументовПоставщика");
		
		НаборЗаписей.Прочитать();
		
		// Если существует запись в регистре
		Для Каждого НоваяЗапись Из НаборЗаписей Цикл
			
			НоваяЗапись.Организация   = Источник.Организация;
			НоваяЗапись.Контрагент    = Источник.Контрагент;
			НоваяЗапись.ТочкаДоставки = Источник.ТочкаДоставки;
			
			НоваяЗапись.Накладная           = Источник.Ссылка;
			НоваяЗапись.КоличествоНакладная = Источник.Товары.Итог("Количество");
			НоваяЗапись.СуммаНакладная      = Источник.Товары.Итог("Сумма"); 
			НоваяЗапись.СуммаНДСНакладная   = Источник.Товары.Итог("СуммаНДС"); 
			
			НаборЗаписей.Записать();
		КонецЦикла;	

		// Запись не найдена в цепочке
		Если НаборЗаписей.Количество() = 0 Тогда
			// Сообщать только для тестирования 
			//Сообщить("Не найден документ Заказ покупателя или не все измерения заполнены для регистра сведений ""ЭКОМ_ЦепочкиДокументовПоставщика""", СтатусСообщения.ОченьВажное);			
		КонецЕсли;
			
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////
	// Корректировка реализации
	//	
	Если ТипЗнч(Источник.Ссылка) = Тип(ТипДокументаКорректировки) Тогда
		
		НаборЗаписей = РегистрыСведений.ЭКОМ_ЦепочкиДокументовПоставщика.СоздатьНаборЗаписей();
		ЗаказКлиента = Неопределено;
		РТУ = ПолучитьИсправляемыйДокументРеализации(Источник,,"ДокументРеализации");
		Организация   = Неопределено;
		Контрагент    = Неопределено;	
		ТочкаДоставки = Неопределено; 
		Если ЗначениеЗаполнено(РТУ) Тогда
			Организация   = РТУ[ИмяОрганизации];
			Контрагент    = РТУ[ИмяКонтрагента];	
			ТочкаДоставки = РТУ[ИмяТочкиДоставки];
			ЗаказКлиента  = РТУ[ИмяЗаказа1С];
		КонецЕсли;
		
		ORDERDATE = Дата(0001, 01, 01);
		ORDERNUMBER = "";		
		Если ЗначениеЗаполнено(ЗаказКлиента) Тогда
			ORDERDATE   = ЗаказКлиента[ДатаЗаказа1С];
			ORDERNUMBER = ЗаказКлиента[НомерЗаказа1С];
		КонецЕсли;
		
		ДанныеОтбораЗаполнены = Ложь;
		СтруктураОтборов = Новый Структура;
		СтруктураОтборов.Вставить("ORDERDATE"    , ORDERDATE);
		СтруктураОтборов.Вставить("ORDERNUMBER"  , ORDERNUMBER);
		СтруктураОтборов.Вставить("Заказ"        , ЗаказКлиента);
		СтруктураОтборов.Вставить("Организация"  , Организация);
		СтруктураОтборов.Вставить("Контрагент"   , Контрагент);
		СтруктураОтборов.Вставить("ТочкаДоставки", ТочкаДоставки);
		СтруктураОтборов.Вставить("Накладная"    , РТУ);
		Для каждого Данные Из СтруктураОтборов Цикл
			Если ЗначениеЗаполнено(Данные.Значение) Тогда
				НаборЗаписей.Отбор[Данные.Ключ].Установить(Данные.Значение);
				ДанныеОтбораЗаполнены = Истина;
			КонецЕсли;
		КонецЦикла;     
		
		
		Если ДанныеОтбораЗаполнены = Истина Тогда
			
			//Выполним блокировку данных
			ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, "ЭКОМ_ЦепочкиДокументовПоставщика");
			
			НаборЗаписей.Прочитать();
			
			// Если существует запись в регистре
			Для Каждого НоваяЗапись Из НаборЗаписей Цикл
						
				ПерезаписатьНаНовуюКорректировку = НЕ Источник.Ссылка = НоваяЗапись.Накладная_Кор;
				ЭтоНоваяКорректировка            = НЕ ЗначениеЗаполнено(НоваяЗапись.Накладная_Кор);
 
				Если ПерезаписатьНаНовуюКорректировку
					ИЛИ ЭтоНоваяКорректировка Тогда 
									
					// Если это создание новой корректировки, перезапишем ссылку и сбросим статусы 
					НоваяЗапись.Накладная_Кор           = Источник.Ссылка;
					НоваяЗапись.КоличествоНакладная_Кор = Источник.Товары.Итог(ТабЧастьКоличество);
					НоваяЗапись.СуммаНакладная_Кор      = Источник.Товары.Итог(ТабЧастьСумма); 
					НоваяЗапись.СуммаНДСНакладная_Кор   = Источник.Товары.Итог(ТабЧастьСуммаНДС);
							
					НаборЗаписей.Записать();
					
				ИначеЕсли Источник.Ссылка = НоваяЗапись.Накладная_Кор Тогда
					// Если это перезапись уже существующей корректировки, обновим только количество и сумму
					НоваяЗапись.КоличествоНакладная_Кор = Источник.Товары.Итог(ТабЧастьКоличество);
					НоваяЗапись.СуммаНакладная_Кор      = Источник.Товары.Итог(ТабЧастьСумма); 
					НоваяЗапись.СуммаНДСНакладная_Кор   = Источник.Товары.Итог(ТабЧастьСуммаНДС);
	
					НаборЗаписей.Записать();
					
				КонецЕсли;
				
			КонецЦикла;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////
	// СчетФактураВыданный
	//	
	Если ТипЗнч(Источник.Ссылка) = Тип(ТипДокументаСЧФ) Тогда
		
		НаборЗаписей = РегистрыСведений.ЭКОМ_ЦепочкиДокументовПоставщика.СоздатьНаборЗаписей();
		коррРТУ      = Неопределено; 
		РТУ          = Неопределено;
		ЗаказКлиента = Неопределено;
		ДокументОснование = Источник[ДокументОснованиеСЧФ];
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
			РТУ = ДокументОснование;
			ЭтоСЧФ_Корр = Ложь;
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			коррРТУ = ДокументОснование;
			РТУ     = ПолучитьИсправляемыйДокументРеализации(коррРТУ,,"ДокументРеализации");
			ЭтоСЧФ_Корр = Истина;
		КонецЕсли;
		
		ORDERDATE = Дата(0001, 01, 01);
		ORDERNUMBER = "";		
		Если ЗначениеЗаполнено(ЗаказКлиента) Тогда
			ORDERDATE   = ЗаказКлиента[ДатаЗаказа1С];
			ORDERNUMBER = ЗаказКлиента[НомерЗаказа1С];		
		КонецЕсли;
		
		Организация   = Неопределено;
		Контрагент    = Неопределено;	
		ТочкаДоставки = Неопределено; 
		Если ЗначениеЗаполнено(РТУ) Тогда
			Организация   = РТУ[ИмяОрганизации];
			Контрагент    = РТУ[ИмяКонтрагента];	
			ТочкаДоставки = РТУ[ИмяТочкиДоставки];
			ЗаказКлиента  = РТУ[ИмяЗаказа1С];
		КонецЕсли;
		
		ДанныеОтбораЗаполнены = Ложь;
		СтруктураОтборов = Новый Структура;
		СтруктураОтборов.Вставить("ORDERDATE"    , ORDERDATE);
		СтруктураОтборов.Вставить("ORDERNUMBER"  , ORDERNUMBER);
		СтруктураОтборов.Вставить("Заказ"        , ЗаказКлиента);
		СтруктураОтборов.Вставить("Организация"  , Организация);
		СтруктураОтборов.Вставить("Контрагент"   , Контрагент);
		СтруктураОтборов.Вставить("ТочкаДоставки", ТочкаДоставки);
		СтруктураОтборов.Вставить("Накладная"    , РТУ);
		СтруктураОтборов.Вставить("Накладная_Кор", коррРТУ);
		Для каждого Данные Из СтруктураОтборов Цикл
			Если ЗначениеЗаполнено(Данные.Значение) Тогда
				НаборЗаписей.Отбор[Данные.Ключ].Установить(Данные.Значение);
				ДанныеОтбораЗаполнены = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ДанныеОтбораЗаполнены = Истина Тогда
			
			//Выполним блокировку данных
			ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, "ЭКОМ_ЦепочкиДокументовПоставщика");
			
			НаборЗаписей.Прочитать();
			
			// Если существует запись в регистре
			Для Каждого НоваяЗапись Из НаборЗаписей Цикл
				
				Если ЭтоСЧФ_Корр Тогда
					ПерезаписатьНаНовуюСЧФ_Корр = НЕ Источник.Ссылка = НоваяЗапись.СЧФ_Кор;
					ЭтоНоваяСЧФ_Корр            = НЕ ЗначениеЗаполнено(НоваяЗапись.СЧФ_Кор);
					
					Если ПерезаписатьНаНовуюСЧФ_Корр
						ИЛИ ЭтоНоваяСЧФ_Корр Тогда 
						
						// Если это создание новой СЧФ корр, перезапишем ссылку и сбросим статусы 
						НоваяЗапись.СЧФ_Кор          = Источник.Ссылка;
						НоваяЗапись.СуммаСЧФ_Кор     = Источник[СуммаДокументаСЧФ];
						НоваяЗапись.НомерИсправления = Источник[НомерИсправления];				
						
						Если ПерезаписатьНаНовуюСЧФ_Корр Тогда
							
							НоваяЗапись.СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ПустаяСсылка();
														
						КонецЕсли;
						
						НаборЗаписей.Записать();
						
					ИначеЕсли Источник.Ссылка = НоваяЗапись.СЧФ_Кор Тогда
						// Если это перезапись уже существующей СЧФ корр, обновим 
						НоваяЗапись.СуммаСЧФ_Кор     = Источник[СуммаДокументаСЧФ];
						НоваяЗапись.НомерИсправления = Источник[НомерИсправления];	
						
						НаборЗаписей.Записать();
						
					КонецЕсли;
					
				Иначе
					ПерезаписатьНаНовуюСЧФ = НЕ Источник.Ссылка = НоваяЗапись.СЧФ;
					ЭтоНоваяСЧФ            = НЕ ЗначениеЗаполнено(НоваяЗапись.СЧФ);
					
					Если ПерезаписатьНаНовуюСЧФ
						ИЛИ ЭтоНоваяСЧФ Тогда 
						
						// Если это создание новой СЧФ, перезапишем ссылку и сбросим статусы 
						НоваяЗапись.СЧФ      = Источник.Ссылка;
						НоваяЗапись.СуммаСЧФ = Источник[СуммаДокументаСЧФ];			    
						
						Если ПерезаписатьНаНовуюСЧФ Тогда
							
							НоваяЗапись.СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ПустаяСсылка();
							
						КонецЕсли;
						
						НаборЗаписей.Записать();
						
					ИначеЕсли Источник.Ссылка = НоваяЗапись.СЧФ Тогда
						// Если это перезапись уже существующей СЧФ, обновим 
						НоваяЗапись.СуммаСЧФ = Источник[СуммаДокументаСЧФ];
						
						НаборЗаписей.Записать();
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры