////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СписокЗначенийОбластьПолномочий  = ЗаполнитьСписокЗначенийОбластьПолномочий();
	Элементы.ОбластьПолномочий.СписокВыбора.Очистить();
	Для каждого Эл Из СписокЗначенийОбластьПолномочий Цикл
		Элементы.ОбластьПолномочий.СписокВыбора.Добавить(Эл.Значение, Эл.Представление);
	КонецЦикла;
	
	СписокЗначенийСтатус  = ЗаполнитьСписокЗначенийСтатус();
	Элементы.СтатусПодписанта.СписокВыбора.Очистить();
	Для каждого Эл Из СписокЗначенийСтатус Цикл
		Элементы.СтатусПодписанта.СписокВыбора.Добавить(Эл.Значение, Эл.Представление);
	КонецЦикла;
	
	СписокЗначенийАлгоритмПодписи  = ЗаполнитьАлгоритмПодписи();
	Элементы.АлгоритмПодписи.СписокВыбора.Очистить();
	Для каждого Эл Из СписокЗначенийАлгоритмПодписи Цикл
		Элементы.АлгоритмПодписи.СписокВыбора.Добавить(Эл.Значение, Эл.Представление);
	КонецЦикла;
	
	Если Параметры.Ключ.Пустая() Тогда
	     Объект.ОснованиеПолномочий = "Должностные обязанности";
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОтпечатокСертификатаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АлгоритмПодписи"           , Объект.АлгоритмПодписи);
	ПараметрыФормы.Вставить("СертификатНаСервере"       , Объект.СертификатНаСервере);
	ПараметрыФормы.Вставить("УстановленВЛичномХранилище", Объект.УстановленВЛичномХранилище);
	
	Оповещение = Новый ОписаниеОповещения("ПодписиУПДСертификатОбработкаВыбора", ЭтаФорма); 
	ОткрытьФорму("Справочник.ЭКОМ_Сертификаты.Форма.УФ_ФормаВсеСертификаты", ПараметрыФормы, , , , , Оповещение); 

КонецПроцедуры

#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ЗаполнитьСписокЗначенийОбластьПолномочий()
	
	СписокЗначенийОбластьПолномочий = Новый СписокЗначений;
	СписокЗначенийОбластьПолномочий.Добавить("0", "0 - лицо, ответственное за подписание счетов-фактур");
	СписокЗначенийОбластьПолномочий.Добавить("1", "1 - лицо, совершившее сделку, операцию");
	СписокЗначенийОбластьПолномочий.Добавить("2", "2 - лицо, совершившее сделку, операцию и ответственное за ее оформление");
	СписокЗначенийОбластьПолномочий.Добавить("3", "3 - лицо, ответственное за оформление свершившегося события");
	СписокЗначенийОбластьПолномочий.Добавить("4", "4 - лицо, совершившее сделку, операцию и ответственное за подписание счетов-фактур");
	СписокЗначенийОбластьПолномочий.Добавить("5", "5 - лицо, совершившее сделку, операцию и ответственное за ее оформление и за подписание счетов-фактур");
	СписокЗначенийОбластьПолномочий.Добавить("6", "6 - лицо, ответственное за оформление свершившегося события и за подписание счетов-фактур");
	
	Возврат СписокЗначенийОбластьПолномочий;
	
КонецФункции

&НаКлиенте
Функция ЗаполнитьСписокЗначенийСтатус()
	
	СписокЗначенийСтатус = Новый СписокЗначений;
	СписокЗначенийСтатус.Добавить("1", "1 - работник организации продавца товаров (работ, услуг, имущественных прав");
	СписокЗначенийСтатус.Добавить("2", "2 - работник организации - составителя информации продавца");
	СписокЗначенийСтатус.Добавить("3", "3 - работник иной уполномоченной организации");
	СписокЗначенийСтатус.Добавить("4", "4 - уполномоченное физическое лицо (в том числе индивидуальный предприниматель)");
    СписокЗначенийСтатус.Добавить("5", "5 - работник организации — покупателя");
	СписокЗначенийСтатус.Добавить("6", "6 - работник организации — составителя файла обмена информации покупателя, если составитель файла обмена информации покупателя не является покупателем");

	Возврат СписокЗначенийСтатус;

КонецФункции

&НаКлиенте
Функция ЗаполнитьАлгоритмПодписи()
	
	СписокЗначенийАлгоритмПодписи = Новый СписокЗначений;
	// MOD-1789
	//СписокЗначенийАлгоритмПодписи.Добавить("ГОСТ Р 34.10-2001"        , "ГОСТ Р 34.10-2001");
	//СписокЗначенийАлгоритмПодписи.Добавить("ГОСТ Р 34.10-2012 256 бит", "ГОСТ Р 34.10-2012 256 бит");
	//СписокЗначенийАлгоритмПодписи.Добавить("ГОСТ Р 34.10-2012 512 бит", "ГОСТ Р 34.10-2012 512 бит");
	//СписокЗначенийАлгоритмПодписи.Добавить("ГОСТ Р 34.10-2001 ViPNet CSP"     , "ГОСТ Р 34.10-2001 ViPNet CSP");
	//СписокЗначенийАлгоритмПодписи.Добавить("ГОСТ Р 34.10-2012/512 ViPNet CSP" , "ГОСТ Р 34.10-2012/512 ViPNet CSP");
	//СписокЗначенийАлгоритмПодписи.Добавить("ГОСТ Р 34.10-2012/1024 ViPNet CSP", "ГОСТ Р 34.10-2012/1024 ViPNet CSP");
	//
	//СписокЗначенийАлгоритмПодписи.Добавить("GOST R 34.10-2012 256 bit", "ГОСТ Р 34.10-2012 256 бит");
	//СписокЗначенийАлгоритмПодписи.Добавить("GOST R 34.10-2012 512 bit", "ГОСТ Р 34.10-2012 512 бит");
	
	СписокЗначенийАлгоритмПодписи.Добавить("ГОСТ Р 34.10-2001");
	СписокЗначенийАлгоритмПодписи.Добавить("ГОСТ Р 34.10-2012 256 бит");
	СписокЗначенийАлгоритмПодписи.Добавить("ГОСТ Р 34.10-2012 512 бит");
	
	СписокЗначенийАлгоритмПодписи.Добавить("ГОСТ Р 34.10-2012/256"); //в некоторых сертах пишется от так
	СписокЗначенийАлгоритмПодписи.Добавить("ГОСТ Р 34.10-2012/512");
	
	СписокЗначенийАлгоритмПодписи.Добавить("ГОСТ Р 34.10-2001 ViPNet CSP");
    СписокЗначенийАлгоритмПодписи.Добавить("ГОСТ Р 34.10-2012/512 ViPNet CSP");
    СписокЗначенийАлгоритмПодписи.Добавить("ГОСТ Р 34.10-2012/1024 ViPNet CSP");

	СписокЗначенийАлгоритмПодписи.Добавить("GOST R 34.10-2001");
	СписокЗначенийАлгоритмПодписи.Добавить("GOST R 34.10-2012 256 бит");
	СписокЗначенийАлгоритмПодписи.Добавить("GOST R 34.10-2012 512 бит");
	
	СписокЗначенийАлгоритмПодписи.Добавить("GOST R 34.10-2012/256"); //в некоторых сертах пишется от так
	СписокЗначенийАлгоритмПодписи.Добавить("GOST R 34.10-2012/512");
	
	СписокЗначенийАлгоритмПодписи.Добавить("GOST R 34.10-2001 ViPNet CSP");
    СписокЗначенийАлгоритмПодписи.Добавить("GOST R 34.10-2012/512 ViPNet CSP");
    СписокЗначенийАлгоритмПодписи.Добавить("GOST R 34.10-2012/1024 ViPNet CSP");
	
	СписокЗначенийАлгоритмПодписи.Добавить("GOST R 34.10-2012 256 bit");
 	СписокЗначенийАлгоритмПодписи.Добавить("GOST R 34.10-2012 512 bit");
	
	Возврат СписокЗначенийАлгоритмПодписи;

КонецФункции

&НаСервере
Процедура ОбработатьДанныеСертификата(Результат)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ИНН = &ИНН";
	
	Запрос.УстановитьПараметр("ИНН", Прав(Результат.ИНН, 12));
	РезультатЗапроса = Запрос.Выполнить();	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Объект.Организация = Выборка.Ссылка; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписиУПДСертификатОбработкаВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
	    Возврат;
	КонецЕсли;

	Объект.ДолжностьПодписанта  = Результат.ДолжностьПодписанта;
	Объект.ФамилияПодписанта    = Результат.ФамилияПодписанта;
	Объект.ИмяПодписанта        = Результат.ИмяПодписанта;
	Объект.ОтчествоПодписанта   = Результат.ОтчествоПодписанта;
	Объект.ОтпечатокСертификата = Результат.ОтпечатокСертификата;
	Объект.ИмяСертификата       = Результат.ИмяСертификата;	
	Объект.Наименование         = Результат.ИмяСертификата;
	Объект.АлгоритмПодписи      = Результат.АлгоритмПодписи;
	Объект.СертификатНаСервере        = Результат.СертификатНаСервере;
    Объект.УстановленВЛичномХранилище = Результат.УстановленВЛичномХранилище;
	
	ОбработатьДанныеСертификата(Результат);

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСертификат(Команда)
    Записать();
    МассивЛогаСобытий = Новый Массив;
    Если Объект.СертификатНаСервере Тогда
		СертификатПроверен = ЭКОМ_ОбщегоНазначения.ПроверитьСертификат(Объект.Ссылка, МассивЛогаСобытий);
	Иначе	
		СертификатПроверен = ЭКОМ_ОбщегоНазначенияКлиент.ПроверитьСертификат(Объект.Ссылка, МассивЛогаСобытий);
    КонецЕсли;
	
	Если МассивЛогаСобытий.Количество() > 0 Тогда
		ЭтаФорма.ТекстСообщения = ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий);
	КонецЕсли;
	
	СообщениеНаФорме = ?(СертификатПроверен = Истина, "Проверка успешно выполнена", "Ошибка проверки. Подробности в нижней части этой формы - строка События");
    Элементы.ТекстСообщения.ЦветТекста = ?(ПустаяСтрока(ТекстСообщения), WebЦвета.Черный, WebЦвета.Кирпичный);

    ПоказатьПредупреждение(Новый ОписаниеОповещения, СообщениеНаФорме, , "Проверка подписи этим сертификатом для этой организации");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ВсеАлгоритмыПодписей = ЭКОМ_ОбщегоНазначения.ВсеАлгоритмыПодписей();
    СписокВыбораАлгоритма = Элементы.АлгоритмПодписи.СписокВыбора;
    СписокВыбораАлгоритма.Очистить();
    СписокВыбораАлгоритма.ЗагрузитьЗначения(ВсеАлгоритмыПодписей);

КонецПроцедуры

&НаКлиенте
Процедура ТекстСообщенияНажатие(Элемент, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
    ПоказатьПредупреждение(Новый ОписаниеОповещения, ЭтаФорма.ТекстСообщения, , "События и ошибки");
КонецПроцедуры

#КонецОбласти



