&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект 	  = РеквизитФормыВЗначение("Объект");
    ПолноеИмяОбработки	  = ОбработкаОбъект.Метаданные().ПолноеИмя();

	ЭтаФорма.ДатаНачала = НачалоМесяца(ТекущаяДата());
	ЭтаФорма.ДатаКонец  = ТекущаяДата();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновкуДанных(СхемаКомпоновкиДанных)
	
	URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	
	ОтборНаФорме.Инициализировать(ИсточникНастроек);
	ОтборНаФорме.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
					
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ТекущиеДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	ОбновитьТЧ(ТекущиеДанныеСписка.ИмяСписка, ТекущиеДанныеСписка.ТипОбмена, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте()

	ИмяСписка = "";		
	ТипОбмена = "";

	ТекущаяСтраницаИмя = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;	
	Если ТекущаяСтраницаИмя = "ГруппаПоставщик" Тогда		
		ИмяСписка = "ТаблицаКвитанцийПоставщик";		
		ТипОбмена = "Поставщик";
		
	ИначеЕсли ТекущаяСтраницаИмя = "ГруппаПокупатель" Тогда				
		ИмяСписка = "ТаблицаКвитанцийСеть";	
		ТипОбмена = "Сеть";
		
	Иначе 		
		ИмяСписка = "ТаблицаОшибочныеКвитанции";
		ТипОбмена = "";

	КонецЕсли;

	ТекущиеДанныеСписка = Новый Структура;
	ТекущиеДанныеСписка.Вставить("ИмяСписка", ИмяСписка);
	ТекущиеДанныеСписка.Вставить("ТипОбмена", ТипОбмена);

	Возврат ТекущиеДанныеСписка;
	
КонецФункции


&НаСервере
Процедура ОбновитьТЧ(ИмяТЗ, ТипОбмена, КомпоновщикНастроек)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТекстЗапроса    = ОбработкаОбъект.ПолучитьТекстЗапросаСинхронизации(ТипОбмена);			
	СхемаКомпоновкиДанных = СозданиеСКД(ТекстЗапроса, ТипОбмена);

	Если КомпоновщикНастроек = Неопределено Тогда
	     ИнициализироватьКомпоновкуДанных(СхемаКомпоновкиДанных);
	КонецЕсли;
	 
	ЭтаФорма[ИмяТЗ].Очистить();

	НастройкиКомпоновщика = ОтборНаФорме.Настройки;
	Если НЕ НастройкиКомпоновщика.ПараметрыДанных.ДоступныеПараметры.Элементы.Количество() = 0 Тогда
		НастройкиКомпоновщика.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНач", НачалоДня(ЭтаФорма.ДатаНачала));
		НастройкиКомпоновщика.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаКон", КонецДня(ЭтаФорма.ДатаКонец));
	КонецЕсли;
			
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновщика,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТЗ = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТЗ);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ЭтаФорма[ИмяТЗ].Загрузить(ТЗ);	
		
КонецПроцедуры

&НаКлиенте
Функция ОбновитьСтатусСтрокиТаблицы(ПрофильОбмена, ПолныйИдентификатор, Тип, МассивЛогаСобытий)
	
	ПервыйЭлементНач = Найти(ПолныйИдентификатор, "_");
	ВторойЭлементНач = Найти(Сред(ПолныйИдентификатор, ПервыйЭлементНач + 1), "_");
		
	СтатсусОК = "Неопределен";
	Идентификатор = Прав(ПолныйИдентификатор, 36);
	ТекстОшибки = "";
	ЛогСобытий  = "";
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		ДанныеОбОшибке = ПолучитьСтруктуруОшибки();
		Данные = ИзвлечьИнформациюОДокументеНаСервере(Идентификатор, Тип, ДанныеОбОшибке, ПрофильОбмена, МассивЛогаСобытий);
		Если ДанныеОбОшибке.ЕстьОшибка Тогда
			ТекстОшибки = Тип + " - " + ДанныеОбОшибке.ТекстОшибки;
		Иначе
			СтатсусОК  = "ОК";
			ЛогСобытий = Тип + " - ОК";
		КонецЕсли;
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("СтатсусОК"  , СтатсусОК);
	Структура.Вставить("ТекстОшибки", ТекстОшибки);
	Структура.Вставить("ЛогСобытий" , ЛогСобытий);
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСтатусы()
	
	ТекущиеДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	
	МассивЛогаСобытий = Новый Массив;
	
	МассивСтатусов = ПолучитьМассивСтатусов(ТекущиеДанныеСписка.ИмяСписка);
	Для каждого Стр Из Элементы[ТекущиеДанныеСписка.ИмяСписка].ВыделенныеСтроки Цикл
		ВыбраннаяСтрока = Элементы[ТекущиеДанныеСписка.ИмяСписка].ДанныеСтроки(Стр);
		ПолучитьСтатусы(ВыбраннаяСтрока, МассивСтатусов, МассивЛогаСобытий);	
	КонецЦикла;
	
	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий);
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСтатусы(ВыбраннаяСтрока, МассивСтатусов, МассивЛогаСобытий)

	Для каждого ЭлИмя Из МассивСтатусов Цикл
		
		Если ЗначениеЗаполнено(ВыбраннаяСтрока[ЭлИмя])
			И НЕ ВыбраннаяСтрока[ЭлИмя] = "Нет данных" Тогда
			
			Структура  = ОбновитьСтатусСтрокиТаблицы(ВыбраннаяСтрока.ПрофильОбмена, ВыбраннаяСтрока[ЭлИмя], ЭлИмя, МассивЛогаСобытий);
			ТексОшибки = СокрЛП(ВыбраннаяСтрока.ТекстОшибки) + ?(ЗначениеЗаполнено(ВыбраннаяСтрока.ТекстОшибки), Символы.ПС, "") + СокрЛП(Структура.ТекстОшибки);
			ЛогСобытий = СокрЛП(ВыбраннаяСтрока.ЛогСобытий) + ?(ЗначениеЗаполнено(ВыбраннаяСтрока.ЛогСобытий), Символы.ПС, "") + СокрЛП(Структура.ЛогСобытий);
			
			ВыбраннаяСтрока["Статус" + ЭлИмя] = Структура.СтатсусОК;
			ВыбраннаяСтрока.ТекстОшибки       = ТексОшибки;
			ВыбраннаяСтрока.ЛогСобытий        = ЛогСобытий;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьМассивСтатусов(ТипОбмена)
	
	Массив = Новый Массив;
	
	Если ТипОбмена = "ТаблицаКвитанцийПоставщик" Тогда
		Массив.Добавить("ПервичныйЮЗД");
		Массив.Добавить("DP_PDPOL_02");
		Массив.Добавить("DP_IZVPOL_04");
		Массив.Добавить("DP_IZVPOL_06");
		Массив.Добавить("DP_UVUTOCH_09");
		Массив.Добавить("DP_IZVPOL_10");
		Массив.Добавить("Подпись");
		
	ИначеЕсли ТипОбмена = "ТаблицаКвитанцийСеть" Тогда
		Массив.Добавить("ПервичныйЮЗД");
		Массив.Добавить("DP_PDOTPR_03");
		Массив.Добавить("DP_IZVPOL_05");
		Массив.Добавить("DP_IZVPOL_06");
		Массив.Добавить("DP_PDOTPR_07");
		Массив.Добавить("DP_IZVPOL_08");
		Массив.Добавить("DP_UVUTOCH_09");
		Массив.Добавить("DP_IZVPOL_10");
		Массив.Добавить("Подпись");
		
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции 

&НаКлиенте
Процедура ПолучитьНеобработанныеСобытияКлиент(Команда)
	
	МассивЛогаСобытий = Новый Массив;
	Ошибка = ПолучитьСтруктуруОшибки();
	ПолучитьНеобработанныеСобытияНаСервере(Ошибка, 0, МассивЛогаСобытий);
	
	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий);
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменКвитанциямиDP_IZVPOL_08(Команда)
	
	ОбменКвитанциями("DP_IZVPOL_08", "Сеть");

КонецПроцедуры

// + Отправка ответной квитанции "Извещение о получении подтверждения даты отправки извещения о получени" // IZVPOL-08
// Параметры:
//	- ИД_Квитанции - Уникальный идентификатор квитанции к которой формируется ответ
//	- ИД_Документа - Уникальный идентификатор документа
//	- Ошибка - Стандартный параметр см. ПолучитьСтруктуруОшибки
// Возвращает файлы подписанной квитанции и подписи в структуре "РезультатПодписи" см. ПолучитьСтруктуруРезультатаПодписания 
&НаКлиенте
Функция ОтправитьКвитанцию(СертификатЭКОМ, ПрофильОбмена, СтруктураСтроки, Тип, Организация, ИД_Квитанции, ИД_Документа, Ошибка, МассивЛогаСобытий) Экспорт 

	ЗначениеПоУмолчанию = Неопределено;
	Измерение           = Неопределено; 
	Обязательно         = Истина;
	ЛокальныйКаталогOUTBOX = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_Локальный_Каталог_OUTBOX", ЗначениеПоУмолчанию, Измерение, Обязательно);
	
	// Проверка каталогов OUTBOX
    Если НЕ Прав(ЛокальныйКаталогOUTBOX,1) = "\" Тогда	
        ЛокальныйКаталогOUTBOX = ЛокальныйКаталогOUTBOX + "\"; 
    КонецЕсли;
	
	ТокенАвторизации = ЭКОМ_ОбщегоНазначения.ПолучитьТокенАвторизации(ПрофильОбмена, Ошибка, МассивЛогаСобытий);	  
	Если Ошибка.ЕстьОшибка Тогда		
		Сообщить("При получении токена(авторизации) возникла ошибка - Код: " + + Ошибка.КодОшибки + " - " + Ошибка.ТекстОшибки);
		Возврат Неопределено;		
	КонецЕсли;
	
	///////////////////////////////
	//Реализация
	
	ДанныеСертификатаЭКОМ = ЭКОМ_ОбщегоНазначения.ПолучитьДанныеСертификатаЭКОМ(СертификатЭКОМ); 
	
	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("identifier"     , ИД_Квитанции);
	ДанныеЗапроса.Вставить("signer_fname"   , ДанныеСертификатаЭКОМ.ФамилияПодписанта);
	ДанныеЗапроса.Вставить("signer_inn"     , ДанныеСертификатаЭКОМ.ИНН);
    ДанныеЗапроса.Вставить("signer_position", ДанныеСертификатаЭКОМ.ДолжностьПодписанта);
    ДанныеЗапроса.Вставить("signer_sname"   , ДанныеСертификатаЭКОМ.ИмяПодписанта);
    ДанныеЗапроса.Вставить("varToken"       , ТокенАвторизации);			
	
    ФайлКвитанции = СформироватьКвитанциюНаСервере(ПрофильОбмена, ДанныеЗапроса, Ошибка, МассивЛогаСобытий);	
	Если Ошибка.ЕстьОшибка Тогда	
		Сообщить("При формировании квитанции возникла ошибка - Код: " + Ошибка.КодОшибки + " - " + Ошибка.ТекстОшибки);
		Возврат Неопределено;	
	КонецЕсли;

	ДанныОФайле = ПолучитьДанныОФайлеНаСервере(ФайлКвитанции); 
	
	ПолноеИмяФайлаXML    = ЛокальныйКаталогOUTBOX + ДанныОФайле.ИмяФайла;
	ФайлКвитанции.Записать(ПолноеИмяФайлаXML);
	ФайлXML = Новый Файл(ПолноеИмяФайлаXML);

	ПолноеИмяФайлаBIN = ЛокальныйКаталогOUTBOX + ФайлXML.ИмяБезРасширения + ".bin";
	
	ДвоичныеДанныеФайлаXML = Новый ДвоичныеДанные(ПолноеИмяФайлаXML);
	
	//Пример. Формирует подпись для файла. Возвращает результат в виде двоичных данных.
	ЛогСобытий = "";
	СформированаПодписьФайла = ЭЦП_СформироватьПодписьФайлаНаКлиенте(ДвоичныеДанныеФайлаXML, ДанныеСертификатаЭКОМ, ЛогСобытий);
	Если СформированаПодписьФайла = Неопределено 
		ИЛИ СформированаПодписьФайла = Ложь Тогда	
		Возврат Неопределено;
		
	КонецЕсли;
	
	ФайлBIN = Новый Файл(ПолноеИмяФайлаBIN);
	Если НЕ ФайлBIN.Существует() Тогда	
		Возврат Неопределено;
		
	КонецЕсли;
	ДвоичныеДанныеПодписи = Новый ДвоичныеДанные(ФайлBIN.ПолноеИмя);
	
	УниверсальныйМетодОтправкиКвитанцийНаСеревере(ДанныеЗапроса.identifier, ФайлКвитанции, ДвоичныеДанныеПодписи, Ошибка);
    Если Ошибка.ЕстьОшибка Тогда	
		Сообщить("При отправке квитанции возникла ошибка - Код: " + Ошибка.КодОшибки + " - " + Ошибка.ТекстОшибки);
		Возврат Неопределено;	
	
	КонецЕсли;

	//Реализация
	///////////////////////////////
	ЗаписатьВРегистрПослеОтправкиНаСервере(СтруктураСтроки, Тип, ДанныОФайле, ДвоичныеДанныеПодписи);
	
	Возврат 1;
	
КонецФункции

&НаКлиенте
Функция ЭЦП_СформироватьПодписьФайлаНаКлиенте(ДвоичныеДанныеФайлаXML, ДанныеСертификатаЭКОМ, ЛогСобытий) Экспорт
	
	МассивЛогаСобытий = Новый Массив;
	ДанныеПодписи = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ЭЦП_СформироватьПодписьФайлаОбщегоНазначения(ДвоичныеДанныеФайлаXML, ДанныеСертификатаЭКОМ, МассивЛогаСобытий)");
	Для каждого Лог Из МассивЛогаСобытий Цикл
		Если ЗначениеЗаполнено(Лог) Тогда
			ЛогСобытий = ЛогСобытий + ?(ЗначениеЗаполнено(ЛогСобытий), Символы.ПС, "") + Лог;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ДанныеПодписи;

КонецФункции

&НаКлиенте
Функция ЭЦП_ПолучитьСертификатПоОтпечаткуНаКлиенте(МенеджерКриптографии, ДанныеСертификатаЭКОМ, ТолькоВЛичномХранилище) Экспорт
	
	ЗначениеХранилищеСертификатов = Неопределено;
	Если ТолькоВЛичномХранилище Тогда
		ЗначениеХранилищеСертификатов = МенеджерКриптографии.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
	Иначе	
		ЗначениеХранилищеСертификатов = МенеджерКриптографии.ПолучитьХранилищеСертификатов();
	КонецЕсли;
	
	ДвоичныеДанныеОтпечатка = Base64Значение(ДанныеСертификатаЭКОМ.СертификатОтпечаток);
	Сертификат = ЗначениеХранилищеСертификатов.НайтиПоОтпечатку(ДвоичныеДанныеОтпечатка);
	
	Возврат Сертификат;
    
КонецФункции

&НаКлиенте
Процедура ОбменКвитанциямиDP_PDOTPR_03(Команда)
	
	ОбменКвитанциями("DP_PDOTPR_03", "Сеть");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменКвитанциямиDP_IZVPOL_05(Команда)
	
	ОбменКвитанциями("DP_IZVPOL_05", "Сеть");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменКвитанциями(Тип, ТипОбмена)
	
	МассивЛогаСобытий = Новый Массив;
	
	Если ТипОбмена = "Поставщик" Тогда	
		ИмяТЧ = "ТаблицаКвитанцийПоставщик";	
		
	ИначеЕсли ТипОбмена = "Сеть" Тогда		
		ИмяТЧ = "ТаблицаКвитанцийСеть";	
		
	Иначе
		ИмяТЧ = "ТаблицаОшибочныеКвитанции";			
	КонецЕсли;
	 
	// Поместим в регистр если есть
	Для каждого Стр Из Элементы[ИмяТЧ].ВыделенныеСтроки Цикл
		ВыбраннаяСтрока = Элементы[ИмяТЧ].ДанныеСтроки(Стр);
		
		КлючСтатус = "Статус" + Тип;
		Если ВыбраннаяСтрока[КлючСтатус] = "" 
			 ИЛИ ВыбраннаяСтрока[КлючСтатус] = "Неопределен" Тогда
			 
			ИД_Квитанции = "";
			ИД_Документа = Прав(ВыбраннаяСтрока.ПервичныйЮЗД, 36); 
			
			Ошибка = ПолучитьСтруктуруОшибки();
			
			Структура = Новый Структура;
			Структура.Вставить("ПервичныйЮЗД", "");
			Структура.Вставить("DP_IZVPOL_06", "");
			Структура.Вставить("DP_UVUTOCH_09", "");
			Структура.Вставить("DP_IZVPOL_10" , "");
			Структура.Вставить("Подпись"      , "");
			
			Структура.Вставить("СтатусПервичныйЮЗД", "");
			Структура.Вставить("СтатусDP_IZVPOL_06", "");
			Структура.Вставить("СтатусDP_UVUTOCH_09", "");
			Структура.Вставить("СтатусDP_IZVPOL_10", "");
			Структура.Вставить("СтатусПодпись", "");
			Структура.Вставить("ТекстОшибки", "");
			Структура.Вставить("Организация", "");
			Структура.Вставить("Контрагенты", "");

			Если ТипОбмена = "Сеть" Тогда
				
				Структура.Вставить("ЭКОМ_Документ", "");
				Структура.Вставить("DP_PDOTPR_03", "");
				Структура.Вставить("DP_IZVPOL_05", "");	
				Структура.Вставить("DP_PDOTPR_07", "");
				Структура.Вставить("DP_IZVPOL_08" , "");		
				
				Структура.Вставить("СтатусDP_PDOTPR_03", "");
				Структура.Вставить("СтатусDP_IZVPOL_05", "");
				Структура.Вставить("СтатусDP_PDOTPR_07", "");
				Структура.Вставить("СтатусDP_IZVPOL_08", "");
				
			Иначе
				
				Структура.Вставить("ДокументСЧФ", "");
				Структура.Вставить("DP_PDPOL_02", "");
				Структура.Вставить("DP_IZVPOL_04", "");
				
				Структура.Вставить("СтатусDP_PDPOL_02", "");
				Структура.Вставить("СтатусDP_IZVPOL_04", "");
				
			КонецЕсли;
					
			ЗаполнитьЗначенияСвойств(Структура, ВыбраннаяСтрока);
			
			ИдентификаторОснование = Прав(Структура.ПервичныйЮЗД, 36);
            
            СтруктураРезультат = ПолучитьДополнительнуюИнформациюПровайдераНаСеревере(ИдентификаторОснование, Тип, Ошибка, ВыбраннаяСтрока.ПрофильОбмена, МассивЛогаСобытий);

			ПоместитьВРегистр(Структура, Тип, ТипОбмена, СтруктураРезультат);
			// Отправляем если есть ошибка
			Если Ошибка.ЕстьОшибка = Истина 
				 И ТипОбмена = "Сеть" Тогда
				
				Ошибка = ПолучитьСтруктуруОшибки();
				Если Тип="DP_IZVPOL_05" Тогда
					
					ИД_Квитанции = Прав(ВыбраннаяСтрока.DP_PDOTPR_03, 36);
					Результат = ОтправитьКвитанцию(ВыбраннаяСтрока.Сертификат, ВыбраннаяСтрока.ПрофильОбмена, Структура, Тип, ВыбраннаяСтрока.Организация, ИД_Квитанции, ИД_Документа, Ошибка, МассивЛогаСобытий);
					
				ИначеЕсли Тип="DP_IZVPOL_08" 
					И (НЕ ЗначениеЗаполнено(ВыбраннаяСтрока[Тип]) 
					ИЛИ ВыбраннаяСтрока[Тип] = "Нет данных") Тогда
					
					ИД_Квитанции = Прав(ВыбраннаяСтрока.DP_PDOTPR_07, 36);
					Результат = ОтправитьКвитанцию(ВыбраннаяСтрока.Сертификат, ВыбраннаяСтрока.ПрофильОбмена, Структура, Тип, ВыбраннаяСтрока.Организация, ИД_Квитанции, ИД_Документа, Ошибка, МассивЛогаСобытий);
					
				ИначеЕсли Тип="DP_IZVPOL_06" Тогда
					
					ИД_Квитанции = Прав(ВыбраннаяСтрока.ПервичныйЮЗД, 36);
					Результат = ОтправитьКвитанцию(ВыбраннаяСтрока.Сертификат, ВыбраннаяСтрока.ПрофильОбмена, Структура, Тип, ВыбраннаяСтрока.Организация, ИД_Квитанции, ИД_Документа, Ошибка, МассивЛогаСобытий);
					
				ИначеЕсли Тип = "Подпись" Тогда
					
					ИД_Документа = Прав(ВыбраннаяСтрока.ПервичныйЮЗД, 36);
					Результат = ОтправитьТитулПокупателя(ВыбраннаяСтрока.Сертификат, ВыбраннаяСтрока.ПрофильОбмена, Структура, Тип, ВыбраннаяСтрока.Организация, ИД_Документа, Ошибка, МассивЛогаСобытий);
	 	
				КонецЕсли;
				
				Если НЕ Результат = Неопределено Тогда
					
					Структура.Вставить(КлючСтатус, "ОК");
					
				КонецЕсли;
				
			КонецЕсли;
			
			// Отправляем если есть ошибка
			Если Ошибка.ЕстьОшибка = Истина 
				 И ТипОбмена = "Поставщик" Тогда
				
				Ошибка = ПолучитьСтруктуруОшибки();
				Если Тип="DP_IZVPOL_04" Тогда
					
					ИД_Квитанции = Прав(ВыбраннаяСтрока.DP_PDPOL_02, 36);
					Результат = ОтправитьКвитанцию(ВыбраннаяСтрока.Сертификат, ВыбраннаяСтрока.ПрофильОбмена, Структура, Тип, ВыбраннаяСтрока.Организация, ИД_Квитанции, ИД_Документа, Ошибка, МассивЛогаСобытий);
					
				ИначеЕсли Тип="DP_IZVPOL_10" Тогда
					
					ИД_Квитанции = Прав(ВыбраннаяСтрока.DP_UVUTOCH_09, 36);
					Результат = ОтправитьКвитанцию(ВыбраннаяСтрока.Сертификат, ВыбраннаяСтрока.ПрофильОбмена, Структура, Тип, ВыбраннаяСтрока.Организация, ИД_Квитанции, ИД_Документа, Ошибка, МассивЛогаСобытий);
						 	
				КонецЕсли;
				
				Если НЕ Результат = Неопределено Тогда
					
					Структура.Вставить(КлючСтатус, "ОК");
					
				КонецЕсли;
				
			КонецЕсли;
			
			Структура.Вставить("ТекстОшибки", Структура.ТекстОшибки + " " + Ошибка.ТекстОшибки);
			
			ЗаполнитьЗначенияСвойств(ВыбраннаяСтрока,Структура);
			
			Соообщение = Новый СообщениеПользователю;
			Соообщение.Текст = "Данные успешно обновлены!";
			Соообщение.Сообщить();
			
		Иначе
			Соообщение = Новый СообщениеПользователю;
			Соообщение.Текст = "Данная квитанция уже загружена в базу!";
			Соообщение.Сообщить();

		КонецЕсли;
		
	КонецЦикла;

	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ЭКОМ_ОбщегоНазначения.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий);
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменКвитанциямиDP_IZVPOL_06(Команда)
	
	ОбменКвитанциями("DP_IZVPOL_06", "Сеть");

КонецПроцедуры

&НаКлиенте
Процедура ОбменКвитанциямиDP_PDOTPR_07(Команда)
	
	ОбменКвитанциями("DP_PDOTPR_07", "Сеть");

КонецПроцедуры

&НаКлиенте
Процедура ОбменКвитанциямиDP_UVUTOCH_09(Команда)
	
    ОбменКвитанциями("DP_UVUTOCH_09", "Сеть");

КонецПроцедуры

&НаКлиенте
Процедура ОбменКвитанциямиDP_IZVPOL_10(Команда)
	
	ОбменКвитанциями("DP_IZVPOL_10", "Сеть");

КонецПроцедуры

&НаКлиенте
Процедура ОбменКвитанциямиПодпись(Команда)
	
    ОбменКвитанциями("Подпись", "Сеть");
	
КонецПроцедуры

// + Отправка титула покупателя // ON_SCHFDOPPOK_11 
// Параметры:
//	- ИД_Документа - Уникальный идентификатор документа
//	- ДанныеТитула - Структура,
//			Ключи:
//				- ДатаДокумента
//				- СодержаниеОперации"
//	- Ошибка - Стандартный параметр см. ПолучитьСтруктуруОшибки
// Возвращает файлы подписанного титула и подписи в структуре "РезультатПодписи" см. ПолучитьСтруктуруРезультатаПодписания
&НаКлиенте
Функция ОтправитьТитулПокупателя(СертификатЭКОМ, ПрофильОбмена, СтруктураСтроки, Тип, Организация, ИД_Документа, Ошибка, МассивЛогаСобытий) Экспорт
	
	///////////////////////////////
	//Реализация
	
	ЗначениеПоУмолчанию = Неопределено;
	Измерение           = Неопределено; 
	Обязательно         = Истина;
	ЛокальныйКаталогOUTBOX = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_Локальный_Каталог_OUTBOX", ЗначениеПоУмолчанию, Измерение, Обязательно);
	
	// Проверка каталогов OUTBOX
    Если НЕ Прав(ЛокальныйКаталогOUTBOX,1) = "\" Тогда	
        ЛокальныйКаталогOUTBOX = ЛокальныйКаталогOUTBOX + "\"; 
    КонецЕсли;

	ТокенАвторизации = ЭКОМ_ОбщегоНазначения.ПолучитьТокенАвторизации(ПрофильОбмена, Ошибка, МассивЛогаСобытий);	  
	Если Ошибка.ЕстьОшибка Тогда		
		Сообщить("При получении токена(авторизации) возникла ошибка - Код: " + Ошибка.КодОшибки + " - " + Ошибка.ТекстОшибки);
		Возврат Неопределено;		
	КонецЕсли;

	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("varToken", 	 ТокенАвторизации);
	ДанныеЗапроса.Вставить("identifier", ИД_Документа);	
	
	ДанныеДокумента = ИзвлечьИнформациюОДокументеНаСервере(ИД_Документа, Тип, Ошибка, ПрофильОбмена, МассивЛогаСобытий);
	Если Ошибка.ЕстьОшибка Тогда		
		Возврат Неопределено;		
	КонецЕсли;	

	ДанныеСертификатаЭКОМ = ЭКОМ_ОбщегоНазначения.ПолучитьДанныеСертификатаЭКОМ(СертификатЭКОМ);
	
	ДанныеЗапросаОтвета = Новый Структура;
	ДанныеЗапросаОтвета.Вставить("signer_fname"   , ДанныеСертификатаЭКОМ.ФамилияПодписанта);
	ДанныеЗапросаОтвета.Вставить("signer_inn"     , ДанныеСертификатаЭКОМ.ИНН);
	ДанныеЗапросаОтвета.Вставить("signer_position", ДанныеСертификатаЭКОМ.ДолжностьПодписанта);
	ДанныеЗапросаОтвета.Вставить("signer_sname"   , ДанныеСертификатаЭКОМ.ИмяПодписанта);
	ДанныеЗапросаОтвета.Вставить("signer_oblpoln" , ДанныеСертификатаЭКОМ.ОбластьПолномочий);
	ДанныеЗапросаОтвета.Вставить("signer_status"  , ДанныеСертификатаЭКОМ.СтатусПодписанта);
	ДанныеЗапросаОтвета.Вставить("signer_osnpoln" , ДанныеСертификатаЭКОМ.ОснованиеПолномочий);
	ДанныеЗапросаОтвета.Вставить("rec_sodoper"    , ДанныеДокумента.ТипДокумента);
	
	ДанныеЗапроса.Вставить("answer_data", ДанныеЗапросаОтвета);	 
	
	ТитулПокупателя = СформироватьКвитанциюНаСервере(ПрофильОбмена, ДанныеЗапроса, Ошибка, МассивЛогаСобытий);
	Если Ошибка.ЕстьОшибка Тогда	
		Сообщить("При формировании титула покупателя возникла ошибка - Код: " + Ошибка.КодОшибки + " - " + Ошибка.ТекстОшибки);
		Возврат Неопределено;	
	КонецЕсли;

	ДанныОФайле = ПолучитьДанныОФайлеНаСервере(ТитулПокупателя); 
	
	ПолноеИмяФайлаXML    = ЛокальныйКаталогOUTBOX + ДанныОФайле.ИмяФайла;
	ТитулПокупателя.Записать(ПолноеИмяФайлаXML);
	ФайлXML = Новый Файл(ПолноеИмяФайлаXML);

	ПолноеИмяФайлаBIN = ЛокальныйКаталогOUTBOX + ФайлXML.ИмяБезРасширения + ".bin";

	ДвоичныеДанныеФайлаXML = Новый ДвоичныеДанные(ПолноеИмяФайлаXML);

	//Пример. Формирует подпись для файла. Возвращает результат в виде двоичных данных.
	ЛогСобытий = "";
	Подпись = ЭЦП_СформироватьПодписьФайлаНаКлиенте(ДвоичныеДанныеФайлаXML, ДанныеСертификатаЭКОМ, ЛогСобытий);
	Если Подпись = Неопределено Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;

	УниверсальныйМетодОтправкиКвитанцийНаСеревере(ДанныеЗапроса.identifier, ТитулПокупателя, Подпись, Ошибка);
    Если Ошибка.ЕстьОшибка Тогда	
		Сообщить("При отправке титула покупателя возникла ошибка - Код: " + Ошибка.КодОшибки + " - " + Ошибка.ТекстОшибки);
		Возврат Неопределено;	
	КонецЕсли;

	//Реализация
	///////////////////////////////
	ЗаписатьВРегистрПослеОтправкиНаСервере(СтруктураСтроки, Тип, ДанныОФайле, Подпись);

	Возврат 1;

КонецФункции

&НаКлиенте
Процедура ОбменКвитанциямиDP_IZVPOL_04(Команда)
	
	ОбменКвитанциями("DP_IZVPOL_04", "Поставщик");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменКвитанциямиDP_PDPOL_02(Команда)
	
	ОбменКвитанциями("DP_PDPOL_02", "Поставщик");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменКвитанциямиDP_IZVPOL_06_Поставщик(Команда)
	
	
	ОбменКвитанциями("DP_IZVPOL_06", "Поставщик");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменКвитанциямиDP_UVUTOCH_09_Поставщик(Команда)
	
    ОбменКвитанциями("DP_UVUTOCH_09", "Поставщик");

КонецПроцедуры

&НаКлиенте
Процедура ОбменКвитанциямиDP_IZVPOL_10_Поставщик(Команда)
	
	ОбменКвитанциями("DP_IZVPOL_10", "Поставщик");

КонецПроцедуры

&НаКлиенте
Процедура ОбменКвитанциямиПодпись_Поставщик(Команда)
	
    ОбменКвитанциями("Подпись", "Поставщик");

КонецПроцедуры

// + Получение дополнительной информации от провайдера по документу // Тест пройден 
// Параметры:
//	- ИД_Документа - Уникальный идентификатор документа
//	- Ошибка - Стандартный параметр см. ПолучитьСтруктуруОшибки
// Возвращает структуру дополнительной информации. См. "ПолучитьСтруктуруДополнительнойИнформации"
&НаСервере
Функция ПолучитьДополнительнуюИнформациюПровайдераНаСеревере(ИД_Документа, Тип, Ошибка, ПрофильОбмена, МассивЛогаСобытий) Экспорт
		
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СтруктураРезультат = ОбработкаОбъект.ПолучитьДополнительнуюИнформациюПровайдера(ИД_Документа, Тип, Ошибка, ПрофильОбмена, МассивЛогаСобытий);
	
	Возврат СтруктураРезультат;
	
КонецФункции

// + Возвращает список необработанных событий // Тест пройден
//	- Ошибка - Стандартный параметр см. ПолучитьСтруктуруОшибки
&НаСервере
Функция ПолучитьНеобработанныеСобытияНаСервере(Ошибка, Количество, МассивЛогаСобытий) Экспорт
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТаблицаСобытий  = ОбработкаОбъект.ПолучитьНеобработанныеСобытия(Ошибка, Количество, МассивЛогаСобытий);
	
	Возврат ТаблицаСобытий; // Заполненая таблица
	
КонецФункции

// Возвращает стандартную структуру сообщения об ошибке
&НаКлиенте
Функция ПолучитьСтруктуруОшибки()
	
	Структура = Новый Структура;
	Структура.Вставить("ЕстьОшибка" , Ложь);
	Структура.Вставить("КодОшибки"  , "");
	Структура.Вставить("ТекстОшибки", "");
	Возврат Структура;

КонецФункции

// Функция формирует запрос в формате JSON.
//
// Параметры:
//  ДанныеЗапроса  - Структура - данные для формирования запроса
//
// Возвращаемое значение:
//   Строка   - итоговый текст запроса
//
&НаСервере
Функция API_СформироватьЗапрос(ДанныеЗапроса) Экспорт

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТекстЗапроса = ОбработкаОбъект.API_СформироватьЗапрос(ДанныеЗапроса);
	
	Возврат ТекстЗапроса;
	
КонецФункции // API_СформироватьЗапрос()

&НаСервере
Функция UnJSON(СтрJSON) Экспорт

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Значение = ОбработкаОбъект.UnJSON(СтрJSON);
	
	Возврат Значение;
	
КонецФункции

&НаСервере
Функция ВыполнитьЗапрос(Команда, ТелоЗапроса, HTTP_Метод, НеобходимоПолучитьТокен, Ошибка, ТокенАвторизации) Экспорт
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Ответ = ОбработкаОбъект.ВыполнитьЗапрос(Команда, ТелоЗапроса, HTTP_Метод, НеобходимоПолучитьТокен, Ошибка, ТокенАвторизации, ЭтаФОрма.АдресСервера, ЭтаФорма.Логин, ЭтаФорма.Пароль);
	
	Возврат Ответ;
	
КонецФункции

&НаСервере
Функция ПолучитьДату(ДатаXML) Экспорт 
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Дата = ОбработкаОбъект.ПолучитьДату(ДатаXML);
	
	Возврат Дата;
	
КонецФункции

// Возвращает стандартное описание списка событий.
// Список допустимых значений для колонки "ТипКвитанции":
//		- "КвитанцияПолученаДокумент" 
//		- "КвитанцияПолученаПДО"
//		- "КвитанцияПолученаПДО_ИОП"
//		- "КвитанцияПолученаПредложениеОбАннулировании"
//		- "КвитанцияПолученаУОУ_Аннулирования"
//		- "АннулированиеДокумента"
&НаСервере
Функция ПолучитьТаблицуСобытий()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТаблицаЗначений = ПолучитьТаблицуСобытий();
		
	Возврат ТаблицаЗначений;
	
КонецФункции

&НаСервере
Процедура ПоместитьВРегистр(СтруктураСтроки, Тип, ТипОбмена, СтруктураРезультат)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПоместитьВРегистр(СтруктураСтроки, Тип, ТипОбмена, СтруктураРезультат);
	
КонецПроцедуры

// Возвращает стандартную форму ответа запроса подписания квитанции или документа
&НаСервере
Процедура ЗаписатьВРегистрПослеОтправкиНаСервере(СтруктураСтроки, Тип, ДанныеОфайле, ДвоичныеДанныеПодписи)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаписатьВРегистрПослеОтправки(СтруктураСтроки, Тип, ДанныеОфайле, ДвоичныеДанныеПодписи);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьЗначВХранилище(Данные)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Результат = ОбработкаОбъект.ПоместитьЗначВХранилище(Данные);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруДокумента(СтрокаXML, МассивЛогаСобытий) Экспорт
    
   	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СтруктураДокумента = ОбработкаОбъект.ПолучитьСтруктуруДокумента(СтрокаXML, МассивЛогаСобытий) ;

	Возврат СтруктураДокумента;
	
КонецФункции

// Возвращает стандартную структуру дополнительной информации
&НаСервере
Функция ПолучитьСтруктуруДополнительнойИнформации()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Структура = ОбработкаОбъект.ПолучитьСтруктуруДополнительнойИнформации();
	
	Возврат Структура;
	
КонецФункции

// Ошибка - Структура 
&НаСервере
Функция СформироватьКвитанциюНаСервере(ПрофильОбмена, ДанныеЗапроса, Ошибка, МассивЛогаСобытий)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ФайлКвитанции = ОбработкаОбъект.СформироватьКвитанцию(ПрофильОбмена, ДанныеЗапроса, Ошибка, МассивЛогаСобытий);
	
	Возврат ФайлКвитанции;
	
КонецФункции 

// Универсальный метод отправки квитанций/титула
// Параметры: 
//	- СтруктураРезультатаПодписания - Структура, 
//			Ключи:
//				- Файл    - двоичные данные,
//				- Подпись - двоичные данные, 
//	- Ошибка - Стандартный параметр см. ПолучитьСтруктуруОшибки
//  - ИД_Документа
&НаСервере
Процедура УниверсальныйМетодОтправкиКвитанцийНаСеревере(ИД_Документа, Файл, Подпись, Ошибка) Экспорт 

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.УниверсальныйМетодОтправкиКвитанций(ИД_Документа, Файл, Подпись, Ошибка);
	
КонецПроцедуры

&НаСервере
Функция ИзвлечьИнформациюОДокументеНаСервере(Идентификатор, Тип, Ошибка, ПрофильОбмена, МассивЛогаСобытий) Экспорт
    	
   	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Структура       = ОбработкаОбъект.ИзвлечьИнформациюОДокументе(Идентификатор, Тип, Ошибка, ПрофильОбмена, МассивЛогаСобытий);
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныОФайлеНаСервере(ДвоичныеДанныеФайла) Экспорт
    	
   	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ДанныОФайле     = ОбработкаОбъект.ПолучитьДанныОФайле(ДвоичныеДанныеФайла);
	
	Возврат ДанныОФайле;
	
КонецФункции


&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ТекущиеДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	ОбновитьТЧ(ТекущиеДанныеСписка.ИмяСписка, ТекущиеДанныеСписка.ТипОбмена, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтбор(Команда)
	
	ТекущиеДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипОбмена"   , ТекущиеДанныеСписка.ТипОбмена);
	ПараметрыФормы.Вставить("ИмяСписка"   , ТекущиеДанныеСписка.ИмяСписка);
	ПараметрыФормы.Вставить("ОтборНаФорме", ЭтаФорма.ОтборНаФорме);
	Оповещение = Новый ОписаниеОповещения("ЗавершениеОтбора", ЭтаФорма);
	ФормаОтбора = ОткрытьФорму(ПолноеИмяОбработки + ".Форма.УФ_ФормаОтбора", ПараметрыФормы, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);		
	
КонецПроцедуры


&НаКлиенте
Процедура ЗавершениеОтбора(Результат, Данные) Экспорт
	
	ЭтаФорма.ОтборНаФорме = Результат.ОтборНаФорме;
	
	ОбновитьТЧ(Результат.ИмяСписка, Результат.ТипОбмена, ЭтаФорма.ОтборНаФорме);
	
КонецПроцедуры

&НаСервере
Функция СозданиеСКД(ТекстЗапроса, ТипОбмена)
	
	//1. Создаем схему компоновки данных 
    СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
    
   //1.1 Определяем источник данных для схемы 
   //для наших целей - текущая ИБ 
    Источник = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
    Источник.Имя = "ИсточникДанных1";
    Источник.СтрокаСоединения = "";
    Источник.ТипИсточникаДанных = "Local";
    
   //1.2 Определяем набор данных 
    НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "НаборДанных1";
	НаборДанных.ИсточникДанных = "ИсточникДанных1";
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
	НаборДанных.Запрос = ТекстЗапроса;
	
	//2. Создаем настройки для схемы 
    НастройкиКомпоновкиДанных = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	Если ТипОбмена = "Сеть" 
		ИЛИ ТипОбмена = "Поставщик"  Тогда
		СтрПараметр = НастройкиКомпоновкиДанных.ПараметрыДанных.Элементы.Добавить();
		СтрПараметр.Параметр = Новый ПараметрКомпоновкиДанных("ДатаНач");
		СтрПараметр.Значение = Дата(0001, 01, 01); 
		СтрПараметр.Использование = Истина;
		
		СтрПараметр = НастройкиКомпоновкиДанных.ПараметрыДанных.Элементы.Добавить();
		СтрПараметр.Параметр = Новый ПараметрКомпоновкиДанных("ДатаКон");
		СтрПараметр.Значение = Дата(0001, 01, 01); 
		СтрПараметр.Использование = Истина;
	КонецЕсли;
	
	Структура = НастройкиКомпоновкиДанных.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Структура.Использование = Истина;
	Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	Структура.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));

	КоллекцияКолонок = Новый ТаблицаЗначений;
	КоллекцияКолонок.Колонки.Добавить("Имя");
	КоллекцияКолонок.Колонки.Добавить("ТипЗначения");
	КоллекцияКолонок.Колонки.Добавить("Заголовок");
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.Текст = СокрЛП(ТекстЗапроса);
	ПостроительЗапроса.ЗаполнитьНастройки();
	Для каждого ВыбранноеПоле Из ПостроительЗапроса.ВыбранныеПоля Цикл	
		НоваяКолонка = КоллекцияКолонок.Добавить();
		НоваяКолонка.Имя = ВыбранноеПоле.Имя;			
		НоваяКолонка.ТипЗначения = ПостроительЗапроса.ДоступныеПоля[ВыбранноеПоле.ПутьКДанным].ТипЗначения;
		НоваяКолонка.Заголовок = ВыбранноеПоле.Представление
	КонецЦикла;
	
	// Добавление полей в набор		
	Для каждого НоваяКолонка Из КоллекцияКолонок Цикл			
		ПолеНабора = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		ПолеНабора.Заголовок   = СокрЛП(НоваяКолонка.Заголовок);
		ПолеНабора.Поле        = СокрЛП(НоваяКолонка.Имя);
		ПолеНабора.ПутьКДанным = СокрЛП(НоваяКолонка.Имя);
		
		// Удалим неопределено и NULL
		Массив = Новый Массив;
		Для каждого ТекущийТип Из НоваяКолонка.ТипЗначения.Типы() Цикл
			Если ТекущийТип = Тип("Неопределено") 
				ИЛИ ТекущийТип = Тип("NULL") 
				ИЛИ ТекущийТип = Неопределено 
				ИЛИ ТекущийТип = Null Тогда 
				Продолжить; 
			КонецЕсли;
			Массив.Добавить(ТекущийТип);
		КонецЦикла;
		ПолеНабора.ТипЗначения = Новый ОписаниеТипов(Массив,НоваяКолонка.ТипЗначения.КвалификаторыЧисла,НоваяКолонка.ТипЗначения.КвалификаторыСтроки,НоваяКолонка.ТипЗначения.КвалификаторыДаты);
		
		ВыбранноеПолеКомпоновкиДанных = НастройкиКомпоновкиДанных.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));			
		ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных(ПолеНабора.ПутьКДанным);
		ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	КонецЦикла;
	 
   Возврат СхемаКомпоновкиДанных;
   
КонецФункции

&НаКлиенте
Процедура ТаблицаКвитанцийСетьВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент = Неопределено 
		ИЛИ Элемент.ТекущиеДанные = Неопределено 
		ИЛИ ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ТаблицаКвитанцийСетьТекстОшибки" 
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ТекстОшибки) Тогда
		
		СтандартнаяОбработка = Ложь;
        Подсказка = "Текст ошибки";
        ПоказатьВводСтроки(Новый ОписаниеОповещения, Элемент.ТекущиеДанные.ТекстОшибки, Подсказка, 0, Истина);
		
	ИначеЕсли Поле.Имя = "ТаблицаКвитанцийСетьЛогСобытий" 
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ЛогСобытий) Тогда
		
		СтандартнаяОбработка = Ложь;
        Подсказка = "Текст лога событий";
        ПоказатьВводСтроки(Новый ОписаниеОповещения, Элемент.ТекущиеДанные.ЛогСобытий, Подсказка, 0, Истина);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущиеДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	ОбновитьТЧ(ТекущиеДанныеСписка.ИмяСписка, ТекущиеДанныеСписка.ТипОбмена, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтбор(Команда)
	
	ЭтаФорма.ОтборНаФорме = Новый КомпоновщикНастроекКомпоновкиДанных;
	ТекущиеДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
    ОбновитьТЧ(ТекущиеДанныеСписка.ИмяСписка, ТекущиеДанныеСписка.ТипОбмена, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКвитанцийПоставщикВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент = Неопределено 
		ИЛИ Элемент.ТекущиеДанные = Неопределено 
		ИЛИ ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ТаблицаКвитанцийПоставщикТекстОшибки" 
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ТекстОшибки) Тогда
		
		СтандартнаяОбработка = Ложь;
        Подсказка = "Текст ошибки";
        ПоказатьВводСтроки(Новый ОписаниеОповещения, Элемент.ТекущиеДанные.ТекстОшибки, Подсказка, 0, Истина);
		
	ИначеЕсли Поле.Имя = "ТаблицаКвитанцийПоставщикЛогСобытий" 
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ЛогСобытий) Тогда
		
		СтандартнаяОбработка = Ложь;
        Подсказка = "Текст лога событий";
        ПоказатьВводСтроки(Новый ОписаниеОповещения, Элемент.ТекущиеДанные.ЛогСобытий, Подсказка, 0, Истина);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаКвитанцииНаПлатформе(Команда)
	
	МассивЛогаСобытий = Новый Массив;
	ПараметрКлюч = "ТипОбмена, Тип";
	
	// Только входящие
	СписокКвитанций = Новый Соответствие;	
	СписокКвитанций.Вставить(ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.DP_IZVPOL_10") , Новый Структура(ПараметрКлюч, "Сеть"     , "DP_IZVPOL_10"));
	СписокКвитанций.Вставить(ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.DP_PDOTPR_03") , Новый Структура(ПараметрКлюч, "Сеть"     , "DP_PDOTPR_03"));
	СписокКвитанций.Вставить(ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.DP_IZVPOL_05") , Новый Структура(ПараметрКлюч, "Сеть"     , "DP_IZVPOL_05"));
	СписокКвитанций.Вставить(ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.DP_PDOTPR_07") , Новый Структура(ПараметрКлюч, "Сеть"     , "DP_PDOTPR_07"));
	СписокКвитанций.Вставить(ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.DP_IZVPOL_08") , Новый Структура(ПараметрКлюч, "Сеть"     , "DP_IZVPOL_08"));	
	СписокКвитанций.Вставить(ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.DP_PDPOL_02")  , Новый Структура(ПараметрКлюч, "Поставщик", "DP_PDPOL_02"));
	СписокКвитанций.Вставить(ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.DP_IZVPOL_04") , Новый Структура(ПараметрКлюч, "Поставщик", "DP_IZVPOL_04"));	
	СписокКвитанций.Вставить(ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.DP_IZVPOL_06") , Новый Структура(ПараметрКлюч, "Поставщик", "DP_IZVPOL_06"));
	СписокКвитанций.Вставить(ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.DP_UVUTOCH_09"), Новый Структура(ПараметрКлюч, "Поставщик", "DP_UVUTOCH_09"));
    СписокКвитанций.Вставить("SCHFDOPPOK"                                                              , Новый Структура(ПараметрКлюч, "Поставщик", "Подпись"));
				
	Для каждого Стр Из Элементы.ТаблицаОшибочныеКвитанции.ВыделенныеСтроки Цикл
		ВыбраннаяСтрока = Элементы.ТаблицаОшибочныеКвитанции.ДанныеСтроки(Стр);

		Если Найти(ВыбраннаяСтрока.Идентификатор, "SCHFDOPPOK") > 0 Тогда
			Данные = СписокКвитанций.Получить("SCHFDOPPOK");
		Иначе
			Данные = СписокКвитанций.Получить(ВыбраннаяСтрока.ВидДокумента);
		КонецЕсли;	
		 
		Если НЕ Данные = Неопределено Тогда
			
			Структура  = ОбновитьСтатусСтрокиТаблицы(ЭтаФорма.ПрофильОбменаНаФорме, ВыбраннаяСтрока.Идентификатор, Данные.Тип, МассивЛогаСобытий);
			ТексОшибки = СокрЛП(ВыбраннаяСтрока.ТекстОшибки) + ?(ЗначениеЗаполнено(ВыбраннаяСтрока.ТекстОшибки), Символы.ПС, "") + СокрЛП(Структура.ТекстОшибки);
			ЛогСобытий = СокрЛП(ВыбраннаяСтрока.ЛогСобытий) + ?(ЗначениеЗаполнено(ВыбраннаяСтрока.ЛогСобытий), Символы.ПС, "") + СокрЛП(Структура.ЛогСобытий);
			
			ВыбраннаяСтрока.ТекстОшибки       = ТексОшибки;
			ВыбраннаяСтрока.ЛогСобытий        = ЛогСобытий;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий);
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура НайтиПовторноДокументОснования(Команда)
	
	КвитанцииНайдены = Ложь;
	МассивСтрок =  ПолучитьСтрокиДинамическогоСпискаДляОбработки("ТаблицаОшибочныеКвитанции");
	СписокТиповОбмена = НайтиПовторноДокументОснованияНаСервере(КвитанцииНайдены, МассивСтрок);
	
	Если КвитанцииНайдены = Истина Тогда
		ФормаОсновная = ПолучитьФорму(ЭтаФорма.ПолноеИмяОбработки + ".Форма.УФ_Форма");
		Для каждого ИмяСписка Из СписокТиповОбмена Цикл
			ФормаОсновная.ПроверитьНаличиеФайловНаКлиенте(ИмяСписка.Ключ, 1, ИмяСписка.Значение);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиПовторноДокументОснованияНаСервере(КвитанцииНайдены, МассивСтрок)
	
	ПараметрКлюч = "ТипОбмена, Тип";

	// Только входящие
	СписокКвитанций = Новый Соответствие;	
	СписокКвитанций.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DP_IZVPOL_10 , Новый Структура(ПараметрКлюч, "СписокДляПокупателя", "DP_IZVPOL_10"));
	СписокКвитанций.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DP_PDOTPR_03 , Новый Структура(ПараметрКлюч, "СписокДляПокупателя", "DP_PDOTPR"));
	СписокКвитанций.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DP_PDOTPR_07 , Новый Структура(ПараметрКлюч, "СписокДляПокупателя", "DP_PDOTPR"));

	СписокКвитанций.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DP_PDPOL_02  , Новый Структура(ПараметрКлюч, "СписокДляПоставщика", "DP_PDPOL"));
	СписокКвитанций.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DP_IZVPOL_06 , Новый Структура(ПараметрКлюч, "СписокДляПоставщика", "DP_IZVPOL_06"));
	СписокКвитанций.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DP_UVUTOCH_09, Новый Структура(ПараметрКлюч, "СписокДляПоставщика", "DP_UVUTOCH"));
    СписокКвитанций.Вставить("SCHFDOPPOK"                                  , Новый Структура(ПараметрКлюч, "СписокДляПоставщика", "Подпись"));
	
	СписокТиповОбмена = Новый Структура;
	МассивИдентификаторов = Новый Массив;
	Для каждого ВыбраннаяСтрока Из МассивСтрок Цикл	
		
		Если Найти(ВыбраннаяСтрока.Идентификатор, "SCHFDOPPOK") > 0 Тогда
			Данные = СписокКвитанций.Получить("SCHFDOPPOK");
		Иначе
			Данные = СписокКвитанций.Получить(ВыбраннаяСтрока.ВидДокумента);
		КонецЕсли;
		
		Если НЕ Данные = Неопределено Тогда
		    СписокТиповОбмена.Вставить(Данные.Тип, Данные.ТипОбмена);
  		КонецЕсли;
			
		МассивИдентификаторов.Добавить(ВыбраннаяСтрока.ИдентификаторОснования);				
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭКОМ_Объекты_События.Документ_Основание,
	               |	ЭКОМ_Квитанции.ВидДокумента,
	               |	ЭКОМ_Квитанции.Идентификатор
	               |ИЗ
	               |	РегистрСведений.ЭКОМ_Объекты_События КАК ЭКОМ_Объекты_События
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЭКОМ_Квитанции КАК ЭКОМ_Квитанции
	               |		ПО ЭКОМ_Объекты_События.Идентификатор = ЭКОМ_Квитанции.ИдентификаторОснования
	               |ГДЕ
	               |	ЭКОМ_Объекты_События.Идентификатор В(&МассивИдентификаторов)
	               |	И НЕ ЭКОМ_Квитанции.ВидДокумента ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторов);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой()  Тогда
	
		Соообщение = Новый СообщениеПользователю;
		Соообщение.Текст = "Документы основания по квитанциям не найдены в базе 1С!";
		Соообщение.Сообщить();
		
	Иначе
		МЗ = РегистрыСведений.ЭКОМ_Квитанции.СоздатьМенеджерЗаписи();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл			
			
			МЗ.ВидДокумента  = Выборка.ВидДокумента;
			МЗ.Идентификатор = Выборка.Идентификатор;
			МЗ.Прочитать();
			
			МЗ.ДатаЗаписи     = ТекущаяДата();
			МЗ.Записать();

		КонецЦикла;
		
		КвитанцииНайдены = Истина;
			
	КонецЕсли;

	Возврат СписокТиповОбмена;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаОшибочныеКвитанцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент = Неопределено 
		ИЛИ Элемент.ТекущиеДанные = Неопределено 
		ИЛИ ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ТаблицаКвитанцийПоставщикТекстОшибки" 
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ТекстОшибки) Тогда
		
		СтандартнаяОбработка = Ложь;
        Подсказка = "Текст ошибки";
        ПоказатьВводСтроки(Новый ОписаниеОповещения, Элемент.ТекущиеДанные.ТекстОшибки, Подсказка, 0, Истина);
		
	ИначеЕсли Поле.Имя = "ТаблицаКвитанцийПоставщикЛогСобытий" 
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ЛогСобытий) Тогда
		
		СтандартнаяОбработка = Ложь;
        Подсказка = "Текст лога событий";
        ПоказатьВводСтроки(Новый ОписаниеОповещения, Элемент.ТекущиеДанные.ЛогСобытий, Подсказка, 0, Истина);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокиДинамическогоСпискаДляОбработки(ИмяСписка)
    
    СписокДляОбработки = Элементы[ИмяСписка];	
	СтрКолонки = "";
	Для каждого ИмяКолонки Из СписокДляОбработки.ПодчиненныеЭлементы Цикл
		ИмяТекКолонки = СтрЗаменить(ИмяКолонки.Имя, СписокДляОбработки.Имя, "");
		СтрКолонки    = ?(СтрКолонки = "", ИмяТекКолонки, СтрКолонки + "," + ИмяТекКолонки);		
	КонецЦикла;
	
	ВыгружаемыеДанныеВыделения = Новый Массив;
	Для каждого текВыделеннаяСтрока Из СписокДляОбработки.ВыделенныеСтроки Цикл
		РезультатСтруктура = Новый Структура(СтрКолонки);
		ВыбраннаяСтрока = СписокДляОбработки.ДанныеСтроки(текВыделеннаяСтрока);			
		ЗаполнитьЗначенияСвойств(РезультатСтруктура, ВыбраннаяСтрока);
		ВыгружаемыеДанныеВыделения.Добавить(РезультатСтруктура);
	КонецЦикла;
		       
    Возврат ВыгружаемыеДанныеВыделения;
	
КонецФункции

&НаКлиенте
Процедура ДатаКонецПриИзменении(Элемент)
	ТекущиеДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	ОбновитьТЧ(ТекущиеДанныеСписка.ИмяСписка, ТекущиеДанныеСписка.ТипОбмена, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ТекущиеДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	ОбновитьТЧ(ТекущиеДанныеСписка.ИмяСписка, ТекущиеДанныеСписка.ТипОбмена, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)	
    Диалог = Новый ДиалогРедактированияСтандартногоПериода();                                 
    Диалог.Период = Новый СтандартныйПериод(ЭтаФорма.ДатаНачала, ЭтаФорма.ДатаКонец);
    ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("УстановитьПериодЗавершение", ЭтаФорма, Новый Структура("Диалог", Диалог));
    Диалог.Показать(ОписаниеОповещенияОЗакрытии); 	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодЗавершение(Период, ДополнительныеПараметры) Экспорт	
	
	Диалог = ДополнительныеПараметры.Диалог; 	
    Если НЕ Период = Неопределено Тогда		
        ЭтаФорма.ДатаНачала = Диалог.Период.ДатаНачала;
        ЭтаФорма.ДатаКонец  = Диалог.Период.ДатаОкончания;		
    КонецЕсли;
	
	ТекущиеДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	ОбновитьТЧ(ТекущиеДанныеСписка.ИмяСписка, ТекущиеДанныеСписка.ТипОбмена, Неопределено);

КонецПроцедуры
