
&ИзменениеИКонтроль("ДобавитьОсновныеНастройкиВПараметры")
Функция игр_ДобавитьОсновныеНастройкиВПараметры(УзелОбмена, Параметры)

	МассивРеквизитов = ПолучитьМассивРеквизитов5ВерсииМодуля();

	//добавляем реквизиты узла обмена
	Для каждого ТекРеквизит из УзелОбмена.Метаданные().Реквизиты Цикл

		Если МассивРеквизитов.Найти(ТекРеквизит.Имя) = Неопределено тогда
			Продолжить;
		КонецЕсли;         

		Параметры.Вставить(ТекРеквизит.Имя, УзелОбмена[ТекРеквизит.Имя]);
	КонецЦикла;

	//Добавляем свойства, которые используем в обмене
	Параметры.Вставить("СвойствоИдМетодаОплаты", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Метод оплаты ИД", Истина));
	Параметры.Вставить("СвойствоИдентификаторОтправления", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Идентификатор отправления", Ложь));

	Параметры.Вставить("ЕстьКритичныеОшибкиВОбмене"	, Ложь);
	Параметры.Вставить("ОбменВыполненБезОшибок"		, Истина);

	лфайлСхемыXSD 	= ПолучитьИмяВременногоФайла(".XSD");
	СхемаXSD  		= ПланыОбмена.Б_ОбменССайтом.ПолучитьМакет("СхемаXSDОбмена");
	СхемаXSD.Записать(лфайлСхемыXSD);

	Параметры.Вставить("ПространствоИмен", "urn:1C.ru:commerceml_3");
	Параметры.Вставить("МояФабрикаXDTO", );

	Параметры.Вставить("ВерсияСхемы"		, "3.1");
	Параметры.Вставить("ФайлСхемы"			, лфайлСхемыXSD);

	Параметры.Вставить("ФорматСуммы"		, "ЧЦ=18; ЧДЦ=2; ЧРД=.; ЧН=; ЧГ=");
	Параметры.Вставить("ФорматКоличества"	, "ЧРД=.; ЧН=; ЧГ=");

	Параметры.Вставить("Ссылка"				, УзелОбмена);

	Параметры.Вставить("ИдентификаторОбмена", Строка(Новый УникальныйИдентификатор)); 

	Параметры.Вставить("ПрефиксВерсии"		, Строка(Формат(ТекущаяДатаСеанса()-НачалоДня(ТекущаяДатаСеанса()), "ЧГ=0"))); 

	Параметры.Вставить("ИспользоватьПартнеровИКонтрагентов"	, ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровИКонтрагентов"));
	Параметры.Вставить("ИспользоватьУпаковкиНоменклатуры"	, ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры"));

	Параметры.Вставить("ИспользоватьРучныеСкидкиВПродажах"	, ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВПродажах"));
	Параметры.Вставить("ИспользоватьАвтоматическиеСкидкиВПродажах"	, ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах"));

	Параметры.Вставить("СтруктураСхемКомпоновки"	, ПолучитьСтруктуруСхемКомпоновки());


	СистемнаяИнформация = Новый СистемнаяИнформация;
	ПлатформаWindows = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86
	ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64;

	Параметры.Вставить("ПлатформаWindows", ПлатформаWindows);

	ДатаФормирования = ТекущаяДатаСеанса();
	Параметры.Вставить("ДатаФормирования", ДатаФормирования);

	//добавляем расширения картинок
	РазрешенныеТипыКартинок = Новый Массив;
	РазрешенныеТипыКартинок.Добавить("gif");
	РазрешенныеТипыКартинок.Добавить("jpg");
	РазрешенныеТипыКартинок.Добавить("jpeg");
	РазрешенныеТипыКартинок.Добавить("png");
	РазрешенныеТипыКартинок.Добавить(".gif");
	РазрешенныеТипыКартинок.Добавить(".jpg");
	РазрешенныеТипыКартинок.Добавить(".jpeg");
	РазрешенныеТипыКартинок.Добавить(".png");
	РазрешенныеТипыКартинок.Добавить("");
	Параметры.Вставить("РасширенияКартинок", РазрешенныеТипыКартинок);

	Параметры.НастройкаВерсионностиВыгружаемыхДанных = УзелОбмена.НастройкаВерсионностиВыгружаемыхДанных.Получить();  	

	Параметры.Вставить("ДатаДеактивацииПриПакетнойВыгрузке"		, Неопределено);

	//добавляем  данные для логирования
	Если Параметры.КаталогЛога = "" тогда

		//Сообщить("Для настройки не задан каталог хранения лога. Лог будет храниться в каталоге выгрузки файлов.");

		Параметры.КаталогЛога = Параметры.КаталогВыгрузки;

		Если Параметры.КаталогЛога = "" тогда
			//Сообщить("Не удалось указать каталог выгрузки в качестве каталога хранения лога. Ведение лога невозможно.");
		КонецЕсли;

	КонецЕсли;

	ИмяФайлаЛога = "";

	Если НЕ ПустаяСтрока(Параметры.КаталогЛога) Тогда

		лКаталогЛога = Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьПутьДляПлатформы(Параметры.ПлатформаWindows, Параметры.КаталогЛога + "\reports"); 

		Если НЕ Б_ОбщиеПроцедурыИФункцииСервер.СуществуетФайл(лКаталогЛога) тогда
			СоздатьКаталог(лКаталогЛога);	
		КонецЕсли;

		ИмяФайлаЛога = Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьПутьДляПлатформы(Параметры.ПлатформаWindows, лКаталогЛога + "\") + "Exchange_" + "(" + УзелОбмена.Наименование +  ")" +  СокрЛП(Формат(Параметры.ДатаФормирования, "ДФ=yyyy-MM-dd")) + ".txt";

	КонецЕсли;

	Параметры.Вставить("ИмяФайлаЛога"		, ИмяФайлаЛога);
	Параметры.Вставить("КодировкаФайлаЛога"	, УзелОбмена.КодировкаФайлаЛога);

	#Удаление
	Параметры.Вставить("ИспользуетсяЦенообразование25", ПолучитьФункциональнуюОпцию("ИспользуетсяЦенообразование25"));
	Параметры.Вставить("ИспользуетсяЦенообразование20", ПолучитьФункциональнуюОпцию("ИспользуетсяЦенообразование20"));
	#КонецУдаления
	#Вставка
	Параметры.Вставить("ИспользуетсяЦенообразование25", Ложь);
	Параметры.Вставить("ИспользуетсяЦенообразование20", Истина);
	#КонецВставки

	Возврат Истина;

КонецФункции

&ИзменениеИКонтроль("ПолучитьНДСПоставке")
Функция игр_ПолучитьНДСПоставке(СтавкаНДС)

	Выборка = Справочники.СтавкиНДС.Выбрать();
	Пока Выборка.Следующий() Цикл
		#Удаление
		Если Выборка.РасчетнаяСтавка = Ложь Тогда
		#КонецУдаления
			Если Формат(Выборка.Ставка, "ЧГ=0") = СтавкаНДС Тогда
				Возврат Выборка.Ссылка;
			КонецЕсли;
		#Удаление
		КонецЕсли;
		#КонецУдаления
	КонецЦикла;

	Возврат Справочники.СтавкиНДС.ПустаяСсылка();

КонецФункции
