
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура игр_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);

	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);

	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);


	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	КонецЕсли;

	Элементы.ТоварыПоискПоШтрихкоду.Видимость = ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ШтрихкодыНоменклатуры);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ИнтеграцияС1СДокументооборотом

	ПредыдущаяДата = Объект.Дата;

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	#Вставка
	игр_ДобавитьКомандыФормы();
	игр_ДобавитьИзменитьРеквизиты();
	игр_ДобавитьИзменитьЭлементыФормы();
	игр_ЗаполнитьЦены(Объект.Товары);
	#КонецВставки

КонецПроцедуры

&НаКлиенте
&После("ОбработкаВыбора")
Процедура игр_ОбработкаВыбора(РезультатВыбора, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументПродажи.Форма.Форма" Тогда
		
		игр_ОбработкаВыбораПодборНаКлиенте(РезультатВыбора);
		
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Подключаемый_ЗагрузитьИзФайла(Команда)
	
	Диалог	= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Диалог.Фильтр	= "*.txt|*.txt";
	
	Если Диалог.Выбрать() Тогда
		
		игр_ЗагрузитьДанныеИзФайла(Диалог.ПолноеИмяФайла);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Подбор(Команда)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Документ.ПересчетТоваров.ФормаДокумента.Команда.ОткрытьПодбор");
	
	ПараметрЗаголовок = НСтр("ru = 'Подбор товаров в %Документ%'");
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", Объект.Ссылка);
	Иначе
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", НСтр("ru = 'пересчет товаров'"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Склад", Объект.Склад);
	ПараметрыФормы.Вставить("Заголовок", ПараметрЗаголовок);
	ПараметрыФормы.Вставить("Дата", Объект.Дата);
	ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти", Ложь);
	ПараметрыФормы.Вставить("Документ", Объект.Ссылка);
	ПараметрыФормы.Вставить("РежимПодбораБезСуммовыхПараметров", Истина);
	
	ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗагрузитьИзМобильныхДанных(Команда)
	
	ПараметрыФормы	= Новый Структура;
	
	ОткрытьФорму("РегистрСведений.игр_ЖурналВходящихДанныхМобильноеПриложение.Форма.ФормаВыборПересчетаТоваров", 
		ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор,,, Новый ОписаниеОповещения("игр_ЗагрузитьИзМобильныхДанныхЗавершение", ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура игр_ЗагрузитьИзМобильныхДанныхЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		
		игр_ЗагрузитьИзМобильныхДанныхНаСервере(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура игр_ЗагрузитьИзМобильныхДанныхНаСервере(Адрес)
	
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда
		
		ТаблицаТоваров	= ПолучитьИзВременногоХранилища(Адрес);
		ДанныеДляЗагрузки = Новый Массив;
		Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
			
			ЭлементМассива	= Новый Массив;
			ЭлементМассива.Добавить(СтрокаТаблицы.Штрихкод);
			ЭлементМассива.Добавить(СтрокаТаблицы.Количество);
			
			ДанныеДляЗагрузки.Добавить(ЭлементМассива);
			
		КонецЦикла;
		
		игр_ЗагрузитьДанныеНаСервере(ДанныеДляЗагрузки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура игр_ЗагрузитьДанныеИзФайла(ИмяФайла)
	
	Текст	= Новый ТекстовыйДокумент;
	Текст.Прочитать(ИмяФайла);
	
	Данные	= Новый Массив;
	
	НПП = 0;
	Пока НПП < Текст.КоличествоСтрок() Цикл
		
		НПП = НПП + 1;
		
		Данные.Добавить(СтрРазделить(Текст.ПолучитьСтроку(НПП), Символ(1)));
		
	КонецЦикла;
	
	игр_ЗагрузитьДанныеНаСервере(Данные);
	
КонецПроцедуры

&НаСервере
Процедура игр_ЗагрузитьДанныеНаСервере(Данные)
	
	Штрихкоды	= Новый Массив;
	КоличествоСоответствие	= Новый Соответствие;
	КэшированныеЗначения	= ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	Для Каждого Элемент Из Данные Цикл
		
		Попытка
			Штрихкод	= Элемент[0];
			Если ТипЗнч(Элемент[1]) = Тип("Строка") Тогда
				Количество	= Число(СтрЗаменить(Элемент[1]," ",""));
			Иначе
				Количество	= Элемент[1];
			КонецЕсли;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон("Ошибка при загрузке строки: %1", Элемент));
			Продолжить;
		КонецПопытки;
		
		Штрихкоды.Добавить(Штрихкод);
		Если КоличествоСоответствие[Штрихкод] = Неопределено Тогда
			КоличествоСоответствие.Вставить(Штрихкод, 0);
		КонецЕсли;
		КоличествоСоответствие[Штрихкод] = КоличествоСоответствие[Штрихкод] + Количество;
		
	КонецЦикла;
	
	РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьДанныеПоШтрихкодам(
		КэшированныеЗначения, Штрихкоды);
		
	Для Каждого Элемент Из Штрихкоды Цикл
		
		Описание	= КэшированныеЗначения.Штрихкоды[Элемент];
		Если Описание = Неопределено ИЛИ НЕ ЗначениеЗаполнено(Описание.Номенклатура) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон("Не найден штрихкод: %1", Элемент));
			Продолжить;
		КонецЕсли;
		
		НайденнаяСтрока	= Объект.Товары.НайтиСтроки(
			Новый Структура("Номенклатура, Характеристика", Описание.Номенклатура, Описание.Характеристика));
			
		Если НайденнаяСтрока.Количество() = 0 Тогда
		
			НоваяСтрока	= Объект.Товары.Добавить();
			
			НоваяСтрока.Номенклатура	= Описание.Номенклатура;
			НоваяСтрока.Характеристика	= Описание.Характеристика;
			Если ЗначениеЗаполнено(НоваяСтрока.Характеристика) Тогда
				НоваяСтрока.ХарактеристикиИспользуются = Истина;
			КонецЕсли;
			
		Иначе
			
			НоваяСтрока	= НайденнаяСтрока[0];
			
		КонецЕсли;
		
		НоваяСтрока.КоличествоУпаковокФакт	= НоваяСтрока.КоличествоУпаковокФакт + КоличествоСоответствие[Элемент];
		НоваяСтрока.КоличествоФакт			= НоваяСтрока.КоличествоФакт + КоличествоСоответствие[Элемент];
		НоваяСтрока.КоличествоУпаковокОтклонение	= НоваяСтрока.КоличествоФакт - НоваяСтрока.КоличествоУпаковок;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура игр_ДобавитьИзменитьРеквизиты()
	
	ДобавляемыеРеквизиты	= Новый Массив;
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("игр_Цена", ОбщегоНазначения.ОписаниеТипаЧисло(15,2), "Объект.Товары", "Цена"));
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
КонецПроцедуры

&НаСервере
Процедура игр_ДобавитьКомандыФормы() 
	
	НоваяКоманда	= Команды.Добавить("игр_ЗагрузитьИзФайла");
	НоваяКоманда.Действие	= "Подключаемый_ЗагрузитьИзФайла";
	НоваяКоманда.Заголовок	= "Загрузить из файла";
	
	НоваяКоманда	= Команды.Добавить("игр_ЗагрузитьМобильныхДанных");
	НоваяКоманда.Действие	= "Подключаемый_ЗагрузитьИзМобильныхДанных";
	НоваяКоманда.Заголовок	= "Загрузить из мобильных данных";
	
	НоваяКоманда	= Команды.Добавить("игр_Подбор");
	НоваяКоманда.Действие	= "Подключаемый_Подбор";
	НоваяКоманда.Заголовок	= "Подобрать товары";
	НоваяКоманда.Картинка	= БиблиотекаКартинок.ПодобратьТовары;
	НоваяКоманда.Отображение	= ОтображениеКнопки.КартинкаИТекст;
	
КонецПроцедуры

&НаСервере
Процедура игр_ДобавитьИзменитьЭлементыФормы() 
	
	НовыйЭлемент	= Элементы.Добавить("игр_ЗагрузитьИзФайла", Тип("КнопкаФормы"), Элементы.Товары.КоманднаяПанель);
	НовыйЭлемент.Вид		= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды	= "игр_ЗагрузитьИзФайла";
	
	НовыйЭлемент	= Элементы.Добавить("игр_ЗагрузитьМобильныхДанных", Тип("КнопкаФормы"), Элементы.Товары.КоманднаяПанель);
	НовыйЭлемент.Вид		= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды	= "игр_ЗагрузитьМобильныхДанных";
	
	НовыйЭлемент	= Элементы.Добавить("игр_Подбор", Тип("КнопкаФормы"), Элементы.Товары.КоманднаяПанель);
	НовыйЭлемент.Вид		= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды	= "игр_Подбор";
	
	НовыйЭлемент	= Элементы.Вставить("игр_ТоварыЦена", Тип("ПолеФормы"), Элементы.Товары, Элементы.ТоварыКоличествоУпаковок);
	НовыйЭлемент.Вид			= ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным	= "Объект.Товары.игр_Цена";
	
КонецПроцедуры

&НаСервере
Процедура игр_ЗаполнитьЦеныПоСтроке(Идентификатор)
	
	игр_ЗаполнитьЦены(Объект.Товары.НайтиПоИдентификатору(Идентификатор));
	
КонецПроцедуры

&НаСервере
Процедура игр_ЗаполнитьЦены(КоллекцияСтрок)
	
	Документы.ПересчетТоваров.игр_ЗаполнитьЦеныПоКоллекцииСтрок(КоллекцияСтрок, Объект, "игр_Цена");
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ТоварыПриОкончанииРедактирования")
Процедура игр_ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	Если Не ОтменаРедактирования
		И НоваяСтрока Тогда

		ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

		Если Не ТекущаяСтрока.ИзлишекПорча Тогда
			Объект.УчетныеДанныеЗаполнены = Ложь;
		КонецЕсли;

	КонецЕсли;
	#Вставка
	игр_ЗаполнитьЦеныПоСтроке(Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор());
	#КонецВставки

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьСервер")
Процедура игр_ЗаполнитьСервер()

	УстановитьЗначениеПараметраНастроек(ОтборПересчета.Настройки, "ДатаОстатков", ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса()));

	Если ИспользоватьАдресноеХранение Тогда
		СхемаКомпоновкиДанных = Документы.ПересчетТоваров.ПолучитьМакет("ОтборПересчетаПоЯчейкам");
	Иначе	
		СхемаКомпоновкиДанных = Документы.ПересчетТоваров.ПолучитьМакет("ОтборПересчетаПоСкладу");
	КонецЕсли;

	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных.ЗаполнениеПоОтборам.Запрос;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
	"&ТекстЗапросаКоэффициентУпаковки",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ТоварыВЯчейках.Упаковка", Неопределено));
	СхемаКомпоновкиДанных.НаборыДанных.ЗаполнениеПоОтборам.Запрос = ТекстЗапроса;

	СегментыСервер.ВключитьОтборПоСегментуНоменклатурыВСКД(ОтборПересчета);

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ОтборПересчета.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Объект.Товары.Загрузить(ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных));

	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	ЗаполнитьПризнакРасхождение();

	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	#Вставка
	игр_ЗаполнитьЦены(Объект.Товары);
	#КонецВставки

КонецПроцедуры

&НаСервере
Процедура игр_ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
	КэшированныеЗначения	= Новый Структура;
	
	Для каждого СтрокаТовара Из ТаблицаТоваров Цикл
		
		НайденнаяСтрока	= Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", СтрокаТовара.Номенклатура, СтрокаТовара.Характеристика));
		Если НайденнаяСтрока.Количество() > 0 Тогда
			ТекущаяСтрока	= НайденнаяСтрока[0];
		Иначе
			ТекущаяСтрока = Объект.Товары.Добавить();
			СписокСвойств = "Номенклатура, Характеристика, Упаковка";
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТовара, СписокСвойств);
		КонецЕсли;
		ТекущаяСтрока.КоличествоУпаковокФакт	= СтрокаТовара.Количество;
		ТекущаяСтрока.КоличествоФакт			= СтрокаТовара.Количество;
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
		СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
		СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиницСуффикс", "Факт");
		СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
		СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий));
		СтруктураДействий.Вставить("ПроверитьЗаполнитьНазначение");
		СтруктураДействий.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
		
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		игр_ЗаполнитьЦены(Объект.Товары);
	
	КонецЦикла;
	
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	ЗаполнитьПризнакРасхождение();
	
КонецПроцедуры

&НаКлиенте
Процедура игр_ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)
	
	игр_ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры


#КонецОбласти