#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытий

#Область ОбъявлениеБиблиотеки

// Заполняет стандартные свойства библиотеки или конфигурации, требуемые для ее использования.
// Поставляемая конфигурация должна рассматриваться как потенциальная библиотека, поэтому
// ее свойства описываются не только в метаданных, но и в коде, как и для любой библиотеки.
//
// Под библиотекой понимается одна или несколько подсистем, а под конфигурацией все, что
// не принадлежит ни одной библиотеке. Библиотека у которой имя совпадает с именем
// конфигурации в метаданных, считается конечной конфигурацией.
// БСП - всегда первая, конечная конфигурация всегда последняя (например, для порядка обновления ИБ).
// 
// Параметры:
//  Описание - Структура со свойствами:
//
//   Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   ТребуемыеПодсистемы - Массив значений типа Строка, содержащий имена других библиотек.
//                         После получения описаний всех библиотек будет проверено, что
//                         все библиотеки требуемые другими библиотеками зарегистрированы и
//                         будет построена линейная последовательность библиотек по мере
//                         их требуемости. При наличии взаимозависимости или их отсутствии
//                         порядок определяется порядком добавления основных модулей библиотек
//                         в процедуре ПриДобавленииПодсистемы общего модуля
//                         ПодсистемыКонфигурацииПереопределяемый.
//                         Порядок используется при выполнении обработчиков обновления
//                         информационной базы.
//
// Для стандартных процедур в основных модулях библиотек рекомендуется использовать
// не копию комментария, а ссылку на комментарий в модуле этом модуле.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя = "ЗарплатаКадрыДляКазахстанаБазовая";
	Описание.Версия = "3.1.1.78";
	Описание.РежимВыполненияОтложенныхОбработчиков = "Параллельно";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийОбновленияИнформационнойБазы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
//
// Параметры:
//  Обработчики - это таблица значений, возвращаемая функцией
//                НоваяТаблицаОбработчиковОбновления модуля ОбновлениеИнформационнойБазы.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия    = "1.0.0.0";
//  Обработчик.Процедура = "ОбновлениеИБ.ПерейтиНаВерсию_1_0_0_0";
// 
//  Все свойства обработчика см. в комментарии к функции
//  НоваяТаблицаОбработчиковОбновления в модуле ОбновлениеИнформационнойБазы.
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.РегистрыСведений.МесячныйРасчетныйПоказатель) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.0.0.0";
		Обработчик.Процедура = "РегистрыСведений.МесячныйРасчетныйПоказатель.НачальноеЗаполнение";
		Обработчик.ОбщиеДанные = Истина;
		Обработчик.НачальноеЗаполнение = Истина;
	КонецЕсли;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "Справочники.ВидыДоходов.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "Справочники.КатегорииЛицПолучателейЛьготИПН.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "РегистрыСведений.РазмерыЛьготИПН.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "Справочники.ВидыВычетовИПН.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахИПН.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "РегистрыСведений.РазмерыВычетовИПН.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "РегистрыСведений.ПрименениеВычетовПоВидамДохода.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахНалоговСборовОтчислений.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.СоздатьВалютуУчетаЗаработнойПлаты";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОбновлениеПоказателейОтОбратного";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.1.8";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОбновлениеПодсистемыВоинскогоУчета";
	Обработчик.МонопольныйРежим = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.1.10";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОчисткаИзмеренияФизическоеЛицоПоИПНиСН";
	Обработчик.МонопольныйРежим = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.1.15";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОбновлениеПоказателейНачислений30115";
	Обработчик.МонопольныйРежим = Истина;
	
	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.РегистрыСведений.МинимальнаяОплатаТрудаРФ) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.0.1.17";
		Обработчик.Процедура = "РегистрыСведений.МинимальнаяОплатаТрудаРФ.ЗаполнитьМРОТ";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;
	
	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.РегистрыСведений.МесячныйРасчетныйПоказатель) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.0.1.17";
		Обработчик.Процедура = "РегистрыСведений.МесячныйРасчетныйПоказатель.ЗаполнитьМРП";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.2.1";
	Обработчик.Процедура = "РегистрыСведений.РазмерыЛьготИПН.ЗаполнитьРазмерыЛьготИПН";
	Обработчик.МонопольныйРежим = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.2.2";
	Обработчик.Процедура = "Справочники.РегламентированныеОтчеты.ЗаполнитьСписокРегламентированныхОтчетов";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.2.2";
	Обработчик.Процедура = "РегистрыСведений.СкрытыеРегламентированныеОтчеты.СкрытьВосстановитьОтчеты";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.2.2";
	Обработчик.Процедура = "Справочники.РегламентированныеОтчеты.УстановитьСнятьПометкуНаУдаление";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.2.3";
	Обработчик.Процедура = "Справочники.РегламентированныеОтчеты.ЗаполнитьСписокРегламентированныхОтчетов";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.2.3";
	Обработчик.Процедура = "РегистрыСведений.СкрытыеРегламентированныеОтчеты.СкрытьВосстановитьОтчеты";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.2.3";
	Обработчик.Процедура = "Справочники.РегламентированныеОтчеты.УстановитьСнятьПометкуНаУдаление";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.2.3";
	Обработчик.Процедура = "Справочники.УченыеЗвания.НачальноеЗаполнение";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.2.3";
	Обработчик.Процедура = "Справочники.УченыеСтепени.НачальноеЗаполнение";
	Обработчик.ОбщиеДанные = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.2.3";
	Обработчик.Процедура = "РегистрыСведений.СтавкаРефинансированияЦБ.ЗаполнитьЗначенияСтавкиРефинансированияЦБ";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.3.5";
	Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахОСМС.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.3.5";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьНастройкиПоСоциальномуМедицинскомуСтрахованию";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.3.6";
	Обработчик.Процедура = "Справочники.РегламентированныеОтчеты.ЗаполнитьСписокРегламентированныхОтчетов";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.3.6";
	Обработчик.Процедура = "РегистрыСведений.СкрытыеРегламентированныеОтчеты.СкрытьВосстановитьОтчеты";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.3.6";
	Обработчик.Процедура = "Справочники.РегламентированныеОтчеты.УстановитьСнятьПометкуНаУдаление";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.4.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ПереименоватьРегламентированныйОтчетСтатистика1ТКвартальная";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.1";
	Обработчик.Процедура = "Справочники.РегламентированныеОтчеты.ЗаполнитьСписокРегламентированныхОтчетов";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.1";
	Обработчик.Процедура = "РегистрыСведений.СкрытыеРегламентированныеОтчеты.СкрытьВосстановитьОтчеты";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.1";
	Обработчик.Процедура = "Справочники.РегламентированныеОтчеты.УстановитьСнятьПометкуНаУдаление";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОбновлениеСправочникаСоставВоеннослужащих";

	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.РегистрыСведений.МинимальнаяОплатаТрудаРФ) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.0.5.1";
		Обработчик.Процедура = "РегистрыСведений.МинимальнаяОплатаТрудаРФ.ЗаполнитьМРОТ";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;
	
	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.РегистрыСведений.МесячныйРасчетныйПоказатель) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.0.5.1";
		Обработчик.Процедура = "РегистрыСведений.МесячныйРасчетныйПоказатель.ЗаполнитьМРП";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.1";
	Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахНалоговСборовОтчислений.ДобавитьСведенияОСтавкахНалоговСборовОтчислений2018";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.УстановитьПризнакНеИспользуетсяВидыВычетовИПН";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.1";
	Обработчик.Процедура = "Справочники.ВидыВычетовИПН.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьДействуетСПрочиеВычетыФизическихЛицИПН";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.1";
	Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахОСМС.ЗаполнитьСведенияОСтавкахОСМС";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.2";
	Обработчик.Процедура = "РегистрыСведений.КоэффициентыСтавкиРефинансированияНБ.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.3";
	Обработчик.Процедура = "Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ОбновитьСправочникДоходыНеПодлежащиеНалогообложениюЧастично2018";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.3";
	Обработчик.Процедура = "Справочники.ВидыДоходов.ЗаполнитьПризнакиВидовДоходов2018";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.3";
	Обработчик.Процедура = "РегистрыСведений.НалогообложениеНачислений.ЗаполнитьНалогообложениеНачисленийПоКатегориям20180101";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.3";
	Обработчик.Процедура = "РегистрыСведений.СтавкаРефинансированияЦБ.ЗаполнитьЗначенияСтавкиРефинансированияЦБ";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.5.4";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьРегистрУчетнаяПолитикаПоНалоговомуУчету";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.0";
	Обработчик.Процедура = "Справочники.СтраныМира.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.15";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОбновитьВыплатаБывшимСотрудникам";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.15";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОбновитьРегистрацияПрочихДоходов";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.15";
	Обработчик.Процедура = "Справочники.ПрожиточныеМинимумы.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.15";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОбновитьПорядокУчетаРабочегоВремени";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.0.15";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОбновлениеПоказателейОтОбратного";
	Обработчик.МонопольныйРежим = Истина;

	// Заполнение Классификатора банков при обновлении
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.15";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "Справочники.КлассификаторБанков.ОбновлениеКлассификатора_ОбработатьДанные";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.15";
	Обработчик.Процедура = "Справочники.РегламентированныеОтчеты.ЗаполнитьСписокРегламентированныхОтчетов";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.15";
	Обработчик.Процедура = "РегистрыСведений.КоэффициентыСтавкиРефинансированияНБ.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.15";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.УдалитьНеиспользуемыеНачисления";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.15";
	Обработчик.Процедура = "Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ОбновитьСправочникДоходыНеПодлежащиеНалогообложениюЧастично2018";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.15";
	Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахОСМС.ОбновитьСведенияОСтавкахОСМС2019";
	
	//Обработчик = Обработчики.Добавить();
	//Обработчик.Версия = "3.1.1.15";
	//Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнениеРегистраНалогиВзносыРасчетыНалогоплательщиков";
	
	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.РегистрыСведений.МинимальнаяОплатаТрудаРФ) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.1.15";
		Обработчик.Процедура = "РегистрыСведений.МинимальнаяОплатаТрудаРФ.ЗаполнитьМРОТ";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;
	
	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.РегистрыСведений.МесячныйРасчетныйПоказатель) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.1.15";
		Обработчик.Процедура = "РегистрыСведений.МесячныйРасчетныйПоказатель.ЗаполнитьМРП";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.16";
	Обработчик.Процедура = "Справочники.ВидыДоходов.ЗаполнитьПризнакиВидовДоходов2019";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.16";
	Обработчик.Процедура = "РегистрыСведений.НалогообложениеНачислений.ЗаполнитьНалогообложениеНачисленийПоКатегориям20190101";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.16";
	Обработчик.Процедура = "Справочники.ПрожиточныеМинимумы.ОбновитьПрожиточныеМинимумы";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.16";
	Обработчик.Процедура = "РегистрыСведений.РазмерыВычетовИПН.НачальноеЗаполнение";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.16";
	Обработчик.Процедура = "Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ОбновитьСправочникДоходыНеПодлежащиеНалогообложениюЧастично2019";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.16";
	Обработчик.Процедура = "Справочники.ВидыВычетовИПН.ОбновитьСправочникВидыВычетовИПН2019";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.19";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОбновлениеРегистраНалогиВзносыРасчетыНалогоплательщиков";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.24";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "Справочники.КлассификаторБанков.ОбновлениеКлассификатора_ОбработатьДанные";
	Обработчик.ОбщиеДанные = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.16";
	Обработчик.Процедура = "РегистрыСведений.НалогообложениеНачислений.ЗаполнитьНалогообложениеНачисленийПоКатегориям20190101";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.26";
	Обработчик.Процедура = "РегистрыСведений.НалогообложениеНачислений.ЗаполнитьНалогообложениеНачисленийГПХ20190101";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.26";
	Обработчик.Процедура = "ОрганизационнаяСтруктура.УстановитьПараметрыНабораСвойствСтруктураПредприятия";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.27";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.УстановитьПоказателиНачисленийПоСреднемуЗаработкуОплатаБольничного";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.27";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.УстановитьУчетВремениВДняхЧасах";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.28";
	Обработчик.Процедура = "РегистрыСведений.СтавкаРефинансированияЦБ.ЗаполнитьЗначенияСтавкиРефинансированияЦБ";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.30";
	Обработчик.Процедура = "РегистрыСведений.НалогообложениеНачислений.ЗаполнитьНалогообложениеКомпенсацияВыходноеПособие20190101";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.33";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьПризнакиДублированияНачисленийДляОплатаБольничногоЛистаЗаСчетРаботодателя";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.37";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьКоэффициентИндексацииЗаработка";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.37";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьСпособРасчетаСуммКПеречислению";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.38";
	Обработчик.Процедура = "Справочники.РегламентированныеОтчеты.ЗаполнитьСписокРегламентированныхОтчетов";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.42";
	Обработчик.Процедура = "РегистрыСведений.ПрименениеВычетовПоВидамДохода.НачальноеЗаполнение";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.42";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("93253acb-9f8a-4c10-bc8e-85fcd09c9d32");
	Обработчик.Процедура = "РегистрыНакопления.ДополнениеРасчетнойБазыУдержаний.ЗаполнитьДополнениеРасчетнойБазыУдержаний";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение регистра ""Дополнение расчетной базы удержаний"".'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.45";
	Обработчик.Процедура = "РегистрыСведений.СтавкаРефинансированияЦБ.ЗаполнитьЗначенияСтавкиРефинансированияЦБ";
	Обработчик.ОбщиеДанные = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.47";
	Обработчик.Процедура = "Справочники.ВидыДоходов.ЗаполнитьПризнакиВидовДоходов2020";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.47";
	Обработчик.Процедура = "РегистрыСведений.НалогообложениеНачислений.ЗаполнитьНалогообложениеНачисленийПоКатегориям20200101";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.47";
	Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахОСМС.ОбновитьСведенияОСтавкахОСМС2020";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.47";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьВычетВОСМС";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.47";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОбновитьВыходныеРабочиеДни";
	
	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.РегистрыСведений.МинимальнаяОплатаТрудаРФ) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.1.53";
		Обработчик.Процедура = "РегистрыСведений.МинимальнаяОплатаТрудаРФ.ЗаполнитьМРОТ";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;
	
	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.РегистрыСведений.МесячныйРасчетныйПоказатель) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.1.53";
		Обработчик.Процедура = "РегистрыСведений.МесячныйРасчетныйПоказатель.ЗаполнитьМРП";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.58";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОбновитьТочностьОкругленияВОСМС";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.58";
	Обработчик.Процедура = "РегистрыСведений.СтавкаРефинансированияЦБ.ЗаполнитьЗначенияСтавкиРефинансированияЦБ";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.58";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьСведенияОСтавкахНалоговСборовОтчислений";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.60";
	Обработчик.Процедура = "Справочники.ПрожиточныеМинимумы.ОбновитьПрожиточныеМинимумы";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.60";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОбновитьИспользованиеВремениКомпенсацииОтпуска";
	
	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.Справочники.ОснованияУвольнения) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.1.61";
		Обработчик.Процедура = "Справочники.ОснованияУвольнения.ЗагрузитьКлассификатор";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.62";
	Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахНалоговСборовОтчислений.ДобавитьСведенияОСтавкахНалоговСборовОтчислений20200601";
	
	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.РегистрыСведений.МесячныйРасчетныйПоказатель) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.1.62";
		Обработчик.Процедура = "РегистрыСведений.МесячныйРасчетныйПоказатель.ЗаполнитьМРП";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.62";
	Обработчик.Процедура = "РегистрыСведений.СтавкаРефинансированияЦБ.НачальноеЗаполнение";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.62";
	Обработчик.Процедура = "РегистрыСведений.КоэффициентыСтавкиРефинансированияНБ.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.62";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОтработаноДнейЧасов";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.64";
	Обработчик.Процедура = "Справочники.ВидыОтправляемыхДокументов.ОбновитьНаименованияПредопределенныхЭлементов";

	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.Справочники.РегламентированныеОтчеты) Тогда
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.64";
	Обработчик.Процедура = "Справочники.РегламентированныеОтчеты.ЗаполнитьСписокРегламентированныхОтчетов";
	Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.66";
	Обработчик.Процедура = "РегистрыСведений.КоэффициентыСтавкиРефинансированияНБ.ОбновитьСведенияКоэффициентыСтавкиРефинансированияНБ2020";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.66";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.УстановитьУчетВремениВДняхЧасахДляБольничных";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.66";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОбновитьВидыОтпусковТКРК202007";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.68";
	Обработчик.Процедура = "ЗарплатаКадрыСоставДокументов.ЗаполнитьСоставСотрудниковДокумента";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("7070b35e-a85d-4efe-818b-199158ece401");
	Обработчик.Комментарий = НСтр("ru='Заполняет состав сотрудников и физических лиц документов'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.68";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ДокументыСКраткимСоставом_ОбработатьДанныеДляПерехода";
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ДокументыСКраткимСоствомКОбработке";
	Обработчик.ОчередьОтложеннойОбработки = 1;
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.ЧитаемыеОбъекты = "Документ.НачислениеДивидендов,Документ.СведенияОНезачисленныхВзносахОтчислениях,Документ.ПеняПоВзносамИОтчислениям";
	Обработчик.ИзменяемыеОбъекты = "Документ.НачислениеДивидендов,Документ.СведенияОНезачисленныхВзносахОтчислениях,Документ.ПеняПоВзносамИОтчислениям";
	Обработчик.БлокируемыеОбъекты = "Документ.НачислениеДивидендов,Документ.СведенияОНезачисленныхВзносахОтчислениях,Документ.ПеняПоВзносамИОтчислениям";
	Обработчик.Комментарий = НСтр("ru = 'Обновление краткого состава документов ""Ведомость на перечисление взносов, отчислений"", ""Сведения о незачисленных взносах, отчислениях"", ""Пеня по взносам и отчислениям"".'");

	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.РегистрыСведений.МинимальнаяОплатаТрудаРФ) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.1.68";
		Обработчик.Процедура = "РегистрыСведений.МинимальнаяОплатаТрудаРФ.ЗаполнитьМРОТ";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;
	
	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.РегистрыСведений.МесячныйРасчетныйПоказатель) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.1.68";
		Обработчик.Процедура = "РегистрыСведений.МесячныйРасчетныйПоказатель.ЗаполнитьМРП";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли; 
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.68";
	Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахОСМС.ОбновитьСведенияОСтавкахОСМС2021";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.68";
	Обработчик.Процедура = "Справочники.ПрожиточныеМинимумы.ОбновитьПрожиточныеМинимумы";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.68";
	Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахНалоговСборовОтчислений.ДобавитьСведенияОСтавкахНалоговСборовОтчислений20210101";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.69";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьРегистрУчетнаяПолитикаПоНалоговомуУчету2020";
	
	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.Справочники.ОснованияУвольнения) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.1.69";
		Обработчик.Процедура = "Справочники.ОснованияУвольнения.ЗагрузитьКлассификатор";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;
    
   	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.69";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнениеДанныхПроизводственногоКалендаря2021";
	Обработчик.ОбщиеДанные = Истина;

   	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.71";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.УстановитьРабочееВремяДляКомандировки";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.72";
	Обработчик.Процедура = "Справочники.ВидыДоходов.ЗаполнитьПризнакиДоходаИндивидуальногоПредпринимателя";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.72";
	Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахНалоговСборовОтчислений.ДобавитьСведенияОСтавкахНалоговСборовОтчисленийДоходСубъектаПредпринимательства2021";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.72";
	Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахОСМС.ОбновитьСведенияОСтавкахОСМСДоходСубъектаПредпринимательства2021";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.72";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьРегистрУчетнаяПолитикаПоНалоговомуУчету2021";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.73";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьПризнакиДублированияНачисленийДляБольничного";
    	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.73";
	Обработчик.Процедура = "РегистрыСведений.СтавкаРефинансированияЦБ.ЗаполнитьЗначенияСтавкиРефинансированияЦБ";
	Обработчик.ОбщиеДанные = Истина;
	
    Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.73";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьРегистрУчетнаяПолитикаЗарплатаКадры";
    	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.74";
	Обработчик.Процедура = "РегистрыСведений.СтавкаРефинансированияЦБ.ЗаполнитьЗначенияСтавкиРефинансированияЦБ";
	Обработчик.ОбщиеДанные = Истина;
    
   	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.75";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОбновлениеПоказателейПрочихУдержаний";
	Обработчик.МонопольныйРежим = Истина;
	
	// Заполнение Классификатора банков при обновлении
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.75";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "Справочники.КлассификаторБанков.ОбновлениеКлассификатора_ОбработатьДанные";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.75";
	Обработчик.Процедура = "РегистрыСведений.СтавкаРефинансированияЦБ.ЗаполнитьЗначенияСтавкиРефинансированияЦБ";
	Обработчик.ОбщиеДанные = Истина;
	
   	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.76";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОбновитьВидВремениДоплатыЗаСовмещение";
	Обработчик.МонопольныйРежим = Истина;
	
	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.РегистрыСведений.МинимальнаяОплатаТрудаРФ) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.1.78";
		Обработчик.Процедура = "РегистрыСведений.МинимальнаяОплатаТрудаРФ.ЗаполнитьМРОТ";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;
	
	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.РегистрыСведений.МесячныйРасчетныйПоказатель) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.1.78";
		Обработчик.Процедура = "РегистрыСведений.МесячныйРасчетныйПоказатель.ЗаполнитьМРП";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли; 
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.78";
	Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахОСМС.ОбновитьСведенияОСтавкахОСМС2022";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.78";
	Обработчик.Процедура = "Справочники.ПрожиточныеМинимумы.ОбновитьПрожиточныеМинимумы";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.78";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьРегистрСведенийОФизическихЛицахУчастникахВОВ";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.78";
	Обработчик.Процедура = "РегистрыСведений.РазмерыВычетовИПН.ОбновитьРазмерыВычетовИПН2022";
	
КонецПроцедуры

// Вызывается перед процедурами-обработчиками обновления данных ИБ.
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры

// Вызывается после завершения монопольного обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсия       - Строка - версия подсистемы до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсия          - Строка - версия подсистемы после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков обновления
//                                             подсистемы, сгруппированных по номеру версии.
//                            Процедура обхода выполненных обработчиков:
//
//	Для Каждого Версия Из ВыполненныеОбработчики.Строки Цикл
//		
//		Если Версия.Версия = "*" Тогда
//			// Обработчик, который может выполнятся при каждой смене версии.
//		Иначе
//			// Обработчик, который выполняется для определенной версии.
//		КонецЕсли;
//		
//		Для Каждого Обработчик Из Версия.Строки Цикл
//			...
//		КонецЦикла;
//		
//	КонецЦикла;
//
//   ВыводитьОписаниеОбновлений - Булево (возвращаемое значение)- если установить Истина,
//                                тогда выводить форму с описанием обновлений.
//   МонопольныйРежим           - Булево - признак выполнения обновления в монопольном режиме.
//                                Истина - обновление выполнялось в монопольном режиме.
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
КонецПроцедуры

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
	// Не используется в БСП.
	
КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиОбновленияИнформационнойБазы

Процедура ОбновлениеПодсистемыВоинскогоУчета() Экспорт
	
	// Справочник СоставыВоеннослужащих
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоставыВоеннослужащих.Ссылка
		|ИЗ
		|	Справочник.СоставыВоеннослужащих КАК СоставыВоеннослужащих";
		
	МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	УдалитьОбъекты(МассивСсылок);
	
	Справочники.СоставыВоеннослужащих.НачальноеЗаполнение();
	
	// Справочник ЗванияГражданскогоВоинскогоУчета
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗванияГражданскогоВоинскогоУчета.Ссылка
		|ИЗ
		|	Справочник.ЗванияГражданскогоВоинскогоУчета КАК ЗванияГражданскогоВоинскогоУчета";
		
	МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	УдалитьОбъекты(МассивСсылок);
	
	Справочники.ЗванияГражданскогоВоинскогоУчета.НачальноеЗаполнение();
	
КонецПроцедуры

Процедура ОчисткаИзмеренияФизическоеЛицоПоИПНиСН() Экспорт
	
	НаборЗаписей = РегистрыНакопления.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.СоздатьНаборЗаписей();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор
		|ИЗ
		|	РегистрНакопления.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами КАК НалогиВзносыОтчисленияРасчетыСБюджетомИФондами
		|ГДЕ
		|	НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.ВидНалогаВзносаОтчисления В (ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН), ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СН))
		|	И НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.ФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор); 
		НаборЗаписей.Прочитать();
		Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
			Если ЗначениеЗаполнено(ЗаписьНабора.ФизическоеЛицо)
				И (ЗаписьНабора.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ИПН 
				ИЛИ ЗаписьНабора.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.СН) Тогда
				ЗаписьНабора.ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
			КонецЕсли;
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаменитьСсылкиВСсылочныхОбъектах(СоответствиеСсылок, МассивСсылок, РеквизитыМетаданных, ИзмененныеОбъекты)
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗаменитьСсылкиВСсылочныхОбъектах(СоответствиеСсылок, МассивСсылок, РеквизитыМетаданных, ИзмененныеОбъекты);
КонецПроцедуры

Процедура ЗаменитьСсылкиВРегистре(МетаданныеРегистра, Поля, СоответствиеСсылок) Экспорт
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗаменитьСсылкиВРегистре(МетаданныеРегистра, Поля, СоответствиеСсылок);
КонецПроцедуры

Функция СоответствиеСсылок(МетаданныеСправочника, ИмяКлюча)
	Возврат ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.СоответствиеСсылок(МетаданныеСправочника, ИмяКлюча);
КонецФункции

Процедура ЗаменитьСсылкиНаБанкиВОбъектах(ПолноеИмяОбъектаМетаданных)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СписокСсылок.Ссылка,
		|	КлассификаторБанковРФ.Ссылка КАК Банк
		|ИЗ
		|	&ПолноеИмяОбъектаМетаданных КАК СписокСсылок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанковРФ КАК КлассификаторБанковРФ
		|		ПО СписокСсылок.УдалитьБанк.Код = КлассификаторБанковРФ.Код
		|ГДЕ
		|	СписокСсылок.УдалитьБанк <> ЗНАЧЕНИЕ(Справочник.УдалитьБанки.ПустаяСсылка)
		|	И СписокСсылок.Банк = ЗНАЧЕНИЕ(Справочник.КлассификаторБанковРФ.ПустаяСсылка)";
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПолноеИмяОбъектаМетаданных", ПолноеИмяОбъектаМетаданных);
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОбъектСБанком = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектСБанком.Банк = Выборка.Банк;
		
		ОбъектСБанком.ОбменДанными.Загрузка = Истина;
		ОбъектСБанком.Записать();
		
	КонецЦикла; 
		
КонецПроцедуры

Процедура ОбновлениеПоказателейНачислений30115() Экспорт
	
	НормаЧасовПриСуммированномУчетеСсылка = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.НормаЧасовПриСуммированномУчете");
	
	Если НормаЧасовПриСуммированномУчетеСсылка = Неопределено Тогда
		Справочники.ПоказателиРасчетаЗарплаты.СоздатьПоказательНормаЧасовПриСуммированномУчете();
		ОбновитьПовторноИспользуемыеЗначения();
		Справочники.ПоказателиРасчетаЗарплаты.ОбновитьПоказателиПредопределенныхСпособовРасчета();
	КонецЕсли;
	
	КоличествоДнейКомпенсацииСсылка = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.КоличествоДнейКомпенсации");
	
	Если КоличествоДнейКомпенсацииСсылка = Неопределено Тогда
		Справочники.ПоказателиРасчетаЗарплаты.СоздатьПоказательКоличествоДнейКомпенсации();
		ОбновитьПовторноИспользуемыеЗначения();
		Справочники.ПоказателиРасчетаЗарплаты.ОбновитьПоказателиПредопределенныхСпособовРасчета();
	Иначе
		Если ЗначениеЗаполнено(КоличествоДнейКомпенсацииСсылка) Тогда
			Объект = КоличествоДнейКомпенсацииСсылка.ПолучитьОбъект();
			Попытка
				Объект.Заблокировать();
			Исключение
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Невозможно изменить показатель """"%2"""". Возможно, он редактируется другим пользователем'"), Объект.Наименование);
				ВызватьИсключение ТекстСообщения;
			КонецПопытки;
			Объект.НеИспользуется = ЛОЖЬ;
			Объект.Наименование = НСтр("ru = 'Количество дней (часов) компенсации отпуска'");
			Объект.КраткоеНаименование = НСтр("ru = 'Дней(часов) компенс..'");
			Объект.Записать();
		КонецЕсли;

	КонецЕсли;
	
	КоличествоДнейОтпускаСсылка = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.КоличествоДнейОтпуска");
	
	Если КоличествоДнейОтпускаСсылка = Неопределено Тогда
		Справочники.ПоказателиРасчетаЗарплаты.СоздатьПоказательКоличествоДнейОтпуска();
		ОбновитьПовторноИспользуемыеЗначения();
		Справочники.ПоказателиРасчетаЗарплаты.ОбновитьПоказателиПредопределенныхСпособовРасчета();
	Иначе
		Если ЗначениеЗаполнено(КоличествоДнейОтпускаСсылка) Тогда
			Объект = КоличествоДнейОтпускаСсылка.ПолучитьОбъект();
			Попытка
				Объект.Заблокировать();
			Исключение
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Невозможно изменить показатель """"%2"""". Возможно, он редактируется другим пользователем'"), Объект.Наименование);
				ВызватьИсключение ТекстСообщения;
			КонецПопытки;
			Объект.НеИспользуется = ЛОЖЬ;
			Объект.Наименование = НСтр("ru = 'Количество дней (часов) отпуска'");
			Объект.КраткоеНаименование = НСтр("ru = 'Дней(часов) отпуска'");
			Объект.Записать();
		КонецЕсли;

	КонецЕсли;
	
	СреднийЗаработокФСССсылка = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.СреднийЗаработокФСС");
		
	Если НЕ СреднийЗаработокФСССсылка = Неопределено Тогда
		Справочники.ПоказателиРасчетаЗарплаты.ОтключитьИспользованиеПредопределенногоЭлемента("СреднийЗаработокФСС");
	КонецЕсли;
	
	РазмерПособияПоУходуЗаРебенкомДоТрехЛетСсылка = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.РазмерПособияПоУходуЗаРебенкомДоТрехЛет");
		
	Если НЕ РазмерПособияПоУходуЗаРебенкомДоТрехЛетСсылка = Неопределено Тогда
		Справочники.ПоказателиРасчетаЗарплаты.ОтключитьИспользованиеПредопределенногоЭлемента("РазмерПособияПоУходуЗаРебенкомДоТрехЛет");
	КонецЕсли;
	
	// СкорректироватьФормулуРасчетаНачисленийОтпуска
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Начисления.Ссылка
	|ИЗ
	|	ПланВидовРасчета.Начисления.Показатели КАК Начисления
	|ГДЕ
	|	Начисления.Ссылка.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаОтпуска)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивВидовРасчета = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		НачислениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		НачислениеОбъект.ФормулаРасчета = "СреднийЗаработокОбщий * КоличествоДнейОтпуска * КоэффициентИндексацииСреднегоЗаработка";
		ЗарплатаКадрыРасширенный.ОбновитьПоказателиФормулыРасчета(НачислениеОбъект, Ложь);
		РасчетЗарплатыРасширенный.ЗаполнитьИнформациюОПоказателяхВидаРасчета(НачислениеОбъект);
		РасчетЗарплатыРасширенный.ЗаполнитьИнформациюОбУчетеВремени(НачислениеОбъект);
		РасчетЗарплатыРасширенный.ЗаполнитьИнформациюОбУчетеСреднегоЗаработка(НачислениеОбъект);
		НачислениеОбъект.НачисляетсяВЦеломЗаМесяц = РасчетЗарплатыРасширенный.НачислениеВыполняетсяВЦеломЗаМесяц(НачислениеОбъект);
		МассивВидовРасчета.Добавить(НачислениеОбъект);
	КонецЦикла;
	
	РасчетЗарплатыРасширенный.ЗаписатьПакетВидовРасчета(МассивВидовРасчета);
	
	// СкорректироватьФормулуРасчетаНачисленийКомпенсацииОтпуска
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Начисления.Ссылка
	|ИЗ
	|	ПланВидовРасчета.Начисления.Показатели КАК Начисления
	|ГДЕ
	|	Начисления.Ссылка.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивВидовРасчета = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		НачислениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		НачислениеОбъект.ФормулаРасчета = "СреднийЗаработокОбщий * КоличествоДнейКомпенсации * КоэффициентИндексацииСреднегоЗаработка";
		НачислениеОбъект.ВидВремени = Перечисления.ВидыРабочегоВремениСотрудников.ДополнительноОплачиваемоеВПределахНормы;
		ЗарплатаКадрыРасширенный.ОбновитьПоказателиФормулыРасчета(НачислениеОбъект, Ложь);
		РасчетЗарплатыРасширенный.ЗаполнитьИнформациюОПоказателяхВидаРасчета(НачислениеОбъект);
		РасчетЗарплатыРасширенный.ЗаполнитьИнформациюОбУчетеВремени(НачислениеОбъект);
		РасчетЗарплатыРасширенный.ЗаполнитьИнформациюОбУчетеСреднегоЗаработка(НачислениеОбъект);
		НачислениеОбъект.НачисляетсяВЦеломЗаМесяц = РасчетЗарплатыРасширенный.НачислениеВыполняетсяВЦеломЗаМесяц(НачислениеОбъект);
		МассивВидовРасчета.Добавить(НачислениеОбъект);
	КонецЦикла;
	
	РасчетЗарплатыРасширенный.ЗаписатьПакетВидовРасчета(МассивВидовРасчета);
	
	// СкорректироватьФормулуРасчетаПростоев
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Начисления.Ссылка,
	|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|ГДЕ
	|	(Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаПростояПоВинеРаботодателя)
	|			ИЛИ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаПростояПоНезависящимОтРаботодателяПричинам))";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивВидовРасчета = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		НачислениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаПростояПоВинеРаботодателя Тогда
			НачислениеОбъект.ФормулаРасчета = "СреднийЗаработокОбщий * (1/2) * ВремяВДняхЧасах * КоэффициентИндексацииСреднегоЗаработка";
		Иначе
			НачислениеОбъект.ФормулаРасчета = "Макс(МРОТ / НормаДней * ВремяВДнях, СреднийЗаработокОбщий * (1/2) * ВремяВДнях * КоэффициентИндексацииСреднегоЗаработка)";
			НачислениеОбъект.СпособРасчета = Перечисления.СпособыРасчетаНачислений.ПроизвольнаяФормула;
		КонецЕсли;
		ЗарплатаКадрыРасширенный.ОбновитьПоказателиФормулыРасчета(НачислениеОбъект, Ложь);
		РасчетЗарплатыРасширенный.ЗаполнитьИнформациюОПоказателяхВидаРасчета(НачислениеОбъект);
		РасчетЗарплатыРасширенный.ЗаполнитьИнформациюОбУчетеВремени(НачислениеОбъект);
		РасчетЗарплатыРасширенный.ЗаполнитьИнформациюОбУчетеСреднегоЗаработка(НачислениеОбъект);
		НачислениеОбъект.НачисляетсяВЦеломЗаМесяц = РасчетЗарплатыРасширенный.НачислениеВыполняетсяВЦеломЗаМесяц(НачислениеОбъект);
		МассивВидовРасчета.Добавить(НачислениеОбъект);
	КонецЦикла;
	
	РасчетЗарплатыРасширенный.ЗаписатьПакетВидовРасчета(МассивВидовРасчета);
	
	// СкорректироватьПоказателиОплатаБольничногоЛистаЗаСчетРаботодателя
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Начисления.Ссылка,
	|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоЛистаЗаСчетРаботодателя)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивВидовРасчета = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		НачислениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗарплатаКадрыРасширенный.ЗаполнитьПоказателиПредопределенногоСпособаРасчета(НачислениеОбъект.СпособРасчета, НачислениеОбъект.Показатели);
		МассивВидовРасчета.Добавить(НачислениеОбъект);
	КонецЦикла;
	
	РасчетЗарплатыРасширенный.ЗаписатьПакетВидовРасчета(МассивВидовРасчета);
	
	ОбновитьПовторноИспользуемыеЗначения();
	Справочники.ПоказателиРасчетаЗарплаты.ОбновитьПоказателиПредопределенныхСпособовРасчета();


КонецПроцедуры

Процедура УдалитьРеглОтчетыРФ() Экспорт
	
	НачатьТранзакцию();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	РегламентированныеОтчеты.Ссылка КАК Ссылка,
	|	РегламентированныеОтчеты.Наименование КАК Наименование
	|ИЗ
	|	Справочник.РегламентированныеОтчеты КАК РегламентированныеОтчеты
	|ГДЕ
	|	РегламентированныеОтчеты.ПометкаУдаления
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		УдаляемыйОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Если НЕ УдаляемыйОбъект = Неопределено Тогда
			УдаляемыйОбъект.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Процедура СоздатьВалютуУчетаЗаработнойПлаты() Экспорт
	
	// Создаем "Тенге".
	
	Коды = Новый Массив;
	Коды.Добавить("398");
	
	РаботаСКурсамиВалют.ДобавитьВалютыПоКоду(Коды);
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_0_3

Процедура ЗаполнитьНастройкиПоСоциальномуМедицинскомуСтрахованию() Экспорт
	
	ЗаполнитьПодлежитСоциальномуМедицинскомуСтрахованию();
	Справочники.ВидыДоходов.ЗаполнитьПризнакиВидовДоходов();
	РегистрыСведений.НалогообложениеНачислений.ЗаполнитьНалогообложениеНачисленийПоКатегориям20170701();
	РегистрыСведений.СведенияОСтавкахОСМС.ЗаполнитьСведенияОСтавкахОСМС();
	
КонецПроцедуры


Процедура ЗаполнитьПодлежитСоциальномуМедицинскомуСтрахованию()
	
	НаборЗаписей = РегистрыСведений.СтатусФизическихЛицКакНалогоплательщиков.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Для Каждого СтрокаНабора из НаборЗаписей Цикл
		Если СтрокаНабора.ПодлежитСоциальномуСтрахованию Тогда
			СтрокаНабора.ПодлежитСоциальномуМедицинскомуСтрахованию = Истина;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_0_4

Процедура ПереименоватьРегламентированныйОтчетСтатистика1ТКвартальная() Экспорт

	// Переименовываем ссылку удаленного отчета "1ТКвартальная" 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РегламентированныйОтчет.Ссылка,
	|	РегламентированныйОтчет.ИсточникОтчета
	|ИЗ
	|	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
	|ГДЕ
	|	РегламентированныйОтчет.ИсточникОтчета В(&СписокИсточниковОтчета)";
	
	СписокИсточников =  Новый СписокЗначений;
	СписокИсточников.Добавить("РегламентированныйОтчет1ТКвартальная");
	
	Запрос.УстановитьПараметр("СписокИсточниковОтчета", СписокИсточников);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОтчетОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Источник = Выборка.ИсточникОтчета;
		ОтчетОбъект.ИсточникОтчета = "РегламентированныйОтчетСтатистика1ТКвартальная";
		ОтчетОбъект.ОбменДанными.Загрузка = Истина;
		ОтчетОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры  

#КонецОбласти

#Область Обновление_3_0_5

Процедура ОбновлениеСправочникаСоставВоеннослужащих() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоставыВоеннослужащих.Ссылка КАК СоставВоеннослужащих,
	|	СоставыВоеннослужащих.Наименование,
	|	СоставыВоеннослужащих.КатегорияСоставаВоеннослужащих,
	|	СоставыВоеннослужащих.ОфицерскийСостав
	|ИЗ
	|	Справочник.СоставыВоеннослужащих КАК СоставыВоеннослужащих";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Пока Выборка.СледующийПоЗначениюПоля("СоставВоеннослужащих") Цикл
			СоставВоеннослужащихОбъект = Выборка.СоставВоеннослужащих.ПолучитьОбъект();
			Если Выборка.ОфицерскийСостав Тогда
				СоставВоеннослужащихОбъект.КатегорияСоставаВоеннослужащих = Перечисления.КатегорииСоставаВоеннослужащих.Офицеры;
			ИначеЕсли НЕ Выборка.ОфицерскийСостав И  СоставВоеннослужащихОбъект.Наименование = НСтр("ru='Рядовые (солдаты, матросы)'") Тогда
				СоставВоеннослужащихОбъект.КатегорияСоставаВоеннослужащих = Перечисления.КатегорииСоставаВоеннослужащих.Солдаты;
			Иначе
				СоставВоеннослужащихОбъект.КатегорияСоставаВоеннослужащих = Перечисления.КатегорииСоставаВоеннослужащих.Сержанты;
			КонецЕсли;
			СоставВоеннослужащихОбъект.Записать();
		КонецЦикла;
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура УстановитьПризнакНеИспользуетсяВидыВычетовИПН() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыВычетовИПН.Ссылка
		|ИЗ
		|	Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|ГДЕ
		|	ВидыВычетовИПН.Предопределенный = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Приоритет = 8;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СправочникОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		СправочникОбъект.НеИспользуется = Истина;
		СправочникОбъект.Приоритет = Приоритет;
		СправочникОбъект.Записать();
		Приоритет = Приоритет + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДействуетСПрочиеВычетыФизическихЛицИПН() Экспорт
	
	НаборЗаписей = РегистрыСведений.ПрочиеВычетыФизическихЛицИПН.СоздатьНаборЗаписей();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрочиеВычетыФизическихЛицИПН.Регистратор
		|ИЗ
		|	РегистрСведений.ПрочиеВычетыФизическихЛицИПН КАК ПрочиеВычетыФизическихЛицИПН
		|ГДЕ
		|	ПрочиеВычетыФизическихЛицИПН.ДействуетС = &ПустаяДата";
	
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.Регистратор);
		НаборЗаписей.Прочитать();
		Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
			ЗаписьНабора.ДействуетС = ЗаписьНабора.Период;
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРегистрУчетнаяПолитикаПоНалоговомуУчету() Экспорт
	
	НаборЗаписей = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СоздатьНаборЗаписей();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетнаяПолитикаОрганизаций.Период,
		|	УчетнаяПолитикаОрганизаций.Организация,
		|	УчетнаяПолитикаОрганизаций.УдалитьПлательщикОППВ КАК ПлательщикОППВ
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НаборЗаписей.Отбор.Организация.Установить(ВыборкаДетальныеЗаписи.Организация);
		НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Организация = ВыборкаДетальныеЗаписи.Организация;
			НоваяЗапись.Период = ВыборкаДетальныеЗаписи.Период;
			НоваяЗапись.ПлательщикОППВ = ВыборкаДетальныеЗаписи.ПлательщикОППВ;
		Иначе
			Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
				ЗаписьНабора.ПлательщикОППВ = ВыборкаДетальныеЗаписи.ПлательщикОППВ;
			КонецЦикла;
		КонецЕсли;
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Обновление_3_1_0

Процедура ОбновитьВыплатаБывшимСотрудникам() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияУдержанияВзносы.Ссылка КАК Ссылка,
		|	НачисленияУдержанияВзносы.НомерСтроки КАК НомерСтроки,
		|	НачисленияУдержанияВзносы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НачисленияУдержанияВзносы.Ссылка.Подразделение КАК Подразделение,
		|	НачисленияУдержанияВзносы.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
		|	НачисленияУдержанияВзносы.Ссылка.ВидВыплаты КАК ВидВыплаты,
		|	НачисленияУдержанияВзносы.Начислено КАК Начислено,
		|	НачисленияУдержанияВзносы.СуммаВычета КАК СуммаВычета,
		|	НачисленияУдержанияВзносы.КВыплате КАК КВыплате,
		|	НачисленияУдержанияВзносы.УдалитьИПН КАК УдалитьИПН,
		|	НачисленияУдержанияВзносы.Удержано КАК Удержано,
		|	НачисленияУдержанияВзносы.УдалитьНеоблагаемыйДоход КАК УдалитьНеоблагаемыйДоход,
		|	НачисленияУдержанияВзносы.УдалитьПримененнаяЛьгота КАК УдалитьПримененнаяЛьгота,
		|	НачисленияУдержанияВзносы.УдалитьОбъектИсчисления КАК УдалитьОбъектИсчисления
		|ПОМЕСТИТЬ ВТ_НачисленияУдержанияВзносы
		|ИЗ
		|	Документ.ВыплатаБывшимСотрудникам.НачисленияУдержанияВзносы КАК НачисленияУдержанияВзносы
		|ГДЕ
		|	(НачисленияУдержанияВзносы.УдалитьИПН > 0
		|			ИЛИ НачисленияУдержанияВзносы.УдалитьНеоблагаемыйДоход > 0
		|			ИЛИ НачисленияУдержанияВзносы.УдалитьПримененнаяЛьгота > 0
		|			ИЛИ НачисленияУдержанияВзносы.УдалитьОбъектИсчисления > 0)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка,
		|	ПериодРегистрации,
		|	ВидВыплаты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыплатаБывшимСотрудникам.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_НалогиВзносыОтчисления
		|ИЗ
		|	Документ.ВыплатаБывшимСотрудникам КАК ВыплатаБывшимСотрудникам
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыплатаБывшимСотрудникам.НалогиВзносыОтчисления КАК ВыплатаБывшимСотрудникамНалогиВзносыОтчисления
		|		ПО ВыплатаБывшимСотрудникам.Ссылка = ВыплатаБывшимСотрудникамНалогиВзносыОтчисления.Ссылка
		|ГДЕ
		|	ВыплатаБывшимСотрудникамНалогиВзносыОтчисления.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(НалогообложениеНачислений.Период) КАК Период,
		|	НалогообложениеНачислений.Начисление КАК Начисление
		|ПОМЕСТИТЬ ВТ_НалогообложениеНачислений
		|ИЗ
		|	РегистрСведений.НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.Начисление ССЫЛКА Справочник.ВидыВыплатБывшимСотрудникам
		|
		|СГРУППИРОВАТЬ ПО
		|	НалогообложениеНачислений.Начисление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.Период КАК Период,
		|	НалогообложениеНачислений.Начисление КАК Начисление,
		|	НалогообложениеНачислений.ВидДохода КАК ВидДохода
		|ПОМЕСТИТЬ ВТ_НалогообложениеНачисленийСрез
		|ИЗ
		|	РегистрСведений.НалогообложениеНачислений КАК НалогообложениеНачислений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НалогообложениеНачислений КАК ВТ_НалогообложениеНачислений
		|		ПО (ВТ_НалогообложениеНачислений.Период = НалогообложениеНачислений.Период)
		|			И (ВТ_НалогообложениеНачислений.Начисление = НалогообложениеНачислений.Начисление)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период,
		|	Начисление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НачисленияУдержанияВзносы.Ссылка КАК Ссылка,
		|	ВТ_НачисленияУдержанияВзносы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТ_НачисленияУдержанияВзносы.Подразделение КАК Подразделение,
		|	ВТ_НачисленияУдержанияВзносы.ПериодРегистрации КАК МесяцНалоговогоПериода,
		|	ВТ_НалогообложениеНачисленийСрез.ВидДохода КАК ВидДохода,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН) КАК ВидНалогаВзносаОтчисления,
		|	ВТ_НачисленияУдержанияВзносы.Начислено - ВТ_НачисленияУдержанияВзносы.УдалитьНеоблагаемыйДоход КАК ОблагаемыйДоход,
		|	ВТ_НачисленияУдержанияВзносы.УдалитьНеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	ВТ_НачисленияУдержанияВзносы.УдалитьИПН КАК НалогВзнос,
		|	ВТ_НачисленияУдержанияВзносы.УдалитьОбъектИсчисления КАК ОбъектИсчисления,
		|	0 КАК РазрешенныйВычет,
		|	0 КАК ПримененныйВычет,
		|	ВТ_НачисленияУдержанияВзносы.УдалитьПримененнаяЛьгота КАК ПримененнаяЛьгота,
		|	0 КАК ПрочиеВычеты,
		|	ЛОЖЬ КАК ФиксСтрока,
		|	ЛОЖЬ КАК ФиксРасчет,
		|	0 КАК ИдентификаторСтрокиНалогиВзносыОтчисления
		|ИЗ
		|	ВТ_НачисленияУдержанияВзносы КАК ВТ_НачисленияУдержанияВзносы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НалогообложениеНачисленийСрез КАК ВТ_НалогообложениеНачисленийСрез
		|		ПО ВТ_НачисленияУдержанияВзносы.ПериодРегистрации >= ВТ_НалогообложениеНачисленийСрез.Период
		|			И ВТ_НачисленияУдержанияВзносы.ВидВыплаты = ВТ_НалогообложениеНачисленийСрез.Начисление
		|ГДЕ
		|	ВТ_НачисленияУдержанияВзносы.Ссылка В
		|			(ВЫБРАТЬ
		|				Т.Ссылка
		|			ИЗ
		|				ВТ_НалогиВзносыОтчисления КАК Т)
		|ИТОГИ ПО
		|	Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДокументы = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументы.Следующий() Цикл
		
		ДокументОбъект = ВыборкаДокументы.Ссылка.ПолучитьОбъект();
		
		ВыборкаСтроки = ВыборкаДокументы.Выбрать();
		Пока ВыборкаСтроки.Следующий() Цикл
			
			НоваяСтрока = ДокументОбъект.НалогиВзносыОтчисления.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаСтроки);
			
		КонецЦикла;
		
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьРегистрацияПрочихДоходов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияУдержанияВзносы.Ссылка КАК Ссылка,
		|	НачисленияУдержанияВзносы.НомерСтроки КАК НомерСтроки,
		|	НачисленияУдержанияВзносы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НачисленияУдержанияВзносы.Ссылка.Подразделение КАК Подразделение,
		|	НачисленияУдержанияВзносы.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
		|	НачисленияУдержанияВзносы.Ссылка.ВидПрочегоДохода КАК ВидПрочегоДохода,
		|	НачисленияУдержанияВзносы.Начислено КАК Начислено,
		|	НачисленияУдержанияВзносы.СуммаВычета КАК СуммаВычета,
		|	НачисленияУдержанияВзносы.КВыплате КАК КВыплате,
		|	НачисленияУдержанияВзносы.УдалитьИПН КАК УдалитьИПН,
		|	НачисленияУдержанияВзносы.Удержано КАК Удержано,
		|	НачисленияУдержанияВзносы.УдалитьНеоблагаемыйДоход КАК УдалитьНеоблагаемыйДоход,
		|	НачисленияУдержанияВзносы.УдалитьПримененнаяЛьгота КАК УдалитьПримененнаяЛьгота,
		|	НачисленияУдержанияВзносы.УдалитьОбъектИсчисления КАК УдалитьОбъектИсчисления
		|ПОМЕСТИТЬ ВТ_НачисленияУдержанияВзносы
		|ИЗ
		|	Документ.РегистрацияПрочихДоходов.НачисленияУдержанияВзносы КАК НачисленияУдержанияВзносы
		|ГДЕ
		|	(НачисленияУдержанияВзносы.УдалитьИПН > 0
		|			ИЛИ НачисленияУдержанияВзносы.УдалитьНеоблагаемыйДоход > 0
		|			ИЛИ НачисленияУдержанияВзносы.УдалитьПримененнаяЛьгота > 0
		|			ИЛИ НачисленияУдержанияВзносы.УдалитьОбъектИсчисления > 0)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка,
		|	ПериодРегистрации,
		|	ВидПрочегоДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РегистрацияПрочихДоходов.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_НалогиВзносыОтчисления
		|ИЗ
		|	Документ.РегистрацияПрочихДоходов КАК РегистрацияПрочихДоходов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияПрочихДоходов.НалогиВзносыОтчисления КАК РегистрацияПрочихДоходовНалогиВзносыОтчисления
		|		ПО РегистрацияПрочихДоходов.Ссылка = РегистрацияПрочихДоходовНалогиВзносыОтчисления.Ссылка
		|ГДЕ
		|	РегистрацияПрочихДоходовНалогиВзносыОтчисления.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(НалогообложениеНачислений.Период) КАК Период,
		|	НалогообложениеНачислений.Начисление КАК Начисление
		|ПОМЕСТИТЬ ВТ_НалогообложениеНачислений
		|ИЗ
		|	РегистрСведений.НалогообложениеНачислений КАК НалогообложениеНачислений
		|ГДЕ
		|	НалогообложениеНачислений.Начисление ССЫЛКА Справочник.ВидыПрочихДоходовФизическихЛиц
		|
		|СГРУППИРОВАТЬ ПО
		|	НалогообложениеНачислений.Начисление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачислений.Период КАК Период,
		|	НалогообложениеНачислений.Начисление КАК Начисление,
		|	НалогообложениеНачислений.ВидДохода КАК ВидДохода
		|ПОМЕСТИТЬ ВТ_НалогообложениеНачисленийСрез
		|ИЗ
		|	РегистрСведений.НалогообложениеНачислений КАК НалогообложениеНачислений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НалогообложениеНачислений КАК ВТ_НалогообложениеНачислений
		|		ПО (ВТ_НалогообложениеНачислений.Период = НалогообложениеНачислений.Период)
		|			И (ВТ_НалогообложениеНачислений.Начисление = НалогообложениеНачислений.Начисление)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период,
		|	Начисление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НачисленияУдержанияВзносы.Ссылка КАК Ссылка,
		|	ВТ_НачисленияУдержанияВзносы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТ_НачисленияУдержанияВзносы.Подразделение КАК Подразделение,
		|	ВТ_НачисленияУдержанияВзносы.ПериодРегистрации КАК МесяцНалоговогоПериода,
		|	ВТ_НалогообложениеНачисленийСрез.ВидДохода КАК ВидДохода,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН) КАК ВидНалогаВзносаОтчисления,
		|	ВТ_НачисленияУдержанияВзносы.Начислено - ВТ_НачисленияУдержанияВзносы.УдалитьНеоблагаемыйДоход КАК ОблагаемыйДоход,
		|	ВТ_НачисленияУдержанияВзносы.УдалитьНеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	ВТ_НачисленияУдержанияВзносы.УдалитьИПН КАК НалогВзнос,
		|	ВТ_НачисленияУдержанияВзносы.УдалитьОбъектИсчисления КАК ОбъектИсчисления,
		|	0 КАК РазрешенныйВычет,
		|	0 КАК ПримененныйВычет,
		|	ВТ_НачисленияУдержанияВзносы.УдалитьПримененнаяЛьгота КАК ПримененнаяЛьгота,
		|	0 КАК ПрочиеВычеты,
		|	ЛОЖЬ КАК ФиксСтрока,
		|	ЛОЖЬ КАК ФиксРасчет,
		|	0 КАК ИдентификаторСтрокиНалогиВзносыОтчисления
		|ИЗ
		|	ВТ_НачисленияУдержанияВзносы КАК ВТ_НачисленияУдержанияВзносы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НалогообложениеНачисленийСрез КАК ВТ_НалогообложениеНачисленийСрез
		|		ПО ВТ_НачисленияУдержанияВзносы.ПериодРегистрации >= ВТ_НалогообложениеНачисленийСрез.Период
		|			И ВТ_НачисленияУдержанияВзносы.ВидПрочегоДохода = ВТ_НалогообложениеНачисленийСрез.Начисление
		|ГДЕ
		|	ВТ_НачисленияУдержанияВзносы.Ссылка В
		|			(ВЫБРАТЬ
		|				Т.Ссылка
		|			ИЗ
		|				ВТ_НалогиВзносыОтчисления КАК Т)
		|ИТОГИ ПО
		|	Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДокументы = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументы.Следующий() Цикл
		
		ДокументОбъект = ВыборкаДокументы.Ссылка.ПолучитьОбъект();
		
		ВыборкаСтроки = ВыборкаДокументы.Выбрать();
		Пока ВыборкаСтроки.Следующий() Цикл
			
			НоваяСтрока = ДокументОбъект.НалогиВзносыОтчисления.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаСтроки);
			
		КонецЦикла;
		
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.Записать();
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ОбновитьПорядокУчетаРабочегоВремени(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Начисления.Ссылка КАК Ссылка,
	|	ПорядокРегистрацииВидовУчетаВремени.ВидИспользованияРабочегоВремениКадровый КАК ВидИспользованияРабочегоВремениКадровый,
	|	НачисленияВидыВремени.ВидВремени КАК ВидВремени
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УдалитьПорядокРегистрацииВидовУчетаВремени.СрезПоследних() КАК ПорядокРегистрацииВидовУчетаВремени
	|		ПО Начисления.ОбозначениеВТабелеУчетаРабочегоВремени = ПорядокРегистрацииВидовУчетаВремени.ВидИспользованияРабочегоВремениРасчетный
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.ВидыВремени КАК НачисленияВидыВремени
	|		ПО (НачисленияВидыВремени.Ссылка = Начисления.Ссылка)
	|			И (НачисленияВидыВремени.ВидВремени = ПорядокРегистрацииВидовУчетаВремени.ВидИспользованияРабочегоВремениКадровый)
	|ГДЕ
	|	НачисленияВидыВремени.Ссылка ЕСТЬ NULL
	|ИТОГИ ПО
	|	Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ВыборкаПоНачислениям = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоНачислениям.Следующий() Цикл
		
		НачислениеОбъект = ВыборкаПоНачислениям.Ссылка.ПолучитьОбъект();
		
		Выборка = ВыборкаПоНачислениям.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ВидВремениСтрока = НачислениеОбъект.ВидыВремени.Добавить();
			ВидВремениСтрока.ВидВремени = Выборка.ВидИспользованияРабочегоВремениКадровый;
			
		КонецЦикла;
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "ПланВидовРасчета.Начисления", "Ссылка", ВыборкаПоНачислениям.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НачислениеОбъект);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновлениеПоказателейОтОбратного() Экспорт
	
	ОтОбратногоСуммаНаРуки = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ОтОбратногоСуммаНаРуки");
	
	Если ОтОбратногоСуммаНаРуки = Неопределено Тогда
		Справочники.ПоказателиРасчетаЗарплаты.СоздатьПредопределенныеПоказателиОтОбратного();
		Справочники.ПоказателиРасчетаЗарплаты.ОтключитьПредопределенныеПоказателиОтОбратного();
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;

КонецПроцедуры

Процедура УдалитьНеиспользуемыеНачисления() Экспорт
	
	// начисления мешают корректной работе запроса настроек
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Начисления.Ссылка КАК Ссылка
		|ИЗ
		|	ПланВидовРасчета.Начисления КАК Начисления
		|ГДЕ
		|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаКомандировки)
		|	ИЛИ Начисления.Наименование ПОДОБНО ""%Материальная помощь, не облагаемая налогами%""";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивНачислений = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Если МассивНачислений.Количество() > 0 Тогда
		УдалитьОбъекты(МассивНачислений, Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнениеРегистраНалогиВзносыРасчетыНалогоплательщиков() Экспорт
	
	НаборЗаписей = РегистрыНакопления.НалогиВзносыРасчетыНалогоплательщиков.СоздатьНаборЗаписей();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НалогиВзносы.Организация КАК Организация,
		|	НалогиВзносы.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	НалогиВзносы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НалогиВзносы.ПериодРегистрации КАК МесяцНалоговогоПериода,
		|	НалогиВзносы.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
		|	НалогиВзносы.НалогВзнос КАК НалогВзнос,
		|	НалогиВзносы.Регистратор КАК Регистратор,
		|	НалогиВзносы.Период КАК Период
		|ИЗ
		|	РегистрНакопления.СведенияОбИсчисленииНалоговВзносовОтчислений КАК НалогиВзносы
		|ГДЕ
		|	НалогиВзносы.ВидНалогаВзносаОтчисления В (ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН), ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОПВ), ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регистратор,
		|	Организация,
		|	РегистрацияВНалоговомОргане,
		|	ФизическоеЛицо,
		|	НалогиВзносы.ПериодРегистрации,
		|	ВидНалогаВзносаОтчисления
		|ИТОГИ ПО
		|	Регистратор";
		
	ВыборкаРегистраторы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРегистраторы.Следующий() Цикл
		НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаРегистраторы.Регистратор);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() <> 0 Тогда
			НаборЗаписей.Очистить();
		КонецЕсли;
		ВыборкаЗаписи = ВыборкаРегистраторы.Выбрать();
		Пока ВыборкаЗаписи.Следующий() Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
			ЗаполнитьЗначенияСвойств(НоваяЗапись,ВыборкаЗаписи);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
			ЗаполнитьЗначенияСвойств(НоваяЗапись,ВыборкаЗаписи);
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновлениеРегистраНалогиВзносыРасчетыНалогоплательщиков() Экспорт
	
	НаборЗаписей = РегистрыНакопления.НалогиВзносыРасчетыНалогоплательщиков.СоздатьНаборЗаписей();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетнаяПолитикаПоНалоговомуУчету.Организация КАК Организация,
		|	МИНИМУМ(УчетнаяПолитикаПоНалоговомуУчету.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_Политика
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаПоНалоговомуУчету КАК УчетнаяПолитикаПоНалоговомуУчету
		|ГДЕ
		|	УчетнаяПолитикаПоНалоговомуУчету.ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	УчетнаяПолитикаПоНалоговомуУчету.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////Приход + Расход
		|ВЫБРАТЬ
		|	НалогиВзносы.Организация КАК Организация,
		|	НалогиВзносы.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	НалогиВзносы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НалогиВзносы.ПериодРегистрации КАК МесяцНалоговогоПериода,
		|	НалогиВзносы.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
		|	НалогиВзносы.ВидДохода КАК ВидДохода,
		|	НалогиВзносы.НалогВзнос КАК НалогВзнос,
		|	НалогиВзносы.Регистратор КАК Регистратор,
		|	НалогиВзносы.Период КАК Период
		|ИЗ
		|	РегистрНакопления.СведенияОбИсчисленииНалоговВзносовОтчислений КАК НалогиВзносы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Политика КАК ВТ_Политика
		|		ПО НалогиВзносы.Организация = ВТ_Политика.Организация
		|ГДЕ
		|	НалогиВзносы.ВидНалогаВзносаОтчисления В (ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН), ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОПВ), ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС))
		|	И ВЫБОР
		|			КОГДА ВТ_Политика.Период ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ НалогиВзносы.ПериодРегистрации < ВТ_Политика.Период
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регистратор,
		|	Организация,
		|	РегистрацияВНалоговомОргане,
		|	ФизическоеЛицо,
		|	НалогиВзносы.ПериодРегистрации,
		|	ВидНалогаВзносаОтчисления,
		|	ВидДохода
		|ИТОГИ ПО
		|	Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////Приход
		|ВЫБРАТЬ
		|	НалогиВзносы.Организация КАК Организация,
		|	НалогиВзносы.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	НалогиВзносы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НалогиВзносы.ПериодРегистрации КАК МесяцНалоговогоПериода,
		|	НалогиВзносы.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
		|	НалогиВзносы.ВидДохода КАК ВидДохода,
		|	НалогиВзносы.НалогВзнос КАК НалогВзнос,
		|	НалогиВзносы.Регистратор КАК Регистратор,
		|	НалогиВзносы.Период КАК Период
		|ИЗ
		|	РегистрНакопления.СведенияОбИсчисленииНалоговВзносовОтчислений КАК НалогиВзносы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Политика КАК ВТ_Политика
		|		ПО НалогиВзносы.Организация = ВТ_Политика.Организация
		|ГДЕ
		|	НалогиВзносы.ВидНалогаВзносаОтчисления В (ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН), ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОПВ), ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС))
		|	И ВЫБОР
		|			КОГДА ВТ_Политика.Период ЕСТЬ NULL
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ НалогиВзносы.ПериодРегистрации >= ВТ_Политика.Период
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регистратор,
		|	Организация,
		|	РегистрацияВНалоговомОргане,
		|	ФизическоеЛицо,
		|	НалогиВзносы.ПериодРегистрации,
		|	ВидНалогаВзносаОтчисления,
		|	ВидДохода
		|ИТОГИ ПО
		|	Регистратор";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаРегистраторы = МассивРезультатов[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРегистраторы.Следующий() Цикл
		НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаРегистраторы.Регистратор);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() <> 0 Тогда
			НаборЗаписей.Очистить();
		КонецЕсли;
		ВыборкаЗаписи = ВыборкаРегистраторы.Выбрать();
		Пока ВыборкаЗаписи.Следующий() Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
			ЗаполнитьЗначенияСвойств(НоваяЗапись,ВыборкаЗаписи);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
			ЗаполнитьЗначенияСвойств(НоваяЗапись,ВыборкаЗаписи);
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЦикла;
	
	ВыборкаРегистраторы = МассивРезультатов[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРегистраторы.Следующий() Цикл
		НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаРегистраторы.Регистратор);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() <> 0 Тогда
			НаборЗаписей.Очистить();
		КонецЕсли;
		ВыборкаЗаписи = ВыборкаРегистраторы.Выбрать();
		Пока ВыборкаЗаписи.Следующий() Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
			ЗаполнитьЗначенияСвойств(НоваяЗапись,ВыборкаЗаписи);
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьПоказателиНачисленийПоСреднемуЗаработкуОплатаБольничного() Экспорт
	
	// у следующих начислений добави показатель СреднийЗаработокОбщий
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Начисления.Ссылка
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоЛистаЗаСчетРаботодателя)
	|	И НЕ ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					ПланВидовРасчета.Начисления.Показатели КАК ПоказателиНачислений
	|				ГДЕ
	|					ПоказателиНачислений.Ссылка = Начисления.Ссылка
	|					И ПоказателиНачислений.Показатель = &СреднийЗаработокОбщий)";
	
	СреднийЗаработокОбщий = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.СреднийЗаработокОбщий");
	
	Если СреднийЗаработокОбщий = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СреднийЗаработокОбщий", СреднийЗаработокОбщий);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		// Нет начислений, которые требовалось бы обработать.
		Возврат;
	КонецЕсли;

	ПакетВидовРасчета = Новый Массив;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НачислениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗарплатаКадрыРасширенный.ЗаполнитьПоказателиПредопределенногоСпособаРасчета(НачислениеОбъект.СпособРасчета, НачислениеОбъект.Показатели);
		НачислениеОбъект.ИспользуетСреднийЗаработокОбщий = Истина;
		ПакетВидовРасчета.Добавить(НачислениеОбъект);
	КонецЦикла;
	
	РасчетЗарплатыРасширенный.ЗаписатьПакетВидовРасчета(ПакетВидовРасчета, Ложь);
	
КонецПроцедуры

Процедура УстановитьУчетВремениВДняхЧасах() Экспорт

	// у следующих начислений заполним при записи вида расчета реквизит УчетВремениВДняхЧасах через РасчетЗарплатыРасширенный.ЗаполнитьИнформациюОбУчетеВремени
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Начисления.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК ПоказателиНачислений
	|		ПО Начисления.Ссылка = ПоказателиНачислений.Ссылка
	|ГДЕ
	|	НЕ Начисления.УчетВремениВДняхЧасах
	|	И ПоказателиНачислений.Показатель В(&МассивПоказателей)";
	
	КоличествоДнейКомпенсации = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.КоличествоДнейКомпенсации");
	КоличествоДнейОтпуска = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.КоличествоДнейОтпуска");
	
	Если КоличествоДнейКомпенсации = Неопределено 
		И КоличествоДнейОтпуска = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивПоказателей = Новый Массив;
	МассивПоказателей.Добавить(КоличествоДнейКомпенсации);
	МассивПоказателей.Добавить(КоличествоДнейОтпуска);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("МассивПоказателей", МассивПоказателей);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		// Нет начислений, которые требовалось бы обработать.
		Возврат;
	КонецЕсли;

	ПакетВидовРасчета = Новый Массив;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НачислениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		РасчетЗарплатыРасширенный.ЗаполнитьИнформациюОбУчетеВремени(НачислениеОбъект);
		ПакетВидовРасчета.Добавить(НачислениеОбъект);
	КонецЦикла;
	
	РасчетЗарплатыРасширенный.ЗаписатьПакетВидовРасчета(ПакетВидовРасчета, Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьПризнакиДублированияНачисленийДляОплатаБольничногоЛистаЗаСчетРаботодателя() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОплатаБольничногоЛистаЗаСчетРаботодателя", Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоЛистаЗаСчетРаботодателя);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Начисления.Ссылка,
		|	ЛОЖЬ КАК ДублироватьДляВнутреннихСовместителейИПодработок,
		|	ЛОЖЬ КАК ДублироватьДляПодработок
		|ИЗ
		|	ПланВидовРасчета.Начисления КАК Начисления
		|ГДЕ
		|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = &ОплатаБольничногоЛистаЗаСчетРаботодателя
		|	И Начисления.ДублироватьДляВнутреннихСовместителейИПодработок = ИСТИНА";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ПакетВидовРасчета = Новый Массив;
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ВидРасчетаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ВидРасчетаОбъект.ДублироватьДляВнутреннихСовместителейИПодработок = Выборка.ДублироватьДляВнутреннихСовместителейИПодработок;
			ВидРасчетаОбъект.ДублироватьДляПодработок = Выборка.ДублироватьДляПодработок;
			
			ПакетВидовРасчета.Добавить(ВидРасчетаОбъект);
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	РасчетЗарплатыРасширенный.ЗаписатьПакетВидовРасчета(ПакетВидовРасчета, Ложь);

КонецПроцедуры

Процедура ЗаполнитьСпособРасчетаСуммКПеречислению() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВедомостьНаПеречислениеВзносовОтчислений.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВедомостьНаПеречислениеВзносовОтчислений КАК ВедомостьНаПеречислениеВзносовОтчислений
		|ГДЕ
		|	ВедомостьНаПеречислениеВзносовОтчислений.СпособРасчетаСуммКПеречислению = ЗНАЧЕНИЕ(Перечисление.СпособыЗаполненияСуммКПеречислениюНалоговВзносовОтчислений.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.СпособРасчетаСуммКПеречислению = Перечисления.СпособыЗаполненияСуммКПеречислениюНалоговВзносовОтчислений.ПоОстаткамЗадолженностиНаКонецМесяца;
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьКоэффициентИндексацииЗаработка() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КоэффициентИндексацииЗаработка.Период КАК Период,
		|	КоэффициентИндексацииЗаработка.Регистратор КАК Регистратор,
		|	КоэффициентИндексацииЗаработка.НомерСтроки КАК НомерСтроки,
		|	КоэффициентИндексацииЗаработка.Активность КАК Активность,
		|	КоэффициентИндексацииЗаработка.Сотрудник КАК Сотрудник,
		|	КоэффициентИндексацииЗаработка.ДатаИндексации КАК ДатаИндексации,
		|	КоэффициентИндексацииЗаработка.Коэффициент КАК Коэффициент,
		|	КоэффициентИндексацииЗаработка.КоэффициентИндексации КАК КоэффициентИндексации
		|ПОМЕСТИТЬ ВТ_НеобработанныеДанные
		|ИЗ
		|	РегистрСведений.КоэффициентИндексацииЗаработка КАК КоэффициентИндексацииЗаработка
		|ГДЕ
		|	КоэффициентИндексацииЗаработка.ДатаИндексации = ДАТАВРЕМЯ(1, 1, 1)
		|	И КоэффициентИндексацииЗаработка.КоэффициентИндексации = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НеобработанныеДанные.Регистратор КАК Регистратор,
		|	ВТ_НеобработанныеДанные.Сотрудник КАК Сотрудник,
		|	ВТ_НеобработанныеДанные.Период КАК Период,
		|	ВТ_НеобработанныеДанные.Период КАК ДатаИндексации,
		|	ВТ_НеобработанныеДанные.Коэффициент КАК Коэффициент,
		|	ВТ_НеобработанныеДанные.Коэффициент КАК КоэффициентИндексации
		|ИЗ
		|	ВТ_НеобработанныеДанные КАК ВТ_НеобработанныеДанные
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_НеобработанныеДанные.Регистратор,
		|	ВТ_НеобработанныеДанные.Сотрудник,
		|	ВТ_НеобработанныеДанные.Период,
		|	КоэффициентИндексацииЗаработка.Период,
		|	ВТ_НеобработанныеДанные.Коэффициент,
		|	КоэффициентИндексацииЗаработка.Коэффициент
		|ИЗ
		|	ВТ_НеобработанныеДанные КАК ВТ_НеобработанныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_НеобработанныеДанные.Регистратор КАК РегистраторОсновнойЗаписи,
		|			ВТ_НеобработанныеДанные.Сотрудник КАК Сотрудник,
		|			ВТ_НеобработанныеДанные.Период КАК Период,
		|			КоэффициентИндексацииЗаработка.Период КАК ПредыдущийПериодИндексации
		|		ИЗ
		|			ВТ_НеобработанныеДанные КАК ВТ_НеобработанныеДанные
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КоэффициентИндексацииЗаработка КАК КоэффициентИндексацииЗаработка
		|				ПО (КоэффициентИндексацииЗаработка.Сотрудник = ВТ_НеобработанныеДанные.Сотрудник)
		|					И (КоэффициентИндексацииЗаработка.Регистратор <> ВТ_НеобработанныеДанные.Регистратор
		|						ИЛИ ТИПЗНАЧЕНИЯ(КоэффициентИндексацииЗаработка.Регистратор) = ТИП(Документ.ПереносДанных))
		|					И ВТ_НеобработанныеДанные.Период > КоэффициентИндексацииЗаработка.Период) КАК КоэффициентыИндексацииЗаработкаПериоды
		|		ПО ВТ_НеобработанныеДанные.Регистратор = КоэффициентыИндексацииЗаработкаПериоды.РегистраторОсновнойЗаписи
		|			И ВТ_НеобработанныеДанные.Сотрудник = КоэффициентыИндексацииЗаработкаПериоды.Сотрудник
		|			И ВТ_НеобработанныеДанные.Период = КоэффициентыИндексацииЗаработкаПериоды.Период
		|			И (ГОД(КоэффициентыИндексацииЗаработкаПериоды.ПредыдущийПериодИндексации) + МЕСЯЦ(КоэффициентыИндексацииЗаработкаПериоды.ПредыдущийПериодИндексации) - ГОД(КоэффициентыИндексацииЗаработкаПериоды.ПредыдущийПериодИндексации) - МЕСЯЦ(КоэффициентыИндексацииЗаработкаПериоды.ПредыдущийПериодИндексации) + 1 <= 12)
		|			И (ВТ_НеобработанныеДанные.Коэффициент > 1)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КоэффициентИндексацииЗаработка КАК КоэффициентИндексацииЗаработка
		|		ПО (КоэффициентИндексацииЗаработка.Сотрудник = ВТ_НеобработанныеДанные.Сотрудник)
		|			И (КоэффициентИндексацииЗаработка.Сотрудник = КоэффициентыИндексацииЗаработкаПериоды.Сотрудник)
		|			И (КоэффициентИндексацииЗаработка.Период = КоэффициентыИндексацииЗаработкаПериоды.ПредыдущийПериодИндексации)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Регистратор,
		|	Сотрудник,
		|	Период УБЫВ,
		|	ДатаИндексации УБЫВ
		|ИТОГИ ПО
		|	Регистратор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРегистратор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НаборЗаписей = РегистрыСведений.КоэффициентИндексацииЗаработка.СоздатьНаборЗаписей();
	ТаблицаКоэффициентовИндексации = НаборЗаписей.Выгрузить();
	// иначе у записей будет установлена Ложь
	ТаблицаКоэффициентовИндексации.Колонки.Удалить("Активность");

	Пока ВыборкаРегистратор.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.КоэффициентИндексацииЗаработка.СоздатьНаборЗаписей();
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
	
		НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаРегистратор.Регистратор);
		
		ТаблицаКоэффициентовИндексации.Очистить();
		
		ВыборкаПоРегистратору = ВыборкаРегистратор.Выбрать();
		
		Пока ВыборкаПоРегистратору.Следующий() Цикл
			
			ЗаписьРегистра = ТаблицаКоэффициентовИндексации.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьРегистра, ВыборкаПоРегистратору);
			
		КонецЦикла;
		
		УчетСреднегоЗаработкаРК.ОбработатьТаблицуКоэффициентовИндексации(ТаблицаКоэффициентовИндексации);
		
		НаборЗаписей.Загрузить(ТаблицаКоэффициентовИндексации);
			
		НаборЗаписей.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьВычетВОСМС() Экспорт
	
	Справочники.ВидыВычетовИПН.НачальноеЗаполнение();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыВычетовИПН.Ссылка КАК Ссылка,
		|	ВидыВычетовИПН.Приоритет КАК Приоритет
		|ИЗ
		|	Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|ГДЕ
		|	НЕ ВидыВычетовИПН.Предопределенный
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыВычетовИПН.Приоритет УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВычетИПН = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ВычетИПН.Приоритет = ВыборкаДетальныеЗаписи.Приоритет + 1;
		ВычетИПН.ОбменДанными.Загрузка = Истина;
		ВычетИПН.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьВыходныеРабочиеДни () Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
		ОписаниеВидаВремени = УчетРабочегоВремени.СоздатьОписаниеВидаВремени();
		ОписаниеВидаВремени.ИмяПредопределенныхДанных = "ВыходныеРабочиеДни";
		ОписаниеВидаВремени.Наименование = "Выходные рабочие дни";
		ОписаниеВидаВремени.БуквенныйКод = "РВ";
		ОписаниеВидаВремени.ЦифровойКод = "41";
		ОписаниеВидаВремени.ПолноеНаименование = НСтр("ru = 'Продолжительность работы в выходные и нерабочие дни'");
		ОписаниеВидаВремени.РабочееВремя = Истина;
		ОписаниеВидаВремени.Целосменное = Ложь;
		
		УчетРабочегоВремени.НовыйВидИспользованияРабочегоВремени(ОписаниеВидаВремени);
		
		ОписаниеВидаВремени = УчетРабочегоВремени.СоздатьОписаниеВидаВремени();
		ОписаниеВидаВремени.ИмяПредопределенныхДанных = "ВыходныеРабочиеДниБезПовышеннойОплаты";
		ОписаниеВидаВремени.Наименование = "Выходные рабочие дни (без повышенной оплаты)";
		ОписаниеВидаВремени.БуквенныйКод = "ВН";
		ОписаниеВидаВремени.ЦифровойКод = "44";
		ОписаниеВидаВремени.ПолноеНаименование = НСтр("ru = 'Продолжительность работы в выходные и нерабочие дни (без повышенной оплаты)'");
		ОписаниеВидаВремени.РабочееВремя = Истина;
		ОписаниеВидаВремени.Целосменное = Ложь;
		
		УчетРабочегоВремени.НовыйВидИспользованияРабочегоВремени(ОписаниеВидаВремени);
	КонецЕсли;	
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Процедура ОбновитьТочностьОкругленияВОСМС() Экспорт
	
	// очистим порядок округления ПорядокОкругленияРезультатовРасчетаЗарплаты
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ПорядокОкругленияРезультатовРасчетаЗарплаты.Период КАК Период,
		|	ПорядокОкругленияРезультатовРасчетаЗарплаты.Организация КАК Организация,
		|	ПорядокОкругленияРезультатовРасчетаЗарплаты.ВидРасчета КАК ВидРасчета
		|ИЗ
		|	РегистрСведений.ПорядокОкругленияРезультатовРасчетаЗарплаты КАК ПорядокОкругленияРезультатовРасчетаЗарплаты
		|ГДЕ
		|	ПорядокОкругленияРезультатовРасчетаЗарплаты.Период >= ДАТАВРЕМЯ(2020, 1, 1)
		|	И ПорядокОкругленияРезультатовРасчетаЗарплаты.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ПорядокОкругленияРезультатовРасчетаЗарплаты = РегистрыСведений.ПорядокОкругленияРезультатовРасчетаЗарплаты.СоздатьНаборЗаписей();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПорядокОкругленияРезультатовРасчетаЗарплаты.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
		ПорядокОкругленияРезультатовРасчетаЗарплаты.Отбор.Организация.Установить(ВыборкаДетальныеЗаписи.Организация);
		ПорядокОкругленияРезультатовРасчетаЗарплаты.Отбор.ВидРасчета.Установить(ВыборкаДетальныеЗаписи.ВидРасчета);
		
		ПорядокОкругленияРезультатовРасчетаЗарплаты.Прочитать();
		ПорядокОкругленияРезультатовРасчетаЗарплаты.Очистить();
		
		Попытка
			
			ПорядокОкругленияРезультатовРасчетаЗарплаты.ОбменДанными.Загрузка = Истина;
			ПорядокОкругленияРезультатовРасчетаЗарплаты.Записать();
			
		Исключение
			
			ТекстСообщения = НСтр(
			"ru = 'при записи набора данных ""Порядок округления результатов расчета налогов, сборов, отчислений"" произошла ошибка: 
			|%1");
			
			ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
			
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Не удалось обновить ""Регистр сведений  ""Порядок округления результатов расчета налогов, сборов, отчислений"""".'"), 
			УровеньЖурналаРегистрации.Ошибка, , , Комментарий);					
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОСтавкахНалоговСборовОтчислений() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОСтавкахНалоговСборовОтчислений.Период КАК Период,
		|	СведенияОСтавкахНалоговСборовОтчислений.Организация КАК Организация,
		|	СведенияОСтавкахНалоговСборовОтчислений.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления
		|ИЗ
		|	РегистрСведений.СведенияОСтавкахНалоговСборовОтчислений КАК СведенияОСтавкахНалоговСборовОтчислений
		|ГДЕ
		|	СведенияОСтавкахНалоговСборовОтчислений.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НаборЗаписей = РегистрыСведений.СведенияОСтавкахНалоговСборовОтчислений.СоздатьНаборЗаписей();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
		НаборЗаписей.Отбор.Организация.Установить(ВыборкаДетальныеЗаписи.Организация);
		НаборЗаписей.Отбор.ВидНалогаВзносаОтчисления.Установить(ВыборкаДетальныеЗаписи.ВидНалогаВзносаОтчисления);
		
		НаборЗаписей.Прочитать();
		Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
				ЗаписьНабора.ВидДохода = Справочники.ВидыДоходов.ДоходыОтРаботодателя;
		КонецЦикла;
		
		Попытка
			
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
			
		Исключение
			
			ТекстСообщения = НСтр(
			"ru = 'При записи набора данных ""Сведения о ставках налогов, сборов, отчислений"" произошла ошибка: 
			|%1");
			
			ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
			
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Не удалось обновить ""Регистр сведений  ""Сведения о ставках налогов, сборов, отчислений"""".'"),
				УровеньЖурналаРегистрации.Ошибка, , , Комментарий);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыДоходов.Ссылка КАК ВидДохода
		|ИЗ
		|	Справочник.ВидыДоходов КАК ВидыДоходов
		|ГДЕ
		|	ВидыДоходов.Предопределенный = ИСТИНА
		|	И ВидыДоходов.УчитыватьОПВ = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НаборЗаписей.Отбор.Период.Установить('20200101');
		НаборЗаписей.Отбор.Организация.Установить(Справочники.Организации.ПустаяСсылка());
		НаборЗаписей.Отбор.ВидНалогаВзносаОтчисления.Установить(Перечисления.ВидыНалоговВзносовОтчислений.ОПВ);
		НаборЗаписей.Отбор.ВидДохода.Установить(ВыборкаДетальныеЗаписи.ВидДохода);
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			Движение = НаборЗаписей.Добавить();
			// Свойства
			Движение.Период = '20200101';
			//Измерения
			Движение.Организация = Справочники.Организации.ПустаяСсылка();
			Движение.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ОПВ;
			Движение.ВидДохода = ВыборкаДетальныеЗаписи.ВидДохода;
			// Ресурсы
			Движение.Ставка = 10;
			
			Попытка
				
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.Записать();
				
			Исключение
				
				ТекстСообщения = НСтр(
				"ru = 'При записи набора данных ""Сведения о ставках налогов, сборов, отчислений"" произошла ошибка: 
				|%1");
				
				ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
				
				ЗаписьЖурналаРегистрации(
					НСтр("ru = 'Не удалось обновить ""Регистр сведений  ""Сведения о ставках налогов, сборов, отчислений"""".'"),
				УровеньЖурналаРегистрации.Ошибка, , , Комментарий);
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ОбновитьИспользованиеВремениКомпенсацииОтпуска() Экспорт 
	
	КоличествоДнейКомпенсации = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.КоличествоДнейКомпенсации");
	
	Если КоличествоДнейКомпенсации = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Показатель", КоличествоДнейКомпенсации);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	НачисленияПоказатели.Ссылка
	               |ИЗ
	               |	ПланВидовРасчета.Начисления.Показатели КАК НачисленияПоказатели
	               |ГДЕ
	               |	НачисленияПоказатели.Показатель = &Показатель";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПакетВидовРасчета = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		НачислениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		РасчетЗарплатыРасширенный.ЗаполнитьИнформациюОбУчетеВремени(НачислениеОбъект);
		ПакетВидовРасчета.Добавить(НачислениеОбъект);
	КонецЦикла;
	
	РасчетЗарплатыРасширенный.ЗаписатьПакетВидовРасчета(ПакетВидовРасчета, Ложь);
	
КонецПроцедуры

Процедура ОтработаноДнейЧасов() Экспорт
	
	ОтработаноДнейЧасовСсылка = Справочники.ПоказателиРасчетаЗарплаты.НайтиПоНаименованию("Отработано дней (часов), в т.ч. сверхурочно");
	
	Если ЗначениеЗаполнено(ОтработаноДнейЧасовСсылка) Тогда
		
		ОтработаноДнейЧасовОбъект = ОтработаноДнейЧасовСсылка.ПолучитьОбъект();
		
		Если НЕ ЗначениеЗаполнено(ОтработаноДнейЧасовОбъект.ИмяПредопределенныхДанных) Тогда
			Возврат;	
		КонецЕсли;
			
		ОтработаноДнейЧасовОбъект.ИмяПредопределенныхДанных = "";
		
		Попытка
			ОтработаноДнейЧасовОбъект.Заблокировать();
		Исключение
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Невозможно изменить показатель """"%2"""". Возможно, он редактируется другим пользователем'"), ОтработаноДнейЧасовОбъект.Наименование);
			ВызватьИсключение ТекстСообщения;
		КонецПопытки;
		
		ОтработаноДнейЧасовОбъект.Записать();
		
	 КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьУчетВремениВДняхЧасахДляБольничных() Экспорт
	
	// у следующих начислений заполним при записи вида расчета реквизит УчетВремениВДняхЧасах через РасчетЗарплатыРасширенный.ЗаполнитьИнформациюОбУчетеВремени
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Начисления.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|ГДЕ
	|	НЕ Начисления.УчетВремениВДняхЧасах
	|	И Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоЛистаЗаСчетРаботодателя)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		// Нет начислений, которые требовалось бы обработать.
		Возврат;
	КонецЕсли;

	ПакетВидовРасчета = Новый Массив;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НачислениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		РасчетЗарплатыРасширенный.ЗаполнитьИнформациюОбУчетеВремени(НачислениеОбъект);
		ПакетВидовРасчета.Добавить(НачислениеОбъект);
	КонецЦикла;
	
	РасчетЗарплатыРасширенный.ЗаписатьПакетВидовРасчета(ПакетВидовРасчета, Ложь);
	
КонецПроцедуры

Процедура ОбновитьВидыОтпусковТКРК202007() Экспорт
	
	Справочники.ВидыОтпусков.ОписатьВидОтпускаДляПрохожденияСкрининговыхИсследований();
	Справочники.ВидыОтпусков.ОписатьВидОтпускаНаПостановкуНаМедицинскийУчетПоБеременностиДоДвенадцатиНедель();
	
	ПланыВидовРасчета.Начисления.СоздатьНачисленияОтпускДляПрохожденияСкрининговыхИсследований();
	ПланыВидовРасчета.Начисления.СоздатьНачисленияОтпускНаПостановкуНаМедицинскийУчетПоБеременностиДоДвенадцатиНедель();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Начисления.Ссылка КАК Начисление
		|ИЗ
		|	ПланВидовРасчета.Начисления КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений КАК НалогообложениеНачислений
		|		ПО (НалогообложениеНачислений.Начисление = Начисления.Ссылка)
		|ГДЕ
		|	Начисления.ВидОтпуска В(&ВидыОтпусков)
		|	И Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаОтпуска)
		|	И НалогообложениеНачислений.Начисление ЕСТЬ NULL";
	
	ВидыОтпусков = Новый Массив;
	ВидыОтпусков.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.ОтпускДляПрохожденияСкрининговыхИсследований"));
	ВидыОтпусков.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.ОтпускНаПостановкуНаМедицинскийУчетПоБеременностиДоДвенадцатиНедель"));
	
	Запрос.УстановитьПараметр("ВидыОтпусков", ВидыОтпусков);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОблагаетсяЦеликом = Перечисления.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РегистрыСведений.НалогообложениеНачислений.ДобавитьСведенияОНалогообложениеНачислений(ВыборкаДетальныеЗаписи.Начисление, Справочники.ВидыДоходов.ДоходыОтРаботодателя, '20200701', ОблагаетсяЦеликом, ОблагаетсяЦеликом, ОблагаетсяЦеликом, ОблагаетсяЦеликом, ОблагаетсяЦеликом, ОблагаетсяЦеликом, ОблагаетсяЦеликом);	
	КонецЦикла;
	
КонецПроцедуры

Процедура ДокументыСКраткимСоствомКОбработке(Параметры) Экспорт
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВедомостьНаПеречислениеВзносовОтчислений.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВедомостьНаПеречислениеВзносовОтчислений КАК ВедомостьНаПеречислениеВзносовОтчислений
		|ГДЕ
		|	ВедомостьНаПеречислениеВзносовОтчислений.КраткийСоставДокумента = """"
		|	И 1 В (ВЫБРАТЬ ПЕРВЫЕ 1
		|				1
		|			ИЗ
		|				Документ.ВедомостьНаПеречислениеВзносовОтчислений.НалогиВзносыОтчисления КАК ТаблицаДокумент
		|			ГДЕ
		|				ТаблицаДокумент.Ссылка = ВедомостьНаПеречислениеВзносовОтчислений.Ссылка
		|				И ТаблицаДокумент.ФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СведенияОНезачисленныхВзносахОтчислениях.Ссылка
		|ИЗ
		|	Документ.СведенияОНезачисленныхВзносахОтчислениях КАК СведенияОНезачисленныхВзносахОтчислениях
		|ГДЕ
		|	СведенияОНезачисленныхВзносахОтчислениях.КраткийСоставДокумента = """"
		|	И 1 В (ВЫБРАТЬ ПЕРВЫЕ 1
		|				1
		|			ИЗ
		|				Документ.СведенияОНезачисленныхВзносахОтчислениях.Сотрудники КАК ТаблицаДокумент
		|			ГДЕ
		|				ТаблицаДокумент.Ссылка = СведенияОНезачисленныхВзносахОтчислениях.Ссылка
		|				И ТаблицаДокумент.ФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПеняПоВзносамИОтчислениям.Ссылка
		|ИЗ
		|	Документ.ПеняПоВзносамИОтчислениям КАК ПеняПоВзносамИОтчислениям
		|ГДЕ
		|	ПеняПоВзносамИОтчислениям.КраткийСоставДокумента = """"
		|	И 1 В (ВЫБРАТЬ ПЕРВЫЕ 1
		|				1
		|			ИЗ
		|				Документ.ПеняПоВзносамИОтчислениям.ИсчислениеПени КАК ТаблицаДокумент
		|			ГДЕ
		|				ТаблицаДокумент.Ссылка = ПеняПоВзносамИОтчислениям.Ссылка
		|				И ТаблицаДокумент.ФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
		|";
		
	Запрос = Новый Запрос(ТекстЗапроса);
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры
	
Процедура ДокументыСКраткимСоставом_ОбработатьДанныеДляПерехода(Параметры) Экспорт
	
	ТипыДокументов = Новый Массив();
	ТипыДокументов.Добавить("Документ.ВедомостьНаПеречислениеВзносовОтчислений");	
	ТипыДокументов.Добавить("Документ.СведенияОНезачисленныхВзносахОтчислениях");
	ТипыДокументов.Добавить("Документ.ПеняПоВзносамИОтчислениям");
	
	Для Каждого ПолноеИмя Из ТипыДокументов Цикл
		
		Выборка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, ПолноеИмя);
		
		ОписаниеДокумента = ЗарплатаКадрыСоставДокументов.ОписаниеДокументаПоИсточнику(Документы[СтрЗаменить(ПолноеИмя, "Документ.", "")].ПустаяСсылка());
		
		Пока Выборка.Следующий() Цикл
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмя);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			НачатьТранзакцию();
			
			Попытка
				Блокировка.Заблокировать();
			Исключение
				
				ОтменитьТранзакцию();
				
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление информационной базы.Ошибка блокировки'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Предупреждение, , Выборка.Ссылка, ПолноеИмя);
				
				Продолжить;
				
			КонецПопытки;
			
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			СотрудникиФизическиеЛица = ЗарплатаКадрыСоставДокументов.СотрудникиФизическиеЛица(Объект.Ссылка, ОписаниеДокумента);
			
			Если Объект = Неопределено Тогда
				
				ОтменитьТранзакцию();
				
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление информационной базы.Ошибка блокировки'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Предупреждение, , Выборка.Ссылка, ПолноеИмя);
				
				Продолжить;
				
			КонецЕсли;
			
			ЗарплатаКадрыСоставДокументов.ЗаполнитьКраткийСоставДокумента(Объект, ОписаниеДокумента, СотрудникиФизическиеЛица);		
			
			Объект.ОбменДанными.Загрузка = Истина;
			
			Попытка
				
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление информационной базы.Ошибка блокировки'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Предупреждение, , Выборка.Ссылка, ПолноеИмя);
				
			КонецПопытки;
			
		КонецЦикла;
		
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмя);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРегистрУчетнаяПолитикаПоНалоговомуУчету2020() Экспорт
	
	НаборЗаписей = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СоздатьНаборЗаписей();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетнаяПолитикаПоНалоговомуУчету.Период КАК Период,
		|	УчетнаяПолитикаПоНалоговомуУчету.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаПоНалоговомуУчету КАК УчетнаяПолитикаПоНалоговомуУчету
		|ГДЕ
		|	УчетнаяПолитикаПоНалоговомуУчету.Период МЕЖДУ ДАТАВРЕМЯ(2020, 1, 1) И ДАТАВРЕМЯ(2020, 12, 31)
		|	И УчетнаяПолитикаПоНалоговомуУчету.ПрименятьВычетВОСМСДляФизическихЛицИГПХ = ИСТИНА
		|	И УчетнаяПолитикаПоНалоговомуУчету.ПрименятьВычетОПВиВОСМСДляГПХ = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НаборЗаписей.Отбор.Организация.Установить(ВыборкаДетальныеЗаписи.Организация);
		НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
		
		НаборЗаписей.Прочитать();
		
		Если НЕ НаборЗаписей.Количество() = 0 Тогда
			
			Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
				ЗаписьНабора.ПрименятьВычетОПВиВОСМСДляГПХ = Истина;
			КонецЦикла;
			
		КонецЕсли;
		
		Если НЕ НаборЗаписей.Количество() = 0 Тогда
			
			Попытка
				
				НаборЗаписей.Записать();

			Исключение
				
				ТекстСообщения = НСтр(
				"ru = 'при записи набора данных ""Учетная политика по налоговому учету"" произошла ошибка: 
				|%1");
				
				ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
				
				ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Не удалось обновить ""Регистр сведений  ""Учетная политика по налоговому учету"""".'"), 
				УровеньЖурналаРегистрации.Ошибка, , , Комментарий);					
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнениеДанныхПроизводственногоКалендаря2021() Экспорт
    
   	ПроизводственныйКалендарьРК = Справочники.ПроизводственныеКалендари.НайтиПоКоду("РК");

    НаборЗаписей = РегистрыСведений.ДанныеПроизводственногоКалендаря.СоздатьНаборЗаписей();
    
    НаборЗаписей.Отбор.ПроизводственныйКалендарь.Установить(ПроизводственныйКалендарьРК);
    НаборЗаписей.Отбор.Год.Установить(2021);
    НаборЗаписей.Отбор.Дата.Установить('20210806');
    
    НаборЗаписей.Прочитать();
    Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
        ЗаписьНабора.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий;
    КонецЦикла;
    
    Попытка
        
        НаборЗаписей.ОбменДанными.Загрузка = Истина;
        НаборЗаписей.Записать();
        
    Исключение
        
        ТекстСообщения = НСтр(
        "ru = 'При записи набора данных ""Данные производственного календаря"" произошла ошибка: 
        |%1");
        
        ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
        Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
        
        ЗаписьЖурналаРегистрации(
        НСтр("ru = 'Не удалось обновить ""Регистр сведений  ""Данные производственного календаря"""".'"),
        УровеньЖурналаРегистрации.Ошибка, , , Комментарий);
        
    КонецПопытки;

    НаборЗаписей = РегистрыСведений.ДанныеПроизводственногоКалендаря.СоздатьНаборЗаписей();
    
    НаборЗаписей.Отбор.ПроизводственныйКалендарь.Установить(ПроизводственныйКалендарьРК);
    НаборЗаписей.Отбор.Год.Установить(2021);
    НаборЗаписей.Отбор.Дата.Установить('20210807');
    
    НаборЗаписей.Прочитать();
    Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
        ЗаписьНабора.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота;
    КонецЦикла;
    
    Попытка
        
        НаборЗаписей.ОбменДанными.Загрузка = Истина;
        НаборЗаписей.Записать();
        
    Исключение
        
        ТекстСообщения = НСтр(
        "ru = 'При записи набора данных ""Данные производственного календаря"" произошла ошибка: 
        |%1");
        
        ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
        Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
        
        ЗаписьЖурналаРегистрации(
        НСтр("ru = 'Не удалось обновить ""Регистр сведений  ""Данные производственного календаря"""".'"),
        УровеньЖурналаРегистрации.Ошибка, , , Комментарий);
        
    КонецПопытки;

    НаборЗаписей = РегистрыСведений.ДанныеПроизводственногоКалендаря.СоздатьНаборЗаписей();
    
    НаборЗаписей.Отбор.ПроизводственныйКалендарь.Установить(ПроизводственныйКалендарьРК);
    НаборЗаписей.Отбор.Год.Установить(2021);
    НаборЗаписей.Отбор.Дата.Установить('20210808');
    
    НаборЗаписей.Прочитать();
    Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
        ЗаписьНабора.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье;
    КонецЦикла;
    
    Попытка
        
        НаборЗаписей.ОбменДанными.Загрузка = Истина;
        НаборЗаписей.Записать();
        
    Исключение
        
        ТекстСообщения = НСтр(
        "ru = 'При записи набора данных ""Данные производственного календаря"" произошла ошибка: 
        |%1");
        
        ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
        Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
        
        ЗаписьЖурналаРегистрации(
        НСтр("ru = 'Не удалось обновить ""Регистр сведений  ""Данные производственного календаря"""".'"),
        УровеньЖурналаРегистрации.Ошибка, , , Комментарий);
        
    КонецПопытки;

КонецПроцедуры

Процедура УстановитьРабочееВремяДляКомандировки() Экспорт
	
	ВидВремениКомандировкаСсылка = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.Командировка");
	
	Если НЕ ВидВремениКомандировкаСсылка = Неопределено Тогда
		
		ВидВремениКомандировка = ВидВремениКомандировкаСсылка.ПолучитьОбъект();
		ВидВремениКомандировка.ОбменДанными.Загрузка = Истина;
		
		ВидВремениКомандировка.РабочееВремя = Истина;
		
		Попытка
			ВидВремениКомандировка.Заблокировать();
		Исключение
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Невозможно изменить показатель """"%2"""". Возможно, он редактируется другим пользователем'"), ВидВремениКомандировка.Наименование);
			ВызватьИсключение ТекстСообщения;
		КонецПопытки;
		
		ВидВремениКомандировка.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРегистрУчетнаяПолитикаПоНалоговомуУчету2021() Экспорт
	
	НаборЗаписей = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СоздатьНаборЗаписей();
	
	Запрос = Новый Запрос;
	// обновим учетную политику пользователей, созданную в 2021 году
	// учетную политику индивидуальных предпринимателей не обновляем, тк расчет СН для ИП реализован не был
	// заполним учетную политику для юр лиц знчением по умолчанию (расчет происходил по общеустановленному режиму всегда) 
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетнаяПолитикаПоНалоговомуУчету.Период КАК Период,
		|	УчетнаяПолитикаПоНалоговомуУчету.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаПоНалоговомуУчету КАК УчетнаяПолитикаПоНалоговомуУчету
		|ГДЕ
		|	УчетнаяПолитикаПоНалоговомуУчету.Период МЕЖДУ ДАТАВРЕМЯ(2021, 1, 1) И ДАТАВРЕМЯ(2021, 12, 31)
		|	И УчетнаяПолитикаПоНалоговомуУчету.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.ПустаяСсылка)
		|	И УчетнаяПолитикаПоНалоговомуУчету.Организация.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НаборЗаписей.Отбор.Организация.Установить(ВыборкаДетальныеЗаписи.Организация);
		НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
		
		НаборЗаписей.Прочитать();
		
		Если НЕ НаборЗаписей.Количество() = 0 Тогда
			
			Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
				ЗаписьНабора.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Общая;
			КонецЦикла;
			
		КонецЕсли;
		
		Если НЕ НаборЗаписей.Количество() = 0 Тогда
			
			Попытка
				
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.Записать();

			Исключение
				
				ТекстСообщения = НСтр(
				"ru = 'при записи набора данных ""Учетная политика по налоговому учету"" произошла ошибка: 
				|%1");
				
				ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
				
				ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Не удалось обновить ""Регистр сведений  ""Учетная политика по налоговому учету"""".'"), 
				УровеньЖурналаРегистрации.Ошибка, , , Комментарий);					
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПризнакиДублированияНачисленийДляБольничного() Экспорт
	
	Запрос = Новый Запрос;
	
	СписокКатегорий = Новый Массив;
	СписокКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.БолезньБезОплаты);
	СписокКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоЛиста);
	СписокКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоНесчастныйСлучайНаПроизводстве);
	СписокКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоПрофзаболевание);
	СписокКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОтпускПоБеременностиИРодам);
	СписокКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОтпускПоБеременностиИРодамБезОплаты);
	СписокКатегорий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОтпускПоБеременностиИРодамВоеннослужащего);
	
	Запрос.УстановитьПараметр("СписокКатегорий", СписокКатегорий);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Начисления.Ссылка,
		|	ЛОЖЬ КАК ДублироватьДляВнутреннихСовместителейИПодработок,
		|	ЛОЖЬ КАК ДублироватьДляПодработок
		|ИЗ
		|	ПланВидовРасчета.Начисления КАК Начисления
		|ГДЕ
		|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (&СписокКатегорий)
		|	И Начисления.ДублироватьДляВнутреннихСовместителейИПодработок = ИСТИНА";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ПакетВидовРасчета = Новый Массив;
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ВидРасчетаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ВидРасчетаОбъект.ДублироватьДляВнутреннихСовместителейИПодработок = Выборка.ДублироватьДляВнутреннихСовместителейИПодработок;
			ВидРасчетаОбъект.ДублироватьДляПодработок = Выборка.ДублироватьДляПодработок;
			
			ПакетВидовРасчета.Добавить(ВидРасчетаОбъект);
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	РасчетЗарплатыРасширенный.ЗаписатьПакетВидовРасчета(ПакетВидовРасчета, Ложь);

КонецПроцедуры

Процедура ЗаполнитьРегистрУчетнаяПолитикаЗарплатаКадры() Экспорт
	
	НаборЗаписей = РегистрыСведений.УчетнаяПолитикаЗарплатаКадры.СоздатьНаборЗаписей();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
        |   Организации.Ссылка КАК Организация
        |ИЗ
        |   Справочник.Организации КАК Организации
        |ГДЕ
        |   НЕ Организации.ПометкаУдаления
        |   И Организации.ГоловнаяОрганизация = Организации.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        
        НаборЗаписей.Отбор.Организация.Установить(ВыборкаДетальныеЗаписи.Организация);
        НаборЗаписей.Отбор.Период.Установить('19800101');
        НаборЗаписей.Прочитать();
        
        Если НаборЗаписей.Количество() = 0 Тогда
            
            НоваяЗапись = НаборЗаписей.Добавить();
            НоваяЗапись.Организация = ВыборкаДетальныеЗаписи.Организация;
            НоваяЗапись.Период = '19800101';
            НоваяЗапись.ДеньУвольненияЯвляетсяРабочимДнем = Истина;
                        
            Попытка
                
                НаборЗаписей.ОбменДанными.Загрузка = Истина;
                НаборЗаписей.Записать();
                
            Исключение
                
                ТекстСообщения = НСтр(
                "ru = 'При записи набора данных ""Учетная политика зарплата кадры"" произошла ошибка: 
                |%1");
                
                ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
                Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
                
                ЗаписьЖурналаРегистрации(
                НСтр("ru = 'Не удалось обновить ""Регистр сведений  ""Учетная политика зарплата кадры"""".'"),
                УровеньЖурналаРегистрации.Ошибка, , , Комментарий);
                
            КонецПопытки;
            
        КонецЕсли;
        
        НаборЗаписей.Отбор.Организация.Установить(ВыборкаДетальныеЗаписи.Организация);
        НаборЗаписей.Отбор.Период.Установить('20210301');
        НаборЗаписей.Прочитать();
        
        Если НаборЗаписей.Количество() = 0 Тогда
            
            НоваяЗапись = НаборЗаписей.Добавить();
            НоваяЗапись.Организация = ВыборкаДетальныеЗаписи.Организация;
            НоваяЗапись.Период = '20210301';
            НоваяЗапись.ДеньУвольненияЯвляетсяРабочимДнем = Ложь;
            
            Попытка
                
                НаборЗаписей.ОбменДанными.Загрузка = Истина;
                НаборЗаписей.Записать();
                
            Исключение
                
                ТекстСообщения = НСтр(
                "ru = 'При записи набора данных ""Учетная политика зарплата кадры"" произошла ошибка: 
                |%1");
                
                ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
                Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
                
                ЗаписьЖурналаРегистрации(
                НСтр("ru = 'Не удалось обновить ""Регистр сведений  ""Учетная политика зарплата кадры"""".'"),
                УровеньЖурналаРегистрации.Ошибка, , , Комментарий);
                
            КонецПопытки;
            
        КонецЕсли;
        
    КонецЦикла;
    
КонецПроцедуры

Процедура ОбновлениеПоказателейПрочихУдержаний() Экспорт
    
    Справочники.ПоказателиРасчетаЗарплаты.СоздатьПоказателиИсчисленныхПоУдержаниюНалоговВзносов();
    Справочники.ПоказателиРасчетаЗарплаты.ОтключитьПоказателиИсчисленныхПоУдержаниюНалоговВзносов();
    ОбновитьПовторноИспользуемыеЗначения();
    
КонецПроцедуры

Процедура ОбновитьВидВремениДоплатыЗаСовмещение() Экспорт
	
	ВидВремениКомандировка = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.Командировка");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Начисления.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.ВидыВремени КАК НачисленияВидыВремени
	|		ПО НачисленияВидыВремени.Ссылка = Начисления.Ссылка
	|			И НачисленияВидыВремени.ВидВремени = &Командировка
	|ГДЕ
	|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоплатаЗаСовмещение)
	|	И НачисленияВидыВремени.Ссылка ЕСТЬ NULL";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Командировка", ВидВремениКомандировка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивВидовРасчета = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		НачислениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СтрокаВремени = НачислениеОбъект.ВидыВремени.Добавить();
		СтрокаВремени.ВидВремени = ВидВремениКомандировка;
		
		МассивВидовРасчета.Добавить(НачислениеОбъект);
		
	КонецЦикла;

	РасчетЗарплатыРасширенный.ЗаписатьПакетВидовРасчета(МассивВидовРасчета);

КонецПроцедуры

Процедура ЗаполнитьРегистрСведенийОФизическихЛицахУчастникахВОВ() Экспорт
	
	НаборЗаписей = РегистрыСведений.СведенияОФизическихЛицахУчастникахВОВ.СоздатьНаборЗаписей();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДАТАВРЕМЯ(2022, 1, 1) КАК Период,
		|	ДАТАВРЕМЯ(2022, 1, 1) КАК ДатаРегистрацииИзменений,
		|	СведенияОФизическихЛицахУчастникахВОВ.ДатаВыдачи КАК ДатаВыдачи,
		|	СведенияОФизическихЛицахУчастникахВОВ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЗНАЧЕНИЕ(Перечисление.КатегорииФизическихЛицУчастниковВОВ.УчастникВОВ) КАК Статус
		|ИЗ
		|	РегистрСведений.СведенияОФизическихЛицахУчастникахВОВ.СрезПоследних(ДАТАВРЕМЯ(2022, 1, 1)) КАК СведенияОФизическихЛицахУчастникахВОВ
		|ГДЕ
		|	СведенияОФизическихЛицахУчастникахВОВ.Статус = ЗНАЧЕНИЕ(Перечисление.КатегорииФизическихЛицУчастниковВОВ.ИнвалидВОВ)
		|	И НЕ СведенияОФизическихЛицахУчастникахВОВ.Период = ДАТАВРЕМЯ(2022, 1, 1)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ВыборкаДетальныеЗаписи.ФизическоеЛицо);
		
		СтрокаНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, ВыборкаДетальныеЗаписи);
		
		Попытка
			
			НаборЗаписей.Записать();

		Исключение
			
			ТекстСообщения = НСтр(
			"ru = 'при записи набора данных ""Сведения об участниках ВОВ и лицах, приравненных к ним"" произошла ошибка: 
			|%1");
			
			ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
			
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Не удалось обновить ""Регистр сведений  ""Сведения об участниках ВОВ и лицах, приравненных к ним"""".'"), 
			УровеньЖурналаРегистрации.Ошибка, , , Комментарий);					
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

