#Область ПрограммныйИнтерфейс

// Определяет список модулей библиотек и конфигурации, которые предоставляют
// основные сведения о себе: имя, версия, список обработчиков обновления
// а также зависимости от других библиотек.
//
// Состав обязательных процедур такого модуля см. в общем модуле ОбновлениеИнформационнойБазыБСП
// (область ПрограммныйИнтерфейс).
// При этом сам модуль Библиотеки стандартных подсистем ОбновлениеИнформационнойБазыБСП
// не требуется явно добавлять в массив МодулиПодсистем.
//
// Параметры:
//  МодулиПодсистем - Массив - имена серверных общих модулей библиотек и конфигурации.
//                             Например: "ОбновлениеИнформационнойБазыБРО" - библиотека,
//                                       "ОбновлениеИнформационнойБазыБП"  - конфигурация.
//                    
Процедура ПриДобавленииПодсистем(МодулиПодсистем) Экспорт
	
	//++ НЕ ГИСМ
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБТС");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБЭД");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБИП");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБИД");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыЕГАИС");
	//-- НЕ ГИСМ
	
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБПО");
	//++ НЕ ЕГАИС
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыГИСМ");
	//-- НЕ ЕГАИС
	
	//++ НЕ ГИСМ
	//++ НЕ УТ
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБРО");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыЗарплатаКадрыРасширенный");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБП");
	//-- НЕ УТ
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыУТ");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыУТК");
	
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыЭСФВС");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыWebKassa");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыЭАВР");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыСНТ");
	
	//++ НЕ УТ
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыКА");
	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыКАК");
	//-- НЕ УТ
	//-- НЕ ГИСМ
КонецПроцедуры

#КонецОбласти
