////////////////////////////////////////////////////////////////////////////////
// ОтчетностьВБанкиСлужебныйПереопределяемый: переопределяемые механизмы
// формирования и отправки финансовой отчетности в банки.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Находит счет по коду в плане счетов, в котором ведется бухгалтерский учет,
// и помещает ссылку в переданную переменную.
//
// Параметры:
//   КодСчета - Строка - код счета, который нужно найти в плане счетов;
//   СчетУчета - Произвольный - переменная, в которую будет помещен результат поиска.
//
// Пример реализации:
//   СчетУчета = ПланыСчетов.Хозрасчетный.НайтиПоКоду(КодСчета);
//
Процедура УстановитьСчетУчетаПоКоду(КодСчета, СчетУчета) Экспорт
	
КонецПроцедуры

// Добавляет ссылки на счета учета и их названия в переданную таблицу.
//
// Параметры:
//   ИмяФормы - Строка - имя формы отчета БухгалтерскаяОтчетностьВБанк, для которой заполняется список счетов.
//   ВидОтчета - Строка - имя отчета, для которого надо заполнить список счетов.
//   ТаблицаСчетов - ТаблицаЗначений - таблица с колонками, в которую будут помещены счета для отчетов:
//     * Включен - Булево - признак включения счета в отчет;
//     * Счет - ПланСчетовСсылка - ссылка на счет плана счетов, в котором ведется бухгалтерский учет;
//     * Наименование - Строка - наименование счета плана счетов, в котором ведется бухгалтерский учет.
//
// Пример реализации:
//   ЗаполнениеОтчетностиВБанки.ДобавитьСчетаЗаполнения(ИмяФормы, ВидОтчета, ТаблицаСчетов);
//
Процедура ЗаполнитьТаблицуСчетовЗаполнения(ИмяФормы, ВидОтчета, ТаблицаСчетов) Экспорт
	
КонецПроцедуры

// Добавляет банки и их БИК в переданную таблицу.
// 
// Параметры:
//   Организация - СправочникСсылка.Организация - организация, для которой нужно получить таблицу с банками.
//   ТаблицаБанков - ТаблицаЗначений - таблица с колонками:
//     * БИК  - Строка - БИК банка.
//     * Банк - ОпределяемыйТип.СправочникБанкиБРО - банк.
//
// Пример реализации:
//   Запрос = Новый Запрос;
//   Запрос.УстановитьПараметр("Организация", Организация);
//   Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
//                  |	БанковскиеСчетаОрганизаций.Банк.Код КАК БИК,
//                  |	БанковскиеСчетаОрганизаций.Банк КАК Банк
//                  |ИЗ
//                  |	Справочник.БанковскиеСчета КАК БанковскиеСчетаОрганизаций
//                  |ГДЕ
//                  |	БанковскиеСчетаОрганизаций.Владелец = &Организация
//                  |	И НЕ БанковскиеСчетаОрганизаций.ПометкаУдаления
//                  |
//                  |СГРУППИРОВАТЬ ПО
//                  |	БанковскиеСчетаОрганизаций.Банк,
//                  |	БанковскиеСчетаОрганизаций.Банк.Код";
//   
//   ТаблицаБанков = Запрос.Выполнить().Выгрузить();
//
Процедура ЗаполнитьТаблицуБанковРасчетныхСчетовОрганизации(Организация, ТаблицаБанков) Экспорт
	
КонецПроцедуры

// Заполняет дерево счетов бухгалтерского учета.
//
// Параметры:
//   ДеревоСчетовБУ - ДеревоЗначений - дерево значений, в которое будут помещены счета.
//
// Пример реализации:
//   Запрос = Новый Запрос;
//   Запрос.Текст =
//       "ВЫБРАТЬ
//       |	Хозрасчетный.Ссылка КАК Ссылка,
//       |	Хозрасчетный.Код КАК Код,
//       |	Хозрасчетный.Наименование КАК Наименование,
//       |	ВЫБОР
//       |		КОГДА Хозрасчетный.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
//       |			ТОГДА ""А""
//       |		ИНАЧЕ ВЫБОР
//       |				КОГДА Хозрасчетный.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
//       |					ТОГДА ""П""
//       |				ИНАЧЕ ""АП""
//       |			КОНЕЦ
//       |	КОНЕЦ КАК Вид
//       |ИЗ
//       |	ПланСчетов.Хозрасчетный КАК Хозрасчетный
//       |ГДЕ
//       |	НЕ Хозрасчетный.Забалансовый
//       |
//       |УПОРЯДОЧИТЬ ПО
//       |	Код
//       |ИТОГИ ПО
//       |	Ссылка ИЕРАРХИЯ";
//   
//   ДеревоСчетовБУ = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
//
Процедура ЗаполнитьДеревоСчетовБУ(ДеревоСчетовБУ) Экспорт
	
КонецПроцедуры

// Устанавливает банк по умолчанию в переданной переменой.
//
// Параметры:
//   БанкОрганизации - Произвольный - переменная, которой будет присвоена ссылка на банк.
//
// Пример реализации:
//   БанкОрганизации = Справочники.Банки.НайтиПоКоду("044525225");
//
Процедура ЗаполнитьБанкПоУмолчанию(БанкОрганизации) Экспорт
	
КонецПроцедуры

#КонецОбласти
