
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.ДвиженияДенежныхСредств.Очистить();
	Объект.Распределение.Очистить();
	
	Запрос	= Новый Запрос;
	Запрос.Текст	= ТекстЗапросаДвиженияДенежныхСредств();
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	
	Результаты	= Запрос.ВыполнитьПакет();
	
	Выборка	= Результаты[1].Выбрать();
	Способы	= Результаты[2].Выгрузить();
	
	Пока Выборка.Следующий() Цикл

		НайденноеРаспределение	= Способы.НайтиСтроки(Новый Структура("Статья", Выборка.Статья)); 
		Если НайденноеРаспределение.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока	= Объект.ДвиженияДенежныхСредств.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КлючСтроки	= XMLСтрока(Новый УникальныйИдентификатор);
		НоваяСтрока.КлючСтроки	= КлючСтроки;
		
		Сумма	= НоваяСтрока.Приход;
		
		ПоследняяСтрока	= Неопределено;
		
		Для Каждого СтрокаТЧ Из НайденноеРаспределение Цикл
			
			Если Сумма = 0 Тогда
				Прервать;
			КонецЕсли;
			
			СтрокаРаспределения	= Объект.Распределение.Добавить();
			СтрокаРаспределения.Фонд		= СтрокаТЧ.Фонд;
			СтрокаРаспределения.КлючСтроки	= КлючСтроки;
			
			Если СтрокаТЧ.СпособПополнения = Перечисления.ФП_СпособПополненияФонда.Процентом Тогда
				СтрокаРаспределения.Приход	= Мин(Сумма, ОКР(НоваяСтрока.Приход / 100 * СтрокаТЧ.Значение));
			Иначе
				СтрокаРаспределения.Приход	= Мин(Сумма, СтрокаТЧ.Значение);
			КонецЕсли;
			
			Сумма	= Сумма - СтрокаРаспределения.Приход;
			ПоследняяСтрока	= СтрокаРаспределения;
			
		КонецЦикла;   
		
		Если Сумма <> 0 И ПоследняяСтрока <> Неопределено Тогда
			ПоследняяСтрока.Приход	= ПоследняяСтрока.Приход + Сумма;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	УстановитьОтборРаспределения();
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаДвиженияДенежныхСредств()
	
	ТекстЗапроса	= 
	"ВЫБРАТЬ
	|	ДенежныеСредстваБезналичные.БанковскийСчет КАК МестоХранения,
	|	ДенежныеСредстваБезналичные.СтатьяДвиженияДенежныхСредств КАК Статья,
	|	СУММА(ДенежныеСредстваБезналичные.Сумма) КАК Сумма,
	|	ДенежныеСредстваБезналичные.ВидДвижения КАК ВидДвижения
	|ПОМЕСТИТЬ ВТ_ДанныеДвижений
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные КАК ДенежныеСредстваБезналичные
	|ГДЕ
	|	ДенежныеСредстваБезналичные.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|СГРУППИРОВАТЬ ПО
	|	ДенежныеСредстваБезналичные.БанковскийСчет,
	|	ДенежныеСредстваБезналичные.СтатьяДвиженияДенежныхСредств,
	|	ДенежныеСредстваБезналичные.ВидДвижения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеСредстваНаличные.Касса,
	|	ДенежныеСредстваНаличные.СтатьяДвиженияДенежныхСредств,
	|	СУММА(ДенежныеСредстваНаличные.Сумма),
	|	ДенежныеСредстваНаличные.ВидДвижения
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные КАК ДенежныеСредстваНаличные
	|ГДЕ
	|	ДенежныеСредстваНаличные.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|СГРУППИРОВАТЬ ПО
	|	ДенежныеСредстваНаличные.Касса,
	|	ДенежныеСредстваНаличные.СтатьяДвиженияДенежныхСредств,
	|	ДенежныеСредстваНаличные.ВидДвижения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДвижений.МестоХранения КАК МестоХранения,
	|	ВТ_ДанныеДвижений.Статья КАК Статья,
	|	ВТ_ДанныеДвижений.ВидДвижения КАК ВидДвижения,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ДанныеДвижений.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА ВТ_ДанныеДвижений.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Приход
	|ИЗ
	|	ВТ_ДанныеДвижений КАК ВТ_ДанныеДвижений
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеДвижений.МестоХранения,
	|	ВТ_ДанныеДвижений.Статья,
	|	ВТ_ДанныеДвижений.ВидДвижения
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ДанныеДвижений.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА ВТ_ДанныеДвижений.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФП_НастройкаПоступленияВФондыСрезПоследних.Фонд КАК Фонд,
	|	ФП_НастройкаПоступленияВФондыСрезПоследних.СтатьяДвиженияДенежныхСредств КАК Статья,
	|	ФП_НастройкаПоступленияВФондыСрезПоследних.СпособПополнения КАК СпособПополнения,
	|	ФП_НастройкаПоступленияВФондыСрезПоследних.Значение КАК Значение,
	|	ВЫБОР
	|		КОГДА ФП_НастройкаПоступленияВФондыСрезПоследних.СпособПополнения = ЗНАЧЕНИЕ(Перечисление.ФП_СпособПополненияФонда.Суммой)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	РегистрСведений.ФП_НастройкаПоступленияВФонды.СрезПоследних КАК ФП_НастройкаПоступленияВФондыСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет"
	;
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаКлиенте
Процедура ДвиженияДенежныхСредствПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборРаспределения();
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьОтборРаспределения()
	
	ТекущиеДанные	= Элементы.ДвиженияДенежныхСредств.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда               
		Элементы.Распределение.ОтборСтрок	= Новый ФиксированнаяСтруктура("КлючСтроки", ТекущиеДанные.КлючСтроки);
	Иначе
		Элементы.Распределение.ОтборСтрок	= Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока Тогда
		ТекущиеДанные				= Элементы.ДвиженияДенежныхСредств.ТекущиеДанные;
		ТекущиеДанныеРаспределение	= Элементы.Распределение.ТекущиеДанные;
		ТекущиеДанныеРаспределение.КлючСтроки	= ТекущиеДанные.КлючСтроки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	ТекущиеДанные	= Элементы.ДвиженияДенежныхСредств.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, "Не выбрано движение");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДенежныхСредствПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные				= Элементы.ДвиженияДенежныхСредств.ТекущиеДанные;
		ТекущиеДанные.КлючСтроки	= Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры


