#Область СлужебныйПрограммныйИнтерфейс

//См. РасчетЗарплатыРасширенныйКлиентСервер.ОписаниеРасчетногоДокумента
Процедура ДополнитьОписаниеРасчетногоДокумента(ПоляОписания) Экспорт
	
	ПоляОписания = ПоляОписания + ",
		|НалогиВзносыОтчисленияИмя,
		|ДоходыНеПодлежащиеНалогообложениюИмя,
		|ВычетыИПНИмя";
	
КонецПроцедуры

//Процедура дополняет описание документа, таблиц документа, панелей документа.
Процедура ОписаниеДокумента(Описание) Экспорт
	
	Если ТипЗнч(Описание) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Описание.Свойство("НалогиВзносыОтчисленияИмя") Тогда
		Описание.НалогиВзносыОтчисленияИмя = "НалогиВзносыОтчисления";
	КонецЕсли;
	Если Описание.Свойство("ДоходыНеПодлежащиеНалогообложениюИмя") Тогда
		Описание.ДоходыНеПодлежащиеНалогообложениюИмя = "ДоходыНеПодлежащиеНалогообложению";
	КонецЕсли;
	Если Описание.Свойство("ВычетыИПНИмя") Тогда
		Описание.ВычетыИПНИмя = "ВычетыИПН";
	КонецЕсли;
	
КонецПроцедуры

//См. РасчетЗарплатыРасширенныйКлиентСервер.ОчиститьТаблицыДокумента
Процедура ОчиститьТаблицыДокумента(ИменаПолейИменТаблиц) Экспорт
	
	ИменаПолейИменТаблиц.Добавить("НалогиВзносыОтчисленияИмя");
	ИменаПолейИменТаблиц.Добавить("ДоходыНеПодлежащиеНалогообложениюИмя");
	ИменаПолейИменТаблиц.Добавить("ВычетыИПНИмя");
	
КонецПроцедуры

// Ключевые реквизиты документов начислений, очищаемые при изменении данных
//
Процедура ДополнитьКлючевыеРеквизитыТаблицыОчищаемыеПриИзменении(Массив) Экспорт
	
	Массив.Добавить("Объект.ДоходыНеПодлежащиеНалогообложению");
	Массив.Добавить("Объект.НалогиВзносыОтчисления");
	Массив.Добавить("Объект.ВычетыИПН");
	
КонецПроцедуры

Процедура ДополнитьКонтролируемыеПоля(КонтролируемыеПоля) Экспорт
	
	КонтролируемыеПоля.Вставить("НалогиВзносыОтчисления", УчетНалоговВзносовОтчисленийРасширенныйВызовСервера.КонтролируемыеПоляДляФиксацииРезультатов());
	КонтролируемыеПоля.Вставить("ДоходыНеПодлежащиеНалогообложению", УчетНалоговВзносовОтчисленийРасширенныйВызовСервера.КонтролируемыеПоляНеоблагаемыхДоходовДляФиксацииРезультатов());
	
КонецПроцедуры

Процедура УстановитьСвойстваЭлементовФормы(Форма, ИмяМесяцНачисления = "МесяцНачисления") Экспорт
	
	ДатаПримененияКорректировкиДохода = '2019-01-01';
	ДатаУменьшенияОблагаемогоДохода = '2021-01-01';
	
	Объект = Форма.Объект;
	
	Если Объект[ИмяМесяцНачисления] >= ДатаУменьшенияОблагаемогоДохода Тогда
		Форма.Элементы.НалогиВзносыОтчисленияПримененнаяЛьгота.Заголовок = НСтр("ru = 'Сумма уменьшения облагаемого дохода'");	
	ИначеЕсли Объект[ИмяМесяцНачисления] >= ДатаПримененияКорректировкиДохода Тогда
		Форма.Элементы.НалогиВзносыОтчисленияПримененнаяЛьгота.Заголовок = НСтр("ru = 'Примененная корректировка'");	
	Иначе
		Форма.Элементы.НалогиВзносыОтчисленияПримененнаяЛьгота.Заголовок = НСтр("ru = 'Примененная льгота ИПН (до 2018 г)'");	
	КонецЕсли;

КонецПроцедуры

Процедура НазначитьИдентификаторСтрокеНалогиВзносыОтчисления(СтрокаНалогиВзносыОтчисления, МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления, НоваяСтрока) Экспорт
	
	Если Не НоваяСтрока Или СтрокаНалогиВзносыОтчисления.ИдентификаторСтрокиНалогиВзносыОтчисления > 0 Тогда
		Возврат;
	КонецЕсли;
	
	МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления = МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления + 1;
	СтрокаНалогиВзносыОтчисления.ИдентификаторСтрокиНалогиВзносыОтчисления = МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления;
	
КонецПроцедуры

#КонецОбласти