Процедура ЗапомнитьСобеседника(Сообщение, ДанныеБота) Экспорт
	
	МЗ = РегистрыСведений.ТелеграмСобеседники.СоздатьМенеджерЗаписи();
	МЗ.Бот = ДанныеБота.Бот;
	МЗ.ИдентификаторЧата = Сообщение.chat.id;
	МЗ.Прочитать();
	
	Если МЗ.Выбран() Тогда
		СчетчикПринятыхСообщений = МЗ.СчетчикПринятыхСообщений + 1;
	Иначе
		СчетчикПринятыхСообщений = 1;
	КонецЕсли;
	
	МЗ.Бот = ДанныеБота.Бот;
	МЗ.ИдентификаторЧата = Сообщение.chat.id;
	
	Попытка
		МЗ.first_name = ?(Сообщение.chat.Свойство("first_name"), Сообщение.chat.first_name, "");
	Исключение
		
	КонецПопытки;
	
	Попытка
		МЗ.last_name = ?(Сообщение.chat.Свойство("last_name"), Сообщение.chat.last_name, "");
	Исключение
		
	КонецПопытки;
	
	Попытка
		МЗ.username = ?(Сообщение.chat.Свойство("username"), Сообщение.chat.username, "");
	Исключение
		
	КонецПопытки;
	
	МЗ.Дата = ТекущаяДата();
	МЗ.СчетчикПринятыхСообщений = СчетчикПринятыхСообщений;
	МЗ.Записать();
	
КонецПроцедуры