#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Округляет число по правилам указанным в объекте.
// 
// Параметры:
//  Число                   - число, число которое необходимо округлить.
//
// Возвращаемое значение:
// 	Число - округленное до заданной точности значение.
//
Функция Округлить(Число) Экспорт
	Возврат ЗарплатаКадрыКлиентСервер.Округлить(Число, Точность, ПравилоОкругления);	
КонецФункции	

// ЗУПК
Процедура ПриЗаписи(Отказ)
	// Обновляем кэш платформы для зачитывания актуальных настроек
	// используется в ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления.
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры
// ЗУПК

#КонецОбласти

#КонецЕсли