
&ИзменениеИКонтроль("ПолучитьНаборСвойств")
Функция игр_ПолучитьНаборСвойств(КлючНабора)

	#Удаление
	ПредопределенныеНаборыСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.ПредопределенныеНаборыСвойств();
	#КонецУдаления
	#Вставка
	ПредопределенныеНаборыСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.игр_ПредопределенныеНаборыСвойств();
	#КонецВставки

	ДанныеПоКлючуНабора = ПредопределенныеНаборыСвойств.Получить(КлючНабора);

	Если ДанныеПоКлючуНабора = Неопределено Тогда
		Возврат Справочники.НаборыДополнительныхРеквизитовИСведений.ПустаяСсылка();	
	Иначе
		Возврат ДанныеПоКлючуНабора.Ссылка;	
	КонецЕсли;

КонецФункции
