&НаКлиенте
Перем СтрокаПриемникПриПеретаскивании;

//Работа с настройками вынесена из модуля обработки для ускорения 

// Настройки хранятся в ЭКОМ_ЗначениеДополнительныхКонстант
// Имя - имя настройки
// опрЗначение - значение по умолчанию
// Измерение - может хранится в разрезе (организаций, пользователей)
&НаСервереБезКонтекста
Функция НастройкаПрочитатьОбщийМодуль(ИмяНастройки, ЗначениеПоУмолчанию = Неопределено, Измерение = Неопределено, Обязательно = Ложь)
	Результат = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(ИмяНастройки, ЗначениеПоУмолчанию, Измерение, Обязательно)");	
   	Возврат Результат;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ (НА СЕРВЕРЕ)
Процедура ВыгрузитьСтрокиЭлементаДереваЗначений(Источник, Приемник, ИменаКолонокДляКопирования) Экспорт
    ВложенныеСтроки = Источник.Строки;
    
    Если ТипЗнч(Приемник) = Тип("ДеревоЗначений") Тогда
        Для каждого ИмяКолонки Из ИменаКолонокДляКопирования Цикл
            Если Приемник.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
                Приемник.Колонки.Добавить(ИмяКолонки, Источник.Колонки[ИмяКолонки].ТипЗначения);
            КонецЕсли;
        КонецЦикла;
    КонецЕсли;
    
    Для каждого СтрокаИсточник Из ВложенныеСтроки Цикл
        СтрокаПриемник = Приемник.Строки.Добавить();
        Для каждого ИмяКолонки Из ИменаКолонокДляКопирования Цикл
            СтрокаПриемник[ИмяКолонки] = СтрокаИсточник[ИмяКолонки];
        КонецЦикла;
        //ЗаполнитьЗначенияСвойств(СтрокаПриемник, СтрокаИсточник, ИменаКолонокДляКопирования);
        ВыгрузитьСтрокиЭлементаДереваЗначений(СтрокаИсточник, СтрокаПриемник, ИменаКолонокДляКопирования);
    КонецЦикла;
    
КонецПроцедуры

Процедура СкопироватьСовпадающиеКолонкиВРезультат(Источник, Приемник) Экспорт
	
	Если НЕ (ТипЗнч(Источник) = Тип("ДеревоЗначений") 
		И ТипЗнч(Приемник) = Тип("ДеревоЗначений")) Тогда
        Возврат;	
    КонецЕсли;
    
    ВсеКолонкиИсточника = Источник.Колонки;
    ВсеКолонкиПриемника = Приемник.Колонки;
    
    КолонкиДляКопирования = Новый Массив;
    Для каждого КолонкаИсточник Из ВсеКолонкиИсточника Цикл
        ИмяКолонки = КолонкаИсточник.Имя;
        ТипКолонки = КолонкаИсточник.ТипЗначения;
        
        ТакаяЖеКолонкаПриемник = ВсеКолонкиПриемника.Найти(ИмяКолонки);
        
        Если ТакаяЖеКолонкаПриемник <> Неопределено И ТипЗнч(КолонкаИсточник.ТипЗначения) = ТипЗнч(ТакаяЖеКолонкаПриемник.ТипЗначения) Тогда
        	КолонкиДляКопирования.Добавить(ИмяКолонки);
        КонецЕсли;
    КонецЦикла;
    Если КолонкиДляКопирования.Количество() = 0 Тогда
    	Источник = Приемник.Скопировать();
        Источник.Строки.Очистить();
    Иначе
        ВыгрузитьСтрокиЭлементаДереваЗначений(Источник, Приемник, КолонкиДляКопирования);
	КонецЕсли;
	
КонецПроцедуры //СкопироватьСовпадающиеКолонкиВРезультат() 

&НаСервере
Процедура УстановитьЗначениеРеквизитаФормы(ИмяРеквизита, Знач Значение)
    
	ТипРеквизита = ТипЗнч(ЭтаФорма[ИмяРеквизита]);	
	Если Значение = Неопределено Тогда								
		Если ТипРеквизита = Тип("Булево") Тогда
			Значение = Ложь;			 			 
		ИначеЕсли ТипРеквизита = Тип("Строка") Тогда
			Значение = "";
		ИначеЕсли ТипРеквизита = Тип("Число") Тогда
			Значение = 0;	
		ИначеЕсли ТипРеквизита = Тип("ДанныеФормыКоллекция") Тогда
			Попытка
				Значение = ЭтаФорма[ИмяРеквизита].Выгрузить(); // Попытка получить пустое значение из реквизита формы
			Исключение КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипРеквизита = Тип("ДанныеФормыКоллекция") 
		Или ТипРеквизита = Тип("ДанныеФормыСтруктура")
		Или ТипРеквизита = Тип("ДанныеФормыСтруктураСКоллекцией") Тогда
		
		Если ТипЗнч(Значение) = Тип("Строка") Тогда
			 Возврат;
		КонецЕсли;
		
		Попытка
			ЗначениеВРеквизитФормы(Значение, ИмяРеквизита);
							
		Исключение
			ПриемникРезультат = РеквизитФормыВЗначение(ИмяРеквизита, Тип("ДеревоЗначений"));
            СкопироватьСовпадающиеКолонкиВРезультат(Значение, ПриемникРезультат);
            Если ТипЗнч(Элементы[ИмяРеквизита]) = Тип("ТаблицаФормы") Тогда
                Попытка
                    ЗначениеВРеквизитФормы(ПриемникРезультат, ИмяРеквизита);
                Исключение
                    Если ТипЗнч(ИмяРеквизита) = Тип("ТаблицаЗначений") Тогда
                        ЭтаФорма[ИмяРеквизита].Загрузить(ПриемникРезультат);
                    КонецЕсли;
                КонецПопытки;
            Иначе
                ЗначениеВРеквизитФормы(ПриемникРезультат, ИмяРеквизита);
            КонецЕсли;
		КонецПопытки;
		
	ИначеЕсли ТипРеквизита = Тип("ДанныеФормыДерево") Тогда
		
		Попытка			
			// Очищаем
			ЛокальныйОбъект = ДанныеФормыВЗначение(ЭтаФорма[ИмяРеквизита], Тип("ДеревоЗначений"));
			ЛокальныйОбъект.Строки.Очистить();
			ЗначениеВРеквизитФормы(ЛокальныйОбъект, ИмяРеквизита);
			
			// Заполняем новыми данными
			ЗначениеВРеквизитФормы(Значение, ИмяРеквизита);
		Исключение
			ПриемникРезультат = РеквизитФормыВЗначение(ИмяРеквизита, Тип("ДеревоЗначений"));
            СкопироватьСовпадающиеКолонкиВРезультат(Значение, ПриемникРезультат);
            Если ТипЗнч(Элементы[ИмяРеквизита]) = Тип("ТаблицаФормы") Тогда
                Попытка
                    ЗначениеВРеквизитФормы(ПриемникРезультат, ИмяРеквизита);
                Исключение
                    Если ТипЗнч(ИмяРеквизита) = Тип("ТаблицаЗначений") Тогда
                        ЭтаФорма[ИмяРеквизита].Загрузить(ПриемникРезультат);
                    КонецЕсли;
                КонецПопытки;
            Иначе
                ЗначениеВРеквизитФормы(ПриемникРезультат, ИмяРеквизита);
            КонецЕсли;
		КонецПопытки;	
		
	Иначе
		ЭтаФорма[ИмяРеквизита] = Значение; 
	КонецЕсли;
    
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокНастроекНаСервере(МассивНастроек = Неопределено)
	
	ОбъектЭтаОбработка = РеквизитФормыВЗначение("Объект");
    Результат          = ОбъектЭтаОбработка.ПолучитьСписокНастроек(МассивНастроек);

    Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьНастройкиНаФорму()
	
	ОбъектЭтаОбработка = РеквизитФормыВЗначение("Объект");
 	
	СоответствиеРеквизитовФормы = Новый Соответствие;
	РеквизитыФормы = ЭтаФорма.ПолучитьРеквизиты();
	Для каждого Стр Из РеквизитыФормы Цикл
	    СоответствиеРеквизитовФормы.Вставить(Стр.Имя, Стр);			
	КонецЦикла;
	
	НастройкиЭКОМ = ПолучитьСписокНастроекНаСервере();
	Для каждого Настройка Из НастройкиЭКОМ Цикл
		СоответствиеРеквизитаФормы = СоответствиеРеквизитовФормы.Получить(Настройка.Ключ);
		Если НЕ СоответствиеРеквизитаФормы = Неопределено Тогда
			УстановитьЗначениеРеквизитаФормы(Настройка.Ключ, Настройка.Значение); 
		Иначе
			Если Прав(Настройка.Ключ, 9) = "Служебный" Тогда
				ИмяРеквизитаФормы = Лев(Настройка.Ключ, СтрДлина(Настройка.Ключ)-9);
				СоответствиеРеквизитаФормы = СоответствиеРеквизитовФормы.Получить(ИмяРеквизитаФормы);
				Если НЕ СоответствиеРеквизитаФормы = Неопределено Тогда
					УстановитьЗначениеРеквизитаФормы(ИмяРеквизитаФормы, Настройка.Значение); 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;   	
	КонецЦикла;
	
	Если СлужебныйДеревоКонфигурации.ПолучитьЭлементы().Количество() = 0 Тогда
        СлужебныйДеревоКонфигурации = ОбъектЭтаОбработка.ЗаполнитьДеревоКонфигурации(Истина);
    КонецЕсли;
	
    ЭтаФорма.СтраницаПриОткрытии = НастройкиЭКОМ.Получить("СлужебныйСтраницаНастроекМодуляПриЗакрытии" + "Служебный"); 

	ЭтаФорма.ЭКОМ_ПрочиеНастройки.Очистить();
	НоваяСтрока = ЭтаФорма.ЭКОМ_ПрочиеНастройки.Добавить();
	НоваяСтрока.Использовать = ЭтаФорма.ЭКОМ_ОбменСеть;
	НоваяСтрока.ЗапросДляТабличнойЧастиТекст = ИнтерфейсНастройкаТабличнойЧастиНаСервере("СлужебныйЗапросДляФормыПокупателя");
	НоваяСтрока.ТипОбмена = "Сеть";
	НоваяСтрока.ПодпискаДляДокументов = "";
	
	НоваяСтрока = ЭтаФорма.ЭКОМ_ПрочиеНастройки.Добавить();
	НоваяСтрока.Использовать = ЭтаФорма.ЭКОМ_ОбменПоставщик;
	НоваяСтрока.ЗапросДляТабличнойЧастиТекст = ИнтерфейсНастройкаТабличнойЧастиНаСервере("СлужебныйЗапросДляФормыПоставщика");
	НоваяСтрока.ТипОбмена = "Поставщик";
	НоваяСтрока.ПодпискаДляДокументов = "";
	
	НоваяСтрока = ЭтаФорма.ЭКОМ_ПрочиеНастройки.Добавить();
	НоваяСтрока.Использовать = ЭтаФорма.ЭКОМ_ОбменЭТРН;
	НоваяСтрока.ЗапросДляТабличнойЧастиТекст = ИнтерфейсНастройкаТабличнойЧастиНаСервере("СлужебныйЗапросДляФормыЭТРН");
	НоваяСтрока.ТипОбмена = "ЭТРН";
	НоваяСтрока.ПодпискаДляДокументов = "";
	
	НоваяСтрока = ЭтаФорма.ЭКОМ_ПрочиеНастройки.Добавить();
	НоваяСтрока.Использовать = ЭтаФорма.ЭКОМ_ОбменCondra;
	НоваяСтрока.ЗапросДляТабличнойЧастиТекст = ИнтерфейсНастройкаТабличнойЧастиНаСервере("СлужебныйЗапросДляФормыCondra");
	НоваяСтрока.ТипОбмена = "Неструкт. докум.";
	НоваяСтрока.ПодпискаДляДокументов = "";
	
	НоваяСтрока = ЭтаФорма.ЭКОМ_ПрочиеНастройки.Добавить();
	НоваяСтрока.Использовать = ЭтаФорма.ЭКОМ_ОбменПрайсЛист;
	НоваяСтрока.ЗапросДляТабличнойЧастиТекст = ИнтерфейсНастройкаТабличнойЧастиНаСервере("СлужебныйЗапросДляФормыПрайсЛист");
	НоваяСтрока.ТипОбмена = "Прайс-лист";
	НоваяСтрока.ПодпискаДляДокументов = "";
	
    ЗначениеВРеквизитФормы(ОбъектЭтаОбработка, "Объект");
КонецПроцедуры

&НаСервере
Процедура ИнициализацияТогоЧтоНеСохраняется()
    
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    СлужебныйПолноеИмяФормы = ОбработкаОбъект.Метаданные().ПолноеИмя();
    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект 	= РеквизитФормыВЗначение("Объект");
    ПолноеИмяОбработки	= ОбработкаОбъект.Метаданные().ПолноеИмя();
	
	ПараметрыОткрытия = ЭтаФорма.Параметры;
    ПараметрыОткрытия.Свойство("НеЗапрашиватьПароль", 	ЭтаФорма.НеЗапрашиватьПароль);
	ПараметрыОткрытия.Свойство("ЭКОМОбъектыАктуальны", 	ЭтаФорма.ЭКОМОбъектыАктуальны);
	
    ЗагрузитьНастройкиНаФорму();
    ИнициализацияТогоЧтоНеСохраняется();
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	// Зададим отбор (условия при которых будет выполнено оформление)
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение     = Новый ПолеКомпоновкиДанных("СписокОбновлений.СтатусОбработки");
	ЭлементОтбора.ВидСравнения      = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение    = "Установлена";
	ЭлементОтбора.Использование     = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Роса);
	
	// Укажем какие поля (колонки) оформлять
	ПолеОформления      = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СписокОбновлений");
	ПолеОформления.Использование = Истина; 
	
	ЭлементОформления.Использование = Истина;
    
    Если Элементы.ГруппаПанельНастроек.ТекущаяСтраница = Элементы.ГруппаОбновления Тогда
    	ЗаполнитьИсториюТаблицыОбновлений();
    КонецЕсли;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
    Элементы.ИнфоОбновления.Заголовок = "Проверка наличия новой версии не произведена.";
    
	Параметры.Свойство("ДополнительнаяОбработкаСсылка", ЭтаФорма.ОбъектСсылка);
	
	//+Лысковец 20220126 / MOD-922 / MOD-570
	ЭтаФорма.ЗакрыватьПриЗакрытииВладельца = Истина;
	//-
	ДоступностьAPI = ОбработкаОбъект.ПолучитьДоступностьApiПоСтране();
	Если Не ДоступностьAPI Тогда 
		Элементы.КомандаДанныеКонтрагентаПоAPI.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

// Выполняется вызов функции из модуля объекта обарботки
//
// Параметры:
//  ИмяФункции  - Строка - наименование функции в модуле объекта
//  ПараметрыФункции  - Массив - парамеры функции в последовательности их заполнения 
//
// Возвращаемое значение:
//   Any   - результат выполнения функции
//
&НаСервере                             
Функция ВернутьРезультатИзМодуляОбъекта(ИмяФункции, ПараметрыФункции = Неопределено)	
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Если ПараметрыФункции = Неопределено Тогда	
		ПараметрыФункции = Новый Массив;	
	ИначеЕсли ТипЗнч(ПараметрыФункции) <> Тип("Массив") Тогда	
		ВызватьИсключение "Ошибка валидации входного параметра";		
	КонецЕсли;
	
	Результат = Неопределено;
	
	СтрокаФункции = "ОбработкаОбъект." + ИмяФункции + "(";
	Индекс = 0;
	
	ПараметрыФункцииСтруктура = Новый Структура;
	Пока Индекс < ПараметрыФункции.Количество() Цикл
		ПараметрыФункцииСтруктура.Вставить("Ключ_" + Индекс, ПараметрыФункции.Получить(Индекс));
		СтрокаФункции 	= СтрокаФункции + ?(Индекс = 0, "", ", ") + "ПараметрыФункцииСтруктура.Ключ_" + Индекс; 
		Индекс 			= Индекс + 1;
	КонецЦикла;
	
	СтрокаФункции = СтрокаФункции + ")";
	Результат = Вычислить(СтрокаФункции);
	
	Для Каждого ЭлементСтруктуры Из ПараметрыФункцииСтруктура Цикл
		Индекс = Число(СтрЗаменить(ЭлементСтруктуры.Ключ, "Ключ_", ""));
	    ПараметрыФункции.Вставить(Индекс, ЭлементСтруктуры.Значение);	
	КонецЦикла;
	
	Возврат Результат;

КонецФункции // ВернутьРезультатИзМодуляОбъекта()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ (НА КЛИЕНТЕ)

// Процедура обрабатывает выбор файла с заполнением реквзиита объекта
//
// Параметры:
//  ПомещенныеФайлы  - Массив - массив выбранных файлов. Предполагается, что будет выбран только один файл
//  ДополнительныеПараметры  - Строка - предполагается, что содержит имя реквизита обработки
//
&НаКлиенте
Процедура КаталогНачалоВыбораФайлаЗавершение(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт

    Если ПомещенныеФайлы = Неопределено Тогда
        Возврат;
    КонецЕсли;

	Для каждого ПереданныйФайл Из ПомещенныеФайлы Цикл
		Если НЕ Элементы.Найти(ДополнительныеПараметры) = Неопределено Тогда
			ЭтаФорма[ДополнительныеПараметры] = ПереданныйФайл;
			ЗаполнитьСписокДляИзменения(ПереданныйФайл, ДополнительныеПараметры);
			УстановитьМодифицированность();
		КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры // КаталогНачалоВыбораФайлаЗавершение()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Восстановление текущей страницы
    СменитьТекущуюСтраницу(СтраницаПриОткрытии); 

	// Скрываем элементы
	Элементы.ГруппаСтруктураСохранения.Видимость = Ложь; // становится видимой при нажатии кнопки сохранить
	
	Если ЭтаФорма.ЭКОМ_ИспПарольДляНастроек Тогда   
		
		Если НеЗапрашиватьПароль = Ложь Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("УстановитьПароль", Ложь);
			
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("ИмяФормы", "УФ_ФормаВводаПароля");
			
			ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);	
			ОткрытьФорму(ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаВводаПароля", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		КонецЕсли;
	Иначе
		ПарольВведенВерно = Истина;
	КонецЕсли;

	УправлениеВидимостью();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНД ВКЛАДКИ НАСТРОЙКИ

&НаКлиенте
Процедура ПодключениеЛокальныеКаталогиЗаполнитьПоУмолчанию(Команда)

	ДанныеОС = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ЭКОМ_ПолучитьРазделительПутиОСКлиента()");
	Диск = ДанныеОС.Получить("Диск");
	РазделительПути = ДанныеОС.Получить("РазделительПути");
		
	РабочийКаталог = Новый Файл(ЭтаФорма.ЭКОМ_Рабочий_Каталог);
	
	Если НЕ РабочийКаталог.Существует() ИЛИ РабочийКаталог.ЭтоФайл() Тогда       
		ЭтаФорма.ЭКОМ_Рабочий_Каталог = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ОпределитьКаталогПоУмолчанию(Диск, РазделительПути)");
		Попытка
			СоздатьКаталог(ЭтаФорма.ЭКОМ_Рабочий_Каталог);
		Исключение
			Сообщить("Ошибка создания каталога. Возможно у Вас нет прав на это действие.");
		КонецПопытки;
		РабочийКаталог = Новый Файл(ЭтаФорма.ЭКОМ_Рабочий_Каталог);
	КонецЕсли;
	
	ЭтаФорма.ЭКОМ_Локальный_Каталог_INBOX 			= РабочийКаталог.ПолноеИмя + РазделительПути + "inbox"      + РазделительПути;
	ЭтаФорма.ЭКОМ_Локальный_Каталог_INBOX_Архив  	= РабочийКаталог.ПолноеИмя + РазделительПути + "inbox_bak"  + РазделительПути;
	ЭтаФорма.ЭКОМ_Локальный_Каталог_OUTBOX       	= РабочийКаталог.ПолноеИмя + РазделительПути + "outbox"     + РазделительПути;
	ЭтаФорма.ЭКОМ_Локальный_Каталог_OUTBOX_Архив 	= РабочийКаталог.ПолноеИмя + РазделительПути + "outbox_bak" + РазделительПути;
	ЭтаФорма.ЭКОМ_Локальный_Каталог_UPDATE       	= РабочийКаталог.ПолноеИмя + РазделительПути + "update"     + РазделительПути;
	ЭтаФорма.ЭКОМ_Локальный_Каталог_Marking       	= РабочийКаталог.ПолноеИмя + РазделительПути + "marking"    + РазделительПути;
    
	СоздатьКаталог(ЭтаФорма.ЭКОМ_Локальный_Каталог_INBOX);
	СоздатьКаталог(ЭтаФорма.ЭКОМ_Локальный_Каталог_INBOX_Архив);
	СоздатьКаталог(ЭтаФорма.ЭКОМ_Локальный_Каталог_OUTBOX);
	СоздатьКаталог(ЭтаФорма.ЭКОМ_Локальный_Каталог_OUTBOX_Архив);
	СоздатьКаталог(ЭтаФорма.ЭКОМ_Локальный_Каталог_UPDATE);
	СоздатьКаталог(ЭтаФорма.ЭКОМ_Локальный_Каталог_Marking);
	
	ЗаполнитьСписокДляИзменения(ЭтаФорма.ЭКОМ_Рабочий_Каталог               , "ЭКОМ_Рабочий_Каталог");
	ЗаполнитьСписокДляИзменения(ЭтаФорма.ЭКОМ_Локальный_Каталог_INBOX       , "ЭКОМ_Локальный_Каталог_INBOX");
	ЗаполнитьСписокДляИзменения(ЭтаФорма.ЭКОМ_Локальный_Каталог_INBOX_Архив , "ЭКОМ_Локальный_Каталог_INBOX_Архив");
	ЗаполнитьСписокДляИзменения(ЭтаФорма.ЭКОМ_Локальный_Каталог_OUTBOX      , "ЭКОМ_Локальный_Каталог_OUTBOX");
	ЗаполнитьСписокДляИзменения(ЭтаФорма.ЭКОМ_Локальный_Каталог_OUTBOX_Архив, "ЭКОМ_Локальный_Каталог_OUTBOX_Архив");
	ЗаполнитьСписокДляИзменения(ЭтаФорма.ЭКОМ_Локальный_Каталог_UPDATE      , "ЭКОМ_Локальный_Каталог_UPDATE");
	ЗаполнитьСписокДляИзменения(ЭтаФорма.ЭКОМ_Локальный_Каталог_Marking     , "ЭКОМ_Локальный_Каталог_Marking");
	
КонецПроцедуры

&НаКлиенте
Процедура ХранениеДанныхЭКОМХраненияДанныхНажатие(Команда)	
	
	// Регистры сведений
	Если Команда.Имя = "ХранениеДанныхЭКОМ_GLN" Тогда
        ОткрытьФорму("РегистрСведений.ЭКОМ_GLN.ФормаСписка");
		
    ИначеЕсли Команда.Имя = "ХранениеДанныхЭКОМ_ТочкиДоставки" Тогда
        ОткрытьФорму("РегистрСведений.ЭКОМ_ТочкиДоставки.ФормаСписка");	
		
    ИначеЕсли Команда.Имя = "ХранениеДанныхЭКОМ_Объекты_События" Тогда
        ОткрытьФорму("РегистрСведений.ЭКОМ_Объекты_События.ФормаСписка");
		
    ИначеЕсли Команда.Имя = "ХранениеДанныхЭКОМ_ИсторияОбмена" Тогда
        ОткрытьФорму("РегистрСведений.ЭКОМ_ИсторияОбмена.ФормаСписка");	
		
    ИначеЕсли Команда.Имя = "ХранениеДанныхЭКОМ_ЗначениеДополнительныхКонстант" Тогда
        ОткрытьФорму("РегистрСведений.ЭКОМ_ЗначениеДополнительныхКонстант.ФормаСписка");
		
    ИначеЕсли Команда.Имя = "ХранениеДанныхЭКОМ_ТранспортнаяИнформация" Тогда
        ОткрытьФорму("РегистрСведений.ЭКОМ_ТранспортнаяИнформация.ФормаСписка");
		
	ИначеЕсли Команда.Имя = "ХранениеДанныхЭКОМ_НоменклатураКонтрагентов" Тогда
        ОткрытьФорму("РегистрСведений.ЭКОМ_НоменклатураКонтрагентов.ФормаСписка");	
		
	ИначеЕсли Команда.Имя = "ХранениеДанныхЭКОМ_ЦепочкиДокументовПоставщика" Тогда
        ОткрытьФорму("РегистрСведений.ЭКОМ_ЦепочкиДокументовПоставщика.ФормаСписка");	
		
	ИначеЕсли Команда.Имя = "ХранениеДанныхЭКОМ_ЦепочкиДокументовПокупателя" Тогда
        ОткрытьФорму("РегистрСведений.ЭКОМ_ЦепочкиДокументовПокупателя.ФормаСписка");	
		
	ИначеЕсли Команда.Имя = "ХранениеДанныхЭКОМ_ЦепочкиДокументовЭТРН" Тогда
        ОткрытьФорму("РегистрСведений.ЭКОМ_ЦепочкиДокументовЭТРН.ФормаСписка");	
		
	ИначеЕсли Команда.Имя = "ХранениеДанныхЭКОМ_ЦепочкиНеструктурированныхДокументов" Тогда
        ОткрытьФорму("РегистрСведений.ЭКОМ_ЦепочкиНеструктурированныхДокументов.ФормаСписка");
		
	ИначеЕсли Команда.Имя = "ХранениеДанныхЭКОМ_Маркировка" Тогда
        ОткрытьФорму("РегистрСведений.ЭКОМ_Маркировка.ФормаСписка");
	
	ИначеЕсли Команда.Имя = "ХранениеДанныхЭКОМ_Квитанции" Тогда
        ОткрытьФорму("РегистрСведений.ЭКОМ_Квитанции.ФормаСписка"); 
		
	ИначеЕсли Команда.Имя = "ХранениеДанныхЭКОМ_Логирование" Тогда
        ОткрытьФорму("РегистрСведений.ЭКОМ_Логирование.ФормаСписка"); 
		
	// Документы
	ИначеЕсли Команда.Имя = "ХранениеДанныхЭКОМ_Документы" Тогда
        ОткрытьФорму("Документ.ЭКОМ_Документы.ФормаСписка");
		
	// Справочники
	ИначеЕсли Команда.Имя = "ХранениеДанныхЭКОМ_ОператорыЭДО" Тогда
        ОткрытьФорму("Справочник.ЭКОМ_ОператорыЭДО.ФормаСписка");
		
	ИначеЕсли Команда.Имя = "ХранениеДанныхЭКОМ_Сертификаты" Тогда
        ОткрытьФорму("Справочник.ЭКОМ_Сертификаты.ФормаСписка");
		
	ИначеЕсли Команда.Имя = "ХранениеДанныхЭКОМ_ТипыНеструктурированныхДокументов" Тогда
        ОткрытьФорму("Справочник.ЭКОМ_ТипыНеструктДокументов.ФормаСписка");
		
	ИначеЕсли Команда.Имя = "ХранениеДанныхЭКОМ_ИнфоПоля" Тогда
        ОткрытьФорму("Справочник.ЭКОМ_ИнфоПоля.ФормаСписка");
		
	ИначеЕсли Команда.Имя = "ХранениеДанныхЭКОМ_ПрофилиОбмена" Тогда
        ОткрытьФорму("Справочник.ЭКОМ_ПрофилиОбмена.ФормаСписка");
		
	ИначеЕсли Команда.Имя = "ХранениеДанныхЭКОМ_Новости" Тогда
		ОткрытьФорму("РегистрСведений.ЭКОМ_Новости.ФормаСписка");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументооборотКонсольЗаданий(Команда)
	
	ЕстьОбработка = НайтиОбработкуРегламентныеИФоновыеЗадания();
	
	Если ЕстьОбработка = Истина Тогда
			
		ОткрытьФорму("Обработка.РегламентныеИФоновыеЗадания.Форма");
			
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Обработка - <<< Регламентные и фоновые задания >>> не найдена!";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиОбработкуРегламентныеИФоновыеЗадания()
	
	ЕстьОбработка = Истина;
	МетаданныеОбработки = Метаданные.Обработки.Найти("РегламентныеИФоновыеЗадания");
	Если МетаданныеОбработки = Неопределено Тогда
	     ЕстьОбработка = Ложь;
	КонецЕсли;
	 
	Возврат ЕстьОбработка;

КонецФункции

&НаКлиенте
Процедура ДокументооборотТестАвтоОбмена(Команда)
	
	АвтоматическийОбменEDIНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура АвтоматическийОбменEDIНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.АвтоматическийОбменEDI();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ВКЛАДКИ НАСТРОЙКИ

&НаКлиенте
Процедура УстановитьМодифицированность(Элемент = Неопределено)
	
	ЭтаФорма.Модифицированность = Истина;
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОписаниеОповещения 	= Новый ОписаниеОповещения("КаталогНачалоВыбораФайлаЗавершение", ЭтаФорма, Элемент.Имя);
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогОткрытияФайла.Каталог  = Элемент.ТекстРедактирования;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Путь к каталогу " + Элемент.Заголовок;
	
	ДиалогОткрытияФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогОткрытьИнтерактивно(ИмяКаталога)
	
	Если Не ЗначениеЗаполнено(ИмяКаталога) Тогда
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ИмяКаталога);
	Если НЕ Файл.Существует() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Файл.ЭтоКаталог() Тогда
		Возврат;
	КонецЕсли;
	
	ЗапуститьПриложение(ИмяКаталога);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСоответствийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяФормы", "УФ_ФормаНастройкиСоответсвий");
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);	
	
	ПараметрыФормы = Новый Структура;

	ПараметрыФормы.Вставить("Тип"     , Элемент.ТекущиеДанные.Тип);
	ПараметрыФормы.Вставить("Реквизит", Элемент.ТекущиеДанные.Реквизит);
	ПараметрыФормы.Вставить("Значение", Элемент.ТекущиеДанные.Значение);
    ОткрытьФорму(ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаНастройкиСоответсвий", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	Элементы.СписокСоответствий.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_ПутьКЛогФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	 КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеСтраницыНастроек(ТекущаяСтраница)
    Перем ИмяСтраницы;
    
    Если ТипЗнч(ТекущаяСтраница) = Тип("ГруппаФормы") Тогда
        ИмяСтраницы = ТекущаяСтраница.Имя;
    ИначеЕсли ТипЗнч(ТекущаяСтраница) = Тип("Строка") Тогда
        ИмяСтраницы = ТекущаяСтраница;
    КонецЕсли;
    
    ОбновитьСписокПоИмениСтраницы(ИмяСтраницы);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПанельНастроекПриСменеСтраницы(Элемент, ТекущаяСтраница)
    ПриСменеСтраницыНастроек(ТекущаяСтраница.Имя);    
КонецПроцедуры

&НаСервере
Процедура КомандаОбновитьДеревоКонфигурацииНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьДеревоКонфигурации();
    
КонецПроцедуры

&НаКлиенте
Процедура НастройкаДокументовОбновитьДеревоКонфигурации(Команда)
	КомандаОбновитьДеревоКонфигурацииНаСервере();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Настройка организаций

&НаСервере
Процедура КомандаЗаполнитьОрганизацииИзДопСведенийНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацииЗаполнитьИзДопСведений(Команда)
	КомандаЗаполнитьОрганизацииИзДопСведенийНаСервере();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Настройка контрагентов 

&НаСервере
Процедура КонтрагентыЗаполнитьИзДопСведенийНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыЗаполнитьИзДопСведений(Команда)
	КонтрагентыЗаполнитьИзДопСведенийНаСервере();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Настройка точек доставки 
&НаСервере
Процедура ЗаписатьНаСервере(ИзмененныеНастройки, СохранитьНастройки = Истина)
	
	Если НЕ СохранитьНастройки Тогда
	     Возврат;
	КонецЕсли;
		
	ОбъектЭтаОбработка = РеквизитФормыВЗначение("Объект");
	
	Для каждого Стр Из ИзмененныеНастройки Цикл	
		Если Лев(Стр.Ключ, 1) = "_" Тогда
		   ОбъектЭтаОбработка.Настройка_Параметр_Записать(Стр.Ключ, ДанныеФормыВЗначение(ЭтаФорма[Стр.Значение], Тип("ДеревоЗначений")));
		Иначе	
		   ОбъектЭтаОбработка.Настройка_Параметр_Записать(Стр.Ключ, Стр.Значение);
		КонецЕсли;
					 
	КонецЦикла;
	
	ЭтаФорма.СписокЗначенийИзмененныхНастроек.Очистить();
	ЭтаФорма.Модифицированность = Ложь;
    	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	СохранитьИзмененныеНастройки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаАлгоритмаЗаполнения(Строка, пПараметры)
	Если НЕ Строка = Неопределено Тогда 
		//Даем возможность передавать имя колонки, в которую пишется значение.
		Элементы[пПараметры.Имя].ТекущиеДанные[?(пПараметры.Свойство("Колонка"), пПараметры.Колонка, "Формула")] = Строка; 
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтруктураФайлаXMLПриАктивизацииЯчейки(Элемент)
	
	Если Элементы.СтруктураФайлаXMLВходящие.ТекущиеДанные = Неопределено 
		ИЛИ Элемент.ТекущийЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолеВвода = Элемент.ТекущийЭлемент;
	Родитель = ЭтаФорма.СтруктураФайлаXMLВходящие.НайтиПоИдентификатору(Элементы.СтруктураФайлаXMLВходящие.ТекущаяСтрока).ПолучитьРодителя();
	Строки = ЭтаФорма.СтруктураФайлаXMLВходящие.НайтиПоИдентификатору(Элементы.СтруктураФайлаXMLВходящие.ТекущаяСтрока).ПолучитьЭлементы();
	
	Если Элемент.ТекущийЭлемент.Имя = "СтруктураФайлаXMLВходящиеТипТранзакции" Тогда
		
		Если Родитель = Неопределено И ПолеВвода.СписокВыбора.Количество() = 0 Тогда
			
			МассивИменДокументов = Неопределено;
			СписокВыбора = Вычислить("ЭКОМ_ОбщегоНазначения.ДокументыСписокВыбораПолучить(""ТипТразакций"", МассивИменДокументов)");
			ПолеВвода.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
			
		ИначеЕсли НЕ Родитель = Неопределено И НЕ ПолеВвода.СписокВыбора.Количество() = 0 Тогда
			
			ПолеВвода.СписокВыбора.Очистить();
			
		КонецЕсли;
	КонецЕсли;
	
	// Установка высоты списка.
	Если ПолеВвода.Вид = ВидПоляФормы.ПолеВвода Тогда
		
		ВысотаСписка = ?(ПолеВвода.СписокВыбора.Количество() > 20, 20, ПолеВвода.СписокВыбора.Количество());
		
		Если НЕ ПолеВвода.ВысотаСпискаВыбора = ВысотаСписка Тогда
			ПолеВвода.ВысотаСпискаВыбора = ВысотаСписка;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМетаданные()
	    Возврат Метаданные.Документы;
КонецФункции

&НаКлиенте
Функция ПолучитьТипДокумента(ТекущийРодитель, ИмяТаблицы, РольДокумента)
	
	Корень = ТекущийРодитель;
	Пока НЕ Корень.ПолучитьРодителя()	= Неопределено Цикл
		Корень = Корень.ПолучитьРодителя();
	КонецЦикла;
	
	Если ИмяТаблицы = "СтруктураФайлаXMLИсходящие" Тогда
		    ТипДокумента = Корень.Источник;
	Иначе		
		Если РольДокумента = "Приемник" Тогда
			ТипДокумента = Корень.Приемник;
		Иначе	
			ТипДокумента = Корень.Источник;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат ТипДокумента;
	
КонецФункции

&НаКлиенте
Процедура СтруктураФайлаXMLВходящиеФормулаОткрытие(Элемент, СтандартнаяОбработка)
		
	СтандартнаяОбработка 	= Ложь;
	Строки = Элементы[Элемент.Родитель.Имя].ТекущиеДанные.ПолучитьЭлементы();
	
	Если НЕ Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипДокументаПриемника = ПолучитьТипДокумента(Элементы[Элемент.Родитель.Имя].ТекущиеДанные, Элемент.Родитель.Имя, "Приемник");	
	ТипДокументаИсточника = ПолучитьТипДокумента(Элементы[Элемент.Родитель.Имя].ТекущиеДанные, Элемент.Родитель.Имя, "Источник");	
		
	ИмяОткрываемойФормы = ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаКонсольЗапросов";
	ДопПараметры = Новый Структура;
    ДопПараметры.Вставить("ИмяТабличнойЧасти", Элемент.Родитель.Имя);
	ДопПараметры.Вставить("ИмяФормы"         , "УФ_ФормаКонсольЗапросов");
	ДопПараметры.Вставить("ИмяЭлементаФормы" , "СтруктураФайлаXMLДокументыФормула");	

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок"            , "Введите алгоритм для заполнения поля (тега) файла");
	ПараметрыФормы.Вставить("ТипДокументаПриемника", ТипДокументаПриемника);
	ПараметрыФормы.Вставить("ТипДокументаИсточника", ТипДокументаИсточника);
	ПараметрыФормы.Вставить("ТекстНачальный"       , Элементы[Элемент.Родитель.Имя].ТекущиеДанные.Формула);
    
    ПараметрыФормы.Вставить("ДопПараметры", ДопПараметры);
    
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы,,,,,ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗакрытия(Результат, ДопПараметры) Экспорт

     НастройкаЗаписана = Ложь;
	 ИзмененияОтсутствуют = Не ЭтаФорма.Модифицированность;
	 
    Если ДопПараметры.ИмяФормы = "УФ_ФормаКонсольЗапросов" 
        И ТипЗнч(Результат) = Тип("Структура") Тогда
        
        Если Результат.Изменен = Ложь Тогда
            Состояние("Код не был изменен!. Нечего сохранять", ,, БиблиотекаКартинок.Записать);
        Иначе 
            ЭтаФорма.Модифицированность = Истина;
        КонецЕсли;
        
        Если Результат.Изменен 
             И ДопПараметры.ИмяЭлементаФормы = "СтруктураФайлаXMLИсходящиеСлужебные" Тогда
             
            ПараметрыДанные = Новый Структура;
            ПараметрыДанные.Вставить("ИдентификаторСтроки", Элементы[ДопПараметры.ИмяТабличнойЧасти].ТекущаяСтрока);
            ПараметрыДанные.Вставить("Имя"    , ДопПараметры.ИмяТабличнойЧасти);
            ПараметрыДанные.Вставить("Колонка", "Служебные");
            ПослеВводаАлгоритмаЗаполнения(СокрЛП(Результат.Текст), ПараметрыДанные);
            
        ИначеЕсли Результат.Изменен 
             И ДопПараметры.ИмяЭлементаФормы = "СтруктураФайлаXMLДокументыФормула" Тогда
             
            ПараметрыДанные = Новый Структура;
            ПараметрыДанные.Вставить("ИдентификаторСтроки", Элементы[ДопПараметры.ИмяТабличнойЧасти].ТекущаяСтрока);
            ПараметрыДанные.Вставить("Имя"    , ДопПараметры.ИмяТабличнойЧасти);
            ПослеВводаАлгоритмаЗаполнения(СокрЛП(Результат.Текст), ПараметрыДанные);
			
			ИмяЭлемента = "СтруктураФайлаXMLДокументы";
			ЗаполнитьСписокДляИзменения(ИмяЭлемента, "_" + ИмяЭлемента);    			
        ИначеЕсли Результат.Изменен 
            И (ДопПараметры.ИмяЭлементаФормы = "СтруктураФайлаXMLВходящиеСлужебныеТекст"
			ИЛИ ДопПараметры.ИмяЭлементаФормы = "СтруктураФайлаXMLДокументыСлужебныеТекст") Тогда
            
            Элементы[ДопПараметры.ИмяТабличнойЧасти].ТекущиеДанные.Служебные = Результат.Текст;     
            ЭтаФорма.ЭтаФорма.Модифицированность = Истина;
        ИначеЕсли Результат.Изменен 
            И ДопПараметры.ИмяЭлементаФормы = "СтруктураФайлаXMLИсходящиеДанные" Тогда
            
            Элементы[ДопПараметры.ИмяТабличнойЧасти].ТекущиеДанные.Данные = Результат.Текст;    
            Колонки = Новый СписокЗначений;
            Для Каждого Колонка Из Результат.Значение Цикл
                Колонки.Добавить(Колонка.КолонкаКлюч);
            КонецЦикла;
            Элементы[ДопПараметры.ИмяТабличнойЧасти].ТекущиеДанные.ДоступныеЗначения.Очистить();
            Элементы[ДопПараметры.ИмяТабличнойЧасти].ТекущиеДанные.ДоступныеЗначения = Колонки;         
            
        ИначеЕсли Результат.Изменен 
            И ДопПараметры.ИмяЭлементаФормы = "ГруппаПоставщик" Тогда
            
            ПараметрыФункции = Новый Массив;
            ПараметрыФункции.Добавить("_СлужебныйЗапросДляФормыПоставщика");        
            ПараметрыФункции.Добавить(Результат.Текст);
            ПараметрыФункции.Добавить("Служебный");
            НастройкаЗаписана = ВернутьРезультатИзМодуляОбъекта("Настройка_Параметр_Записать", ПараметрыФункции);
            ОбновитьВсеРолиНаСервере();
            ЭтаФорма.ЭтаФорма.Модифицированность = ?(ИзмененияОтсутствуют, Ложь, Истина);
			
		ИначеЕсли ДопПараметры.ИмяЭлементаФормы = "ГруппаПрайсЛист"
			И (Результат.Изменен = Истина
			ИЛИ Результат.ДопПараметры.ЗаписатьЗапрос = Истина) Тогда
            
            ПараметрыФункции = Новый Массив;
            ПараметрыФункции.Добавить("_СлужебныйЗапросДляФормыПрайсЛист");        
            ПараметрыФункции.Добавить(Результат.Текст);
            ПараметрыФункции.Добавить("Служебный");
            НастройкаЗаписана = ВернутьРезультатИзМодуляОбъекта("Настройка_Параметр_Записать", ПараметрыФункции);
            ОбновитьВсеРолиНаСервере();
            ЭтаФорма.ЭтаФорма.Модифицированность = ?(ИзмененияОтсутствуют, Ложь, Истина);

        ИначеЕсли Результат.Изменен 
            И ДопПараметры.ИмяЭлементаФормы = "ГруппаПокупатель" Тогда
            
            ПараметрыФункции = Новый Массив;
            ПараметрыФункции.Добавить("_СлужебныйЗапросДляФормыПокупателя");        
            ПараметрыФункции.Добавить(Результат.Текст);
            ПараметрыФункции.Добавить("Служебный");
            НастройкаЗаписана = ВернутьРезультатИзМодуляОбъекта("Настройка_Параметр_Записать", ПараметрыФункции);
            ОбновитьВсеРолиНаСервере();
            ЭтаФорма.ЭтаФорма.Модифицированность = ?(ИзмененияОтсутствуют, Ложь, Истина);
			
        ИначеЕсли Результат.Изменен 
            И ДопПараметры.ИмяЭлементаФормы = "АвтоОбмен" Тогда
            
            ПараметрыФункции = Новый Массив;
            ПараметрыФункции.Добавить(ДопПараметры.ИмяЗапроса); 
            ПараметрыФункции.Добавить(Результат.Текст);
            ПараметрыФункции.Добавить("Служебный");
            НастройкаЗаписана = ВернутьРезультатИзМодуляОбъекта("Настройка_Параметр_Записать", ПараметрыФункции);
			
		ИначеЕсли Результат.Изменен 
			И ДопПараметры.ИмяЭлементаФормы = "ГруппаЭТРН" Тогда
			
			ПараметрыФункции = Новый Массив;
			ПараметрыФункции.Добавить("_СлужебныйЗапросДляФормыЭТРН");		
			ПараметрыФункции.Добавить(Результат.Текст);
			ПараметрыФункции.Добавить("Служебный");
			НастройкаЗаписана = ВернутьРезультатИзМодуляОбъекта("Настройка_Параметр_Записать", ПараметрыФункции);
			ОбновитьВсеРолиНаСервере();
            ЭтаФорма.ЭтаФорма.Модифицированность = ?(ИзмененияОтсутствуют, Ложь, Истина);
			
		ИначеЕсли Результат.Изменен 
			И ДопПараметры.ИмяЭлементаФормы = "ПодпискаДляДокументовПоставщик" Тогда
			
			ПараметрыФункции = Новый Массив;
			ПараметрыФункции.Добавить("_СлужебныйЗапросДляПодпискиДокументовПоставщик");		
			ПараметрыФункции.Добавить(Результат.Текст);
			ПараметрыФункции.Добавить("Служебный");
			НастройкаЗаписана = ВернутьРезультатИзМодуляОбъекта("Настройка_Параметр_Записать", ПараметрыФункции);
            ЭтаФорма.ЭтаФорма.Модифицированность = ?(ИзмененияОтсутствуют, Ложь, Истина);
			
		ИначеЕсли Результат.Изменен 
			И ДопПараметры.ИмяЭлементаФормы = "ПодпискаДляДокументовСеть" Тогда
			
			ПараметрыФункции = Новый Массив;
			ПараметрыФункции.Добавить("_СлужебныйЗапросДляПодпискиДокументовСеть");		
			ПараметрыФункции.Добавить(Результат.Текст);
			ПараметрыФункции.Добавить("Служебный");
			НастройкаЗаписана = ВернутьРезультатИзМодуляОбъекта("Настройка_Параметр_Записать", ПараметрыФункции);
            ЭтаФорма.ЭтаФорма.Модифицированность = ?(ИзмененияОтсутствуют, Ложь, Истина);
			
		ИначеЕсли Результат.Изменен 
			И ДопПараметры.ИмяЭлементаФормы = "ПодпискаДляДокументовЭТРН" Тогда
			
			ПараметрыФункции = Новый Массив;
			ПараметрыФункции.Добавить("_СлужебныйЗапросДляПодпискиДокументовЭТРН");		
			ПараметрыФункции.Добавить(Результат.Текст);
			ПараметрыФункции.Добавить("Служебный");
			НастройкаЗаписана = ВернутьРезультатИзМодуляОбъекта("Настройка_Параметр_Записать", ПараметрыФункции);
            ЭтаФорма.ЭтаФорма.Модифицированность = ?(ИзмененияОтсутствуют, Ложь, Истина);
			
		ИначеЕсли Результат.Изменен 
			И ДопПараметры.ИмяЭлементаФормы = "ГруппаCondra" Тогда
			
			ПараметрыФункции = Новый Массив;
			ПараметрыФункции.Добавить("_СлужебныйЗапросДляФормыCondra");		
			ПараметрыФункции.Добавить(Результат.Текст);
			ПараметрыФункции.Добавить("Служебный");
			НастройкаЗаписана = ВернутьРезультатИзМодуляОбъекта("Настройка_Параметр_Записать", ПараметрыФункции);
			ОбновитьВсеРолиНаСервере();
            ЭтаФорма.ЭтаФорма.Модифицированность = ?(ИзмененияОтсутствуют, Ложь, Истина);
			
		ИначеЕсли Результат.Изменен 
			И ДопПараметры.ИмяЭлементаФормы = "ПодпискаДляДокументовCondra" Тогда
			
			ПараметрыФункции = Новый Массив;
			ПараметрыФункции.Добавить("_СлужебныйЗапросДляПодпискиДокументовCondra");		
			ПараметрыФункции.Добавить(Результат.Текст);
			ПараметрыФункции.Добавить("Служебный");
			НастройкаЗаписана = ВернутьРезультатИзМодуляОбъекта("Настройка_Параметр_Записать", ПараметрыФункции);
            ЭтаФорма.ЭтаФорма.Модифицированность = ?(ИзмененияОтсутствуют, Ложь, Истина);
			
        КонецЕсли;
        		
		Если ДопПараметры.Свойство("ИмяТабличнойЧасти") Тогда
			
			Если ДопПараметры.Свойство("ИмяЭлементаФормы") = Истина 
				И НЕ ДопПараметры.ИмяЭлементаФормы = "ПодпискаДляДокументовЭТРН" Тогда
				
				СтруктураФайлаXMLПриАктивизацииЯчейки(Элементы[ДопПараметры.ИмяТабличнойЧасти]);
				
			КонецЕсли;
			
		КонецЕсли;
            
    ИначеЕсли ДопПараметры.ИмяФормы = "УФ_ФормаНастройкиСлужебные" 
              И ТипЗнч(Результат) = Тип("Структура") Тогда  
              
        Если НЕ ТипЗнч(ДопПараметры.ЭлементТекущиеДанные) = Тип(Результат.Тип) Тогда
            ДопПараметры.ЭлементТекущиеДанные = Вычислить("Новый " + Результат.Тип);
        КонецЕсли;
        
        Если Результат.Редактирование Тогда
            ДопПараметры.ЭлементТекущиеДанные.Очистить();
        КонецЕсли;
        
         Для Каждого Строка Из Результат.ТабличноеПоле Цикл
			Если Результат.Тип = "Структура" Тогда
				Если ЗначениеЗаполнено(Строка.Реквизит) Тогда
				     ДопПараметры.ЭлементТекущиеДанные.Вставить(Строка.Реквизит, Строка.Формула);
				 КонецЕсли;
            ИначеЕсли Результат.Тип = "СписокЗначений" Тогда
                ДопПараметры.ЭлементТекущиеДанные.Добавить(Строка.Реквизит, Строка.Формула, Строка.Обязательный);
            КонецЕсли;
        КонецЦикла;
        
        Если ДопПараметры.ИмяЭлементаФормы = "СтруктураФайлаXMLИсходящиеКнопка"
			ИЛИ ДопПараметры.ИмяЭлементаФормы = "СтруктураФайлаXMLВходящиеКнопка"
			ИЛИ ДопПараметры.ИмяЭлементаФормы = "СтруктураФайлаXMLДокументыКнопка" Тогда
			Элементы[ДопПараметры.ИмяТабличнойЧасти].ТекущиеДанные.КоллекцияТЧ = ДопПараметры.ЭлементТекущиеДанные;
			Элементы[ДопПараметры.ИмяТабличнойЧасти].ТекущиеДанные.Кнопка = ?(ДопПараметры.ЭлементТекущиеДанные.НайтиПоЗначению("ИмяКнопки") = Неопределено, "", ДопПараметры.ЭлементТекущиеДанные.НайтиПоЗначению("ИмяКнопки").Представление);
			
		ИначеЕсли Найти(ДопПараметры.ИмяЭлементаФормы, "Атрибуты") > 0 Тогда
			Если Элементы[ДопПараметры.ИмяТабличнойЧасти].ТекущиеДанные.Атрибуты = Неопределено Тогда
				Элементы[ДопПараметры.ИмяТабличнойЧасти].ТекущиеДанные.Атрибуты = ДопПараметры.ЭлементТекущиеДанные;   
			КонецЕсли;	
			
		Иначе
			Если Элементы[ДопПараметры.ИмяТабличнойЧасти].ТекущиеДанные.Служебные = Неопределено Тогда
				Элементы[ДопПараметры.ИмяТабличнойЧасти].ТекущиеДанные.Служебные = ДопПараметры.ЭлементТекущиеДанные;   
			КонецЕсли;
			
		КонецЕсли;
        
    ИначеЕсли ДопПараметры.ИмяФормы = "УФ_ФормаСвязи" И ТипЗнч(Результат) = Тип("Структура") Тогда 
        
        Если НЕ ТипЗнч(ДопПараметры.ЭлементТекущиеДанные) = Тип("СписокЗначений") Тогда
            ДопПараметры.ЭлементТекущиеДанные = Новый СписокЗначений;
        КонецЕсли;
        
        ДопПараметры.ЭлементТекущиеДанные.Очистить();
        
        Для Каждого Строка Из Результат.ТабличноеПоле Цикл
            ДопПараметры.ЭлементТекущиеДанные.Добавить(Строка.ЛевоеПоле, Строка.ПравоеПоле);
        КонецЦикла;
        
        Если НастройкаЗаписана = 1 Или НастройкаЗаписана = Истина Тогда
        Состояние("Код записан в настройки", ,, БиблиотекаКартинок.Записать);
        //здесь может быть обновление кэша формы
    КонецЕсли;
    
    ИначеЕсли ДопПараметры.ИмяФормы = "УФ_ФормаКонтрагента"  Тогда 
        Элементы.СписокКонтрагентов.Обновить(); 
    ИначеЕсли ДопПараметры.ИмяФормы = "УФ_ФормаОрганизации"  Тогда 
        Элементы.СписокОрганизаций.Обновить();  
    ИначеЕсли ДопПараметры.ИмяФормы = "УФ_ФормаТочкиДоставки"  Тогда 
        Элементы.СписокТочекДоставок.Обновить();
    ИначеЕсли ДопПараметры.ИмяФормы = "УФ_ФормаНастройкиСоответсвий" Тогда 
        Элементы.СписокСоответствий.Обновить();
    ИначеЕсли ДопПараметры.ИмяФормы = "УФ_ФормаВводаПароля" Тогда       
        ЭтаФорма.ЭКОМ_ИспПарольДляНастроек = Результат.ИспользоватьПароль;
        
        Если Результат.ПарольИзБазы = Результат.Пароль Тогда
			ПарольВведенВерно = Истина;
		Иначе
			Состояние("Пароль не корректен!");
		КонецЕсли;
		УправлениеВидимостью();
		
	ИначеЕсли ДопПараметры.ИмяФормы = "УФ_ГибкиеНастройкиОнлайн" Тогда  
		 
		Если ДопПараметры.ТипГибкихНастроек = "Исходящие настройки" Тогда
			ИмяРеквизитаФормы = "СтруктураФайлаXMLИсходящие";
		    ОбновитьСтруктуруДереваСтруктураФайлаXML(Результат.СтруктураФайлаXMLИсходящие, ИмяРеквизитаФормы);			
			ЗаполнитьСписокДляИзменения(ИмяРеквизитаФормы, "_" + ИмяРеквизитаФормы);
		ИначеЕсли ДопПараметры.ТипГибкихНастроек = "Входящие настройки" Тогда
			ИмяРеквизитаФормы = "СтруктураФайлаXMLВходящие";
	        ОбновитьСтруктуруДереваСтруктураФайлаXML(Результат.СтруктураФайлаXMLВходящие, ИмяРеквизитаФормы);
			ЗаполнитьСписокДляИзменения(ИмяРеквизитаФормы, "_" + ИмяРеквизитаФормы);
		ИначеЕсли ДопПараметры.ТипГибкихНастроек = "Настройки по созданию документов" Тогда
			ИмяРеквизитаФормы = "СтруктураФайлаXMLДокументы";
            ОбновитьСтруктуруДереваСтруктураФайлаXML(Результат.СтруктураФайлаXMLДокументы, ИмяРеквизитаФормы);
			ЗаполнитьСписокДляИзменения(ИмяРеквизитаФормы, "_" + ИмяРеквизитаФормы);
		КонецЕсли;
  	
    КонецЕсли;
    
    Если НастройкаЗаписана = 1 Или НастройкаЗаписана = Истина Тогда
        Состояние("Код записан в настройки", ,, БиблиотекаКартинок.Записать);
        //здесь может быть обновление кэша формы
    КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура ОбновитьСтруктуруДереваСтруктураФайлаXML(ДанныеФормыДерево, ИмяРеквизитаФормы)
	
	ДЗ = ДанныеФормыВЗначение(ДанныеФормыДерево, Тип("ДеревоЗначений"));
   	ЗначениеВРеквизитФормы(ДЗ, ИмяРеквизитаФормы);
	
КонецПроцедуры
 
// Функция заполняет дерево значений согласно данным документа 1с из дерева конфигурации.
//
// Параметры:
//  Имя  - Строка - имя документа 1С в дереве конфигурации
//
&НаСервере
Процедура ЗаполнитьДеревоПоДокументу1С(Данные)
	
	ДеревоЗначенийНастроек   = РеквизитФормыВЗначение("СтруктураФайлаXMLВходящие");
	ДеревоКонфигурацииОбъект = РеквизитФормыВЗначение("СлужебныйДеревоКонфигурации");
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    СтруктураФайлаXMLВходящиеНовый =  ОбработкаОбъект.ЗаполнитьДеревоПоДокументу1С(Данные.ТипТранзакции, ДеревоЗначенийНастроек, ДеревоКонфигурацииОбъект);
	//ТекущаяСтрока    = СтруктураФайлаXMLВходящиеОбъект.Строки.Найти(Данные.ТипТранзакции , "ТипТранзакции");		 	
	//ТекущаяСтрока.Строки.Очистить();
	//ДокументИсточник = ДеревоКонфигурацииОбъект.Строки.Найти(ТекущаяСтрока.Источник      , "Синоним");			 
	//ДокументПриемник = ДеревоКонфигурацииОбъект.Строки.Найти(ТекущаяСтрока.Приемник, "Синоним");
	//	
	//Если ДокументИсточник = Неопределено
	//	ИЛИ ДокументПриемник = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;

	//// Добавление колонок дерева.
	//Если СтруктураФайлаXMLВходящиеОбъект.Колонки.Найти("ТипТранзакции") = Неопределено Тогда
	//	СтруктураФайлаXMLВходящиеОбъект.Колонки.Добавить("ТипТранзакции", Новый ОписаниеТипов("Строка"), "Тип транзакции");
	//КонецЕсли;
	//Если СтруктураФайлаXMLВходящиеОбъект.Колонки.Найти("Использовать") = Неопределено Тогда
	//	СтруктураФайлаXMLВходящиеОбъект.Колонки.Добавить("Использовать", Новый ОписаниеТипов("Булево"));
	//КонецЕсли;
	//Если СтруктураФайлаXMLВходящиеОбъект.Колонки.Найти("Источник") = Неопределено Тогда
	//	СтруктураФайлаXMLВходящиеОбъект.Колонки.Добавить("Источник", Новый ОписаниеТипов("Строка"));
	//КонецЕсли;
	//Если СтруктураФайлаXMLВходящиеОбъект.Колонки.Найти("Приемник") = Неопределено Тогда	
	//	СтруктураФайлаXMLВходящиеОбъект.Колонки.Добавить("Приемник", Новый ОписаниеТипов("Строка"));
	//КонецЕсли;
	//Если СтруктураФайлаXMLВходящиеОбъект.Колонки.Найти("Формула") = Неопределено Тогда
	//	СтруктураФайлаXMLВходящиеОбъект.Колонки.Добавить("Формула", Новый ОписаниеТипов("Строка"));
	//КонецЕсли;
	//Если СтруктураФайлаXMLВходящиеОбъект.Колонки.Найти("Служебные") = Неопределено Тогда
	//	СтруктураФайлаXMLВходящиеОбъект.Колонки.Добавить("Служебные", Новый ОписаниеТипов("Строка"));
	//КонецЕсли;
	//
	//// Добавление реквизитов.
	//Для Каждого ЭлРеквизита Из ДокументПриемник.Строки Цикл
	//	
	//	Если НЕ ЭлРеквизита.Строки.Количество() = 0 Тогда
	//		Продолжить; // Это таблица, а нужен реквизит
	//	КонецЕсли;
	//	
	//	Строка = ТекущаяСтрока.Строки.Добавить();
	//	Строка.Использовать	= Истина;
	//	Строка.Приемник 	= ЭлРеквизита.Синоним;
	//	
	//	СтрокаИсточник = ДокументИсточник.Строки.Найти(ЭлРеквизита.Синоним, "Синоним");
	//	Если НЕ СтрокаИсточник = Неопределено Тогда
	//	        Строка.Источник	= СтрокаИсточник.Синоним;
	//	КонецЕсли;
	//
	//КонецЦикла;
	//
	//// Добавление табличных частей.
	//Для Каждого Таблица Из ДокументПриемник.Строки Цикл
	//	
	//	Если Таблица.Строки.Количество() = 0 Тогда
	//		Продолжить; // Это реквизит, а нужна таблица
	//	КонецЕсли;
	//	
	//	// Исключаем эту таблицу.
	//	Если Таблица.Имя = "ДокументыСвязанные" Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	СтрокаТаб = ТекущаяСтрока.Строки.Добавить();
	//	СтрокаТаб.Использовать 	= Истина;
	//	СтрокаТаб.Приемник 		= Таблица.Синоним;
	//	СтрокаТабИсточник       = ДокументИсточник.Строки.Найти(Таблица.Синоним, "Синоним");
	//	Если НЕ СтрокаТабИсточник = Неопределено Тогда
	//	        СтрокаТаб.Источник	= СтрокаТабИсточник.Синоним;
	//	КонецЕсли;
	//	
	//	// Добавление реквизитов табличной части.
	//	Для Каждого ЭлРеквизита Из Таблица.Строки Цикл
	//		Строка = СтрокаТаб.Строки.Добавить();
	//		Строка.Использовать	= Истина;
	//		Строка.Приемник 	= ЭлРеквизита.Синоним;
	//		СтрокаИсточник      = ДокументИсточник.Строки.Найти(ЭлРеквизита.Синоним, "Синоним");
	//		Если НЕ СтрокаИсточник = Неопределено Тогда
	//			Строка.Источник	= СтрокаИсточник.Синоним;
	//		КонецЕсли;
	//	КонецЦикла;		
	//КонецЦикла;
	
    Если СтруктураФайлаXMLВходящиеНовый = Неопределено Тогда
        Возврат;
    КонецЕсли;
	ЗначениеВРеквизитФормы(СтруктураФайлаXMLВходящиеНовый, "СтруктураФайлаXMLВходящие");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаДокументовНовыйДокумент(Команда)
	
	Если Элементы.ГруппаНастройкиДокументовСтраницы.ТекущаяСтраница.Имя = "ГруппаДокументы1С" Тогда
		ЭтаФорма.СтруктураФайлаXMLВходящие.ПолучитьЭлементы().Добавить();
	ИначеЕсли Элементы.ГруппаНастройкиДокументовСтраницы.ТекущаяСтраница.Имя = "ГруппаДокументы" Тогда
		ЭтаФорма.СтруктураФайлаXMLДокументы.ПолучитьЭлементы().Добавить();
	КонецЕсли;
	
КонецПроцедуры

// Аналог метода НайтиСтроки коллекции строк дерева значений, используемый в случае использования дерева значений в управляемых формах.
//
//Параметры:
// КоллекцияСтрок – ДанныеФормыКоллекцияЭлементовДерева – Коллекция подчиненных строк элемента дерева значений, используемого в управляемых формах.
// ПараметрыОтбора - Структура - Структура с критериями поиска.
//                               Задает условия поиска: ключ структуры определяет имя колонки, по которой будет осуществляться поиск,
//                               а значение структуры - искомое значение.
//                               Структура без полей означает "выбрать все подчиненные строки".
// ВключатьПодчиненные - Булево - Определяет, будет ли производиться поиск также в подчиненных коллекциях (если таковые имеются).
//                                Истина - поиск будет произведен.
//
//Возвращаемое значение:
// Массив(ДанныеФормыЭлементДерева) – Массив из строк дерева значений, соответствующих заданному условию поиска.
&НаКлиенте
Функция ДанныеФормыКоллекцияЭлементовДереваНайтиСтроки(КоллекцияСтрок, ПараметрыОтбора, ВключатьПодчиненные = Ложь) Экспорт
	Результат = Новый Массив;
	Для Каждого СтрокаТекущая Из КоллекцияСтрок Цикл
		СтрокаНайдена = Истина;
		Для Каждого КлючИЗначение Из ПараметрыОтбора Цикл
			Если СтрокаТекущая[КлючИЗначение.Ключ] <> КлючИЗначение.Значение Тогда
				СтрокаНайдена = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если СтрокаНайдена Тогда
			Результат.Добавить(СтрокаТекущая);
		КонецЕсли;
		Если ВключатьПодчиненные Тогда
			ПодчиненныеСтроки = ДанныеФормыКоллекцияЭлементовДереваНайтиСтроки(СтрокаТекущая.ПолучитьЭлементы(), ПараметрыОтбора, ВключатьПодчиненные);
			Для Каждого НайденнаяСтрока Из ПодчиненныеСтроки Цикл
				Результат.Добавить(НайденнаяСтрока);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Если Результат.Количество() = 0 Тогда
	     Результат.Добавить(Неопределено);	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СтруктураФайлаXMLВходящиеПриАктивизацииЯчейки(Элемент)
    
	Если Элементы[Элемент.Имя].ТекущиеДанные = Неопределено
		ИЛИ НЕ Элемент.ТекущийЭлемент.Вид = ВидПоляФормы.ПолеВвода Тогда
		Возврат;
	КонецЕсли;
	
	ПолеВвода 	= Элемент.ТекущийЭлемент;
	Родитель 	= Элементы[Элемент.Имя].ТекущиеДанные.ПолучитьРодителя();
	Строки 		= Элементы[Элемент.Имя].ТекущиеДанные.ПолучитьЭлементы();
	СписокВыбора = Новый Массив;
		
	ПолеВвода.СписокВыбора.Очистить();
	
	// Запрещаем активацию строки для "Входящий ORDER" и "Входящий RECADV", кроме пунктов "СлужебныеТекст",
	// "Сохранение" и "Загрузка". Запрещаем активацию строки любого пункта для неопределенного типа транзакции.
	ЭтоВходящийEDI = Ложь;
	Если Строки.Количество() > 0  Тогда
		Если Уровень(Элементы[Элемент.Имя].ТекущиеДанные) = 0 И
			(((НЕ Элемент.Имя = "СтруктураФайлаXMLДокументы" И Найти(Элементы[Элемент.Имя].ТекущиеДанные.ТипТранзакции, "Входящий") = 1)
			И НЕ (Элемент.ТекущийЭлемент.Имя = "СтруктураФайлаXMLВходящиеСлужебныеТекст" 
			ИЛИ Элемент.ТекущийЭлемент.Имя = "СтруктураФайлаXMLВходящиеСохранение"
			ИЛИ Элемент.ТекущийЭлемент.Имя = "СтруктураФайлаXMLВходящиеЗагрузка"))
			ИЛИ (НЕ Элемент.Имя = "СтруктураФайлаXMLДокументы" И ПустаяСтрока(Элементы[Элемент.Имя].ТекущиеДанные.ТипТранзакции))) Тогда
			
			ЭтоВходящийEDI = Истина;
		
		КонецЕсли;	
	КонецЕсли;
	
	Если Элемент.Имя = "СтруктураФайлаXMLДокументы"  Тогда
		Элементы[Элемент.Имя + "Формула"].ТолькоПросмотр = ЭтоВходящийEDI ИЛИ Элементы[Элемент.Имя].ТекущиеДанные.ПолучитьЭлементы().Количество() > 0;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя = "СтруктураФайлаXMLВходящиеТипТранзакции" Тогда
		
		Если Родитель = Неопределено Тогда
			СписокВыбора = Вычислить("ЭКОМ_ОбщегоНазначения.ДокументыСписокВыбораПолучить(""ТипТразакцийВходящий"")");
		КонецЕсли;
		
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "СтруктураФайлаXMLДокументыКолонкаИсточника" 
		И Родитель = Неопределено Тогда
		
		ДанныеПоКолонкам = Вычислить("ЭКОМ_ОбщегоНазначения.ПолучитьДанныеПоКолонкамИсточника()");
		Для каждого Данные Из ДанныеПоКолонкам Цикл
			СписокВыбора.Добавить(Данные.Ключ);
		КонецЦикла;
		
	ИначеЕсли НЕ ЭтоВходящийEDI И (Элемент.ТекущийЭлемент.Имя = Элемент.Имя + "Приемник"
		ИЛИ Элемент.ТекущийЭлемент.Имя = Элемент.Имя + "Источник") Тогда

		ТекущийЭлементИмя = СтрЗаменить(Элемент.ТекущийЭлемент.Имя, Элемент.Имя, "");
		
		Если Родитель = Неопределено Тогда // Выбор документа
			
			Для Каждого ДокументКонфигурации Из ЭтаФорма.СлужебныйДеревоКонфигурации.ПолучитьЭлементы() Цикл
				СписокВыбора.Добавить(ДокументКонфигурации.Имя);
			КонецЦикла;
			
		КонецЕсли;				
	КонецЕсли;
	
	ПолеВвода.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
    ПолеВвода.СписокВыбора.СортироватьПоЗначению();
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураФайлаXMLВходящиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Запрещаем выбор для "Входящий ORDER" и "Входящий RECADV", кроме пунктов "СлужебныеТекст",
	// "Сохранение" и "Загрузка". Запрещаем выбор любого пункта для неопределенного типа транзакции.
    ТекДанныеСтруктурыФайла = Элементы[Элемент.Имя].ТекущиеДанные;
	
	Если ((НЕ Элемент.Имя = "СтруктураФайлаXMLДокументы" 
		И Найти(ТекДанныеСтруктурыФайла.ТипТранзакции, "Входящий") = 1)
        И НЕ (Поле.Имя = "СтруктураФайлаXMLВходящиеСлужебныеТекст" 
		ИЛИ Поле.Имя = "СтруктураФайлаXMLВходящиеСохранение"
        ИЛИ Поле.Имя = "СтруктураФайлаXMLВходящиеЗагрузка"
		ИЛИ Поле.Имя = "СтруктураФайлаXMLВходящиеКнопка"))
        ИЛИ (НЕ Элемент.Имя = "СтруктураФайлаXMLДокументы" 
		И  ПустаяСтрока(ТекДанныеСтруктурыФайла.ТипТранзакции)) Тогда
		Если (НЕ Элемент.Имя = "СтруктураФайлаXMLДокументы" 
			И  ПустаяСтрока(ТекДанныеСтруктурыФайла.ТипТранзакции)) 
			И (Поле.Имя = "СтруктураФайлаXMLВходящиеЗагрузка") Тогда
            ПоказатьПредупреждение(Новый ОписаниеОповещения, "Выберите тип транзакции для загружаемых настроек", , "Загрузка настроек из файла");
        	Возврат;
        КонецЕсли;
	КонецЕсли;
	
	Если (Поле.Имя = "СтруктураФайлаXMLВходящиеСлужебныеТекст" 
		ИЛИ Поле.Имя = "СтруктураФайлаXMLДокументыСлужебныеТекст")
		И Уровень(ТекДанныеСтруктурыФайла) = 0 Тогда
			
		СтандартнаяОбработка 	= Ложь;
		СлужебныеДо = ТекДанныеСтруктурыФайла.Служебные; // лишняя переменная?
						
		ИмяОткрываемойФормы = ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаКонсольЗапросов";
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ИмяТабличнойЧасти", Элемент.Имя);
		ДопПараметры.Вставить("ИмяЭлементаФормы" , Поле.Имя);	
		ДопПараметры.Вставить("ИмяФормы"         , "УФ_ФормаКонсольЗапросов");
			
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
		
		Если ТекДанныеСтруктурыФайла.Свойство("Приемник") Тогда
			ТипДокументаПриемника = ТекДанныеСтруктурыФайла.Приемник;
		Иначе	
			ТипДокументаПриемника = Неопределено;
		КонецЕсли;

		Если ТекДанныеСтруктурыФайла.Свойство("КолонкаИсточника") Тогда
			ТипДокументаИсточника = ТекДанныеСтруктурыФайла.КолонкаИсточника;
		Иначе	
			ТипДокументаИсточника = Неопределено;
		КонецЕсли;

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок"            , "Обработка записи документа");
		ПараметрыФормы.Вставить("ТипДокументаПриемника", ТипДокументаПриемника);
		ПараметрыФормы.Вставить("ТипДокументаИсточника", ТипДокументаИсточника);
		ПараметрыФормы.Вставить("ТекстНачальный", ТекДанныеСтруктурыФайла.Служебные);
		Если ТекДанныеСтруктурыФайла.Свойство("ТипТранзакции") = Истина Тогда				
			ПараметрыФормы.Вставить("СправкаКФорме", "Источник, пример кода:
				|Источник.Комментарий = ""Тест"";");
		КонецЕсли;

        ПараметрыФормы.Вставить("ДопПараметры", ДопПараметры); 
		ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы,,,,,ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
		ЗаполнитьСписокДляИзменения(Элемент.Имя, "_" + Элемент.Имя);

	ИначеЕсли Поле.Имя	= Элемент.Имя + "Сохранение" И Уровень(ТекДанныеСтруктурыФайла) = 0 Тогда
		Если ПроверитьЗаполнениеТекстаНастроекСтруктурыФайлаXML(ТекДанныеСтруктурыФайла) Тогда //DocRobot 1.21.0 20220207 MOD-1562 [отключить сохранение пустого шаблона]
			СохранитьНастройкуXML(Элемент.Имя);
		КонецЕсли;
		
	ИначеЕсли Поле.Имя	= Элемент.Имя + "Загрузка" И Уровень(ТекДанныеСтруктурыФайла) = 0 Тогда
		ВосстановитьНастройкуXML(Элемент.Имя);
		
	ИначеЕсли Поле.Имя	= Элемент.Имя + "Кнопка" 
		И Уровень(ТекДанныеСтруктурыФайла) = 0 Тогда
		
		Если Элемент.Имя = "СтруктураФайлаXMLДокументы" Тогда
			ИмяКнопкиПоУмолчнию = "для создания документов";
		Иначе	
			ИмяКнопкиПоУмолчнию = ТекДанныеСтруктурыФайла.ТипТранзакции;
		КонецЕсли;
		
		СформироватьНастройкиКнопки(ИмяКнопкиПоУмолчнию, ТекДанныеСтруктурыФайла, СтандартнаяОбработка, Поле.Имя, Элемент.Имя);
		
		ЗаполнитьСписокДляИзменения(Элемент.Имя, "_" + Элемент.Имя);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеТекстаНастроекСтруктурыФайлаXML(ВыбраннаяСтрока)
	
	Если ПустаяСтрока(ВыбраннаяСтрока.Служебные) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сохранение пустого текста настроек невозможно";
		Сообщение.Сообщить();
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция Уровень(СтрокаДерева)
   Родитель = СтрокаДерева.ПолучитьРодителя();
   Возврат ?(Родитель=Неопределено, 0, 1+Уровень(Родитель));
КонецФункции

#Область СохранениеНастроек

&НаСервере
Функция СохранитьНастройкуXMLСервер(ТабличоеПолеИмя, Значение, ИмяКолонки)
	
	// создаем на клиенте текстовый файл
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");

	ДеревоОбъект    = РеквизитФормыВЗначение(ТабличоеПолеИмя);
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Колонки = Новый Массив;
	Для Каждого Колонка Из ДеревоОбъект.Колонки Цикл
		Колонки.Добавить(Колонка.Имя);
	КонецЦикла;
		
	Дерево = Новый ДеревоЗначений;
	Для Каждого Колонка Из Колонки Цикл
		Дерево.Колонки.Добавить(Колонка);
	КонецЦикла;

	НайденнаяСтрока = ДеревоОбъект.Строки.Найти(Значение, ИмяКолонки); 

	ОбработкаОбъект.СкопироватьСтрокуДереваЗначений(НайденнаяСтрока, Дерево.Строки.Добавить(), Колонки);
	
	Запись = Новый ЗаписьXML;
	Запись.ОткрытьФайл(ИмяВременногоФайла);    
	
	НовыйСериализаторXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
	НовыйСериализаторXDTO.ЗаписатьXML(Запись, Дерево, НазначениеТипаXML.Явное);
	
	Запись.Закрыть();
	
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла));

	Возврат АдресВоВременномХранилище;
	
КонецФункции

&НаКлиенте
Процедура СохранитьНастройкуXML(ТабличоеПолеИмя) 
	
	Если ТабличоеПолеИмя = "СтруктураФайлаXMLВходящие"
		ИЛИ ТабличоеПолеИмя = "СтруктураФайлаXMLИсходящие" Тогда
		Реквизит = "ТипТранзакции";
	ИначеЕсли ТабличоеПолеИмя = "СтруктураФайлаXMLДокументы" Тогда
		Реквизит = "Кнопка";
	КонецЕсли;
	
	ВерсияОбработки = ПолучитьВерсиюОбработкиНаСервере();
	Значение = Элементы[ТабличоеПолеИмя].ТекущиеДанные[Реквизит];
    ИмяФайлаПоУмолчанию = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьИмяСохраняемогоФайла(ВерсияОбработки, Значение, ТабличоеПолеИмя)");

	АдресВоВременномХранилище = СохранитьНастройкуXMLСервер(ТабличоеПолеИмя, Значение, Реквизит);		
	
	СохранениеФайла(АдресВоВременномХранилище, ИмяФайлаПоУмолчанию);
					
КонецПроцедуры

&НаСервере
Функция ПолучитьВерсиюОбработкиНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ПолучитьВерсиюОбработки();
	
КонецФункции

#КонецОбласти

#Область ВосстановлениеНастроек

&НаКлиенте
Процедура ВосстановитьНастройкуXML(ТабличоеПолеИмя)
	     
	ОбработкаОкончанияПомещения = Новый ОписаниеОповещения("ОповещениеВыборФайла", ЭтаФорма, ТабличоеПолеИмя);
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Фильтр             = "Настройка по документу (*.xml)|*.xml|Таблица значений 1С (*.1ct)|*.1ct";
	ДиалогОткрытияФайла.ИндексФильтра      = 0; 
	НачатьПомещениеФайлов(ОбработкаОкончанияПомещения, , ДиалогОткрытияФайла, Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВыборФайла(ВыбранныеФайлы, ТабличоеПолеИмя) Экспорт
	
    Если ВыбранныеФайлы = Неопределено Тогда
        Возврат;
    КонецЕсли;    
	
	Если ВыбранныеФайлы.Количество() = 1 Тогда	
		// Запоминаем текущий выделенный элемент дерева
		ТекущиеДанные       = Элементы[ТабличоеПолеИмя].ТекущиеДанные;
		ИндексСтроки        = ЭтаФорма[ТабличоеПолеИмя].ПолучитьЭлементы().Индекс(ТекущиеДанные);
		ИдентификаторСтроки = Элементы[ТабличоеПолеИмя].ТекущаяСтрока;
		
		ВыбФайл                   = ВыбранныеФайлы[0];
		АдресВоВременномХранилище = ВыбФайл.Хранение;
        ПутьКФайлу                = ВыбФайл.Имя;
		
		ВыборФайлаНаСервере(ПутьКФайлу, ИндексСтроки, ТабличоеПолеИмя, АдресВоВременномХранилище);
		
		// Выделяем ранее запомненный элемент
		ТекущиеДанные = ЭтаФорма[ТабличоеПолеИмя].ПолучитьЭлементы().Получить(ИндексСтроки);
		Если ТекущиеДанные.Свойство("ТипТранзакции") И НастройкаДанногоТипаУжеИспользуется(ЭтаФорма[ТабличоеПолеИмя].ПолучитьЭлементы(), ТекущиеДанные.ТипТранзакции) Тогда
			ТекущиеДанные.Использовать = Ложь;
			ЭКОМ_ОбщегоНазначения.СообщитьПользователю("Шаблон настроек с типом транзакции " + ТекущиеДанные.ТипТранзакции + " уже используется, " 
			+ "загружаемый шаблон " + ТекущиеДанные.Кнопка + " добавлен без флажка ""Использовать""");
		КонецЕсли;      

		ИдентификаторСтроки = ТекущиеДанные.ПолучитьИдентификатор();
		Элементы[ТабличоеПолеИмя].ТекущаяСтрока = ИдентификаторСтроки;
	КонецЕсли;	
    Состояние("Настройки загружены!",100, ПутьКФайлу, БиблиотекаКартинок.ЭКОМ_ОбщаяКартинка);

КонецПроцедуры  

&НаСервере
Процедура ВыборФайлаНаСервере(Знач ПутьКФайлу, ИндексСтроки, ТабличоеПолеИмя, АдресВоВременномХранилище = Неопределено) Экспорт
	
	ДеревоОбъект    = РеквизитФормыВЗначение(ТабличоеПолеИмя);
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    
    Файл            = Новый Файл(ПутьКФайлу);
    РасширениеФайла = Файл.Расширение;
    
    Если АдресВоВременномХранилище <> Неопределено Тогда
        ФайлИзХранилища         = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
        ПолноеИмяФайлаНаСервере = ПолучитьИмяВременногоФайла(РасширениеФайла);
        
        ФайлИзХранилища.Записать(ПолноеИмяФайлаНаСервере);    
    Иначе
        ПолноеИмяФайлаНаСервере = ПутьКФайлу;
    КонецЕсли;

	Если НРег(РасширениеФайла) = ".1ct" Тогда // Старый формат
		
		ФайлТЗ = Новый ТекстовыйДокумент;
		ФайлТЗ.Прочитать(ПолноеИмяФайлаНаСервере);
		
		ДанныеТЗ = XMLЗначение(Тип("ХранилищеЗначения"), ФайлТЗ.ПолучитьТекст()).Получить();
						
	ИначеЕсли НРег(РасширениеФайла) = ".xml" Тогда // Новый формат
		
		НовоеЧтениеXML = Новый ЧтениеXML;
		НовоеЧтениеXML.ОткрытьФайл(ПолноеИмяФайлаНаСервере);
		НовыйСериализаторXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
		ДанныеТЗ = НовыйСериализаторXDTO.ПрочитатьXML(НовоеЧтениеXML);

	Иначе
		Сообщить("Формат [" + НРег(Файл.Расширение) + "] не поддерживается!", СтатусСообщения.Информация);
	КонецЕсли;
	
	Колонки = Новый Массив;	
	Для Каждого Колонка Из ДанныеТЗ.Колонки Цикл
		Колонки.Добавить(Колонка.Имя);
	КонецЦикла;

	ДеревоОбъект.Строки.Удалить(ИндексСтроки);
		
	// Коопируем строку в новое место.
	НоваяСтрока = ДеревоОбъект.Строки.Добавить();
	ОбработкаОбъект.СкопироватьСтрокуДереваЗначений(ДанныеТЗ.Строки.Получить(0), НоваяСтрока, Колонки, ТабличоеПолеИмя); //Docrobot 1.21.0 MOD-280 [Добавлено ТабличоеПолеИмя]
	ДеревоОбъект.Строки.Сдвинуть(ДеревоОбъект.Строки.Индекс(НоваяСтрока), ИндексСтроки - ДеревоОбъект.Строки.Индекс(НоваяСтрока));
	
	ЗначениеВРеквизитФормы(ДеревоОбъект, ТабличоеПолеИмя);
	
КонецПроцедуры // ОповещениеВыборФайлаНаСервере() 

#КонецОбласти

&НаКлиенте
Процедура НастройкаДокументовЗагрузитьНастройкиВсе(Команда)
	Если Модифицированность Тогда
		 Оповещение = Новый ОписаниеОповещения("ПередЗагрузкойВсехНастроек", ЭтаФорма);
		 ПоказатьВопрос(Оповещение, "Имеются несохраненные изменения, для продолжения требуется запись настроек. Сохранить?", РежимДиалогаВопрос.ОКОтмена);
	 Иначе
		 ПередЗагрузкойВсехНастроек();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗагрузкойВсехНастроек(Результат = Неопределено, Параметры = Неопределено) Экспорт
	Если ТипЗнч(Результат) = Тип("КодВозвратаДиалога") И Результат = КодВозвратаДиалога.ОК Тогда
		ВызватьДиалог = Ложь;
		СохранитьИзмененныеНастройки(, ВызватьДиалог);
	ИначеЕсли ТипЗнч(Результат) = Тип("КодВозвратаДиалога") И Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;	
	
	ОбработкаОкончанияПомещения = Новый ОписаниеОповещения("ОповещениеЗагрузитьНастройкиВсе", ЭтаФорма);
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Фильтр             = "Файл гибких настроек документов XML (*.xml)|*.xml|Таблица значений 1С (*.1ct)|*.1ct";
	ДиалогОткрытияФайла.ИндексФильтра      = 0; 
	НачатьПомещениеФайлов(ОбработкаОкончанияПомещения, , ДиалогОткрытияФайла, Истина, УникальныйИдентификатор);  	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеЗагрузитьНастройкиВсе(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;    
	
	Если ВыбранныеФайлы.Количество() = 1 Тогда			
		ВыбФайл = ВыбранныеФайлы[0];
		ИмяФайла = ВыбФайл.Имя;
		АдресВоВременномХранилище = ВыбФайл.Хранение;
		РезультатЧтенияФайла = ПолучитьЗагружаемыеНастройки(ИмяФайла, АдресВоВременномХранилище);
		
		Если РезультатЧтенияФайла.Свойство("Получены") Тогда   			
			ПараметрыОткрываемойФормы = Новый Структура;
			ПараметрыОткрываемойФормы.Вставить("ТипОперации", "Загрузка");
			ПараметрыОткрываемойФормы.Вставить("ТипыТранзакций", РезультатЧтенияФайла.ЗагружаемыеНастройки);
			
			ДополнительныеПараметры = Новый Структура("ТаблицаНастроек", РезультатЧтенияФайла.ТаблицаНастроек);
			
			ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеПолученияЗагружаемыНастроек", ЭтаФорма, ДополнительныеПараметры);
			ОткрытьФорму(ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ВыборСохраняемыхНастроек", ПараметрыОткрываемойФормы,,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);  			
		КонецЕсли; 		
	КонецЕсли;	
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеПолученияЗагружаемыНастроек(Результат, ДополнительныеПараметры) Экспорт
	АдресТаблицы    = Неопределено;
	МассивКонстант  = Неопределено;
	МассивНастроек  = Неопределено;
	
	Если Результат.Свойство("МассивКонстант", МассивКонстант) = Ложь 
		ИЛИ Результат.Свойство("ВыбранныеТипы", МассивНастроек) = Ложь
		ИЛИ ДополнительныеПараметры.Свойство("ТаблицаНастроек", АдресТаблицы) = Ложь Тогда
		
		Если Не Результат.Свойство("Отменить") Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сохранение настроек не может быть выполнено, не выбран каталог сохранения или не удалось передать структуру сохраняемых настроек";
			Сообщение.Сообщить();
		КонецЕсли;
		Возврат;
		
	КонецЕсли;
	
	ПослеПолученияЗагружаемыхНастроекНаСервере(АдресТаблицы, МассивКонстант, МассивНастроек);
	
	СтраницаПриОткрытии = "ГруппаНастройкиДокументов"; //Docrobot 1.20.0 MOD-1343 [Иначе при вызове ПриОткрытии меняется на последнюю сохраненную страницу]
	ПриОткрытии(Ложь);                                 //Docrobot 1.20.0 MOD-1343 []
КонецПроцедуры

&НаСервере
Процедура ПослеПолученияЗагружаемыхНастроекНаСервере(АдресТаблицы, МассивКонстант, МассивНастроек)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗагрузитьНастройкиПоДокументам(АдресТаблицы, МассивКонстант, МассивНастроек);
	
	МассивЛогаСобытий = Новый Массив;
	ПараметрыФункции  = Новый Массив;
	ПараметрыФункции.Добавить(Ложь);
	ПараметрыФункции.Добавить(МассивЛогаСобытий);
	БекапНастроек = ВернутьРезультатИзМодуляОбъекта("ИзменитьФорматПользовательскихНастроек", ПараметрыФункции);
	
	// обновление загруженных настроек
	ПриСозданииНаСервере(Ложь, Истина);
	Элементы.ГруппаПанельНастроек.ТекущаяСтраница = Элементы.ГруппаНастройкиДокументов;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Выбранные настройки загружены.";
	Сообщение.Сообщить();
КонецПроцедуры

&НаСервере
Функция ПолучитьЗагружаемыеНастройки(ПутьКФайлу, АдресВоВременномХранилище)  	
	
	ИмяСобытия = "Загрузить все гибкие настройки";
	Результат  = Новый Структура;
	Результат.Вставить("Получены", Ложь);
	Результат.Вставить("СтарыйФормат", Ложь);
	МассивЛогаСобытий = Новый Массив;

	
	Файл = Новый Файл(ПутьКФайлу);
	Если НРег(Файл.Расширение) = ".1ct" Тогда // Старый формат
		ФайлТЗ = Новый ТекстовыйДокумент;
		ФайлТЗ.Прочитать(ПутьКФайлу); 
		Данные = ФайлТЗ.ПолучитьТекст();	
		
		ДанныеТЗ = XMLЗначение(Тип("ХранилищеЗначения"), Данные).Получить();		
		Для Каждого Элемент Из ДанныеТЗ Цикл
			УстановитьЗначениеРеквизитаФормы(Элемент.Ключ, Элемент.Значение);
		КонецЦикла; 
		
		ТекстЛогаСобытий = "Для данного формата недоступен выбор загружаемых настроек, будут загружены все. " + Символы.ПС  
		+ "Настройки загружены на форму - перехожу к сохранению в регистр без подтверждений..." + Символы.ПС
		+ "Настройки сохранены.";	
		ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Информация, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		
		ПараметрыФункции = Новый Массив;
		ПараметрыФункции.Добавить(Ложь);
		ПараметрыФункции.Добавить(МассивЛогаСобытий);
		БекапНастроек = ВернутьРезультатИзМодуляОбъекта("ИзменитьФорматПользовательскихНастроек", ПараметрыФункции);
		
		// обновление загруженных настроек
		ПриСозданииНаСервере(Ложь, Истина);

		Результат.СтарыйФормат = Истина;
		
	ИначеЕсли НРег(Файл.Расширение) = ".xml" Тогда // Новый формат
		ОбработкаОбъект 	 = РеквизитФормыВЗначение("Объект");
		РезультатЧтенияФайла = ОбработкаОбъект.ПолучитьСоставЗагружаемыхНастроек(АдресВоВременномХранилище);
		
		НастройкиПолучены = Ложь;
		Если РезультатЧтенияФайла.Свойство("Получены", НастройкиПолучены) И НастройкиПолучены Тогда
			Результат = РезультатЧтенияФайла;
			Результат.Вставить("СтарыйФормат", Ложь);
		КонецЕсли; 
	Иначе
		ТекстЛогаСобытий = "Формат [" + НРег(Файл.Расширение) + "] не поддерживается!";	
		ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Предупреждение, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
	КонецЕсли;
	
	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Попытка
			Выполнить("ЭКОМ_ОбщегоНазначения.ЗаписатьЛогСобытийвРегистрЛогирование(МассивЛогаСобытий);");
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Вычислить("ЭКОМ_ОбщегоНазначения.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий)");
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьГибкиеНастройкиДокументовВсе(ПутьКФайлу, АдресВоВременномХранилище)
	
	ИмяСобытия = "Загрузить все гибкие настройки";
	МассивЛогаСобытий = Новый Массив;
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Файл = Новый Файл(ПутьКФайлу);
	Загружены = Ложь;
	Если НРег(Файл.Расширение) = ".1ct" Тогда // Старый формат
		ФайлТЗ = Новый ТекстовыйДокумент;
		ФайлТЗ.Прочитать(ПутьКФайлу); 
		Данные = ФайлТЗ.ПолучитьТекст();	
		
		ДанныеТЗ = XMLЗначение(Тип("ХранилищеЗначения"), Данные).Получить();		
		Для Каждого Элемент Из ДанныеТЗ Цикл
            УстановитьЗначениеРеквизитаФормы(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
		
		ТекстЛогаСобытий = "Настройки загружены на форму - перехожу к сохранению в регистр без подтверждений..." + Символы.ПС
			+ "Настройки сохранены.";	
		ЗаписьСтруктурыЛога = Вычислить("ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Информация, ИмяСобытия)");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		
		Загружены = Истина;
		
	ИначеЕсли НРег(Файл.Расширение) = ".xml" Тогда // Новый формат
		Загружены = ОбработкаОбъект.ЗагрузитьНастройки(АдресВоВременномХранилище, МассивЛогаСобытий);
	Иначе
		ТекстЛогаСобытий = "Формат [" + НРег(Файл.Расширение) + "] не поддерживается!";	
		ЗаписьСтруктурыЛога = Вычислить("ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Предупреждение, ИмяСобытия)");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

	КонецЕсли;
	
	Сообщение = Новый СообщениеПользователю;
	
	Если Загружены Тогда
		ПараметрыФункции = Новый Массив;
		ПараметрыФункции.Добавить(Ложь);
		ПараметрыФункции.Добавить(МассивЛогаСобытий);
		БекапНастроек = ВернутьРезультатИзМодуляОбъекта("ИзменитьФорматПользовательскихНастроек", ПараметрыФункции);
		
		// Обновим загруженные настройки
    	ПриСозданииНаСервере(Ложь, Истина);
		
		Сообщение.Текст = "Настройки загружены";
		
	Иначе
		Сообщение.Текст = "Настройки не загружены. Причину смотрите в логе событий.";
	КонецЕсли;
	
	Сообщение.Сообщить();
	
	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Попытка
			Выполнить("ЭКОМ_ОбщегоНазначения.ЗаписатьЛогСобытийвРегистрЛогирование(МассивЛогаСобытий);");
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Вычислить("ЭКОМ_ОбщегоНазначения.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий)");
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаДокументовСохранитьНастройкиВсе(Команда)
	
	Массив = Новый Массив;
	Массив.Добавить("СтруктураФайлаXMLВходящие");
	Массив.Добавить("СтруктураФайлаXMLИсходящие");
	Массив.Добавить("СтруктураФайлаXMLДокументы");
	
	Структура = Новый Структура;
	Структура.Вставить("ЭКОМ_ЗначениеДополнительныхКонстант", Истина);

	МассивЛогаСобытий = Новый Массив;
	АдресВоВременномХранилище = ВыгрузкаНаСервере(Структура, Массив, МассивЛогаСобытий);
	
	КраткаяИнформация = Вычислить("ЭКОМ_ОбщегоНазначения.ПолучитьКраткуюИнформацияОКонфигурации()");
	ДатаЗаписи        = Формат(ТекущаяДата(), "ДФ=dd.MM.yy");
	ИмяСохранения     = "Настройки по документам_" + ДатаЗаписи + "_" + КраткаяИнформация;
	
	СохранениеФайла(АдресВоВременномХранилище, ИмяСохранения);
	
	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Попытка
			Выполнить("ЭКОМ_ОбщегоНазначения.ЗаписатьЛогСобытийвРегистрЛогирование(МассивЛогаСобытий);");
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Вычислить("ЭКОМ_ОбщегоНазначения.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий)");
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыгрузкаНаСервере(Структура, Массив, МассивЛогаСобытий, ВыгружатьТолькоВыбранные = Ложь, НастройкиКВыгрузке = Неопределено)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
    АдресВоВременномХранилище = ОбработкаОбъект.ВыгрузитьНастройки(Структура, Массив, МассивЛогаСобытий, ВыгружатьТолькоВыбранные, НастройкиКВыгрузке);	
	
	Возврат  АдресВоВременномХранилище;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеТЗ_В_XMLСтрока(ИменаЭлементов)
	
	Значения = Новый Структура;
	Для Каждого Элемент Из ИменаЭлементов Цикл
		Значения.Вставить(Элемент, ДанныеФормыВЗначение(ЭтаФорма[Элемент], Тип("ДеревоЗначений"))); 
	КонецЦикла;
	ДанныеТЗ = Новый ХранилищеЗначения(Значения);
	
	Возврат XMLСтрока(ДанныеТЗ);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ИСХОДЯЩИЕ 

// Функция получает из текущей строки и всех строк уровнями выше наименования реквизитов, доступных для выбора в текущей строке
//
// Параметры:
//  Данные  - СтрокаДереваЗначений - строка дерева, для которй нужно получить список доступных реквизитов
//  ТолькоТекущая - Булево - установка признака указывает на необходимость выводить список реквизитов только из текущей строки (не учитывая реквизиты строк-родителей)
//
// Возвращаемое значение:
//   СписокЗначений   - коллекция реквизитов, доступных для выбора
//
&НаКлиенте
Функция ПолучитьКоллекциюДоступныхРеквизитов(Знач Данные, ТолькоТекущая = Ложь)

	СписокВыбора = Новый СписокЗначений;
	
	Корень = Данные;
	Пока НЕ Корень.ПолучитьРодителя()	= Неопределено Цикл
		Корень 				= Корень.ПолучитьРодителя();
	КонецЦикла;
	
	Если Найти(Корень.ТипТранзакции, "Исходящий") > 0 Тогда
		НаправлениеТранзакции	= "исход";
	ИначеЕсли Найти(Корень.ТипТранзакции, "Входящий") > 0 Тогда
		НаправлениеТранзакции	= "вход";
	Иначе
		НаправлениеТранзакции	= "";
	КонецЕсли;
	
	Если ПустаяСтрока(НаправлениеТранзакции) Тогда
		Возврат СписокВыбора;
	КонецЕсли;
	
	// Перебор строк.
	Пока НЕ Данные	= Неопределено Цикл
		Если ТипЗнч(Данные.ДоступныеЗначения) 	= Тип("СписокЗначений") Тогда
			Если Уровень(Данные) = 0 Тогда
				ИмяПриемника 	= "Документ";
			Иначе
				ИмяПриемника	= Данные.Приемник;
			КонецЕсли;
			
			Для Каждого Значение Из Данные.ДоступныеЗначения Цикл
				СписокВыбора.Добавить(ИмяПриемника + "." + Значение);
			КонецЦикла;
		КонецЕсли;
		Если ТолькоТекущая Тогда
			Данные				= Неопределено;
		Иначе
			Данные				= Данные.ПолучитьРодителя();
		КонецЕсли;
	КонецЦикла;
	
	СписокВыбора.СортироватьПоЗначению(НаправлениеСортировки.Возр);

	Возврат СписокВыбора;
	
КонецФункции // ПолучитьКоллекциюДоступныхРеквизитов()

// Заполняет массив-приемник уникальными значениями из массива-источника.
// Если элемент в массиве-приемнике уже существует, то добавления нового элемента не происходит.
//
// Параметры:
//  МассивПриемник – Массив – массив, который заполняется уникальными значениями
//  МассивИсточник – Массив – массив, из которого подбираются элементы в массив-приемник.
// 
&НаКлиенте
Процедура ЗаполнитьМассивУникальнымиЗначениями(МассивПриемник, МассивИсточник)
	
	УникальныеЗначения = Новый Соответствие;
	
	Для каждого Значение Из МассивПриемник Цикл
		УникальныеЗначения.Вставить(Значение, Истина);
	КонецЦикла;
	
	Для каждого Значение Из МассивИсточник Цикл
		Если УникальныеЗначения[Значение] = Неопределено Тогда
			МассивПриемник.Добавить(Значение);
			УникальныеЗначения.Вставить(Значение, Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураФайлаXMLИсходящиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// Определение направления транзакции.
	Корень    = Элементы.СтруктураФайлаXMLИсходящие.ТекущиеДанные;
	Пока НЕ Корень.ПолучитьРодителя() = Неопределено Цикл
		Корень = Корень.ПолучитьРодителя();
	КонецЦикла;
	
	Если Поле.Имя = "СтруктураФайлаXMLИсходящиеДанные" 
		И (Уровень(Элементы.СтруктураФайлаXMLИсходящие.ТекущиеДанные) = 0
		ИЛИ НЕ Элемент.ТекущиеДанные.ПолучитьЭлементы().Количество() = 0) Тогда
		
		СтандартнаяОбработка 	= Ложь;
		
		Если Элементы.СтруктураФайлаXMLИсходящие.ТекущиеДанные.ПолучитьЭлементы().Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Заголовок = ?(ПустаяСтрока(Элементы.СтруктураФайлаXMLИсходящие.ТекущиеДанные.Приемник), "", "Введите алгоритм для заполнения поля """ 
		             + Элементы.СтруктураФайлаXMLИсходящие.ТекущиеДанные.Приемник + """");
		
		ТипДокументаИсточник = ПолучитьТипДокумента(Элементы.СтруктураФайлаXMLИсходящие.ТекущиеДанные, "СтруктураФайлаXMLИсходящие", "Источник");
		
		ИмяОткрываемойФормы = ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаКонсольЗапросов";
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ИмяТабличнойЧасти", "СтруктураФайлаXMLИсходящие");
		ДопПараметры.Вставить("ИмяФормы"         , "УФ_ФормаКонсольЗапросов");
		ДопПараметры.Вставить("ИмяЭлементаФормы" , "СтруктураФайлаXMLИсходящиеДанные");
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок"            , Заголовок);
		ПараметрыФормы.Вставить("ТипДокументаИсточника", ТипДокументаИсточник);
		ПараметрыФормы.Вставить("ТекстНачальный"       , Элементы.СтруктураФайлаXMLИсходящие.ТекущиеДанные.Данные);
		
        ПараметрыФормы.Вставить("ДопПараметры", ДопПараметры);
		
		ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы,,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
		ЗаполнитьСписокДляИзменения(Элемент.Имя, "_" + Элемент.Имя);
		
	ИначеЕсли Поле.Имя = "СтруктураФайлаXMLИсходящиеСвязи" И НЕ Уровень(Элементы.СтруктураФайлаXMLИсходящие.ТекущиеДанные) = 0
		И НЕ Элемент.ТекущиеДанные.ПолучитьЭлементы().Количество() = 0 И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Данные) Тогда // Здесь должно быть все по другому. Возможно стоит сделать новую форму.
		
		СтандартнаяОбработка 	= Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок"                  , "Редактирование набора связей для тега");
		
		ПараметрыФормы.Вставить("ЛевоеПолеДоступныеЗначения" , ПолучитьКоллекциюДоступныхРеквизитов(Элемент.ТекущиеДанные));
		ПараметрыФормы.Вставить("ПравоеПолеДоступныеЗначения", ПолучитьКоллекциюДоступныхРеквизитов(Элемент.ТекущиеДанные));
		
		МассивСтрок = Новый Массив;
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Связи) Тогда		
			
			Для Каждого Строка Из Элемент.ТекущиеДанные.Связи Цикл
				СтрокаТЧ = Новый Структура;
				СтрокаТЧ.Вставить("ЛевоеПоле" , Строка.Значение);
				СтрокаТЧ.Вставить("ПравоеПоле", Строка.Представление);
				МассивСтрок.Добавить(СтрокаТЧ);
			КонецЦикла;
			
		КонецЕсли;	
		ПараметрыФормы.Вставить("ТабличноеПоле", МассивСтрок);
		
		ДопПараметры = Новый Структура;
        ДопПараметры.Вставить("ИмяТабличнойЧасти"   , "СтруктураФайлаXMLИсходящие");
		ДопПараметры.Вставить("ЭлементТекущиеДанные", Элемент.ТекущиеДанные.Связи);
		ДопПараметры.Вставить("ИмяФормы"            , "УФ_ФормаСвязи");
		ДопПараметры.Вставить("ИмяЭлементаФормы"    , Поле.Имя);	
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
		ПараметрыФормы.Вставить("ДопПараметры", ДопПараметры);
        
		ОткрытьФорму(ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаСвязи", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);					
		
		ЗаполнитьСписокДляИзменения(Элемент.Имя, "_" + Элемент.Имя);
		
	ИначеЕсли Поле.Имя	= "СтруктураФайлаXMLИсходящиеАтрибуты" Тогда
		
		СтандартнаяОбработка 	= Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок"     , "Редактирование набора атрибутов для тега " + Элемент.ТекущиеДанные.Приемник);
		ПараметрыФормы.Вставить("Редактирование", Истина);
		
		МассивСтрок = Новый Массив;
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Атрибуты) Тогда
			Для Каждого Строка Из Элемент.ТекущиеДанные.Атрибуты Цикл
				СтрокаТЧ = Новый Структура;
				СтрокаТЧ.Вставить("Реквизит"         , Строка.Значение);
				СтрокаТЧ.Вставить("Формула"          , Строка.Представление);
				СтрокаТЧ.Вставить("Обязательный"     , Строка.Пометка);
				СтрокаТЧ.Вставить("ДоступныеЗначения", ПолучитьКоллекциюДоступныхРеквизитов(Элемент.ТекущиеДанные));
				МассивСтрок.Добавить(СтрокаТЧ);
			КонецЦикла;
		Иначе
			СтрокаТЧ = Новый Структура;
			СтрокаТЧ.Вставить("Реквизит"         , "");
			СтрокаТЧ.Вставить("Формула"          , "");
			СтрокаТЧ.Вставить("Обязательный"     , "");
			СтрокаТЧ.Вставить("ДоступныеЗначения", ПолучитьКоллекциюДоступныхРеквизитов(Элемент.ТекущиеДанные));
			МассивСтрок.Добавить(СтрокаТЧ);
		КонецЕсли;	
		ПараметрыФормы.Вставить("ТабличноеПоле", МассивСтрок);
		
		ДопПараметры = Новый Структура;
        ДопПараметры.Вставить("ИмяТабличнойЧасти"   , "СтруктураФайлаXMLИсходящие");
		ДопПараметры.Вставить("ЭлементТекущиеДанные", Элемент.ТекущиеДанные.Атрибуты);
		ДопПараметры.Вставить("ИмяФормы"            , "УФ_ФормаНастройкиСлужебные");
		ДопПараметры.Вставить("ИмяЭлементаФормы"    , Поле.Имя);	
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
        ПараметрыФормы.Вставить("ДопПараметры", ДопПараметры);
        
		ОткрытьФорму(ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаНастройкиСлужебные", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);					
		
		ЗаполнитьСписокДляИзменения(Элемент.Имя, "_" + Элемент.Имя);
		
	ИначеЕсли Поле.Имя	= "СтруктураФайлаXMLИсходящиеСлужебные" 
		И Уровень(Элементы.СтруктураФайлаXMLИсходящие.ТекущиеДанные) = 0 Тогда
		
		СтандартнаяОбработка 	= Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок"     , "Редактирование дополнительных настроек для тега " + Элемент.ТекущиеДанные.Приемник);
		ПараметрыФормы.Вставить("Редактирование", Истина);
		
		МассивСтрок = Новый Массив;
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Служебные) Тогда
			Для Каждого Строка Из Элемент.ТекущиеДанные.Служебные Цикл
				СтрокаТЧ = Новый Структура;
				СтрокаТЧ.Вставить("Реквизит"         , Строка.Ключ);
				СтрокаТЧ.Вставить("Формула"          , Строка.Значение);
				СтрокаТЧ.Вставить("ДоступныеЗначения", ПолучитьКоллекциюДоступныхРеквизитов(Элемент.ТекущиеДанные));
				МассивСтрок.Добавить(СтрокаТЧ);
			КонецЦикла;
		Иначе
			СтрокаТЧ = Новый Структура;
			СтрокаТЧ.Вставить("Реквизит"         , "");
			СтрокаТЧ.Вставить("Формула"          , "");
			СтрокаТЧ.Вставить("ДоступныеЗначения", ПолучитьКоллекциюДоступныхРеквизитов(Элемент.ТекущиеДанные));
			МассивСтрок.Добавить(СтрокаТЧ);
		КонецЕсли;
		ПараметрыФормы.Вставить("ТабличноеПоле", МассивСтрок);

		ДопПараметры = Новый Структура;
        ДопПараметры.Вставить("ИмяТабличнойЧасти"   , "СтруктураФайлаXMLИсходящие");
		ДопПараметры.Вставить("ЭлементТекущиеДанные", Элемент.ТекущиеДанные.Служебные);
		ДопПараметры.Вставить("ИмяФормы"            , "УФ_ФормаНастройкиСлужебные");
		ДопПараметры.Вставить("ИмяЭлементаФормы"    , Поле.Имя);	
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
        ПараметрыФормы.Вставить("ДопПараметры", ДопПараметры);
        
		ОткрытьФорму(ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаНастройкиСлужебные", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
		
		ЗаполнитьСписокДляИзменения(Элемент.Имя, "_" + Элемент.Имя);
		
	ИначеЕсли Поле.Имя	= "СтруктураФайлаXMLИсходящиеСлужебные" 
		И НЕ Уровень(Элементы.СтруктураФайлаXMLИсходящие.ТекущиеДанные) = 0 Тогда
		
		СтандартнаяОбработка 	= Ложь;
		
		Заголовок 		= ?(ПустаяСтрока(Элемент.ТекущиеДанные.Приемник), "", "Введите алгоритм условий отбора тега """ + Элемент.ТекущиеДанные.Приемник + """");
		
        ТипДокументаИсточник = ПолучитьТипДокумента(Элементы.СтруктураФайлаXMLИсходящие.ТекущиеДанные, "СтруктураФайлаXMLИсходящие", "Источник");
	
		ИмяОткрываемойФормы = ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаКонсольЗапросов";
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок"            , Заголовок);
		ПараметрыФормы.Вставить("ТипДокументаИсточника", ТипДокументаИсточник);
		ПараметрыФормы.Вставить("ТекстНачальный"       , Элемент.ТекущиеДанные.Служебные);
		
		ДопПараметры = Новый Структура;
        ДопПараметры.Вставить("ИмяТабличнойЧасти", "СтруктураФайлаXMLИсходящие");
		ДопПараметры.Вставить("ИмяФормы"         , "УФ_ФормаКонсольЗапросов");
		ДопПараметры.Вставить("ИмяЭлементаФормы" , Поле.Имя);
				
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
		
        ПараметрыФормы.Вставить("ДопПараметры", ДопПараметры);
        
        ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы,,,,,ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
        ПараметрыФормы.Вставить("ДопПараметры", ДопПараметры);
        
		Данные  = Новый Структура;
		Данные.Вставить("Имя"    , "СтруктураФайлаXMLИсходящие");
		Данные.Вставить("Колонка", "Служебные");
		ПослеВводаАлгоритмаЗаполнения(СокрЛП(Элемент.ТекущиеДанные.Служебные), Данные);		
		
		ЗаполнитьСписокДляИзменения(Элемент.Имя, "_" + Элемент.Имя);
		
	ИначеЕсли Поле.Имя	= "СтруктураФайлаXMLИсходящиеСохранение" И Уровень(Элементы.СтруктураФайлаXMLИсходящие.ТекущиеДанные) = 0 Тогда
		СтандартнаяОбработка 	= Ложь;
		
		Если ПроверитьЗаполнениеТекстаНастроекСтруктурыФайлаXML(Элементы.СтруктураФайлаXMLИсходящие.ТекущиеДанные) Тогда //DocRobot 1.21.0 20220207 MOD-1562 [отключить сохранение пустого шаблона]
			СохранитьНастройкуXML(Элемент.Имя);
		КонецЕсли;
		
	ИначеЕсли Поле.Имя	= "СтруктураФайлаXMLИсходящиеЗагрузка" И Уровень(Элементы.СтруктураФайлаXMLИсходящие.ТекущиеДанные) = 0 Тогда
		СтандартнаяОбработка 	= Ложь;
		
		ВосстановитьНастройкуXML(Элемент.Имя);
	ИначеЕсли Поле.Имя	= "СтруктураФайлаXMLИсходящиеКнопка" 
		И Уровень(Элементы.СтруктураФайлаXMLИсходящие.ТекущиеДанные) = 0 Тогда
		
		СформироватьНастройкиКнопки(Элемент.ТекущиеДанные.ТипТранзакции, Элемент.ТекущиеДанные, СтандартнаяОбработка, Поле.Имя, "СтруктураФайлаXMLИсходящие");
		ЗаполнитьСписокДляИзменения(Элемент.Имя, "_" + Элемент.Имя);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СформироватьНастройкиКнопки(ИмяКнопкиПоУмолчнию, ВыбраннаяСтрока, СтандартнаяОбработка, ИмяЭлементаФормы, ИмяТабличнойЧасти)
	
	СтандартнаяОбработка 	= Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок"     , "Кнопка - " + ИмяКнопкиПоУмолчнию);
	ПараметрыФормы.Вставить("Редактирование", Истина);
	
	СтруктураРеквизитов = Новый Соответствие;
	СтруктураРеквизитов.Вставить("ИмяКнопки" , ИмяКнопкиПоУмолчнию);
	СтруктураРеквизитов.Вставить("Покупатель", ЭтаФорма.ЭКОМ_ОбменСеть);
	СтруктураРеквизитов.Вставить("Поставщик" , ЭтаФорма.ЭКОМ_ОбменПоставщик);
	СтруктураРеквизитов.Вставить("ЭТРН"      , ЭтаФорма.ЭКОМ_ОбменЭТРН);
	СтруктураРеквизитов.Вставить("Прайс-лист" , ЭтаФорма.ЭКОМ_ОбменПрайсЛист);
	
	МассивСтрок = Новый Массив;
	Для Каждого СтруктураСтрока Из СтруктураРеквизитов Цикл
		
		Формула = "";	
		Если СтруктураСтрока.Ключ = "ИмяКнопки" Тогда
			Формула = ?(ЗначениеЗаполнено(ВыбраннаяСтрока.Кнопка),ВыбраннаяСтрока.Кнопка, СтруктураСтрока.Значение);	
			Использовать = Истина;
		Иначе
			Использовать = СтруктураСтрока.Значение;
		КонецЕсли;
		
		СтрокаКоллекцияТЧ = ВыбраннаяСтрока.КоллекцияТЧ.НайтиПоЗначению(СтруктураСтрока.Ключ); 
		Если НЕ СтрокаКоллекцияТЧ = Неопределено Тогда
			Если СтруктураСтрока.Ключ = "ИмяКнопки" Тогда
				Формула = СтрокаКоллекцияТЧ.Представление;
			КонецЕсли;				
			Использовать = СтрокаКоллекцияТЧ.Пометка;
		КонецЕсли; 
		
		СтрокаТЧ = Новый Структура;
		СтрокаТЧ.Вставить("Реквизит"    , СтруктураСтрока.Ключ);
		СтрокаТЧ.Вставить("Формула"     , Формула);
		СтрокаТЧ.Вставить("Использовать", Использовать);
		МассивСтрок.Добавить(СтрокаТЧ);
		
	КонецЦикла;
	
	ПараметрыФормы.Вставить("ТабличноеПолеДляКнопки", МассивСтрок);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяТабличнойЧасти"   , ИмяТабличнойЧасти);
	ДопПараметры.Вставить("ЭлементТекущиеДанные", ВыбраннаяСтрока.Кнопка);
	ДопПараметры.Вставить("ИмяФормы"            , "УФ_ФормаНастройкиСлужебные");
	ДопПараметры.Вставить("ИмяЭлементаФормы"    , ИмяЭлементаФормы);	
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
	ПараметрыФормы.Вставить("ДопПараметры", ДопПараметры);
	
	ОткрытьФорму(ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаНастройкиСлужебные", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);					
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураФайлаXMLИсходящиеПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка 			= Ложь;
	СтрокаПриемникПриПеретаскивании = Строка;
КонецПроцедуры

&НаКлиенте
Процедура СтруктураФайлаXMLИсходящиеОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	Если НЕ СтрокаПриемникПриПеретаскивании = Неопределено Тогда
		
		СтрокаПриемникПриПеретаскиванииТек = ЭтаФорма.СтруктураФайлаXMLИсходящие.НайтиПоИдентификатору(СтрокаПриемникПриПеретаскивании);
		
		Если Уровень(ПараметрыПеретаскивания.Значение[0]) = 0 Тогда
			СтрокаПриемникПриПеретаскивании = Неопределено;
			Возврат;
		КонецЕсли;
				
		// Коопируем строку в новое место.
		СкопироватьСтрокуДереваЗначенийНаСервере(ПараметрыПеретаскивания.Значение[0], СтрокаПриемникПриПеретаскиванииТек.ПолучитьЭлементы().Добавить(), Элемент.Имя);
		// Удаляем исходную строку.
		ПараметрыПеретаскивания.Значение[0].ПолучитьРодителя().ПолучитьЭлементы().Удалить(ПараметрыПеретаскивания.Значение[0]);
		
		СтрокаПриемникПриПеретаскивании = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьСтрокуДереваЗначенийНаСервере(Значение, СтрокаПриемникПриПеретаскивании, ТабличоеПолеИмя) Экспорт
		
	ДеревоОбъект    = РеквизитФормыВЗначение(ТабличоеПолеИмя);
	Колонки = Новый Массив;	
	Для Каждого Колонка Из ДеревоОбъект.Колонки Цикл
		Колонки.Добавить(Колонка.Имя);
	КонецЦикла;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СкопироватьСтрокуДереваЗначений(Значение, СтрокаПриемникПриПеретаскивании, Колонки);
	
КонецПроцедуры 


&НаКлиенте
Процедура НастройкаДокументовНовыйДокументИсходящий(Команда)
	ЭтаФорма.СтруктураФайлаXMLИсходящие.ПолучитьЭлементы().Добавить();	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСтруктуру_из_XML(ИмяКоллекции, ИмяЭлемента)
 
	ИмяФайла = ПолучитьИмяФайлаСтруктуры(РежимДиалогаВыбораФайла.Открытие, ИмяЭлемента);
	Если ПустаяСтрока(ИмяФайла) Тогда
		Возврат;
	КонецЕсли;
    
    ЗагрузитьДанныеСтруктуры_из_XML(ИмяФайла, ИмяКоллекции); 
    
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяФайлаСтруктуры(Режим, ИмяКратко = "")
    
	ВыборФайла = Новый ДиалогВыбораФайла(Режим);
	ВыборФайла.ПолноеИмяФайла = "" + ИмяКратко;
	Фильтр = "(*.xml)|*.xml";
	ВыборФайла.Фильтр = Фильтр;
	ВыборФайла.МножественныйВыбор = Ложь;
	ВыборФайла.Выбрать();
	
	Возврат ВыборФайла.ПолноеИмяФайла;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьДанныеСтруктуры_из_XML(ИмяФайла, ИмяКоллекции)
	
	ДеревоОбъект = РеквизитФормыВЗначение(ИмяКоллекции);
	
    МассивКолонок = Новый Массив;
	
	Для каждого СтрЭлемент Из Элементы[ИмяКоллекции].ПодчиненныеЭлементы Цикл
		МассивКолонок.Добавить(СтрЗаменить(СтрЭлемент.Имя, ИмяКоллекции, ""));
	КонецЦикла;
	
	Если МассивКолонок.Найти("Атрибуты") = Неопределено Тогда
    	МассивКолонок.Добавить("Атрибуты");
 	КонецЕсли;
	
    Дерево = Вычислить("ЭКОМ_ОбщегоНазначения.ДеревоЗначенийИзФайлаXML(ИмяФайла, МассивКолонок, ДеревоОбъект)");
    СтрКолонок = Новый Структура("Использовать", Истина);
	
	УстановитьЗначТолькоВКорне = Новый Массив;
	УстановитьЗначТолькоВКорне.Добавить(Ложь);
	
    УстановитьЗначенияДерево(Дерево.Строки.Получить(Дерево.Строки.Количество() - 1), "Структура", СтрКолонок, УстановитьЗначТолькоВКорне);

	Если ТипЗнч(Дерево) = Тип("ДеревоЗначений") Тогда
		ЗначениеВРеквизитФормы(Дерево, ИмяКоллекции);
    КонецЕсли;
	
КонецПроцедуры

// Процедура устанавливает передаваемые значения в строку дерева знчаений
//
// Параметры:
//  Дерево  - СтрокаДереваЗначений - объект, в котором нужно обновить значения
//  ИмяКолонки  - Строка - имя колонки дерева значений для установки значения.
//		Если в параметр передается строка "Структура", то установка требуется
//		для нескольких значений, которые передаются в структуре, где ключ - имя
//		колонки, а значение - значение строки дерева значений.
//  Значение  - AnyType - значение для подстановки в указанную колонку. Если в
//		параметр ИмяКолонки передается строка "Структура", то установка требуется
//		для нескольких значений, которые передаются в структуре, где ключ - имя
//		колонки, а значение - значение строки дерева значений.
//  УстановитьЗначТолькоВКорне  - Массив - коллекция флагов ограничения установки
//		значений только в корне дерева. Флаги расположены в той же последовательности,
//		что и значения в параметре Значение.
//
&НаСервере
Процедура УстановитьЗначенияДерево(Дерево, ИмяКолонки, Значение, УстановитьЗначТолькоВКорне)
	
	// Обход реквизитов в корне дерева.
	Индекс = 0;
	
	Для Каждого Стр Из Значение Цикл
		
		Попытка
			Дерево[Стр.Ключ] = Стр.Значение;
		Исключение КонецПопытки;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	// Обход реквизитов подчиненных элементов.
    ОбойтиУровеньДерева(Дерево.Строки, ИмяКолонки, Значение, УстановитьЗначТолькоВКорне);
    
КонецПроцедуры

&НаСервере
Процедура ОбойтиУровеньДерева(Строки, ИмяКолонки, Значение, УстановитьЗначТолькоВКорне, ИмяТэга = "", ИмяРодитель = "")
	
	Для Каждого Строка из Строки Цикл
		
		Родитель = Строка.Родитель;
		Попытка
			ИмяТега = Строка.Тег; // Старый вариант
		Исключение
			ИмяТега = Строка.Приемник;
		КонецПопытки;
		
		Пока Родитель <> Неопределено Цикл
			Попытка
				ИмяРодитель = Родитель.Тег; // Старый вариант
			Исключение
				ИмяРодитель = Родитель.Приемник;
			КонецПопытки;
			ИмяТега = ИмяРодитель + "_" + ИмяТега;
			Родитель = Родитель.Родитель;
		КонецЦикла;
			
		Если ИмяКолонки = "Структура" И ТипЗнч(Значение) = Тип("Структура") Тогда
			
			Индекс = 0;
			
			Для Каждого Стр Из Значение Цикл
				
				Попытка
					Если НЕ УстановитьЗначТолькоВКорне.Получить(Индекс) Тогда
						Строка[Стр.Ключ] = Стр.Значение;
					ИначеЕсли Строка.Уровень() = 0 Тогда
						Строка[Стр.Ключ] = Стр.Значение;
					КонецЕсли;
				Исключение КонецПопытки;
				
				Индекс = Индекс + 1;
				
			КонецЦикла;
		Иначе
			Строка[ИмяКолонки] = Значение;
		КонецЕсли;
		ОбойтиУровеньДерева(Строка.Строки, ИмяКолонки, Значение, УстановитьЗначТолькоВКорне, ИмяТэга, ИмяРодитель);
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаДокументовЗагрузитьНовыйФормат(Команда)
	ЗагрузитьСтруктуру_из_XML("СтруктураФайлаXMLИсходящие", "");
КонецПроцедуры

&НаКлиенте
Процедура СтруктураФайлаXMLИсходящиеТипТранзакцииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТипТранзакции", ВыбранноеЗначение);	
	МассивСтрок = ДанныеФормыКоллекцияЭлементовДереваНайтиСтроки(ЭтаФорма.СтруктураФайлаXMLИсходящие.ПолучитьЭлементы(), ПараметрыОтбора);
	
	Если НЕ ПустаяСтрока(ВыбранноеЗначение)
		И НЕ МассивСтрок[0] = Неопределено Тогда		
		Сообщить("Выбранный тип транзакции уже настроен.", СтатусСообщения.Информация);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_Локальный_Каталог_UPDATEНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЭтаФорма.Модифицированность
		И ЗавершениеРаботы = Истина Тогда 
		              
		Если ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения") И ВладелецФормы.Открыта() Тогда
			Возврат;
		КонецЕсли;
		
		ТекстПредупреждения = "Docrobot: перед закрытием необходимо сохранить настройки!";
	    Отказ = Истина;
		Возврат;     
	КонецЕсли;
	
	Если НЕ ЗавершениеРаботы = Истина Тогда
		МассивЛогаСобытий = Новый Массив;
		ИмяТекущейСтраницы = Элементы.ГруппаПанельНастроек.ТекущаяСтраница.Имя;
	    ЗаписатьТекущуюСтраницуНаСервере(ИмяТекущейСтраницы, МассивЛогаСобытий);
	    Если ЭтаФорма.Модифицированность Тогда
			
			Если ЗавершениеРаботы = Истина Тогда
				ТекстПредупреждения = "Настройки изменены и не сохранены. Необходимо закрыть форму настроек!";
				Отказ = Истина;
			Иначе
				Отказ = Истина;
				СохранитьИзмененныеНастройки(Истина);
			КонецЕсли;

	    КонецЕсли;
		
		Если МассивЛогаСобытий.Количество() > 0  Тогда
			Попытка
				Выполнить("ЭКОМ_ОбщегоНазначения.ЗаписатьЛогСобытийвРегистрЛогирование(МассивЛогаСобытий);");
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = Вычислить("ЭКОМ_ОбщегоНазначения.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий)");
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ИнтерфейсНастройкаТабличнойЧастиНаСервере(ИмяЗапроса, ЗапросПоУмолчанию = "")
	ТекстЗапроса = НастройкаПрочитатьОбщийМодуль(ИмяЗапроса, ЗапросПоУмолчанию, "Служебный");
	Возврат ТекстЗапроса; 
КонецФункции

&НаКлиенте
Процедура СтруктураФайлаXMLВходящиеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Корень = Элемент.ТекущиеДанные;
	Пока НЕ Корень.ПолучитьРодителя()	= Неопределено Цикл
		Корень = Корень.ПолучитьРодителя();
	КонецЦикла;

	// Запрещаем добавление строк для входящих ORDER и RECADV, а также при отсутствующем типе транзакции.
	Отказ = Корень.ТипТранзакции = "Входящий ORDER" ИЛИ Корень.ТипТранзакции = "Входящий RECADV"
	ИЛИ ПустаяСтрока(Корень.ТипТранзакции);	

КонецПроцедуры

&НаКлиенте
Процедура ТочкиДоставкиДобавить(Команда)
	ОткрытьФорму(ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаТочкиДоставки", ,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СтруктураФайлаXMLИсходящиеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Элементы.СтруктураФайлаXMLИсходящие.ТекущиеДанные = Неопределено
		ИЛИ НЕ Элемент.ТекущийЭлемент.Вид = ВидПоляФормы.ПолеВвода Тогда
		Возврат;
	КонецЕсли;
	
	ПолеВвода 				 = Элемент.ТекущийЭлемент;
	Родитель 				 = Элементы.СтруктураФайлаXMLИсходящие.ТекущиеДанные.ПолучитьРодителя();
	Строки 					 = Элементы.СтруктураФайлаXMLИсходящие.ТекущиеДанные.ПолучитьЭлементы();
	СписокВыбора 			 = Новый Массив;
	ПолеВвода.ТолькоПросмотр = Истина;
	ПолеВвода.СписокВыбора.Очистить();
	
	// Определение направления транзакции.
	Корень = Элементы.СтруктураФайлаXMLИсходящие.ТекущиеДанные;
	Пока НЕ Корень.ПолучитьРодителя()	= Неопределено Цикл
		Корень = Корень.ПолучитьРодителя();
	КонецЦикла;
	
	ЭКОМ_ОбменСеть      = НастройкаПрочитатьОбщийМодуль("ЭКОМ_ОбменСеть"     , Истина);
    ЭКОМ_ОбменПоставщик = НастройкаПрочитатьОбщийМодуль("ЭКОМ_ОбменПоставщик", Истина);
	ЭКОМ_ОбменЭТРН      = НастройкаПрочитатьОбщийМодуль("ЭКОМ_ОбменЭТРН"     , Истина);

	Если Элемент.ТекущийЭлемент.Имя = "СтруктураФайлаXMLИсходящиеТипТранзакции" И Родитель = Неопределено Тогда
		
		СписокВыбора 	= Вычислить("ЭКОМ_ОбщегоНазначения.ДокументыСписокВыбораПолучить(""ТипТразакций"")");
				
		ПолеВвода.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
		ПолеВвода.ТолькоПросмотр = Ложь;
		
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "СтруктураФайлаXMLИсходящиеИсточник"
			И Родитель = Неопределено Тогда
			
			ДанныеПоКолонкам = Вычислить("ЭКОМ_ОбщегоНазначения.ПолучитьДанныеПоКолонкамИсточника()");
			Для каждого Данные Из ДанныеПоКолонкам Цикл
				СписокВыбора.Добавить(Данные.Ключ);
			КонецЦикла;
		
			ПолеВвода.ТолькоПросмотр = Ложь;
			
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "СтруктураФайлаXMLИсходящиеПриемник" Тогда

			ПолеВвода.РежимВыбораИзСписка 		= Ложь;
			ПолеВвода.РедактированиеТекста 		= Истина;
			ПолеВвода.ТолькоПросмотр = Ложь;
	
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "СтруктураФайлаXMLИсходящиеДанные" Тогда
		
		Если Строки.Количество() = 0 Тогда // Только выбор из списка.
			ПолеВвода.РежимВыбораИзСписка 		= Истина;
			ПолеВвода.КнопкаОчистки 			= Истина;
			ПолеВвода.КнопкаОткрытия			= Ложь;
			ПолеВвода.РедактированиеТекста 		= Ложь;
			
			СписокВыбора = ПолучитьКоллекциюДоступныхРеквизитов(Элементы.СтруктураФайлаXMLИсходящие.ТекущиеДанные).ВыгрузитьЗначения();
			
			ПолеВвода.ТолькоПросмотр = Ложь;
		Иначе // Позволяем писать код.
			ПолеВвода.РежимВыбораИзСписка 		= Ложь;
			ПолеВвода.КнопкаОчистки 			= Ложь;
			ПолеВвода.КнопкаОткрытия			= Истина;
			ПолеВвода.РедактированиеТекста 		= Ложь; // Не позволяем писать текст. Код редактируется только в окне конструктора, чтобы была возможность его выполнить.
			ПолеВвода.ТолькоПросмотр = Ложь;
		КонецЕсли;
		
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "СтруктураФайлаXMLИсходящиеКнопка" Тогда
		ПолеВвода.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	Для каждого Эл Из СписокВыбора Цикл
	    ПолеВвода.СписокВыбора.Добавить(Эл);
	КонецЦикла;
		
	// Установка высоты списка.
	Если ПолеВвода.Вид = ВидПоляФормы.ПолеВвода Тогда		
		ВысотаСписка = ?(ПолеВвода.СписокВыбора.Количество() > 20, 20, ПолеВвода.СписокВыбора.Количество());	
		Если НЕ ПолеВвода.ВысотаСпискаВыбора = ВысотаСписка Тогда
			ПолеВвода.ВысотаСпискаВыбора = ВысотаСписка;
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыДобавить(Команда)
	ОткрытьФорму(ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаКонтрагента", ,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКонтрагентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Контрагент"                , Элемент.ТекущиеДанные.Контрагент);
	Отбор.Вставить("Номенклатура"              , Элемент.ТекущиеДанные.Номенклатура);
	Отбор.Вставить("ХарактеристикаНоменклатуры", Элемент.ТекущиеДанные.Характеристика);

	Структура = Новый Структура("Ключ", ПолучитьКлючЭКОМ_НоменклатураКонтрагентов(Отбор));
	
	ОткрытьФорму("РегистрСведений.ЭКОМ_НоменклатураКонтрагентов.ФормаЗаписи", Структура, ,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервере
Функция ПолучитьКлючЭКОМ_НоменклатураКонтрагентов(Отбор)
	
	Рег = РегистрыСведений.ЭКОМ_НоменклатураКонтрагентов;
	КлючЗаписи = Рег.СоздатьКлючЗаписи(Отбор);
	
	Возврат КлючЗаписи;
	
КонецФункции

&НаСервере
Процедура УдалитьИзРегистраНаСервереЭКОМ_ЗначениеДополнительныхКонстант(ДопПараметры)
	
	МЗ = РегистрыСведений.ЭКОМ_ЗначениеДополнительныхКонстант.СоздатьМенеджерЗаписи();
	МЗ.ДополнительнаяКонстанта = ДопПараметры.ДополнительнаяКонстанта;
	МЗ.Измерение               = ДопПараметры.Измерение;
	МЗ.Прочитать();
	Если МЗ.Выбран() Тогда	
		МЗ.Удалить();
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСоответсвийУдалитьИзРегистра(Команда)
	
	Для каждого текВыделеннаяСтрока Из Элементы.СписокСоответствий.ВыделенныеСтроки Цикл
		ВыбраннаяСтрока = Элементы.СписокСоответствий.ДанныеСтроки(текВыделеннаяСтрока);
			
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ДополнительнаяКонстанта", ВыбраннаяСтрока.Реквизит);
		ДопПараметры.Вставить("Измерение"              , ВыбраннаяСтрока.Тип);
		
		УдалитьИзРегистраНаСервереЭКОМ_ЗначениеДополнительныхКонстант(ДопПараметры);
		
	КонецЦикла;
		
	Элементы.СписокСоответствий.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораВидамиДокументов1С(Элемент, СписокДоступныхДокументов = Неопределено)
    
    Если СписокДоступныхДокументов = Неопределено Тогда
        ИсточникДанных = ЭтаФорма.СлужебныйДеревоКонфигурации.ПолучитьЭлементы();
    Иначе
        ИсточникДанных = СписокДоступныхДокументов;
    КонецЕсли;
    
    ТипИсточникаДанныхСписокЗначений = (ТипЗнч(ИсточникДанных) = Тип("СписокЗначений"));
    
	Если Элемент.СписокВыбора.Количество() = 0 Тогда
        Для Каждого ЭлементИсточникаДанных Из ИсточникДанных Цикл
            Если ТипИсточникаДанныхСписокЗначений Тогда
                Элемент.СписокВыбора.Добавить(ЭлементИсточникаДанных.Значение, ЭлементИсточникаДанных.Представление);
            Иначе
                Элемент.СписокВыбора.Добавить(ЭлементИсточникаДанных.Имя, ЭлементИсточникаДанных.Синоним);
            КонецЕсли;
		КонецЦикла;
	КонецЕсли;
    
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиИзРегистра()

	Настройки 	= Новый Структура;
	
	НаборЗаписей = РегистрыСведений.ЭКОМ_ЗначениеДополнительныхКонстант.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Счетчик 	= 0;
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Если ПустаяСтрока(Запись.ДополнительнаяКонстанта) 
			 ИЛИ Запись.ДополнительнаяКонстанта = "ЭКОМ_ПарольПользователяFTP"
			 ИЛИ Запись.ДополнительнаяКонстанта = "ЭКОМ_ПарольПользователяПортал" Тогда
			Продолжить;
		КонецЕсли;
		
		Настройки.Вставить("Запись_" + Формат(Счетчик, "ЧГ=0"), Новый Структура("ДополнительнаяКонстанта, Измерение, ЗначениеДополнительнойКонстанты, ЗначениеДополнительногоХранилища",
		Запись.ДополнительнаяКонстанта, Запись.Измерение, Запись.ЗначениеДополнительнойКонстанты, Запись.ЗначениеДополнительногоХранилища));
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	Возврат Новый ХранилищеЗначения(Настройки);

КонецФункции

&НаКлиенте
Процедура ХранениеДанныхСохранитьВсеНастройки(Команда)
	
	Элементы.ГруппаСтруктураСохранения.Видимость = Истина;
	ЭтаФорма.РС_ЭКОМ_ЗначениеДополнительныхКонстант = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ХранениеДанныхВосстановитьВсеНастройки(Команда)
	
	ОбработкаОкончанияПомещения = Новый ОписаниеОповещения("ОповещениеЗагрузитьНастройкиИзРегистров", ЭтаФорма);
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Фильтр             = "Файл настроек XML (*.xml)|*.xml|Таблица значений 1С (*.1ct)|*.1ct"; 
	ДиалогОткрытияФайла.ИндексФильтра      = 0; 
	НачатьПомещениеФайлов(ОбработкаОкончанияПомещения, , ДиалогОткрытияФайла, Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеЗагрузитьНастройкиИзРегистров(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
        Возврат;
    КонецЕсли;    
	
	Если ВыбранныеФайлы.Количество() = 1 Тогда			
		
		АдресВоВременомХранилище = ВыбранныеФайлы[0].Хранение;
		ПутьКФайлу = ВыбранныеФайлы[0].Имя;
							
		ЗагрузитьНастройкиИзРегистра(ПутьКФайлу, АдресВоВременомХранилище);
			
		Состояние("Настройки загружены");
	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиИзРегистра(ПутьКФайлу, АдресВоВременномХранилище = Неопределено)

	ИмяСобытия = "Загрузка настроек из регистр";
	МассивЛогаСобытий = Новый Массив;
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	РасширениеФайлаНастроек = НРег(Прав(ПутьКФайлу, 4));
	
	Если АдресВоВременномХранилище <> Неопределено Тогда
		ДвоичныеДанныеИзВременногоХранилища = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
		ИмяФайлаНаСервере = ПолучитьИмяВременногоФайла(РасширениеФайлаНастроек);
		ДвоичныеДанныеИзВременногоХранилища.Записать(ИмяФайлаНаСервере);
	Иначе
		ИмяФайлаНаСервере = ПутьКФайлу;
	КонецЕсли;
	
	Файл = Новый Файл(ПутьКФайлу);
	Загружены = Ложь;
	Если РасширениеФайлаНастроек = ".1ct" Тогда // Старый формат

		ФайлНастроек = Новый ТекстовыйДокумент;
		ФайлНастроек.Прочитать(ИмяФайлаНаСервере);
		Настройки = XMLЗначение(Тип("ХранилищеЗначения"), ФайлНастроек.ПолучитьТекст()).Получить();
		
		Для Каждого Настройка Из Настройки Цикл
			
			МенеджерЗаписи = РегистрыСведений.ЭКОМ_ЗначениеДополнительныхКонстант.СоздатьМенеджерЗаписи();
			Для Каждого Эл Из Настройка.Значение Цикл
				МенеджерЗаписи[Эл.Ключ] = Эл.Значение;
			КонецЦикла;
			МенеджерЗаписи.Записать(Истина);
			
		КонецЦикла;
		
		Загружены = Истина;
	ИначеЕсли РасширениеФайлаНастроек = ".xml" Тогда // Новый формат
		АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайлаНаСервере), Новый УникальныйИдентификатор);
	    Загружены = ОбработкаОбъект.ЗагрузитьНастройки(АдресВоВременномХранилище, МассивЛогаСобытий);
	Иначе
		ТекстЛогаСобытий = "Формат [" + РасширениеФайлаНастроек + "] не поддерживается!";	
		ЗаписьСтруктурыЛога = Вычислить("ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Предупреждение, ИмяСобытия)");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
	КонецЕсли;
	
	Сообщение = Новый СообщениеПользователю;
	
	Если Загружены Тогда
		ПараметрыФункции = Новый Массив;
		ПараметрыФункции.Добавить(Ложь);
		ПараметрыФункции.Добавить(МассивЛогаСобытий);
		БекапНастроек = ВернутьРезультатИзМодуляОбъекта("ИзменитьФорматПользовательскихНастроек", ПараметрыФункции);
		
		// Обновим загруженные настройки
    	ПриСозданииНаСервере(Ложь, Истина);
		
		Сообщение.Текст = "Настройки загружены";
		
	Иначе
		Сообщение.Текст = "Настройки не загружены. Причину смотрите в логе событий.";
	КонецЕсли;
	
	Сообщение.Сообщить();
	
	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Попытка
			Выполнить("ЭКОМ_ОбщегоНазначения.ЗаписатьЛогСобытийвРегистрЛогирование(МассивЛогаСобытий);");
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Вычислить("ЭКОМ_ОбщегоНазначения.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий)");
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОбновлениеНаКлиенте(Команда)
	
	ЗаполнитьТаблицуОбновлений();
	
КонецПроцедуры

Процедура СохранитьФайлИзХранилища(ДанныеФайла, Знач ТипФайла = Неопределено)
    
    Если ТипФайла = Неопределено Тогда
    	СохранитьФайлИзХранилища(ДанныеФайла, "ФайлОбновления");
		//СохранитьФайлИзХранилища(ДанныеФайла, "ФайлОписания");
		//СохранитьФайлИзХранилища(ДанныеФайла, "ФайлКонфигурации");
        Возврат; //все файлы сохранены
    КонецЕсли;
    
    //когда указан конкретный тип файла тогда и сохраняю (при рекурсивных вызовах или при сохранении отдельных файлов)
    Если ДанныеФайла["ОшибкаЗаписи" + ТипФайла] = Истина Тогда
        Если ДанныеФайла["ОшибкаЗаписи" + ТипФайла] = Истина Тогда
            Адрес = ДанныеФайла["АдресВоВременномХранилище" + ТипФайла];
            ДДФ = ПолучитьИзВременногоХранилища(Адрес);
            Попытка
            	ДДФ.Записать(ДанныеФайла[ТипФайла]);
            Исключение
                Ошибка = ОписаниеОшибки();
                Сообщить(Ошибка);
            КонецПопытки;
        КонецЕсли;
    КонецЕсли;
  		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуОбновлений()

	ЭтаФорма.СписокОбновлений.Очистить();
	
	МассивЛогаСобытий = Новый Массив;
	
	ЗначениеПоУмолчанию = Неопределено;
	Измерение           = Неопределено; 
	Обязательно         = Истина;
	ЛокальныйКаталогUPDATE = НастройкаПрочитатьОбщийМодуль("ЭКОМ_Локальный_Каталог_UPDATE", ЗначениеПоУмолчанию, Измерение, Обязательно);
	
	ПараметрыФункции = Новый Массив;
	ПараметрыФункции.Добавить(Истина);
	ПараметрыФункции.Добавить(МассивЛогаСобытий);
	
	СтруктураРезультата = ВернутьРезультатИзМодуляОбъекта("ПроверитьОбновление", ПараметрыФункции);	
	Если СтруктураРезультата.ОбновлениеЗагружено = Истина Тогда
		 ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(СтруктураРезультата.ДанныеОбработки.АдресВоВременномХранилище);
		 ФормаОбновлений     = ПолучитьФорму(ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаОбновления");
	     ФормаОбновлений.СохранитьОбновленияНаДиск(ДвоичныеДанныеФайла, СтруктураРезультата.ДанныеОбработки.ФайлОбновленияИмя, ЛокальныйКаталогUPDATE, МассивЛогаСобытий);
	КонецЕсли;
    
	Если СтруктураРезультата.НеобходимоОбновление Тогда
         ТекстСообщения = "Доступна новая версия - " + СтруктураРезультата.ДанныеОбработки.ВерсияМодуля;
		 //СохранитьФайлИзХранилища(СтруктураВозврата.ДанныеОбработки);
     Иначе
         ТекстСообщения = "Новая версия отсутствует.";
	КонецЕсли;
	
	ЗаполнитьИсториюТаблицыОбновлений();

    Элементы.ИнфоОбновления.Заголовок = ТекстСообщения;

КонецПроцедуры
&НаСервере
Процедура ЗаполнитьИсториюТаблицыОбновлений()

	ЭтаФорма.СписокОбновлений.Очистить();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	// Получим список установленных обновлений
	Запрос = Новый Запрос;
	Запрос.Текст = ОбработкаОбъект.ЗапросДляТаблицыОбновлений();
			
	РезультатЗапроса = Запрос.Выполнить();	
	
	Н = 1;
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НовСтр = ЭтаФорма.СписокОбновлений.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
            НовСтр.НомерСтроки = Н;

			Н = Н + 1;
			
		КонецЦикла;	
    КонецЕсли;
    
    ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДоступностьApiПоСтранеНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ДоступностьAPI = ОбработкаОбъект.ПолучитьДоступностьApiПоСтране();
	Возврат ДоступностьAPI;
КонецФункции

&НаКлиенте
Процедура СписокОбновленийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда	
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВерсияМодуля"   , Элемент.ТекущиеДанные.ВерсияМодуля);	
		ПараметрыФормы.Вставить("ДатаОбработки"  , Элемент.ТекущиеДанные.ДатаОбработки);	
        ПараметрыФормы.Вставить("Описание"       , Элемент.ТекущиеДанные.Описание);	
		ПараметрыФормы.Вставить("СтатусОбработки", Элемент.ТекущиеДанные.СтатусОбработки);	
		ПараметрыФормы.Вставить("ЭКОМОбъектыАктуальны", ЭтаФорма.ЭКОМОбъектыАктуальны);	
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ИмяФормы", "УФ_ФормаОбновления");
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);	
		ОткрытьФорму(ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаОбновления", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник) Экспорт
	
	Если ИмяСобытия = "ОбновленПрофильОбмена" Тогда 
		ДоступностьAPI = ПолучитьДоступностьApiПоСтранеНаСервере();
		Элементы.КомандаДанныеКонтрагентаПоAPI.Видимость = ДоступностьAPI;	
	КонецЕсли;
	
	ФормаДляОповещения = Неопределено;
	Если ТипЗнч(Параметр) = Тип("Структура") Тогда
	     Параметр.Свойство("ФормаДляОповещения", ФормаДляОповещения);
	КонецЕсли;
	
	Если ФормаДляОповещения = "Обработка.УФ_ФормаНастройкиОсновные" Тогда
		
		Если ИмяСобытия = "ОбработкаЗакрытия" Тогда
			ОбработкаЗакрытия(Параметр, Параметр.ДопПараметры);
			
		ИначеЕсли ИмяСобытия = "ЭКОМ_КонецПроверкиФормулыНаФорме" Тогда
			ПроверкаКодаНаФормеАРМЗавершение(Параметр);
		КонецЕсли;
	
	КонецЕсли;
      
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	СохранитьИзмененныеНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_ИспПарольДляНастроекПриИзменении(Элемент)
	
	Если ЭтаФорма.ЭКОМ_ИспПарольДляНастроек Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("УстановитьПароль", Истина);
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ИмяФормы", "УФ_ФормаВводаПароля");
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);	
		ОткрытьФорму(ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаВводаПароля", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;	

	ПараметрыФункции = Новый Массив;
	ПараметрыФункции.Добавить("ЭКОМ_ИспПарольДляНастроек");
	ПараметрыФункции.Добавить(ЭтаФорма.ЭКОМ_ИспПарольДляНастроек);
	ПараметрыФункции.Добавить(Неопределено);
	ВернутьРезультатИзМодуляОбъекта("Настройка_Параметр_Записать", ПараметрыФункции);
		
КонецПроцедуры


&НаКлиенте
Процедура КомандаЗаполнитьПодчиненныеВходящие(Команда)
	
	Если Элементы.ГруппаНастройкиДокументовСтраницы.ТекущаяСтраница.Имя = "ГруппаДокументы1С" Тогда
		ЗаполнитьПодчиненныеСтрокиСтруктурыФайлаXML("СтруктураФайлаXMLВходящие");
	ИначеЕсли Элементы.ГруппаНастройкиДокументовСтраницы.ТекущаяСтраница.Имя = "ГруппаДокументы" Тогда
		ЗаполнитьПодчиненныеСтрокиСтруктурыФайлаXML("СтруктураФайлаXMLДокументы");
	КонецЕсли;
	
КонецПроцедуры

//Описание универсальная процедура заполнения подчиненных строк дерева гибких настроек
&НаКлиенте
Процедура ЗаполнитьПодчиненныеСтрокиСтруктурыФайлаXML(ИмяЭлементаФормы_СтруктураФайлаXML = "СтруктураФайлаXMLВходящие")
	
    ТекущиеДанные  = Элементы[ИмяЭлементаФормы_СтруктураФайлаXML].ТекущиеДанные;	
	Пока НЕ ТекущиеДанные.ПолучитьРодителя() = Неопределено Цикл
 		 ТекущиеДанные = ТекущиеДанные.ПолучитьРодителя();
	КонецЦикла;
	
	Данные = Новый Структура;	
	Данные.Вставить("ТипТранзакции", ТекущиеДанные.ТипТранзакции);
	Данные.Вставить("Процедура"    , "ЗаполнитьПодчиненныеСтрокиСтруктурыФайлаXML");
	
	Если НЕ ТекущиеДанные.ПолучитьЭлементы().Количество() = 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ОповещениеПослеОтветаНаВопрос", ЭтаФорма, Данные); 
		ПоказатьВопрос(Оповещение, "Подчиненные строки будут удалены. 
        |Продолжить?", РежимДиалогаВопрос.ДаНет, 0);	
		
	Иначе
		
		ЗаполнитьДеревоПоДокументу1С(Данные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПослеОтветаНаВопрос(Результат, Данные) Экспорт 
	
	Если Данные.Процедура =  "ЗаполнитьПодчиненныеСтрокиСтруктурыФайлаXML" 
		И Результат = КодВозвратаДиалога.Да Тогда
	
		ЗаполнитьДеревоПоДокументу1С(Данные);
		
	ИначеЕсли Данные.Процедура =  "ПередЗакрытием" 
		И Результат = КодВозвратаДиалога.Да Тогда
            СохранитьИзмененныеНастройки(Истина);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПодчиненныеИсходящие(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаДанныеКонтрагентаПоAPI(Команда)	
	
	МассивЛогаСобытий = Новый Массив;

	Массив_GLN = Новый Массив;
	ВыделенныеСтроки = Элементы.СписокТочекДоставок.ВыделенныеСтроки;
	Для Каждого ТекущаяСтрока Из ВыделенныеСтроки Цикл
		Массив_GLN.Добавить(Элементы.СписокТочекДоставок.ДанныеСтроки(ТекущаяСтрока));
	КонецЦикла;
	КомандаДанныеКонтрагентаПоAPIНаСервере(Массив_GLN, МассивЛогаСобытий);
	Элементы.СписокТочекДоставок.Обновить();
	
	Если МассивЛогаСобытий.Количество() > 0 Тогда
		Попытка
			Выполнить("ЭКОМ_ОбщегоНазначения.ЗаписатьЛогСобытийвРегистрЛогирование(МассивЛогаСобытий);");
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Вычислить("ЭКОМ_ОбщегоНазначения.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий)");
			Сообщение.Сообщить();
		КонецПопытки;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КомандаДанныеКонтрагентаПоAPIНаСервере(ВыделенныеСтроки, МассивЛогаСобытий)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Для Каждого ТекущаяСтрока Из ВыделенныеСтроки Цикл 
		МЗ = РегистрыСведений.ЭКОМ_ТочкиДоставки.СоздатьМенеджерЗаписи();
		МЗ.Объект = ТекущаяСтрока.ТочкаДоставки;
		МЗ.Прочитать();
		
		Данные = ОбработкаОбъект.ДанныеКонтрагентаПоAPI(МЗ.GLN, МассивЛогаСобытий);
		Если ТипЗнч(Данные) = Тип("Массив") Тогда
			Адрес  = "";	
			Индекс = "";
			Индекс = Данные[0].Индекс;
			Если ЗначениеЗаполнено(Индекс) Тогда
				МЗ.Адр_Индекс = Индекс;
				Адрес = Индекс + ", ";
			КонецЕсли;
			
			КодРегион  = "";
			КодРегион = Данные[0].Регион;
			Если ЗначениеЗаполнено(КодРегион) Тогда
				МЗ.Адр_КодРегиона = КодРегион;
				Адрес = Адрес + КодРегион + ", ";
			КонецЕсли;
			
			Район  = "";
			Район = Данные[0].Район;
			Если ЗначениеЗаполнено(Район) Тогда
				МЗ.Адр_Район = Район;
				Адрес = Адрес + Район + ", ";
			КонецЕсли;
			
			Город  = "";
			Город = Данные[0].Город;
			Если ЗначениеЗаполнено(Город) Тогда
				МЗ.Адр_Город = Город;
				Адрес = Адрес + Город + ", ";
			КонецЕсли;
			
			Население  = "";
			Население = Данные[0].Население;
			Если ЗначениеЗаполнено(Население) Тогда
				МЗ.Адр_НаселПункт = Население;
				Адрес = Адрес + Население + ", ";
			КонецЕсли;
			
			Улица  = "";
			Улица = Данные[0].Улица;
			Если ЗначениеЗаполнено(Улица) Тогда
				МЗ.Адр_Улица = Улица;
				Адрес = Адрес + Улица + ", ";
			КонецЕсли;
			
			НомерДома  = "";
			НомерДома = Данные[0].НомерДома;
			Если ЗначениеЗаполнено(НомерДома) Тогда
				МЗ.Адр_Дом = НомерДома;
				Адрес = Адрес + НомерДома + ", ";
			КонецЕсли;
			
			Корпус  = "";
			Корпус = Данные[0].Корпус;
			Если ЗначениеЗаполнено(Корпус) Тогда
				МЗ.Адр_Корпус = Корпус;
				Адрес = Адрес + Корпус + ", ";
			КонецЕсли;
			
			Квартира  = "";
			Квартира = Данные[0].Квартира;
			Если ЗначениеЗаполнено(Квартира) Тогда
				МЗ.Адр_Кварт = Квартира;
				Адрес = Адрес + Квартира + ", ";
			КонецЕсли;
			
			МЗ.ИНН = Данные[0].ИНН;
			МЗ.КПП = Данные[0].КПП;
			МЗ.Наименование = Данные[0].Наименование;
			МЗ.Адрес = Адрес;
			МЗ.Записать();
			
			СсылкаОбъект = ТекущаяСтрока.ТочкаДоставки.ПолучитьОбъект();
			Если НЕ ТекущаяСтрока.ТочкаДоставки.Метаданные().Реквизиты.Найти("ИНН")= Неопределено Тогда
				СсылкаОбъект.ИНН = Данные[0].ИНН;		
			КонецЕсли;
			
			Если НЕ ТекущаяСтрока.ТочкаДоставки.Метаданные().Реквизиты.Найти("КПП") = Неопределено Тогда
				СсылкаОбъект.КПП = Данные[0].КПП;		
			КонецЕсли;
			
			СсылкаОбъект.Записать();
			
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаПродолжитьВыгрузку(Команда)
					
	Массив = Новый Массив;
	
	Структура = Новый Структура;
	Структура.Вставить("ЭКОМ_ЗначениеДополнительныхКонстант", ЭтаФорма.РС_ЭКОМ_ЗначениеДополнительныхКонстант);
	Структура.Вставить("ЭКОМ_GLN"                           , ЭтаФорма.РС_ЭКОМ_ЭКОМ_GLN);
	Структура.Вставить("ЭКОМ_ТочкиДоставки"                 , ЭтаФорма.РС_ЭКОМ_ТочкиДоставки);
	Структура.Вставить("ЭКОМ_НоменклатураКонтрагентов"      , ЭтаФорма.РС_ЭКОМ_НоменклатураКонтрагентов);

	МассивЛогаСобытий = Новый Массив;
	АдресВоВременномХранилище = ВыгрузкаНаСервере(Структура, Массив, МассивЛогаСобытий);	
	ИмяСохранения = "Настройки из регистров";
	
	СохранениеФайла(АдресВоВременномХранилище, ИмяСохранения);
	
	Элементы.ГруппаСтруктураСохранения.Видимость = Ложь;
	
	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Попытка
			Выполнить("ЭКОМ_ОбщегоНазначения.ЗаписатьЛогСобытийвРегистрЛогирование(МассивЛогаСобытий);");
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Вычислить("ЭКОМ_ОбщегоНазначения.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий)");
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранениеФайла(АдресВоВременномХранилище, ИмяСохранения)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	// создаем на клиенте текстовый файл
	ИмяВременногоФайлаXML = ПолучитьИмяВременногоФайла("xml");
	
    Если ДвоичныеДанные = Неопределено Тогда
        ПоказатьПредупреждение(Новый ОписаниеОповещения, "Не удалось получить данные настроек из временного хранилища", , "Сохранение в файл");
        Возврат;
    КонецЕсли;
	// создаем диалог сохранения файла
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогОткрытияФайла.Заголовок          = "Сохраните файл";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Расширение         = "xml";
    ДиалогОткрытияФайла.Фильтр             = "Настройка по документу(*.xml)|*.xml";
	ДиалогОткрытияФайла.ИндексФильтра      = 0; //укажем фильтр по умолчанию (нумерация с нуля)
	
	ДиалогОткрытияФайла.ПолноеИмяФайла = ИмяСохранения + ".xml";;
	
	ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("ЗавершениеДиалогаВыбораФайлаСохранение", ЭтаФорма, ДвоичныеДанные));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеДиалогаВыбораФайлаСохранение(ВыбранныеФайлы, ДвоичныеДанные) Экспорт
    
    Если ВыбранныеФайлы = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ВсегоФайлов = ВыбранныеФайлы.Количество();
    Прогресс = 0;
    ТекущийНомерФайла = 0;
	Если ВыбранныеФайлы <> Неопределено Или ТипЗнч(ВыбранныеФайлы) = Тип("Массив") Тогда
        Для каждого ИмяФайла Из ВыбранныеФайлы Цикл
            ТекущийНомерФайла = ТекущийНомерФайла + 1;
            Попытка
                Прогресс = Окр(ТекущийНомерФайла * 100 / ВсегоФайлов, 0);
                ДвоичныеДанные.Записать(ИмяФайла);
            Исключение
                Сообщить("Ошибка записи в файл [" + "] " + ИмяФайла);
            КонецПопытки;
            Состояние("Сохранено в " + ИмяФайла, Прогресс,, БиблиотекаКартинок.ЭКОМ_Информация);		
        КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗапросНаАвтоОбменПоставщикORDRSPИсходящий(Команда)
		
	ПараметрыФункции = Новый Массив;
	ПараметрыФункции.Добавить("ЗапросНаАвтоОбменПоставщикORDRSPИсходящий");		
	ПараметрыФункции.Добавить("");
    ПараметрыФункции.Добавить("Служебный");
	ПараметрыФункции.Добавить(Ложь);
	
	ТекстЗапроса = ВернутьРезультатИзМодуляОбъекта("Настройка_Параметр_Прочитать", ПараметрыФункции);
			
	ИмяОткрываемойФормы = ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаКонсольЗапросов";
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяФормы"         , "УФ_ФормаКонсольЗапросов");
	ДопПараметры.Вставить("ИмяЭлементаФормы" , "АвтоОбмен");
	ДопПараметры.Вставить("ИмяЗапроса"       , "_ЗапросНаАвтоОбменПоставщикORDRSPИсходящий");

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок"            , "Введите запрос на получение документов для отправки ORDRSP регламентным заданием");
	ПараметрыФормы.Вставить("ТекстНачальный"       , ТекстЗапроса);  
    ПараметрыФормы.Вставить("ДопПараметры"         , ДопПараметры);
    
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы,,,,,ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗапросНаАвтоОбменПоставщикDESADVИсходящий(Команда)
	
	ПараметрыФункции = Новый Массив;
	ПараметрыФункции.Добавить("ЗапросНаАвтоОбменПоставщикDESADVИсходящий");		
	ПараметрыФункции.Добавить("");
    ПараметрыФункции.Добавить("Служебный");
	ПараметрыФункции.Добавить(Ложь);
	
	ТекстЗапроса = ВернутьРезультатИзМодуляОбъекта("Настройка_Параметр_Прочитать", ПараметрыФункции);
			
	ИмяОткрываемойФормы = ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаКонсольЗапросов";
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяФормы"         , "УФ_ФормаКонсольЗапросов");
	ДопПараметры.Вставить("ИмяЭлементаФормы" , "АвтоОбмен");
	ДопПараметры.Вставить("ИмяЗапроса"       , "_ЗапросНаАвтоОбменПоставщикDESADVИсходящий");

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок"            , "Введите запрос на получение документов для отправки DESADV регламентным заданием");
	ПараметрыФормы.Вставить("ТекстНачальный"       , ТекстЗапроса);  
    ПараметрыФормы.Вставить("ДопПараметры"         , ДопПараметры);
    
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы,,,,,ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗапросНаАвтоОбменПоставщикИсходящийЮЗД(Команда)
	
    ПараметрыФункции = Новый Массив;
	ПараметрыФункции.Добавить("ЗапросНаАвтоОбменПоставщикЮЗДИсходящий");		
	ПараметрыФункции.Добавить("");
    ПараметрыФункции.Добавить("Служебный");
	ПараметрыФункции.Добавить(Ложь);
	
	ТекстЗапроса = ВернутьРезультатИзМодуляОбъекта("Настройка_Параметр_Прочитать", ПараметрыФункции);
			
	ИмяОткрываемойФормы = ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаКонсольЗапросов";
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяФормы"         , "УФ_ФормаКонсольЗапросов");
	ДопПараметры.Вставить("ИмяЭлементаФормы" , "АвтоОбмен");
	ДопПараметры.Вставить("ИмяЗапроса"       , "_ЗапросНаАвтоОбменПоставщикЮЗДИсходящий");

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок"            , "Введите запрос на получение документов для отправки ЮЗД регламентным заданием");
	ПараметрыФормы.Вставить("ТекстНачальный"       , ТекстЗапроса);  
    ПараметрыФормы.Вставить("ДопПараметры"         , ДопПараметры);
    
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы,,,,,ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗапросНаАвтоОбменПоставщикINVOICEИсходящий(Команда)
	
	ПараметрыФункции = Новый Массив;
	ПараметрыФункции.Добавить("ЗапросНаАвтоОбменПоставщикINVOICEИсходящий");		
	ПараметрыФункции.Добавить("");
    ПараметрыФункции.Добавить("Служебный");
	ПараметрыФункции.Добавить(Ложь);
	
	ТекстЗапроса = ВернутьРезультатИзМодуляОбъекта("Настройка_Параметр_Прочитать", ПараметрыФункции);
			
	ИмяОткрываемойФормы = ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаКонсольЗапросов";
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяФормы"         , "УФ_ФормаКонсольЗапросов");
	ДопПараметры.Вставить("ИмяЭлементаФормы" , "АвтоОбмен");
	ДопПараметры.Вставить("ИмяЗапроса"       , "_ЗапросНаАвтоОбменПоставщикINVOICEИсходящий");

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок"            , "Введите запрос на получение документов для отправки INVOICE регламентным заданием");
	ПараметрыФормы.Вставить("ТекстНачальный"       , ТекстЗапроса);  
    ПараметрыФормы.Вставить("ДопПараметры"         , ДопПараметры);
    
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы,,,,,ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗапросНаАвтоОбменПоставщикDESSCCИсходящий(Команда)
	
	ПараметрыФункции = Новый Массив;
	ПараметрыФункции.Добавить("ЗапросНаАвтоОбменПоставщикDESSCCИсходящий");		
	ПараметрыФункции.Добавить("");
    ПараметрыФункции.Добавить("Служебный");
	ПараметрыФункции.Добавить(Ложь);
	
	ТекстЗапроса = ВернутьРезультатИзМодуляОбъекта("Настройка_Параметр_Прочитать", ПараметрыФункции);
			
	ИмяОткрываемойФормы = ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаКонсольЗапросов";
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяФормы"         , "УФ_ФормаКонсольЗапросов");
	ДопПараметры.Вставить("ИмяЭлементаФормы" , "АвтоОбмен");
	ДопПараметры.Вставить("ИмяЗапроса"       , "_ЗапросНаАвтоОбменПоставщикDESSCCИсходящий");

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок"            , "Введите запрос на получение документов для отправки DESSCC регламентным заданием");
	ПараметрыФормы.Вставить("ТекстНачальный"       , ТекстЗапроса);  
    ПараметрыФормы.Вставить("ДопПараметры"         , ДопПараметры);
    
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы,,,,,ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗапросНаАвтоОбменПокупательORDERИсходящий(Команда)
	
    ПараметрыФункции = Новый Массив;
	ПараметрыФункции.Добавить("ЗапросНаАвтоОбменПокупательORDERИсходящий");		
	ПараметрыФункции.Добавить("");
    ПараметрыФункции.Добавить("Служебный");
	ПараметрыФункции.Добавить(Ложь);
	
	ТекстЗапроса = ВернутьРезультатИзМодуляОбъекта("Настройка_Параметр_Прочитать", ПараметрыФункции);
			
	ИмяОткрываемойФормы = ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаКонсольЗапросов";
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяФормы"         , "УФ_ФормаКонсольЗапросов");
	ДопПараметры.Вставить("ИмяЭлементаФормы" , "АвтоОбмен");
	ДопПараметры.Вставить("ИмяЗапроса"       , "_ЗапросНаАвтоОбменПокупательORDERИсходящий");

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок"            , "Введите запрос на получение документов для отправки ORDER регламентным заданием");
	ПараметрыФормы.Вставить("ТекстНачальный"       , ТекстЗапроса);  
    ПараметрыФормы.Вставить("ДопПараметры"         , ДопПараметры);
    
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы,,,,,ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗапросНаАвтоОбменПокупательRECADVИсходящий(Команда)
	
    ПараметрыФункции = Новый Массив;
	ПараметрыФункции.Добавить("ЗапросНаАвтоОбменПокупательRECADVИсходящий");		
	ПараметрыФункции.Добавить("");
    ПараметрыФункции.Добавить("Служебный");
	ПараметрыФункции.Добавить(Ложь);
	
	ТекстЗапроса = ВернутьРезультатИзМодуляОбъекта("Настройка_Параметр_Прочитать", ПараметрыФункции);
			
	ИмяОткрываемойФормы = ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаКонсольЗапросов";
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяФормы"         , "УФ_ФормаКонсольЗапросов");
	ДопПараметры.Вставить("ИмяЭлементаФормы" , "АвтоОбмен");
	ДопПараметры.Вставить("ИмяЗапроса"       , "_ЗапросНаАвтоОбменПокупательRECADVИсходящий");

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок"            , "Введите запрос на получение документов для отправки RECADV регламентным заданием");
	ПараметрыФормы.Вставить("ТекстНачальный"       , ТекстЗапроса);  
    ПараметрыФормы.Вставить("ДопПараметры"         , ДопПараметры);
    
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы,,,,,ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗапросАвтоОбменRETINS_исходящий(Команда)
	
	ПараметрыФункции = Новый Массив;
	ПараметрыФункции.Добавить("ЗапросНаАвтоОбменПоставщикRETINSИсходящий");		
	ПараметрыФункции.Добавить("");
    ПараметрыФункции.Добавить("Служебный");
	ПараметрыФункции.Добавить(Ложь);
	
	ТекстЗапроса = ВернутьРезультатИзМодуляОбъекта("Настройка_Параметр_Прочитать", ПараметрыФункции);
			
	ИмяОткрываемойФормы = ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаКонсольЗапросов";
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяФормы"         , "УФ_ФормаКонсольЗапросов");
	ДопПараметры.Вставить("ИмяЭлементаФормы" , "АвтоОбмен");
	ДопПараметры.Вставить("ИмяЗапроса"       , "_ЗапросНаАвтоОбменПоставщикRETINSИсходящий");

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок"            , "Введите запрос на получение документов для отправки RETINS регламентным заданием");
	ПараметрыФормы.Вставить("ТекстНачальный"       , ТекстЗапроса);  
    ПараметрыФормы.Вставить("ДопПараметры"         , ДопПараметры);
    
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы,,,,,ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаСервере
Функция ОчиститьОбъектыЭКОМПоДатуНаСервере(МассивЛогаСобытий)
    
    ОбъектЭтаОбработка = РеквизитФормыВЗначение("Объект");

	ДанныеОРегистрах = Новый Соответствие;
	ДанныеОРегистрах.Вставить("ОчиститьОбъекты_РегистрСведений_ЭКОМ_ИсторияОбмена"              , ОчиститьОбъекты_РегистрСведений_ЭКОМ_ИсторияОбмена);
	ДанныеОРегистрах.Вставить("ОчиститьОбъекты_РегистрСведений_ЭКОМ_ОбъектыСобытия"             , ОчиститьОбъекты_РегистрСведений_ЭКОМ_ОбъектыСобытия);
	ДанныеОРегистрах.Вставить("ОчиститьОбъекты_РегистрСведений_ЭКОМ_ТранспортнаяИнформация"     , ОчиститьОбъекты_РегистрСведений_ЭКОМ_ТранспортнаяИнформация);
	ДанныеОРегистрах.Вставить("ОчиститьОбъекты_ЭКОМ_Документы"                                  , ОчиститьОбъекты_ЭКОМ_Документы);
	ДанныеОРегистрах.Вставить("ОчиститьОбъекты_РегистрСведений_ЭКОМ_ЦепочкиДокументовПоставщика", ОчиститьОбъекты_РегистрСведений_ЭКОМ_ЦепочкиДокументовПоставщика);
	ДанныеОРегистрах.Вставить("ОчиститьОбъекты_РегистрСведений_ЭКОМ_ЦепочкиДокументовПокупателя", ОчиститьОбъекты_РегистрСведений_ЭКОМ_ЦепочкиДокументовПокупателя);
	ДанныеОРегистрах.Вставить("ОчиститьОбъекты_РегистрСведений_ЭКОМ_ЦепочкиДокументовЭТРН"      , ОчиститьОбъекты_РегистрСведений_ЭКОМ_ЦепочкиДокументовЭТРН);
	ДанныеОРегистрах.Вставить("ОчиститьОбъекты_РегистрСведений_ЭКОМ_Квитанции"                  , ОчиститьОбъекты_РегистрСведений_ЭКОМ_Квитанции);
	ДанныеОРегистрах.Вставить("ОчиститьОбъекты_РегистрСведений_ЭКОМ_ЦепочкиНеструктурированныхДокументов", ОчиститьОбъекты_РегистрСведений_ЭКОМ_ЦепочкиНеструктурированныхДокументов);
	ДанныеОРегистрах.Вставить("ОчиститьОбъекты_РегистрСведений_ЭКОМ_Маркировка"                    , ОчиститьОбъекты_РегистрСведений_ЭКОМ_Маркировка);
	ДанныеОРегистрах.Вставить("ОчиститьОбъекты_РегистрСведений_ЭКОМ_GLN"                           , ОчиститьОбъекты_РегистрСведений_ЭКОМ_GLN);
	ДанныеОРегистрах.Вставить("ОчиститьОбъекты_РегистрСведений_ЭКОМ_ЗначениеДополнительныхКонстант", ОчиститьОбъекты_РегистрСведений_ЭКОМ_ЗначениеДополнительныхКонстант);
	ДанныеОРегистрах.Вставить("ОчиститьОбъекты_РегистрСведений_ЭКОМ_НоменклатураКонтрагентов"      , ОчиститьОбъекты_РегистрСведений_ЭКОМ_НоменклатураКонтрагентов);
	ДанныеОРегистрах.Вставить("ОчиститьОбъекты_РегистрСведений_ЭКОМ_Паллеты"                       , ОчиститьОбъекты_РегистрСведений_ЭКОМ_Паллеты);
	ДанныеОРегистрах.Вставить("ОчиститьОбъекты_РегистрСведений_ЭКОМ_ТочкиДоставки"                 , ОчиститьОбъекты_РегистрСведений_ЭКОМ_ТочкиДоставки);
	ДанныеОРегистрах.Вставить("ОчиститьОбъекты_РегистрСведений_ЭКОМ_Логирование"                 , ОчиститьОбъекты_РегистрСведений_ЭКОМ_Логирование);
	ДанныеОРегистрах.Вставить("ОчиститьОбъекты_РегистрСведений_ЭКОМ_Новости"                 	, ОчиститьОбъекты_РегистрСведений_ЭКОМ_Новости);
	
    ОчисткаУспешна = ОбъектЭтаОбработка.ОчиститьИБ_ОтДанныхЭКОМ(ДанныеОРегистрах, ОчиститьОбъекты_НачДатаОчистки, ОчиститьОбъекты_КонДатаОчистки, МассивЛогаСобытий);
    
    Возврат ОчисткаУспешна;
	
КонецФункции

&НаКлиенте
Процедура ОчиститьОбъектыЭКОМПоДату(Команда)
    Если НЕ ЗначениеЗаполнено(ОчиститьОбъекты_НачДатаОчистки) ИЛИ НЕ ЗначениеЗаполнено(ОчиститьОбъекты_КонДатаОчистки) Тогда
           ПоказатьПредупреждение(Новый ОписаниеОповещения, "Очистка отменена. Не заполнен период очистки." 
                                 ,
                                 , "Очистка ИБ от объектов Docrobot"
                                 );
    	Возврат;
    КонецЕсли;
    
    Если ОчиститьОбъекты_НачДатаОчистки <> НачалоДня(ОчиститьОбъекты_НачДатаОчистки) Тогда
    	ОчиститьОбъекты_НачДатаОчистки = НачалоДня(ОчиститьОбъекты_НачДатаОчистки);
    КонецЕсли;
    
    Если ОчиститьОбъекты_КонДатаОчистки <> КонецДня(ОчиститьОбъекты_КонДатаОчистки) Тогда
    	ОчиститьОбъекты_КонДатаОчистки = КонецДня(ОчиститьОбъекты_КонДатаОчистки);
    КонецЕсли;
    
    ОповещениеВопроса = Новый ОписаниеОповещения("ОчиститьОбъектыЭКОМПоДатуЗавершение", ЭтаФорма);
    ПоказатьВопрос(ОповещениеВопроса, "Вы ДЕЙСТВИТЕЛЬНО хотите очистить данные Docrobot объектов за период " + ПредставлениеПериода(ОчиститьОбъекты_НачДатаОчистки, ОчиститьОбъекты_КонДатаОчистки, "ДФ=дд.ММ.гггг") + "?"
                  , РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет, "Очистка ИБ от данных Docrobot");
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОбъектыЭКОМПоДатуЗавершение(РезультатВопроса, ДопПараметры) Экспорт
	
	МассивЛогаСобытий = Новый Массив;
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОчисткаУспешна = ОчиститьОбъектыЭКОМПоДатуНаСервере(МассивЛогаСобытий);
		
		Если ОчисткаУспешна = Ложь Тогда //ничего не сделано
			ПоказатьПредупреждение( , "Очистка завершена. Найдено и удалено 0 объектов.", , "Очистка ИБ от объектов Docrobot");
			Возврат;
		КонецЕсли;
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстСообщения = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий)");
        ТекстовыйДокумент.УстановитьТекст(ТекстСообщения);
		
		ДанныеОС = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ЭКОМ_ПолучитьРазделительПутиОСКлиента()");
		РазделительПути = ДанныеОС.Получить("РазделительПути");
		
		РабочийКаталог = НастройкаПрочитатьОбщийМодуль("ЭКОМ_Рабочий_Каталог");
		Выполнить("ЭКОМ_ОбщегоНазначенияКлиент.ПроверитьЛокальныйКаталог(РабочийКаталог, РазделительПути)");
		
		Если ЗначениеЗаполнено(РабочийКаталог) Тогда
			
			ПолноеИмяЛога = РабочийКаталог + "Результаты очистки ИБ от данных объектов Docrobot по " + Формат(ОчиститьОбъекты_КонДатаОчистки, "ДФ=дд-ММ-гггг") + ".txt";;		
			ТекстовыйДокумент.Записать(ПолноеИмяЛога, КодировкаТекста.UTF8);
			ТекстовыйДокумент.Показать(ПолноеИмяЛога);
			ПоказатьПредупреждение(Новый ОписаниеОповещения, "Очистка завершена. Подробности выведены в текстовый файл " + Символы.ПС + ПолноеИмяЛога, , "Очистка ИБ от объектов Docrobot");	
		Иначе
			ТекстовыйДокумент.Показать();
			ПоказатьПредупреждение(Новый ОписаниеОповещения, "Не заполнен рабочий каталог. Лог не сохранен.", , "Очистка ИБ от объектов Docrobot");
		КонецЕсли;
		
	Иначе
		ПоказатьПредупреждение(Новый ОписаниеОповещения, "Очистка отменена.", , "Очистка ИБ от объектов Docrobot");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВерсияПлатформыНаКлиенте() Экспорт
	
	// # Пример: 8.3.11.3034 - 83110 (версия по трем позициям) и до 4 знаков 
    // # Пример: 8.3.5.6565  - 8350 (версия по трем позициям) и до 4 знаков 	
	// # Пример: 8.2.19.4342 - 8219 (версия по трем позициям) и до 4 знаков 
    // # Пример: 8.3.10.4342 - 83100(версия по трем позициям) и до 4 знаков
	// # Пример: 8.3.9.4342  - 8390 (версия по трем позициям) и до 4 знаков
	// # Пример: 8.3.12.4342 - 83120(версия по трем позициям) и до 4 знаков
	// # Пример: 8.3.1.00    - 8310(версия по трем позициям) и до 4 знаков
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ТекущаяВерсия = СистемнаяИнформация.ВерсияПриложения;
	
	Версия  = "";
	Для н = 1  По 3 Цикл
		ПозицияТочки  = Найти(ТекущаяВерсия, ".");
		Символ        = Лев(ТекущаяВерсия , ПозицияТочки - 1);
		ТекущаяВерсия = Сред(ТекущаяВерсия, ПозицияТочки + 1);
		Версия        = Версия + Символ;
	КонецЦикла;
	
	Если СтрДлина(Версия) < 4 
		 ИЛИ (Сред(Версия, 2, 1) = "3" И СтрДлина(Версия) = 4) Тогда
	    Версия = Версия + "0";	
	КонецЕсли;
	
	Попытка
		ВерсияЧисло = Число(Версия);
	Исключение
	   ВерсияЧисло  = 0;
	КонецПопытки;

	Возврат ВерсияЧисло;
	
КонецФункции

&НаСервере
Процедура СохранитьКодТЧПоставщикаНаСервере()
    
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКодТЧПоставщика(Команда)
    СохранитьКодТЧПоставщикаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	Если СлужебныйФормаОткрыта = Истина Тогда
	     Возврат;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	СлужебныйФормаОткрыта = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиДокументовПоОтдельности(Команда)
	Если Модифицированность Тогда
		Оповещение = Новый ОписаниеОповещения("ПередСохранениемНастроекДокументов", ЭтаФорма);
		ПоказатьВопрос(Оповещение, "Имеются несохраненные изменения, для продолжения требуется запись настроек. Сохранить?", РежимДиалогаВопрос.ОКОтмена);
	Иначе
		ПередСохранениемНастроекДокументов();
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура ПередСохранениемНастроекДокументов(Результат = Неопределено, Параметры = Неопределено) Экспорт
	
	Если ТипЗнч(Результат) = Тип("КодВозвратаДиалога") И Результат = КодВозвратаДиалога.ОК Тогда
		ВызватьДиалог = Ложь;
		СохранитьИзмененныеНастройки(, ВызватьДиалог);
	ИначеЕсли ТипЗнч(Результат) = Тип("КодВозвратаДиалога") И Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;	
	
	ТипыТранзакций = Новый Соответствие;
	ТипыТранзакций.Вставить("СтруктураФайлаXMLВходящие");
	ТипыТранзакций.Вставить("СтруктураФайлаXMLИсходящие");
	ТипыТранзакций.Вставить("СтруктураФайлаXMLДокументы");
	
	Для Каждого Элемент Из ТипыТранзакций Цикл
		СтрокиДЗ      = ЭтаФорма[Элемент.Ключ].ПолучитьЭлементы();
		
		ТранзакцииПоПолю = Новый Массив;
		Для Каждого Строка Из СтрокиДЗ Цикл
			ТекущийТипТранзакции = Неопределено;
			Если Строка.Свойство("ТипТранзакции", ТекущийТипТранзакции) = Ложь Тогда
				Если Строка.Свойство("Кнопка", ТекущийТипТранзакции) = Ложь Тогда
					Продолжить; 
				КонецЕсли;
			КонецЕсли;
			
			ТранзакцииПоПолю.Добавить(ТекущийТипТранзакции);
		КонецЦикла;
		
		ТипыТранзакций.Вставить(Элемент.Ключ, ТранзакцииПоПолю);
	КонецЦикла;  	
	
	ИменаПрочихНастроек = Новый Соответствие;
	ИменаПрочихНастроек.Вставить("СетьПодписка", "ДокументовСеть");
	ИменаПрочихНастроек.Вставить("СетьЗапрос", "Покупателя");
	ИменаПрочихНастроек.Вставить("ПоставщикПодписка", "ДокументовПоставщик");
	ИменаПрочихНастроек.Вставить("ПоставщикЗапрос", "Поставщика");
	ИменаПрочихНастроек.Вставить("Прайс-листЗапрос", "ПрайсЛист");
	ИменаПрочихНастроек.Вставить("Прайс-листПодписка", "ПрайсЛист");
	ИменаПрочихНастроек.Вставить("Неструкт. докум.Запрос", "Condra");
	ИменаПрочихНастроек.Вставить("Неструкт. докум.Подписка", "ДокументовCondra");
	ИменаПрочихНастроек.Вставить("ЭТРНЗапрос", "ЭТРН");
	ИменаПрочихНастроек.Вставить("ЭТРНПодписка", "ДокументовЭТРН");	
	
	// настройки интерфейса, прочие настройки
	МассивНастроек = Новый Массив;
	Для Каждого Строка Из ЭКОМ_ПрочиеНастройки Цикл
		Если Строка.Использовать Тогда
			МассивНастроек.Добавить("СлужебныйЗапросДляФормы" + ИменаПрочихНастроек.Получить(Строка.ТипОбмена  + "Запрос"));
			МассивНастроек.Добавить("СлужебныйЗапросДляПодписки" + ИменаПрочихНастроек.Получить(Строка.ТипОбмена  + "Подписка"));
		КонецЕсли;
	КонецЦикла;
	Если МассивНастроек.Количество() Тогда
		ТипыТранзакций.Вставить("Прочие настройки", МассивНастроек);
	КонецЕсли;
	
	ПараметрыОткрываемойФормы = Новый Структура;
	ПараметрыОткрываемойФормы.Вставить("ТипОперации"   , "Сохранение");
	ПараметрыОткрываемойФормы.Вставить("ТипыТранзакций", ТипыТранзакций);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВыбораНастроекСохранения", ЭтаФорма);
	ОткрытьФорму(ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ВыборСохраняемыхНастроек", ПараметрыОткрываемойФормы,,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНастроекСохранения(Результат, ДополнительныеПараметры) Экспорт
	
	МассивЛогаСобытий	   = Новый Массив;
	ВыбранныеТипы  	       = Неопределено;
	ВсегоФайлов   		   = Неопределено;
	КаталогСохранения 	   = Неопределено;
	МассивКонстант		   = Неопределено;
	СохранятьПоОтдельности = Неопределено;
	Если Результат.Свойство("ВыбранныеТипы", ВыбранныеТипы) = Ложь 
		ИЛИ Результат.Свойство("КаталогСохранения", КаталогСохранения) = Ложь 
		ИЛИ Результат.Свойство("ВсегоФайлов", ВсегоФайлов) = Ложь
		ИЛИ Результат.Свойство("МассивКонстант", МассивКонстант) = Ложь 
		ИЛИ Результат.Свойство("СохранятьПоОтдельности", СохранятьПоОтдельности) = Ложь Тогда		 
		
		Если Не Результат.Свойство("Отменить") Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сохранение настроек не может быть выполнено, не выбран каталог сохранения или не удалось передать структуру сохраняемых настроек";
			Сообщение.Сообщить();
		КонецЕсли;
		Возврат;
		
	КонецЕсли;
	
	Сообщение = Новый СообщениеПользователю;  	
	Если СохранятьПоОтдельности Тогда 		
		Прогресс		  = 0;
		ТекущийНомерФайла = 0;
		ДанныеОС 		  = ЭКОМ_ОбщегоНазначенияКлиент.ЭКОМ_ПолучитьРазделительПутиОСКлиента();
		РазделительПути   = ДанныеОС.Получить("РазделительПути");
		ВерсияОбработки   = ПолучитьВерсиюОбработкиНаСервере();
		
		СтруктураФайловНастроек = ПолучитьФайлыНастроек(ВыбранныеТипы, МассивКонстант);
		Для Каждого ЭлементОсновной Из СтруктураФайловНастроек Цикл
			
			Для Каждого Элемент Из ЭлементОсновной.Значение Цикл
				ДвоичныеДанные = ПолучитьИзВременногоХранилища(Элемент.Значение);
				
				ИмяСохранения	    = ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьИмяСохраняемогоФайла(ВерсияОбработки, Элемент.Ключ, ЭлементОсновной.Ключ);
				ИмяФайлаПоУмолчанию = ИмяСохранения + ".xml";
				ПолныйПутьКФайлу	= КаталогСохранения + РазделительПути + ИмяФайлаПоУмолчанию;
				
				Прогресс = Окр(ТекущийНомерФайла * 100 / ВсегоФайлов, 0);
				Попытка
					ДвоичныеДанные.Записать(ПолныйПутьКФайлу);
				Исключение
					Сообщить("Ошибка записи в файл [" + "] " + ПолныйПутьКФайлу);
				КонецПопытки;
				
				ЗаписанныйФайл = Новый Файл(ПолныйПутьКФайлу);
				Если ЗаписанныйФайл.Существует() Тогда
					СостояниеЭКОМ("Успешно сохранен файл настроек", "" + ИмяФайлаПоУмолчанию, Прогресс);
					Сообщение.Текст = "Успешно сохранен файл настроек: " + ИмяФайлаПоУмолчанию;    					
				Иначе
					СостояниеЭКОМ("Файл настроек не записан", ИмяФайлаПоУмолчанию, Прогресс);
					Сообщение.Текст = "Файл настроек не записан: " + ИмяФайлаПоУмолчанию;
				КонецЕсли;
				Сообщение.Сообщить();
			КонецЦикла;
			
		КонецЦикла;
	Иначе
		ОтборРегистр = Новый Структура;
		ОтборРегистр.Вставить("ЭКОМ_ЗначениеДополнительныхКонстант", Истина);
		
		АдресВоВременномХранилище = ВыгрузкаНаСервере(ОтборРегистр, МассивКонстант, МассивЛогаСобытий, Истина, ВыбранныеТипы);
		
		КраткаяИнформация = ЭКОМ_ОбщегоНазначения.ПолучитьКраткуюИнформацияОКонфигурации();
		ДатаЗаписи        = Формат(ТекущаяДата(), "ДФ=dd.MM.yy");
		ИмяСохранения     = "Настройки по документам_" + ДатаЗаписи + "_" + КраткаяИнформация + ".xml";
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
		ДвоичныеДанные.Записать(КаталогСохранения + ПолучитьРазделительПутиКлиента() + ИмяСохранения);
		
		Сообщение.Текст = "Успешно сохранен файл с выбранными настройками.";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьФайлыНастроек(ВыбранныеТипы, МассивКонстант)
	
	ОтборРегистр = Новый Структура("ЭКОМ_ЗначениеДополнительныхКонстант", Истина);
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
    СтруктураНастроек = ОбработкаОбъект.ВыгрузитьНастройки(ОтборРегистр, МассивКонстант, , Истина, ВыбранныеТипы, Истина);	
	Если СтруктураНастроек.Свойство("ЭКОМ_ЗначениеДополнительныхКонстант") Тогда
		ТаблицаНастроек   = СтруктураНастроек.ЭКОМ_ЗначениеДополнительныхКонстант;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	ФайлыНастроек     = Новый Соответствие;
	
	ТекущийНомерФайла = 0;
	Для Каждого Строка Из ТаблицаНастроек Цикл
		СформированныеФайлы = Новый Соответствие;
		
		ИмяКолонки    = ?(Строка.ДополнительнаяКонстанта = "СтруктураФайлаXMLДокументы", "Кнопка", "ТипТранзакции");
		ТекущийНомерФайла = ТекущийНомерФайла + 1;
		
		СтрокаДеревоНастроек = Строка.ЗначениеДополнительногоХранилища;
		
		Если ТипЗнч(СтрокаДеревоНастроек) = Тип("ДеревоЗначений") Тогда
			
			Для Каждого СтрокаДерева Из СтрокаДеревоНастроек.Строки Цикл
				ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
					
				Колонки = Новый Массив;
				Для Каждого Колонка Из СтрокаДеревоНастроек.Колонки Цикл
					Колонки.Добавить(Колонка.Имя);
				КонецЦикла;
				
				Дерево = Новый ДеревоЗначений;
				Для Каждого Колонка Из Колонки Цикл
					Дерево.Колонки.Добавить(Колонка);
				КонецЦикла;
				
				НайденнаяСтрока = СтрокаДеревоНастроек.Строки.Найти(СтрокаДерева[ИмяКолонки], ИмяКолонки); 
				
				ОбработкаОбъект.СкопироватьСтрокуДереваЗначений(НайденнаяСтрока, Дерево.Строки.Добавить(), Колонки);
				
				Запись = Новый ЗаписьXML;
				Запись.ОткрытьФайл(ИмяВременногоФайла);    
				
				НовыйСериализаторXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
				НовыйСериализаторXDTO.ЗаписатьXML(Запись, Дерево, НазначениеТипаXML.Явное);
				
				Запись.Закрыть();
				
				АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла), ЭтаФорма.УникальныйИдентификатор);
				
				СформированныеФайлы.Вставить(СтрокаДерева[ИмяКолонки], АдресВоВременномХранилище);  				
			КонецЦикла;
			
			ФайлыНастроек.Вставить(Строка.ДополнительнаяКонстанта, СформированныеФайлы);
		Иначе
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
			
			Запись = Новый ЗаписьXML;
			Запись.ОткрытьФайл(ИмяВременногоФайла);    
			
			НовыйСериализаторXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
			НовыйСериализаторXDTO.ЗаписатьXML(Запись, Строка.ЗначениеДополнительногоХранилища, НазначениеТипаXML.Явное);
			
			Запись.Закрыть();
			
			ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
			АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
			
			СформированныеФайлы.Вставить(Строка.ДополнительнаяКонстанта, АдресВоВременномХранилище); 
			ФайлыНастроек.Вставить(Строка.ДополнительнаяКонстанта, СформированныеФайлы);
		КонецЕсли;
	
		
	КонецЦикла;
	
	Возврат ФайлыНастроек;
	
КонецФункции

&НаСервере
Функция ПолучитьФайлыНастроекЗапросПодписка(ВыбранныеТипы, МассивКонстант)
	
	ОтборРегистр = Новый Структура("ЭКОМ_ЗначениеДополнительныхКонстант", Истина);
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
    СтруктураНастроек = ОбработкаОбъект.ВыгрузитьНастройки(ОтборРегистр, МассивКонстант, , Истина, ВыбранныеТипы, Истина);	
	Если СтруктураНастроек.Свойство("ЭКОМ_ЗначениеДополнительныхКонстант") Тогда
		ТаблицаНастроек   = СтруктураНастроек.ЭКОМ_ЗначениеДополнительныхКонстант;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	ФайлыНастроек     = Новый Соответствие;
	
	ТекущийНомерФайла = 0;
	Для Каждого Строка Из ТаблицаНастроек Цикл
		
		Если Строка.ЗначениеДополнительногоХранилища = Неопределено Или Строка.ЗначениеДополнительногоХранилища = "" Тогда
			Возврат Неопределено;
		Иначе
			СформированныеФайлы = Новый Соответствие;
			
			ИмяКолонки    = ?(Строка.ДополнительнаяКонстанта = "СтруктураФайлаXMLДокументы", "Кнопка", "ТипТранзакции");
			ТекущийНомерФайла = ТекущийНомерФайла + 1;
			
			СтрокаДеревоНастроек = Строка.ЗначениеДополнительногоХранилища;
			
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
			
			Запись = Новый ЗаписьXML;
			Запись.ОткрытьФайл(ИмяВременногоФайла);    
			
			НовыйСериализаторXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
			НовыйСериализаторXDTO.ЗаписатьXML(Запись, Строка.ЗначениеДополнительногоХранилища, НазначениеТипаXML.Явное);
			
			Запись.Закрыть();
			
			ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
			АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
			
			СформированныеФайлы.Вставить(Строка.ДополнительнаяКонстанта, АдресВоВременномХранилище); 
			ФайлыНастроек.Вставить(Строка.ДополнительнаяКонстанта, СформированныеФайлы);
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат ФайлыНастроек;
	
КонецФункции

&НаКлиенте
Процедура СостояниеЭКОМ(Знач ТекстСообщения = "", Знач Пояснение = "Docrobot", Знач Прогресс = Неопределено)
    Состояние(ТекстСообщения,Прогресс, Пояснение, БиблиотекаКартинок.ЭКОМ_ОбщаяКартинка);
КонецПроцедуры

&НаКлиенте
Функция МаксимальнаяДлинаИмениТранзакции(МассивИменТранзакций = Неопределено)
	
	Перем МассивИменДокументов;
    
    Если МассивИменТранзакций = Неопределено Тогда
    	МассивИменТранзакций = Вычислить("ЭКОМ_ОбщегоНазначения.ДокументыСписокВыбораПолучить(""ТипТразакций"", МассивИменДокументов)");
    КонецЕсли;
    МаксимальнаяДлина = 0;
    Для каждого Транзакция Из МассивИменТранзакций Цикл
        ТекущаяДлина = СтрДлина(Транзакция);
        МаксимальнаяДлина = ?(ТекущаяДлина > МаксимальнаяДлина, ТекущаяДлина, МаксимальнаяДлина);
    КонецЦикла;
    
    Возврат МаксимальнаяДлина;
	
КонецФункции

&НаКлиенте
Процедура УправлениеШиринойСтруктурыФайла(ИмяДереваНастроек)
		
	СтрокиДЗ = ЭтаФорма[ИмяДереваНастроек].ПолучитьЭлементы();
	
	ТипыТранзакций = Новый Массив;
	Для каждого ТекСтрока Из СтрокиДЗ Цикл
	    ТипыТранзакций.Добавить(ТекСтрока.ТипТранзакции);
	КонецЦикла;
	
	ДлинаКолонкиТранзакций = МаксимальнаяДлинаИмениТранзакции(ТипыТранзакций);
	Элементы[ИмяДереваНастроек].Ширина = ДлинаКолонкиТранзакций;
	Элементы[ИмяДереваНастроек].МаксимальнаяШирина = ДлинаКолонкиТранзакций;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()
    
    УправлениеШиринойСтруктурыФайла("СтруктураФайлаXMLВходящие");
    УправлениеШиринойСтруктурыФайла("СтруктураФайлаXMLИсходящие");

  	Элементы.ГруппаПоставщикРегламентныйОбмен.Доступность	= ЭКОМ_ОбменПоставщик;
	Элементы.ГруппаПокупательРегламентныйОбмен.Доступность	= ЭКОМ_ОбменСеть;
	Элементы.ГруппаПоставщикДокументооборот.Доступность 	= ЭКОМ_ОбменПоставщик;
	Элементы.ГруппаПокупательДокументооборот.Доступность 	= ЭКОМ_ОбменСеть;
	
	// Ограничение по паролю.
	Элементы.ГруппаНастройкиДокументов.Доступность = ЭтаФорма.ПарольВведенВерно;
	Элементы.ГруппаДокументооборот.Доступность	   = ЭтаФорма.ПарольВведенВерно;
	Элементы.ГруппаПользователиИРоли.Доступность   = ЭтаФорма.ПарольВведенВерно;
	Элементы.ГруппаХранениеДанных.Доступность 	   = ЭтаФорма.ПарольВведенВерно;
	Элементы.ГруппаРегламентныйОбмен.Доступность   = ЭтаФорма.ПарольВведенВерно;
	Элементы.ГруппаОбновления.Доступность 		   = ЭтаФорма.ПарольВведенВерно;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокКолонокПоставщика(Команда)
    ПолучитьКолонкиТабличнойЧастиОбновитьТЗВидимостиКолонок("Поставщик");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокКолонокПокупателя(Команда)
    ПолучитьКолонкиТабличнойЧастиОбновитьТЗВидимостиКолонок("Покупатель");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОбновлений(Команда)
    
    ПолноеИмяФормыОбновлений = ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаОбновления";
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЭКОМОбъектыАктуальны", ЭтаФорма.ЭКОМОбъектыАктуальны);
    ОткрытьФорму(ПолноеИмяФормыОбновлений, ПараметрыФормы,ЭтаФорма,"ЭКОМ_УФ_ФормаОбновления", ,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
 
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлИлиКаталог(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
    
	ПолныйПуть = Элемент.ТекстРедактирования;
	Если Не ЗначениеЗаполнено(ПолныйПуть) Тогда
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ПолныйПуть);
	Если НЕ Файл.Существует() Тогда
		Возврат;
	КонецЕсли;
    
    ПутьДляЗапуска = ?(Файл.ЭтоФайл(), Файл.Путь, ПолныйПуть);
	ЗапуститьПриложение(ПутьДляЗапуска);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОбъектыВыборПериода(Команда)
    
    ДиалогПериода = Новый ДиалогРедактированияСтандартногоПериода;
    ДиалогПериода.Период.Вариант = ВариантСтандартногоПериода.ПрошлыйГод;
    
    Если НЕ ЗначениеЗаполнено(ОчиститьОбъекты_НачДатаОчистки) Тогда
    	ОчиститьОбъекты_НачДатаОчистки = НачалоГода(ТекущаяДата());
    КонецЕсли;
    
    Если НЕ ЗначениеЗаполнено(ОчиститьОбъекты_КонДатаОчистки) Тогда
    	ОчиститьОбъекты_КонДатаОчистки = КонецГода(ТекущаяДата());
    КонецЕсли;
    
    ДиалогПериода.Период.ДатаНачала    = ОчиститьОбъекты_НачДатаОчистки;
    ДиалогПериода.Период.ДатаОкончания = ОчиститьОбъекты_КонДатаОчистки;
    
    ДиалогПериода.Показать(Новый ОписаниеОповещения("ОчиститьОбъектыВыборПериодаЗавершение", ЭтаФорма))
КонецПроцедуры

Процедура ОчиститьОбъектыВыборПериодаЗавершение(Период, ДопПараметры) Экспорт
    Если Период = Неопределено Тогда
        Возврат;
    КонецЕсли;
    ОчиститьОбъекты_НачДатаОчистки = Период.ДатаНачала;
    ОчиститьОбъекты_КонДатаОчистки = Период.ДатаОкончания;
КонецПроцедуры

Функция СтрНайтиПоШаблону(СтрокаГдеИскать, ШаблонПоиска) Экспорт
    Перем Результат;
    
    Если (Прав(ШаблонПоиска, 1) = "%" И Лев(ШаблонПоиска, 1) = "%") Тогда //ищет вхождение в любом месте
        
        ШаблонПоискаБезСпецСимволов = СтрЗаменить(ШаблонПоиска, "%", "");
        Если Найти(СтрокаГдеИскать, ШаблонПоискаБезСпецСимволов) = 0 Тогда
            Возврат Неопределено;
        КонецЕсли;
        
    ИначеЕсли Лев(ШаблонПоиска, 1) = "%" Или Найти(ШаблонПоиска, "%") = 0 Тогда //Ищет только сначала строки
        
            ШаблонПоискаБезСпецСимволов = СтрЗаменить(ШаблонПоиска, "%", "");
            ФрагментТекста              = Лев(СтрокаГдеИскать, СтрДлина(ШаблонПоискаБезСпецСимволов));
            Результат                   = (ФрагментТекста = ШаблонПоискаБезСпецСимволов);
    КонецЕсли;
    
    Возврат Результат;
КонецФункции 

//возвращает истину если шаблон поиска найден ложь если не найден
Функция СтрНайденШаблонПоискаВСтроке(СтрокаГдеИскать, ШаблонПоиска) Экспорт
    Перем Результат;
    
    ПозицияВхождения = СтрНайтиПоШаблону(СтрокаГдеИскать, ШаблонПоиска);
    Если ПозицияВхождения <> Неопределено И ПустаяСтрока(ПозицияВхождения) = Ложь Тогда
        Результат = ?(ПозицияВхождения > 0, Истина, Ложь);
    Иначе
        Результат = Ложь;
    КонецЕсли;
    
    Возврат Результат;
КонецФункции

// Функция - ищет по шаблону реквизиты формы с именами используемый спецсимвол % действует как в ПОДОБНО. Если % не указан то ищу сначала строки указанный шаблон в имени реквизита формы
//
// Параметры:
//  ШаблонПоиска - Строка - строка поиска. Способ поиска указывается спецсимволом %. Поддерживаются ЭКОМ_% или просто ЭКОМ_ - поиск вхождения с начала строки. %ЭКОМ_% - поиск вхождения в имя в любой части строки.
//  ВернутьТолькоИмена - Булево - Истина - вернет имена (по-умолчанию). Ложь - вернет объекты подмножества реквизит формы.
// Возвращаемое значение:
//   - Массив имен реквизитов формы или массив реквизитов формы
//
&НаСервере
Функция НайтиРеквизитыФормы(Знач ШаблонПоиска, ВернутьТолькоИмена = Истина, Результат = Неопределено)
    
    Если Результат = Неопределено Тогда
        Результат = Новый Массив;
    КонецЕсли;
    
    Если ТипЗнч(ШаблонПоиска) = Тип("Строка") Тогда
        Если Найти(ШаблонПоиска, ",") > 0 Тогда
            ШаблонПоиска = ВернутьТемЖеЗначениемИлиМассивомИзЭтогоЗначения(ШаблонПоиска, ",", Истина, Ложь);
            Результат    = НайтиРеквизитыФормы(ШаблонПоиска, ВернутьТолькоИмена, Результат);
            Возврат Результат;
        КонецЕсли;
    ИначеЕсли ТипЗнч(ШаблонПоиска) = Тип("Массив") Тогда
        Для Каждого ТекущийШаблонПоиска Из ШаблонПоиска Цикл
            Результат = НайтиРеквизитыФормы(ТекущийШаблонПоиска, ВернутьТолькоИмена, Результат);
        КонецЦикла;
        Возврат Результат;
    КонецЕсли;
    
    НайденныйЭлементФормы = Элементы.Найти(ШаблонПоиска);
    Если НайденныйЭлементФормы = Неопределено Тогда  //был передан шаблон поиска - перебираю все реквизиты добавляя подходящие или этот реквизит формы не выведен 
        Попытка ////может быть ситуация когда Реквизит формы не выведен на форму в элементы формы
	        НайденныйРеквизитФормы = ЭтаФорма[ШаблонПоиска];
            Результат.Добавить(ШаблонПоиска);
            Возврат Результат; //наден реквизит по шаблону поиска и шаблоном было точное имя реквизита
        Исключение
        КонецПопытки;
        
        //по точному соотвествию реквизит формы не обнаружен пробую искать по подстроке в имени реквизита
        Для Каждого ЭлементФормы Из Элементы Цикл
            Если ТипЗнч(ЭлементФормы) <> Тип("ПолеФормы") Тогда
                Продолжить;
            КонецЕсли;
            
            ИмяРеквизита = ЭлементФормы.Имя;
            Если СтрНайденШаблонПоискаВСтроке(ИмяРеквизита, ШаблонПоиска) = Ложь Тогда
                Продолжить;    
            Иначе
                Попытка
	                ЗначениеРеквизитаФормы = ЭтаФорма[ИмяРеквизита];
                    НайденныйЭлементФормы = ЭлементФормы;
                    Результат = НайтиРеквизитыФормы(ИмяРеквизита, ВернутьТолькоИмена, Результат);
                Исключение
                    Продолжить; 
                КонецПопытки;
            КонецЕсли;        
        КонецЦикла;
        Возврат Результат;
    КонецЕсли;
    
    //это вызывается когда передано конкретное имя реквизита и он был найден. (вызывается в конечном итоге всегда в при успехе поиска конце цепочки вызовов)
    Если НайденныйЭлементФормы <> Неопределено Тогда
        Если ВернутьТолькоИмена = Истина Тогда
            Результат.Добавить(НайденныйЭлементФормы.Имя);
        Иначе
            Результат.Добавить(НайденныйЭлементФормы);
        КонецЕсли; 
    КонецЕсли;
    
    
    Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ВызватьДиалогПодтвержденияЗаписи(ИзмененныеНастройки, ОписаниеИзменений, ЗакрытьФорму = Ложь, ИзмененныеНастройкиТаблицей = Неопределено)
    
    ВозвращаемыеПараметры = Новый Структура("ЗакрытьФорму, ИзмененныеНастройки,", ЗакрытьФорму, ИзмененныеНастройки) ;
    ОповещениеОЗакрытии   = Новый ОписаниеОповещения("ВызватьДиалогПодтвержденияЗаписиЗавершение", ЭтаФорма, ВозвращаемыеПараметры);
    ПараметрыВызова       = Новый Структура("ОписаниеИзмененийТекст, ИзмененныеНастройки", ОписаниеИзменений, ИзмененныеНастройкиТаблицей);
    ФормаСохранения       = ОткрытьФорму(ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_СохранениеНастроек", ПараметрыВызова, ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
    
КонецПроцедуры

&НаКлиенте
Процедура ВызватьДиалогПодтвержденияЗаписиЗавершение(РезультатЗакрытия, Параметры = Ложь) Экспорт
	
	МассивЛогаСобытий = Новый Массив;
	Если РезультатЗакрытия = Истина Тогда
		
        ЗаписатьНаСервере(Параметры.ИзмененныеНастройки);
		
		// Для обновления ролей при изменении значений определенных переменных.
		ОбновитьРоли = Ложь;
		ЭлементыДляОбновленияРолей = Новый Массив;
		ЭлементыДляОбновленияРолей.Добавить("_СтруктураФайлаXMLВходящие");
		ЭлементыДляОбновленияРолей.Добавить("_СтруктураФайлаXMLИсходящие");
		ЭлементыДляОбновленияРолей.Добавить("_СтруктураФайлаXMLДокументы");
		Для каждого Стр Из Параметры.ИзмененныеНастройки Цикл			 
			ОбновитьРоли = ?(НЕ ЭлементыДляОбновленияРолей.Найти(Стр.Ключ) = Неопределено, Истина, ОбновитьРоли);
		КонецЦикла;
		
		Если ОбновитьРоли Тогда
			ОбновитьВсеРолиНаСервере();
		КонецЕсли;
		
        Состояние("Настройки успешно записаны.", , , БиблиотекаКартинок.Записать);
        ЭтаФорма.Модифицированность = Ложь;
		
		//+Лысковец 20220125 / MOD-570 / При попытке записать изменения, если закрыта обработка / добавлено условие
		Если НЕ ВладелецФормы = Неопределено Тогда
			ВладелецФормы.СоздатьДинамическийСписокДобавитьДинамическиеКнопки(МассивЛогаСобытий);
		КонецЕсли;
		//-
		
    Иначе
        Состояние("Вы отказались от сохранения настроек.", , , БиблиотекаКартинок.Записать);
    КонецЕсли;
    Если Параметры.ЗакрытьФорму = Истина Тогда
        ПараметрФормы = Новый Структура;
        ПараметрФормы.Вставить("ЗавершениеРаботы", Истина);
		ПараметрФормы.Вставить("ФормаДляОповещения", "Обработка.УФ_Форма");
    	Оповестить("НастройкиОбновить", ПараметрФормы);
        ЭтаФорма.Модифицированность = Ложь;
        Закрыть();
	КонецЕсли;
	
	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Попытка
			Выполнить("ЭКОМ_ОбщегоНазначения.ЗаписатьЛогСобытийвРегистрЛогирование(МассивЛогаСобытий);");
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Вычислить("ЭКОМ_ОбщегоНазначения.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий)");
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ИзмененныеНастройкиТаблицей(ИзмененныеНастройкиСтруктурой)
    
    ИзмененныеНастройкиТаблицей = Новый ТаблицаЗначений;
    ИзмененныеНастройкиТаблицей.Колонки.Добавить("Сохранять", Новый ОписаниеТипов("Булево"));
    ИзмененныеНастройкиТаблицей.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
    ИзмененныеНастройкиТаблицей.Колонки.Добавить("Синоним", Новый ОписаниеТипов("Строка"));
    
    ИзмененныеНастройкиТаблицей.Колонки.Добавить("Было");
    ИзмененныеНастройкиТаблицей.Колонки.Добавить("ТипБыло");
    
    ИзмененныеНастройкиТаблицей.Колонки.Добавить("Стало");
    ИзмененныеНастройкиТаблицей.Колонки.Добавить("ТипСтало");
    
    СтрокаТЗ = ИзмененныеНастройкиТаблицей.Добавить();
    //СтрокаТЗ.Имя       = ИмяНастройки;
    //СтрокаТЗ.Синоним   = Элементы[ИмяНастройки].Заголовок;
    //
    //СтрокаТЗ.Было  = ИзмененныеНастройкиСтруктурой.ИмяНастройки;
    //СтрокаТЗ.Стало = ЗначениеНастройкиСтало;
    //СтрокаТЗ.ТипБыло  = ТипЗнч(СтароеЗначениеНастройки);
    //СтрокаТЗ.ТипСтало = ТипЗнч(ЗначениеНастройкиСтало);
КонецФункции

&НаКлиенте
Процедура СохранитьИзмененныеНастройки(ЗакрытьФорму = Ложь, ВызватьДиалог = Истина)
	
	МассивЛогаСобытий = Новый Массив;
	
	Если ЭтаФорма.СписокЗначенийИзмененныхНастроек.Количество() = 0 Тогда
	     Сообщить("Изменения настроек отсутствуют!");
		 ЭтаФорма.Модифицированность = Ложь;
		 
		 Если ЗакрытьФорму = Истина Тогда
			 ИмяТекущейСтраницы = Элементы.ГруппаПанельНастроек.ТекущаяСтраница.Имя;
			 ЗаписатьТекущуюСтраницуНаСервере(ИмяТекущейСтраницы, МассивЛогаСобытий);
			 Закрыть();
		 КонецЕсли;

	 Иначе
		 ОписаниеИзменений = "";
		 СоответствиеЗначений = ЭтаФорма.СписокЗначенийИзмененныхНастроек.Получить(0).Значение;
		 Для каждого Стр Из СоответствиеЗначений Цикл
			 ОписаниеИзменений = ОписаниеИзменений + ?(ЗначениеЗаполнено(ОписаниеИзменений), Символы.ПС, "") + Стр.Ключ;	 
		 КонецЦикла;
		 
		 Если ВызватьДиалог Тогда
			 ВызватьДиалогПодтвержденияЗаписи(СоответствиеЗначений, ОписаниеИзменений, ЗакрытьФорму);
		 Иначе
			 ВызватьДиалогПодтвержденияЗаписиЗавершение(Истина, Новый Структура("ЗакрытьФорму, ИзмененныеНастройки", Ложь, СоответствиеЗначений));
		 КонецЕсли;
         ЭтаФорма.Модифицированность = Ложь;
	КонецЕсли;
	
	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Попытка
			Выполнить("ЭКОМ_ОбщегоНазначения.ЗаписатьЛогСобытийвРегистрЛогирование(МассивЛогаСобытий);");
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Вычислить("ЭКОМ_ОбщегоНазначения.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий)");
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИзмененныеРеквизитыПрочитатьНастройкуИзФормы(ИмяНастройки)
    Перем Результат;
    
    РеквизитНастройки = ЭтаФорма[ИмяНастройки];
    ТипСтрокой = Строка(ТипЗнч(ЭтаФорма[ИмяНастройки]));
    Если Лев(ТипСтрокой, 11) = "ДанныеФормы" Тогда
        Результат = РеквизитФормыВЗначение(ИмяНастройки);
    Иначе
        Результат = РеквизитНастройки;
    КонецЕсли;
    Возврат Результат;
КонецФункции

&НаСервере
Процедура ДобавитьИсточникВПриемникСтрокой(Источник, Приемник, Разделитель = ",", ПробелПослеРазделителя = Истина) Экспорт 
    Приемник = Приемник + ?(Приемник = "", "", Разделитель + ?(ПробелПослеРазделителя = Истина, " ", "")) + Строка(Источник);
КонецПроцедуры
&НаСервере
Функция ОписаниеИзмененияСтрокой(Было, Стало, Описание = "", ОписаниеПослеОписанияПередБыло = "поле", ОписаниеБыло = "было", ОписаниеСтало = "стало", ДобавитьСправаКОписанию = ":", ДлинныеСтрокиОбрезатьДо = 100) Экспорт
    
    БылоСтрокой  = ПредставитьЗначениеСтрокой(Было ,, ДлинныеСтрокиОбрезатьДо);
    СталоСтрокой = ПредставитьЗначениеСтрокой(Стало,, ДлинныеСтрокиОбрезатьДо);
    
    Результат = ОписаниеПослеОписанияПередБыло + ДобавитьСправаКОписанию + " " + Строка(Описание) + ", " + ОписаниеБыло + ДобавитьСправаКОписанию + " " + БылоСтрокой + ", " + ОписаниеСтало + ДобавитьСправаКОписанию + " " + СталоСтрокой;
    Возврат Результат;
КонецФункции 
&НаСервере
Функция ПредставитьЗначениеСтрокой(ЗначениеДляПредставления, УбратьПереносыСтрок = Истина, ДлинныеСтрокиОбрезатьДо = 100, ДобавитьТипЗначения = Истина) Экспорт 
    Перем Результат;    
    
    Если ЗначениеДляПредставления = NULL Тогда
        Результат = "NULL";
    ИначеЕсли ЗначениеДляПредставления = Неопределено Тогда
        Результат = "Неопределено";
    ИначеЕсли ТипЗнч(ЗначениеДляПредставления) = Тип("ЭлементСпискаЗначений") Тогда
        Результат = "Пометка " + ?(ЗначениеДляПредставления.Пометка, "✅ ","нет ")
                  + "Представление [" + Строка(ЗначениеДляПредставления.Представление) + "]"
                  + ", " 
                  + "Значение [" + Строка(ЗначениеДляПредставления.Значение) + "], тип " + Строка(ТипЗнч(ЗначениеДляПредставления))
                  ;
    ИначеЕсли ТипЗнч(ЗначениеДляПредставления) = Тип("КлючИЗначение") Тогда
        Результат = "Ключ [" + Строка(ЗначениеДляПредставления.Ключ) + "]"
                  + ", " 
                  + "Значение [" + Строка(ЗначениеДляПредставления.Значение) + "]"
                  ;
    Иначе
        Результат = Строка(ЗначениеДляПредставления);
        Результат = ?(ПустаяСтрока(Результат), "[]", Результат);
        Если ДобавитьТипЗначения = Истина Тогда
            Результат = Результат + ". Тип: " + Строка(ТипЗнч(ЗначениеДляПредставления));
        КонецЕсли;
    КонецЕсли;
    
    Если ДлинныеСтрокиОбрезатьДо = Неопределено Или ДлинныеСтрокиОбрезатьДо = 0 Тогда
    Иначе
        Результат = Лев(Результат, ДлинныеСтрокиОбрезатьДо) + ?(СтрДлина(Результат) > ДлинныеСтрокиОбрезатьДо, "...(длинный текст)", "");
    КонецЕсли;
    
    Если УбратьПереносыСтрок = Истина Тогда
        Результат = СтрЗаменить(Результат, Символы.ПС, " ");;    
    КонецЕсли;
    
    Возврат  Результат;
КонецФункции
&НаСервере
Функция ОписаниеЭлементаКоллекции(Элемент)
    Если ТипЗнч(Элемент) <> Тип("КлючИЗначение") Тогда
        Возврат "";    
    КонецЕсли;
    
    Результат = "Ключ: [" + ПредставитьЗначениеСтрокой(Элемент.Ключ,,, Ложь) + "], значение: " + ПредставитьЗначениеСтрокой(Элемент.Значение);
    Возврат Результат;
КонецФункции

&НаСервере
Функция РезультатПоТекущемуРезультату(Знач ТекущийРезультат, Знач РезультатДо, ЗначениеТекущийРезультатДляЗаменыРезультат = Ложь)
    Перем Результат;
    
    Результат = ?(ТекущийРезультат = ЗначениеТекущийРезультатДляЗаменыРезультат, ТекущийРезультат, РезультатДо); 
    
    Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ЭКОМ_ОбновленияИзВеткиDevПриИзменении(Элемент)
    ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПользователяПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
    Если ОтменаРедактирования = Истина Тогда
    	Возврат;
    КонецЕсли;
    
    Элемент.ТекущиеДанные.Изменена = Истина;
КонецПроцедуры

&НаСервере
Функция ВернутьТемЖеЗначениемИлиМассивомИзЭтогоЗначения(ЗначениеДляАнализаВозврата, Разделитель = ",", ОбязательноМассивом = Ложь, ДобавитьВМассивНеопределено = Ложь) Экспорт
    Результат = Неопределено;
    
    Если ТипЗнч(ЗначениеДляАнализаВозврата) = Тип("Строка") Тогда
        Если Найти(ЗначениеДляАнализаВозврата, Разделитель) > 0 Тогда
            ЗначениеМассивом = ЭКОМ_РазложитьСтрокуВМассивПодстрок(ЗначениеДляАнализаВозврата, Разделитель, Истина);
            Результат = Новый Массив;
            Для Каждого ЗначениеРезультата Из ЗначениеМассивом Цикл
                Результат.Добавить(СокрЛП(ЗначениеРезультата));
            КонецЦикла;
            Если ДобавитьВМассивНеопределено = Истина Тогда
                Результат.Добавить(Неопределено);
            КонецЕсли;
        Иначе
            Если ОбязательноМассивом = Истина Или ДобавитьВМассивНеопределено = Истина Тогда
                Результат = Новый Массив;
                Результат.Добавить(ЗначениеДляАнализаВозврата);
                Результат.Добавить(Неопределено);
            Иначе
                Результат = ЗначениеДляАнализаВозврата;
            КонецЕсли;
        КонецЕсли;
    Иначе
        Результат = ЗначениеДляАнализаВозврата;
    КонецЕсли;
    
    Возврат Результат;
КонецФункции

// Функция "расщепляет" строку на подстроки, используя заданный 
//		разделитель. Разделитель может иметь любую длину. 
//		Если в качестве разделителя задан пробел, рядом стоящие пробелы 
//		считаются одним разделителем, а ведущие и хвостовые пробелы параметра Стр
//		игнорируются.
//		Например, 
//		Эком_РазложитьСтрокуВМассивПодстрок(",строка 1,,,строка 2", ",") возвратит массив значений из пяти элементов, 
//		три из которых - пустые строки, а 
//		Эком_РазложитьСтрокуВМассивПодстрок(" строка1   строка 2", " ") возвратит массив значений из двух элементов
//
//	Параметры: 
//		Стр - 			строка, которую необходимо разложить на подстроки. 
//						Параметр передается по значению.
//		Разделитель - 	строка-разделитель, по умолчанию - запятая.
//
//
//	Возвращаемое значение:
//		массив значений, элементы которого - подстроки
//
Функция Эком_РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",", ДелатьСокрЛП = Истина, ПропускатьПустыеЗначения = Истина) Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока Истина Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
                ТекущееЗначение = ?(ДелатьСокрЛП = Истина, СокрЛП(Стр), Стр);
				МассивСтрок.Добавить(ТекущееЗначение);
				Возврат МассивСтрок;
			КонецЕсли;
            ТекущееЗначение = Лев(Стр,Поз-1);
            ТекущееЗначение = ?(ДелатьСокрЛП = Истина, СокрЛП(ТекущееЗначение), ТекущееЗначение);
            МассивСтрок.Добавить(ТекущееЗначение);
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	ИначеЕсли Разделитель = "" Тогда
		Для Поз = 1 По СтрДлина(Стр) Цикл
			МассивСтрок.Добавить(Сред(Стр, Поз, 1));
		КонецЦикла;
		Возврат МассивСтрок;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока Истина Цикл
			Поз = Найти(Стр,Разделитель);
            Если Поз=0 Тогда
                ТекущееЗначение = ?(ДелатьСокрЛП = Истина, СокрЛП(Стр), Стр);
				МассивСтрок.Добавить(ТекущееЗначение);
				Возврат МассивСтрок;
			КонецЕсли;
            ТекущееЗначение = Лев(Стр,Поз-1);
            ТекущееЗначение = ?(ДелатьСокрЛП = Истина, СокрЛП(ТекущееЗначение), ТекущееЗначение);
            МассивСтрок.Добавить(ТекущееЗначение);
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	Результат = МассивСтрок;
КонецФункции

&НаСервереБезКонтекста
Процедура УдалитьИзРегистраСведенийЗаписьПоТекущимДаннымТабличногоПоляНаСервере(ИмяРегистраСведений, ЗначениеОтбора)
    Перем Результат;
    
    МенеджерЗаписи = РегистрыСведений[ИмяРегистраСведений].СоздатьМенеджерЗаписи();
    МенеджерЗаписи.Объект = ЗначениеОтбора;
    МенеджерЗаписи.Прочитать();
    Если МенеджерЗаписи.Выбран() Тогда
        МенеджерЗаписи.Удалить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзРегистраСведенийЗаписьПоТекущимДаннымТабличногоПоля(ЭлементФормыТабличноеПоле, ИмяКолонки = "Контрагент", ИмяРегистраСведений = "ЭКОМ_GLN")
    
    ЗначениеОтбора = ЗначениеТабличногоПоляПоИмениКолонки(ИмяКолонки);
    
    Если ЗначениеОтбора = Неопределено Тогда
        Возврат;
    КонецЕсли;
	
	ОповещениеВопроса = Новый ОписаниеОповещения("УдалитьИзРегистраСведенийЗаписьПоТекущимДаннымТабличногоПоляЗавершение", ЭтаФорма,
		Новый Структура("ИмяКолонки, ИмяРегистраСведений, ЗначениеОтбора", ИмяКолонки, ИмяРегистраСведений, ЗначениеОтбора));
    ПоказатьВопрос(ОповещениеВопроса, "Удалить сведения о [" + Строка(ЗначениеОтбора) + "] из настроек модуля Docrobot?",
		РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет, "Удаление настройки (регистр сведений " + ИмяРегистраСведений + ")");
				  
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзРегистраСведенийЗаписьПоТекущимДаннымТабличногоПоляЗавершение(РезультатВопроса, ДопПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		УдалитьИзРегистраСведенийЗаписьПоТекущимДаннымТабличногоПоляНаСервере(ДопПараметры.ИмяРегистраСведений, ДопПараметры.ЗначениеОтбора);
		ИмяСтраницы = СтраницаФормыПоИмениКолонкиТаблицы(ДопПараметры.ИмяКолонки);
    	ОбновитьСписокПоИмениСтраницы(ИмяСтраницы);
    КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СтраницаФормыПоИмениКолонкиТаблицы(ИмяКолонки)
    Перем Результат;
    
    Если ИмяКолонки = "Организация" Тогда
        Результат = "ГруппаОрганизации";
    ИначеЕсли ИмяКолонки = "Контрагент" Тогда
    	Результат = "ГруппаКонтрагенты";
    ИначеЕсли ИмяКолонки = "ТочкаДоставки" Тогда
    	Результат = "ГруппаТочкиДоставки";
    КонецЕсли;		
    
    Возврат Результат;
КонецФункции
//Создание/редактирование строк регистров сведений ЭКОМ
&НаКлиенте
Процедура ОткрытьФормуПоИмениКолонкиТабличногоПоля(ИмяКолонки = "Организация", ЗначениеДляОткрытия = Неопределено, Копирование = Ложь)
    Если ИмяКолонки = "Организация" Тогда
    	ИмяФормыДляОткрытия = "УФ_ФормаОрганизации";
    ИначеЕсли ИмяКолонки = "Контрагент" Тогда
    	ИмяФормыДляОткрытия = "УФ_ФормаКонтрагента";
    ИначеЕсли ИмяКолонки = "ТочкаДоставки" Тогда
    	ИмяФормыДляОткрытия = "УФ_ФормаТочкиДоставки";
    КонецЕсли;		
    
    ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить(ИмяКолонки, ЗначениеДляОткрытия);	
    ПараметрыФормы.Вставить("Копирование", Копирование);	
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяФормы", ИмяФормыДляОткрытия);
    
    ПараметрыФормы.Вставить("ДопПараметры", ДопПараметры);
    
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);	
	ОткрытьФорму(ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма." + ИмяФормыДляОткрытия, ПараметрыФормы, ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
    
КонецПроцедуры

&НаКлиенте
Функция ЗначениеТабличногоПоляПоИмениКолонки(ИмяКолонки = "Организация")
    
    Если ИмяКолонки = "Организация" Тогда
    	ОбрабатываемыйСписок = Элементы.СписокОрганизаций;
    ИначеЕсли ИмяКолонки = "Контрагент" Тогда
    	ОбрабатываемыйСписок = Элементы.СписокКонтрагентов;
    ИначеЕсли ИмяКолонки = "ТочкаДоставки" Тогда
    	ОбрабатываемыйСписок = Элементы.СписокТочекДоставок;
    КонецЕсли;		
    
    ТекущиеДанныеСписка = ОбрабатываемыйСписок.ТекущиеДанные;
    Если ТекущиеДанныеСписка = Неопределено Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    Результат = ТекущиеДанныеСписка[ИмяКолонки];
    
    Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуЗаписиРегистраСведенийЭКОМ(ИмяКолонки = "Организация", СтандартнаяОбработка, Копирование = Ложь, ПередаватьЗначениеОбъекта = Истина)
    Перем ЗначениеПоискаДанныхВРегистре;
    
    Если ПередаватьЗначениеОбъекта = Истина Тогда
        ЗначениеПоискаДанныхВРегистре = ЗначениеТабличногоПоляПоИмениКолонки(ИмяКолонки);
    КонецЕсли;
    
    СтандартнаяОбработка = Ложь;
    ОткрытьФормуПоИмениКолонкиТабличногоПоля(ИмяКолонки, ЗначениеПоискаДанныхВРегистре, Копирование);
    
КонецПроцедуры


//*******************************************************
&НаКлиенте
Процедура СписокКонтрагентовПередНачаломДобавления(Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
    
    ОткрытьФормуЗаписиРегистраСведенийЭКОМ("Контрагент", Отказ, Копирование);
    
КонецПроцедуры

&НаКлиенте
Процедура СписокКонтрагентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    ОткрытьФормуЗаписиРегистраСведенийЭКОМ("Контрагент", СтандартнаяОбработка, Ложь);
    
КонецПроцедуры

&НаКлиенте
Процедура СписокКонтрагентовПриНачалеРедактирования(НоваяСтрока, Копирование)
    ОткрытьФормуЗаписиРегистраСведенийЭКОМ("Контрагент", Неопределено, Копирование);
КонецПроцедуры

&НаКлиенте
Процедура СписокТочекДоставокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    ОткрытьФормуЗаписиРегистраСведенийЭКОМ("ТочкаДоставки", СтандартнаяОбработка, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СписокТочекДоставокПередНачаломДобавления(Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
    Перем СтандартнаяОбработка;
    
    ОткрытьФормуЗаписиРегистраСведенийЭКОМ("ТочкаДоставки", Отказ, Копирование);
КонецПроцедуры

&НаКлиенте
Процедура СписокТочекДоставокПриНачалеРедактирования(НоваяСтрока, Копирование)
    ОткрытьФормуЗаписиРегистраСведенийЭКОМ("ТочкаДоставки", Неопределено, Копирование);    
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПоИмениСтраницы(ИмяСтраницы);
    
    Если ИмяСтраницы = "ГруппаОрганизации" Тогда
        Элементы.СписокОрганизаций.Обновить();
	ИначеЕсли ИмяСтраницы = "ГруппаКонтрагенты" Тогда
		Элементы.СписокКонтрагентов.Обновить();
	ИначеЕсли ИмяСтраницы = "ГруппаТочкиДоставки" Тогда
		Элементы.СписокТочекДоставок.Обновить();
	ИначеЕсли ИмяСтраницы = "ГруппаНоменклатура_Контрагентов" Тогда
		Элементы.СписокНоменклатурыКонтрагентов.Обновить();
	ИначеЕсли ИмяСтраницы = "ГруппаНастройкаСоответсвий" Тогда
		Элементы.СписокСоответствий.Обновить();
	ИначеЕсли ИмяСтраницы = "ГруппаОбновления" Тогда
		ЗаполнитьИсториюТаблицыОбновлений();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокОрганизацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокОрганизацийПриНажатииНаСтроку(Поле.Имя, ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОрганизацийПриНажатииНаСтроку(КолонкаИмя, ВыбраннаяСтрока)
	
	Если КолонкаИмя = "СписокОрганизацийПрофильОбмена" Тогда		
		ФормаВыбора = ПолучитьФорму("Справочник.ЭКОМ_ПрофилиОбмена.ФормаВыбора");
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);
		
		ПараметрыФормы      = Новый Структура("РежимВыбора, ЗакрыватьПриВыборе", Истина, Истина);		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаВыбораПрофиляОбмена", ЭтаФорма, ДопПараметры);	
		ОткрытьФорму("Справочник.ЭКОМ_ПрофилиОбмена.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
  	Иначе
		ОткрытьФормуЗаписиРегистраСведенийЭКОМ("Организация", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПрофиляОбмена(РезультатВыбора, ДопПараметры) Экспорт
	
	ВыбраннаяСтрока = Элементы.СписокОрганизаций.ДанныеСтроки(ДопПараметры.ВыбраннаяСтрока);
	Если ЗначениеЗаполнено(РезультатВыбора) Тогда
		ЗаписатьПрофильОбмена(РезультатВыбора, ВыбраннаяСтрока.Организация);
		
		Элементы.СписокОрганизаций.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПрофильОбмена(ПрофильОбмена, Организация) Экспорт
	
		МенеджеЗаписи = РегистрыСведений.ЭКОМ_GLN.СоздатьМенеджерЗаписи();
		МенеджеЗаписи.Объект = Организация;
		МенеджеЗаписи.Прочитать();
		
		МенеджеЗаписи.ПрофильОбмена = ПрофильОбмена;
		МенеджеЗаписи.Записать();
		
КонецПроцедуры

&НаКлиенте
Процедура СписокОрганизацийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
    ОткрытьФормуЗаписиРегистраСведенийЭКОМ("Организация", Отказ, Копирование);
КонецПроцедуры

&НаКлиенте
Процедура СписокОрганизацийПередНачаломИзменения(Элемент, Отказ)
    ОткрытьФормуЗаписиРегистраСведенийЭКОМ("Организация", Неопределено, Ложь);
    Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаписьЭКОМ_GLN_Организации(Команда)
    ОткрытьФормуЗаписиРегистраСведенийЭКОМ("Организация", Неопределено, Ложь, Ложь);
КонецПроцедуры


&НаКлиенте
Процедура СкопироватьЗаписьЭКОМ_GLN_Организации(Команда)
    ОткрытьФормуЗаписиРегистраСведенийЭКОМ("Организация", Неопределено, Истина);
КонецПроцедуры


&НаКлиенте
Процедура СоздатьЗаписьЭКОМ_GLN_Контрагенты(Команда)
    ОткрытьФормуЗаписиРегистраСведенийЭКОМ("Контрагент", Неопределено, Ложь, Ложь);
КонецПроцедуры


&НаКлиенте
Процедура СкопироватьЗаписьЭКОМ_GLN_Контрагенты(Команда)
    ОткрытьФормуЗаписиРегистраСведенийЭКОМ("Контрагент", Неопределено, Истина);
КонецПроцедуры


&НаКлиенте
Процедура УдалитьЗаписьЭКОМ_GLN_Организации(Команда)
    УдалитьИзРегистраСведенийЗаписьПоТекущимДаннымТабличногоПоля(СписокОрганизаций, "Организация", "ЭКОМ_GLN");
КонецПроцедуры


&НаКлиенте
Процедура УдалитьЗаписьЭКОМ_GLN_Контрагенты(Команда)
    УдалитьИзРегистраСведенийЗаписьПоТекущимДаннымТабличногоПоля("СписокКонтрагентов", "Контрагент", "ЭКОМ_GLN");
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗаписьЭКОМ_GLN_ТочкиДоставки(Команда)
    УдалитьИзРегистраСведенийЗаписьПоТекущимДаннымТабличногоПоля("СписокТочекДоставки", "ТочкаДоставки", "ЭКОМ_ТочкиДоставки");
КонецПроцедуры

&НаСервере
Процедура ОтборДинамическогоСписка(ИмяСписка)
    
    ДинамическийСписокДляОбработки = ЭтаФорма[ИмяСписка];
	ДинамическийСписокДляОбработки.Отбор.Элементы.Очистить();
	
	ИмяПоляСписка = Неопределено;
	
	Если ИмяСписка = "СписокОрганизация" Тогда
		ЗначениеОтбора = ЭтаФорма.ОрганизацияОтбор;
        ИмяПоляСписка  = "Организация";
    ИначеЕсли ИмяСписка = "СписокКонтрагентов" Тогда
        ЗначениеОтбора = ЭтаФорма.КонтрагентОтбор;
        ИмяПоляСписка  = "Контрагент";
    ИначеЕсли ИмяСписка = "СписокТочекДоставок" Тогда
		ЗначениеОтбора = ЭтаФорма.Владелец;
		ИмяПоляСписка  = "ТочкаДоставки";
	ИначеЕсли ИмяСписка = "СписокСоответствий" Тогда
		Если НЕ ЭтаФорма.ФильтрПоСоответствиям.Количество() = 0 Тогда
			ЗначениеОтбора = ЭтаФорма.ФильтрПоСоответствиям[0].Значение;
			ИмяПоляСписка  = "Тип";
		КонецЕсли;
	КонецЕсли;
    
	Если ИмяПоляСписка = Неопределено 
		ИЛИ ЗначениеЗаполнено(ЗначениеОтбора) = Ложь Тогда     
        Возврат;
    КонецЕсли;
	
	ЭлементОтбора = ДинамическийСписокДляОбработки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));      
    ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяПоляСписка);
    ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.ПравоеЗначение = ЗначениеОтбора;
    ЭлементОтбора.ИдентификаторПользовательскойНастройки = ИмяСписка;
    
КонецПроцедуры
&НаКлиенте
Процедура ОтборПоКонтрагенту(Команда)
    ОтборДинамическогоСписка("СписокКонтрагентов");
КонецПроцедуры


&НаКлиенте
Процедура КонтрагентОтборПриИзменении(Элемент)
    ОтборДинамическогоСписка("СписокКонтрагентов");
КонецПроцедуры


&НаКлиенте
Процедура КонтрагентОтборОчистка(Элемент, СтандартнаяОбработка)
    ОтборДинамическогоСписка("СписокКонтрагентов");
КонецПроцедуры


&НаКлиенте
Процедура СоздатьЗаписьЭКОМ_ТочкиДоставки(Команда)
    ОткрытьФормуЗаписиРегистраСведенийЭКОМ("ТочкаДоставки", Неопределено, Ложь, Ложь);
КонецПроцедуры


&НаКлиенте
Процедура СкопироватьЗаписьЭКОМ_ТочкиДоставки(Команда)
    ОткрытьФормуЗаписиРегистраСведенийЭКОМ("ТочкаДоставки", Неопределено, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_Состояние(ТекстСообщения = "", Прогресс = Неопределено, Пояснение = "")
    Состояние(ТекстСообщения, Прогресс, Пояснение, БиблиотекаКартинок.ЭКОМ_ОбщаяКартинка);		
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
    ОтборДинамическогоСписка("СписокТочекДоставок");
КонецПроцедуры

// Процедура сохраняет последнюю страницу, на которую перешел пользователь
//
&НаСервереБезКонтекста
Процедура ЗаписатьТекущуюСтраницуНаСервере(ИмяТекущейСтраницы, МассивЛогаСобытий)
	
	Если ИмяТекущейСтраницы <> "ГруппаНастройкаСоответсвий" Тогда
		Результат = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкаПараметрЗаписать(""СлужебныйСтраницаНастроекМодуляПриЗакрытии"", ИмяТекущейСтраницы, ""Служебный"", МассивЛогаСобытий)");
    КонецЕсли;
	
КонецПроцедуры // ЗаписатьТекущуюСтраницуНаСервере()

&НаКлиенте
Процедура ПроверкаКодаНаФормеАРМЗавершение(Параметры)
    
    МассивЛогаСобытий = Параметры.МассивЛогаСобытий;
 	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Попытка
			Выполнить("ЭКОМ_ОбщегоНазначения.ЗаписатьЛогСобытийвРегистрЛогирование(МассивЛогаСобытий);");
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Вычислить("ЭКОМ_ОбщегоНазначения.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий)");
			Сообщение.Сообщить();
		КонецПопытки;
	 Иначе
        КомментарийКТекстуЗапроса = "";

	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПолучитьКолонкиТабличнойЧастиОбновитьТЗВидимостиКолонок(ТипДинамическогоСписка)
    
    ИмяНастройки = ?(ТипДинамическогоСписка = "Поставщик", "СлужебныйЗапросДляФормыПоставщика", "СлужебныйЗапросДляФормыПокупателя");
    
    ТекстКода        = НастройкаПрочитатьОбщийМодуль(ИмяНастройки, "", "Служебный");
    ИмяЭлементаФормы = "Группа" + ТипДинамическогоСписка;
    
    МассивЛогаСобытий = Новый Массив;
    ПараметрыПроверки = Новый Структура;
    ПараметрыПроверки.Вставить("Текст"           , ТекстКода);
	ПараметрыПроверки.Вставить("ИмяЭлементаФормы", ИмяЭлементаФормы);
	ПараметрыПроверки.Вставить("МассивЛогаСобытий"   , МассивЛогаСобытий);
	ПараметрыПроверки.Вставить("ЗакрытьПослеПроверки", Ложь);
	ПараметрыПроверки.Вставить("ФормаДляОповещения"  , "Обработка.УФ_Форма");
	
    Оповестить("ЭКОМ_ПроверитьФормулуНаФорме", ПараметрыПроверки);
    
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКолонкиТабличнойЧастиАРМаПоставщик(Команда)
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ТипОбмена", "Поставщик");
	ПараметрыОповещения.Вставить("ФормаДляОповещения", "Обработка.УФ_Форма");
    Оповестить("ОбновитьКолонкиДинамическогоСписка", ПараметрыОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКолонкиТабличнойЧастиАРМаСеть(Команда)
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ТипОбмена", "Сеть");
	ПараметрыОповещения.Вставить("ФормаДляОповещения", "Обработка.УФ_Форма");
    Оповестить("ОбновитьКолонкиДинамическогоСписка", ПараметрыОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_ПрочиеНастройкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекЭлемент = ЭтаФорма.ЭКОМ_ПрочиеНастройки.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если Поле.Имя = "ЭКОМ_ПрочиеНастройкиЗапросДляТабличнойЧасти" Тогда
		
		ЗапросПоУмолчанию = "";
		ТекстЗапроса = "";
		Если ТекЭлемент.ТипОбмена = "Поставщик" Тогда
			
			ТекстЗапроса = ИнтерфейсНастройкаТабличнойЧастиНаСервере("СлужебныйЗапросДляФормыПоставщика");
			Заголовок    = "Введите запрос для получения полей формы поставщика";
			Имя = "ГруппаПоставщик";
			
		ИначеЕсли ТекЭлемент.ТипОбмена = "Сеть" Тогда	
			
			ТекстЗапроса = ИнтерфейсНастройкаТабличнойЧастиНаСервере("СлужебныйЗапросДляФормыПокупателя");
			Заголовок    = "Введите запрос для получения полей формы покупателя";
			Имя = "ГруппаПокупатель";
			
		ИначеЕсли ТекЭлемент.ТипОбмена = "ЭТРН" Тогда	
			
			ТекстЗапроса = ИнтерфейсНастройкаТабличнойЧастиНаСервере("СлужебныйЗапросДляФормыЭТРН");
			Заголовок    = "Введите запрос для получения полей формы ЭТРН";
			Имя = "ГруппаЭТРН";
			
		ИначеЕсли ТекЭлемент.ТипОбмена = "Неструкт. докум." Тогда	
			
			ТекстЗапроса = ИнтерфейсНастройкаТабличнойЧастиНаСервере("СлужебныйЗапросДляФормыCondra");
			Заголовок    = "Введите запрос для получения полей формы неструктурированных документов";
			Имя = "ГруппаCondra";	
			
		ИначеЕсли ТекЭлемент.ТипОбмена = "Прайс-лист" Тогда	
			
			ЭтоУправляемаяФорма = Истина;
			ТекстЗапроса = ИнтерфейсНастройкаТабличнойЧастиНаСервере("СлужебныйЗапросДляФормыПрайсЛист");
			Заголовок    = "Введите запрос для получения полей формы прайс-лист";
			Имя = "ГруппаПрайсЛист";	
			
		КонецЕсли;
		
		ЗаписатьЗапрос = Ложь;
		Если НЕ ЗначениеЗаполнено(ТекстЗапроса) Тогда
		     ТекстЗапроса = ЗапросПоУмолчанию;
			 ЗаписатьЗапрос = Истина;
		КонецЕсли;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ИмяФормы"        , "УФ_ФормаКонсольЗапросов");
		ДопПараметры.Вставить("ИмяЭлементаФормы", Имя);
		
		ДопПараметры.Вставить("ЭКОМ_ОбменCondra"    , ЭтаФорма.ЭКОМ_ОбменCondra);
		ДопПараметры.Вставить("ЭКОМ_ОбменСеть"      , ЭтаФорма.ЭКОМ_ОбменСеть);
		ДопПараметры.Вставить("ЭКОМ_ОбменЭТРН"      , ЭтаФорма.ЭКОМ_ОбменЭТРН);
		ДопПараметры.Вставить("ЭКОМ_ОбменПоставщик" , ЭтаФорма.ЭКОМ_ОбменПоставщик);
		ДопПараметры.Вставить("ЭКОМ_ОбменПрайсЛист" , ЭтаФорма.ЭКОМ_ОбменПрайсЛист);
		ДопПараметры.Вставить("ЗаписатьЗапрос"      , ЗаписатьЗапрос);

		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("Заголовок"     , Заголовок);
		ПараметрыФормы.Вставить("ТекстНачальный", ТекстЗапроса);
		ПараметрыФормы.Вставить("СправкаКФорме" , "Пример кода:
		|ТекстЗапроса = ""Здесь текст запроса"";");
		
		ПараметрыФормы.Вставить("ДопПараметры", ДопПараметры);
		
		ОткрытьФорму(ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаКонсольЗапросов", ПараметрыФормы,,,,,ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли Поле.Имя = "ЭКОМ_ПрочиеНастройкиПодпискаДляДокументов" Тогда

		Если ТекЭлемент.ТипОбмена = "Поставщик" Тогда			
			Имя = "ПодпискаДляДокументовПоставщик";
			ТекстЗапроса = ИнтерфейсНастройкаТабличнойЧастиНаСервере("СлужебныйЗапросДляПодпискиДокументовПоставщик");
			
		ИначеЕсли ТекЭлемент.ТипОбмена = "Сеть" Тогда			
			Имя = "ПодпискаДляДокументовСеть";
			ТекстЗапроса = ИнтерфейсНастройкаТабличнойЧастиНаСервере("СлужебныйЗапросДляПодпискиДокументовСеть");
			
		ИначеЕсли ТекЭлемент.ТипОбмена = "ЭТРН" Тогда					
			Имя = "ПодпискаДляДокументовЭТРН";
			ТекстЗапроса = ИнтерфейсНастройкаТабличнойЧастиНаСервере("СлужебныйЗапросДляПодпискиДокументовЭТРН");
			
		ИначеЕсли ТекЭлемент.ТипОбмена = "Неструкт. докум." Тогда					
			Имя = "ПодпискаДляДокументовCondra";
			ТекстЗапроса = ИнтерфейсНастройкаТабличнойЧастиНаСервере("СлужебныйЗапросДляПодпискиДокументовCondra");
			
		ИначеЕсли ТекЭлемент.ТипОбмена = "Прайс-лист" Тогда				
			Имя = "ПодпискаДляДокументовПрайсЛист";
			ТекстЗапроса = ИнтерфейсНастройкаТабличнойЧастиНаСервере("СлужебныйЗапросДляПодпискиДокументовПрайсЛист");

		КонецЕсли;
											
		Заголовок = "Введите алгоритм для заполнения подписки на документы - " + ТекЭлемент.ТипОбмена;
							
		ИмяОткрываемойФормы = ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаКонсольЗапросов";
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ИмяТабличнойЧасти", "СтруктураФайлаXMLИсходящие");
		ДопПараметры.Вставить("ИмяФормы"         , "УФ_ФормаКонсольЗапросов");
		ДопПараметры.Вставить("ИмяЭлементаФормы" , Имя);
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок"     , Заголовок);
		ПараметрыФормы.Вставить("ТекстНачальный", ТекстЗапроса);
        ПараметрыФормы.Вставить("СправкаКФорме" , "Пример кода:
		|ТекстЗапроса = ""Здесь текст запроса"";");

        ПараметрыФормы.Вставить("ДопПараметры", ДопПараметры);
		
		ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы,,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	ИначеЕсли Поле.Имя = "ЭКОМ_ПрочиеНастройкиСохранитьЗапросТЧ" Тогда
		
		ПараметрыСохранения = Новый Структура;
		ПараметрыСохранения.Вставить("НачалоКонстанты", "СлужебныйЗапросДляФормы");
        ПараметрыСохранения.Вставить("ВидНастройки", "Запрос");
		
		СохранитьТекстЗапросаПодпискиXML(Элемент, ПараметрыСохранения);
		
	ИначеЕсли Поле.Имя = "ЭКОМ_ПрочиеНастройкиЗагрузитьЗапросТЧ" Тогда
		
		ПараметрыВосстановления = Новый Структура;
		ПараметрыВосстановления.Вставить("НачалоКонстанты", "СлужебныйЗапросДляФормы");
        ПараметрыВосстановления.Вставить("ВидНастройки", "Запрос");
		
		ВосстановитьТекстЗапросаПодписки(Элемент, ПараметрыВосстановления);
		
	ИначеЕсли Поле.Имя = "ЭКОМ_ПрочиеНастройкиСохранитьАлгоритмПодписки" Тогда
		
		ПараметрыСохранения = Новый Структура;
		ПараметрыСохранения.Вставить("НачалоКонстанты", "СлужебныйЗапросДляПодписки");
        ПараметрыСохранения.Вставить("ВидНастройки", "Подписка");
		
		СохранитьТекстЗапросаПодпискиXML(Элемент, ПараметрыСохранения);
		
	ИначеЕсли Поле.Имя = "ЭКОМ_ПрочиеНастройкиЗагрузитьАлгоритмПодписки" Тогда
		
		ПараметрыВосстановления = Новый Структура;
		ПараметрыВосстановления.Вставить("НачалоКонстанты", "СлужебныйЗапросДляПодписки");
        ПараметрыВосстановления.Вставить("ВидНастройки", "Подписка");
		
		ВосстановитьТекстЗапросаПодписки(Элемент, ПараметрыВосстановления);
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьТекстЗапросаПодпискиXML(ТабличоеПоле, ПараметрыСохранения)
	
	ДанныеОС 		  = ЭКОМ_ОбщегоНазначенияКлиент.ЭКОМ_ПолучитьРазделительПутиОСКлиента();
	РазделительПути   = ДанныеОС.Получить("РазделительПути");
	ВерсияОбработки   = ПолучитьВерсиюОбработкиНаСервере();
	ТекущиеДанные = ТабличоеПоле.ТекущиеДанные;
	МассивКонстант = Новый Массив;
	ВыбранныеТипы = Новый Массив;
	
	ИменаПрочихНастроек = Новый Соответствие;
	ИменаПрочихНастроек.Вставить("СетьПодписка", "ДокументовСеть");
	ИменаПрочихНастроек.Вставить("СетьЗапрос", "Покупателя");
	ИменаПрочихНастроек.Вставить("ПоставщикПодписка", "ДокументовПоставщик");
	ИменаПрочихНастроек.Вставить("ПоставщикЗапрос", "Поставщика");
	ИменаПрочихНастроек.Вставить("Прайс-листЗапрос", "ПрайсЛист");
	ИменаПрочихНастроек.Вставить("Прайс-листПодписка", "ПрайсЛист");
	ИменаПрочихНастроек.Вставить("Неструкт. докум.Запрос", "Condra");
	ИменаПрочихНастроек.Вставить("Неструкт. докум.Подписка", "ДокументовCondra");
	ИменаПрочихНастроек.Вставить("ЭТРНЗапрос", "ЭТРН");
	ИменаПрочихНастроек.Вставить("ЭТРНПодписка", "ДокументовЭТРН");	
	
	ИмяФайлаПоУмолчанию = ПараметрыСохранения.НачалоКонстанты + ИменаПрочихНастроек.Получить(ТекущиеДанные.ТипОбмена  + ПараметрыСохранения.ВидНастройки);
	
	МассивКонстант.Добавить(ИмяФайлаПоУмолчанию);	
	ФайлыНастроек = ПолучитьФайлыНастроекЗапросПодписка(ВыбранныеТипы, МассивКонстант);
		
	Если ФайлыНастроек = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сохранение пустого текста настроек невозможно";
		Сообщение.Сообщить();
	Иначе
		Для Каждого ЭлементОсновной Из ФайлыНастроек Цикл	
			Для Каждого Элемент Из ЭлементОсновной.Значение Цикл			
				АдресВоВременномХранилище = Элемент.Значение;				
				СохранениеФайла(АдресВоВременномХранилище,Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьИмяСохраняемогоФайла(ВерсияОбработки, ИмяФайлаПоУмолчанию, ""СлужебныйЗапрос"")"));			
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьТекстЗапросаПодписки(ТабличоеПоле, ПараметрыВосстановления)
	
	ТекущиеДанные = ТабличоеПоле.ТекущиеДанные;
	
	ИменаПрочихНастроек = Новый Соответствие;
	ИменаПрочихНастроек.Вставить("СетьПодписка", "ДокументовСеть");
	ИменаПрочихНастроек.Вставить("СетьЗапрос", "Покупателя");
	ИменаПрочихНастроек.Вставить("ПоставщикПодписка", "ДокументовПоставщик");
	ИменаПрочихНастроек.Вставить("ПоставщикЗапрос", "Поставщика");
	ИменаПрочихНастроек.Вставить("Прайс-листЗапрос", "ПрайсЛист");
	ИменаПрочихНастроек.Вставить("Прайс-листПодписка", "ПрайсЛист");
	ИменаПрочихНастроек.Вставить("Неструкт. докум.Запрос", "Condra");
	ИменаПрочихНастроек.Вставить("Неструкт. докум.Подписка", "ДокументовCondra");
	ИменаПрочихНастроек.Вставить("ЭТРНЗапрос", "ЭТРН");
	ИменаПрочихНастроек.Вставить("ЭТРНПодписка", "ДокументовЭТРН");	
	
	ИмяТекстаЗапроса = ПараметрыВосстановления.НачалоКонстанты + ИменаПрочихНастроек.Получить(ТекущиеДанные.ТипОбмена  + ПараметрыВосстановления.ВидНастройки);	
	     
	ОбработкаОкончанияПомещения = Новый ОписаниеОповещения("ОповещениеВыборФайлаНастройки", ЭтаФорма, ИмяТекстаЗапроса);
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Фильтр             = "Настройка по документу (*.xml)|*.xml|Текстовый документ(*.txt)|*.txt";
	ДиалогОткрытияФайла.ИндексФильтра      = 0; 
	НачатьПомещениеФайлов(ОбработкаОкончанияПомещения, , ДиалогОткрытияФайла, Истина, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВыборФайлаНастройки(ВыбранныеФайлы, ИмяТекстаЗапроса) Экспорт
	
    Если ВыбранныеФайлы = Неопределено Тогда
        Возврат;
    КонецЕсли;    
	
	Если ВыбранныеФайлы.Количество() = 1 Тогда	
		
		ВыбФайл  = ВыбранныеФайлы[0];
		ПолноеИмяФайла = ВыбФайл.ПолноеИмя;
		ИмяФайла = ВыбФайл.Имя;
		
		Файл = Новый Файл(ПолноеИмяФайла);
		Если НЕ Файл.Существует() Тогда
			Сообщить("Найстройки не загружены. Выбранного файла не существует.");
			Возврат;
		КонецЕсли;
		
		Если НРег(Файл.Расширение) = ".1ct" Тогда
			ФайлТЗ = Новый ТекстовыйДокумент;
			ФайлТЗ.Прочитать(ПолноеИмяФайла); 
			ТекстЗапроса = XMLЗначение(Тип("ХранилищеЗначения"), ФайлТЗ.ПолучитьТекст()).Получить();
		ИначеЕсли НРег(Файл.Расширение) = ".xml" Тогда
			НовоеЧтениеXML = Новый ЧтениеXML;
			НовоеЧтениеXML.ОткрытьФайл(ПолноеИмяФайла);
			НовыйСериализаторXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
			ТекстЗапроса = НовыйСериализаторXDTO.ПрочитатьXML(НовоеЧтениеXML);
		ИначеЕсли НРег(Файл.Расширение) = ".txt" Тогда
			Файл =  Новый ЧтениеТекста(ПолноеИмяФайла, КодировкаТекста.UTF8);
			ТекстЗапроса = Файл.Прочитать();
		Иначе
			Предупреждение("Формат <" + НРег(Файл.Расширение) + "> не поддерживается!", СтатусСообщения.Информация);
			Возврат;
		КонецЕсли;
		
		
		ПараметрыФункции = Новый Массив;
		ПараметрыФункции.Добавить("_" +ИмяТекстаЗапроса);		
		ПараметрыФункции.Добавить(ТекстЗапроса);
		ПараметрыФункции.Добавить("Служебный");
		НастройкаЗаписана = ВернутьРезультатИзМодуляОбъекта("Настройка_Параметр_Записать", ПараметрыФункции);
		ОбновитьВсеРолиНаСервере();

	КонецЕсли;
	
	Если НастройкаЗаписана = 1 Или НастройкаЗаписана = Истина Тогда  
		Состояние("Настройки загружены!",100, ИмяФайла, БиблиотекаКартинок.ЭКОМ_ОбщаяКартинка);
		ОбновитьВсеРолиНаСервере();
	КонецЕсли;
КонецПроцедуры 


&НаКлиенте
Процедура ЭКОМ_ПрочиеНастройкиПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено 
		ИЛИ Элемент.ТекущаяСтрока = Неопределено Тогда
    	Возврат;
	КонецЕсли;
	
	Элементы.ГруппаРольЭТРН.Видимость = Ложь;
	Если Элемент.ТекущиеДанные.ТипОбмена = "ЭТРН" Тогда		 
		 Элементы.ГруппаРольЭТРН.Видимость = Истина;
		 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_ПрочиеНастройкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Элемент.ТекущиеДанные = Неопределено 
		ИЛИ Элемент.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.ТипОбмена = "Сеть" Тогда
		ЭтаФорма.ЭКОМ_ОбменСеть = Элемент.ТекущиеДанные.Использовать;
		ЗаполнитьСписокДляИзменения(ЭтаФорма.ЭКОМ_ОбменСеть, "ЭКОМ_ОбменСеть");
		
	ИначеЕсли Элемент.ТекущиеДанные.ТипОбмена = "Поставщик" Тогда
		ЭтаФорма.ЭКОМ_ОбменПоставщик = Элемент.ТекущиеДанные.Использовать;
		ЗаполнитьСписокДляИзменения(ЭтаФорма.ЭКОМ_ОбменПоставщик, "ЭКОМ_ОбменПоставщик");
		
	ИначеЕсли Элемент.ТекущиеДанные.ТипОбмена = "ЭТРН" Тогда
		ЭтаФорма.ЭКОМ_ОбменЭТРН = Элемент.ТекущиеДанные.Использовать;
		ЗаполнитьСписокДляИзменения(ЭтаФорма.ЭКОМ_ОбменЭТРН, "ЭКОМ_ОбменЭТРН");
		
		Если ЭтаФорма.ЭКОМ_ТипОбменаЭТРН_Отправитель = Ложь
			И ЭтаФорма.ЭКОМ_ТипОбменаЭТРН_Получатель = Ложь
			И ЭтаФорма.ЭКОМ_ТипОбменаЭТРН_Перевозчик = Ложь Тогда
			  ЭтаФорма.ЭКОМ_ТипОбменаЭТРН_Отправитель = Истина;
			  ЗаполнитьСписокДляИзменения(ЭтаФорма.ЭКОМ_ТипОбменаЭТРН_Отправитель, "ЭКОМ_ТипОбменаЭТРН_Отправитель");
		КонецЕсли;
		
	ИначеЕсли Элемент.ТекущиеДанные.ТипОбмена = "Неструкт. докум." Тогда
		ЭтаФорма.ЭКОМ_ОбменCondra = Элемент.ТекущиеДанные.Использовать;
		ЗаполнитьСписокДляИзменения(ЭтаФорма.ЭКОМ_ОбменCondra, "ЭКОМ_ОбменCondra");
		
	ИначеЕсли Элемент.ТекущиеДанные.ТипОбмена = "Прайс-лист" Тогда
		ЭтаФорма.ЭКОМ_ОбменПрайсЛист = Элемент.ТекущиеДанные.Использовать;
		ЗаполнитьСписокДляИзменения(ЭтаФорма.ЭКОМ_ОбменПрайсЛист, "ЭКОМ_ОбменПрайсЛист");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсточникДляИсходящихДокументов(АлгоритмЗаполненияСписка, СписокВыбора)
	
	ТекстЗапроса = "";
	
	Попытка
		
		Выполнить(АлгоритмЗаполненияСписка);
		Запрос = Новый Запрос;		               
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ДатаНач", ТекущаяДата());
		Запрос.УстановитьПараметр("ДатаКон", ТекущаяДата());	
		Запрос.УстановитьПараметр("масПомеченныхДоков", Новый Массив);
		Запрос.УстановитьПараметр("НаправлениеОбмена" , Перечисления.ЭКОМ_НаправлениеОбмена.ПустаяСсылка());
		
		РезультатЗапроса = Запрос.Выполнить();
		КолонкиЗапроса = РезультатЗапроса.Колонки;				
		Для каждого ТекКолонка Из КолонкиЗапроса Цикл
			СписокВыбора.Добавить(ТекКолонка.Имя);			
		КонецЦикла;
		
	Исключение				
	КонецПопытки;
	     
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоСоответствиямНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокФильтров = Новый СписокЗначений;
	СписокФильтров.Добавить("Организация_"   , "Организация");
    СписокФильтров.Добавить("Контрагент_"    , "Контрагент");
	СписокФильтров.Добавить("ТочкаДоставки_" , "Точка доставки");
	СписокФильтров.Добавить("Номенклатура_"  , "Номенклатура");
	
	НачальноеЗначение = 0;
	Если НЕ ЭтаФорма.ФильтрПоСоответствиям.Количество() = 0  Тогда
		НайденноеЗначение = СписокФильтров.НайтиПоЗначению(ЭтаФорма.ФильтрПоСоответствиям[0].Значение);
		Если НЕ НайденноеЗначение = Неопределено Тогда
			НачальноеЗначение = СписокФильтров.Индекс(НайденноеЗначение);
		КонецЕсли;
	КонецЕсли;
		
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ДанныеВыбора", ДанныеВыбора);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьПослеВыбораФильтра", ЭтаФорма, ПараметрыОповещения);
	ПоказатьВыборИзСписка(ОписаниеОповещения, СписокФильтров, Элемент, НачальноеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораФильтра(ВыбранныйЭлемент, ПараметрыОповещения) Экспорт 
	
	Если НЕ ВыбранныйЭлемент = Неопределено Тогда
		
		ЭтаФорма.ФильтрПоСоответствиям.Очистить();
		ЭтаФорма.ФильтрПоСоответствиям.Добавить(ВыбранныйЭлемент.Значение, ВыбранныйЭлемент.Представление);
		
		ОтборДинамическогоСписка("СписокСоответствий");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоСоответствиямПриИзменении(Элемент)
	ОтборДинамическогоСписка("СписокСоответствий");
КонецПроцедуры

&НаКлиенте
Процедура СменитьТекущуюСтраницу(ИмяСтраницы) Экспорт
       
    Если НЕ ЗначениеЗаполнено(ИмяСтраницы) Тогда
        ИмяСтраницы = "ГруппаОрганизации";
    КонецЕсли;
    
    ТекСтраницаЗначение = Элементы.ГруппаПанельНастроек.ПодчиненныеЭлементы.Найти(ИмяСтраницы);
    
    Если ТекСтраницаЗначение = Неопределено Тогда
        ИмяСтраницы         = "ГруппаОрганизации";
        ТекСтраницаЗначение = Элементы.ГруппаПанельНастроек.ПодчиненныеЭлементы.Найти(ИмяСтраницы);
    КонецЕсли;
    
    Элементы.ГруппаПанельНастроек.ТекущаяСтраница = ТекСтраницаЗначение;
    ПриСменеСтраницыНастроек(ТекСтраницаЗначение);
          
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗапросНаАвтоОбменПокупательSTATUSИсходящий(Команда)
	
	ПараметрыФункции = Новый Массив;
	ПараметрыФункции.Добавить("ЗапросНаАвтоОбменПоставщикSTATUSИсходящий");		
	ПараметрыФункции.Добавить("");
    ПараметрыФункции.Добавить("Служебный");
	ПараметрыФункции.Добавить(Ложь);
	
	ТекстЗапроса = ВернутьРезультатИзМодуляОбъекта("Настройка_Параметр_Прочитать", ПараметрыФункции);
			
	ИмяОткрываемойФормы = ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаКонсольЗапросов";
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяФормы"         , "УФ_ФормаКонсольЗапросов");
	ДопПараметры.Вставить("ИмяЭлементаФормы" , "АвтоОбмен");
	ДопПараметры.Вставить("ИмяЗапроса"       , "_ЗапросНаАвтоОбменПоставщикSTATUSИсходящий");

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок"            , "Введите запрос на получение документов для отправки STATUS регламентным заданием");
	ПараметрыФормы.Вставить("ТекстНачальный"       , ТекстЗапроса);  
    ПараметрыФормы.Вставить("ДопПараметры"         , ДопПараметры);
    
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы,,,,,ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьНовыйФорматОнлайнВходящие(Команда)
	
	ТипГибкихНастроек = "Входящие настройки";
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяФормы"         , "УФ_ГибкиеНастройкиОнлайн");
	ДопПараметры.Вставить("ТипГибкихНастроек", ТипГибкихНастроек);

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
	ПараметрыФормы 	= Новый Структура;
	ПараметрыФормы.Вставить("СтруктураФайлаXMLВходящие", ЭтаФорма.СтруктураФайлаXMLВходящие);
	ПараметрыФормы.Вставить("ТипГибкихНастроек"        , ТипГибкихНастроек);
	ПараметрыФормы.Вставить("ДопПараметры"             , ДопПараметры);
	
	ОткрытьФорму(ПолноеИмяОбработки + ".Форма.УФ_ГибкиеНастройкиОнлайн", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовыйФорматОнлайнИсходящие(Команда)
	
	ТипГибкихНастроек = "Исходящие настройки";
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяФормы"         , "УФ_ГибкиеНастройкиОнлайн");
	ДопПараметры.Вставить("ТипГибкихНастроек", ТипГибкихНастроек);

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
	ПараметрыФормы 	= Новый Структура;
	ПараметрыФормы.Вставить("СтруктураФайлаXMLИсходящие", ЭтаФорма.СтруктураФайлаXMLИсходящие);
	ПараметрыФормы.Вставить("ТипГибкихНастроек"         , ТипГибкихНастроек);
	ПараметрыФормы.Вставить("ДопПараметры"              , ДопПараметры);
	
	ОткрытьФорму(ПолноеИмяОбработки + ".Форма.УФ_ГибкиеНастройкиОнлайн", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовыйФорматОнлайнДокументы(Команда)
	
    ТипГибкихНастроек = "Настройки по созданию документов";
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяФормы"         , "УФ_ГибкиеНастройкиОнлайн");
	ДопПараметры.Вставить("ТипГибкихНастроек", ТипГибкихНастроек);

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
	ПараметрыФормы 	= Новый Структура;
	ПараметрыФормы.Вставить("СтруктураФайлаXMLДокументы", ЭтаФорма.СтруктураФайлаXMLДокументы);
	ПараметрыФормы.Вставить("ТипГибкихНастроек"         , ТипГибкихНастроек);
	ПараметрыФормы.Вставить("ДопПараметры"              , ДопПараметры);
	
	ОткрытьФорму(ПолноеИмяОбработки + ".Форма.УФ_ГибкиеНастройкиОнлайн", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовыйФорматОнлайнПодписка(Команда)
	
    ТипГибкихНастроек = "Настройки по подписке документов";
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяФормы"         , "УФ_ГибкиеНастройкиОнлайн");
	ДопПараметры.Вставить("ТипГибкихНастроек", ТипГибкихНастроек);

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
	ПараметрыФормы 	= Новый Структура;
	ПараметрыФормы.Вставить("ТипГибкихНастроек"         , ТипГибкихНастроек);
	ПараметрыФормы.Вставить("ДопПараметры"              , ДопПараметры);
	
	ОткрытьФорму(ПолноеИмяОбработки + ".Форма.УФ_ГибкиеНастройкиОнлайн", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовыйФорматОнлайнТабличнаяЧасть(Команда)
	
	ТипГибкихНастроек = "Настройки табличной части";
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяФормы"         , "УФ_ГибкиеНастройкиОнлайн");
	ДопПараметры.Вставить("ТипГибкихНастроек", ТипГибкихНастроек);

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
	ПараметрыФормы 	= Новый Структура;
	ПараметрыФормы.Вставить("ТипГибкихНастроек"         , ТипГибкихНастроек);
	ПараметрыФормы.Вставить("ДопПараметры"              , ДопПараметры);
	
	ОткрытьФорму(ПолноеИмяОбработки + ".Форма.УФ_ГибкиеНастройкиОнлайн", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаСервере
Процедура ХранениеДанныхЭКОМ_РазблокировкаПроцессаОбменаНаСервере()
	
	ОбъектЭтаОбработка = РеквизитФормыВЗначение("Объект");

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Измерение", "Блокировка");
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ЗначениеДополнительнойКонстанты", Ложь);
	
	ОбъектЭтаОбработка.ЗаписьВРегистр("ЭКОМ_ЗначениеДополнительныхКонстант", ПараметрыОтбора, ПараметрыЗаписи);
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Обмен документами разблокирован!";
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиенте
Процедура ХранениеДанныхЭКОМ_РазблокировкаПроцессаОбмена(Команда)
	ХранениеДанныхЭКОМ_РазблокировкаПроцессаОбменаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_ОтправлятьДокументыПовторноПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_ПолучатьСтатусФайлыПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокДляИзменения(Значение, Имя)
	
	// Создаем новый список
	Если СписокЗначенийИзмененныхНастроек.Количество() = 0 Тогда
	    СоответствиеЗначений = Новый Соответствие;
		
	// Меняем текущий	
	Иначе	
	    СоответствиеЗначений = СписокЗначенийИзмененныхНастроек.Получить(0).Значение;
	КонецЕсли;
	
	СоответствиеЗначений.Вставить(Имя, Значение);
	СписокЗначенийИзмененныхНастроек.Очистить();
	СписокЗначенийИзмененныхНастроек.Добавить(СоответствиеЗначений);
	
	ЭтаФорма.Модифицированность = Истина;
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_ЗаказыЗагружатьТекущейДатойПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_РеализацииСоздаватьДатойПоставкиПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_СоздаватьДокументЗаказ1СПроведеннымПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_СоздаватьДокументРеализация1СПроведеннымПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_ОтправлятьНепроведенныеПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_Рабочий_КаталогПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_Локальный_Каталог_INBOXПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_Локальный_Каталог_OUTBOXПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_Локальный_Каталог_MarkingПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_Локальный_Каталог_INBOX_АрхивПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_Локальный_Каталог_OUTBOX_АрхивПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_Локальный_Каталог_UPDATEПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_АвтоОбменORDER_входящийПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_АвтоОбменORDRSP_исходящийПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_АвтоОбменRECADV_входящийПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_АвтоОбменDESADV_исходящийПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_АвтоОбменRETINS_исходящийПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_АвтоОбменINVOICE_исходящийПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_АвтоОбменDESSCC_исходящийПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_АвтоОбменУПД_исходящийПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_АвтоОбменУПД_входящийПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_АвтоОбменИсходящийSTATUSПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_АвтоотправкаУточненийПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_АвтоотправкаПодписьЮЗДПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_АвтоОбменDESADVПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_АвтоОбменRECADVПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_АвтоОбменORDRSPПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_АвтоОбменORDERПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_АвтоПроверкаСтатусовЮЗДПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_АвтообновлениеПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_Локальный_Каталог_UPDATE1ПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма.ЭКОМ_Локальный_Каталог_UPDATE, "ЭКОМ_Локальный_Каталог_UPDATE");
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_ИспользуетсяПроксиПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_ИмяСервераПроксиПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_ИмяПользователяПроксиПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_ПарольПользователяПроксиПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_ТипОбменаЭТРН_ОтправительПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_ТипОбменаЭТРН_ПеревозчикПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_ТипОбменаЭТРН_ПолучательПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура СтруктураФайлаXMLВходящиеПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(Элемент.Имя, "_" + Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура СтруктураФайлаXMLИсходящиеПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(Элемент.Имя, "_" + Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура СтруктураФайлаXMLДокументыПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(Элемент.Имя, "_" + Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_ЗапретитьФормированиеМиксПалетТандерПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ОбновитьВсеРолиНаСервере()

	ОбъектЭтаОбработка = РеквизитФормыВЗначение("Объект");
	ОбъектЭтаОбработка.ОбновитьВсеРоли(Ложь);

КонецПроцедуры // ОбновитьВсеРолиНаСервере()

&НаКлиенте
Процедура ЭКОМ_СоздаватьДокументПоступления1СПроведеннымПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_СоздаватьДокументПолученныйСЧФ1СПроведеннымПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_ИспользоватьАдресаИзРегистраGLNПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_ИспользоватьАдресаИзРегистраТочкиДоставкиGLNПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_ПодписыватьПрайсЛистПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура СтруктураФайлаXMLВходящиеИспользоватьПриИзменении(Элемент)
	КонтрольИзмененияИспользованияНастройки(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СтруктураФайлаXMLИсходящиеИспользоватьПриИзменении(Элемент)
	КонтрольИзмененияИспользованияНастройки(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура КонтрольИзмененияИспользованияНастройки(Элемент)
	ТекДанные = Элемент.Родитель.ТекущиеДанные;
	Если ТекДанные.Использовать И НастройкаДанногоТипаУжеИспользуется(Вычислить(Элемент.Родитель.Имя + ".ПолучитьЭлементы()"), ТекДанные.ТипТранзакции) Тогда
		ЭКОМ_ОбщегоНазначенияКлиент.СообщитьПользователю("Настройка с данным типом транзакции уже используется. Может быть выбран только один шаблон.");
		ТекДанные.Использовать = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция НастройкаДанногоТипаУжеИспользуется(ДеревоЗначений, ИмяКолонки, Счетчик = 0)
	Для Каждого Строка Из ДеревоЗначений Цикл
		Если Строка.ТипТранзакции = ИмяКолонки И Строка.Использовать Тогда
			Счетчик = Счетчик + 1;
			Если Счетчик > 1 Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла; 	
	
	Возврат Счетчик > 1;
КонецФункции

//Docrobot 1.20.0 MOD-1602 [Процедура обрабатывает изменения флажков для подписок]
&НаКлиенте
Процедура ДобавитьЭлементВСписокДляИзменений(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

//Docrobot 1.19.0 MOD-1511 [Добавлена процедура КомандаЗапросНаАвтоОбменПокупательУточнения]
&НаКлиенте
Процедура КомандаЗапросНаАвтоОбменПокупательУточнения(Команда)
		
    ПараметрыФункции = Новый Массив;
	ПараметрыФункции.Добавить("ЗапросНаАвтоОбменПокупательУточнения");		
	ПараметрыФункции.Добавить("");
    ПараметрыФункции.Добавить("Служебный");
	ПараметрыФункции.Добавить(Ложь);
	
	ТекстЗапроса = ВернутьРезультатИзМодуляОбъекта("Настройка_Параметр_Прочитать", ПараметрыФункции);
			
	ИмяОткрываемойФормы = ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаКонсольЗапросов";
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяФормы"         , "УФ_ФормаКонсольЗапросов");
	ДопПараметры.Вставить("ИмяЭлементаФормы" , "АвтоОбмен");
	ДопПараметры.Вставить("ИмяЗапроса"       , "_ЗапросНаАвтоОбменПокупательУточнения");

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработкаЗакрытия", ЭтаФорма, ДопПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок"            , "Введите запрос на получение документов для отправки Уточнения регламентным заданием");
	ПараметрыФормы.Вставить("ТекстНачальный"       , ТекстЗапроса);  
    ПараметрыФормы.Вставить("ДопПараметры"         , ДопПараметры);
    
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы,,,,,ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_РазделятьЗаказыПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_РазделятьРеализацииПриИзменении(Элемент)
	ЗаполнитьСписокДляИзменения(ЭтаФорма[Элемент.Имя], Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеНастройки(Команда)
	ОткрытьФорму(ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ДополнительныеНастройки",,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
КонецПроцедуры


