
// Возвращает массив единиц измерения указанной номенклатуры
//
// Параметры:
//  Номенклатура  - СправочникСсылка.Номенклатура - Владелец единицы измерения
//  РежимВыбораЕдиниц  - Число - режим выбора единиц измерения
//
// Возвращаемое значение:
//   Массив   - коллекция единиц измерения номенклатуры
//
Функция ПолучитьКоллекциюЕдиницНоменклатуры(Номенклатура, РежимВыбораЕдиниц) Экспорт

	СписокВыбора = Новый Массив;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВЫРАЗИТЬ(&Номенклатура КАК Справочник.Номенклатура).ЕдиницаИзмерения КАК Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура";
		
		Если РежимВыбораЕдиниц = 3 
			И Метаданные.Справочники.Номенклатура.Реквизиты.Найти("ЕдиницаИзмерения") = Неопределено
			И НЕ Метаданные.Справочники.Номенклатура.Реквизиты.Найти("БазоваяЕдиницаИзмерения") = Неопределено Тогда // Для БП 2.0
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕдиницаИзмерения", "БазоваяЕдиницаИзмерения");
		КонецЕсли;
		
		Если РежимВыбораЕдиниц = 2 Тогда
			Запрос.Текст = Запрос.Текст +
			"
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	УпаковкиЕдиницыИзмерения.Ссылка
			|ИЗ
			|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
			|ГДЕ
			|	УпаковкиЕдиницыИзмерения.Владелец = &Номенклатура";
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокВыбора;
	
КонецФункции // ПолучитьКоллекциюЕдиницНоменклатуры()