
&ИзменениеИКонтроль("ПолучитьЗначениеРеквизитаДокументаПоСоответствию")
Функция игр_ПолучитьЗначениеРеквизитаДокументаПоСоответствию(ПараметрыОбмена, ДокументXML, Документ, ОсновныеНастройкиДокумента, ТекущийРеквизит, СтрокаXML, СтрокаТабличнойЧасти, СтрараяТабличнаяЧасть)

	Если СтрокаТабличнойЧасти = Неопределено тогда
		лРеквизит = Документ.Метаданные().Реквизиты.Найти(ТекущийРеквизит.НаименованиеРеквизита1С);
	Иначе
		лРеквизит = Метаданные.НайтиПоТипу(Тип(СтрокаТабличнойЧасти)).Реквизиты.Найти(ТекущийРеквизит.НаименованиеРеквизита1С);	
	КонецЕсли;

	Если лРеквизит = Неопределено тогда

		Массив = Новый Массив;
		Если СтрокаТабличнойЧасти = Неопределено тогда
			Массив.Добавить(ТипЗнч(Документ[ТекущийРеквизит.НаименованиеРеквизита1С]));
		Иначе
			Массив.Добавить(ТипЗнч(СтрокаТабличнойЧасти[ТекущийРеквизит.НаименованиеРеквизита1С]));
		КонецЕсли;  
		лТипРеквизита = Новый ОписаниеТипов(Массив);

	Иначе

		лТипРеквизита = лРеквизит.Тип;

	КонецЕсли;

	мПростыеТипы = Новый Массив;
	мПростыеТипы.Добавить(Тип("Строка"));	
	мПростыеТипы.Добавить(Тип("Число"));	
	мПростыеТипы.Добавить(Тип("Булево"));	
	мПростыеТипы.Добавить(Тип("Дата"));	

	Результат = Неопределено;

	Если ТекущийРеквизит.ТипДанных = "Из поля XML документа" тогда

		Если ТекущийРеквизит.Значение = "Дата с сайта с учетом настройки обмена" тогда

			ДатаДокументаНаСайте 	= XMLЗначение(Тип("Дата"),ДокументXML.Дата + "T" + ДокументXML.Время);

			Если ОсновныеНастройкиДокумента.ДатаДокументов = "Текущая дата" тогда
				Результат = ТекущаяДатаСеанса();
			Иначе
				Результат = ДатаДокументаНаСайте;
			КонецЕсли;


		ИначеЕсли ТекущийРеквизит.Значение = "Дата отгрузки" тогда

			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДатаОтгрузки) тогда
				Результат = СтрокаТабличнойЧасти.ДатаОтгрузки;	
			Иначе

				ДатаДокументаНаСайте 	= XMLЗначение(Тип("Дата"),ДокументXML.Дата + "T" + ДокументXML.Время);

				Если ОсновныеНастройкиДокумента.ДатаДокументов = "Текущая дата" тогда
					Результат = ТекущаяДатаСеанса();
				Иначе
					Результат = ДатаДокументаНаСайте;
				КонецЕсли;
			КонецЕсли;

		ИначеЕсли ТекущийРеквизит.Значение = "Дата с сайта" тогда

			Результат 	= XMLЗначение(Тип("Дата"),ДокументXML.Дата + "T" + ДокументXML.Время);

		ИначеЕсли ТекущийРеквизит.Значение = "Дата 1С" тогда

			Результат =  ТекущаяДатаСеанса();

		ИначеЕсли ТекущийРеквизит.Значение = "Номер с сайта" тогда

			Результат =  ДокументXML.Номер;	

		ИначеЕсли ТекущийРеквизит.Значение = "Ид с сайта" тогда

			Результат =  ДокументXML.Ид;	

		ИначеЕсли ТекущийРеквизит.Значение = "Номер 1С" тогда

			Результат = ДокументXML.Номер1С;

		ИначеЕсли ТекущийРеквизит.Значение = "Номер версии с сайта" тогда

			Результат = ДокументXML.НомерВерсии;

		ИначеЕсли ТекущийРеквизит.Значение = "Пометка удаления" тогда

			Результат = ДокументXML.ПометкаУдаления;	

		ИначеЕсли ТекущийРеквизит.Значение = "Комментарий" тогда

			Результат = ФормированиеКомментарияДокумента(ДокументXML.Номер,  ДокументXML.Комментарий);	

		ИначеЕсли ТекущийРеквизит.Значение = "Склад" тогда

			Результат = ПолучитьСклад(ПараметрыОбмена, Документ, ДокументXML);

		ИначеЕсли ТекущийРеквизит.Значение = "Статус" тогда

			Результат = ПолучитьСтатусДокумента(ПараметрыОбмена, Документ, ДокументXML);

		ИначеЕсли ТекущийРеквизит.Значение = "Способ доставки" тогда

			Результат = ПолучитьСпособДоставки(ПараметрыОбмена, Документ, ДокументXML);

		ИначеЕсли ТекущийРеквизит.Значение = "Перевозчик" тогда

			Результат = ПолучитьПеревозчика(ПараметрыОбмена, Документ, ДокументXML);

		ИначеЕсли ТекущийРеквизит.Значение = "Налогообложение НДС" тогда

			Результат = ЗначениеНастроекПовтИсп.НалогообложениеНДС(Документ.Организация, Документ.Склад, Документ.Договор, Документ.НаправлениеДеятельности, Документ.Дата)			

		ИначеЕсли ТекущийРеквизит.Значение = "Цена включает НДС" тогда

			Результат = ДокументXML.НДСВСумме;	

		ИначеЕсли ТекущийРеквизит.Значение = "Валюта" тогда

			Результат = ДокументXML.Валюта	

		ИначеЕсли ТекущийРеквизит.Значение = "Контрагент" тогда

			Результат = ПолучитьКонтрагента(ПараметрыОбмена, ДокументXML.Контрагент.ЮрФизЛицо, ДокументXML);

		ИначеЕсли ТекущийРеквизит.Значение = "Партнер" тогда

			Контрагент = ПолучитьКонтрагента(ПараметрыОбмена, ДокументXML.Контрагент.ЮрФизЛицо, ДокументXML);

			Если Контрагент <> неопределено  тогда
				Результат = Контрагент.Партнер;
			Иначе
				Результат = Справочники.Партнеры.ПустаяСсылка();	
			КонецЕсли;

		ИначеЕсли ТекущийРеквизит.Значение = "Соглашение" тогда

			Результат = ПолучитьСоглашение(ПараметрыОбмена, ДокументXML.Контрагент.ЮрФизЛицо, ДокументXML);

		ИначеЕсли ТекущийРеквизит.Значение = "Адрес доставки" тогда

			Если ДокументXML.ХозОперация = "Заказ товара" И ДокументXML.Контрагент.Контакты <> Неопределено тогда

				Для Каждого ТекАдрес из ДокументXML.Контрагент.Контакты Цикл

					Если ТекАдрес.ТипВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента или ТекАдрес.ТипВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.АдресПартнера тогда

						Результат 	= ТекАдрес.Представление;

					КонецЕсли;

				КонецЦикла;

			Иначе
				Результат = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Адрес доставки");
			Конецесли;

		ИначеЕсли ТекущийРеквизит.Значение = "Адрес доставки значения полей" тогда

			Если ДокументXML.Контрагент.Контакты <> Неопределено тогда

				Для Каждого ТекАдрес из ДокументXML.Контрагент.Контакты Цикл

					Если ТекАдрес.ТипВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента тогда

						Результат = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(ТекАдрес.Представление, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента); 						

					ИначеЕсли ТекАдрес.ТипВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.АдресПартнера тогда

						Результат = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(ТекАдрес.Представление, Справочники.ВидыКонтактнойИнформации.АдресПартнера); 						

					КонецЕсли;

				КонецЦикла;
			КонецЕсли;

		ИначеЕсли ТекущийРеквизит.Значение = "Адрес доставки перевозчика" тогда

			Результат =  "";	

			Если Документ.метаданные().Реквизиты.Найти("ПеревозчикПартнер") <> Неопределено тогда

				Если ДокументXML.Контрагент.Контакты <> Неопределено тогда

					НайденныйАдрес = Документ.ПеревозчикПартнер.КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.АдресПартнера);

					Если НайденныйАдрес <> Неопределено тогда 
						Результат =  (НайденныйАдрес.Представление);
					КонецЕсли;

				КонецЕсли;

			КонецЕсли;

		ИначеЕсли ТекущийРеквизит.Значение = "Адрес контрагента" тогда

			Результат =  "";	

			Если ДокументXML.Контрагент.Контакты <> Неопределено тогда

				НайденныйАдрес = ДокументXML.Контрагент.Контакты.Найти(Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента, "ТипВидКонтактнойИнформации");

				Если НайденныйАдрес <> Неопределено тогда 
					Результат =  (НайденныйАдрес.Представление);
				КонецЕсли;

			КонецЕсли;

		ИначеЕсли ТекущийРеквизит.Значение = "Телефон контрагента" тогда

			Результат =  "";	

			Если ДокументXML.Контрагент.Контакты <> Неопределено тогда

				НайденныйАдрес = ДокументXML.Контрагент.Контакты.Найти("Телефон", "ТипВидКонтактнойИнформации");

				Если НайденныйАдрес <> Неопределено тогда 
					Результат =  НайденныйАдрес.Представление;
				КонецЕсли;

			КонецЕсли;

		ИначеЕсли ТекущийРеквизит.Значение = "Адрес эл. почты контрагента" тогда

			Результат =  "";	

			Если ДокументXML.Контрагент.Контакты <> Неопределено тогда

				НайденныйАдрес = ДокументXML.Контрагент.Контакты.Найти("Почта", "ТипВидКонтактнойИнформации");

				Если НайденныйАдрес <> Неопределено тогда 
					Результат =  НайденныйАдрес.Представление;
				КонецЕсли;

			КонецЕсли;

		ИначеЕсли ТекущийРеквизит.Значение = "Полное наименование контрагента" тогда

			Результат =  ?(ЗначениеЗаполнено(ДокументXML.Контрагент.НаименованиеПолное), ДокументXML.Контрагент.НаименованиеПолное, ДокументXML.Контрагент.Наименование);	

		ИначеЕсли ТекущийРеквизит.Значение = "Банковский счет" тогда

			Результат = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();

			ВремСтруктДанных = Новый Структура;
			ВремСтруктДанных.Вставить("Организация"		, Документ.Организация);
			ВремСтруктДанных.Вставить("ФормаОплаты"		, Перечисления.ФормыОплаты.Безналичная);
			ВремСтруктДанных.Вставить("БанковскийСчет"	, Неопределено);
			ВремСтруктДанных.Вставить("Валюта"			, ДокументXML.Валюта);
			ВремСтруктДанных.Вставить("НаправлениеДеятельности", Справочники.НаправленияДеятельности.ПустаяСсылка());

			Если Документ.Метаданные().Реквизиты.Найти("БанковскийСчет") <> Неопределено тогда
				ВремСтруктДанных.БанковскийСчет = Документ.БанковскийСчет; 	
				Результат = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(ВремСтруктДанных);	
			ИначеЕсли Документ.Метаданные().Реквизиты.Найти("БанковскийСчетОрганизации") <> Неопределено тогда
				ВремСтруктДанных.БанковскийСчет = Документ.БанковскийСчетОрганизации; 	
				Результат = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(ВремСтруктДанных);			
			КонецЕсли;

		ИначеЕсли ТекущийРеквизит.Значение = "Банковский счет контрагента" тогда

			Контрагент = ПолучитьКонтрагента(ПараметрыОбмена, ДокументXML.Контрагент.ЮрФизЛицо, ДокументXML);

			Результат = ПолучитьбанковскийСчетДляДокумента(ДокументXML, Контрагент);

		ИначеЕсли ТекущийРеквизит.Значение = "Касса" тогда

			Результат = Справочники.Кассы.ПустаяСсылка();
			ЗначениеОплаты = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Метод оплаты ИД");

			ИдОплаты = "";
			Если НЕ ЗначениеОплаты = Неопределено тогда
				ИдОплаты = СокрЛП(ЗначениеОплаты);	
			КонецЕсли;

			Если ПараметрыОбмена.СоответствиеПлатежныхСистемИКасс <> Неопределено тогда

				НайденнаяСтрока = ПараметрыОбмена.СоответствиеПлатежныхСистемИКасс.Найти(ИдОплаты, "ИдПлатежнойСистемы");
				Если НайденнаяСтрока = Неопределено тогда
					Результат = Справочники.Кассы.ПустаяСсылка();
				Иначе
					Результат = ПараметрыОбмена.СоответствиеПлатежныхСистемИКасс.Найти(ИдОплаты, "ИдПлатежнойСистемы").Касса;
				КонецЕсли;
			КонецЕсли;

			Если НЕ ЗначениеЗаполнено(Результат) тогда
				Результат = ЗначениеНастроекПовтИсп.ПолучитьКассуОрганизацииПоУмолчанию()
			КонецЕсли;


		ИначеЕсли ТекущийРеквизит.Значение = "Эквайринговый терминал" тогда

			Результат = Справочники.ЭквайринговыеТерминалы.ПустаяСсылка();
			ЗначениеОплаты = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Метод оплаты ИД");

			ИдОплаты = "";
			Если НЕ ЗначениеОплаты = Неопределено тогда
				ИдОплаты = СокрЛП(ЗначениеОплаты);	
			КонецЕсли;

			Если ПараметрыОбмена.СоответствиеПлатежныхСистемИКасс <> Неопределено тогда

				НайденнаяСтрока = ПараметрыОбмена.СоответствиеПлатежныхСистемИКасс.Найти(ИдОплаты, "ИдПлатежнойСистемы");
				Если НайденнаяСтрока = Неопределено тогда
					Результат = Справочники.ЭквайринговыеТерминалы.ПустаяСсылка();
				Иначе
					Результат = НайденнаяСтрока.Терминал;
				КонецЕсли;
			КонецЕсли;

		ИначеЕсли ТекущийРеквизит.Значение = "Форма оплаты" тогда

			Результат = Документ.Соглашение.ФормаОплаты;

		ИначеЕсли ТекущийРеквизит.Значение = "Основание" тогда

			Результат = ПолучитьОснование(ДокументXML, лТипРеквизита);

		ИначеЕсли ТекущийРеквизит.Значение = "Реализация по заказам" тогда

			Основание = ПолучитьОснование(ДокументXML, лТипРеквизита);

			Если Основание <> Неопределено тогда
				Результат = Истина;
			Иначе
				Результат = Ложь;
			КонецЕсли;

		ИначеЕсли ТекущийРеквизит.Значение = "Менеджер" тогда
			Если Документ.Метаданные().Реквизиты.Найти("Соглашение") <> Неопределено тогда
				Результат = Документ.Соглашение.Менеджер;
			Иначе
				Результат = Справочники.Пользователи.ПустаяСсылка();
			КонецЕсли;
		ИначеЕсли ТекущийРеквизит.Значение = "Приоритет" тогда

			Результат = Справочники.Приоритеты.НайтиПоНаименованию("Средний");

		ИначеЕсли ТекущийРеквизит.Значение = "Операция" тогда

			Если Документ.Метаданные().Реквизиты.Найти("Соглашение") <> Неопределено тогда
				Результат = Документ.Соглашение.ХозяйственнаяОперация;
			КонецЕсли;

		ИначеЕсли ТекущийРеквизит.Значение = "График оплаты" тогда

			Результат = Документ.Соглашение.ГрафикОплаты;

		ИначеЕсли ТекущийРеквизит.Значение = "Дата платежа" тогда

			ДатаОплаты			= ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Дата оплаты");

			Если НЕ ДатаОплаты 	= Неопределено тогда

				Попытка
					ДатаОплаты 				= Дата(ДатаОплаты);
					Результат   			= ДатаОплаты;
				Исключение
					Б_ОбменССайтомСервер.СообщитьПодробно("Не удалось получить дату оплаты для документа: " + Документ.Номер, ПараметрыОбмена);
				КонецПопытки

			КонецЕсли;

		ИначеЕсли ТекущийРеквизит.Значение = "Сумма" тогда

			Если ДокументXML.ХозОперация = "Отпуск товара" тогда
				СуммаДоставки = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Сумма доставки");
				Результат = ДокументXML.Сумма - Число(?(ЗначениеЗаполнено(СуммаДоставки),СуммаДоставки,0));	
			Иначе
				Результат = ДокументXML.Сумма;
			КонецЕсли;

		ИначеЕсли ТекущийРеквизит.Значение = "Курс" тогда

			Результат = ДокументXML.Курс;

		ИначеЕсли ТекущийРеквизит.Значение = "Кратность" тогда

			Результат = 1;

		ИначеЕсли ТекущийРеквизит.Значение = "НДС в сумме" тогда

			Результат = ДокументXML.НДСВСумме;

		ИначеЕсли ТекущийРеквизит.Значение = "Сумма НДС" тогда

			Результат = ДокументXML.СуммаНДС;

		ИначеЕсли ТекущийРеквизит.Документ <> "ЗаказКлиента" И ТекущийРеквизит.Значение = "Объект расчетов" тогда

			Заказ = ПолучитьОснование(ДокументXML, лТипРеквизита);
			Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ, "ОбъектРасчетов");

		ИначеЕсли ТекущийРеквизит.Значение = "Номенклатура" тогда

			СтрИнформацииОНоменклатуре = ПолучитьИнформациюОНоменклатуреДляДокумента(ПараметрыОбмена, СтрокаXML);

			Если СтрИнформацииОНоменклатуре.Номенклатура = Неопределено тогда
				Б_ОбменССайтомСервер.СообщитьПодробно("В документе: " + Строка(Документ) + " не найдена/создана номенклатура. ", ПараметрыОбмена);
				Результат = Справочники.Номенклатура.ПустаяСсылка();	
			Иначе
				Результат = СтрИнформацииОНоменклатуре.Номенклатура;	
			КонецЕсли;

		ИначеЕсли ТекущийРеквизит.Значение = "Наименование номенклатуры" тогда

			СтрИнформацииОНоменклатуре = ПолучитьИнформациюОНоменклатуреДляДокумента(ПараметрыОбмена, СтрокаXML);

			Если СтрИнформацииОНоменклатуре.Номенклатура = Неопределено тогда
				Результат = "";	
			Иначе
				Результат = СтрИнформацииОНоменклатуре.Номенклатура.Наименование;	
			КонецЕсли;

		ИначеЕсли ТекущийРеквизит.Значение = "Содержание" тогда

			СтрИнформацииОНоменклатуре = ПолучитьИнформациюОНоменклатуреДляДокумента(ПараметрыОбмена, СтрокаXML);

			Если СтрИнформацииОНоменклатуре.Номенклатура = Неопределено тогда
				Результат = "";	
			Иначе

				Если СтрИнформацииОНоменклатуре.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга тогда
					Результат = СтрИнформацииОНоменклатуре.Номенклатура.Наименование;
				Иначе
					Результат = "";	
				КонецЕсли;

			КонецЕсли;

		ИначеЕсли ТекущийРеквизит.Значение = "Характеристика" тогда

			СтрИнформацииОНоменклатуре = ПолучитьИнформациюОНоменклатуреДляДокумента(ПараметрыОбмена, СтрокаXML);

			Если СтрИнформацииОНоменклатуре.ХарактеристикаНоменклатуры = Неопределено тогда
				Результат = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();	
			Иначе
				Результат = СтрИнформацииОНоменклатуре.ХарактеристикаНоменклатуры;	
			КонецЕсли;

		ИначеЕсли ТекущийРеквизит.Значение = "Единица измерения" тогда

			СтрИнформацииОНоменклатуре = ПолучитьИнформациюОНоменклатуреДляДокумента(ПараметрыОбмена, СтрокаXML);

			Если СтрИнформацииОНоменклатуре.ЕдиницаИзмерения = Неопределено тогда
				Результат = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();	
			Иначе
				Результат = СтрИнформацииОНоменклатуре.ЕдиницаИзмерения;	
			КонецЕсли;

		ИначеЕсли ТекущийРеквизит.Значение = "Ставка НДС" тогда

			Если ЗначениеЗаполнено(СтрокаXML.СтавкаНДСТовара) Тогда
				Результат = СтрокаXML.СтавкаНДСТовара;
			Иначе
				Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС) Тогда
					Результат = СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС;
				КонецЕсли;

			КонецЕсли;

		ИначеЕсли ТекущийРеквизит.Значение = "Количество" тогда

			Результат = СтрокаXML.Количество;

		ИначеЕсли ТекущийРеквизит.Значение = "Количество упаковок" тогда

			Результат = СтрокаXML.Количество;

		ИначеЕсли ТекущийРеквизит.Значение = "Цена" тогда

			Если СтрокаXML.Количество = 0 тогда
				Б_ОбменССайтомСервер.СообщитьПодробно("У документа: " + Документ.Номер + " есть позиция, с 0 количеством. Цена будет установлена 0", ПараметрыОбмена);
				Возврат 0;
			КонецЕсли;

			Если НЕ ПараметрыОбмена.УстанавливатьРучнуюСкидкуВДокументе тогда

				Результат = 0;	

				Если ЗначениеЗаполнено(СтрокаXML.Цена) Тогда
					Результат = СтрокаXML.Цена;
				КонецЕсли;

				Если Результат = 0 Тогда
					Результат = СтрокаXML.Сумма / СтрокаXML.Количество;
				КонецЕсли;
			Иначе	

				ЦенаДоСкидки =  СтрокаXML.Сумма/СтрокаXML.Количество;

				лСкидка = 0;
				Если СтрокаXML.Скидки <> Неопределено тогда
					лСкидка = СтрокаXML.Скидки.Итог("Сумма");	
				КонецЕсли;

				Результат = ЦенаДоСкидки + лСкидка;

			КонецЕсли;	

		ИначеЕсли ТекущийРеквизит.Значение = "Процент ручной скидки" тогда

			Если НЕ ПараметрыОбмена.УстанавливатьРучнуюСкидкуВДокументе тогда

				Результат = 0;

			Иначе	

				Если СтрокаXML.Количество = 0 тогда
					Возврат 0;
				КонецЕсли;

				ЦенаДоСкидки =  СтрокаXML.Сумма/СтрокаXML.Количество;

				Если ЦенаДоСкидки = 0 тогда
					Б_ОбменССайтомСервер.СообщитьПодробно("У документа: " + Документ.Номер + " есть позиция с суммой без скидок = 0. Скидка будет установлена = 0", ПараметрыОбмена);
					Возврат 0;
				КонецЕсли;

				лСкидка = 0;
				Если СтрокаXML.Скидки <> Неопределено тогда
					лСкидка = СтрокаXML.Скидки.Итог("Сумма");	
				КонецЕсли;

				Результат = лСкидка*100/(ЦенаДоСкидки+лСкидка);

			КонецЕсли;	

		ИначеЕсли ТекущийРеквизит.Значение = "Сумма позиции" тогда

			Результат = СтрокаXML.Сумма;

		ИначеЕсли ТекущийРеквизит.Значение = "Вариант обеспечения" тогда

			Результат = Неопределено;

			Если СтрараяТабличнаяЧасть <> Неопределено тогда

				СтрИнформацииОНоменклатуре = ПолучитьИнформациюОНоменклатуреДляДокумента(ПараметрыОбмена, СтрокаXML);

				Для Каждого ТекЭлементТЧ из СтрараяТабличнаяЧасть Цикл
					Если ТекЭлементТЧ.КодСтроки = СтрокаXML.КодСтроки И ТекЭлементТЧ.Номенклатура = СтрИнформацииОНоменклатуре.Номенклатура тогда
						Результат	= ТекЭлементТЧ.ВариантОбеспечения;	
					КонецЕсли;
				КонецЦикла;

			КонецЕсли;

			Если Результат = Неопределено Тогда
				Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрИнформацииОНоменклатуре.Номенклатура, "ТипНоменклатуры") = Перечисления.ТипыНоменклатуры.Услуга тогда
					Результат	= Перечисления.ВариантыОбеспечения.НеТребуется;
				Иначе
					#Удаление
					Результат 	= Перечисления.ВариантыОбеспечения.КОбеспечению;
					#КонецУдаления
					#Вставка
					Результат 	= Перечисления.ВариантыОбеспечения.Требуется;
					#КонецВставки
				КонецЕсли;
			КонецЕсли;

		ИначеЕсли ТекущийРеквизит.Значение = "Отменено" тогда

			Отменен 	= ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Отменен");
			Результат   = ?((Отменен = Неопределено ИЛИ Отменен = "false"), Ложь, Истина);

		ИначеЕсли ТекущийРеквизит.Значение = "Причина отмены" тогда

			ЗаказОтменен 	= ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Отменен");
			ЗаказОтменен    = ?((ЗаказОтменен = Неопределено ИЛИ ЗаказОтменен = "false"), Ложь, Истина);

			Если ЗаказОтменен тогда

				ПричинаОтменыНаименование 	= ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Причина отмены"); 
				Если Б_ОбменССайтомСервер.СвойствоXDTOЗаполнено(ПричинаОтменыНаименование) тогда
					Результат				= ПолучитьЗначениеПричиныОтменыЗаказа(ПричинаОтменыНаименование);
				Иначе

					Б_ОбменССайтомСервер.СообщитьПодробно("В документе: " + Строка(Документ) + " не найдена причина отмена заказа по наименованию. Будет установлена из настроек обмена.", ПараметрыОбмена);
					Результат				= ПараметрыОбмена.ПричинаОтменыЗаказа;

				КонецЕсли;

			КонецЕсли;

		ИначеЕсли ТекущийРеквизит.Значение = "Код строки" тогда
			Результат = СтрокаXML.КодСтроки;	 		
		КонецЕсли;

	ИначеЕсли ТекущийРеквизит.ТипДанных = "Фиксированное значение" тогда

		Если ТекущийРеквизит.НаименованиеРеквизита1С = "Соглашение" тогда
			Если Документ.Контрагент = ПараметрыОбмена.КонтрагентФизлицо И ЗначениеЗаполнено(ПараметрыОбмена.КонтрагентФизлицо) И ЗначениеЗаполнено(ПараметрыОбмена.СоглашениеКонтрагентаФизлицо) тогда	
				Результат = ПараметрыОбмена.СоглашениеКонтрагентаФизлицо; 
			Иначе
				Результат = ТекущийРеквизит.Значение;	
			КонецЕсли;
		Иначе
			Результат = ТекущийРеквизит.Значение;	
		КонецЕсли;

	ИначеЕсли ТекущийРеквизит.ТипДанных = "Из дополнительных свойств документа (по наименованию)" тогда

		лЗначениеДопСвойства = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, ТекущийРеквизит.Значение);

		Если НЕ ЗначениеЗаполнено(лЗначениеДопСвойства) тогда
			Возврат Неопределено;
		КонецЕсли;

		Для каждого ТекТип из лТипРеквизита.Типы() Цикл

			Если мПростыеТипы.Найти(ТекТип) = Неопределено тогда

				лОбъект = Метаданные.НайтиПоТипу(ТекТип);

				Если лОбъект <> Неопределено тогда

					лПолноеИмяОбъектаПоиска = лОбъект.ПолноеИмя();

					Если Лев(лПолноеИмяОбъектаПоиска, 3) = "Пер" тогда

						Для каждого ТекЗначение из лОбъект.ЗначенияПеречисления Цикл

							Если ТекЗначение.Синоним = лЗначениеДопСвойства тогда

								Результат = Перечисления[лОбъект.Имя][ТекЗначение.Имя];

								Прервать;

							КонецЕсли;

						КонецЦикла;

					ИначеЕсли Лев(лПолноеИмяОбъектаПоиска, 3) = "Док" тогда

						Результат = Документы[лОбъект.Имя].НайтиПоНомеру(лЗначениеДопСвойства, ТекущаяДатаСеанса());

						Прервать;

					ИначеЕсли Лев(лПолноеИмяОбъектаПоиска, 3) = "Спр" тогда

						Если лОбъект.Имя = "СоглашенияСКлиентами" И ДокументXML.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо И ЗначениеЗаполнено(ПараметрыОбмена.СоглашениеКонтрагентаФизлицо) тогда	
							Возврат ПараметрыОбмена.СоглашениеКонтрагентаФизлицо; 	
						КонецЕсли;

						Если лОбъект.Имя = "Контрагент" И ДокументXML.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо И ЗначениеЗаполнено(ПараметрыОбмена.КонтрагентФизлицо) тогда	
							Возврат ПараметрыОбмена.КонтрагентФизлицо; 	
						КонецЕсли;

						Если лОбъект.Имя = "Партнер" И ДокументXML.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо И ЗначениеЗаполнено(ПараметрыОбмена.КонтрагентФизлицо) тогда	
							Возврат ПараметрыОбмена.СоглашениеКонтрагентаФизлицо.Партнер; 	
						КонецЕсли;

						Результат = Справочники[лОбъект.Имя].НайтиПоНаименованию(лЗначениеДопСвойства);

						Если ЗначениеЗаполнено(Результат) тогда
							Возврат Результат; 
						КонецЕсли;

					КонецЕсли;

				Иначе

					Результат = лЗначениеДопСвойства;

				КонецЕсли;

			Иначе

				Попытка 
					Результат = XMLЗначение(ТекТип, лЗначениеДопСвойства);    
				Исключение 
					Результат = ""; 
				КонецПопытки ; 	  

				Прервать;

			КонецЕсли;

		КонецЦикла;			

	ИначеЕсли ТекущийРеквизит.ТипДанных = "Из дополнительных свойств документа (по ид)" тогда

		лЗначениеДопСвойства = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, ТекущийРеквизит.Значение);

		Если НЕ ЗначениеЗаполнено(лЗначениеДопСвойства) тогда
			Возврат Неопределено;
		КонецЕсли;

		Для каждого ТекТип из лТипРеквизита.Типы() Цикл

			Попытка

				Результат =	XMLЗначение(ТекТип, лЗначениеДопСвойства);	

				Прервать;

			Исключение

			КонецПопытки

		КонецЦикла;

	ИначеЕсли ТекущийРеквизит.ТипДанных = "<Свой алгоритм>" тогда

		лИтоговоеНазваниеПоля = ТекущийРеквизит.Значение;	

		лИтоговоеНазваниеПоля = стрЗаменить(лИтоговоеНазваниеПоля, "[Документ]"		, "Документ");
		лИтоговоеНазваниеПоля = стрЗаменить(лИтоговоеНазваниеПоля, "[Результат]"		, "Результат");
		лИтоговоеНазваниеПоля = стрЗаменить(лИтоговоеНазваниеПоля, "[НоваяСтрока]"		, "СтрокаТабличнойЧасти");
		лИтоговоеНазваниеПоля = стрЗаменить(лИтоговоеНазваниеПоля, "[ПараметрыОбмена]"	, "ПараметрыОбмена");
		лИтоговоеНазваниеПоля = стрЗаменить(лИтоговоеНазваниеПоля, "[ДокументXML]"		, "ДокументXML");
		лИтоговоеНазваниеПоля = стрЗаменить(лИтоговоеНазваниеПоля, "[СтрокаXML]"		, "СтрокаXML");

		Если ЗначениеЗаполнено(лИтоговоеНазваниеПоля) тогда
			Выполнить(лИтоговоеНазваниеПоля);
		КонецЕсли;

	КонецЕсли;

	Возврат Результат; 

КонецФункции

&ИзменениеИКонтроль("ПересчитатьСтрокуДокумента")
Процедура игр_ПересчитатьСтрокуДокумента(Документ, СтрокаТЧ)

	СтруктураДействий = Новый Структура;                  
	
	#Удаление
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Документ);
	#КонецУдаления
	#Вставка
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Документ);
	#КонецВставки

	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("Организация, НалогообложениеНДС, Дата", Документ.Организация, Документ.НалогообложениеНДС, Документ.Дата));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Документ.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");       
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));

	ОбработкаТабличнойЧастиВызовСервера.ОбработатьСтрокуТЧ(СтрокаТЧ, СтруктураДействий, Неопределено);

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнениеКонтактовКонтрагента")
Процедура игр_ЗаполнениеКонтактовКонтрагента(Объект, ТипОбъекта, ИнформацияОКонтрагенте)

	Если ТипОбъекта = "Контрагент" тогда

		лПочта      = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
		лТелефон	= Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;

	ИначеЕсли ТипОбъекта = "Партнер" тогда

		лПочта      = Справочники.ВидыКонтактнойИнформации.EmailПартнера;
		лТелефон	= Справочники.ВидыКонтактнойИнформации.ТелефонПартнера;

	КонецЕсли;

	тзнКонтактактов = ИнформацияОКонтрагенте.Контакты;

	Если тзнКонтактактов <> Неопределено тогда

		Для каждого ТекКонтакт из тзнКонтактактов Цикл

			Если ТекКонтакт.ТипКонтрагента = ТипОбъекта тогда

				Если НЕ ЗначениеЗаполнено(ТекКонтакт.ТипВидКонтактнойИнформации) ИЛИ ПустаяСтрока(ТекКонтакт.Представление) тогда
					Продолжить;	
				КонецЕсли;

				Если ТекКонтакт.ТипВидКонтактнойИнформации = "Почта" тогда

					СтруктураПоиска = Новый Структура("Тип, Вид");
					СтруктураПоиска.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
					СтруктураПоиска.Вид = лПочта;
					ОчиститьКонтактнуюИнформациюКонтрагентаПартнера(Объект, СтруктураПоиска);

					НовКонтакт 					= Объект.КонтактнаяИнформация.Добавить();
					НовКонтакт.Тип 				= Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
					НовКонтакт.Вид 				= лПочта;
					НовКонтакт.Представление 	= ТекКонтакт.Представление;
					НовКонтакт.АдресЭП		 	= ТекКонтакт.Представление;
					#Удаление
					НовКонтакт.ЗначенияПолей	= УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(ТекКонтакт.Представление, лПочта);
					#КонецУдаления
					#Вставка
					НовКонтакт.ЗначенияПолей	= УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияXMLПоПредставлению(ТекКонтакт.Представление, лПочта);
					#КонецВставки
					
				ИначеЕсли ТекКонтакт.ТипВидКонтактнойИнформации = "Телефон" тогда

					СтруктураПоиска = Новый Структура("Тип, Вид");
					СтруктураПоиска.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
					СтруктураПоиска.Вид = лТелефон;
					ОчиститьКонтактнуюИнформациюКонтрагентаПартнера(Объект, СтруктураПоиска);

					НовКонтакт 					= Объект.КонтактнаяИнформация.Добавить();
					НовКонтакт.Тип 				= Перечисления.ТипыКонтактнойИнформации.Телефон;
					НовКонтакт.Вид 				= лТелефон;
					НовКонтакт.Представление 	= ТекКонтакт.Представление;
					НовКонтакт.НомерТелефона 	= ТекКонтакт.Представление;
					НовКонтакт.НомерТелефонаБезКодов = ТекКонтакт.Представление;
					#Удаление
					НовКонтакт.ЗначенияПолей	= УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(ТекКонтакт.Представление, лТелефон);
					#КонецУдаления
					#Вставка
					НовКонтакт.ЗначенияПолей	= УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияXMLПоПредставлению(ТекКонтакт.Представление, лПочта);
					#КонецВставки
					
				Иначе

					СтруктураПоиска = Новый Структура("Тип, Вид");
					СтруктураПоиска.Тип = ТекКонтакт.ТипВидКонтактнойИнформации.Тип;
					СтруктураПоиска.Вид = ТекКонтакт.ТипВидКонтактнойИнформации;
					ОчиститьКонтактнуюИнформациюКонтрагентаПартнера(Объект, СтруктураПоиска);

					НовКонтакт 					= Объект.КонтактнаяИнформация.Добавить();
					НовКонтакт.Тип 				= ТекКонтакт.ТипВидКонтактнойИнформации.Тип;
					НовКонтакт.Вид 				= ТекКонтакт.ТипВидКонтактнойИнформации;
					#Удаление
					НовКонтакт.ЗначенияПолей	= УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияПоПредставлению(ТекКонтакт.Представление, ТекКонтакт.ТипВидКонтактнойИнформации);
					#КонецУдаления
					#Вставка
					НовКонтакт.ЗначенияПолей	= УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияXMLПоПредставлению(ТекКонтакт.Представление, лПочта);
					#КонецВставки
					НовКонтакт.Представление 	= ТекКонтакт.Представление;

					Если ТекКонтакт.АдресныеПоля <> Неопределено тогда
						Для Каждого СтрокаУточнения Из ТекКонтакт.АдресныеПоля Цикл

							Если СтрокаУточнения.ТипЗначения = "Страна" Тогда
								НовКонтакт.Страна = СтрокаУточнения.Значение;
							ИначеЕсли СтрокаУточнения.ТипЗначения = "Регион" Тогда
								НовКонтакт.Регион = СтрокаУточнения.Значение;
							ИначеЕсли СтрокаУточнения.ТипЗначения = "Город" Тогда
								НовКонтакт.Город = СтрокаУточнения.Значение;
							КонецЕсли;

						КонецЦикла;
						НовКонтакт.ЗначенияПолей = СтрокаПоСпискуПолей(ТекКонтакт.АдресныеПоля);
					КонецЕсли;  				

				КонецЕсли;
			КонецЕсли;

		КонецЦикла;	
	КонецЕсли;

КонецПроцедуры


&Вместо("СоздатьОбновитьДокумент")
Процедура игр_СоздатьОбновитьДокумент(ПараметрыОбмена, НазваниеДокумента, ДокументXML, НовыйДокумент, СсылкаНаДокумент)
	
		Если НовыйДокумент И НЕ ДокументXML.ПометкаУдаления = ИСТИНА тогда
		Документ = Документы[НазваниеДокумента].СоздатьДокумент();	
	ИначеЕсли НовыйДокумент И ДокументXML.ПометкаУдаления = ИСТИНА тогда
		Б_ОбменССайтомСервер.СообщитьПодробно("Помеченный на удаление документ  '"+ НазваниеДокумента + "' не загружаем.", ПараметрыОбмена);
		Возврат;   
	Иначе             
		Документ = СсылкаНаДокумент.ПолучитьОбъект();  		
	КонецЕсли;   

	Если ДокументXML.ПометкаУдаления = ИСТИНА тогда

		Попытка 
			Документ.УстановитьПометкуУдаления(Истина);
			Б_ОбменССайтомСервер.СообщитьПодробно("Помечен на удаление документ:" + Строка(Документ.Ссылка), ПараметрыОбмена);
		Исключение
			Б_ОбменССайтомСервер.СообщитьПодробно("Не удалось удалить документ:" + Строка(Документ.Ссылка), ПараметрыОбмена);
		КонецПопытки;

		Возврат;

	КонецЕсли;

	ВремТабТЧ = ПараметрыОбмена.ВсеСоответствияТабличныхЧастейДокументов.Скопировать();
	ВремТабТЧ.Свернуть("ТабличнаяЧасть, Документ, ПолеXML");

	мНастройкиДокумента	= ПолучитьРеквизитыТЧДокумента(НазваниеДокумента, ПараметрыОбмена.ДокументыЗагрузки);
	мРеквизитыДокумента = ПолучитьРеквизитыТЧДокумента(НазваниеДокумента, ПараметрыОбмена.ВсеСоответствияШапокДокументов);
	мТабличныеЧасти		= ПолучитьРеквизитыТЧДокумента(НазваниеДокумента, ВремТабТЧ); 
	мРеквизитыТЧ		= ПолучитьРеквизитыТЧДокумента(НазваниеДокумента, ПараметрыОбмена.ВсеСоответствияТабличныхЧастейДокументов);

	Если мНастройкиДокумента.Количество() = 0 тогда

		Б_ОбменССайтомСервер.СообщитьПодробно("У документа " + НазваниеДокумента + " не найдены основные параметры документа в настройках соответствий. Загрузка документа невозможна.", ПараметрыОбмена);

		Возврат;

	КонецЕсли;

	ОсновныеНастройкиДокумента = мНастройкиДокумента[0];

	Для Каждого ТекРеквизит из мРеквизитыДокумента Цикл

		Если НЕ ПустаяСтрока(ТекРеквизит.Значение) тогда

			Если ТекРеквизит.НаименованиеРеквизита1С = "Дата" ИЛИ ТекРеквизит.НаименованиеРеквизита1С = "Номер" ИЛИ ТекРеквизит.НаименованиеРеквизита1С = "ПометкаУдаления"
				ИЛИ ТекРеквизит.НаименованиеРеквизита1С = "Б_Идентификатор" ИЛИ ТекРеквизит.НаименованиеРеквизита1С = "Б_ДатаДокумента" ИЛИ ТекРеквизит.НаименованиеРеквизита1С = "Б_НомерВерсии" Тогда
				Документ[ТекРеквизит.НаименованиеРеквизита1С] = ПолучитьЗначениеРеквизитаДокументаПоСоответствию(ПараметрыОбмена, ДокументXML, Документ, ОсновныеНастройкиДокумента, ТекРеквизит);	
			Иначе
				Если Документ.Метаданные().Реквизиты.Найти(ТекРеквизит.НаименованиеРеквизита1С) <> Неопределено Тогда
					Документ[ТекРеквизит.НаименованиеРеквизита1С] = ПолучитьЗначениеРеквизитаДокументаПоСоответствию(ПараметрыОбмена, ДокументXML, Документ, ОсновныеНастройкиДокумента, ТекРеквизит);	
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	ДокументОтменен = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Отменен");
	ДокументОтменен = ?((ДокументОтменен = Неопределено ИЛИ ДокументОтменен = "false"), Ложь, Истина);

	Если ОсновныеНастройкиДокумента.НумерацияДокументов =  "С сайта" тогда
		Документ.Номер = ДокументXML.Номер; 	
	Иначе
		Если НовыйДокумент тогда

			Документ.УстановитьНовыйНомер();	

		КонецЕсли;
	КонецЕсли;

	Для каждого ТекТабЧасть из мТабличныеЧасти Цикл

		СтрараяТабличнаяЧасть = Документ[ТекТабЧасть.ТабличнаяЧасть].Выгрузить();

		Документ[ТекТабЧасть.ТабличнаяЧасть].Очистить();

		Если ТекТабЧасть.ПолеXML = "" тогда

			Массив = новый Массив;
			Массив.Добавить(Тип("ДокументСсылка.ЗаказКлиента"));
			лТипРеквизита = Новый ОписаниеТипов(Массив);

			Заказ = ПолучитьОснование(ДокументXML, лТипРеквизита);

			Если ЗначениеЗаполнено(Заказ) тогда

				СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
				тзнТоваровЗаказа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заказ, "Товары").Выгрузить();
				Если тзнТоваровЗаказа.Количество() > 0 Тогда
					СтавкаНДС = тзнТоваровЗаказа[0].СтавкаНДС;	
				КонецЕсли;

				НовСтрока = Документ[ТекТабЧасть.ТабличнаяЧасть].Добавить();
				Для Каждого ТекРеквизитТЧ из мРеквизитыТЧ Цикл

					Если НЕ ПустаяСтрока(ТекРеквизитТЧ.Значение) тогда
						НовСтрока[ТекРеквизитТЧ.НаименованиеРеквизита1С] = ПолучитьЗначениеРеквизитаДокументаПоСоответствию(ПараметрыОбмена, ДокументXML, Документ, ОсновныеНастройкиДокумента, ТекРеквизитТЧ, , НовСтрока, СтрараяТабличнаяЧасть);	
					КонецЕсли;

				КонецЦикла;

				НовСтрока.СтавкаНДС	= СтавкаНДС;

				//#Область ОсобенностиПКО
				//			Если НазваниеДокумента = "ПриходныйКассовыйОрдер" тогда

				СтруктураПересчетаСуммы = Новый Структура;
				СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Истина);

				СтруктураДействий = Новый Структура;
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);

				ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НовСтрока, СтруктураДействий, Неопределено);
				//				КонецЕсли;	
				//#КонецОбласти


				//Если НовСтрока.Сумма = 0 Тогда
				//	НовСтрока.СуммаНДС = 0;	
				//Иначе
				//	НовСтрока.СуммаНДС = Окр(ТекНДС.СуммаНДС*СуммаРасшифровка/ТекНДС.Сумма,2);
				//КонецЕсли;
				//
				//
				//ОплатаВсего = Документ.СуммаДокумента;
				//
				//Для Каждого ТекНДС из  тзнНДС Цикл
				//	
				//	Если ОплатаВсего < ТекНДС.Сумма Тогда
				//		СуммаРасшифровка = ОплатаВсего;
				//	Иначе
				//		СуммаРасшифровка = ТекНДС.Сумма;
				//		ОплатаВсего = ОплатаВсего - ТекНДС.Сумма; 
				//	КонецЕсли;
				//	НовСтрока.Сумма					= СуммаРасшифровка;		
				//	НовСтрока.СуммаВзаиморасчетов	= СуммаРасшифровка;		
				//	
				//КонецЦикла;
			КонецЕсли;

		Иначе

			Для каждого ТекСтрокаТЗ из ДокументXML[ТекТабЧасть.ПолеXML] Цикл

				Если ДокументXML[ТекТабЧасть.ПолеXML].Колонки.Найти("Количество") <> Неопределено тогда
					Если ТекСтрокаТЗ.Количество = 0 тогда
						Продолжить;	
					КонецЕсли;

				КонецЕсли;	

				Если ТекСтрокаТЗ.Ид = "ORDER_DELIVERY" И ДокументXML.ХозОперация = "Отпуск товара" тогда

					СтрИнформацииОНоменклатуре = ПолучитьИнформациюОНоменклатуреДляДокумента(ПараметрыОбмена, ТекСтрокаТЗ);

					Если СтрИнформацииОНоменклатуре.Номенклатура = Неопределено тогда
						Продолжить;
					Иначе
						ТоварДоставка = СтрИнформацииОНоменклатуре.Номенклатура;	

						Если ТоварДоставка.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга тогда

							Если НЕ ТоварДоставка.ВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг тогда
								Продолжить;
							КонецЕсли;

						КонецЕсли; 
					КонецЕсли;

				КонецЕсли;				

				НовСтрока = Документ[ТекТабЧасть.ТабличнаяЧасть].Добавить();

				Для Каждого ТекРеквизитТЧ из мРеквизитыТЧ Цикл

					Если НЕ ПустаяСтрока(ТекРеквизитТЧ.Значение) И ТекРеквизитТЧ.ТабличнаяЧасть = ТекТабЧасть.ТабличнаяЧасть тогда

						НовСтрока[ТекРеквизитТЧ.НаименованиеРеквизита1С] = ПолучитьЗначениеРеквизитаДокументаПоСоответствию(ПараметрыОбмена, ДокументXML, Документ, ОсновныеНастройкиДокумента, ТекРеквизитТЧ, ТекСтрокаТЗ, НовСтрока, СтрараяТабличнаяЧасть);	

					КонецЕсли;

				КонецЦикла;

				Если ТекТабЧасть.ТабличнаяЧасть = "Товары" И (НазваниеДокумента = "ЗаказКлиента" или НазваниеДокумента = "РеализацияТоваровУслуг") тогда

					СтруктураДействий = Новый Структура;

					ПересчитатьСтрокуДокумента(Документ, НовСтрока);

				КонецЕсли;

			КонецЦикла;

		КонецЕсли;

	КонецЦикла;

	#Область ОсобенностиЗаказовИОтгрузок
	Если НазваниеДокумента = "ЗаказКлиента" или НазваниеДокумента = "РеализацияТоваровУслуг" тогда
		Если ПараметрыОбмена.УстанавливатьРучнуюСкидкуВДокументе Тогда
			Если ДокументXML.Скидки <> Неопределено тогда
				СуммаСкидки = 0;
				Для Каждого СтрокаСкидки Из ДокументXML.Скидки Цикл

					Если ЗначениеЗаполнено(СтрокаСкидки.Сумма) И СтрокаСкидки.УчтеноВСумме Тогда

						СуммаСкидки = СуммаСкидки + СтрокаСкидки.Сумма;

					КонецЕсли;

				КонецЦикла;

				Если СуммаСкидки <> 0 Тогда

					Если Документ.Товары.Количество() > 0 Тогда
						РаспределитьСуммуПоКолонке(Документ, Документ.Товары, -СуммаСкидки);
					КонецЕсли;

				КонецЕсли;  				

			КонецЕсли;
		КонецЕсли;

		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("ПрименятьКОбъекту"					, Истина);
		СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет"		, Ложь);
		СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки"	, Истина);
		СтруктураПараметры.Вставить("УправляемыеСкидки"					, Неопределено);
		СтруктураПараметры.Вставить("РеализацияСверхЗаказа"				, Ложь);

		Если ПараметрыОбмена.ИспользоватьАвтоматическиеСкидкиВПродажах тогда
			СкидкиНаценкиСервер.Рассчитать(Документ, СтруктураПараметры);
		КонецЕсли;

		Документ.СуммаДокумента = Документ.Товары.Итог("Сумма");

		Если НазваниеДокумента = "ЗаказКлиента" тогда

			Если ПараметрыОбмена.Свойство("НастройкиСтатусовЗаказа") тогда
				Если ПараметрыОбмена.НастройкиСтатусовЗаказа.ИсточникСтатусов1С = "СвойствоЗаказов" тогда

					ИдСтатуса		= ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Статуса заказа ИД");

					Если ИдСтатуса 	<> Неопределено тогда

						НайденноеЗначениеСвойства =ПараметрыОбмена.НастройкиСтатусовЗаказа.СоответствияЗначенийСвойствЗаказа.Найти(ИдСтатуса);

						Если НайденноеЗначениеСвойства <> Неопределено тогда

							СтрокаДР = Документ.ДополнительныеРеквизиты.Найти(ПараметрыОбмена.НастройкиСтатусовЗаказа.СвойствоЗаказа);

							Если СтрокаДР = Неопределено Тогда
								НовоеСвойство = Документ.ДополнительныеРеквизиты.Добавить();
							Иначе
								НовоеСвойство = СтрокаДР	
							КонецЕсли;

							НовоеСвойство.Свойство = ПараметрыОбмена.НастройкиСтатусовЗаказа.СвойствоЗаказа; 
							НовоеСвойство.Значение = НайденноеЗначениеСвойства.Статус; 

						КонецЕсли;

					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

			Если ПараметрыОбмена.Свойство("НастройкиСлужбДоставкиДокументов") тогда
				Если ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.ИсточникСлужбДоставкиЗаказа = "СвойствоЗаказов" тогда

					ИдМетодаДоставки = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Метод доставки ИД");

					Если ИдМетодаДоставки 	<> Неопределено тогда

						НайденноеЗначениеСвойства = ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СоответствияЗначенийСвойствЗаказа.Найти(ИдМетодаДоставки);

						Если НайденноеЗначениеСвойства <> Неопределено тогда

							СтрокаДР = Документ.ДополнительныеРеквизиты.Найти(ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СвойствоЗаказа);

							Если СтрокаДР = Неопределено Тогда
								НовоеСвойство = Документ.ДополнительныеРеквизиты.Добавить();
							Иначе
								НовоеСвойство = СтрокаДР	
							КонецЕсли;

							НовоеСвойство.Свойство = ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СвойствоЗаказа; 
							НовоеСвойство.Значение = НайденноеЗначениеСвойства.Служба; 

						КонецЕсли;

					КонецЕсли;
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;

		Если НазваниеДокумента = "РеализацияТоваровУслуг" тогда
			Если ПараметрыОбмена.Свойство("НастройкиСлужбДоставкиДокументов") тогда

				ИдМетодаДоставки = ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Метод доставки ИД");

				Если ИдМетодаДоставки 	<> Неопределено тогда

					НайденноеЗначениеСвойства = ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СоответствияЗначенийСвойствОтгрузки.Найти(ИдМетодаДоставки);

					Если НайденноеЗначениеСвойства <> Неопределено тогда

						СтрокаДР = Документ.ДополнительныеРеквизиты.Найти(ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СвойствоОтгрузки);

						Если СтрокаДР = Неопределено Тогда
							НовоеСвойство = Документ.ДополнительныеРеквизиты.Добавить();
						Иначе
							НовоеСвойство = СтрокаДР	
						КонецЕсли;

						НовоеСвойство.Свойство = ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СвойствоОтгрузки; 
						НовоеСвойство.Значение = НайденноеЗначениеСвойства.Служба; 

					КонецЕсли;

				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		СкладГруппа = Справочники.Склады.ЭтоГруппаИСкладыИспользуютсяВТЧДокументовПродажи(Документ.Склад);
		СкладыСервер.ЗаполнитьСкладыВТабличнойЧасти(Документ.Склад, СкладГруппа, Документ.Товары, Ложь);

	КонецЕсли;

	Если НазваниеДокумента = "РеализацияТоваровУслуг" тогда

 
	КонецЕсли;

	#КонецОбласти

	Если ОсновныеНастройкиДокумента.РежимЗаписиДокументов = "Проводить оперативно" тогда
		ДокументСозданИзменен = ЗаписьИПроведениеДокумента(ПараметрыОбмена, Документ, ?(ДокументОтменен, Ложь, Истина), Истина);
	ИначеЕсли ОсновныеНастройкиДокумента.РежимЗаписиДокументов = "Проводить не оперативно" тогда
		ДокументСозданИзменен = ЗаписьИПроведениеДокумента(ПараметрыОбмена, Документ, ?(ДокументОтменен, Ложь, Истина), Ложь);

	Иначе

		лПроводитьДокумент 		= ПроверкаНаПроведениеПоДополнительнымУсловиям(ПараметрыОбмена, НазваниеДокумента, ДокументОтменен, ДокументXML, Документ);
		ДокументСозданИзменен 	= ЗаписьИПроведениеДокумента(ПараметрыОбмена, Документ, лПроводитьДокумент, Ложь);

	КонецЕсли;

	Если ДокументСозданИзменен тогда 

		Если НазваниеДокумента = "ОперацияПоПлатежнойКарте" ИЛИ НазваниеДокумента = "ПриходныйКассовыйОрдер" тогда
			ЗаполнитьИнформациюОЧеке(Документ.Ссылка, ДокументXML);
		ИначеЕсли НазваниеДокумента = "ЗаказКлиента" тогда 

			Если ПараметрыОбмена.Свойство("НастройкиСтатусовЗаказа") тогда

				Если ПараметрыОбмена.НастройкиСтатусовЗаказа.ИсточникСтатусов1С = "СостоянияЗаказов" тогда

					ИдСтатуса		= ПолучитьЗначениеРеквизитаДокумента(ДокументXML.ЗначенияРеквизитов, "Статуса заказа ИД");

					Если ИдСтатуса 	<> Неопределено тогда

						НайденноеСостояниеЗаказа = ПараметрыОбмена.НастройкиСтатусовЗаказа.СоответствияСостоянийЗаказа.Найти(ИдСтатуса);

						Если НайденноеСостояниеЗаказа <> Неопределено тогда
							НоваяЗапись = РегистрыСведений.СостоянияЗаказовКлиентов.СоздатьМенеджерЗаписи();
							НоваяЗапись.Заказ 		= Документ.Ссылка;
							НоваяЗапись.ДатаСобытия = ТекущаяДатаСеанса();
							НоваяЗапись.Состояние 	= НайденноеСостояниеЗаказа.Статус;
							НоваяЗапись.Записать();
						КонецЕсли;

					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		ЗаписьСтатусовИУдалениеЗагруженныхДокументов(ПараметрыОбмена, ДокументXML, ОсновныеНастройкиДокумента, Документ, НовыйДокумент, ДокументОтменен);
	КонецЕсли;

	
КонецПроцедуры

