
&ИзменениеИКонтроль("ИмяПланаОбмена")
Функция игр_ИмяПланаОбмена()

	Если ТипЗнч(ПолеИмяПланаОбмена) <> Тип("Строка")
		ИЛИ ПустаяСтрока(ПолеИмяПланаОбмена) Тогда

		Если ЗначениеЗаполнено(УзелДляОбмена) Тогда

			ПолеИмяПланаОбмена = ОбменДаннымиПовтИсп.ПолучитьИмяПланаОбмена(УзелДляОбмена);

		ИначеЕсли ЗначениеЗаполнено(УзелОбменаЗагрузкаДанных) Тогда

			ПолеИмяПланаОбмена = ОбменДаннымиПовтИсп.ПолучитьИмяПланаОбмена(УзелОбменаЗагрузкаДанных);

		ИначеЕсли ЗначениеЗаполнено(ИмяПланаОбменаВРО) Тогда

			ПолеИмяПланаОбмена = ИмяПланаОбменаВРО;

		Иначе

			ПолеИмяПланаОбмена = "";

		КонецЕсли;

	КонецЕсли;
	#Вставка
	ПолеИмяПланаОбмена	= СтрЗаменить(ПолеИмяПланаОбмена,
		"ОбменКомплекснаяАвтоматизацияРозница",
		"ОбменУправлениеТорговлейРозница");
	#КонецВставки

	Возврат ПолеИмяПланаОбмена;
КонецФункции
