#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ПрограммныйИнтерфейс

// Подсистема "Управление доступом".

// Процедура ЗаполнитьНаборыЗначенийДоступа по свойствам объекта заполняет наборы значений доступа
// в таблице с полями:
//    НомерНабора     - Число                                     (необязательно, если набор один),
//    ВидДоступа      - ПланВидовХарактеристикСсылка.ВидыДоступа, (обязательно),
//    ЗначениеДоступа - Неопределено, СправочникСсылка или др.    (обязательно),
//    Чтение          - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Добавление      - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Изменение       - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Удаление        - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//
//  Вызывается из процедуры УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа(),
// если объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьНаборыЗначенийДоступа" и
// из таких же процедур объектов, у которых наборы значений доступа зависят от наборов этого
// объекта (в этом случае объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьЗависимыеНаборыЗначенийДоступа").
//
// Параметры:
//  Таблица      - ТабличнаяЧасть,
//                 РегистрСведенийНаборЗаписей.НаборыЗначенийДоступа,
//                 ТаблицаЗначений, возвращаемая УправлениеДоступом.ТаблицаНаборыЗначенийДоступа().
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	ЗарплатаКадры.ЗаполнитьНаборыПоОрганизацииИФизическимЛицам(ЭтотОбъект, Таблица, "Организация", "ФизическиеЛица.ФизическоеЛицо");
	
КонецПроцедуры

// Подсистема "Управление доступом".

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Посчитать сумму документа и записать ее в соответствующий реквизит шапки.
	СуммаПоДокументу = НалогиВзносыОтчисления.Итог("НалогВзнос");
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МожноЗаполнитьНалогиВзносыОтчисления() Экспорт
	
	ПравилаПроверки = Новый Структура;
	
	ПравилаПроверки.Вставить("Организация",					НСтр("ru='Не выбрана организация'"));
	ПравилаПроверки.Вставить("ПериодРегистрации",			НСтр("ru='Не задан период регистрации'"));
	ПравилаПроверки.Вставить("Дата",						НСтр("ru='Не задана дата документа'"));
	ПравилаПроверки.Вставить("ВидНалогаВзносаОтчисления",	НСтр("ru='Не указан вид взноса, отчисления'"));
	ПравилаПроверки.Вставить("ВидПлатежа",					НСтр("ru='Не указан вид платежа'"));
	
	Возврат	ЗарплатаКадрыКлиентСервер.СвойстваЗаполнены(ЭтотОбъект, ПравилаПроверки, Истина);

КонецФункции

#Область ПроцедурыИФункцииЗаполненияДокумента

Процедура ЗаполнитьНалогиВзносыОтчисления() Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Отбираем сотрудников в соответствии с реквизитами шапки ведомости.
	СоздатьВТСотрудникиДляВедомостиПоШапке(МенеджерВременныхТаблиц, ЭтотОбъект);
	
	// Получаем взносы и отчисления для отобранных сотрудников.
	ПараметрыПолученияНалоговВзносовОтчислений = ПараметрыПолученияНалоговВзносовОтчисленийКВыплатеВедомости(ЭтотОбъект);
	СоздатьВТНалогиВзносыКВыплате(МенеджерВременныхТаблиц, Истина, ПараметрыПолученияНалоговВзносовОтчислений, "ВТСотрудникиДляВедомости");
	
	// Получаем кадровые данные сотрудников с полями для сортировки. 	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(МенеджерВременныхТаблиц, "ВТСотрудникиДляВедомости");
	КадровыеДанные = "";
	ЗарплатаКадры.ДополнитьКадровымиДаннымиНастройкиПорядкаСписка(КадровыеДанные);
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, КадровыеДанные);
	
	ОтборПоПодразделению = Ложь;
	Если ПолучитьФункциональнуюОпцию("ВыполнятьРасчетЗарплатыПоПодразделениям") 
			 И ЗначениеЗаполнено(Подразделение) Тогда
		ОтборПоПодразделению = Истина;
	КонецЕсли;
	
	// Формируем отсортированные налоги, взносы, отчисления сотрудников к выплате.
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	НалогиВзносыОтчисления.НалогВзнос КАК НалогВзнос,
	|	НалогиВзносыОтчисления.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	НалогиВзносыОтчисления.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТКадровыеДанныеСотрудников КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогиВзносыОтчисления КАК НалогиВзносыОтчисления
	|		ПО (НалогиВзносыОтчисления.ФизическоеЛицо = Сотрудники.ФизическоеЛицо)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НалогиВзносыОтчисленияПрочиеФизЛица.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка),
	|	НалогиВзносыОтчисленияПрочиеФизЛица.НалогВзнос,
	|	НалогиВзносыОтчисленияПрочиеФизЛица.МесяцНалоговогоПериода,
	|	НалогиВзносыОтчисленияПрочиеФизЛица.РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТНалогиВзносыОтчисленияПрочиеФизЛица КАК НалогиВзносыОтчисленияПрочиеФизЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК Сотрудники
	|		ПО НалогиВзносыОтчисленияПрочиеФизЛица.ФизическоеЛицо = Сотрудники.ФизическоеЛицо
	|ГДЕ
	|	&ОтборПоПодразделению = ЛОЖЬ";
	Запрос.УстановитьПараметр("ОтборПоПодразделению",ОтборПоПодразделению);
	
	ЗарплатаКадры.ДополнитьТекстЗапросаУпорядочиваниемСотрудниковПоВТСДаннымиПорядка(Запрос, "Сотрудники");	
	
	НалогиВзносыОтчисленияОстатки = Запрос.Выполнить().Выгрузить();
	
	ЗаполнитьПоТаблицеНалогиВзносы(ЭтотОбъект, НалогиВзносыОтчисленияОстатки);
	
КонецПроцедуры

Процедура СоздатьВТСотрудникиДляВедомостиПоШапке(МенеджерВременныхТаблиц, Ведомость, ИмяВТСотрудники = "") Экспорт
	
	// Отбор сотрудников по организации и подразделению.
	СоздатьВТСотрудникиДляВедомостиПоМестуРаботы(МенеджерВременныхТаблиц, Ведомость, ИмяВТСотрудники);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаДляКадровыхДанных", Ведомость.Дата);
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	&ДатаДляКадровыхДанных КАК Период
	|ПОМЕСТИТЬ ВТСотрудникиДляВедомости
	|ИЗ
	|	#ВТСотрудники КАК Сотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ #ВТСотрудники";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСотрудники", ИмяВТСотрудники);
	
	Запрос.Выполнить();
	
КонецПроцедуры	

Процедура СоздатьВТСотрудникиДляВедомостиПоМестуРаботы(МенеджерВременныхТаблиц, Ведомость, ИмяВТСотрудники)
	
	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	
	ЗаполнитьПараметрыПолученияСотрудниковПоШапкеВедомости(ПараметрыПолученияСотрудников, Ведомость);

	КадровыйУчет.СоздатьВТСотрудникиОрганизации(
		МенеджерВременныхТаблиц, Истина, 
		ПараметрыПолученияСотрудников, 
		"ВТСотрудникиПоМестуРаботыПоШапкеВедомости");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		 "ВЫБРАТЬ РАЗЛИЧНЫЕ 
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТСотрудникиПринятыеНаРаботу
		|ИЗ
		|	ВТСотрудникиПоМестуРаботыПоШапкеВедомости КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ВидЗанятости В (ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы), ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.Подразделение КАК Подразделение,
		|	Сотрудники.ВидЗанятости КАК ВидЗанятости,
		|	ВЫБОР
		|		КОГДА Сотрудники.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|			ТОГДА 2
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ПриоритетСостояния,
		|	ВЫБОР
		|		КОГДА Сотрудники.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|			ТОГДА Сотрудники.ДатаУвольнения
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ДатаУвольнения
		|ПОМЕСТИТЬ ВТСотрудникиПоПриоритетам
		|ИЗ
		|	ВТСотрудникиПоМестуРаботыПоШапкеВедомости КАК Сотрудники
		|ГДЕ
		|	(Сотрудники.ВидЗанятости В (ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы), ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство))
		|			ИЛИ (Сотрудники.ВидЗанятости ЕСТЬ NULL 
		|			И Сотрудники.ФизическоеЛицо НЕ В (ВЫБРАТЬ ВТСотрудникиПринятыеНаРаботу.ФизическоеЛицо Из ВТСотрудникиПринятыеНаРаботу КАК ВТСотрудникиПринятыеНаРаботу)))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСотрудникиПоПриоритетам.ФизическоеЛицо,
		|	МИНИМУМ(ВТСотрудникиПоПриоритетам.ПриоритетСостояния) КАК ПриоритетСостояния,
		|	МАКСИМУМ(ВТСотрудникиПоПриоритетам.ДатаУвольнения) КАК ДатаУвольнения
		|ПОМЕСТИТЬ ВТПриоритеты
		|ИЗ
		|	ВТСотрудникиПоПриоритетам КАК ВТСотрудникиПоПриоритетам
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСотрудникиПоПриоритетам.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСотрудникиПоПриоритетам.Сотрудник,
		|	ВТСотрудникиПоПриоритетам.ФизическоеЛицо,
		|	ВТСотрудникиПоПриоритетам.Подразделение
		|ПОМЕСТИТЬ ВТСотрудникиАктуальные
		|ИЗ
		|	ВТСотрудникиПоПриоритетам КАК ВТСотрудникиПоПриоритетам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПриоритеты КАК ВТПриоритеты
		|		ПО ВТСотрудникиПоПриоритетам.ФизическоеЛицо = ВТПриоритеты.ФизическоеЛицо
		|			И ВТСотрудникиПоПриоритетам.ПриоритетСостояния = ВТПриоритеты.ПриоритетСостояния
		|			И (ВЫБОР
		|				КОГДА ВТСотрудникиПоПриоритетам.ПриоритетСостояния = 2
		|					ТОГДА ВТСотрудникиПоПриоритетам.ДатаУвольнения = ВТПриоритеты.ДатаУвольнения
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)";
		
	Запрос.Выполнить();	
		
	ИмяВТСотрудникиПоМестуРаботы = "ВТСотрудникиАктуальные";
	
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТСотрудникиАктуальные";
	// при отборе по подразделениям	берем относящихся к нему на конец периода
	Если ЗначениеЗаполнено(ПараметрыПолученияСотрудников.Подразделение) Тогда
		
		Запрос.УстановитьПараметр("Подразделение", ПараметрыПолученияСотрудников.Подразделение);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ ВТСотрудникиОтносящиесяКПодразделению
		|ИЗ
		|	#ВТСотрудникиПоМестуРаботы КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Подразделение В ИЕРАРХИИ(&Подразделение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ #ВТСотрудникиПоМестуРаботы";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСотрудникиПоМестуРаботы", ИмяВТСотрудникиПоМестуРаботы);
		
		Запрос.Выполнить();

		ИмяВТСотрудникиПоМестуРаботы = "ВТСотрудникиОтносящиесяКПодразделению";
		
	КонецЕсли;	
	
	// если передан список сотрудников, берем только присутствующих в нем
	Если ЗначениеЗаполнено(ИмяВТСотрудники) Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ ВТВходящиеСотрудникиПоМестуРаботы
		|ИЗ
		|	#ВТСотрудникиПоМестуРаботы КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ВТСотрудники КАК ВходящиеСотрудники
		|		ПО Сотрудники.Сотрудник = ВходящиеСотрудники.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ #ВТСотрудникиПоМестуРаботы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ #ВТСотрудники";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСотрудникиПоМестуРаботы", ИмяВТСотрудникиПоМестуРаботы);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСотрудники", ИмяВТСотрудники);
		
		Запрос.Выполнить();

		ИмяВТСотрудникиПоМестуРаботы = "ВТВходящиеСотрудникиПоМестуРаботы";
		
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Сотрудники.Подразделение
	|ПОМЕСТИТЬ ВТСотрудникиПоМестуРаботы
	|ИЗ
	|	#ВТСотрудникиПоМестуРаботы КАК Сотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ #ВТСотрудникиПоМестуРаботы";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСотрудникиПоМестуРаботы", ИмяВТСотрудникиПоМестуРаботы);
	
	Запрос.Выполнить();
	
	ИмяВТСотрудники = "ВТСотрудникиПоМестуРаботы"
	
КонецПроцедуры	

Процедура СоздатьВТНалогиВзносыКВыплате(МенеджерВременныхТаблиц, ТолькоРазрешенные, Параметры, ИмяВТСотрудники) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	УничтожитьВТ = Новый Массив;
	
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации", Параметры.ПериодРегистрации);
	Запрос.УстановитьПараметр("ВидНалогаВзносаОтчисления", Параметры.ВидНалогаВзносаОтчисления);
	Запрос.УстановитьПараметр("ВидПлатежа", Параметры.ВидПлатежа);
	
	ПоЗадолженностиЗаМесяц = (СпособРасчетаСуммКПеречислению = Перечисления.СпособыЗаполненияСуммКПеречислениюНалоговВзносовОтчислений.ПоЗадолженностиЗаМесяц);

	Если Ссылка.Пустая() Тогда
		КонецПериодаГраница = Новый Граница(Макс(ТекущаяДатаСеанса(), КонецМесяца(Параметры.ПериодРегистрации)));	
	Иначе
		КонецПериодаГраница = Новый Граница(Макс(?(ЗначениеЗаполнено(Параметры.Дата), Параметры.Дата, ТекущаяДатаСеанса()), КонецМесяца(Параметры.ПериодРегистрации)));	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("КонецПериодаГраница", КонецПериодаГраница);

	Запрос.Текст =  
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НалогиВзносыОтчисленияОстатки.ФизическоеЛицо,
	|	НалогиВзносыОтчисленияОстатки.МесяцНалоговогоПериода,
	|	НалогиВзносыОтчисленияОстатки.РегистрацияВНалоговомОргане,
	|	СУММА(НалогиВзносыОтчисленияОстатки.НалогВзносОстаток) КАК НалогВзнос
	|ПОМЕСТИТЬ ВТНалогиВзносыОтчисленияОстатки
	|ИЗ
	|	РегистрНакопления.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Остатки(
	|			&КонецПериодаГраница,
	|			Организация = &Организация
	|				И ФизическоеЛицо В
	|					(ВЫБРАТЬ
	|						Сотрудники.ФизическоеЛицо
	|					ИЗ
	|						#ВТСотрудники КАК Сотрудники)
	|				И ВидНалогаВзносаОтчисления = &ВидНалогаВзносаОтчисления
	|				" + ?(ПоЗадолженностиЗаМесяц, "
	|				И МесяцНалоговогоПериода МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)", "
	|				И МесяцНалоговогоПериода <= КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)") + "
	|				И ВидПлатежа = &ВидПлатежа) КАК НалогиВзносыОтчисленияОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	НалогиВзносыОтчисленияОстатки.ФизическоеЛицо,
	|	НалогиВзносыОтчисленияОстатки.МесяцНалоговогоПериода,
	|	НалогиВзносыОтчисленияОстатки.РегистрацияВНалоговомОргане" ;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСотрудники", ИмяВТСотрудники);
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НалогиВзносыОтчисления.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НалогиВзносыОтчисления.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	НалогиВзносыОтчисления.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	НалогиВзносыОтчисления.НалогВзнос КАК НалогВзнос
	|ПОМЕСТИТЬ ВТНалогиВзносыОтчисления
	|ИЗ
	|	ВТНалогиВзносыОтчисленияОстатки КАК НалогиВзносыОтчисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НалогиВзносыОтчисленияОстатки.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НалогиВзносыОтчисленияОстатки.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	НалогиВзносыОтчисленияОстатки.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СУММА(НалогиВзносыОтчисленияОстатки.НалогВзносОстаток) КАК НалогВзнос
	|ПОМЕСТИТЬ ВТНалогиВзносыОтчисленияПрочиеФизЛицаОстатки
	|ИЗ
	|	РегистрНакопления.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Остатки(
	|			&КонецПериодаГраница,
	|			Организация = &Организация
	|				И НЕ ФизическоеЛицо В
	|						(ВЫБРАТЬ
	|							Т.ФизическоеЛицо
	|						ИЗ
	|							ВТНалогиВзносыОтчисления КАК Т)
	|				И ВидНалогаВзносаОтчисления = &ВидНалогаВзносаОтчисления
	|				" + ?(ПоЗадолженностиЗаМесяц, "
	|				И МесяцНалоговогоПериода МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)", "
	|				И МесяцНалоговогоПериода <= КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)") + "
	|				И ВидПлатежа = &ВидПлатежа) КАК НалогиВзносыОтчисленияОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	НалогиВзносыОтчисленияОстатки.ФизическоеЛицо,
	|	НалогиВзносыОтчисленияОстатки.МесяцНалоговогоПериода,
	|	НалогиВзносыОтчисленияОстатки.РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НалогиВзносыОтчисления.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НалогиВзносыОтчисления.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	НалогиВзносыОтчисления.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	НалогиВзносыОтчисления.НалогВзнос КАК НалогВзнос
	|ПОМЕСТИТЬ ВТНалогиВзносыОтчисленияПрочиеФизЛица
	|ИЗ
	|	ВТНалогиВзносыОтчисленияПрочиеФизЛицаОстатки КАК НалогиВзносыОтчисления";
	Запрос.Выполнить();
	
	УничтожитьВТ.Добавить("ВТНалогиВзносыОтчисленияОстатки");
	УничтожитьВТ.Добавить("ВТНалогиВзносыОтчисленияПрочиеФизЛицаОстатки");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыПолученияСотрудниковПоШапкеВедомости(ПараметрыПолученияСотрудников, Ведомость)
	
	ДлинаСуток = 86400;
	
	НачалоПериода 		=   '00010101';
	ОкончаниеПериода	=  КонецМесяца(Ведомость.ПериодРегистрации);
	РаботникиПоДоговорамГПХ = Истина;
	
	ПараметрыПолученияСотрудников.Организация	= Ведомость.Организация;
	ПараметрыПолученияСотрудников.Подразделение	= Ведомость.Подразделение;
	ПараметрыПолученияСотрудников.НачалоПериода 	= НачалоПериода;
	ПараметрыПолученияСотрудников.ОкончаниеПериода	= ОкончаниеПериода;
	ПараметрыПолученияСотрудников.РаботникиПоТрудовымДоговорам	= Истина;
	ПараметрыПолученияСотрудников.РаботникиПоДоговорамГПХ		= РаботникиПоДоговорамГПХ;
	
	ПараметрыПолученияСотрудников.КадровыеДанные = "Подразделение,ВидЗанятости,ВидСобытия,ДатаУвольнения";	
	
	КадровыйУчетРасширенный.ПрименитьОтборПоФункциональнойОпцииВыполнятьРасчетЗарплатыПоПодразделениям(ПараметрыПолученияСотрудников);
	
КонецПроцедуры

Функция ПараметрыПолученияНалоговВзносовОтчисленийКВыплатеВедомости(Ведомость) Экспорт
		
	ПараметрыПолученияНалоговВзносовОтчислений = Новый Структура;
	ПараметрыПолученияНалоговВзносовОтчислений.Вставить("Организация",				Справочники.Организации.ПустаяСсылка());
	ПараметрыПолученияНалоговВзносовОтчислений.Вставить("Подразделение",			Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	ПараметрыПолученияНалоговВзносовОтчислений.Вставить("ВидНалогаВзносаОтчисления",Перечисления.ВидыНалоговВзносовОтчислений.ПустаяСсылка());
	ПараметрыПолученияНалоговВзносовОтчислений.Вставить("ВидПлатежа",				Перечисления.ВидыПлатежейВГосБюджет.ПустаяСсылка());
	ПараметрыПолученияНалоговВзносовОтчислений.Вставить("ПериодРегистрации",		Дата(1,1,1));
	ПараметрыПолученияНалоговВзносовОтчислений.Вставить("Дата",						Дата(1,1,1));
	ПараметрыПолученияНалоговВзносовОтчислений.Вставить("ИгнорируемыеРегистраторы",	Новый Массив);
	
	ПараметрыПолученияНалоговВзносовОтчислений.Организация				= Ведомость.Организация;
	ПараметрыПолученияНалоговВзносовОтчислений.Подразделение			= Ведомость.Подразделение;
	ПараметрыПолученияНалоговВзносовОтчислений.ВидНалогаВзносаОтчисления= Ведомость.ВидНалогаВзносаОтчисления; 
	ПараметрыПолученияНалоговВзносовОтчислений.ВидПлатежа				= Ведомость.ВидПлатежа; 
	ПараметрыПолученияНалоговВзносовОтчислений.ПериодРегистрации		= Ведомость.ПериодРегистрации;
	ПараметрыПолученияНалоговВзносовОтчислений.Дата						= Ведомость.Дата;
	ПараметрыПолученияНалоговВзносовОтчислений.ИгнорируемыеРегистраторы	= Ведомость.Ссылка;

	Возврат ПараметрыПолученияНалоговВзносовОтчислений;
	
КонецФункции

Процедура ЗаполнитьПоТаблицеНалогиВзносы(Ведомость, ТаблицаНалогиВзносы) Экспорт
	
	НалогиВзносыОтчисления.Загрузить(ТаблицаНалогиВзносы);
	
	// Убираем нулевые строки
	УдаляемыеСтрокиНалогиВзносыОтчисления = Новый Массив;
	Для Каждого СтрокаНалогиВзносы Из НалогиВзносыОтчисления Цикл
		Если СтрокаНалогиВзносы.НалогВзнос = 0 Тогда
			УдаляемыеСтрокиНалогиВзносыОтчисления.Добавить(СтрокаНалогиВзносы);
		КонецЕсли;	
	КонецЦикла;
	Для Каждого УдаляемаяСтрокаНалогиВзносыОтчисления Из УдаляемыеСтрокиНалогиВзносыОтчисления Цикл
		НалогиВзносыОтчисления.Удалить(УдаляемаяСтрокаНалогиВзносыОтчисления);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьНалогиВзносыОтчисления(ФизическиеЛица) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Отбираем сотрудников по переданным физическим лицам.
	СоздатьВТСотрудникиДляВедомостиПоФизическимЛицам(МенеджерВременныхТаблиц, ФизическиеЛица);
	
	// Получаем взносы и отчисления для отобранных сотрудников.
	ПараметрыПолученияНалоговВзносовОтчислений = ПараметрыПолученияНалоговВзносовОтчисленийКВыплатеВедомости(ЭтотОбъект);
	СоздатьВТНалогиВзносыКВыплате(МенеджерВременныхТаблиц, Истина, ПараметрыПолученияНалоговВзносовОтчислений, "ВТСотрудникиДляВедомости");
	
	ОтборПоПодразделению = Ложь;
	Если ПолучитьФункциональнуюОпцию("ВыполнятьРасчетЗарплатыПоПодразделениям") 
			 И ЗначениеЗаполнено(Подразделение) Тогда
		ОтборПоПодразделению = Истина;
	КонецЕсли;
	
	// Формируем отсортированные налоги, взносы, отчисления сотрудников к выплате.
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НалогиВзносыОтчисления.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ЕСТЬNULL(НалогиВзносыОтчисления.НалогВзнос, 0) КАК НалогВзнос,
	|	ЕСТЬNULL(НалогиВзносыОтчисления.МесяцНалоговогоПериода, &ПериодРегистрации) КАК МесяцНалоговогоПериода
	|ИЗ
	|	ВТСотрудникиДляВедомости КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогиВзносыОтчисления КАК НалогиВзносыОтчисления
	|		ПО (НалогиВзносыОтчисления.ФизическоеЛицо = Сотрудники.ФизическоеЛицо)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НалогиВзносыОтчисленияПрочиеФизЛица.ФизическоеЛицо,
	|	НалогиВзносыОтчисленияПрочиеФизЛица.РегистрацияВНалоговомОргане,
	|	НалогиВзносыОтчисленияПрочиеФизЛица.НалогВзнос,
	|	НалогиВзносыОтчисленияПрочиеФизЛица.МесяцНалоговогоПериода
	|ИЗ
	|	ВТНалогиВзносыОтчисленияПрочиеФизЛица КАК НалогиВзносыОтчисленияПрочиеФизЛица
	|ГДЕ
	|	НалогиВзносыОтчисленияПрочиеФизЛица.ФизическоеЛицо В (&МассивФизЛиц)
	|	И &ОтборПоПодразделению = ЛОЖЬ";
	Запрос.УстановитьПараметр("ОтборПоПодразделению",ОтборПоПодразделению);
	Запрос.УстановитьПараметр("МассивФизЛиц",ФизическиеЛица);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(НалогиВзносыОтчисления.Добавить(), Выборка);
		
	КонецЦикла;
	
	Для Каждого Элемент Из ФизическиеЛица Цикл
		
		НайденнаяСтрока = НалогиВзносыОтчисления.Найти(Элемент,"ФизическоеЛицо");
		
		Если НайденнаяСтрока = Неопределено Тогда
			
			СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для сотрудника: %1 отсутствуют остатки по виду налога, взноса, отчисления: %2 на %3'"),
				Элемент,ВидНалогаВзносаОтчисления,Формат(ПериодРегистрации,"ДЛФ=DD"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьВТСотрудникиДляВедомостиПоФизическимЛицам(МенеджерВременныхТаблиц, ФизическиеЛица);

	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	
	ПараметрыПолученияСотрудников.СписокФизическихЛиц = ФизическиеЛица;
	
	ЗаполнитьПараметрыПолученияСотрудниковПоШапкеВедомости(ПараметрыПолученияСотрудников, ЭтотОбъект);	
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(
		МенеджерВременныхТаблиц, Истина, 
		ПараметрыПолученияСотрудников, 
		"ВТСотрудникиДляВедомости");  
		
КонецПроцедуры
	
#КонецОбласти

#КонецОбласти

#КонецЕсли