
#Область ПрограммныйИнтерфейс

Процедура ВыгрузитьНаСервКаспи() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураХарактеристикиТовараКаспи.Ссылка КАК Ссылка,
	|	КОЛИЧЕСТВО(ЕСТЬNULL(НоменклатураХарактеристикиТовараКаспи.Значение, 0)) КАК ЕстьДанные,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(НоменклатураХарактеристикиТовараКаспи.Значение, 0) <> """"
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК заполн
	|ПОМЕСТИТЬ втДанные
	|ИЗ
	|	Справочник.Номенклатура.ХарактеристикиТовараКаспи КАК НоменклатураХарактеристикиТовараКаспи
	|ГДЕ
	|	НоменклатураХарактеристикиТовараКаспи.Обязательный
	|	И НЕ НоменклатураХарактеристикиТовараКаспи.Ссылка.ВыгруженНаКаспи
	|	И НоменклатураХарактеристикиТовараКаспи.Ссылка.Марка <> &Марка
	|
	|СГРУППИРОВАТЬ ПО
	|	НоменклатураХарактеристикиТовараКаспи.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанные.Ссылка КАК Номенклатура
	|ПОМЕСТИТЬ втЗаполненаяНоменклатура
	|ИЗ
	|	втДанные КАК втДанные
	|ГДЕ
	|	втДанные.ЕстьДанные - втДанные.заполн = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура.КатегорияТовара КАК КатегорияКаспи,
	|	ТоварыНаСкладахОстатки.Номенклатура.Артикул КАК артикул,
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика1,
	|	ПОДСТРОКА(ТоварыНаСкладахОстатки.Номенклатура.Описание, 1, 200) КАК описание,
	|	ПОДСТРОКА(ТоварыНаСкладахОстатки.Номенклатура.Описание, 1, 1024) КАК описаниеZM,
	|	"""" КАК цвет,
	|	"""" КАК размер,
	|	линкиФото.Ссылка КАК фото,
	|	"""" КАК ЦветКаспи,
	|	"""" КАК РазмерКаспи
	|ИЗ
	|	втЗаполненаяНоменклатура КАК втЗаполненаяНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураПрисоединенныеФайлы КАК линкиФото
	|			ПО ТоварыНаСкладахОстатки.Номенклатура = линкиФото.ВладелецФайла
	|		ПО (ТоварыНаСкладахОстатки.Номенклатура = втЗаполненаяНоменклатура.Номенклатура)
	|ГДЕ
	|	ТоварыНаСкладахОстатки.Склад В ИЕРАРХИИ(&Склад)
	|	И НЕ линкиФото.Ссылка ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Номенклатура,
	|	ТоварыНаСкладахОстатки.Характеристика,
	|	ТоварыНаСкладахОстатки.Номенклатура.Артикул,
	|	ПОДСТРОКА(ТоварыНаСкладахОстатки.Номенклатура.Описание, 1, 200),
	|	ПОДСТРОКА(ТоварыНаСкладахОстатки.Номенклатура.Описание, 1, 1024),
	|	линкиФото.Ссылка,
	|	ТоварыНаСкладахОстатки.Номенклатура.КатегорияТовара
	|ИТОГИ ПО
	|	Номенклатура,
	|	Характеристика1";
	
	
	настр=Справочники.TRP_S_НастройкиМаркетплейса.НастройкиКаспи;
	
	списВидНом=настр.НеВыгружатьКатегории.ВыгрузитьКолонку("ВидНоменклатуры");
	списСклад=настр.СкладыКаспи.ВыгрузитьКолонку("Склад");

	Запрос.УстановитьПараметр("ВидНоменклатуры", списВидНом);
	Запрос.УстановитьПараметр("Свойство", настр.ХарактеристикаЦвет);
	Запрос.УстановитьПараметр("Свойство2", настр.ХарактеристикаРазмер);
	Запрос.УстановитьПараметр("Склад", списСклад);
	Запрос.УстановитьПараметр("Марка", Справочники.Марки.ПустаяСсылка());
	
	данныеПоТоварам = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	м=новый массив;
	
	для каждого ст из данныеПоТоварам.Строки цикл
		для каждого ст1 из ст.Строки цикл
			структ=создатьДжсонТоваров(ст1); 
			
			рез=истина;
			если структ<>"" тогда
				рез=ЗаписатьДЖдляПроверки(структ);
			КонецЕсли;
			
			если рез и структ<>"" тогда
				м.Добавить(структ);
			иначе
				записатьВЛогОтправки(""+ст1.артикул+"	"+ст1.Номенклатура,"Ошибка записиДЖСОН");
				прервать;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	если м.Количество()<>0 тогда
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON,м);
		СтрокаJS = ЗаписьJSON.Закрыть();
		
		кодОтправки=отправитьДжсон(СтрокаJS,данныеПоТоварам);  
		
		рег=РегистрыСведений.ЛогОтравкиКарточекТовараКаспи.СоздатьМенеджерЗаписи();
		рег.Активность=Истина;
		рег.КодОтправки=кодОтправки;
		рег.Период=ТекущаяДата();
		рег.СтрокаЖС=СтрокаJS;
		рег.Записать();  
		
	иначе
		
		рег=РегистрыСведений.ЛогОтравкиКарточекТовараКаспи.СоздатьМенеджерЗаписи();
		рег.Активность=Истина;
		рег.КодОтправки="";
		рег.Период=ТекущаяДата();
		рег.СтрокаЖС="Все валидные карты товаров выгружены";
		рег.Записать();  
		
	КонецЕсли;

КонецПроцедуры

Процедура ОтправитьПрайсНаСервере() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры.игр_КатегорияКаспи КАК КатегорияКаспи,
	|	ТоварыНаСкладахОстатки.Номенклатура.Артикул КАК артикул,
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	|	ТоварыНаСкладахОстатки.Склад КАК Склад,
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ост,
	|	ценаРозн2.Цена КАК ЦенаРозн
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ) КАК ценаРозн2
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ценаРозн2.Номенклатура
	|			И ТоварыНаСкладахОстатки.Характеристика = ценаРозн2.Характеристика
	|			И (ценаРозн2.ВидЦены = &ВидЦены2)
	|ГДЕ
	|	ТоварыНаСкладахОстатки.Склад В ИЕРАРХИИ(&Склад)
	|	И ТоварыНаСкладахОстатки.Номенклатура.ВыгруженНаКаспи
	|	И ТоварыНаСкладахОстатки.ВНаличииОстаток >= &колРезерв
	|ИТОГИ ПО
	|	артикул,
	|	Характеристика";
	
	
	настр=Справочники.TRP_S_НастройкиМаркетплейса.НастройкиКаспи;
	
	списСклад=настр.СкладыКаспи.ВыгрузитьКолонку("Склад");
	
	Запрос.УстановитьПараметр("ВидЦены2", настр.ВидЦены);
	Запрос.УстановитьПараметр("Склад",списСклад);
	Запрос.УстановитьПараметр("колРезерв",настр.РезервКоличестваТоваров);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	рез = РезультатЗапроса.выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ф = создатьХМЛфайл(рез,настр);
	
	ОтправитьНаФТП(ф);
	
	УдалитьФайлы(ф);

КонецПроцедуры

Функция ПолучитьНастройкиПодключения() Экспорт
	
	Результат	= Новый Структура("АдресAPI, Токен", "", "");
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыУчетнойЗаписи = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(КлючНастроекПодключения(), "АдресAPI, Токен");
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗаполнитьЗначенияСвойств(Результат, ПараметрыУчетнойЗаписи);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНастройкиВыгрузкиНоменклатуры() Экспорт
	
	Результат	= Новый Структура("ВидЦеныПродажа, ВидЦеныСебестоимость, Адрес, Папка, ИмяПользователя, Пароль",
		"", "", "", "", "", "");
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыУчетнойЗаписи = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(КлючНастроекВыгрузкиНоменклатуры(), 
		"ВидЦеныПродажа, ВидЦеныСебестоимость, Адрес, Папка, ИмяПользователя, Пароль");
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗаполнитьЗначенияСвойств(Результат, ПараметрыУчетнойЗаписи);
	
	Возврат Результат;
	
КонецФункции

Функция КлючНастроекПодключения() Экспорт
	
	Возврат "НастройкиПодключенияКаспи";
	
КонецФункции

Функция КлючНастроекВыгрузкиНоменклатуры() Экспорт
	
	Возврат "НастройкиВыгрузкиНоменклатуры";
	
КонецФункции

Процедура ЗагрузитьХарактеристикиКатегорий(КатегорияСсылка, НаименованиеКатегории) Экспорт
	
	МассивХарактеристик = ПолучитьХарактеристикиКатегории(НаименованиеКатегории);  
	
	Если ТипЗнч(МассивХарактеристик) <> Тип("Массив") Тогда
		ВызватьИсключение СтрШаблон("Категория %1 не найдена в Каспи", НаименованиеКатегории);
	КонецЕсли;  
	
	Таблица	= Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Колонка1");
	Таблица.Колонки.Добавить("Колонка2");
	Таблица.Колонки.Добавить("Колонка22");
	Таблица.Колонки.Добавить("Колонка3");
	Таблица.Колонки.Добавить("Колонка4");
	
	НоваяСтрока	= Таблица.Добавить();
	НоваяСтрока.колонка1	= НаименованиеКатегории;
	
	Для Каждого Элемент Из МассивХарактеристик Цикл
		
		МассивПодстрок	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Элемент["code"],"*");
		НоваяСтрока	= Таблица.Добавить();
		НоваяСтрока.колонка1	= НаименованиеКатегории;
		НоваяСтрока.колонка2	= МассивПодстрок[2];  
		НоваяСтрока.колонка22	= Элемент["code"];  
		НоваяСтрока.колонка3	= Элемент["mandatory"];  
		НоваяСтрока.колонка4	= Элемент["type"];
		
		Если Элемент["type"] = "enum" Тогда
			МассивЗначений	= ПолучитьЗначенияХарактеристикиКатегории(НаименованиеКатегории, Элемент["code"]);
			Для Каждого ЭлементЗначение Из МассивЗначений Цикл
				НоваяСтрока	= Таблица.Добавить();
				НоваяСтрока.колонка1	= НаименованиеКатегории;
				НоваяСтрока.колонка2	= МассивПодстрок[2];  
				НоваяСтрока.колонка22	= Элемент["code"];  
				НоваяСтрока.колонка3	= ЭлементЗначение["name"];   
				НоваяСтрока.колонка4	= Элемент["type"];
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Обязательный	= Ложь;
	Для Каждого СтрокаТаблицы Из Таблица Цикл   
		
		Если СтрокаТаблицы.колонка3="" Тогда Продолжить; КонецЕсли;
		
		Запись	= РегистрыСведений.ДопСвойстваТоваровКаспи.СоздатьМенеджерЗаписи(); 
		
		Запись.Категория		= КатегорияСсылка;
		Запись.Свойство			= СтрокаТаблицы.колонка2;
		Запись.СвойствоКаспи	= СтрокаТаблицы.колонка22;  
		Запись.Тип				= СтрокаТаблицы.колонка4;
		Если ТипЗнч(СтрокаТаблицы.колонка3) = Тип("Булево") Тогда
			Запись.Обязательный	= СтрокаТаблицы.колонка3;   
			Обязательный		= Запись.Обязательный;
		Иначе
			Запись.Обязательный	= Обязательный;
			Запись.Значение		= СтрокаТаблицы.колонка3;
		КонецЕсли;
		Запись.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЭтикеткуЗаказа(НомерЗаказа) Экспорт
	
	НастройкиПодключения	= игр_ИнтеграцияКаспиПовтИсп.ПолучитьНастройкиПодключения();
	
	АдресРесурса	= СтрШаблон("%1%2", НастройкиПодключения.АдресAPI, "orders");
	
	ДополнительныеПараметры	= КоннекторHTTP.НовыеПараметры();
	
	ДополнительныеПараметры.Таймаут	= 60;

	ДополнительныеПараметры.Заголовки.Вставить("Content-Type", "application/json");
	ДополнительныеПараметры.Заголовки.Вставить("X-Auth-Token", НастройкиПодключения.Токен);
	
	ДополнительныеПараметры.ПараметрыЗапроса	= Новый Соответствие;
	ДополнительныеПараметры.ПараметрыЗапроса.Вставить("filter[orders][code]", НомерЗаказа);
	
	Ответ	= КоннекторHTTP.Get(АдресРесурса,, ДополнительныеПараметры);
	
	Если Ответ.КодСостояния <> 200 Тогда
		
		ВызватьИсключение СтрШаблон("Ошибка соединения: %1", КоннекторHTTP.КакТекст(Ответ));
		
	КонецЕсли;
	
	Данные	= КоннекторHTTP.КакJson(Ответ);
	РеквизитыЗаказа	= Данные["data"][0]["attributes"];
	ДанныеДоставки	= РеквизитыЗаказа["kaspiDelivery"];
	
	АдресЭтикетки	= ДанныеДоставки["waybill"];
	
	Если НЕ ЗначениеЗаполнено(АдресЭтикетки) Тогда
		ВызватьИсключение "Адрес этикетки для заказа не найдено в Каспи";
	КонецЕсли;
	
	ДополнительныеПараметры	= КоннекторHTTP.НовыеПараметры();
	Ответ	= КоннекторHTTP.Get(АдресЭтикетки,, ДополнительныеПараметры);

	Если Ответ.КодСостояния <> 200 Тогда
		
		ВызватьИсключение СтрШаблон("Ошибка соединения: %1", КоннекторHTTP.КакТекст(Ответ));
		
	КонецЕсли;
	
	ДанныеФайла	= КоннекторHTTP.КакДвоичныеДанные(Ответ);
	Адрес		= ПоместитьВоВременноеХранилище(ДанныеФайла);
	
	Возврат Адрес;
	
КонецФункции

Функция ОтправитьКодПокупателюНаВыдачу(НомерЗаказа) Экспорт
	
	НастройкиПодключения	= игр_ИнтеграцияКаспиПовтИсп.ПолучитьНастройкиПодключения();
	
	АдресРесурса	= СтрШаблон("%1%2", НастройкиПодключения.АдресAPI, "orders");
	
	ДополнительныеПараметры	= КоннекторHTTP.НовыеПараметры();
	
	ДополнительныеПараметры.Заголовки.Вставить("Content-Type", "application/vnd.api+json");
	ДополнительныеПараметры.Заголовки.Вставить("X-Auth-Token", НастройкиПодключения.Токен);
	ДополнительныеПараметры.Заголовки.Вставить("X-Security-Code", "");
	ДополнительныеПараметры.Заголовки.Вставить("X-Send-Code", Истина);
	
	ДанныеЗапроса	= Новый Структура;
	ДанныеЗапроса.Вставить("data", Новый Структура);
	ДанныеЗапроса.data.Вставить("type", "orders");
	ДанныеЗапроса.data.Вставить("id", НомерЗаказа);
	ДанныеЗапроса.data.Вставить("attributes", Новый Структура);
	ДанныеЗапроса.data.attributes.Вставить("code", "ordercode");
	ДанныеЗапроса.data.attributes.Вставить("status", "COMPLETED"); 
	
	ДополнительныеПараметры.Данные	= ДанныеЗапроса;
	
	Ответ	= КоннекторHTTP.Post(АдресРесурса,, ДополнительныеПараметры);
	
	Если Ответ.КодСостояния <> 200 Тогда
		
		ВызватьИсключение СтрШаблон("Ошибка соединения %1: %2", Ответ.КодСостояния, КоннекторHTTP.КакТекст(Ответ));
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ИзменитьСтатусЗаказаВыдан(НомерЗаказа, КодПодтверждения) Экспорт
	
	НастройкиПодключения	= игр_ИнтеграцияКаспиПовтИсп.ПолучитьНастройкиПодключения();
	
	АдресРесурса	= СтрШаблон("%1%2", НастройкиПодключения.АдресAPI, "orders");
	
	ДополнительныеПараметры	= КоннекторHTTP.НовыеПараметры();
	
	ДополнительныеПараметры.Заголовки.Вставить("Content-Type", "application/vnd.api+json");
	ДополнительныеПараметры.Заголовки.Вставить("X-Auth-Token", НастройкиПодключения.Токен);
	ДополнительныеПараметры.Заголовки.Вставить("X-Security-Code", КодПодтверждения);
	ДополнительныеПараметры.Заголовки.Вставить("X-Send-Code", Истина);
	
	ДанныеЗапроса	= Новый Структура;
	ДанныеЗапроса.Вставить("data", Новый Структура);
	ДанныеЗапроса.data.Вставить("type", "orders");
	ДанныеЗапроса.data.Вставить("id", НомерЗаказа);
	ДанныеЗапроса.data.Вставить("attributes", Новый Структура);
	ДанныеЗапроса.data.attributes.Вставить("code", "ordercode");
	ДанныеЗапроса.data.attributes.Вставить("status", "COMPLETED");

	ДополнительныеПараметры.Данные	= ДанныеЗапроса;
	
	Ответ	= КоннекторHTTP.Post(АдресРесурса,, ДополнительныеПараметры);
	
	Если Ответ.КодСостояния <> 200 Тогда
		
		ВызватьИсключение СтрШаблон("Ошибка соединения %1: %2", Ответ.КодСостояния, КоннекторHTTP.КакТекст(Ответ));
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#Область ЗапросыAPI

Функция ПолучитьХарактеристикиКатегории(Категория)
	
	НастройкиПодключения	= игр_ИнтеграцияКаспиПовтИсп.ПолучитьНастройкиПодключения();
	
	АдресРесурса	= СтрШаблон("%1%2", НастройкиПодключения.АдресAPI, "products/classification/attributes");
	
	ДополнительныеПараметры	= КоннекторHTTP.НовыеПараметры();
	
	ДополнительныеПараметры.Заголовки.Вставить("Content-Type", "application/json");
	ДополнительныеПараметры.Заголовки.Вставить("X-Auth-Token", НастройкиПодключения.Токен);
	
	ДополнительныеПараметры.ПараметрыЗапроса	= Новый Соответствие;
	ДополнительныеПараметры.ПараметрыЗапроса.Вставить("c", Категория);
	
	Ответ	= КоннекторHTTP.Get(АдресРесурса,, ДополнительныеПараметры);
	
	Если Ответ.КодСостояния <> 200 Тогда
		
		ВызватьИсключение СтрШаблон("Ошибка соединения: %1", КоннекторHTTP.КакТекст(Ответ));
		
	КонецЕсли;
	
	Возврат КоннекторHTTP.КакJson(Ответ);
	
КонецФункции

Функция ПолучитьЗначенияХарактеристикиКатегории(Категория, Характеристика)
	
	НастройкиПодключения	= игр_ИнтеграцияКаспиПовтИсп.ПолучитьНастройкиПодключения();
	
	АдресРесурса	= СтрШаблон("%1%2", НастройкиПодключения.АдресAPI, "products/classification/attribute/values");
	
	ДополнительныеПараметры	= КоннекторHTTP.НовыеПараметры();
	
	ДополнительныеПараметры.Заголовки.Вставить("Content-Type", "application/json");
	ДополнительныеПараметры.Заголовки.Вставить("X-Auth-Token", НастройкиПодключения.Токен);
	
	ДополнительныеПараметры.ПараметрыЗапроса	= Новый Соответствие;
	ДополнительныеПараметры.ПараметрыЗапроса.Вставить("c", Категория);
	ДополнительныеПараметры.ПараметрыЗапроса.Вставить("a", Характеристика);
	
	Ответ	= КоннекторHTTP.Get(АдресРесурса,, ДополнительныеПараметры);
	
	Если Ответ.КодСостояния <> 200 Тогда
		
		ВызватьИсключение СтрШаблон("Ошибка соединения: %1", КоннекторHTTP.КакТекст(Ответ));
		
	КонецЕсли;
	
	Возврат КоннекторHTTP.КакJson(Ответ);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаписатьДЖдляПроверки(структ)
	
	фл=истина;
	попытка
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON,структ);
		СтрокаJS = ЗаписьJSON.Закрыть();
	Исключение
		фл=ложь;
	КонецПопытки;
	
	возврат фл;
	
КонецФункции

Функция СоздатьХМЛфайл(Знач рез, настр)
	
	ЗаписьXML = Новый ЗаписьXML;  
	ф=ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML.ОткрытьФайл(ф);
	
	тзСклады=ПолучитьСписСкладов();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("kaspi_catalog");
	ЗаписьXML.ЗаписатьАтрибут("xmlns", "kaspiShopping");
	ЗаписьXML.ЗаписатьАтрибут("xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьАтрибут("date", "string");
	ЗаписьXML.ЗаписатьАтрибут("xsi:schemaLocation", "kaspiShopping http://kaspi.kz/kaspishopping.xsd");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("company");
	ЗаписьXML.ЗаписатьТекст(настр.КодКомпанииВ_Каспи);
	ЗаписьXML.ЗаписатьКонецЭлемента(); //company
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("merchantid");
	ЗаписьXML.ЗаписатьТекст(настр.MerchantID);
	ЗаписьXML.ЗаписатьКонецЭлемента(); //company
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("offers");
	
	для каждого ст из рез.Строки цикл
		если  сокрлп(ст.артикул)="" тогда Продолжить; КонецЕсли;
		для каждого ст1 из ст.строки Цикл
			к=1;   
			для каждого ст2 из ст1.строки Цикл
				если к=1 тогда
					ЗаписьXML.ЗаписатьНачалоЭлемента("offer"); 
					если ЗначениеЗаполнено(ст2.Характеристика) тогда
						ЗаписьXML.ЗаписатьАтрибут("sku", ст2.артикул+"_"+ст2.Характеристика.уникальныйИдентификатор());
					иначе
						ЗаписьXML.ЗаписатьАтрибут("sku", ст2.артикул);
					КонецЕсли;
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("model");
					ЗаписьXML.ЗаписатьТекст(строка(""+ст2.номенклатура+" "+ст2.Характеристика));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //model
					ЗаписьXML.ЗаписатьНачалоЭлемента("brand");
					ЗаписьXML.ЗаписатьТекст(строка(""));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //brand
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("availabilities");
					к=2;
				КонецЕсли;
				
				кодСклад=ПолучитьКодСклада(ст2.склад);				
				стр=тзСклады.Найти(сокрлп(кодСклад));
				если стр<>Неопределено тогда
					стр.уже=1;
				КонецЕсли;
				
				если ст2.склад<>null тогда
					ЗаписьXML.ЗаписатьНачалоЭлемента("availability");
					ЗаписьXML.ЗаписатьАтрибут("available", ?(ст2.ост>0,"yes","no"));
					ЗаписьXML.ЗаписатьАтрибут("storeId", кодСклад);
					Если ст2.ост > 0 Тогда
						ЗаписьXML.ЗаписатьАтрибут("stockCount", Формат(ст2.ост, "ЧГ="));
					КонецЕсли;
					ЗаписьXML.ЗаписатьКонецЭлемента();//availability
				КонецЕсли;
				ц=ст2.ЦенаРозн;
				цена=формат(ц,"ЧГ=");
			КонецЦикла;   
			
			для каждого сстт из тзСклады цикл
				если сстт.уже<>1 тогда
					ЗаписьXML.ЗаписатьНачалоЭлемента("availability");
					ЗаписьXML.ЗаписатьАтрибут("available", "no");
					ЗаписьXML.ЗаписатьАтрибут("storeId", сстт.код);
					ЗаписьXML.ЗаписатьКонецЭлемента();//availability
				КонецЕсли;
			КонецЦикла;
			
			для каждого сстт из тзСклады цикл сстт.уже=0 КонецЦикла;
			
			ЗаписьXML.ЗаписатьКонецЭлемента(); //availabilities
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("price");
			ЗаписьXML.ЗаписатьТекст(цена);
			ЗаписьXML.ЗаписатьКонецЭлемента(); //price
			
			ЗаписьXML.ЗаписатьКонецЭлемента(); //offer
		КонецЦикла;
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); //offers
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); //kaspi_catalog    
	
	ЗаписьXML.Закрыть();
	
	Возврат ф;

КонецФункции    

Функция ОтправитьДжсон(жс, данные)
	
	WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
	
	WinHttp.Open("POST","https://kaspi.kz/shop/api/products/import",0); 
	
	
	WinHttp.setRequestHeader("Accept", "application/json");
	WinHttp.setRequestHeader("Content-Type", "text/plain");
	WinHttp.setRequestHeader("X-Auth-Token", "Ku7Z94wIKPRZ5BYlyBrNuG2FGTMkr16SFUAxf12lERY=");  
	WinHttp.Send(жс);
	ТекстОтвета = WinHttp.ResponseText();
	
	если не WinHttp.Status=200 тогда
		Сообщить("Соединение с сервером не установлено ("+WinHttp.StatusText+")");
		
		возврат ""
	иначе
		для каждого ст из данные.Строки цикл
			о=ст.номенклатура.получитьОбъект();
			о.ВыгруженНаКаспи=Истина;    
			о.записать();
		КонецЦикла;  
	КонецЕсли;
	
	Чтение = Новый ЧтениеJSON;   
	ТекстОтвета=СтрЗаменить(ТекстОтвета,"$","");
	чтение.УстановитьСтроку(ТекстОтвета);
	Структура = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();  	
	
	возврат Структура.code; 
	
КонецФункции

#КонецОбласти

&НаСервере
Функция создатьДжсонТоваров(ст)

	
	структ=новый Структура;  
	
	если ЗначениеЗаполнено(ст.Характеристика1)  тогда
		артКасп=""+ст.артикул+"_"+ст.Характеристика1.УникальныйИдентификатор() ;  //если нет характеристик арт без хар
	иначе
		артКасп=""+ст.артикул;
	КонецЕсли;
	//цветК=ст.Строки[0].цветКаспи;
	//размерК=ст.Строки[0].РазмерКаспи;
	//если размерК="1" тогда 
	//	размерК="универсальный"
	//КонецЕсли;
	//НаимКаспи=""+ст.номенклатура+"   цвет:"+цветК+"  размер:"+размерК;   
	НаимКаспи=""+ст.номенклатура;
	
	структ.Вставить("sku",артКасп);
	структ.Вставить("title",НаимКаспи);
	структ.Вставить("brand",ст.Номенклатура.Марка.наименование);
	структ.Вставить("category",ст.категорияКаспи.НаименованиеКаспи);  
	если СокрЛП(ст.описание)="" и СокрЛП(ст.описаниеZM)="" тогда
		структ.Вставить("description",НаимКаспи);    
	иначе           
		если СокрЛП(ст.описаниеZM)="" тогда
			структ.Вставить("description",ст.описание);             
		иначе
			структ.Вставить("description",ст.описаниеZM);             
		КонецЕсли;
	КонецЕсли;
	
	матр=новый массив;  
	
	фл=истина;

	для каждого стт из ст.номенклатура.ХарактеристикиТовараКаспи цикл 
		если не ЗначениеЗаполнено(стт.значение) тогда Продолжить; КонецЕсли; 
		мартструкт=новый Структура();
		мартструкт.Вставить("code",стт.характеристикаКаспи);
			если стт.Тип="number" тогда
				знч=стт.значение;
				фл=истина;
				попытка
					знч=число(знч)
				Исключение
					фл=ложь;
				КонецПопытки;
				
				если фл тогда
					мартструкт.Вставить("value",число(стт.значение));
				иначе
					записатьВЛогОтправки("артикул:"+арткасп+" значение:"+стт.значение,"Ошибка преобразования типа");
					прервать;
				КонецЕсли;
			иначеесли стт.Тип="boolean" тогда
				мартструкт.Вставить("value",Булево(стт.значение));
			иначе
				мартструкт.Вставить("value",стт.значение);
			КонецЕсли;
		матр.Добавить(мартструкт);   
	КонецЦикла;

	
	структ.Вставить("attributes",матр);

	мимж=новый массив;   
	
	к=1;
	для каждого стт из ст.строки цикл   
		
		урл="http://45.86.81.195:8064/ka_work/hs/gi_api/image?id="+стт.фото.уникальныйИдентификатор();
		мимж.Добавить(новый Структура("url",урл)); 
		если к=7 тогда Прервать; КонецЕсли;
		к=к+1;
	КонецЦикла;
	
	структ.Вставить("images",мимж);  
	
	если фл тогда
		возврат структ;
	иначе
		возврат "";
	КонецЕсли;
КонецФункции

процедура записатьВЛогОтправки(ст,видОш)
	рег=РегистрыСведений.ЛогОтравкиКарточекТовараКаспи.СоздатьМенеджерЗаписи();
	рег.Активность=Истина;
	рег.КодОтправки=видОш;
	рег.Период=ТекущаяДата();
	рег.СтрокаЖС=ст;
	рег.Записать();  
КонецПроцедуры

Процедура ОтправитьНаФТП(фф)  
	спр=Справочники.TRP_S_НастройкиМаркетплейса.НастройкиКаспи; 
	
	АдресСайта = спр.АдресСервера;
	Порт = спр.Порт;
	Логин = спр.ИмяПользователя;
	Пароль = спр.Пароль;
	ИмяКаталога = "/Kaspy/";
	FTPСоединение = Новый FTPСоединение(АдресСайта,Порт,Логин,Пароль,,истина);
	FTPСоединение.УстановитьТекущийКаталог(ИмяКаталога);
	
	FTPСоединение.Записать(фф,"KaspiFeed.xml");  
КонецПроцедуры

Функция  ПолучитьСписСкладов()  
	спр=Справочники.TRP_S_НастройкиМаркетплейса.НастройкиКаспи; 
	
	тз1=новый ТаблицаЗначений;
	тз1.Колонки.Добавить("код");
	тз1.Колонки.Добавить("уже");
	
	для каждого ст из спр.СкладыКаспи цикл  
		с=тз1.Добавить();
		с.код=ст.КодКаспи;
		с.уже=0;
	КонецЦикла;
	
	возврат тз1;
КонецФункции

Функция ПолучитьКодСклада(скл)
	спр=Справочники.TRP_S_НастройкиМаркетплейса.НастройкиКаспи; 
	с=спр.СкладыКаспи.Найти(скл);
	
	возврат с.КодКаспи;
КонецФункции

Процедура ВыгрузкаПрайсаКаспи() Экспорт
	ОтправитьПрайсНаСервере()
КонецПроцедуры

Процедура ВыгрузкаКарточекТовараКаспи() Экспорт
	ВыгрузитьНаСервКаспи()
КонецПроцедуры

