#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
    
    ТекущийОбъект = ЭтотОбъект[0];
    МассивНепроверяемыхРеквизитов = Новый Массив;
    
    Если НЕ ТекущийОбъект.ТипРасходов = Перечисления.ТипыЗатратРегл.Прочее Тогда
        МассивНепроверяемыхРеквизитов.Добавить("ВидДоходаРасхода");    
    КонецЕсли; 
    
    ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли
