#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция получает элемент справочника - ключ аналитики учета.
//
// Параметры:
//	ПараметрыАналитики - Коллекция - Коллекция параметров для получения ключа
//
// Возвращаемое значение:
//	СправочникСсылка.КлючиАналитикиУчетаПоПартнерам - Найденный элемент справочника
//
Функция ЗначениеКлючаАналитики(ПараметрыАналитики) Экспорт

	МенеджерЗаписи = РегистрыСведений.АналитикаУчетаВнеоборотныхАктивов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыАналитики, "ВидАктиваНУ, ВидДвиженияСтоимостиНУ");
	МенеджерЗаписи.Прочитать();

	Если МенеджерЗаписи.Выбран() Тогда
		ЭлементКлючАналитики = МенеджерЗаписи.КлючАналитики;
	Иначе
		ЭлементКлючАналитики = СоздатьКлючАналитики(ПараметрыАналитики);
	КонецЕсли;

	Возврат ЭлементКлючАналитики;

КонецФункции

// Функция получает элемент справочника - ключ аналитики учета.
//
// Параметры:
//	ПараметрыАналитики - Выборка или Структура  с полями "Организация, Партнер, Контрагент, Договор".
//
// Возвращаемое значение:
//	СправочникСсылка.КлючиАналитикиУчетаПоПартнерам - Найденный элемент справочника
//
Функция СоздатьКлючАналитики(ПараметрыАналитики) Экспорт

	МенеджерЗаписи = РегистрыСведений.АналитикаУчетаВнеоборотныхАктивов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыАналитики, "ВидАктиваНУ, ВидДвиженияСтоимостиНУ");

	// Создание нового ключа аналитики.
	СправочникОбъект = Справочники.КлючиАналитикиУчетаВА.СоздатьЭлемент();
	СправочникОбъект.Наименование = ПолучитьПолноеНаименованиеКлючаАналитики(МенеджерЗаписи);
	ЗаполнитьЗначенияСвойств(СправочникОбъект, ПараметрыАналитики, "ВидАктиваНУ, ВидДвиженияСтоимостиНУ");
	СправочникОбъект.Записать();

	Результат = СправочникОбъект.Ссылка;

	МенеджерЗаписи.КлючАналитики = Результат;
	МенеджерЗаписи.Записать(Ложь);

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение 
// ключей аналитики регистра
//
Процедура НачальноеЗаполнение() Экспорт
	
	МассивИсключенийВидовДвиженийСтоимостиФА = Новый Массив;
	МассивИсключенийВидовДвиженийСтоимостиФА.Добавить(Перечисления.ВидыДвиженияСтоимостиФА.РавномерноеСписаниеСтоимостиОбъектаПреференций);
	МассивИсключенийВидовДвиженийСтоимостиФА.Добавить(Перечисления.ВидыДвиженияСтоимостиФА.СписаниеОтрицательногоБалансаГруппы);
	МассивИсключенийВидовДвиженийСтоимостиФА.Добавить(Перечисления.ВидыДвиженияСтоимостиФА.СписаниеПриВыбытииВсехАктивовГруппы);
	МассивИсключенийВидовДвиженийСтоимостиФА.Добавить(Перечисления.ВидыДвиженияСтоимостиФА.СписаниеСтоимостногоБалансаГруппыМенееМинимума);
	
	НаборЗаписей = РегистрыСведений.АналитикаУчетаВнеоборотныхАктивов.СоздатьНаборЗаписей();
	
	ОтборВидАктиваНУ 			= НаборЗаписей.Отбор.ВидАктиваНУ;
	ОтборВидДвиженияСтоимостиНУ = НаборЗаписей.Отбор.ВидДвиженияСтоимостиНУ;
	
	ПараметрыАналитики = Новый Структура("ВидАктиваНУ, ВидДвиженияСтоимостиНУ");
	
	Для Каждого ВидДвиженияСтоимостиНУ Из Перечисления.ВидыДвиженияСтоимостиФА Цикл
		Если Не МассивИсключенийВидовДвиженийСтоимостиФА.Найти(ВидДвиженияСтоимостиНУ) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОтборВидДвиженияСтоимостиНУ.Установить(ВидДвиженияСтоимостиНУ);
		ПараметрыАналитики.ВидДвиженияСтоимостиНУ = ВидДвиженияСтоимостиНУ;
		
		Для Каждого ВидАктиваНУ Из Перечисления.ВидАктиваНУ Цикл
			ОтборВидАктиваНУ.Установить(ВидАктиваНУ);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыАналитики.ВидАктиваНУ = ВидАктиваНУ;
			
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, ПараметрыАналитики);
			
			// Создание нового ключа аналитики
			СправочникОбъект = Справочники.КлючиАналитикиУчетаВА.СоздатьЭлемент();
			СправочникОбъект.Наименование = ПолучитьПолноеНаименованиеКлючаАналитики(Запись);
			ЗаполнитьЗначенияСвойств(СправочникОбъект, ПараметрыАналитики, "ВидАктиваНУ, ВидДвиженияСтоимостиНУ");
			СправочникОбъект.Записать();
			
			Запись.КлючАналитики = СправочникОбъект.Ссылка;
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#Область Прочее

Функция ПолучитьПолноеНаименованиеКлючаАналитики(МенеджерЗаписи)
	
	Наименование = "";
	
	МетаданныеИзмерения = Метаданные.РегистрыСведений.АналитикаУчетаВнеоборотныхАктивов.Измерения;
	Для Каждого Измерение Из МетаданныеИзмерения Цикл
		
		// Получим представление значения, которое указано в измерении регистра сведений.
		ТекстЗначения = Строка(МенеджерЗаписи[Измерение.Имя]);
		Если Не ПустаяСтрока(ТекстЗначения) Тогда
			Наименование = Наименование + ТекстЗначения + "; ";
		КонецЕсли;
		
	КонецЦикла;
	
	Если Прав(Наименование, 2) = "; " Тогда
		Наименование = Лев(Наименование, СтрДлина(Наименование) - 2);
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли