////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ДВИЖЕНИЯМИ ДОКУМЕНТОВ ПО НУ

#Область ПрограммныйИнтерфейс

//Процедура-обработчик подписки на событие ОбработкаПроведения для документов, выполняющих движения по регистрам ОбъектыНалоговогоУчетаФА и ФиксированныеАктивыУчитываемыеОтдельно.
//Предназначена для формирования движений по указанным регистрам.
//
//Параметры:
//		Источник - ДокументОбъект - документ-регистратор для регистров ОбъектыНалоговогоУчетаФА и ФиксированныеАктивыУчитываемыеОтдельно
//		Отказ - Булево - флаг отказа
//		РежимПроведения - РежимПроведенияДокумента - Режим проведения документа
//
Процедура ПриПроведенииДокумента(Источник, Отказ, РежимПроведения) Экспорт

	ДатаУчетнойПолитики = ?(ТипЗнч(Источник) = Тип("ДокументОбъект.ВводОстатковВнеоборотныхАктивов") ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.ВводОстатковВнеоборотныхАктивов2_4"), 
			КонецМесяца(Источник.Дата) + 1, Источник.Дата);
	ПлательщикНалогаНаПрибыль = УчетнаяПолитика.ПлательщикНалогаНаПрибыль(Источник.Организация, ДатаУчетнойПолитики);
	
	Если Отказ Или Не ПлательщикНалогаНаПрибыль Тогда
		Возврат;
	КонецЕсли;

	СтруктураРегистров = Новый Структура("ОбъектыНалоговогоУчетаФА, ФиксированныеАктивыУчитываемыеОтдельно",
		Не Источник.Движения.Найти("ОбъектыНалоговогоУчетаФА") = Неопределено,
		Не Источник.Движения.Найти("ФиксированныеАктивыУчитываемыеОтдельно") = Неопределено);

	ИнициализироватьДанныеДокумента(Источник, Источник.ДополнительныеСвойства, СтруктураРегистров);

	Если СтруктураРегистров.ОбъектыНалоговогоУчетаФА Тогда
		ДвижениеПоРегиструОбъектыНалоговогоУчетаФА(Источник.ДополнительныеСвойства, Источник.Движения, Отказ);
	КонецЕсли;

	Если СтруктураРегистров.ФиксированныеАктивыУчитываемыеОтдельно Тогда
		ДвижениеПоРегиструФиксированныеАктивыУчитываемыеОтдельно(Источник.ДополнительныеСвойства, Источник.Движения, Отказ);
	КонецЕсли;

КонецПроцедуры

Функция ОпределитьВидаАктиваНУ(ПорядокУчета) Экспорт
	
	Если Не ЗначениеЗаполнено(ПорядокУчета) Тогда
		ВидАктиваНУ = Неопределено;
	ИначеЕсли ПорядокУчета = Перечисления.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации Тогда
		ВидАктиваНУ = Перечисления.ВидАктиваНУ.ФиксированныйАктив;
	ИначеЕсли ПорядокУчета = Перечисления.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизацииПоДвойнойНорме
		Или ПорядокУчета = Перечисления.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.ВключениеВРасходыПриПринятииКУчету
		Или ПорядокУчета = Перечисления.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.ОтнесениеНаВычетыРавнымиДолями Тогда
		
		ВидАктиваНУ = Перечисления.ВидАктиваНУ.ФиксированныйАктивУчитываемыйОтдельно;
	Иначе
		ВидАктиваНУ = Перечисления.ВидАктиваНУ.НеФиксированныйАктив;
	КонецЕсли;
	
	Возврат ВидАктиваНУ;

КонецФункции

Процедура СоздатьКлючиАналитикиУчетаВА(ВидыАктиваНУ, ВидыДвиженияСтоимости) Экспорт
	
	ВидыДвижения = Новый Массив;
	ВидыАктива   = Новый Массив;
	
	Если ТипЗнч(ВидыДвиженияСтоимости) = Тип("ПеречислениеСсылка.ВидыДвиженияСтоимостиФА") Тогда
		ВидыДвижения.Добавить(ВидыДвиженияСтоимости);
	Иначе
		ВидыДвижения = ВидыДвиженияСтоимости;
	КонецЕсли;
	
	Если ТипЗнч(ВидыАктиваНУ) = Тип("ПеречислениеСсылка.ВидАктиваНУ") Тогда
		ВидыАктива.Добавить(ВидыАктиваНУ);
	Иначе
		ВидыАктива = ВидыАктиваНУ;
	КонецЕсли;
	
	ПараметрыКлюча = Новый Структура("ВидАктиваНУ, ВидДвиженияСтоимостиНУ");
	
	Для Каждого ВидАктива ИЗ ВидыАктива Цикл
		Для Каждого ВидДвиженияСтоимости Из ВидыДвижения Цикл
			ПараметрыКлюча.ВидАктиваНУ = ВидАктива;
			ПараметрыКлюча.ВидДвиженияСтоимостиНУ = ВидДвиженияСтоимости;
			
			КлючАналитикиВА = РегистрыСведений.АналитикаУчетаВнеоборотныхАктивов.ЗначениеКлючаАналитики(ПараметрыКлюча);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстОтраженияРемонтовВНУ(ДокументИмя) Экспорт
	
	ИмяПроцедуры = "ТекстОтражения" + ДокументИмя + "()";
	
	СписокДокументовКОтражению = ДокументыКОтражениюРасходовНаРемонты();
	
	Если СписокДокументовКОтражению.НайтиПоЗначению(ДокументИмя) = Неопределено Тогда
		ТекстЗапроса = "";
	Иначе
		ТекстЗапроса = Вычислить(ИмяПроцедуры);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ЭтоСчетКапитализацииРасходовПоВНА(Счет) Экспорт
	
	Результат =
		(Счет = ПланыСчетов.Хозрасчетный.ПодготовкаКВводуВЭксплуатацию
		ИЛИ Счет = ПланыСчетов.Хозрасчетный.ПодготовкаКВводуВЭксплуатациюАрендованногоИмущества
		ИЛИ Счет = ПланыСчетов.Хозрасчетный.ПриобретениеЗемельныхУчастков
		ИЛИ Счет = ПланыСчетов.Хозрасчетный.ПриобретениеОбъектовПриродопользования
		ИЛИ Счет = ПланыСчетов.Хозрасчетный.СтроительствоОбъектовОсновныхСредств
		ИЛИ Счет = ПланыСчетов.Хозрасчетный.ПриобретениеНематериальныхАктивов
		ИЛИ Счет = ПланыСчетов.Хозрасчетный.ВыполнениеНИОКР
		ИЛИ Счет = ПланыСчетов.Хозрасчетный.ПодготовкаКВводуВЭксплуатациюИнвестицийВНедвижимость
		ИЛИ Счет = ПланыСчетов.Хозрасчетный.НематериальныеАктивыОрганизации
		ИЛИ Счет = ПланыСчетов.Хозрасчетный.Гудвилл);
		
	Возврат Результат;
	
КонецФункции

Функция ПодготовитьТаблицуЗакрытиеРемонтыВНУ(ТаблицаРеквизиты, Отказ) Экспорт
	
	ТаблицаЗакрытие = ТаблицаЗакрытие();
	Параметры       = ПодготовитьПараметрыЗакрытиеРемонтыВНУ(ТаблицаЗакрытие, ТаблицаРеквизиты);
	Реквизиты       = Параметры.Реквизиты[0];
	ТаблицаЗакрытиеРемонты = Параметры.ТаблицаЗакрытие;
	
	КонГраница = Новый Граница(Реквизиты.КонДата, ВидГраницы.Включая);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КонГраница",  КонГраница);
	Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НалоговыйОстатки.Счет КАК Счет,
	|	НалоговыйОстатки.Подразделение 			 КАК Подразделение,
	|	НалоговыйОстатки.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	0 КАК СуммаСписанияУУ,
	|	0 КАК СуммаСписания,
	|	0 КАК СуммаСписанияФО,
	|	СУММА(ЕСТЬNULL(НалоговыйОстатки.СуммаНУОстатокДт, 0) - ЕСТЬNULL(НалоговыйОстатки.СуммаНУОстатокКт, 0)) КАК СуммаСписанияНУ,
	|	СУММА(ЕСТЬNULL(НалоговыйОстатки.СуммаПРОстатокДт, 0) - ЕСТЬNULL(НалоговыйОстатки.СуммаПРОстатокКт, 0)) КАК СуммаСписанияПР,
	|	СУММА(ЕСТЬNULL(НалоговыйОстатки.СуммаВРОстатокДт, 0) - ЕСТЬNULL(НалоговыйОстатки.СуммаВРОстатокКт, 0)) КАК СуммаСписанияВР
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&КонГраница,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат),
	|			Организация = &Организация
	|		) КАК НалоговыйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	НалоговыйОстатки.Счет,
	|	НалоговыйОстатки.Подразделение,
	|	НалоговыйОстатки.НаправлениеДеятельности";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Выборка Из Результат Цикл
		Если Выборка.СуммаСписанияНУ <> 0 Тогда
			Запись = ТаблицаЗакрытиеРемонты.Добавить();
			Запись.СчетДт      = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
			Запись.СчетКт      = ПланыСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ;
			
			Запись.Подразделение 			= Выборка.Подразделение;
			Запись.НаправлениеДеятельности 	= Выборка.НаправлениеДеятельности;
			
			Запись.СуммаУУ     = Выборка.СуммаСписанияУУ;
			Запись.Сумма       = Выборка.СуммаСписания;
			Запись.СуммаФО     = Выборка.СуммаСписанияФО;
			Запись.СуммаНУ     = Выборка.СуммаСписанияНУ;
			Запись.СуммаПР     = Выборка.СуммаСписанияПР;
			Запись.СуммаВР     = Выборка.СуммаСписанияВР;
			Запись.Содержание  = НСтр("ru = 'Закрытие счета затрат по ремонтам и объектам преференций в НУ'");
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаЗакрытиеРемонты;
	
КонецФункции

Процедура СозатьКлючиАналитикиУчетаАмортизации() Экспорт
	
	ВидыАктиваНУ = Новый Массив;
	ВидыАктиваНУ.Добавить(Перечисления.ВидАктиваНУ.НеФиксированныйАктив);
	ВидыАктиваНУ.Добавить(Перечисления.ВидАктиваНУ.ФиксированныйАктив);
	ВидыАктиваНУ.Добавить(Перечисления.ВидАктиваНУ.ФиксированныйАктивУчитываемыйОтдельно);
	
	УчетФиксированныхАктивов.СоздатьКлючиАналитикиУчетаВА(ВидыАктиваНУ, Перечисления.ВидыДвиженияСтоимостиФА.Амортизация);
	
КонецПроцедуры

#Область РегламентныеОперацииПоФиксированнымАктивам

Процедура РасчетДоходовИВычетовПоФАНУ(СтруктураШапкиДокумента, Движения, Отказ) Экспорт
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	
	ПараметрыПроведения = ПодготовитьПараметрыПроведенияРасчетВычетовФАНУ(СтруктураШапкиДокумента, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ
	
	ТаблицаВычетыФА = ПодготовитьТаблицыРасчетВычетовФАНУ(
		ПараметрыПроведения.ТаблицаРеквизиты,
		СтруктураШапкиДокумента.СписокОрганизаций,
		Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	СформироватьДвиженияРасчетВычетовФАНУ(
		ТаблицаВычетыФА,
		ПараметрыПроведения.ТаблицаРеквизиты,
		Движения,
		Отказ);
		
КонецПроцедуры

Функция ПараметрыУчетнойПолитикиПоВычетамФА(Организация, Период) Экспорт
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	УчетныеПолитики.СписыватьСтоимостныйБалансПриВыбытииВсехФАГруппы,
		|	УчетныеПолитики.РассчитыватьДоходОтПревышенияСтоимостиВыбывшихФА,
		|	УчетныеПолитики.СписыватьСтоимостныйБалансГруппыМенееМинимума,
		|	УчетныеПолитики.АмортизацияФАНУ
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&Период,
		|							Организация = &Организация) КАК ДанныеРегистра
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчетныеПолитикиОрганизаций КАК УчетныеПолитики
		|		ПО ДанныеРегистра.УчетнаяПолитика = УчетныеПолитики.Ссылка");

	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Организация);

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	СтруктураПараметров = Новый Структура;
	Для Каждого Колонка Из Результат.Колонки Цикл
		СтруктураПараметров.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
	КонецЦикла;
	
	Возврат СтруктураПараметров;

КонецФункции

Процедура ВключениеВСтоимостныйБалансАктивовУчитываемыхОтдельно(СтруктураШапкиДокумента, Движения, Отказ) Экспорт
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	ПараметрыПроведения = ПодготовитьПараметрыПроведенияВключениеАктивовВСБ(СтруктураШапкиДокумента, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ
	ТаблицаАктивыУчитываемыеОтдельно = ПодготовитьТаблицыАктивыУчитываемыеОтдельно(
		ПараметрыПроведения.ТаблицаРеквизиты,
		СтруктураШапкиДокумента.СписокОрганизаций,
		Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	СформироватьДвиженияВключениеАктивовВСтоимостныйБаланс(
		ТаблицаАктивыУчитываемыеОтдельно,
		ПараметрыПроведения.ТаблицаРеквизиты,
		Движения,
		Отказ);		

КонецПроцедуры

Процедура СписаниеРезерваПоПереоценкеВНА(СтруктураШапкиДокумента, Движения, Отказ) Экспорт
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	
	ПараметрыПроведения = ПодготовитьПараметрыСписанияРезерваПоПереоценкеВНА(СтруктураШапкиДокумента, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ
	
	ТаблицаСписанияРезерваВНА = ПодготовитьТаблицыСписанияРезерваПоПереоценкеВНА(
		ПараметрыПроведения.ТаблицаРеквизиты,
		СтруктураШапкиДокумента.СписокОрганизаций,
		Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	СформироватьДвиженияСписаниеРезерваПоПереоценкеВНА(
		ТаблицаСписанияРезерваВНА,
		ПараметрыПроведения.ТаблицаРеквизиты,
		Движения,
		Отказ);
		
	
КонецПроцедуры

#КонецОбласти 

#Область ОтражениеВРеглУчете

Функция ТекстЗапросаВТОтраженияВНалУчетеОС(Документ, Движение, ТекстыВременныхТаблиц) Экспорт
	
	ТекстыВременныхТаблиц.Добавить(УчетФиксированныхАктивов.ТекстЗапросаВТОбъектыНалоговогоУчетаФАОС(Документ));
	ТекстыВременныхТаблиц.Добавить(УчетФиксированныхАктивов.ТекстЗапросаВТФиксированныеАктивыУчитываемыеОтдельноОС(Документ));
	ТекстыВременныхТаблиц.Добавить(УчетФиксированныхАктивов.ТекстЗапросаВТВидыАктиваОС(Документ));
	ТекстыВременныхТаблиц.Добавить(УчетФиксированныхАктивов.ТекстЗапросаВТАналитикаУчетаВАОС(Движение));
	
	Если ТипЗнч(ТекстыВременныхТаблиц) = Тип("СписокЗначений") Тогда
		ТекстыВременныхТаблиц[3].Представление = "ВТАналитикаУчетаВА" + Движение;
	КонецЕсли;
	
	Возврат ТекстыВременныхТаблиц;
	
КонецФункции

Функция ТекстЗапросаВТОтраженияВНалУчетеНМА(Документ, Движение, ТекстыВременныхТаблиц, ТабличнаяЧасть = Неопределено) Экспорт
	
	ТекстыВременныхТаблиц.Добавить(УчетФиксированныхАктивов.ТекстЗапросаВТОбъектыНалоговогоУчетаФАНМА(Документ, ТабличнаяЧасть));
	ТекстыВременныхТаблиц.Добавить(УчетФиксированныхАктивов.ТекстЗапросаВТФиксированныеАктивыУчитываемыеОтдельноНМА(Документ, ТабличнаяЧасть));
	ТекстыВременныхТаблиц.Добавить(УчетФиксированныхАктивов.ТекстЗапросаВТВидыАктиваНМА(Документ, ТабличнаяЧасть));
	ТекстыВременныхТаблиц.Добавить(УчетФиксированныхАктивов.ТекстЗапросаВТАналитикаУчетаВАНМА(Движение));
	
	Если ТипЗнч(ТекстыВременныхТаблиц) = Тип("СписокЗначений") Тогда
		ТекстыВременныхТаблиц[3].Представление = "ВТАналитикаУчетаВА" + Движение;
	КонецЕсли;
	
	Возврат ТекстыВременныхТаблиц;
	
КонецФункции

Функция ТекстЗапросаВТОбъектыНалоговогоУчетаФА() Экспорт
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// Таблица ВТОбъектыНалоговогоУчетаФА
	|"+
	"ВЫБРАТЬ
	|	втОбъектыДокумента.ОбъектУчета КАК ОбъектУчета,
	|	ЕСТЬNULL(ОбъектыНалоговогоУчета.СостояниеФиксированногоАктива, ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.ПустаяСсылка)) КАК СостояниеФА
	|ПОМЕСТИТЬ ВТОбъектыНалоговогоУчетаФА
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыНалоговогоУчетаФА.СрезПоследних(
	|			&Дата,
	|			Регистратор <> &Ссылка
	|			И (Организация, ФиксированныйАктив) В
	|				(ВЫБРАТЬ
	|					Т.Организация, Т.ОбъектУчета
	|				ИЗ
	|					втОбъектыДокумента КАК Т)) КАК ОбъектыНалоговогоУчета
	|	ПО втОбъектыДокумента.ОбъектУчета = ОбъектыНалоговогоУчета.ФиксированныйАктив
	|";
	
КонецФункции

Функция ТекстЗапросаВТФиксированныеАктивыУчитываемыеОтдельно() Экспорт
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// Таблица ВТФиксированныеАктивыУчитываемыеОтдельно
	|"+
	"ВЫБРАТЬ
	|	втОбъектыДокумента.ОбъектУчета КАК ОбъектУчета,
	|	ЕСТЬNULL(ФиксированныеАктивыУчитываемыеОтдельно.Событие, ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.ПустаяСсылка)) КАК СобытиеФАОтдельно
	|ПОМЕСТИТЬ ВТФиксированныеАктивыУчитываемыеОтдельно
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФиксированныеАктивыУчитываемыеОтдельно.СрезПоследних(
	|			&Дата,
	|			Регистратор <> &Ссылка
	|			И (Организация, ФиксированныйАктив) В
	|				(ВЫБРАТЬ
	|					Т.Организация, Т.ОбъектУчета
	|				ИЗ
	|					втОбъектыДокумента КАК Т)) КАК ФиксированныеАктивыУчитываемыеОтдельно
	|	ПО втОбъектыДокумента.ОбъектУчета = ФиксированныеАктивыУчитываемыеОтдельно.ФиксированныйАктив
	|";
	
КонецФункции

Функция ТекстЗапросаВТВидыАктива() Экспорт
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// Таблица ВТВидыАктива
	|"+
	"ВЫБРАТЬ
	|	втОбъектыДокумента.ОбъектУчета КАК ОбъектУчета,
	|	ВЫБОР КОГДА
	|			ФиксированныеАктивыУчитываемыеОтдельно.СобытиеФАОтдельно = ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.ПринятиеКУчету)
	|			Или ФиксированныеАктивыУчитываемыеОтдельно.СобытиеФАОтдельно = ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.Выбытие)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидАктиваНУ.ФиксированныйАктивУчитываемыйОтдельно)
	|		ИНАЧЕ
	|			ВЫБОР КОГДА ОбъектыНалоговогоУчетаФА.СостояниеФА <> ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.ПустаяСсылка) 
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидАктиваНУ.ФиксированныйАктив) 
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидАктиваНУ.НеФиксированныйАктив)
	|			КОНЕЦ
	|	КОНЕЦ КАК ВидАктиваНУ
	|ПОМЕСТИТЬ ВТВидыАктиваАмортизация
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТФиксированныеАктивыУчитываемыеОтдельно КАК ФиксированныеАктивыУчитываемыеОтдельно
	|		ПО втОбъектыДокумента.ОбъектУчета = ФиксированныеАктивыУчитываемыеОтдельно.ОбъектУчета
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТОбъектыНалоговогоУчетаФА КАК ОбъектыНалоговогоУчетаФА
	|		ПО втОбъектыДокумента.ОбъектУчета = ОбъектыНалоговогоУчетаФА.ОбъектУчета
	|";
	
КонецФункции

Функция ТекстЗапросаВТАналитикаУчетаВА() Экспорт
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// Таблица ВТАналитикаУчетаВА
	|ВЫБРАТЬ
	|	ВидыАктива.ОбъектУчета КАК ОбъектУчета,
	|	АналитикаУчетаВнеоборотныхАктивов.КлючАналитики КАК КлючАналитики
	|ПОМЕСТИТЬ ВТАналитикаУчетаВААмортизация
	|ИЗ
	|	ВТВидыАктиваАмортизация КАК ВидыАктива
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаВнеоборотныхАктивов КАК АналитикаУчетаВнеоборотныхАктивов
	|		ПО ВидыАктива.ВидАктиваНУ = АналитикаУчетаВнеоборотныхАктивов.ВидАктиваНУ
	|		И АналитикаУчетаВнеоборотныхАктивов.ВидДвиженияСтоимостиНУ = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Амортизация)
	|";
	
КонецФункции

Функция ТекстЗапросаВТОбъектыНалоговогоУчетаФАОС(Документ) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СписокОС.ОсновноеСредство КАК ОбъектУчета,
	|	ЕСТЬNULL(ОбъектыНалоговогоУчета.СостояниеФиксированногоАктива, ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.ПустаяСсылка)) КАК СостояниеФА
	|ПОМЕСТИТЬ ВТОбъектыНалоговогоУчетаФАПеремещение
	|ИЗ
	|	Документ.ПеремещениеОС.ОС КАК СписокОС
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыНалоговогоУчетаФА.СрезПоследних(
	|			&Дата,
	|			Регистратор <> &Ссылка
	|			И (Организация, ФиксированныйАктив) В
	|				(ВЫБРАТЬ
	|					Т.Ссылка.Организация,
	|					Т.ОсновноеСредство
	|				ИЗ
	|					Документ.ПеремещениеОС.ОС КАК Т
	|				ГДЕ Т.Ссылка = &Ссылка)) КАК ОбъектыНалоговогоУчета
	|	ПО СписокОС.ОсновноеСредство = ОбъектыНалоговогоУчета.ФиксированныйАктив
	|ГДЕ
	|	СписокОС.Ссылка = &Ссылка";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПеремещениеОС", Документ);
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// Таблица ВТОбъектыНалоговогоУчетаФАПеремещение
	|"+
	ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаВТФиксированныеАктивыУчитываемыеОтдельноОС(Документ) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СписокОС.ОсновноеСредство КАК ОбъектУчета,
	|	ЕСТЬNULL(ФиксированныеАктивыУчитываемыеОтдельно.Событие, ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.ПустаяСсылка)) КАК СобытиеФАОтдельно
	|ПОМЕСТИТЬ ВТФиксированныеАктивыУчитываемыеОтдельноПеремещение
	|ИЗ
	|	Документ.ПеремещениеОС.ОС КАК СписокОС
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФиксированныеАктивыУчитываемыеОтдельно.СрезПоследних(
	|			&Дата,
	|			Регистратор <> &Ссылка
	|			И (Организация, ФиксированныйАктив) В
	|				(ВЫБРАТЬ
	|					Т.Ссылка.Организация,
	|					Т.ОсновноеСредство
	|				ИЗ
	|					Документ.ПеремещениеОС.ОС КАК Т
	|				ГДЕ Т.Ссылка = &Ссылка)) КАК ФиксированныеАктивыУчитываемыеОтдельно
	|	ПО СписокОС.ОсновноеСредство = ФиксированныеАктивыУчитываемыеОтдельно.ФиксированныйАктив
	|ГДЕ СписокОС.Ссылка = &Ссылка";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПеремещениеОС", Документ);
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// Таблица ВТФиксированныеАктивыУчитываемыеОтдельноПеремещение
	|"+
	ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаВТВидыАктиваОС(Документ) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СписокОС.ОсновноеСредство КАК ОбъектУчета,
	|	ВЫБОР КОГДА
	|			ФиксированныеАктивыУчитываемыеОтдельно.СобытиеФАОтдельно = ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.ПринятиеКУчету)
	|			Или ФиксированныеАктивыУчитываемыеОтдельно.СобытиеФАОтдельно = ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.Выбытие)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидАктиваНУ.ФиксированныйАктивУчитываемыйОтдельно)
	|		ИНАЧЕ
	|			ВЫБОР КОГДА ОбъектыНалоговогоУчетаФА.СостояниеФА <> ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.ПустаяСсылка) 
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидАктиваНУ.ФиксированныйАктив) 
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидАктиваНУ.НеФиксированныйАктив)
	|			КОНЕЦ
	|	КОНЕЦ КАК ВидАктиваНУ
	|ПОМЕСТИТЬ ВТВидыАктива
	|ИЗ
	|	Документ.ПеремещениеОС.ОС КАК СписокОС
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТФиксированныеАктивыУчитываемыеОтдельноПеремещение КАК ФиксированныеАктивыУчитываемыеОтдельно
	|		ПО СписокОС.ОсновноеСредство = ФиксированныеАктивыУчитываемыеОтдельно.ОбъектУчета
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТОбъектыНалоговогоУчетаФАПеремещение КАК ОбъектыНалоговогоУчетаФА
	|		ПО СписокОС.ОсновноеСредство = ОбъектыНалоговогоУчетаФА.ОбъектУчета
	|ГДЕ СписокОС.Ссылка = &Ссылка
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПеремещениеОС", Документ);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТАналитикаУчетаВАОС(Движение) Экспорт
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыАктива.ОбъектУчета КАК ОбъектУчета,
	|	АналитикаУчетаВнеоборотныхАктивов.КлючАналитики КАК КлючАналитики
	|ПОМЕСТИТЬ ВТАналитикаУчетаВА#Движение#
	|ИЗ
	|	ВТВидыАктива КАК ВидыАктива
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаВнеоборотныхАктивов КАК АналитикаУчетаВнеоборотныхАктивов
	|		ПО ВидыАктива.ВидАктиваНУ = АналитикаУчетаВнеоборотныхАктивов.ВидАктиваНУ
	|		И АналитикаУчетаВнеоборотныхАктивов.ВидДвиженияСтоимостиНУ = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.#Движение#)
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#Движение#", Движение);
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// Таблица ВТАналитикаУчетаВА(Движение)
	|"+
	ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаВТОбъектыНалоговогоУчетаФАНМА(Документ, ТабличнаяЧасть = Неопределено) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДокументНМА.НематериальныйАктив КАК ОбъектУчета,
	|	ЕСТЬNULL(ОбъектыНалоговогоУчета.СостояниеФиксированногоАктива, ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.ПустаяСсылка)) КАК СостояниеФА
	|ПОМЕСТИТЬ ВТОбъектыНалоговогоУчетаФАПеремещение
	|ИЗ
	|	Документ.ИмяДокумента КАК ДокументНМА
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыНалоговогоУчетаФА.СрезПоследних(
	|			&Дата,
	|			Регистратор <> &Ссылка
	|			И (Организация, ФиксированныйАктив) В
	|				(ВЫБРАТЬ
	|					Т"+?(НЕ ТабличнаяЧасть = Неопределено, ".Ссылка", "")+".Организация,
	|					Т.НематериальныйАктив
	|				ИЗ
	|					Документ.ИмяДокумента КАК Т
	|				ГДЕ Т.Ссылка = &Ссылка)) КАК ОбъектыНалоговогоУчета
	|	ПО ДокументНМА.НематериальныйАктив = ОбъектыНалоговогоУчета.ФиксированныйАктив
	|ГДЕ
	|	ДокументНМА.Ссылка = &Ссылка";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяДокумента", Документ + ?(НЕ ТабличнаяЧасть = Неопределено, "." + ТабличнаяЧасть, ""));
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// Таблица ВТОбъектыНалоговогоУчетаФАПеремещение
	|"+
	ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаВТФиксированныеАктивыУчитываемыеОтдельноНМА(Документ, ТабличнаяЧасть = Неопределено) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДокументНМА.НематериальныйАктив КАК ОбъектУчета,
	|	ЕСТЬNULL(ФиксированныеАктивыУчитываемыеОтдельно.Событие, ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.ПустаяСсылка)) КАК СобытиеФАОтдельно
	|ПОМЕСТИТЬ ВТФиксированныеАктивыУчитываемыеОтдельноПеремещение
	|ИЗ
	|	Документ.ИмяДокумента КАК ДокументНМА
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФиксированныеАктивыУчитываемыеОтдельно.СрезПоследних(
	|			&Дата,
	|			Регистратор <> &Ссылка
	|			И (Организация, ФиксированныйАктив) В
	|				(ВЫБРАТЬ
	|					Т"+?(НЕ ТабличнаяЧасть = Неопределено, ".Ссылка", "")+".Организация,
	|					Т.НематериальныйАктив
	|				ИЗ
	|					Документ.ИмяДокумента КАК Т
	|				ГДЕ Т.Ссылка = &Ссылка)) КАК ФиксированныеАктивыУчитываемыеОтдельно
	|	ПО ДокументНМА.НематериальныйАктив = ФиксированныеАктивыУчитываемыеОтдельно.ФиксированныйАктив
	|ГДЕ ДокументНМА.Ссылка = &Ссылка";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяДокумента", Документ + ?(НЕ ТабличнаяЧасть = Неопределено, "." + ТабличнаяЧасть, ""));
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// Таблица ВТФиксированныеАктивыУчитываемыеОтдельноПеремещение
	|"+
	ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаВТВидыАктиваНМА(Документ, ТабличнаяЧасть = Неопределено) Экспорт
	
	ТекстЗапроса = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Таблица ВТВидыАктива
	|ВЫБРАТЬ
	|	ДокументНМА.НематериальныйАктив КАК ОбъектУчета,
	|	ВЫБОР КОГДА
	|			ФиксированныеАктивыУчитываемыеОтдельно.СобытиеФАОтдельно = ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.ПринятиеКУчету)
	|			Или ФиксированныеАктивыУчитываемыеОтдельно.СобытиеФАОтдельно = ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.Выбытие)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидАктиваНУ.ФиксированныйАктивУчитываемыйОтдельно)
	|		ИНАЧЕ
	|			ВЫБОР КОГДА ОбъектыНалоговогоУчетаФА.СостояниеФА <> ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.ПустаяСсылка) 
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидАктиваНУ.ФиксированныйАктив) 
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидАктиваНУ.НеФиксированныйАктив)
	|			КОНЕЦ
	|	КОНЕЦ КАК ВидАктиваНУ
	|ПОМЕСТИТЬ ВТВидыАктива
	|ИЗ
	|	Документ.ИмяДокумента КАК ДокументНМА
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТФиксированныеАктивыУчитываемыеОтдельноПеремещение КАК ФиксированныеАктивыУчитываемыеОтдельно
	|		ПО ДокументНМА.НематериальныйАктив = ФиксированныеАктивыУчитываемыеОтдельно.ОбъектУчета
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТОбъектыНалоговогоУчетаФАПеремещение КАК ОбъектыНалоговогоУчетаФА
	|		ПО ДокументНМА.НематериальныйАктив = ОбъектыНалоговогоУчетаФА.ОбъектУчета
	|ГДЕ ДокументНМА.Ссылка = &Ссылка
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяДокумента", Документ + ?(НЕ ТабличнаяЧасть = Неопределено, "." + ТабличнаяЧасть, ""));
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВТАналитикаУчетаВАНМА(Движение) Экспорт
	
	ТекстЗапроса = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Таблица ВТАналитикаУчетаВА(Движение)
	|ВЫБРАТЬ
	|	ВидыАктива.ОбъектУчета КАК ОбъектУчета,
	|	АналитикаУчетаВнеоборотныхАктивов.КлючАналитики КАК КлючАналитики
	|ПОМЕСТИТЬ ВТАналитикаУчетаВА#Движение#
	|ИЗ
	|	ВТВидыАктива КАК ВидыАктива
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаВнеоборотныхАктивов КАК АналитикаУчетаВнеоборотныхАктивов
	|		ПО ВидыАктива.ВидАктиваНУ = АналитикаУчетаВнеоборотныхАктивов.ВидАктиваНУ
	|		И АналитикаУчетаВнеоборотныхАктивов.ВидДвиженияСтоимостиНУ = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.#Движение#)
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#Движение#", Движение);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ТекстЗапросаВТАналитикаУчетаВАОС_РеализацияВА(ТекстыЗапроса) Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	СписокОбъектов.Ссылка,
	|	СписокОбъектов.АналитикаДоходов КАК ОбъектУчета
	|ПОМЕСТИТЬ ВТОперация
	|ИЗ
	|	Документ.РеализацияУслугПрочихАктивов.Доходы КАК СписокОбъектов
	|
	|ГДЕ 
	|	СписокОбъектов.Ссылка = &Ссылка
	|	И (СписокОбъектов.АналитикаДоходов ССЫЛКА Справочник.ОбъектыЭксплуатации 
	|		Или СписокОбъектов.АналитикаДоходов ССЫЛКА Справочник.НематериальныеАктивы)
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, "ВТОперация");
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	СписокОбъектов.ОбъектУчета КАК ОбъектУчета,
	|	ЕСТЬNULL(ОбъектыНалоговогоУчета.СостояниеФиксированногоАктива, ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.ПустаяСсылка)) КАК СостояниеФА
	|ПОМЕСТИТЬ ВТОбъектыНалоговогоУчетаФАРеализация
	|ИЗ
	|	ВТОперация КАК СписокОбъектов
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыНалоговогоУчетаФА.СрезПоследних(
	|			&Дата,
	|			Регистратор <> &Ссылка
	|			И (Организация, ФиксированныйАктив) В
	|				(ВЫБРАТЬ
	|					Т.Ссылка.Организация,
	|					Т.ОбъектУчета
	|				ИЗ
	|					ВТОперация КАК Т
	|				)) КАК ОбъектыНалоговогоУчета
	|	ПО СписокОбъектов.ОбъектУчета = ОбъектыНалоговогоУчета.ФиксированныйАктив
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, "ВТОбъектыНалоговогоУчетаФАРеализация");
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	СписокОбъектов.ОбъектУчета КАК ОбъектУчета,
	|	ЕСТЬNULL(ФиксированныеАктивыУчитываемыеОтдельно.Событие, ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.ПустаяСсылка)) КАК СобытиеФАОтдельно
	|ПОМЕСТИТЬ ВТФиксированныеАктивыУчитываемыеОтдельноРеализация
	|ИЗ
	|	ВТОперация КАК СписокОбъектов
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФиксированныеАктивыУчитываемыеОтдельно.СрезПоследних(
	|			&Дата,
	|			Регистратор <> &Ссылка
	|			И (Организация, ФиксированныйАктив) В
	|				(ВЫБРАТЬ
	|					Т.Ссылка.Организация,
	|					Т.ОбъектУчета
	|				ИЗ
	|					ВТОперация КАК Т
	|				)) КАК ФиксированныеАктивыУчитываемыеОтдельно
	|	ПО СписокОбъектов.ОбъектУчета = ФиксированныеАктивыУчитываемыеОтдельно.ФиксированныйАктив
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, "ВТФиксированныеАктивыУчитываемыеОтдельноРеализация");
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	СписокОбъектов.ОбъектУчета КАК ОбъектУчета,
	|	ВЫБОР КОГДА
	|			ФиксированныеАктивыУчитываемыеОтдельно.СобытиеФАОтдельно = ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.ПринятиеКУчету)
	|			Или ФиксированныеАктивыУчитываемыеОтдельно.СобытиеФАОтдельно = ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.Выбытие)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидАктиваНУ.ФиксированныйАктивУчитываемыйОтдельно)
	|		ИНАЧЕ
	|			ВЫБОР КОГДА ОбъектыНалоговогоУчетаФА.СостояниеФА <> ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.ПустаяСсылка) 
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидАктиваНУ.ФиксированныйАктив) 
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидАктиваНУ.НеФиксированныйАктив)
	|			КОНЕЦ
	|	КОНЕЦ КАК ВидАктиваНУ
	|ПОМЕСТИТЬ ВТВидыАктиваРеализация
	|ИЗ
	|	ВТОперация КАК СписокОбъектов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТФиксированныеАктивыУчитываемыеОтдельноРеализация КАК ФиксированныеАктивыУчитываемыеОтдельно
	|		ПО СписокОбъектов.ОбъектУчета = ФиксированныеАктивыУчитываемыеОтдельно.ОбъектУчета
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТОбъектыНалоговогоУчетаФАРеализация КАК ОбъектыНалоговогоУчетаФА
	|		ПО СписокОбъектов.ОбъектУчета = ОбъектыНалоговогоУчетаФА.ОбъектУчета
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, "ВТФиксированныеАктивыУчитываемыеОтдельноРеализация");
	
	ТекстЗапроса = "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыАктива.ОбъектУчета КАК ОбъектУчета,
	|	АналитикаУчетаВнеоборотныхАктивов.КлючАналитики КАК КлючАналитики
	|ПОМЕСТИТЬ ВТАналитикаУчетаВАРеализация
	|ИЗ
	|	ВТВидыАктиваРеализация КАК ВидыАктива
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаВнеоборотныхАктивов КАК АналитикаУчетаВнеоборотныхАктивов
	|		ПО ВидыАктива.ВидАктиваНУ = АналитикаУчетаВнеоборотныхАктивов.ВидАктиваНУ
	|		И АналитикаУчетаВнеоборотныхАктивов.ВидДвиженияСтоимостиНУ = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Выбытие)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, "ВТАналитикаУчетаВАРеализация");
	
	//Возврат "
	//|////////////////////////////////////////////////////////////////////////////////
	//|// 
	//|"+
	//ТекстЗапроса + ";";

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ЗаполнениеТекстаЗапроса

Функция ТекстЗапросаТаблицаОбъектыНалоговогоУчетаФА_ВводОстатковВнеоборотныхАктивов(ДокументВерсии2_4 = Ложь)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаОС.НомерСтроки КАК НомерСтроки,
	|
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|
	|	&Организация КАК Организация,
	|	ТаблицаОС.ОсновноеСредство КАК ФиксированныйАктив,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.ПринятКУчету) КАК СостояниеФиксированногоАктива
	|
	|ИЗ
	|	Документ.ВводОстатковВнеоборотныхАктивов" + ?(ДокументВерсии2_4, "2_4", "") + ".ОС КАК ТаблицаОС
	|
	|ГДЕ
	|	ТаблицаОС.Ссылка = &Ссылка
	|	И ТаблицаОС.ПорядокУчетаНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаНМА.НомерСтроки,
	|
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|
	|	&Организация КАК Организация,
	|	ТаблицаНМА.НематериальныйАктив КАК ФиксированныйАктив,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.ПринятКУчету) КАК СостояниеФиксированногоАктива
	|	
	|ИЗ
	|	Документ.ВводОстатковВнеоборотныхАктивов" + ?(ДокументВерсии2_4, "2_4", "") + ".НМА КАК ТаблицаНМА
	|
	|ГДЕ
	|	ТаблицаНМА.Ссылка = &Ссылка
	|	И ТаблицаНМА.ПорядокУчетаНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаОбъектыНалоговогоУчетаФА_ПринятиеКУчетуОС(ДокументВерсии2_4 = Ложь)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаОС.НомерСтроки КАК НомерСтроки,
	|
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|
	|	&Организация КАК Организация,
	|	ТаблицаОС.ОсновноеСредство КАК ФиксированныйАктив,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.ПринятКУчету) КАК СостояниеФиксированногоАктива
	|
	|ИЗ
	|	Документ.ПринятиеКУчетуОС" + ?(ДокументВерсии2_4, "2_4", "") + ".ОС КАК ТаблицаОС
	|
	|ГДЕ
	|	ТаблицаОС.Ссылка = &Ссылка
	|	И &ПорядокУчетаНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаОбъектыНалоговогоУчетаФА_ПринятиеКУчетуНМА(ДокументВерсии2_4 = Ложь)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|
	|	&Организация КАК Организация,
	|	ДанныеДокументаНМА.НематериальныйАктив КАК ФиксированныйАктив,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.ПринятКУчету) КАК СостояниеФиксированногоАктива
	|
	|ИЗ
	|	Документ.ПринятиеКУчетуНМА" + ?(ДокументВерсии2_4, "2_4", "") + " КАК ДанныеДокументаНМА
	|
	|ГДЕ
	|	ДанныеДокументаНМА.Ссылка = &Ссылка
	|	И &ПорядокУчетаНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации)
	|;";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаОбъектыНалоговогоУчетаФА_СписаниеОС(ДокументВерсии2_4 = Ложь)

	ТекстЗапроса = ТекстЗапросаТаблицаОбъектыНалоговогоУчетаФА_ВыбытиеОС();
	
	Возврат ТекстЗапроса + "
	|	И &СнятьСУчетаПоНалогам;";
	
КонецФункции

Функция ТекстЗапросаТаблицаОбъектыНалоговогоУчетаФА_ПодготовкаКПередачеОС(ДокументВерсии2_4 = Ложь)

	ТекстЗапроса = ТекстЗапросаТаблицаОбъектыНалоговогоУчетаФА_ВыбытиеОС();
	
	Возврат ТекстЗапроса + ";";
	
КонецФункции

Функция ТекстЗапросаТаблицаОбъектыНалоговогоУчетаФА_ВыбытиеОС()

	Возврат "
	|ВЫБРАТЬ
	|	ТаблицаОС.НомерСтроки КАК НомерСтроки,
	|
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|
	|	&Организация КАК Организация,
	|	ТаблицаОС.ОсновноеСредство КАК ФиксированныйАктив,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.Выбыл) КАК СостояниеФиксированногоАктива
	|
	|ИЗ
	|	Документ.#ИмяДокумента#.ОС КАК ТаблицаОС
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыНалоговогоУчетаФА.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация) КАК ОбъектыНалоговогоУчетаФАСрезПоследних
	|		ПО ТаблицаОС.ОсновноеСредство = ОбъектыНалоговогоУчетаФАСрезПоследних.ФиксированныйАктив
	|
	|ГДЕ
	|	ТаблицаОС.Ссылка = &Ссылка
	|	И НЕ ОбъектыНалоговогоУчетаФАСрезПоследних.ФиксированныйАктив ЕСТЬ NULL
	|	И ОбъектыНалоговогоУчетаФАСрезПоследних.СостояниеФиксированногоАктива = ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.ПринятКУчету)
	|";

КонецФункции

Функция ТекстЗапросаТаблицаОбъектыНалоговогоУчетаФА_ПеремещениеОС(ДокументВерсии2_4 = Ложь)

	Возврат "
	|ВЫБРАТЬ
	|	ТаблицаОС.НомерСтроки КАК НомерСтроки,
	|
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|
	|	&Организация КАК Организация,
	|	ТаблицаОС.ОсновноеСредство КАК ФиксированныйАктив,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.Выбыл) КАК СостояниеФиксированногоАктива
	|
	|ИЗ
	|	Документ.ПеремещениеОС" + ?(ДокументВерсии2_4, "2_4", "") + ".ОС КАК ТаблицаОС
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыНалоговогоУчетаФА.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация) КАК ОбъектыНалоговогоУчетаФАСрезПоследних
	|		ПО ТаблицаОС.ОсновноеСредство = ОбъектыНалоговогоУчетаФАСрезПоследних.ФиксированныйАктив
	|
	|ГДЕ
	|	ТаблицаОС.Ссылка = &Ссылка
	|	И НЕ ОбъектыНалоговогоУчетаФАСрезПоследних.ФиксированныйАктив ЕСТЬ NULL
	|	И ОбъектыНалоговогоУчетаФАСрезПоследних.СостояниеФиксированногоАктива = ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.ПринятКУчету)
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации"+?(ДокументВерсии2_4, "", "РеглУчет")+".ПеремещениеОСвПодразделениеВыделенноеНаБаланс)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаОС.НомерСтроки КАК НомерСтроки,
	|
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|
	|	&ОрганизацияПолучатель КАК Организация,
	|	ТаблицаОС.ОсновноеСредство КАК ФиксированныйАктив,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.ПринятКУчету) КАК СостояниеФиксированногоАктива
	|
	|ИЗ
	|	Документ.ПеремещениеОС" + ?(ДокументВерсии2_4, "2_4", "") + ".ОС КАК ТаблицаОС
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыНалоговогоУчетаФА.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация) КАК ОбъектыНалоговогоУчетаФАСрезПоследних
	|		ПО ТаблицаОС.ОсновноеСредство = ОбъектыНалоговогоУчетаФАСрезПоследних.ФиксированныйАктив
	|
	|ГДЕ
	|	ТаблицаОС.Ссылка = &Ссылка
	|	И НЕ ОбъектыНалоговогоУчетаФАСрезПоследних.ФиксированныйАктив ЕСТЬ NULL
	|	И ОбъектыНалоговогоУчетаФАСрезПоследних.СостояниеФиксированногоАктива = ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.ПринятКУчету)
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации"+?(ДокументВерсии2_4, "", "РеглУчет")+".ПеремещениеОСвПодразделениеВыделенноеНаБаланс)
	|;";

КонецФункции

Функция ТекстЗапросаТаблицаОбъектыНалоговогоУчетаФА_ПеремещениеНМА(ДокументВерсии2_4 = Ложь)

	Возврат "
	|ВЫБРАТЬ
	|	ТаблицаНМА.НомерСтроки КАК НомерСтроки,
	|
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|
	|	&Организация КАК Организация,
	|	ТаблицаНМА.НематериальныйАктив КАК ФиксированныйАктив,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.Выбыл) КАК СостояниеФиксированногоАктива
	|
	|ИЗ
	|	Документ.ПеремещениеНМА2_4.НМА КАК ТаблицаНМА
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыНалоговогоУчетаФА.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация) КАК ОбъектыНалоговогоУчетаФАСрезПоследних
	|		ПО ТаблицаНМА.НематериальныйАктив = ОбъектыНалоговогоУчетаФАСрезПоследних.ФиксированныйАктив
	|
	|ГДЕ
	|	ТаблицаНМА.Ссылка = &Ссылка
	|	И НЕ ОбъектыНалоговогоУчетаФАСрезПоследних.ФиксированныйАктив ЕСТЬ NULL
	|	И ОбъектыНалоговогоУчетаФАСрезПоследних.СостояниеФиксированногоАктива = ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.ПринятКУчету)
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеНМАвПодразделениеВыделенноеНаБаланс)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаНМА.НомерСтроки КАК НомерСтроки,
	|
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|
	|	&ОрганизацияПолучатель КАК Организация,
	|	ТаблицаНМА.НематериальныйАктив КАК ФиксированныйАктив,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.ПринятКУчету) КАК СостояниеФиксированногоАктива
	|
	|ИЗ
	|	Документ.ПеремещениеНМА2_4.НМА КАК ТаблицаНМА
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыНалоговогоУчетаФА.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация) КАК ОбъектыНалоговогоУчетаФАСрезПоследних
	|		ПО ТаблицаНМА.НематериальныйАктив = ОбъектыНалоговогоУчетаФАСрезПоследних.ФиксированныйАктив
	|
	|ГДЕ
	|	ТаблицаНМА.Ссылка = &Ссылка
	|	И НЕ ОбъектыНалоговогоУчетаФАСрезПоследних.ФиксированныйАктив ЕСТЬ NULL
	|	И ОбъектыНалоговогоУчетаФАСрезПоследних.СостояниеФиксированногоАктива = ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.ПринятКУчету)
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеНМАвПодразделениеВыделенноеНаБаланс)
	|;";

КонецФункции

Функция ТекстЗапросаТаблицаОбъектыНалоговогоУчетаФА_СписаниеНМА(ДокументВерсии2_4 = Ложь)

	ТекстЗапроса = ТекстЗапросаТаблицаОбъектыНалоговогоУчетаФА_ВыбытиеНМА(ДокументВерсии2_4);
	
	Возврат ТекстЗапроса + "
	|	И &СнятьСУчетаПоНалогам;";
	
КонецФункции

Функция ТекстЗапросаТаблицаОбъектыНалоговогоУчетаФА_ПодготовкаКПередачеНМА(ДокументВерсии2_4 = Ложь)
	
	ТекстЗапроса = ТекстЗапросаТаблицаОбъектыНалоговогоУчетаФА_ВыбытиеНМА(ДокументВерсии2_4);
	
	Возврат ТекстЗапроса + ";";
	
КонецФункции

Функция ТекстЗапросаТаблицаОбъектыНалоговогоУчетаФА_ВыбытиеНМА(ДокументВерсии2_4 = Ложь)

	Если ДокументВерсии2_4 Тогда
		Возврат "
		|ВЫБРАТЬ
		|	ТаблицаНМА.НомерСтроки КАК НомерСтроки,
		|
		|	&Дата КАК Период,
		|	&Ссылка КАК Регистратор,
		|
		|	&Организация КАК Организация,
		|	ТаблицаНМА.НематериальныйАктив КАК ФиксированныйАктив,
		|
		|	ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.Выбыл) КАК СостояниеФиксированногоАктива
		|
		|ИЗ
		|	Документ.#ИмяДокумента#.НМА КАК ТаблицаНМА
		|	
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыНалоговогоУчетаФА.СрезПоследних(
		|				&Дата,
		|				Организация = &Организация) КАК ОбъектыНалоговогоУчетаФАСрезПоследних
		|		ПО ТаблицаНМА.НематериальныйАктив = ОбъектыНалоговогоУчетаФАСрезПоследних.ФиксированныйАктив
		|
		|ГДЕ
		|	ТаблицаНМА.Ссылка = &Ссылка
		|	И НЕ ОбъектыНалоговогоУчетаФАСрезПоследних.ФиксированныйАктив ЕСТЬ NULL
		|	И ОбъектыНалоговогоУчетаФАСрезПоследних.СостояниеФиксированногоАктива = ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.ПринятКУчету)
		|";
	Иначе
		Возврат "
		|ВЫБРАТЬ
		|	&Дата КАК Период,
		|	&Ссылка КАК Регистратор,
		|
		|	&Организация КАК Организация,
		|	&НематериальныйАктив КАК ФиксированныйАктив,
		|
		|	ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.Выбыл) КАК СостояниеФиксированногоАктива
		|
		|ИЗ
		|	РегистрСведений.ОбъектыНалоговогоУчетаФА.СрезПоследних(
		|		&Дата,
		|		Организация = &Организация
		|			И ФиксированныйАктив = &НематериальныйАктив) КАК ОбъектыНалоговогоУчетаФАСрезПоследних
		|
		|ГДЕ
		|	ОбъектыНалоговогоУчетаФАСрезПоследних.СостояниеФиксированногоАктива = ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.ПринятКУчету)
		|";
	КонецЕсли;

КонецФункции

Функция ТекстЗапросаТаблицаФиксированныеАктивыУчитываемыеОтдельно_ВводОстатковВнеоборотныхАктивов(ДокументВерсии2_4 = Ложь)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаОС.НомерСтроки КАК НомерСтроки,
	|
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|
	|	&Организация КАК Организация,
	|	ТаблицаОС.ОсновноеСредство КАК ФиксированныйАктив,
	|
	|	ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.ПринятиеКУчету) КАК Событие,
	|	ВЫБОР КОГДА ТаблицаОС.ПорядокУчетаНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизацииПоДвойнойНорме) 
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыФАУчитываемыхОтдельно.ДвойнаяНормаАмортизации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыФАУчитываемыхОтдельно.ОбъектыПреференций)
	|	КОНЕЦ КАК ВидЛьготыФА
	|
	|ИЗ
	|	Документ.ВводОстатковВнеоборотныхАктивов" + ?(ДокументВерсии2_4, "2_4", "") + ".ОС КАК ТаблицаОС
	|
	|ГДЕ
	|	ТаблицаОС.Ссылка = &Ссылка
	|	И (ТаблицаОС.ПорядокУчетаНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизацииПоДвойнойНорме) 
	|		ИЛИ ТаблицаОС.ПорядокУчетаНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.ВключениеВРасходыПриПринятииКУчету) 
	|		ИЛИ ТаблицаОС.ПорядокУчетаНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.ОтнесениеНаВычетыРавнымиДолями)) 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаНМА.НомерСтроки,
	|
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|
	|	&Организация КАК Организация,
	|	ТаблицаНМА.НематериальныйАктив КАК ФиксированныйАктив,
	|
	|	ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.ПринятиеКУчету) КАК Событие,
	|	ВЫБОР КОГДА ТаблицаНМА.ПорядокУчетаНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизацииПоДвойнойНорме) 
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыФАУчитываемыхОтдельно.ДвойнаяНормаАмортизации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыФАУчитываемыхОтдельно.ОбъектыПреференций)
	|	КОНЕЦ КАК ВидЛьготыФА
	|
	|ИЗ
	|	Документ.ВводОстатковВнеоборотныхАктивов" + ?(ДокументВерсии2_4, "2_4", "") + ".НМА КАК ТаблицаНМА
	|
	|ГДЕ
	|	ТаблицаНМА.Ссылка = &Ссылка
	|	И (ТаблицаНМА.ПорядокУчетаНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизацииПоДвойнойНорме) 
	|		ИЛИ ТаблицаНМА.ПорядокУчетаНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.ВключениеВРасходыПриПринятииКУчету) 
	|		ИЛИ ТаблицаНМА.ПорядокУчетаНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.ОтнесениеНаВычетыРавнымиДолями)) 
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаФиксированныеАктивыУчитываемыеОтдельно_ПринятиеКУчетуОС(ДокументВерсии2_4 = Ложь)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаОС.НомерСтроки КАК НомерСтроки,
	|
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|
	|	&Организация КАК Организация,
	|	ТаблицаОС.ОсновноеСредство КАК ФиксированныйАктив,
	|
	|	ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.ПринятиеКУчету) КАК Событие,
	|	ВЫБОР КОГДА &ПорядокУчетаНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизацииПоДвойнойНорме) 
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыФАУчитываемыхОтдельно.ДвойнаяНормаАмортизации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыФАУчитываемыхОтдельно.ОбъектыПреференций)
	|	КОНЕЦ КАК ВидЛьготыФА
	|
	|ИЗ
	|	Документ.ПринятиеКУчетуОС" + ?(ДокументВерсии2_4, "2_4", "") + ".ОС КАК ТаблицаОС
	|
	|ГДЕ
	|	ТаблицаОС.Ссылка = &Ссылка
	|	И (&ПорядокУчетаНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизацииПоДвойнойНорме) 
	|		ИЛИ &ПорядокУчетаНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.ВключениеВРасходыПриПринятииКУчету) 
	|		ИЛИ &ПорядокУчетаНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.ОтнесениеНаВычетыРавнымиДолями)) 
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаФиксированныеАктивыУчитываемыеОтдельно_ПринятиеКУчетуНМА(ДокументВерсии2_4 = Ложь)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|
	|	&Организация КАК Организация,
	|	&НематериальныйАктив КАК ФиксированныйАктив,
	|
	|	ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.ПринятиеКУчету) КАК Событие,
	|	ВЫБОР КОГДА &ПорядокУчетаНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизацииПоДвойнойНорме) 
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыФАУчитываемыхОтдельно.ДвойнаяНормаАмортизации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыФАУчитываемыхОтдельно.ОбъектыПреференций)
	|	КОНЕЦ КАК ВидЛьготыФА
	|
	|ГДЕ
	|	&ПорядокУчетаНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизацииПоДвойнойНорме) 
	|		ИЛИ &ПорядокУчетаНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.ВключениеВРасходыПриПринятииКУчету) 
	|		ИЛИ &ПорядокУчетаНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.ОтнесениеНаВычетыРавнымиДолями)
	|;";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаФиксированныеАктивыУчитываемыеОтдельно_СписаниеОС(ДокументВерсии2_4 = Ложь)

	ТекстЗапроса = ТекстЗапросаТаблицаФиксированныеАктивыУчитываемыеОтдельно_ВыбытиеОС();
	
	Возврат ТекстЗапроса + "
	|	И &СнятьСУчетаПоНалогам;";
	
КонецФункции

Функция ТекстЗапросаТаблицаФиксированныеАктивыУчитываемыеОтдельно_ПодготовкаКПередачеОС(ДокументВерсии2_4 = Ложь)

	ТекстЗапроса = ТекстЗапросаТаблицаФиксированныеАктивыУчитываемыеОтдельно_ВыбытиеОС();
	
	Возврат ТекстЗапроса + ";";

КонецФункции

Функция ТекстЗапросаТаблицаФиксированныеАктивыУчитываемыеОтдельно_ВыбытиеОС()

	Возврат "
	|ВЫБРАТЬ
	|	ТаблицаОС.НомерСтроки КАК НомерСтроки,
	|
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|
	|	&Организация КАК Организация,
	|	ТаблицаОС.ОсновноеСредство КАК ФиксированныйАктив,
	|
	|	ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.Выбытие) КАК Событие,
	|	ФиксированныеАктивыУчитываемыеОтдельно.ВидЛьготыФА КАК ВидЛьготыФА
	|
	|ИЗ
	|	Документ.#ИмяДокумента#.ОС КАК ТаблицаОС
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФиксированныеАктивыУчитываемыеОтдельно.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация) КАК ФиксированныеАктивыУчитываемыеОтдельно
	|		ПО ТаблицаОС.ОсновноеСредство = ФиксированныеАктивыУчитываемыеОтдельно.ФиксированныйАктив
	|
	|ГДЕ
	|	ТаблицаОС.Ссылка = &Ссылка
	|	И НЕ ФиксированныеАктивыУчитываемыеОтдельно.ФиксированныйАктив ЕСТЬ NULL
	|	И Событие = ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.ПринятиеКУчету)
	|";

КонецФункции

Функция ТекстЗапросаТаблицаФиксированныеАктивыУчитываемыеОтдельно_ПеремещениеОС(ДокументВерсии2_4 = Ложь)

	Возврат "
	|ВЫБРАТЬ
	|	ТаблицаОС.НомерСтроки КАК НомерСтроки,
	|
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|
	|	&Организация КАК Организация,
	|	ТаблицаОС.ОсновноеСредство КАК ФиксированныйАктив,
	|
	|	ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.Выбытие) КАК Событие,
	|	ФиксированныеАктивыУчитываемыеОтдельно.ВидЛьготыФА КАК ВидЛьготыФА
	|
	|ИЗ
	|	Документ.ПеремещениеОС" + ?(ДокументВерсии2_4, "2_4", "") + ".ОС КАК ТаблицаОС
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФиксированныеАктивыУчитываемыеОтдельно.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация) КАК ФиксированныеАктивыУчитываемыеОтдельно
	|		ПО ТаблицаОС.ОсновноеСредство = ФиксированныеАктивыУчитываемыеОтдельно.ФиксированныйАктив
	|
	|ГДЕ
	|	ТаблицаОС.Ссылка = &Ссылка
	|	И НЕ ФиксированныеАктивыУчитываемыеОтдельно.ФиксированныйАктив ЕСТЬ NULL
	|	И Событие = ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.ПринятиеКУчету)
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации"+?(ДокументВерсии2_4, "", "РеглУчет")+".ПеремещениеОСвПодразделениеВыделенноеНаБаланс)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаОС.НомерСтроки КАК НомерСтроки,
	|
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|
	|	&ОрганизацияПолучатель КАК Организация,
	|	ТаблицаОС.ОсновноеСредство КАК ФиксированныйАктив,
	|
	|	ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.ПринятиеКУчету) КАК Событие,
	|	ФиксированныеАктивыУчитываемыеОтдельно.ВидЛьготыФА КАК ВидЛьготыФА
	|
	|ИЗ
	|	Документ.ПеремещениеОС" + ?(ДокументВерсии2_4, "2_4", "") + ".ОС КАК ТаблицаОС
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФиксированныеАктивыУчитываемыеОтдельно.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация) КАК ФиксированныеАктивыУчитываемыеОтдельно
	|		ПО ТаблицаОС.ОсновноеСредство = ФиксированныеАктивыУчитываемыеОтдельно.ФиксированныйАктив
	|
	|ГДЕ
	|	ТаблицаОС.Ссылка = &Ссылка
	|	И НЕ ФиксированныеАктивыУчитываемыеОтдельно.ФиксированныйАктив ЕСТЬ NULL
	|	И Событие = ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.ПринятиеКУчету)
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации"+?(ДокументВерсии2_4, "", "РеглУчет")+".ПеремещениеОСвПодразделениеВыделенноеНаБаланс)
	|;";

КонецФункции

Функция ТекстЗапросаТаблицаФиксированныеАктивыУчитываемыеОтдельно_ПеремещениеНМА(ДокументВерсии2_4 = Истина)

	Возврат "
	|ВЫБРАТЬ
	|	ТаблицаНМА.НомерСтроки КАК НомерСтроки,
	|
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|
	|	&Организация КАК Организация,
	|	ТаблицаНМА.НематериальныйАктив КАК ФиксированныйАктив,
	|
	|	ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.Выбытие) КАК Событие,
	|	ФиксированныеАктивыУчитываемыеОтдельно.ВидЛьготыФА КАК ВидЛьготыФА
	|
	|ИЗ
	|	Документ.ПеремещениеНМА2_4.НМА КАК ТаблицаНМА
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФиксированныеАктивыУчитываемыеОтдельно.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация) КАК ФиксированныеАктивыУчитываемыеОтдельно
	|		ПО ТаблицаНМА.НематериальныйАктив = ФиксированныеАктивыУчитываемыеОтдельно.ФиксированныйАктив
	|
	|ГДЕ
	|	ТаблицаНМА.Ссылка = &Ссылка
	|	И НЕ ФиксированныеАктивыУчитываемыеОтдельно.ФиксированныйАктив ЕСТЬ NULL
	|	И Событие = ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.ПринятиеКУчету)
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеНМАвПодразделениеВыделенноеНаБаланс)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаНМА.НомерСтроки КАК НомерСтроки,
	|
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|
	|	&ОрганизацияПолучатель КАК Организация,
	|	ТаблицаНМА.НематериальныйАктив КАК ФиксированныйАктив,
	|
	|	ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.ПринятиеКУчету) КАК Событие,
	|	ФиксированныеАктивыУчитываемыеОтдельно.ВидЛьготыФА КАК ВидЛьготыФА
	|
	|ИЗ
	|	Документ.ПеремещениеНМА2_4.НМА КАК ТаблицаНМА
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФиксированныеАктивыУчитываемыеОтдельно.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация) КАК ФиксированныеАктивыУчитываемыеОтдельно
	|		ПО ТаблицаНМА.НематериальныйАктив = ФиксированныеАктивыУчитываемыеОтдельно.ФиксированныйАктив
	|
	|ГДЕ
	|	ТаблицаНМА.Ссылка = &Ссылка
	|	И НЕ ФиксированныеАктивыУчитываемыеОтдельно.ФиксированныйАктив ЕСТЬ NULL
	|	И Событие = ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.ПринятиеКУчету)
	|	И &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеНМАвПодразделениеВыделенноеНаБаланс)
	|;";

КонецФункции

Функция ТекстЗапросаТаблицаФиксированныеАктивыУчитываемыеОтдельно_СписаниеНМА(ДокументВерсии2_4 = Ложь)

	ТекстЗапроса = ТекстЗапросаТаблицаФиксированныеАктивыУчитываемыеОтдельно_ВыбытиеНМА(ДокументВерсии2_4);
	
	Возврат ТекстЗапроса + "
	|	И &СнятьСУчетаПоНалогам;";
	
КонецФункции

Функция ТекстЗапросаТаблицаФиксированныеАктивыУчитываемыеОтдельно_ПодготовкаКПередачеНМА(ДокументВерсии2_4 = Ложь)
	
	ТекстЗапроса = ТекстЗапросаТаблицаФиксированныеАктивыУчитываемыеОтдельно_ВыбытиеНМА(ДокументВерсии2_4);
	
	Возврат ТекстЗапроса + ";";
	
КонецФункции

Функция ТекстЗапросаТаблицаФиксированныеАктивыУчитываемыеОтдельно_ВыбытиеНМА(ДокументВерсии2_4 = Ложь)

	Если ДокументВерсии2_4 Тогда
		Возврат "
		|ВЫБРАТЬ
		|	ТаблицаНМА.НомерСтроки КАК НомерСтроки,
		|
		|	&Дата КАК Период,
		|	&Ссылка КАК Регистратор,
		|
		|	&Организация КАК Организация,
		|	ТаблицаНМА.НематериальныйАктив КАК ФиксированныйАктив,
		|
		|	ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.Выбытие) КАК Событие,
		|	ФиксированныеАктивыУчитываемыеОтдельно.ВидЛьготыФА КАК ВидЛьготыФА
		|
		|ИЗ
		|	Документ.#ИмяДокумента#.НМА КАК ТаблицаНМА
		|	
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФиксированныеАктивыУчитываемыеОтдельно.СрезПоследних(
		|				&Дата,
		|				Организация = &Организация) КАК ФиксированныеАктивыУчитываемыеОтдельно
		|		ПО ТаблицаНМА.НематериальныйАктив = ФиксированныеАктивыУчитываемыеОтдельно.ФиксированныйАктив
		|
		|ГДЕ
		|	ТаблицаНМА.Ссылка = &Ссылка
		|	И НЕ ФиксированныеАктивыУчитываемыеОтдельно.ФиксированныйАктив ЕСТЬ NULL
		|	И Событие = ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.ПринятиеКУчету)
		|";
	Иначе
		Возврат "
		|ВЫБРАТЬ
		|	&Дата КАК Период,
		|	&Ссылка КАК Регистратор,
		|
		|	&Организация КАК Организация,
		|	&НематериальныйАктив КАК ФиксированныйАктив,
		|
		|	ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.Выбытие) КАК Событие,
		|	ФиксированныеАктивыУчитываемыеОтдельно.ВидЛьготыФА КАК ВидЛьготыФА
		|
		|ИЗ
		|	РегистрСведений.ФиксированныеАктивыУчитываемыеОтдельно.СрезПоследних(
		|		&Дата,
		|		Организация = &Организация
		|			И ФиксированныйАктив = &НематериальныйАктив) КАК ФиксированныеАктивыУчитываемыеОтдельно
		|
		|ГДЕ
		|	Событие = ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.ПринятиеКУчету)
		|";
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДвижениеПоРегиструОбъектыНалоговогоУчетаФА(ДополнительныеСвойства, Движения, Отказ)

	ТаблицаДвижений = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОбъектыНалоговогоУчетаФА;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Движения.ОбъектыНалоговогоУчетаФА.Записывать = Истина;
	Движения.ОбъектыНалоговогоУчетаФА.Загрузить(ТаблицаДвижений);

КонецПроцедуры

Процедура ДвижениеПоРегиструФиксированныеАктивыУчитываемыеОтдельно(ДополнительныеСвойства, Движения, Отказ)

	ТаблицаДвижений = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаФиксированныеАктивыУчитываемыеОтдельно;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Движения.ФиксированныеАктивыУчитываемыеОтдельно.Записывать = Истина;
	Движения.ФиксированныеАктивыУчитываемыеОтдельно.Загрузить(ТаблицаДвижений);

КонецПроцедуры

Процедура ИнициализироватьДанныеДокумента(ДокументОбъект, ДополнительныеСвойства, СтруктураРегистров)

	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений

	СтруктураПараметров = Новый Структура;
	ЗаполнитьСтруктуруПараметровЗапроса(СтруктураПараметров);
	
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, ДокументОбъект);

	Запрос = Новый Запрос;
	УстановитьПараметрыЗапроса(Запрос, СтруктураПараметров);

	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса

	ТекстыЗапроса = Новый СписокЗначений;
	ИмяДокумента  = ДокументОбъект.Метаданные().Имя;
	
	Для Каждого Регистр Из СтруктураРегистров Цикл

		Если Регистр.Значение Тогда

			ИмяПроцедуры = "ТекстЗапросаТаблица" + Регистр.Ключ + "_[ИмяДокумента]()";
			ИмяПроцедуры = СтрЗаменить(ИмяПроцедуры, "[ИмяДокумента]", ИмяДокумента);
			
			Если НЕ СтрНайти(ИмяПроцедуры, "2_4") = 0 Тогда
				ИмяПроцедуры = СтрЗаменить(ИмяПроцедуры, "2_4()", "(Истина)");	
			КонецЕсли;
			ТекстЗапроса = СтрЗаменить(Вычислить(ИмяПроцедуры), "#ИмяДокумента#", ИмяДокумента);
			ТекстыЗапроса.Добавить(ТекстЗапроса, "Таблица" + Регистр.Ключ);

		КонецЕсли;

	КонецЦикла;

	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений);
 					   	
КонецПроцедуры

Процедура ЗаполнитьСтруктуруПараметровЗапроса(СтруктураПараметров)
	
	СтруктураПараметров.Вставить("Ссылка");
	СтруктураПараметров.Вставить("Организация");
	СтруктураПараметров.Вставить("Дата");
	СтруктураПараметров.Вставить("АмортизационнаяГруппа");
	СтруктураПараметров.Вставить("ПорядокУчетаНУ");
	СтруктураПараметров.Вставить("НематериальныйАктив");
	СтруктураПараметров.Вставить("СнятьСУчетаПоНалогам");
	СтруктураПараметров.Вставить("ХозяйственнаяОперация");
	СтруктураПараметров.Вставить("ОрганизацияПолучатель");
	
КонецПроцедуры

Процедура УстановитьПараметрыЗапроса(Запрос, СтруктураПараметров)

	Для Каждого Параметр Из СтруктураПараметров Цикл

		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);

	КонецЦикла;

КонецПроцедуры

Функция ПолучитьПолныйСписокВидовАктивовНУ() Экспорт

	ВидыАктива = Новый Массив;
	
	Для Каждого ВидАктиваНУ Из Перечисления.ВидАктиваНУ Цикл
		ВидыАктива.Добавить(ВидАктиваНУ);
	КонецЦикла;
	
	Возврат ВидыАктива;
	
КонецФункции

#КонецОбласти

#Область ОтражениеВреглУчетеТекущегоРемонта

Функция ДокументыКОтражениюРасходовНаРемонты()
	
	СписокДокументов = Новый СписокЗначений;
	
	СписокДокументов.Добавить("АвансовыйОтчет");
	СписокДокументов.Добавить("АмортизацияОС");
	СписокДокументов.Добавить("АмортизацияНМА");
	СписокДокументов.Добавить("ВнутреннееПотреблениеТоваров");
	СписокДокументов.Добавить("ВыбытиеДенежныхДокументов");
	СписокДокументов.Добавить("КорректировкаПриобретения");
	СписокДокументов.Добавить("ПогашениеСтоимостиТМЦВЭксплуатации");
	СписокДокументов.Добавить("ПриобретениеТоваровУслуг");
	СписокДокументов.Добавить("ПриобретениеУслугПрочихАктивов");
	СписокДокументов.Добавить("ПрочиеДоходыРасходы");
	СписокДокументов.Добавить("РаспределениеРасходовБудущихПериодов");
	СписокДокументов.Добавить("РасходныйКассовыйОрдер");
	СписокДокументов.Добавить("СписаниеБезналичныхДенежныхСредств");
	СписокДокументов.Добавить("ОтражениеЗарплатыВФинансовомУчете");
	
	Возврат СписокДокументов;
	
КонецФункции

Функция ТекстОтраженияАвансовыйОтчет()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ // Поступление услуг (Дт 44 :: Кт 71)
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР 
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Текущий)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Преференции)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	ЕСТЬNULL(Суммы.СуммаБезНДСРегл, Строки.СуммаСНДС - Строки.СуммаНДС) КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Поступление расходов"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.АвансовыйОтчет КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.АвансовыйОтчет.ПрочиеРасходы КАК Строки
	|	ПО
	|		Строки.Ссылка = ДокументыКОтражению.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СуммыДокументовВВалютеРегл КАК Суммы
	|	ПО
	|		Суммы.Регистратор = Строки.Ссылка
	|		И Суммы.ИдентификаторСтроки = Строки.ИдентификаторСтроки
	|		И Суммы.СуммаБезНДСРегл <> 0
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И (СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности)
	|			ИЛИ СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты))
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции))
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Строки.СтатьяРасходов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|	И Операция.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыАвансовогоОтчета.Утвержден)
	|	И НЕ Строки.Отменено
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Поступление услуг (Дт 44 :: Кт 71)
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Капитальный) КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	ЕСТЬNULL(Суммы.СуммаБезНДСРегл, Строки.СуммаСНДС - Строки.СуммаНДС) КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Поступление расходов"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.АвансовыйОтчет КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.АвансовыйОтчет.ПрочиеРасходы КАК Строки
	|	ПО
	|		Строки.Ссылка = ДокументыКОтражению.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СуммыДокументовВВалютеРегл КАК Суммы
	|	ПО
	|		Суммы.Регистратор = Строки.Ссылка
	|		И Суммы.ИдентификаторСтроки = Строки.ИдентификаторСтроки
	|		И Суммы.СуммаБезНДСРегл <> 0
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств)
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Строки.СтатьяРасходов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|	И Операция.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыАвансовогоОтчета.Утвержден)
	|	И НЕ Строки.Отменено
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстОтраженияАмортизацияОС()
	
	ТекстЗапроса = "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация (Дт СчетУчетаЗатрат :: Кт СчетНакопленияАмортизации)
	|ВЫБРАТЬ
	|	
	|	&Ссылка КАК Ссылка,
	|	&Дата КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР 
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Текущий)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Преференции)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СуммаБУ КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Начисление амортизации"" КАК Содержание
	|ИЗ
	|	втНачисленнаяАмортизация КАК Строки
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции))
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПервоначальныеСведения КАК втПервоначальныеСведения
	|	ПО Строки.ОбъектУчета = втПервоначальныеСведения.ОбъектУчета
	|
	|ГДЕ
	|	НЕ Строки.ЭтоАмортизационнаяПремия
	|	И НЕ Строки.ПередаватьРасходыВДругуюОрганизацию
	|	И НЕ втПервоначальныеСведения.НачислятьИзнос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация (Дт СчетУчетаЗатрат :: Кт СчетНакопленияАмортизации)
	|ВЫБРАТЬ
	|	
	|	&Ссылка КАК Ссылка,
	|	&Дата КАК Период,
	|	ЕСТЬNULL(ОрганизациПолучатель.Ссылка, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР 
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Текущий)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Преференции)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СуммаБУ КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Начисление амортизации"" КАК Содержание
	|ИЗ
	|	втНачисленнаяАмортизация КАК Строки
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОрганизациПолучатель
	|		ПО Строки.ОрганизацияПолучательРасходов = ОрганизациПолучатель.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции))
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПервоначальныеСведения КАК втПервоначальныеСведения
	|	ПО Строки.ОбъектУчета = втПервоначальныеСведения.ОбъектУчета
	|
	|ГДЕ
	|	НЕ Строки.ЭтоАмортизационнаяПремия
	|	И Строки.ПередаватьРасходыВДругуюОрганизацию
	|	И НЕ втПервоначальныеСведения.НачислятьИзнос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация (Дт СчетУчетаЗатрат :: Кт СчетНакопленияАмортизации)
	|ВЫБРАТЬ
	|	
	|	&Ссылка КАК Ссылка,
	|	&Дата КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Капитальный) КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СуммаБУ КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Начисление амортизации"" КАК Содержание
	|ИЗ
	|	втНачисленнаяАмортизация КАК Строки
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств)
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПервоначальныеСведения КАК втПервоначальныеСведения
	|	ПО Строки.ОбъектУчета = втПервоначальныеСведения.ОбъектУчета
	|
	|ГДЕ
	|	НЕ Строки.ЭтоАмортизационнаяПремия
	|	И НЕ Строки.ПередаватьРасходыВДругуюОрганизацию
	|	И НЕ втПервоначальныеСведения.НачислятьИзнос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация (Дт СчетУчетаЗатрат :: Кт СчетНакопленияАмортизации)
	|ВЫБРАТЬ
	|	
	|	&Ссылка КАК Ссылка,
	|	&Дата КАК Период,
	|	ЕСТЬNULL(ОрганизациПолучатель.Ссылка, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Капитальный) КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СуммаБУ КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Начисление амортизации"" КАК Содержание
	|ИЗ
	|	втНачисленнаяАмортизация КАК Строки
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОрганизациПолучатель
	|		ПО Строки.ОрганизацияПолучательРасходов = ОрганизациПолучатель.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств)
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПервоначальныеСведения КАК втПервоначальныеСведения
	|	ПО Строки.ОбъектУчета = втПервоначальныеСведения.ОбъектУчета
	|
	|ГДЕ
	|	НЕ Строки.ЭтоАмортизационнаяПремия
	|	И Строки.ПередаватьРасходыВДругуюОрганизацию
	|	И НЕ втПервоначальныеСведения.НачислятьИзнос
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстОтраженияАмортизацияНМА()
	
	ТекстЗапроса = "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация НМА (Дт 20, 25, 44 :: Кт СчетАмортизации)
	|ВЫБРАТЬ
	|	
	|	&Ссылка КАК Ссылка,
	|	&Дата КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР 
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Текущий)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Преференции)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СуммаБУ КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Начисление амортизации"" КАК Содержание
	|ИЗ
	|	втНачисленнаяАмортизация КАК Строки
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции))
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|
	|ГДЕ
	|	НЕ Строки.ПередаватьРасходыВДругуюОрганизацию
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация НМА (Дт 20, 25, 44 :: Кт СчетАмортизации)
	|ВЫБРАТЬ
	|	
	|	&Ссылка КАК Ссылка,
	|	&Дата КАК Период,
	|	ЕСТЬNULL(ОрганизациПолучатель.Ссылка, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР 
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Текущий)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Преференции)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СуммаБУ КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Начисление амортизации"" КАК Содержание
	|ИЗ
	|	втНачисленнаяАмортизация КАК Строки
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОрганизациПолучатель
	|		ПО Строки.ОрганизацияПолучательРасходов = ОрганизациПолучатель.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции))
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|
	|ГДЕ
	|	Строки.ПередаватьРасходыВДругуюОрганизацию
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация НМА (Дт 20, 25, 44 :: Кт СчетАмортизации)
	|ВЫБРАТЬ
	|	
	|	&Ссылка КАК Ссылка,
	|	&Дата КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Капитальный) КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СуммаБУ КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Начисление амортизации"" КАК Содержание
	|ИЗ
	|	втНачисленнаяАмортизация КАК Строки
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств)
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|
	|ГДЕ
	|	НЕ Строки.ПередаватьРасходыВДругуюОрганизацию
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Амортизация НМА (Дт 20, 25, 44 :: Кт СчетАмортизации)
	|ВЫБРАТЬ
	|	
	|	&Ссылка КАК Ссылка,
	|	&Дата КАК Период,
	|	ЕСТЬNULL(ОрганизациПолучатель.Ссылка, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Капитальный) КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СуммаБУ КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Начисление амортизации"" КАК Содержание
	|ИЗ
	|	втНачисленнаяАмортизация КАК Строки
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОрганизациПолучатель
	|		ПО Строки.ОрганизацияПолучательРасходов = ОрганизациПолучатель.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств)
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|
	|ГДЕ
	|	Строки.ПередаватьРасходыВДругуюОрганизацию
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстОтраженияВнутреннееПотреблениеТоваров()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Списание на расходы товаров (Дт 20, 2Х, 44, 91.02 :: Кт 41.01, 76.ОК)
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Операция.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Операция.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР 
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Текущий)
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств )
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Капитальный)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Преференции)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	ЕСТЬNULL(Стоимости.СуммаНУ, Строки.СуммаНУ) КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	Операция.Склад КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Списание товаров на расходы"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ВнутреннееПотреблениеТоваров КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВтСтроки КАК Строки
	|	ПО
	|		Операция.Ссылка = Строки.Ссылка
	|		И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтСтоимости КАК Стоимости
	|	ПО
	|		Строки.Ссылка = Стоимости.Ссылка
	|		И Строки.Номенклатура = Стоимости.Номенклатура
	|		И Строки.Склад = Стоимости.Склад
	|		И Строки.ГруппаФинансовогоУчета = Стоимости.ГруппаФинансовогоУчета
	|		И Строки.ТипЗапасов = Стоимости.ТипЗапасов
	|		И Строки.Контрагент = Стоимости.Контрагент
	|		И Строки.СтатьяРасходов = Стоимости.СтатьяРасходов
	|		И Строки.АналитикаРасходов = Стоимости.АналитикаРасходов
	|		И Строки.РазделУчета = Стоимости.РазделУчета
	|		И Строки.ГруппаПродукции = Стоимости.ГруппаПродукции
	|		И Строки.ИдентификаторСтроки = Стоимости.ИдентификаторСтроки
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И (СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности)
	|			ИЛИ СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|			ИЛИ СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы))
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции))
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|ГДЕ
	|	Строки.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	И Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|	И Строки.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	И СтатьиНаРемонтОС.Ссылка ЕСТЬ НЕ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ //// Списание на расходы товаров (Дт 20, 2Х, 44, 91.02 :: Кт 41.01, 76.ОК)
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Операция.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Операция.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходыВНалоговомУчете) КАК СчетДт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.РасходыПоПреференциям) КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	ЕСТЬNULL(Стоимости.СуммаНУ, Строки.СуммаНУ) КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	-ЕСТЬNULL(Стоимости.СуммаНУ, Строки.СуммаНУ) КАК СуммаВРДт,
	|	
	|	ВЫБОР КОГДА Строки.Склад ССЫЛКА Справочник.Партнеры ИЛИ Строки.Склад ССЫЛКА Справочник.Организации ТОГДА
	|		НЕОПРЕДЕЛЕНО
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НаСкладе)
	|	КОНЕЦ КАК ВидСчетаКт,
	|	
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаКт,
	|	Операция.Склад КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Операция.Склад.Подразделение КАК ПодразделениеКт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ВЫБОР КОГДА Строки.Склад ССЫЛКА Справочник.Партнеры  ИЛИ Строки.Склад ССЫЛКА Справочник.Организации ТОГДА
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыКОформлениюОтчетовКомитенту)
	|	ИНАЧЕ
	|		НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетКт,
	|	
	|	ВЫБОР КОГДА Строки.Склад ССЫЛКА Справочник.Партнеры  ИЛИ Строки.Склад ССЫЛКА Справочник.Организации ТОГДА
	|		Строки.Контрагент
	|	ИНАЧЕ
	|		Строки.Номенклатура
	|	КОНЕЦ КАК СубконтоКт1,
	|	
	|	ВЫБОР КОГДА Строки.Склад ССЫЛКА Справочник.Партнеры  ИЛИ Строки.Склад ССЫЛКА Справочник.Организации ТОГДА
	|		Строки.Номенклатура
	|	ИНАЧЕ
	|		Операция.Склад
	|	КОНЕЦ КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Списание товаров на расходы "" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ВнутреннееПотреблениеТоваров КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВтСтроки КАК Строки
	|	ПО
	|		Операция.Ссылка = Строки.Ссылка
	|		И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтСтоимости КАК Стоимости
	|	ПО
	|		Строки.Ссылка = Стоимости.Ссылка
	|		И Строки.Номенклатура = Стоимости.Номенклатура
	|		И Строки.Склад = Стоимости.Склад
	|		И Строки.ГруппаФинансовогоУчета = Стоимости.ГруппаФинансовогоУчета
	|		И Строки.ТипЗапасов = Стоимости.ТипЗапасов
	|		И Строки.Контрагент = Стоимости.Контрагент
	|		И Строки.СтатьяРасходов = Стоимости.СтатьяРасходов
	|		И Строки.АналитикаРасходов = Стоимости.АналитикаРасходов
	|		И Строки.РазделУчета = Стоимости.РазделУчета
	|		И Строки.ГруппаПродукции = Стоимости.ГруппаПродукции
	|		И Строки.ИдентификаторСтроки = Стоимости.ИдентификаторСтроки
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И (СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы))
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции)
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|
	|ГДЕ
	|	Строки.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	И Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|	И Строки.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	И СтатьиНаРемонтОС.Ссылка ЕСТЬ НЕ NULL
	|";

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстОтраженияВыбытиеДенежныхДокументов()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Списание ДД на расходы (Дт 2Х.ХХ :: Кт 50.03)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Операция.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Операция.Подразделение КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Операция.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|	Операция.СтатьяРасходов КАК СубконтоДт1,
	|	Операция.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР 
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Текущий)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Преференции)
	|	КОНЕЦ КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	ЕСТЬNULL(Суммы.СуммаБезНДСРегл, Строки.Сумма) КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Списание ДД на расходы"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ВыбытиеДенежныхДокументов КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ВыбытиеДенежныхДокументов.ДенежныеДокументы КАК Строки
	|	ПО
	|		Операция.Ссылка = Строки.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СуммыДокументовВВалютеРегл КАК Суммы
	|	ПО
	|		Строки.Ссылка = Суммы.Регистратор
	|		И Строки.ИдентификаторСтроки = Суммы.ИдентификаторСтроки
	|		И Суммы.СуммаБезНДСРегл <> 0
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Операция.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И (СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности)
	|			ИЛИ СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты))
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции))
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|
	|ГДЕ
	|	Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеДенежныхДокументов)
	|	И Операция.СтатьяРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ //// Списание ДД на расходы (Дт 2Х.ХХ :: Кт 50.03)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Операция.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Операция.Подразделение КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Операция.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|	Операция.СтатьяРасходов КАК СубконтоДт1,
	|	Операция.АналитикаРасходов КАК СубконтоДт2,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Капитальный) КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	ЕСТЬNULL(Суммы.СуммаБезНДСРегл, Строки.Сумма) КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Списание ДД на расходы"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ВыбытиеДенежныхДокументов КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ВыбытиеДенежныхДокументов.ДенежныеДокументы КАК Строки
	|	ПО
	|		Операция.Ссылка = Строки.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СуммыДокументовВВалютеРегл КАК Суммы
	|	ПО
	|		Строки.Ссылка = Суммы.Регистратор
	|		И Строки.ИдентификаторСтроки = Суммы.ИдентификаторСтроки
	|		И Суммы.СуммаБезНДСРегл <> 0
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Операция.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств)
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|
	|ГДЕ
	|	Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеДенежныхДокументов)
	|	И Операция.СтатьяРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов
	|";

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстОтраженияКорректировкаПриобретения()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Корректировка поступления услуг (Дт 08, 2Х, 44, 91 :: Кт 60, 71, 76)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР 
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Текущий)
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств )
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Капитальный)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Преференции)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	ВЫБОР КОГДА Операция.ДокументОснование.ЗакупкаПодДеятельность В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|	ТОГДА
	|		ЕСТЬNULL(Суммы.СуммаБезНДСРегл + Суммы.СуммаНДСРегл, Строки.СуммаСНДС)
	|	ИНАЧЕ
	|		ЕСТЬNULL(Суммы.СуммаБезНДСРегл, Строки.СуммаСНДС - Строки.СуммаНДС)
	|	КОНЕЦ КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	ВЫБОР КОГДА Операция.ДокументОснование.ЗакупкаПодДеятельность В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|	ТОГДА
	|		Строки.СуммаВзаиморасчетов
	|	ИНАЧЕ
	|		Строки.СуммаВзаиморасчетов - Строки.СуммаНДСВзаиморасчетов
	|	КОНЕЦ КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Корректировка поступления услуг"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.КорректировкаПриобретения КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.КорректировкаПриобретения.Расхождения КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СуммыДокументовВВалютеРегл КАК Суммы
	|	ПО
	|		Суммы.Регистратор = Строки.Ссылка
	|		И Суммы.ИдентификаторСтроки = Строки.ИдентификаторСтроки
	|		И Суммы.СуммаБезНДСРегл <> 0
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И (СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности)
	|			ИЛИ СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|			ИЛИ СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы))
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции))
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|ГДЕ
	|	(Строки.СписатьНаРасходы 
	|		ИЛИ ЕСТЬNULL(Строки.Номенклатура.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) НЕ В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)))
	|	И Строки.СтатьяРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов
	|	И СтатьиНаРемонтОС.Ссылка ЕСТЬ НЕ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ //// Корректировка поступления услуг (Дт 08, 2Х, 44, 91 :: Кт 60, 71, 76)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходыВНалоговомУчете) КАК СчетДт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.РасходыПоПреференциям) КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	ВЫБОР КОГДА Операция.ДокументОснование.ЗакупкаПодДеятельность В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|	ТОГДА
	|		ЕСТЬNULL(Суммы.СуммаБезНДСРегл + Суммы.СуммаНДСРегл, Строки.СуммаСНДС)
	|	ИНАЧЕ
	|		ЕСТЬNULL(Суммы.СуммаБезНДСРегл, Строки.СуммаСНДС - Строки.СуммаНДС)
	|	КОНЕЦ КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	-ВЫБОР КОГДА Операция.ДокументОснование.ЗакупкаПодДеятельность В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|	ТОГДА
	|		ЕСТЬNULL(Суммы.СуммаБезНДСРегл + Суммы.СуммаНДСРегл, Строки.СуммаСНДС)
	|	ИНАЧЕ
	|		ЕСТЬNULL(Суммы.СуммаБезНДСРегл, Строки.СуммаСНДС - Строки.СуммаНДС)
	|	КОНЕЦ КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками) КАК ВидСчетаКт,
	|	ЕСТЬNULL(Расчеты.ГруппаФинансовогоУчета, Операция.ДокументОснование.ГруппаФинансовогоУчета) КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	Операция.ВалютаВзаиморасчетов КАК ВалютаКт,
	|	ЕСТЬNULL(Расчеты.Подразделение, Операция.Подразделение) КАК ПодразделениеКт,
	|	ЕСТЬNULL(Расчеты.НаправлениеДеятельности, Операция.ДокументОснование.НаправлениеДеятельности) КАК НаправлениеДеятельностиКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|	Операция.Контрагент КАК СубконтоКт1,
	|	Операция.Договор КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Корректировка поступления услуг"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.КорректировкаПриобретения КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.КорректировкаПриобретения.Расхождения КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СуммыДокументовВВалютеРегл КАК Суммы
	|	ПО
	|		Суммы.Регистратор = Строки.Ссылка
	|		И Суммы.ИдентификаторСтроки = Строки.ИдентификаторСтроки
	|		И Суммы.СуммаБезНДСРегл <> 0
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.Склады КАК Склады
	|	ПО
	|		Склады.Ссылка = Строки.Склад
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Расчеты КАК Расчеты
	|	ПО 
	|		Операция.Ссылка = Расчеты.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И (СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы))
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции)
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|
	|ГДЕ
	|	(Строки.СписатьНаРасходы 
	|		ИЛИ ЕСТЬNULL(Строки.Номенклатура.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) НЕ В (
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|				ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)))
	|	И Строки.СтатьяРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов
	|";
	
	Возврат ТекстЗапроса;

КонецФункции	

Функция ТекстОтраженияПогашениеСтоимостиТМЦВЭксплуатации()
	
	ТекстЗапроса = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Погашение стоимости ТМЦ в эксплуатации (Дт СчетРасходов :: Кт 10.11.Х)
	|ВЫБРАТЬ
	|	
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР 
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Текущий)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Преференции)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СуммаНУ КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	Строки.ПартияТМЦВЭксплуатации.КатегорияЭксплуатации КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Погашение стоимости ТМЦ в эксплуатации"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПогашениеСтоимостиТМЦВЭксплуатации КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПогашениеСтоимостиТМЦВЭксплуатации.Расходы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И (СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности)
	|			ИЛИ СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты))
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции))
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Погашение стоимости ТМЦ в эксплуатации (Дт СчетРасходов :: Кт 10.11.Х)
	|ВЫБРАТЬ
	|	
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Капитальный) КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СуммаНУ КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	Строки.ПартияТМЦВЭксплуатации.КатегорияЭксплуатации КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Погашение стоимости ТМЦ в эксплуатации"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПогашениеСтоимостиТМЦВЭксплуатации КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПогашениеСтоимостиТМЦВЭксплуатации.Расходы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств)
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстОтраженияПриобретениеТоваровУслуг()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Получение услуг (Дт 2Х, 44, 91 :: Кт 60, 71, 76)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР 
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Текущий)
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств )
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Капитальный)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Преференции)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	(ВЫБОР
	|		КОГДА Операция.ЗакупкаПодДеятельность В (&ТипыОблагаемыеНДС)
	|				ИЛИ НЕ СтатьиНДСРаспределяется.Ссылка ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(Суммы.СуммаБезНДСРегл, Строки.СуммаСНДС - Строки.СуммаНДС)
	|		КОГДА Операция.ЗакупкаПодДеятельность В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|				, ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|			ТОГДА ЕСТЬNULL(Суммы.СуммаБезНДСРегл + Суммы.СуммаНДСРегл, Строки.СуммаСНДС)
	|	КОНЕЦ) КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Поступление услуг"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПриобретениеТоваровУслуг КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Документ.ПриобретениеТоваровУслуг.Товары КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.СуммыДокументовВВалютеРегл КАК Суммы
	|	ПО 
	|		Суммы.Регистратор = Строки.Ссылка
	|		И Суммы.ИдентификаторСтроки = Строки.ИдентификаторСтроки
	|		И Суммы.СуммаБезНДСРегл <> 0
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНДСРаспределяется
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНДСРаспределяется.Ссылка
	|		И СтатьиНДСРаспределяется.ВариантРаздельногоУчетаНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И (СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности)
	|			ИЛИ СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|			ИЛИ СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы))
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции))
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|ГДЕ
	|	Строки.Номенклатура.ТипНоменклатуры НЕ В
	|		(ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|	И Операция.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпорту),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо))
	|	И СтатьиНаРемонтОС.Ссылка ЕСТЬ НЕ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ //// Получение услуг на прочие активы (Дт 08 :: Кт 60, 71, 76)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходыВНалоговомУчете) КАК СчетДт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.РасходыПоПреференциям) КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт, // Наверное 0
	|	(ВЫБОР
	|		КОГДА Операция.ЗакупкаПодДеятельность В (&ТипыОблагаемыеНДС)
	|				ИЛИ НЕ СтатьиНДСРаспределяется.Ссылка ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(Суммы.СуммаБезНДСРегл, Строки.СуммаСНДС - Строки.СуммаНДС)
	|		КОГДА Операция.ЗакупкаПодДеятельность В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|				, ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|			ТОГДА ЕСТЬNULL(Суммы.СуммаБезНДСРегл + Суммы.СуммаНДСРегл, Строки.СуммаСНДС)
	|	КОНЕЦ) КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	-(ВЫБОР
	|		КОГДА Операция.ЗакупкаПодДеятельность В (&ТипыОблагаемыеНДС)
	|				ИЛИ НЕ СтатьиНДСРаспределяется.Ссылка ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(Суммы.СуммаБезНДСРегл, Строки.СуммаСНДС - Строки.СуммаНДС)
	|		КОГДА Операция.ЗакупкаПодДеятельность В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|				, ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|			ТОГДА ЕСТЬNULL(Суммы.СуммаБезНДСРегл + Суммы.СуммаНДСРегл, Строки.СуммаСНДС)
	|	КОНЕЦ) КАК СуммаВРДт,
	|	
	|	(ВЫБОР КОГДА Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо) ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками) КОНЕЦ) КАК ВидСчетаКт,
	|	(ВЫБОР КОГДА Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо) ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ЕСТЬNULL(Расчеты.ГруппаФинансовогоУчета, Операция.ГруппаФинансовогоУчета) КОНЕЦ) КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	Операция.ВалютаВзаиморасчетов КАК ВалютаКт,
	|	ЕСТЬNULL(Расчеты.Подразделение, Операция.Подразделение) КАК ПодразделениеКт,
	|	ВЫБОР
	|		КОГДА Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо) ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ЕСТЬNULL(Расчеты.НаправлениеДеятельности, Операция.НаправлениеДеятельности)
	|	КОНЕЦ КАК НаправлениеДеятельностиКт,
	|
	|	(ВЫБОР
	|		КОГДА Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо) ТОГДА
	|			(ВЫБОР КОГДА Суммы.СуммаБезНДСРегл ЕСТЬ NULL ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами)
	|				ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВал) КОНЕЦ)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ) КАК СчетКт,
	|	(ВЫБОР КОГДА Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо) ТОГДА Операция.ПодотчетноеЛицо
	|		ИНАЧЕ Операция.Контрагент КОНЕЦ) КАК СубконтоКт1,
	|	(ВЫБОР КОГДА Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо) ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Операция.Договор КОНЕЦ) КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Получение услуг на прочие активы"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПриобретениеТоваровУслуг КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		Документ.ПриобретениеТоваровУслуг.Товары КАК Строки
	|	ПО 
	|		Строки.Ссылка = Операция.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.СуммыДокументовВВалютеРегл КАК Суммы
	|	ПО
	|		Суммы.Регистратор = Строки.Ссылка И Суммы.ИдентификаторСтроки = Строки.ИдентификаторСтроки И Суммы.СуммаБезНДСРегл <> 0
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНДСРаспределяется
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНДСРаспределяется.Ссылка
	|		И СтатьиНДСРаспределяется.ВариантРаздельногоУчетаНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Расчеты КАК Расчеты
	|	ПО 
	|		Операция.Ссылка = Расчеты.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И (СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы))
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции)
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|
	|ГДЕ
	|	Строки.Номенклатура.ТипНоменклатуры НЕ В
	|		(ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|	И Операция.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпорту),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо))
	|";

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстОтраженияПриобретениеУслугПрочихАктивов()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ // Поступление услуг (Дт <25, 26, 44, 20, 23, 08.3, 20> :: Кт <60.1, 76, 71> )
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР 
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Текущий)
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств )
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Капитальный)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Преференции)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	(ВЫБОР КОГДА Операция.ЗакупкаПодДеятельность В (&ТипыОблагаемыеНДС)
	|		ИЛИ НЕ СтатьиНДСРаспределяется.Ссылка ЕСТЬ NULL
	|	ТОГДА
	|		ЕСТЬNULL(Суммы.СуммаБезНДСРегл, Строки.СуммаСНДС - Строки.СуммаНДС)
	|	КОГДА Операция.ЗакупкаПодДеятельность В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|	ТОГДА
	|		ЕСТЬNULL(Суммы.СуммаБезНДСРегл + Суммы.СуммаНДСРегл, Строки.СуммаСНДС)
	|	КОНЕЦ) КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Поступление услуг"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПриобретениеУслугПрочихАктивов КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПриобретениеУслугПрочихАктивов.Расходы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СуммыДокументовВВалютеРегл КАК Суммы
	|	ПО
	|		Суммы.Регистратор = Строки.Ссылка
	|		И Суммы.ИдентификаторСтроки = Строки.ИдентификаторСтроки
	|		И Суммы.СуммаБезНДСРегл <> 0
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНДСРаспределяется
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНДСРаспределяется.Ссылка
	|		И СтатьиНДСРаспределяется.ВариантРаздельногоУчетаНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И (СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности)
	|			ИЛИ СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|			ИЛИ СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы))
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции))
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|
	|ГДЕ
	|	Операция.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо)
	|	)
	|	И ТИПЗНАЧЕНИЯ(Строки.СтатьяРасходов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|	И СтатьиНаРемонтОС.Ссылка ЕСТЬ НЕ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Поступление услуг (Дт <25, 26, 44, 20, 23, 08.3, 20> :: Кт <60.1, 76, 71> )
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходыВНалоговомУчете) КАК СчетДт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.РасходыПоПреференциям) КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	(ВЫБОР КОГДА Операция.ЗакупкаПодДеятельность В (&ТипыОблагаемыеНДС)
	|		ИЛИ НЕ СтатьиНДСРаспределяется.Ссылка ЕСТЬ NULL
	|	ТОГДА
	|		ЕСТЬNULL(Суммы.СуммаБезНДСРегл, Строки.СуммаСНДС - Строки.СуммаНДС)
	|	КОГДА Операция.ЗакупкаПодДеятельность В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|	ТОГДА
	|		ЕСТЬNULL(Суммы.СуммаБезНДСРегл + Суммы.СуммаНДСРегл, Строки.СуммаСНДС)
	|	КОНЕЦ) КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	-(ВЫБОР КОГДА Операция.ЗакупкаПодДеятельность В (&ТипыОблагаемыеНДС)
	|		ИЛИ НЕ СтатьиНДСРаспределяется.Ссылка ЕСТЬ NULL
	|	ТОГДА
	|		ЕСТЬNULL(Суммы.СуммаБезНДСРегл, Строки.СуммаСНДС - Строки.СуммаНДС)
	|	КОГДА Операция.ЗакупкаПодДеятельность В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД))
	|	ТОГДА
	|		ЕСТЬNULL(Суммы.СуммаБезНДСРегл + Суммы.СуммаНДСРегл, Строки.СуммаСНДС)
	|	КОНЕЦ) КАК СуммаВРДт,
	|	
	|	(ВЫБОР КОГДА Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо) ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками) КОНЕЦ) КАК ВидСчетаКт,
	|	(ВЫБОР КОГДА Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо) ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ЕСТЬNULL(Расчеты.ГруппаФинансовогоУчета, Операция.ГруппаФинансовогоУчета) КОНЕЦ) КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	Операция.ВалютаВзаиморасчетов КАК ВалютаКт,
	|	ЕСТЬNULL(Расчеты.Подразделение, Операция.Подразделение) КАК ПодразделениеКт,
	|	ВЫБОР
	|		КОГДА Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо) ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ЕСТЬNULL(Расчеты.НаправлениеДеятельности, Операция.НаправлениеДеятельности)
	|	КОНЕЦ КАК НаправлениеДеятельностиКт,
	|
	|	(ВЫБОР
	|		КОГДА Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо) ТОГДА
	|			(ВЫБОР КОГДА Суммы.СуммаБезНДСРегл ЕСТЬ NULL ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами)
	|				ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВал) КОНЕЦ)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ) КАК СчетКт,
	|	(ВЫБОР КОГДА Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо) ТОГДА Операция.ПодотчетноеЛицо
	|		ИНАЧЕ Операция.Контрагент КОНЕЦ) КАК СубконтоКт1,
	|	(ВЫБОР КОГДА Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо) ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Операция.Договор КОНЕЦ) КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Поступление услуг"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПриобретениеУслугПрочихАктивов КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПриобретениеУслугПрочихАктивов.Расходы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СуммыДокументовВВалютеРегл КАК Суммы
	|	ПО
	|		Суммы.Регистратор = Строки.Ссылка
	|		И Суммы.ИдентификаторСтроки = Строки.ИдентификаторСтроки
	|		И Суммы.СуммаБезНДСРегл <> 0
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНДСРаспределяется
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНДСРаспределяется.Ссылка
	|		И СтатьиНДСРаспределяется.ВариантРаздельногоУчетаНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Расчеты КАК Расчеты
	|	ПО 
	|		Расчеты.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И (СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы))
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции)
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|
	|ГДЕ
	|	Операция.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо)
	|	)
	|	И ТИПЗНАЧЕНИЯ(Строки.СтатьяРасходов) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|";
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстОтраженияПрочиеДоходыРасходы()
	
#Область РегистрацияПрочихРасходов
	ТекстРегистрацияПрочихРасходов = "
	|ВЫБРАТЬ // Прочие расходы (Дт <25, 26, 44, 20, 23> :: Кт <разные>)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	ВЫБОР КОГДА РАЗНОСТЬДАТ(Строки.ДатаОтражения, Операция.Дата, ДЕНЬ) = 0
	|				ИЛИ Строки.ДатаОтражения = ДАТАВРЕМЯ(1, 1, 1) ТОГДА
	|		Операция.Дата
	|	ИНАЧЕ
	|		Строки.ДатаОтражения
	|	КОНЕЦ КАК Период,
	|	Операция.Организация КАК Организация,
	|	Строки.НомерСтроки КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|	Строки.СтатьяРасходов КАК СубконтоДт1, 
	|	Строки.АналитикаРасходов КАК СубконтоДт2, 
	|	ВЫБОР 
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Текущий)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Преференции)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	(Строки.СуммаРегл - Строки.ПостояннаяРазница - Строки.ВременнаяРазница) КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие расходы"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПрочиеДоходыРасходы КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПрочиеДоходыРасходы.ПрочиеРасходы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СуммыДокументовВВалютеРегл КАК Суммы
	|	ПО
	|		Суммы.Регистратор = Строки.Ссылка
	|		И Суммы.ИдентификаторСтроки = Строки.ИдентификаторСтроки
	|		И Суммы.СуммаБезНДСРегл <> 0
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И (СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности)
	|			ИЛИ СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты))
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции))
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|ГДЕ
	|	Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочиеРасходы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Прочие расходы (Дт <25, 26, 44, 20, 23> :: Кт <разные>)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	ВЫБОР КОГДА РАЗНОСТЬДАТ(Строки.ДатаОтражения, Операция.Дата, ДЕНЬ) = 0
	|				ИЛИ Строки.ДатаОтражения = ДАТАВРЕМЯ(1, 1, 1) ТОГДА
	|		Операция.Дата
	|	ИНАЧЕ
	|		Строки.ДатаОтражения
	|	КОНЕЦ КАК Период,
	|	Операция.Организация КАК Организация,
	|	Строки.НомерСтроки КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|	Строки.СтатьяРасходов КАК СубконтоДт1, 
	|	Строки.АналитикаРасходов КАК СубконтоДт2, 
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Капитальный) КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	(Строки.СуммаРегл - Строки.ПостояннаяРазница - Строки.ВременнаяРазница) КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие расходы"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПрочиеДоходыРасходы КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПрочиеДоходыРасходы.ПрочиеРасходы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СуммыДокументовВВалютеРегл КАК Суммы
	|	ПО
	|		Суммы.Регистратор = Строки.Ссылка
	|		И Суммы.ИдентификаторСтроки = Строки.ИдентификаторСтроки
	|		И Суммы.СуммаБезНДСРегл <> 0
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств)
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|ГДЕ
	|	Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочиеРасходы)
	|
	|";
#КонецОбласти

#Область СписаниеПрочихРасходов
	ТекстСписаниеПрочихРасходов = "
	|ВЫБРАТЬ // Списание прочих расходов (Дт <разные> :: Дт <25, 26, 44, 20, 23>)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	ВЫБОР КОГДА РАЗНОСТЬДАТ(Строки.ДатаОтражения, Операция.Дата, ДЕНЬ) = 0
	|				ИЛИ Строки.ДатаОтражения = ДАТАВРЕМЯ(1, 1, 1) ТОГДА
	|		Операция.Дата
	|	ИНАЧЕ
	|		Строки.ДатаОтражения
	|	КОНЕЦ КАК Период,
	|	Операция.Организация КАК Организация,
	|	Строки.НомерСтроки КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетДт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаКт,
	|	Строки.Подразделение КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетКт,
	|	
	|	Строки.СтатьяРасходов КАК СубконтоКт1, 
	|	Строки.АналитикаРасходов КАК СубконтоКт2, 
	|	ВЫБОР 
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Текущий)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Преференции)
	|	КОНЕЦ КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	(Строки.СуммаРегл - Строки.ПостояннаяРазница - Строки.ВременнаяРазница) КАК СуммаНУКт,
	|	Строки.ПостояннаяРазница КАК СуммаПРКт,
	|	Строки.ВременнаяРазница КАК СуммаВРКт,
	|	""Списание прочих расходов"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПрочиеДоходыРасходы КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПрочиеДоходыРасходы.ПрочиеРасходы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И (СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности)
	|			ИЛИ СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты))
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции))
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|ГДЕ
	|	Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеПрочихРасходов)
	|	И (Строки.СуммаРегл <> 0 ИЛИ Строки.ВременнаяРазница <> 0 ИЛИ Строки.ПостояннаяРазница <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Списание прочих расходов (Дт <разные> :: Дт <25, 26, 44, 20, 23>)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	ВЫБОР КОГДА РАЗНОСТЬДАТ(Строки.ДатаОтражения, Операция.Дата, ДЕНЬ) = 0
	|				ИЛИ Строки.ДатаОтражения = ДАТАВРЕМЯ(1, 1, 1) ТОГДА
	|		Операция.Дата
	|	ИНАЧЕ
	|		Строки.ДатаОтражения
	|	КОНЕЦ КАК Период,
	|	Операция.Организация КАК Организация,
	|	Строки.НомерСтроки КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетДт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаКт,
	|	Строки.Подразделение КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетКт,
	|	
	|	Строки.СтатьяРасходов КАК СубконтоКт1, 
	|	Строки.АналитикаРасходов КАК СубконтоКт2, 
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Капитальный) КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	(Строки.СуммаРегл - Строки.ПостояннаяРазница - Строки.ВременнаяРазница) КАК СуммаНУКт,
	|	Строки.ПостояннаяРазница КАК СуммаПРКт,
	|	Строки.ВременнаяРазница КАК СуммаВРКт,
	|	""Списание прочих расходов"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПрочиеДоходыРасходы КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПрочиеДоходыРасходы.ПрочиеРасходы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств)
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|ГДЕ
	|	Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеПрочихРасходов)
	|	И (Строки.СуммаРегл <> 0 ИЛИ Строки.ВременнаяРазница <> 0 ИЛИ Строки.ПостояннаяРазница <> 0)
	|";
#КонецОбласти

#Область СторнированиеПрочихРасходов
	ТекстСторнированиеПрочихРасходов = "
	|ВЫБРАТЬ // Прочие расходы (сторно) (Дт <25, 26, 44, 20, 23> :: Кт <разные>)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	ВЫБОР КОГДА РАЗНОСТЬДАТ(Строки.ДатаОтражения, Операция.Дата, ДЕНЬ) = 0
	|				ИЛИ Строки.ДатаОтражения = ДАТАВРЕМЯ(1, 1, 1) ТОГДА
	|		Операция.Дата
	|	ИНАЧЕ
	|		Строки.ДатаОтражения
	|	КОНЕЦ КАК Период,
	|	Операция.Организация КАК Организация,
	|	Строки.НомерСтроки КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|	Строки.СтатьяРасходов КАК СубконтоДт1, 
	|	Строки.АналитикаРасходов КАК СубконтоДт2, 
	|	ВЫБОР 
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Текущий)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Преференции)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	-(Строки.СуммаРегл - Строки.ПостояннаяРазница - Строки.ВременнаяРазница) КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочих расходы (сторно)"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПрочиеДоходыРасходы КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПрочиеДоходыРасходы.ПрочиеРасходы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СуммыДокументовВВалютеРегл КАК Суммы
	|	ПО
	|		Суммы.Регистратор = Строки.Ссылка
	|		И Суммы.ИдентификаторСтроки = Строки.ИдентификаторСтроки
	|		И Суммы.СуммаБезНДСРегл <> 0
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И (СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности)
	|			ИЛИ СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты))
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции))
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|ГДЕ
	|	Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторнированиеПрочихРасходов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Прочие расходы (сторно) (Дт <25, 26, 44, 20, 23> :: Кт <разные>)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	ВЫБОР КОГДА РАЗНОСТЬДАТ(Строки.ДатаОтражения, Операция.Дата, ДЕНЬ) = 0
	|				ИЛИ Строки.ДатаОтражения = ДАТАВРЕМЯ(1, 1, 1) ТОГДА
	|		Операция.Дата
	|	ИНАЧЕ
	|		Строки.ДатаОтражения
	|	КОНЕЦ КАК Период,
	|	Операция.Организация КАК Организация,
	|	Строки.НомерСтроки КАК ИдентификаторСтроки,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|	Строки.СтатьяРасходов КАК СубконтоДт1, 
	|	Строки.АналитикаРасходов КАК СубконтоДт2, 
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Капитальный) КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	-(Строки.СуммаРегл - Строки.ПостояннаяРазница - Строки.ВременнаяРазница) КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочих расходы (сторно)"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПрочиеДоходыРасходы КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПрочиеДоходыРасходы.ПрочиеРасходы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СуммыДокументовВВалютеРегл КАК Суммы
	|	ПО
	|		Суммы.Регистратор = Строки.Ссылка
	|		И Суммы.ИдентификаторСтроки = Строки.ИдентификаторСтроки
	|		И Суммы.СуммаБезНДСРегл <> 0
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств)
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|ГДЕ
	|	Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторнированиеПрочихРасходов)
	|
	|";
#КонецОбласти
	
	Возврат ТекстРегистрацияПрочихРасходов
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстСписаниеПрочихРасходов
		+ " ОБЪЕДИНИТЬ ВСЕ " + ТекстСторнированиеПрочихРасходов
		;
	
КонецФункции

Функция ТекстОтраженияРаспределениеРасходовБудущихПериодов()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ // Распределение РБП (Дт <25, 26, 44, 20, 23, 08.3, 20> :: Кт <97.х> )
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР 
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Текущий)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Преференции)
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СуммаРегл - Строки.ПостояннаяРазница - Строки.ВременнаяРазница КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	Операция.СтатьяРасходов КАК АналитикаУчетаКт,
	|	Операция.Подразделение КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Распределение РБП на расходы"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспределениеРасходовБудущихПериодов КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспределениеРасходовБудущихПериодов.РаспределениеРасходов КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И (СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности)
	|			ИЛИ СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты))
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции))
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|ГДЕ
	|	Строки.СуммаРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ // Распределение РБП (Дт <25, 26, 44, 20, 23, 08.3, 20> :: Кт <97.х> )
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Строки.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Капитальный) КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СуммаРегл - Строки.ПостояннаяРазница - Строки.ВременнаяРазница КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	Операция.СтатьяРасходов КАК АналитикаУчетаКт,
	|	Операция.Подразделение КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Распределение РБП на расходы"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспределениеРасходовБудущихПериодов КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РаспределениеРасходовБудущихПериодов.РаспределениеРасходов КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств)
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|ГДЕ
	|	Строки.СуммаРегл <> 0
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстОтраженияРасходныйКассовыйОрдер()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ //// Прочие расходы
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИндентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР 
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Текущий)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Преференции)
	|	КОНЕЦ КАК СубконтоДт3,
	|
	|	0 ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	ЕСТЬNULL(Суммы.СуммаБезНДСРегл + Суммы.СуммаНДСРегл, Строки.Сумма) КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие расходы"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РасходныйКассовыйОрдер КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СуммыДокументовВВалютеРегл КАК Суммы
	|	ПО
	|		Строки.Ссылка = Суммы.Регистратор
	|		И Строки.ИдентификаторСтроки = Суммы.ИдентификаторСтроки
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Константы КАК Константы
	|	ПО
	|		Истина
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И (СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности)
	|			ИЛИ СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты))
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции))
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|ГДЕ
	|	Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств)
	|	И Строки.СтатьяРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ //// Прочие расходы
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИндентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Капитальный) КАК СубконтоДт3,
	|
	|	0 ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	ЕСТЬNULL(Суммы.СуммаБезНДСРегл + Суммы.СуммаНДСРегл, Строки.Сумма) КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие расходы"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РасходныйКассовыйОрдер КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СуммыДокументовВВалютеРегл КАК Суммы
	|	ПО
	|		Строки.Ссылка = Суммы.Регистратор
	|		И Строки.ИдентификаторСтроки = Суммы.ИдентификаторСтроки
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Константы КАК Константы
	|	ПО
	|		Истина
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств)
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|ГДЕ
	|	Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств)
	|	И Строки.СтатьяРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстОтраженияСписаниеБезналичныхДенежныхСредств()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ // Прочие расходы в валюте регл.учета
	|
	|	Операция.Ссылка КАК Ссылка,
	|	ВЫБОР КОГДА НАЧАЛОПЕРИОДА(Операция.Дата) = Операция.ДатаПроведенияБанком ТОГДА
	|		Операция.Дата
	|	ИНАЧЕ
	|		КОНЕЦПЕРИОДА(Операция.ДатаПроведенияБанком, ДЕНЬ)
	|	КОНЕЦ КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИндентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР 
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Текущий)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Преференции)
	|	КОНЕЦ КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	ЕСТЬNULL(Суммы.СуммаБезНДСРегл + Суммы.СуммаНДСРегл, Строки.Сумма) КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие расходы"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.СписаниеБезналичныхДенежныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК Строки
	|	ПО 
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.СуммыДокументовВВалютеРегл КАК Суммы
	|	ПО 
	|		Строки.Ссылка = Суммы.Регистратор
	|		И Строки.ИдентификаторСтроки = Суммы.ИдентификаторСтроки
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Константы КАК Константы
	|	ПО 
	|		ИСТИНА
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И (СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности)
	|			ИЛИ СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты))
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции))
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|ГДЕ 
	|	Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств)
	|	И Операция.ПроведеноБанком
	|	И Строки.СтатьяРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Прочие расходы в валюте регл.учета
	|
	|	Операция.Ссылка КАК Ссылка,
	|	ВЫБОР КОГДА НАЧАЛОПЕРИОДА(Операция.Дата) = Операция.ДатаПроведенияБанком ТОГДА
	|		Операция.Дата
	|	ИНАЧЕ
	|		КОНЕЦПЕРИОДА(Операция.ДатаПроведенияБанком, ДЕНЬ)
	|	КОНЕЦ КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИндентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Капитальный) КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	ЕСТЬNULL(Суммы.СуммаБезНДСРегл + Суммы.СуммаНДСРегл, Строки.Сумма) КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Прочие расходы"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.СписаниеБезналичныхДенежныхСредств КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК Строки
	|	ПО 
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.СуммыДокументовВВалютеРегл КАК Суммы
	|	ПО 
	|		Строки.Ссылка = Суммы.Регистратор
	|		И Строки.ИдентификаторСтроки = Суммы.ИдентификаторСтроки
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Константы КАК Константы
	|	ПО 
	|		ИСТИНА
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств)
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|ГДЕ 
	|	Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств)
	|	И Операция.ПроведеноБанком
	|	И Строки.СтатьяРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов 
	|";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстОтраженияОтражениеЗарплатыВФинансовомУчете()
	
	ТекстЗапроса = "
	// зарплата и взносы на расходы по статьям
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	Операция.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР 
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Текущий)
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств )
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Капитальный)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Преференции)
	|	КОНЕЦ КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	СУММА(Строки.Сумма) КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Начисление заработной платы на расходы"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ОтражениеЗарплатыВФинансовомУчете КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		НачисленнаяЗарплатаИВзносы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности)
	|			, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|			, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы))
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции))
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|ГДЕ
	|	Строки.ВидОперации НЕ В (
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.НачисленоСдельноДоход),
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства),
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы),
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства),
	|		ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы))
	|	И Строки.ВидСчетаДт = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	И Строки.СтатьяРасходов Ссылка ПланВидовХарактеристик.СтатьиРасходов
	|	И СтатьиНаРемонтОС.Ссылка ЕСТЬ НЕ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	Операция.Ссылка,
	|	КОНЕЦПЕРИОДА(Операция.ПериодРегистрации, МЕСЯЦ),
	|	Операция.Организация,
	|	Строки.АналитикаРасходов,
	|	ВЫБОР
	|		КОГДА Строки.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ,
	|	Строки.СчетКт,
	|	Строки.СубконтоКт1,
	|	Строки.СубконтоКт2,
	|	Строки.СтатьяРасходов,
	|	Строки.Подразделение,
	|	Строки.Подразделение,
	|	Строки.СтатьяРасходов,
	|	Строки.Подразделение,
	|	СтатьиНаРемонтОС.ВидРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	// прямые производственные
	|ВЫБРАТЬ
	|	Строки.Регистратор КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Строки.Период, МЕСЯЦ) КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР 
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Текущий)
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств )
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Капитальный)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Преференции)
	|	КОНЕЦ КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Сумма(Строки.СуммаРегл) КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО СубконтоКт1,
	|   НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Начисление заработной платы (сдельной)"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ОтражениеЗарплатыВФинансовомУчете КАК Строки
	|	ПО
	|		ДокументыКОтражению.Ссылка = Строки.Регистратор
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		(
	|			ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПустаяСсылка) КАК ТипНалога,				ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда) КАК СчетКт	// (Кт 70)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРСтраховаяЧасть),		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_страх)										// (Кт 69.02.1)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРНакопительнаяЧасть),	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_нак)										// (Кт 69.02.2)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ФСС),						ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФСС)											// (Кт 69.01)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ФФОМС),					ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФФОМС)											// (Кт 69.03.1)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ТФОМС),					ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТФОМС)											// (Кт 69.03.2)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРДополнительныйТарифЛЭ),	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_доп)										// (Кт 69.02.3)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРДополнительныйТарифШахтеры),	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_доп_шахтеры)							// (Кт 69.02.4)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах),	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_доп_ВредныеУсловияТруда)	// (Кт 69.02.5)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах),	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_доп_ТяжелыеУсловияТруда)		// (Кт 69.02.6)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРПоСуммарномуТарифу),	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_ОПС)										// (Кт 69.02.7)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРДоПредельнойВеличины),	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_ОПС)										// (Кт 69.02.7)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРСПревышения),			ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_ОПС_СвышеПредела)							// (Кт 69.02.8)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ФССНС),					ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФСС_НСиПЗ)										// (Кт 69.11)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.СН),						ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СоциальныйНалог)					
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.СО),						ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбязательстваПоСоциальномуСтрахованию)										
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ОППВ),						ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбязательныеПрофессиональныеПенсионныеВзносы)										
	|		) КАК ВтСчета
	|	ПО
	|		Строки.ТипНалога = ВтСчета.ТипНалога
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции))
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|
	|ГДЕ
	|	Строки.ВидРабот <> ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка)
	|	И СтатьиНаРемонтОС.Ссылка ЕСТЬ НЕ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	Строки.Регистратор,
	|	КОНЕЦПЕРИОДА(Строки.Период, МЕСЯЦ),
	|	Строки.Организация,
	|	Строки.Подразделение,
	|	Строки.ВидРабот,
	|	Строки.ГруппаПродукции,
	|	Строки.ВидНачисленияОплатыТруда,
	|	ВтСчета.СчетКт,
	|	Строки.ФизическоеЛицо
	|,  Строки.РегистрацияВНалоговомОргане,
	|	Строки.СтатьяРасходов,
	|	Строки.АналитикаРасходов,
	|	СтатьиНаРемонтОС.ВидРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// на расходы
	|ВЫБРАТЬ
	|	Строки.Регистратор КАК Ссылка,
	|	КОНЕЦПЕРИОДА(Строки.Период, МЕСЯЦ) КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|
	|	Строки.СтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРемонтуОсновныхСредствВНУ) КАК СчетДт,
	|	Строки.СтатьяРасходов КАК СубконтоДт1,
	|	Строки.АналитикаРасходов КАК СубконтоДт2,
	|	ВЫБОР 
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Текущий)
	|		КОГДА СтатьиНаРемонтОС.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств )
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Капитальный)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗатратВА.Преференции)
	|	КОНЕЦ КАК СубконтоДт3,
	|
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Сумма(Строки.СуммаРегл) КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|   НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""Начисление заработной платы (сдельной)"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ОтражениеЗарплатыВФинансовомУчете КАК Строки
	|	ПО
	|		ДокументыКОтражению.Ссылка = Строки.Регистратор
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		(
	|			ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПустаяСсылка) КАК ТипНалога,				ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда) КАК СчетКт	// (Кт 70)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРСтраховаяЧасть),		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_страх)										// (Кт 69.02.1)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРНакопительнаяЧасть),	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_нак)										// (Кт 69.02.2)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ФСС),						ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФСС)											// (Кт 69.01)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ФФОМС),					ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФФОМС)											// (Кт 69.03.1)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ТФОМС),					ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТФОМС)											// (Кт 69.03.2)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРДополнительныйТарифЛЭ),	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_доп)										// (Кт 69.02.3)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРДополнительныйТарифШахтеры),	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_доп_шахтеры)							// (Кт 69.02.4)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах),	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_доп_ВредныеУсловияТруда)	// (Кт 69.02.5)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах),	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_доп_ТяжелыеУсловияТруда)		// (Кт 69.02.6)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРПоСуммарномуТарифу),	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_ОПС)										// (Кт 69.02.7)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРДоПредельнойВеличины),	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_ОПС)										// (Кт 69.02.7)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПФРСПревышения),			ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПФР_ОПС_СвышеПредела)							// (Кт 69.02.8)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ФССНС),					ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФСС_НСиПЗ)										// (Кт 69.11)
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.СН),						ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СоциальныйНалог)					
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.СО),						ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбязательстваПоСоциальномуСтрахованию)										
	|			ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ОППВ),						ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбязательныеПрофессиональныеПенсионныеВзносы)										
	|		) КАК ВтСчета
	|	ПО
	|		Строки.ТипНалога = ВтСчета.ТипНалога
	|	
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиНаРемонтОС
	|	ПО
	|		Строки.СтатьяРасходов = СтатьиНаРемонтОС.Ссылка
	|		И СтатьиНаРемонтОС.ВариантРаспределенияРасходовРегл В ( ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности)
	|			, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|			, ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы))
	|		И СтатьиНаРемонтОС.ПринятиеКналоговомуУчету = ИСТИНА
	|		И СтатьиНаРемонтОС.ВидРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КапитальныйРемонтОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Преференции))
	|		И СтатьиНаРемонтОС.РасходыНаОбъектыЭксплуатации = ИСТИНА
	|ГДЕ
	|	Не Строки.СтатьяРасходов Ссылка ПланВидовХарактеристик.СтатьиАктивовПассивов
	|	И Строки.ВидРабот = ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка)
	|	И СтатьиНаРемонтОС.Ссылка ЕСТЬ НЕ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	Строки.Регистратор,
	|	КОНЕЦПЕРИОДА(Строки.Период, МЕСЯЦ),
	|	Строки.Организация,
	|	ВтСчета.СчетКт,
	|	ВЫБОР
	|		КОГДА ВтСчета.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|			ТОГДА Строки.ФизическоеЛицо
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВтСчета.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)
	|			ТОГДА Строки.ВидНачисленияОплатыТруда
    |		КОГДА ВтСчета.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбязательныеПрофессиональныеПенсионныеВзносы)
    |				ИЛИ ВтСчета.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбязательстваПоСоциальномуСтрахованию)
    |			ТОГДА Строки.ФизическоеЛицо
	|       КОГДА ВтСчета.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СоциальныйНалог)
	|			ТОГДА Строки.РегистрацияВНалоговомОргане
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	Строки.Подразделение,
	|	Строки.СтатьяРасходов,
	|	Строки.АналитикаРасходов,
	|	СтатьиНаРемонтОС.ВидРасходов
	|";
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#Область ЗакрытиеЗабалансовогоСчетаРемонтыВНУ

Функция ТаблицаЗакрытие()
	
	ОписаниеТипаЧисла15_2 = ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15, 2);
	ОписаниеТипаЧисла15_3 = ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15, 3);
	ОписаниеТипаСчетХозр  = Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный");
	
	ТаблицаЗакрытие = Новый ТаблицаЗначений;
	ТаблицаЗакрытие.Колонки.Добавить("СчетДт",        ОписаниеТипаСчетХозр);
	ТаблицаЗакрытие.Колонки.Добавить("СчетКт",        ОписаниеТипаСчетХозр);
	ТаблицаЗакрытие.Колонки.Добавить("Подразделение", 			Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	ТаблицаЗакрытие.Колонки.Добавить("НаправлениеДеятельности", Новый ОписаниеТипов("СправочникСсылка.НаправленияДеятельности"));
	ТаблицаЗакрытие.Колонки.Добавить("СубконтоДт1");
	ТаблицаЗакрытие.Колонки.Добавить("СубконтоКт1");
	ТаблицаЗакрытие.Колонки.Добавить("СуммаУУ",       ОписаниеТипаЧисла15_2);
	ТаблицаЗакрытие.Колонки.Добавить("Сумма",         ОписаниеТипаЧисла15_2);
	ТаблицаЗакрытие.Колонки.Добавить("СуммаФО",       ОписаниеТипаЧисла15_2);
	ТаблицаЗакрытие.Колонки.Добавить("СуммаНУ",       ОписаниеТипаЧисла15_2);
	ТаблицаЗакрытие.Колонки.Добавить("СуммаПР",       ОписаниеТипаЧисла15_2);
	ТаблицаЗакрытие.Колонки.Добавить("СуммаВР",       ОписаниеТипаЧисла15_2);
	ТаблицаЗакрытие.Колонки.Добавить("КоличествоДт",  ОписаниеТипаЧисла15_3);
	ТаблицаЗакрытие.Колонки.Добавить("КоличествоКт",  ОписаниеТипаЧисла15_3);
	ТаблицаЗакрытие.Колонки.Добавить("Содержание",    ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповСтроки(150));
	
	Возврат ТаблицаЗакрытие;
	
КонецФункции

Функция ПодготовитьПараметрыЗакрытиеРемонтыВНУ(ТаблицаЗакрытие, ТаблицаРеквизиты)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы Параметры.ТаблицаЗакрытие
	СписокОбязательныхКолонок = ""
	+ "СчетДт,"        // <ПланСчетовСсылка.Хозрасчетный>
	+ "СчетКт,"        // <ПланСчетовСсылка.Хозрасчетный>
	+ "Подразделение," // <Ссылка на справочник подразделений>
	+ "НаправлениеДеятельности," // <Ссылка на справочник подразделений>
	+ "СубконтоДт1,"
	+ "СубконтоКт1,"
	+ "СуммаУУ,"       // <Число, 15, 2>
	+ "СуммаФО,"       // <Число, 15, 2>
	+ "Сумма,"         // <Число, 15, 2>
	+ "СуммаНУ,"       // <Число, 15, 2>
	+ "СуммаПР,"       // <Число, 15, 2>
	+ "СуммаВР,"       // <Число, 15, 2>
	+ "КоличествоДт,"  // <Число, 15, 3>
	+ "КоличествоКт,"  // <Число, 15, 3>
	+ "Содержание"     // <Строка, 150>
	;
	
	ТаблицаПараметров = ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаЗакрытие,
		СписокОбязательныхКолонок);
	Параметры.Вставить("ТаблицаЗакрытие", ТаблицаПараметров);
	
	// Подготовка таблицы Параметры.Реквизиты
	СписокОбязательныхКолонок = ""
	+ "Период,"                  // <Дата>
	+ "НачалоГода,"              // <Дата>
	+ "НачДата,"                 // <Дата>
	+ "КонДата,"                 // <Дата>
	+ "Организация,"             // <СправочникСсылка.Организации>
	+ "Регистратор,"             // <ДокументСсылка.*>
	+ "СодержаниеЗакрытиеГода"   // <Строка, 150>
	;
	
	ТаблицаПараметров = ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаРеквизиты,
		СписокОбязательныхКолонок);
	Параметры.Вставить("Реквизиты", ТаблицаПараметров);
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#Область РасчетАмортизации_ФАНУ

Функция ПодготовитьПараметрыПроведенияРасчетВычетовФАНУ(СтруктураШапки, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;

	Содержание  = НСтр("ru = 'Начислена амортизация фиксированных активов в НУ'");
	
	ПараметрыУчетнойПолитики = ПараметрыУчетнойПолитикиПоВычетамФА(СтруктураШапки.Организация, СтруктураШапки.Дата);
	
	Период  = НачалоГода(СтруктураШапки.Дата);
	ИспользуетсяУправлениеВНА_2_4 = ВнеоборотныеАктивы.ИспользуетсяУправлениеВНА_2_4(Период);
	
	Если ПараметрыУчетнойПолитики = Неопределено Тогда
		СписыватьСтоимостныйБалансПриВыбытииВсехФАГруппы = Ложь;
		РассчитыватьДоходОтПревышенияСтоимостиВыбывшихФА = Ложь;
		СписыватьСтоимостныйБалансГруппыМенееМинимума = Ложь;
		АмортизацияФАНУ = Ложь;
	Иначе
		СписыватьСтоимостныйБалансПриВыбытииВсехФАГруппы = ПараметрыУчетнойПолитики.СписыватьСтоимостныйБалансПриВыбытииВсехФАГруппы;
		РассчитыватьДоходОтПревышенияСтоимостиВыбывшихФА = ПараметрыУчетнойПолитики.РассчитыватьДоходОтПревышенияСтоимостиВыбывшихФА;
		СписыватьСтоимостныйБалансГруппыМенееМинимума = ПараметрыУчетнойПолитики.СписыватьСтоимостныйБалансГруппыМенееМинимума;
		АмортизацияФАНУ = ПараметрыУчетнойПолитики.АмортизацияФАНУ;
	КонецЕсли;	
	
	
	Запрос = Новый Запрос;
		
	Запрос.УстановитьПараметр("Ссылка", СтруктураШапки.Ссылка);
	Запрос.УстановитьПараметр("Содержание", Содержание);
	Запрос.УстановитьПараметр("СписыватьСтоимостныйБалансПриВыбытииВсехФАГруппы", СписыватьСтоимостныйБалансПриВыбытииВсехФАГруппы);
	Запрос.УстановитьПараметр("СписыватьСтоимостныйБалансГруппыМенееМинимума", СписыватьСтоимостныйБалансГруппыМенееМинимума);
	Запрос.УстановитьПараметр("РассчитыватьДоходОтПревышенияСтоимостиВыбывшихФА", РассчитыватьДоходОтПревышенияСтоимостиВыбывшихФА);
	Запрос.УстановитьПараметр("АмортизацияФАНУ", АмортизацияФАНУ);
	Запрос.УстановитьПараметр("ИспользуетсяУправлениеВНА_2_4", ИспользуетсяУправлениеВНА_2_4);
	
	ПоддержкаПБУ18  = УчетнаяПолитика.ПоддержкаПБУ18(СтруктураШапки.Организация, СтруктураШапки.Дата);
	Запрос.УстановитьПараметр("ПоддержкаПБУ18", ПоддержкаПБУ18);
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаРасчетАмортизацииФАНУ(НомераТаблиц);
	Результат = Запрос.ВыполнитьПакет();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
	
КонецФункции

Функция ТекстЗапросаРасчетАмортизацииФАНУ(НомераТаблиц)

	НомераТаблиц.Вставить("ТаблицаРеквизиты", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РегламентнаяОперация.Ссылка КАК Регистратор,
	|	РегламентнаяОперация.Организация КАК Организация,
	|	РегламентнаяОперация.Дата КАК Период,
	|	&СписыватьСтоимостныйБалансПриВыбытииВсехФАГруппы КАК СписыватьСтоимостныйБалансПриВыбытииВсехФАГруппы,
	|	&СписыватьСтоимостныйБалансГруппыМенееМинимума КАК СписыватьСтоимостныйБалансГруппыМенееМинимума,
	|	&РассчитыватьДоходОтПревышенияСтоимостиВыбывшихФА КАК РассчитыватьДоходОтПревышенияСтоимостиВыбывшихФА,
	|	&АмортизацияФАНУ КАК АмортизацияФАНУ,
	|	&ПоддержкаПБУ18 КАК ПоддержкаПБУ18,
	|   &ИспользуетсяУправлениеВНА_2_4 КАК ИспользуетсяУправлениеВНА_2_4
	|ИЗ
	|	Документ.РегламентнаяОперация КАК РегламентнаяОперация
	|ГДЕ
	|	РегламентнаяОперация.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();

КонецФункции

Функция ПроверитьАктуальностьРасчетаСтоимостиВНА(Реквизиты)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Задания.Организация,
	|	МИНИМУМ(НАЧАЛОПЕРИОДА(Задания.Месяц, МЕСЯЦ)) КАК Месяц
	|ИЗ
	|	РегистрСведений.ЗаданияКРасчетуСтоимостиВНА КАК Задания
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(Задания.Месяц, МЕСЯЦ) <= &Период
	|	И Задания.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	Задания.Организация";
	
	Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
	Запрос.УстановитьПараметр("Период", Реквизиты.Период);
	Результат = Запрос.Выполнить();
	
	СтоимостьВНААктуальна = Истина;
	Если Не Результат.Пустой() Тогда
		СтоимостьВНААктуальна = Ложь;
	КонецЕсли;
	
	Возврат СтоимостьВНААктуальна;
	
КонецФункции

Функция ПодготовитьТаблицыРасчетВычетовФАНУ(ТаблицаРеквизиты, СписокОрганизаций, Отказ) Экспорт
	
	РасчетВычетовПоФА = ПолучитьТаблицаРасчетВычетовПоФА();
	
	СтруктураТаблиц = Новый Структура();
	СтруктураТаблиц.Вставить("ТаблицаРасходыПоАмортизацииНУ");
	
	Параметры = ПодготовитьПараметрыРасчетАмортизацииНУ(РасчетВычетовПоФА, ТаблицаРеквизиты);
	Если Параметры.Реквизиты.Количество() = 0 Тогда
		Возврат СтруктураТаблиц;
	КонецЕсли;
	
	Реквизиты = Параметры.Реквизиты[0];
	
	Если Реквизиты.ИспользуетсяУправлениеВНА_2_4 Тогда
		СтоимостьВНААктуальна = ПроверитьАктуальностьРасчетаСтоимостиВНА(Реквизиты);
		
		Если НЕ СтоимостьВНААктуальна Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не выполнена регламентная операция по расчету стоимости ОС и НМА'"),
					Реквизиты.Регистратор.ПолучитьОбъект(),
					"",
					,
					Отказ);
		КонецЕсли;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	МассивРезультатов = РассчитатьВычетыФАНУ(Реквизиты, СписокОрганизаций, МенеджерВременныхТаблиц);
	
	СтруктураТаблиц.Вставить("ТаблицаДоходы", 				 МассивРезультатов[0].Выгрузить());
	СтруктураТаблиц.Вставить("ТаблицаСписаниеПриВыбытии", 	 МассивРезультатов[1].Выгрузить());
	СтруктураТаблиц.Вставить("ТаблицаСписаниеМенееМинимума", МассивРезультатов[2].Выгрузить());
	
	ТаблицаАмортизацииПрямая = Новый ТаблицаЗначений;
	ТаблицаАмортизацииКРаспределению = Новый ДеревоЗначений;
	
	Если Реквизиты.АмортизацияФАНУ Тогда
		МассивРезультатов = ПодготовитьТаблицуАмортизацииФАНУ(Реквизиты, МенеджерВременныхТаблиц);
		
		ТаблицаАмортизацииКРаспределению = МассивРезультатов[0].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		ТаблицаАмортизацииПрямая = МассивРезультатов[1].Выгрузить();
	КонецЕсли;	
	
	ТаблицаЗатрат = ПолучитьТаблицаРасчетВычетовПоФА();
	
	Для Каждого СтрокаАмортизации Из ТаблицаАмортизацииПрямая Цикл 
		СтрокаЗатрат = ТаблицаЗатрат.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗатрат, СтрокаАмортизации);
		СтрокаЗатрат.Сумма = СтрокаАмортизации.РасчетнаяАмортизацияФА; 
	КонецЦикла;	
	
	ТаблицаРаспределения = РаспределитьРасходыПоАмортизации(ТаблицаЗатрат, ТаблицаАмортизацииКРаспределению);
	
	СтруктураТаблиц.Вставить("ТаблицаРасчетАмортизацииНУ", ТаблицаЗатрат);
	
	Возврат СтруктураТаблиц;
	
КонецФункции

Функция ПодготовитьПараметрыРасчетАмортизацииНУ(ТаблицаПроводок, ТаблицаРеквизиты)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы Параметры.Реквизиты
	
	СписокОбязательныхКолонок = ""
	+ "Период,"												// <Дата>
	+ "Организация,"										// <СправочникСсылка.Организации>
	+ "Регистратор,"										// <ДокументСсылка.*>
	+ "СписыватьСтоимостныйБалансПриВыбытииВсехФАГруппы,"	// <Булево>
	+ "СписыватьСтоимостныйБалансГруппыМенееМинимума,"		// <Булево>
	+ "РассчитыватьДоходОтПревышенияСтоимостиВыбывшихФА,"	// <Булево>
	+ "АмортизацияФАНУ,"									// <Булево>
	+ "ИспользуетсяУправлениеВНА_2_4";    					// <Булево>
	
	Параметры.Вставить("Реквизиты", 
		ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(ТаблицаРеквизиты, СписокОбязательныхКолонок));
	
	Возврат Параметры;
	
КонецФункции

Функция РассчитатьВычетыФАНУ(Реквизиты, СписокОрганизаций, МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НачДата",           				Новый Граница (НачалоГода(Реквизиты.Период),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонДата",           				Новый Граница (КонецГода(Реквизиты.Период),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", 	  				Реквизиты.Организация);
	Запрос.УстановитьПараметр("СписокОрганизаций", 				СписокОрганизаций);
	Запрос.УстановитьПараметр("СписыватьГруппыМенееМинимума", 	Реквизиты.СписыватьСтоимостныйБалансГруппыМенееМинимума);
	Запрос.УстановитьПараметр("НачислятьАмортизацию", 			Реквизиты.АмортизацияФАНУ);
	
	Запрос.Текст = "
	|ВЫБРАТЬ 
	|	МесячныйРасчетныйПоказатель.Размер КАК МРП
	|ИЗ
	|	РегистрСведений.МесячныйРасчетныйПоказатель.СрезПоследних(&КонДата) КАК МесячныйРасчетныйПоказатель
	|";
	
	Результат = Запрос.Выполнить(); 
	Если Не Результат.Пустой() Тогда
		Таблица = Результат.Выгрузить();
		СтавкаМРП = Таблица[0].МРП;
	Иначе
		СтавкаМРП = 0;
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("СтавкаМРП", СтавкаМРП);
	
	ИспользуетсяУправлениеВНА_2_4 = Реквизиты.ИспользуетсяУправлениеВНА_2_4;
	
	Запрос.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыНалоговогоУчетаФА.Организация КАК Организация,
	|	ОбъектыНалоговогоУчетаФА.ФиксированныйАктив КАК ФиксированныйАктив,
	|	ОбъектыНалоговогоУчетаФА.СостояниеФиксированногоАктива КАК СостояниеФиксированногоАктива,
	|	ИСТИНА КАК ВходитВСтоимостныйБалансГруппы
	|ПОМЕСТИТЬ ВТ_СписокОбъектов
	|ИЗ
	|	РегистрСведений.ОбъектыНалоговогоУчетаФА.СрезПоследних(&КонДата, Организация В (&СписокОрганизаций)) КАК ОбъектыНалоговогоУчетаФА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ФиксированныеАктивыУчитываемыеОтдельно.Организация,
	|	ФиксированныеАктивыУчитываемыеОтдельно.ФиксированныйАктив,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.ПринятКУчету),
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.ФиксированныеАктивыУчитываемыеОтдельно.СрезПоследних(
	|			&КонДата,
	|			Организация В (&СписокОрганизаций)
	|				) КАК ФиксированныеАктивыУчитываемыеОтдельно
	|ГДЕ ФиксированныеАктивыУчитываемыеОтдельно.Событие <> ЗНАЧЕНИЕ(Перечисление.СобытияФАУчитываемыхОтдельно.ВключениеВСоставГруппы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПервоначальныеСведенияОСНУ.ОсновноеСредство КАК ОбъектУчета,
	|	ПервоначальныеСведенияОСНУ."+?(ИспользуетсяУправлениеВНА_2_4, "ПорядокУчетаНУ", "ПорядокВключенияСтоимостиВСоставРасходов")+" КАК ПорядокПогашенияСтоимостиНУ,
	|	ПервоначальныеСведенияОСНУ.АмортизационнаяГруппа КАК ГруппаФА
	|ПОМЕСТИТЬ ВТ_ПервоначальныеСведенияОбъектов
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОС"+?(ИспользуетсяУправлениеВНА_2_4, "", "НалоговыйУчет")+".СрезПоследних(
	|			&КонДата,
	|			ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					СписокОбъектов.ФиксированныйАктив
	|				ИЗ
	|					ВТ_СписокОбъектов КАК СписокОбъектов)) КАК ПервоначальныеСведенияОСНУ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПервоначальныеСведенияНМАНУ.НематериальныйАктив,
	|	ПервоначальныеСведенияНМАНУ."+?(ИспользуетсяУправлениеВНА_2_4, "ПорядокУчетаНУ", "ПорядокВключенияСтоимостиВСоставРасходов")+",
	|	ПервоначальныеСведенияНМАНУ.АмортизационнаяГруппа
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияНМА"+?(ИспользуетсяУправлениеВНА_2_4, "", "НалоговыйУчет")+".СрезПоследних(
	|			&КонДата,
	|			НематериальныйАктив В
	|				(ВЫБРАТЬ
	|					СписокОбъектов.ФиксированныйАктив
	|				ИЗ
	|					ВТ_СписокОбъектов КАК СписокОбъектов)) КАК ПервоначальныеСведенияНМАНУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокОбъектов.Организация КАК Организация,
	|	СписокОбъектов.ФиксированныйАктив КАК ФиксированныйАктив,
	|	СписокОбъектов.СостояниеФиксированногоАктива КАК СостояниеФиксированногоАктива,
	|	СписокОбъектов.ВходитВСтоимостныйБалансГруппы КАК ВходитВСтоимостныйБалансГруппы,
	|	ПервоначальныеСведения.ПорядокПогашенияСтоимостиНУ КАК ПорядокПогашенияСтоимостиНУ,
	|	ПервоначальныеСведения.ГруппаФА КАК ГруппаФА,
	|	ВЫБОР
	|		КОГДА ПервоначальныеСведения.ГруппаФА = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПерваяГруппа)
	|			ТОГДА СписокОбъектов.ФиксированныйАктив
	|		ИНАЧЕ ПервоначальныеСведения.ГруппаФА	
	|	КОНЕЦ КАК ГруппаУчетаФА
	|ПОМЕСТИТЬ ВТ_ОбъектыНалоговогоУчетаФА
	|ИЗ
	|	ВТ_СписокОбъектов КАК СписокОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПервоначальныеСведенияОбъектов КАК ПервоначальныеСведения
	|		ПО СписокОбъектов.ФиксированныйАктив = ПервоначальныеСведения.ОбъектУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаУчетаОС.Организация КАК Организация,
	|	СчетаУчетаОС.ОсновноеСредство КАК ОбъектУчета,
	|	ВЫБОР
	|		КОГДА СчетаУчетаОС.ГруппаФинансовогоУчета = ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаВнеоборотныхАктивов.ПустаяСсылка)
	|			ТОГДА СчетаУчетаОС.СчетУчета
	|		ИНАЧЕ СчетаУчетаОС.ГруппаФинансовогоУчета.СчетУчета
	|	КОНЕЦ КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА СчетаУчетаОС.ГруппаФинансовогоУчета = ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаВнеоборотныхАктивов.ПустаяСсылка)
	|			ТОГДА СчетаУчетаОС.СчетНачисленияАмортизации
	|		ИНАЧЕ СчетаУчетаОС.ГруппаФинансовогоУчета.СчетУчетаАмортизации
	|	КОНЕЦ КАК СчетНачисленияАмортизации
	|ПОМЕСТИТЬ ВТ_СчетаУчетаОСИНМА
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|			&КонДата,
	|			(ОсновноеСредство, Организация) В
	|				(ВЫБРАТЬ
	|					ВЫРАЗИТЬ(ВТ_ОбъектыНалоговогоУчетаФА.ФиксированныйАктив КАК Справочник.ОбъектыЭксплуатации),
	|					ВТ_ОбъектыНалоговогоУчетаФА.Организация
	|				ИЗ
	|					ВТ_ОбъектыНалоговогоУчетаФА)) КАК СчетаУчетаОС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетаУчетаНМА.Организация КАК Организация,
	|	СчетаУчетаНМА.НематериальныйАктив КАК ОбъектУчета,
	|	СчетаУчетаНМА."+?(ИспользуетсяУправлениеВНА_2_4, "ГруппаФинансовогоУчета.СчетУчета", "СчетУчета")+",
	|	СчетаУчетаНМА."+?(ИспользуетсяУправлениеВНА_2_4, "ГруппаФинансовогоУчета.СчетУчетаАмортизации", "СчетНачисленияАмортизации")+"
	|ИЗ
	|	РегистрСведений."+?(ИспользуетсяУправлениеВНА_2_4, "ПорядокУчетаНМА", "СчетаБухгалтерскогоУчетаНМА")+".СрезПоследних(
	|			&КонДата,
	|			(НематериальныйАктив, Организация) В
	|				(ВЫБРАТЬ
	|					ВЫРАЗИТЬ(ВТ_ОбъектыНалоговогоУчетаФА.ФиксированныйАктив КАК Справочник.НематериальныеАктивы),
	|					ВТ_ОбъектыНалоговогоУчетаФА.Организация
	|				ИЗ
	|					ВТ_ОбъектыНалоговогоУчетаФА)) КАК СчетаУчетаНМА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетаОСиНМА.Организация КАК Организация,
	|	СчетаОСиНМА.ОбъектУчета КАК ОбъектУчета,
	|	СчетаОСиНМА.СчетУчета,
	|	СчетаОСиНМА.СчетНачисленияАмортизации
	|ПОМЕСТИТЬ ВТ_СчетаУчетаАктивов
	|ИЗ
	|	ВТ_СчетаУчетаОСИНМА КАК СчетаОСиНМА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ОбъектыНалоговогоУчетаФА.ФиксированныйАктив = СведенияОГруппахФА.ФиксированныйАктив
	|				И СведенияОГруппахФА.Организация = ОбъектыНалоговогоУчетаФА.Организация
	|			ТОГДА 1
	|		КОГДА ОбъектыНалоговогоУчетаФА.ФиксированныйАктив = СведенияОГруппахФА.ФиксированныйАктив
	|				И СведенияОГруппахФА.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА 2
	|		КОГДА СведенияОГруппахФА.Организация = ОбъектыНалоговогоУчетаФА.Организация
	|			ТОГДА 3
	|		КОГДА СведенияОГруппахФА.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА 4
	|		ИНАЧЕ 5
	|	КОНЕЦ КАК Приоритет,
	|	ВЫБОР
	|		КОГДА СчетаУчетаФА.СчетУчета В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПустаяСсылка)
	|		ИНАЧЕ
	|			ОбъектыНалоговогоУчетаФА.ГруппаФА
	|	КОНЕЦ КАК ГруппаФА,
	|	ВЫБОР
	|		КОГДА СчетаУчетаФА.СчетУчета В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПустаяСсылка)
	|		ИНАЧЕ
	|			ОбъектыНалоговогоУчетаФА.ГруппаУчетаФА
	|	КОНЕЦ КАК ГруппаУчетаФА,
	|	ОбъектыНалоговогоУчетаФА.Организация КАК Организация,
	|	ОбъектыНалоговогоУчетаФА.ФиксированныйАктив КАК ФиксированныйАктив,
	|	ОбъектыНалоговогоУчетаФА.СостояниеФиксированногоАктива КАК СостояниеФиксированногоАктива,
	|	ВЫБОР
	|		КОГДА СчетаУчетаФА.СчетУчета В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ
	|			ОбъектыНалоговогоУчетаФА.ВходитВСтоимостныйБалансГруппы
	|	КОНЕЦ КАК ВходитВСтоимостныйБалансГруппы,
	|	ВЫБОР
	|		КОГДА НЕ ОбъектыНалоговогоУчетаФА.ВходитВСтоимостныйБалансГруппы
	|				И ОбъектыНалоговогоУчетаФА.ПорядокПогашенияСтоимостиНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизацииПоДвойнойНорме)
	|			ТОГДА СведенияОГруппахФА.ПрименяемаяНормаАмортизации * 2
	|		КОГДА НЕ ОбъектыНалоговогоУчетаФА.ВходитВСтоимостныйБалансГруппы ИЛИ СчетаУчетаФА.СчетУчета В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи))
	|			ТОГДА 0
	|		ИНАЧЕ СведенияОГруппахФА.ПрименяемаяНормаАмортизации
	|	КОНЕЦ КАК ПрименяемаяНормаАмортизации
	|ПОМЕСТИТЬ ВТ_СведенияОГруппахФА
	|ИЗ
	|	ВТ_ОбъектыНалоговогоУчетаФА КАК ОбъектыНалоговогоУчетаФА
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОГруппахФиксированныхАктивов.СрезПоследних(&КонДата, ) КАК СведенияОГруппахФА
	|		ПО (ОбъектыНалоговогоУчетаФА.Организация = СведенияОГруппахФА.Организация
	|				ИЛИ СведенияОГруппахФА.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|			И (ОбъектыНалоговогоУчетаФА.ГруппаФА = СведенияОГруппахФА.АмортизационнаяГруппа
	|					И СведенияОГруппахФА.ФиксированныйАктив = НЕОПРЕДЕЛЕНО
	|				ИЛИ СведенияОГруппахФА.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПерваяГруппа)
	|					И ОбъектыНалоговогоУчетаФА.ФиксированныйАктив = СведенияОГруппахФА.ФиксированныйАктив)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаУчетаАктивов КАК СчетаУчетаФА
	|			ПО ОбъектыНалоговогоУчетаФА.Организация = СчетаУчетаФА.Организация
	|				И ОбъектыНалоговогоУчетаФА.ФиксированныйАктив = СчетаУчетаФА.ОбъектУчета
	|ГДЕ
	|	НЕ ОбъектыНалоговогоУчетаФА.ГруппаФА = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГруппыФА.ГруппаФА КАК ГруппаФА,
	|	ГруппыФА.ГруппаУчетаФА КАК ГруппаУчетаФА,
	|	ГруппыФА.Организация КАК Организация,
	|	ГруппыФА.ФиксированныйАктив КАК ФиксированныйАктив,
	|	МИНИМУМ(ГруппыФА.Приоритет) КАК Приоритет,
	|	ГруппыФА.СостояниеФиксированногоАктива КАК СостояниеФиксированногоАктива
	|ПОМЕСТИТЬ ВТ_ГруппыФАПромежуточный
	|ИЗ
	|	ВТ_СведенияОГруппахФА КАК ГруппыФА
	|
	|СГРУППИРОВАТЬ ПО
	|	ГруппыФА.ФиксированныйАктив,
	|	ГруппыФА.Организация,
	|	ГруппыФА.ГруппаФА,
	|	ГруппыФА.ГруппаУчетаФА,
	|	ГруппыФА.СостояниеФиксированногоАктива
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГруппыФА.ГруппаФА КАК ГруппаФА,
	|	ГруппыФА.ГруппаУчетаФА КАК ГруппаУчетаФА,
	|	ГруппыФА.Организация КАК Организация,
	|	ГруппыФА.ФиксированныйАктив КАК ФиксированныйАктив,
	|	ГруппыФА.СостояниеФиксированногоАктива КАК СостояниеФиксированногоАктива,
	|	СведенияОГруппахФА.ПрименяемаяНормаАмортизации КАК ПрименяемаяНормаАмортизации,
	|	СведенияОГруппахФА.ВходитВСтоимостныйБалансГруппы КАК ВходитВСтоимостныйБалансГруппы
	|ПОМЕСТИТЬ ВТ_ГруппыФА
	|ИЗ
	|	ВТ_ГруппыФАПромежуточный КАК ГруппыФА
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СведенияОГруппахФА КАК СведенияОГруппахФА
	|		ПО ГруппыФА.Организация = СведенияОГруппахФА.Организация
	|			И ГруппыФА.ФиксированныйАктив = СведенияОГруппахФА.ФиксированныйАктив
	|			И ГруппыФА.Приоритет = СведенияОГруппахФА.Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаУчетаАктивов.Организация КАК Организация,
	|	СчетаУчетаАктивов.ОбъектУчета КАК ФиксированныйАктив,
	|	СтоимостьВА_НУ.Подразделение КАК Подразделение,
	|	СчетаУчетаАктивов.СчетУчета КАК Счет,
	|	СУММА(ВЫБОР
	|		КОГДА СтоимостьВА_НУ.Субконто2 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	|			ТОГДА ВЫБОР
	|					КОГДА СтоимостьВА_НУ.Субконто2.ВидДвиженияСтоимостиНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Поступление), ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.УвеличениеСтоимостиЗаСчетРемонта))
	|						ТОГДА СтоимостьВА_НУ.СуммаНУОборотДт - СтоимостьВА_НУ.СуммаНУОборотКт
	|					КОГДА (СтоимостьВА_НУ.Субконто2.ВидДвиженияСтоимостиНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Перемещение)) И СчетаУчетаАктивов.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи))
	|						ТОГДА СтоимостьВА_НУ.СуммаНУОборотДт
	|				КОНЕЦ
	|		КОГДА СтоимостьВА_НУ.Субконто3 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	|			ТОГДА ВЫБОР
	|					КОГДА СтоимостьВА_НУ.Субконто3.ВидДвиженияСтоимостиНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Поступление), ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.УвеличениеСтоимостиЗаСчетРемонта))
	|						ТОГДА СтоимостьВА_НУ.СуммаНУОборотДт - СтоимостьВА_НУ.СуммаНУОборотКт
	|					КОГДА (СтоимостьВА_НУ.Субконто3.ВидДвиженияСтоимостиНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Перемещение)) И СчетаУчетаАктивов.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи))
	|						ТОГДА СтоимостьВА_НУ.СуммаНУОборотДт
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Поступление,
	|	СУММА(ВЫБОР
	|		КОГДА СтоимостьВА_НУ.Субконто2 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	|			ТОГДА ВЫБОР
	|					КОГДА СтоимостьВА_НУ.Субконто2.ВидДвиженияСтоимостиНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Выбытие))
	|						ИЛИ (СтоимостьВА_НУ.Субконто2.ВидДвиженияСтоимостиНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Перемещение)) И НЕ СчетаУчетаАктивов.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи))
	|						ТОГДА СтоимостьВА_НУ.СуммаНУОборотКт - СтоимостьВА_НУ.СуммаНУОборотДт
	|					КОГДА (СтоимостьВА_НУ.Субконто2.ВидДвиженияСтоимостиНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Перемещение)) И СчетаУчетаАктивов.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи))
	|						ТОГДА СтоимостьВА_НУ.СуммаНУОборотКт
	|				КОНЕЦ
	|		КОГДА СтоимостьВА_НУ.Субконто3 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	|			ТОГДА ВЫБОР
	|					КОГДА СтоимостьВА_НУ.Субконто3.ВидДвиженияСтоимостиНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Выбытие))
	|						ИЛИ (СтоимостьВА_НУ.Субконто3.ВидДвиженияСтоимостиНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Перемещение)) И НЕ СчетаУчетаАктивов.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи))
	|						ТОГДА СтоимостьВА_НУ.СуммаНУОборотКт - СтоимостьВА_НУ.СуммаНУОборотДт
	|					КОГДА СтоимостьВА_НУ.Субконто3.ВидДвиженияСтоимостиНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Выбытие))
	|						ИЛИ (СтоимостьВА_НУ.Субконто3.ВидДвиженияСтоимостиНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Перемещение)) И СчетаУчетаАктивов.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи))
	|						ТОГДА СтоимостьВА_НУ.СуммаНУОборотКт
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Выбытие,	
	|	МАКСИМУМ(СтоимостьВА_НУ.СуммаНУНачальныйОстатокДт) КАК НачальныйОстаток,
	|	МАКСИМУМ(СтоимостьВА_НУ.СуммаНУКонечныйОстатокДт) КАК КонечныйОстаток,
	|	СУММА(ВЫБОР
	|		КОГДА СтоимостьВА_НУ.Субконто2 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	|			ТОГДА ВЫБОР
	|					КОГДА СтоимостьВА_НУ.Субконто2.ВидДвиженияСтоимостиНУ = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.СписаниеСтоимостногоБалансаГруппыМенееМинимума)
	|						ТОГДА СтоимостьВА_НУ.СуммаНУОборотКт
	|				КОНЕЦ
	|		КОГДА СтоимостьВА_НУ.Субконто3 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	|			ТОГДА ВЫБОР
	|					КОГДА СтоимостьВА_НУ.Субконто3.ВидДвиженияСтоимостиНУ = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.СписаниеСтоимостногоБалансаГруппыМенееМинимума)
	|						ТОГДА СтоимостьВА_НУ.СуммаНУОборотКт
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СписаниеМенееМинимумаУчетное
	|ПОМЕСТИТЬ ВТ_СтоимостьВА_НУ
	|ИЗ
	|	ВТ_СчетаУчетаАктивов КАК СчетаУчетаАктивов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|			&НачДата,
	|			&КонДата,
	|			,
	|			,
	|			Счет В ИЕРАРХИИ
	|				(ВЫБРАТЬ
	|					СчетаУчетаАктивов.СчетУчета
	|				ИЗ
	|					ВТ_СчетаУчетаАктивов КАК СчетаУчетаАктивов),
	|			,
	|			(СУБКОНТО1, ОРГАНИЗАЦИЯ) В
	|					(ВЫБРАТЬ
	|						ВЫРАЗИТЬ(ВТ_ОбъектыНалоговогоУчетаФА.ФиксированныйАктив КАК Справочник.ОбъектыЭксплуатации),
	|						ВТ_ОбъектыНалоговогоУчетаФА.Организация
	|					ИЗ
	|						ВТ_ОбъектыНалоговогоУчетаФА)
	|				ИЛИ (СУБКОНТО1, ОРГАНИЗАЦИЯ) В
	|					(ВЫБРАТЬ
	|						ВЫРАЗИТЬ(ВТ_ОбъектыНалоговогоУчетаФА.ФиксированныйАктив КАК Справочник.НематериальныеАктивы),
	|						ВТ_ОбъектыНалоговогоУчетаФА.Организация
	|					ИЗ
	|						ВТ_ОбъектыНалоговогоУчетаФА)) КАК СтоимостьВА_НУ
	|		ПО СчетаУчетаАктивов.Организация = СтоимостьВА_НУ.Организация
	|			И СчетаУчетаАктивов.ОбъектУчета = СтоимостьВА_НУ.Субконто1
	|			И СчетаУчетаАктивов.СчетУчета = СтоимостьВА_НУ.Счет
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетаУчетаАктивов.Организация,
	|	СтоимостьВА_НУ.Подразделение,
	|	СчетаУчетаАктивов.ОбъектУчета,
	|	СчетаУчетаАктивов.СчетУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаУчетаАктивов.Организация КАК Организация,
	|	СчетаУчетаАктивов.ОбъектУчета КАК ФиксированныйАктив,
	|	СчетаУчетаАктивов.СчетНачисленияАмортизации КАК Счет,
	|	МАКСИМУМ(АмортизацияВА_НУ.СуммаНУНачальныйОстатокКт) КАК НачальныйОстаток,
	|	МАКСИМУМ(АмортизацияВА_НУ.СуммаНУКонечныйОстатокКт) КАК КонечныйОстаток,
	|	СУММА(ВЫБОР
	|		КОГДА АмортизацияВА_НУ.Субконто2 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	|			ТОГДА ВЫБОР
	|					КОГДА АмортизацияВА_НУ.Субконто2.ВидДвиженияСтоимостиНУ = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Амортизация)
	|						ТОГДА АмортизацияВА_НУ.СуммаНУОборотКт
	|				КОНЕЦ
	|		КОГДА АмортизацияВА_НУ.Субконто3 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	|			ТОГДА ВЫБОР
	|					КОГДА АмортизацияВА_НУ.Субконто3.ВидДвиженияСтоимостиНУ = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Амортизация)
	|						ТОГДА АмортизацияВА_НУ.СуммаНУОборотКт
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК АмортизацияУчетная
	|ПОМЕСТИТЬ ВТ_АмортизацияВА_НУ
	|ИЗ
	|	ВТ_СчетаУчетаАктивов КАК СчетаУчетаАктивов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|			&НачДата,
	|			&КонДата,
	|			,
	|			,
	|			Счет В ИЕРАРХИИ
	|				(ВЫБРАТЬ
	|					СчетаУчетаАктивов.СчетНачисленияАмортизации
	|				ИЗ
	|					ВТ_СчетаУчетаАктивов КАК СчетаУчетаАктивов),
	|			,
	|			(СУБКОНТО1, ОРГАНИЗАЦИЯ) В
	|					(ВЫБРАТЬ
	|						ВЫРАЗИТЬ(ВТ_ОбъектыНалоговогоУчетаФА.ФиксированныйАктив КАК Справочник.ОбъектыЭксплуатации),
	|						ВТ_ОбъектыНалоговогоУчетаФА.Организация
	|					ИЗ
	|						ВТ_ОбъектыНалоговогоУчетаФА)
	|				ИЛИ (СУБКОНТО1, ОРГАНИЗАЦИЯ) В
	|					(ВЫБРАТЬ
	|						ВЫРАЗИТЬ(ВТ_ОбъектыНалоговогоУчетаФА.ФиксированныйАктив КАК Справочник.НематериальныеАктивы),
	|						ВТ_ОбъектыНалоговогоУчетаФА.Организация
	|					ИЗ
	|						ВТ_ОбъектыНалоговогоУчетаФА)) КАК АмортизацияВА_НУ
	|		ПО СчетаУчетаАктивов.Организация = АмортизацияВА_НУ.Организация
	|			И СчетаУчетаАктивов.ОбъектУчета = АмортизацияВА_НУ.Субконто1
	|			И СчетаУчетаАктивов.СчетНачисленияАмортизации = АмортизацияВА_НУ.Счет
	|
	|ГДЕ 
	|	НЕ СчетаУчетаАктивов.СчетНачисленияАмортизации = СчетаУчетаАктивов.СчетУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетаУчетаАктивов.Организация,
	|	СчетаУчетаАктивов.ОбъектУчета,
	|	СчетаУчетаАктивов.СчетНачисленияАмортизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыНалоговогоУчетаФА.ГруппаФА КАК ГруппаФА,
	|	ОбъектыНалоговогоУчетаФА.ГруппаУчетаФА КАК ГруппаУчетаФА,	
	|	СУММА(ЕСТЬNULL(СтоимостьФА.НачальныйОстаток, 0) - ЕСТЬNULL(АмортизацияФА.НачальныйОстаток, 0) + ЕСТЬNULL(СтоимостьФА.Поступление, 0) - ЕСТЬNULL(СтоимостьФА.Выбытие, 0)) КАК СтоимостьНУ,
	|	СУММА(АмортизацияФА.АмортизацияУчетная) КАК АмортизацияУчетная,
	|	СУММА(ВЫБОР
	|			КОГДА ОбъектыНалоговогоУчетаФА.СостояниеФиксированногоАктива = ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.ПринятКУчету)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоНеВыбывшихВГруппе,
	|	СУММА(СтоимостьФА.СписаниеМенееМинимумаУчетное) КАК СписаниеМенееМинимумаУчетное
	|ПОМЕСТИТЬ ВТ_ИтогиПоГруппамНУ
	|ИЗ
	|	ВТ_ОбъектыНалоговогоУчетаФА КАК ОбъектыНалоговогоУчетаФА
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГруппыФА КАК ГруппыФА
	|		ПО ОбъектыНалоговогоУчетаФА.Организация = ГруппыФА.Организация
	|			И ОбъектыНалоговогоУчетаФА.ФиксированныйАктив = ГруппыФА.ФиксированныйАктив
	|			И ГруппыФА.ВходитВСтоимостныйБалансГруппы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтоимостьВА_НУ КАК СтоимостьФА
	|		ПО (СтоимостьФА.Организация = ОбъектыНалоговогоУчетаФА.Организация)
	|			И (СтоимостьФА.ФиксированныйАктив = ОбъектыНалоговогоУчетаФА.ФиксированныйАктив)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АмортизацияВА_НУ КАК АмортизацияФА
	|		ПО (АмортизацияФА.Организация = ОбъектыНалоговогоУчетаФА.Организация)
	|			И (АмортизацияФА.ФиксированныйАктив = ОбъектыНалоговогоУчетаФА.ФиксированныйАктив)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыНалоговогоУчетаФА.ГруппаФА,
	|	ОбъектыНалоговогоУчетаФА.ГруппаУчетаФА
	|;
	|//////////// Итоговый ЗАПРОС /////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтогиПоГруппамНУ.ГруппаУчетаФА КАК ГруппаУчетаФА,
	|	ГруппыФА.ГруппаФА КАК ГруппаФА,		
	|	ГруппыФА.Организация КАК Организация,		
	|	ГруппыФА.ФиксированныйАктив КАК ФиксированныйАктив,
	|	ЕСТЬNULL(СтоимостьВА.Счет,  СчетаУчетаАктивов.СчетУчета) КАК СчетУчетаФА,
	|	ЕСТЬNULL(АмортизацияВА.Счет, СчетаУчетаАктивов.СчетНачисленияАмортизации) КАК СчетАмортизацииФА,
	|	ГруппыФА.СостояниеФиксированногоАктива,
	//  |	ИтогиПоГруппамНУ.СтоимостьНУ КАК ИтоговаяСтоимостьГруппыНУ,
	|	(ЕСТЬNULL(СтоимостьВА.НачальныйОстаток, 0) - ЕСТЬNULL(АмортизацияВА.НачальныйОстаток, 0)) + ЕСТЬNULL(СтоимостьВА.Поступление, 0) - ЕСТЬNULL(СтоимостьВА.Выбытие, 0) КАК СтоимостьНУ,
	|	ЕСТЬNULL(АмортизацияВА.КонечныйОстаток, 0) КАК АмортизацияКонечныйОстаток,	
	|	ВЫБОР
	|		КОГДА НЕ ГруппыФА.ВходитВСтоимостныйБалансГруппы
	|			ТОГДА ВЫБОР
	|               КОГДА (ЕСТЬNULL(СтоимостьВА.НачальныйОстаток, 0) - ЕСТЬNULL(АмортизацияВА.НачальныйОстаток, 0)) + ЕСТЬNULL(СтоимостьВА.Поступление, 0) - ЕСТЬNULL(СтоимостьВА.Выбытие, 0) < 0
	|					ТОГДА 1
	|				КОГДА (ЕСТЬNULL(СтоимостьВА.НачальныйОстаток, 0) - ЕСТЬNULL(АмортизацияВА.НачальныйОстаток, 0)) + ЕСТЬNULL(СтоимостьВА.Поступление, 0) - ЕСТЬNULL(СтоимостьВА.Выбытие, 0) > 0
	|                   И ГруппыФА.СостояниеФиксированногоАктива = ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийФА.Выбыл)
	|					ТОГДА 2
	|				ИНАЧЕ 5
	|			КОНЕЦ
	|		ИНАЧЕ
	|			ВЫБОР 
	|				КОГДА ЕСТЬNULL(ИтогиПоГруппамНУ.СтоимостьНУ, 0) < 0
	|					ТОГДА 1
	|				КОГДА ЕСТЬNULL(ИтогиПоГруппамНУ.КоличествоНеВыбывшихВГруппе, 0) = 0
	|					ТОГДА 2
	|				КОГДА &СписыватьГруппыМенееМинимума
	|					И ЕСТЬNULL(ИтогиПоГруппамНУ.СтоимостьНУ, 0) < (300*&СтавкаМРП)
	|					И (&НачислятьАмортизацию
	|						ИЛИ ЕСТЬNULL(ИтогиПоГруппамНУ.АмортизацияУчетная, 0) = 0)
	|					ТОГДА 3
	|				КОГДА ЕСТЬNULL(ИтогиПоГруппамНУ.СписаниеМенееМинимумаУчетное, 0) = 0
	|					ТОГДА 4
	|				ИНАЧЕ 5
	|			КОНЕЦ
	|	КОНЕЦ КАК ВидОперацииПоАктиву,
	|	ГруппыФА.ПрименяемаяНормаАмортизации КАК ПрименяемаяНормаАмортизации,
	|	(ЕСТЬNULL(СтоимостьВА.НачальныйОстаток, 0) - ЕСТЬNULL(АмортизацияВА.НачальныйОстаток, 0) + ЕСТЬNULL(СтоимостьВА.Поступление, 0) - ЕСТЬNULL(СтоимостьВА.Выбытие, 0)) * ЕСТЬNULL(ГруппыФА.ПрименяемаяНормаАмортизации, 0)
	|	/ 100 КАК РасчетнаяАмортизацияФА,
	|	НЕ ГруппыФА.ВходитВСтоимостныйБалансГруппы КАК УчитыватьОтдельно,
	|	ЕстьNULL(МестонахождениеОС.МОЛ, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК МОЛ,
	//|	ЕстьNULL(МестонахождениеОС.Местонахождение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение
	|	ВЫБОР КОГДА ГруппыФА.ФиксированныйАктив ССЫЛКА Справочник.ОбъектыЭксплуатации 
	|		ТОГДА ЕстьNULL(МестонахождениеОС.Местонахождение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
	|	ИНАЧЕ 
	|		ЕстьNULL(СтоимостьВА.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) 
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР КОГДА ГруппыФА.ФиксированныйАктив ССЫЛКА Справочник.ОбъектыЭксплуатации 
	|		ТОГДА ЕстьNULL(ПорядокУчетаОС.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|	ИНАЧЕ 
	|		ЕстьNULL(ПорядокУчетаНМА.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|	КОНЕЦ КАК НаправлениеДеятельности,	
	|	ВЫБОР КОГДА ГруппыФА.ФиксированныйАктив ССЫЛКА Справочник.ОбъектыЭксплуатации 
	|		ТОГДА ЕстьNULL(ПорядокУчетаОС.ГруппаФинансовогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаВнеоборотныхАктивов.ПустаяСсылка))
	|	ИНАЧЕ 
	|		ЕстьNULL(ПорядокУчетаНМА.ГруппаФинансовогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаВнеоборотныхАктивов.ПустаяСсылка))
	|	КОНЕЦ КАК ГруппаФинансовогоУчета,
	|	ЕстьNULL(МестонахождениеОСУУ.Арендатор, НЕОПРЕДЕЛЕНО) КАК Арендатор
	|ПОМЕСТИТЬ ВТ_ИтоговаяТаблица
	|
	|ИЗ
	|	ВТ_ГруппыФА КАК ГруппыФА
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогиПоГруппамНУ КАК ИтогиПоГруппамНУ
	|			ПО ГруппыФА.ГруппаУчетаФА = ИтогиПоГруппамНУ.ГруппаУчетаФА
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтоимостьВА_НУ КАК СтоимостьВА
	|			ПО (ГруппыФА.Организация = СтоимостьВА.Организация)
	|				И (ГруппыФА.ФиксированныйАктив = СтоимостьВА.ФиксированныйАктив)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АмортизацияВА_НУ КАК АмортизацияВА
	|			ПО (ГруппыФА.Организация = АмортизацияВА.Организация)
	|				И (ГруппыФА.ФиксированныйАктив = АмортизацияВА.ФиксированныйАктив)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(&КонДата) КАК МестонахождениеОС
	|			ПО (ВЫБОР КОГДА ГруппыФА.ФиксированныйАктив ССЫЛКА Справочник.ОбъектыЭксплуатации 
	|					ТОГДА ГруппыФА.ФиксированныйАктив = МестонахождениеОС.ОсновноеСредство
	|				ИНАЧЕ ЛОЖЬ КОНЕЦ)
	|				И ГруппыФА.Организация = МестонахождениеОС.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаУчетаАктивов КАК СчетаУчетаАктивов
	|			ПО ГруппыФА.Организация = СчетаУчетаАктивов.Организация
	|				И  ГруппыФА.ФиксированныйАктив = СчетаУчетаАктивов.ОбъектУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаОС.СрезПоследних(&КонДата) КАК ПорядокУчетаОС
	|			ПО (ВЫБОР КОГДА ГруппыФА.ФиксированныйАктив ССЫЛКА Справочник.ОбъектыЭксплуатации 
	|					ТОГДА ГруппыФА.ФиксированныйАктив = ПорядокУчетаОС.ОсновноеСредство
	|				ИНАЧЕ ЛОЖЬ КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаНМА.СрезПоследних(&КонДата) КАК ПорядокУчетаНМА
	|			ПО (ВЫБОР КОГДА ГруппыФА.ФиксированныйАктив ССЫЛКА Справочник.НематериальныеАктивы 
	|					ТОГДА ГруппыФА.ФиксированныйАктив = ПорядокУчетаНМА.НематериальныйАктив
	|				ИНАЧЕ ЛОЖЬ КОНЕЦ)
	|				И ГруппыФА.Организация = ПорядокУчетаНМА.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОС.СрезПоследних(&КонДата) КАК МестонахождениеОСУУ
	|			ПО (ВЫБОР КОГДА ГруппыФА.ФиксированныйАктив ССЫЛКА Справочник.ОбъектыЭксплуатации 
	|					ТОГДА ГруппыФА.ФиксированныйАктив = МестонахождениеОСУУ.ОсновноеСредство
	|				ИНАЧЕ ЛОЖЬ КОНЕЦ)
	//|	,ВТ_СтавкаМРП КАК СтавкаМРП
	|;";
	
	Запрос.Выполнить();
	Запрос.Текст = "	
	|ВЫБРАТЬ 
	|	ИтоговаяТаблица.ГруппаУчетаФА,
	|	ИтоговаяТаблица.ГруппаФА,		
	|	ИтоговаяТаблица.Организация,		
	|	ИтоговаяТаблица.ФиксированныйАктив,
	|	ИтоговаяТаблица.СчетУчетаФА,
	|	ИтоговаяТаблица.СчетАмортизацииФА,
	|	ИтоговаяТаблица.СостояниеФиксированногоАктива,
	|	ИтоговаяТаблица.СтоимостьНУ,
	|	ИтоговаяТаблица.ПрименяемаяНормаАмортизации,
	|	ИтоговаяТаблица.РасчетнаяАмортизацияФА,
	|	ИтоговаяТаблица.УчитыватьОтдельно,
	|	ИтоговаяТаблица.МОЛ,
	|	ИтоговаяТаблица.Подразделение,
	|	ИтоговаяТаблица.НаправлениеДеятельности,
	|	ИтоговаяТаблица.ГруппаФинансовогоУчета,
	|	ИтоговаяТаблица.Арендатор
	|ИЗ ВТ_ИтоговаяТаблица КАК ИтоговаяТаблица
	|ГДЕ ИтоговаяТаблица.ВидОперацииПоАктиву = 1
	|
	|;
	|ВЫБРАТЬ 
	|	ИтоговаяТаблица.ГруппаУчетаФА,
	|	ИтоговаяТаблица.ГруппаФА,		
	|	ИтоговаяТаблица.Организация,		
	|	ИтоговаяТаблица.ФиксированныйАктив,
	|	ИтоговаяТаблица.СчетУчетаФА,
	|	ИтоговаяТаблица.СчетАмортизацииФА,
	|	ИтоговаяТаблица.СостояниеФиксированногоАктива,
	|	ИтоговаяТаблица.СтоимостьНУ,
	|	ИтоговаяТаблица.ПрименяемаяНормаАмортизации,
	|	ИтоговаяТаблица.РасчетнаяАмортизацияФА,
	|	ИтоговаяТаблица.АмортизацияКонечныйОстаток,
	|	ИтоговаяТаблица.УчитыватьОтдельно,
	|	ИтоговаяТаблица.МОЛ,
	|	ИтоговаяТаблица.Подразделение,
	|	ИтоговаяТаблица.НаправлениеДеятельности,
	|	ИтоговаяТаблица.ГруппаФинансовогоУчета,
	|	ИтоговаяТаблица.Арендатор
	|ИЗ ВТ_ИтоговаяТаблица КАК ИтоговаяТаблица
	|ГДЕ ИтоговаяТаблица.ВидОперацииПоАктиву = 2
	|;
	|ВЫБРАТЬ 
	|	ИтоговаяТаблица.ГруппаУчетаФА,
	|	ИтоговаяТаблица.ГруппаФА,		
	|	ИтоговаяТаблица.Организация,		
	|	ИтоговаяТаблица.ФиксированныйАктив,
	|	ИтоговаяТаблица.СчетУчетаФА,
	|	ИтоговаяТаблица.СчетАмортизацииФА,
	|	ИтоговаяТаблица.СостояниеФиксированногоАктива,
	|	ИтоговаяТаблица.СтоимостьНУ,
	|	ИтоговаяТаблица.ПрименяемаяНормаАмортизации,
	|	ИтоговаяТаблица.РасчетнаяАмортизацияФА,
	|	ИтоговаяТаблица.АмортизацияКонечныйОстаток,
	|	ИтоговаяТаблица.УчитыватьОтдельно,
	|	ИтоговаяТаблица.МОЛ,
	|	ИтоговаяТаблица.Подразделение,
	|	ИтоговаяТаблица.НаправлениеДеятельности,
	|	ИтоговаяТаблица.ГруппаФинансовогоУчета,
	|	ИтоговаяТаблица.Арендатор
	|ИЗ ВТ_ИтоговаяТаблица КАК ИтоговаяТаблица
	|ГДЕ ИтоговаяТаблица.ВидОперацииПоАктиву = 3
	|;";

	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Возврат МассивРезультатов;
	
КонецФункции

Функция ПолучитьТаблицаРасчетВычетовПоФА()
	
	ОписаниеТипаЧисла15_2 = ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15, 2);
	ОписаниеТипаСчетХозр  = Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный");
	
	ТаблицаРасчета = Новый ТаблицаЗначений;
	
	ТаблицаРасчета.Колонки.Добавить("Организация",          Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаРасчета.Колонки.Добавить("СчетРасходов",         ОписаниеТипаСчетХозр);
	ТаблицаРасчета.Колонки.Добавить("СчетАмортизацииФА",    ОписаниеТипаСчетХозр);
	ТаблицаРасчета.Колонки.Добавить("Сумма",        		ОписаниеТипаЧисла15_2);
	ТаблицаРасчета.Колонки.Добавить("Коэффициент",        	ОписаниеТипаЧисла15_2);
	
	ТаблицаРасчета.Колонки.Добавить("ФиксированныйАктив",  	);
	ТаблицаРасчета.Колонки.Добавить("СтатьяРасходов",   	Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
	ТаблицаРасчета.Колонки.Добавить("Подразделение",  		Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	ТаблицаРасчета.Колонки.Добавить("ПодразделениеЗатрат",	Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	ТаблицаРасчета.Колонки.Добавить("МОЛ",  				Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаРасчета.Колонки.Добавить("НаправлениеДеятельности",	Новый ОписаниеТипов("СправочникСсылка.НаправленияДеятельности"));
	ТаблицаРасчета.Колонки.Добавить("ГруппаФинансовогоУчета",  	Новый ОписаниеТипов("СправочникСсылка.ГруппыФинансовогоУчетаВнеоборотныхАктивов"));
	ТаблицаРасчета.Колонки.Добавить("Арендатор",  	Неопределено);
	
	ТаблицаРасчета.Колонки.Добавить("АналитикаРасходов",  	);
	ТаблицаРасчета.Колонки.Добавить("ПередаватьРасходыВДругуюОрганизацию",  	Новый ОписаниеТипов("Булево"));
	ТаблицаРасчета.Колонки.Добавить("ОрганизацияПолучательРасходов",  			Новый ОписаниеТипов("СправочникСсылка.Организации"));
	
	Возврат ТаблицаРасчета;
	
КонецФункции

Функция РасходыПоАмортизацииНУ(Реквизиты, ТаблицаАмортизации, Отказ)
	
КонецФункции	

Процедура СформироватьДвиженияРасчетВычетовФАНУ(ТаблицаВычетыФА, ТаблицаРеквизиты, Движения, Отказ)
	
	Реквизиты = ТаблицаРеквизиты[0];
	
	Если Реквизиты.РассчитыватьДоходОтПревышенияСтоимостиВыбывшихФА Тогда
		СформироватьДвиженияПризнаниеДоходаОтПревышенияСтоимостиВыбывшегоАктива(ТаблицаВычетыФА.ТаблицаДоходы, Реквизиты, Движения, Отказ);
	КонецЕсли;	
	
	Если Реквизиты.СписыватьСтоимостныйБалансПриВыбытииВсехФАГруппы Тогда
		СформироватьДвиженияСписаниеПриВыбытииВсехАктивовГруппы(ТаблицаВычетыФА.ТаблицаСписаниеПриВыбытии, Реквизиты, Движения, Отказ);
	КонецЕсли;	
	
	Если Реквизиты.СписыватьСтоимостныйБалансГруппыМенееМинимума Тогда
		СформироватьДвиженияГруппМенееМинимума(ТаблицаВычетыФА.ТаблицаСписаниеМенееМинимума, Реквизиты, Движения, Отказ);
	КонецЕсли;	
	
	Если Реквизиты.АмортизацияФАНУ Тогда
		СформироватьДвиженияПоАмортизации(ТаблицаВычетыФА.ТаблицаРасчетАмортизацииНУ, Реквизиты, Движения, Отказ);
	КонецЕсли;
		
КонецПроцедуры

Процедура СформироватьДвиженияПризнаниеДоходаОтПревышенияСтоимостиВыбывшегоАктива(ТаблицаДанных, Реквизиты, Движения, Отказ)
	
	ПараметрыКлюча = Новый Структура("ВидАктиваНУ, ВидДвиженияСтоимостиНУ", Перечисления.ВидАктиваНУ.ФиксированныйАктив, Перечисления.ВидыДвиженияСтоимостиФА.СписаниеОтрицательногоБалансаГруппы);
	КлючАналитики = РегистрыСведений.АналитикаУчетаВнеоборотныхАктивов.ЗначениеКлючаАналитики(ПараметрыКлюча);
	
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		Если СтрокаДанных.СтоимостьНУ = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Проводка = Движения.Хозрасчетный.Добавить();
		Проводка.Период      = Реквизиты.Период;
		Проводка.Организация = СтрокаДанных.Организация;
		
		Проводка.СчетДт      = СтрокаДанных.СчетУчетаФА;
		Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.ДоходыОтВыбытияАктивов;
		
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаДанных.ФиксированныйАктив);
		Если ТипЗнч(СтрокаДанных.ФиксированныйАктив) = Тип("СправочникСсылка.ОбъектыЭксплуатации")
			И НЕ СтрокаДанных.СчетУчетаФА = ПланыСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи Тогда
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаДанных.МОЛ);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, КлючАналитики);
		Иначе	
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, КлючАналитики);
		КонецЕсли;
		
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, ПланыВидовХарактеристик.СтатьиДоходов.ДоходыОтВыбытияФА);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаДанных.ФиксированныйАктив);
		
		БухгалтерскийУчет.УстановитьПодразделенияПроводки(Проводка, СтрокаДанных.Подразделение, СтрокаДанных.Подразделение);
		
		СуммаНУ        = -СтрокаДанных.СтоимостьНУ;
		СуммаПР        = 0;
		СуммаВР        = СтрокаДанных.СтоимостьНУ;
		
		НалоговыйУчет.ЗаполнитьНалоговыеСуммыПроводки(СуммаНУ, СуммаНУ, СуммаПР, СуммаПР,
								СуммаВР, СуммаВР, Проводка, Реквизиты.ПоддержкаПБУ18);
								
		Проводка.Содержание = НСтр("ru='Признан доход от превышения доходов выбывших ФА над стоимостным балансом группы/подгруппы'");
		
		//Формирование движений по РН СтоимостьОС и СтоимостьНМА
		Если Реквизиты.ИспользуетсяУправлениеВНА_2_4 Тогда
			
			Если ТипЗнч(СтрокаДанных.ФиксированныйАктив) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
				СтрокаСтоимостьВНА = Движения.СтоимостьОС.ДобавитьПриход();
				СтрокаСтоимостьВНА.ОсновноеСредство 		= СтрокаДанных.ФиксированныйАктив;
				СтрокаСтоимостьВНА.МОЛ 						= СтрокаДанных.МОЛ;
				СтрокаСтоимостьВНА.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.РеализацияОС;
			Иначе
				СтрокаСтоимостьВНА = Движения.СтоимостьНМА.ДобавитьПриход();
				СтрокаСтоимостьВНА.НематериальныйАктив 		= СтрокаДанных.ФиксированныйАктив;
				СтрокаСтоимостьВНА.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.РеализацияНМА;
			КонецЕсли;
			
			СтрокаСтоимостьВНА.Период = Реквизиты.Период;
			
			СтрокаСтоимостьВНА.Организация 				= СтрокаДанных.Организация;
			СтрокаСтоимостьВНА.Подразделение 			= СтрокаДанных.Подразделение;
			СтрокаСтоимостьВНА.ГруппаФинансовогоУчета 	= СтрокаДанных.ГруппаФинансовогоУчета;
			СтрокаСтоимостьВНА.НаправлениеДеятельности 	= СтрокаДанных.НаправлениеДеятельности;
			
			СтрокаСтоимостьВНА.СтоимостьНУ = -СтрокаДанных.СтоимостьНУ;
			СтрокаСтоимостьВНА.СтоимостьВР = СтрокаДанных.СтоимостьНУ;
			
			СтрокаСтоимостьВНА.КорПодразделение = СтрокаДанных.Подразделение;
			СтрокаСтоимостьВНА.ВидАктиваИДвиженияСтоимостиНУ = КлючАналитики;
			СтрокаСтоимостьВНА.ОтражатьВРеглУчете = Истина;
			
		КонецЕсли;

	КонецЦикла;		
	
	Движения.Хозрасчетный.Записывать = Истина;
	Движения.СтоимостьОС.Записывать = Истина;
	Движения.СтоимостьНМА.Записывать = Истина;
	
КонецПроцедуры	

// Процедура формирует корреспонденции в НУ по списанию стоимостного
// баланса группы при выбытии всех, входищих в нее, активов
//
// Параметры:
// 	ВыборкаВидовОпераций - выборка из результата запроса, содержаща группировки по ГРуппамФА и ФА.
// 	Содержит поля
//		ГруппаУчетаФА 	- Группа НУ (если учет в целом по группе)	либо ФА, если учет в группе ведется по объектам
//		ГруппаФА 		- 	Группа налогового учета
//		ФиксированныйАктив  - Фиксирвоанный актив
//		СчетУчетаФА			- Счет учета фиксированного актива в НУ
//		ВидУчетаВГруппеФА	- Вид учета в группе: "по объектам"/ "по группе в целом"
//		СостояниеФиксированногоАктива - состояние актива в налоговом учете:	"принят к учету"/"выбыл"/ "снят с учета"
//		ИтоговаяСтоимостьГруппыНУ	 - Стоимостный баланс по ГруппеУчетаФА
//		СтоимостьНУ					 - Стоимостный баланс по фиксированному активу
//		ВидОперацииПоАктиву			 - Вид регламентой операции (из числа взаимоисключающих), которая выполняется с активом в документе:
//									 1 - Признание дохода от превышения стоимости выбывших активов над стоимостным балансом группы
//									 2 - Списание стоимостного баланса при выбытии всех активов группы
//									 3 - Списание стоимостного баланса группы, если величина баланса менее установленого минимума (с. 111, п.2)
//									 4 - Начисление амортизации по активу
//		ПрименяемаяНормаАмортизации - Применяемая норма амортизации
//		РасчетнаяАмортизацияФА		- Сумма расчетной амортизации по активу
//		УчитыватьОтдельно			- Признак того, что данный актив учитывается отдельно от стоимостного баланса группы
//
Процедура СформироватьДвиженияСписаниеПриВыбытииВсехАктивовГруппы(ТаблицаДанных, Реквизиты, Движения, Отказ)
	
	ПараметрыКлюча = Новый Структура("ВидАктиваНУ, ВидДвиженияСтоимостиНУ", Перечисления.ВидАктиваНУ.ФиксированныйАктив, Перечисления.ВидыДвиженияСтоимостиФА.СписаниеПриВыбытииВсехАктивовГруппы);
	КлючАналитики = РегистрыСведений.АналитикаУчетаВнеоборотныхАктивов.ЗначениеКлючаАналитики(ПараметрыКлюча);
	
	ПараметрыКлюча = Новый Структура("ВидАктиваНУ, ВидДвиженияСтоимостиНУ", Перечисления.ВидАктиваНУ.ФиксированныйАктив, Перечисления.ВидыДвиженияСтоимостиФА.СписаниеНакопленнойАмортизации);
	КлючАналитикиСписаниеАмортизации = РегистрыСведений.АналитикаУчетаВнеоборотныхАктивов.ЗначениеКлючаАналитики(ПараметрыКлюча);

	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		//Проводки
		Если СтрокаДанных.СтоимостьНУ <> 0 Тогда 
			Проводка = Движения.Хозрасчетный.Добавить();
			Проводка.Период      = Реквизиты.Период;
			Проводка.Организация = СтрокаДанных.Организация;
			
			Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ПрочиеРасходыВНалоговомУчете;
			Проводка.СчетКт      = СтрокаДанных.СчетУчетаФА;
			
			//СубконтоДТ
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, ПланыВидовХарактеристик.СтатьиРасходов.СписаниеПриВыбытииВсехФАГруппы);
							
			//СубконтоКТ
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаДанных.ФиксированныйАктив);
			
			Если ТипЗнч(СтрокаДанных.ФиксированныйАктив) = Тип("СправочникСсылка.ОбъектыЭксплуатации") 
				И НЕ СтрокаДанных.СчетУчетаФА = ПланыСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи Тогда
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаДанных.МОЛ);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, КлючАналитики);
			Иначе	
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, КлючАналитики);
			КонецЕсли;
			
			БухгалтерскийУчет.УстановитьПодразделенияПроводки(Проводка, СтрокаДанных.Подразделение, СтрокаДанных.Подразделение);
			
			СуммаНУ        = СтрокаДанных.СтоимостьНУ;
			СуммаПР        = 0;
			СуммаВР        = -СтрокаДанных.СтоимостьНУ;
			
			НалоговыйУчет.ЗаполнитьНалоговыеСуммыПроводки(СуммаНУ, СуммаНУ, СуммаПР, СуммаПР,
									СуммаВР, СуммаВР, Проводка, Реквизиты.ПоддержкаПБУ18);
									
			Проводка.Содержание = НСтр("ru='Стоимость группы, все активы которой выбыли, отнесена на вычеты'");
			
			//Прочие расходы
			СтрокаРасходы = Движения.ПрочиеРасходы.Добавить();
			СтрокаРасходы.Период = Реквизиты.Период;
			СтрокаРасходы.Организация = СтрокаДанных.Организация; 
			
			СтрокаРасходы.СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.СписаниеПриВыбытииВсехФАГруппы;
			СтрокаРасходы.АналитикаРасходов = СтрокаДанных.ФиксированныйАктив;
			
			СтрокаРасходы.Подразделение = СтрокаДанных.Подразделение;
			СтрокаРасходы.ВременнаяРазница = -СтрокаДанных.СтоимостьНУ;
			
			СтрокаРасходы.СчетКт = СтрокаДанных.СчетУчетаФА;
			СтрокаРасходы.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочиеРасходы;
			
			//Формирование движений по РН СтоимостьОС и СтоимостьНМА
			Если Реквизиты.ИспользуетсяУправлениеВНА_2_4 Тогда
				
				Если ТипЗнч(СтрокаДанных.ФиксированныйАктив) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
					СтрокаСтоимостьВНА = Движения.СтоимостьОС.ДобавитьРасход();
					СтрокаСтоимостьВНА.ОсновноеСредство 		= СтрокаДанных.ФиксированныйАктив;
					СтрокаСтоимостьВНА.МОЛ 						= СтрокаДанных.МОЛ;
					СтрокаСтоимостьВНА.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.СписаниеОС;
				Иначе
					СтрокаСтоимостьВНА = Движения.СтоимостьНМА.ДобавитьРасход();
					СтрокаСтоимостьВНА.НематериальныйАктив 		= СтрокаДанных.ФиксированныйАктив;
					СтрокаСтоимостьВНА.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.СписаниеНМА;
				КонецЕсли;
				
				СтрокаСтоимостьВНА.Период = Реквизиты.Период;
				
				СтрокаСтоимостьВНА.Организация 				= СтрокаДанных.Организация;
				СтрокаСтоимостьВНА.Подразделение 			= СтрокаДанных.Подразделение;
				СтрокаСтоимостьВНА.ГруппаФинансовогоУчета 	= СтрокаДанных.ГруппаФинансовогоУчета;
				СтрокаСтоимостьВНА.НаправлениеДеятельности 	= СтрокаДанных.НаправлениеДеятельности;
				
				СтрокаСтоимостьВНА.СтоимостьНУ = СтрокаДанных.СтоимостьНУ;
				СтрокаСтоимостьВНА.СтоимостьВР = -СтрокаДанных.СтоимостьНУ;
				
				СтрокаСтоимостьВНА.КорПодразделение 				= СтрокаДанных.Подразделение;
				СтрокаСтоимостьВНА.КорСтатьяРасходов 				= ПланыВидовХарактеристик.СтатьиРасходов.СписаниеПриВыбытииВсехФАГруппы;
				СтрокаСтоимостьВНА.КорАналитикаРасходов 			= СтрокаДанных.ФиксированныйАктив;;
				СтрокаСтоимостьВНА.ВидАктиваИДвиженияСтоимостиНУ 	= КлючАналитики;
				СтрокаСтоимостьВНА.ОтражатьВРеглУчете 				= Истина;
				
			КонецЕсли;
		КонецЕсли;	
			
		//Списание накопленной амортизации
		Если СтрокаДанных.АмортизацияКонечныйОстаток <> 0 Тогда
			Проводка = Движения.Хозрасчетный.Добавить();
			Проводка.Период      = Реквизиты.Период;
			Проводка.Организация = СтрокаДанных.Организация;
			
			Проводка.СчетДт      = СтрокаДанных.СчетАмортизацииФА;
			Проводка.СчетКт      = СтрокаДанных.СчетУчетаФА;
			
			//СубконтоДТ
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаДанных.ФиксированныйАктив);
			
			Если ТипЗнч(СтрокаДанных.ФиксированныйАктив) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаДанных.МОЛ);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, КлючАналитикиСписаниеАмортизации);
			Иначе	
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, КлючАналитикиСписаниеАмортизации);
			КонецЕсли;
			
			//СубконтоКТ
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаДанных.ФиксированныйАктив);
			
			Если ТипЗнч(СтрокаДанных.ФиксированныйАктив) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаДанных.МОЛ);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, КлючАналитикиСписаниеАмортизации);
			Иначе	
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, КлючАналитикиСписаниеАмортизации);
			КонецЕсли;
			
			БухгалтерскийУчет.УстановитьПодразделенияПроводки(Проводка, СтрокаДанных.Подразделение, СтрокаДанных.Подразделение);
			
			СуммаНУ        = СтрокаДанных.АмортизацияКонечныйОстаток;
			СуммаПР        = 0;
			СуммаВР        = -СтрокаДанных.АмортизацияКонечныйОстаток;
			
			НалоговыйУчет.ЗаполнитьНалоговыеСуммыПроводки(СуммаНУ, СуммаНУ, СуммаПР, СуммаПР,
									СуммаВР, СуммаВР, Проводка, Реквизиты.ПоддержкаПБУ18);
									
			Проводка.Содержание = НСтр("ru='Списана амортизация в НУ'");
			
			Если Реквизиты.ИспользуетсяУправлениеВНА_2_4 Тогда
				
				Если ТипЗнч(СтрокаДанных.ФиксированныйАктив) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
					СтрокаАмортизацияВНА = Движения.АмортизацияОС.ДобавитьПриход();
					СтрокаАмортизацияВНА.ОсновноеСредство 		= СтрокаДанных.ФиксированныйАктив;
					СтрокаАмортизацияВНА.МОЛ 					= СтрокаДанных.МОЛ;
					СтрокаАмортизацияВНА.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.СписаниеАмортизацииОС;
				Иначе
					СтрокаАмортизацияВНА = Движения.АмортизацияНМА.ДобавитьПриход();
					СтрокаАмортизацияВНА.НематериальныйАктив 	= СтрокаДанных.ФиксированныйАктив;
					СтрокаАмортизацияВНА.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.СписаниеАмортизацииНМА;
				КонецЕсли;
				
				СтрокаАмортизацияВНА.Период = Реквизиты.Период;
				
				СтрокаАмортизацияВНА.Организация 				= СтрокаДанных.Организация;
				СтрокаАмортизацияВНА.Подразделение 				= СтрокаДанных.Подразделение;
				СтрокаАмортизацияВНА.ГруппаФинансовогоУчета 	= СтрокаДанных.ГруппаФинансовогоУчета;
				СтрокаАмортизацияВНА.НаправлениеДеятельности 	= СтрокаДанных.НаправлениеДеятельности;
				
				СтрокаАмортизацияВНА.АмортизацияНУ = СтрокаДанных.АмортизацияКонечныйОстаток;
				СтрокаАмортизацияВНА.АмортизацияВР = -СтрокаДанных.АмортизацияКонечныйОстаток;
				
				СтрокаАмортизацияВНА.КорПодразделение 				= СтрокаДанных.Подразделение;
				СтрокаАмортизацияВНА.ВидАктиваИДвиженияСтоимостиНУ 	= КлючАналитикиСписаниеАмортизации;
				
				Если ТипЗнч(СтрокаДанных.ФиксированныйАктив) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
					СтрокаСтоимостьВНА = Движения.СтоимостьОС.ДобавитьРасход();
					СтрокаСтоимостьВНА.ОсновноеСредство 		= СтрокаДанных.ФиксированныйАктив;
					СтрокаСтоимостьВНА.МОЛ 						= СтрокаДанных.МОЛ;
					СтрокаСтоимостьВНА.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.СписаниеАмортизацииОС;
				Иначе
					СтрокаСтоимостьВНА = Движения.СтоимостьНМА.ДобавитьРасход();
					СтрокаСтоимостьВНА.НематериальныйАктив 		= СтрокаДанных.ФиксированныйАктив;
					СтрокаСтоимостьВНА.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.СписаниеАмортизацииНМА;
				КонецЕсли;
				
				СтрокаСтоимостьВНА.Период = Реквизиты.Период;
				
				СтрокаСтоимостьВНА.Организация 				= СтрокаДанных.Организация;
				СтрокаСтоимостьВНА.Подразделение 			= СтрокаДанных.Подразделение;
				СтрокаСтоимостьВНА.ГруппаФинансовогоУчета 	= СтрокаДанных.ГруппаФинансовогоУчета;
				СтрокаСтоимостьВНА.НаправлениеДеятельности 	= СтрокаДанных.НаправлениеДеятельности;
				
				СтрокаСтоимостьВНА.СтоимостьНУ = СтрокаДанных.АмортизацияКонечныйОстаток;
				СтрокаСтоимостьВНА.СтоимостьВР = -СтрокаДанных.АмортизацияКонечныйОстаток;
				
				СтрокаСтоимостьВНА.КорПодразделение 				= СтрокаДанных.Подразделение;
				СтрокаСтоимостьВНА.ВидАктиваИДвиженияСтоимостиНУ 	= КлючАналитикиСписаниеАмортизации;
				СтрокаСтоимостьВНА.ОтражатьВРеглУчете 				= Истина;
				
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;		

	Движения.Хозрасчетный.Записывать 	= Истина;
	Движения.ПрочиеРасходы.Записывать 	= Истина;
	Движения.СтоимостьОС.Записывать 	= Истина;
	Движения.СтоимостьНМА.Записывать 	= Истина;
	Движения.АмортизацияОС.Записывать 	= Истина;
	Движения.АмортизацияНМА.Записывать 	= Истина;

КонецПроцедуры // ВыполнитьСписаниеПриВыбытииВсехАктивовГруппы_НУ

// Процедура формирует корреспонденции по отражению амортизации в налоговом учете
//
// Параметры:
// 	ВыборкаВидовОпераций - выборка из результата запроса, содержаща группировки по ГРуппамФА и ФА.
// 	Содержит поля
//		ГруппаУчетаФА 	- Группа НУ (если учет в целом по группе)	либо ФА, если учет в группе ведется по объектам
//		ГруппаФА 		- 	Группа налогового учета
//		ФиксированныйАктив  - Фиксирвоанный актив
//		СчетУчетаФА			- Счет учета фиксированного актива в НУ
//		ВидУчетаВГруппеФА	- Вид учета в группе: "по объектам"/ "по группе в целом"
//		СостояниеФиксированногоАктива - состояние актива в налоговом учете:	"принят к учету"/"выбыл"/ "снят с учета"
//		ИтоговаяСтоимостьГруппыНУ	 - Стоимостный баланс по ГруппеУчетаФА
//		СтоимостьНУ					 - Стоимостный баланс по фиксированному активу
//		ВидОперацииПоАктиву			 - Вид регламентой операции (из числа взаимоисключающих), которая выполняется с активом в документе:
//									 1 - Признание дохода от превышения стоимости выбывших активов над стоимостным балансом группы
//									 2 - Списание стоимостного баланса при выбытии всех активов группы
//									 3 - Списание стоимостного баланса группы, если величина баланса менее установленого минимума (с. 111, п.2)
//									 4 - Начисление амортизации по активу
//		ПрименяемаяНормаАмортизации - Применяемая норма амортизации
//		РасчетнаяАмортизацияФА		- Сумма расчетной амортизации по активу
//		УчитыватьОтдельно			- Признак того, что данный актив учитывается отдельно от стоимостного баланса группы
//
Процедура СформироватьДвиженияПоАмортизации(ТаблицаРасчетАмортизацииНУ, Реквизиты, Движения, Отказ)
	
	ПараметрыКлюча = Новый Структура("ВидАктиваНУ, ВидДвиженияСтоимостиНУ", Перечисления.ВидАктиваНУ.ФиксированныйАктив, Перечисления.ВидыДвиженияСтоимостиФА.Амортизация);
	КлючАналитики = РегистрыСведений.АналитикаУчетаВнеоборотныхАктивов.ЗначениеКлючаАналитики(ПараметрыКлюча);
		
	Для Каждого СтрокаАмортизации Из ТаблицаРасчетАмортизацииНУ Цикл
		
		Если СтрокаАмортизации.Сумма <> 0 Тогда
			Если НЕ СтрокаАмортизации.ПередаватьРасходыВДругуюОрганизацию Тогда
				Проводка = Движения.Хозрасчетный.Добавить();
				Проводка.Период      = Реквизиты.Период;
				Проводка.Организация = СтрокаАмортизации.Организация;
				
				Проводка.СчетДт      = СтрокаАмортизации.СчетРасходов;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаАмортизации.СтатьяРасходов);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаАмортизации.АналитикаРасходов);
				
				Проводка.СчетКт      = СтрокаАмортизации.СчетАмортизацииФА;
				
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаАмортизации.ФиксированныйАктив);
				Если ТипЗнч(СтрокаАмортизации.ФиксированныйАктив) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаАмортизации.МОЛ);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, КлючАналитики);
				Иначе	
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, КлючАналитики);
				КонецЕсли;
				
				БухгалтерскийУчет.УстановитьПодразделенияПроводки(Проводка, СтрокаАмортизации.ПодразделениеЗатрат, СтрокаАмортизации.Подразделение);
				
				СуммаНУ        = СтрокаАмортизации.Сумма;
				СуммаПР        = 0;
				СуммаВР        = -СтрокаАмортизации.Сумма;
				
				НалоговыйУчет.ЗаполнитьНалоговыеСуммыПроводки(СуммаНУ, СуммаНУ, СуммаПР, СуммаПР,
				СуммаВР, СуммаВР, Проводка, Реквизиты.ПоддержкаПБУ18);
				
				Проводка.Содержание = НСтр("ru='Начислена амортизация (НУ)'");
				
			Иначе
				
				//отправитель
				Проводка = Движения.Хозрасчетный.Добавить();
				Проводка.Период      = Реквизиты.Период;
				Проводка.Организация = СтрокаАмортизации.Организация;
				
				Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.КраткосрочнаяДебиторскаяЗадолженностьФилиаловИСтруктурныхПодразделений;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаАмортизации.ОрганизацияПолучательРасходов);
							
				Проводка.СчетКт      = СтрокаАмортизации.СчетАмортизацииФА;
				
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаАмортизации.ФиксированныйАктив);
				Если ТипЗнч(СтрокаАмортизации.ФиксированныйАктив) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаАмортизации.МОЛ);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, КлючАналитики);
				Иначе	
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, КлючАналитики);
				КонецЕсли;
				
				БухгалтерскийУчет.УстановитьПодразделенияПроводки(Проводка, СтрокаАмортизации.ПодразделениеЗатрат, СтрокаАмортизации.Подразделение);
				
				СуммаНУ        = СтрокаАмортизации.Сумма;
				СуммаПР        = 0;
				СуммаВР        = -СтрокаАмортизации.Сумма;
				
				НалоговыйУчет.ЗаполнитьНалоговыеСуммыПроводки(СуммаНУ, СуммаНУ, СуммаПР, СуммаПР,
				СуммаВР, СуммаВР, Проводка, Реквизиты.ПоддержкаПБУ18);
				
				Проводка.Содержание = НСтр("ru='Начислена амортизация (НУ)'");
				
				//получатель
				Проводка = Движения.Хозрасчетный.Добавить();
				Проводка.Период      = Реквизиты.Период;
				Проводка.Организация = СтрокаАмортизации.ОрганизацияПолучательРасходов;
				
				Проводка.СчетДт      = СтрокаАмортизации.СчетРасходов;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаАмортизации.СтатьяРасходов);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаАмортизации.АналитикаРасходов);
							
				Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.КраткосрочнаяКредиторскаяЗадолженностьФилиаламИСтруктурнымПодразделениям;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Реквизиты.Организация);
				
				БухгалтерскийУчет.УстановитьПодразделенияПроводки(Проводка, СтрокаАмортизации.Подразделение, СтрокаАмортизации.Подразделение);
				
				СуммаНУ        = СтрокаАмортизации.Сумма;
				СуммаПР        = 0;
				СуммаВР        = -СтрокаАмортизации.Сумма;
				
				НалоговыйУчет.ЗаполнитьНалоговыеСуммыПроводки(СуммаНУ, СуммаНУ, СуммаПР, СуммаПР,
				СуммаВР, СуммаВР, Проводка, Реквизиты.ПоддержкаПБУ18);
				
				Проводка.Содержание = НСтр("ru='Начислена амортизация (НУ)'");
				
			КонецЕсли;
			
			//Прочие расходы
			СтрокаРасходы = Движения.ПрочиеРасходы.Добавить();
			СтрокаРасходы.Период = Реквизиты.Период;
			Если НЕ СтрокаАмортизации.ПередаватьРасходыВДругуюОрганизацию Тогда
				СтрокаРасходы.Организация = СтрокаАмортизации.Организация;
			Иначе
				СтрокаРасходы.Организация = СтрокаАмортизации.ОрганизацияПолучательРасходов;
			КонецЕсли;	
			
			СтрокаРасходы.СтатьяРасходов = СтрокаАмортизации.СтатьяРасходов;
			СтрокаРасходы.АналитикаРасходов = СтрокаАмортизации.ФиксированныйАктив;
			
			СтрокаРасходы.Подразделение = СтрокаАмортизации.ПодразделениеЗатрат;
			СтрокаРасходы.ВременнаяРазница = -СтрокаАмортизации.Сумма;
			
			Если НЕ СтрокаАмортизации.ПередаватьРасходыВДругуюОрганизацию Тогда
				СтрокаРасходы.СчетКт = СтрокаАмортизации.СчетАмортизацииФА;
			Иначе
				СтрокаРасходы.СчетКт = ПланыСчетов.Хозрасчетный.КраткосрочнаяКредиторскаяЗадолженностьФилиаламИСтруктурнымПодразделениям; 
			КонецЕсли;
			
			СтрокаРасходы.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.АмортизацияВнеоборотныхАктивов;

			//Формирование движений по РН АмортизацияОС и АмортизацияНМА
			Если Реквизиты.ИспользуетсяУправлениеВНА_2_4 Тогда
				
				Если ТипЗнч(СтрокаАмортизации.ФиксированныйАктив) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
					СтрокаАмортизацияВНА = Движения.АмортизацияОС.ДобавитьРасход();
					СтрокаАмортизацияВНА.ОсновноеСредство = СтрокаАмортизации.ФиксированныйАктив;
					СтрокаАмортизацияВНА.МОЛ = СтрокаАмортизации.МОЛ;
					СтрокаАмортизацияВНА.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.АмортизацияОС;
				Иначе
					СтрокаАмортизацияВНА = Движения.АмортизацияНМА.ДобавитьРасход();
					СтрокаАмортизацияВНА.НематериальныйАктив = СтрокаАмортизации.ФиксированныйАктив;
					СтрокаАмортизацияВНА.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.АмортизацияНМА;
				КонецЕсли;
				
				СтрокаАмортизацияВНА.Период = Реквизиты.Период;
				
				СтрокаАмортизацияВНА.Организация 				= СтрокаАмортизации.Организация;
				СтрокаАмортизацияВНА.Подразделение 				= СтрокаАмортизации.Подразделение;
				СтрокаАмортизацияВНА.ГруппаФинансовогоУчета 	= СтрокаАмортизации.ГруппаФинансовогоУчета;
				СтрокаАмортизацияВНА.НаправлениеДеятельности 	= СтрокаАмортизации.НаправлениеДеятельности;
				
				СтрокаАмортизацияВНА.АмортизацияНУ = СтрокаАмортизации.Сумма;
				СтрокаАмортизацияВНА.АмортизацияВР = -СтрокаАмортизации.Сумма;
				
				СтрокаАмортизацияВНА.КорПодразделение = СтрокаАмортизации.ПодразделениеЗатрат;
				СтрокаАмортизацияВНА.КорСтатьяРасходов = СтрокаАмортизации.СтатьяРасходов;
				СтрокаАмортизацияВНА.КорАналитикаРасходов = СтрокаАмортизации.АналитикаРасходов;
				СтрокаАмортизацияВНА.ВидАктиваИДвиженияСтоимостиНУ = КлючАналитики;
				
			КонецЕсли;
			
		КонецЕсли;	
			
	КонецЦикла;	
	
	Движения.Хозрасчетный.Записывать = Истина;
	Движения.ПрочиеРасходы.Записывать = Истина;
	Движения.АмортизацияОС.Записывать = Истина;
	Движения.АмортизацияНМА.Записывать = Истина;

КонецПроцедуры

// Процедура формирует корреспонденции в НУ по списанию стоимостного
// баланса группы, если данная величина менее установленной налоговым законодательством (ст. 111, п.2)
//
// Параметры:
// 	ВыборкаВидовОпераций - выборка из результата запроса, содержаща группировки по ГРуппамФА и ФА.
// 	Содержит поля
//		ГруппаУчетаФА 	- Группа НУ (если учет в целом по группе)	либо ФА, если учет в группе ведется по объектам
//		ГруппаФА 		- 	Группа налогового учета
//		ФиксированныйАктив  - Фиксирвоанный актив
//		СчетУчетаФА			- Счет учета фиксированного актива в НУ
//		ВидУчетаВГруппеФА	- Вид учета в группе: "по объектам"/ "по группе в целом"
//		СостояниеФиксированногоАктива - состояние актива в налоговом учете:	"принят к учету"/"выбыл"/ "снят с учета"
//		ИтоговаяСтоимостьГруппыНУ	 - Стоимостный баланс по ГруппеУчетаФА
//		СтоимостьНУ					 - Стоимостный баланс по фиксированному активу
//		ВидОперацииПоАктиву			 - Вид регламентой операции (из числа взаимоисключающих), которая выполняется с активом в документе:
//									 1 - Признание дохода от превышения стоимости выбывших активов над стоимостным балансом группы
//									 2 - Списание стоимостного баланса при выбытии всех активов группы
//									 3 - Списание стоимостного баланса группы, если величина баланса менее установленого минимума (с. 111, п.2)
//									 4 - Начисление амортизации по активу
//		ПрименяемаяНормаАмортизации - Применяемая норма амортизации
//		РасчетнаяАмортизацияФА		- Сумма расчетной амортизации по активу
//		УчитыватьОтдельно			- Признак того, что данный актив учитывается отдельно от стоимостного баланса группы
//
Процедура СформироватьДвиженияГруппМенееМинимума(ТаблицаДанных, Реквизиты, Движения, Отказ)
	
	ПараметрыКлюча = Новый Структура("ВидАктиваНУ, ВидДвиженияСтоимостиНУ", Перечисления.ВидАктиваНУ.ФиксированныйАктив, Перечисления.ВидыДвиженияСтоимостиФА.СписаниеСтоимостногоБалансаГруппыМенееМинимума);
	КлючАналитики = РегистрыСведений.АналитикаУчетаВнеоборотныхАктивов.ЗначениеКлючаАналитики(ПараметрыКлюча);
	
	ПараметрыКлюча = Новый Структура("ВидАктиваНУ, ВидДвиженияСтоимостиНУ", Перечисления.ВидАктиваНУ.ФиксированныйАктив, Перечисления.ВидыДвиженияСтоимостиФА.СписаниеНакопленнойАмортизации);
	КлючАналитикиСписаниеАмортизации = РегистрыСведений.АналитикаУчетаВнеоборотныхАктивов.ЗначениеКлючаАналитики(ПараметрыКлюча);

	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
			
		Если СтрокаДанных.СтоимостьНУ = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		//Проводки
		Проводка = Движения.Хозрасчетный.Добавить();
		Проводка.Период      = Реквизиты.Период;
		Проводка.Организация = СтрокаДанных.Организация;
		
		Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.ПрочиеРасходыВНалоговомУчете;
		Проводка.СчетКт      = СтрокаДанных.СчетУчетаФА;
		
		//СубконтоДТ
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, ПланыВидовХарактеристик.СтатьиРасходов.СписаниеСтоимостногоБалансаГруппыМенееМинимума);
						
		//СубконтоКТ
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаДанных.ФиксированныйАктив);
		
		Если ТипЗнч(СтрокаДанных.ФиксированныйАктив) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаДанных.МОЛ);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, КлючАналитики);
		Иначе	
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, КлючАналитики);
		КонецЕсли;
		
		БухгалтерскийУчет.УстановитьПодразделенияПроводки(Проводка, СтрокаДанных.Подразделение, СтрокаДанных.Подразделение);
		
		СуммаНУ        = СтрокаДанных.СтоимостьНУ;
		СуммаПР        = 0;
		СуммаВР        = -СтрокаДанных.СтоимостьНУ;
		
		НалоговыйУчет.ЗаполнитьНалоговыеСуммыПроводки(СуммаНУ, СуммаНУ, СуммаПР, СуммаПР,
								СуммаВР, СуммаВР, Проводка, Реквизиты.ПоддержкаПБУ18);
								
		Проводка.Содержание = НСтр("ru='Стоимость группы менее минимума отнесена на вычеты'");
		
		//Формирование движений по РН СтоимостьОС и СтоимостьНМА
		Если Реквизиты.ИспользуетсяУправлениеВНА_2_4 Тогда
			
			Если ТипЗнч(СтрокаДанных.ФиксированныйАктив) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
				СтрокаСтоимостьВНА = Движения.СтоимостьОС.ДобавитьРасход();
				СтрокаСтоимостьВНА.ОсновноеСредство 		= СтрокаДанных.ФиксированныйАктив;
				СтрокаСтоимостьВНА.МОЛ 						= СтрокаДанных.МОЛ;
				СтрокаСтоимостьВНА.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.СписаниеОС;
			Иначе
				СтрокаСтоимостьВНА = Движения.СтоимостьНМА.ДобавитьРасход();
				СтрокаСтоимостьВНА.НематериальныйАктив 		= СтрокаДанных.ФиксированныйАктив;
				СтрокаСтоимостьВНА.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.СписаниеНМА;
			КонецЕсли;
			
			СтрокаСтоимостьВНА.Период = Реквизиты.Период;
			
			СтрокаСтоимостьВНА.Организация 				= СтрокаДанных.Организация;
			СтрокаСтоимостьВНА.Подразделение 			= СтрокаДанных.Подразделение;
			СтрокаСтоимостьВНА.ГруппаФинансовогоУчета 	= СтрокаДанных.ГруппаФинансовогоУчета;
			СтрокаСтоимостьВНА.НаправлениеДеятельности 	= СтрокаДанных.НаправлениеДеятельности;
			
			СтрокаСтоимостьВНА.СтоимостьНУ = СтрокаДанных.СтоимостьНУ;
			СтрокаСтоимостьВНА.СтоимостьВР = -СтрокаДанных.СтоимостьНУ;
			
			СтрокаСтоимостьВНА.КорПодразделение 				= СтрокаДанных.Подразделение;
			СтрокаСтоимостьВНА.КорСтатьяРасходов 				= ПланыВидовХарактеристик.СтатьиРасходов.СписаниеСтоимостногоБалансаГруппыМенееМинимума;
			СтрокаСтоимостьВНА.КорАналитикаРасходов 			= СтрокаДанных.ФиксированныйАктив;;
			СтрокаСтоимостьВНА.ВидАктиваИДвиженияСтоимостиНУ 	= КлючАналитики;
			СтрокаСтоимостьВНА.ОтражатьВРеглУчете 				= Истина;
			
		КонецЕсли;
		
		//Списание накопленной амортизации
		Если СтрокаДанных.АмортизацияКонечныйОстаток <> 0 Тогда
			Проводка = Движения.Хозрасчетный.Добавить();
			Проводка.Период      = Реквизиты.Период;
			Проводка.Организация = СтрокаДанных.Организация;
			
			Проводка.СчетДт      = СтрокаДанных.СчетАмортизацииФА;
			Проводка.СчетКт      = СтрокаДанных.СчетУчетаФА;
			
			//СубконтоДТ
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаДанных.ФиксированныйАктив);
			
			Если ТипЗнч(СтрокаДанных.ФиксированныйАктив) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаДанных.МОЛ);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, КлючАналитикиСписаниеАмортизации);
			Иначе	
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, КлючАналитикиСписаниеАмортизации);
			КонецЕсли;
			
			//СубконтоКТ
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаДанных.ФиксированныйАктив);
			
			Если ТипЗнч(СтрокаДанных.ФиксированныйАктив) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаДанных.МОЛ);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, КлючАналитикиСписаниеАмортизации);
			Иначе	
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, КлючАналитикиСписаниеАмортизации);
			КонецЕсли;
			
			БухгалтерскийУчет.УстановитьПодразделенияПроводки(Проводка, СтрокаДанных.Подразделение, СтрокаДанных.Подразделение);
			
			СуммаНУ        = СтрокаДанных.АмортизацияКонечныйОстаток;
			СуммаПР        = 0;
			СуммаВР        = -СтрокаДанных.АмортизацияКонечныйОстаток;
			
			НалоговыйУчет.ЗаполнитьНалоговыеСуммыПроводки(СуммаНУ, СуммаНУ, СуммаПР, СуммаПР,
									СуммаВР, СуммаВР, Проводка, Реквизиты.ПоддержкаПБУ18);
									
			Проводка.Содержание = НСтр("ru='Списана амортизация в НУ'");
			
			Если Реквизиты.ИспользуетсяУправлениеВНА_2_4 Тогда
				
				Если ТипЗнч(СтрокаДанных.ФиксированныйАктив) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
					СтрокаАмортизацияВНА = Движения.АмортизацияОС.ДобавитьПриход();
					СтрокаАмортизацияВНА.ОсновноеСредство 		= СтрокаДанных.ФиксированныйАктив;
					СтрокаАмортизацияВНА.МОЛ 					= СтрокаДанных.МОЛ;
					СтрокаАмортизацияВНА.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.СписаниеАмортизацииОС;
				Иначе
					СтрокаАмортизацияВНА = Движения.АмортизацияНМА.ДобавитьПриход();
					СтрокаАмортизацияВНА.НематериальныйАктив 	= СтрокаДанных.ФиксированныйАктив;
					СтрокаАмортизацияВНА.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.СписаниеАмортизацииНМА;
				КонецЕсли;
				
				СтрокаАмортизацияВНА.Период = Реквизиты.Период;
				
				СтрокаАмортизацияВНА.Организация 				= СтрокаДанных.Организация;
				СтрокаАмортизацияВНА.Подразделение 				= СтрокаДанных.Подразделение;
				СтрокаАмортизацияВНА.ГруппаФинансовогоУчета 	= СтрокаДанных.ГруппаФинансовогоУчета;
				СтрокаАмортизацияВНА.НаправлениеДеятельности 	= СтрокаДанных.НаправлениеДеятельности;
				
				СтрокаАмортизацияВНА.АмортизацияНУ = СтрокаДанных.АмортизацияКонечныйОстаток;
				СтрокаАмортизацияВНА.АмортизацияВР = -СтрокаДанных.АмортизацияКонечныйОстаток;
				
				СтрокаАмортизацияВНА.КорПодразделение 				= СтрокаДанных.Подразделение;
				СтрокаАмортизацияВНА.ВидАктиваИДвиженияСтоимостиНУ 	= КлючАналитикиСписаниеАмортизации;
				
				Если ТипЗнч(СтрокаДанных.ФиксированныйАктив) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
					СтрокаСтоимостьВНА = Движения.СтоимостьОС.ДобавитьРасход();
					СтрокаСтоимостьВНА.ОсновноеСредство 		= СтрокаДанных.ФиксированныйАктив;
					СтрокаСтоимостьВНА.МОЛ 						= СтрокаДанных.МОЛ;
					СтрокаСтоимостьВНА.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.СписаниеАмортизацииОС;
				Иначе
					СтрокаСтоимостьВНА = Движения.СтоимостьНМА.ДобавитьРасход();
					СтрокаСтоимостьВНА.НематериальныйАктив 		= СтрокаДанных.ФиксированныйАктив;
					СтрокаСтоимостьВНА.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.СписаниеАмортизацииНМА;
				КонецЕсли;
				
				СтрокаСтоимостьВНА.Период = Реквизиты.Период;
				
				СтрокаСтоимостьВНА.Организация 				= СтрокаДанных.Организация;
				СтрокаСтоимостьВНА.Подразделение 			= СтрокаДанных.Подразделение;
				СтрокаСтоимостьВНА.ГруппаФинансовогоУчета 	= СтрокаДанных.ГруппаФинансовогоУчета;
				СтрокаСтоимостьВНА.НаправлениеДеятельности 	= СтрокаДанных.НаправлениеДеятельности;
				
				СтрокаСтоимостьВНА.СтоимостьНУ = СтрокаДанных.АмортизацияКонечныйОстаток;
				СтрокаСтоимостьВНА.СтоимостьВР = -СтрокаДанных.АмортизацияКонечныйОстаток;
				
				СтрокаСтоимостьВНА.КорПодразделение 				= СтрокаДанных.Подразделение;
				СтрокаСтоимостьВНА.ВидАктиваИДвиженияСтоимостиНУ 	= КлючАналитикиСписаниеАмортизации;
				СтрокаСтоимостьВНА.ОтражатьВРеглУчете 				= Истина;
				
			КонецЕсли;

		КонецЕсли;	
		
		//Прочие расходы
		СтрокаРасходы = Движения.ПрочиеРасходы.Добавить();
		СтрокаРасходы.Период = Реквизиты.Период;
		СтрокаРасходы.Организация = СтрокаДанных.Организация; 
		
		СтрокаРасходы.СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.СписаниеСтоимостногоБалансаГруппыМенееМинимума;
		СтрокаРасходы.АналитикаРасходов = СтрокаДанных.ФиксированныйАктив;
		
		СтрокаРасходы.Подразделение = СтрокаДанных.Подразделение;
		СтрокаРасходы.ВременнаяРазница = -СтрокаДанных.СтоимостьНУ;
		
		СтрокаРасходы.СчетКт = СтрокаДанных.СчетУчетаФА;
		СтрокаРасходы.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочиеРасходы;
				
	КонецЦикла;		
	
	Движения.Хозрасчетный.Записывать 	= Истина;
	Движения.ПрочиеРасходы.Записывать 	= Истина;
	Движения.СтоимостьОС.Записывать 	= Истина;
	Движения.СтоимостьНМА.Записывать 	= Истина;
	Движения.АмортизацияОС.Записывать 	= Истина;
	Движения.АмортизацияНМА.Записывать 	= Истина;
	
КонецПроцедуры

Функция ПодготовитьТаблицуАмортизацииФАНУ(Реквизиты, МенеджерВременныхТаблиц)

	ЗапросПланаСчетов = РеглУчетВыборкиСерверПовтИсп.ЗапросПланаСчетов();
	ЗапросПланаСчетов.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросПланаСчетов.Выполнить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КонДата", Новый Граница (КонецГода(Реквизиты.Период),ВидГраницы.Включая));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
 	Если Реквизиты.ИспользуетсяУправлениеВНА_2_4 Тогда
		Запрос.Текст = "
		           |ВЫБРАТЬ
	               |	СпособыОтраженияРасходовОСБУ.ОсновноеСредство КАК ОбъектУчета,
	               |	СпособыОтраженияРасходовОСБУ.Организация КАК Организация,
				   |	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Подразделение,
	               |	СпособыОтраженияРасходовОСБУ.СтатьяРасходов КАК СтатьяРасходов,
	               |	СпособыОтраженияРасходовОСБУ.АналитикаРасходов КАК АналитикаРасходов,
	               |	СпособыОтраженияРасходовОСБУ.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	               |	СпособыОтраженияРасходовОСБУ.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	               |	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочнаяДебиторскаяЗадолженностьФилиаловИСтруктурныхПодразделений) КАК СчетПередачиРасходов,
				   |	ВЫБОР
				   |		КОГДА НЕ СпособыОтраженияРасходовОСБУ.СпособОтраженияРасходов = ЗНАЧЕНИЕ(Документ.ИзменениеПараметровОС2_4.ПустаяСсылка)
				   |			ТОГДА ИСТИНА
				   |		ИНАЧЕ ЛОЖЬ
				   |	КОНЕЦ КАК СпособОтраженияРасходовЗаданДокументом,
				   |	СпособыОтраженияРасходовОСБУ.СпособОтраженияРасходов КАК СпособОтраженияРасходов,
				   |	1 КАК Коэффициент
	               |ПОМЕСТИТЬ СпособыОтраженияРасходовБУ
	               |ИЗ
	               |	РегистрСведений.ПорядокУчетаОСБУ.СрезПоследних(
	               |			&КонДата,
	               |			(ОсновноеСредство, Организация) В
	               |				(ВЫБРАТЬ
	               |					ВЫРАЗИТЬ(ВТ_ОбъектыНалоговогоУчетаФА.ФиксированныйАктив КАК Справочник.ОбъектыЭксплуатации),
	               |					ВТ_ОбъектыНалоговогоУчетаФА.Организация
	               |				ИЗ
	               |					ВТ_ОбъектыНалоговогоУчетаФА)) КАК СпособыОтраженияРасходовОСБУ
	               |ГДЕ
	               |	СпособыОтраженияРасходовОСБУ.СпособОтраженияРасходов = ЗНАЧЕНИЕ(Документ.ИзменениеПараметровОС2_4.ПустаяСсылка)
		           |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СпособыОтраженияРасходовОСБУ.ОсновноеСредство,
	               |	СпособыОтраженияРасходовОСБУ.Организация,
				   |	ОтражениеАмортизационныхРасходов.Подразделение,
	               |	ОтражениеАмортизационныхРасходов.СтатьяРасходов,
	               |	ОтражениеАмортизационныхРасходов.АналитикаРасходов,
	               |	ОтражениеАмортизационныхРасходов.ПередаватьРасходыВДругуюОрганизацию,
	               |	ОтражениеАмортизационныхРасходов.ОрганизацияПолучательРасходов,
	               |	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочнаяДебиторскаяЗадолженностьФилиаловИСтруктурныхПодразделений),
				   |	ВЫБОР
				   |		КОГДА НЕ СпособыОтраженияРасходовОСБУ.СпособОтраженияРасходов = ЗНАЧЕНИЕ(Документ.ИзменениеПараметровОС2_4.ПустаяСсылка)
				   |			ТОГДА ИСТИНА
				   |		ИНАЧЕ ЛОЖЬ
				   |	КОНЕЦ,
				   |	СпособыОтраженияРасходовОСБУ.СпособОтраженияРасходов,
				   |	ОтражениеАмортизационныхРасходов.Коэффициент
	               |ИЗ
	               |	РегистрСведений.ПорядокУчетаОСБУ.СрезПоследних(
	               |			&КонДата,
	               |			(ОсновноеСредство, Организация) В
	               |				(ВЫБРАТЬ
	               |					ВЫРАЗИТЬ(ВТ_ОбъектыНалоговогоУчетаФА.ФиксированныйАктив КАК Справочник.ОбъектыЭксплуатации),
	               |					ВТ_ОбъектыНалоговогоУчетаФА.Организация
	               |				ИЗ
	               |					ВТ_ОбъектыНалоговогоУчетаФА)) КАК СпособыОтраженияРасходовОСБУ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеПараметровОС2_4.Амортизация КАК ОтражениеАмортизационныхРасходов
	               |		ПО СпособыОтраженияРасходовОСБУ.СпособОтраженияРасходов = ОтражениеАмортизационныхРасходов.Ссылка
	               |ГДЕ
	               |	НЕ СпособыОтраженияРасходовОСБУ.СпособОтраженияРасходов = ЗНАЧЕНИЕ(Документ.ИзменениеПараметровОС2_4.ПустаяСсылка)
				   |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СпособыОтраженияРасходовНМАБУ.НематериальныйАктив,
	               |	СпособыОтраженияРасходовНМАБУ.Организация,
				   |	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	               |	СпособыОтраженияРасходовНМАБУ.СтатьяРасходов,
	               |	СпособыОтраженияРасходовНМАБУ.АналитикаРасходов,
	               |	СпособыОтраженияРасходовНМАБУ.ПередаватьРасходыВДругуюОрганизацию,
	               |	СпособыОтраженияРасходовНМАБУ.ОрганизацияПолучательРасходов,
	               |	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочнаяДебиторскаяЗадолженностьФилиаловИСтруктурныхПодразделений) КАК СчетПередачиРасходов,
				   |	ВЫБОР
				   |		КОГДА НЕ СпособыОтраженияРасходовНМАБУ.СпособОтраженияРасходов = ЗНАЧЕНИЕ(Документ.ИзменениеПараметровНМА2_4.ПустаяСсылка)
				   |			ТОГДА ИСТИНА
				   |		ИНАЧЕ ЛОЖЬ
				   |	КОНЕЦ КАК СпособОтраженияРасходовЗаданДокументом,
				   |	СпособыОтраженияРасходовНМАБУ.СпособОтраженияРасходов,
				   |	1
	               |ИЗ
	               |	РегистрСведений.ПорядокУчетаНМАБУ.СрезПоследних(
	               |			&КонДата,
	               |			(НематериальныйАктив, Организация) В
	               |				(ВЫБРАТЬ
	               |					ВЫРАЗИТЬ(ВТ_ОбъектыНалоговогоУчетаФА.ФиксированныйАктив КАК Справочник.НематериальныеАктивы),
	               |					ВТ_ОбъектыНалоговогоУчетаФА.Организация
	               |				ИЗ
	               |					ВТ_ОбъектыНалоговогоУчетаФА)) КАК СпособыОтраженияРасходовНМАБУ
	               |ГДЕ
	               |	СпособыОтраженияРасходовНМАБУ.СпособОтраженияРасходов = ЗНАЧЕНИЕ(Документ.ИзменениеПараметровНМА2_4.ПустаяСсылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СпособыОтраженияРасходовНМАБУ.НематериальныйАктив,
	               |	СпособыОтраженияРасходовНМАБУ.Организация,
				   |	ОтражениеАмортизационныхРасходов.Подразделение,
	               |	ОтражениеАмортизационныхРасходов.СтатьяРасходов,
	               |	ОтражениеАмортизационныхРасходов.АналитикаРасходов,
	               |	ОтражениеАмортизационныхРасходов.ПередаватьРасходыВДругуюОрганизацию,
	               |	ОтражениеАмортизационныхРасходов.ОрганизацияПолучательРасходов,
	               |	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочнаяДебиторскаяЗадолженностьФилиаловИСтруктурныхПодразделений) КАК СчетПередачиРасходов,
				   |	ВЫБОР
				   |		КОГДА НЕ СпособыОтраженияРасходовНМАБУ.СпособОтраженияРасходов = ЗНАЧЕНИЕ(Документ.ИзменениеПараметровНМА2_4.ПустаяСсылка)
				   |			ТОГДА ИСТИНА
				   |		ИНАЧЕ ЛОЖЬ
				   |	КОНЕЦ КАК СпособОтраженияРасходовЗаданДокументом,
				   |	СпособыОтраженияРасходовНМАБУ.СпособОтраженияРасходов,
				   |	ОтражениеАмортизационныхРасходов.Коэффициент
	               |ИЗ
	               |	РегистрСведений.ПорядокУчетаНМАБУ.СрезПоследних(
	               |			&КонДата,
	               |			(НематериальныйАктив, Организация) В
	               |				(ВЫБРАТЬ
	               |					ВЫРАЗИТЬ(ВТ_ОбъектыНалоговогоУчетаФА.ФиксированныйАктив КАК Справочник.НематериальныеАктивы),
	               |					ВТ_ОбъектыНалоговогоУчетаФА.Организация
	               |				ИЗ
	               |					ВТ_ОбъектыНалоговогоУчетаФА)) КАК СпособыОтраженияРасходовНМАБУ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеПараметровНМА2_4.АмортизационныеРасходы КАК ОтражениеАмортизационныхРасходов
	               |		ПО СпособыОтраженияРасходовНМАБУ.СпособОтраженияРасходов = ОтражениеАмортизационныхРасходов.Ссылка
	               |ГДЕ
	               |	НЕ СпособыОтраженияРасходовНМАБУ.СпособОтраженияРасходов = ЗНАЧЕНИЕ(Документ.ИзменениеПараметровНМА2_4.ПустаяСсылка)
	               |;";
	Иначе	   
		Запрос.Текст ="
		           |ВЫБРАТЬ
	               |	СпособыОтраженияРасходовОСБУ.ОсновноеСредство КАК ОбъектУчета,
	               |	СпособыОтраженияРасходовОСБУ.Организация КАК Организация,
				   |	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка КАК Подразделение,
				   |	СпособыОтраженияРасходовОСБУ.СтатьяРасходов КАК СтатьяРасходов,
	               |	СпособыОтраженияРасходовОСБУ.АналитикаРасходов КАК АналитикаРасходов,
	               |	СпособыОтраженияРасходовОСБУ.ПередаватьРасходыВДругуюОрганизацию КАК ПередаватьРасходыВДругуюОрганизацию,
	               |	СпособыОтраженияРасходовОСБУ.ОрганизацияПолучательРасходов КАК ОрганизацияПолучательРасходов,
	               |	СпособыОтраженияРасходовОСБУ.СчетПередачиРасходов КАК СчетПередачиРасходов,
				   |	СпособыОтраженияРасходовОСБУ.СпособОтраженияРасходовЗаданДокументом КАК СпособОтраженияРасходовЗаданДокументом,
				   |	СпособыОтраженияРасходовОСБУ.СпособОтраженияРасходов КАК СпособОтраженияРасходов,
				   |	1 КАК Коэффициент
	               |ПОМЕСТИТЬ СпособыОтраженияРасходовБУ
	               |ИЗ
	               |	РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	               |			&КонДата,
	               |			(ОсновноеСредство, Организация) В
	               |				(ВЫБРАТЬ
	               |					ВЫРАЗИТЬ(ВТ_ОбъектыНалоговогоУчетаФА.ФиксированныйАктив КАК Справочник.ОбъектыЭксплуатации),
	               |					ВТ_ОбъектыНалоговогоУчетаФА.Организация
	               |				ИЗ
	               |					ВТ_ОбъектыНалоговогоУчетаФА)) КАК СпособыОтраженияРасходовОСБУ
	               |ГДЕ
	               |	СпособыОтраженияРасходовОСБУ.СпособОтраженияРасходовЗаданДокументом = ЛОЖЬ
		           |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СпособыОтраженияРасходовОСБУ.ОсновноеСредство,
	               |	СпособыОтраженияРасходовОСБУ.Организация,
				   |	ОтражениеАмортизационныхРасходов.Подразделение,
				   |	ОтражениеАмортизационныхРасходов.СтатьяРасходов,
	               |	ОтражениеАмортизационныхРасходов.АналитикаРасходов,
	               |	ОтражениеАмортизационныхРасходов.ПередаватьРасходыВДругуюОрганизацию,
	               |	ОтражениеАмортизационныхРасходов.ОрганизацияПолучательРасходов,
	               |	ОтражениеАмортизационныхРасходов.СчетПередачиРасходов,
				   |	СпособыОтраженияРасходовОСБУ.СпособОтраженияРасходовЗаданДокументом,
				   |	СпособыОтраженияРасходовОСБУ.СпособОтраженияРасходов,
				   |	ОтражениеАмортизационныхРасходов.Коэффициент
	               |ИЗ
	               |	РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	               |			&КонДата,
	               |			(ОсновноеСредство, Организация) В
	               |				(ВЫБРАТЬ
	               |					ВЫРАЗИТЬ(ВТ_ОбъектыНалоговогоУчетаФА.ФиксированныйАктив КАК Справочник.ОбъектыЭксплуатации),
	               |					ВТ_ОбъектыНалоговогоУчетаФА.Организация
	               |				ИЗ
	               |					ВТ_ОбъектыНалоговогоУчетаФА)) КАК СпособыОтраженияРасходовОСБУ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеПараметровОС.ОтражениеАмортизационныхРасходов КАК ОтражениеАмортизационныхРасходов
	               |		ПО СпособыОтраженияРасходовОСБУ.СпособОтраженияРасходов = ОтражениеАмортизационныхРасходов.Ссылка
	               |ГДЕ
	               |	СпособыОтраженияРасходовОСБУ.СпособОтраженияРасходовЗаданДокументом = ИСТИНА
				   |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СпособыОтраженияРасходовНМАБУ.НематериальныйАктив,
	               |	СпособыОтраженияРасходовНМАБУ.Организация,
				   |	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка,
	               |	СпособыОтраженияРасходовНМАБУ.СтатьяРасходов,
	               |	СпособыОтраженияРасходовНМАБУ.АналитикаРасходов,
	               |	СпособыОтраженияРасходовНМАБУ.ПередаватьРасходыВДругуюОрганизацию,
	               |	СпособыОтраженияРасходовНМАБУ.ОрганизацияПолучательРасходов,
	               |	СпособыОтраженияРасходовНМАБУ.СчетПередачиРасходов,
				   |	СпособыОтраженияРасходовНМАБУ.СпособОтраженияРасходовЗаданДокументом,
				   |	СпособыОтраженияРасходовНМАБУ.СпособОтраженияРасходов,
				   |	0
	               |ИЗ
	               |	РегистрСведений.СпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет.СрезПоследних(
	               |			&КонДата,
	               |			(НематериальныйАктив, Организация) В
	               |				(ВЫБРАТЬ
	               |					ВЫРАЗИТЬ(ВТ_ОбъектыНалоговогоУчетаФА.ФиксированныйАктив КАК Справочник.НематериальныеАктивы),
	               |					ВТ_ОбъектыНалоговогоУчетаФА.Организация
	               |				ИЗ
	               |					ВТ_ОбъектыНалоговогоУчетаФА)) КАК СпособыОтраженияРасходовНМАБУ
	               |ГДЕ
	               |	СпособыОтраженияРасходовНМАБУ.СпособОтраженияРасходовЗаданДокументом = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СпособыОтраженияРасходовНМАБУ.НематериальныйАктив,
	               |	СпособыОтраженияРасходовНМАБУ.Организация,
				   |	ОтражениеАмортизационныхРасходов.Подразделение,
				   |	ОтражениеАмортизационныхРасходов.СтатьяРасходов,
	               |	ОтражениеАмортизационныхРасходов.АналитикаРасходов,
	               |	ОтражениеАмортизационныхРасходов.ПередаватьРасходыВДругуюОрганизацию,
	               |	ОтражениеАмортизационныхРасходов.ОрганизацияПолучательРасходов,
	               |	ОтражениеАмортизационныхРасходов.СчетПередачиРасходов,
				   |	СпособыОтраженияРасходовНМАБУ.СпособОтраженияРасходовЗаданДокументом,
				   |	СпособыОтраженияРасходовНМАБУ.СпособОтраженияРасходов,
				   |	ОтражениеАмортизационныхРасходов.Коэффициент
	               |ИЗ
	               |	РегистрСведений.СпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет.СрезПоследних(
	               |			&КонДата,
	               |			(НематериальныйАктив, Организация) В
	               |				(ВЫБРАТЬ
	               |					ВЫРАЗИТЬ(ВТ_ОбъектыНалоговогоУчетаФА.ФиксированныйАктив КАК Справочник.НематериальныеАктивы),
	               |					ВТ_ОбъектыНалоговогоУчетаФА.Организация
	               |				ИЗ
	               |					ВТ_ОбъектыНалоговогоУчетаФА)) КАК СпособыОтраженияРасходовНМАБУ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеПараметровНМА.ОтражениеАмортизационныхРасходов КАК ОтражениеАмортизационныхРасходов
	               |		ПО СпособыОтраженияРасходовНМАБУ.СпособОтраженияРасходов = ОтражениеАмортизационныхРасходов.Ссылка
	               |ГДЕ
	               |	СпособыОтраженияРасходовНМАБУ.СпособОтраженияРасходовЗаданДокументом = ИСТИНА
	               |;";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Настройка.Организация КАК Организация,
	               |	Настройка.АналитикаУчета КАК АналитикаУчета,
	               |	Настройка.МестоУчета КАК МестоУчета,
	               |	Настройка.ВидСчетаРеглУчета КАК ВидСчетаРеглУчета,
	               |	Настройка.СчетУчета КАК СчетУчета,
	               |	ВЫБОР
	               |		КОГДА Настройка.ИспользоватьСубконто
	               |				И Настройка.ВидСубконто В (План.ВидСубконто1, План.ВидСубконто2, План.ВидСубконто3)
	               |			ТОГДА Настройка.ИспользоватьСубконто
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ИспользоватьСубконто,
	               |	ВЫБОР
	               |		КОГДА Настройка.ИспользоватьСубконто
	               |				И Настройка.ВидСубконто В (План.ВидСубконто1, План.ВидСубконто2, План.ВидСубконто3)
	               |			ТОГДА Настройка.ВидСубконто
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК ВидСубконто,
	               |	ВЫБОР
	               |		КОГДА Настройка.ИспользоватьСубконто
	               |				И Настройка.ВидСубконто В (План.ВидСубконто1, План.ВидСубконто2, План.ВидСубконто3)
	               |			ТОГДА Настройка.Субконто
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК Субконто
	               |ПОМЕСТИТЬ Счета
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПорядокУчета.Организация КАК Организация,
	               |		ПорядокУчета.СтатьяРасходов КАК АналитикаУчета,
	               |		ПорядокУчета.Подразделение КАК МестоУчета,
	               |		ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаРеглУчета,
	               |		ПорядокУчета.СчетУчета КАК СчетУчета,
	               |		ИСТИНА КАК ИспользоватьСубконто,
	               |		ПорядокУчета.ВидСубконто КАК ВидСубконто,
	               |		ПорядокУчета.СтатьяРасходов КАК Субконто
	               |	ИЗ
	               |		РегистрСведений.ПорядокОтраженияРасходов КАК ПорядокУчета
	               |	ГДЕ
	               |		ПорядокУчета.СпособНастройкиСчетовУчета = ЗНАЧЕНИЕ(Перечисление.СпособыНастройкиСчетовУчета.ОдинаковоДляВсехДокументов)) КАК Настройка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланХозрасчетный КАК План
	               |		ПО (План.Ссылка = Настройка.СчетУчета)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Настройка.АналитикаУчета КАК АналитикаУчета,
	               |	Настройка.ВидСчетаРеглУчета КАК ВидСчетаРеглУчета,
	               |	Настройка.СчетУчета КАК СчетУчета,
	               |	ВЫБОР
	               |		КОГДА Настройка.ИспользоватьСубконто
	               |				И Настройка.ВидСубконто В (План.ВидСубконто1, План.ВидСубконто2, План.ВидСубконто3)
	               |			ТОГДА Настройка.ИспользоватьСубконто
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ИспользоватьСубконто,
	               |	ВЫБОР
	               |		КОГДА Настройка.ИспользоватьСубконто
	               |				И Настройка.ВидСубконто В (План.ВидСубконто1, План.ВидСубконто2, План.ВидСубконто3)
	               |			ТОГДА Настройка.ВидСубконто
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК ВидСубконто,
	               |	ВЫБОР
	               |		КОГДА Настройка.ИспользоватьСубконто
	               |				И Настройка.ВидСубконто В (План.ВидСубконто1, План.ВидСубконто2, План.ВидСубконто3)
	               |			ТОГДА Настройка.Субконто
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК Субконто
	               |ПОМЕСТИТЬ СчетаПоУмолчанию
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПорядокУчета.Ссылка КАК АналитикаУчета,
	               |		ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчетаРеглУчета,
	               |		ПорядокУчета.СчетУчета КАК СчетУчета,
	               |		ВЫБОР
	               |			КОГДА ВидыСубконто.Ссылка ЕСТЬ NULL 
	               |				ТОГДА ЛОЖЬ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ КАК ИспользоватьСубконто,
	               |		ЕСТЬNULL(ВидыСубконто.ВидСубконто, НЕОПРЕДЕЛЕНО) КАК ВидСубконто,
	               |		ПорядокУчета.Ссылка КАК Субконто
	               |	ИЗ
	               |		ПланВидовХарактеристик.СтатьиРасходов КАК ПорядокУчета
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконто
	               |			ПО ПорядокУчета.СчетУчета = ВидыСубконто.Ссылка
	               |				И (ВидыСубконто.ВидСубконто В (ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.РасходыБудущихПериодов)))) КАК Настройка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланХозрасчетный КАК План
	               |		ПО (План.Ссылка = Настройка.СчетУчета)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИтоговаяТаблица.Организация,
	               |	ИтоговаяТаблица.ФиксированныйАктив,
	               |	ИтоговаяТаблица.Подразделение,
				   |	ВЫБОР 
			       |		КОГДА ЕСТЬNULL(СпособыОтраженияРасходовБУ.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) 
			       |			ТОГДА ИтоговаяТаблица.Подразделение
			       |		ИНАЧЕ СпособыОтраженияРасходовБУ.Подразделение 
				   |	КОНЕЦ КАК ПодразделениеЗатрат,
				   |	ИтоговаяТаблица.НаправлениеДеятельности,
				   |	ИтоговаяТаблица.ГруппаФинансовогоУчета,
				   |	ЕСТЬNULL(СпособыОтраженияРасходовБУ.СтатьяРасходов, НЕОПРЕДЕЛЕНО) КАК СтатьяРасходов,
	               |	ЕСТЬNULL(СпособыОтраженияРасходовБУ.АналитикаРасходов, НЕОПРЕДЕЛЕНО) КАК АналитикаРасходов,
				   |	ЕСТЬNULL(СпособыОтраженияРасходовБУ.Коэффициент, 0) КАК Коэффициент,
				   |	ИтоговаяТаблица.ГруппаУчетаФА,
				   |	ИтоговаяТаблица.ГруппаФА,		
				   |	ИтоговаяТаблица.СчетАмортизацииФА,
				   |	ИтоговаяТаблица.СостояниеФиксированногоАктива,
				   |	ИтоговаяТаблица.СтоимостьНУ,
				   |	ИтоговаяТаблица.ПрименяемаяНормаАмортизации,
				   |	ИтоговаяТаблица.РасчетнаяАмортизацияФА,
				   |	ИтоговаяТаблица.УчитыватьОтдельно,
				   |	ЕСТЬNULL(СпособыОтраженияРасходовБУ.ПередаватьРасходыВДругуюОрганизацию, НЕОПРЕДЕЛЕНО) КАК ПередаватьРасходыВДругуюОрганизацию,
				   |	ЕСТЬNULL(СпособыОтраженияРасходовБУ.ОрганизацияПолучательРасходов, НЕОПРЕДЕЛЕНО) КАК ОрганизацияПолучательРасходов,
				   |	ЕСТЬNULL(СпособыОтраженияРасходовБУ.СчетПередачиРасходов, НЕОПРЕДЕЛЕНО) КАК СчетПередачиРасходов,
				   |	СпособыОтраженияРасходовБУ.СпособОтраженияРасходовЗаданДокументом,
				   |	СпособыОтраженияРасходовБУ.СпособОтраженияРасходов,
				   |	ИтоговаяТаблица.МОЛ
				   |ПОМЕСТИТЬ ВТ_СпособыОтраженияРасходовФА
	               |ИЗ
	               |	ВТ_ИтоговаяТаблица КАК ИтоговаяТаблица
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияРасходовБУ КАК СпособыОтраженияРасходовБУ
	               |		ПО ИтоговаяТаблица.Организация = СпособыОтраженияРасходовБУ.Организация
	               |			И ИтоговаяТаблица.ФиксированныйАктив = СпособыОтраженияРасходовБУ.ОбъектУчета
				   |
	               |ГДЕ ИтоговаяТаблица.ВидОперацииПоАктиву = 4			
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	Данные.ГруппаУчетаФА,
				   |	Данные.ГруппаФА,		
				   |	Данные.СчетАмортизацииФА,
				   |	Данные.СостояниеФиксированногоАктива,
				   |	Данные.СтоимостьНУ,
				   |	Данные.ПрименяемаяНормаАмортизации,
				   |	Данные.РасчетнаяАмортизацияФА,
				   |	Данные.УчитыватьОтдельно,
				   |	Данные.ПередаватьРасходыВДругуюОрганизацию,
				   |	Данные.ОрганизацияПолучательРасходов,
				   |	Данные.СчетПередачиРасходов,
				   |	Данные.СпособОтраженияРасходовЗаданДокументом,
				   |	Данные.СпособОтраженияРасходов,
				   |	Данные.МОЛ,
				   |	Данные.Подразделение,
				   |	Данные.ПодразделениеЗатрат,
				   |	Данные.НаправлениеДеятельности,
				   |	Данные.ГруппаФинансовогоУчета,
				   |	Данные.Коэффициент,
				   |	Данные.Организация КАК Организация,
				   |	Данные.ФиксированныйАктив КАК ФиксированныйАктив,
				   |	Данные.СтатьяРасходов КАК СтатьяРасходов,
				   |	Данные.АналитикаРасходов КАК АналитикаРасходов,
				   |	ВЫБОР
				   |		КОГДА ЕСТЬNULL(СчетаДт.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)) <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
				   |			ТОГДА СчетаДт.СчетУчета
				   |		КОГДА ЕСТЬNULL(СчетаДтПоУмолчанию.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)) <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
				   |			ТОГДА СчетаДтПоУмолчанию.СчетУчета
				   |		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
				   |	КОНЕЦ КАК СчетРасходов
				   |ПОМЕСТИТЬ ВТ_ДанныеКОтражению
	               |ИЗ
	               |	ВТ_СпособыОтраженияРасходовФА КАК Данные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Счета КАК СчетаДт
	               |		ПО Данные.Организация = СчетаДт.Организация
	               |			И Данные.СтатьяРасходов = СчетаДт.АналитикаУчета
	               |			И Данные.Подразделение = СчетаДт.МестоУчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СчетаПоУмолчанию КАК СчетаДтПоУмолчанию
	               |		ПО Данные.СтатьяРасходов = СчетаДтПоУмолчанию.АналитикаУчета
				   |";
				   
	Запрос.Выполнить();
				   
	Запрос.Текст = "ВЫБРАТЬ
	               |	Данные.ГруппаУчетаФА,
	               |	Данные.ГруппаФА,
	               |	Данные.СчетАмортизацииФА,
	               |	Данные.СостояниеФиксированногоАктива,
	               |	Данные.СтоимостьНУ,
	               |	Данные.ПрименяемаяНормаАмортизации,
	               |	Данные.РасчетнаяАмортизацияФА,
	               |	Данные.УчитыватьОтдельно,
	               |	Данные.ПередаватьРасходыВДругуюОрганизацию,
	               |	Данные.ОрганизацияПолучательРасходов,
	               |	Данные.СчетПередачиРасходов,
	               |	Данные.СпособОтраженияРасходовЗаданДокументом,
	               |	Данные.СпособОтраженияРасходов,
	               |	Данные.МОЛ,
	               |	Данные.Подразделение,
				   |	Данные.ПодразделениеЗатрат,
				   |	Данные.НаправлениеДеятельности,
				   |	Данные.ГруппаФинансовогоУчета,
				   |	Данные.Коэффициент,
	               |	Данные.Организация КАК Организация,
	               |	Данные.ФиксированныйАктив КАК ФиксированныйАктив,
	               |	Данные.СтатьяРасходов КАК СтатьяРасходов,
	               |	Данные.АналитикаРасходов КАК АналитикаРасходов,
	               |	ВЫБОР КОГДА Данные.СчетРасходов В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СчетаПроизводственногоУчета)) ИЛИ Данные.СчетРасходов  = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
				   |		ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходыВНалоговомУчете)
				   |		ИНАЧЕ Данные.СчетРасходов
				   |	КОНЕЦ КАК СчетРасходов
	               |ИЗ
	               |	ВТ_ДанныеКОтражению КАК Данные
				   |ГДЕ
	               |	Данные.СпособОтраженияРасходовЗаданДокументом = ИСТИНА
				   |ИТОГИ
				   |	КОЛИЧЕСТВО(Данные.СтатьяРасходов),
				   |	СУММА(Данные.РасчетнаяАмортизацияФА),
				   |	СУММА(Данные.Коэффициент)
				   |ПО 
				   |	Данные.ФиксированныйАктив КАК ФиксированныйАктив
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Данные.ГруппаУчетаФА,
	               |	Данные.ГруппаФА,
	               |	Данные.СчетАмортизацииФА,
	               |	Данные.СостояниеФиксированногоАктива,
	               |	Данные.СтоимостьНУ,
	               |	Данные.ПрименяемаяНормаАмортизации,
	               |	Данные.РасчетнаяАмортизацияФА,
	               |	Данные.УчитыватьОтдельно,
	               |	Данные.ПередаватьРасходыВДругуюОрганизацию,
	               |	Данные.ОрганизацияПолучательРасходов,
	               |	Данные.СчетПередачиРасходов,
	               |	Данные.СпособОтраженияРасходовЗаданДокументом,
	               |	Данные.СпособОтраженияРасходов,
	               |	Данные.МОЛ,
	               |	Данные.Подразделение,
				   |	Данные.ПодразделениеЗатрат,
				   |	Данные.НаправлениеДеятельности,
				   |	Данные.ГруппаФинансовогоУчета,
				   |	Данные.Коэффициент,
	               |	Данные.Организация КАК Организация,
	               |	Данные.ФиксированныйАктив КАК ФиксированныйАктив,
	               |	Данные.СтатьяРасходов КАК СтатьяРасходов,
	               |	Данные.АналитикаРасходов КАК АналитикаРасходов,
	               |	ВЫБОР КОГДА Данные.СчетРасходов В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СчетаПроизводственногоУчета))  ИЛИ Данные.СчетРасходов  = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
				   |		ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходыВНалоговомУчете)
				   |		ИНАЧЕ Данные.СчетРасходов
				   |	КОНЕЦ КАК СчетРасходов
	               |ИЗ
	               |	ВТ_ДанныеКОтражению КАК Данные
	               |ГДЕ
	               |	Данные.СпособОтраженияРасходовЗаданДокументом = ЛОЖЬ";
	
	Результат = Запрос.ВыполнитьПакет();
	
	Возврат Результат;
	
КонецФункции // ()

Функция РаспределитьРасходыПоАмортизации(ТаблицаЗатрат, ДеревоАмортизации)
	
	Для Каждого СтрокаАмортизации Из ДеревоАмортизации.Строки Цикл
		ДобавитьСтрокиВТаблицуАмортизацииНУ(ТаблицаЗатрат, СтрокаАмортизации, СтрокаАмортизации.Строки);
	КонецЦикла;	
	
	Возврат ТаблицаЗатрат;
	
КонецФункции

Процедура ДобавитьСтрокиВТаблицуАмортизацииНУ(Таблица, Строка, ТаблицаРаспределения)
	
	Если (Строка.РасчетнаяАмортизацияФА = 0) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТаблицаРаспределения = Неопределено Тогда
		СтрокаТаблицыЗатрат = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыЗатрат, Строка);
		
	Иначе
		МассивКоэффицентов = ТаблицаРаспределения.ВыгрузитьКолонку("Коэффициент");
		Суммы = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Строка.РасчетнаяАмортизацияФА, МассивКоэффицентов);
		Коэффициенты = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Строка.Коэффициент, МассивКоэффицентов, 100);
		
		Если Суммы = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Для Индекс=0 По ТаблицаРаспределения.Количество()-1 Цикл
			ПравилоОтражения = ТаблицаРаспределения[Индекс];
			СтрокаТаблицыЗатрат = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыЗатрат, Строка);
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыЗатрат, ПравилоОтражения);
			СтрокаТаблицыЗатрат.Сумма = ?(Суммы = Неопределено, 0, Суммы[Индекс]);
			СтрокаТаблицыЗатрат.Коэффициент = ?(Коэффициенты=Неопределено, 0, Коэффициенты[Индекс]);
		КонецЦикла;
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область ВключениеАктивовВСтоимостныйБалансГруппы

Функция ПодготовитьПараметрыПроведенияВключениеАктивовВСБ(СтруктураШапки, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;

	Запрос = Новый Запрос;
		
	Запрос.УстановитьПараметр("Ссылка", СтруктураШапки.Ссылка);
	Запрос.УстановитьПараметр("Содержание",	НСтр("ru='Активы, учитываемые отдельно, включены в стоимостный баланс групп (НУ)'"));
	
	ПоддержкаПБУ18  = УчетнаяПолитика.ПоддержкаПБУ18(СтруктураШапки.Организация, СтруктураШапки.Дата);
	Запрос.УстановитьПараметр("ПоддержкаПБУ18", ПоддержкаПБУ18);
	
	Период  = НачалоГода(СтруктураШапки.Дата);
	ИспользуетсяУправлениеВНА_2_4 = ВнеоборотныеАктивы.ИспользуетсяУправлениеВНА_2_4(Период);
    Запрос.УстановитьПараметр("ИспользуетсяУправлениеВНА_2_4", ИспользуетсяУправлениеВНА_2_4);
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаВключениеАктивовВСтоимостныйБаланс(НомераТаблиц);
	Результат = Запрос.ВыполнитьПакет();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
	
КонецФункции

Функция ТекстЗапросаВключениеАктивовВСтоимостныйБаланс(НомераТаблиц)

	НомераТаблиц.Вставить("ТаблицаРеквизиты", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РегламентнаяОперация.Ссылка КАК Регистратор,
	|	РегламентнаяОперация.Организация КАК Организация,
	|	РегламентнаяОперация.Дата КАК Период,
	|	&Содержание КАК Содержание,
	|	&ПоддержкаПБУ18 КАК ПоддержкаПБУ18
	|,	&ИспользуетсяУправлениеВНА_2_4 КАК ИспользуетсяУправлениеВНА_2_4
	|ИЗ
	|	Документ.РегламентнаяОперация КАК РегламентнаяОперация
	|ГДЕ
	|	РегламентнаяОперация.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();

КонецФункции

Функция ПодготовитьТаблицыАктивыУчитываемыеОтдельно(ТаблицаРеквизиты, СписокОрганизаций, Отказ)
	
	Запрос = Новый Запрос;
	Реквизиты = ТаблицаРеквизиты[0];
	
	Запрос.УстановитьПараметр("НачДата", 									НачалоГода(Реквизиты.Период));
	Запрос.УстановитьПараметр("КонДата", 									КонецМесяца(Реквизиты.Период));
	Запрос.УстановитьПараметр("УчитываетсяОтдельноОтСтоимостногоБаланса",	Перечисления.СобытияФАУчитываемыхОтдельно.ПринятиеКУчету);	
	Запрос.УстановитьПараметр("СписокОрганизаций",							СписокОрганизаций);
	Запрос.УстановитьПараметр("ВидАктиваУчитываемогоОтдельно",				Перечисления.ВидАктиваНУ.ФиксированныйАктивУчитываемыйОтдельно);
	
	ИспользуетсяУправлениеВНА_2_4 = Реквизиты.ИспользуетсяУправлениеВНА_2_4;
	
	Если ИспользуетсяУправлениеВНА_2_4 Тогда
		СтоимостьВНААктуальна = ПроверитьАктуальностьРасчетаСтоимостиВНА(Реквизиты);
		
		Если НЕ СтоимостьВНААктуальна Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не выполнена регламентная операция по расчету стоимости ОС и НМА'"),
					Реквизиты.Регистратор.ПолучитьОбъект(),
					"",
					,
					Отказ);
		КонецЕсли;
	КонецЕсли;

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФиксированныеАктивыУчитываемыеОтдельноСрезПоследних.ФиксированныйАктив,
	|	ФиксированныеАктивыУчитываемыеОтдельноСрезПоследних.Организация,
	|	ФиксированныеАктивыУчитываемыеОтдельноСрезПоследних.ВидЛьготыФА
	|ПОМЕСТИТЬ ВТ_ФАУчитываемыеОтдельно
	|ИЗ
	|	РегистрСведений.ФиксированныеАктивыУчитываемыеОтдельно.СрезПоследних(&КонДата, Организация В (&СписокОрганизаций)) КАК ФиксированныеАктивыУчитываемыеОтдельноСрезПоследних
	|ГДЕ
	|	ФиксированныеАктивыУчитываемыеОтдельноСрезПоследних.Событие = &УчитываетсяОтдельноОтСтоимостногоБаланса
	|	И (ФиксированныеАктивыУчитываемыеОтдельноСрезПоследних.ВидЛьготыФА = ЗНАЧЕНИЕ(Перечисление.ВидыФАУчитываемыхОтдельно.ДвойнаяНормаАмортизации)
	|				И ФиксированныеАктивыУчитываемыеОтдельноСрезПоследних.Период < &НачДата
	|			ИЛИ ФиксированныеАктивыУчитываемыеОтдельноСрезПоследних.ВидЛьготыФА = ЗНАЧЕНИЕ(Перечисление.ВидыФАУчитываемыхОтдельно.ОбъектыПреференций)
	|				И ДОБАВИТЬКДАТЕ(ФиксированныеАктивыУчитываемыеОтдельноСрезПоследних.Период, ГОД, 3) < &НачДата)
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация, 
	|	ФиксированныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаУчетаОС.Организация КАК Организация,
	|	СчетаУчетаОС.ОсновноеСредство КАК ОбъектУчета,
	|	ВЫБОР
	|		КОГДА СчетаУчетаОС.ГруппаФинансовогоУчета = ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаВнеоборотныхАктивов.ПустаяСсылка)
	|			ТОГДА СчетаУчетаОС.СчетУчета
	|		ИНАЧЕ СчетаУчетаОС.ГруппаФинансовогоУчета.СчетУчета
	|	КОНЕЦ КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА СчетаУчетаОС.ГруппаФинансовогоУчета = ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаВнеоборотныхАктивов.ПустаяСсылка)
	|			ТОГДА СчетаУчетаОС.СчетНачисленияАмортизации
	|		ИНАЧЕ СчетаУчетаОС.ГруппаФинансовогоУчета.СчетУчетаАмортизации
	|	КОНЕЦ КАК СчетНачисленияАмортизации	
	|ПОМЕСТИТЬ ВТ_СчетаУчетаОСИНМА
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|			&НачДата,            
	|			Организация В (&СписокОрганизаций)
	|			И ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					ВЫРАЗИТЬ(ВТ_ФАУчитываемыеОтдельно.ФиксированныйАктив КАК Справочник.ОбъектыЭксплуатации)
	|				ИЗ
	|					ВТ_ФАУчитываемыеОтдельно)) КАК СчетаУчетаОС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетаУчетаНМА.Организация КАК Организация,
	|	СчетаУчетаНМА.НематериальныйАктив КАК ОбъектУчета,
	|	СчетаУчетаНМА."+?(ИспользуетсяУправлениеВНА_2_4, "ГруппаФинансовогоУчета.СчетУчета", "СчетУчета")+",
	|	СчетаУчетаНМА."+?(ИспользуетсяУправлениеВНА_2_4, "ГруппаФинансовогоУчета.СчетУчетаАмортизации", "СчетНачисленияАмортизации")+"
	|ИЗ
	|	РегистрСведений."+?(ИспользуетсяУправлениеВНА_2_4, "ПорядокУчетаНМА", "СчетаБухгалтерскогоУчетаНМА")+".СрезПоследних(
	|			&КонДата,
	|			Организация В (&СписокОрганизаций)
	|			И НематериальныйАктив В
	|				(ВЫБРАТЬ
	|					ВЫРАЗИТЬ(ВТ_ФАУчитываемыеОтдельно.ФиксированныйАктив КАК Справочник.НематериальныеАктивы)
	|				ИЗ
	|					ВТ_ФАУчитываемыеОтдельно)) КАК СчетаУчетаНМА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетаОСиНМА.Организация КАК Организация,
	|	СчетаОСиНМА.ОбъектУчета КАК ОбъектУчета,
	|	СчетаОСиНМА.СчетУчета,
	|	СчетаОСиНМА.СчетНачисленияАмортизации
	|ПОМЕСТИТЬ ВТ_СчетаУчетаАктивов
	|ИЗ
	|	ВТ_СчетаУчетаОСИНМА КАК СчетаОСиНМА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация, 
	|	ОбъектУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьВА.Организация КАК Организация,
	|	СтоимостьВА.Субконто1 КАК ФиксированныйАктив,
	|	СтоимостьВА.Подразделение КАК Подразделение,
	|	СтоимостьВА.Счет КАК Счет,
	|//НУ
	|	СУММА(ВЫБОР
	|		КОГДА СтоимостьВА.Субконто2 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	|			ТОГДА ВЫБОР
	|					КОГДА СтоимостьВА.Субконто2.ВидАктиваНУ = &ВидАктиваУчитываемогоОтдельно И СтоимостьВА.Субконто2.ВидДвиженияСтоимостиНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Поступление), ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.УвеличениеСтоимостиЗаСчетРемонта))
	|						ТОГДА СтоимостьВА.СуммаНУОборотДт - СтоимостьВА.СуммаНУОборотКт
	|				КОНЕЦ
	|		КОГДА СтоимостьВА.Субконто3 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	|			ТОГДА ВЫБОР
	|					КОГДА СтоимостьВА.Субконто3.ВидАктиваНУ = &ВидАктиваУчитываемогоОтдельно И СтоимостьВА.Субконто3.ВидДвиженияСтоимостиНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Поступление), ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.УвеличениеСтоимостиЗаСчетРемонта))
	|						ТОГДА СтоимостьВА.СуммаНУОборотДт - СтоимостьВА.СуммаНУОборотКт
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК ПоступлениеНУ,
	|	СУММА(ВЫБОР
	|		КОГДА СтоимостьВА.Субконто2 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	|			ТОГДА ВЫБОР
	|					КОГДА СтоимостьВА.Субконто2.ВидАктиваНУ = &ВидАктиваУчитываемогоОтдельно И СтоимостьВА.Субконто2.ВидДвиженияСтоимостиНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Выбытие), ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Перемещение))
	|						ТОГДА СтоимостьВА.СуммаНУОборотКт - СтоимостьВА.СуммаНУОборотДт
	|				КОНЕЦ
	|		КОГДА СтоимостьВА.Субконто3 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	|			ТОГДА ВЫБОР
	|					КОГДА СтоимостьВА.Субконто3.ВидАктиваНУ = &ВидАктиваУчитываемогоОтдельно И СтоимостьВА.Субконто3.ВидДвиженияСтоимостиНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Выбытие), ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Перемещение))
	|						ТОГДА СтоимостьВА.СуммаНУОборотКт - СтоимостьВА.СуммаНУОборотДт
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК ВыбытиеНУ,	
	|	МАКСИМУМ(СтоимостьВА.СуммаНУНачальныйОстатокДт) КАК НачальныйОстатокНУ,
	|	МАКСИМУМ(СтоимостьВА.СуммаНУКонечныйОстатокДт) КАК КонечныйОстатокНУ
	|
	//|//ПР
	//|	СУММА(ВЫБОР
	//|		КОГДА СтоимостьВА.Субконто2 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	//|			ТОГДА ВЫБОР
	//|					КОГДА СтоимостьВА.Субконто2.ВидАктиваНУ = &ВидАктиваУчитываемогоОтдельно И СтоимостьВА.Субконто2.ВидДвиженияСтоимостиНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Поступление), ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.УвеличениеСтоимостиЗаСчетРемонта))
	//|						ТОГДА СтоимостьВА.СуммаПРОборотДт - СтоимостьВА.СуммаПРОборотКт
	//|				КОНЕЦ
	//|		КОГДА СтоимостьВА.Субконто3 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	//|			ТОГДА ВЫБОР
	//|					КОГДА СтоимостьВА.Субконто3.ВидАктиваНУ = &ВидАктиваУчитываемогоОтдельно И СтоимостьВА.Субконто3.ВидДвиженияСтоимостиНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Поступление), ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.УвеличениеСтоимостиЗаСчетРемонта))
	//|						ТОГДА СтоимостьВА.СуммаПРОборотДт - СтоимостьВА.СуммаПРОборотКт
	//|				КОНЕЦ
	//|		ИНАЧЕ 0
	//|	КОНЕЦ) КАК ПоступлениеПР,
	//|	СУММА(ВЫБОР
	//|		КОГДА СтоимостьВА.Субконто2 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	//|			ТОГДА ВЫБОР
	//|					КОГДА СтоимостьВА.Субконто2.ВидАктиваНУ = &ВидАктиваУчитываемогоОтдельно И СтоимостьВА.Субконто2.ВидДвиженияСтоимостиНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Выбытие), ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Перемещение))
	//|						ТОГДА СтоимостьВА.СуммаПРОборотКт - СтоимостьВА.СуммаПРОборотДт
	//|				КОНЕЦ
	//|		КОГДА СтоимостьВА.Субконто3 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	//|			ТОГДА ВЫБОР
	//|					КОГДА СтоимостьВА.Субконто3.ВидАктиваНУ = &ВидАктиваУчитываемогоОтдельно И СтоимостьВА.Субконто3.ВидДвиженияСтоимостиНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Выбытие), ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Перемещение))
	//|						ТОГДА СтоимостьВА.СуммаПРОборотКт - СтоимостьВА.СуммаПРОборотДт
	//|				КОНЕЦ
	//|		ИНАЧЕ 0
	//|	КОНЕЦ) КАК ВыбытиеПР,	
	//|	МАКСИМУМ(СтоимостьВА.СуммаПРНачальныйОстатокДт) КАК НачальныйОстатокПР,
	//|	МАКСИМУМ(СтоимостьВА.СуммаПРКонечныйОстатокДт) КАК КонечныйОстатокПР,
	|
	//|//ВР
	//|	СУММА(ВЫБОР
	//|		КОГДА СтоимостьВА.Субконто2 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	//|			ТОГДА ВЫБОР
	//|					КОГДА СтоимостьВА.Субконто2.ВидАктиваНУ = &ВидАктиваУчитываемогоОтдельно И СтоимостьВА.Субконто2.ВидДвиженияСтоимостиНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Поступление), ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.УвеличениеСтоимостиЗаСчетРемонта))
	//|						ТОГДА СтоимостьВА.СуммаВРОборотДт - СтоимостьВА.СуммаВРОборотКт
	//|				КОНЕЦ
	//|		КОГДА СтоимостьВА.Субконто3 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	//|			ТОГДА ВЫБОР
	//|					КОГДА СтоимостьВА.Субконто3.ВидАктиваНУ = &ВидАктиваУчитываемогоОтдельно И СтоимостьВА.Субконто3.ВидДвиженияСтоимостиНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Поступление), ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.УвеличениеСтоимостиЗаСчетРемонта))
	//|						ТОГДА СтоимостьВА.СуммаВРОборотДт - СтоимостьВА.СуммаВРОборотКт
	//|				КОНЕЦ
	//|		ИНАЧЕ 0
	//|	КОНЕЦ) КАК ПоступлениеВР,
	//|	СУММА(ВЫБОР
	//|		КОГДА СтоимостьВА.Субконто2 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	//|			ТОГДА ВЫБОР
	//|					КОГДА СтоимостьВА.Субконто2.ВидАктиваНУ = &ВидАктиваУчитываемогоОтдельно И СтоимостьВА.Субконто2.ВидДвиженияСтоимостиНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Выбытие), ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Перемещение))
	//|						ТОГДА СтоимостьВА.СуммаВРОборотКт - СтоимостьВА.СуммаВРОборотДт
	//|				КОНЕЦ
	//|		КОГДА СтоимостьВА.Субконто3 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	//|			ТОГДА ВЫБОР
	//|					КОГДА СтоимостьВА.Субконто3.ВидАктиваНУ = &ВидАктиваУчитываемогоОтдельно И СтоимостьВА.Субконто3.ВидДвиженияСтоимостиНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Выбытие), ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияСтоимостиФА.Перемещение))
	//|						ТОГДА СтоимостьВА.СуммаВРОборотКт - СтоимостьВА.СуммаВРОборотДт
	//|				КОНЕЦ
	//|		ИНАЧЕ 0
	//|	КОНЕЦ) КАК ВыбытиеВР,	
	//|	МАКСИМУМ(СтоимостьВА.СуммаВРНачальныйОстатокДт) КАК НачальныйОстатокВР,
	//|	МАКСИМУМ(СтоимостьВА.СуммаВРКонечныйОстатокДт) КАК КонечныйОстатокВР
	|
	|
	|ПОМЕСТИТЬ ВТ_СтоимостьВА_НУ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|			&НачДата,
	|			&КонДата,
	|			,
	|			,
	|			Счет В ИЕРАРХИИ
	|				(ВЫБРАТЬ
	|					СчетаУчетаАктивов.СчетУчета
	|				ИЗ
	|					ВТ_СчетаУчетаАктивов КАК СчетаУчетаАктивов),
	|			,
	|			Организация В (&СписокОрганизаций)
	|			И (СУБКОНТО1 В
	|					(ВЫБРАТЬ
	|						ВЫРАЗИТЬ(ВТ_ФАУчитываемыеОтдельно.ФиксированныйАктив КАК Справочник.ОбъектыЭксплуатации)
	|					ИЗ
	|						ВТ_ФАУчитываемыеОтдельно)
	|				ИЛИ СУБКОНТО1 В
	|					(ВЫБРАТЬ
	|						ВЫРАЗИТЬ(ВТ_ФАУчитываемыеОтдельно.ФиксированныйАктив КАК Справочник.НематериальныеАктивы)
	|					ИЗ
	|						ВТ_ФАУчитываемыеОтдельно))) КАК СтоимостьВА
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьВА.Организация,
	|	СтоимостьВА.Подразделение,	
	|	СтоимостьВА.Субконто1,
	|	СтоимостьВА.Счет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Субконто1,
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АмортизацияВА.Организация КАК Организация,
	|	АмортизацияВА.Субконто1 КАК ФиксированныйАктив,
	|	АмортизацияВА.Подразделение КАК Подразделение,
	|	АмортизацияВА.Счет КАК Счет,
	|	СУММА(АмортизацияВА.СуммаНУОстатокКт) КАК КонечныйОстатокНУ
	//|	СУММА(ВЫБОР
	//|		КОГДА АмортизацияВА.Субконто2 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	//|			ТОГДА ВЫБОР
	//|					КОГДА АмортизацияВА.Субконто2.ВидАктиваНУ = &ВидАктиваУчитываемогоОтдельно
	//|						ТОГДА АмортизацияВА.СуммаПРОстатокКт
	//|				КОНЕЦ
	//|		КОГДА АмортизацияВА.Субконто3 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	//|			ТОГДА ВЫБОР
	//|					КОГДА АмортизацияВА.Субконто3.ВидАктиваНУ = &ВидАктиваУчитываемогоОтдельно
	//|						ТОГДА АмортизацияВА.СуммаПРОстатокКт
	//|				КОНЕЦ
	//|		ИНАЧЕ 0
	//|	КОНЕЦ) КАК КонечныйОстатокПР,
	//|	СУММА(ВЫБОР
	//|		КОГДА АмортизацияВА.Субконто2 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	//|			ТОГДА ВЫБОР
	//|					КОГДА АмортизацияВА.Субконто2.ВидАктиваНУ = &ВидАктиваУчитываемогоОтдельно
	//|						ТОГДА АмортизацияВА.СуммаВРОстатокКт
	//|				КОНЕЦ
	//|		КОГДА АмортизацияВА.Субконто3 ССЫЛКА Справочник.КлючиАналитикиУчетаВА
	//|			ТОГДА ВЫБОР
	//|					КОГДА АмортизацияВА.Субконто3.ВидАктиваНУ = &ВидАктиваУчитываемогоОтдельно
	//|						ТОГДА АмортизацияВА.СуммаВРОстатокКт
	//|				КОНЕЦ
	//|		ИНАЧЕ 0
	//|	КОНЕЦ) КАК КонечныйОстатокВР
	|ПОМЕСТИТЬ ВТ_АмортизацияВА_НУ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&КонДата,
	|			Счет В ИЕРАРХИИ
	|				(ВЫБРАТЬ
	|					СчетаУчетаАктивов.СчетНачисленияАмортизации
	|				ИЗ
	|					ВТ_СчетаУчетаАктивов КАК СчетаУчетаАктивов),
	|			,
	|			Организация В (&СписокОрганизаций)
	|			И (СУБКОНТО1 В
	|					(ВЫБРАТЬ
	|						ВЫРАЗИТЬ(ВТ_ФАУчитываемыеОтдельно.ФиксированныйАктив КАК Справочник.ОбъектыЭксплуатации)
	|					ИЗ
	|						ВТ_ФАУчитываемыеОтдельно)
	|				ИЛИ СУБКОНТО1 В
	|					(ВЫБРАТЬ
	|						ВЫРАЗИТЬ(ВТ_ФАУчитываемыеОтдельно.ФиксированныйАктив КАК Справочник.НематериальныеАктивы)
	|					ИЗ
	|						ВТ_ФАУчитываемыеОтдельно))) КАК АмортизацияВА
	|
	|СГРУППИРОВАТЬ ПО
	|	АмортизацияВА.Организация,
	|	АмортизацияВА.Подразделение,	
	|	АмортизацияВА.Субконто1,
	|	АмортизацияВА.Счет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Субконто1,
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФАУчитываемыеОтдельно.Организация КАК Организация,
	|	СтоимостьВА_НУ.Подразделение КАК Подразделение,
	|	ФАУчитываемыеОтдельно.ФиксированныйАктив КАК ФиксированныйАктив,
	|	ФАУчитываемыеОтдельно.ВидЛьготыФА КАК ВидЛьготыФА,
	|	СтоимостьВА_НУ.Счет КАК СчетУчета,
	|	ЕСТЬNULL(СтоимостьВА_НУ.НачальныйОстатокНУ, 0) + ЕСТЬNULL(СтоимостьВА_НУ.ПоступлениеНУ, 0) - ЕСТЬNULL(СтоимостьВА_НУ.ВыбытиеНУ, 0) - ЕСТЬNULL(АмортизацияВА_НУ.КонечныйОстатокНУ, 0) КАК СтоимостьНУ,
	//|	ЕСТЬNULL(СтоимостьВА_НУ.НачальныйОстатокПР, 0) + ЕСТЬNULL(СтоимостьВА_НУ.ПоступлениеПР, 0) - ЕСТЬNULL(СтоимостьВА_НУ.ВыбытиеПР, 0) КАК СтоимостьПР,
	//|	ЕСТЬNULL(СтоимостьВА_НУ.НачальныйОстатокВР, 0) + ЕСТЬNULL(СтоимостьВА_НУ.ПоступлениеВР, 0) - ЕСТЬNULL(СтоимостьВА_НУ.ВыбытиеВР, 0) КАК СтоимостьВР,
	//| 	АмортизацияВА_НУ.Счет КАК СчетАмортизации,  
	//|	ЕСТЬNULL(АмортизацияВА_НУ.КонечныйОстатокНУ, 0) КАК АмортизацияНУ,
	//|	ЕСТЬNULL(АмортизацияВА_НУ.КонечныйОстатокПР, 0) КАК АмортизацияПР,
	//|	ЕСТЬNULL(АмортизацияВА_НУ.КонечныйОстатокВР, 0) КАК АмортизацияВР,
	|	ЕСТЬNULL(МестонахождениеОС.МОЛ, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК МОЛ
	|,	ВЫБОР КОГДА ФАУчитываемыеОтдельно.ФиксированныйАктив ССЫЛКА Справочник.ОбъектыЭксплуатации 
	|		ТОГДА ЕстьNULL(ПорядокУчетаОС.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|	ИНАЧЕ 
	|		ЕстьNULL(ПорядокУчетаНМА.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|	КОНЕЦ КАК НаправлениеДеятельности,	
	|	ВЫБОР КОГДА ФАУчитываемыеОтдельно.ФиксированныйАктив ССЫЛКА Справочник.ОбъектыЭксплуатации 
	|		ТОГДА ЕстьNULL(ПорядокУчетаОС.ГруппаФинансовогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаВнеоборотныхАктивов.ПустаяСсылка))
	|	ИНАЧЕ 
	|		ЕстьNULL(ПорядокУчетаНМА.ГруппаФинансовогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаВнеоборотныхАктивов.ПустаяСсылка))
	|	КОНЕЦ КАК ГруппаФинансовогоУчета
	|ИЗ
	|	ВТ_ФАУчитываемыеОтдельно КАК ФАУчитываемыеОтдельно
	|   ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтоимостьВА_НУ КАК СтоимостьВА_НУ 
	|		ПО ФАУчитываемыеОтдельно.Организация = СтоимостьВА_НУ.Организация
	|		И ФАУчитываемыеОтдельно.ФиксированныйАктив = СтоимостьВА_НУ.ФиксированныйАктив
	|   ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АмортизацияВА_НУ КАК АмортизацияВА_НУ 
	|		ПО ФАУчитываемыеОтдельно.Организация = АмортизацияВА_НУ.Организация
	|		И ФАУчитываемыеОтдельно.ФиксированныйАктив = АмортизацияВА_НУ.ФиксированныйАктив
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(&КонДата) КАК МестонахождениеОС
	|		ПО (ВЫБОР КОГДА ФАУчитываемыеОтдельно.ФиксированныйАктив ССЫЛКА Справочник.ОбъектыЭксплуатации 
	|				ТОГДА ФАУчитываемыеОтдельно.ФиксированныйАктив = МестонахождениеОС.ОсновноеСредство
	|			ИНАЧЕ ЛОЖЬ КОНЕЦ)
	|			И ФАУчитываемыеОтдельно.Организация = МестонахождениеОС.Организация
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаОС.СрезПоследних(&КонДата) КАК ПорядокУчетаОС
	|		ПО (ВЫБОР КОГДА ФАУчитываемыеОтдельно.ФиксированныйАктив ССЫЛКА Справочник.ОбъектыЭксплуатации 
	|				ТОГДА ФАУчитываемыеОтдельно.ФиксированныйАктив = ПорядокУчетаОС.ОсновноеСредство
	|			ИНАЧЕ ЛОЖЬ КОНЕЦ)
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаНМА.СрезПоследних(&КонДата) КАК ПорядокУчетаНМА
	|		ПО (ВЫБОР КОГДА ФАУчитываемыеОтдельно.ФиксированныйАктив ССЫЛКА Справочник.НематериальныеАктивы 
	|				ТОГДА ФАУчитываемыеОтдельно.ФиксированныйАктив = ПорядокУчетаНМА.НематериальныйАктив
	|			ИНАЧЕ ЛОЖЬ КОНЕЦ)
	|			И ФАУчитываемыеОтдельно.Организация = ПорядокУчетаНМА.Организация
	|
	|ГДЕ
	|	(ЕСТЬNULL(СтоимостьВА_НУ.НачальныйОстатокНУ, 0) + ЕСТЬNULL(СтоимостьВА_НУ.ПоступлениеНУ, 0) - ЕСТЬNULL(СтоимостьВА_НУ.ВыбытиеНУ, 0) - ЕСТЬNULL(АмортизацияВА_НУ.КонечныйОстатокНУ, 0)) <> 0
	|";
	   	
	Результат = Запрос.Выполнить();
	Таблица = Результат.Выгрузить();
	
	Возврат Таблица;
	
КонецФункции	

Процедура СформироватьДвиженияВключениеАктивовВСтоимостныйБаланс(ТаблицаДанных, ТаблицаРеквизиты, Движения, Отказ)

	ПараметрыКлюча = Новый Структура("ВидАктиваНУ, ВидДвиженияСтоимостиНУ", Перечисления.ВидАктиваНУ.ФиксированныйАктив, Перечисления.ВидыДвиженияСтоимостиФА.Поступление);
	КлючАналитикиПоступлениеФА = РегистрыСведений.АналитикаУчетаВнеоборотныхАктивов.ЗначениеКлючаАналитики(ПараметрыКлюча);
	
	ПараметрыКлюча = Новый Структура("ВидАктиваНУ, ВидДвиженияСтоимостиНУ", Перечисления.ВидАктиваНУ.ФиксированныйАктивУчитываемыйОтдельно, Перечисления.ВидыДвиженияСтоимостиФА.Выбытие);
	КлючАналитикиВыбытиеФАОтдельно = РегистрыСведений.АналитикаУчетаВнеоборотныхАктивов.ЗначениеКлючаАналитики(ПараметрыКлюча);

	ПараметрыКлюча = Новый Структура("ВидАктиваНУ, ВидДвиженияСтоимостиНУ", Перечисления.ВидАктиваНУ.ФиксированныйАктив, Перечисления.ВидыДвиженияСтоимостиФА.Амортизация);
	КлючАналитикиАмортизацияФА = РегистрыСведений.АналитикаУчетаВнеоборотныхАктивов.ЗначениеКлючаАналитики(ПараметрыКлюча);
	
	ПараметрыКлюча = Новый Структура("ВидАктиваНУ, ВидДвиженияСтоимостиНУ", Перечисления.ВидАктиваНУ.ФиксированныйАктивУчитываемыйОтдельно, Перечисления.ВидыДвиженияСтоимостиФА.Амортизация);
	КлючАналитикиАмортизацияФАОтдельно = РегистрыСведений.АналитикаУчетаВнеоборотныхАктивов.ЗначениеКлючаАналитики(ПараметрыКлюча);

	СостояниеФиксированногоАктива  = Перечисления.ВидыСостоянийФА.ПринятКУчету;
	Событие 					   = Перечисления.СобытияФАУчитываемыхОтдельно.ВключениеВСоставГруппы;
	
	Реквизиты = ТаблицаРеквизиты[0];
	
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		//Проводки
		Если СтрокаДанных.СтоимостьНУ <> 0 Тогда 
			Проводка = Движения.Хозрасчетный.Добавить();
			Проводка.Период      = Реквизиты.Период;
			Проводка.Организация = СтрокаДанных.Организация;
			
			Проводка.СчетДт      = СтрокаДанных.СчетУчета;
			Проводка.СчетКт      = СтрокаДанных.СчетУчета;
			
			//СубконтоДТ
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаДанных.ФиксированныйАктив);
			Если ТипЗнч(СтрокаДанных.ФиксированныйАктив) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаДанных.МОЛ);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, КлючАналитикиПоступлениеФА);
			Иначе	
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, КлючАналитикиПоступлениеФА);
			КонецЕсли;
			
			//СубконтоКТ
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаДанных.ФиксированныйАктив);
			Если ТипЗнч(СтрокаДанных.ФиксированныйАктив) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаДанных.МОЛ);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, КлючАналитикиВыбытиеФАОтдельно);
			Иначе	
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, КлючАналитикиВыбытиеФАОтдельно);
			КонецЕсли;
			
			БухгалтерскийУчет.УстановитьПодразделенияПроводки(Проводка, СтрокаДанных.Подразделение, СтрокаДанных.Подразделение);
			
			СуммаНУ        = СтрокаДанных.СтоимостьНУ;
			СуммаПР        = 0;
			СуммаВР        = 0;
			
			НалоговыйУчет.ЗаполнитьНалоговыеСуммыПроводки(СуммаНУ, СуммаНУ, СуммаПР, СуммаПР,
									СуммаВР, СуммаВР, Проводка, Реквизиты.ПоддержкаПБУ18);
									
			Проводка.Содержание = Реквизиты.Содержание;
			
			//Формирование движений по РН СтоимостьОС и СтоимостьНМА
			Если Реквизиты.ИспользуетсяУправлениеВНА_2_4 Тогда
				
				Если ТипЗнч(СтрокаДанных.ФиксированныйАктив) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
					СтрокаСтоимостьВНА = Движения.СтоимостьОС.ДобавитьПриход();
					СтрокаСтоимостьВНА.ОсновноеСредство 		= СтрокаДанных.ФиксированныйАктив;
					СтрокаСтоимостьВНА.МОЛ 						= СтрокаДанных.МОЛ;
					СтрокаСтоимостьВНА.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.ПеремещениеОС;
				Иначе
					СтрокаСтоимостьВНА = Движения.СтоимостьНМА.ДобавитьПриход();
					СтрокаСтоимостьВНА.НематериальныйАктив 		= СтрокаДанных.ФиксированныйАктив;
					СтрокаСтоимостьВНА.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.ПеремещениеНМА;
				КонецЕсли;
				
				СтрокаСтоимостьВНА.Период = Реквизиты.Период;
				
				СтрокаСтоимостьВНА.Организация 				= СтрокаДанных.Организация;
				СтрокаСтоимостьВНА.Подразделение 			= СтрокаДанных.Подразделение;
				СтрокаСтоимостьВНА.ГруппаФинансовогоУчета 	= СтрокаДанных.ГруппаФинансовогоУчета;
				СтрокаСтоимостьВНА.НаправлениеДеятельности 	= СтрокаДанных.НаправлениеДеятельности;
				
				СтрокаСтоимостьВНА.СтоимостьНУ = СтрокаДанных.СтоимостьНУ;
								
				СтрокаСтоимостьВНА.КорПодразделение 				= СтрокаДанных.Подразделение;
				СтрокаСтоимостьВНА.ВидАктиваИДвиженияСтоимостиНУ 	= КлючАналитикиПоступлениеФА;
				СтрокаСтоимостьВНА.ОтражатьВРеглУчете 				= Истина;
				
				Если ТипЗнч(СтрокаДанных.ФиксированныйАктив) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
					СтрокаСтоимостьВНА = Движения.СтоимостьОС.ДобавитьРасход();
					СтрокаСтоимостьВНА.ОсновноеСредство 		= СтрокаДанных.ФиксированныйАктив;
					СтрокаСтоимостьВНА.МОЛ 						= СтрокаДанных.МОЛ;
					СтрокаСтоимостьВНА.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.ПеремещениеОС;
				Иначе
					СтрокаСтоимостьВНА = Движения.СтоимостьНМА.ДобавитьРасход();
					СтрокаСтоимостьВНА.НематериальныйАктив 		= СтрокаДанных.ФиксированныйАктив;
					СтрокаСтоимостьВНА.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.ПеремещениеНМА;
				КонецЕсли;
				
				СтрокаСтоимостьВНА.Период = Реквизиты.Период;
				
				СтрокаСтоимостьВНА.Организация 				= СтрокаДанных.Организация;
				СтрокаСтоимостьВНА.Подразделение 			= СтрокаДанных.Подразделение;
				СтрокаСтоимостьВНА.ГруппаФинансовогоУчета 	= СтрокаДанных.ГруппаФинансовогоУчета;
				СтрокаСтоимостьВНА.НаправлениеДеятельности 	= СтрокаДанных.НаправлениеДеятельности;
				
				СтрокаСтоимостьВНА.СтоимостьНУ = СтрокаДанных.СтоимостьНУ;
								
				СтрокаСтоимостьВНА.КорПодразделение 				= СтрокаДанных.Подразделение;
				СтрокаСтоимостьВНА.ВидАктиваИДвиженияСтоимостиНУ 	= КлючАналитикиВыбытиеФАОтдельно;
				СтрокаСтоимостьВНА.ОтражатьВРеглУчете 				= Истина;
			КонецЕсли;
			
		КонецЕсли;	
			
		//Если СтрокаДанных.АмортизацияНУ <> 0 ИЛИ СтрокаДанных.АмортизацияПР <> 0 ИЛИ СтрокаДанных.АмортизацияВР <> 0 Тогда
		//	
		//	Проводка = Движения.Хозрасчетный.Добавить();
		//	Проводка.Период      = Реквизиты.Период;
		//	Проводка.Организация = СтрокаДанных.Организация;
		//	
		//	Проводка.СчетДт      = СтрокаДанных.СчетАмортизации;
		//	Проводка.СчетКт      = СтрокаДанных.СчетАмортизации;
		//	
		//	//СубконтоДТ
		//	БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаДанных.ФиксированныйАктив);
		//	
		//	Если ТипЗнч(СтрокаДанных.ФиксированныйАктив) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
		//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаДанных.МОЛ);
		//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, КлючАналитикиАмортизацияФА);
		//	Иначе	
		//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, КлючАналитикиАмортизацияФА);
		//	КонецЕсли;
		//	
		//	//СубконтоКТ
		//	БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаДанных.ФиксированныйАктив);
		//	
		//	Если ТипЗнч(СтрокаДанных.ФиксированныйАктив) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
		//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаДанных.МОЛ);
		//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, КлючАналитикиАмортизацияФАОтдельно);
		//	Иначе	
		//		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, КлючАналитикиАмортизацияФАОтдельно);
		//	КонецЕсли;
		//	
		//	БухгалтерскийУчет.УстановитьПодразделенияПроводки(Проводка, СтрокаДанных.Подразделение, СтрокаДанных.Подразделение);
		//	
		//	СуммаНУ        = СтрокаДанных.АмортизацияНУ;
		//	СуммаПР        = СтрокаДанных.АмортизацияПР;
		//	СуммаВР        = СтрокаДанных.АмортизацияВР;
		//	
		//	НалоговыйУчет.ЗаполнитьНалоговыеСуммыПроводки(СуммаНУ, СуммаНУ, СуммаПР, СуммаПР,
		//							СуммаВР, СуммаВР, Проводка, Реквизиты.ПоддержкаПБУ18);
		//							
		//	Проводка.Содержание = Реквизиты.Содержание;
		//КонецЕсли;
		
		//Движения по регистру сведений ОбъектыНалоговогоУчетаФА
		Движение = Движения.ОбъектыНалоговогоУчетаФА.Добавить();
		Движение.Период 						= Реквизиты.Период;
		Движение.Организация 					= СтрокаДанных.Организация;
		Движение.ФиксированныйАктив 			= СтрокаДанных.ФиксированныйАктив;
		Движение.СостояниеФиксированногоАктива  = СостояниеФиксированногоАктива;		
		
		//Движения по регистру сведений ФиксированныеАктивыУчитываемыеОтдельно
		Движение = Движения.ФиксированныеАктивыУчитываемыеОтдельно.Добавить();
		Движение.Период 			= Реквизиты.Период;
		Движение.Организация 		= СтрокаДанных.Организация;
		Движение.ФиксированныйАктив = СтрокаДанных.ФиксированныйАктив;
		Движение.Событие 			= Событие;		
		Движение.ВидЛьготыФА 		= СтрокаДанных.ВидЛьготыФА;
		
	КонецЦикла;	
	
 	Движения.Хозрасчетный.Записывать = Истина;
	Движения.ОбъектыНалоговогоУчетаФА.Записывать = Истина;	
	Движения.ФиксированныеАктивыУчитываемыеОтдельно.Записывать = Истина;
	Движения.СтоимостьОС.Записывать 	= Истина;
	Движения.СтоимостьНМА.Записывать 	= Истина;
	
КонецПроцедуры
 
#КонецОбласти 

#Область СписаниеРезерваПоПереоценкеВНА

Функция ПодготовитьПараметрыСписанияРезерваПоПереоценкеВНА(СтруктураШапки, Отказ) Экспорт
	
	Период  = НачалоМесяца(СтруктураШапки.Дата);
	ИспользуетсяУправлениеВНА_2_4 = ВнеоборотныеАктивы.ИспользуетсяУправлениеВНА_2_4(Период);
	Если НЕ ИспользуетсяУправлениеВНА_2_4 Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ПараметрыПроведения = Новый Структура;

	Содержание  = НСтр("ru = 'Списание резерва по переоценке ОС'");
	
	Запрос = Новый Запрос;
		
	Запрос.УстановитьПараметр("Ссылка", СтруктураШапки.Ссылка);
	Запрос.УстановитьПараметр("Содержание", Содержание);
	
	ПоддержкаПБУ18  = УчетнаяПолитика.ПоддержкаПБУ18(СтруктураШапки.Организация, СтруктураШапки.Дата);
	Запрос.УстановитьПараметр("ПоддержкаПБУ18", ПоддержкаПБУ18);
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаПараметрыСписанияРезерваПереоценкиВНА(НомераТаблиц);
	Результат = Запрос.ВыполнитьПакет();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;
	
КонецФункции

Функция ТекстЗапросаПараметрыСписанияРезерваПереоценкиВНА(НомераТаблиц)

	НомераТаблиц.Вставить("ТаблицаРеквизиты", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РегламентнаяОперация.Ссылка КАК Регистратор,
	|	РегламентнаяОперация.Организация КАК Организация,
	|	РегламентнаяОперация.Дата КАК Период,
	|	&ПоддержкаПБУ18 КАК ПоддержкаПБУ18,
	|	&Содержание КАК Содержание
	|ИЗ
	|	Документ.РегламентнаяОперация КАК РегламентнаяОперация
	|ГДЕ
	|	РегламентнаяОперация.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();

КонецФункции

Функция ПодготовитьПараметрыСписанияРезерваПереоценки(ТаблицаРеквизиты)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы Параметры.Реквизиты
	СписокОбязательныхКолонок = ""
	+ "Период,"												// <Дата>
	+ "Организация,"										// <СправочникСсылка.Организации>
	+ "Регистратор,"										// <ДокументСсылка.*>
	+ "ПоддержкаПБУ18";
	
	Параметры.Вставить("Реквизиты", 
		ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(ТаблицаРеквизиты, СписокОбязательныхКолонок));
	
	Возврат Параметры;
	
КонецФункции

Функция ПодготовитьТаблицыСписанияРезерваПоПереоценкеВНА(ТаблицаРеквизиты, СписокОрганизаций, Отказ) Экспорт
	
	Параметры = ПодготовитьПараметрыСписанияРезерваПереоценки(ТаблицаРеквизиты);
	Если Параметры.Реквизиты.Количество() = 0 Тогда
		Отказ = Истина;
		Возврат Неопределено;
	КонецЕсли;
	
	Реквизиты = Параметры.Реквизиты[0];
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	СтруктураТаблиц = РассчитатьСписаниеРезерваПоПереоценкеВНА(Реквизиты, СписокОрганизаций, МенеджерВременныхТаблиц);
	
	Возврат СтруктураТаблиц;
	
КонецФункции

Функция РассчитатьСписаниеРезерваПоПереоценкеВНА(Реквизиты, СписокОрганизаций, МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Если Константы.ПорядокУчетаВНАВУпрУчете.Получить() = Перечисления.ПорядокУчетаВНАВУпрУчете.ПоСтандартамМУ 
		//Т.к. переоценка ОС не учитывается в месяце ее отражения, то данную функциональность пока не используем
		И ПолучитьФункциональнуюОпцию("ОтключенныйФункционал") Тогда
		Период = Новый Граница (КонецМесяца(Реквизиты.Период),ВидГраницы.Включая);
	Иначе
		Период = НачалоМесяца(Реквизиты.Период);
	КонецЕсли;
	Запрос.УстановитьПараметр("Период",           				Период);
	Запрос.УстановитьПараметр("ГраницаРезерва",					Новый Граница(Реквизиты.Регистратор.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("НачДата",           				НачалоМесяца(Реквизиты.Период));
	Запрос.УстановитьПараметр("КонДата",           				Новый Граница (КонецМесяца(Реквизиты.Период),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", 	  				Реквизиты.Организация);
	Запрос.УстановитьПараметр("СписокОрганизаций", 				СписокОрганизаций);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	СтоимостьОСОстатки.Организация КАК Организация,
	|	СтоимостьОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОСОстатки.РезервПереоценкиСтоимостиНачальныйОстаток КАК РезервСтоимости,
	|	СтоимостьОСОстатки.РезервПереоценкиСтоимостиРеглНачальныйОстаток КАК РезервСтоимостиРегл,
	|	0 КАК РезервАмортизации,
	|	0 КАК РезервАмортизацииРегл,
	|	СтоимостьОСОстатки.РезервПереоценкиСтоимостиКонечныйОстаток КАК РезервСтоимостиНаКонец,
	|	СтоимостьОСОстатки.РезервПереоценкиСтоимостиРеглКонечныйОстаток КАК РезервСтоимостиРеглНаКонец,
	|	0 КАК РезервАмортизацииНаКонец,
	|	0 КАК РезервАмортизацииРеглНаКонец
	|ПОМЕСТИТЬ ВТ_ОстаткиРезерваПереоценкиОС
	|ИЗ
	|	РегистрНакопления.СтоимостьОС.ОстаткиИОбороты(&Период, &ГраницаРезерва, Период, , Организация В (&СписокОрганизаций)) КАК СтоимостьОСОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АмортизацияОСОстатки.Организация,
	|	АмортизацияОСОстатки.ОсновноеСредство,
	|	0,
	|	0,
	|	АмортизацияОСОстатки.РезервПереоценкиАмортизацииНачальныйОстаток,
	|	АмортизацияОСОстатки.РезервПереоценкиАмортизацииРеглНачальныйОстаток,
	|	0,
	|	0,
	|	АмортизацияОСОстатки.РезервПереоценкиАмортизацииКонечныйОстаток,
	|	АмортизацияОСОстатки.РезервПереоценкиАмортизацииРеглКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.АмортизацияОС.ОстаткиИОбороты(&Период, &ГраницаРезерва, Период, , Организация В (&СписокОрганизаций)) КАК АмортизацияОСОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиРезерваПереоценки.Организация КАК Организация,
	|	ВТ_ОстаткиРезерваПереоценки.ОсновноеСредство КАК ОсновноеСредство,
	|	СУММА(ВТ_ОстаткиРезерваПереоценки.РезервСтоимости) КАК РезервСтоимости,
	|	СУММА(ВТ_ОстаткиРезерваПереоценки.РезервСтоимостиРегл) КАК РезервСтоимостиРегл,
	|	СУММА(ВТ_ОстаткиРезерваПереоценки.РезервАмортизации) КАК РезервАмортизации,
	|	СУММА(ВТ_ОстаткиРезерваПереоценки.РезервАмортизацииРегл) КАК РезервАмортизацииРегл
	|ПОМЕСТИТЬ ВТ_ОстаткиРезервовПереоценкиОСИтоги
	|ИЗ
	|	ВТ_ОстаткиРезерваПереоценкиОС КАК ВТ_ОстаткиРезерваПереоценки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиРезерваПереоценки.Организация,
	|	ВТ_ОстаткиРезерваПереоценки.ОсновноеСредство
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ВТ_ОстаткиРезерваПереоценки.РезервСтоимости) > 0
	|			И СУММА(ВТ_ОстаткиРезерваПереоценки.РезервСтоимостиНаКонец) > 0
	|		ИЛИ СУММА(ВТ_ОстаткиРезерваПереоценки.РезервСтоимостиРегл) > 0
	|			И СУММА(ВТ_ОстаткиРезерваПереоценки.РезервСтоимостиРеглНаКонец) > 0
	|		ИЛИ СУММА(ВТ_ОстаткиРезерваПереоценки.РезервАмортизации) > 0
	|			И СУММА(ВТ_ОстаткиРезерваПереоценки.РезервАмортизацииНаКонец) > 0
	|		ИЛИ СУММА(ВТ_ОстаткиРезерваПереоценки.РезервАмортизацииРегл) > 0
	|			И СУММА(ВТ_ОстаткиРезерваПереоценки.РезервАмортизацииРеглНаКонец) > 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АмортизацияОСОбороты.Организация КАК Организация,
	|	АмортизацияОСОбороты.ОсновноеСредство КАК ОсновноеСредство,
	|	СУММА(АмортизацияОСОбороты.АмортизацияРасход) КАК АмортизацияРасход,
	|	СУММА(АмортизацияОСОбороты.АмортизацияРеглРасход) КАК АмортизацияРеглРасход
	|ПОМЕСТИТЬ ВТ_АмортизацияОСЗаМесяц
	|ИЗ
	|	РегистрНакопления.АмортизацияОС.Обороты(
	|			&НачДата,
	|			&КонДата,
	|			Регистратор,
	|			(Организация, ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					ВТ_ОстаткиРезервовПереоценкиОСИтоги.Организация КАК Организация,
	|					ВТ_ОстаткиРезервовПереоценкиОСИтоги.ОсновноеСредство КАК ОсновноеСредство
	|				ИЗ
	|					ВТ_ОстаткиРезервовПереоценкиОСИтоги КАК ВТ_ОстаткиРезервовПереоценкиОСИтоги)) КАК АмортизацияОСОбороты
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(АмортизацияОСОбороты.Регистратор) = ТИП(Документ.АмортизацияОС2_4)
	|
	|СГРУППИРОВАТЬ ПО
	|	АмортизацияОСОбороты.ОсновноеСредство,
	|	АмортизацияОСОбороты.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьОСОстатки.Организация КАК Организация,
	|	СтоимостьОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОСОстатки.СтоимостьОстаток КАК ОстаточнаяСтоимость,
	|	СтоимостьОСОстатки.СтоимостьРеглОстаток КАК ОстаточнаяСтоимостьРегл
	|ПОМЕСТИТЬ ВТ_СтоимостьОСНаКонец
	|ИЗ
	|	РегистрНакопления.СтоимостьОС.Остатки(
	|			&Период,
	|			(Организация, ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					ВТ_ОстаткиРезервовПереоценкиОСИтоги.Организация КАК Организация,
	|					ВТ_ОстаткиРезервовПереоценкиОСИтоги.ОсновноеСредство КАК ОсновноеСредство
	|				ИЗ
	|					ВТ_ОстаткиРезервовПереоценкиОСИтоги КАК ВТ_ОстаткиРезервовПереоценкиОСИтоги)) КАК СтоимостьОСОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АмортизацияОСОстатки.Организация,
	|	АмортизацияОСОстатки.ОсновноеСредство,
	|	АмортизацияОСОстатки.АмортизацияОстаток,
	|	АмортизацияОСОстатки.АмортизацияРеглОстаток
	|ИЗ
	|	РегистрНакопления.АмортизацияОС.Остатки(
	|			&Период,
	|			(Организация, ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					ВТ_ОстаткиРезервовПереоценкиОСИтоги.Организация КАК Организация,
	|					ВТ_ОстаткиРезервовПереоценкиОСИтоги.ОсновноеСредство КАК ОсновноеСредство
	|				ИЗ
	|					ВТ_ОстаткиРезервовПереоценкиОСИтоги КАК ВТ_ОстаткиРезервовПереоценкиОСИтоги)) КАК АмортизацияОСОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СтоимостьНаКонец.Организация КАК Организация,
	|	ВТ_СтоимостьНаКонец.ОсновноеСредство КАК ОсновноеСредство,
	|	СУММА(ВТ_СтоимостьНаКонец.ОстаточнаяСтоимость) КАК ОстаточнаяСтоимость,
	|	СУММА(ВТ_СтоимостьНаКонец.ОстаточнаяСтоимостьРегл) КАК ОстаточнаяСтоимостьРегл
	|ПОМЕСТИТЬ ВТ_ОстаточнаяСтоимостьОСНаКонецИтоги
	|ИЗ
	|	ВТ_СтоимостьОСНаКонец КАК ВТ_СтоимостьНаКонец
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СтоимостьНаКонец.Организация,
	|	ВТ_СтоимостьНаКонец.ОсновноеСредство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиРезервовПереоценкиИтоги.Организация КАК Организация,
	|	ВТ_ОстаткиРезервовПереоценкиИтоги.ОсновноеСредство КАК ОсновноеСредство,
	|	ЕСТЬNULL(МестонахождениеОССрезПоследних.МОЛ, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК МОЛ,
	|	ВТ_ОстаткиРезервовПереоценкиИтоги.РезервСтоимости КАК РезервСтоимости,
	|	ВТ_ОстаткиРезервовПереоценкиИтоги.РезервСтоимостиРегл КАК РезервСтоимостиРегл,
	|	ВТ_ОстаткиРезервовПереоценкиИтоги.РезервАмортизации * -1 КАК РезервАмортизации,
	|	ВТ_ОстаткиРезервовПереоценкиИтоги.РезервАмортизацииРегл * -1 КАК РезервАмортизацииРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ОстаточнаяСтоимостьНаКонецИтоги.ОстаточнаяСтоимость, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ВТ_АмортизацияЗаМесяц.АмортизацияРасход, 0) / ВТ_ОстаточнаяСтоимостьНаКонецИтоги.ОстаточнаяСтоимость
	|	КОНЕЦ КАК КоэффициентСписанияРезерва,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ОстаточнаяСтоимостьНаКонецИтоги.ОстаточнаяСтоимостьРегл, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ВТ_АмортизацияЗаМесяц.АмортизацияРеглРасход, 0) / ВТ_ОстаточнаяСтоимостьНаКонецИтоги.ОстаточнаяСтоимостьРегл
	|	КОНЕЦ КАК КоэффициентСписанияРезерваРегл
	|ПОМЕСТИТЬ ВТ_ИтогиРезерваПереоценкиОСКСписанию
	|ИЗ
	|	ВТ_ОстаткиРезервовПереоценкиОСИтоги КАК ВТ_ОстаткиРезервовПереоценкиИтоги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АмортизацияОСЗаМесяц КАК ВТ_АмортизацияЗаМесяц
	|		ПО ВТ_ОстаткиРезервовПереоценкиИтоги.Организация = ВТ_АмортизацияЗаМесяц.Организация
	|			И ВТ_ОстаткиРезервовПереоценкиИтоги.ОсновноеСредство = ВТ_АмортизацияЗаМесяц.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаточнаяСтоимостьОСНаКонецИтоги КАК ВТ_ОстаточнаяСтоимостьНаКонецИтоги
	|		ПО ВТ_ОстаткиРезервовПереоценкиИтоги.Организация = ВТ_ОстаточнаяСтоимостьНаКонецИтоги.Организация
	|			И ВТ_ОстаткиРезервовПереоценкиИтоги.ОсновноеСредство = ВТ_ОстаточнаяСтоимостьНаКонецИтоги.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОС.СрезПоследних(
	|				&КонДата,
	|				(Организация, ОсновноеСредство) В
	|					(ВЫБРАТЬ
	|						ВТ_ОстаткиРезервовПереоценкиИтоги.Организация КАК Организация,
	|						ВТ_ОстаткиРезервовПереоценкиИтоги.ОсновноеСредство КАК ОсновноеСредство
	|					ИЗ
	|						ВТ_ОстаткиРезервовПереоценкиОСИтоги КАК ВТ_ОстаткиРезервовПереоценкиИтоги)) КАК МестонахождениеОССрезПоследних
	|		ПО ВТ_ОстаткиРезервовПереоценкиИтоги.Организация = МестонахождениеОССрезПоследних.Организация
	|			И ВТ_ОстаткиРезервовПереоценкиИтоги.ОсновноеСредство = МестонахождениеОССрезПоследних.ОсновноеСредство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИтогиРезерваПереоценкиКСписанию.Организация КАК Организация,
	|	ВТ_ИтогиРезерваПереоценкиКСписанию.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОСОстатки.Подразделение КАК Подразделение,
	|	СтоимостьОСОстатки.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СтоимостьОСОстатки.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВТ_ИтогиРезерваПереоценкиКСписанию.МОЛ КАК МОЛ,
	|	ВЫРАЗИТЬ(ВТ_ИтогиРезерваПереоценкиКСписанию.РезервСтоимости * ВТ_ИтогиРезерваПереоценкиКСписанию.КоэффициентСписанияРезерва КАК ЧИСЛО(15, 2)) КАК СуммаСписанияРезерваСтоимости,
	|	ВЫРАЗИТЬ(ВТ_ИтогиРезерваПереоценкиКСписанию.РезервСтоимостиРегл * ВТ_ИтогиРезерваПереоценкиКСписанию.КоэффициентСписанияРезерваРегл КАК ЧИСЛО(15, 2)) КАК СуммаСписанияРезерваСтоимостиРегл,
	|	ВЫРАЗИТЬ(ВТ_ИтогиРезерваПереоценкиКСписанию.РезервАмортизации * ВТ_ИтогиРезерваПереоценкиКСписанию.КоэффициентСписанияРезерва КАК ЧИСЛО(15, 2)) КАК СуммаСписанияРезерваАмортизации,
	|	ВЫРАЗИТЬ(ВТ_ИтогиРезерваПереоценкиКСписанию.РезервАмортизацииРегл * ВТ_ИтогиРезерваПереоценкиКСписанию.КоэффициентСписанияРезерваРегл КАК ЧИСЛО(15, 2)) КАК СуммаСписанияРезерваАмортизацииРегл
	|ИЗ
	|	ВТ_ИтогиРезерваПереоценкиОСКСписанию КАК ВТ_ИтогиРезерваПереоценкиКСписанию
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС.Остатки(
	|				&КонДата,
	|				(Организация, ОсновноеСредство) В
	|					(ВЫБРАТЬ
	|						ВТ_ОстаткиРезервовПереоценкиОСИтоги.Организация КАК Организация,
	|						ВТ_ОстаткиРезервовПереоценкиОСИтоги.ОсновноеСредство КАК ОсновноеСредство
	|					ИЗ
	|						ВТ_ОстаткиРезервовПереоценкиОСИтоги КАК ВТ_ОстаткиРезервовПереоценкиОСИтоги)) КАК СтоимостьОСОстатки
	|		ПО ВТ_ИтогиРезерваПереоценкиКСписанию.Организация = СтоимостьОСОстатки.Организация
	|			И ВТ_ИтогиРезерваПереоценкиКСписанию.ОсновноеСредство = СтоимостьОСОстатки.ОсновноеСредство";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаДляРасчетаОС = РезультатЗапроса.Выгрузить();
	
	МассивТаблицРасчета = Новый Структура;
	МассивТаблицРасчета.Вставить("ТаблицаДляРасчетаОС", ТаблицаДляРасчетаОС);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	СтоимостьНМАОстатки.Организация КАК Организация,
	|	СтоимостьНМАОстатки.НематериальныйАктив КАК НематериальныйАктив,
	|	СтоимостьНМАОстатки.РезервПереоценкиСтоимостиНачальныйОстаток КАК РезервСтоимости,
	|	СтоимостьНМАОстатки.РезервПереоценкиСтоимостиРеглНачальныйОстаток КАК РезервСтоимостиРегл,
	|	0 КАК РезервАмортизации,
	|	0 КАК РезервАмортизацииРегл,
	|	СтоимостьНМАОстатки.РезервПереоценкиСтоимостиКонечныйОстаток КАК РезервСтоимостиНаКонец,
	|	СтоимостьНМАОстатки.РезервПереоценкиСтоимостиРеглКонечныйОстаток КАК РезервСтоимостиРеглНаКонец,
	|	0 КАК РезервАмортизацииНаКонец,
	|	0 КАК РезервАмортизацииРеглНаКонец
	|ПОМЕСТИТЬ ВТ_ОстаткиРезерваПереоценкиНМА
	|ИЗ
	|	РегистрНакопления.СтоимостьНМА.ОстаткиИОбороты(&Период, &ГраницаРезерва, Период, , Организация В (&СписокОрганизаций)) КАК СтоимостьНМАОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АмортизацияНМАОстатки.Организация,
	|	АмортизацияНМАОстатки.НематериальныйАктив,
	|	0,
	|	0,
	|	АмортизацияНМАОстатки.РезервПереоценкиАмортизацииНачальныйОстаток,
	|	АмортизацияНМАОстатки.РезервПереоценкиАмортизацииРеглНачальныйОстаток,
	|	0,
	|	0,
	|	АмортизацияНМАОстатки.РезервПереоценкиАмортизацииКонечныйОстаток,
	|	АмортизацияНМАОстатки.РезервПереоценкиАмортизацииРеглКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.АмортизацияНМА.ОстаткиИОбороты(&Период, &ГраницаРезерва, Период, , Организация В (&СписокОрганизаций)) КАК АмортизацияНМАОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиРезерваПереоценки.Организация КАК Организация,
	|	ВТ_ОстаткиРезерваПереоценки.НематериальныйАктив КАК НематериальныйАктив,
	|	СУММА(ВТ_ОстаткиРезерваПереоценки.РезервСтоимости) КАК РезервСтоимости,
	|	СУММА(ВТ_ОстаткиРезерваПереоценки.РезервСтоимостиРегл) КАК РезервСтоимостиРегл,
	|	СУММА(ВТ_ОстаткиРезерваПереоценки.РезервАмортизации) КАК РезервАмортизации,
	|	СУММА(ВТ_ОстаткиРезерваПереоценки.РезервАмортизацииРегл) КАК РезервАмортизацииРегл
	|ПОМЕСТИТЬ ВТ_ОстаткиРезервовПереоценкиНМАИтоги
	|ИЗ
	|	ВТ_ОстаткиРезерваПереоценкиНМА КАК ВТ_ОстаткиРезерваПереоценки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиРезерваПереоценки.Организация,
	|	ВТ_ОстаткиРезерваПереоценки.НематериальныйАктив
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ВТ_ОстаткиРезерваПереоценки.РезервСтоимости) > 0
	|			И СУММА(ВТ_ОстаткиРезерваПереоценки.РезервСтоимостиНаКонец) > 0
	|		ИЛИ СУММА(ВТ_ОстаткиРезерваПереоценки.РезервСтоимостиРегл) > 0
	|			И СУММА(ВТ_ОстаткиРезерваПереоценки.РезервСтоимостиРеглНаКонец) > 0
	|		ИЛИ СУММА(ВТ_ОстаткиРезерваПереоценки.РезервАмортизации) > 0
	|			И СУММА(ВТ_ОстаткиРезерваПереоценки.РезервАмортизацииНаКонец) > 0
	|		ИЛИ СУММА(ВТ_ОстаткиРезерваПереоценки.РезервАмортизацииРегл) > 0
	|			И СУММА(ВТ_ОстаткиРезерваПереоценки.РезервАмортизацииРеглНаКонец) > 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АмортизацияНМАОбороты.Организация КАК Организация,
	|	АмортизацияНМАОбороты.НематериальныйАктив КАК НематериальныйАктив,
	|	СУММА(АмортизацияНМАОбороты.АмортизацияРасход) КАК АмортизацияРасход,
	|	СУММА(АмортизацияНМАОбороты.АмортизацияРеглРасход) КАК АмортизацияРеглРасход
	|ПОМЕСТИТЬ ВТ_АмортизацияНМАЗаМесяц
	|ИЗ
	|	РегистрНакопления.АмортизацияНМА.Обороты(
	|			&НачДата,
	|			&КонДата,
	|			Регистратор,
	|			(Организация, НематериальныйАктив) В
	|				(ВЫБРАТЬ
	|					ВТ_ОстаткиРезервовПереоценкиНМАИтоги.Организация КАК Организация,
	|					ВТ_ОстаткиРезервовПереоценкиНМАИтоги.НематериальныйАктив КАК НематериальныйАктив
	|				ИЗ
	|					ВТ_ОстаткиРезервовПереоценкиНМАИтоги КАК ВТ_ОстаткиРезервовПереоценкиНМАИтоги)) КАК АмортизацияНМАОбороты
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(АмортизацияНМАОбороты.Регистратор) = ТИП(Документ.АмортизацияНМА2_4)
	|
	|СГРУППИРОВАТЬ ПО
	|	АмортизацияНМАОбороты.НематериальныйАктив,
	|	АмортизацияНМАОбороты.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьНМАОстатки.Организация КАК Организация,
	|	СтоимостьНМАОстатки.НематериальныйАктив КАК НематериальныйАктив,
	|	СтоимостьНМАОстатки.СтоимостьОстаток КАК ОстаточнаяСтоимость,
	|	СтоимостьНМАОстатки.СтоимостьРеглОстаток КАК ОстаточнаяСтоимостьРегл
	|ПОМЕСТИТЬ ВТ_СтоимостьНМАНаКонец
	|ИЗ
	|	РегистрНакопления.СтоимостьНМА.Остатки(
	|			&Период,
	|			(Организация, НематериальныйАктив) В
	|				(ВЫБРАТЬ
	|					ВТ_ОстаткиРезервовПереоценкиНМАИтоги.Организация КАК Организация,
	|					ВТ_ОстаткиРезервовПереоценкиНМАИтоги.НематериальныйАктив КАК НематериальныйАктив
	|				ИЗ
	|					ВТ_ОстаткиРезервовПереоценкиНМАИтоги КАК ВТ_ОстаткиРезервовПереоценкиНМАИтоги)) КАК СтоимостьНМАОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АмортизацияНМАОстатки.Организация,
	|	АмортизацияНМАОстатки.НематериальныйАктив,
	|	АмортизацияНМАОстатки.АмортизацияОстаток,
	|	АмортизацияНМАОстатки.АмортизацияРеглОстаток
	|ИЗ
	|	РегистрНакопления.АмортизацияНМА.Остатки(
	|			&Период,
	|			(Организация, НематериальныйАктив) В
	|				(ВЫБРАТЬ
	|					ВТ_ОстаткиРезервовПереоценкиНМАИтоги.Организация КАК Организация,
	|					ВТ_ОстаткиРезервовПереоценкиНМАИтоги.НематериальныйАктив КАК НематериальныйАктив
	|				ИЗ
	|					ВТ_ОстаткиРезервовПереоценкиНМАИтоги КАК ВТ_ОстаткиРезервовПереоценкиНМАИтоги)) КАК АмортизацияНМАОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СтоимостьНаКонец.Организация КАК Организация,
	|	ВТ_СтоимостьНаКонец.НематериальныйАктив КАК НематериальныйАктив,
	|	СУММА(ВТ_СтоимостьНаКонец.ОстаточнаяСтоимость) КАК ОстаточнаяСтоимость,
	|	СУММА(ВТ_СтоимостьНаКонец.ОстаточнаяСтоимостьРегл) КАК ОстаточнаяСтоимостьРегл
	|ПОМЕСТИТЬ ВТ_ОстаточнаяСтоимостьНМАНаКонецИтоги
	|ИЗ
	|	ВТ_СтоимостьНМАНаКонец КАК ВТ_СтоимостьНаКонец
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СтоимостьНаКонец.Организация,
	|	ВТ_СтоимостьНаКонец.НематериальныйАктив
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиРезервовПереоценкиИтоги.Организация КАК Организация,
	|	ВТ_ОстаткиРезервовПереоценкиИтоги.НематериальныйАктив КАК НематериальныйАктив,
	|	ВТ_ОстаткиРезервовПереоценкиИтоги.РезервСтоимости КАК РезервСтоимости,
	|	ВТ_ОстаткиРезервовПереоценкиИтоги.РезервСтоимостиРегл КАК РезервСтоимостиРегл,
	|	ВТ_ОстаткиРезервовПереоценкиИтоги.РезервАмортизации * -1 КАК РезервАмортизации,
	|	ВТ_ОстаткиРезервовПереоценкиИтоги.РезервАмортизацииРегл * -1 КАК РезервАмортизацииРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ОстаточнаяСтоимостьНаКонецИтоги.ОстаточнаяСтоимость, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ВТ_АмортизацияЗаМесяц.АмортизацияРасход, 0) / ВТ_ОстаточнаяСтоимостьНаКонецИтоги.ОстаточнаяСтоимость
	|	КОНЕЦ КАК КоэффициентСписанияРезерва,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ОстаточнаяСтоимостьНаКонецИтоги.ОстаточнаяСтоимостьРегл, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ВТ_АмортизацияЗаМесяц.АмортизацияРеглРасход, 0) / ВТ_ОстаточнаяСтоимостьНаКонецИтоги.ОстаточнаяСтоимостьРегл
	|	КОНЕЦ КАК КоэффициентСписанияРезерваРегл
	|ПОМЕСТИТЬ ВТ_ИтогиРезерваПереоценкиНМАКСписанию
	|ИЗ
	|	ВТ_ОстаткиРезервовПереоценкиНМАИтоги КАК ВТ_ОстаткиРезервовПереоценкиИтоги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АмортизацияНМАЗаМесяц КАК ВТ_АмортизацияЗаМесяц
	|		ПО ВТ_ОстаткиРезервовПереоценкиИтоги.Организация = ВТ_АмортизацияЗаМесяц.Организация
	|			И ВТ_ОстаткиРезервовПереоценкиИтоги.НематериальныйАктив = ВТ_АмортизацияЗаМесяц.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаточнаяСтоимостьНМАНаКонецИтоги КАК ВТ_ОстаточнаяСтоимостьНаКонецИтоги
	|		ПО ВТ_ОстаткиРезервовПереоценкиИтоги.Организация = ВТ_ОстаточнаяСтоимостьНаКонецИтоги.Организация
	|			И ВТ_ОстаткиРезервовПереоценкиИтоги.НематериальныйАктив = ВТ_ОстаточнаяСтоимостьНаКонецИтоги.НематериальныйАктив
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИтогиРезерваПереоценкиКСписанию.Организация КАК Организация,
	|	ВТ_ИтогиРезерваПереоценкиКСписанию.НематериальныйАктив КАК НематериальныйАктив,
	|	СтоимостьНМАОстатки.Подразделение КАК Подразделение,
	|	СтоимостьНМАОстатки.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СтоимостьНМАОстатки.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВЫРАЗИТЬ(ВТ_ИтогиРезерваПереоценкиКСписанию.РезервСтоимости * ВТ_ИтогиРезерваПереоценкиКСписанию.КоэффициентСписанияРезерва КАК ЧИСЛО(15, 2)) КАК СуммаСписанияРезерваСтоимости,
	|	ВЫРАЗИТЬ(ВТ_ИтогиРезерваПереоценкиКСписанию.РезервСтоимостиРегл * ВТ_ИтогиРезерваПереоценкиКСписанию.КоэффициентСписанияРезерваРегл КАК ЧИСЛО(15, 2)) КАК СуммаСписанияРезерваСтоимостиРегл,
	|	ВЫРАЗИТЬ(ВТ_ИтогиРезерваПереоценкиКСписанию.РезервАмортизации * ВТ_ИтогиРезерваПереоценкиКСписанию.КоэффициентСписанияРезерва КАК ЧИСЛО(15, 2)) КАК СуммаСписанияРезерваАмортизации,
	|	ВЫРАЗИТЬ(ВТ_ИтогиРезерваПереоценкиКСписанию.РезервАмортизацииРегл * ВТ_ИтогиРезерваПереоценкиКСписанию.КоэффициентСписанияРезерваРегл КАК ЧИСЛО(15, 2)) КАК СуммаСписанияРезерваАмортизацииРегл
	|ИЗ
	|	ВТ_ИтогиРезерваПереоценкиНМАКСписанию КАК ВТ_ИтогиРезерваПереоценкиКСписанию
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьНМА.Остатки(
	|				&КонДата,
	|				(Организация, НематериальныйАктив) В
	|					(ВЫБРАТЬ
	|						ВТ_ОстаткиРезервовПереоценкиНМАИтоги.Организация КАК Организация,
	|						ВТ_ОстаткиРезервовПереоценкиНМАИтоги.НематериальныйАктив КАК НематериальныйАктив
	|					ИЗ
	|						ВТ_ОстаткиРезервовПереоценкиНМАИтоги КАК ВТ_ОстаткиРезервовПереоценкиНМАИтоги)) КАК СтоимостьНМАОстатки
	|		ПО ВТ_ИтогиРезерваПереоценкиКСписанию.Организация = СтоимостьНМАОстатки.Организация
	|			И ВТ_ИтогиРезерваПереоценкиКСписанию.НематериальныйАктив = СтоимостьНМАОстатки.НематериальныйАктив";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаДляРасчетаНМА = РезультатЗапроса.Выгрузить();
	
	МассивТаблицРасчета.Вставить("ТаблицаДляРасчетаНМА", ТаблицаДляРасчетаНМА);

	Возврат МассивТаблицРасчета;
	
КонецФункции

Процедура СформироватьДвиженияСписаниеРезерваПоПереоценкеВНА(ТаблицаСписанияРезерваВНА, ТаблицаРеквизиты, Движения, Отказ)
	
	Реквизиты = ТаблицаРеквизиты[0];
	
	//Движения по списанию резерва переоценки основных средств
	Для Каждого СтрокаСписанияРезерва Из ТаблицаСписанияРезерваВНА.ТаблицаДляРасчетаОС Цикл
		
		//Формирование движений по РН СтоимостьОС
		СтрокаСтоимостьОС = Движения.СтоимостьОС.ДобавитьРасход();
		СтрокаСтоимостьОС.Период = Реквизиты.Период;
		ЗаполнитьЗначенияСвойств(СтрокаСтоимостьОС, СтрокаСписанияРезерва);
		СтрокаСтоимостьОС.РезервПереоценкиСтоимости = СтрокаСписанияРезерва.СуммаСписанияРезерваСтоимости;
		СтрокаСтоимостьОС.РезервПереоценкиСтоимостиРегл = СтрокаСписанияРезерва.СуммаСписанияРезерваСтоимостиРегл;
		СтрокаСтоимостьОС.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеРезерваПереоценкиСтоимостиОС;
		
		//Формирование движений по РН АмортизацияОС
		СтрокаАмортизацияОС = Движения.АмортизацияОС.ДобавитьПриход();
		СтрокаАмортизацияОС.Период = Реквизиты.Период;
		ЗаполнитьЗначенияСвойств(СтрокаАмортизацияОС, СтрокаСписанияРезерва);
		СтрокаАмортизацияОС.РезервПереоценкиАмортизации = СтрокаСписанияРезерва.СуммаСписанияРезерваАмортизации;
		СтрокаАмортизацияОС.РезервПереоценкиАмортизацииРегл = СтрокаСписанияРезерва.СуммаСписанияРезерваАмортизацииРегл;
		СтрокаАмортизацияОС.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеРезерваПереоценкиАмортизацииОС;
		
		//Формирование проводок
		Проводка = Движения.Хозрасчетный.Добавить();
		Проводка.Период      = Реквизиты.Период;
		Проводка.Организация = СтрокаСписанияРезерва.Организация;
		
		Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.РезервНаПереоценкуОсновныхСредств;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаСписанияРезерва.ОсновноеСредство);
		
		Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода;
		
		БухгалтерскийУчет.УстановитьПодразделенияПроводки(Проводка, СтрокаСписанияРезерва.Подразделение, СтрокаСписанияРезерва.Подразделение);
		
		СуммаСписанияРезерваОС = СтрокаСписанияРезерва.СуммаСписанияРезерваСтоимостиРегл - СтрокаСписанияРезерва.СуммаСписанияРезерваАмортизацииРегл;
		Проводка.Сумма = СуммаСписанияРезерваОС;
		СуммаНУ        = 0;
		СуммаПР        = СуммаСписанияРезерваОС;
		СуммаВР        = 0;
		
		НалоговыйУчет.ЗаполнитьНалоговыеСуммыПроводки(СуммаНУ, СуммаНУ, СуммаПР, СуммаПР,
		СуммаВР, СуммаВР, Проводка, Реквизиты.ПоддержкаПБУ18);
		
		Проводка.Содержание = НСтр("ru='Списание резерва по переоценке ОС'");
	КонецЦикла;
	
	//Движения по списанию резерва переоценки нематериальных активов
	Для Каждого СтрокаСписанияРезерва Из ТаблицаСписанияРезерваВНА.ТаблицаДляРасчетаНМА Цикл
		
		//Формирование движений по РН СтоимостьНМА
		СтрокаСтоимостьНМА = Движения.СтоимостьНМА.ДобавитьРасход();
		СтрокаСтоимостьНМА.Период = Реквизиты.Период;
		ЗаполнитьЗначенияСвойств(СтрокаСтоимостьНМА, СтрокаСписанияРезерва);
		СтрокаСтоимостьНМА.РезервПереоценкиСтоимости = СтрокаСписанияРезерва.СуммаСписанияРезерваСтоимости;
		СтрокаСтоимостьНМА.РезервПереоценкиСтоимостиРегл = СтрокаСписанияРезерва.СуммаСписанияРезерваСтоимостиРегл;
		СтрокаСтоимостьНМА.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеРезерваПереоценкиСтоимостиНМА;
		
		//Формирование движений по РН АмортизацияНМА
		СтрокаАмортизацияНМА = Движения.АмортизацияНМА.ДобавитьПриход();
		СтрокаАмортизацияНМА.Период = Реквизиты.Период;
		ЗаполнитьЗначенияСвойств(СтрокаАмортизацияНМА, СтрокаСписанияРезерва);
		СтрокаАмортизацияНМА.РезервПереоценкиАмортизации = СтрокаСписанияРезерва.СуммаСписанияРезерваАмортизации;
		СтрокаАмортизацияНМА.РезервПереоценкиАмортизацииРегл = СтрокаСписанияРезерва.СуммаСписанияРезерваАмортизацииРегл;
		СтрокаАмортизацияНМА.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеРезерваПереоценкиАмортизацииНМА;
		
		//Формирование проводок
		Проводка = Движения.Хозрасчетный.Добавить();
		Проводка.Период      = Реквизиты.Период;
		Проводка.Организация = СтрокаСписанияРезерва.Организация;
		
		Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.РезервНаПереоценкуНематериальныхАктивов;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаСписанияРезерва.НематериальныйАктив);
		
		Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода;
		
		БухгалтерскийУчет.УстановитьПодразделенияПроводки(Проводка, СтрокаСписанияРезерва.Подразделение, СтрокаСписанияРезерва.Подразделение);
		
		СуммаСписанияРезерваОС = СтрокаСписанияРезерва.СуммаСписанияРезерваСтоимостиРегл - СтрокаСписанияРезерва.СуммаСписанияРезерваАмортизацииРегл;
		Проводка.Сумма = СуммаСписанияРезерваОС;
		СуммаНУ        = 0;
		СуммаПР        = СуммаСписанияРезерваОС;
		СуммаВР        = 0;
		
		НалоговыйУчет.ЗаполнитьНалоговыеСуммыПроводки(СуммаНУ, СуммаНУ, СуммаПР, СуммаПР,
		СуммаВР, СуммаВР, Проводка, Реквизиты.ПоддержкаПБУ18);
		
		Проводка.Содержание = НСтр("ru='Списание резерва по переоценке НМА'");
	КонецЦикла;
	
	Движения.Хозрасчетный.Записывать = Истина;
	Движения.СтоимостьОС.Записывать = Истина;
	Движения.СтоимостьНМА.Записывать = Истина;
	Движения.АмортизацияОС.Записывать = Истина;
	Движения.АмортизацияНМА.Записывать = Истина;
		
КонецПроцедуры

#КонецОбласти