
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьРеквизиты();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаказы(Команда)
	
	СформироватьЗаказыНаСервере();
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗаказы;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНоменклатуру(Команда)
	
	ОткрытьФорму("Обработка.игр_ФормированиеЗаказовПоставщику.Форма.ФормаДобавитьНоменклатуру",, ЭтотОбъект,,,,
		Новый ОписаниеОповещения("ДобавитьНоменклатуруЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ТабДокумент	= ПечатьНаСервере(); 
	ТабДокумент.Показать("Заказ поставщику");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	ЗаполнитьНаСервере(Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементоыФормы

&НаКлиенте
Процедура ТаблицаОстатковНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ИсточникКолонка	= Элементы.ТаблицаОстатков.ТекущийЭлемент.Имя;
	Если НЕ СтрЗаканчиваетсяНа(ИсточникКолонка, "Доступно") Тогда
		Выполнение = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОстатковПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОстатковОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОстатковПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ТаблицаОстатков.ТекущиеДанные;
	ТекущаяСтрока = Элементы.ТаблицаОстатков.ТекущаяСтрока;
	
	ИсточникКолонка	= Элементы.ТаблицаОстатков.ТекущийЭлемент.Имя;
	ПриемникКолонка	= Поле.Имя;
	
	ПараметрыПемещения	= ПараметраПеремещения();
	ПараметрыПемещения.Вставить("ИсточникКолонка", ИсточникКолонка);
	ПараметрыПемещения.Вставить("ПриемникКолонка", ПриемникКолонка);
	ПараметрыПемещения.Вставить("ТекущаяСтрока", ТекущаяСтрока);
	
	Оповещение	= Новый ОписаниеОповещения("ВводКоличестваПеретаскиваниеЗавершение", ЭтотОбъект, ПараметрыПемещения);
	
	ПоказатьВводЧисла(Оповещение, ТекущиеДанные[ИсточникКолонка], "Количество", 10, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеСтроки	= ТаблицаЗаказов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ДанныеСтроки <> Неопределено Тогда
		ПоказатьЗначение(, ДанныеСтроки.Заказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОстатковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент = Элементы.ТаблицаОстатковНоменклатура Тогда 
		СтандартнаяОбработка = Ложь;
		ДанныеСтроки	= ТаблицаОстатков.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если ДанныеСтроки <> Неопределено Тогда
			ПоказатьЗначение(, ДанныеСтроки.Номенклатура);
		КонецЕсли;     
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьНоменклатуруЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		
		ДополнитьТаблицуОстатков(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьТаблицуОстатков(Адрес)
	
	РеквизитТаблица	= РеквизитФормыВЗначение("ТаблицаОстатков");
	
	ТаблицаДанных	= ПолучитьИзВременногоХранилища(Адрес);
	
	Для Каждого ТекСтрока Из ТаблицаДанных Цикл
		
		НайденныйТовар = Неопределено;
		Если ЗначениеЗаполнено(ТекСтрока.Штрихкод) Тогда
			НайденныйТовар	= РеквизитТаблица.Найти(ТекСтрока.Штрихкод, "Штрихкод"); 
		КонецЕсли;
		Если НайденныйТовар = Неопределено И ЗначениеЗаполнено(ТекСтрока.Артикул) Тогда
			НайденныйТовар	= РеквизитТаблица.Найти(ТекСтрока.Артикул, "Артикул"); 
		КонецЕсли;
		
		Если НайденныйТовар = Неопределено Тогда
			
			НоваяСтрока	= РеквизитТаблица.Добавить();
			НоваяСтрока.Штрихкод		= ТекСтрока.Штрихкод;
			НоваяСтрока.Артикул			= ТекСтрока.Артикул;
			НоваяСтрока.Номенклатура	= ТекСтрока.Наименование;
			НоваяСтрока.ЦенаПрайс		= ТекСтрока.Цена; 
			НоваяСтрока.ОтображатьНоменклатуру	= Истина;
			
		Иначе
			
			НайденныйТовар.ЦенаПрайс		= ТекСтрока.Цена;	
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(РеквизитТаблица, "ТаблицаОстатков"); 
	УстановитьУсловноеОформлениеПоля("ТаблицаОстатковНоменклатура");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(Обновление = Ложь)
	
	Если НЕ Обновление Тогда
		ТаблицаОстатков.Очистить();  
	КонецЕсли;
	
	УдалитьКолонкиСкладов();
	ЗаполнитьТаблицуОстатков(Обновление);
	СвернутьТаблицуОстатков();
	СоздатьЭлементыКолонкиСкладов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОстатков(Обновление = Ложь)
	
	РеквизитОбъект	= РеквизитФормыВЗначение("Объект");
	Схема			= РеквизитОбъект.ПолучитьМакет("СхемаПолученияДанных");
	
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек.Настройки, "ДатаОстатков", КонецДня(ТекущаяДатаСеанса()), Истина);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек.Настройки, "ВидЦены", ВидЦен, Истина);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек.Настройки, "Организация", Организация, Истина);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек.Настройки, "ДатаНачалаПродаж", ДатаНачала, Истина);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек.Настройки, "ДатаОкончанияПродаж", КонецДня(ДатаОкончания), Истина);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек.Настройки, "РасшифровкаПродаж", РасшифровкаПродаж, Истина);
	
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек.Настройки, "Свойство", 
		ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ОсновнойПоставщик_Номенклатура"));

	
	КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки		= КомпоновщикМакета.Выполнить(Схема, КомпоновщикНастроек.ПолучитьНастройки(),,,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
	ПроцессорКомпоновки	= Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ТаблицаДанных	= Новый ТаблицаЗначений;
	
	ПроцессорВывода	= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаДанных);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	Если Обновление Тогда

		СохраненнаяТаблица	= ТаблицаОстатков.Выгрузить();
		ТаблицаОстатков.Очистить();
		
		Кэш	= Новый Соответствие;
		Для Каждого ТекСтрока Из СохраненнаяТаблица Цикл
			
			СтрокиТаблицы	= Новый Массив;
			Если ЗначениеЗаполнено(ТекСтрока.Штрихкод) Тогда
				СтрокиТаблицы	= ТаблицаДанных.НайтиСтроки(Новый Структура("Штрихкод", ТекСтрока.Штрихкод));
			КонецЕсли;
			
			Если СтрокиТаблицы.Количество() = 0 И ЗначениеЗаполнено(ТекСтрока.Артикул) Тогда
				СтрокиТаблицы	= ТаблицаДанных.НайтиСтроки(Новый Структура("Артикул", ТекСтрока.Артикул));
			КонецЕсли;
			
			Если СтрокиТаблицы.Количество() > 0 Тогда
			
				Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
					
					Если ЗначениеЗаполнено(СтрокаТаблицы.Подразделение) И Кэш[СтрокаТаблицы.Подразделение] = Неопределено Тогда
						Кэш.Вставить(СтрокаТаблицы.Подразделение, Новый Массив);
						СоздатьКолонкиСклада(СтрокаТаблицы.Подразделение);
						Описание = ОписаниеКолонкиСкладов(СтрокаТаблицы.Подразделение);
						Кэш[СтрокаТаблицы.Подразделение].Добавить(Описание[0].Значение);
					КонецЕсли;
					
					НоваяСтрока	= ТаблицаОстатков.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы); 
					НоваяСтрока.ЦенаПрайс	= ТекСтрока.ЦенаПрайс; 
					
					Если ЗначениеЗаполнено(СтрокаТаблицы.Подразделение) Тогда
						НоваяСтрока[Кэш[СтрокаТаблицы.Подразделение][0]] = СтрокаТаблицы.Продажи;
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе 
				БазоваяСтрока	= ТаблицаОстатков.Добавить();
				ЗаполнитьЗначенияСвойств(БазоваяСтрока, ТекСтрока, "Артикул, Номенклатура, Штрихкод, ЦенаПрайс"); 
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
	
		Кэш	= Новый Соответствие;
		Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.Подразделение) И Кэш[СтрокаТаблицы.Подразделение] = Неопределено Тогда
				Кэш.Вставить(СтрокаТаблицы.Подразделение, Новый Массив);
				СоздатьКолонкиСклада(СтрокаТаблицы.Подразделение);
				Описание = ОписаниеКолонкиСкладов(СтрокаТаблицы.Подразделение);
				Кэш[СтрокаТаблицы.Подразделение].Добавить(Описание[0].Значение);
			КонецЕсли;
			
			НоваяСтрока	= ТаблицаОстатков.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);

			Если ЗначениеЗаполнено(СтрокаТаблицы.Подразделение) Тогда
				НоваяСтрока[Кэш[СтрокаТаблицы.Подразделение][0]] = СтрокаТаблицы.Продажи;
			КонецЕсли;
					
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СвернутьТаблицуОстатков()
	
	РеквизитТаблицы	= РеквизитФормыВЗначение("ТаблицаОстатков");
	
	СтрокаИтогов = "";
	СтрокаДопГруппировки = "";

	Для Каждого СтрокаТаблицы Из КолонкиСкладов Цикл
		
		ОписаниеКолонки	= ОписаниеКолонкиСкладов(СтрокаТаблицы.Подразделение);
		Для Каждого ЭлементКоллекции Из ОписаниеКолонки Цикл
			Если СтрЗаканчиваетсяНа(ЭлементКоллекции.Значение, "Рейтинг") Тогда
				СтрокаДопГруппировки = СтрокаДопГруппировки + ЭлементКоллекции.Значение + ","; 
			Иначе
				СтрокаИтогов = СтрокаИтогов + ЭлементКоллекции.Значение + ","; 
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;	

	СтрокаИтогов = СтрокаИтогов + "Заказ, Продажи, Итог";
	
	РеквизитТаблицы.Свернуть(СтрокаДопГруппировки + "Штрихкод, ЦенаПрайс, Артикул, Поставщик, Номенклатура, Характеристика, ОтображатьНоменклатуру, Цена, Рейтинг, Доступно", СтрокаИтогов);
	ПредыдущаяНоменклатура	= Неопределено;
	Для Каждого СтрокаТаблицы Из РеквизитТаблицы Цикл
		
		Если СтрокаТаблицы.Номенклатура = ПредыдущаяНоменклатура Тогда
			СтрокаТаблицы.ОтображатьНоменклатуру = Ложь;
		Иначе
			СтрокаТаблицы.ОтображатьНоменклатуру = Истина;
		КонецЕсли;
		
		Для Каждого Колонка Из РеквизитТаблицы.Колонки Цикл
			Если СтрЗаканчиваетсяНа(Колонка.Имя, "Доступно") Тогда
				СтрокаТаблицы.Итог = СтрокаТаблицы.Итог + СтрокаТаблицы[Колонка.Имя];
			КонецЕсли;
		КонецЦикла;
		
		ПредыдущаяНоменклатура = СтрокаТаблицы.Номенклатура; 
		
		СтрокаТаблицы.Заказ	= Макс(0, СтрокаТаблицы.Продажи - СтрокаТаблицы.Доступно);
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(РеквизитТаблицы, "ТаблицаОстатков");
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКолонкиСклада(Подразделение)
	
	ДобавляемыеРеквизиты	= Новый Массив;
	
	НоваяСтрока	= КолонкиСкладов.Добавить();
	НоваяСтрока.Подразделение	= Подразделение;
	
	ОписаниеТипа		= ОбщегоНазначения.ОписаниеТипаЧисло(10,0);
	ОписаниеТипаСтрока	= ОбщегоНазначения.ОписаниеТипаСтрока(3);
	
	ОписаниеКолонок	= ОписаниеКолонкиСкладов(Подразделение);
	Для Каждого ЭлементКоллекции Из ОписаниеКолонок Цикл
		
		ДобавляемыеРеквизиты.Добавить(
			Новый РеквизитФормы(ЭлементКоллекции.Значение, 
								ОписаниеТипа, 
								"ТаблицаОстатков", 
								ЭлементКоллекции.Представление));
		
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьРеквизиты()
	
	РеквизитОбъект	= РеквизитФормыВЗначение("Объект");
	Схема			= РеквизитОбъект.ПолучитьМакет("СхемаПолученияДанных");
	
	#Если _ Тогда
		Схема = Новый СхемаКомпоновкиДанных;
	#КонецЕсли
	
	АдресСхемы	= ПоместитьВоВременноеХранилище(Схема, УникальныйИдентификатор);
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек.Настройки, "ДатаОстатков", ТекущаяДатаСеанса(), Истина);
	
	Организация   = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьКолонкиСкладов()
	
	УдаляемыеРеквизиты	= Новый Массив;
	
	УсловноеОформление.Элементы.Очистить();
	
	Для Каждого СтрокаТаблицы Из КолонкиСкладов Цикл
		
		ОписаниеКолонки	= ОписаниеКолонкиСкладов(СтрокаТаблицы.Подразделение);
		Для Каждого ЭлементКоллекции Из ОписаниеКолонки Цикл
			
			УдаляемыеРеквизиты.Добавить(СтрШаблон("ТаблицаОстатков.%1", ЭлементКоллекции.Значение));
			Если Элементы.Найти(ЭлементКоллекции.Значение) <> Неопределено Тогда
				Элементы.Удалить(Элементы[ЭлементКоллекции.Значение]);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если Элементы.Найти("ГруппаСкладовИтого") <> Неопределено Тогда
		Элементы.Удалить(Элементы["ГруппаСкладовИтого"]);
	КонецЕсли;

	Если Элементы.Найти("ТаблицаШтрихкод") <> Неопределено Тогда
		Элементы.Удалить(Элементы["ТаблицаШтрихкод"]);
	КонецЕсли;
	
	КолонкиСкладов.Очистить();
	ИзменитьРеквизиты(, УдаляемыеРеквизиты);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыКолонкиСкладов()
	
	УстановитьУсловноеОформлениеПоля("ТаблицаОстатковНоменклатура");
	
	Для Каждого СтрокаТаблицы Из КолонкиСкладов Цикл
		
		Подразделение	= СтрокаТаблицы.Подразделение;
		Индекс			= КолонкиСкладов.Индекс(СтрокаТаблицы);
		
		ОписаниеКолонок	= ОписаниеКолонкиСкладов(Подразделение);
		Для Каждого ЭлементКоллекции Из ОписаниеКолонок Цикл
			
			НовыйЭлемент	= Элементы.Добавить(ЭлементКоллекции.Значение, Тип("ПолеФормы"), Элементы.ТаблицаОстатков);
			НовыйЭлемент.Вид		= ВидПоляФормы.ПолеНадписи;
			НовыйЭлемент.Заголовок	= Строка(Подразделение);
			НовыйЭлемент.ПутьКДанным	= СтрШаблон("ТаблицаОстатков.%1", ЭлементКоллекции.Значение);
			НовыйЭлемент.Ширина			= 5;
			НовыйЭлемент.РастягиватьПоГоризонтали	= Ложь;
			НовыйЭлемент.ГоризонтальноеПоложение	= ГоризонтальноеПоложениеЭлемента.Центр;
			Если СтрЗаканчиваетсяНа(ЭлементКоллекции.Значение, "Доступно") Тогда
				НовыйЭлемент.Шрифт	= Новый Шрифт(,,Истина);
			КонецЕсли;
			
			УстановитьУсловноеОформлениеПоля(ЭлементКоллекции.Значение);
			
		КонецЦикла;
		
	КонецЦикла;
	
	НовыйЭлемент	= Элементы.Добавить("ТаблицаШтрихкод", Тип("ПолеФормы"), Элементы.ТаблицаОстатков);
	НовыйЭлемент.Вид			= ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным	= "ТаблицаОстатков.Штрихкод";
	
//	Элементы.Переместить(Элементы.ТаблицаОстатковИтог, Элементы.ТаблицаОстатков, Элементы.ТаблицаОстатковРейтинг);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеПоля(ИмяПоля)
	
	Поле	= Элементы.Найти(ИмяПоля);
	
	Элемент	= УсловноеОформление.Элементы.Добавить();
		
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Поле.Имя);
	
	Если ИмяПоля = "ТаблицаОстатковНоменклатура" Тогда
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаОстатковЦена");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаОстатков.ОтображатьНоменклатуру");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Ложь;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "");

		Элемент	= УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Поле.Имя);

		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаОстатковНоменклатура");
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаОстатков.Цена");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = 0;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЖелтый);
		
	ИначеЕсли СтрЗаканчиваетсяНа(ИмяПоля, "Доступно") Тогда
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаОстатков." + ИмяПоля);
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = 0;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЛососьСветлый);
		
	ИначеЕсли СтрЗаканчиваетсяНа(ИмяПоля, "ПриходРасход") Тогда
		
		Элемент.Оформление.УстановитьЗначениеПараметра("ВыделятьОтрицательные", Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОписаниеКолонкиСкладов(Склад)
	
	Результат = Новый СписокЗначений;
	
	Идентификатор	= СтрЗаменить(XMLСтрока(Склад),"-","_");
	
	Результат.Добавить(СтрШаблон("_%1_Продажи", Идентификатор), "Пр");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СкладПоКолонке(ИмяКолонки)
	
	Идентификатор = СтрЗаменить(Сред(ИмяКолонки, 2, 36),"_","-");
	
	Результат = Неопределено;
	
	Попытка
		Результат = Справочники.СтруктураПредприятия.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));
	Исключение
		Результат = Неопределено;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПараметраПеремещения()
	
	ПараметрыПемещения	= Новый Структура;
	ПараметрыПемещения.Вставить("ИсточникКолонка", "");
	ПараметрыПемещения.Вставить("ПриемникКолонка", "");
	ПараметрыПемещения.Вставить("ТекущаяСтрока", 0);
	
	Возврат ПараметрыПемещения;
	
КонецФункции

&НаКлиенте
Процедура ВводКоличестваПеретаскиваниеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьПеремещениеНаСервере(Результат, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПеремещениеНаСервере(РезультатКоличество, ДополнительныеПараметры)
	
	ПараметрыПеремещения	= ПараметраПеремещения();
	ЗаполнитьЗначенияСвойств(ПараметрыПеремещения, ДополнительныеПараметры);
	
	СкладИсточник	= СкладПоКолонке(ПараметрыПеремещения.ИсточникКолонка);
	СкладПриемник	= СкладПоКолонке(ПараметрыПеремещения.ПриемникКолонка);
	
	Если ЗначениеЗаполнено(СкладИсточник) И ЗначениеЗаполнено(СкладПриемник)
		И СкладИсточник <> СкладПриемник Тогда
		ДанныеСтроки	= ТаблицаОстатков.НайтиПоИдентификатору(ПараметрыПеремещения.ТекущаяСтрока);
		Если ДанныеСтроки = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		КоличествоДляПеремещения	= Мин(РезультатКоличество, ДанныеСтроки[ПараметрыПеремещения.ИсточникКолонка]);
		
		НоваяСтрока	= ТаблицаДействий.Добавить();
		НоваяСтрока.Номенклатура	= ДанныеСтроки.Номенклатура;
		НоваяСтрока.Характеристика	= ДанныеСтроки.Характеристика;
		НоваяСтрока.Количество		= КоличествоДляПеремещения;
		НоваяСтрока.Источник		= СкладИсточник;
		НоваяСтрока.Приемник		= СкладПриемник;
		
		КолонкиИсточник = ОписаниеКолонкиСкладов(СкладИсточник);
		КолонкиПриемник = ОписаниеКолонкиСкладов(СкладПриемник);
		
		ДанныеСтроки[КолонкиИсточник[0].Значение] = ДанныеСтроки[КолонкиИсточник[0].Значение] - КоличествоДляПеремещения;
		ДанныеСтроки[КолонкиИсточник[1].Значение] = ДанныеСтроки[КолонкиИсточник[1].Значение] - КоличествоДляПеремещения;
		
		ДанныеСтроки[КолонкиПриемник[0].Значение] = ДанныеСтроки[КолонкиПриемник[0].Значение] + КоличествоДляПеремещения;
		ДанныеСтроки[КолонкиПриемник[1].Значение] = ДанныеСтроки[КолонкиПриемник[1].Значение] + КоличествоДляПеремещения;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаказыНаСервере()
	
	ТаблицаЗаказов.Очистить();
	
	ТаблицаДляФормирования	= СкорректированнаяТаблицаДействий(ТаблицаДействий.Выгрузить());
	
	ВременныйДокумент		= Документы.ЗаказНаПеремещение.СоздатьДокумент();
	ТаблицаТоваровДокумента	= ВременныйДокумент.Товары.Выгрузить();
	
	ТаблицаСкладов	= ТаблицаДляФормирования.Скопировать();
	ТаблицаСкладов.Свернуть("Источник, Приемник", "");
	
	ПараметрыЗаполнения	= Новый Соответствие;
	ПараметрыЗаполнения.Вставить("Источник", ТаблицаДляФормирования);
	ПараметрыЗаполнения.Вставить("Товары", ТаблицаТоваровДокумента);
	
	Для Каждого СтрокаСклада Из ТаблицаСкладов Цикл
		
		НачатьТранзакцию();
		Попытка
			
			НовыйДокумент	= Документы.ЗаказНаПеремещение.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(НовыйДокумент, ПолучитьРеквизитыШапки(СтрокаСклада));
			НовыйДокумент.Товары.Загрузить(ПолучитьТабличнуюЧастьТовары(ПараметрыЗаполнения, СтрокаСклада));
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			
			ЗафиксироватьТранзакцию();
			
			НоваяСтрока	= ТаблицаЗаказов.Добавить();
			НоваяСтрока.Заказ	= НовыйДокумент.Ссылка;
			
		Исключение
			ОтменитьТранзакцию();
			
			Информация	= ИнформацияОбОшибке();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ОбработкаОшибок.КраткоеПредставлениеОшибки(Информация));
				
			ЗаписьЖурналаРегистрации("Формирование заказа на перемещение",
				УровеньЖурналаРегистрации.Ошибка,
				,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(Информация));
			
		КонецПопытки;
		
	КонецЦикла;
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРеквизитыШапки(СтрокаСклада)
	
	Реквизиты	= Новый Структура;
	
	Реквизиты.Вставить("Дата", ТекущаяДатаСеанса());
	Реквизиты.Вставить("Организация", Организация);
	Реквизиты.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПеремещениеТоваров);
	Реквизиты.Вставить("Ответственный", Пользователи.АвторизованныйПользователь());
	Реквизиты.Вставить("СкладОтправитель", СтрокаСклада.Источник);
	Реквизиты.Вставить("СкладПолучатель", СтрокаСклада.Приемник);
	Реквизиты.Вставить("ВариантПриемкиТоваров", Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным);
	Реквизиты.Вставить("СпособДоставки", Перечисления.СпособыДоставки.Самовывоз);
	Реквизиты.Вставить("Статус", Перечисления.СтатусыВнутреннихЗаказов.Закрыт);
	
	Возврат Реквизиты;
	
КонецФункции

&НаСервере
Функция ПолучитьТабличнуюЧастьТовары(ПараметрыЗаполнения, СтрокаСклада)
	
	ТаблицаДляФормирования	= ПараметрыЗаполнения["Источник"];
	ТаблицаТоваровДокумента	= ПараметрыЗаполнения["Товары"].Скопировать();
	
	СтруктураПоиска	= Новый Структура("Источник, Приемник");
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаСклада);
	НайденныеСтроки	= ТаблицаДляФормирования.НайтиСтроки(СтруктураПоиска);
	Для Каждого ЭлементКоллекции Из НайденныеСтроки Цикл
		
		НоваяСтрока	= ТаблицаТоваровДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементКоллекции, "Номенклатура, Характеристика, Количество");
		
		НоваяСтрока.НачалоОтгрузки		= ТекущаяДатаСеанса();
		НоваяСтрока.КоличествоУпаковок	= НоваяСтрока.Количество;
		НоваяСтрока.ВариантОбеспечения	= Перечисления.ВариантыОбеспечения.СоСклада;
		
	КонецЦикла;
	
	Возврат ТаблицаТоваровДокумента;
	
КонецФункции

&НаСервере
Функция СкорректированнаяТаблицаДействий(ТаблицаДляКорректировки)
	
	Запрос	= Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДействий.Источник КАК Источник,
	|	ТаблицаДействий.Приемник КАК Приемник,
	|	ТаблицаДействий.Номенклатура КАК Номенклатура,
	|	ТаблицаДействий.Характеристика КАК Характеристика,
	|	ТаблицаДействий.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ТаблицаДействий
	|ИЗ
	|	&ТаблицаДействий КАК ТаблицаДействий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДействий.Источник КАК Источник,
	|	ВТ_ТаблицаДействий.Приемник КАК Приемник,
	|	ВТ_ТаблицаДействий.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаДействий.Характеристика КАК Характеристика,
	|	СУММА(ВТ_ТаблицаДействий.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТаблицаСводно
	|ИЗ
	|	ВТ_ТаблицаДействий КАК ВТ_ТаблицаДействий
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаДействий.Источник,
	|	ВТ_ТаблицаДействий.Приемник,
	|	ВТ_ТаблицаДействий.Номенклатура,
	|	ВТ_ТаблицаДействий.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСводно.Источник КАК Источник,
	|	ВТ_ТаблицаСводно.Приемник КАК Приемник,
	|	ВТ_ТаблицаСводно.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаСводно.Характеристика КАК Характеристика,
	|	ВТ_ТаблицаСводно.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ПерекрестныеДействия
	|ИЗ
	|	ВТ_ТаблицаСводно КАК ВТ_ТаблицаСводно
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСводно.Приемник,
	|	ВТ_ТаблицаСводно.Источник,
	|	ВТ_ТаблицаСводно.Номенклатура,
	|	ВТ_ТаблицаСводно.Характеристика,
	|	-ВТ_ТаблицаСводно.Количество
	|ИЗ
	|	ВТ_ТаблицаСводно КАК ВТ_ТаблицаСводно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПерекрестныеДействия.Источник КАК Источник,
	|	ВТ_ПерекрестныеДействия.Приемник КАК Приемник,
	|	ВТ_ПерекрестныеДействия.Номенклатура КАК Номенклатура,
	|	ВТ_ПерекрестныеДействия.Характеристика КАК Характеристика,
	|	СУММА(ВТ_ПерекрестныеДействия.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_Сводно
	|ИЗ
	|	ВТ_ПерекрестныеДействия КАК ВТ_ПерекрестныеДействия
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПерекрестныеДействия.Источник,
	|	ВТ_ПерекрестныеДействия.Приемник,
	|	ВТ_ПерекрестныеДействия.Номенклатура,
	|	ВТ_ПерекрестныеДействия.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сводно.Источник КАК Источник,
	|	ВТ_Сводно.Приемник КАК Приемник,
	|	ВТ_Сводно.Номенклатура КАК Номенклатура,
	|	ВТ_Сводно.Характеристика КАК Характеристика,
	|	ВТ_Сводно.Количество КАК Количество
	|ИЗ
	|	ВТ_Сводно КАК ВТ_Сводно
	|ГДЕ
	|	ВТ_Сводно.Количество > 0"
	;
	
	Запрос.УстановитьПараметр("ТаблицаДействий", ТаблицаДляКорректировки);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ПечатьНаСервере()
	
	РеквизитОбъект	= РеквизитФормыВЗначение("Объект");
	Макет	= РеквизитОбъект.ПолучитьМакет("Вывод");
	
	ТабДокумент	= Новый ТабличныйДокумент;
	
	Область	= Макет.ПолучитьОбласть("Шапка");
	
	ТабДокумент.Вывести(Область);
	
	Область	= Макет.ПолучитьОбласть("Строка");
	
	Для Каждого ТекСтрока Из ТаблицаОстатков Цикл   
		Если ТекСтрока.Заказ > 0 Тогда
			Область.Параметры.Заполнить(ТекСтрока); 
			ТабДокумент.Вывести(Область);
		КонецЕсли;
	КонецЦикла;

	Возврат ТабДокумент;	
	
КонецФункции

#КонецОбласти
