&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СписокФорматовЮЗД       = ОбработкаОбъект.ПолучитьФорматыУПД();
	СписокФорматовИнфоПолей = ОбработкаОбъект.ПолучитьФорматыИнфоПолей();
	
	НайденноеЗначение = СписокФорматовЮЗД.НайтиПоЗначению(Объект.ФорматУПД);
	Если НЕ НайденноеЗначение = Неопределено Тогда
	     Объект.ФорматУПД = НайденноеЗначение.Значение;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ФорматУПД) Тогда
		Объект.ФорматУПД = Объект.Наименование;
		Модифицированность = Истина;
	КонецЕсли;

	ЭтаФорма.ОбработкаТип = ЗначениеВСтрокуВнутр(ТипЗнч(ОбработкаОбъект)); // Установим внутреннее строковое представление типа значения объекта обработки

	ЗначениеУникально = ОбработкаОбъект.ПроверкаНаУникальностьСправочника(Объект.ФорматУПД, Объект.Ссылка); 
	Если Не ЗначениеУникально Тогда
		Объект.ФорматУПД   = "";
		
		Сообщение 	    = Новый СообщениеПользователю;
		Сообщение.Текст = "Объект справочника c форматом УПД <<<" + Объект.ФорматУПД + ">>>  уже существует!" + Символы.ПС + "Поле формат УПД было очищено.";
		Сообщение.Сообщить();
	КонецЕсли;

	Если Объект.ФорматУПД = "УПД по умолчанию" Тогда
		Если Объект.ТабличнаяЧасть.Количество() = 0 Тогда
		     ОбработкаОбъект.ЗаполнитьУПД_поУмолчанию(Объект.Ссылка);
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФорматУПДПриИзменении(Элемент)
	
	Объект.Наименование = Объект.ФорматУПД;
	
	ЗначениеУникально = ПроверкаНаУникальностьСправочникаНаСервере(ЭтаФорма.ОбработкаТип, Объект.ФорматУПД, Объект.Ссылка);
	Если НЕ ЗначениеУникально Тогда
		 Сообщение = Новый СообщениеПользователю;
		 Сообщение.Текст = "Объект справочника c форматом УПД <<<" + Объект.ФорматУПД + ">>>  уже существует!";
		 Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверкаНаУникальностьСправочникаНаСервере(ОбработкаТип, ИмяФорматаУПД, Ссылка)
	
	ОбработкаОбъект = Новый (ЗначениеИзСтрокиВнутр(ОбработкаТип));
	ЗначениеУникально = ОбработкаОбъект.ПроверкаНаУникальностьСправочника(ИмяФорматаУПД, Ссылка);
	
	Возврат ЗначениеУникально;
	
КонецФункции

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗначениеУникально = ПроверкаНаУникальностьСправочникаНаСервере(ЭтаФорма.ОбработкаТип, Объект.ФорматУПД, Объект.Ссылка);
	Если НЕ ЗначениеУникально Тогда
		 Сообщение = Новый СообщениеПользователю;
		 Сообщение.Текст = "Объект справочника c форматом УПД <<<" + Объект.ФорматУПД + ">>>  уже существует!";
		 Сообщение.Сообщить();

	     Отказ = Истина;
	КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ФорматУПД.СписокВыбора.ЗагрузитьЗначения(СписокФорматовЮЗД.ВыгрузитьЗначения());
	Объект.ФорматУПД = Объект.Наименование;
	ОбновитьОтображениеДанных();
 
КонецПроцедуры

&НаКлиенте
Процедура ФорматУПДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Элементы.ФорматУПД.СписокВыбора.Очистить();	
	Элементы.ФорматУПД.СписокВыбора.ЗагрузитьЗначения(СписокФорматовЮЗД.ВыгрузитьЗначения());				
	Элементы.ФорматУПД.СписокВыбора.СортироватьПоЗначению();
	Элементы.ФорматУПД.СписокВыбора.Вставить(0, "УПД по умолчанию");
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьТипПоляНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЭтаФорма.Элементы.ТабличнаяЧасть.ПодчиненныеЭлементы.ТабличнаяЧастьТипПоля.СписокВыбора.Очистить();
	ЭтаФорма.Элементы.ТабличнаяЧасть.ПодчиненныеЭлементы.ТабличнаяЧастьТипПоля.СписокВыбора.ЗагрузитьЗначения(СписокФорматовИнфоПолей.ВыгрузитьЗначения());	
	ЭтаФорма.Элементы.ТабличнаяЧасть.ПодчиненныеЭлементы.ТабличнаяЧастьТипПоля.СписокВыбора.СортироватьПоЗначению();	
КонецПроцедуры
