#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("Заголовок",			Заголовок);
	Параметры.Свойство("ОрганизацияСсылка",	ОрганизацияСсылка);
	
	Заголовок = ?(ПустаяСтрока(Заголовок), "", Заголовок + ": ") + НСтр("ru='Учетная политика'");
	
	ПрочитатьДанные();
	
	// Установка доступности элементов формы в зависимости от текущих настроек.
	ОбновитьЭлементыФормыПоТекущимНастройкам();
	
	ТекстПодсказкиКПоляДатаРегистрации = УчетСтраховыхВзносовКлиентСервер.ТекстПодсказкиПоляДатаРегистрацииПериодическихРегистров();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, 
		"ПрименяемыеТарифыСтраховыхВзносовДатаРегистрацииИзменений", 
		"Подсказка", 
		ТекстПодсказкиКПоляДатаРегистрации);
	
	Элементы.УчетПособийФСС.ТолькоПросмотр = Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НастройкиУчетаПособийСоциальногоСтрахования);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"УчетнаяПолитикаПоНалоговомуУчетуПлательщикОППВ",
		"Доступность",
		Не ОбособленноеПодразделение);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"УчетнаяПолитикаПоНалоговомуУчетуПрименятьОграничениеНаМинимальныйОбъектОСМС",
		"Доступность",
		Не ОбособленноеПодразделение);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"УчетнаяПолитикаПоНалоговомуУчетуПредоставлятьВычетВМесяцеОтсутствияДохода",
		"Доступность",
		Не ОбособленноеПодразделение);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"УчетнаяПолитикаПоНалоговомуУчетуОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу",
		"Доступность",
		Не ОбособленноеПодразделение);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"УчетнаяПолитикаПоНалоговомуУчетуПериодСтрокой",
		"Доступность",
		Не ОбособленноеПодразделение);	
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"УчетнаяПолитикаПоНалоговомуУчетуНеПрименятьКорректировкуПрочихНалоговВзносовОтчислений",
		"Доступность",
		Не ОбособленноеПодразделение);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетВОСМСДляФизическихЛицИГПХ",
		"Доступность",
		Не ОбособленноеПодразделение);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетОПВДляГПХ",
		"Доступность",
		Не ОбособленноеПодразделение);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетОПВиВОСМСДляГПХ",
		"Доступность",
		Не ОбособленноеПодразделение);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаУчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложения",
		"Доступность",
		Не ОбособленноеПодразделение);
        
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"УчетнаяПолитикаЗарплатаКадрыПериодСтрокой",
		"Доступность",
		Не ОбособленноеПодразделение);	
        
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"УчетнаяПолитикаЗарплатаКадрыДеньУвольненияЯвляетсяРабочимДнем",
		"Доступность",
		Не ОбособленноеПодразделение);
        
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("СохранитьИЗакрыть", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененаРегистрацияВНалоговомОргане" И Параметр.Владелец = ОрганизацияСсылка Тогда
		ОбновитьВидимостьПредупрежденийОРегионеПрямыхВыплат();
	КонецЕсли;
	
	Если ИмяСобытия = "ОтредактированаИстория" И ОрганизацияСсылка = Источник Тогда
		
		Если Параметр.ИмяРегистра = "ПрименяемыеТарифыСтраховыхВзносов" Тогда
			
			Если ПрименяемыеТарифыСтраховыхВзносовНаборЗаписейПрочитан Тогда
				
				РедактированиеПериодическихСведенийКлиент.ОбработкаОповещения(
				ЭтаФорма,
				ОрганизацияСсылка,
				ИмяСобытия,
				Параметр,
				Источник);
				
				УстановитьПодсказкуВидаТарифаПриИзменении(ЭтаФорма);
					
				ОбновитьПолеПрименяемыеТарифыСтраховыхВзносовПериод(ЭтаФорма);
				
			КонецЕсли;
			
		ИначеЕсли Параметр.ИмяРегистра = "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев" Тогда
			
			Если СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевНаборЗаписейПрочитан Тогда
				
				РедактированиеПериодическихСведенийКлиент.ОбработкаОповещения(
				ЭтаФорма,
				ОрганизацияСсылка,
				ИмяСобытия,
				Параметр,
				Источник);
				
				ОбновитьПолеСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериод(ЭтаФорма);
				
			КонецЕсли;
					
		ИначеЕсли Параметр.ИмяРегистра = "РасчетСреднегоЗаработкаОрганизаций" Тогда
			
			Если РасчетСреднегоЗаработкаОрганизацийНаборЗаписейПрочитан Тогда
				
				РедактированиеПериодическихСведенийКлиент.ОбработкаОповещения(
				ЭтаФорма,
				ОрганизацияСсылка,
				ИмяСобытия,
				Параметр,
				Источник);
				
				ОбновитьПолеСведенияОРасчетеСреднегоЗаработкаПериод(
				ЭтаФорма, 
				Этаформа.Элементы,
				РасчетСреднегоЗаработкаОрганизаций,
				РасчетСреднегоЗаработкаОрганизацийПрежняя,
				ОбщегоНазначенияКлиент.ДатаСеанса());
				
			КонецЕсли;
			
		ИначеЕсли Параметр.ИмяРегистра = "СрокиПеречисленияВзносовИОтчислений" Тогда
			
			ОбновитьСведенияОПеречисленииВзносовИОтчислений(Параметр.МассивЗаписей);
			
		ИначеЕсли Параметр.ИмяРегистра = "ПорядокОкругленияРезультатовРасчетаЗарплаты" Тогда
			
			ОбновитьСведенияОПорядкеОкругления(Параметр.МассивЗаписей);
			
		ИначеЕсли Параметр.ИмяРегистра = "УчетнаяПолитикаПоНалоговомуУчету" Тогда
			
			Если УчетнаяПолитикаПоНалоговомуУчетуНаборЗаписейПрочитан Тогда
				
				РедактированиеПериодическихСведенийКлиент.ОбработкаОповещения(
					ЭтаФорма,
					ОрганизацияСсылка,
					ИмяСобытия,
					Параметр,
					Источник);
				
				ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "УчетнаяПолитикаПоНалоговомуУчету.Период", "УчетнаяПолитикаПоНалоговомуУчетуПериодСтрокой");
				
				ОбновитьВидимостьНастроекПоПериоду(ЭтаФорма);

            КонецЕсли;
            
        ИначеЕсли Параметр.ИмяРегистра = "УчетнаяПолитикаЗарплатаКадры" Тогда
            
            Если УчетнаяПолитикаЗарплатаКадрыНаборЗаписейПрочитан Тогда
                
                РедактированиеПериодическихСведенийКлиент.ОбработкаОповещения(
                ЭтаФорма,
                ГоловнаяОрганизация,
                ИмяСобытия,
                Параметр,
                Источник);
                
                ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "УчетнаяПолитикаЗарплатаКадры.Период", "УчетнаяПолитикаЗарплатаКадрыПериодСтрокой");
                
            КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя.ПроцентДоплатыЗаРаботуВНочноеВремя) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Процент доплаты за работу в ночное время не указан.'"), , , , Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя.ПроцентДоплатыЗаРаботуВВечернееВремя) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Процент доплаты за работу в вечернее время не указан.'"), , , , Отказ);
	КонецЕсли;
	
	Если ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НастройкиУчетаПособийСоциальногоСтрахования) Тогда
		Если ОрганизацияВРегионеПрямыхВыплат
			И Не ПособияВыплачиваютсяСтрахователемЧисло
			И Не ЗначениеЗаполнено(НастройкиУчетаПособийСоциальногоСтрахования.ДатаПередачиФССВыплатыПособий) Тогда
			Текст = НСтр("ru = 'Не заполнена дата передачи выплаты пособий в ФСС'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, , "ДатаПередачиФССВыплатыПособий", "НастройкиУчетаПособийСоциальногоСтрахования", Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидТарифаПриИзменении(Элемент)
	
	УстановитьПодсказкуВидаТарифаПриИзменении(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ПрименяемыеТарифыСтраховыхВзносовПериодСтрокойПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(
		ЭтаФорма, "ПрименяемыеТарифыСтраховыхВзносов.Период", "ПрименяемыеТарифыСтраховыхВзносовПериодСтрокой", Модифицированность);
		
	УстановитьДатуРегистрацииИзмененийТарифаСтраховыхВзносовПоПериоду();
КонецПроцедуры

&НаКлиенте
Процедура ПрименяемыеТарифыСтраховыхВзносовПериодСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("УстановитьДатуРегистрацииИзмененийТарифаСтраховыхВзносовПоПериоду", ЭтотОбъект);
	
	
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(
		ЭтаФорма,
		ЭтаФорма,
		"ПрименяемыеТарифыСтраховыхВзносов.Период",
		"ПрименяемыеТарифыСтраховыхВзносовПериодСтрокой",,
		Оповещение,
		МесяцПоУмолчанию());
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименяемыеТарифыСтраховыхВзносовПериодСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(
		ЭтаФорма, "ПрименяемыеТарифыСтраховыхВзносов.Период", "ПрименяемыеТарифыСтраховыхВзносовПериодСтрокой",
		Направление, Модифицированность, МесяцПоУмолчанию());
		
	УстановитьДатуРегистрацииИзмененийТарифаСтраховыхВзносовПоПериоду();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименяемыеТарифыСтраховыхВзносовПериодСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПрименяемыеТарифыСтраховыхВзносовПериодСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименяемыеТарифыСтраховыхВзносовДатаРегистрацииИзмененийПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(
		ЭтаФорма,
		"ПрименяемыеТарифыСтраховыхВзносов.ДатаРегистрацииИзменений",
		"ПрименяемыеТарифыСтраховыхВзносовДатаРегистрацииИзмененийСтрокой",
		Модифицированность);	
КонецПроцедуры

&НаКлиенте
Процедура ПрименяемыеТарифыСтраховыхВзносовДатаРегистрацииИзмененийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(
		ЭтаФорма,
		ЭтаФорма,
		"ПрименяемыеТарифыСтраховыхВзносов.ДатаРегистрацииИзменений",
		"ПрименяемыеТарифыСтраховыхВзносовДатаРегистрацииИзмененийСтрокой",
		,
		,
		МесяцПоУмолчанию());
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименяемыеТарифыСтраховыхВзносовДатаРегистрацииИзмененийРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(
		ЭтаФорма,
		"ПрименяемыеТарифыСтраховыхВзносов.ДатаРегистрацииИзменений",
		"ПрименяемыеТарифыСтраховыхВзносовДатаРегистрацииИзмененийСтрокой",
		Направление,
		Модифицированность,
		МесяцПоУмолчанию());
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименяемыеТарифыСтраховыхВзносовДатаРегистрацииИзмененийАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПрименяемыеТарифыСтраховыхВзносовДатаРегистрацииИзмененийОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры


&НаКлиенте
Процедура СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериодСтрокойПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(
		ЭтаФорма, "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Период", "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериодСтрокой", Модифицированность);
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериодСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(
		ЭтаФорма,
		ЭтаФорма,
		"СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Период",
		"СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериодСтрокой",
		,
		,
		МесяцПоУмолчанию());
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериодСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(
		ЭтаФорма, "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Период", "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериодСтрокой",
		Направление, Модифицированность, МесяцПоУмолчанию());
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериодСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериодСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры


&НаКлиенте
Процедура ОрганизацияВРегионеПрямыхВыплатПриИзменении(Элемент)
	Если ОрганизацияВРегионеПрямыхВыплат Тогда
		НастройкиУчетаПособийСоциальногоСтрахования.ДатаПередачиФССВыплатыПособий = ДатаВступленияРегионаОрганизацииВПроектПоПрямымВыплатам(ОрганизацияСсылка);
		ТекущийЭлемент = Элементы.ДатаПередачиФССВыплатыПособий;
	Иначе
		НастройкиУчетаПособийСоциальногоСтрахования.ДатаПередачиФССВыплатыПособий = '00010101';
		ПособияВыплачиваютсяСтрахователемЧисло = 0;
		НастройкиУчетаПособийСоциальногоСтрахования.ПособияВыплачиваютсяСтрахователем = Ложь;
	КонецЕсли;
	
	ОбновитьДоступностьПолейПрямыхВыплат(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВыплатаПособийПереданаВФССПриИзменении(Элемент)
	НастройкиУчетаПособийСоциальногоСтрахования.ПособияВыплачиваютсяСтрахователем = ПособияВыплачиваютсяСтрахователемЧисло;
	ОбновитьДоступностьПолейПрямыхВыплат(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПособияВыплачиваютсяСтрахователемПриИзменении(Элемент)
	НастройкиУчетаПособийСоциальногоСтрахования.ПособияВыплачиваютсяСтрахователем = ПособияВыплачиваютсяСтрахователемЧисло;
	ОбновитьДоступностьПолейПрямыхВыплат(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПредупреждениеОрганизацияВРегионеПрямыхВыплатОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НачатьРедактированиеРегистрацииВНалоговомОргане();
КонецПроцедуры

&НаКлиенте
Процедура ПредупреждениеОрганизацияВРегионеБезПрямыхВыплатОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НачатьРедактированиеРегистрацииВНалоговомОргане();
КонецПроцедуры


&НаКлиенте
Процедура РасчетСреднегоЗаработкаОрганизацийИстория(Команда)
	ОткрытьФормуРедактированияИсторииРасчетСреднегоЗаработка();
КонецПроцедуры

&НаКлиенте
Процедура РасчетСреднегоЗаработкаОрганизацийРассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановокПриИзменении(Элемент)
	ОбновитьПолеСведенияОРасчетеСреднегоЗаработкаПериод(ЭтаФорма, ЭтаФорма.Элементы, РасчетСреднегоЗаработкаОрганизаций, РасчетСреднегоЗаработкаОрганизацийПрежняя, ОбщегоНазначенияКлиент.ДатаСеанса());
	ОбновитьДоступностьВариантУчетаКадровыхПерестановок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РасчетСреднегоЗаработкаОрганизацийВариантУчетаКадровыхПерестановокПриИзменении(Элемент)
	ОбновитьПолеСведенияОРасчетеСреднегоЗаработкаПериод(ЭтаФорма, ЭтаФорма.Элементы, РасчетСреднегоЗаработкаОрганизаций, РасчетСреднегоЗаработкаОрганизацийПрежняя, ОбщегоНазначенияКлиент.ДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура РасчетСреднегоЗаработкаОрганизацийУчетРабочегоВремениПриИзменении(Элемент)
	ОбновитьПолеСведенияОРасчетеСреднегоЗаработкаПериод(ЭтаФорма, ЭтаФорма.Элементы, РасчетСреднегоЗаработкаОрганизаций, РасчетСреднегоЗаработкаОрганизацийПрежняя, ОбщегоНазначенияКлиент.ДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура РасчетСреднегоЗаработкаОрганизацийПериодСтрокойПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "РасчетСреднегоЗаработкаОрганизаций.Период", "РасчетСреднегоЗаработкаОрганизацийПериодСтрокой", Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура РасчетСреднегоЗаработкаОрганизацийПериодСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(
		ЭтаФорма,
		ЭтаФорма,
		"РасчетСреднегоЗаработкаОрганизаций.Период",
		"РасчетСреднегоЗаработкаОрганизацийПериодСтрокой");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетСреднегоЗаработкаОрганизацийПериодСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "РасчетСреднегоЗаработкаОрганизаций.Период", "РасчетСреднегоЗаработкаОрганизацийПериодСтрокой", Направление, Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура РасчетСреднегоЗаработкаОрганизацийПериодСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РасчетСреднегоЗаработкаОрганизацийПериодСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры



&НаКлиенте
Процедура УчетнаяПолитикаПоНалоговомуУчетуИстория(Команда)
	
	ТолькоПросмотрИстории = ТолькоПросмотр ИЛИ ОбособленноеПодразделение;
	РедактированиеПериодическихСведенийКлиент.ОткрытьИсторию("УчетнаяПолитикаПоНалоговомуУчету", ?(ОбособленноеПодразделение, ГоловнаяОрганизация, ОрганизацияСсылка), ЭтаФорма, ТолькоПросмотрИстории);
	
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяПолитикаПоНалоговомуУчетуПериодСтрокойПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(
		ЭтаФорма, "УчетнаяПолитикаПоНалоговомуУчету.Период", "УчетнаяПолитикаПоНалоговомуУчетуПериодСтрокой", Модифицированность);
		
	ОбновитьВидимостьНастроекПоПериоду(ЭтаФорма);
	ОбновитьЗначениеНастроекПоПериоду(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяПолитикаПоНалоговомуУчетуПериодСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("УчетнаяПолитикаПоНалоговомуУчетуПериодСтрокойНачалоВыбораЗавершение", ЭтотОбъект);
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(
		ЭтаФорма,
		ЭтаФорма,
		"УчетнаяПолитикаПоНалоговомуУчету.Период",
		"УчетнаяПолитикаПоНалоговомуУчетуПериодСтрокой", ,
		Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура УчетнаяПолитикаПоНалоговомуУчетуПериодСтрокойНачалоВыбораЗавершение(ЗначениеВыбрано, ДополнительныеПараметры) Экспорт

	ОбновитьВидимостьНастроекПоПериоду(ЭтаФорма);
	ОбновитьЗначениеНастроекПоПериоду(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяПолитикаПоНалоговомуУчетуПериодСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(
		ЭтаФорма, "УчетнаяПолитикаПоНалоговомуУчету.Период", "УчетнаяПолитикаПоНалоговомуУчетуПериодСтрокой", Направление, Модифицированность);
		
	ОбновитьВидимостьНастроекПоПериоду(ЭтаФорма);
	ОбновитьЗначениеНастроекПоПериоду(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура УчетнаяПолитикаПоНалоговомуУчетуПериодСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяПолитикаПоНалоговомуУчетуПериодСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	ОбновитьВидимостьНастроекПоПериоду(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура УчетнаяПолитикаПоНалоговомуУчетуНеПрименятьКорректировкуПрочихНалоговВзносовОтчисленийПриИзменении(Элемент)
	
	Если УчетнаяПолитикаПоНалоговомуУчету.Период >= '2020-01-01'
		И (НЕ УчетнаяПолитикаПоНалоговомуУчету.НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений
		И УчетнаяПолитикаПоНалоговомуУчету.ПрименятьВычетВОСМСДляФизическихЛицИГПХ) Тогда
		
		УчетнаяПолитикаПоНалоговомуУчету.ПрименятьВычетВОСМСДляФизическихЛицИГПХ = Ложь;	
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Настройка ""Применять вычет ВОСМС для физических лиц (сотрудников)"" снята. Вычет ВОСМС не может использоваться совместно с корректировкой дохода'"));
			
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетВОСМСДляФизическихЛицИГПХПриИзменении(Элемент)
	
	Если УчетнаяПолитикаПоНалоговомуУчету.Период >= '2020-01-01'
		И (УчетнаяПолитикаПоНалоговомуУчету.ПрименятьВычетВОСМСДляФизическихЛицИГПХ = Истина 
		И НЕ УчетнаяПолитикаПоНалоговомуУчету.НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений) Тогда
		
		УчетнаяПолитикаПоНалоговомуУчету.НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений = Истина;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Настройка ""Расчет СН, ООСМС, ВОСМС без применения 90% корректировки по ИПН"" установлена. Корректировка дохода не может использоваться совместно с предоставлением вычета ВОСМС.'"));
			
	КонецЕсли;		
	
КонецПроцедуры


&НаКлиенте
Процедура УчетнаяПолитикаЗарплатаКадрыИстория(Команда)
	
	ТолькоПросмотрИстории = ТолькоПросмотр ИЛИ ОбособленноеПодразделение;
	РедактированиеПериодическихСведенийКлиент.ОткрытьИсторию("УчетнаяПолитикаЗарплатаКадры", ?(ОбособленноеПодразделение, ГоловнаяОрганизация, ОрганизацияСсылка), ЭтаФорма, ТолькоПросмотрИстории);
	
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяПолитикаЗарплатаКадрыПериодСтрокойПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(
		ЭтаФорма, "УчетнаяПолитикаЗарплатаКадры.Период", "УчетнаяПолитикаЗарплатаКадрыПериодСтрокой", Модифицированность);
        
   	ОбновитьЗначениеНастроекЗарплатаКадрыПоПериоду(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура УчетнаяПолитикаЗарплатаКадрыПериодСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("УчетнаяПолитикаЗарплатаКадрыПериодСтрокойНачалоВыбораЗавершение", ЭтотОбъект);
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(
		ЭтаФорма,
		ЭтаФорма,
		"УчетнаяПолитикаЗарплатаКадры.Период",
		"УчетнаяПолитикаЗарплатаКадрыПериодСтрокой", ,
		Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура УчетнаяПолитикаЗарплатаКадрыПериодСтрокойНачалоВыбораЗавершение(ЗначениеВыбрано, ДополнительныеПараметры) Экспорт

	ОбновитьЗначениеНастроекЗарплатаКадрыПоПериоду(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяПолитикаЗарплатаКадрыПериодСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(
		ЭтаФорма, "УчетнаяПолитикаЗарплатаКадры.Период", "УчетнаяПолитикаЗарплатаКадрыПериодСтрокой", Направление, Модифицированность);
        
    ОбновитьЗначениеНастроекЗарплатаКадрыПоПериоду(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура УчетнаяПолитикаЗарплатаКадрыПериодСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяПолитикаЗарплатаКадрыПериодСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТарифСтраховыхВзносовИстория(Команда)
	
	ОткрытьФормуРедактированияИстории("ПрименяемыеТарифыСтраховыхВзносов", ГоловнаяОрганизация, ЭтаФорма, ОбособленноеПодразделение);
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевИстория(Команда)
	
	ОткрытьФормуРедактированияИстории("СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев", ОрганизацияСсылка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	СохранитьИЗакрытьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ЗаписатьНаСервере();

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция МесяцПоУмолчанию()
	
	ПериодичностьМесяцПоУмолчанию = ЗарплатаКадрыКлиентСервер.ДатаОтсчетаПериодическихСведенийСПериодомМесяц();
	
	Если ЗначениеЗаполнено(ПрименяемыеТарифыСтраховыхВзносов.Период)
		И ПрименяемыеТарифыСтраховыхВзносов.Период > ПериодичностьМесяцПоУмолчанию
		И Не ЗначениеЗаполнено(СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Период)
			Или СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Период <= ПериодичностьМесяцПоУмолчанию Тогда
			
		Возврат ПрименяемыеТарифыСтраховыхВзносов.Период;
		
	ИначеЕсли ЗначениеЗаполнено(СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Период)
		И СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Период > ПериодичностьМесяцПоУмолчанию
		И Не ЗначениеЗаполнено(ПрименяемыеТарифыСтраховыхВзносов.Период)
			Или ПрименяемыеТарифыСтраховыхВзносов.Период <= ПериодичностьМесяцПоУмолчанию Тогда

			Возврат СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Период;
			
	ИначеЕсли (Не ЗначениеЗаполнено(СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Период)
		Или СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Период <= ПериодичностьМесяцПоУмолчанию)
			И (ЗначениеЗаполнено(ПрименяемыеТарифыСтраховыхВзносов.Период)
			Или ПрименяемыеТарифыСтраховыхВзносов.Период <= ПериодичностьМесяцПоУмолчанию)Тогда
			
		Возврат НачалоГода(ОбщегоНазначенияКлиент.ДатаСеанса());
			
	КонецЕсли;
	
	Возврат Мин(ПрименяемыеТарифыСтраховыхВзносов.Период, СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Период);
	
КонецФункции

&НаКлиенте
Процедура СохранитьИЗакрытьНаКлиенте(ЗакрытьФорму = Истина) Экспорт 

	ДополнительныеПараметры = Новый Структура("ЗакрытьФорму", ЗакрытьФорму);
	
	Оповещение = Новый ОписаниеОповещения("СохранитьИЗакрытьНаКлиентеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	СохранитьДанные(Ложь, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрытьНаКлиентеЗавершение(Отказ, ДополнительныеПараметры) Экспорт 

	Если Не Отказ И Открыта() Тогда
		
		Модифицированность = Ложь;
		Если ДополнительныеПараметры.ЗакрытьФорму Тогда
			Закрыть();
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанные(Отказ, ОповещениеЗавершения = Неопределено) Экспорт
	
	Если Не Модифицированность Тогда
		Если ОповещениеЗавершения <> Неопределено Тогда 
			ВыполнитьОбработкуОповещения(ОповещениеЗавершения, Отказ);
		КонецЕсли;
		Возврат;
	КонецЕсли; 
		
	ЗапроситьРежимИзмененияПрименяемыеТарифыСтраховыхВзносов(СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Период, Отказ, ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанныеЗавершение(Отказ, ОповещениеЗавершения) Экспорт  
	
	СохранитьДанныеНаСервере(Отказ);
	
	Если НЕ Отказ И ОповещениеЗавершения <> Неопределено Тогда 
		ВыполнитьОбработкуОповещения(ОповещениеЗавершения, Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанные()
	
	ГоловнаяОрганизация = ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(ОрганизацияСсылка);
	ОбособленноеПодразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОрганизацияСсылка,"ОбособленноеПодразделение");
	// ЗУПК
	ОрганизацияЯвляетсяИП = НЕ ЗарплатаКадрыПовтИсп.ЭтоЮридическоеЛицо(ОрганизацияСсылка);
	
	Если ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета() Тогда
		
		ЭлементыУпрощенная = Элементы.УчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложения.СписокВыбора.НайтиПоЗначению(Перечисления.СистемыНалогообложения.Упрощенная);
		Если НЕ ЭлементыУпрощенная = Неопределено Тогда
			Элементы.УчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложения.СписокВыбора.Удалить(ЭлементыУпрощенная);	
		КонецЕсли;
		
	КонецЕсли;
	// ЗУПК
	
	РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(ЭтаФорма, "ПрименяемыеТарифыСтраховыхВзносов", ГоловнаяОрганизация);
	Если Не ЗначениеЗаполнено(ПрименяемыеТарифыСтраховыхВзносов.ВидТарифа) Тогда
		ПрименяемыеТарифыСтраховыхВзносов.Период = Дата(2010,1,1);
		ПрименяемыеТарифыСтраховыхВзносов.ДатаРегистрацииИзменений = ПрименяемыеТарифыСтраховыхВзносов.Период;
		ПрименяемыеТарифыСтраховыхВзносов.ВидТарифа = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим");
	КонецЕсли;
	ОбновитьПолеПрименяемыеТарифыСтраховыхВзносовПериод(ЭтаФорма);
	ОбновитьПолеПрименяемыеТарифыСтраховыхВзносовДатаРегистрацииИзменений(ЭтотОбъект);
	
	УстановитьПодсказкуВидаТарифаПриИзменении(ЭтаФорма);
	
	РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(ЭтаФорма, "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев", ОрганизацияСсылка);
	ОбновитьПолеСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериод(ЭтаФорма);
	
	УчетСтраховыхВзносовЗначение = РегистрыСведений.НастройкиУчетаСтраховыхВзносов.СоздатьМенеджерЗаписи();
	УчетСтраховыхВзносовЗначение.Организация = ОрганизацияСсылка;
	УчетСтраховыхВзносовЗначение.Прочитать();
	ЗначениеВРеквизитФормы(УчетСтраховыхВзносовЗначение, "УчетСтраховыхВзносов");
	
	УчетПособийНастройкиОрганизацийЗначение = РегистрыСведений.НастройкиУчетаПособийСоциальногоСтрахования.СоздатьМенеджерЗаписи();
	УчетПособийНастройкиОрганизацийЗначение.Организация = ОрганизацияСсылка;
	УчетПособийНастройкиОрганизацийЗначение.Прочитать();
	ЗначениеВРеквизитФормы(УчетПособийНастройкиОрганизацийЗначение, "НастройкиУчетаПособийСоциальногоСтрахования");
	
	ОрганизацияВРегионеПрямыхВыплат = УчетПособийНастройкиОрганизацийЗначение.ПособияВыплачиваютсяСтрахователем
		Или ЗначениеЗаполнено(УчетПособийНастройкиОрганизацийЗначение.ДатаПередачиФССВыплатыПособий);
	ПособияВыплачиваютсяСтрахователемЧисло = УчетПособийНастройкиОрганизацийЗначение.ПособияВыплачиваютсяСтрахователем;
	
	ПрямыеВыплатыПособийСоциальногоСтрахованияКлиентСервер.ЗаполнитьСписокВыбораДатамиВступленияВПилотныйПроект(
		Элементы.ДатаПередачиФССВыплатыПособий.СписокВыбора);
	
	УчетнаяПолитикаПоНДФЛЗначение = РегистрыСведений.УчетнаяПолитикаПоНДФЛ.СоздатьМенеджерЗаписи();
	УчетнаяПолитикаПоНДФЛЗначение.ГоловнаяОрганизация = ГоловнаяОрганизация;
	УчетнаяПолитикаПоНДФЛЗначение.Прочитать();
	ЗначениеВРеквизитФормы(УчетнаяПолитикаПоНДФЛЗначение, "УчетнаяПолитикаПоНДФЛ");
	Если НЕ ЗначениеЗаполнено(УчетнаяПолитикаПоНДФЛ.ОсобенностиИсчисленияНДФЛ) Тогда
		УчетнаяПолитикаПоНДФЛ.ОсобенностиИсчисленияНДФЛ = Перечисления.ОсобенностиИсчисленияНДФЛ.СтандартныеВычетыНарастающимИтогом;
	КонецЕсли;
	
	Настройки = РегистрыСведений.НастройкиЗарплатаКадрыРасширенная.СоздатьМенеджерЗаписи();
	Настройки.Организация = ОрганизацияСсылка;
	Настройки.Прочитать();
	ЗначениеВРеквизитФормы(Настройки, "НастройкиОрганизацийРасширенная"); 
	
	// Показатели доплаты за работу в ночное и вечернее время.
	ПроцентДоплатыНочныеВечерние = РегистрыСведений.ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя.СоздатьМенеджерЗаписи();
	ПроцентДоплатыНочныеВечерние.Организация = ОрганизацияСсылка;
	ПроцентДоплатыНочныеВечерние.Прочитать();
	
	Если Не ПроцентДоплатыНочныеВечерние.Выбран() Тогда
		// Заполняем значениями по умолчанию.
		ПроцентДоплатыНочныеВечерние.ПроцентДоплатыЗаРаботуВНочноеВремя = 50;
		ПроцентДоплатыНочныеВечерние.ПроцентДоплатыЗаРаботуВВечернееВремя = 10;
	Иначе
		Если ПроцентДоплатыНочныеВечерние.ПроцентДоплатыЗаРаботуВНочноеВремя = 0 Тогда
			ПроцентДоплатыНочныеВечерние.ПроцентДоплатыЗаРаботуВНочноеВремя = 50;	
		КонецЕсли;
		Если ПроцентДоплатыНочныеВечерние.ПроцентДоплатыЗаРаботуВВечернееВремя = 0 Тогда
			ПроцентДоплатыНочныеВечерние.ПроцентДоплатыЗаРаботуВВечернееВремя = 10;	
		КонецЕсли;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ПроцентДоплатыНочныеВечерние, "ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя"); 
	
	НадписьДоплатаЗаДниНетрудоспособности = НСтр("ru = '% среднего заработка'");
		
	ПрочитатьДанныеРасчетаСреднегоЗаработкаДляРедактированияВФорме();
	
	ПрочитатьНастройкиПеречисленияВзносовИОтчисленийВФорме();
	
	ПрочитатьНастройкиПорядкаОкругленияВФорме();
	
	ПрочитатьДанныеУчетнойПолитикиПоНалоговомуУчету();
    
    ПрочитатьДанныеУчетнойПолитикиЗарплатаКадры();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеНаСервере(Отказ)
	
	Если Не ПроверитьЗаполнение() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
	// в ЗУПК изменен порядок записи в регистры, необходимо для обхода ошибки записи в закрытом периоде РФ регистров
	РедактированиеПериодическихСведений.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтаФорма, "РасчетСреднегоЗаработкаОрганизаций", ОрганизацияСсылка);
	РедактированиеПериодическихСведений.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтаФорма, "УчетнаяПолитикаПоНалоговомуУчету", ОрганизацияСсылка);
   	РедактированиеПериодическихСведений.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтаФорма, "УчетнаяПолитикаЗарплатаКадры", ?(ОбособленноеПодразделение, ГоловнаяОрганизация, ОрганизацияСсылка));
    
    Если ПравоДоступа("Изменение", Метаданные.РегистрыСведений.СрокиПеречисленияВзносовИОтчислений) Тогда
        // в ЗУПК изменен порядок записи в регистры, необходимо для обхода ошибки записи в закрытом периоде РФ регистров
        НаборСрокиПеречисленияВзносовИОтчислений = РеквизитФормыВЗначение("СрокиПеречисленияВзносовИОтчисленийНаборЗаписей");
        НаборСрокиПеречисленияВзносовИОтчислений.Записать();
    КонецЕсли; 
    
    Если ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПорядокОкругленияРезультатовРасчетаЗарплаты) Тогда
        НаборПорядокОкругленияРезультатовРасчетаЗарплаты = РеквизитФормыВЗначение("ПорядокОкругленияРезультатовРасчетаЗарплатыНаборЗаписей");
        НаборПорядокОкругленияРезультатовРасчетаЗарплаты.Записать();
    КонецЕсли;

	// в ЗУПК изменен порядок записи в регистры, необходимо для обхода ошибки записи в закрытом периоде РФ регистров
	//РедактированиеПериодическихСведений.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтаФорма, "ПрименяемыеТарифыСтраховыхВзносов", ГоловнаяОрганизация);
	//РедактированиеПериодическихСведений.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтаФорма, "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев", ОрганизацияСсылка);
    
    Если ПравоДоступа("Изменение", Метаданные.РегистрыСведений.УчетнаяПолитикаПоНДФЛ) Тогда
        УчетнаяПолитикаПоНДФЛЗначение = РеквизитФормыВЗначение("УчетнаяПолитикаПоНДФЛ");
        УчетнаяПолитикаПоНДФЛЗначение.ГоловнаяОрганизация = ГоловнаяОрганизация;
        УчетнаяПолитикаПоНДФЛЗначение.Записать();
    КонецЕсли;
    
    Если ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НастройкиУчетаСтраховыхВзносов) Тогда
        УчетСтраховыхВзносовЗначение = РеквизитФормыВЗначение("УчетСтраховыхВзносов");
        УчетСтраховыхВзносовЗначение.Организация = ОрганизацияСсылка;
        УчетСтраховыхВзносовЗначение.Записать();
    КонецЕсли;
    
    Если ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НастройкиУчетаПособийСоциальногоСтрахования) Тогда
        УчетПособийНастройкиОрганизацийЗначение = РеквизитФормыВЗначение("НастройкиУчетаПособийСоциальногоСтрахования");
        УчетПособийНастройкиОрганизацийЗначение.Организация = ОрганизацияСсылка;
        УчетПособийНастройкиОрганизацийЗначение.Записать();
    КонецЕсли;
    
    Если ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НастройкиЗарплатаКадрыРасширенная) Тогда
        НастройкиОрганизаций = РеквизитФормыВЗначение("НастройкиОрганизацийРасширенная");
        НастройкиОрганизаций.Организация = ОрганизацияСсылка;
        НастройкиОрганизаций.Записать();
    КонецЕсли;
    
    Если ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя) Тогда
        ПроцентДоплатыНочныеВечерние = РеквизитФормыВЗначение("ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя");
        ПроцентДоплатыНочныеВечерние.Организация = ОрганизацияСсылка;
        ПроцентДоплатыНочныеВечерние.Записать();
    КонецЕсли;

	ОбновитьПовторноИспользуемыеЗначения();
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()

	Отказ = Ложь;
	СохранитьДанныеНаСервере(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПрочитатьДанные();
	
	// Установка доступности элементов формы в зависимости от текущих настроек.
	ОбновитьЭлементыФормыПоТекущимНастройкам();

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПолеПрименяемыеТарифыСтраховыхВзносовПериод(Форма)
	
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(Форма, "ПрименяемыеТарифыСтраховыхВзносов", Форма.ГоловнаяОрганизация);
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(Форма, "ПрименяемыеТарифыСтраховыхВзносов.Период", "ПрименяемыеТарифыСтраховыхВзносовПериодСтрокой");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПолеПрименяемыеТарифыСтраховыхВзносовДатаРегистрацииИзменений(Форма)
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(Форма, "ПрименяемыеТарифыСтраховыхВзносов.ДатаРегистрацииИзменений", "ПрименяемыеТарифыСтраховыхВзносовДатаРегистрацииИзмененийСтрокой");
	
	Форма.Элементы.ПрименяемыеТарифыСтраховыхВзносовДатаРегистрацииИзменений.АвтоОтметкаНезаполненного = Форма.Элементы.ПрименяемыеТарифыСтраховыхВзносовПериодСтрокой.АвтоОтметкаНезаполненного;
	
	Если Не Форма.Элементы.ПрименяемыеТарифыСтраховыхВзносовПериодСтрокой.АвтоОтметкаНезаполненного
		И Не ЗначениеЗаполнено(Форма.ПрименяемыеТарифыСтраховыхВзносов.Период) Тогда
		
		Форма.Элементы.ПрименяемыеТарифыСтраховыхВзносовДатаРегистрацииИзменений.ОтметкаНезаполненного = Ложь;
	КонецЕсли;		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПолеСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериод(Форма)
	
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(Форма, "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев", Форма.ОрганизацияСсылка);
	
	// Не обязательно заполнение поля Период если данные по умолчанию.
	Если Форма.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Период = НачалоМесяца(ЗарплатаКадрыКлиентСервер.ДатаОтсчетаПериодическихСведенийСПериодомМесяц()) Тогда
		
		Форма.Элементы.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериодСтрокой.АвтоОтметкаНезаполненного = Ложь;
		Форма.Элементы.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериодСтрокой.ОтметкаНезаполненного = Ложь;
		
	КонецЕсли;
	
	Если Форма.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Период = НачалоМесяца(ЗарплатаКадрыКлиентСервер.ДатаОтсчетаПериодическихСведенийСПериодомМесяц()) Тогда
		Форма.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериод = '00010101';
	Иначе
		Форма.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериод = Форма.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Период;
	КонецЕсли;
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(Форма, "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериод", "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериодСтрокой");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияИстории(ИмяРегистра, ВедущийОбъект, Форма, ЗапретРедактирования = Ложь)
	
	ТолькоПросмотрИстории = Форма.ТолькоПросмотр ИЛИ ЗапретРедактирования;
	Если Не ТолькоПросмотрИстории Тогда
		Попытка
			Форма.ЗаблокироватьДанныеФормыДляРедактирования();
			ТолькоПросмотрИстории = Ложь;
		Исключение
			ТолькоПросмотрИстории = Истина;
		КонецПопытки
	КонецЕсли;
	РедактированиеПериодическихСведенийКлиент.ОткрытьИсторию(ИмяРегистра, ВедущийОбъект, Форма, ТолькоПросмотрИстории);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаборЗаписейПериодическихСведений(ИмяРегистра, ВедущийОбъект) Экспорт
	
	РедактированиеПериодическихСведений.ПрочитатьНаборЗаписей(ЭтаФорма, ИмяРегистра, ВедущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Результат, ДополнительныеПараметры) Экспорт 
	
	Отказ = Ложь;
	СохранитьДанныеНаСервере(Отказ);
	
	Если Не Отказ Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПодсказкуВидаТарифаПриИзменении(Форма)
	
	ЗарплатаКадрыКлиентСервер.УстановитьРасширеннуюПодсказкуЭлементуФормы(
		Форма, "ВидТарифа", УчетСтраховыхВзносовКлиентСервер.ОписаниеВидаТарифа(Форма.ПрименяемыеТарифыСтраховыхВзносов.ВидТарифа));
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыФормыПоТекущимНастройкам()
	
	Элементы.ОрганизацияОписаниеДекорация.Видимость = ОбособленноеПодразделение;
	
	Элементы.ГруппаТарифСтраховыхВзносов.ТолькоПросмотр = ОбособленноеПодразделение;
	Элементы.ГруппаУчетСтраховыхВзносов.ТолькоПросмотр = ОбособленноеПодразделение;
	Элементы.НДФЛГруппа.ТолькоПросмотр = ОбособленноеПодразделение;
	
	// Установим видимость отдельных полей в зависимости от настройки.
	ИспользоватьНочные = ПолучитьФункциональнуюОпцию("УчитыватьНочныеЧасы");
	ИспользоватьВечерние = ПолучитьФункциональнуюОпцию("УчитыватьВечерниеЧасы");
	
	Если Не ИспользоватьНочные И Не ИспользоватьВечерние Тогда
		Элементы.ПроцентДоплатыЗаНочныеВечерниеГруппа.Видимость = Ложь;
	Иначе
		// Устанавливаем по отдельности видимость каждого поля.
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПроцентДоплатыЗаРаботуВНочноеВремяГруппа", "Видимость", ИспользоватьНочные);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПроцентДоплатыЗаРаботуВВечернееВремяГруппа", "Видимость", ИспользоватьВечерние);
	КонецЕсли;
	
	ОбновитьВидимостьПредупрежденийОРегионеПрямыхВыплат();
	ОбновитьДоступностьПолейПрямыхВыплат(ЭтотОбъект);
	ОбновитьДоступностьВариантУчетаКадровыхПерестановок(ЭтаФорма);
	ОбновитьВидимостьНастроекПоПериоду(ЭтаФорма);
	ОбновитьВидимостьНастроекИПНаУпрощенке(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуРегистрацииИзмененийТарифаСтраховыхВзносовПоПериоду(Результат = Истина, Параметр = Неопределено) Экспорт 
	ПрименяемыеТарифыСтраховыхВзносов.ДатаРегистрацииИзменений = НачалоМесяца(ПрименяемыеТарифыСтраховыхВзносов.Период);	
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтотОбъект, "ПрименяемыеТарифыСтраховыхВзносов.ДатаРегистрацииИзменений", "ПрименяемыеТарифыСтраховыхВзносовДатаРегистрацииИзмененийСтрокой");
КонецПроцедуры	

&НаКлиенте
Процедура ЗапроситьРежимИзмененияПрименяемыеТарифыСтраховыхВзносов(ДатаИзменения, Отказ, ОповещениеЗавершения)
	
	ТекстКнопкиДа = НСтр("ru = 'Изменились сведения о страховых взносах'");
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru =  'При редактировании изменены сведения о страховых взносах.
						|Если исправлена прежняя запись о страховых взносах (она была ошибочной), нажмите ""Исправлена ошибка"".
						|Если изменились сведения с %1, нажмите'") + " ""%2""",
			Формат(ДатаИзменения, "ДФ='д ММММ гггг ""г""'"),
			ТекстКнопкиДа);
			
	Оповещение = Новый ОписаниеОповещения("ЗапроситьРежимИзмененияСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев", ЭтотОбъект, ОповещениеЗавершения);		
	РедактированиеПериодическихСведенийКлиент.ЗапроситьРежимИзмененияРегистра(ЭтаФорма, "ПрименяемыеТарифыСтраховыхВзносов", ТекстВопроса, ТекстКнопкиДа, Отказ, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьРежимИзмененияСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев(Отказ, ОповещениеЗавершения) Экспорт
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ТекстКнопкиДа = НСтр("ru = 'Изменилась ставка взносов в ФСС НС и ПЗ'");
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru =  'При редактировании изменена ставка взносов в ФСС НС и ПЗ.
						|Если исправлена прежняя ставка взносов в ФСС НС и ПЗ (она была ошибочной), нажмите ""Исправлена ошибка"".
						|Если у сотрудника изменились сведения с %1, нажмите'") + " ""%2""",
			Формат(СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Период, "ДФ='д ММММ гггг ""г""'"),
			ТекстКнопкиДа);
			
	Оповещение = Новый ОписаниеОповещения("СохранитьДанныеЗавершение", ЭтотОбъект, ОповещениеЗавершения);		
	РедактированиеПериодическихСведенийКлиент.ЗапроситьРежимИзмененияРегистра(ЭтаФорма, "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев", ТекстВопроса, ТекстКнопкиДа, Отказ, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьРедактированиеРегистрацииВНалоговомОргане()
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СтруктурнаяЕдиница", ОрганизацияСсылка);
	ОткрытьФорму("ОбщаяФорма.РедактированиеРегистрацииВНалоговомОргане", ПараметрыОткрытия, ЭтотОбъект);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДатаВступленияРегионаОрганизацииВПроектПоПрямымВыплатам(Организация)
	Возврат ПрямыеВыплатыПособийСоциальногоСтрахования.ДатаВступленияРегионаОрганизацииВПроектПоПрямымВыплатам(Организация, ТекущаяДатаСеанса());
КонецФункции

&НаСервере
Процедура ОбновитьВидимостьПредупрежденийОРегионеПрямыхВыплат()
	ЭтоРегионПрямыхВыплат = ЗначениеЗаполнено(ДатаВступленияРегионаОрганизацииВПроектПоПрямымВыплатам(ОрганизацияСсылка));
	Элементы.ПредупреждениеОрганизацияВРегионеПрямыхВыплат.Видимость    = ЭтоРегионПрямыхВыплат И Не ОрганизацияВРегионеПрямыхВыплат;
	Элементы.ПредупреждениеОрганизацияВРегионеБезПрямыхВыплат.Видимость = Не ЭтоРегионПрямыхВыплат И ОрганизацияВРегионеПрямыхВыплат;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДоступностьПолейПрямыхВыплат(Форма)
	Форма.Элементы.ГруппаПрямыеВыплаты.Доступность = Форма.ОрганизацияВРегионеПрямыхВыплат;
	Форма.Элементы.ДатаПередачиФССВыплатыПособий.Доступность = Не Форма.ПособияВыплачиваютсяСтрахователемЧисло;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьВидимостьНастроекПоПериоду(Форма)
    
   Если Форма.УчетнаяПолитикаПоНалоговомуУчету.Период >= '2021-01-01' Тогда
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПрименятьОграничениеНаМинимальныйОбъектОСМС.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПредоставлятьВычетВМесяцеОтсутствияДохода.Видимость = Истина;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуНеПрименятьКорректировкуПрочихНалоговВзносовОтчислений.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетВОСМСДляФизическихЛицИГПХ.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетОПВДляГПХ.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетОПВиВОСМСДляГПХ.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложения.Видимость = Истина;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуКоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя.Видимость = Истина;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуКоэффициентМРПДляРасчетаСНЗаНаемногоРаботника.Видимость = Истина;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуСуммаЗаявленногоДоходаИП.Видимость = Форма.ОрганизацияЯвляетсяИП;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуСпособОтраженияПоДоходуСубъектаПредпринимательства.Видимость = Форма.ОрганизацияЯвляетсяИП;
    ИначеЕсли Форма.УчетнаяПолитикаПоНалоговомуУчету.Период >= '2020-01-01' Тогда
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПрименятьОграничениеНаМинимальныйОбъектОСМС.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПредоставлятьВычетВМесяцеОтсутствияДохода.Видимость = Истина;
		Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуНеПрименятьКорректировкуПрочихНалоговВзносовОтчислений.Видимость = Истина;
	    Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетВОСМСДляФизическихЛицИГПХ.Видимость = Истина;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетОПВиВОСМСДляГПХ.Видимость = Истина;
	    Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетОПВДляГПХ.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложения.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуКоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуКоэффициентМРПДляРасчетаСНЗаНаемногоРаботника.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуСуммаЗаявленногоДоходаИП.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуСпособОтраженияПоДоходуСубъектаПредпринимательства.Видимость = Ложь;
    ИначеЕсли Форма.УчетнаяПолитикаПоНалоговомуУчету.Период >= '2019-01-01' Тогда
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПрименятьОграничениеНаМинимальныйОбъектОСМС.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПредоставлятьВычетВМесяцеОтсутствияДохода.Видимость = Истина;
		Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуНеПрименятьКорректировкуПрочихНалоговВзносовОтчислений.Видимость = Ложь;
	    Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетВОСМСДляФизическихЛицИГПХ.Видимость = Ложь;
	    Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетОПВДляГПХ.Видимость = Истина;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетОПВиВОСМСДляГПХ.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложения.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуКоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуКоэффициентМРПДляРасчетаСНЗаНаемногоРаботника.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуСуммаЗаявленногоДоходаИП.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуСпособОтраженияПоДоходуСубъектаПредпринимательства.Видимость = Ложь;
   	ИначеЕсли Форма.УчетнаяПолитикаПоНалоговомуУчету.Период >= '2018-01-01' Тогда
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПрименятьОграничениеНаМинимальныйОбъектОСМС.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПредоставлятьВычетВМесяцеОтсутствияДохода.Видимость = Истина;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуНеПрименятьКорректировкуПрочихНалоговВзносовОтчислений.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетВОСМСДляФизическихЛицИГПХ.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетОПВДляГПХ.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетОПВиВОСМСДляГПХ.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложения.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуКоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуКоэффициентМРПДляРасчетаСНЗаНаемногоРаботника.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуСуммаЗаявленногоДоходаИП.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуСпособОтраженияПоДоходуСубъектаПредпринимательства.Видимость = Ложь;
    Иначе
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПрименятьОграничениеНаМинимальныйОбъектОСМС.Видимость = Истина;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПредоставлятьВычетВМесяцеОтсутствияДохода.Видимость = Ложь;
    	Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуНеПрименятьКорректировкуПрочихНалоговВзносовОтчислений.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетВОСМСДляФизическихЛицИГПХ.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетОПВДляГПХ.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетОПВиВОСМСДляГПХ.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложения.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуКоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуКоэффициентМРПДляРасчетаСНЗаНаемногоРаботника.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуСуммаЗаявленногоДоходаИП.Видимость = Ложь;
        Форма.Элементы.УчетнаяПолитикаПоНалоговомуУчетуСпособОтраженияПоДоходуСубъектаПредпринимательства.Видимость = Ложь;
   КонецЕсли;
    
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЗначениеНастроекПоПериоду(Форма)
    
    Если Форма.УчетнаяПолитикаПоНалоговомуУчету.Период >= '2021-01-01' Тогда
        Форма.УчетнаяПолитикаПоНалоговомуУчету.НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений = Ложь;
        Форма.УчетнаяПолитикаПоНалоговомуУчету.ПрименятьВычетВОСМСДляФизическихЛицИГПХ = Ложь;
        Форма.УчетнаяПолитикаПоНалоговомуУчету.ПрименятьВычетОПВиВОСМСДляГПХ = Ложь;
		Если НЕ ЗначениеЗаполнено(Форма.УчетнаяПолитикаПоНалоговомуУчету.СистемаНалогообложения) Тогда
			Форма.УчетнаяПолитикаПоНалоговомуУчету.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.Общая");	
		КонецЕсли;
	ИначеЕсли Форма.УчетнаяПолитикаПоНалоговомуУчету.Период >= '2019-01-01' Тогда
		Форма.УчетнаяПолитикаПоНалоговомуУчету.НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений = Ложь;
	    Форма.УчетнаяПолитикаПоНалоговомуУчету.ПрименятьВычетВОСМСДляФизическихЛицИГПХ = Ложь;
        Форма.УчетнаяПолитикаПоНалоговомуУчету.ПрименятьВычетОПВиВОСМСДляГПХ = Ложь;
        Форма.УчетнаяПолитикаПоНалоговомуУчету.СистемаНалогообложения = Неопределено;
        Форма.УчетнаяПолитикаПоНалоговомуУчету.КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя = 0;
        Форма.УчетнаяПолитикаПоНалоговомуУчету.КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника = 0;
        Форма.УчетнаяПолитикаПоНалоговомуУчету.СуммаЗаявленногоДоходаИП = 0;
        Форма.УчетнаяПолитикаПоНалоговомуУчету.СпособОтраженияПоДоходуСубъектаПредпринимательства = Неопределено;
   Иначе
    	Форма.УчетнаяПолитикаПоНалоговомуУчету.НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений = Ложь;
        Форма.УчетнаяПолитикаПоНалоговомуУчету.ПрименятьВычетВОСМСДляФизическихЛицИГПХ = Ложь;
        Форма.УчетнаяПолитикаПоНалоговомуУчету.ПрименятьВычетОПВиВОСМСДляГПХ = Ложь;
        Форма.УчетнаяПолитикаПоНалоговомуУчету.СистемаНалогообложения = Неопределено;
        Форма.УчетнаяПолитикаПоНалоговомуУчету.КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя = 0;
        Форма.УчетнаяПолитикаПоНалоговомуУчету.КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника = 0;
        Форма.УчетнаяПолитикаПоНалоговомуУчету.СуммаЗаявленногоДоходаИП = 0;
        Форма.УчетнаяПолитикаПоНалоговомуУчету.СпособОтраженияПоДоходуСубъектаПредпринимательства = Неопределено;
    КонецЕсли;
    
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЗначениеНастроекЗарплатаКадрыПоПериоду(Форма)
    
    Если Форма.УчетнаяПолитикаЗарплатаКадры.Период >= '2021-03-01' Тогда
        Форма.УчетнаяПолитикаЗарплатаКадры.ДеньУвольненияЯвляетсяРабочимДнем = Ложь;
    Иначе 
        Форма.УчетнаяПолитикаЗарплатаКадры.ДеньУвольненияЯвляетсяРабочимДнем = Истина;
    КонецЕсли;
    
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДоступностьВариантУчетаКадровыхПерестановок(Форма)
	Форма.Элементы.РасчетСреднегоЗаработкаОрганизацийВариантУчетаКадровыхПерестановок.Доступность = Форма.РасчетСреднегоЗаработкаОрганизаций.РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок;
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивЗаписейНабораПорядокОкругления()
	
	СтруктураЗаписиСтрокой = "Период, Организация, ВидРасчета, СпособОкругления";
	
	МассивЗаписей = Новый Массив();
	Для Каждого Строка Из ПорядокОкругленияРезультатовРасчетаЗарплатыНаборЗаписей Цикл
		НоваяСтрока = Новый Структура(СтруктураЗаписиСтрокой);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		МассивЗаписей.Добавить(НоваяСтрока);
	КонецЦикла;
	
	Возврат МассивЗаписей;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивЗаписейНабораСрокиПеречисленияВзносовИОтчислений()
	
	СтруктураЗаписиСтрокой = "Период, Организация, ВидНалогаВзносаОтчисления, ДатаПеречисленияНеПозжеЧем, ПорядокОпределенияСрокаПеречисления";
	
	МассивЗаписей = Новый Массив();
	Для Каждого Строка Из СрокиПеречисленияВзносовИОтчисленийНаборЗаписей Цикл
		НоваяСтрока = Новый Структура(СтруктураЗаписиСтрокой);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		МассивЗаписей.Добавить(НоваяСтрока);
	КонецЦикла;
	
	Возврат МассивЗаписей;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПолеСведенияОРасчетеСреднегоЗаработкаПериод(Форма, Элементы, РасчетСреднегоЗаработкаОрганизаций, РасчетСреднегоЗаработкаОрганизацийПрежняя, ДатаСеанса)

	Если Элементы.Найти("РасчетСреднегоЗаработкаОрганизацийПериодСтрокой") = НеОпределено Тогда
		Возврат;
	КонецЕсли;
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(Форма, "РасчетСреднегоЗаработкаОрганизаций", Форма.ОрганизацияСсылка);
	// Не обязательно заполнение поля Период если данные по умолчанию и при этом 
	// записи о среднем заработке еще нет.
	Если Не ЗначениеЗаполнено(РасчетСреднегоЗаработкаОрганизаций.УчетРабочегоВремени) И Не ЗначениеЗаполнено(РасчетСреднегоЗаработкаОрганизаций.Период) Тогда
		Если ЗначениеЗаполнено(РасчетСреднегоЗаработкаОрганизаций.Период) Тогда
			РасчетСреднегоЗаработкаОрганизаций.Период = '00010101';
		КонецЕсли; 
	Иначе
		Если Не ЗначениеЗаполнено(РасчетСреднегоЗаработкаОрганизаций.Период) Тогда
			РасчетСреднегоЗаработкаОрганизаций.Период = НачалоМесяца(ДатаСеанса);
		КонецЕсли; 
	КонецЕсли;
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(Форма, "РасчетСреднегоЗаработкаОрганизаций.Период", "РасчетСреднегоЗаработкаОрганизацийПериодСтрокой");

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПолеУчетнаяПолитикаПоНалоговомуУчетуПериод(Форма)
	
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(Форма, "УчетнаяПолитикаПоНалоговомуУчету", Форма.ОрганизацияСсылка);
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(Форма, "УчетнаяПолитикаПоНалоговомуУчету.Период", "УчетнаяПолитикаПоНалоговомуУчетуПериодСтрокой");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПолеУчетнаяПолитикаЗарплатаКадрыПериод(Форма)
	
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(Форма, "УчетнаяПолитикаЗарплатаКадры", ?(Форма.ОбособленноеПодразделение, Форма.ГоловнаяОрганизация, Форма.ОрганизацияСсылка));
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(Форма, "УчетнаяПолитикаЗарплатаКадры.Период", "УчетнаяПолитикаЗарплатаКадрыПериодСтрокой");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСведенияОПеречисленииВзносовИОтчислений(МассивЗаписей)
	
	СрокиПеречисленияВзносовИОтчисленийНаборЗаписей.Очистить();
	Для Каждого СтрокаМассива Из МассивЗаписей Цикл
		ЗаполнитьЗначенияСвойств(СрокиПеречисленияВзносовИОтчисленийНаборЗаписей.Добавить(), СтрокаМассива);
	КонецЦикла;
	ПрочитатьНастройкиПеречисленияВзносовИОтчисленийВФорме();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСведенияОПорядкеОкругления(МассивЗаписей)
	
	ПорядокОкругленияРезультатовРасчетаЗарплатыНаборЗаписей.Очистить();
	Для Каждого СтрокаМассива Из МассивЗаписей Цикл
		ЗаполнитьЗначенияСвойств(ПорядокОкругленияРезультатовРасчетаЗарплатыНаборЗаписей.Добавить(), СтрокаМассива);
	КонецЦикла;
	ПрочитатьНастройкиПорядкаОкругленияВФорме();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияИсторииПорядкаОкругления()
	
	ТолькоПросмотрИстории = ТолькоПросмотр;
	Если Не ТолькоПросмотрИстории Тогда
		Попытка
			ЗаблокироватьДанныеФормыДляРедактирования();
			ТолькоПросмотрИстории = Ложь;
		Исключение
			ТолькоПросмотрИстории = Истина;
		КонецПопытки
	КонецЕсли;
	
	Если НЕ ПорядокОкругленияРезультатовРасчетаЗарплатыНаборЗаписейПрочитан Тогда 
		ПрочитатьНаборЗаписейПериодическихСведений("ПорядокОкругленияРезультатовРасчетаЗарплаты", ОрганизацияСсылка);
	КонецЕсли;
	
	МассивЗаписей = ПолучитьМассивЗаписейНабораПорядокОкругления();

	ПараметрыФормы = Новый Структура("МассивЗаписей,ВедущийОбъект,ТолькоПросмотр", МассивЗаписей, ОрганизацияСсылка, ТолькоПросмотрИстории);
	ОткрытьФорму("РегистрСведений.ПорядокОкругленияРезультатовРасчетаЗарплаты.Форма.РедактированиеИстории" , ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияИсторииРасчетСреднегоЗаработка()

	ТолькоПросмотрИстории = ТолькоПросмотр;
	Если Не ТолькоПросмотрИстории Тогда
		Попытка
			ЗаблокироватьДанныеФормыДляРедактирования();
			ТолькоПросмотрИстории = Ложь;
		Исключение
			ТолькоПросмотрИстории = Истина;
		КонецПопытки
	КонецЕсли;
	
	МассивЗаписей = РедактированиеПериодическихСведенийКлиентСервер.МассивЗаписейИстории(ЭтаФорма, "РасчетСреднегоЗаработкаОрганизаций", ОрганизацияСсылка);
	
	ПараметрыФормы = Новый Структура("МассивЗаписей,ВедущийОбъект,ТолькоПросмотр", МассивЗаписей, ОрганизацияСсылка, ТолькоПросмотрИстории);
	ОткрытьФорму("РегистрСведений.РасчетСреднегоЗаработкаОрганизаций.Форма.РедактированиеИстории" , ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияИсторииСроковПеречисленияВзносовИОтчислений()
	
	ТолькоПросмотрИстории = ТолькоПросмотр;
	Если Не ТолькоПросмотрИстории Тогда
		Попытка
			ЗаблокироватьДанныеФормыДляРедактирования();
			ТолькоПросмотрИстории = Ложь;
		Исключение
			ТолькоПросмотрИстории = Истина;
		КонецПопытки
	КонецЕсли;
	
	Если НЕ СрокиПеречисленияВзносовИОтчисленийНаборЗаписейПрочитан Тогда 
		ПрочитатьНаборЗаписейПериодическихСведений("СрокиПеречисленияВзносовИОтчислений", ОрганизацияСсылка);
	КонецЕсли;
	
	МассивЗаписей = ПолучитьМассивЗаписейНабораСрокиПеречисленияВзносовИОтчислений();

	ПараметрыФормы = Новый Структура("МассивЗаписей,ВедущийОбъект,ТолькоПросмотр", МассивЗаписей, ОрганизацияСсылка, ТолькоПросмотрИстории);
	ОткрытьФорму("РегистрСведений.СрокиПеречисленияВзносовИОтчислений.Форма.РедактированиеИстории" , ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречисленияВзносовИОтчисленийИстория(Команда)

	ОткрытьФормуРедактированияИсторииСроковПеречисленияВзносовИОтчислений();
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокОкругленияРезультатовРасчетаЗарплатыИстория(Команда)
	ОткрытьФормуРедактированияИсторииПорядкаОкругления();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеРасчетаСреднегоЗаработкаДляРедактированияВФорме()

	РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(ЭтаФорма, "РасчетСреднегоЗаработкаОрганизаций", ОрганизацияСсылка);
	ОбновитьПолеСведенияОРасчетеСреднегоЗаработкаПериод(ЭтаФорма, ЭтаФорма.Элементы, РасчетСреднегоЗаработкаОрганизаций, РасчетСреднегоЗаработкаОрганизацийПрежняя, ТекущаяДатаСеанса());
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеУчетнойПолитикиПоНалоговомуУчету()

	РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(ЭтаФорма, "УчетнаяПолитикаПоНалоговомуУчету", ОрганизацияСсылка);
	ЭлементВыбораПустаяСсылка = Элементы.УчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложения.СписокВыбора.НайтиПоЗначению(Перечисления.СистемыНалогообложения.ПустаяСсылка());
	
	Если Не ЗначениеЗаполнено(УчетнаяПолитикаПоНалоговомуУчету.Период) Тогда
		
		УчетнаяПолитикаПоНалоговомуУчету.Период = НачалоГода(ТекущаяДатаСеанса());
		УчетнаяПолитикаПоНалоговомуУчету.СистемаНалогообложения = ЗарплатаКадрыПереопределяемый.СистемаНалогообложенияПоУмолчанию(УчетнаяПолитикаПоНалоговомуУчету.Организация, УчетнаяПолитикаПоНалоговомуУчету.Период);
		
		Модифицированность = Истина;
		
		Если НЕ ЭлементВыбораПустаяСсылка = Неопределено Тогда
			Элементы.УчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложения.СписокВыбора.Удалить(ЭлементВыбораПустаяСсылка);	
		КонецЕсли;
		
	Иначе
		
		// отображаем только у существующих учетных политик
		Если НЕ (УчетнаяПолитикаПоНалоговомуУчету.Период >= Дата('20210101') И УчетнаяПолитикаПоНалоговомуУчету.Период < Дата('20211231'))
			ИЛИ НЕ УчетнаяПолитикаПоНалоговомуУчету.СистемаНалогообложения = Перечисления.СистемыНалогообложения.ПустаяСсылка() Тогда
			
			Если НЕ ЭлементВыбораПустаяСсылка = Неопределено Тогда
				Элементы.УчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложения.СписокВыбора.Удалить(ЭлементВыбораПустаяСсылка);	
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	ОбновитьПолеУчетнаяПолитикаПоНалоговомуУчетуПериод(ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеУчетнойПолитикиЗарплатаКадры()

	РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(ЭтаФорма, "УчетнаяПолитикаЗарплатаКадры", ?(ОбособленноеПодразделение, ГоловнаяОрганизация, ОрганизацияСсылка));
	
	Если Не ЗначениеЗаполнено(УчетнаяПолитикаЗарплатаКадры.Период) Тогда
		
		УчетнаяПолитикаЗарплатаКадры.Период = НачалоГода(ТекущаяДатаСеанса());
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
	ОбновитьПолеУчетнаяПолитикаЗарплатаКадрыПериод(ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиПеречисленияВзносовИОтчисленийВФорме()

	Если НЕ СрокиПеречисленияВзносовИОтчисленийНаборЗаписейПрочитан Тогда
		ПрочитатьНаборЗаписейПериодическихСведений("СрокиПеречисленияВзносовИОтчислений", ОрганизацияСсылка);
	КонецЕсли;
		
	НаборЗаписей = СрокиПеречисленияВзносовИОтчислений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаЗаписей", СрокиПеречисленияВзносовИОтчисленийНаборЗаписей.Выгрузить());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СрокиПеречисленияВзносовИОтчислений.Период,
		|	СрокиПеречисленияВзносовИОтчислений.Организация,
		|	СрокиПеречисленияВзносовИОтчислений.ВидНалогаВзносаОтчисления,
		|	СрокиПеречисленияВзносовИОтчислений.ДатаПеречисленияНеПозжеЧем,
		|	СрокиПеречисленияВзносовИОтчислений.ПорядокОпределенияСрокаПеречисления
		|ПОМЕСТИТЬ ВТТаблицаЗаписей
		|ИЗ
		|	&ТаблицаЗаписей КАК СрокиПеречисленияВзносовИОтчислений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыСроковПеречисления.Период,
		|	ПериодыСроковПеречисления.ВидНалогаВзносаОтчисления,
		|	ВТТаблицаЗаписей.ДатаПеречисленияНеПозжеЧем,
		|	ВТТаблицаЗаписей.ПорядокОпределенияСрокаПеречисления,
		|	ВТТаблицаЗаписей.Организация
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ВТТаблицаЗаписей.Период) КАК Период,
		|		ВТТаблицаЗаписей.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления
		|	ИЗ
		|		ВТТаблицаЗаписей КАК ВТТаблицаЗаписей
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТТаблицаЗаписей.ВидНалогаВзносаОтчисления) КАК ПериодыСроковПеречисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаЗаписей КАК ВТТаблицаЗаписей
		|		ПО ПериодыСроковПеречисления.Период = ВТТаблицаЗаписей.Период
		|			И ПериодыСроковПеречисления.ВидНалогаВзносаОтчисления = ВТТаблицаЗаписей.ВидНалогаВзносаОтчисления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей.Очистить();
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);		
	КонецЦикла;	
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДатеВТабличнойЧасти(НаборЗаписей, "Период", "ПериодСтрокой");

КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиПорядкаОкругленияВФорме()

	Если НЕ ПорядокОкругленияРезультатовРасчетаЗарплатыНаборЗаписейПрочитан Тогда
		ПрочитатьНаборЗаписейПериодическихСведений("ПорядокОкругленияРезультатовРасчетаЗарплаты", ОрганизацияСсылка);
	КонецЕсли;
		
	НаборЗаписей = ПорядокОкругленияРезультатовРасчетаЗарплаты;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаЗаписей", ПорядокОкругленияРезультатовРасчетаЗарплатыНаборЗаписей.Выгрузить());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПорядокОкругленияРезультатовРасчетаЗарплаты.Период,
		|	ПорядокОкругленияРезультатовРасчетаЗарплаты.Организация,
		|	ПорядокОкругленияРезультатовРасчетаЗарплаты.ВидРасчета,
		|	ПорядокОкругленияРезультатовРасчетаЗарплаты.СпособОкругления
		|ПОМЕСТИТЬ ВТТаблицаЗаписей
		|ИЗ
		|	&ТаблицаЗаписей КАК ПорядокОкругленияРезультатовРасчетаЗарплаты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыПорядкаОкругления.Период,
		|	ПериодыПорядкаОкругления.ВидРасчета,
		|	ВТТаблицаЗаписей.СпособОкругления,
		|	ВТТаблицаЗаписей.Организация
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ВТТаблицаЗаписей.Период) КАК Период,
		|		ВТТаблицаЗаписей.ВидРасчета КАК ВидРасчета
		|	ИЗ
		|		ВТТаблицаЗаписей КАК ВТТаблицаЗаписей
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТТаблицаЗаписей.ВидРасчета) КАК ПериодыПорядкаОкругления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаЗаписей КАК ВТТаблицаЗаписей
		|		ПО ПериодыПорядкаОкругления.Период = ВТТаблицаЗаписей.Период
		|			И ПериодыПорядкаОкругления.ВидРасчета = ВТТаблицаЗаписей.ВидРасчета";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей.Очистить();
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);		
	КонецЦикла;	
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДатеВТабличнойЧасти(НаборЗаписей, "Период", "ПериодСтрокой");

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьВидимостьНастроекИПНаУпрощенке(ЭтаФорма)

	Элементы = ЭтаФорма.Элементы;
	
	Элементы.УчетнаяПолитикаПоНалоговомуУчетуСуммаЗаявленногоДоходаИП.Видимость = ЭтаФорма.ОрганизацияЯвляетсяИП И ЗначениеЗаполнено(ЭтаФорма.УчетнаяПолитикаПоНалоговомуУчету.СистемаНалогообложения);
	Элементы.УчетнаяПолитикаПоНалоговомуУчетуСпособОтраженияПоДоходуСубъектаПредпринимательства.Видимость = ЭтаФорма.ОрганизацияЯвляетсяИП И ЗначениеЗаполнено(ЭтаФорма.УчетнаяПолитикаПоНалоговомуУчету.СистемаНалогообложения);
	Элементы.ГруппаСНИндивидуальногоПредпринимателя.Видимость = ЭтаФорма.ОрганизацияЯвляетсяИП И ЭтаФорма.УчетнаяПолитикаПоНалоговомуУчету.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.Общая");
	
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложенияПриИзменении(Элемент)
	
	ОбновитьВидимостьНастроекИПНаУпрощенке(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти
