#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьСведенияОСтавкахНалоговСборовОтчислений();
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОСтавкахНалоговСборовОтчислений() Экспорт
	
	НаборЗаписей = РегистрыСведений.СведенияОСтавкахНалоговСборовОтчислений.СоздатьНаборЗаписей();

	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20150101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВ, Справочники.ВидыДоходов.ДоходыОтРаботодателя,     10.0);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20150101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОППВ, Справочники.ВидыДоходов.ДоходыОтРаботодателя,    5.0);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20150101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.СО, Справочники.ВидыДоходов.ДоходыОтРаботодателя,      5.0);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20150101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.СН, Справочники.ВидыДоходов.ДоходыОтРаботодателя,      11.0);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20180101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.СО, Справочники.ВидыДоходов.ДоходыОтРаботодателя,      3.5);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20180101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.СН, Справочники.ВидыДоходов.ДоходыОтРаботодателя,      9.5);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20200101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВ, Справочники.ВидыДоходов.ДоходыОтРаботодателя,     10.0);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20200101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВ, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, 10.0);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20200601', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВ, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, 5.0);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20210101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВ, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, 10.0);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20210101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВ, Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства, 10.0);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20210101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.СО, Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства, 3.5);
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, Период, Организация, ВидНалогаВзносаОтчисления, ВидДохода, Ставка)
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;
	НоваяЗапись.Организация = Организация;
	НоваяЗапись.ВидНалогаВзносаОтчисления = ВидНалогаВзносаОтчисления;
	НоваяЗапись.ВидДохода = ВидДохода;
	НоваяЗапись.Ставка = Ставка;
	
КонецПроцедуры

Процедура ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой(Период, Организация, ВидНалога, ВидДохода, Коэффициент) 
	
	НаборЗаписей = РегистрыСведений.СведенияОСтавкахНалоговСборовОтчислений.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ВидНалогаВзносаОтчисления.Установить(ВидНалога, Истина);
	НаборЗаписей.Отбор.ВидДохода.Установить(ВидДохода, Истина);
	НаборЗаписей.Отбор.Организация.Установить(Организация, Истина);
	НаборЗаписей.Отбор.Период.Установить(Период, Истина);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Движение = НаборЗаписей.Добавить();
		// Свойства
		Движение.Период = Период;
		//Измерения
		Движение.Организация = Организация;
		Движение.ВидНалогаВзносаОтчисления = ВидНалога;
		Движение.ВидДохода = ВидДохода;
		// Ресурсы
		Движение.Ставка = Коэффициент;
		
		Попытка
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСведенияОСтавкахНалоговСборовОтчислений2018() Экспорт
	
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20180101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.СО, Справочники.ВидыДоходов.ДоходыОтРаботодателя, 3.5);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20180101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.СН, Справочники.ВидыДоходов.ДоходыОтРаботодателя, 9.5);
	
КонецПроцедуры

Процедура ДобавитьСведенияОСтавкахНалоговСборовОтчислений20200601() Экспорт
	
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20200601', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВ, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, 5.0);
	
КонецПроцедуры
	
Процедура ДобавитьСведенияОСтавкахНалоговСборовОтчислений20210101() Экспорт
	
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20210101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВ, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, 10.0);
	
КонецПроцедуры
	
Процедура ДобавитьСведенияОСтавкахНалоговСборовОтчисленийДоходСубъектаПредпринимательства2021() Экспорт
	
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20210101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВ, Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства, 10.0);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20210101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.СО, Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства, 3.5);
	
КонецПроцедуры
	
#КонецОбласти

#КонецЕсли