&НаКлиенте
Процедура КомандаПолученияДанныхGIT(Команда)
	
	ОбновитьСправочникиИнфополейНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСправочникиИнфополейНаСервере()
	
	Справочники.ЭКОМ_ИнфоПоля.ОбновитьСправочникиИнфополей();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.АвтоОбновление = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ОбновлениеИнфоПолейВключено", Истина, "Служебный");
КонецПроцедуры

&НаКлиенте
Процедура АвтоОбновлениеПриИзменении(Элемент)
	
	МассивЛогаСобытий = Новый Массив;	
	НастройкаЗаписана = ЭКОМ_ОбщегоНазначения.НастройкаПараметрЗаписать("ОбновлениеИнфоПолейВключено", ЭтаФорма.АвтоОбновление, "Служебный", МассивЛогаСобытий);
	Если НастройкаЗаписана = Ложь Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий);
		Сообщение.Сообщить();
	КонецЕсли;

КонецПроцедуры
