&НаКлиенте
Перем ОбработкаКС Экспорт;

&НаКлиенте
Перем ФормаДлительнойОперации;

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Обход ошибки платформы "Параметр сеанса отсутствует или удален".
	ТабличныйДокумент.Очистить();
	
	СформироватьСтруктуруРеквизитовФормы();
	
	СоответствиеЕдиницыИзмеренияДелителю = Новый Структура;
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1", 1);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000", 1000);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000000", 1000000);
	
	// ОПИСАНИЕ ПАРАМЕТРОВ МНОГОСТРОЧНЫХ ГРУПП
	// Идентификаторы многострочных групп
	СтруктураРеквизитовФормы.мИдГруппы31  = "П0003100002";
	СтруктураРеквизитовФормы.мИдГруппы32  = "П0003200002";
    СтруктураРеквизитовФормы.мИдГруппы51  = "П0005100002";
    СтруктураРеквизитовФормы.мИдГруппы52  = "П0005200002";
	СтруктураРеквизитовФормы.мИдГруппы53  = "П0005300002";
	СтруктураРеквизитовФормы.мИдГруппы71  = "П0007100001";
	СтруктураРеквизитовФормы.мИдГруппы72  = "П0007200002";
	СтруктураРеквизитовФормы.мИдГруппы73  = "П0007300001";
	СтруктураРеквизитовФормы.мИдГруппы81  = "П0008100001";
	СтруктураРеквизитовФормы.мИдГруппы82  = "П0008200002";
	СтруктураРеквизитовФормы.мИдГруппы83  = "П0008300001";
	
	//300.03
	КолИсхСтрокИдГруппы31  = 1;
	КолИсхСтрокИдГруппы32  = 1;
	
	//300.05
    КолИсхСтрокИдГруппы51  = 1;
    КолИсхСтрокИдГруппы52  = 1;
	КолИсхСтрокИдГруппы53  = 1;
	
	//300.07
	КолИсхСтрокИдГруппы71  = 1;
	КолИсхСтрокИдГруппы72  = 1;
	КолИсхСтрокИдГруппы73  = 1;
	
	//300.08
	КолИсхСтрокИдГруппы81  = 1;
	КолИсхСтрокИдГруппы82  = 1;
	КолИсхСтрокИдГруппы83  = 1;
	
	//300.03
	КолКолонокИдГруппы31 = 4;
	КолКолонокИдГруппы32 = 4;
	
	//300.05
    КолКолонокИдГруппы51 = 6;
    КолКолонокИдГруппы52 = 5;
	КолКолонокИдГруппы53 = 5;
	
	//300.07
	КолКолонокИдГруппы71 = 6;
	КолКолонокИдГруппы72 = 4;
	КолКолонокИдГруппы73 = 4;
	
	//300.07
	КолКолонокИдГруппы81 = 6;
	КолКолонокИдГруппы82 = 4;
	КолКолонокИдГруппы83 = 4;
	
	СтруктураДанныхФорма300Страница1        = Новый Структура;
	СтруктураДанныхФорма300Страница2        = Новый Структура;
	СтруктураДанныхФорма300Страница3        = Новый Структура;
	СтруктураДанныхФорма300_01Страница1     = Новый Структура;
	СтруктураДанныхФорма300_02Страница1     = Новый Структура;
	СтруктураДанныхФорма300_03Страница1     = Новый Структура;
	СтруктураДанныхФорма300_03Страница2     = Новый Структура;
	СтруктураДанныхФорма300_04Страница1     = Новый Структура;
	СтруктураДанныхФорма300_05Страница1     = Новый Структура;
	СтруктураДанныхФорма300_05Страница2     = Новый Структура;
	СтруктураДанныхФорма300_05Страница3     = Новый Структура;
	СтруктураДанныхФорма300_06Страница1     = Новый Структура;
	СтруктураДанныхФорма300_07Страница1     = Новый Структура;
	СтруктураДанныхФорма300_07Страница2     = Новый Структура;
	СтруктураДанныхФорма300_07Страница3     = Новый Структура;
	СтруктураДанныхФорма300_08Страница1     = Новый Структура;
	СтруктураДанныхФорма300_08Страница2     = Новый Структура;
	СтруктураДанныхФорма300_08Страница3     = Новый Структура;
	
	
	
	// структура многострочных разделов формы
	мСтруктураМногострочныхРазделов = Новый Структура;
	//300.03
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы31, СтруктураРеквизитовФормы.мИдГруппы31);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы32, СтруктураРеквизитовФормы.мИдГруппы32);
	//300.05
    мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы51, СтруктураРеквизитовФормы.мИдГруппы51);
    мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы52, СтруктураРеквизитовФормы.мИдГруппы52);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы53, СтруктураРеквизитовФормы.мИдГруппы53);
	//300.07
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы71, СтруктураРеквизитовФормы.мИдГруппы71);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы72, СтруктураРеквизитовФормы.мИдГруппы72);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы73, СтруктураРеквизитовФормы.мИдГруппы73);
	//300.08
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы81, СтруктураРеквизитовФормы.мИдГруппы81);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы82, СтруктураРеквизитовФормы.мИдГруппы82);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы83, СтруктураРеквизитовФормы.мИдГруппы83);
	
	// Структура содержит данные дополнительных страниц
	мСтруктураМногостраничныхРазделов = Новый Структура;
	
	// структура исходных строк (минимального кол-ва) многострочных разделов формы
	мСтруктураИсхКолвоСтрокРазделов = Новый Структура;
	//300.03
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы31, КолИсхСтрокИдГруппы31);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы32, КолИсхСтрокИдГруппы32);
	//300.05
    мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы51, КолИсхСтрокИдГруппы51);
    мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы52, КолИсхСтрокИдГруппы52);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы53, КолИсхСтрокИдГруппы53);
	//300.07
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы71, КолИсхСтрокИдГруппы71);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы72, КолИсхСтрокИдГруппы72);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы73, КолИсхСтрокИдГруппы73);
	//300.08
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы81, КолИсхСтрокИдГруппы81);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы82, КолИсхСтрокИдГруппы82);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы83, КолИсхСтрокИдГруппы83);
	
	мСтруктураКолвоКолонокРазделов = Новый Структура;
	//300.03
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы31, КолКолонокИдГруппы31);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы32, КолКолонокИдГруппы32);
	//300.05
    мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы51, КолКолонокИдГруппы51);
    мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы52, КолКолонокИдГруппы52);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы53, КолКолонокИдГруппы53);
	//300.07
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы71, КолКолонокИдГруппы71);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы72, КолКолонокИдГруппы72);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы73, КолКолонокИдГруппы73);
	//300.08
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы81, КолКолонокИдГруппы81);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы82, КолКолонокИдГруппы82);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы83, КолКолонокИдГруппы83);
	
	
	СтруктураРеквизитовФормы.СписокПечатаемыхЛистов = Новый СписокЗначений;
	СтруктураРеквизитовФормы.мПечатныеформы = Новый СписокЗначений;
	
	СтруктураРеквизитовФормы.мВыбраннаяФорма          = Параметры.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета  = Параметры.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета = Параметры.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мПериодичность           = Параметры.мПериодичность;
	СтруктураРеквизитовФормы.мСкопированаФорма        = Параметры.мСкопированаФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок          = Параметры.мСохраненныйДок;
	СтруктураРеквизитовФормы.Организация              = Параметры.Организация;
	СтруктураРеквизитовФормы.ВидДокумента = 0;
	СтруктураРеквизитовФормы.мМетодРасчета = ПолучитьМетодОтнесенияНДСВЗачет();
	
	Попытка
		НалоговыйКомитет = СтруктураРеквизитовФормы.Организация.РегистрацияВНалоговомОргане;
	Исключение
		 НалоговыйКомитет = Неопределено;
	КонецПопытки;
	СтруктураРеквизитовФормы.НалоговыйКомитет = ?(ЗначениеЗаполнено(НалоговыйКомитет),НалоговыйКомитет,Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка());
	
	ИмяРаздела = "Форма300Страница1";
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(
	ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяРаздела));
	
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	
	СформироватьОтчетныйПериод();
	
	Инициализация(Параметры.БезОткрытияФормы);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруРеквизитовФормы()
	
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("Организация");
	СтруктураРеквизитовФормы.Вставить("ЕдиницаИзмерения");
	СтруктураРеквизитовФормы.Вставить("ТочностьЕдиницыИзмерения");
	СтруктураРеквизитовФормы.Вставить("мКвартал");
	СтруктураРеквизитовФормы.Вставить("мГод");
	СтруктураРеквизитовФормы.Вставить("мДатаНачалаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мДатаКонцаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мПериодичность");
	СтруктураРеквизитовФормы.Вставить("мСкопированаФорма");
	СтруктураРеквизитовФормы.Вставить("мСохраненныйДок");
	СтруктураРеквизитовФормы.Вставить("мВыбраннаяФорма");
	СтруктураРеквизитовФормы.Вставить("мЗаписываетсяНовыйДокумент");
	СтруктураРеквизитовФормы.Вставить("мВариант");
	СтруктураРеквизитовФормы.Вставить("мПроверятьСоотношенияПриПечатиИВыгрузки");
	СтруктураРеквизитовФормы.Вставить("СписокПечатаемыхЛистов");
	СтруктураРеквизитовФормы.Вставить("мРежимПечати");
	СтруктураРеквизитовФормы.Вставить("мСчетчикСтраниц");
	СтруктураРеквизитовФормы.Вставить("мПечатныеФормы");
	СтруктураРеквизитовФормы.Вставить("НаимТекущегоРаздела");
	СтруктураРеквизитовФормы.Вставить("ВидДокумента");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы31");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы32");
    СтруктураРеквизитовФормы.Вставить("мИдГруппы51");
    СтруктураРеквизитовФормы.Вставить("мИдГруппы52");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы53");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы71");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы72");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы73");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы81");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы82");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы83");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы911");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы912");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы913");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы921");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы922");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы923");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы931");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы932");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы933");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы941");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы942");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы943");
	СтруктураРеквизитовФормы.Вставить("мМетодРасчета");
	СтруктураРеквизитовФормы.Вставить("АдресВоВременномХранилище");
	СтруктураРеквизитовФормы.Вставить("АдресВременногоХранилищаРасшифровки");
	СтруктураРеквизитовФормы.Вставить("ГруппаОрганизаций", Новый СписокЗначений);
	СтруктураРеквизитовФормы.Вставить("ИдентификаторЗадания");
	СтруктураРеквизитовФормы.Вставить("УспешноеАвтозаполнение");
	СтруктураРеквизитовФормы.Вставить("ВерсияАвтозаполнения");
	СтруктураРеквизитовФормы.Вставить("ВыводитьСтраницуВТаблДокНаСервере");
	СтруктураРеквизитовФормы.Вставить("НалоговыйКомитет");
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСтраницОтчета() 
	
	// Дерево содержит коллекцию страниц отчета.
	мДеревоСтраницОтчета.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300Страница1";
	СтрокаУровня1.Представление            = "Форма 300.00 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300Страница2";
	СтрокаУровня1.Представление            = "Форма 300.00 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300Страница3";
	СтрокаУровня1.Представление            = "Форма 300.00 Страница 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_01Страница1";
	СтрокаУровня1.Представление            = "Форма 300.01 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_02Страница1";
	СтрокаУровня1.Представление            = "Форма 300.02 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_03Страница1";
	СтрокаУровня1.Представление            = "Форма 300.03 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_03Страница2";
	СтрокаУровня1.Представление            = "Форма 300.03 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_04Страница1";
	СтрокаУровня1.Представление            = "Форма 300.04 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_05Страница1";
	СтрокаУровня1.Представление            = "Форма 300.05 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_05Страница2";
	СтрокаУровня1.Представление            = "Форма 300.05 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_05Страница3";
	СтрокаУровня1.Представление            = "Форма 300.05 Страница 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_06Страница1";
	СтрокаУровня1.Представление            = "Форма 300.06 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_07Страница1";
	СтрокаУровня1.Представление            = "Форма 300.07 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_07Страница2";
	СтрокаУровня1.Представление            = "Форма 300.07 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_07Страница3";
	СтрокаУровня1.Представление            = "Форма 300.07 Страница 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_08Страница1";
	СтрокаУровня1.Представление            = "Форма 300.08 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_08Страница2";
	СтрокаУровня1.Представление            = "Форма 300.08 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_08Страница3";
	СтрокаУровня1.Представление            = "Форма 300.08 Страница 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСвойствСтраниц() Экспорт
	
	мСвойстваРазделовДекларации.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	
	СтрокаУровня1.ИмяСтраницы                          = "Форма300Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300Страница3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_01Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_02Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_03Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы31;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_03Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы32;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_04Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_05Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы51;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_05Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы52;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_05Страница3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы53;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_06Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_07Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы71;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_07Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы72;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_07Страница3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы73;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_08Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы81;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_08Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы82;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма300_08Страница3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы83;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПустыеСтруктурыДанных()
	
	СохрТабличныйДокумент = Новый ТабличныйДокумент;
	
	СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		ИмяГруппы = ЭлементСтруктуры.Ключ;
		СтруктураГруппы = ЭтаФорма[ЭлементСтруктуры.Значение];
		СтруктураГруппы.Очистить();
	КонецЦикла;
	
	Для Каждого Раздел Из мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
		
		ТабличныйДокумент.Очистить();
		ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + Раздел.ИмяСтраницы));
		
		СохранитьДанныеРаздела(Раздел.ИмяСтраницы);
		
	КонецЦикла;
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоРазделовОтчетаНаСервере() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДеревоРазделовОтчетаНаКлиенте() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьДеревоРазделовОтчета(Форма)
	
	Форма["РазделыОтчета"].ПолучитьЭлементы().Очистить();
	МассивНаименований = Новый Массив;
	
	Для Каждого ЭлементДереваСтраницОтчета Из Форма["мДеревоСтраницОтчета"].ПолучитьЭлементы() Цикл
		
		Если ЭлементДереваСтраницОтчета.ПоказатьСтраницу = 1 Тогда
			
			Если МассивНаименований.Найти(ЭлементДереваСтраницОтчета.ИмяСтраницы) = Неопределено Тогда 
				
				ЭлементРазделовОтчета = Форма["РазделыОтчета"].ПолучитьЭлементы().Добавить();
				ЭлементРазделовОтчета.КолонкаРазделыОтчета = Лев(ЭлементДереваСтраницОтчета.Представление,12);
				ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим = ЭлементДереваСтраницОтчета.ИмяСтраницы;
				МассивНаименований.Добавить(ЭлементДереваСтраницОтчета.ИмяСтраницы);
				ЭлементРазделовОтчета.РазделМногострочный = МногострочныйРаздел(ЭлементДереваСтраницОтчета.ИмяСтраницы);
				
				Если ЭтоРазделРодитель(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим) Тогда
					
					Для НомерПодраздела = 1 По ПолучитьКоличествоПодразделовПоРодителю(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим) Цикл
						
						СтраницаРазделаОтчета = ЭлементРазделовОтчета.ПолучитьЭлементы().Добавить();
						
						СтраницаРазделаОтчета.КолонкаРазделыОтчета              = Лев(ЭлементДереваСтраницОтчета.Представление,СтрДлина(ЭлементДереваСтраницОтчета.Представление)-1) + НомерПодраздела;
						СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим      = Лев(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим, СтрДлина(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим)-1) + НомерПодраздела;
						МассивНаименований.Добавить(СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим);
						СтраницаРазделаОтчета.РазделМногострочный               = ЭлементРазделовОтчета.РазделМногострочный;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоРазделРодитель(ИмяРаздела)
	
	Результат = (ИмяРаздела = "Форма300Страница1")
	ИЛИ (ИмяРаздела = "Форма300_01Страница1")
	ИЛИ (ИмяРаздела = "Форма300_02Страница1")
	ИЛИ (ИмяРаздела = "Форма300_03Страница1")
	ИЛИ (ИмяРаздела = "Форма300_04Страница1")
	ИЛИ (ИмяРаздела = "Форма300_05Страница1")
	ИЛИ (ИмяРаздела = "Форма300_06Страница1")
	ИЛИ (ИмяРаздела = "Форма300_07Страница1")
	ИЛИ (ИмяРаздела = "Форма300_08Страница1");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МногострочныйРаздел(ИмяРаздела)
	
	Результат = (ИмяРаздела = "Форма300_03Страница1")
			ИЛИ (ИмяРаздела = "Форма300_03Страница2")
            ИЛИ (ИмяРаздела = "Форма300_05Страница1")
            ИЛИ (ИмяРаздела = "Форма300_05Страница2")
			ИЛИ (ИмяРаздела = "Форма300_05Страница3")
			ИЛИ (ИмяРаздела = "Форма300_07Страница1")
			ИЛИ (ИмяРаздела = "Форма300_07Страница2")
			ИЛИ (ИмяРаздела = "Форма300_07Страница3")
			ИЛИ (ИмяРаздела = "Форма300_08Страница1")
			ИЛИ (ИмяРаздела = "Форма300_08Страница2")
			ИЛИ (ИмяРаздела = "Форма300_08Страница3");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьКоличествоПодразделовПоРодителю(Родитель)
	
	Если Родитель = "Форма300Страница1" Тогда
		Возврат 3;
	ИначеЕсли Родитель = "Форма300_01Страница1" Тогда
		Возврат 1;
	ИначеЕсли Родитель = "Форма300_02Страница1" Тогда
		Возврат 1;
	ИначеЕсли Родитель = "Форма300_03Страница1" Тогда
		Возврат 2;
	ИначеЕсли Родитель = "Форма300_04Страница1" Тогда
		Возврат 1;
	ИначеЕсли Родитель = "Форма300_05Страница1" Тогда
		Возврат 3;
	ИначеЕсли Родитель = "Форма300_06Страница1" Тогда
		Возврат 1;
	ИначеЕсли Родитель = "Форма300_07Страница1" Тогда
		Возврат 3;
	ИначеЕсли Родитель = "Форма300_08Страница1" Тогда
		Возврат 3;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьМетодОтнесенияНДСВЗачет()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Не УчетнаяПолитикаОрганизацийСрезПоследних.УчетнаяПолитика.ПрименяетсяУчетНДСПоФактическомуИспользованию ЕСТЬ NULL 
	|				И УчетнаяПолитикаОрганизацийСрезПоследних.УчетнаяПолитика.ПрименяетсяУчетНДСПоФактическомуИспользованию = ИСТИНА
	|			ТОГДА ""Пропорциональный""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ИспользоватьРаздельныйУчетПоНалогообложению.Значение
	|					ТОГДА ""Раздельный""
	|				ИНАЧЕ ""Пропорциональный""
	|			КОНЕЦ
	|	КОНЕЦ КАК МетодОтнесенияНДСВЗачет
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&Дата, Организация = &Организация) КАК УчетнаяПолитикаОрганизацийСрезПоследних,
	|	Константа.ИспользоватьРаздельныйУчетПоНалогообложению КАК ИспользоватьРаздельныйУчетПоНалогообложению";
	
	Запрос.УстановитьПараметр("Организация", СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("Дата", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.МетодОтнесенияНДСВЗачет;
	
КонецФункции

&НаСервере
Процедура СформироватьОтчетныйПериод()
	
	СтрПериодОтчета = ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета,СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ФП = истина");
	
	СтруктураРеквизитовФормы.мКвартал = Лев(СтрПериодОтчета,1);
	СтруктураРеквизитовФормы.мГод = Лев(Прав(СтрПериодОтчета,7),4);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета()
	
	СтруктураЗависимыхЯчеекДляАвторасчета = Новый Структура;
	//300.00Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("ВидДекларации", "Первоначальная;Очередная;Дополнительная;ПоУведомлению;Ликвидационная");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("КатегорияНалПл", "Условие_A;Условие_B;Условие_С1;Условие_С2");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("НаличиеПриложений", "Приложение01;Приложение02;Приложение03;Приложение04;Приложение05;Приложение06;Приложение07;Приложение08");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("СпособВыписки", "ВыпискаНаБумажномНосителе;ВыпискаВЭлектронномВиде");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("СпособПолучения", "ПолучениеНаБумажномНосителе;ПолучениеВЭлектронномВиде");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010001001", "П000010001001;П000010001101;П000010001201;П000010007002");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010001002", "П000010001002;П000010001102;П000010001202");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010002001", "П000110004001;П000610005001;П000010007002");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010003001", "П000610004001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010003002", "П000610004002");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010005001", "П000210009001;П000610006001;П000610006101;П000610006201");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010006001", "П000010001001;П000010002001;П000010003001;П000010004001;П000010005001;П000010007002");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010007002", "П000010001001;П000010002001;П000010003001;П000010004001;П000010005001;П000010006001");
	//300.00Стр2
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020008002", "П000010002001;П000010001001;П000010002001;П000010003001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020011002", "П000410001002");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020012002", "П000010001002;П000010003002;П000020010002;П000020011002");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020013001", "П000020013001;П000020013101;П000020013201");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020013002", "П000020013002;П000020013102;П000020013202");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020014001", "П000510001001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020014002", "П000510007001;П000010007002;Пропорциональный;Раздельный;ПропорцИРаздел");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020016001", "П000010016101;П000010016201");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020016002", "П000010016102;П000010016202");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020017001", "П000210014001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020018002", "П000310000104;П000310000203");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020019002", "П000320000102;П000320000203");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020021001", "П000020013001;П000020013101;П000020013201;П000020014001;П000020015001;П000020016101;П000020016201;П000020017001;П000020018002;П000020020001;П000030029001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020022002", "П000610010002");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020023002", "П000020013002;П000020013102;П000020013202;П000020014002;П000020016102;П000020016202;П000020019002;П000020020002;П000020022002");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020024002", "П000020024002;П000020024102;П000020024202;П000020024302");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020025202", "П000020023002;П000020025202;П000020022002;Раздельный");  //зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020025102", "П000020023002;П000010007002;П000020025102;Пропорциональный");  //зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020025302", "П000020024102;П000020009002;П000020024302;П000010007002;П000020024202;П000020025302;ПропорцИРаздел");  //зависимость самой от себя
	//300.00Стр3
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030025402", "П000020012002;П000020023002;П000030027102;П000020025102;П000030029002;Пропорциональный;П000020025202;Раздельный;П000020025302;ПропорцИРаздел");  //зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030028002", "П000110008001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030029001", "П000410001001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030029002", "П000410001002");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030030102", "П000020012002;П000020023002;П000020025202;П000030029002;Раздельный;П000020025102;Пропорциональный;П000020025302;ПропорцИРаздел;П000030030102");  //зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030030202", "П000030029002;П000020023002;П000020012002;Раздельный;П000020025202;Пропорциональный;П000020025102;ПропорцИРаздел;П000030030202");  //зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030026102", "П000020023002;П000020025102;Пропорциональный");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030026202", "Раздельный");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030026302", "П000020024002;П000020025302;ПропорцИРаздел");
	
	//300.01Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000110001001", "П000110001101;П000110001201;П000110001301;П000110001401;П000110001501;П000110001001");  //сложная зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000110003001", "П000110003101;П000110003201;П000110003001;П000110003301;П000110003401;П000110003501");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000110004001", "П000110001001;П000110001101;П000110001201;П000110001301;П000110001401;П000110001501;П000110002001;П000110003001;П000110003101;П000110003201;П000110003301;П000110003401;П000110003501");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000110008001", "П000110005001;П000110006001;П000110007001");
	
	//300.02Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000210001001", "П000210001001;П000210001101;П000210001201;П000210001301;П000210001401;П000210001501");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000210009001", "П000210001001;П000210001101;П000210001201;П000210002001;П000210003001;П000210004001;П000210005001;П000210006001;П000210007001;П000210008001;П000210009001");  //зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000210010001", "П000210010101;П000210010201;П000210010301;П000210010401;П000210010501;П000210010001");  //сложная зависимость самой от себя
	//300.02Стр2
	//СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000210014001", "П000210010001;П000210010101;П000210010201;П000210010301;П000210010401;П000210010501;П000210011001;П000210012001;П000210013001;П000210014001");  //зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000210014001", "П000210010001;П000210011001;П000210012001;П000210013001;П000210014001");  //зависимость самой от себя
	//300.03Стр2
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000320000104", "П000310000104;П000320000102;П000320000103");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000320000204", "П000310000203;П000320000202;П000320000203");
	//300.04Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000410001001", "П000410001101;П000410001201;П000410001301;П000410001401;П000410001501;П000410001601;П000410001701;П000410001801;П000410001901;П000410001001;П0004100011001");  //сложная зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000410001002", "П000410001102;П000410001202;П000410001302;П000410001402;П000410001502;П000410001602;П000410001702;П000410001802;П000410001902;П000410001002;П0004100011002");  //сложная зависимость самой от себя
	//300.05Стр1
    СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000530000205", "П000520000205;П000530000204");
    СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020014001", "П000520000103");
    СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020014002", "П000530000105;П000530000104;П000520000105");
	//300.06Стр1                                           
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000610001001", "П000610001001;П000610001101;П000610001201;П000610001301;П000610001401;П000610001501");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000610001002", "П000610001002;П000610001102;П000610001202;П000610001302;П000610001402;П000610001502");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000610004001", "П000610001001;П000610001101;П000610001201;П000610001301;П000610001401;П000610001501;П000610002001;П000610003001;П000610004001");  //зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000610004002", "П000610001002;П000610001102;П000610001202;П000610001302;П000610001402;П000610001502;П000610002002;П000610003002;П000610004002");  //зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000610006001", "П000610006001;П000610006101;П000610006201;П000610006301;П000610006401;П000610006501");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000610007002", "П000610007002;П000610007102;П000610007202;П000610007302;П000610007402;П000610007502");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000610010002", "П000610007002;П000610007102;П000610007202;П000610008002;П000610009002;П000610004002;П000610010002");  //зависимость самой от себя
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруЯчеекСРасшифровкой()
	
	СтруктураЯчеекСРасшифровкой = Новый Структура;
	//300.07 Стр2
	СтруктураЯчеекСРасшифровкой.Вставить("П0007100001","П000710000104");
	//300.08 Стр2
	СтруктураЯчеекСРасшифровкой.Вставить("П0008100001","П000810000104");
	
КонецПроцедуры

&НаСервере
Процедура Инициализация(БезОткрытияФормы = Ложь) Экспорт
	
	ФормироватьСтруктуруСтраницОтчета();
	ФормироватьСтруктуруСвойствСтраниц();
	СформироватьДеревоРазделовОтчетаНаСервере();
	ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета();
	
	ЗаполнитьСтруктуруЯчеекСРасшифровкой();
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
	Если СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		ЗаполнитьПустыеСтруктурыДанных();
		ЗаполнитьСведенияОбОрганизацииНаСервере();
		НачальныеОперацииСМногострочнымиБлоками();
		СтруктураРеквизитовФормы.ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
		СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 0;
		КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
		РасчетНаСервере("Форма300Страница1","Очередная");
		Модифицированность = Истина;
	Иначе
		ВосстановитьСохраненныеДанные();
		ВывестиМакетВТаблДокНаСервере("Форма300Страница1");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизацииНаСервере()
	
	ЗаполнитьСведенияОбОрганизации(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизации(Форма)
	
	СтрокаСведений = "ИННЮЛ, НаимЮЛПол, ФИОРук, СерияСвидетельстваПоНДС, НомерСвидетельстваПоНДС";
	
	СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(СтруктураРеквизитовФормы.Организация,,СтрокаСведений);
	
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ИИН_БИН"].Значение) Тогда
		ТабличныйДокумент.Области["ИИН_БИН"].Значение = СведенияОбОрганизации.ИННЮЛ;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Квартал"].Значение) Тогда
		ТабличныйДокумент.Области["Квартал"].Значение = СтруктураРеквизитовФормы.мКвартал;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Год"].Значение) Тогда
		ТабличныйДокумент.Области["Год"].Значение = СтруктураРеквизитовФормы.мГод;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ОргНазв") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ОргНазв"].Значение) Тогда
		ТабличныйДокумент.Области["ОргНазв"].Значение = СведенияОбОрганизации.НаимЮЛПол;
		Если ТабличныйДокумент.Области.Найти("ОргНазв3") <> Неопределено Тогда
			КонецШага = 3;
		Иначе
			КонецШага = 2;
		КонецЕсли;
		НачПозиция = 1;
		Для Шаг = 1 По КонецШага Цикл
			ДлинаСтроки = ТабличныйДокумент.Области["ОргНазв" + Шаг].ТипЗначения.КвалификаторыСтроки.Длина;
			НазОрганизации = Сред(СведенияОбОрганизации.НаимЮЛПол, НачПозиция, ДлинаСтроки); 
			ТабличныйДокумент.Области["ОргНазв" + Шаг].Значение = НазОрганизации;
			НачПозиция =НачПозиция + ДлинаСтроки;
		КонецЦикла;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("Руководитель") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Руководитель"].Значение) Тогда
		ТабличныйДокумент.Области["Руководитель"].Значение = СведенияОбОрганизации.ФИОРук;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти(СтруктураРеквизитовФормы.мМетодРасчета) <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области[СтруктураРеквизитовФормы.мМетодРасчета].Значение) Тогда
		
		ТабличныйДокумент.Области.Раздельный.Значение = "";
		ТабличныйДокумент.Области.Пропорциональный.Значение = "";
		ТабличныйДокумент.Области.ПропорцИРаздел.Значение = "";
		
		ТабличныйДокумент.Области[СтруктураРеквизитовФормы.мМетодРасчета].Значение = "Х";
		
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("СерияСвидетельства") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["СерияСвидетельства"].Значение) Тогда
		ТабличныйДокумент.Области["СерияСвидетельства"].Значение = СведенияОбОрганизации.СерияСвидетельстваПоНДС;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("НомерСвидетельства") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["НомерСвидетельства"].Значение)Тогда
		ТабличныйДокумент.Области["НомерСвидетельства"].Значение = СведенияОбОрганизации.НомерСвидетельстваПоНДС;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("КодНалоговогоОргана") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["КодНалоговогоОргана"].Значение) Тогда
		КодНалоговогоОргана = ?(СтруктураРеквизитовФормы.НалоговыйКомитет = Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка(),"",СтруктураРеквизитовФормы.НалоговыйКомитет.Код);
		ТабличныйДокумент.Области["КодНалоговогоОргана"].Значение = КодНалоговогоОргана;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ПоУведомлению") <> Неопределено Тогда
		
		Если ТабличныйДокумент.Области["ПоУведомлению"].Значение = "Х" Тогда
			ТабличныйДокумент.Области.НомерУведомления.Защита = Ложь;
			ТабличныйДокумент.Области.ДатаУведомления.Защита = Ложь;
		ИначеЕсли ТабличныйДокумент.Области["Очередная"].Значение = "" И
			ТабличныйДокумент.Области["Дополнительная"].Значение = "" И 
			ТабличныйДокумент.Области["Ликвидационная"].Значение = "" И
			ТабличныйДокумент.Области["Первоначальная"].Значение = "" Тогда
			
			ТабличныйДокумент.Области["Очередная"].Значение = "Х";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьСохраненныеДанные()
	
	Перем ДанныеМногострочныхРазделов;
	Перем ПоказателиОтчета;
	Перем НалоговыйКомитет;
	
	// восстанавливаем сохраненные данные отчета
	СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	
	// восстановим сохраненные данные редактируемых ячеек
	СписокСохранения.Свойство("ПоказателиОтчета", ПоказателиОтчета);
	СписокСохранения.Свойство("НалоговыйКомитет", НалоговыйКомитет);
	
	Если СписокСохранения.Свойство( "ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов) Тогда
		
		Для Каждого ЭлементСтруктуры Из ДанныеМногострочныхРазделов Цикл
			
			НайденноеЗначение = Неопределено;
			мСтруктураМногострочныхРазделов.Свойство(ЭлементСтруктуры.Ключ, НайденноеЗначение);
			
			Если НЕ НайденноеЗначение = Неопределено Тогда
				ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, ЭтаФорма[НайденноеЗначение]);
				Если ТипЗнч(ЭтаФорма[НайденноеЗначение]) = Тип("ДанныеФормыКоллекция") Тогда
					Если ЭтаФорма[НайденноеЗначение].Количество() = 0 Тогда
						ЭтаФорма[НайденноеЗначение].Добавить();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы] = ПоказателиОтчета[Префикс + Раздел.ИмяСтраницы];
	КонецЦикла;
	
	Комментарий = СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий;
	СтруктураРеквизитовФормы.НалоговыйКомитет = НалоговыйКомитет;
	СтруктураРеквизитовФормы.ЕдиницаИзмерения = СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения;
	
	РегламентированнаяОтчетность.ОперацииПриВосстановленииРегламентированногоОтчета(ЭтаФорма);
	КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
	
КонецПроцедуры

&НаСервере
Процедура НачальныеОперацииСМногострочнымиБлоками()
	Перем ИсходноеКоличествоСтрокГруппы;
	
	// создаем исходную структуру многострочных разделов
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		ИмяГруппы = ЭлементСтруктуры.Ключ;
		СтруктураГруппы = ЭтаФорма[ЭлементСтруктуры.Значение];
		
		мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
		
		Если ИсходноеКоличествоСтрокГруппы > СтруктураГруппы.Количество() Тогда 
			Для НСтр = 1 По ИсходноеКоличествоСтрокГруппы Цикл
				СтруктураГруппы.Добавить();
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазделыОтчетаПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ОчиститьТекущуюСтраницу.Видимость = НЕ Элемент.ТекущиеДанные.РазделМногострочный;
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, 1);
	
	ЗаполнитьСведенияОбОрганизацииНаСервере();
	
	Элементы.ВыгрузитьВExcel.Видимость = (СтрНайти(СтруктураРеквизитовФормы.НаимТекущегоРаздела, "Форма300_07") > 0 
		ИЛИ СтрНайти(СтруктураРеквизитовФормы.НаимТекущегоРаздела, "Форма300_08")) > 0;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетСтраницыВТабличныйДокументНаСервере(ИмяТекРаздела)
	
	ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела);
	СтруктураРеквизитовФормы.НаимТекущегоРаздела  = ИмяТекРаздела;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела)
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(
	ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяТекРаздела));
	
	//многострочные разделы
	Если ИмяТекРаздела = "Форма300_03Страница1"
		ИЛИ ИмяТекРаздела = "Форма300_03Страница2"
        ИЛИ ИмяТекРаздела = "Форма300_05Страница1"
        ИЛИ ИмяТекРаздела = "Форма300_05Страница2"
		ИЛИ ИмяТекРаздела = "Форма300_05Страница3"
		ИЛИ ИмяТекРаздела = "Форма300_07Страница1"
		ИЛИ ИмяТекРаздела = "Форма300_07Страница2"
		ИЛИ ИмяТекРаздела = "Форма300_07Страница3"
		ИЛИ ИмяТекРаздела = "Форма300_08Страница1"
		ИЛИ ИмяТекРаздела = "Форма300_08Страница2"
		ИЛИ ИмяТекРаздела = "Форма300_08Страница3" Тогда
		
		СтруктураДанныхРаздела = ЭтаФорма["СтруктураДанных" + ИмяТекРаздела];
		
		Для Каждого ЭлСтруктуры Из СтруктураДанныхРаздела Цикл
			Попытка
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
		ТекТабличноеПоле = ЭтаФорма.ТабличныйДокумент;
		
		ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяТекРаздела);
		
		СтруктураГруппы = Неопределено;
		
		мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
		
		СтруктураГруппы = ЭтаФорма[СтруктураГруппы];
		
		ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
		
		ЕстьДопСтроки = Ложь;
		
		Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
			Если СтрЧислоВхождений(ОбластьТД.Имя, "_2") > 0 Тогда
				ЕстьДопСтроки = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьДопСтроки Тогда
			Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
				Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
					ОбластьТД.Гиперссылка = Истина;
					ОбластьТД.Текст = "х";
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
				Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
					ОбластьТД.Гиперссылка = Ложь;
					ОбластьТД.Текст = "";
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//обычные разделы
	ИначеЕсли ЭтаФорма["СтруктураДанных" + ИмяТекРаздела]<> Неопределено Тогда
		
		Для Каждого ЭлСтруктуры Из ЭтаФорма["СтруктураДанных" + ИмяТекРаздела] Цикл
			Попытка
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиРазделВТабличныйДокумент(Форма, ИмяГруппы, СтруктураГруппы)
	Перем ИсходноеКоличествоСтрокГруппы;
	
	#Если НаКлиенте Тогда
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИмяГруппы);
	#Иначе
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИмяГруппы);
	#КонецЕсли
	
	// определим исходное колво строк многострочного раздела,
	// соответствующее бумажной форме отчета
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
	
	// реальное кол-во строк (колво заполненных строк)
	ТекущееКоличествоСтрокГруппы = СтруктураГруппы.Количество();
	
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	ПерерисоватьСтроки = (НЕ ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы);
	
	Раздел = Форма[ТекТабличноеПолеИмя];
	
	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// При восстановлении сохраненных данных отчета сравниваем исходное кол-во
	// отображаемых в форме строк многострочного раздела с реальным количеством
	// созданных строк в сохраненном отчете.
	Если ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы Тогда
		
		// При превышении реального кол-ва строк над исходным кол-вом (по шаблону),
		// автоматически добавляем необходимое колво строк.
		Форма.ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки);
		
		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
	КонецЕсли;
	
	// выводим значения строк
	Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
		НомерСтрокиВТаблице      = СтруктураГруппы.Индекс(СтрокаТаблицы);
		НомерСтрокиВФормеТаблицыСтр = Формат(НомерСтрокиВТаблице + 1, "ЧГ=");
		
		Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
			
			КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
			
			Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
				
				ЗначениеЯчейки = СтрокаТаблицы[КолонкаТаблицыИмя];
				ИмяЯчейки      = КолонкаТаблицыИмя + "_" + НомерСтрокиВФормеТаблицыСтр;
				
				ОбластьЯчейкиТаблицы = ТекТабличноеПоле.Области[ИмяЯчейки];
				
				Если ОбластьЯчейкиТаблицы.СодержитЗначение = Истина Тогда
					ОбластьЯчейкиТаблицы.Значение = ЗначениеЯчейки;
				Иначе
					ОбластьЯчейкиТаблицы.Текст = ЗначениеЯчейки;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки) Экспорт
	
	ОбластьДопСтроки = ТекТабличноеПоле.ПолучитьОбласть("МногострочнаяЧасть");
	
	КоординатыОбластей = Новый Структура();
	
	Для Каждого Область Из ТекТабличноеПоле.Области Цикл
		
		Если СтрНайти(Область.Имя, "_") Тогда
			
			КоординатыОбластей.Вставить(Область.Имя, Область.Верх);
			
		КонецЕсли;
		
	КонецЦикла;
	
	МногострочнаяЧастьВерх = ТекТабличноеПоле.Области.МногострочнаяЧасть.Верх;
	
	МногострочнаяЧастьНиз = ТекТабличноеПоле.Области.МногострочнаяЧасть.Низ;
	
	ТекТабличноеПоле.ВставитьОбласть(ОбластьДопСтроки.Область(), ТекТабличноеПоле.Область(МногострочнаяЧастьНиз + 1, , МногострочнаяЧастьНиз + (ТекущееКоличествоСтрокГруппы - 1) * ВысотаСтроки), ТипСмещенияТабличногоДокумента.ПоВертикали);
	
	Для НомНовойСтроки = ИсходноеКоличествоСтрокГруппы По ТекущееКоличествоСтрокГруппы Цикл
		
		Постфикс = Формат(ТекущееКоличествоСтрокГруппы - НомНовойСтроки + 1, "ЧГ=");
		
		Для Каждого Область Из ОбластьДопСтроки.Области Цикл
			
			Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
				
				ОбластьТаблДок = ТекТабличноеПоле.Область(КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Лево, КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Право);
				
				Если ОбластьТаблДок.СодержитЗначение Тогда
					ОбластьТаблДок.Очистить();
				КонецЕсли;
				
				ОбластьТаблДок.Имя = Лев(Область.Имя, СтрНайти(Область.Имя, "_")) + Постфикс;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;	
	
	ТекТабличноеПоле.Область(ТекТабличноеПоле.Области.МногострочнаяЧасть.Верх, , ТекТабличноеПоле.Области.МногострочнаяЧасть.Низ).Имя = "";
	
	ТекТабличноеПоле.Область(МногострочнаяЧастьВерх, , МногострочнаяЧастьНиз).Имя = "МногострочнаяЧасть";
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеРаздела(НаимРаздела)
	
	// Многострочные разделы.
	Если НаимРаздела = "Форма300_03Страница1"
		ИЛИ НаимРаздела = "Форма300_03Страница2"
        ИЛИ НаимРаздела = "Форма300_05Страница1"
        ИЛИ НаимРаздела = "Форма300_05Страница2"
		ИЛИ НаимРаздела = "Форма300_05Страница3"
		ИЛИ НаимРаздела = "Форма300_07Страница1"
		ИЛИ НаимРаздела = "Форма300_07Страница2"
		ИЛИ НаимРаздела = "Форма300_07Страница3"
		ИЛИ НаимРаздела = "Форма300_08Страница1"
		ИЛИ НаимРаздела = "Форма300_08Страница2"
		ИЛИ НаимРаздела = "Форма300_08Страница3" Тогда
		
		ЭтаФорма["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");
		
		ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(НаимРаздела);
		
		ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппы);
		
		// Обычные разделы.
	Иначе
		
		ЭтаФорма["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СобратьДанныеТекущегоТаблПоля(Форма, ТабличноеПоле) Экспорт
	
	СтруктураДанныхПоля = Новый Структура;
	Для Каждого ТекущаяОбласть Из Форма[ТабличноеПоле].Области Цикл
		Если СтрЧислоВхождений(Тип(ТекущаяОбласть), "Рисунок") = 0 И ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник И ТекущаяОбласть.СодержитЗначение = Истина Тогда
			СтруктураДанныхПоля.Вставить(ТекущаяОбласть.Имя, ТекущаяОбласть.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураДанныхПоля;
	
КонецФункции

&НаСервере
Процедура ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппы) Экспорт
	
	Перем СтруктураГруппы;
	
	РегламентированнаяОтчетностьКлиентСервер.ОбновитьСтруктуруМногострочногоРаздела(ЭтаФорма, ИмяГруппы);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область)
	Модифицированность = Истина;
	
	ИмяРаздела = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
	
	//СохранитьДанныеРаздела(ИмяРаздела);
	
	РасчетНаКлиенте(ИмяРаздела,Область.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетНаКлиенте(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт
	
	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);
	
КонецПроцедуры

&НаСервере
Процедура РасчетНаСервере(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт
	
	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура Расчет(Форма, ИмяСтраницыПанели = "", ОбластьИмя = "")
	
	Если Форма.СтруктураРеквизитовФормы.мРежимПечати Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСтраницыПанели = "Форма300Страница1" Тогда
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.ВидДекларации, ОбластьИмя) > 0 Тогда
			
			Первоначальная = "";
			Очередная =      "";
			Дополнительная = "";
			ПоУведомлению =  "";
			Ликвидационная = "";
			
			
			Если ОбластьИмя = "Первоначальная" Тогда
				Первоначальная = "Х";
			ИначеЕсли ОбластьИмя = "Очередная" Тогда
				Очередная = "Х";
			ИначеЕсли ОбластьИмя = "Дополнительная" Тогда
				Дополнительная = "Х";
			ИначеЕсли ОбластьИмя = "ПоУведомлению" Тогда
				ПоУведомлению = "Х";
			ИначеЕсли ОбластьИмя = "Ликвидационная" Тогда
				Ликвидационная = "Х";
			Иначе
				Очередная = "Х";
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма300Страница1.Вставить("Первоначальная", Первоначальная);
			Форма.СтруктураДанныхФорма300Страница1.Вставить("Очередная",           Очередная);
			Форма.СтруктураДанныхФорма300Страница1.Вставить("Дополнительная", Дополнительная);
			Форма.СтруктураДанныхФорма300Страница1.Вставить("ПоУведомлению",   ПоУведомлению);
			Форма.СтруктураДанныхФорма300Страница1.Вставить("Ликвидационная", Ликвидационная);
			Если Не ПоУведомлению = "Х" Тогда
				Форма.СтруктураДанныхФорма300Страница1.Вставить("НомерУведомления", "");
				Форма.СтруктураДанныхФорма300Страница1.Вставить("ДатаУведомления", "");
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				Форма.ТабличныйДокумент.Области.Первоначальная.Значение = Первоначальная;
				Форма.ТабличныйДокумент.Области.Очередная.Значение = Очередная;
				Форма.ТабличныйДокумент.Области.Дополнительная.Значение = Дополнительная;
				Форма.ТабличныйДокумент.Области.ПоУведомлению.Значение = ПоУведомлению;
				Форма.ТабличныйДокумент.Области.Ликвидационная.Значение = Ликвидационная;
				Если ПоУведомлению = "Х" Тогда
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Ложь;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Ложь;
				Иначе
					Форма.ТабличныйДокумент.Области.НомерУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Истина;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.КатегорияНалПл, ОбластьИмя) > 0 Тогда
			
			Условие_A = "";
			Условие_B = "";
			Условие_С1 = "";
			Условие_С2 = "";
			
			Если ОбластьИмя = "Условие_A" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Условие_A = Форма.ТабличныйДокумент.Области.Условие_A.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("Условие_A") Тогда
					Условие_A = Форма.СтруктураДанныхФорма300Страница1.Условие_A;
				КонецЕсли;
				
				Условие_A = ?(Условие_A = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("Условие_A", Условие_A);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Условие_A.Значение = Условие_A;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Условие_B" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Условие_B = Форма.ТабличныйДокумент.Области.Условие_B.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("Условие_B") Тогда
					Условие_B = Форма.СтруктураДанныхФорма300Страница1.Условие_B;
				КонецЕсли;
				
				Условие_B = ?(Условие_B = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("Условие_B", Условие_B);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Условие_B.Значение = Условие_B;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Условие_С1" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Условие_С1 = Форма.ТабличныйДокумент.Области.Условие_С1.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("Условие_С1") Тогда
					Условие_С1 = Форма.СтруктураДанныхФорма300Страница1.Условие_С1;
				КонецЕсли;
				
				Условие_С1 = ?(Условие_С1 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("Условие_С1", Условие_С1);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Условие_С1.Значение = Условие_С1;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Условие_С2" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Условие_С2 = Форма.ТабличныйДокумент.Области.Условие_С2.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("Условие_С2") Тогда
					Условие_С2 = Форма.СтруктураДанныхФорма300Страница1.Условие_С2;
				КонецЕсли;
				
				Условие_С2 = ?(Условие_С2 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("Условие_С2", Условие_С2);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Условие_С2.Значение = Условие_С2;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.СпособВыписки, ОбластьИмя) > 0 Тогда
			
			ВыпискаНаБумажномНосителе = "";
			ВыпискаВЭлектронномВиде = "";
			
			Если ОбластьИмя = "ВыпискаНаБумажномНосителе" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					ВыпискаНаБумажномНосителе = Форма.ТабличныйДокумент.Области.ВыпискаНаБумажномНосителе.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("ВыпискаНаБумажномНосителе") Тогда
					ВыпискаНаБумажномНосителе = Форма.СтруктураДанныхФорма300Страница1.ВыпискаНаБумажномНосителе;
				КонецЕсли;
				
				ВыпискаНаБумажномНосителе = ?(ВыпискаНаБумажномНосителе = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("ВыпискаНаБумажномНосителе", ВыпискаНаБумажномНосителе);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.ВыпискаНаБумажномНосителе.Значение = ВыпискаНаБумажномНосителе;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "ВыпискаВЭлектронномВиде" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					ВыпискаВЭлектронномВиде = Форма.ТабличныйДокумент.Области.ВыпискаВЭлектронномВиде.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("ВыпискаВЭлектронномВиде") Тогда
					ВыпискаВЭлектронномВиде = Форма.СтруктураДанныхФорма300Страница1.ВыпискаВЭлектронномВиде;
				КонецЕсли;
				
				ВыпискаВЭлектронномВиде = ?(ВыпискаВЭлектронномВиде = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("ВыпискаВЭлектронномВиде", ВыпискаВЭлектронномВиде);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.ВыпискаВЭлектронномВиде.Значение = ВыпискаВЭлектронномВиде;
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЕсли;
			
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.СпособПолучения, ОбластьИмя) > 0 Тогда
			
			ПолучениеНаБумажномНосителе = "";
			ПолучениеВЭлектронномВиде = "";
			
			Если ОбластьИмя = "ПолучениеНаБумажномНосителе" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					ПолучениеНаБумажномНосителе = Форма.ТабличныйДокумент.Области.ПолучениеНаБумажномНосителе.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("ПолучениеНаБумажномНосителе") Тогда
					ПолучениеНаБумажномНосителе = Форма.СтруктураДанныхФорма300Страница1.ПолучениеНаБумажномНосителе;
				КонецЕсли;
				
				ПолучениеНаБумажномНосителе = ?(ПолучениеНаБумажномНосителе = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("ПолучениеНаБумажномНосителе", ПолучениеНаБумажномНосителе);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.ПолучениеНаБумажномНосителе.Значение = ПолучениеНаБумажномНосителе;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "ПолучениеВЭлектронномВиде" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					ПолучениеВЭлектронномВиде = Форма.ТабличныйДокумент.Области.ПолучениеВЭлектронномВиде.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("ПолучениеВЭлектронномВиде") Тогда
					ПолучениеВЭлектронномВиде = Форма.СтруктураДанныхФорма300Страница1.ПолучениеВЭлектронномВиде;
				КонецЕсли;
				
				ПолучениеВЭлектронномВиде = ?(ПолучениеВЭлектронномВиде = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("ПолучениеВЭлектронномВиде", ПолучениеВЭлектронномВиде);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.ПолучениеВЭлектронномВиде.Значение = ПолучениеВЭлектронномВиде;
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЕсли;
			
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.НаличиеПриложений, ОбластьИмя) > 0 Тогда
			
			Приложение01 = "";
			Приложение02 = "";
			Приложение03 = "";
			Приложение04 = "";
			Приложение05 = "";
			Приложение06 = "";
			Приложение07 = "";
			Приложение08 = "";
			
			Если ОбластьИмя = "Приложение01" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Приложение01 = Форма.ТабличныйДокумент.Области.Приложение01.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("Приложение01") Тогда
					Приложение01 = Форма.СтруктураДанныхФорма300Страница1.Приложение01;
				КонецЕсли;
				
				Приложение01 = ?(Приложение01 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение01", Приложение01);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение01.Значение = Приложение01;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение02" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Приложение02 = Форма.ТабличныйДокумент.Области.Приложение02.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("Приложение02") Тогда
					Приложение02 = Форма.СтруктураДанныхФорма300Страница1.Приложение02;
				КонецЕсли;
				
				Приложение02 = ?(Приложение02 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение02", Приложение02);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение02.Значение = Приложение02;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение03" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Приложение03 = Форма.ТабличныйДокумент.Области.Приложение03.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("Приложение03") Тогда
					Приложение03 = Форма.СтруктураДанныхФорма300Страница1.Приложение03;
				КонецЕсли;
				
				Приложение03 = ?(Приложение03 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение03", Приложение03);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение03.Значение = Приложение03;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение04" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Приложение04 = Форма.ТабличныйДокумент.Области.Приложение04.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("Приложение04") Тогда
					Приложение04 = Форма.СтруктураДанныхФорма300Страница1.Приложение04;
				КонецЕсли;
				
				Приложение04 = ?(Приложение04 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение04", Приложение04);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение04.Значение = Приложение04;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение05" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Приложение05 = Форма.ТабличныйДокумент.Области.Приложение05.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("Приложение05") Тогда
					Приложение05 = Форма.СтруктураДанныхФорма300Страница1.Приложение05;
				КонецЕсли;
				
				Приложение05 = ?(Приложение05 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение05", Приложение05);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение05.Значение = Приложение05;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение06" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Приложение06 = Форма.ТабличныйДокумент.Области.Приложение06.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("Приложение06") Тогда
					Приложение06 = Форма.СтруктураДанныхФорма300Страница1.Приложение06;
				КонецЕсли;
				
				Приложение06 = ?(Приложение06 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение06", Приложение06);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение06.Значение = Приложение06;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение07" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Приложение07 = Форма.ТабличныйДокумент.Области.Приложение07.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("Приложение07") Тогда
					Приложение07 = Форма.СтруктураДанныхФорма300Страница1.Приложение07;
				КонецЕсли;
				
				Приложение07 = ?(Приложение07 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение07", Приложение07);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение07.Значение = Приложение07;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение08" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Приложение08 = Форма.ТабличныйДокумент.Области.Приложение08.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("Приложение08") Тогда
					Приложение08 = Форма.СтруктураДанныхФорма300Страница1.Приложение08;
				КонецЕсли;
				
				Приложение08 = ?(Приложение08 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение08", Приложение08);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение08.Значение = Приложение08;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//300.00.001 А
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010001001, ОбластьИмя) > 0 Тогда
			
			ОкрП000010001001 = 0;
			ОкрП000010001101 = 0;
			ОкрП000010001201 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010001001") Тогда
				ОкрП000010001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010001001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010001101") Тогда
				ОкрП000010001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010001101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010001201") Тогда
				ОкрП000010001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010001201);
			КонецЕсли;
			
			П000010001001 = ОкрП000010001101 + ОкрП000010001201;
			
			Форма.СтруктураДанныхФорма300Страница1.Вставить("П000010001001", П000010001001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010001001.Значение = П000010001001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница1", "П000010002001");  //перерасчет 1й стр. форма 300.00
			
			Расчет(Форма, "Форма300Страница2", "П000010002001");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;

		//300.00.001 B
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010001002, ОбластьИмя) > 0 Тогда
			
			ОкрП000010001002 = 0;
			ОкрП000010001102 = 0;
			ОкрП000010001202 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010001002") Тогда
				ОкрП000010001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010001002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010001102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001102.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010001102") Тогда
				ОкрП000010001102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010001102);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010001202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001202.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010001202") Тогда
				ОкрП000010001202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010001202);
			КонецЕсли;
			
			П000010001002 = ОкрП000010001102 + ОкрП000010001202;
			
			Форма.СтруктураДанныхФорма300Страница1.Вставить("П000010001002", П000010001002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010001002.Значение = П000010001002;
			КонецЕсли;

			Расчет(Форма, "Форма300Страница2", "П000010001002");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;

		//300.00.002
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010002001, ОбластьИмя) > 0 Тогда
			
			ОкрП000110004001 = 0;
			ОкрП000610005001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110004001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110004001") Тогда
				ОкрП000110004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110004001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610005001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610005001") Тогда
				ОкрП000610005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610005001);
			КонецЕсли;
			
			П000010002001 = ОкрП000110004001 + ОкрП000610005001;
			
			Форма.СтруктураДанныхФорма300Страница1.Вставить("П000010002001", П000010002001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010002001.Значение = П000010002001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница1", "П000010002001");  //перерасчет 1й стр. форма 300.00
			
			Расчет(Форма, "Форма300Страница2", "П000010002001");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.003A
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010003001, ОбластьИмя) > 0 Тогда
			
			ОкрП000610004001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610004001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610004001") Тогда
				ОкрП000610004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610004001);
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма300Страница1.Вставить("П000010003001", ОкрП000610004001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010003001.Значение = ОкрП000610004001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница1", "П000010003001");  //перерасчет 1й стр. форма 300.00
			
			Расчет(Форма, "Форма300Страница2", "П000010003001");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.003B
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010003002, ОбластьИмя) > 0 Тогда
			
			ОкрП000610004002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610004002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610004002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610004002") Тогда
				ОкрП000610004002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610004002);
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма300Страница1.Вставить("П000010003002", ОкрП000610004002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010003002.Значение = ОкрП000610004002;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000010003002");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.005
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010005001, ОбластьИмя) > 0 Тогда
			
			ОкрП000210009001 = 0;
			ОкрП000610006001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210009001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210009001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210009001") Тогда
				ОкрП000210009001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210009001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610006001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610006001") Тогда
				ОкрП000610006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610006001);
			КонецЕсли;
			
			П000010005001 = ОкрП000210009001 + ОкрП000610006001;
			
			Форма.СтруктураДанныхФорма300Страница1.Вставить("П000010005001", П000010005001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010005001.Значение = П000010005001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница1", "П000010005001");  //перерасчет 1й стр. форма 300.00
			
		КонецЕсли;
		
		// 300.00.006А
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010006001, ОбластьИмя) > 0 Тогда
			
			ОкрП000010001001 = 0;
			ОкрП000010002001 = 0;
			ОкрП000010003001 = 0;
			ОкрП000010004001 = 0;
			ОкрП000010005001 = 0;
			
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010001001") Тогда
				ОкрП000010001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010001001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010002001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010002001") Тогда
				ОкрП000010002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010002001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010003001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010003001") Тогда
				ОкрП000010003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010003001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010004001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010004001") Тогда
				ОкрП000010004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010004001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010005001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010005001") Тогда
				ОкрП000010005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010005001);
			КонецЕсли;
			
			П000010006001 =  ОкрП000010001001 + ОкрП000010002001 + ОкрП000010003001 + ОкрП000010004001 + ОкрП000010005001;
			
			Форма.СтруктураДанныхФорма300Страница1.Вставить("П000010006001", П000010006001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010006001.Значение = П000010006001;
			КонецЕсли;
			
			П000010006101 =  ОкрП000010001001 + ОкрП000010002001 + ОкрП000010003001;
			
			Форма.СтруктураДанныхФорма300Страница1.Вставить("П000010006101", П000010006101);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010006101.Значение = П000010006101;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000010006001");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.007
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010007002, ОбластьИмя) > 0 Тогда
			
			ОкрП000010001001 = 0;
			ОкрП000010002001 = 0;
			ОкрП000010003001 = 0;
			ОкрП000010006001 = 0;  //деление на 0
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010001001") Тогда
				ОкрП000010001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010001001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010002001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010002001") Тогда
				ОкрП000010002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010002001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010003001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010003001") Тогда
				ОкрП000010003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010003001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010006001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010006001") Тогда
				ОкрП000010006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010006001);
			КонецЕсли;
			
			П000010007002 = (ОкрП000010001001 + ОкрП000010002001 + ОкрП000010003001) / ?(ОкрП000010006001 = 0,1,ОкрП000010006001) * 100;
			
			Форма.СтруктураДанныхФорма300Страница1.Вставить("П000010007002", Окр(П000010007002,2));
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010007002.Значение = Окр(П000010007002,2);
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000010007002");  //перерасчет 2й стр. форма 300.00
			
			Расчет(Форма, "Форма300Страница3", "П000010007002");  //перерасчет 3й стр. форма 300.00
			
		КонецЕсли;
		
		Если    "П000010001001" = ОбластьИмя 
			ИЛИ "П000010001002" = ОбластьИмя 
			ИЛИ "П000010002001" = ОбластьИмя 
			ИЛИ "П000010003002" = ОбластьИмя
			ИЛИ "П000010003001" = ОбластьИмя 
			ИЛИ "П000010006001" = ОбластьИмя Тогда
			
			Расчет(Форма, "Форма300Страница2", ОбластьИмя);
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300Страница2" Тогда
		
		//300.00.008
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020008002, ОбластьИмя) > 0 Тогда
			
			ОкрП000010001001 = 0;
			ОкрП000010002001 = 0;
			ОкрП000010003001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010001001") Тогда
				ОкрП000010001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010001001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010002001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010002001") Тогда
				ОкрП000010002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010002001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010003001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010003001") Тогда
				ОкрП000010003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010003001);
			КонецЕсли;
			
			СуммаДляП000020008002 = ОкрП000010001001 + ОкрП000010002001 + ОкрП000010003001;
			П000020008002 = ОкрП000010002001 / ?(СуммаДляП000020008002 = 0,1,СуммаДляП000020008002) * 100;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020008002", Окр(П000020008002,2));
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020008002.Значение = Окр(П000020008002,2);
			КонецЕсли;
			
		КонецЕсли;
		
		//300.00.011
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020011002, ОбластьИмя) > 0 Тогда
			
			ОкрП000410001002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001002") Тогда
				ОкрП000410001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001002);
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020011002", ОкрП000410001002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020011002.Значение = ОкрП000410001002;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000020011002");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.012
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020012002, ОбластьИмя) > 0 Тогда
			
			ОкрП000010001002 = 0;
			ОкрП000010003002 = 0;
			ОкрП000020010002 = 0;
			ОкрП000020011002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010001002") Тогда
				ОкрП000010001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010001002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
				ОкрП000010003002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010003002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010003002") Тогда
				ОкрП000010003002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010003002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020010002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020010002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020010002") Тогда
				ОкрП000020010002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020010002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020011002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020011002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020011002") Тогда
				ОкрП000020011002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020011002);
			КонецЕсли;
			
			П000020012002 = ОкрП000010001002 + ОкрП000010003002 + ОкрП000020010002 + ОкрП000020011002;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020012002", П000020012002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020012002.Значение = П000020012002;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница3", "П000020012002");  //перерасчет 3й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.013 A
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020013001, ОбластьИмя) > 0 Тогда
			
			ОкрП000020013001 = 0;
			ОкрП000020013101 = 0;
			ОкрП000020013201 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020013001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020013001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020013001") Тогда
				ОкрП000020013001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020013001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020013101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020013101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020013101") Тогда
				ОкрП000020013101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020013101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020013201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020013201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020013201") Тогда
				ОкрП000020013201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020013201);
			КонецЕсли;
			
			П000020013001 = ОкрП000020013101 + ОкрП000020013201;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020013001", П000020013001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020013001.Значение = П000020013001;
			КонецЕсли;
			
		КонецЕсли;
		
		//300.00.013 B
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020013002, ОбластьИмя) > 0 Тогда
			
			ОкрП000020013002 = 0;
			ОкрП000020013102 = 0;
			ОкрП000020013202 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020013002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020013002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020013002") Тогда
				ОкрП000020013002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020013002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020013102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020013102.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020013102") Тогда
				ОкрП000020013102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020013102);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020013202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020013202.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020013202") Тогда
				ОкрП000020013202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020013202);
			КонецЕсли;
			
			П000020013002 = ОкрП000020013102 + ОкрП000020013202;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020013002", П000020013002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020013002.Значение = П000020013002;
			КонецЕсли;
			
		КонецЕсли;
		
		//300.00.014A
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020014001, ОбластьИмя) > 0 Тогда
			
			ОкрП000520000103 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_05Страница2" Тогда
				ОкрП000520000103 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000520000103.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_05Страница2.Свойство("П000520000103") Тогда
				ОкрП000520000103 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_05Страница2.П000520000103);
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020014001", ОкрП000520000103);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020014001.Значение = ОкрП000520000103;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000020014001");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.014B
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020014002, ОбластьИмя) > 0 Тогда
			
			ОкрП000530000105 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.мМетодРасчета = "Пропорциональный" ИЛИ Форма.СтруктураРеквизитовФормы.мМетодРасчета = "ПропорцИРаздел" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_05Страница3" Тогда
					ОкрП000530000105 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000530000105.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300_05Страница3.Свойство("П000530000105") Тогда
					ОкрП000530000105 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_05Страница3.П000530000105);
				КонецЕсли;
				
				Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020014002", ОкрП000530000105);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					Форма.ТабличныйДокумент.Области.П000020014002.Значение = ОкрП000530000105;
				КонецЕсли;
				
			Иначе
				
				ОкрП000530000105 = 0;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_05Страница3" Тогда
					ОкрП000530000105 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000530000105.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300_05Страница3.Свойство("П000530000105") Тогда
					ОкрП000530000105 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_05Страница3.П000530000105);
				КонецЕсли;
				
				П000020014002 = ОкрП000530000105;
				
				Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020014002", П000020014002);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					Форма.ТабличныйДокумент.Области.П000020014002.Значение = П000020014002;
				КонецЕсли;
				
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000020014002");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.017
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020017001, ОбластьИмя) > 0 Тогда
			
			ОкрП000210014001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210014001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210014001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210014001") Тогда
				ОкрП000210014001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210014001);
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020017001", ОкрП000210014001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020017001.Значение = ОкрП000210014001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000020017001");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.018
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020018002, ОбластьИмя) > 0 Тогда
			
			ОкрП000310000104= 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница1" Тогда
				ОкрП000310000104 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000310000104.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница1.Свойство("П000310000104") Тогда
				ОкрП000310000104 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница1.П000320000102);
			КонецЕсли;
			
			П000020018002 = ОкрП000310000104;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020018002", П000020018002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020018002.Значение = П000020018002;
			КонецЕсли;
			
		КонецЕсли;
		
		//300.00.019
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020019002, ОбластьИмя) > 0 Тогда
			
			ОкрП000320000102 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				ОкрП000320000102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320000102.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница2.Свойство("П000320000102") Тогда
				ОкрП000320000102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница2.П000320000102);
			КонецЕсли;
			
			П000020019002 = ОкрП000320000102;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020019002", П000020019002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020019002.Значение = П000020019002;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000020019002");  //перерасчет 2й стр. форма 300.00
			Расчет(Форма, "Форма300Страница3", "П000030025402");  //перерасчет 3й стр. форма 300.00
			Расчет(Форма, "Форма300Страница3", "П000030030102");  //перерасчет 3й стр. форма 300.00
			Расчет(Форма, "Форма300Страница3", "П000030030202");  //перерасчет 3й стр. форма 300.00
			
		КонецЕсли;
		
		
		
		//300.00.021
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020021001, ОбластьИмя) > 0 Тогда
			
			ОкрП000020013001 = 0;
			ОкрП000020014001 = 0;
			ОкрП000020015001 = 0;
			ОкрП000020016001 = 0;
			ОкрП000020017001 = 0;
			ОкрП000020020001 = 0;
			ОкрП000030029001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020013001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020013001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020013001") Тогда
				ОкрП000020013001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020013001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020014001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020014001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020014001") Тогда
				ОкрП000020014001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020014001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020015001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020015001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020015001") Тогда
				ОкрП000020015001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020015001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020016001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020016101.Значение)
				 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020016201.Значение);
			 ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020016101")
				 	И Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020016201") Тогда
				ОкрП000020016001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020016101)
				+ РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020016201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020017001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020017001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020017001") Тогда
				ОкрП000020017001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020017001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020020001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020020001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020020001") Тогда
				ОкрП000020020001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020020001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				ОкрП000030029001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030029001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030029001") Тогда
				ОкрП000030029001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030029001);
			КонецЕсли;
			
			П000020021001 =  ОкрП000020013001 + ОкрП000020014001 + ОкрП000020015001 + ОкрП000020016001 + ОкрП000020017001 + ОкрП000020020001 + ОкрП000030029001;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020021001", П000020021001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020021001.Значение = П000020021001;
			КонецЕсли;
			
		КонецЕсли;
		
		//300.00.022
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020022002, ОбластьИмя) > 0 Тогда
			
			ОкрП000610010002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610010002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610010002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610010002") Тогда
				ОкрП000610010002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610010002);
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020022002", ОкрП000610010002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020022002.Значение = ОкрП000610010002;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000020022002");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.023
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020023002, ОбластьИмя) > 0 Тогда
			
			ОкрП000020013002 = 0;
			ОкрП000020014002 = 0;
			ОкрП000020016002 = 0;
			ОкрП000020019002 = 0;
			ОкрП000020020002 = 0;
			ОкрП000020022002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020013002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020013002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020013002") Тогда
				ОкрП000020013002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020013002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020014002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020014002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020014002") Тогда
				ОкрП000020014002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020014002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020016002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020016102.Значение)
				+ РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020016202.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020016102") И Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020016202") Тогда
				ОкрП000020016002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020016102)
				+ РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020016202);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020019002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020019002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020019002") Тогда
				ОкрП000020019002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020019002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020020002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020020002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020020002") Тогда
				ОкрП000020020002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020020002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020022002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020022002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020022002") Тогда
				ОкрП000020022002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020022002);
			КонецЕсли;
			
			П000020023002 = ОкрП000020013002 + ОкрП000020014002 + ОкрП000020016002 + ОкрП000020019002 + ОкрП000020020002 + ОкрП000020022002;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020023002", П000020023002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020023002.Значение = П000020023002;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000020023002");  //перерасчет 3й стр. форма 300.00
			Расчет(Форма, "Форма300Страница3", "П000020023002");  //перерасчет 3й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.024
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020024002, ОбластьИмя) > 0 Тогда
			
			ОкрП000020024102 = 0;
			ОкрП000020024202 = 0;
			ОкрП000020024302 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020024102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020024102.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020024102") Тогда
				ОкрП000020024102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020024102);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020024202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020024202.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020024202") Тогда
				ОкрП000020024202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020024202);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020024302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020024302.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020024302") Тогда
				ОкрП000020024302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020024302);
			КонецЕсли;
			
			П000020024002 = ОкрП000020024102 + ОкрП000020024202 + ОкрП000020024302;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020024002", П000020024002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020024002.Значение = П000020024002;
			КонецЕсли;
			
		КонецЕсли;
		
		//300.00.025 I
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020025102, ОбластьИмя) > 0 Тогда
			
			ОкрП000020023002 = 0;
			ОкрП000010007002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.мМетодРасчета = "Пропорциональный" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020023002 = РегламентированнаяОтчетностьКлиентСерверРК.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020023002.Значение,2);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020023002") Тогда
					ОкрП000020023002 = РегламентированнаяОтчетностьКлиентСерверРК.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020023002,2);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					ОкрП000010007002 = РегламентированнаяОтчетностьКлиентСерверРК.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010007002.Значение,2);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010007002") Тогда
					ОкрП000010007002 = РегламентированнаяОтчетностьКлиентСерверРК.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010007002,2);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					ОкрП000010006001 = РегламентированнаяОтчетностьКлиентСерверРК.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010006001.Значение,2);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010006001") Тогда
					ОкрП000010006001 = РегламентированнаяОтчетностьКлиентСерверРК.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010006001,2);
				КонецЕсли;
				
			КонецЕсли;
			
			Если ОкрП000010006001 <> 0 И ОкрП000010007002 = 0 Тогда
				П000020025102 = 0;
			ИначеЕсли ОкрП000010007002 = 0 Тогда
				П000020025102 = ОкрП000020023002;
			Иначе
				П000020025102 = ОкрП000020023002 * ОкрП000010007002 / 100;
			КонецЕсли;
			
			П000020025102 = РегламентированнаяОтчетностьКлиентСерверРК.ОкруглитьЧислоПоФормату(Форма, П000020025102);
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020025102", П000020025102);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020025102.Значение = П000020025102;
			КонецЕсли;
			
		КонецЕсли;
		
		//300.00.025 II
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020025202, ОбластьИмя) > 0 Тогда
			
			ОкрП000020023002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.мМетодРасчета = "Раздельный" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020023002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020023002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020023002") Тогда
					ОкрП000020023002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020023002);
				КонецЕсли;
				
			КонецЕсли;
			
			П000020025202 = ОкрП000020023002;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020025202", П000020025202);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020025202.Значение = П000020025202;
			КонецЕсли;
			
		КонецЕсли;
		
		//300.00.025 III
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020025302, ОбластьИмя) > 0 Тогда
			
			ОкрП000020024102 = 0;
			ОкрП000020009002 = 0;
			ОкрП000020024302 = 0;
			ОкрП000010007002 = 0;
			ОкрП000020024202 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.мМетодРасчета = "ПропорцИРаздел" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020024102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020024102.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020024102") Тогда
					ОкрП000020024102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020024102);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020009002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020009002") Тогда
					ОкрП000020009002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020009002);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020024302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020024302.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020024302") Тогда
					ОкрП000020024302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020024302);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
					ОкрП000010007002 = РегламентированнаяОтчетностьКлиентСерверРК.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010007002.Значение,2);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница1.Свойство("П000010007002") Тогда
					ОкрП000010007002 = РегламентированнаяОтчетностьКлиентСерверРК.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница1.П000010007002,2);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020024202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020024202.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020024202") Тогда
					ОкрП000020024202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020024202);
				КонецЕсли;
				
			КонецЕсли;
			
			П000020025302 = (ОкрП000020024102 * ОкрП000020009002)+(ОкрП000020024302 * ОкрП000010007002) + ОкрП000020024202;
			
			Форма.СтруктураДанныхФорма300Страница2.Вставить("П000020025302", П000020025302);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020025302.Значение = П000020025302;
			КонецЕсли;
			
		КонецЕсли;

		Если "П000020012002" = ОбластьИмя  
			ИЛИ "П000020023002" = ОбластьИмя 
			ИЛИ "П000020025102" = ОбластьИмя 
			ИЛИ "П000020025202" = ОбластьИмя 
			ИЛИ "П000020025302" = ОбластьИмя Тогда
			
			Расчет(Форма, "Форма300Страница3", ОбластьИмя); //перерасчет 3й стр. форма 300.00
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300Страница3" Тогда
		
		//300.00.025 IV

		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030025402, ОбластьИмя) > 0
			И (Форма.СтруктураДанныхФорма300Страница1.Условие_С1 = "Х"
			ИЛИ Форма.СтруктураДанныхФорма300Страница1.Условие_С2 = "Х") Тогда
			
			ОкрП000020012002 = 0;
			ОкрП000020025102 = 0;
			ОкрП000020025202 = 0;
			ОкрП000020025302 = 0;
			ОкрП000030027102 = 0;
			ОкрП000030029002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
				ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020012002") Тогда
				ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020012002);
			КонецЕсли;
				
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				ОкрП000030027102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030027102.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000020027102") Тогда
				ОкрП000030027102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030027102);
			КонецЕсли;
				
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				ОкрП000030029002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030029002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030029002") Тогда
				ОкрП000030029002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030029002);
			КонецЕсли;
				
			Если Форма.СтруктураРеквизитовФормы.мМетодРасчета = "Пропорциональный" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020025102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020025102.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020025102") Тогда
					ОкрП000020025102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020025102);
				КонецЕсли;
				
				П000030025402 = (ОкрП000020012002 - ОкрП000020025102 - ОкрП000030027102 - ОкрП000030029002) * 0.7;
			
			ИначеЕсли Форма.СтруктураРеквизитовФормы.мМетодРасчета = "Раздельный" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020025202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020025202.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020025202") Тогда
					ОкрП000020025202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020025202);
				КонецЕсли;
				
				П000030025402 = (ОкрП000020012002 - ОкрП000020025202 - ОкрП000030027102 - ОкрП000030029002) * 0.7;
			
			ИначеЕсли Форма.СтруктураРеквизитовФормы.мМетодРасчета = "ПропорцИРаздел" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020025302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020025302.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020025302") Тогда
					ОкрП000020025302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020025302);
				КонецЕсли;
				
				П000030025402 = (ОкрП000020012002 - ОкрП000020025302 - ОкрП000030027102 - ОкрП000030029002) * 0.7;
			
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма300Страница3.Вставить("П000030025402", П000030025402);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030025402.Значение = П000030025402;
			КонецЕсли;
			
		КонецЕсли;

		//300.00.026 I
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030026102, ОбластьИмя) > 0 Тогда
			
			Если Форма.СтруктураРеквизитовФормы.мМетодРасчета = "Пропорциональный" Тогда
				
				ОкрП000020023002 = 0;
				ОкрП000020025102 = 0;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020023002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020023002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020023002") Тогда
					ОкрП000020023002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020023002);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020025102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020025102.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020025102") Тогда
					ОкрП000020025102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020025102);
				КонецЕсли;
				
				П000030026102 = ОкрП000020023002 - ОкрП000020025102;
				
				Форма.СтруктураДанныхФорма300Страница3.Вставить("П000030026102", П000030026102);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					Форма.ТабличныйДокумент.Области.П000030026102.Значение = П000030026102;
				КонецЕсли;
			
			КонецЕсли;
			
		КонецЕсли;

		//300.00.026 III
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030026302, ОбластьИмя) > 0 Тогда
			
			Если Форма.СтруктураРеквизитовФормы.мМетодРасчета = "ПропорцИРаздел" Тогда
				
				ОкрП000020024002 = 0;
				ОкрП000020025303 = 0;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020024002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020024002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020024002") Тогда
					ОкрП000020024002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020024002);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020025303 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020025303.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020025303") Тогда
					ОкрП000020025303 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020025303);
				КонецЕсли;
				
				П000030026302 = ОкрП000020024002 - ОкрП000020025303;
				
				Форма.СтруктураДанныхФорма300Страница3.Вставить("П000030026302", П000030026302);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					Форма.ТабличныйДокумент.Области.П000030026302.Значение = П000030026302;
				КонецЕсли;
			
			КонецЕсли;
			
		КонецЕсли;
			
		//300.00.028 
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030028002, ОбластьИмя) > 0 Тогда
			
			ОкрП000110008001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110008001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110008001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110008001") Тогда
				ОкрП000110008001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110008001);
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма300Страница3.Вставить("П000030028002", ОкрП000110008001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030028002.Значение = ОкрП000110008001;
			КонецЕсли;
			
		КонецЕсли;
		
			
		//300.00.029A 
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030029001, ОбластьИмя) > 0 Тогда
			
			ОкрП000410001001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001001") Тогда
				ОкрП000410001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001001);
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма300Страница3.Вставить("П000030029001", ОкрП000410001001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030029001.Значение = ОкрП000410001001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница3", "П000030029001");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.029B
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030029002, ОбластьИмя) > 0 Тогда
			
			ОкрП000410001002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001002") Тогда
				ОкрП000410001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001002);
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма300Страница3.Вставить("П000030029002", ОкрП000410001002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030029002.Значение = ОкрП000410001002;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница3", "П000030029002");  //перерасчет 3й стр. форма 300.00
			
		КонецЕсли;
		
		//300.00.030 I
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030030102, ОбластьИмя) > 0 Тогда
			
			Если Форма.СтруктураРеквизитовФормы.мМетодРасчета = "Раздельный" Тогда
				
				ОкрП000020012002 = 0;
				ОкрП000020025202 = 0;
				ОкрП000030029002 = 0;
				ОкрП000030025402 = 0;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020012002") Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020012002);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020025202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020025202.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020025202") Тогда
					ОкрП000020025202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020025202);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030025402 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030025402.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030025402") Тогда
					ОкрП000030025402 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030025402);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030029002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030029002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030029002") Тогда
					ОкрП000030029002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030029002);
				КонецЕсли;
				
				П000030030102 = ОкрП000020012002 - ОкрП000020025202 - ОкрП000030029002 - ОкрП000030025402;
				
			ИначеЕсли Форма.СтруктураРеквизитовФормы.мМетодРасчета = "Пропорциональный" Тогда
				
				ОкрП000020012002 = 0;
				ОкрП000020025102 = 0;
				ОкрП000030029002 = 0;
				ОкрП000030025402 = 0;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020012002") Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020012002);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020025102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020025102.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020025102") Тогда
					ОкрП000020025102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020025102);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030025402 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030025402.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030025402") Тогда
					ОкрП000030025402 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030025402);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030029002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030029002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030029002") Тогда
					ОкрП000030029002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030029002);
				КонецЕсли;
				
				П000030030102 = ОкрП000020012002 - ОкрП000020025102 - ОкрП000030029002 - ОкрП000030025402;
				
			ИначеЕсли Форма.СтруктураРеквизитовФормы.мМетодРасчета = "ПропорцИРаздел" Тогда
				
				ОкрП000020012002 = 0;
				ОкрП000020025302 = 0;
				ОкрП000030029002 = 0;
				ОкрП000030025402 = 0;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020012002") Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020012002);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020025302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020025302.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020025302") Тогда
					ОкрП000020025302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020025302);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030025402 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030025402.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030025402") Тогда
					ОкрП000030025402 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030025402);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030029002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030029002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030029002") Тогда
					ОкрП000030029002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030029002);
				КонецЕсли;
				
				П000030030102 = ОкрП000020012002 - ОкрП000020025302 - ОкрП000030029002 - ОкрП000030025402;
				
			КонецЕсли;
			
			П000030030102 = ?(П000030030102 < 0, 0, П000030030102);
			
			Форма.СтруктураДанныхФорма300Страница3.Вставить("П000030030102", П000030030102);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030030102.Значение = П000030030102;
			КонецЕсли;
			
		КонецЕсли;
		
		//300.00.030 II
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030030202, ОбластьИмя) > 0 Тогда
			
			Если Форма.СтруктураРеквизитовФормы.мМетодРасчета = "Раздельный" Тогда
				
				ОкрП000020012002 = 0;
				ОкрП000020025202 = 0;
				ОкрП000030029002 = 0;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020012002") Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020012002);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020025202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020025202.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020025202") Тогда
					ОкрП000020025202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020025202);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030029002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030029002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030029002") Тогда
					ОкрП000030029002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030029002);
				КонецЕсли;
				
				П000030030202 =  ОкрП000020025202 + ОкрП000030029002 - ОкрП000020012002;
				
			ИначеЕсли Форма.СтруктураРеквизитовФормы.мМетодРасчета = "Пропорциональный" Тогда
				
				ОкрП000020012002 = 0;
				ОкрП000020025102 = 0;
				ОкрП000030029002 = 0;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020012002") Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020012002);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020025102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020025102.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020025102") Тогда
					ОкрП000020025102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020025102);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030029002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030029002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030029002") Тогда
					ОкрП000030029002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030029002);
				КонецЕсли;
				
				П000030030202 =  ОкрП000020025102 + ОкрП000030029002 - ОкрП000020012002;
				
			ИначеЕсли Форма.СтруктураРеквизитовФормы.мМетодРасчета = "ПропорцИРаздел" Тогда
				
				ОкрП000020012002 = 0;
				ОкрП000020025302 = 0;
				ОкрП000030029002 = 0;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020012002") Тогда
					ОкрП000020012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020012002);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница2" Тогда
					ОкрП000020025302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020025302.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница2.Свойство("П000020025302") Тогда
					ОкрП000020025302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница2.П000020025302);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
					ОкрП000030029002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030029002.Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма300Страница3.Свойство("П000030029002") Тогда
					ОкрП000030029002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300Страница3.П000030029002);
				КонецЕсли;
				
				П000030030202 =  ОкрП000020025302 + ОкрП000030029002 - ОкрП000020012002;
				
			КонецЕсли;
			
			П000030030202 = ?(П000030030202 < 0, 0, П000030030202);
			
			Форма.СтруктураДанныхФорма300Страница3.Вставить("П000030030202", П000030030202);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030030202.Значение = П000030030202;
			КонецЕсли
			
			
		КонецЕсли;
		
		Если ОбластьИмя = "ОтказОтВозврата" Тогда
			
			ОтказОтВозврата = Форма.ТабличныйДокумент.Области.ОтказОтВозврата.Значение;
			
			Если ОтказОтВозврата = "" Тогда 
				ОтказОтВозврата = "Х";
			Иначе 
				ОтказОтВозврата = "";
			КонецЕсли;
			
			Форма.ТабличныйДокумент.Области.ОтказОтВозврата.Значение = ОтказОтВозврата;
			Форма.СтруктураДанныхФорма300Страница3.Вставить("ОтказОтВозврата", ОтказОтВозврата);
			
		КонецЕсли;
		
		Если ОбластьИмя = "ИспользованиеКонтрольногоСчета" Тогда
			
			ИспользованиеКонтрольногоСчета = Форма.ТабличныйДокумент.Области.ИспользованиеКонтрольногоСчета.Значение;
			
			Если ИспользованиеКонтрольногоСчета = "" Тогда 
				ИспользованиеКонтрольногоСчета = "Х";
			Иначе 
				ИспользованиеКонтрольногоСчета = "";
			КонецЕсли;
			
			Форма.ТабличныйДокумент.Области.ИспользованиеКонтрольногоСчета.Значение = ИспользованиеКонтрольногоСчета;
			Форма.СтруктураДанныхФорма300Страница3.Вставить("ИспользованиеКонтрольногоСчета", ИспользованиеКонтрольногоСчета);
			
		КонецЕсли;
		
		Если "П000030029001" = ОбластьИмя Тогда
			
			Расчет(Форма, "Форма300Страница2", ОбластьИмя);
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_01Страница1" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение01", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение01.Значение = "Х";
		КонецЕсли;
		
		//300.01.001
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000110001001, ОбластьИмя) > 0 Тогда
			
			ОкрП000110001101 = 0;
			ОкрП000110001201 = 0;
			ОкрП000110001301 = 0;
			ОкрП000110001401 = 0;
			ОкрП000110001501 = 0;
			ОкрП000110001001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110001101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110001101") Тогда
				ОкрП000110001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110001101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110001201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110001201") Тогда
				ОкрП000110001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110001201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110001301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110001301") Тогда
				ОкрП000110001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110001301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110001401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110001401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110001401") Тогда
				ОкрП000110001401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110001401);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110001501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110001501.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110001501") Тогда
				ОкрП000110001501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110001501);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110001001") Тогда
				ОкрП000110001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110001001);
			КонецЕсли;
			
			П000110001001 = ОкрП000110001101 + ОкрП000110001201 + ОкрП000110001301 + ОкрП000110001401 + ОкрП000110001501;
			
			Форма.СтруктураДанныхФорма300_01Страница1.Вставить("П000110001001", П000110001001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000110001001.Значение = П000110001001;
			КонецЕсли;
			
		КонецЕсли;
		
		//300.01.003
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000110003001, ОбластьИмя) > 0 Тогда

			ОкрП000110003101 = 0;
			ОкрП000110003201 = 0;
			ОкрП000110003301 = 0;
			ОкрП000110003401 = 0;
			ОкрП000110003501 = 0;
			ОкрП000110003001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110003001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110003001") Тогда
				ОкрП000110003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110003001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110003101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110003101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110003101") Тогда
				ОкрП000110003101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110003101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110003201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110003201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110003201") Тогда
				ОкрП000110003201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110003201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110003301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110003301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110003301") Тогда
				ОкрП000110003301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110003301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110003401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110003401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110003401") Тогда
				ОкрП000110003401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110003401);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110003501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110003501.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110003501") Тогда
				ОкрП000110003501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110003501);
			КонецЕсли;
			
			П000110003001 = ОкрП000110003101 + ОкрП000110003201 + ОкрП000110003301 + ОкрП000110003401 + ОкрП000110003501;
			
			Форма.СтруктураДанныхФорма300_01Страница1.Вставить("П000110003001", П000110003001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000110003001.Значение = П000110003001;
			КонецЕсли;
			
		КонецЕсли;

		//300.01.004
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000110004001, ОбластьИмя) > 0 Тогда
			
			ОкрП000110001001 = 0;
			ОкрП000110002001 = 0;
			ОкрП000110003001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110001001") Тогда
				ОкрП000110001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110001001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110002001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110002001") Тогда
				ОкрП000110002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110002001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110003001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110003001") Тогда
				ОкрП000110003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110003001);
			КонецЕсли;
			
			П000110004001 = ОкрП000110001001 + ОкрП000110002001 + ОкрП000110003001;
			
			Форма.СтруктураДанныхФорма300_01Страница1.Вставить("П000110004001", П000110004001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000110004001.Значение = П000110004001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница1", "П000110004001");  //перерасчет 1й стр. форма 300.00
			
		КонецЕсли;
		
		//300.01.008
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000110008001, ОбластьИмя) > 0 Тогда
			
			ОкрП000110005001 = 0;
			ОкрП000110006001 = 0;
			ОкрП000110007001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110005001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110005001") Тогда
				ОкрП000110005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110005001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110006001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110006001") Тогда
				ОкрП000110006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110006001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				ОкрП000110007001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110007001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_01Страница1.Свойство("П000110007001") Тогда
				ОкрП000110007001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_01Страница1.П000110007001);
			КонецЕсли;
			
			П000110008001 = ОкрП000110005001 + ОкрП000110006001 + ОкрП000110007001;
			
			Форма.СтруктураДанныхФорма300_01Страница1.Вставить("П000110008001", П000110008001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_01Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000110008001.Значение = П000110008001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница3", "П000110008001");  //перерасчет 3й стр. форма 300.00
			
		КонецЕсли;

		Если "П000610005001" = ОбластьИмя Тогда
			
			Расчет(Форма, "Форма300Страница1", ОбластьИмя);
			
		ИначеЕсли "П000110008001" = ОбластьИмя Тогда
			
			Расчет(Форма, "Форма300Страница3", ОбластьИмя);
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_02Страница1" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение02", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение02.Значение = "Х";
		КонецЕсли;
		
		//300.02.001
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210001001, ОбластьИмя) > 0 Тогда

			ОкрП000210001001 = 0;
			ОкрП000210001101 = 0;
			ОкрП000210001201 = 0;
			
			ОкрП000210001301 = 0;
			ОкрП000210001401 = 0;
			ОкрП000210001501 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210001001") Тогда
				ОкрП000210001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210001001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210001101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210001101") Тогда
				ОкрП000210001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210001101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210001201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210001201") Тогда
				ОкрП000210001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210001201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210001301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210001301") Тогда
				ОкрП000210001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210001301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210001401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210001401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210001401") Тогда
				ОкрП000210001401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210001401);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210001501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210001501.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210001501") Тогда
				ОкрП000210001501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210001501);
			КонецЕсли;
			
			
			П000210001001 = ОкрП000210001101 + ОкрП000210001201 + ОкрП000210001301 + ОкрП000210001401 + ОкрП000210001501;
			
			Форма.СтруктураДанныхФорма300_02Страница1.Вставить("П000210001001", П000210001001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000210001001.Значение = П000210001001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300_02Страница1", "П000210009001");  //перерасчет 3й стр. форма 300.00
			
		КонецЕсли;
		
		//300.02.009
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210009001, ОбластьИмя) > 0 Тогда
			
			ОкрП000210001001 = 0;
			ОкрП000210002001 = 0;
			ОкрП000210003001 = 0;
			ОкрП000210004001 = 0;
			ОкрП000210005001 = 0;
			ОкрП000210006001 = 0;
			ОкрП000210007001 = 0;
			ОкрП000210008001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210001001") Тогда
				ОкрП000210001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210001001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210002001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210002001") Тогда
				ОкрП000210002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210002001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210003001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210003001") Тогда
				ОкрП000210003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210003001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210004001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210004001") Тогда
				ОкрП000210004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210004001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210005001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210005001") Тогда
				ОкрП000210005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210005001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210006001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210006001") Тогда
				ОкрП000210006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210006001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210007001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210007001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210007001") Тогда
				ОкрП000210007001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210007001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210008001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210008001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210008001") Тогда
				ОкрП000210008001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210008001);
			КонецЕсли;
			
			П000210009001 = ОкрП000210001001 + ОкрП000210002001 + ОкрП000210003001 + ОкрП000210004001 + ОкрП000210005001 + ОкрП000210006001 + ОкрП000210007001 + ОкрП000210008001;
			
			Форма.СтруктураДанныхФорма300_02Страница1.Вставить("П000210009001", П000210009001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000210009001.Значение = П000210009001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница1", "П000210009001");  //перерасчет 1й стр. форма 300.00
			
		КонецЕсли;
		
		//300.02.010
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210010001, ОбластьИмя) > 0 Тогда
			
			ОкрП000210010001 = 0;
			ОкрП000210010101 = 0;
			ОкрП000210010201 = 0;
			ОкрП000210010301 = 0;
			ОкрП000210010401 = 0;
			ОкрП000210010501 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210010001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210010001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210010001") Тогда
				ОкрП000210010001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210010001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210010101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210010101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210010101") Тогда
				ОкрП000210010101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210010101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210010201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210010201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210010201") Тогда
				ОкрП000210010201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210010201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210010301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210010301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210010301") Тогда
				ОкрП000210010301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210010301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210010401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210010401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210010401") Тогда
				ОкрП000210010401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210010401);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210010501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210010501.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210010401") Тогда
				ОкрП000210010501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210010501);
			КонецЕсли;
			
			П000210010001 = ОкрП000210010101 + ОкрП000210010201 + ОкрП000210010301 + ОкрП000210010401 + ОкрП000210010501;
			
			Форма.СтруктураДанныхФорма300_02Страница1.Вставить("П000210010001", П000210010001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000210010001.Значение = П000210010001;
			КонецЕсли;	
			
			Расчет(Форма, "Форма300_02Страница1", "П000210014001");  //перерасчет 3й стр. форма 300.00

		КонецЕсли;
		
		//300.02.014
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210014001, ОбластьИмя) > 0 Тогда
			
			ОкрП000210010001 = 0;
			ОкрП000210011001 = 0;
			ОкрП000210012001 = 0;
			ОкрП000210013001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210010001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210010001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210010001") Тогда
				ОкрП000210010001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210010001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210011001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210011001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210011001") Тогда
				ОкрП000210011001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210011001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210012001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210012001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210012001") Тогда
				ОкрП000210012001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210012001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				ОкрП000210013001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210013001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_02Страница1.Свойство("П000210013001") Тогда
				ОкрП000210013001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_02Страница1.П000210013001);
			КонецЕсли;
			
			П000210014001 = ОкрП000210010001 + ОкрП000210011001 + ОкрП000210012001 + ОкрП000210013001;
			
			Форма.СтруктураДанныхФорма300_02Страница1.Вставить("П000210014001", П000210014001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_02Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000210014001.Значение = П000210014001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000210014001");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_03Страница1" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение03", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение03.Значение = "Х";
		КонецЕсли;
		
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
			
			СуммаП000310000104 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы31]].Количество() Цикл
				
				СуммаП000310000104 = СуммаП000310000104 + Форма.ТабличныйДокумент.Области["П000310000203_" + Ном].Значение;

			КонецЦикла;
			
			Форма.ТабличныйДокумент.Области.П000310000104.Значение = СуммаП000310000104;
			
		Иначе
			
			СуммаП000310000104 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы31]].Количество() Цикл
				
				СуммаП000320000104 = СуммаП000310000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы31]][Ном - 1].П000310000203);

			КонецЦикла;
			
			Форма.СтруктураДанныхФорма300_03Страница1.Вставить("П000310000104", СуммаП000310000104);
			
		КонецЕсли;
		
		Если    "П000310000104" = ОбластьИмя 
			ИЛИ "П000310000204" = ОбластьИмя 
			ИЛИ "П000310000203" = Лев(ОбластьИмя,13) Тогда
			
			Расчет(Форма, "Форма300_03Страница2", ОбластьИмя);  //перерасчет 2й стр. форма 300.03
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_03Страница2" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение03", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение03.Значение = "Х";
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000320000204, Лев(ОбластьИмя,13)) > 0 Тогда
			
			Префикс = Сред(ОбластьИмя,Найти(ОбластьИмя,"_"),СтрДлина(ОбластьИмя) - (Найти(ОбластьИмя,"_")-1));
			Индекс = Число(Прав(Префикс,СтрДлина(Префикс)-1)) - 1;
			
			ОкрП000310000203 = 0;
			ОкрП000320000202 = 0;
			ОкрП000320000203 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница1" Тогда
				ОкрП000310000203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000310000203"+Префикс].Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница1.Свойство("П000310000203" + Префикс) Тогда
				ОкрП000310000203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница1["П000310000203"+Префикс]);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				ОкрП000320000202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000320000202"+Префикс].Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница2.Свойство("П000320000202" + Префикс) Тогда
				ОкрП000320000202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница2["П000320000202"+Префикс]);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				ОкрП000320000203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000320000203"+Префикс].Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница2.Свойство("П000320000203" + Префикс) Тогда
				ОкрП000320000203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница2["П000320000203"+Префикс]);
			КонецЕсли;
			
			П000320000204 = ОкрП000310000203 - (ОкрП000320000202 + ОкрП000320000203);
			
			Форма.СтруктураДанныхФорма300_03Страница2.Вставить("П000320000204" + Префикс, П000320000204);
			
			Форма.П0003200002[Индекс].П000320000204 = П000320000204;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				Форма.ТабличныйДокумент.Области["П000320000204"+Префикс].Значение = П000320000204;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
			
			СуммаП000310000104 = 0;
			СуммаП000320000102 = 0;
			СуммаП000320000103 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы32]].Количество() Цикл
				
				СуммаП000310000104 = СуммаП000310000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы31]][Ном - 1].П000310000203);
				СуммаП000320000102 = СуммаП000320000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000320000202_" + Ном].Значение);
				СуммаП000320000103 = СуммаП000320000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000320000203_" + Ном].Значение);
				
			КонецЦикла;
			
			Форма.ТабличныйДокумент.Области.П000320000102.Значение = СуммаП000320000102;
			Форма.ТабличныйДокумент.Области.П000320000103.Значение = СуммаП000320000103;
			Форма.ТабличныйДокумент.Области.П000320000104.Значение = СуммаП000310000104 - (СуммаП000320000102 + СуммаП000320000103);
			
			
		Иначе
			
			СуммаП000310000104 = 0;
			СуммаП000320000102 = 0;
			СуммаП000320000103 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы32]].Количество() Цикл
				
				СуммаП000310000104 = СуммаП000310000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000310000203_" + Ном].Значение);
				СуммаП000320000102 = СуммаП000320000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы32]][Ном - 1].П000320000202);
				СуммаП000320000103 = СуммаП000320000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы32]][Ном - 1].П000320000203);
				
			КонецЦикла;
			
			Форма.СтруктураДанныхФорма300_03Страница2.Вставить("П000320000102", СуммаП000320000102);
			Форма.СтруктураДанныхФорма300_03Страница2.Вставить("П000320000103", СуммаП000320000103);
			Форма.СтруктураДанныхФорма300_03Страница2.Вставить("П000320000104", СуммаП000310000104 - (СуммаП000320000102 + СуммаП000320000103));
			
		КонецЕсли;
		
		//00000001L
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000320000104, ОбластьИмя) > 0 Тогда
			
			ОкрП000310000104 = 0;
			ОкрП000320000102 = 0;
			ОкрП000320000103 = 0;
			ОкрП000320000102 = 0;
			ОкрП000320000104 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница1" Тогда
				ОкрП000310000104 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000310000104.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница1.Свойство("П000310000104") Тогда
				ОкрП000310000104 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница1.П000310000104);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				ОкрП000320000102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320000102.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница2.Свойство("П000320000102") Тогда
				ОкрП000320000102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница2.П000320000102);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				ОкрП000320000103 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320000103.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница2.Свойство("П000320000103") Тогда
				ОкрП000320000103 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница2.П000320000103);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				ОкрП000320000102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320000102.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница2.Свойство("П000320000102") Тогда
				ОкрП000320000102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница2.П000320000102);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				ОкрП000320000104 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320000104.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_03Страница2.Свойство("П000320000104") Тогда
				ОкрП000320000104 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_03Страница2.П000320000104);
			КонецЕсли;
			
			П000320000104 = ОкрП000310000104 - (ОкрП000320000102 + ОкрП000320000103 + ОкрП000320000102 + ОкрП000320000104);
			
			Форма.СтруктураДанныхФорма300_03Страница2.Вставить("П000320000104", П000320000104);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_03Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000320000104.Значение = П000320000104;
			КонецЕсли;
			
		КонецЕсли;
		
		Если    "П000320000102" = ОбластьИмя 
			ИЛИ "П000320000202" = Лев(ОбластьИмя,13) Тогда
			
			Расчет(Форма, "Форма300Страница2", "П000320000102");  //перерасчет 2й стр. форма 300.00
		ИначеЕсли "П000310000104" = ОбластьИмя 
			ИЛИ "П000310000203" = Лев(ОбластьИмя,13) Тогда
			Расчет(Форма, "Форма300Страница2", "П000310000104");  //перерасчет 2й стр. форма 300.00
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_04Страница1" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение04", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение04.Значение = "Х";
		КонецЕсли;
		
		//300.04.001A
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000410001001, ОбластьИмя) > 0 Тогда
			
			ОкрП000410001001 = 0;
			ОкрП000410001101 = 0;
			ОкрП000410001201 = 0;
			ОкрП000410001301 = 0;
			ОкрП000410001401 = 0;
			ОкрП000410001501 = 0;
			ОкрП000410001601 = 0;
			ОкрП000410001701 = 0;
			ОкрП000410001801 = 0;
			ОкрП000410001901 = 0;
			ОкрП0004100011001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001001") Тогда
				ОкрП000410001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001101") Тогда
				ОкрП000410001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001201") Тогда
				ОкрП000410001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001301") Тогда
				ОкрП000410001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001401") Тогда
				ОкрП000410001401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001401);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001501.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001501") Тогда
				ОкрП000410001501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001501);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001601.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001601") Тогда
				ОкрП000410001601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001601);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001701 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001701.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001701") Тогда
				ОкрП000410001701 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001701);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001801 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001801.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001801") Тогда
				ОкрП000410001801 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001801);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001901 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001901.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001901") Тогда
				ОкрП000410001901 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001901);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП0004100011001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П0004100011001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П0004100011001") Тогда
				ОкрП0004100011001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П0004100011001);
			КонецЕсли;
			
			П000410001001 = ОкрП000410001101 + ОкрП000410001201 + ОкрП000410001301 + ОкрП000410001401 + ОкрП000410001501 + ОкрП000410001601 + ОкрП000410001701 + ОкрП000410001801 + ОкрП000410001901 + ОкрП0004100011001;
			
			Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001001", П000410001001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000410001001.Значение = П000410001001;
			КонецЕсли;
			Расчет(Форма, "Форма300Страница3", "П000410001001");  //перерасчет 3й стр. форма 300.00
			
		КонецЕсли;
		
		//300.04.001B
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000410001002, ОбластьИмя) > 0 Тогда
			
			ОкрП000410001002 = 0;
			ОкрП000410001102 = 0;
			ОкрП000410001202 = 0;
			ОкрП000410001302 = 0;
			ОкрП000410001402 = 0;
			ОкрП000410001502 = 0;
			ОкрП000410001602 = 0;
			ОкрП000410001702 = 0;
			ОкрП000410001802 = 0;
			ОкрП000410001902 = 0;
			ОкрП0004100011002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001002") Тогда
				ОкрП000410001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001102.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001102") Тогда
				ОкрП000410001102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001102);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001202.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001202") Тогда
				ОкрП000410001202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001202);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001302.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001302") Тогда
				ОкрП000410001302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001302);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001402 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001402.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001402") Тогда
				ОкрП000410001402 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001402);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001502 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001502.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001502") Тогда
				ОкрП000410001502 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001502);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001602 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001602.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001602") Тогда
				ОкрП000410001602 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001602);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001702 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001702.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001702") Тогда
				ОкрП000410001702 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001702);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001802 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001802.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001802") Тогда
				ОкрП000410001802 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001802);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП000410001902 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000410001902.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П000410001902") Тогда
				ОкрП000410001902 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П000410001902);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				ОкрП0004100011002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П0004100011002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_04Страница1.Свойство("П0004100011002") Тогда
				ОкрП0004100011002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_04Страница1.П0004100011002);
			КонецЕсли;
			
			
			П000410001002 = ОкрП000410001102 + ОкрП000410001202 + ОкрП000410001302 + ОкрП000410001402 + ОкрП000410001502 + ОкрП000410001602 + ОкрП000410001702 + ОкрП000410001802 + ОкрП000410001902 + ОкрП0004100011002;
			
			Форма.СтруктураДанныхФорма300_04Страница1.Вставить("П000410001002", П000410001002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_04Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000410001002.Значение = П000410001002;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница2", "П000410001002");  //перерасчет 2й стр. форма 300.00
			
			Расчет(Форма, "Форма300Страница3", "П000410001002");  //перерасчет 3й стр. форма 300.00
			
		КонецЕсли;

	ИначеЕсли ИмяСтраницыПанели = "Форма300_05Страница2" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение05", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение05.Значение = "Х";
		КонецЕсли;
		
		//00000001F
		//00000001G
		//00000001H
		
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
			
			СуммаП000520000103 = 0;
			СуммаП000520000104 = 0;
			СуммаП000520000105 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы52]].Количество() Цикл
				
				СуммаП000520000103 = СуммаП000520000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000520000203_" + Ном].Значение);
				СуммаП000520000104 = СуммаП000520000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000520000204_" + Ном].Значение);
				СуммаП000520000105 = СуммаП000520000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000520000205_" + Ном].Значение);
				
			КонецЦикла;
			
			Форма.ТабличныйДокумент.Области.П000520000103.Значение = СуммаП000520000103;
			Форма.ТабличныйДокумент.Области.П000520000104.Значение = СуммаП000520000104;
			Форма.ТабличныйДокумент.Области.П000520000105.Значение = СуммаП000520000105;
			
			
		Иначе
			
			СуммаП000520000103 = 0;
			СуммаП000520000104 = 0;
			СуммаП000520000105 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы52]].Количество() Цикл
				
				СуммаП000520000103 = СуммаП000520000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы52]][Ном - 1].П000520000203);
				СуммаП000520000104 = СуммаП000520000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы52]][Ном - 1].П000520000204);
				СуммаП000520000105 = СуммаП000520000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы52]][Ном - 1].П000520000205);
				
			КонецЦикла;
			
			Форма.СтруктураДанныхФорма300_05Страница2.Вставить("П000520000103", СуммаП000520000103);
			Форма.СтруктураДанныхФорма300_05Страница2.Вставить("П000520000104", СуммаП000520000104);
			Форма.СтруктураДанныхФорма300_05Страница2.Вставить("П000520000105", СуммаП000520000105);
			
		КонецЕсли;
        
        Если СтрНайти(ОбластьИмя, "П000520000205") > 0 Тогда
			Расчет(Форма, "Форма300_05Страница3", ОбластьИмя);  //перерасчет 3й стр. форма 300.05
        КонецЕсли;
        
        Если СтрНайти(ОбластьИмя, "П000520000203") > 0 Тогда
			ОбластьДляИзменения = "П000520000103";
		ИначеЕсли СтрНайти(ОбластьИмя, "П000520000205") > 0 Тогда
			ОбластьДляИзменения = "П000520000105";
		Иначе
			ОбластьДляИзменения = ОбластьИмя;
		КонецЕсли;
        
        Расчет(Форма, "Форма300Страница2", ОбластьДляИзменения);  //перерасчет 2й стр. форма 300.00
        
    ИначеЕсли ИмяСтраницыПанели = "Форма300_05Страница3" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение05", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение05.Значение = "Х";
		КонецЕсли;
		
		//00000001F
		//00000001G
		//00000001H
        
        Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000530000205, Лев(ОбластьИмя,13)) > 0 Тогда
			
			Префикс = Сред(ОбластьИмя,Найти(ОбластьИмя,"_"),СтрДлина(ОбластьИмя) - (Найти(ОбластьИмя,"_")-1));
			Индекс = Число(Прав(Префикс,СтрДлина(Префикс)-1)) - 1;
			
			ОкрП000520000205 = 0;
            ОкрП000530000204 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_05Страница2" Тогда
				ОкрП000520000205 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000520000205"+Префикс].Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_05Страница2.Свойство("П000520000205" + Префикс) Тогда
				ОкрП000520000205 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_05Страница2["П000520000205"+Префикс]);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_05Страница3" Тогда
				ОкрП000530000204 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000530000204"+Префикс].Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_05Страница3.Свойство("П000530000204" + Префикс) Тогда
				ОкрП000530000204 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_05Страница3["П000530000204"+Префикс]);
			КонецЕсли;
			
			П000530000205 = ОкрП000520000205 + ОкрП000530000204;
			
			Форма.СтруктураДанныхФорма300_05Страница3.Вставить("П000530000205" + Префикс, П000530000205);
			
			Форма.П0005300002[Индекс].П000530000205 = П000530000205;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_05Страница3"  Тогда
				Форма.ТабличныйДокумент.Области["П000530000205"+Префикс].Значение = П000530000205;
			КонецЕсли;
			
		КонецЕсли;

        
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
			
			СуммаП000530000102 = 0;
			СуммаП000530000103 = 0;
			СуммаП000530000104 = 0;
            СуммаП000530000105 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы53]].Количество() Цикл
				
				СуммаП000530000102 = СуммаП000530000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000530000202_" + Ном].Значение);
				СуммаП000530000103 = СуммаП000530000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000530000203_" + Ном].Значение);
				СуммаП000530000104 = СуммаП000530000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000530000204_" + Ном].Значение);
                СуммаП000530000105 = СуммаП000530000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000530000205_" + Ном].Значение);
				
			КонецЦикла;
			
			Форма.ТабличныйДокумент.Области.П000530000102.Значение = СуммаП000530000102;
			Форма.ТабличныйДокумент.Области.П000530000103.Значение = СуммаП000530000103;
			Форма.ТабличныйДокумент.Области.П000530000104.Значение = СуммаП000530000104;
            Форма.ТабличныйДокумент.Области.П000530000105.Значение = СуммаП000530000105;            
			
		Иначе
			
			СуммаП000530000102 = 0;
			СуммаП000530000103 = 0;
			СуммаП000530000104 = 0;
            СуммаП000530000105 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы53]].Количество() Цикл
				
				СуммаП000530000102 = СуммаП000530000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы53]][Ном - 1].П000530000202);
				СуммаП000530000103 = СуммаП000530000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы53]][Ном - 1].П000530000203);
				СуммаП000530000104 = СуммаП000530000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы53]][Ном - 1].П000530000204);
                СуммаП000530000105 = СуммаП000530000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы53]][Ном - 1].П000530000205);
				
			КонецЦикла;
			
			Форма.СтруктураДанныхФорма300_05Страница3.Вставить("П000530000102", СуммаП000530000102);
			Форма.СтруктураДанныхФорма300_05Страница3.Вставить("П000530000103", СуммаП000530000103);
			Форма.СтруктураДанныхФорма300_05Страница3.Вставить("П000530000104", СуммаП000530000104);
            Форма.СтруктураДанныхФорма300_05Страница3.Вставить("П000530000105", СуммаП000530000105);
			
        КонецЕсли;
        
        Если СтрНайти(ОбластьИмя, "П000530000204") > 0 Тогда
			ОбластьДляИзменения = "П000530000104";
		ИначеЕсли СтрНайти(ОбластьИмя, "П000530000205") > 0 Тогда
			ОбластьДляИзменения = "П000530000105";
		Иначе
			ОбластьДляИзменения = ОбластьИмя;
		КонецЕсли;
        
        Расчет(Форма, "Форма300Страница2", ОбластьДляИзменения);  //перерасчет 2й стр. форма 300.00
        
	ИначеЕсли ИмяСтраницыПанели = "Форма300_06Страница1" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение06", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение06.Значение = "Х";
		КонецЕсли;
		
		//300.06.001А
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000610001001, ОбластьИмя) > 0 Тогда

			ОкрП000610001001 = 0;
			ОкрП000610001101 = 0;
			ОкрП000610001201 = 0;
			ОкрП000610001301 = 0;
			ОкрП000610001401 = 0;
			ОкрП000610001501 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610001001") Тогда
				ОкрП000610001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610001001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610001101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610001101") Тогда
				ОкрП000610001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610001101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610001201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610001201") Тогда
				ОкрП000610001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610001201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610001301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610001301") Тогда
				ОкрП000610001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610001301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610001401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610001401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610001401") Тогда
				ОкрП000610001401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610001401);
			КонецЕсли;

			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610001501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610001501.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610001501") Тогда
				ОкрП000610001501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610001501);
			КонецЕсли;
			
			П000610001001 = ОкрП000610001101 + ОкрП000610001201 + ОкрП000610001301 + ОкрП000610001401 + ОкрП000610001501;
			
			Форма.СтруктураДанныхФорма300_06Страница1.Вставить("П000610001001", П000610001001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000610001001.Значение = П000610001001;
			КонецЕсли;
			                                       
			Расчет(Форма, "Форма300_06Страница1", "П000610004001");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;

		//300.06.001B
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000610001002, ОбластьИмя) > 0 Тогда

			ОкрП000610001002 = 0;
			ОкрП000610001102 = 0;
			ОкрП000610001202 = 0;
			ОкрП000610001302 = 0;
			ОкрП000610001402 = 0;
			ОкрП000610001502 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610001002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610001002") Тогда
				ОкрП000610001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610001002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610001102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610001102.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610001102") Тогда
				ОкрП000610001102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610001102);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610001202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610001202.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610001202") Тогда
				ОкрП000610001202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610001202);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610001302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610001302.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610001302") Тогда
				ОкрП000610001302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610001302);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610001402 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610001402.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610001402") Тогда
				ОкрП000610001402 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610001402);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610001502 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610001502.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610001502") Тогда
				ОкрП000610001502 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610001502);
			КонецЕсли;
			
			П000610001002 = ОкрП000610001102 + ОкрП000610001202 + ОкрП000610001302 + ОкрП000610001402 + ОкрП000610001502;
			
			Форма.СтруктураДанныхФорма300_06Страница1.Вставить("П000610001002", П000610001002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000610001002.Значение = П000610001002;
			КонецЕсли;
			                                               
			Расчет(Форма, "Форма300_06Страница1", "П000610004002");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;

		//300.06.004А
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000610004001, ОбластьИмя) > 0 Тогда
			
			ОкрП000610001001 = 0;
			ОкрП000610002001 = 0;
			ОкрП000610003001 = 0;
			ОкрП000610004001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610001001") Тогда
				ОкрП000610001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610001001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610002001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610002001") Тогда
				ОкрП000610002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610002001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610003001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610003001") Тогда
				ОкрП000610003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610003001);
			КонецЕсли;
			
			П000610004001 = ОкрП000610001001 + ОкрП000610002001 + ОкрП000610003001;
			
			Форма.СтруктураДанныхФорма300_06Страница1.Вставить("П000610004001", П000610004001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000610004001.Значение = П000610004001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница1", "П000610004001");  //перерасчет 1й стр. форма 300.00
			
		КонецЕсли;
		
		//300.06.004B
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000610004002, ОбластьИмя) > 0 Тогда
			
			ОкрП000610001002 = 0;
			ОкрП000610002002 = 0;
			ОкрП000610003002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610001002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610001002") Тогда
				ОкрП000610001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610001002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610002002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610002002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610002002") Тогда
				ОкрП000610002002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610002002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610003002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610003002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610003002") Тогда
				ОкрП000610003002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610003002);
			КонецЕсли;
			
			П000610004002 = ОкрП000610001002 + ОкрП000610002002 + ОкрП000610003002;
			
			Форма.СтруктураДанныхФорма300_06Страница1.Вставить("П000610004002", П000610004002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000610004002.Значение = П000610004002;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница1", "П000610004002");  //перерасчет 1й стр. форма 300.00
			
		КонецЕсли;
		
		Если "П000610005001" = ОбластьИмя Тогда
			
			Расчет(Форма, "Форма300Страница1", ОбластьИмя);  //перерасчет 1й стр. форма 300.00
			
		КонецЕсли;
		
		//300.06.006А
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000610006001, ОбластьИмя) > 0 Тогда

			ОкрП000610006001 = 0;
			ОкрП000610006101 = 0;
			ОкрП000610006201 = 0;
			ОкрП000610006301 = 0;
			ОкрП000610006401 = 0;
			ОкрП000610006501 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610006001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610006001") Тогда
				ОкрП000610006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610006001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610006101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610006101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610006101") Тогда
				ОкрП000610006101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610006101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610006201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610006201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610006201") Тогда
				ОкрП000610006201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610006201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610006301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610006301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610006301") Тогда
				ОкрП000610006301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610006301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610006401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610006401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610006401") Тогда
				ОкрП000610006401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610006401);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610006501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610006501.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610006501") Тогда
				ОкрП000610006501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610006501);
			КонецЕсли;

			
			П000610006001 = ОкрП000610006101 + ОкрП000610006201 + ОкрП000610006301 + ОкрП000610006401 + ОкрП000610006501;
			
			Форма.СтруктураДанныхФорма300_06Страница1.Вставить("П000610006001", П000610006001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000610006001.Значение = П000610006001;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница1", "П000610006001");  //перерасчет 5й стр. форма 300.00
			
		КонецЕсли;
		
		//300.06.007B
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000610007002, ОбластьИмя) > 0 Тогда

			ОкрП000610007002 = 0;
			ОкрП000610007102 = 0;
			ОкрП000610007202 = 0;
			ОкрП000610007302 = 0;
			ОкрП000610007402 = 0;
			ОкрП000610007502 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610007002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610007002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610007002") Тогда
				ОкрП000610007002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610007002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610007102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610007102.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610007102") Тогда
				ОкрП000610007102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610007102);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610007202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610007202.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610007202") Тогда
				ОкрП000610007202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610007202);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610007302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610007302.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610007302") Тогда
				ОкрП000610007302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610007302);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610007402 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610007402.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610007402") Тогда
				ОкрП000610007402 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610007402);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610007502 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610007502.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610007502") Тогда
				ОкрП000610007502 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610007502);
			КонецЕсли;
			
			
			П000610007002 = ОкрП000610007102 + ОкрП000610007202 + ОкрП000610007302 + ОкрП000610007402 + ОкрП000610007502;
			
			Форма.СтруктураДанныхФорма300_06Страница1.Вставить("П000610007002", П000610007002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000610007002.Значение = П000610007002;
			КонецЕсли;
			
			Расчет(Форма, "Форма300_06Страница1", "П000610010002");  //перерасчет 2й стр. форма 300.00
			
		КонецЕсли;

		//300.06.010B
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000610010002, ОбластьИмя) > 0 Тогда
			
			ОкрП000610007002 = 0;
			ОкрП000610008002 = 0;
			ОкрП000610009002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610007002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610007002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610007002") Тогда
				ОкрП000610007002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610007002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610008002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610008002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610008002") Тогда
				ОкрП000610008002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610008002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				ОкрП000610009002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000610009002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма300_06Страница1.Свойство("П000610009002") Тогда
				ОкрП000610009002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма300_06Страница1.П000610009002);
			КонецЕсли;
			
			П000610010002 = ОкрП000610007002 + ОкрП000610008002 + ОкрП000610009002;
			
			Форма.СтруктураДанныхФорма300_06Страница1.Вставить("П000610010002", П000610010002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300_06Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000610010002.Значение = П000610010002;
			КонецЕсли;
			
			Расчет(Форма, "Форма300Страница1", "П000610010002");  //перерасчет 1й стр. форма 300.00
			
		КонецЕсли;
		
		Если "П000610001001" = ОбластьИмя 
			ИЛИ "П000610001101" = ОбластьИмя
			ИЛИ "П000610001201" = ОбластьИмя
			ИЛИ "П000610002001" = ОбластьИмя
			ИЛИ "П000610003001" = ОбластьИмя 
			ИЛИ "П000610004001" = ОбластьИмя Тогда
			
			Расчет(Форма, "Форма300Страница1", "П000610004001");
			
		ИначеЕсли "П000610001002" = ОбластьИмя 
			ИЛИ "П000610001102" = ОбластьИмя
			ИЛИ "П000610001202" = ОбластьИмя
			ИЛИ "П000610002002" = ОбластьИмя
			ИЛИ "П000610003002" = ОбластьИмя 
			ИЛИ "П000610004002" = ОбластьИмя Тогда
			
			Расчет(Форма, "Форма300Страница1", "П000610004002");
			
		ИначеЕсли "П000610006001" = ОбластьИмя
			ИЛИ "П000610006101" = ОбластьИмя
			ИЛИ "П000610006201" = ОбластьИмя Тогда
			
			Расчет(Форма, "Форма300Страница1", "П000610006001");
			
		ИначеЕсли "П000610007002" = ОбластьИмя
			ИЛИ "П000610007102" = ОбластьИмя
			ИЛИ "П000610007202" = ОбластьИмя
			ИЛИ "П000610008002" = ОбластьИмя
			ИЛИ "П000610009002" = ОбластьИмя
			ИЛИ "П000610010002" = ОбластьИмя Тогда
			
			Расчет(Форма, "Форма300Страница2", "П000610010002");
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_07Страница1" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение07", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение07.Значение = "Х";
		КонецЕсли;
		
		Расчет(Форма, "Форма300_07Страница2", ОбластьИмя);
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_07Страница2" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение07", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение07.Значение = "Х";
		КонецЕсли;
		
		//00000001H
		//00000001I
		//00000001J
		
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
			
			СуммаП000720000102 = 0;
			СуммаП000720000103 = 0;
			СуммаП000720000104 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы72]].Количество() Цикл
				
				СуммаП000720000102 = СуммаП000720000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000720000202_" + Ном].Значение);
				СуммаП000720000103 = СуммаП000720000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000720000203_" + Ном].Значение);
				СуммаП000720000104 = СуммаП000720000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000720000204_" + Ном].Значение);
				
			КонецЦикла;
			
			Форма.ТабличныйДокумент.Области.П000720000102.Значение = СуммаП000720000102;
			Форма.ТабличныйДокумент.Области.П000720000103.Значение = СуммаП000720000103;
			Форма.ТабличныйДокумент.Области.П000720000104.Значение = СуммаП000720000104;
			
			
		Иначе
			
			СуммаП000720000102 = 0;
			СуммаП000720000103 = 0;
			СуммаП000720000104 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы72]].Количество() Цикл
				
				СуммаП000720000102 = СуммаП000720000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы72]][Ном - 1].П000720000202);
				СуммаП000720000103 = СуммаП000720000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы72]][Ном - 1].П000720000203);
				СуммаП000720000104 = СуммаП000720000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы72]][Ном - 1].П000720000204);
				
			КонецЦикла;
			
			Форма.СтруктураДанныхФорма300_07Страница2.Вставить("П000720000102", СуммаП000720000102);
			Форма.СтруктураДанныхФорма300_07Страница2.Вставить("П000720000103", СуммаП000720000103);
			Форма.СтруктураДанныхФорма300_07Страница2.Вставить("П000720000104", СуммаП000720000104);
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_07Страница3" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение07", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение07.Значение = "Х";
		КонецЕсли;
		
		Расчет(Форма, "Форма300_07Страница2", ОбластьИмя);
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_08Страница1" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение08", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение08.Значение = "Х";
		КонецЕсли;
		
		Расчет(Форма, "Форма300_08Страница2", ОбластьИмя);
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_08Страница2" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение08", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение08.Значение = "Х";
		КонецЕсли;
		
		//00000001H
		//00000001I
		//00000001J
		
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
			
			СуммаП000820000102 = 0;
			СуммаП000820000103 = 0;
			СуммаП000820000104 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы82]].Количество() Цикл
				
				СуммаП000820000102 = СуммаП000820000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000820000202_" + Ном].Значение);
				СуммаП000820000103 = СуммаП000820000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000820000203_" + Ном].Значение);
				СуммаП000820000104 = СуммаП000820000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000820000204_" + Ном].Значение);
				
			КонецЦикла;
			
			Форма.ТабличныйДокумент.Области.П000820000102.Значение = СуммаП000820000102;
			Форма.ТабличныйДокумент.Области.П000820000103.Значение = СуммаП000820000103;
			Форма.ТабличныйДокумент.Области.П000820000104.Значение = СуммаП000820000104;
			
			
		Иначе
			
			СуммаП000820000102 = 0;
			СуммаП000820000103 = 0;
			СуммаП000820000104 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы82]].Количество() Цикл
				
				СуммаП000820000102 = СуммаП000820000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы82]][Ном - 1].П000820000202);
				СуммаП000820000103 = СуммаП000820000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы82]][Ном - 1].П000820000203);
				СуммаП000820000104 = СуммаП000820000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы82]][Ном - 1].П000820000204);
				
			КонецЦикла;
			
			Форма.СтруктураДанныхФорма300_08Страница2.Вставить("П000820000102", СуммаП000820000102);
			Форма.СтруктураДанныхФорма300_08Страница2.Вставить("П000820000103", СуммаП000820000103);
			Форма.СтруктураДанныхФорма300_08Страница2.Вставить("П000820000104", СуммаП000820000104);
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма300_08Страница3" Тогда
		
		Форма.СтруктураДанныхФорма300Страница1.Вставить("Приложение08", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение08.Значение = "Х";
		КонецЕсли;
		
		Расчет(Форма, "Форма300_08Страница2", ОбластьИмя);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьЗавершение", ЭтотОбъект);
	
	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВыгрузитьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчет() Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьОтчетЗавершение", ЭтотОбъект);
	
	Если Модифицированность Тогда
		СохранитьНаКлиенте(,ОписаниеОповещения);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчетЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ФормаВыгрузкиРеглОтчета = ПолучитьФорму("Документ.ВыгрузкаРегламентированныхОтчетов.Форма.ФормаДокумента", , ЭтаФорма);
	
	СпДокОсн = Новый СписокЗначений;
	СпДокОсн.Добавить(СтруктураРеквизитовФормы.мСохраненныйДок);
	
	ФормаВыгрузкиРеглОтчета.СформироватьИЗаписать(СпДокОсн);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВExcel(Команда)
	
	Если НЕ (СтрНайти(СтруктураРеквизитовФормы.НаимТекущегоРаздела, "Форма300_07") > 0 
		ИЛИ СтрНайти(СтруктураРеквизитовФормы.НаимТекущегоРаздела, "Форма300_08") > 0) Тогда
		ТекстСообщения = НСтр("ru = 'Из-за отсутствия актуального шаблона выгрузка в Excel невозможна.'");								
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);									
		Возврат 	
	КонецЕсли;		
	
	КодФормы = Сред(СтруктураРеквизитовФормы.НаимТекущегоРаздела, 0, 11);
	
	ПараметрыВыгрузкиВExcel = ПолучитьПараметрыВыгрузкиВExcel(КодФормы);
	ВыбратьИПередатьФайлШаблонаНаСервер(ПараметрыВыгрузкиВExcel.ИмяФайлаШаблона, КодФормы);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИПередатьФайлШаблонаНаСервер(ИмяФайлаШаблона, ИмяФормы)
	
	РасширениеПодключено = ПодключитьРасширениеРаботыСФайлами();
	Если НЕ РасширениеПодключено Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТекстПредложения", НСтр("ru = 'Для выбора шаблона Excel 
								|необходимо установить расширение работы с файлами.'"));
		ПараметрыФормы.Вставить("ВозможноПродолжениеБезУстановки", Ложь);
		ОткрытьФорму("ОбщаяФорма.ВопросОбУстановкеРасширенияРаботыСФайлами", ПараметрыФормы);
		Возврат;
	КонецЕсли;		
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПолноеИмяФайла = ИмяФайлаШаблона;
	ДиалогОткрытияФайла.Фильтр = НСтр("ru = 'Книга Excel (*.xls;*.xlsx)|*.xls;*.xlsx'");
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Укажите файл шайблона формы для выгрузки в Excel'");
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьИПередатьФайлШаблонаНаСерверЗавершение", ЭтотОбъект, Новый Структура);	
	Оповещение.ДополнительныеПараметры.Вставить("ИмяФормы", ИмяФормы);	
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		НачатьПомещениеФайла(Оповещение, , ДиалогОткрытияФайла.ПолноеИмяФайла, Ложь, УникальныйИдентификатор);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Обработчик немодального завершения выбора и передачи файлов на сервер
//
Процедура ВыбратьИПередатьФайлШаблонаНаСерверЗавершение(Знач Успешно, Знач АдресФайлаШаблона, Знач ВыбранноеИмяФайла, Знач ДополнительныеПараметры) Экспорт
	
	Если Не Успешно Тогда
		Возврат;
	КонецЕсли;
	
	// Заполним шаблон Excel по указанному адресу
	ПараметрыВыгрузкиВExcel = ПолучитьПараметрыВыгрузкиВExcel(ДополнительныеПараметры.ИмяФормы);
	
#Если ВебКлиент Тогда
	РезультатВыгрузки = ВыгрузитьДанныеРеестраВExcelНаСервере(ДополнительныеПараметры.ИмяФормы, АдресФайлаШаблона,ПараметрыВыгрузкиВExcel.ИмяЛистаШаблона, 
													ПараметрыВыгрузкиВExcel.НомерПервойСтроки, ПараметрыВыгрузкиВExcel.ЗаголовокРеестра);
	Если РезультатВыгрузки = Неопределено Тогда
		// не сформирован результат.
		Возврат;
	КонецЕсли;
	
	АдресРеестра = РезультатВыгрузки.АдресРеестраExcel;
	АдресВременногоХранилища = РезультатВыгрузки.АдресФайлаExcel;
	
#Иначе
	РезультатВыгрузкиРеестра = ВыгрузитьДанныеРеестраНаСервере(ДополнительныеПараметры.ИмяФормы, ПараметрыВыгрузкиВExcel.ЗаголовокРеестра);
	
	Если РезультатВыгрузкиРеестра.АдресРеестраДляВыгрузки <> Неопределено И РезультатВыгрузкиРеестра.КоличествоЗаписей <> 0 Тогда
		РезультатВыгрузкиВФайл = ВыгрузитьДанныеРеестраВExcelНаКлиенте(ДополнительныеПараметры.ИмяФормы, АдресФайлаШаблона, РезультатВыгрузкиРеестра.АдресРеестраДляВыгрузки, ПараметрыВыгрузкиВExcel.ИмяЛистаШаблона, 
																ПараметрыВыгрузкиВExcel.НомерПервойСтроки, РезультатВыгрузкиРеестра.КоличествоЗаписей);
	Иначе
		Возврат;
	КонецЕсли;
	
	Если РезультатВыгрузкиВФайл = Неопределено Тогда
		// не сформирован результат.
		Возврат;
	КонецЕсли;
	
	АдресРеестра = РезультатВыгрузкиРеестра.АдресРеестраExcel;
	АдресВременногоХранилища = РезультатВыгрузкиВФайл.АдресФайлаExcel;
#КонецЕсли

	Если НЕ АдресРеестра = Неопределено Тогда
		
		РеестрСФ = ПолучитьИзВременногоХранилища(АдресРеестра);
		РеестрСФ.ОтображатьСетку = Ложь;
		РеестрСФ.ОтображатьЗаголовки = Ложь;
		РеестрСФ.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		ИдентификаторПечатнойФормы = Сред(СтруктураРеквизитовФормы.НаимТекущегоРаздела, 1, 11) + " " + СтруктураРеквизитовФормы.мГод + "кв" + СтруктураРеквизитовФормы.мКвартал;
		
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
		ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Реестр счетов-фактур'");
		ПечатнаяФорма.ТабличныйДокумент = РеестрСФ;
		ПечатнаяФорма.ИмяФайлаПечатнойФормы = НСтр("ru = 'Реестр счетов-фактур'");
	
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);

	КонецЕсли;
	
	Если НЕ АдресВременногоХранилища = Неопределено Тогда
		Если Не ПодключитьРасширениеРаботыСФайлами() Тогда		
			ПолучитьФайл(АдресВременногоХранилища, СтруктураРеквизитовФормы.НаимТекущегоРаздела, Истина); 
			Возврат;
		КонецЕсли;
		
		ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогСохраненияФайла.ПолноеИмяФайла = Сред(СтруктураРеквизитовФормы.НаимТекущегоРаздела, 1, 11) + " " + СтруктураРеквизитовФормы.мГод + "кв" + СтруктураРеквизитовФормы.мКвартал;
		ДиалогСохраненияФайла.Фильтр = НСтр("ru = 'Книга Excel (*.xls)|*.xls'");
		ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
		ДиалогСохраненияФайла.Заголовок = НСтр("ru = 'Сохранение многострочного приложения в формате Excel'");
		
		Если ДиалогСохраненияФайла.Выбрать() Тогда	 	   
			
			ПолучитьФайл(АдресВременногоХранилища, ДиалогСохраненияФайла.ПолноеИмяФайла, Ложь);     
			
			ТекстСообщения = НСтр("ru = 'Данные успешно выгружены в'");		
			
			#Если НЕ ВебКлиент Тогда
				ПоказатьОповещениеПользователя(
				ТекстСообщения, "file://" + СтрЗаменить(СокрЛП(ДиалогСохраненияФайла.Каталог), "\", "/"),
				ДиалогСохраненияФайла.Каталог);
			#Иначе
				ПоказатьОповещениеПользователя(
				ТекстСообщения,,
				ДиалогСохраненияФайла.Каталог);
			#КонецЕсли  						
		КонецЕсли;					
	КонецЕсли;	
	
	// Сообщить о завершении выгрузки и показать файл
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыВыгрузкиВExcel(ИмяФормы)
	ПараметрыВыгрузки = Новый Структура("ИмяФайлаШаблона, ИмяЛистаШаблона, НомерПервойСтроки, ЗаголовокРеестра");
	Если ИмяФормы = "Форма300_07" Тогда
		ПараметрыВыгрузки.ИмяФайлаШаблона = "SONO_300_07_2016.xls";
		ПараметрыВыгрузки.ИмяЛистаШаблона = "300.07.Data1";
		ПараметрыВыгрузки.НомерПервойСтроки = 2;
		ПараметрыВыгрузки.ЗаголовокРеестра = "РЕЕСТР СЧЕТОВ-ФАКТУР ПО РЕАЛИЗОВАННЫМ ТОВАРАМ, РАБОТАМ, УСЛУГАМ В ТЕЧЕНИЕ ОТЧЕТНОГО НАЛОГОВОГО ПЕРИОДА";
	ИначеЕсли ИмяФормы = "Форма300_08"  Тогда
		ПараметрыВыгрузки.ИмяФайлаШаблона = "SONO_300_08_2016.xls";
		ПараметрыВыгрузки.ИмяЛистаШаблона = "300.08.Data1";
		ПараметрыВыгрузки.НомерПервойСтроки = 2;
		ПараметрыВыгрузки.ЗаголовокРеестра = "РЕЕСТР СЧЕТОВ-ФАКТУР ПО ПРИОБРЕТЕННЫМ ТОВАРАМ, РАБОТАМ, УСЛУГАМ В ТЕЧЕНИЕ ОТЧЕТНОГО НАЛОГОВОГО ПЕРИОДА";
	КонецЕсли;	
	
	Возврат ПараметрыВыгрузки
КонецФункции	

&НаСервере
// Процедура подготавливает таблицу данных для выгрузки и помещает его в реквизит формы.
//
Функция ВыгрузитьДанныеРеестраНаСервере(ИмяФормы, Заголовок)

	Результат = Новый Структура("АдресРеестраExcel, АдресРеестраДляВыгрузки, КоличествоЗаписей", Неопределено, Неопределено, 0);
	
	// сформируем предварительно табличный документ, если вдруг не окажется Excel на компьютере
	ТаблицаДанных = ПолучитьТаблицуДанныхРеестраExcel(ИмяФормы);
	
	СтруктураИтоговыхПолей = ПолучитьСтруктуруИтоговыхПолейРеестраExcel(ИмяФормы);
	
	Реестр = Новый ТабличныйДокумент;
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("МакетРеестра2017Кв1");
	
	СведенияОНалогоплательщике = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(СтруктураРеквизитовФормы.Организация,,"НаимЮЛПол, ИННЮЛ");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.Заголовок 		= Заголовок;
	ОбластьЗаголовок.Параметры.ИИН_БИН 			= СведенияОНалогоплательщике.ИННЮЛ;
	ОбластьЗаголовок.Параметры.Налогоплательщик = СведенияОНалогоплательщике.НаимЮЛПол;
	ОбластьЗаголовок.Параметры.НалоговыйПериод 	= ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));
	Реестр.Вывести(ОбластьЗаголовок);
	
	ОбластьЗаголовокКолонки = Макет.ПолучитьОбласть("Шапка|Колонка");
	НомерКолонки = 0;
	
	РеестрДляВыгрузки = Новый ТабличныйДокумент;
	ОбластьЗаголовокКолонкиРеестра = Макет.ПолучитьОбласть("Шапка|Колонка");
	
	НомерКолонки = 0;
	Для Каждого Колонка Из ТаблицаДанных.Колонки Цикл
		НомерКолонки = НомерКолонки + 1;
		ОбластьЗаголовокКолонки.Параметры.ЗаголовокКолонки = Колонка.Заголовок;
		ОбластьЗаголовокКолонкиРеестра.Параметры.ЗаголовокКолонки = Колонка.Имя;
		
		Если НомерКолонки = 1 Тогда
			Реестр.Вывести(ОбластьЗаголовокКолонки);
			РеестрДляВыгрузки.Вывести(ОбластьЗаголовокКолонкиРеестра);
		Иначе
			Реестр.Присоединить(ОбластьЗаголовокКолонки);
			РеестрДляВыгрузки.Присоединить(ОбластьЗаголовокКолонкиРеестра);
		КонецЕсли;
	КонецЦикла;

	ОбластьСтрока = Макет.ПолучитьОбласть("Строка|Колонка");
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		НомерКолонки = 0;
		Для Каждого Колонка Из ТаблицаДанных.Колонки Цикл
			НомерКолонки = НомерКолонки + 1;
			ОбластьСтрока.Параметры.Строка = СтрокаДанных[Колонка.Имя];
			Если НомерКолонки = 1 Тогда
				Реестр.Вывести(ОбластьСтрока);
				РеестрДляВыгрузки.Вывести(ОбластьСтрока);
			Иначе
				Реестр.Присоединить(ОбластьСтрока);
				РеестрДляВыгрузки.Присоединить(ОбластьСтрока);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	// подсчитаем итоги по тем полям, которые указаны как итоговые
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал|Колонка");
	НомерКолонки = 0;
	Для Каждого Колонка Из ТаблицаДанных.Колонки Цикл
		НомерКолонки = НомерКолонки + 1;
		Если СтруктураИтоговыхПолей.Свойство(Колонка.Имя) Тогда
			ОбластьПодвал.Параметры.Итог = ТаблицаДанных.Итог(Колонка.Имя);
		Иначе
			ОбластьПодвал.Параметры.Итог = "";
		КонецЕсли;
		Если НомерКолонки = 1 Тогда
			Реестр.Вывести(ОбластьПодвал);
		Иначе
			Реестр.Присоединить(ОбластьПодвал);
		КонецЕсли;
	КонецЦикла;

	Результат.АдресРеестраExcel = ПоместитьВоВременноеХранилище(Реестр, ЭтаФорма.УникальныйИдентификатор);
	Результат.АдресРеестраДляВыгрузки = ПоместитьВоВременноеХранилище(РеестрДляВыгрузки, ЭтаФорма.УникальныйИдентификатор);
	Результат.КоличествоЗаписей = ТаблицаДанных.Количество();
	
	Возврат Результат;
	
КонецФункции// ВыгрузитьВExcel()

&НаСервере
// Процедура выгружает переданную таблицу значений в Excel
//
Функция ВыгрузитьДанныеРеестраВExcelНаСервере(ИмяФормы, АдресФайлаШаблона, ИмяЛиста, 
								НомерНачальнойСтрокиExcel, Заголовок)

								
	Результат = Новый Структура("АдресФайлаExcel, АдресРеестраExcel", Неопределено, Неопределено);
	
	// сформируем предварительно табличный документ, если вдруг не окажется Excel на компьютере
	ТаблицаДанных = ПолучитьТаблицуДанныхРеестраExcel(ИмяФормы);
	СтруктураСоответствияПолей = ПолучитьСтруктуруСоответствияПолейРеестраExcel(ИмяФормы);
	СтруктураИтоговыхПолей = ПолучитьСтруктуруИтоговыхПолейРеестраExcel(ИмяФормы);
	
	Реестр = Новый ТабличныйДокумент;
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("МакетРеестра2017Кв1");
	
	СведенияОНалогоплательщике = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(СтруктураРеквизитовФормы.Организация,,"НаимЮЛПол, ИННЮЛ");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.Заголовок 		= Заголовок;
	ОбластьЗаголовок.Параметры.ИИН_БИН 			= СведенияОНалогоплательщике.ИННЮЛ;
	ОбластьЗаголовок.Параметры.Налогоплательщик = СведенияОНалогоплательщике.НаимЮЛПол;
	ОбластьЗаголовок.Параметры.НалоговыйПериод 	= ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));
	Реестр.Вывести(ОбластьЗаголовок);
	
	ОбластьЗаголовокКолонки = Макет.ПолучитьОбласть("Шапка|Колонка");
	НомерКолонки = 0;
	Для Каждого Колонка Из ТаблицаДанных.Колонки Цикл
		НомерКолонки = НомерКолонки + 1;
		ОбластьЗаголовокКолонки.Параметры.ЗаголовокКолонки = Колонка.Заголовок;
		Если НомерКолонки = 1 Тогда
			Реестр.Вывести(ОбластьЗаголовокКолонки);
		Иначе
			Реестр.Присоединить(ОбластьЗаголовокКолонки);
		КонецЕсли;
	КонецЦикла;
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка|Колонка");
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		НомерКолонки = 0;
		Для Каждого Колонка Из ТаблицаДанных.Колонки Цикл
			НомерКолонки = НомерКолонки + 1;
			ОбластьСтрока.Параметры.Строка = СтрокаДанных[Колонка.Имя];
			Если НомерКолонки = 1 Тогда
				Реестр.Вывести(ОбластьСтрока);
			Иначе
				Реестр.Присоединить(ОбластьСтрока);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	// подсчитаем итоги по тем полям, которые указаны как итоговые
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал|Колонка");
	НомерКолонки = 0;
	Для Каждого Колонка Из ТаблицаДанных.Колонки Цикл
		НомерКолонки = НомерКолонки + 1;
		Если СтруктураИтоговыхПолей.Свойство(Колонка.Имя) Тогда
			ОбластьПодвал.Параметры.Итог = ТаблицаДанных.Итог(Колонка.Имя);
		Иначе
			ОбластьПодвал.Параметры.Итог = "";
		КонецЕсли;
		Если НомерКолонки = 1 Тогда
			Реестр.Вывести(ОбластьПодвал);
		Иначе
			Реестр.Присоединить(ОбластьПодвал);
		КонецЕсли;
	КонецЦикла;

	Попытка
		ОбъектЭксель = Новый COMОбъект("Excel.Application");
		ОбъектЭксель.ScreenUpdating = Ложь;
		ОбъектЭксель.EnableEvents = Ложь;
	Исключение		
		ТекстСообщения = НСтр("ru = 'Не удалось создать объект Excel.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);

		Возврат Результат;
	КонецПопытки;
	
	// Сохраним шаблон во временный файл
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаШаблона);	
	ИмяВременногоШаблона = ПолучитьИмяВременногоФайла("xls");
	ДвоичныеДанные.Записать(ИмяВременногоШаблона);
	
	Попытка
		НоваяКнига = ОбъектЭксель.Workbooks.Add(ИмяВременногоШаблона);
	Исключение
		
		ТекстСообщения = НСтр("ru = 'Не удалось создать новый документ Excel, на основании указанного шаблона.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Возврат Результат;
	КонецПопытки;

	// определим количество листов
	Если ТаблицаДанных.Количество() > 65500 Тогда
		КоличествоЗаписей = ТаблицаДанных.Количество();
		ВсегоСтраниц =  Цел(КоличествоЗаписей/65500);
		Если ВсегоСтраниц = КоличествоЗаписей/65500  Тогда
			ВсегоСтраниц = ВсегоСтраниц;
		Иначе
			ВсегоСтраниц = ВсегоСтраниц + 1;
		КонецЕсли;
	Иначе
		ВсегоСтраниц = 1;
	КонецЕсли;
	
	// переходим на лист для заполнения данных.
	// Если вместо шаблона Excel была указана книга Excel, на этом этапе может возникнуть ошибка.
    Попытка
		РабочийЛистКниги = НоваяКнига.Sheets.Item(ИмяЛиста);
	Исключение
		
		ТекстСообщения = НСтр("ru = 'Возникла ошибка при обработке документа Excel. Проверьте правильность указания шаблона формы.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Возврат Результат;
	КонецПопытки;
	
	Если ВсегоСтраниц > 1 Тогда
		РабочийЛистКниги.Copy(,РабочийЛистКниги);
	КонецЕсли;
	
	НомерТекущейСтроки = НомерНачальнойСтрокиExcel;	     
	НомерПП = 0;
	КоличествоСтрок = ТаблицаДанных.Количество();
	ТекСтр = 1;
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
	
		НомерПП = НомерПП + 1;
		
		Если НомерПП > ТекСтр * 65500 Тогда
			ТекСтр = ТекСтр + 1;
			РабочийЛистКниги = НоваяКнига.Sheets.Item(ИмяЛиста + " (" + ТекСтр + ")");							
			НомерТекущейСтроки = НомерНачальнойСтрокиExcel;	     
			// проверим нужно ли еще добавлять листы
			Если ТекСтр < ВсегоСтраниц Тогда
				РабочийЛистКниги.Copy(,РабочийЛистКниги);
			КонецЕсли;
		КонецЕсли;
		Для Каждого КлючИЗначение Из СтруктураСоответствияПолей Цикл
			Если КлючИЗначение.Ключ = "НомерСтроки" 
			 ИЛИ КлючИЗначение.Ключ = "СтатусПоставщика"
			 ИЛИ КлючИЗначение.Ключ = "РННПоставщика"
			 ИЛИ КлючИЗначение.Ключ = "РННПокупателя"
			 ИЛИ КлючИЗначение.Ключ = "ИННБИНПоставщика" 
			 ИЛИ КлючИЗначение.Ключ = "ИННБИНПокупателя" 
			 ИЛИ КлючИЗначение.Ключ = "ИННПокупателя" 
			 ИЛИ КлючИЗначение.Ключ = "КПППокупателя" 
			 ИЛИ КлючИЗначение.Ключ = "УНППокупателя" 
			 ИЛИ КлючИЗначение.Ключ = "ВидОборота" 			 
			 ИЛИ КлючИЗначение.Ключ = "ВидСФЛев" 
			 ИЛИ КлючИЗначение.Ключ = "ВидСФПрав" 
			 ИЛИ КлючИЗначение.Ключ = "НомерСФ" Тогда
				РабочийЛистКниги.Cells(НомерТекущейСтроки,КлючИЗначение.Значение).NumberFormat = "@";  // текстовый формат
			КонецЕсли;
			
			Если КлючИЗначение.Ключ = "СтоимостьБезНДС"
			 ИЛИ КлючИЗначение.Ключ = "СуммаНДССФ" 
			 ИЛИ КлючИЗначение.Ключ = "СуммаНДСВЗачет"
			 ИЛИ КлючИЗначение.Ключ = "СуммаНДСНачисленного" Тогда
			 	РабочийЛистКниги.Cells(НомерТекущейСтроки,КлючИЗначение.Значение).NumberFormat = "0";  // числовой формат
			КонецЕсли;
			
			Если КлючИЗначение.Ключ = "ДатаСФ"
				ИЛИ КлючИЗначение.Ключ = "ДатаОборотаПоРеализации" Тогда
				РабочийЛистКниги.Cells(НомерТекущейСтроки,КлючИЗначение.Значение).NumberFormat = ""; // Формат даты Selection.NumberFormat = "m/d/yyyy"
			КонецЕсли;	
			
			Попытка
				РабочийЛистКниги.Cells(НомерТекущейСтроки,КлючИЗначение.Значение).Value = СтрокаТаблицы[КлючИЗначение.Ключ];
			Исключение
				ТекстСообщения = НСтр("ru = 'При выгрузке строки № %1 произошла ошибка. Строка выгружена частично...'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СокрЛП(НомерТекущейСтроки));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			КонецПопытки
		КонецЦикла;
	
		НомерТекущейСтроки = НомерТекущейСтроки + 1;
	КонецЦикла;

	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xls");
	НоваяКнига.SaveAs(ИмяВременногоФайла, 56);
	
	ТекстСообщения = НСтр("ru = 'Формирование книги Excel завершено.'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	ОбъектЭксель.Quit();
	ОбъектЭксель = Неопределено;
	
	//////////////////////////////////////////////////////////////////////////////
	// Сохранить результат.	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	Результат.АдресФайлаExcel = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
	Результат.АдресРеестраExcel = ПоместитьВоВременноеХранилище(Реестр, ЭтаФорма.УникальныйИдентификатор);
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат Результат;
	
КонецФункции// ВыгрузитьВExcel()

&НаСервере
Функция ПолучитьТаблицуДанныхРеестраExcel(ИмяФормы)
	Если ИмяФормы = "Форма300_07" Тогда
		Возврат Форма300_07ПолучитьТаблицуДанныхРеестраExcel(ИмяФормы);	
	ИначеЕсли ИмяФормы = "Форма300_08" Тогда
		Возврат Форма300_08ПолучитьТаблицуДанныхРеестраExcel(ИмяФормы);		
	КонецЕсли;	
КонецФункции	

&НаСервере
Функция ПолучитьСтруктуруСоответствияПолейРеестраExcel(ИмяФормы)
	Если ИмяФормы = "Форма300_07" Тогда
		Возврат Форма300_07ПолучитьСтруктуруСоответствияПолейРеестраExcel();
	ИначеЕсли ИмяФормы = "Форма300_08" Тогда
		Возврат Форма300_08ПолучитьСтруктуруСоответствияПолейРеестраExcel();
	КонецЕсли;	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруИтоговыхПолейРеестраExcel(ИмяФормы)
	Если ИмяФормы = "Форма300_07" Тогда
		Возврат Форма300_07ПолучитьСтруктуруИтоговыхПолейРеестраExcel();	
	ИначеЕсли ИмяФормы = "Форма300_08" Тогда
		Возврат Форма300_08ПолучитьСтруктуруИтоговыхПолейРеестраExcel();		
	КонецЕсли;	
КонецФункции

&НаСервере
Функция Форма300_07ПолучитьТаблицуДанныхРеестраExcel(ТекКодФормы)
	
	СтруктураФормы = Новый Структура;
	СтруктураФормы.Вставить("ЛистA", П0007100001);
	СтруктураФормы.Вставить("ЛистB", П0007200002);
	СтруктураФормы.Вставить("ЛистC", П0007300001);
	
	// Создание таблицы А, которая должна содержать свои колонки, а также колонки остальных таблиц.
	ТаблицаДанныхA = Новый ТаблицаЗначений;              
	ТаблицаДанныхA.Колонки.Добавить("НомерСтроки", , 		"Номер строки");
	ТаблицаДанныхA.Колонки.Добавить("СтатусПоставщика", , 	"Статус поставщика");
	ТаблицаДанныхA.Колонки.Добавить("ИННБИНПокупателя", , 	"ИИН (БИН) покупателя");
	
	ТаблицаДанныхA.Колонки.Добавить("НомерСФ", , 			"Номер счета-фактуры");
	ТаблицаДанныхA.Колонки.Добавить("ДатаСФ", , 			"Дата выписки счета - фактуры");	
	ТаблицаДанныхA.Колонки.Добавить("ВидСФПрав", , 			"Вид счета-фактуры");
	
	ТаблицаДанныхA.Колонки.Добавить("СтоимостьБезНДС", , 	"Всего стоимость по счету-фактуре без учета НДС");
	ТаблицаДанныхA.Колонки.Добавить("СуммаНДССФ", , 		"Сумма НДС, указанного в счете-фактуре");
	ТаблицаДанныхA.Колонки.Добавить("СуммаНДСНачисленного", , "Сумма начисленного НДС");
	
	ТаблицаДанныхA.Колонки.Добавить("ВидПолезногоИскопаемого", , 	"Вид полезного ископаемого");
	ТаблицаДанныхA.Колонки.Добавить("ОбъемПолезногоИскопаемого", ,  "Объем полезного ископаемого");
	ТаблицаДанныхA.Колонки.Добавить("ЕдиницаИзмерения", , 	        "Единица измерения");

	ТаблицаДанныхB = Новый ТаблицаЗначений;
	ТаблицаДанныхB.Колонки.Добавить("НомерСФ");
	ТаблицаДанныхB.Колонки.Добавить("ДатаСФ");
	ТаблицаДанныхB.Колонки.Добавить("ВидСФЛев");
	ТаблицаДанныхB.Колонки.Добавить("ВидСФПрав");
	
	ТаблицаДанныхC = Новый ТаблицаЗначений;
	ТаблицаДанныхC.Колонки.Добавить("СтоимостьБезНДС");
	ТаблицаДанныхC.Колонки.Добавить("СуммаНДССФ");
	ТаблицаДанныхC.Колонки.Добавить("СуммаНДСНачисленного");
	
	ТаблицаДанныхD = Новый ТаблицаЗначений;
	ТаблицаДанныхD.Колонки.Добавить("ВидПолезногоИскопаемого");
	ТаблицаДанныхD.Колонки.Добавить("ОбъемПолезногоИскопаемого");
	ТаблицаДанныхD.Колонки.Добавить("ЕдиницаИзмерения");	
	
	
	Для Каждого ЭлементСтруктуры Из СтруктураФормы Цикл
		ИмяГруппы 		   = ЭлементСтруктуры.Ключ;
		ТаблицаСтрокГруппы = ЭлементСтруктуры.Значение;
				
		Для Каждого Элемент Из ТаблицаСтрокГруппы Цикл
		
			Если ИмяГруппы = "ЛистA" Тогда
				
				НоваяСтрокаДанных = ТаблицаДанныхA.Добавить();	
			
				//Так должны заполнять по отдельности значения выборки 
				//для каждого листа
				НоваяСтрокаДанных.НомерСтроки 	   = Элемент.П000710000101;
				НоваяСтрокаДанных.СтатусПоставщика = Элемент.П000710000102;
				Если ЗначениеЗаполнено(Элемент.П000710000103) Тогда 
					НоваяСтрокаДанных.ИННБИНПокупателя = Элемент.П000710000103;
				КонецЕсли;
				
				НоваяСтрокаДанных.НомерСФ 		   = Элемент.П000710000104;
				Если ЗначениеЗаполнено(Элемент.П000710000105) Тогда
					НоваяСтрокаДанных.ДатаСФ	   = НачалоДня(Элемент.П000710000105);
				КонецЕсли;
												
				Если ЗначениеЗаполнено(Элемент.П000710000106) Тогда
					НоваяСтрокаДанных.ВидСФПрав	   = Элемент.П000710000106;
				КонецЕсли;
				
				
			ИначеЕсли ИмяГруппы = "ЛистB" Тогда

				НоваяСтрокаДанных = ТаблицаДанныхC.Добавить();	

				НоваяСтрокаДанных.СтоимостьБезНДС	   = Элемент.П000720000202;
				НоваяСтрокаДанных.СуммаНДССФ 		   = Элемент.П000720000203;
				НоваяСтрокаДанных.СуммаНДСНачисленного = Элемент.П000720000204;
				
			ИначеЕсли ИмяГруппы = "ЛистC" Тогда
				
				НоваяСтрокаДанных = ТаблицаДанныхD.Добавить();	

				НоваяСтрокаДанных.ВидПолезногоИскопаемого	= Элемент.П000730000102;
				НоваяСтрокаДанных.ОбъемПолезногоИскопаемого = Элемент.П000730000103;
				НоваяСтрокаДанных.ЕдиницаИзмерения          = Элемент.П000730000104;
				
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЦикла;
	
	// сводная таблица
	ТаблицаДанныхA.ЗагрузитьКолонку(ТаблицаДанныхB.ВыгрузитьКолонку("НомерСФ"), 		"НомерСФ");
	ТаблицаДанныхA.ЗагрузитьКолонку(ТаблицаДанныхB.ВыгрузитьКолонку("ДатаСФ"), 			"ДатаСФ");	
    ТаблицаДанныхA.ЗагрузитьКолонку(ТаблицаДанныхB.ВыгрузитьКолонку("ВидСФПрав"),		"ВидСФПрав");
    ТаблицаДанныхA.ЗагрузитьКолонку(ТаблицаДанныхC.ВыгрузитьКолонку("СтоимостьБезНДС"),	"СтоимостьБезНДС");
	ТаблицаДанныхA.ЗагрузитьКолонку(ТаблицаДанныхC.ВыгрузитьКолонку("СуммаНДССФ"), 		"СуммаНДССФ");
	ТаблицаДанныхA.ЗагрузитьКолонку(ТаблицаДанныхC.ВыгрузитьКолонку("СуммаНДСНачисленного"),"СуммаНДСНачисленного");
    ТаблицаДанныхA.ЗагрузитьКолонку(ТаблицаДанныхD.ВыгрузитьКолонку("ВидПолезногоИскопаемого"),	  "ВидПолезногоИскопаемого");
	ТаблицаДанныхA.ЗагрузитьКолонку(ТаблицаДанныхD.ВыгрузитьКолонку("ОбъемПолезногоИскопаемого"), "ОбъемПолезногоИскопаемого");
	ТаблицаДанныхA.ЗагрузитьКолонку(ТаблицаДанныхD.ВыгрузитьКолонку("ЕдиницаИзмерения"),          "ЕдиницаИзмерения");

	Возврат ТаблицаДанныхA;
	
КонецФункции

&НаСервере
Функция Форма300_07ПолучитьСтруктуруСоответствияПолейРеестраExcel()
	
	СтруктураСоответствияПолей = Новый Структура();	
	СтруктураСоответствияПолей.Вставить("НомерСтроки", 		1);
	СтруктураСоответствияПолей.Вставить("СтатусПоставщика", 2);
	СтруктураСоответствияПолей.Вставить("РННПокупателя", 	3);
	СтруктураСоответствияПолей.Вставить("ИННБИНПокупателя", 4);
	СтруктураСоответствияПолей.Вставить("НомерСФ", 			5);
	СтруктураСоответствияПолей.Вставить("ДатаСФ", 			6);
	СтруктураСоответствияПолей.Вставить("ВидСФПрав", 		7);
	СтруктураСоответствияПолей.Вставить("СтоимостьБезНДС", 	8);
	СтруктураСоответствияПолей.Вставить("СуммаНДССФ", 		9);
	СтруктураСоответствияПолей.Вставить("СуммаНДСНачисленного", 10);
	СтруктураСоответствияПолей.Вставить("ВидПолезногоИскопаемого", 	 11);
	СтруктураСоответствияПолей.Вставить("ОбъемПолезногоИскопаемого", 12);
	СтруктураСоответствияПолей.Вставить("ЕдиницаИзмерения",          13);
	
	Возврат СтруктураСоответствияПолей;
КонецФункции

&НаСервере
Функция Форма300_07ПолучитьСтруктуруИтоговыхПолейРеестраExcel()
	СтруктураИтоговыхПолей = Новый Структура;
	СтруктураИтоговыхПолей.Вставить("СтоимостьБезНДС", 		8);
	СтруктураИтоговыхПолей.Вставить("СуммаНДССФ", 			9);
	СтруктураИтоговыхПолей.Вставить("СуммаНДСНачисленного", 10);
	
	Возврат СтруктураИтоговыхПолей;
КонецФункции

&НаСервере
Функция Форма300_08ПолучитьТаблицуДанныхРеестраExcel(ТекКодФормы)	
	
	СтруктураФормы = Новый Структура;
	СтруктураФормы.Вставить("ЛистA", П0008100001);
	СтруктураФормы.Вставить("ЛистB", П0008200002);
	СтруктураФормы.Вставить("ЛистC", П0008300001);
	
	ТаблицаДанныхA = Новый ТаблицаЗначений;              	
	ТаблицаДанныхA.Колонки.Добавить("НомерСтроки",,               "Номер строки");
	ТаблицаДанныхA.Колонки.Добавить("СтатусПоставщика",,          "Статус поставщика");
	ТаблицаДанныхA.Колонки.Добавить("ИННБИНПоставщика",,          "ИИН (БИН) поставщика");
	ТаблицаДанныхA.Колонки.Добавить("НомерСФ",,                   "Номер счета-фактуры");
	ТаблицаДанныхA.Колонки.Добавить("ДатаСФ",,                    "Дата выписки счета - фактуры");	
	ТаблицаДанныхA.Колонки.Добавить("ВидСФПрав",,                 "Признак счета-фактуры");
	ТаблицаДанныхA.Колонки.Добавить("СтоимостьБезНДС",,           "Всего стоимость по счету-фактуре (документу)  без учета НДС");
	ТаблицаДанныхA.Колонки.Добавить("СуммаНДССФ",,                "Сумма НДС, указанного в счете-фактуре  (документе)");
	ТаблицаДанныхA.Колонки.Добавить("СуммаНДСВЗачет",,            "Сумма НДС, подлежащего отнесению в зачет");
	ТаблицаДанныхA.Колонки.Добавить("ВидПолезногоИскопаемого",,   "Вид полезного ископаемого");
	ТаблицаДанныхA.Колонки.Добавить("ОбъемПолезногоИскопаемого",, "Объем полезного ископаемого");
	ТаблицаДанныхA.Колонки.Добавить("ЕдиницаИзмерения",,          "Единицы измерения");
	
	ТаблицаДанныхB = Новый ТаблицаЗначений;
	ТаблицаДанныхB.Колонки.Добавить("НомерСФ");
	ТаблицаДанныхB.Колонки.Добавить("ДатаСФ");	
	ТаблицаДанныхB.Колонки.Добавить("ВидСФПрав");

	ТаблицаДанныхC = Новый ТаблицаЗначений;
	ТаблицаДанныхC.Колонки.Добавить("СтоимостьБезНДС");
	ТаблицаДанныхC.Колонки.Добавить("СуммаНДССФ");
	ТаблицаДанныхC.Колонки.Добавить("СуммаНДСВЗачет");
	
	ТаблицаДанныхD = Новый ТаблицаЗначений;
	ТаблицаДанныхD.Колонки.Добавить("ВидПолезногоИскопаемого");
	ТаблицаДанныхD.Колонки.Добавить("ОбъемПолезногоИскопаемого");
	ТаблицаДанныхD.Колонки.Добавить("ЕдиницаИзмерения");
		                            	
	Для Каждого ЭлементСтруктуры Из СтруктураФормы Цикл
		
		ИмяГруппы 	= ЭлементСтруктуры.Ключ;
		ТаблицаСтрокГруппы = ЭлементСтруктуры.Значение;
				
		Для Каждого Элемент Из ТаблицаСтрокГруппы Цикл
		
			Если ИмяГруппы = "ЛистA" Тогда
				
				НоваяСтрокаДанных = ТаблицаДанныхA.Добавить();	
			
				//Так должны заполнять по отдельности значения выборки 
				//для каждого листа
				НоваяСтрокаДанных.НомерСтроки 	   = Элемент.П000810000101;
				НоваяСтрокаДанных.СтатусПоставщика = Элемент.П000810000102;
				Если ЗначениеЗаполнено(Элемент.П000810000103) Тогда 
					НоваяСтрокаДанных.ИННБИНПоставщика = Элемент.П000810000103;
				КонецЕсли;
				
				НоваяСтрокаДанных.НомерСФ 		   = Элемент.П000810000104;
				Если ЗначениеЗаполнено(Элемент.П000810000105) Тогда
					НоваяСтрокаДанных.ДатаСФ	   = НачалоДня(Элемент.П000810000105);
				КонецЕсли;
				Если ЗначениеЗаполнено(Элемент.П000810000106) Тогда
					НоваяСтрокаДанных.ВидСФПрав	   = Элемент.П000810000106;
				КонецЕсли;
				
			ИначеЕсли ИмяГруппы = "ЛистB" Тогда

				НоваяСтрокаДанных = ТаблицаДанныхC.Добавить();	

				НоваяСтрокаДанных.СтоимостьБезНДС = Элемент.П000820000202;
				НоваяСтрокаДанных.СуммаНДССФ 	  = Элемент.П000820000203;
				НоваяСтрокаДанных.СуммаНДСВЗачет  = Элемент.П000820000204;
				
			ИначеЕсли ИмяГруппы = "ЛистC" Тогда
				
				НоваяСтрокаДанных = ТаблицаДанныхD.Добавить();	

				НоваяСтрокаДанных.ВидПолезногоИскопаемого	= Элемент.П000830000102;
				НоваяСтрокаДанных.ОбъемПолезногоИскопаемого = Элемент.П000830000103;
				НоваяСтрокаДанных.ЕдиницаИзмерения          = Элемент.П000830000104;
				
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЦикла;
	
	// сводная таблица
	ТаблицаДанныхA.ЗагрузитьКолонку(ТаблицаДанныхB.ВыгрузитьКолонку("НомерСФ"),                   "НомерСФ");
	ТаблицаДанныхA.ЗагрузитьКолонку(ТаблицаДанныхB.ВыгрузитьКолонку("ДатаСФ"),                    "ДатаСФ");	
    ТаблицаДанныхA.ЗагрузитьКолонку(ТаблицаДанныхB.ВыгрузитьКолонку("ВидСФПрав"),                 "ВидСФПрав");
	ТаблицаДанныхA.ЗагрузитьКолонку(ТаблицаДанныхC.ВыгрузитьКолонку("СтоимостьБезНДС"),           "СтоимостьБезНДС");
	ТаблицаДанныхA.ЗагрузитьКолонку(ТаблицаДанныхC.ВыгрузитьКолонку("СуммаНДССФ"),                "СуммаНДССФ");
	ТаблицаДанныхA.ЗагрузитьКолонку(ТаблицаДанныхC.ВыгрузитьКолонку("СуммаНДСВЗачет"),            "СуммаНДСВЗачет");
    ТаблицаДанныхA.ЗагрузитьКолонку(ТаблицаДанныхD.ВыгрузитьКолонку("ВидПолезногоИскопаемого"),	  "ВидПолезногоИскопаемого");
	ТаблицаДанныхA.ЗагрузитьКолонку(ТаблицаДанныхD.ВыгрузитьКолонку("ОбъемПолезногоИскопаемого"), "ОбъемПолезногоИскопаемого");
	ТаблицаДанныхA.ЗагрузитьКолонку(ТаблицаДанныхD.ВыгрузитьКолонку("ЕдиницаИзмерения"),          "ЕдиницаИзмерения");
	
	Возврат ТаблицаДанныхA
КонецФункции

&НаСервере
Функция Форма300_08ПолучитьСтруктуруСоответствияПолейРеестраExcel()
	
	СтруктураСоответствияПолей = Новый Структура();
	
	СтруктураСоответствияПолей.Вставить("НомерСтроки",                1);
	СтруктураСоответствияПолей.Вставить("СтатусПоставщика",           2);
	СтруктураСоответствияПолей.Вставить("РННПоставщика",              3);
	СтруктураСоответствияПолей.Вставить("ИННБИНПоставщика",           4);
	СтруктураСоответствияПолей.Вставить("НомерСФ",                    5);
	СтруктураСоответствияПолей.Вставить("ДатаСФ",                     6);	
	СтруктураСоответствияПолей.Вставить("ВидСФПрав",                  7);
	СтруктураСоответствияПолей.Вставить("СтоимостьБезНДС",            8);
	СтруктураСоответствияПолей.Вставить("СуммаНДССФ",                 9);
	СтруктураСоответствияПолей.Вставить("СуммаНДСВЗачет",            10);
	СтруктураСоответствияПолей.Вставить("ВидПолезногоИскопаемого", 	 11);
	СтруктураСоответствияПолей.Вставить("ОбъемПолезногоИскопаемого", 12);
	СтруктураСоответствияПолей.Вставить("ЕдиницаИзмерения",          13);

	
	Возврат СтруктураСоответствияПолей;
КонецФункции

&НаСервере
Функция Форма300_08ПолучитьСтруктуруИтоговыхПолейРеестраExcel()
	СтруктураИтоговыхПолей = Новый Структура;
	
	СтруктураИтоговыхПолей.Вставить("СтоимостьБезНДС", 8);
	СтруктураИтоговыхПолей.Вставить("СуммаНДССФ",      9);
	СтруктураИтоговыхПолей.Вставить("СуммаНДСВЗачет",  10);
	
	Возврат СтруктураИтоговыхПолей;
КонецФункции

#Если Не ВебКлиент Тогда
	
&НаКлиенте
Функция ВыгрузитьДанныеРеестраВExcelНаКлиенте(ИмяФормы, АдресФайлаШаблона, АдресРеестра, ИмяЛиста, НомерНачальнойСтрокиExcel, КоличествоЗаписей)

	Результат = Новый Структура("АдресФайлаExcel", Неопределено);
	
	Реестр = ПолучитьИзВременногоХранилища(АдресРеестра);
	
	// Сохраним шаблон во временный файл
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаШаблона);	
	ИмяВременногоШаблона = ПолучитьИмяВременногоФайла("xls");
	ДвоичныеДанные.Записать(ИмяВременногоШаблона);
	
	СтруктураСоответствияПолей = ПолучитьСтруктуруСоответствияПолейРеестраExcel(ИмяФормы);
	
	Попытка
		ОбъектЭксель = Новый COMОбъект("Excel.Application");
		ОбъектЭксель.ScreenUpdating = Ложь;
		ОбъектЭксель.EnableEvents = Ложь;
	Исключение		
		ТекстСообщения = НСтр("ru = 'Не удалось создать объект Excel.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);

		Возврат Результат;
	КонецПопытки;
	
	Попытка
		НоваяКнига = ОбъектЭксель.Workbooks.Add(ИмяВременногоШаблона);
	Исключение
		
		ТекстСообщения = НСтр("ru = 'Не удалось создать новый документ Excel, на основании указанного шаблона!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Возврат Результат;
	КонецПопытки;

	Если КоличествоЗаписей > 65500 Тогда
		ВсегоСтраниц =  Цел(КоличествоЗаписей/65500);
		Если ВсегоСтраниц = КоличествоЗаписей/65500  Тогда
			ВсегоСтраниц = ВсегоСтраниц;
		Иначе
			ВсегоСтраниц = ВсегоСтраниц + 1;
		КонецЕсли;
	Иначе
		ВсегоСтраниц = 1;
	КонецЕсли;
	
	// переходим на лист для заполнения данных.
	// Если вместо шаблона Excel была указана книга Excel, на этом этапе может возникнуть ошибка.
    Попытка
		РабочийЛистКниги = НоваяКнига.Sheets.Item(ИмяЛиста);
	Исключение
		
		ТекстСообщения = НСтр("ru = 'Возникла ошибка при обработке документа Excel. Проверьте правильность указания шаблона формы.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Возврат Результат;
	КонецПопытки;
	
	Если ВсегоСтраниц > 1 Тогда
		РабочийЛистКниги.Copy(,РабочийЛистКниги);
	КонецЕсли;
	
	НомерТекущейСтроки = НомерНачальнойСтрокиExcel;	     
	НомерПП = 0;
	КоличествоСтрок = КоличествоЗаписей;//ТаблицаДанныхДляВыгрузки.Количество();
	ТекСтр = 1;
	
	СтруктураСоответствияКолонок = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураСоответствияПолей Цикл
		Для НомерКолонки = 1 По СтруктураСоответствияПолей.Количество() Цикл
			ОбластьЗаголовок = Реестр.Область("R1C" + НомерКолонки);
			Если СокрЛП(ОбластьЗаголовок.Текст) = КлючИЗначение.Ключ Тогда
				СтруктураСоответствияКолонок.Вставить(КлючИЗначение.Ключ, НомерКолонки);
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЦикла;	
	
	Для НомерСтроки = 2 По КоличествоЗаписей+1 Цикл
		НомерПП = НомерПП + 1;
		
		Если НомерПП > ТекСтр * 65500 Тогда
			ТекСтр = ТекСтр + 1;
			РабочийЛистКниги = НоваяКнига.Sheets.Item(ИмяЛиста + " (" + ТекСтр + ")");							
			НомерТекущейСтроки = НомерНачальнойСтрокиExcel;	     
			// проверим нужно ли еще добавлять листы
			Если ТекСтр < ВсегоСтраниц Тогда
				РабочийЛистКниги.Copy(,РабочийЛистКниги);
			КонецЕсли;
		КонецЕсли;
		Для Каждого КлючИЗначение Из СтруктураСоответствияПолей Цикл
			Если КлючИЗначение.Ключ = "НомерСтроки" 
			 ИЛИ КлючИЗначение.Ключ = "СтатусПоставщика"
			 ИЛИ КлючИЗначение.Ключ = "РННПоставщика"
			 ИЛИ КлючИЗначение.Ключ = "РННПокупателя"
			 ИЛИ КлючИЗначение.Ключ = "ИННБИНПоставщика" 
			 ИЛИ КлючИЗначение.Ключ = "ИННБИНПокупателя" 
			 ИЛИ КлючИЗначение.Ключ = "ИННПокупателя" 
			 ИЛИ КлючИЗначение.Ключ = "КПППокупателя" 
			 ИЛИ КлючИЗначение.Ключ = "УНППокупателя" 
			 ИЛИ КлючИЗначение.Ключ = "ВидОборота" 			 
			 ИЛИ КлючИЗначение.Ключ = "ВидСФЛев" 
			 ИЛИ КлючИЗначение.Ключ = "ВидСФПрав" 
			 ИЛИ КлючИЗначение.Ключ = "НомерСФ" Тогда
				РабочийЛистКниги.Cells(НомерТекущейСтроки,КлючИЗначение.Значение).NumberFormat = "@";  // текстовый формат
			КонецЕсли;
			
			Если КлючИЗначение.Ключ = "СтоимостьБезНДС"
			 ИЛИ КлючИЗначение.Ключ = "СуммаНДССФ" 
			 ИЛИ КлючИЗначение.Ключ = "СуммаНДСВЗачет"
			 ИЛИ КлючИЗначение.Ключ = "СуммаНДСНачисленного" Тогда
			 	РабочийЛистКниги.Cells(НомерТекущейСтроки,КлючИЗначение.Значение).NumberFormat = "0";  // числовой формат
			КонецЕсли;
			
			Если КлючИЗначение.Ключ = "ДатаСФ"
				ИЛИ КлючИЗначение.Ключ = "ДатаОборотаПоРеализации" Тогда
				РабочийЛистКниги.Cells(НомерТекущейСтроки,КлючИЗначение.Значение).NumberFormat = ""; // Формат даты Selection.NumberFormat = "m/d/yyyy"
			КонецЕсли;	
			
			Попытка
				ТекстОбласти = Реестр.Область("R" + Формат(НомерСтроки,"ЧЦ=10; ЧГ=0") + "C" + СтруктураСоответствияКолонок[КлючИЗначение.Ключ]).Текст;
				Если (КлючИЗначение.Ключ = "СтоимостьБезНДС" 
					ИЛИ КлючИЗначение.Ключ = "СуммаНДССФ" 
				 	ИЛИ КлючИЗначение.Ключ = "СуммаНДСВЗачет"
				 	ИЛИ КлючИЗначение.Ключ = "СуммаНДСНачисленного") и ЗначениеЗаполнено(ТекстОбласти) Тогда
				 			ТекстОбласти = Число(ТекстОбласти);
				КонецЕсли;
				РабочийЛистКниги.Cells(НомерТекущейСтроки,КлючИЗначение.Значение).Value = ?(ТекстОбласти="", Неопределено, ТекстОбласти);			
			Исключение
				ТекстСообщения = НСтр("ru = 'При выгрузке строки № %1 произошла ошибка. Строка выгружена частично...'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СокрЛП(НомерТекущейСтроки));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			КонецПопытки
			
		КонецЦикла;
	
		НомерТекущейСтроки = НомерТекущейСтроки + 1;
	КонецЦикла;

	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xls");
	НоваяКнига.SaveAs(ИмяВременногоФайла, 56); //  XlExcel8 (Microsoft Office 97-2003)
	
	ТекстСообщения = НСтр("ru = 'Формирование книги Excel завершено.'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	ОбъектЭксель.Quit();
	ОбъектЭксель = Неопределено;
	
	//////////////////////////////////////////////////////////////////////////////
	// Сохранить результат.	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	Результат.АдресФайлаExcel = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
		
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат Результат;

КонецФункции	

#КонецЕсли

&НаКлиенте
Функция УниверсальнаяВыгрузка(ТекстВыгрузки = Неопределено, ПроверятьБлокировки = Истина, ИмяФайлаВыгрузки = "", ВыгружатьСОшибками = Ложь) Экспорт
	
	Перем ПараметрыВыгрузки;
	
	Если Модифицированность Тогда
		ТекстЗаголовка = ЗаголовокРегламентированногоОтчета(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
		
		ОргСтр = " (" + СтруктураРеквизитовФормы.Организация + ")";
		Если СтрНайти(ТекстЗаголовка, ОргСтр) = 0 Тогда
			ТекстЗаголовка = ТекстЗаголовка + ОргСтр;
		КонецЕсли;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Отчет """ + ТекстЗаголовка + """ не сохранен.";
		Сообщение.Сообщить();
		
		Возврат Ложь;
	КонецЕсли;
	
	ИмяФайлаВыгрузки = СформироватьИмяФайла();
	
	Если НЕ УниверсальнаяВыгрузкаXMLНаСервере(ТекстВыгрузки, ПараметрыВыгрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // УниверсальнаяВыгрузка()

&НаСервере
Функция СформироватьИмяФайла()
	
	Перем ПолученноеЗначение;
	
	ИмяФайлаXML = "Форма300_"+ Прав(Этаформа.ИмяФормы,7)+ "_" + СтрЗаменить(СтрЗаменить(Строка(ТекущаяДата())," ","_"),":","-") + ".xml";
	
	Возврат ИмяФайлаXML;
	
КонецФункции


&НаКлиенте
Функция ЗаголовокРегламентированногоОтчета(ДатаНач, ДатаКон, Периодичность = Неопределено) Экспорт
	
	СтрПериодОтчета = ПредставлениеПериода( НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета), КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ФП = Истина" );
	
	Если СтрНайти(ЭтаФорма.Заголовок, СтрПериодОтчета) = 0 Тогда
		Возврат ЭтаФорма.Заголовок + " за " + СтрПериодОтчета;
	Иначе
		Возврат ЭтаФорма.Заголовок;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция УниверсальнаяВыгрузкаXMLНаСервере(ТекстВыгрузки, ПараметрыВыгрузки)
	
	Префикс = Прав(СтруктураРеквизитовФормы.мВыбраннаяФорма,7);
	
	// запишем общие атрибуты (code, version) и создадим элемент form
	Запись = РегламентированнаяОтчетность.СоздатьНовыйПотокXML("UTF-8");
	
	// Запишем корневой элемент
	Запись.ЗаписатьНачалоЭлемента("fno");
	
	Попытка
		МакетВыгрузки = ЭтотОбъект.РеквизитФормыВЗначение("Отчет").ПолучитьМакет("СхемаВыгрузкиВXML");
	Исключение
		СообщениеТабл = ТаблицаСообщений.Добавить();
		СообщениеТабл.Описание = НСтр("ru = 'Отсутствует актуальный шаблон для выгрузки'");
	КонецПопытки;
	
	ТаблОбщиеРеквизиты = Новый ТаблицаЗначений;
	ТаблОбщиеРеквизиты.Колонки.Добавить("ИмяАтрибута");
	ТаблОбщиеРеквизиты.Колонки.Добавить("ЗначениеАтрибута");
	
	ОбластьОбщихРеквизитов = МакетВыгрузки.Область("ОбщиеРеквизиты" + Префикс);
	Для Ном = ОбластьОбщихРеквизитов.Верх По ОбластьОбщихРеквизитов.Низ Цикл
		Строка = ТаблОбщиеРеквизиты.Добавить();
		Строка.ИмяАтрибута		 = СокрП(МакетВыгрузки.Область(Ном, 1).Текст);
		Строка.ЗначениеАтрибута	 = СокрП(МакетВыгрузки.Область(Ном, 2).Текст);
	КонецЦикла;
	
	// Запишем атрибуты корневого элемента
	Для Каждого Строка Из ТаблОбщиеРеквизиты Цикл
		Запись.ЗаписатьАтрибут(Строка.ИмяАтрибута,Строка.ЗначениеАтрибута);
	КонецЦикла;
	
	// создадим таблицу для выгрузки
	ТаблицаВыгрузки = Новый ТаблицаЗначений;
	ТаблицаВыгрузки.Колонки.Добавить("Форма");
	ТаблицаВыгрузки.Колонки.Добавить("Страница");
	ТаблицаВыгрузки.Колонки.Добавить("ИмяАтрибута");
	ТаблицаВыгрузки.Колонки.Добавить("ИмяЯчейки");
	ТаблицаВыгрузки.Колонки.Добавить("КоличествоROW");
	ТаблицаВыгрузки.Колонки.Добавить("ИмяФормы");
	ТаблицаВыгрузки.Колонки.Добавить("ИмяЛиста");
	ТаблицаВыгрузки.Колонки.Добавить("Отображение");
	ТаблицаВыгрузки.Колонки.Добавить("ВыгружатьНулевыеЗначения");
	
	ТаблицаВыгрузки.Колонки.Добавить("КоличествоПодстрок");
	
	ТаблицаВыгрузки.Колонки.Добавить("КодФормы");
	ТаблицаВыгрузки.Колонки.Добавить("Выгружать");
	ТаблицаВыгрузки.Колонки.Добавить("Многострочность");
	ТаблицаВыгрузки.Колонки.Добавить("ЗаголовокФормы"); 
	ТаблицаВыгрузки.Колонки.Добавить("КоличествоНаЛисте");
	ТаблицаВыгрузки.Колонки.Добавить("Значение");    
	
	ОбластьВыгрузки = МакетВыгрузки.Область("Выгрузка" + Префикс);
	
	Для Ном = ОбластьВыгрузки.Верх По ОбластьВыгрузки.Низ Цикл
		
		Строка = ТаблицаВыгрузки.Добавить();
		Строка.Форма 	       			= СокрП(МакетВыгрузки.Область(Ном, 1).Текст);
		Строка.Страница        			= СокрП(МакетВыгрузки.Область(Ном, 2).Текст);
		Строка.ИмяАтрибута     			= СокрП(МакетВыгрузки.Область(Ном, 3).Текст);
		Строка.ИмяЯчейки      	 		= СокрП(МакетВыгрузки.Область(Ном, 4).Текст);
		Строка.КоличествоROW   			= СокрП(МакетВыгрузки.Область(Ном, 5).Текст);
		Строка.ИмяФормы        			= СокрП(МакетВыгрузки.Область(Ном, 6).Текст);
		Строка.ИмяЛиста        			= СокрП(МакетВыгрузки.Область(Ном, 7).Текст);
		Строка.Отображение     			= СокрП(МакетВыгрузки.Область(Ном, 8).Текст);
		
		Строка.ВыгружатьНулевыеЗначения = ?(СокрП(МакетВыгрузки.Область(Ном, 9).Текст) = "1", Истина, Ложь);
		
		МаксимальныйНормерПодстрокиЯчееки = 5;
		Если СокрП(МакетВыгрузки.Область(Ном, 10).Текст) = "x" Тогда
			Строка.КоличествоПодстрок =  МаксимальныйНормерПодстрокиЯчееки;
		Иначе	
			Строка.КоличествоПодстрок =  "";
		КонецЕсли;	
	КонецЦикла;
	
	// выгрузка в XML 
	КоличествоСтрокВТаблице = ТаблицаВыгрузки.Количество();
	НомерСтроки = 0;
	
	ТекущаяФорма = Неопределено;
	ТекущаяСтраница = Неопределено;
	
	Пока Истина Цикл
		
		Если НомерСтроки >= КоличествоСтрокВТаблице Тогда
			Прервать;
		КонецЕсли;
		
		Если Не ТекущаяФорма = ТаблицаВыгрузки[НомерСтроки].Форма Тогда
			
			ТекущаяФорма = ТаблицаВыгрузки[НомерСтроки].Форма;
			
			Если НомерСтроки > 0 Тогда 
				Запись.ЗаписатьКонецЭлемента();
			КонецЕсли;
			Запись.ЗаписатьНачалоЭлемента("form");
			Запись.ЗаписатьАтрибут("name", ТекущаяФорма);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТаблицаВыгрузки[НомерСтроки].КоличествоПодстрок) Тогда  // для обычных форм
			КоличествоПодстрок = Число(ТаблицаВыгрузки[НомерСтроки].КоличествоПодстрок);
			Для Н = 1 По КоличествоПодстрок Цикл
				ИмяАтрибута = ТаблицаВыгрузки[НомерСтроки].ИмяАтрибута;
				
				Если СтрНайти(ИмяАтрибута, "300_06_") = 0 Тогда
					ИмяАтрибута = СтрЗаменить(ИмяАтрибута, "n", Формат(Н,"ЧЦ=2; ЧВН="));
				Иначе
					ИмяАтрибута = СтрЗаменить(ИмяАтрибута, "n", Н);
				КонецЕсли;	
				
				Запись.ЗаписатьНачалоЭлемента("field");
				Запись.ЗаписатьАтрибут("name", ИмяАтрибута);
				
				ИмяЯчейки = ТаблицаВыгрузки[НомерСтроки].ИмяЯчейки;
				Если ЗначениеЗаполнено(ИмяЯчейки) Тогда
					ИмяЯчейки = СтрЗаменить(ИмяЯчейки, "n", Н);
					Значение = ОпределитьЗначениеПараметра(ЭтотОбъект[ТаблицаВыгрузки[НомерСтроки].ИмяФормы][ИмяЯчейки]);
				Иначе
					Значение = "";
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Значение) Тогда
					Запись.ЗаписатьТекст(Строка(Значение));
				КонецЕсли;
				Запись.ЗаписатьКонецЭлемента();
			КонецЦикла;	
		ИначеЕсли ТаблицаВыгрузки[НомерСтроки].КоличествоROW = "0" Тогда
			//Если не многострочная форма, просто добавляем значение реквизита
			Запись.ЗаписатьНачалоЭлемента("field");
			Запись.ЗаписатьАтрибут("name", ТаблицаВыгрузки[НомерСтроки].ИмяАтрибута);
			//Проверим есть ли возможность заполнить данный параметр
			Если ЗначениеЗаполнено(ТаблицаВыгрузки[НомерСтроки].ИмяЯчейки) Тогда
				
				Если ТаблицаВыгрузки[НомерСтроки].ИмяЯчейки = "КодВалюты" Тогда
					Запись.ЗаписатьТекст("KZT");
				Иначе
					//Получим и обработаем значение параметра и запишем его
					Если ТаблицаВыгрузки[НомерСтроки].ИмяЯчейки = "НомерСтраницы" Тогда
						Значение = "1";
					Иначе 
						Значение = ОпределитьЗначениеПараметра(ЭтотОбъект[ТаблицаВыгрузки[НомерСтроки].ИмяФормы][ТаблицаВыгрузки[НомерСтроки].ИмяЯчейки], ТаблицаВыгрузки[НомерСтроки].ИмяЯчейки);
					КонецЕсли;
					
					Если Не ЗначениеЗаполнено(Значение) И ТаблицаВыгрузки[НомерСтроки].ВыгружатьНулевыеЗначения Тогда
						Значение = "0";
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Значение) Тогда
						Запись.ЗаписатьТекст(Строка(Значение));
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
			Запись.ЗаписатьКонецЭлемента();
			
		Иначе
			
			//Определим состав колонок многострочной формы
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Форма", ТаблицаВыгрузки[НомерСтроки].Форма);
			СтруктураПоиска.Вставить("КоличествоROW", "99999");
			СтрокиТаблицы = ТаблицаВыгрузки.НайтиСтроки(СтруктураПоиска);
			
			//Проверям есть ли у нас вообще записи в многострочной форме
			ЕстьЗаписи = Ложь;
			Для Каждого Строка Из СтрокиТаблицы Цикл
				Если ЭтотОбъект[Строка.ИмяФормы].Количество() <> 0 И ЗначениеЗаполнено(ЭтотОбъект[Строка.ИмяФормы][0][Строка.ИмяЯчейки]) Тогда 
					ЕстьЗаписи = Истина;
				КонецЕсли;
			КонецЦикла;
			
			Если ЕстьЗаписи Тогда 
				
				Для Счетчик = 0 По ЭтотОбъект[ТаблицаВыгрузки[НомерСтроки].ИмяФормы].Количество() - 1 Цикл
					//Начинаем запись по строкам
					Запись.ЗаписатьНачалоЭлемента("row");
					//Номер строки всегда первая колонка
					ЭтоНомерСтроки = Истина;
					Для Каждого Строка Из СтрокиТаблицы Цикл
						//Записываем значения элементов строки
						Запись.ЗаписатьНачалоЭлемента("field");
						Запись.ЗаписатьАтрибут("name", Строка.ИмяАтрибута);
						Значение = ОпределитьЗначениеПараметра(ЭтотОбъект[Строка.ИмяФормы][Счетчик][Строка.ИмяЯчейки], , ЭтоНомерСтроки,Строка.ВыгружатьНулевыеЗначения);
						ЭтоНомерСтроки = Ложь;
						Запись.ЗаписатьТекст(Значение);
						Запись.ЗаписатьКонецЭлемента();
					КонецЦикла;
					
					Запись.ЗаписатьКонецЭлемента();
					
				КонецЦикла;
				
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + СтрокиТаблицы.Количество() - 1;
			
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	Запись.ЗаписатьКонецЭлемента();// </form> 
	Запись.ЗаписатьКонецЭлемента();// fno
	// получаем текст XML
	ТекстВыгрузки = Запись.Закрыть();
	
	// Заменить в именах элементов "form_300_09_0X" на "form_300_09".
	Для Индекс = 1 По 4 Цикл
		ТекстВыгрузки = СтрЗаменить(ТекстВыгрузки,"form_300_09_" + Формат(Индекс, "ЧЦ=2; ЧВН="),"form_300_09");
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // УниверсальнаяВыгрузкаXMLНаСервере()

&НаСервере
Функция ПроверитьПоказатели() Экспорт
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ОпределитьЗначениеПараметра(ЗначениеПараметра, ИмяАтрибута = Неопределено, НомерСтроки = Ложь,ВыгружатьНулевыеЗначения = Ложь)
	
	МассивОпций = Новый Массив;
	МассивОпций.Добавить("Пропорциональный");
	МассивОпций.Добавить("Раздельный");
	МассивОпций.Добавить("ПропорцИРаздел");
	МассивОпций.Добавить("Дополнительная");
	МассивОпций.Добавить("Ликвидационная");
	МассивОпций.Добавить("Первоначальная");
	МассивОпций.Добавить("ПоУведомлению");
	МассивОпций.Добавить("Очередная");
	МассивОпций.Добавить("Условие_B");
	МассивОпций.Добавить("Условие_A");
	МассивОпций.Добавить("ОтказОтВозврата");
	МассивОпций.Добавить("ИспользованиеКонтрольногоСчета");
	
	МассивОпций.Добавить("Приложение01");
	МассивОпций.Добавить("Приложение02");
	МассивОпций.Добавить("Приложение03");
	МассивОпций.Добавить("Приложение04");
	МассивОпций.Добавить("Приложение05");
	МассивОпций.Добавить("Приложение06");
	МассивОпций.Добавить("Приложение07");
	МассивОпций.Добавить("Приложение08");
	МассивОпций.Добавить("Приложение09");
	
	МассивОпций.Добавить("ВыпискаВЭлектронномВиде");
	МассивОпций.Добавить("ВыпискаНаБумажномНосителе");
	МассивОпций.Добавить("ПолучениеВЭлектронномВиде");
	МассивОпций.Добавить("ПолучениеНаБумажномНосителе");
	МассивОпций.Добавить("Условие_С2");
	МассивОпций.Добавить("Условие_С1");
	
	
	Если Не МассивОпций.Найти(ИмяАтрибута) = Неопределено Тогда
		Значение = ?(ЗначениеПараметра = "Х", Истина, Ложь);
	Иначе 
		Значение = ?(Не ЗначениеЗаполнено(ЗначениеПараметра) И НЕ ВыгружатьНулевыеЗначения, "", ЗначениеПараметра);
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Дата") Тогда
		Если Значение = Дата("00010101000000") Тогда 
			Значение = "";
		Иначе 
			Значение = Формат(Значение, "ДЛФ=Д");
		КонецЕсли;
	КонецЕсли;
	Если ТипЗнч(Значение) = Тип("Булево") Тогда 
		Значение = ?(Значение, "true", "");
	КонецЕсли;
	Если ТипЗнч(Значение) = Тип("Число") Тогда 
		Значение = Окр(Значение, 2);
		
		Если НомерСтроки Тогда
			Значение = Строка(Значение);
			ДлиннаНомера = СтрДлина(Значение);
			
			Для Счетчик = ДлиннаНомера По 7 Цикл 
				Значение = "0" + Значение;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат XMLСтрока(Значение);
	
КонецФункции

&НаКлиенте
Процедура Расшифровать(Команда)
	
	Попытка
		ИмяЯчейки = ЭтотОбъект.ТекущийЭлемент.ТекущаяОбласть.Имя;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Активизируйте нужную ячейку отчета для расшифровки.'"));
		Возврат;
	КонецПопытки;
	
	ЦветРасшифровки = Новый Цвет(225, 253, 253);
	Если ЭтотОбъект.ТекущийЭлемент.ТекущаяОбласть.ЦветФона = ЦветРасшифровки Тогда 
		ФормаРасшифровкаСКД(ИмяЯчейки);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Расшифровка данной ячейки не поддерживается.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекущуюСтраницу(Команда)
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьТекущийЭкземплярМногостраничногоРаздела" + Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекущийРаздел(Команда)
	//РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьТекущийРаздел" + Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтчет(Команда)
	
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьВесьОтчет");
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(ВыполняемоеОповещение = Неопределено) Экспорт
	
	РегламентированнаяОтчетностьКлиент.Очистить(ЭтаФорма, ВыполняемоеОповещение);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере() Экспорт
	
	СтруктураДанныхФорма300Страница1.Очистить();
	СтруктураДанныхФорма300Страница2.Очистить();
	СтруктураДанныхФорма300Страница3.Очистить();
	СтруктураДанныхФорма300_01Страница1.Очистить();
	СтруктураДанныхФорма300_02Страница1.Очистить();
	СтруктураДанныхФорма300_03Страница1.Очистить();
	СтруктураДанныхФорма300_03Страница2.Очистить();
	СтруктураДанныхФорма300_04Страница1.Очистить();
	СтруктураДанныхФорма300_05Страница1.Очистить();
	СтруктураДанныхФорма300_05Страница2.Очистить();
	СтруктураДанныхФорма300_05Страница3.Очистить();
	СтруктураДанныхФорма300_06Страница1.Очистить();
	СтруктураДанныхФорма300_07Страница1.Очистить();
	СтруктураДанныхФорма300_07Страница2.Очистить();
	СтруктураДанныхФорма300_07Страница3.Очистить();
	СтруктураДанныхФорма300_08Страница1.Очистить();
	СтруктураДанныхФорма300_08Страница2.Очистить();
	СтруктураДанныхФорма300_08Страница3.Очистить();
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	ОчиститьТабличноеПолеНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма300Страница1");
	
	НачальныеОперацииСМногострочнымиБлоками();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОчисткаРегламентированногоОтчетаНаСервере(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаСервере(ИмяСтраницы);
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаРегламентированногоОтчетаНаКлиенте(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаКлиенте(ИмяСтраницы);
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТабличноеПолеНаКлиенте(ВыбТабличноеПолеИмя) Экспорт
	
	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличноеПолеНаСервере(ВыбТабличноеПолеИмя) Экспорт
	
	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьТабличноеПоле(Форма, ВыбТабличноеПолеИмя)
    
    ВыбТабличноеПоле = Форма.ТабличныйДокумент;
    
    // Непосредственно очищаем ячейки табличного документа.
    Для Инд = 0 По ВыбТабличноеПоле.Области.Количество() - 1 Цикл
        ТекущаяОбласть = ВыбТабличноеПоле.Области[Инд];
        
        Если Не ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
            Продолжить;
        КонецЕсли;
        
        Если ТекущаяОбласть.СодержитЗначение <> Истина Тогда
            Продолжить;
        КонецЕсли;
        
        Если (СтрНайти(ТекущаяОбласть.Имя, "ИИН") > 0 ) 
            ИЛИ (СтрНайти(ТекущаяОбласть.Имя, "Год") > 0 ) Тогда
            Если ТекущаяОбласть.Защита Тогда
                Продолжить;
            КонецЕсли;
        КонецЕсли;
        
        Если ТипЗнч(ТекущаяОбласть.Значение) = Тип("Число") 
            И ТекущаяОбласть.Значение <> 0 Тогда
            ТекущаяОбласть.Очистить();
        КонецЕсли;
        
        Если ТекущаяОбласть.Защита Тогда
            Продолжить;
        КонецЕсли;
        
        ТекущаяОбласть.Очистить();
        
    КонецЦикла;
    
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
	ОткрытьФормуВыбораСтраниц("ВыбратьДляНастройки");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраниц(ВариантВыбора)
	Перем ТекущийРазделОтчетаСокрНаим;
	Перем НомерСтраницыРазделаОтчета;
	
	// Запоминаем текущий раздел, установленный в дереве разделов отчета.
	Если НЕ Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		ТекущийРазделОтчетаСокрНаим = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
		НомерСтраницыРазделаОтчета  = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	КонецЕсли;
	
	мПараметры = Новый Структура;
	мПараметры.Вставить("Автосохранение", Ложь);
	мПараметры.Вставить("мАвтоВыборКодов", Ложь);
	мПараметры.Вставить("ЗначенияИзСписка", Ложь);
	мПараметры.Вставить("ОтключитьАвтоРасчет", Ложь);
	мПараметры.Вставить("СчетчикСтраниц", Ложь);
	мПараметры.Вставить("ПараметрыОтображенияСумм", Ложь);
	мПараметры.Вставить("ИмеетсяРеквизитДеревоВыбранныхСтраниц", Истина);
	мПараметры.Вставить("Выгрузка", Истина);
	мПараметры.Вставить("ИмяОтчета", ИмяОтчета(ЭтаФорма.ИмяФормы));
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("мПараметры",                              мПараметры);
	
	ФормаНастройкиОтчета = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("НастройкиОтчета", ПараметрыФормы, ЭтаФорма);
	
	ПодготовитьДеревоСтраницДляНастройки();
	
	КопироватьДанныеФормы(мДеревоВыбранныхСтраниц, ФормаНастройкиОтчета.Дерево);
	
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
	
	ЗначениеЕдИзм       = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	ЗначениеЗпт         = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;
	
	ДополнительныеПараметры = Новый Структура("ЗначениеАвторасчета, ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим", , ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуВыбораСтраницЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ФормаНастройкиОтчета.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаНастройкиОтчета.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаНастройкиОтчета.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьДеревоСтраницДляНастройки()
	
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
	ДеревоСтраниц = РеквизитФормыВЗначение("мДеревоСтраницОтчета");
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300Страница1";
	СтрокаУровня1.Представление            = "Форма 300.00";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма300Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);

	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_01Страница1";
	СтрокаУровня1.Представление            = "Форма 300.01";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма300_01Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_02Страница1";
	СтрокаУровня1.Представление            = "Форма 300.02";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма300_02Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_03Страница1";
	СтрокаУровня1.Представление            = "Форма 300.03";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма300_03Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_04Страница1";
	СтрокаУровня1.Представление            = "Форма 300.04";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма300_04Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_05Страница1";
	СтрокаУровня1.Представление            = "Форма 300.05";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма300_05Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_06Страница1";
	СтрокаУровня1.Представление            = "Форма 300.06";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма300_06Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_07Страница1";
	СтрокаУровня1.Представление            = "Форма 300.07";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма300_07Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма300_08Страница1";
	СтрокаУровня1.Представление            = "Форма 300.08";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма300_08Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраницЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	//ЗначениеАвторасчета = ДополнительныеПараметры.ЗначениеАвторасчета;
	ЗначениеЕдИзм = ДополнительныеПараметры.ЗначениеЕдИзм;
	ЗначениеЗпт = ДополнительныеПараметры.ЗначениеЗпт;
	НомерСтраницыРазделаОтчета = ДополнительныеПараметры.НомерСтраницыРазделаОтчета;
	ТекущийРазделОтчетаСокрНаим = ДополнительныеПараметры.ТекущийРазделОтчетаСокрНаим;
	
	//СформироватьПодменюПечать(ЭтаФорма);
	Модифицированность = Истина;
	
	флЗначенияИдентичны = Истина;
	
	флЗначенияИдентичны = ПеренестиДанныеДереваСтраниц();
	
	Если НЕ флЗначенияИдентичны Тогда
		
		СформироватьДеревоРазделовОтчетаНаКлиенте();
		
		Если НЕ ТекущийРазделОтчетаСокрНаим = Неопределено Тогда
			
			// Пытаемся найти ранее запомненный раздел.
			НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(РазделыОтчета.ПолучитьЭлементы(), "КолонкаРазделыОтчетаСокрНаим", ТекущийРазделОтчетаСокрНаим);
			
			Если НЕ НайденнаяСтрока = Неопределено 
				И НЕ НомерСтраницыРазделаОтчета = Неопределено 
				И НайденнаяСтрока.ПолучитьЭлементы().Количество() > 0 Тогда
				
				НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(НайденнаяСтрока.ПолучитьЭлементы(), "КолонкаНомерСтраницыРазделаОтчета", НомерСтраницыРазделаОтчета);
				
			КонецЕсли;
			
			// В случае успешного поиска, устанавливаем курсор на найденный раздел.
			Если НЕ НайденнаяСтрока = Неопределено Тогда
				Элементы.РазделыОтчета.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПеренестиДанныеДереваСтраниц()
	
	флЗначенияИдентичны = Истина;
	
	ДеревоВыбСтраниц = РеквизитФормыВЗначение("мДеревоВыбранныхСтраниц");
	
	Для Каждого ЭлементДерева Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		
		Если  Сред(ЭлементДерева.Представление,13,1) = "_" Тогда
			Строка = ДеревоВыбСтраниц.Строки.Найти(Лев(ЭлементДерева.Представление,15),"Представление");
		Иначе
			Строка = ДеревоВыбСтраниц.Строки.Найти(Лев(ЭлементДерева.Представление,12),"Представление");
		КонецЕсли;
		
		Если ЭлементДерева.ПоказатьСтраницу <> ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1) Тогда
			
			флЗначенияИдентичны = Ложь;
			
		КонецЕсли;
		
		ЭлементДерева.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
		ЭлементДерева.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
		ЭлементДерева.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
		
	КонецЦикла;
	
	Возврат флЗначенияИдентичны;
	
КонецФункции

&НаКлиенте
Процедура Обновить(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПериодЗаполнения(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвто(Команда) Экспорт
	
	Отказ = Ложь;
	
	ОчиститьСообщения();
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоПредупредитьОСохранении", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередЗаполнениемРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоПредупредитьОСохранении(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоСохранениеОтчета", ЭтотОбъект, ДополнительныеПараметры);
	
	ТекстВопроса = НСтр("ru = 'Автоматическое заполнение приведет к сохранению отчета с новыми данными. Заполнить отчет?'");
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Заполнить", "Заполнить и сохранить");
	Кнопки.Добавить("НеЗаполнять", "Не заполнять");
	
	КнопкаПоУмолчанию = "НеЗаполнять";
	
	ЗаголовокВопроса = НСтр("ru = 'Автоматическое заполнение отчета'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , КнопкаПоУмолчанию, ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоСохранениеОтчета(ОтветПользователя, ДополнительныеПараметры) Экспорт
	
	Если ОтветПользователя <> "Заполнить" Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураРеквизитовФормы.УспешноеАвтозаполнение = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
	"ЗаполнитьАвтоПослеСохранениеОтчета", 
	ЭтотОбъект, 
	ДополнительныеПараметры); 
	
	СохранитьНаКлиенте(,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоПослеСохранениеОтчета(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаданиеВыполнено = ЗаполнитьАвтоНаСервере();
	
	Если ЗаданиеВыполнено Тогда
		СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
		
		РегламентированнаяОтчетностьКлиент.ОбновитьДеревоРазделовВФормеОтчета(ЭтаФорма);
		
		Если Элементы.РазделыОтчета.ТекущиеДанные <> Неопределено И НЕ Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
			Элементы.РазделыОтчета.ТекущаяСтрока = Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы()[0].ПолучитьИдентификатор();
		КонецЕсли;
		
		Если Элементы.Расшифровать.Видимость Тогда
			Элементы.Расшифровать.Доступность = Истина;
			//	Элементы.ТабличныйДокументКонтекстноеМенюРасшифровать.Доступность = Истина;
		КонецЕсли;
		
		//ЗапуститьПроверки();
		
	Иначе
		
		// Операция еще не завершена, выполняется с помощью фонового задания (асинхронно).
		ПараметрыОбработчикаОжидания = Новый Структура;
		ПараметрыОбработчикаОжидания.Вставить("МинимальныйИнтервал", 1);
		ПараметрыОбработчикаОжидания.Вставить("МаксимальныйИнтервал", 15);
		ПараметрыОбработчикаОжидания.Вставить("ТекущийИнтервал", 1);
		ПараметрыОбработчикаОжидания.Вставить("КоэффициентУвеличенияИнтервала", 1.4);
		
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		
		ФормаДлительнойОперации = ОткрытьФорму("ОбщаяФорма.ДлительнаяОперация", Новый Структура("ИдентификаторЗадания", СтруктураРеквизитовФормы.ИдентификаторЗадания), ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		
		Если ПроверитьВыполнениеЗадания() Тогда 
			
			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			
			СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
			
			РегламентированнаяОтчетностьКлиент.ОбновитьДеревоРазделовВФормеОтчета(ЭтаФорма);
			
			Если НЕ Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
				Элементы.РазделыОтчета.ТекущаяСтрока = Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы()[0].ПолучитьИдентификатор();
			КонецЕсли;
			
			Если Элементы.Расшифровать.Видимость Тогда
				Элементы.Расшифровать.Доступность = Истина;
				//Элементы.ТабличныйДокументКонтекстноеМенюРасшифровать.Доступность = Истина;
			КонецЕсли;
			
			//ЗапуститьПроверки();
			
			Возврат;
			
		КонецЕсли;
		
	Исключение
		
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение;
		
	КонецПопытки;
	
	ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.ТекущийИнтервал * ПараметрыОбработчикаОжидания.КоэффициентУвеличенияИнтервала;
	
	Если ПараметрыОбработчикаОжидания.ТекущийИнтервал > ПараметрыОбработчикаОжидания.МаксимальныйИнтервал Тогда
		ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.МаксимальныйИнтервал;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВыполнениеЗадания()
	
	Если ДлительныеОперации.ЗаданиеВыполнено(СтруктураРеквизитовФормы.ИдентификаторЗадания) Тогда 
		РегламентированнаяОтчетностьУПК.ФоновыеСообщенияПользователю(СтруктураРеквизитовФормы.ИдентификаторЗадания, ЭтаФорма.УникальныйИдентификатор);
		ЗагрузитьПодготовленныеДанные();
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗаполнитьАвтоНаСервере()
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	СтруктураРеквизитовФормы.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	СтруктураРеквизитовФормы.АдресВременногоХранилищаРасшифровки = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("Организация",              СтруктураРеквизитовФормы.Организация);
	ПараметрыОтчета.Вставить("ГруппаОрганизаций",        СтруктураРеквизитовФормы.ГруппаОрганизаций);
	ПараметрыОтчета.Вставить("мДатаНачалаПериодаОтчета", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	ПараметрыОтчета.Вставить("мДатаКонцаПериодаОтчета",  СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	ПараметрыОтчета.Вставить("УникальныйИдентификаторФормы", ЭтаФорма.УникальныйИдентификатор);
	ПараметрыОтчета.Вставить("АдресВоВременномХранилище", СтруктураРеквизитовФормы.АдресВоВременномХранилище);
	ПараметрыОтчета.Вставить("АдресВременногоХранилищаРасшифровки", СтруктураРеквизитовФормы.АдресВременногоХранилищаРасшифровки);
	ПараметрыОтчета.Вставить("Декларация", СтруктураРеквизитовФормы.мСохраненныйДок);
	ПараметрыОтчета.Вставить("МетодОтнесенияНДСВЗачет", СтруктураРеквизитовФормы.мМетодРасчета);
	
	Контейнер = Новый Структура();
	Контейнер.Вставить("Форма300Страница1", СтруктураДанныхФорма300Страница1);
	Контейнер.Вставить("Форма300Страница2", СтруктураДанныхФорма300Страница2);
	Контейнер.Вставить("Форма300Страница3", СтруктураДанныхФорма300Страница3);
	Контейнер.Вставить("Форма300_01Страница1", СтруктураДанныхФорма300_01Страница1);
	Контейнер.Вставить("Форма300_02Страница1", СтруктураДанныхФорма300_02Страница1);
	Контейнер.Вставить("Форма300_03Страница1", СтруктураДанныхФорма300_03Страница1);
	Контейнер.Вставить("Форма300_03Страница2", СтруктураДанныхФорма300_03Страница2);
	Контейнер.Вставить("Форма300_04Страница1", СтруктураДанныхФорма300_04Страница1);
	Контейнер.Вставить("Форма300_05Страница1", СтруктураДанныхФорма300_05Страница1);
    Контейнер.Вставить("Форма300_05Страница1_ДанныеДопСтрок", ДанныеФормыВЗначение(П0005100002, Тип("ТаблицаЗначений")));
    Контейнер.Вставить("Форма300_05Страница2", СтруктураДанныхФорма300_05Страница2);
	Контейнер.Вставить("Форма300_05Страница2_ДанныеДопСтрок", ДанныеФормыВЗначение(П0005200002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма300_05Страница3", СтруктураДанныхФорма300_05Страница3);
	Контейнер.Вставить("Форма300_05Страница3_ДанныеДопСтрок", ДанныеФормыВЗначение(П0005300002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма300_06Страница1", СтруктураДанныхФорма300_06Страница1);
	Контейнер.Вставить("Форма300_07Страница1", СтруктураДанныхФорма300_07Страница1);
	Контейнер.Вставить("Форма300_07Страница1_ДанныеДопСтрок", ДанныеФормыВЗначение(П0007100001, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма300_07Страница2", СтруктураДанныхФорма300_07Страница2);
	Контейнер.Вставить("Форма300_07Страница2_ДанныеДопСтрок", ДанныеФормыВЗначение(П0007200002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма300_07Страница3", СтруктураДанныхФорма300_07Страница3);
	Контейнер.Вставить("Форма300_07Страница3_ДанныеДопСтрок", ДанныеФормыВЗначение(П0007300001, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма300_08Страница1", СтруктураДанныхФорма300_08Страница1);
	Контейнер.Вставить("Форма300_08Страница1_ДанныеДопСтрок", ДанныеФормыВЗначение(П0008100001, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма300_08Страница2", СтруктураДанныхФорма300_08Страница2);
	Контейнер.Вставить("Форма300_08Страница2_ДанныеДопСтрок", ДанныеФормыВЗначение(П0008200002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма300_08Страница3", СтруктураДанныхФорма300_08Страница3);
	Контейнер.Вставить("Форма300_08Страница3_ДанныеДопСтрок", ДанныеФормыВЗначение(П0008300001, Тип("ТаблицаЗначений")));
	
	Контейнер.Вставить("ПолучениеЭлектронномВиде", Ложь);
	Контейнер.Вставить("ВыпискаВЭлектронномВиде", Ложь);

	ЗаданиеВыполнено = Ложь;
	
	НаименованиеЗадания = НСтр("ru = 'Автоматическое заполнение по данным информационной базы'");
	
	ПараметрыЗаполнения = Новый Массив;
	ПараметрыЗаполнения.Добавить(ИмяОтчета(ЭтаФорма.ИмяФормы));
	ПараметрыЗаполнения.Добавить(ИмяФормыОтчета(ЭтаФорма.ИмяФормы));
	ПараметрыЗаполнения.Добавить(ПараметрыОтчета);
	ПараметрыЗаполнения.Добавить(Контейнер);
	
	Если ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая Тогда
		ВремяОжидания = 4;
	Иначе
		ВремяОжидания = 2;
	КонецЕсли;
	
	Задание = ФоновыеЗадания.Выполнить("РегламентированнаяОтчетностьПереопределяемый.ЗаполнитьОтчет", ПараметрыЗаполнения, , НаименованиеЗадания);
	
	Попытка
		Задание.ОжидатьЗавершения(ВремяОжидания);
	Исключение
		// Специальная обработка не требуется. Предположительно, исключение вызвано истечением времени ожидания.
	КонецПопытки;
	
	СтруктураРеквизитовФормы.ИдентификаторЗадания = Задание.УникальныйИдентификатор;
	
	// Если операция уже завершилась, то сразу обрабатываем результат.
	Если ДлительныеОперации.ЗаданиеВыполнено(Задание.УникальныйИдентификатор) Тогда
		
		ЗаданиеВыполнено = Истина;
		
		РегламентированнаяОтчетностьУПК.ФоновыеСообщенияПользователю(Задание.УникальныйИдентификатор, ЭтаФорма.УникальныйИдентификатор);
		
		ЗагрузитьПодготовленныеДанные();
		
	КонецЕсли;
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма300Страница1");

	ЗаполнитьСведенияОбОрганизацииНаСервере();
	НачальныеОперацииСМногострочнымиБлоками();
	
	Модифицированность = Истина;

	Возврат ЗаданиеВыполнено;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()
	
	СтруктураРеквизитовФормы.УспешноеАвтозаполнение = Истина;
	СтруктураРеквизитовФормы.ВерсияАвтозаполнения = "2020кв2";
	
	Контейнер = ПолучитьИзВременногоХранилища(СтруктураРеквизитовФормы.АдресВоВременномХранилище);
	
	Если ТипЗнч(Контейнер) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ВыпискаВЭлектронномВиде = Ложь;
	ПолучениеЭлектронномВиде = Ложь;
	
	Для Каждого ЭлементСтруктуры Из Контейнер Цикл
		ИмяЭлемента = ЭлементСтруктуры.Ключ;
		
		Если ИмяЭлемента = "Форма300_07Страница1_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0007100001);
			
		ИначеЕсли ИмяЭлемента = "Форма300_05Страница1_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0005100002);
			
		ИначеЕсли ИмяЭлемента = "Форма300_05Страница2_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0005200002);
            
        ИначеЕсли ИмяЭлемента = "Форма300_05Страница3_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0005300002);
            
		ИначеЕсли ИмяЭлемента = "Форма300_07Страница2_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0007200002);
			
		ИначеЕсли ИмяЭлемента = "Форма300_07Страница3_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0007300001);
			
		ИначеЕсли ИмяЭлемента = "Форма300_08Страница1_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0008100001);
			
		ИначеЕсли ИмяЭлемента = "Форма300_08Страница2_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0008200002);
			
		ИначеЕсли ИмяЭлемента = "Форма300_08Страница3_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0008300001);
			
		ИначеЕсли ИмяЭлемента = "ВыпискаВЭлектронномВиде" Тогда
			ВыпискаВЭлектронномВиде = ЭлементСтруктуры.Значение;	
			
		ИначеЕсли ИмяЭлемента = "ПолучениеЭлектронномВиде" Тогда
			ПолучениеЭлектронномВиде = ЭлементСтруктуры.Значение;	
			
		ИначеЕсли ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ТаблицаЗначений") Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, ЭтаФорма["СтруктураДанных" + ИмяЭлемента]);
			
		Иначе
			ЭтаФорма["СтруктураДанных" + ИмяЭлемента] = ЭлементСтруктуры.Значение;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВывестиМакетВТаблДокНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	ВыпискаНаБумажномНосителе = ?(П0007100001.Количество() > 0, "Х", "");
	Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
		ТабличныйДокумент.Области.ВыпискаНаБумажномНосителе.Значение = ВыпискаНаБумажномНосителе;
	ИначеЕсли СтруктураДанныхФорма300Страница1.Свойство("ВыпискаНаБумажномНосителе") Тогда
		СтруктураДанныхФорма300Страница1.ВыпискаНаБумажномНосителе = ВыпискаНаБумажномНосителе;
	КонецЕсли;

	ПолучениеНаБумажномНосителе = ?(П0008100001.Количество() > 0, "Х", "");
	Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
		ТабличныйДокумент.Области.ПолучениеНаБумажномНосителе.Значение = ПолучениеНаБумажномНосителе;
	ИначеЕсли СтруктураДанныхФорма300Страница1.Свойство("ПолучениеНаБумажномНосителе") Тогда
		СтруктураДанныхФорма300Страница1.ПолучениеНаБумажномНосителе = ПолучениеНаБумажномНосителе;
	КонецЕсли;

	Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
		ТабличныйДокумент.Области.ВыпискаВЭлектронномВиде.Значение = ?(ВыпискаВЭлектронномВиде, "Х", "");
	ИначеЕсли СтруктураДанныхФорма300Страница1.Свойство("ВыпискаВЭлектронномВиде") Тогда
		СтруктураДанныхФорма300Страница1.ВыпискаВЭлектронномВиде = ?(ВыпискаВЭлектронномВиде, "Х", "");
	КонецЕсли;
	
	Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма300Страница1" Тогда
		ТабличныйДокумент.Области.ПолучениеВЭлектронномВиде.Значение = ?(ПолучениеЭлектронномВиде, "Х", "");
	ИначеЕсли СтруктураДанныхФорма300Страница1.Свойство("ПолучениеВЭлектронномВиде") Тогда
		СтруктураДанныхФорма300Страница1.ПолучениеВЭлектронномВиде = ?(ПолучениеЭлектронномВиде, "Х", "");
	КонецЕсли;
	
	// Форма300Страница2 чтобы данные были прочитаны из СтруктураДанныхФорма300Страница1, для совместимости с ручными изменениями
	РасчетНаСервере("Форма300Страница2", "ВыпискаНаБумажномНосителе");
	РасчетНаСервере("Форма300Страница2", "ПолучениеНаБумажномНосителе");
	РасчетНаСервере("Форма300Страница2", "ВыпискаВЭлектронномВиде");
	РасчетНаСервере("Форма300Страница2", "ПолучениеНаБумажномНосителе");
	
	РасчетНаСервере("Форма300_01Страница1", "");
	РасчетНаСервере("Форма300_02Страница1", "");
	РасчетНаСервере("Форма300_04Страница1", "");
	РасчетНаСервере("Форма300_05Страница1", "");
	РасчетНаСервере("Форма300_05Страница2", "");
	РасчетНаСервере("Форма300_05Страница3", "");
	РасчетНаСервере("Форма300_07Страница3", "");
	РасчетНаСервере("Форма300_08Страница3", "");
	РасчетНаСервере("Форма300_06Страница1", "");
		
	Модифицированность = Ложь;
	
	Сохранить();
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Если Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	Оповещение = Новый ОписаниеОповещения("ПослеСохраненияФормыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	СохранитьНаКлиенте(, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиенте(Автосохранение = Ложь, ВыполняемоеОповещение = Неопределено) Экспорт
	
	
	Вариант = СтруктураРеквизитовФормы.ВидДокумента;
	
	Если НЕ РегламентированнаяОтчетностьКлиент.ПриЗаписиРегламентированногоОтчетаНаКлиенте(ЭтаФорма, , Автосохранение, Вариант) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатСохранения = ПередСохранением();
	
	ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения);
	
КонецПроцедуры

&НаСервере
Функция ПередСохранением()
	
	Возврат Сохранить();
	
КонецФункции

&НаСервере
Функция Сохранить()
	
	Если НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.ПолучитьОбъект();
	КонецЕсли;
	
	Если НЕ РегламентированнаяОтчетность.ПриЗаписиРегламентированногоОтчетаНаСервере(ЭтаФорма, , ,СтруктураРеквизитовФормы.ВидДокумента, , СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ИсточникОтчета           = Метаданные.Отчеты[Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7)].Имя;
	СтруктураРеквизитовФормы.мСохраненныйДок.НаименованиеОтчета       = Метаданные.Отчеты[Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7)].ОсновнаяФорма.Синоним;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаНачала               = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаОкончания            = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.Периодичность            = СтруктураРеквизитовФормы.мПериодичность;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВыбраннаяФорма           = СтруктураРеквизитовФормы.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок.Организация              = СтруктураРеквизитовФормы.Организация;
	СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий              = Комментарий;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаПодписи              = ТекущаяДата(); 
	СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения         = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВидОтчетности            = Перечисления.ВидыОтчетности.РегламентированнаяОтчетность;
	СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий              = Комментарий;
	СтруктураРеквизитовФормы.мСохраненныйДок.КодНалоговогоОргана      = ?(СтруктураРеквизитовФормы.Налоговыйкомитет = Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка(),"",СтруктураРеквизитовФормы.Налоговыйкомитет.Код);
	СтруктураРеквизитовФормы.мСохраненныйДок.КПП                      = "";
	СтруктураРеквизитовФормы.мСохраненныйДок.Вид                      = СтруктураРеквизитовФормы.ВидДокумента;
	СтруктураРеквизитовФормы.мСохраненныйДок.ПредставлениеВида        = РегламентированнаяОтчетность.ПредставлениеВидаДокумента(СтруктураРеквизитовФормы.мСохраненныйДок.Вид);
	СтруктураРеквизитовФормы.мВариант                                 = СтруктураРеквизитовФормы.ВидДокумента;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ФорматВыгрузки = "Автоматически";
	//сохранение данных текущего раздела
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	// формируем данные редактируемых ячеек таблицы
	ПоказателиОтчета = Новый Структура();
	
	ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета);
	// формируем список сохранения
	СписокСохранения = Новый Структура();
	
	// вставляем данные редактируемых ячеек таблицы
	СписокСохранения.Вставить("ПоказателиОтчета", ПоказателиОтчета);
	СписокСохранения.Вставить("НалоговыйКомитет", СтруктураРеквизитовФормы.НалоговыйКомитет);
	
	ДанныеМногострочныхРазделов = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		
		ДанныеМногострочныхРазделов.Вставить(ЭлементСтруктуры.Ключ, ДанныеФормыВЗначение(ЭтаФорма[ЭлементСтруктуры.Значение], Тип("ТаблицаЗначений")));
		
	КонецЦикла;
	
	СписокСохранения.Вставить("ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов);
	
	ДанныеМногостраничныхРазделов = Новый Структура;
	
	МассивТиповНеопределено = Новый Массив; 
	МассивТиповНеопределено.Добавить(Тип("Неопределено"));
	ОписаниеТиповНеопределено = Новый ОписаниеТипов(МассивТиповНеопределено);
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногостраничныхРазделов Цикл
		ИмяРаздела = ЭлементСтруктуры.Ключ;
		ИмяСтруктурыДанных = ЭлементСтруктуры.Значение;
		ДанныеВТаблицеЗначений = СведенияМногостраничногоРазделаВТаблице(ИмяСтруктурыДанных);
		Если ДанныеВТаблицеЗначений <> Неопределено Тогда
			ДанныеМногостраничныхРазделов.Вставить(ИмяРаздела, ДанныеВТаблицеЗначений);
		КонецЕсли;
	КонецЦикла;
	
	ХранилищеДанных = Новый ХранилищеЗначения(СписокСохранения);
	СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета = ХранилищеДанных;
	
	Попытка
		СтруктураРеквизитовФормы.мСохраненныйДок.Записать();
	Исключение
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецПопытки;
	Модифицированность = Ложь;
	
	СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения)
	
	КлючУникальности = СтруктураРеквизитовФормы.мСохраненныйДок;
	
	Если РезультатСохранения Тогда
		
		РегламентированнаяОтчетностьКлиент.ПослеЗаписиРегламентированногоОтчета(ЭтаФорма);
		
		Если ВыполняемоеОповещение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ВыполняемоеОповещение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСохраненияФормыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.Форма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета)
	
	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		ПоказателиОтчета.Вставить(Префикс + Раздел.ИмяСтраницы, ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы]);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СведенияМногостраничногоРазделаВТаблице(ИмяСтруктурыДанных)
	
	ОписаниеТиповНеопределено = Новый ОписаниеТипов("Неопределено");
	
	ТаблицаЗначенийСДанными = ДанныеФормыВЗначение(ЭтаФорма[ИмяСтруктурыДанных], Тип("ТаблицаЗначений"));
	
	Если ТаблицаЗначенийСДанными <> Неопределено Тогда
		
		Если ТаблицаЗначенийСДанными.Колонки.Найти("Данные") <> Неопределено Тогда
			ТаблицаЗначенийСДанными.Колонки.Удалить("Данные");
			ТаблицаЗначенийСДанными.Колонки.Добавить("Данные", ОписаниеТиповНеопределено);
			
			Ном = 0;
			Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначенийСДанными Цикл
				СтрокаТаблицыЗначений.Данные = ЭтаФорма[ИмяСтруктурыДанных][Ном].Данные[0].Значение;
				Ном = Ном + 1;
			КонецЦикла;
		КонецЕсли;
		
		Если ТаблицаЗначенийСДанными.Колонки.Найти("ДанныеДопСтрок") <> Неопределено Тогда
			ТаблицаЗначенийСДанными.Колонки.Удалить("ДанныеДопСтрок");
			ТаблицаЗначенийСДанными.Колонки.Добавить("ДанныеДопСтрок", ОписаниеТиповНеопределено);
			
			Ном = 0;
			Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначенийСДанными Цикл
				
				Если ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок.Количество() > 0
					И ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок[0].Представление = "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела" Тогда
					СтрокаТаблицыЗначений.ДанныеДопСтрок = ДанныеФормыВЗначение(ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок[0].Значение, Тип("ТаблицаЗначений"));
					
					Ном = Ном + 1;
					Продолжить;
				КонецЕсли;
				
				СтруктураДанныхДопСтрок = Новый Структура;
				
				Для Каждого ЭлСтруктуры Из ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок Цикл
					СтруктураДанныхДопСтрок.Вставить(ДанныеФормыВЗначение(ЭлСтруктуры.Значение, Тип("ТаблицаЗначений")));
				КонецЦикла;
				
				СтрокаТаблицыЗначений.ДанныеДопСтрок = СтруктураДанныхДопСтрок;
				
				Ном = Ном + 1;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаЗначенийСДанными;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьБланк(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБланкЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Команда = ДополнительныеПараметры.Команда;
	
	ДополнительныеПараметрыПечати = Новый Структура;
	ДополнительныеПараметрыПечати.Вставить("ВидПечати", Команда.Имя);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПечатьЗавершение", ЭтотОбъект, ДополнительныеПараметрыПечати);
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
						
	Иначе
		
		СохранитьНаКлиенте(, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьСразу(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьСразуЗавершение (Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Команда = ДополнительныеПараметры.Команда;
	
	Если Команда <> Неопределено Тогда
		Печать(Команда.Имя);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(ВидПечати, НеИзФормыОтчета = Ложь) Экспорт
	
	Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1. Формируется печатная форма...'"), ЭтаФорма.Заголовок), , , БиблиотекаКартинок.Печать);
	
	Если СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки <> Неопределено И СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки Тогда
		РегламентированнаяОтчетностьКлиент.ПроверитьКонтрольныеСоотношения(ЭтаФорма, ОбработкаКС);
	КонецЕсли;
	
	Если НЕ ПечатьНаСервере(ВидПечати) Тогда
		Возврат;
	КонецЕсли;
	
	
	ОбщиеРеквизитыРазделов = Новый Структура;
	
	
	РегламентированнаяОтчетностьКлиент.ОткрытьФормуПредварительногоПросмотра(ЭтаФорма, ВидПечати, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере(ВидПечати)
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	Раздел = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	СтруктураРеквизитовФормы.мПечатныеФормы.Очистить();
	СтруктураРеквизитовФормы.мРежимПечати = Истина;
	
	Для Каждого ЭлеменетДерева Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		Если ЭлеменетДерева.ВыводНаПечать = 1 Тогда
			ВывестиМакетСтраницыВТабличныйДокументНаСервере(ЭлеменетДерева.ИмяСтраницы);
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("НаименованиеЛиста",  ЭлеменетДерева.Представление);
			СтруктураПараметров.Вставить("ОриентацияЛиста",    ЭлеменетДерева.ОриентацияСтраницы);
			СтруктураПараметров.Вставить("ИмяСтраницы",        ЭлеменетДерева.ИмяСтраницы);
			Структурапараметров.Вставить("ИмяОбластиТаблПоля", "ТабличныйДокумент");
			СтруктураПараметров.Вставить("ВидПечати",          ВидПечати);
			
			РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, СтруктураПараметров, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(Раздел);
	
	РегламентированнаяОтчетностьКлиентСервер.ПроставлениеНомеровЛистов(ЭтаФорма, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	РегламентированнаяОтчетностьКлиент.ПередЗакрытиемРегламентированногоОтчета(ЭтаФорма, Отказ, СтандартнаяОбработка,ЗавершениеРаботы, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПриЗакрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	РегламентированнаяОтчетность.ПриЗакрытииРегламентированногоОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Ячейка = Элемент.ТекущаяОбласть.Имя;	
	
	Если СтрНайти(Ячейка, "text__") <> 0 Тогда
		СтандартнаяОбработка = Ложь;
		
		ИмяРаздела = Сред(Ячейка,3,10);
		КодРаздела = Прав(ИмяРаздела, 3);
		Если КодРаздела = "010" ИЛИ  КодРаздела = "007" Тогда
			ИмяОбласти = "НДС_Зачет_" + ИмяРаздела;
		Иначе
			ИмяОбласти = "НДС_Реализация_" + ИмяРаздела;
		КонецЕсли;	
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИмяМакета"			  	, "КодыСтрокНалоговыхДеклараций");
		ПараметрыФормы.Вставить("ИмяСекции"			  	, ИмяОбласти);
		ПараметрыФормы.Вставить("ПолучатьПолныеДанные"	, Истина);
		ПараметрыФормы.Вставить("ТекущийКодСтроки"	  	, Элемент.ТекущаяОбласть.Значение);
		ПараметрыФормы.Вставить("ИмяЯчейки"	  			, Ячейка);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("Форма300ОбработкаВыбораЗначений", ЭтотОбъект, ПараметрыФормы);
		ОткрытьФорму("ОбщаяФорма.ФормаВыбораИзКлассификатора", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе	
	
		ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка);
		
		Если СтрЧислоВхождений(Область.Имя, "ДобавитьСтроку") > 0 Тогда
			ДобавитьСтроку("");
		ИначеЕсли СтрЧислоВхождений(Область.Имя, "УдалитьСтроку") > 0 И Область.Гиперссылка Тогда
			УдалитьСтроку("");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура  Форма300_06ОбработкаВыбораЗначенийНаСервере(Результат, ИмяЯчейки)
	
	ЭтотОбъект.ТабличныйДокумент.Области[ИмяЯчейки].Значение = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура  Форма300ОбработкаВыбораЗначений(Результат, ПараметрыВыбора) экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	Иначе
		ВыбранноеЗначение = Результат;
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда 
			ВыбранноеЗначение = ВыбранноеЗначение.Наименование;
		КонецЕсли;
	КонецЕсли;
	
	Форма300_06ОбработкаВыбораЗначенийНаСервере(ВыбранноеЗначение, ПараметрыВыбора.ИмяЯчейки); 	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка)
	Перем ЗначениеСвойства;
	//Если РегламентированнаяОтчетностьКлиент.ВыбраннаяОбластьРегламентированногоОтчетаНеВерна(ЭтаФорма, Область, СтандартнаяОбработка) Тогда
	//	Возврат;
	//КонецЕсли;
	Если (СтрНайти(Область.Имя, "R") >0)
		Или (СтрНайти(Область.Имя, "C") >0) Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	ИмяЯчейки = Область.Имя;
	
	Если (Найти(ИмяЯчейки, "Первоначальная") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Очередная") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Дополнительная") > 0)
		ИЛИ (Найти(ИмяЯчейки, "ПоУведомлению") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Ликвидационная") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Условие_A") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Условие_B") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Условие_С1") > 0) 
		ИЛИ (Найти(ИмяЯчейки, "Условие_С2") > 0) 
		ИЛИ (Найти(ИмяЯчейки, "ВыпискаНаБумажномНосителе") > 0) 
		ИЛИ (Найти(ИмяЯчейки, "ВыпискаВЭлектронномВиде") > 0) 
		ИЛИ (Найти(ИмяЯчейки, "ПолучениеНаБумажномНосителе") > 0) 
		ИЛИ (Найти(ИмяЯчейки, "ПолучениеВЭлектронномВиде") > 0) 
		ИЛИ (Найти(ИмяЯчейки, "Приложение01") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Приложение02") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Приложение03") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Приложение04") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Приложение05") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Приложение06") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Приложение07") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Приложение08") > 0) Тогда
		РасчетНаКлиенте("Форма300Страница1",ИмяЯчейки);
	КонецЕсли;
	
	Если (Найти(ИмяЯчейки, "ОтказОтВозврата") > 0) Тогда
		РасчетНаКлиенте("Форма300Страница3",ИмяЯчейки);
	КонецЕсли;		
	
	Если (Найти(ИмяЯчейки, "ИспользованиеКонтрольногоСчета") > 0) Тогда
		РасчетНаКлиенте("Форма300Страница3",ИмяЯчейки);
	КонецЕсли;		
	
	Если (Найти(ИмяЯчейки, "КодНалоговогоОргана") > 0) Тогда 
		
		ЗначенияОтборов = Новый Структура;
		ЗначенияОтборов.Вставить("Владелец", СтруктураРеквизитовФормы.Организация);
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", ЗначенияОтборов);
		ОповещениеВыбора = Новый ОписаниеОповещения("ПослеВыбораНалоговогоКомитета", ЭтаФорма);
		ОткрытьФорму("Справочник.РегистрацииВНалоговомОргане.Форма.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОповещениеВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
	Если СтруктураЯчеекСРасшифровкой.Свойство(Лев(ИмяЯчейки,11),ЗначениеСвойства)Тогда
		ИмяБезПрефикса = Лев(ИмяЯчейки,13);
		Если СтрНайти(ЗначениеСвойства,ИмяБезПрефикса) > 0  Тогда
			ОткрытьФормуРасшифровки(ИмяЯчейки,ИмяБезПрефикса,ИмяБезПрефикса <> ИмяЯчейки);
		КонецЕсли;
	КонецЕсли;
	
	
	//Если СтрНайти(ИмяЯчейки, "text__") <> 0 Тогда
	//	СтандартнаяОбработка = Ложь;
	//	
	//	ИмяРаздела = Сред(ИмяЯчейки,3,10);
	//	КодРаздела = Прав(ИмяРаздела, 3);
	//	Если КодРаздела = "001" Тогда
	//		ИмяОбласти = "НДС_Реализация_" + ИмяРаздела;
	//	Иначе
	//		ИмяОбласти = "НДС_Зачет_" + ИмяРаздела;
	//	КонецЕсли;	
	//	
	//	ПараметрыФормы = Новый Структура;
	//	ПараметрыФормы.Вставить("ИмяМакета"			  	, "КодыСтрокНалоговыхДеклараций");
	//	ПараметрыФормы.Вставить("ИмяСекции"			  	, ИмяОбласти);
	//	ПараметрыФормы.Вставить("ПолучатьПолныеДанные"	, Истина);
	//	ПараметрыФормы.Вставить("ТекущийКодСтроки"	  	, "");
	//	ПараметрыФормы.Вставить("ИмяЯчейки"	  			, ИмяЯчейки);
	//	
	//	
	//	ОписаниеОповещения = Новый ОписаниеОповещения("Форма300ОбработкаВыбораЗначений", ЭтотОбъект, ПараметрыФормы);
	//	//ОткрытьФорму("Отчет.РегламентированныйОтчет300Форма.Форма.ФормаВыбораИзКлассификатора", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//	ОткрытьФорму("ОбщаяФорма.ФормаВыбораИзКлассификатора", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//	
	//КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНалоговогоКомитета(ВыбЭлемент, Параметры) Экспорт
	
	ПоменялсяНалоговыйКомитет = Ложь;
	
	Если ЗначениеЗаполнено(ВыбЭлемент) Тогда
		ПоменялсяНалоговыйКомитет = НЕ(СтруктураРеквизитовФормы.НалоговыйКомитет = ВыбЭлемент);
		СтруктураРеквизитовФормы.НалоговыйКомитет = ВыбЭлемент;
	КонецЕсли;
	
	Если ПоменялсяНалоговыйКомитет Тогда
		ЗаполнитьСведенияОбОрганизацииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРасшифровки(ИмяЯчейки,ИмяБезПрефикса,Многострочность)
	
	Если Многострочность Тогда
		
		Позиция = СтрНайти(ИмяЯчейки,"_");
		Индекс = Число(СокрЛП(Прав(ИмяЯчейки,СтрДлина(ИмяЯчейки)- Позиция))) - 1;
		ИмяТаблицы = СокрЛП(Лев(ИмяЯчейки,11));
		
		Если Индекс < ЭтаФорма[ИмяТаблицы].Количество() Тогда
			ЗначениеРасшифровки = ЭтаФорма[ИмяТаблицы][Индекс][ИмяБезПрефикса + "_Расшифровка"];
		Иначе
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗначениеРасшифровки) Тогда
			ПоказатьЗначение(,ЗначениеРасшифровки);
		Иначе
			//Вход на ручной ввод ссылочных элементов
		КонецЕсли;
		
	Иначе
		
		//вход на обработку вывода ссылок не многострочных форм
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	#Если ВебКлиент Тогда
		ВставитьДополнительнуюСтрокуНаСервере();
	#Иначе
		ВставитьДополнительнуюСтрокуНаКлиенте();
	#КонецЕсли
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура ВставитьДополнительнуюСтрокуНаСервере()
	
	ВставитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьДополнительнуюСтрокуНаКлиенте()
	
	ВставитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВставитьДополнительнуюСтроку(Форма, ИмяГруппыБлока = Неопределено, СпециальноеДобавление = Ложь, ИмяКолонкиНомера = Неопределено) Экспорт
	
	Перем СтруктураГруппы;
	Перем МаксимальноеКоличествоСтрокГруппы;
	
	Если ИмяГруппыБлока = Неопределено Тогда
		// Сначала выполним проверку на активную страницу панели формы,
		// которая содержит многострочный раздел
		#Если НаКлиенте Тогда
			ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		#Иначе
			ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		#КонецЕсли
		
		Если ИмяГруппы = Неопределено Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Не выбран многострочный раздел, в который необходимо добавить строку.'");
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли;
		
	Иначе
		ИмяГруппы = ИмяГруппыБлока;
	КонецЕсли;
	
	// Исходное количество строк группы
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, МаксимальноеКоличествоСтрокГруппы);
	
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = Форма[СтруктураГруппы];
	
	// определяем последнюю строку многострочной группы
	КолСтрок = СтруктураГруппы.Количество();
	КолСтрокСтр = Формат(КолСтрок, "ЧГ=");
	
	
	ИмяПервойЯчейкиПоследнейСтроки = ИмяГруппы + "01_" + КолСтрокСтр;
	
	// область первой ячейки последней строки многострочного раздела
	ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяПервойЯчейкиПоследнейСтроки];
	
	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// номера строк исходной области
	НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;
	НомерНижнЯчейкиОбласти = ОбластьЯчейки.Верх + ВысотаСтроки - 1;
	
	СдвигСтрок = НомерНижнЯчейкиОбласти - НомерВерхЯчейкиОбласти + 1;
	
	// номера строк вставляемой области
	НомерВерхЯчейкиНовойОбласти = НомерВерхЯчейкиОбласти + СдвигСтрок;
	НомерНижнЯчейкиНовойОбласти = НомерНижнЯчейкиОбласти + СдвигСтрок;
	
	НазначитьИмяОбластиМЧ = Ложь;
	ВставляемаяОбласть = ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, );
	Если СтрНайти(ВставляемаяОбласть.Имя, "МногострочнаяЧасть") Тогда
		НазначитьИмяОбластиМЧ = Истина;
		ИмяМногострочнойЧасти = ВставляемаяОбласть.Имя;
	КонецЕсли;
	
	Если НЕ СпециальноеДобавление Тогда
		
		РегламентированнаяОтчетностьВызовСервера.ВставитьОбластьВТабличныйДокумент(ТекТабличноеПоле, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
		
		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
	КонецЕсли;
	
	Если НазначитьИмяОбластиМЧ Тогда
		ТекТабличноеПоле.Область(НомерНижнЯчейкиОбласти + 1, , НомерНижнЯчейкиОбласти + (НомерНижнЯчейкиОбласти - НомерВерхЯчейкиОбласти) + 1, ).Имя = "";
		ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, ).Имя = ИмяМногострочнойЧасти;
	КонецЕсли;
	
	КолСтрокСтр1 = Формат(КолСтрок + 1, "ЧГ=");
	
	Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
		
		ИмяКолонки = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
		
		
		// переопределяем имена вставленной области
		Если СтруктураГруппы[0].Свойство(ИмяКолонки) Тогда
			
			ИмяОбластиЯчейки    = ИмяКолонки + "_" + КолСтрокСтр;
			ИмяНовОбластиЯчейки = ИмяКолонки + "_" + КолСтрокСтр1;
			
			ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяОбластиЯчейки];
			ОбластьЯчейки.Имя = ИмяНовОбластиЯчейки;
			
			Если (НомерГрафы = 1) Тогда
				ТекТабличноеПоле.Области["УдалитьСтроку" + ИмяОбластиЯчейки].Имя = "УдалитьСтроку" + ИмяНовОбластиЯчейки;
			КонецЕсли;
			
			// определяем границы ячейки исходной области
			НомерВерхСтрокиЯчейки  = ОбластьЯчейки.Верх - СдвигСтрок;
			НомерНижнСтрокиЯчейки  = ОбластьЯчейки.Низ  - СдвигСтрок;
			НомерЛевоКолонкиЯчейки = ОбластьЯчейки.Лево;
			НомерПравКолонкиЯчейки = ОбластьЯчейки.Право;
			
			// Назначаем имя ячейки исходной области,
			// (т.к. в результате вставки новой области оно было очищено)
			ОбластьЯчейкиИсходнойОбласти = ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки, НомерНижнСтрокиЯчейки, НомерПравКолонкиЯчейки);
			ОбластьЯчейкиИсходнойОбласти.Имя = ИмяОбластиЯчейки;
			
			Если (НомерГрафы = 1) Тогда
				
				ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки - 1, НомерНижнСтрокиЯчейки, НомерЛевоКолонкиЯчейки - 1).Имя  = "УдалитьСтроку" + ИмяОбластиЯчейки;
				
			КонецЕсли;
			
			// очищаем значения ячеек вставленной области
			Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
				ОбластьЯчейки.Очистить();
			КонецЕсли;
			
			Если ИмяКолонкиНомера <> Неопределено Тогда
				Если ИмяКолонкиНомера = ИмяКолонки Тогда
					Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
						ОбластьЯчейки.Значение = КолСтрокСтр1;
					Иначе
						ОбластьЯчейки.Текст = КолСтрокСтр1;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИмяГруппыБлока = Неопределено Тогда
		
		
		ИмяТекущейОбласти = ИмяГруппы + "01_" + КолСтрокСтр1;
		
		Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];
		
		// установим фокус на поле табличн. документа
		ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
		
	КонецЕсли;
	
	// добавляем в структуру многострочной группы новую строку
	ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,Форма);
	
	//ПрописатьФункцию добавления по всем страницам приложения
	
	Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
		Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
			ОбластьТД.Гиперссылка = Истина;
			ОбластьТД.Текст = "х";
		КонецЕсли;
	КонецЦикла;
	
	Форма.Модифицированность = Истина;
	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	
	ТекТабличноеПоле = ЭтаФорма["ТабличныйДокумент"];
	
	ТекущаяОбласть = ТекТабличноеПоле.ТекущаяОбласть;
	
	ИмяГруппы = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(ЭтаФорма, ТекущаяОбласть);
	
	Если ИмяГруппы = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не выбрана удаляемая строка многострочного раздела.'");
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьСтрокуЗавершение", ЭтотОбъект);
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Удалить выбранную строку?'"), Символы.ПС);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	#Если ВебКлиент Тогда
		УдалитьДополнительнуюСтрокуНаСервере();
	#Иначе
		УдалитьДополнительнуюСтрокуНаКлиенте();
	#КонецЕсли
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДополнительнуюСтрокуНаСервере()
	
	УдалитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДополнительнуюСтрокуНаКлиенте()
	
	УдалитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьДополнительнуюСтроку(Форма, СпециальноеДобавление = Ложь, ИмяКолонкиНомера = Неопределено) Экспорт
	
	Перем ИсходноеКоличествоСтрокГруппы;
	Перем СтруктураГруппы;
	
	ТекущаяСтраница = Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	ТекТабличноеПоле = Форма.ТабличныйДокумент;
	
	ТекущаяОбласть = Форма.Элементы["ТабличныйДокумент"].ТекущаяОбласть;
	
	#Если НаКлиенте ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		ИмяГруппы = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(Форма, ТекущаяОбласть);
	#Иначе
		ИмяГруппы = РегламентированнаяОтчетностьВызовСервера.РазделТекущейОбластиНаСервере(Форма, ТекущаяОбласть);
	#КонецЕсли
	
	// исходное количество строк группы
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
	
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = Форма[СтруктураГруппы];
	
	// Выполним также проверку вхождения текущей (выделенной) ячейки в многострочный раздел
	ТекущаяОбласть = Форма.Элементы["ТабличныйДокумент"].ТекущаяОбласть;
	
	ИмяЯчейки = ТекущаяОбласть.Имя;
	
	// номер строки многострочного раздела определим
	// по имени выделенной ячейки
	НомУдаляемойСтроки = Число(Сред(ИмяЯчейки, СтрНайти(ИмяЯчейки, "_") + 1));
	НомерСтрокиТаблицы = НомУдаляемойСтроки - 1; // нумерация строк в таблице значений начинается с нуля
	
	Если СтруктураГруппы.Количество() > ИсходноеКоличествоСтрокГруппы Тогда
		
		ИмяПервойЯчейкиУдаляемойСтроки = "УдалитьСтроку" + ИмяГруппы + "01_" + Формат(НомУдаляемойСтроки, "ЧГ=0");
		
		// область первой ячейки удаляемой строки многострочного раздела
		ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяПервойЯчейкиУдаляемойСтроки];
		
		НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
		ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
		
		НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;
		НомерНижнЯчейкиОбласти = ОбластьЯчейки.Верх + ВысотаСтроки - 1;
		
		МногострочностьВРазделе = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе");
		МногострочностьВРазделеТип = ТипЗнч(МногострочностьВРазделе);
		Если МногострочностьВРазделеТип = Тип("Число") Тогда
			ИмяОбластиМнгЧ = "МногострочнаяЧасть";
		ИначеЕсли МногострочностьВРазделеТип = Тип("ДанныеФормыКоллекция") Тогда
			ИмяОбластиМнгЧ = МногострочностьВРазделе.НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0].Область;
		КонецЕсли;
		// Найдем координаты области, для последующего восстановления.
		
		Если ТекТабличноеПоле.Области.Найти(ИмяОбластиМнгЧ) <> Неопределено Тогда
			ОбластьВерх = ТекТабличноеПоле.Области[ИмяОбластиМнгЧ].Верх;
			ОбластьНиз = ТекТабличноеПоле.Области[ИмяОбластиМнгЧ].Низ;
		КонецЕсли;
		
		Если СпециальноеДобавление Тогда
			
		Иначе
			
			РегламентированнаяОтчетностьВызовСервера.УдалитьОбластьИзТабличногоДокумента(ТекТабличноеПоле, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
			
			Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
			
		КонецЕсли;
		// Восстановим область.
		ТекТабличноеПоле.Область(ОбластьВерх, 0, ОбластьНиз, 0).Имя = ИмяОбластиМнгЧ;
		
		КолвоСдвигаемыхСтрок = СтруктураГруппы.Количество() - НомУдаляемойСтроки;
		
		// обновим имена ячеек сдвинутых строк
		Если КолвоСдвигаемыхСтрок > 0 Тогда
			
			Для НСтр = НомУдаляемойСтроки + 1 По СтруктураГруппы.Количество() Цикл
				
				ТекСтрока = СтруктураГруппы[НСтр - 1];
				
				НСтрСтр = Формат(НСтр, "ЧГ=0");
				НСтрСтр1 = Формат(НСтр - 1, "ЧГ=0");
				
				Для НомерГрафы = 0 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
					
					Если НомерГрафы = 0 Тогда
						
						КолонкаИмя = "УдалитьСтроку" + ИмяГруппы + Формат( 1, "ЧЦ=2; ЧВН=");
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ИмяКолонкиНомера <> Неопределено Тогда
							Если ИмяКолонкиНомера = КолонкаИмя Тогда
								// обновляем порядковый номер строки
								
								СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
								НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
								ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер;
								
								// обновляем значение элемента таблицы значений
								ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
					КолонкаИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
					
					Если СтруктураГруппы[0].Свойство(КолонкаИмя) Тогда
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ИмяКолонкиНомера <> Неопределено Тогда
							Если ИмяКолонкиНомера = КолонкаИмя Тогда
								// обновляем порядковый номер строки
								
								СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
								НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
								ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер;
								
								// обновляем значение элемента таблицы значений
								ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
		КонецЕсли;
		// обновляем структуру многострочного раздела
		
		//Процедура удаления по всем страницам приложения
		УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма);
		
	Иначе
		// строка не удаляется в форме табличного документа,
		// а должна осуществляться сдвиг строк
		
		// обновляем структуру многострочного раздела
		// методом удаления выбранной строки и добавления пустой строки
		
		//Процедура удаления по всем страницам приложения
		УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма);
		
		//Процедура удаления по всем страницам приложения
		ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,Форма);
		
		// обновляем порядковые номера строк, выводимых в табличный документ
		Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
			
			НомерСтрокиВТаблице = СтруктураГруппы.Индекс(СтрокаТаблицы);
			НомерСтрокиВФормеТаблицы = Формат(НомерСтрокиВТаблице + 1, "ЧГ=0");
			
			Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
				
				КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
				
				Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
					
					Если ИмяКолонкиНомера <> Неопределено Тогда
						Если ИмяКолонкиНомера = КолонкаТаблицыИмя Тогда
							// обновляем порядковый номер строки
							СтрокаТаблицы[КолонкаТаблицыИмя] = НомерСтрокиВФормеТаблицы;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;	
				
			КонецЦикла;
			
		КонецЦикла;
		
		// Данные в многострочном блоке обновляются в декларациях!
		// Форма.ОбновитьСтруктуруМногострочногоРаздела(ИмяГруппы);
		// Обновляем экранную форму табличного документа
		#Если НаКлиенте Тогда
			Форма.ВывестиРазделВТабличныйДокументНаКлиенте(ИмяГруппы, СтруктураГруппы);
		#Иначе
			Форма.ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппы, СтруктураГруппы);
		#КонецЕсли
		
	КонецЕсли;
	
	// назначим текущей областью таблицы первую редактируемую ячейку
	// удаленной строки, если ее порядковый номер меньше кол-ва строк
	// многострочного раздела, или последней строки раздела в противном случае
	
	// определяем текущую область таблицы
	НомТекущейСтроки = Мин(НомУдаляемойСтроки, СтруктураГруппы.Количество());
	
	ИмяТекущейОбласти = "УдалитьСтроку" + ИмяГруппы + "01_" + Формат(НомТекущейСтроки, "ЧГ=0");
	
	Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];
	
	// установим фокус на поле табличн. документа
	ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
	
	ЕстьДопСтроки = Ложь;
	
	Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
		Если СтрЧислоВхождений(ОбластьТД.Имя, "_2") > 0 Тогда
			ЕстьДопСтроки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьДопСтроки Тогда
		Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
			Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
				ОбластьТД.Гиперссылка = Ложь;
				ОбластьТД.Текст = "";
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Форма.Модифицированность = Истина;
	
	#Если НаКлиенте Тогда
		Форма.РасчетНаКлиенте(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	#Иначе
		Форма.РасчетНаСервере(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы31", СтруктураРеквизитовФормы.мИдГруппы31);
	ИдГрупп.Вставить("мИдГруппы32", СтруктураРеквизитовФормы.мИдГруппы32);
    ИдГрупп.Вставить("мИдГруппы51", СтруктураРеквизитовФормы.мИдГруппы51);
    ИдГрупп.Вставить("мИдГруппы52", СтруктураРеквизитовФормы.мИдГруппы52);
	ИдГрупп.Вставить("мИдГруппы53", СтруктураРеквизитовФормы.мИдГруппы53);
	ИдГрупп.Вставить("мИдГруппы71", СтруктураРеквизитовФормы.мИдГруппы71);
	ИдГрупп.Вставить("мИдГруппы72", СтруктураРеквизитовФормы.мИдГруппы72);
	ИдГрупп.Вставить("мИдГруппы73", СтруктураРеквизитовФормы.мИдГруппы73);
	ИдГрупп.Вставить("мИдГруппы81", СтруктураРеквизитовФормы.мИдГруппы81);
	ИдГрупп.Вставить("мИдГруппы82", СтруктураРеквизитовФормы.мИдГруппы82);
	ИдГрупп.Вставить("мИдГруппы83", СтруктураРеквизитовФормы.мИдГруппы83);
	ИдГрупп.Вставить("мИдГруппы911", СтруктураРеквизитовФормы.мИдГруппы911);
	ИдГрупп.Вставить("мИдГруппы912", СтруктураРеквизитовФормы.мИдГруппы912);
	ИдГрупп.Вставить("мИдГруппы913", СтруктураРеквизитовФормы.мИдГруппы913);
	ИдГрупп.Вставить("мИдГруппы921", СтруктураРеквизитовФормы.мИдГруппы921);
	ИдГрупп.Вставить("мИдГруппы922", СтруктураРеквизитовФормы.мИдГруппы922);
	ИдГрупп.Вставить("мИдГруппы923", СтруктураРеквизитовФормы.мИдГруппы923);
	ИдГрупп.Вставить("мИдГруппы931", СтруктураРеквизитовФормы.мИдГруппы931);
	ИдГрупп.Вставить("мИдГруппы932", СтруктураРеквизитовФормы.мИдГруппы932);
	ИдГрупп.Вставить("мИдГруппы933", СтруктураРеквизитовФормы.мИдГруппы933);
	ИдГрупп.Вставить("мИдГруппы941", СтруктураРеквизитовФормы.мИдГруппы941);
	ИдГрупп.Вставить("мИдГруппы942", СтруктураРеквизитовФормы.мИдГруппы942);
	ИдГрупп.Вставить("мИдГруппы943", СтруктураРеквизитовФормы.мИдГруппы943);
	
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста, , ИдГрупп);
	
КонецФункции

&НаКлиенте
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы31", СтруктураРеквизитовФормы.мИдГруппы31);
	ИдГрупп.Вставить("мИдГруппы32", СтруктураРеквизитовФормы.мИдГруппы32);
    ИдГрупп.Вставить("мИдГруппы51", СтруктураРеквизитовФормы.мИдГруппы51);
    ИдГрупп.Вставить("мИдГруппы52", СтруктураРеквизитовФормы.мИдГруппы52);
	ИдГрупп.Вставить("мИдГруппы53", СтруктураРеквизитовФормы.мИдГруппы53);
	ИдГрупп.Вставить("мИдГруппы71", СтруктураРеквизитовФормы.мИдГруппы71);
	ИдГрупп.Вставить("мИдГруппы72", СтруктураРеквизитовФормы.мИдГруппы72);
	ИдГрупп.Вставить("мИдГруппы73", СтруктураРеквизитовФормы.мИдГруппы73);
	ИдГрупп.Вставить("мИдГруппы81", СтруктураРеквизитовФормы.мИдГруппы81);
	ИдГрупп.Вставить("мИдГруппы82", СтруктураРеквизитовФормы.мИдГруппы82);
	ИдГрупп.Вставить("мИдГруппы83", СтруктураРеквизитовФормы.мИдГруппы83);
	ИдГрупп.Вставить("мИдГруппы911", СтруктураРеквизитовФормы.мИдГруппы911);
	ИдГрупп.Вставить("мИдГруппы912", СтруктураРеквизитовФормы.мИдГруппы912);
	ИдГрупп.Вставить("мИдГруппы913", СтруктураРеквизитовФормы.мИдГруппы913);
	ИдГрупп.Вставить("мИдГруппы921", СтруктураРеквизитовФормы.мИдГруппы921);
	ИдГрупп.Вставить("мИдГруппы922", СтруктураРеквизитовФормы.мИдГруппы922);
	ИдГрупп.Вставить("мИдГруппы923", СтруктураРеквизитовФормы.мИдГруппы923);
	ИдГрупп.Вставить("мИдГруппы931", СтруктураРеквизитовФормы.мИдГруппы931);
	ИдГрупп.Вставить("мИдГруппы932", СтруктураРеквизитовФормы.мИдГруппы932);
	ИдГрупп.Вставить("мИдГруппы933", СтруктураРеквизитовФормы.мИдГруппы933);
	ИдГрупп.Вставить("мИдГруппы941", СтруктураРеквизитовФормы.мИдГруппы941);
	ИдГрупп.Вставить("мИдГруппы942", СтруктураРеквизитовФормы.мИдГруппы942);
	ИдГрупп.Вставить("мИдГруппы943", СтруктураРеквизитовФормы.мИдГруппы943);
	
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста, , ИдГрупп);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста = Неопределено, ТекущаяСтраница, ИдГрупп)
	
	Перем ИмяГруппы;
	
	Если ИмяЛиста = Неопределено Тогда
		ИмяТекущейСтраницыПанели = ТекущаяСтраница.Имя;
	Иначе
		ИмяТекущейСтраницыПанели = ИмяЛиста;
	КонецЕсли;
	
	Если ИмяТекущейСтраницыПанели = "Форма300_03Страница1" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы31;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_03Страница2" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы32;
    ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_05Страница1" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы51;    
    ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_05Страница2" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы52;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_05Страница3" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы53;
	ИначеЕсли ИмяТекущейСтраницыПанели = "Форма300_07Страница1" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы71;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_07Страница2" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы72;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_07Страница3" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы73;
	ИначеЕсли ИмяТекущейСтраницыПанели = "Форма300_08Страница1" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы81;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_08Страница2" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы82;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма300_08Страница3" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы83;
	КонецЕсли;
	
	Возврат ИмяГруппы;
	
КонецФункции

&НаКлиенте
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы31", СтруктураРеквизитовФормы.мИдГруппы31);
	ИдГрупп.Вставить("мИдГруппы32", СтруктураРеквизитовФормы.мИдГруппы32);
    ИдГрупп.Вставить("мИдГруппы51", СтруктураРеквизитовФормы.мИдГруппы51);
    ИдГрупп.Вставить("мИдГруппы52", СтруктураРеквизитовФормы.мИдГруппы52);
	ИдГрупп.Вставить("мИдГруппы53", СтруктураРеквизитовФормы.мИдГруппы53);
	ИдГрупп.Вставить("мИдГруппы71", СтруктураРеквизитовФормы.мИдГруппы71);
	ИдГрупп.Вставить("мИдГруппы72", СтруктураРеквизитовФормы.мИдГруппы72);
	ИдГрупп.Вставить("мИдГруппы73", СтруктураРеквизитовФормы.мИдГруппы73);
	ИдГрупп.Вставить("мИдГруппы81", СтруктураРеквизитовФормы.мИдГруппы81);
	ИдГрупп.Вставить("мИдГруппы82", СтруктураРеквизитовФормы.мИдГруппы82);
	ИдГрупп.Вставить("мИдГруппы83", СтруктураРеквизитовФормы.мИдГруппы83);
	
	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

&НаСервере
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы31", СтруктураРеквизитовФормы.мИдГруппы31);
	ИдГрупп.Вставить("мИдГруппы32", СтруктураРеквизитовФормы.мИдГруппы32);
    ИдГрупп.Вставить("мИдГруппы51", СтруктураРеквизитовФормы.мИдГруппы51);
    ИдГрупп.Вставить("мИдГруппы52", СтруктураРеквизитовФормы.мИдГруппы52);
	ИдГрупп.Вставить("мИдГруппы53", СтруктураРеквизитовФормы.мИдГруппы53);
	ИдГрупп.Вставить("мИдГруппы71", СтруктураРеквизитовФормы.мИдГруппы71);
	ИдГрупп.Вставить("мИдГруппы72", СтруктураРеквизитовФормы.мИдГруппы72);
	ИдГрупп.Вставить("мИдГруппы73", СтруктураРеквизитовФормы.мИдГруппы73);
	ИдГрупп.Вставить("мИдГруппы81", СтруктураРеквизитовФормы.мИдГруппы81);
	ИдГрупп.Вставить("мИдГруппы82", СтруктураРеквизитовФормы.мИдГруппы82);
	ИдГрупп.Вставить("мИдГруппы83", СтруктураРеквизитовФормы.мИдГруппы83);
	ИдГрупп.Вставить("мИдГруппы911", СтруктураРеквизитовФормы.мИдГруппы911);
	ИдГрупп.Вставить("мИдГруппы912", СтруктураРеквизитовФормы.мИдГруппы912);
	ИдГрупп.Вставить("мИдГруппы913", СтруктураРеквизитовФормы.мИдГруппы913);
	ИдГрупп.Вставить("мИдГруппы921", СтруктураРеквизитовФормы.мИдГруппы921);
	ИдГрупп.Вставить("мИдГруппы922", СтруктураРеквизитовФормы.мИдГруппы922);
	ИдГрупп.Вставить("мИдГруппы923", СтруктураРеквизитовФормы.мИдГруппы923);
	ИдГрупп.Вставить("мИдГруппы931", СтруктураРеквизитовФормы.мИдГруппы931);
	ИдГрупп.Вставить("мИдГруппы932", СтруктураРеквизитовФормы.мИдГруппы932);
	ИдГрупп.Вставить("мИдГруппы933", СтруктураРеквизитовФормы.мИдГруппы933);
	ИдГрупп.Вставить("мИдГруппы941", СтруктураРеквизитовФормы.мИдГруппы941);
	ИдГрупп.Вставить("мИдГруппы942", СтруктураРеквизитовФормы.мИдГруппы942);
	ИдГрупп.Вставить("мИдГруппы943", СтруктураРеквизитовФормы.мИдГруппы943);
	
	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп) Экспорт
	
	Перем ТекТабличноеПоле;
	
	Если ИдГруппы = ИдГрупп.мИдГруппы31 Тогда
		
		ТекТабличноеПоле = "Форма300_03Страница1";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы32 Тогда
		
		ТекТабличноеПоле = "Форма300_03Страница2";

    ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы51 Тогда
		
		ТекТабличноеПоле = "Форма300_05Страница1";
  
    ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы52 Тогда
		
		ТекТабличноеПоле = "Форма300_05Страница2";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы53 Тогда
		
		ТекТабличноеПоле = "Форма300_05Страница3";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы71 Тогда
		
		ТекТабличноеПоле = "Форма300_07Страница1";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы72 Тогда
		
		ТекТабличноеПоле = "Форма300_07Страница2";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы73 Тогда
		
		ТекТабличноеПоле = "Форма300_07Страница3";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы81 Тогда
		
		ТекТабличноеПоле = "Форма300_08Страница1";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы82 Тогда
		
		ТекТабличноеПоле = "Форма300_08Страница2";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы83 Тогда
		
		ТекТабличноеПоле = "Форма300_08Страница3";
		
	КонецЕсли;
	
	Возврат ТекТабличноеПоле;
	
КонецФункции

&НаКлиенте
Процедура ВывестиРазделВТабличныйДокументНаКлиенте(ИмяГруппы, СтруктураГруппы) Экспорт
	ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
КонецПроцедуры

&НаСервере
Процедура ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппы, СтруктураГруппы) Экспорт
	ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма)
	
	Если Число(Сред(ИмяГруппы,5,1)) = 3 Тогда
		
		СтруктураГруппы = Форма["П0003100002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0003200002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,1)) = 5 Тогда
		
        СтруктураГруппы = Форма["П0005100002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
        
        СтруктураГруппы = Форма["П0005200002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0005300002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,1)) = 7 Тогда
		
		СтруктураГруппы = Форма["П0007100001"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0007200002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0007300001"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,1)) = 8 Тогда
		
		СтруктураГруппы = Форма["П0008100001"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0008200002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0008300001"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
	КонецЕсли;
	
	ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма,НомерСтрокиТаблицы, Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы, Форма)
	
	
	Если Число(Сред(ИмяГруппы,5,1)) = 3 Тогда
		
		СтруктураГруппы = Форма["П0003100002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0003200002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,1)) = 5 Тогда
        
        СтруктураГруппы = Форма["П0005100002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
        
        СтруктураГруппы = Форма["П0005200002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0005300002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,1)) = 7 Тогда
		
		СтруктураГруппы = Форма["П0007100001"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0007200002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0007300001"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,1)) = 8 Тогда
		
		СтруктураГруппы = Форма["П0008100001"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0008200002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0008300001"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
	КонецЕсли;
	
	ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма, СтруктураГруппы.Количество(), Ложь);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма, НомерСтроки, УдалитьСтроку)
	
	
	Если УдалитьСтроку = Ложь Тогда
		ИндексПересчета = НомерСтроки - 2
	Иначе
		ИндексПересчета = НомерСтроки;
	КонецЕсли;
	
	Если Число(Сред(ИмяГруппы,5,1)) = 3 Тогда
		
		СтруктураГруппы = Форма["П0003100002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000310000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0003200002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000320000201 = Индекс + 2;
		КонецЦикла;
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,1)) = 5 Тогда
		
        СтруктураГруппы = Форма["П0005100002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000510000201 = Индекс + 2;
		КонецЦикла;
        
        СтруктураГруппы = Форма["П0005200002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000520000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0005300002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000530000201 = Индекс + 2;
		КонецЦикла;
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,1)) = 7 Тогда
		
		СтруктураГруппы = Форма["П0007100001"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000710000101 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0007200002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000720000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0007300001"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000730000101 = Индекс + 2;
		КонецЦикла;
		
	ИначеЕсли Число(Сред(ИмяГруппы,5,1)) = 8 Тогда
		
		СтруктураГруппы = Форма["П0008100001"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000810000101 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0008200002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000820000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0008300001"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000830000101 = Индекс + 2;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяОтчета(ЭтаФормаИмя)
	Форма_Имя = СтрЗаменить(ЭтаФормаИмя, "Внешний", "");
	Возврат Сред(Лев(Форма_Имя, СтрНайти(Форма_Имя, ".Форма.") - 1), 7);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяФормыОтчета(ЭтаФормаИмя)
	Возврат Сред(ЭтаФормаИмя, СтрНайти(ЭтаФормаИмя, ".Форма.") + 7);
КонецФункции

&НаКлиенте
Процедура ПечатьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Печать(ДополнительныеПараметры.ВидПечати);
	
КонецПроцедуры

#Область РасшифровкаСКД

&НаКлиенте
Процедура ФормаРасшифровкаСКД(ИмяЯчейки)
	
	ИмяЯчейкиСтрокой = ПолучитьИмяЯчейкиПоКоду(ИмяЯчейки, ЭтаФорма);
	
	Если ИмяЯчейкиСтрокой = "300.00.010"
		ИЛИ ИмяЯчейкиСтрокой = "300.00.025.IV"
		ИЛИ ИмяЯчейкиСтрокой = "300.00.027.I" Тогда
		Возврат;//недропользователи;сельхозпроизводители
	КонецЕсли;
	
	ОтображатьПоказательСуммаВДекларации 	= Ложь;
	ОтображатьПоказательСуммаОборота		= Истина;
	ОтображатьПоказательСуммаНДС 			= Истина;
	
	// определим раздел формы для расшифровки
	РазделНДС = "НачисленныйНДС";
	ПредставлениеРазделаНДС = "Начисление НДС";
	
	
	Попытка
		СокращенныйКод = Число(Сред(ИмяЯчейки, 8,3));
		Если (Найти(ИмяЯчейкиСтрокой, "300.00") > 0 И СокращенныйКод >= 13 И СокращенныйКод <= 29)
			ИЛИ (Найти(ИмяЯчейкиСтрокой, "300.02") > 0 И СокращенныйКод >= 10)
			ИЛИ (Найти(ИмяЯчейкиСтрокой, "300.06") > 0 И СокращенныйКод >= 7)
			ИЛИ (Найти(ИмяЯчейкиСтрокой, "300.04") > 0)Тогда
			
			РазделНДС = "ЗачетныйНДС";
			ПредставлениеРазделаНДС = "Зачет НДС";
			ОтображатьПоказательСуммаВДекларации = Истина;
		Иначе

		КонецЕсли;
	Исключение
		
	КонецПопытки;
	
	// определим коды строк регистра для включения в расшифровку данной ячейки
	КодыСтрокРасшифровки = Форма300ПолучитьСписокКодовСтрокВключаемыхВРасшифровку(ИмяЯчейкиСтрокой);
	
	ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
	
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("НачалоПериода", 	СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("КонецПериода",  	СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ТипДанных", 		"РегистрыНакопления");
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ИмяОбъекта", 	"НДС");
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ИмяТаблицы", 	"Обороты");
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СхемаКомпоновкиДанных", ПолучитьАдресМакетаСКД(РазделНДС));
	
	// Отборы
	ПользовательскиеОтборы = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
	ПользовательскиеОтборы.ИдентификаторПользовательскойНастройки = "Отбор";
	
	// Сортировка
	ПользовательскиеСортировки = ПользовательскиеНастройки.Элементы.Добавить(Тип("ПорядокКомпоновкиДанных"));
	ПользовательскиеСортировки.ИдентификаторПользовательскойНастройки = "Порядок";
	
	НовыйЭлементПорядка = ПользовательскиеСортировки.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	НовыйЭлементПорядка.Использование  = Истина;
	НовыйЭлементПорядка.Поле  = Новый ПолеКомпоновкиДанных("Регистратор.Дата");
	
	// Группировки	
	МассивГруппировок = Новый Массив();
	РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьГруппировку(МассивГруппировок,"КодСтроки", НСтр("ru = 'Код строки'"));
	Если РазделНДС = "НачисленныйНДС" Тогда
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьГруппировку(МассивГруппировок,"ВидОперацииРеализации", НСтр("ru = 'Вид операции реализации'"));
	Иначе
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьГруппировку(МассивГруппировок,"ВидОперацииПоступления", НСтр("ru = 'Вид операции поступления'"));
	КонецЕсли;
	
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Группировка",  МассивГруппировок);
	
	// Параметры
	
	МассивПараметровДанных = Новый Массив();
	
	РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьПараметр(МассивПараметровДанных, "КодСтрокиРасшифровки", КодыСтрокРасшифровки);
	РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьПараметр(МассивПараметровДанных, "НачалоПериода", НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета));
	РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьПараметр(МассивПараметровДанных, "КонецПериода", КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));
	РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьПараметр(МассивПараметровДанных, "Организация", СтруктураРеквизитовФормы.Организация);
	
	Если ИмяЯчейкиСтрокой = "300.00.004" Тогда
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьПараметр(МассивПараметровДанных, "Строка300_00_04", ИСТИНА);
	Иначе
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьПараметр(МассивПараметровДанных, "Строка300_00_04", ЛОЖЬ);
	КонецЕсли;
	
	// Метод отнесения НДС в зачет.
	// при расшифровке раздельного метода в расшифровку добавляем Вид оборота и Сумму в Декларации (сумма с учетом удельного веса)
	ПризнакРаздельногоМетода = ?((СтруктураРеквизитовФормы.мМетодРасчета = "Раздельный" И Найти(ИмяЯчейкиСтрокой, "300.04") = 0 И Найти(ИмяЯчейкиСтрокой, "300.00.028") = 0), Истина, Ложь);
	РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьПараметр(МассивПараметровДанных, "РаздельныйМетод", ПризнакРаздельногоМетода);
	
	
	//ПараметрыВывода.Значение = "Регистр налогового учета к строке "+ИмяЯчейки+" для Декларации по НДС";
	Если СтруктураДанныхФорма300Страница1.Свойство("П000010007002") Тогда
		УдельныйВес = ?(Не ЗначениеЗаполнено(СтруктураДанныхФорма300Страница1.П000010007002),
			1,СтруктураДанныхФорма300Страница1.П000010007002);
	Иначе
		УдельныйВес = 1;
	КонецЕсли;
	РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьПараметр(МассивПараметровДанных, "УдельныйВес", УдельныйВес);
	
	// Дополнительные отборы
	Если Найти(ИмяЯчейкиСтрокой, "300.00.003") > 0 Тогда
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы, "СтавкаНДС.Ставка", 0, ВидСравненияКомпоновкиДанных.НеРавно);
		ОтображатьПоказательСуммаНДС 			= Истина;
		
	ИначеЕсли Найти(ИмяЯчейкиСтрокой, "300.00.002") > 0 Тогда
		// Корректировка по 0 ставке
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы, "СтавкаНДС.Ставка", 0, ВидСравненияКомпоновкиДанных.Равно);
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы, "СтавкаНДС.ДляОсвобожденногоОборота", Ложь, ВидСравненияКомпоновкиДанных.Равно);
		ОтображатьПоказательСуммаНДС = Ложь;
		
	ИначеЕсли Найти(ИмяЯчейкиСтрокой, "300.00.004") > 0 Тогда
		
		ОтображатьПоказательСуммаНДС = Ложь;
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы,"ВидОперацииРеализации.НеЯвляетсяОборотомПоРеализации",
			Истина,
			ВидСравненияКомпоновкиДанных.Равно);
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы, "СтавкаНДС.ДляОсвобожденногоОборота", Ложь, ВидСравненияКомпоновкиДанных.Равно);
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы, "СтавкаНДС.МестоРеализацииНеРК", Истина, ВидСравненияКомпоновкиДанных.Равно);
		
	ИначеЕсли Найти(ИмяЯчейкиСтрокой, "300.00.005") > 0 Тогда
		
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы, "СтавкаНДС.ДляОсвобожденногоОборота", Истина, ВидСравненияКомпоновкиДанных.Равно);
		ОтображатьПоказательСуммаНДС = Ложь;
		
	ИначеЕсли Найти(ИмяЯчейкиСтрокой, "300.00.015") > 0 Тогда
		
		ОтображатьПоказательСуммаВДекларации 	= Ложь;
		
	ИначеЕсли Найти(ИмяЯчейкиСтрокой, "300.00.017") > 0 Тогда
		
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы, "СтавкаНДС.ДляОсвобожденногоОборота", Истина, ВидСравненияКомпоновкиДанных.Равно);
		ОтображатьПоказательСуммаНДС 			= Ложь;
		ОтображатьПоказательСуммаВДекларации 	= Ложь;
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы, "СтавкаНДС.МестоРеализацииНеРК", Ложь, ВидСравненияКомпоновкиДанных.Равно);
		
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы,"ВидОперацииРеализации.ВидНДС",
			ПредопределенноеЗначение("Перечисление.ВидыНДС.НДСУплачиваемыйПриИмпортеИзТаможенногоСоюза"),
			ВидСравненияКомпоновкиДанных.НеРавно);
		
	ИначеЕсли Найти(ИмяЯчейкиСтрокой, "300.00.018") > 0 Тогда
		
		ОтображатьПоказательСуммаНДС 			= Ложь;
		ОтображатьПоказательСуммаВДекларации 	= Ложь;
		
	ИначеЕсли Найти(ИмяЯчейкиСтрокой, "300.01") > 0 Тогда
		// 0 ставка НДС
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы, "СтавкаНДС.ДляОсвобожденногоОборота", Ложь, ВидСравненияКомпоновкиДанных.Равно);
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы, "СтавкаНДС.Ставка", 0, ВидСравненияКомпоновкиДанных.Равно);
		ОтображатьПоказательСуммаНДС = Ложь;
		
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы,"ВидОперацииРеализации.ВидНДС",
			ПредопределенноеЗначение("Перечисление.ВидыНДС.НДСУплачиваемыйПриИмпортеМетодомЗачета"),
			ВидСравненияКомпоновкиДанных.НеРавно);
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы,"ВидОперацииРеализации.ВидНДС",
			ПредопределенноеЗначение("Перечисление.ВидыНДС.НДСУплачиваемыйПриИмпортеИзТаможенногоСоюза"),
			ВидСравненияКомпоновкиДанных.НеРавно);
		
	ИначеЕсли Найти(ИмяЯчейкиСтрокой, "300.02") >0 Тогда
		// Без НДС (освобожденные обороты)
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы, "СтавкаНДС.ДляОсвобожденногоОборота", Истина, ВидСравненияКомпоновкиДанных.Равно);
		ОтображатьПоказательСуммаНДС = Ложь;
		// освобожденный импорт, к его показателям не применяется удельный вес
		ОтображатьПоказательСуммаВДекларации 	= Ложь;
		
		Если РазделНДС = "ЗачетныйНДС" Тогда
			
			РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы, "СтавкаНДС.МестоРеализацииНеРК", Ложь, ВидСравненияКомпоновкиДанных.Равно);
			
			РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы,"ВидОперацииРеализации.ВидНДС",
				ПредопределенноеЗначение("Перечисление.ВидыНДС.НДСУплачиваемыйПриИмпортеИзТаможенногоСоюза"),
				ВидСравненияКомпоновкиДанных.НеРавно);
			
		КонецЕсли;
		
	ИначеЕсли Найти(ИмяЯчейкиСтрокой, "300.04") > 0 Тогда
		// НДС методом зачета, к его показателям не применяется удельный вес
		ОтображатьПоказательСуммаВДекларации 	= Ложь;
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы,"ВидОперацииПоступления.ВидНДС",
			ПредопределенноеЗначение("Перечисление.ВидыНДС.НДСУплачиваемыйПриИмпортеМетодомЗачета"),
			ВидСравненияКомпоновкиДанных.Равно);
	ИначеЕсли ИмяЯчейкиСтрокой =  "300.06.004" Тогда
		// Корректировка по облагаемым оборотам
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы, "СтавкаНДС.Ставка", 0, ВидСравненияКомпоновкиДанных.НеРавно);
		
	ИначеЕсли ИмяЯчейкиСтрокой =  "300.06.005" Тогда
		// Корректировка по 0 ставке
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы, "СтавкаНДС.Ставка", 0, ВидСравненияКомпоновкиДанных.Равно);
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы, "СтавкаНДС.ДляОсвобожденногоОборота", Ложь, ВидСравненияКомпоновкиДанных.Равно);
		ОтображатьПоказательСуммаНДС = Ложь;
		
	ИначеЕсли ИмяЯчейкиСтрокой =  "300.06.006" Тогда
		// Корректировка освобожденного оборота
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы, "СтавкаНДС.ДляОсвобожденногоОборота", Истина, ВидСравненияКомпоновкиДанных.Равно);
		ОтображатьПоказательСуммаНДС = Ложь;
		
	ИначеЕсли ИмяЯчейкиСтрокой =  "300.00.013.I" Тогда
		// Корректировка освобожденного оборота
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы, "ОборотыПоСчетуФактуре", Истина, ВидСравненияКомпоновкиДанных.Равно);
		
	ИначеЕсли ИмяЯчейкиСтрокой =  "300.00.013.II" Тогда
		// Корректировка освобожденного оборота
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы, "ОборотыПоСчетуФактуре", Ложь, ВидСравненияКомпоновкиДанных.Равно);
		
		
	ИначеЕсли ИмяЯчейкиСтрокой =  "300.00.001.I" Тогда
		// Корректировка освобожденного оборота
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы, "ОборотыПоСчетуФактуре", Истина, ВидСравненияКомпоновкиДанных.Равно);
		
	ИначеЕсли ИмяЯчейкиСтрокой =  "300.00.001.II" Тогда
		// Корректировка освобожденного оборота
		//СписокОтбор = Новый Массив;
		//СписокОтбор.Добавить(Ложь);
		//СписокОтбор.Добавить(Неопределено);
		//СписокОтбор.Добавить(Null);
		//РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы, "ОборотыПоСчетуФактуре", СписокОтбор, ВидСравненияКомпоновкиДанных.ВСписке);
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьОтбор(ПользовательскиеОтборы, "ОборотыПоСчетуФактуре", Ложь, ВидСравненияКомпоновкиДанных.Равно);
		
		
	КонецЕсли;
	
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПараметрыДанных", МассивПараметровДанных);
	
	ПользовательскиеПоля = ПользовательскиеНастройки.Элементы.Добавить(Тип("ВыбранныеПоляКомпоновкиДанных"));
	ПользовательскиеПоля.ИдентификаторПользовательскойНастройки = "Выбор";
	
	Если ОтображатьПоказательСуммаОборота Тогда
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "СуммаОборота", "Оборот по реализации");
	КонецЕсли;
	Если ОтображатьПоказательСуммаВДекларации Тогда
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "СуммаВДекларации", "Сумма в декларации");
	КонецЕсли;
	Если ОтображатьПоказательСуммаНДС Тогда
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "СуммаНДС", "Сумма НДС");
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "Контрагент", "Контрагент");
	РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "ИИН_БИН", "ИИН/БИН контрагента");
	РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "Регистратор", "Документ");
	РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "СтавкаНДС", "Ставка НДС");
	
	// Прочие настройки
	ТекстЗаголовка = НСТР("ru = 'Регистр налогового учета к строке %1 для Декларации по НДС'");
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Заголовок", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗаголовка, ИмяЯчейкиСтрокой));
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ВыводитьЗаголовок", Истина);
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ВыводитьПодписи", Истина);
	
	ИмяРазделаРасшифровки = "Декларация по НДС:" + СтруктураРеквизитовФормы.мГод + ", " + ПредставлениеРазделаНДС;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидРасшифровки", 2);
	ПараметрыФормы.Вставить("РежимРасшифровки", Истина);
	ПараметрыФормы.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("ВыводитьЗаголовок", Истина);
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", ИмяРазделаРасшифровки);
	
	ОткрытьФорму("Отчет.РасшифровкаРегламентированныхОтчетов.Форма.ФормаОтчета", ПараметрыФормы,, Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИмяЯчейкиПоКоду(ИмяЯчейки, Форма)
	
	Раздел = Число(Сред(ИмяЯчейки,4,2));
	Ячейка = Число(Сред(ИмяЯчейки,8,3));
	Если СтрДлина(ИмяЯчейки)>13 Тогда
		Префикс = Число(Сред(ИмяЯчейки,11,2));
	Иначе
		Префикс = Число(Сред(ИмяЯчейки,11,1));
	КонецЕсли;
	
	ИмяСтрокой = "300." + Формат(Раздел, "ЧЦ=2; ЧН=00; ЧВН=") + "." + Формат(Ячейка, "ЧЦ=3; ЧВН=");
	
	Если Префикс = 0 Тогда
		//Возврат ИмяСтрокой;
	ИначеЕсли Префикс = 1 Тогда
		ИмяСтрокой = ИмяСтрокой + "." + "I";
	ИначеЕсли Префикс = 2 Тогда
		ИмяСтрокой = ИмяСтрокой + "." + "II";
	ИначеЕсли Префикс = 3 Тогда
		ИмяСтрокой = ИмяСтрокой + "." + "III";
	ИначеЕсли Префикс = 4 Тогда
		ИмяСтрокой = ИмяСтрокой + "." + "IV";
	ИначеЕсли Префикс = 5 Тогда
		ИмяСтрокой = ИмяСтрокой + "." + "V";
	ИначеЕсли Префикс = 6 Тогда
		ИмяСтрокой = ИмяСтрокой + "." + "VI";
	ИначеЕсли Префикс = 7 Тогда
		ИмяСтрокой = ИмяСтрокой + "." + "VII";
	ИначеЕсли Префикс = 8 Тогда
		ИмяСтрокой = ИмяСтрокой + "." + "VIII";
	ИначеЕсли Префикс = 9 Тогда
		ИмяСтрокой = ИмяСтрокой + "." + "IX";
	ИначеЕсли Префикс = 10 Тогда
		ИмяСтрокой = ИмяСтрокой + "." + "X";
	Иначе
		//Возврат ИмяСтрокой;
	КонецЕсли;
	
	Если СтрНайти(ИмяСтрокой, "300.01.003.") <> 0 Тогда
		
		НомерСтроки = Сред(ИмяСтрокой, 12, 1);
		НазваниеСтроки = "s_300_01_" + Сред(ИмяСтрокой, 8, 3) + "_text__" + Префикс;
		
		НаименованиеПоКлассификатору = "";
		Если Форма.СтруктураДанныхФорма300_01Страница1.Свойство(НазваниеСтроки) Тогда
			НаименованиеПоКлассификатору = Форма.СтруктураДанныхФорма300_01Страница1[НазваниеСтроки];
		КонецЕсли;	
		
		ИмяСтрокой = Сред(ИмяСтрокой, 1, 11) + СтрЗаменить(НаименованиеПоКлассификатору, "-", ".");

	ИначеЕсли СтрНайти(ИмяСтрокой, "300.02.001.") <> 0 ИЛИ СтрНайти(ИмяСтрокой, "300.02.010.") <> 0 Тогда
		
		НомерСтроки = Сред(ИмяСтрокой, 12, 1);
		НазваниеСтроки = "s_300_02_" + Сред(ИмяСтрокой, 8, 3) + "_text__" + Префикс;
		
		НаименованиеПоКлассификатору = "";
		Если Форма.СтруктураДанныхФорма300_02Страница1.Свойство(НазваниеСтроки) Тогда
			НаименованиеПоКлассификатору = Форма.СтруктураДанныхФорма300_02Страница1[НазваниеСтроки];
		КонецЕсли;	
		
		ИмяСтрокой = Сред(ИмяСтрокой, 1, 11) + СтрЗаменить(НаименованиеПоКлассификатору, "-", ".");
	ИначеЕсли СтрНайти(ИмяСтрокой, "300.06.001.") <> 0 ИЛИ СтрНайти(ИмяСтрокой, "300.06.006.") <> 0 ИЛИ  СтрНайти(ИмяСтрокой, "300.06.007.") Тогда
		
		НомерСтроки = Сред(ИмяСтрокой, 12, 1);
		НазваниеСтроки = "s_300_06_" + Сред(ИмяСтрокой, 8, 3) + "_text__" + Префикс;
		
		НаименованиеПоКлассификатору = "";
		Если Форма.СтруктураДанныхФорма300_06Страница1.Свойство(НазваниеСтроки) Тогда
			НаименованиеПоКлассификатору = Форма.СтруктураДанныхФорма300_06Страница1[НазваниеСтроки];
		КонецЕсли;	
		
		ИмяСтрокой = Сред(ИмяСтрокой, 1, 11) + СтрЗаменить(НаименованиеПоКлассификатору, "-", ".");	
	КонецЕсли;
	
	Возврат ИмяСтрокой;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Форма300ПолучитьСписокКодовСтрокВключаемыхВРасшифровку(ИмяЯчейки)
	
	КодыСтрокРасшифровки = Новый СписокЗначений;
	
	Если ИмяЯчейки = "300.00.002" Тогда
		
		КодыСтрокРасшифровки.Добавить("300.00.002");
		
		КодыСтрокРасшифровки.Добавить("300.01.001");
		КодыСтрокРасшифровки.Добавить("300.01.002");
		КодыСтрокРасшифровки.Добавить("300.01.003");
		
		
		КодыСтрокРасшифровки.Добавить("300.06.005");
		
	ИначеЕсли ИмяЯчейки = "300.00.003" Тогда
		
		КодыСтрокРасшифровки.Добавить("300.06.001");
		
	ИначеЕсли Найти(ИмяЯчейки,"300.00.013")>0 Тогда
		
		КодыСтрокРасшифровки.Добавить("300.00.013");
		
	ИначеЕсли Найти(ИмяЯчейки,"300.00.001")>0 Тогда
		
		КодыСтрокРасшифровки.Добавить("300.00.001");
		
	ИначеЕсли ИмяЯчейки = "300.00.005" Тогда
		
		Для Сч = 1 по 5 Цикл
			КодыСтрокРасшифровки.Добавить("300.02.0"+ Формат(Сч, "ЧЦ=2; ЧН=; ЧВН="));
		КонецЦикла;
		Для Сч = 1 по 8 Цикл
			КодыСтрокРасшифровки.Добавить("300.06.0"+ Формат(Сч, "ЧЦ=2; ЧН=; ЧВН="));
		КонецЦикла;
		
	ИначеЕсли ИмяЯчейки = "300.00.014" Тогда
		
		КодыСтрокРасшифровки.Добавить("300.00.014");
		// НДС за нерезидента
		Для Сч = 1 по 7 Цикл
			КодыСтрокРасшифровки.Добавить("300.05.0"+ Формат(Сч, "ЧЦ=2; ЧН=; ЧВН="));
		КонецЦикла;
		
	ИначеЕсли ИмяЯчейки = "300.00.017" Тогда
		
		Для Сч = 10 по 13 Цикл
			КодыСтрокРасшифровки.Добавить("300.02.0"+ Формат(Сч, "ЧЦ=2; ЧН=; ЧВН="));
		КонецЦикла;
		
	ИначеЕсли ИмяЯчейки = "300.00.019" Тогда
		
		КодыСтрокРасшифровки.Добавить("300.03.001");
		КодыСтрокРасшифровки.Добавить("300.03.002");
		
	ИначеЕсли ИмяЯчейки = "300.00.022" Тогда
		
		Для Сч = 7 по 9 Цикл
			КодыСтрокРасшифровки.Добавить("300.06.0"+ Формат(Сч, "ЧЦ=2; ЧН=; ЧВН="));
		КонецЦикла;
		
	ИначеЕсли ИмяЯчейки = "300.00.029" Тогда
		
		КодыСтрокРасшифровки.Добавить("300.00.029");
		КодыСтрокРасшифровки.Добавить("300.04.001");
		
	ИначеЕсли ИмяЯчейки = "300.01.004" Тогда
		// итоговая строка
		Для Сч = 1 по 3 Цикл
			КодыСтрокРасшифровки.Добавить("300.01.0"+ Формат(Сч, "ЧЦ=2; ЧН=; ЧВН="));
		КонецЦикла;
		
	ИначеЕсли ИмяЯчейки = "300.02.009" Тогда
		// итоговая строка
		Для Сч = 1 по 8 Цикл
			КодыСтрокРасшифровки.Добавить("300.02.0"+ Формат(Сч, "ЧЦ=2; ЧН=; ЧВН="));
		КонецЦикла;
		
	ИначеЕсли ИмяЯчейки = "300.02.014" Тогда
		// итоговая строка
		Для Сч = 10 по 13 Цикл
			КодыСтрокРасшифровки.Добавить("300.02.0"+ Формат(Сч, "ЧЦ=2; ЧН=; ЧВН="));
		КонецЦикла;
		
	ИначеЕсли ИмяЯчейки = "300.06.004" Тогда
		
		Для Сч = 1 по 3 Цикл
			КодыСтрокРасшифровки.Добавить("300.06.0"+ Формат(Сч, "ЧЦ=2; ЧН=; ЧВН="));
		КонецЦикла;
		
	ИначеЕсли ИмяЯчейки = "300.06.010" Тогда
		// итоговая строка
		Для Сч = 7 по 9 Цикл
			КодыСтрокРасшифровки.Добавить("300.06.0"+ Формат(Сч, "ЧЦ=2; ЧН=; ЧВН="));
		КонецЦикла;
		
	Иначе
		
		КодыСтрокРасшифровки.Добавить(ИмяЯчейки);
		
	КонецЕсли;
	
	Возврат КодыСтрокРасшифровки;
	
КонецФункции

&НаСервере
Функция ПолучитьАдресМакетаСКД(знач ИмяРаздела)
	
	ОбщаяСКД = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("МакетСКДФорма3002020Кв2");
	СхемаКомпоновкиДанных = ОбщаяСКД.ВложенныеСхемыКомпоновкиДанных.Найти(ИмяРаздела).Схема;
	
	Возврат ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор)
	
КонецФункции

//&НаКлиенте
//Процедура  Форма300бработкаВыбораЗначений(Результат, ПараметрыВыбора) экспорт
//	//ТекИмяФормы = "Форма300_02";
//	Если Результат = Неопределено Тогда
//		Возврат;
//	Иначе
//		ВыбранноеЗначение = Результат;
//		Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда 
//			ВыбранноеЗначение = ВыбранноеЗначение.Наименование;
//		КонецЕсли;
//	КонецЕсли;
//	
//	Форма300ОбработкаВыбораЗначенийНаСервере(ВыбранноеЗначение, ПараметрыВыбора.ИмяЯчейки); 	
//	
//КонецПроцедуры

//&НаСервере
//Процедура  Форма300ОбработкаВыбораЗначенийНаСервере(Результат, ИмяЯчейки)
//	
//	ЭтотОбъект.ТабличныйДокумент.Области[ИмяЯчейки].Значение = Результат;
//	РегламентированнаяОтчетность.ПередатьЗначениеВСтруктуру(ЭтотОбъект, "Форма300_02", ИмяЯчейки, Результат, Ложь);
//	
//КонецПроцедуры

#КонецОбласти