
&ИзменениеИКонтроль("УстановитьСтраницуВариантаНавигации")
Процедура игр_УстановитьСтраницуВариантаНавигации(Форма, ВариантНавигацииДоИзменения)

	Если Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоИерархии Тогда
		СтраницаВариантаНавигации = Форма.Элементы.НавигацияИерархияНоменклатуры;
	ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоИерархииПоставщика Тогда
		СтраницаВариантаНавигации = Форма.Элементы.НавигацияИерархияНоменклатурыПоставщика;
	ИначеЕсли Не ЗначениеЗаполнено(Форма.ВариантНавигации) Тогда
		СтраницаВариантаНавигации = Форма.Элементы.НавигацияИерархияНоменклатуры;
		Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоИерархии;
	ИначеЕсли (Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам
		Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам
		Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам) Тогда
		СтраницаВариантаНавигации = Форма.Элементы.НавигацияВидыНоменклатуры;

		Если Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам Тогда
			Форма.Элементы.ДеревоОтборов.Видимость    = Истина;
			Форма.Элементы.ВидНоменклатуры.Видимость  = Ложь;
		ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам Тогда
			Форма.Элементы.ДеревоОтборов.Видимость    = Ложь;
			Форма.Элементы.ВидНоменклатуры.Видимость  = Ложь;
		ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам Тогда
			Форма.Элементы.ДеревоОтборов.Видимость    = Истина;
			Форма.Элементы.ВидНоменклатуры.Видимость  = Истина;
		КонецЕсли;

		Если ПодборТоваровКлиентСервер.ЭтоФормаПодбора(Форма)
			ИЛИ ПодборТоваровКлиентСервер.ЭтоФормаВыбораНоменклатуры(Форма)
			ИЛИ ПодборТоваровКлиентСервер.ЭтоФормаСпискаНоменклатуры(Форма) Тогда

			Если Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам Тогда
				Форма.Элементы.ВидыНоменклатуры.Видимость = Истина;
			ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам Тогда
				Форма.Элементы.ВидыНоменклатуры.Видимость = Истина;
			ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам Тогда
				Форма.Элементы.ВидыНоменклатуры.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;

	ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСовместноПродаваемымТоварам Тогда
		СтраницаВариантаНавигации = Форма.Элементы.СтраницаПодобранныеТовары;
	ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоТоварамДругогоКачества Тогда
		Если ПодборТоваровКлиентСервер.ЭтоФормаПодобныеТоварыНоменклатуры(Форма) Тогда
			СтраницаВариантаНавигации = Форма.Элементы.НавигацияИерархияНоменклатуры;
		Иначе
			СтраницаВариантаНавигации = Форма.Элементы.СтраницаТоварыДругогоКачества;
		КонецЕсли;
	ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоНоменклатуре Тогда
		Форма.Элементы.ВидНоменклатуры.Видимость  = Ложь;
		СтраницаВариантаНавигации = Форма.Элементы.НавигацияНоменклатура;
	ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоНоменклатуреПоставщика Тогда
		Форма.Элементы.ВидНоменклатуры.Видимость  = Ложь;
		СтраницаВариантаНавигации = Форма.Элементы.НавигацияНоменклатураПоставщика;
	КонецЕсли;

	ВозвратКФильтрам = Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоТоварамДругогоКачества
	Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСовместноПродаваемымТоварам;

	Если ПодборТоваровКлиентСервер.ЭтоФормаПодбора(Форма)
		ИЛИ ПодборТоваровКлиентСервер.ЭтоФормаВыбораНоменклатуры(Форма)
		ИЛИ ПодборТоваровКлиентСервер.ЭтоФормаСпискаНоменклатуры(Форма) Тогда
		Форма.Элементы.ИспользоватьФильтры.Доступность = Не ВозвратКФильтрам;
		Форма.Элементы.СтандартныйПоискКоманднаяПанельУстановитьФильтр.Доступность = Не ВозвратКФильтрам;
		Форма.Элементы.РасширенныйПоискКоманднаяПанельУстановитьФильтр.Доступность = Не ВозвратКФильтрам;
		Форма.Элементы.СписокРасширенныйПоискНоменклатураКонтекстноеМенюНоменклатураСАналогичнымиСвойствами.Доступность = Не ВозвратКФильтрам;
		Форма.Элементы.СписокРасширенныйПоискНоменклатураКонтекстноеМенюТоварыДругогоКачества.Доступность = Не ВозвратКФильтрам;
		Форма.Элементы.СписокСтандартныйПоискНоменклатураКонтекстноеМенюНоменклатураСАналогичнымиСвойствами.Доступность = Не ВозвратКФильтрам;
		Форма.Элементы.СписокСтандартныйПоискНоменклатураКонтекстноеМенюТоварыДругогоКачества.Доступность = Не ВозвратКФильтрам;
		СформироватьНадписьВариантНавигации(Форма, ВариантНавигацииДоИзменения);
	КонецЕсли;

	Форма.Элементы.ВариантыНавигации.ТекущаяСтраница = СтраницаВариантаНавигации;

	#Удаление
	Если Не ПодборТоваровКлиентСервер.ЭтоФормаПрайсЛиста(Форма)
		И Не ПодборТоваровКлиентСервер.ЭтоФормаПрайсЛистаПоставщиков(Форма) Тогда

		Если Не ПравоДоступа("Изменение", Метаданные.Справочники.ВидыНоменклатуры) Тогда  
			Форма.Элементы.ВидыНоменклатурыСоздать.Видимость                   = Ложь;
			Форма.Элементы.ВидыНоменклатурыСоздатьГруппу.Видимость             = Ложь;  
			Форма.Элементы.ВидыНоменклатурыИзменить.Видимость                  = Ложь;
			Форма.Элементы.ВидыНоменклатурыСкопировать.Видимость               = Ложь;
			Форма.Элементы.ВидыНоменклатурыУстановитьПометкуУдаления.Видимость = Ложь;

			Форма.Элементы.СоздатьВидНоменклатуры.Видимость                    = Ложь;
			Форма.Элементы.СоздатьГруппуВидовНоменклатуры.Видимость            = Ложь;
		Иначе

			Видимость = Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам
			Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам;
			
			Форма.Элементы.ВидыНоменклатурыСоздать.Видимость                   = Видимость;
			Форма.Элементы.ВидыНоменклатурыСоздатьГруппу.Видимость             = Видимость; 
			Форма.Элементы.ВидыНоменклатурыИзменить.Видимость                  = Видимость;
			Форма.Элементы.ВидыНоменклатурыСкопировать.Видимость               = Видимость;
			Форма.Элементы.ВидыНоменклатурыУстановитьПометкуУдаления.Видимость = Видимость;

			Форма.Элементы.СоздатьВидНоменклатуры.Видимость                    = Видимость;
			Форма.Элементы.СоздатьГруппуВидовНоменклатуры.Видимость            = Видимость;

		КонецЕсли;

		Если Не ПравоДоступа("Изменение", Метаданные.Справочники.Номенклатура) Тогда
			Форма.Элементы.СоздатьГруппуНоменклатуры.Видимость                 = Ложь;
		Иначе
			Видимость = Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоИерархии;

			Форма.Элементы.СоздатьГруппуНоменклатуры.Видимость  = Видимость;
		КонецЕсли;

	КонецЕсли;
	#КонецУдаления

	Видимость = Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам
	Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам
	Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам;

	Форма.Элементы.СброситьОтборыПоСвойствам.Видимость = Видимость;

	Доступность = Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам
	Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам;

	Форма.Элементы.СброситьОтборыПоСвойствам.Доступность = Доступность;

КонецПроцедуры
