
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.ЗакрыватьПриВыборе <> Ложь Тогда
		ЭтаФорма.ЗакрыватьПриВыборе = Истина;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДатаСеанса());
	Элементы.Список.Обновить();
	ЗаполнитьСведенияОДатеАктуализации();
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Если ТипЗнч(Параметры.ТекущаяСтрока) = Тип("СправочникСсылка.КлассификаторТНВЭД") И Не Параметры.ТекущаяСтрока.Пустая() Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СведенияОНоменклатуреГСВССрезПоследних.НоменклатураГСВС КАК НоменклатураГСВС
		|ИЗ
		|	РегистрСведений.СведенияОНоменклатуреГСВС.СрезПоследних(&Период, НоменклатураГСВС.ТипКодаГСВС = ЗНАЧЕНИЕ(Перечисление.ТипыКодовГСВС.ТНВЭД)) КАК СведенияОНоменклатуреГСВССрезПоследних
		|ГДЕ
		|	ПОДСТРОКА(СведенияОНоменклатуреГСВССрезПоследних.ПолныйКодГСВС, 13, 10) = &Код");
		
		Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("Код", Параметры.ТекущаяСтрока.Код);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			НачальноеЗначениеВыбора = Выборка.НоменклатураГСВС;
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ВС_ПроверятьОповещенияФоновогоЗадания"
		И ЭтаФорма.КлючУникальности = Источник Тогда
		
		ВСКлиентПереопределяемый.ОбработкаОповещенияВС_ПроверятьОповещенияФоновогоЗадания(ЭтаФорма, Параметр);
		Элементы.Список.Обновить();
		ЗаполнитьСведенияОДатеАктуализации();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КлючУникальности = Новый УникальныйИдентификатор;
	
	Если Не НачальноеЗначениеВыбора.Пустая() Тогда
		Элементы.Список.ТекущаяСтрока = НачальноеЗначениеВыбора;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОповеститьОВыборе(НайтиСоздатьКодТНВЭДНаКлиенте());
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКодТНВЭД(Команда)
	ОповеститьОВыборе(НайтиСоздатьКодТНВЭДНаКлиенте());
КонецПроцедуры

&НаКлиенте
Процедура ТехническаяИнформацияОбОбновленииНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СобытиеЖурналаРегистрации", "ОбменЭСФ.ЗагрузитьСправочникГСВС");	

	ВСКлиентПереопределяемый.ОткрытьФормуЖурналаРегистрации(ПараметрыФормы);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция НайтиСоздатьКодТНВЭДНаКлиенте()
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено
		ИЛИ Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат ПредопределенноеЗначение("Справочник.КлассификаторТНВЭД.ПустаяСсылка");
	КонецЕсли;
	
	Возврат НайтиСоздатьКодТНВЭДНаСервере(
				Элементы.Список.ТекущиеДанные.ПолныйКодГСВС,
				Элементы.Список.ТекущиеДанные.ПолноеНаименованиеRu);
	
КонецФункции

&НаСервере
Функция НайтиСоздатьКодТНВЭДНаСервере(КодСправочника, НаименованиеСправочника = "")
	
	Если Не ЗначениеЗаполнено(КодСправочника) Тогда
		Возврат Справочники.КлассификаторТНВЭД.ПустаяСсылка();
	КонецЕсли;
		
	КодТНВЭД = Лев(СокрЛП(КодСправочника),10);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КлассификаторТНВЭД.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
		|ГДЕ
		|	КлассификаторТНВЭД.Код = &Код";
	Запрос.УстановитьПараметр("Код",КодТНВЭД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		СправочникОбъект = Справочники.КлассификаторТНВЭД.СоздатьЭлемент();
		СправочникОбъект.Код = КодТНВЭД;
		СправочникОбъект.СырьевойТовар = Ложь;
		СправочникОбъект.ЭлементОбработан = Истина;
		СправочникОбъект.Наименование = НаименованиеСправочника;
		СправочникОбъект.НаименованиеПолное = НаименованиеСправочника;
		СправочникОбъект.Записать();
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		
		ЗафиксироватьТранзакцию();
		
		Возврат СправочникОбъект.Ссылка;
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстСообщения = НСтр("ru = 'Не удалось записать элемент справочника ""КлассификаторТНВЭД"" с кодом %Код% : %Причина%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Код%", КодТНВЭД);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Справочники.КлассификаторТНВЭД, , ТекстСообщения);
		
		Возврат Справочники.КлассификаторТНВЭД.ПустаяСсылка();
	КонецПопытки;
	
КонецФункции 

&НаСервере
Процедура ЗаполнитьСведенияОДатеАктуализации()
	ПараметрыМетодаСинхронизации = ЭСФСервер.ПолучитьПараметрыМетода(Неопределено, ВРег("gsvsUpdates"), Неопределено);	
	Если ПараметрыМетодаСинхронизации.Свойство("lastUpdateDate") и ЗначениеЗаполнено(ПараметрыМетодаСинхронизации.lastUpdateDate) Тогда
		ДатаАктуализации = ПараметрыМетодаСинхронизации.lastUpdateDate
	Иначе
		ДатаАктуализации = Неопределено;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти


