
#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации	= ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	
	ПараметрыРегистрации.Вид	= ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Версия			= "1.0";
	ПараметрыРегистрации.Наименование	= "Определение рейтинга товарных позиций. АВС-Анализ Калмыкова";
	ПараметрыРегистрации.Информация		= "(с) Разработка отчета Башмаков Артем. https://t.me/bashmakov_artem";
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуДанных(ОсновныеНастройки) Экспорт
	
	СхемаДанныеТоваров	= ПолучитьМакет("ДанныеТоваров");
	
	Настройки	= СхемаДанныеТоваров.НастройкиПоУмолчанию;
	
	ПериодАнализ		= КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(ОсновныеНастройки, "ПериодАнализ").Значение;
	ПериодСравнение		= КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(ОсновныеНастройки, "ПериодСравнение").Значение;
	
	КомпоновкаДанныхКлиентСервер.СкопироватьОтборКомпоновкиДанных(СхемаДанныеТоваров, Настройки, ОсновныеНастройки);
	
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Настройки, "НачалоПериодаАнализ", ПериодАнализ.ДатаНачала);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Настройки, "ОкончаниеПериодаАнализ", ПериодАнализ.ДатаОкончания);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Настройки, "НачалоПериодаСравнение", ПериодСравнение.ДатаНачала);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Настройки, "ОкончаниеПериодаСравнение", ПериодСравнение.ДатаОкончания);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Настройки, "СвойствоПоставщик", ПолучитьСвойство("ОсновнойПоставщик_Номенклатура"));
	
	КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки		= КомпоновщикМакета.Выполнить(СхемаДанныеТоваров, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки	= Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	Результат	= Новый ТаблицаЗначений;
	
	ПроцессорВывода	= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат Результат;
		
КонецФункции

Функция ПолучитьСтруктуруТаблицыДляОтчета() Экспорт
	
	Результат	= Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("ОбъектАнализа");
	Результат.Колонки.Добавить("ОборотАнализ");
	Результат.Колонки.Добавить("ОборотСравнение");
	Результат.Колонки.Добавить("ОборотАнализКоличество");
	Результат.Колонки.Добавить("ОборотСравнениеКоличество");
	Результат.Колонки.Добавить("Номенклатура");
	Результат.Колонки.Добавить("Подразделение");
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьТаблицуДляОтчета(ТаблицаДляОтчета, ТаблицаДанных, ПолеОбъектаАнализа) Экспорт
	
	Для Каждого ТекСтрока Из ТаблицаДанных Цикл
		
		НоваяСтрока	= ТаблицаДляОтчета.Добавить();
		
		НоваяСтрока.ОбъектАнализа	= ТекСтрока[ПолеОбъектаАнализа];
		НоваяСтрока.ОборотАнализ	= ТекСтрока.ОборотАнализ;
		НоваяСтрока.ОборотСравнение	= ТекСтрока.ОборотСравнение;
		НоваяСтрока.ОборотАнализКоличество		= ТекСтрока.КоличествоАнализ;
		НоваяСтрока.ОборотСравнениеКоличество	= ТекСтрока.КоличествоСравнение;
		
	КонецЦикла;
	
	ТаблицаДляОтчета.Свернуть("ОбъектАнализа, Номенклатура, Подразделение", 
		"ОборотАнализ, ОборотСравнение,ОборотАнализКоличество,ОборотСравнениеКоличество");
	ТаблицаДляОтчета.Колонки.Добавить("ГруппаАнализаРодитель");
	ТаблицаДляОтчета.Колонки.Добавить("ГруппаАнализа");
	ТаблицаДляОтчета.Колонки.Добавить("Рейтинг1");
	ТаблицаДляОтчета.Колонки.Добавить("Рейтинг2");
	ТаблицаДляОтчета.Колонки.Добавить("Рейтинг1Количество");
	ТаблицаДляОтчета.Колонки.Добавить("Рейтинг2Количество");
	ТаблицаДляОтчета.Колонки.Добавить("Количество");
	
	ТаблицаДляОтчета.ЗаполнитьЗначения(1, "Количество");
	
	ЗаполнитьРейтинги(ТаблицаДляОтчета, "ОборотСравнениеКоличество", "Рейтинг2Количество");
	ЗаполнитьРейтинги(ТаблицаДляОтчета, "ОборотАнализКоличество", "Рейтинг1Количество");
	
	ЗаполнитьРейтинги(ТаблицаДляОтчета, "ОборотСравнение", "Рейтинг2");
	ЗаполнитьРейтинги(ТаблицаДляОтчета, "ОборотАнализ", "Рейтинг1");
	
		
КонецПроцедуры

#КонецОбласти

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Настройки	= КомпоновщикНастроек.ПолучитьНастройки();
	
	ТаблицаДанных	= ПолучитьТаблицуДанных(Настройки);
	ТаблицаДляОтчета	= ПолучитьСтруктуруТаблицыДляОтчета();
	
	ВариантФормирования	= КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(Настройки, "ВариантФормирования");
	
	ЗаполнитьТаблицуДляОтчета(ТаблицаДляОтчета, ТаблицаДанных, ПолеОбъектаАнализа(ВариантФормирования.Значение));
	
	КорректироватьОтборы(Настройки, Ложь);
	
	КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки		= КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ВнешниеНаборы	= Новый Структура;
	ВнешниеНаборы.Вставить("ТаблицаДляОтчета", ТаблицаДляОтчета);
	
	ПроцессорКомпоновки	= Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборы, ДанныеРасшифровки);
	
	ВременныйДокумент	= Новый ТабличныйДокумент;
	
	ПроцессорВывода	= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ВременныйДокумент);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Макет	= ПолучитьМакет("МакетШапки");
	Область	= Макет.ПолучитьОбласть("Шапка");
	ДокументРезультат.Вывести(Область);
	ДокументРезультат.Вывести(ВременныйДокумент);
	
КонецПроцедуры

Процедура КорректироватьОтборы(Настройки, Использование) 
	
	Для Каждого Элемент Из Настройки.Отбор.Элементы Цикл
		Элемент.Использование	= Использование;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолеОбъектаАнализа(Вариант) 
	
	Если Вариант = 1 Тогда
		Возврат "Группа";
	ИначеЕсли Вариант = 2 Тогда
		Возврат "Склад";
	ИначеЕсли Вариант = 3 Тогда
		Возврат "Бренд";
	ИначеЕсли Вариант = 4 Тогда
		Возврат "Покупатель";
	ИначеЕсли Вариант = 5 Тогда
		Возврат "Подразделение";
	ИначеЕсли Вариант = 6 Тогда
		Возврат "Поставщик";
	Иначе
		Возврат "Номенклатура";
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьРейтинги(ТаблицаДляОтчета, ПолеРасчета, ПолеРейтинга)
	
	ПроцентАВС	= 0.8;
	ПроцентХ	= 0.2;
	ПроцентЗ	= 0.01;
	
	ПроцентА	= 0.4;
	ПроцентВ	= ПроцентА + 0.24;
	ПроцентС	= ПроцентВ + 0.16;
	
	Оборот_Сум	= ТаблицаДляОтчета.Итог(ПолеРасчета);
		
	ТаблицаДляОтчета.Сортировать(ПолеРасчета + " Убыв");
	НакопленнаяСумма 	= 0;
	СчетчикРейтингов	= Новый Соответствие;
	СчетчикРейтингов.Вставить("A", 0);
	СчетчикРейтингов.Вставить("B", 0);
	СчетчикРейтингов.Вставить("C", 0);
	СчетчикРейтингов.Вставить("X", 0);
	СчетчикРейтингов.Вставить("Z", 0);
	Для Каждого ТекСтрока Из ТаблицаДляОтчета Цикл
		
		Если НакопленнаяСумма < Оборот_Сум * ПроцентАВС Тогда
			Если НакопленнаяСумма < Оборот_Сум * ПроцентА Тогда 
				ТекСтрока.ГруппаАнализа = "A";
			ИначеЕсли НакопленнаяСумма < Оборот_Сум * ПроцентВ Тогда 
				ТекСтрока.ГруппаАнализа = "B";
			Иначе
				ТекСтрока.ГруппаАнализа = "C";
			КонецЕсли;
			ТекСтрока.ГруппаАнализаРодитель = "ABC";
		ИначеЕсли НакопленнаяСумма < Оборот_Сум * (ПроцентАВС + ПроцентХ - ПроцентЗ) Тогда
			ТекСтрока.ГруппаАнализа = "X";
			ТекСтрока.ГруппаАнализаРодитель = "XZ";
		Иначе
			ТекСтрока.ГруппаАнализа = "Z";
			ТекСтрока.ГруппаАнализаРодитель = "XZ";
		КонецЕсли;
		
		СчетчикРейтингов[ТекСтрока.ГруппаАнализа] = СчетчикРейтингов[ТекСтрока.ГруппаАнализа] + 1;
		ТекСтрока[ПолеРейтинга] = СтрШаблон("%1%2", ТекСтрока.ГруппаАнализа, Формат(СчетчикРейтингов[ТекСтрока.ГруппаАнализа], "ЧЦ=5; ЧВН=; ЧГ="));
		
		НакопленнаяСумма = НакопленнаяСумма + ТекСтрока[ПолеРасчета];
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСвойство(Имя)
	
	Результат	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка();
	
	Запрос	= Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Т.Ссылка КАК Ссылка ИЗ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК Т ГДЕ Т.Имя = &Имя";
	Запрос.УстановитьПараметр("Имя", Имя);
	
	Выборка	= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат	= Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции