

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "ТаблицаИсточников");
	Процент = 30;
	
КонецПроцедуры

&НаКлиенте
Процедура Пополнить(Команда)
	
	МассивИсточников	= Новый Массив;
	Для Каждого Элемент Из ТаблицаИсточников Цикл
		Если Элемент.Пометка И НЕ Элемент.Значение = Склад Тогда
			МассивИсточников.Добавить(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Результат	= Новый Структура;
	Результат.Вставить("Склад", Склад);
	Результат.Вставить("Процент", Процент);
	Результат.Вставить("МассивИсточников", МассивИсточников);
	
	Закрыть(Результат);
	
КонецПроцедуры
