////////////////////////////////////////////////////////////////////////////////
// Область Атолл (REST v2)

// Область Авторизация

// Возвращает структуру:
// 	Получены 	 - булево - Истина, в случае успешной авторизации, иначе Ложь
//  Токен        - строка - токен полученный в результате авторизации
//  РезультатAPI - структура - ответ API
//
//	Параметры:
//	ПрофильОбмена - ссылка на элемент справочника ЭКОМ_ПрофилиОбмена	
Функция ВыполнитьАвторизациюАтолл(ПрофильОбмена) Экспорт
	ДанныеАвторизации = Новый Структура;
	ДанныеАвторизации.Вставить("Получены", Ложь);
	ДанныеПодключения = ПолучитьДанныеПодключенияEvolution(ПрофильОбмена);
	Если ДанныеПодключения.ПолученПрофиль Тогда
		ДанныеАвторизации = ВыполнитьАвторизациюАтолл_БезДанных(ДанныеПодключения);
	КонецЕсли;
	
	Возврат ДанныеАвторизации; 		
КонецФункции

// Возвращает структуру:
// 	Получены 	 - булево - Истина, в случае успешной авторизации, иначе Ложь
//  Токен        - строка - токен полученный в результате авторизации
//  РезультатAPI - структура - ответ API
//
//	Параметры:
//	ДанныеПодключения - структура
//		- ИмяПользователя    - строка - логин учетной записи e-vo.ru
//		- ПарольПользователя - строка - пароль учетной записи e-vo.ru
//		- Сервер			 - строка - сервер REST API
Функция ВыполнитьАвторизациюАтолл_БезДанных(ДанныеПодключения) Экспорт
	МассивЛогаСобытий = Новый Массив;
	ДанныеАвторизации = Новый Структура;
	ДанныеАвторизации.Вставить("Получены", Ложь);
	
	ИмяМетода = "/api/v2/edo/index/authorize";
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("varLogin", ДанныеПодключения.ИмяПользователя);
	ТелоЗапроса.Вставить("varPassword", ДанныеПодключения.ПарольПользователя);
	РезультатAPI = ВыполнитьЗапросAPI(ДанныеПодключения.Сервер, , ИмяМетода, ТелоЗапроса);
	
	Если РезультатAPI.Успешно Тогда
		ДанныеАвторизации.Получены = Истина;
		ДанныеАвторизации.Вставить("Токен", РезультатAPI.Заголовки.Получить("X-Auth-Token"));
		// TODO: заменить на ЭКОМ_ОбщегоНазначения.НастройкаПараметрЗаписать
		ЗаписатьТокен(ДанныеАвторизации.Токен);
	КонецЕсли;
	
	ДанныеАвторизации.Вставить("РезультатAPI", РезультатAPI);
	
	Возврат ДанныеАвторизации;		
КонецФункции
// КонецОбласти Авторизация

// Область ИзменениеСтатусовДокументов 

// Вызывает выполнение запроса API PATCH /api/v2/edi/documents, возвращает структуру:
//		- Успешно - булево - обязательный
//		- Ответ	  - Соответствие, ответ API
// Параметры:
//ПараметрыМетода - тип структура - параметры метода PATCH /api/v2/edi/documents
//					gln - строка - обязательный
//					doc_id - строка - обязательный
//					status - строка - обязательный  
//					description - строка - обязательный
//ДанныеПодключения - тип структура - данные о сервере, токене для выполнения метода API
//					 Сервер - строка (адрес сервера)
//					 Токен  - строка (токен из РС ЭКОМ значения доп констант)
Функция ОтметитьEdiПрочитанными(ПараметрыМетода, ДанныеПодключения) Экспорт
	ИмяМетода = "/api/v2/edi/documents/";
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("X-Auth-Token", ДанныеПодключения.Токен);
	
	ЗаполнитьПараметрыМетода(ИмяМетода, ПараметрыМетода);
	РезультатAPI = ВыполнитьЗапросAPI(ДанныеПодключения.Сервер,, ИмяМетода,, Заголовки, "PATCH");    
	
	Возврат РезультатAPI;
КонецФункции

// Вызывает выполнение запроса API PATCH /edo/timeline/event, возвращает структуру:
//		- Успешно - булево - обязательный
//		- Ответ	  - Соответствие, ответ API
// Параметры:
//ПараметрыМетода - тип структура - параметры метода PATCH /edo/timeline/event
//					guid - строка - обязательный, идентификатор пользователя, участника ЮЗД обмена
//					identifier - строка - обязательный, идентификатор документа УПД/УКД или квитанции. Строка в формате GUID
//					read - булево - обязательный, признак прочтения (True/False)  
//ДанныеПодключения - тип структура - данные о сервере, токене для выполнения метода API
//					 Сервер - строка (адрес сервера)
//					 Токен  - строка (токен из РС ЭКОМ значения доп констант)
Функция ОтметитьЮЗДПрочитанными(ПараметрыМетода, ДанныеПодключения) Экспорт
	ИмяМетода = "/api/v2/edo/timeline/event/";
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("X-Auth-Token", ДанныеПодключения.Токен);
	
	ЗаполнитьПараметрыМетода(ИмяМетода, ПараметрыМетода);
	РезультатAPI = ВыполнитьЗапросAPI(ДанныеПодключения.Сервер,, ИмяМетода,, Заголовки, "PATCH");    
	Возврат РезультатAPI;
КонецФункции

// Вызывает выполнение запроса API PATCH /condras/timeline/event, возвращает структуру:
//		- Успешно - булево - обязательный
//		- Ответ	  - Соответствие, ответ API
// Параметры:
//ПараметрыМетода - тип структура - параметры метода PATCH /condras/timeline/event
//					guid - строка - обязательный
//					doc_uuid - строка - обязательный, идентификатор изменяемого документа
//					read - булево - обязательный, признак прочтения (True/False)  
//ДанныеПодключения - тип структура - данные о сервере, токене для выполнения метода API
//					 Сервер - строка (адрес сервера)
//					 Токен  - строка (токен из РС ЭКОМ значения доп констант)
Функция ОтметитьCONDRAПрочитанными(ПараметрыМетода, ДанныеПодключения) Экспорт
	ИмяМетода = "/api/v2/edo/condras/timeline/event/";
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("X-Auth-Token", ДанныеПодключения.Токен);
	
	ЗаполнитьПараметрыМетода(ИмяМетода, ПараметрыМетода);
	РезультатAPI = ВыполнитьЗапросAPI(ДанныеПодключения.Сервер,, ИмяМетода,, Заголовки, "PATCH");    
	Возврат РезультатAPI;
КонецФункции
// КонецОбласти ИзменениеСтатусовДокументов 

// Область ПолучениеВходящихДокументов 
// Область EDI

// Вызывает выполнение запроса API /documents/bodies, возвращает структуру:
//		- Успешно - булево - обязательный
//		- ФайлXML - файл
//		- Ответ	  - Соответствие, ответ API
// Параметры:
//ПараметрыМетода - тип структура - параметры метода GET /api/v2/edi/documents/bodies/
//					gln - строка - обязательный
//					doc_id - строка - обязательный
//ДанныеПодключения - тип структура - данные о сервере, токене для выполнения метода API
//					 Сервер - строка (адрес сервера)
//					 Токен  - строка (токен из РС ЭКОМ значения доп констант)
Функция ПолучитьВходящийДокументEDI(ПараметрыМетода, ДанныеПодключения, Каталог, ТипДокумента) Экспорт
	ИмяМетода  = "/api/v2/edi/documents/bodies/"; 	
	Заголовки  = Новый Соответствие;
	Заголовки.Вставить("X-Auth-Token", ДанныеПодключения.Токен);
	ЗаполнитьПараметрыМетода(ИмяМетода, ПараметрыМетода);
	
	РезультатAPI = ВыполнитьЗапросAPI(ДанныеПодключения.Сервер,, ИмяМетода,, Заголовки); 
	Результат = РезультатAPI;
	Если РезультатAPI.Успешно Тогда
		Идентификатор   = ПараметрыМетода.gln + "_" + ПараметрыМетода.doc_id;
		СтрокаСообщения = РезультатAPI.Ответ.Получить("СтрокаОтвет");
		ТелоДокумента   = РезультатAPI.Ответ.Получить("body");
		ИмяФайла 	    = Каталог +  ТипДокумента + "_" + Идентификатор + ".xml";
		
		КодировкаXML  = "UTF-8";
		СтрокаXML 	  = Входящий_EDI_JSON_В_XML(СтрокаСообщения, ТелоДокумента, ТипДокумента, Каталог, ИмяФайла, КодировкаXML); 
		Результат.Вставить("СтрокаXML", СтрокаXML);
		Результат.Вставить("ИмяФайла" , ИмяФайла); 	
		Результат.Вставить("ФайлBody" , Новый Файл(ИмяФайла)); 	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Вызывает выполнение запроса API /edi/documents, возвращает Массив документов edo с отбором по типу
//
// Параметры:
// ПараметрыМетода - Структура - параметры метода GET /api/v2/edi/documents
//					gln  	 - Строка - обязательный (gln или Guid), идентификатор пользователя, участника EDI обмена.
//					status 	 - Строка - обязательный, статус документа (sent, delivered, inbox, read, error).
//					doc_type - Строка - обязательный, тип документа (Order, Ordrsp, Desadv, Recadv, 
//															Insdes, Desscc, Invoice, Alcdes, Retann, Retins, Pricat).
//					limit    - Строка - количество выводимых документов при чтении ленты за 1 раз; по умолчанию значение «40»  
// ДанныеПодключения - Структура - данные о сервере, токене (ПолучитьДанныеПодключенияEvolution)
// ТипДокумента - Строка - Тип документа по которому состоялось событие.
//			Значения: UPD_SCHFDOP, UPD_SCHF
Функция ПолучитьСписокВходящихДокументовEDI(ПараметрыМетода, ДанныеПодключения) Экспорт
	ИмяМетода = "/api/v2/edi/documents/";
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("X-Auth-Token", ДанныеПодключения.Токен);
	
	ЗаполнитьПараметрыМетода(ИмяМетода, ПараметрыМетода);
	РезультатAPI     = ВыполнитьЗапросAPI(ДанныеПодключения.Сервер,, ИмяМетода,, Заголовки);  
	МассивДокументов = Новый Массив;
	Если РезультатAPI.Успешно Тогда 
		МассивДокументов = РезультатAPI.Ответ.Получить("documents");
	КонецЕсли;
	
	Возврат МассивДокументов;
КонецФункции

// Возвращает строку, соответствие типа документа REST API v2 типу документа модуля docrobot
//
// Параметры:
//	ТипДокумента 	    - строка - тип документа модуля docrobot
//	ТипДокументооборота - строка - тип документооборота ("EDI", "ЮЗД", "CNDR") 
Функция ПреобразоватьТипДокументаКЗначениюАтолл(Знач ТипДокумента, ТипДокументооборота) Экспорт
	Если ТипДокументооборота = "EDI" Тогда
		ТипДокумента = НРег(ТипДокумента);
		Если ТипДокумента = "order" Или ТипДокумента = "retin" Тогда
			ТипДокумента = ТипДокумента + "s";         	
		КонецЕсли;
	Иначе
		ТипыEdoTimeline = СоответствиеTypeTimelineТипамДокументов_Атолл();
		ТипДокумента = ТипыEdoTimeline.Получить(ТипДокумента);  
		Если ТипДокумента = Неопределено Тогда
			ТипДокумента = "";
		КонецЕсли;   
	КонецЕсли;   
	
	Возврат ТипДокумента;
КонецФункции
// КонецОбласти EDI

// Область ЮЗД  

// Вызывает выполнение запроса API /event/content, возвращает структуру:
//		- Успешно - булево - обязательный
//		- ФайлXML - файл
//		- Signs   - файл
//		- Ответ	  - Соответствие, ответ API
// Параметры:
//ПараметрыМетода - тип структура - параметры метода GET /api/v2/edo/timeline/event/content/
//					gln  	 - строка - обязательный (gln или Guid), идентификатор пользователя, участника EDI обмена.
//					Guid 	 - строка - обязательный (gln или Guid), идентификатор пользователя, участника ЮЗД обмена.
//					doc_uuid - строка - обязательный, идентификатор документа УПД/УКД или квитанции. Строка в формате GUID.
//ДанныеПодключения - тип структура - данные о сервере, токене для выполнения метода API
//					 Сервер - строка (адрес сервера)
//					 Токен  - строка (токен из РС ЭКОМ значения доп констант)
Функция ПолучитьВходящийДокументЮЗД(ПараметрыМетода, ДанныеПодключения, Каталог, ТипДокумента) Экспорт
	ИмяМетода  = "/api/v2/edo/timeline/event/content/"; 	
	Заголовки  = Новый Соответствие;
	Заголовки.Вставить("X-Auth-Token", ДанныеПодключения.Токен);
	ЗаполнитьПараметрыМетода(ИмяМетода, ПараметрыМетода);
	
	РезультатAPI = ВыполнитьЗапросAPI(ДанныеПодключения.Сервер,, ИмяМетода,, Заголовки); 
	Результат    = РезультатAPI;
	Если РезультатAPI.Успешно Тогда
		Идентификатор = ПараметрыМетода.guid + "_" + ПараметрыМетода.doc_uuid;
		ФайлТело      = ФайлИзBase64(РезультатAPI.Ответ.Получить("body"), Каталог, ТипДокумента, Идентификатор, ".xml");
		Результат.Вставить("ФайлBody", ФайлТело);
		
		МассивSigns = РезультатAPI.Ответ.Получить("signs");
		Если ТипЗнч(МассивSigns) = Тип("Массив") Тогда
			МассивПодписей = Новый Массив;
			Для Каждого Элемент Из МассивSigns Цикл
				ФайлПодпись = ФайлИзBase64(Элемент.Получить("body"), Каталог, ТипДокумента, Идентификатор, ".bin");
				МассивПодписей.Добавить(ФайлПодпись);
			КонецЦикла;
			Результат.Вставить("МассивПодписей", МассивПодписей);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Вызывает выполнение запроса API /edo/timeline, возвращает Массив документов edo с отбором по типу
//
// Параметры:
// ПараметрыМетода - Структура - параметры метода GET /api/v2/edo/timeline/event/content/
//					gln  	 - Строка - обязательный (gln или Guid), идентификатор пользователя, участника EDI обмена.
//					Guid 	 - Строка - обязательный (gln или Guid), идентификатор пользователя, участника ЮЗД обмена.
//					unread   - Булево - Состояние события (документа): прочитан - 0, не прочитан - 1.
//					limit    - Строка - количество выводимых документов при чтении ленты за 1 раз; по умолчанию значение «40» 
// ДанныеПодключения - Структура - данные о сервере, токене (ПолучитьДанныеПодключенияEvolution)
// ТипДокумента - Строка - Тип документа по которому состоялось событие.
//			Значения: UPD_SCHFDOP, UPD_SCHF
Функция ПолучитьСписокВходящихДокументовЮЗД(ПараметрыМетода, ДанныеПодключения, ТипДокумента) Экспорт
	ИмяМетода = "/api/v2/edo/timeline/";
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("X-Auth-Token", ДанныеПодключения.Токен);
	ЗаполнитьПараметрыМетода(ИмяМетода, ПараметрыМетода);
	
	РезультатAPI 	 = ВыполнитьЗапросAPI(ДанныеПодключения.Сервер,, ИмяМетода,, Заголовки);  
	МассивДокументов = Новый Массив;
	Если РезультатAPI.Успешно Тогда 
		TimeLine = РезультатAPI.Ответ.Получить("timeLine");
		Для Каждого Элемент Из TimeLine Цикл
			Если Элемент <> Неопределено И ТипДокумента = Элемент.Получить("type") Тогда
				МассивДокументов.Добавить(Элемент);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивДокументов;
КонецФункции
// КонецОбласти ЮЗД

// Область CONDRA

// Вызывает выполнение запроса API /condras/content, возвращает структуру:
//		- Успешно - булево - обязательный
//		- Файл - файл
//		- Sign - файл
//		- Ответ	  - Соответствие, ответ API
// Параметры:
//ПараметрыМетода - тип структура - параметры метода GET /api/v2/edo/timeline/event/content/
//					gln  	 - строка - обязательный (gln или Guid), идентификатор пользователя, участника EDI обмена.
//					Guid 	 - строка - обязательный (gln или Guid), идентификатор пользователя, участника ЮЗД обмена.
//					doc_uuid - строка - Идентификатор запрашиваемого документа.
//					limit    - Строка - количество выводимых документов при чтении ленты за 1 раз; по умолчанию значение «40» 
//ДанныеПодключения - тип структура - данные о сервере, токене для выполнения метода API
//					 Сервер - строка (адрес сервера)
//					 Токен  - строка (токен из РС ЭКОМ значения доп констант)
Функция ПолучитьВходящийДокументCONDRA(ПараметрыМетода, ДанныеПодключения, Каталог, ТипДокумента) Экспорт
	ИмяМетода  = "/api/v2/edo/condras/content/"; 	
	Заголовки  = Новый Соответствие;
	Заголовки.Вставить("X-Auth-Token", ДанныеПодключения.Токен);
	ЗаполнитьПараметрыМетода(ИмяМетода, ПараметрыМетода);
	
	РезультатAPI = ВыполнитьЗапросAPI(ДанныеПодключения.Сервер,, ИмяМетода,, Заголовки); 
	Результат = РезультатAPI;
	Если РезультатAPI.Успешно Тогда
		Идентификатор = ПараметрыМетода.gln + " - " + ПараметрыМетода.docID;
		ФайлТело      = ФайлИзBase64(РезультатAPI.Ответ.Получить("body"), Каталог, ТипДокумента, Идентификатор, ".tmp");
		ФайлПодпись   = ФайлИзBase64(РезультатAPI.Ответ.Получить("sign"), Каталог, ТипДокумента,  Идентификатор, ".bin");
		Результат.Вставить("ФайлBody"   , ФайлТело);
		Результат.Вставить("ФайлПодпись", ФайлПодпись);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Вызывает выполнение запроса API /condras/timeline, возвращает Массив документов edo с отбором по типу
//
// Параметры:
// ПараметрыМетода - Структура - параметры метода GET /api/v2/edo/timeline/event/content/
//					gln  	 - Строка - обязательный (gln или Guid), идентификатор пользователя, участника EDI обмена.
//					Guid 	 - Строка - обязательный (gln или Guid), идентификатор пользователя, участника ЮЗД обмена.
//					unread   - Булево - Состояние события (документа): прочитан - 0, не прочитан - 1.
// ДанныеПодключения - Структура - данные о сервере, токене (ПолучитьДанныеПодключенияEvolution)
Функция ПолучитьСписокВходящихДокументовCONDRA(ПараметрыМетода, ДанныеПодключения) Экспорт
	ИмяМетода = "/api/v2/edo/condras/timeline/";
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("X-Auth-Token", ДанныеПодключения.Токен);
	ЗаполнитьПараметрыМетода(ИмяМетода, ПараметрыМетода);
	
	РезультатAPI 	 = ВыполнитьЗапросAPI(ДанныеПодключения.Сервер,, ИмяМетода,, Заголовки);    
	МассивДокументов = Новый Массив; 
	Если РезультатAPI.Успешно Тогда 
		МассивДокументов = РезультатAPI.Ответ.Получить("timeLine");
	КонецЕсли;
	
	Возврат МассивДокументов;
КонецФункции
// КонецОбласти CONDRA  
// КонецОбласти ПолучениеВходящихДокументов

// Область ОтправкаДокументов

// Вызывает выполнение запроса API /api/v2/edo/document/, возвращает структуру:
//		- Успешно - булево - обязательный
//		- ДокИд - Строка - Идентификатор документа полученный ответом от API
//		- Ответ	  - Соответствие, ответ API
// Параметры:
//ТелоЗапроса - тип Соответствие - параметры метода POST /api/v2/edo/document
//					body - Строка - обязательный. Тело документа преобразованного к строке в кодировке BASE64.
//					docType - Строка - обязательный. Тип передаваемого дкоумента.
//					docName - Строка - Параметр обязателен при отправке EDI документов.
//					Sign - Строка - Электронно-цифровая подпись документа преобразованная к строке в кодировке BASE64.
//					Signs - Массив - Массив данных по электронно-цифровой подписи.
//ДанныеПодключения - тип структура - данные о сервере, токене для выполнения метода API
//					 Сервер - строка (адрес сервера)
//					 Токен  - строка (токен из РС ЭКОМ значения доп констант)
Функция Отправить_ДокументEDI_ЮЗД_Атолл(ТелоЗапроса, ДанныеПодключения) Экспорт
	ИмяМетода  = "/api/v2/edo/document"; 	
	Заголовки  = Новый Соответствие;
	Заголовки.Вставить("X-Auth-Token", ДанныеПодключения.Токен);
	
	ЭтоДокументEDI = ТелоЗапроса.Получить("docName") <> Неопределено;
	
	РезультатAPI = ВыполнитьЗапросAPI(ДанныеПодключения.Сервер,, ИмяМетода, ТелоЗапроса, Заголовки); 
	Если РезультатAPI.Успешно Тогда
		Если ЭтоДокументEDI Тогда
			ДокИд = РезультатAPI.Ответ.Получить("doc_id");
		Иначе
			ДокИд = РезультатAPI.Ответ.Получить("docUUID");
		КонецЕсли;
		РезультатAPI.Вставить("ДокИД" , ДокИд); 	
	КонецЕсли;
	
	Возврат РезультатAPI;
КонецФункции

// Вызывает выполнение запроса API /api/v2/edo/condra, возвращает структуру:
//		- Успешно - булево - обязательный
//		- ДокИд - Строка - Идентификатор документа полученный ответом от API
//		- Ответ	  - Соответствие, ответ API
// Параметры:
//ТелоЗапроса - тип Соответствие - параметры метода POST /api/v2/edo/condra
//					date - Дата - обязательный - Дата создания неструктурированного документа.
//					number - Строка - Номер неструктурированного документа.
//					condraType - Строка - Тип неструктурированного документа.
//					sender - Строка - Электронно- полный guid отправителя.
//					recipient - Строка - полный guid получателя.
//					body - Дата - Тело документа преобразованное к BASE64 строке.
//					fileName - Строка - Имя файла.
//					contractDate - Строка - Дата договора, в рамках которого отправляется неструктурированный документ.
//					contractNumber - Строка - Номер договора, в рамках которого отправляется неструктурированный документ.
//					info - Строка - Дополнительная информация по документу.
//					internalID - Строка - Номер документа в ученой системе отправителя..
//					sign - Строка - Тело подписи преобразованное к BASE64 строке.
//ДанныеПодключения - тип структура - данные о сервере, токене для выполнения метода API
//					 Сервер - строка (адрес сервера)
//					 Токен  - строка (токен из РС ЭКОМ значения доп констант)
Функция ОтправитьCONDRAАтолл(ТелоЗапроса, ДанныеПодключения) Экспорт
	ИмяМетода  = "/api/v2/edo/condra"; 	
	Заголовки  = Новый Соответствие;
	Заголовки.Вставить("X-Auth-Token", ДанныеПодключения.Токен);
	
	РезультатAPI = ВыполнитьЗапросAPI(ДанныеПодключения.Сервер,, ИмяМетода, ТелоЗапроса, Заголовки); 
	Если РезультатAPI.Успешно Тогда
			ДокИд = РезультатAPI.Ответ.Получить("docUUID");
	КонецЕсли;
	
	Возврат РезультатAPI;
КонецФункции
// КонецОбласти ОтправкаДокументов 
// КонецОбласти Атолл (REST v2)

////////////////////////////////////////////////////////////////////////////////
// Область Evolution_v3
// Область ПолучениеВходящихДокументов
// Область EDI 

// Вызывает выполнение запроса API v3 /Api/V1/Edo/Document/GetEdiDocBody, возвращает структуру:
//		- Успешно - булево - обязательный
//		- ФайлXML - файл
//		- Ответ	  - Соответствие, ответ API
// Параметры:
//ПараметрыМетода - тип структура - параметры метода GET /api/v2/edi/documents/bodies/
//					gln   - строка - обязательный
//					ДокИд - строка - обязательный
//ДанныеПодключения - тип структура - данные о сервере, токене для выполнения метода API
//					 Сервер - строка (адрес сервера)
//					 Токен  - строка (токен из РС ЭКОМ значения доп констант)
Функция ПолучитьВходящийДокументEDIv3(ПараметрыМетода, ДанныеПодключения, Каталог, ТипДокумента) Экспорт
	ИмяМетода  = "/Api/V1/Edo/Document/GetEdiDocBody"; 	
	ТелоЗапроса = Новый Соответствие;
	ТелоЗапроса.Вставить("intDocID", ПараметрыМетода.ДокИд);
	ТелоЗапроса.Вставить("varToken", ДанныеПодключения.Токен);
	
	РезультатAPI = ВыполнитьЗапросAPI(ДанныеПодключения.Сервер,, ИмяМетода, ТелоЗапроса); 
	Результат = РезультатAPI;
	Если РезультатAPI.Успешно Тогда
		Идентификатор = ПараметрыМетода.gln + "-" + ПараметрыМетода.ДокИд;
		ТелоДокумента = РезультатAPI.Ответ.Получить("body");
		ИмяФайла 	  = Каталог +  ТипДокумента + "_" + Идентификатор + ".xml";
		
		СтрокаXML 	  = ЗаписатьВходящийEDI_В_XML(Каталог, ТипДокумента, ИмяФайла, ТелоДокумента, "UTF-8"); 
		Результат.Вставить("СтрокаXML", СтрокаXML);
		Результат.Вставить("ИмяФайла" , ИмяФайла); 	
		Результат.Вставить("ФайлBody" , Новый Файл(ИмяФайла)); 	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Вызывает выполнение запроса API /edi/documents, возвращает Массив соответствий с отбором по типу. Соответствие:
//		- intDocID - идентификатор дкоумента
//		- doc_type - тип документа
//		- date     - Дата и время создания (получения) документа на платформе
//
// Параметры:
// ПараметрыМетода - Структура - параметры метода GET /api/v2/edi/documents
//					unread   - строка - обязательный
//					doc_type - строка - обязательный / Order, Ordrsp, Desadv, Recadv, Insdes, Desscc, Invoice, Alcdes, Retann, Retins, Pricat
// ДанныеПодключения - Структура - данные о сервере, токене (ПолучитьДанныеПодключенияEvolution)
Функция ПолучитьСписокВходящихДокументовEDIv3(ПараметрыМетода, ДанныеПодключения) Экспорт
	ИмяМетода 	= "Api/V1/Edo/Document/GetEdiDocs/";
	ТелоЗапроса = Новый Соответствие;
	ТелоЗапроса.Вставить("unread"  , ПараметрыМетода.unread);  // 0 - не прочитан, 1 - прочитан. Если указать, устанавливается соотв. отбор.
	ТелоЗапроса.Вставить("doc_type", ПараметрыМетода.doc_type);  // В случае указания, в ответе выводиться список только документов соответствующего типа.
	ТелоЗапроса.Вставить("varToken", ДанныеПодключения.Токен);  // 
	//ТелоЗапроса.Вставить("timefrom", ); // возможные форматы: ГГГГ-ММ-ДД ЧЧ:ММ:СС / "ГГГГ-ММ-ДД ЧЧ:ММ" / "ГГГГ-ММ-ДД"
	//ТелоЗапроса.Вставить("timeto"	 , ); // возможные форматы: ГГГГ-ММ-ДД ЧЧ:ММ:СС / "ГГГГ-ММ-ДД ЧЧ:ММ" / "ГГГГ-ММ-ДД"
	//ТелоЗапроса.Вставить("limit"	 , ); // возможные форматы: (=1000 по умолчанию)
	//ТелоЗапроса.Вставить("page"	 , );
	
	ЗаполнитьПараметрыМетода(ИмяМетода, ПараметрыМетода);
	РезультатAPI	 = ВыполнитьЗапросAPI(ДанныеПодключения.Сервер,, ИмяМетода, ТелоЗапроса);
	МассивДокументов = Новый Массив;
	Если РезультатAPI.Успешно Тогда 
		МассивДокументов = РезультатAPI.Ответ.Получить("docs");
	КонецЕсли;
	
	Возврат МассивДокументов;
КонецФункции
// КонецОбласти EDI 
Функция ПреобразоватьТипДокументаКЗначениюАтоллv3(Знач ТипДокумента) Экспорт
	ТипДокумента = НРег(ТипДокумента);
	Если ТипДокумента = "order" Или ТипДокумента = "retin" Тогда
		ТипДокумента = ТипДокумента + "s";
	КонецЕсли;
	
	Возврат ТипДокумента;
КонецФункции

// Область ЮЗД  

// Вызывает выполнение запроса API /event/content, возвращает структуру:
//		- Успешно - булево - обязательный
//		- ФайлXML - файл
//		- Signs   - файл
//		- Ответ	  - Соответствие, ответ API
// Параметры:
//ПараметрыМетода - тип структура - параметры метода GET /api/v2/edo/timeline/event/content/
//					gln  	 - строка - обязательный (gln или Guid), идентификатор пользователя, участника EDI обмена.
//					Guid 	 - строка - обязательный (gln или Guid), идентификатор пользователя, участника ЮЗД обмена.
//					doc_uuid - строка - обязательный, идентификатор документа УПД/УКД или квитанции. Строка в формате GUID.
//ДанныеПодключения - тип структура - данные о сервере, токене для выполнения метода API
//					 Сервер - строка (адрес сервера)
//					 Токен  - строка (токен из РС ЭКОМ значения доп констант)
Функция ПолучитьВходящийДокументЮЗДv3(ПараметрыМетода, ДанныеПодключения, Каталог, ТипДокумента) Экспорт
	ИмяМетода  = "/api/v2/edo/timeline/event/content/"; 	
	Заголовки  = Новый Соответствие;
	Заголовки.Вставить("X-Auth-Token", ДанныеПодключения.Токен);
	ЗаполнитьПараметрыМетода(ИмяМетода, ПараметрыМетода);
	
	РезультатAPI = ВыполнитьЗапросAPI(ДанныеПодключения.Сервер,, ИмяМетода,, Заголовки); 
	Результат    = РезультатAPI;
	Если РезультатAPI.Успешно Тогда
		Идентификатор = ПараметрыМетода.gln + " - " + ПараметрыМетода.doc_uuid;
		ФайлТело      = ФайлИзBase64(РезультатAPI.Ответ.Получить("body"), Каталог, ТипДокумента, Идентификатор, ".xml");
		Результат.Вставить("ФайлBody", ФайлТело);
		
		МассивSigns = РезультатAPI.Ответ.Получить("signs");
		Если ТипЗнч(МассивSigns) = Тип("Массив") Тогда
			МассивПодписей = Новый Массив;
			Для Каждого Элемент Из МассивSigns Цикл
				ФайлПодпись = ФайлИзBase64(Элемент.Получить("body"), Каталог, ТипДокумента, Идентификатор, ".bin");
				МассивПодписей.Добавить(ФайлПодпись);
			КонецЦикла;
			Результат.Вставить("МассивПодписей", МассивПодписей);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Вызывает выполнение запроса API /edo/timeline, возвращает Массив документов edo с отбором по типу
//
// Параметры:
// ПараметрыМетода - Структура - параметры метода GET /api/v2/edo/timeline/event/content/
//					gln  	 - Строка - обязательный (gln или Guid), идентификатор пользователя, участника EDI обмена.
//					Guid 	 - Строка - обязательный (gln или Guid), идентификатор пользователя, участника ЮЗД обмена.
//					unread   - Булево - Состояние события (документа): прочитан - 0, не прочитан - 1.
// ДанныеПодключения - Структура - данные о сервере, токене (ПолучитьДанныеПодключенияEvolution)
// ТипДокумента - Строка - Тип документа по которому состоялось событие.
//			Значения: UPD_SCHFDOP, UPD_SCHF
Функция ПолучитьСписокВходящихДокументовЮЗДv3(ПараметрыМетода, ДанныеПодключения, ТипДокумента) Экспорт
	ИмяМетода = "/api/v2/edo/timeline/";
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("X-Auth-Token", ДанныеПодключения.Токен);
	ЗаполнитьПараметрыМетода(ИмяМетода, ПараметрыМетода);
	
	РезультатAPI 	 = ВыполнитьЗапросAPI(ДанныеПодключения.Сервер,, ИмяМетода,, Заголовки);  
	МассивДокументов = Новый Массив;
	Если РезультатAPI.Успешно Тогда 
		TimeLine = РезультатAPI.Ответ.Получить("timeLine");
		Для Каждого Элемент Из TimeLine Цикл
			Если ТипДокумента = Элемент.Получить("type") Тогда
				МассивДокументов.Добавить(Элемент);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивДокументов;
КонецФункции
// КонецОбласти ЮЗД 

// Область CONDRA

// Вызывает выполнение запроса API /condras/content, возвращает структуру:
//		- Успешно - булево - обязательный
//		- Файл - файл
//		- Sign - файл
//		- Ответ	  - Соответствие, ответ API
// Параметры:
//ПараметрыМетода - тип структура - параметры метода GET /api/v2/edo/timeline/event/content/
//					gln  	 - строка - обязательный (gln или Guid), идентификатор пользователя, участника EDI обмена.
//					Guid 	 - строка - обязательный (gln или Guid), идентификатор пользователя, участника ЮЗД обмена.
//					doc_uuid - строка - Идентификатор запрашиваемого документа.
//ДанныеПодключения - тип структура - данные о сервере, токене для выполнения метода API
//					 Сервер - строка (адрес сервера)
//					 Токен  - строка (токен из РС ЭКОМ значения доп констант)
Функция ПолучитьВходящийДокументCONDRAv3(ПараметрыМетода, ДанныеПодключения, Каталог, ТипДокумента) Экспорт
	ИмяМетода  = "/api/v2/edo/condras/content/"; 	
	Заголовки  = Новый Соответствие;
	Заголовки.Вставить("X-Auth-Token", ДанныеПодключения.Токен);
	ЗаполнитьПараметрыМетода(ИмяМетода, ПараметрыМетода);
	
	РезультатAPI = ВыполнитьЗапросAPI(ДанныеПодключения.Сервер,, ИмяМетода,, Заголовки); 
	Результат = РезультатAPI;
	Если РезультатAPI.Успешно Тогда
		Идентификатор = ПараметрыМетода.gln + " - " + ПараметрыМетода.docID;
		ФайлТело      = ФайлИзBase64(РезультатAPI.Ответ.Получить("body"), Каталог, ТипДокумента, Идентификатор, ".tmp");
		ФайлПодпись   = ФайлИзBase64(РезультатAPI.Ответ.Получить("sign"), Каталог, ТипДокумента,  Идентификатор, ".bin");
		Результат.Вставить("ФайлBody"   , ФайлТело);
		Результат.Вставить("ФайлПодпись", ФайлПодпись);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Вызывает выполнение запроса API /condras/timeline, возвращает Массив документов edo с отбором по типу
//
// Параметры:
// ПараметрыМетода - Структура - параметры метода GET /api/v2/edo/timeline/event/content/
//					gln  	 - Строка - обязательный (gln или Guid), идентификатор пользователя, участника EDI обмена.
//					Guid 	 - Строка - обязательный (gln или Guid), идентификатор пользователя, участника ЮЗД обмена.
//					unread   - Булево - Состояние события (документа): прочитан - 0, не прочитан - 1.
// ДанныеПодключения - Структура - данные о сервере, токене (ПолучитьДанныеПодключенияEvolution)
Функция ПолучитьСписокВходящихДокументовCONDRAv3(ПараметрыМетода, ДанныеПодключения) Экспорт
	ИмяМетода = "/api/v2/edo/condras/timeline/";
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("X-Auth-Token", ДанныеПодключения.Токен);
	ЗаполнитьПараметрыМетода(ИмяМетода, ПараметрыМетода);
	
	РезультатAPI 	 = ВыполнитьЗапросAPI(ДанныеПодключения.Сервер,, ИмяМетода,, Заголовки);    
	МассивДокументов = Новый Массив; 
	Если РезультатAPI.Успешно Тогда 
		МассивДокументов = РезультатAPI.Ответ.Получить("timeLine");
	КонецЕсли;
	
	Возврат МассивДокументов;
КонецФункции
// КонецОбласти CONDRA

Функция ВыполнитьАвторизациюEvolutionV3(ДанныеПодключения) Экспорт
	ИмяМетода = "/Api/V1/Edo/Index/Authorize";
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("varLogin", ДанныеПодключения.ИмяПользователя);
	ТелоЗапроса.Вставить("varPassword", ДанныеПодключения.ПарольПользователя);
	РезультатAPI = ВыполнитьЗапросAPI("exite-api.e-vo.ru", , ИмяМетода, ТелоЗапроса);
	
	Если РезультатAPI.Успешно Тогда
		Токен = РезультатAPI.Ответ.Получить("varToken"); 
		ЗаписатьТокен(Токен);
	КонецЕсли;
	
	Возврат РезультатAPI;		
КонецФункции

Функция ИзменитьGlnEvolutionV3(ДанныеПодключения, gln) Экспорт
	ИмяМетода = "/Api/V1/User/ChangeApiGln";
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("gln", gln);
	ТелоЗапроса.Вставить("varToken", ДанныеПодключения.Токен);
	РезультатAPI = ВыполнитьЗапросAPI("exite-api.e-vo.ru", , ИмяМетода, ТелоЗапроса);
	
	Возврат РезультатAPI;		
КонецФункции
// КонецОбласти Evolution_v3

////////////////////////////////////////////////////////////////////////////////
//Область ОбщиеAPI

Функция ВыполнитьЗапросAPI(Сервер, Знач ПортAPI = 443, ИмяМетода, ТелоЗапроса = Неопределено, СвоиЗаголовки = Неопределено, HTTPМетод = "GET") Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Успешно"   , Ложь);
	Результат.Вставить("КодСостояния");
	
	Если СвоиЗаголовки = Неопределено Тогда
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "application/json");
		Заголовки.Вставить("cache-control", "no-cache");
	Иначе
		Заголовки = СвоиЗаголовки;
	КонецЕсли;
	
	ПортAPI		 = ЭКОМ_ОбщегоНазначения.ЭКОМ_ПреобразоватьВЧислоОбщегоНазначения(ПортAPI);
	Соединение   = Новый HTTPСоединение(Сервер, ПортAPI,,,,, Новый ЗащищенноеСоединениеOpenSSL);

	Если Не ТелоЗапроса = Неопределено Тогда
		HTTPМетод = "POST";
		ТекстJSON = ПреобразоватьТелоЗапросаВJSON(ТелоЗапроса);
	КонецЕсли;

	HTTPЗапрос = Новый HTTPЗапрос(ИмяМетода, Заголовки);
	Если HTTPМетод = "POST" Тогда
		HTTPЗапрос.УстановитьТелоИзСтроки(ТекстJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	КонецЕсли;

	ИмяВыходногоФайла = "";
	Попытка
		HTTPОтвет = Соединение.ВызватьHTTPМетод(HTTPМетод, HTTPЗапрос, ИмяВыходногоФайла);
	Исключение
		Результат.КодСостояния = 0;
		Результат.Вставить("ОписаниеОшибки", ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки;
	
	СтрокаОтвет = HTTPОтвет.ПолучитьТелоКакСтроку();
	Если Не (HTTPОтвет.КодСостояния = 200 Или HTTPОтвет.КодСостояния = 201) Тогда
		Результат.Вставить("ОтветТекст", СокрЛП(HTTPОтвет.КодСостояния) + " " + СтрокаОтвет);
		Результат.КодСостояния = HTTPОтвет.КодСостояния;			
		Возврат Результат;
	КонецЕсли;
	
	Если ЭКОМ_ОбщегоНазначения.ПоискВСтроке(СтрокаОтвет, "{") = 1 Тогда
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаОтвет);
		Соответствие = ПрочитатьJSON(ЧтениеJSON, Истина);
		Соответствие.Вставить("Заголовки", HTTPОтвет.Заголовки);
		ЧтениеJSON.Закрыть();
	Иначе
		Соответствие = Новый Соответствие;
	КонецЕсли;
    Соответствие.Вставить("СтрокаОтвет", СтрокаОтвет);
	
	Результат.Успешно 	   = Истина;
	Результат.КодСостояния = HTTPОтвет.КодСостояния;
	Результат.Вставить("Ответ", Соответствие);
	Результат.Вставить("Заголовки", HTTPОтвет.Заголовки);
	
	Возврат Результат;
КонецФункции

Функция ПреобразоватьТелоЗапросаВJSON(ТелоЗапроса) Экспорт
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ТелоЗапроса);
	ТекстJSON = ЗаписьJSON.Закрыть();	
	                                
	Возврат ТекстJSON;
КонецФункции

Функция ПолучитьДанныеПодключенияEvolution(ПрофильОбмена) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ПолученПрофиль", Ложь);
	Результат.Вставить("ПолученТокен", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭКОМ_ПрофилиОбмена.СерверREST КАК Сервер,
	               |	ЭКОМ_ПрофилиОбмена.ИмяПользователяFTP КАК ИмяПользователя,
	               |	ЭКОМ_ПрофилиОбмена.ПарольПользователяAPI КАК ПарольПользователя
	               |ИЗ
	               |	Справочник.ЭКОМ_ПрофилиОбмена КАК ЭКОМ_ПрофилиОбмена
	               |ГДЕ
	               |	ЭКОМ_ПрофилиОбмена.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ПрофильОбмена);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.ПолученПрофиль = Истина;
		Результат.Вставить("Сервер", Выборка.Сервер);
		Результат.Вставить("ИмяПользователя", Выборка.ИмяПользователя);
		Результат.Вставить("ПарольПользователя", Выборка.ПарольПользователя);
	КонецЕсли;  
	
	МенеджерЗаписи = РегистрыСведений.ЭКОМ_ЗначениеДополнительныхКонстант.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ДополнительнаяКонстанта = "ЭКОМ_ТокенEvolution";
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Результат.ПолученТокен = Истина;
		Результат.Вставить("Токен", МенеджерЗаписи.ЗначениеДополнительнойКонстанты);
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

Процедура ЗаполнитьПараметрыМетода(МетодСПараметрами, ПараметрыСообщения)   	
	Для Каждого Параметр Из ПараметрыСообщения Цикл
		СлужебныйСимвол = ?(Прав(МетодСПараметрами, 1) = "/", "?", "&");
		Если ТипЗнч(Параметр.Значение) = Тип("Строка") И ЗначениеЗаполнено(Параметр.Значение) Тогда
			МетодСПараметрами = МетодСПараметрами + СлужебныйСимвол + Параметр.Ключ + "=" + Параметр.Значение;
		КонецЕсли;
	КонецЦикла;    	
КонецПроцедуры

Функция ПолучитьПараметрыСообщенияEdiDocuments(gln, limit, offset, time_from, time_to, doc_type, status, docid, description)    	
	ПараметрыСообщения = Новый Структура;
	ПараметрыСообщения.Вставить("gln", gln);  // обязательный параметр(!) / идентификатор пользователя, участника EDI обмена.
	ПараметрыСообщения.Вставить("limit", limit); // Устанавливает количество выводимых документов при чтении ленты за 1 раз; по умолчанию значение «40»
	ПараметрыСообщения.Вставить("offset", offset); // Устанавливает смещение индекса первого элемента при чтении ленты документов; по умолчанию значение «0».
	ПараметрыСообщения.Вставить("time_from", time_from); // Дата начала периода, работает с датой получения/отправки документа. Формат yyyy-MM-dd’T’HH:mm:ss (2019-01-01T00:00:00)
	ПараметрыСообщения.Вставить("time_to", time_to); // Дата окончания периода, работает с датой получения/отправки документа. Формат yyyy-MM-dd’T’HH:mm:ss (2019-01-01T00:00:00)
	ПараметрыСообщения.Вставить("doc_type", doc_type); // Order, Ordrsp, Desadv, Recadv, Insdes, Desscc, Invoice, Alcdes, Retann, Retins, Pricat
	ПараметрыСообщения.Вставить("status", status); // sent, delivered, inbox, read, error
	ПараметрыСообщения.Вставить("doc_id", docid); // обязательный параметр(!) / Идентификатор документа, чье содержание необходимо получить.
	ПараметрыСообщения.Вставить("description", description);
	
	Возврат ПараметрыСообщения;
КонецФункции

Функция ПолучитьПараметрыСообщенияBodies(gln, doc_id)
	ПараметрыСообщения = Новый Структура;
	ПараметрыСообщения.Вставить("gln", gln);  // обязательный параметр(!) / идентификатор пользователя, участника EDI обмена.
	ПараметрыСообщения.Вставить("doc_id", doc_id); // обязательный параметр(!) / Идентификатор документа, чье содержание необходимо получить.
	
	Возврат ПараметрыСообщения;
КонецФункции

Функция ВызываемыйМетодПрошелПроверку(ИмяМетода, ПараметрыСообщения)
	ДоступныеМетоды = Новый Массив;
	ДоступныеМетоды.Добавить("/api/v2/edi/documents/bodies/");
	ДоступныеМетоды.Добавить("/api/v2/edo/timeline/event/content/");
	ДоступныеМетоды.Добавить("/api/v2/edo/condras/content/");
	
	Если ДоступныеМетоды.Найти(ИмяМетода) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбязательныеПараметры = ПолучитьОбязательныеПараметрыМетода(ИмяМетода);
	Если ОбязательныеПараметры = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого Параметр Из ПараметрыСообщения Цикл
		Если ОбязательныеПараметры.Найти(Параметр) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

Функция ПолучитьОбязательныеПараметрыМетода(ИмяМетода)
	МассивEdiBodies = Новый Массив;
	МассивEdiBodies.Добавить("gln");
	МассивEdiBodies.Добавить("doc_id");
	
	МассивContent = Новый Массив;
	МассивContent.Добавить("gln");
	МассивContent.Добавить("guid");
	МассивContent.Добавить("doc_uuid");
	
	ОбязательныеПараметры = Новый Соответствие;
	ОбязательныеПараметры.Вставить("/api/v2/edi/documents/bodies/"	    , МассивEdiBodies);
	ОбязательныеПараметры.Вставить("/api/v2/edo/timeline/event/content/", МассивContent);
	ОбязательныеПараметры.Вставить("/api/v2/edo/condras/content/"	    , МассивContent);
	
	Возврат ОбязательныеПараметры.Получить(ИмяМетода);
КонецФункции

Функция ПолучитьМассивВходящихДокументовEDI(ДанныеПодключения, ТипДокумента, gln, status = "inbox")
	// значения в API и модуле 1С отличаются для данных типов, приведение к одному виду
	DocType 	 = НРег(ТипДокумента);
	Если DocType = "order" Или DocType = "retin" Тогда
		DocType = DocType + "s";
	КонецЕсли;
	
	МетодApiDocuments  = "/api/v2/edi/documents/";
	ПараметрыСообщения = Новый Структура("gln, doc_type, status", gln, DocType, status);
	Заголовки 		   = Новый Структура("X-Auth-Token", ДанныеПодключения.Токен);  	
	ЗаполнитьПараметрыМетода(МетодApiDocuments, ПараметрыСообщения);
	
	РезультатAPI = ВыполнитьЗапросAPI(ДанныеПодключения.Сервер,, МетодApiDocuments,, Заголовки);    
	Если РезультатAPI.Успешно Тогда 
		МассивДокументов = РезультатAPI.Ответ.Получить("documents");
	КонецЕсли;
	
	Возврат МассивДокументов;
КонецФункции
// КонецОбласти ОбщиеAPI

////////////////////////////////////////////////////////////////////////////////
// Область Служебные

Процедура ЗаписатьТокен(Токен)
	МенеджерЗаписи = РегистрыСведений.ЭКОМ_ЗначениеДополнительныхКонстант.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ДополнительнаяКонстанта = "ЭКОМ_ТокенEvolution";
	МенеджерЗаписи.Прочитать();
	
	Если Не МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.ДополнительнаяКонстанта = "ЭКОМ_ТокенEvolution";
	КонецЕсли;
	МенеджерЗаписи.ЗначениеДополнительнойКонстанты = Токен;      	
	МенеджерЗаписи.Записать();
КонецПроцедуры

Функция Входящий_EDI_JSON_В_XML(СтрокаJSON, ТелоДокумента, ТипДокумента, ВременныйКаталог, ИмяФайла, Кодировка)
	СтрокиПодстрокиJSON    = РазделитьОсновнуюСтрокуИПодстрокиJSON(СтрокаJSON);
	ЭлементыОсновнойСтроки = СтрокиПодстрокиJSON.ЭлементыОсновнойСтроки;
	ЭлементыПодстрок       = СтрокиПодстрокиJSON.ЭлементыПодстрок;
	
	Попытка
		ЗаписьXML = Новый ЗаписьXML; 
		ЗаписьXML.УстановитьСтроку(Кодировка);
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		ЗаписьXML.ЗаписатьНачалоЭлемента(ТипДокумента);
		Для Каждого Элемент Из ЭлементыОсновнойСтроки Цикл
			Значение = ТелоДокумента.Получить(Элемент);
			ЗначениеВЗаписьXML(Элемент, Значение, ЗаписьXML, ЭлементыПодстрок);
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		СтрокаXML = ЗаписьXML.Закрыть();
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(ИмяФайла);
		ЗаписьXML.ЗаписатьБезОбработки(СтрокаXML);
		ЗаписьXML.Закрыть();		
	Исключение
		СтрокаXML = "";
	КонецПопытки;
	
	Возврат СтрокаXML;
КонецФункции

Процедура ЗначениеВЗаписьXML(Ключ, Значение, ЗаписьXML, ПодчиненныеСтроки)
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		МассивЭлементовПодстроки = ПодчиненныеСтроки.Получить(Ключ);
		МассивJSON = Значение;
		Для Каждого СоответствиеJSON Из МассивJSON Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента(Ключ);
			Для Каждого ВложенныйЭлемент Из МассивЭлементовПодстроки Цикл
				ЗначениеВложенногоЭлемента = СоответствиеJSON.Получить(ВложенныйЭлемент);
				Если ЗначениеВложенногоЭлемента <> Неопределено Тогда
					ЗначениеВЗаписьXML(ВложенныйЭлемент, ЗначениеВложенногоЭлемента, ЗаписьXML, ПодчиненныеСтроки);
				КонецЕсли;
			КонецЦикла;
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
	Иначе
		ЗаписатьЭлементXML(Ключ, Значение, ЗаписьXML);
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьЭлементXML(Ключ, Значение, ЗаписьXML)
	ЗаписьXML.ЗаписатьНачалоЭлемента(Ключ);
	ЗаписьXML.ЗаписатьТекст(Строка(Значение));
	ЗаписьXML.ЗаписатьКонецЭлемента();
КонецПроцедуры

Функция РазделитьОсновнуюСтрокуИПодстрокиJSON(Знач СтрокаJSON)
	// для сохранения последовательности элементов при конвертировании JSON в XML
	// будет выполнено последовательное чтение, но предварительно для простоты чтения и сохранения структуры выполняется запись
	// подмножеств и удаление их из головного элемента, 
	
	НачальнаяПозиция = 1;
	// символ "[" означает начало множества элементов
	ОткрывающаяСкобка = ЭКОМ_ОбщегоНазначения.ПоискВСтроке(СтрокаJSON, "[", , НачальнаяПозиция);
	ПодчиненныеСтроки  = Новый Соответствие; 	
	Пока ОткрывающаяСкобка <> 0 Цикл
		// наличие символа "[" внутри множества (до символа "]"), означает наличие подмножества
		СледующаяОткрСкобка = ЭКОМ_ОбщегоНазначения.ПоискВСтроке(СтрокаJSON, "[",, ОткрывающаяСкобка + 1);
		ЗакрывающаяСкобка   = ЭКОМ_ОбщегоНазначения.ПоискВСтроке(СтрокаJSON, "]",, НачальнаяПозиция);
		
		Если ЗакрывающаяСкобка = 0 Тогда
			Прервать;	
		КонецЕсли;
		
		ЧислоЗакрывающихСкобок = 1;
		// сбор всех подмножеств в массив подчиненных строк
		Пока СледующаяОткрСкобка <> 0 И СледующаяОткрСкобка < ЗакрывающаяСкобка Цикл
			ЧислоЗакрывающихСкобок =  ЧислоЗакрывающихСкобок + 1;
			СледующаяОткрСкобка  = ЭКОМ_ОбщегоНазначения.ПоискВСтроке(СтрокаJSON, "[",, СледующаяОткрСкобка + 1);
		КонецЦикла;
		
		
		// сохранение имени элемента в составе редактируемой строки, для формирования ключа
		КонецИмени  = ЭКОМ_ОбщегоНазначения.ПоискВСтроке(СтрокаJSON, """:", 1, ОткрывающаяСкобка);
		НачалоИмени = ЭКОМ_ОбщегоНазначения.ПоискВСтроке(СтрокаJSON, """", 1, КонецИмени - 1);
		
		КонецСтроки         = ЭКОМ_ОбщегоНазначения.ПоискВСтроке(СтрокаJSON, "]",, НачальнаяПозиция, ЧислоЗакрывающихСкобок);
		РедактируемаяСтрока = Сред(СтрокаJSON, НачалоИмени, КонецСтроки - НачалоИмени + 1);
		
		Счетчик				= 1;
		ВхождениеЗакрСкобки = ЧислоЗакрывающихСкобок;
		// чтение подстрок от последнего уровня вложенности к первому
		Пока ВхождениеЗакрСкобки > 0 Цикл
			// получение текущей подстроки: последняя открывающая скобка закрывается ближайшей к ней закрывающей скобкой
			НачалоПодстроки = ЭКОМ_ОбщегоНазначения.ПоискВСтроке(РедактируемаяСтрока, "[", , , ВхождениеЗакрСкобки);
			КонецПодстроки  = ЭКОМ_ОбщегоНазначения.ПоискВСтроке(РедактируемаяСтрока, "]", , , Счетчик);
			Подстрока       = Сред(РедактируемаяСтрока, НачалоПодстроки, КонецПодстроки - НачалоПодстроки + 1);
			
			// вычисление имени элемента, к которому относится множество (подстрока)
			КонецИмени      = ЭКОМ_ОбщегоНазначения.ПоискВСтроке(РедактируемаяСтрока, """:", 1, НачалоПодстроки);
			НачалоИмени     = ЭКОМ_ОбщегоНазначения.ПоискВСтроке(РедактируемаяСтрока, """", 1, КонецИмени - 1);
			ИмяПодмножества = Сред(РедактируемаяСтрока, НачалоИмени + 1, КонецИмени - НачалоИмени - 1);
			ПодчиненныеСтроки.Вставить(ИмяПодмножества, Подстрока);
			
			// удаление прочитанной подстроки из строки множества
			РедактируемаяСтрока	= СтрЗаменить(РедактируемаяСтрока, Подстрока, "");
			
			ВхождениеЗакрСкобки = ВхождениеЗакрСкобки - 1;
			Счетчик 			= Счетчик + 1;
		КонецЦикла;
		
		// удаление прочитанных подстрок из основной строки
		СтрокаУдаление    = Сред(СтрокаJSON, ОткрывающаяСкобка, КонецСтроки - ОткрывающаяСкобка + 1);
		СтрокаJSON 		  = СтрЗаменить(СтрокаJSON, СтрокаУдаление, "");				
		Попытка
			НачальнаяПозиция = ОткрывающаяСкобка + 1;
			ОткрывающаяСкобка = ЭКОМ_ОбщегоНазначения.ПоискВСтроке(СтрокаJSON, "[",, НачальнаяПозиция);
		Исключение
			НачальнаяПозиция = 0;
		КонецПопытки;
	КонецЦикла;
	
	СтрокаJSON = СтрЗаменить(СтрокаJSON, """body""", "");
	ЭлементыОсновнойСтроки = ПолучитьЭлементыСтрокиJSON(СтрокаJSON);
	
	ЭлементыПодстрок = Новый Соответствие;
	Для Каждого Элемент Из ПодчиненныеСтроки Цикл
		МассивЭлементовПодстроки = ПолучитьЭлементыСтрокиJSON(Элемент.Значение);
		ЭлементыПодстрок.Вставить(Элемент.Ключ, МассивЭлементовПодстроки);
	КонецЦикла;
	
	Результат = Новый Структура("ОсновнаяСтрока, Подстроки, ЭлементыОсновнойСтроки, ЭлементыПодстрок", 
								СтрокаJSON, ПодчиненныеСтроки, ЭлементыОсновнойСтроки, ЭлементыПодстрок);

	Возврат Результат;	
	
КонецФункции

Функция ПолучитьЭлементыСтрокиJSON(Строка)
	НачальнаяПозиция = 1;
	ОткрывающаяКовычка = ЭКОМ_ОбщегоНазначения.ПоискВСтроке(Строка, """",, НачальнаяПозиция);
	МассивЭлементов = Новый Массив;
	Пока ОткрывающаяКовычка <> 0 Цикл
		ЗавершениеЭлемента = ЭКОМ_ОбщегоНазначения.ПоискВСтроке(Строка, """:",, НачальнаяПозиция);
		Если ЗавершениеЭлемента <> 0 Тогда
			Элемент = Сред(Строка, ОткрывающаяКовычка + 1, ЗавершениеЭлемента - ОткрывающаяКовычка - 1);
			Если МассивЭлементов.Найти(Элемент) = Неопределено Тогда
				МассивЭлементов.Добавить(Элемент);
			КонецЕсли;
		Иначе
			Прервать;
		КонецЕсли;
		ЗавершениеСтроки = ЭКОМ_ОбщегоНазначения.ПоискВСтроке(Строка, ",",, ЗавершениеЭлемента);
		Если ЗавершениеСтроки = 0 Тогда
			Прервать;
		КонецЕсли;
		ОткрывающаяКовычка = ЭКОМ_ОбщегоНазначения.ПоискВСтроке(Строка, """",, ЗавершениеСтроки);
		НачальнаяПозиция   = ОткрывающаяКовычка + 1;
	КонецЦикла;
	
	Возврат МассивЭлементов;	
КонецФункции

Функция ЗаписатьВходящийEDI_В_XML(ВременныйКаталог, ТипДокумента, ИмяФайла, ТелоДокумента, Кодировка)
	Попытка
		ЗаписьXML = Новый ЗаписьXML; 
		ЗаписьXML.УстановитьСтроку(Кодировка);
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		ЗаписьXML.ЗаписатьНачалоЭлемента(ТипДокумента);
		Для Каждого Элемент Из ТелоДокумента Цикл		
			МассивСоответствийВXML(Элемент, ЗаписьXML);
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		СтрокаXML 		 = ЗаписьXML.Закрыть();
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(ИмяФайла);
		ЗаписьXML.ЗаписатьБезОбработки(СтрокаXML);
		ЗаписьXML.Закрыть();
		
	Исключение
	КонецПопытки;
	
	Возврат СтрокаXML;
КонецФункции

Процедура МассивСоответствийВXML(Значение, Файл)
		Если ТипЗнч(Значение) = Тип("Массив") 
			Или ТипЗнч(Значение) = Тип("Соответствие") Тогда
			Для Каждого Элемент Из Значение Цикл
				МассивСоответствийВXML(Элемент, Файл);
			КонецЦикла;
		Иначе
			ЗначениеВЭлемент(Значение, Файл);
		КонецЕсли; 		
КонецПроцедуры

Процедура ЗначениеВЭлемент(Соответствие, Файл)
	Файл.ЗаписатьНачалоЭлемента(Соответствие.Ключ);
	Если ТипЗнч(Соответствие.Значение) = Тип("Массив") 
		Или ТипЗнч(Соответствие.Значение) = Тип("Соответствие") Тогда
		МассивСоответствийВXML(Соответствие.Значение, Файл);
	Иначе
		Файл.ЗаписатьТекст(Строка(Соответствие.Значение));
	КонецЕсли; 
	файл.ЗаписатьКонецЭлемента();
КонецПроцедуры

Функция ФайлИзBase64(СтрокаBase64, Каталог, ТипДокумента, Идентификатор, Расширение)
	ДвоичныеДанные = Base64Значение(СтрокаBase64);
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяФайла = Каталог + "\" + ТипДокумента + "_" + Идентификатор + Расширение; 
	ДвоичныеДанные.Записать(ИмяФайла);
	
	Файл = Новый Файл(ИмяФайла);
	Возврат Файл;	
КонецФункции

// Возвращает соответствие значений поля type метода API v2 /edo/timeline/ (используется при получении списка документов ЮЗД)
// типам документов модуля docrobot
Функция СоответствиеTypeTimelineТипамДокументов_Атолл() Экспорт
	// в качестве ключа используется ТипДокумента
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("DP_PDPOL"		  , "DP_PDPOL");
	Соответствие.Вставить("DP_IZVPOL"	      , "DP_IZVPOL");
	Соответствие.Вставить("DP_IZVPOL_04"	  , "DP_IZVPOL");
	Соответствие.Вставить("DP_IZVPOL_05"	  , "DP_IZVPOL");
	Соответствие.Вставить("DP_IZVPOL_06"	  , "DP_IZVPOL");
	Соответствие.Вставить("DP_IZVPOL_08"	  , "DP_IZVPOL");
	Соответствие.Вставить("DP_IZVPOL_10"	  , "DP_IZVPOL");	
	Соответствие.Вставить("DP_PDOTPR"         , "DP_PDOTPR");
	Соответствие.Вставить("DP_PDOTPR_03"	  , "DP_PDOTPR");
	Соответствие.Вставить("DP_PDOTPR_07"	  , "DP_PDOTPR");
	Соответствие.Вставить("DP_UVUTOCH"	 	  , "DP_UVUTOCH");
	Соответствие.Вставить("DP_UVUTOCH_09"	  , "DP_UVUTOCH");
	Соответствие.Вставить("DP_UVUTOCH_24"	  , "DP_UVUTOCH");
	Соответствие.Вставить("DP_PRANNUL"		  , "DP_PRANNUL");
	Соответствие.Вставить("ON_SCHFDOPPOK"	  , "UPD_SCHFDOPPOK");
	Соответствие.Вставить("ON_NSCHFDOPPOKMARK", "UPD_SCHFDOPPOK");
	Соответствие.Вставить("ON_NSCHFDOPPOKPROS", "UPD_SCHFDOPPOK");
	Соответствие.Вставить("ON_NSCHFDOPPOK"	  , "UPD_SCHFDOPPOK");
	Соответствие.Вставить("ON_SCHFDOPPR"	  , "UPD_SCHFDOP");
	Соответствие.Вставить("ON_NSCHFDOPPR"	  , "UPD_SCHFDOP");   
	Соответствие.Вставить("ON_KORSCHFDOPPR"   , "UKD_KORSCHFDIS");
	Соответствие.Вставить("ON_NKORSCHFDOPPR"  , "UKD_KORSCHFDIS");
	Соответствие.Вставить("ON_KORSCHFDOPPOK"  , "UKD_KORSCHFDIS_POK");
	Соответствие.Вставить("ON_NKORSCHFDOPPOK" , "UKD_KORSCHFDIS_POK");
	
	Возврат Соответствие;	
КонецФункции

// Возвращает соответствие значений поля docType метода API v2 /edo/document/ (используется при отправке документов EDI, ЮЗД)
// значениям перечисления ЭКОМ_ВидыДокументов
Функция СоответствиеDocTypeВидуДокументов_Атолл() Экспорт
	// в качестве ключа используется ВидДокумента
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DP_IZVPOL_04, "DP_IZVPOL");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DP_IZVPOL_05, "DP_IZVPOL");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DP_IZVPOL_06, "DP_IZVPOL");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DP_IZVPOL_08, "DP_IZVPOL");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DP_IZVPOL_10, "DP_IZVPOL");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DP_IZVPOL_23, "DP_IZVPOL");
	
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DP_PDPOL_02, "DP_PDPOL"); 
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DP_PDPOL_07, "DP_PDPOL");  
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DP_PDPOL_12, "DP_PDPOL");
	
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DP_PDOTPR_03, "DP_PDOTPR");   
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DP_PDOTPR_07, "DP_PDOTPR"); 
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DP_PDOTPR_08, "DP_PDOTPR"); 
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DP_PDOTPR_13, "DP_PDOTPR"); 
	
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DP_PRANNUL_22, "DP_PRANNUL");
	
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DP_UVUTOCH_09, "DP_UVUTOCH");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DP_UVUTOCH_24, "DP_UVUTOCH");
	
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_KORSCHFDOPPR_01          , "ON_KORSCHFDOPPR");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_KORSCHFDOPPR_01_Испр 	   , "ON_KORSCHFDOPPR");  
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPR_01         , "ON_NKORSCHFDOPPR");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPR_01_Испр	   , "ON_NKORSCHFDOPPR");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPRMARK_01     , "ON_NKORSCHFDOPPR");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPRMARK_01_Испр, "ON_NKORSCHFDOPPR");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPRPROS_01     , "ON_NKORSCHFDOPPR");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPRPROS_01_Испр, "ON_NKORSCHFDOPPR");
	
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_KORSCHFDOPPOK_11	   , "ON_KORSCHFDOPPOK");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPOK_11	   , "ON_NKORSCHFDOPPOK");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPOKMARK_11, "ON_NKORSCHFDOPPOK");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPOKPROS_11, "ON_NKORSCHFDOPPOK");
	
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPOK_11		, "ON_NSCHFDOPPOK");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPOKMARK_11	, "ON_NSCHFDOPPOK");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPOKPROS_11	, "ON_NSCHFDOPPOK");
	
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPR_01     	, "ON_NSCHFDOPPR");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPR_01_Испр	, "ON_NSCHFDOPPR");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPRMARK_01     , "ON_NSCHFDOPPR");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPRMARK_01_Испр, "ON_NSCHFDOPPR");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPRPROS_01		, "ON_NSCHFDOPPR");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPRPROS_01_Испр, "ON_NSCHFDOPPR");	
	
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_SCHFDOPPOK_11			, "ON_SCHFDOPPOK");
	
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_SCHFDOPPR_01			, "ON_SCHFDOPPR");	
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ON_SCHFDOPPR_01_Испр		, "ON_SCHFDOPPR");	
	
	Возврат Соответствие;	
КонецФункции

// Возвращает соответствие значений параметра doc_type метода API v2 /edi/documents/ (используется при получении списка документов EDI)
// значениям перечисления ЭКОМ_ВидыДокументов
Функция СоответствиеDocTypeВидуДокументовEDI_Атолл() Экспорт   
	// в качестве ключа используется ВидДокумента
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ORDER_Входящий   , "orders");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ORDER_Исходящий  , "orders");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.RETORD_Исходящий , "orders");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ORDRSP_Входящий  , "ordrsp");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.ORDRSP_Исходящий , "ordrsp");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.RECADV_Входящий  , "recadv");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.RECADV_Исходящий , "recadv"); 
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DESADV_Входящий  , "desadv");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DESADV_Исходящий , "desadv");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.RETANN_Входящий  , "retann");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.RETANN_Исходящий , "retann");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.RETINS_Входящий  , "retins");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.RETINS_Исходящий , "retins");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.INVOICE 			, "invoice");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.INSDES_Входящий  , "insdes");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.INSDES_Исходящий , "insdes");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DESSCC_Входящий  , "desscc");
	Соответствие.Вставить(Перечисления.ЭКОМ_ВидыДокументов.DESSCC_Исходящий , "desscc");
	
	
	Возврат Соответствие;	
КонецФункции

// Возвращает массив всех типов документов относящихся к EDI
Функция ПолучитьМассивТиповEDI() Экспорт
	ТипыEDI = Новый Массив;
	ТипыEDI.Добавить("ORDER");
	ТипыEDI.Добавить("ORDRSP");
	ТипыEDI.Добавить("DESADV");
	ТипыEDI.Добавить("RECADV");
	ТипыEDI.Добавить("INSDES");
	ТипыEDI.Добавить("DESSCC");
	ТипыEDI.Добавить("INVOICE");
	ТипыEDI.Добавить("ALCDES");
	ТипыEDI.Добавить("RETANN");      
	ТипыEDI.Добавить("RETINS"); 
	ТипыEDI.Добавить("PRICAT"); 
	
	Возврат ТипыEDI;
КонецФункции

// Возвращает массив всех типов документов относящихся к ЮЗД
Функция ПолучитьМассивТиповЮЗД() Экспорт
	ТипыЮЗД = Новый Массив;
	ТипыЮЗД.Добавить("ON_KORSCHFDOPPOK_11");
	ТипыЮЗД.Добавить("ON_KORSCHFDOPPR_01");
	ТипыЮЗД.Добавить("ON_KORSCHFDOPPR_01_Испр");
	ТипыЮЗД.Добавить("ON_NKORSCHFDOPPOK_11");
	ТипыЮЗД.Добавить("ON_NKORSCHFDOPPOKMARK_11");
	ТипыЮЗД.Добавить("ON_NKORSCHFDOPPOKPROS_11");           	
	ТипыЮЗД.Добавить("ON_NKORSCHFDOPPR_01");
	ТипыЮЗД.Добавить("ON_NKORSCHFDOPPR_01_Испр");
	ТипыЮЗД.Добавить("ON_NKORSCHFDOPPRMARK_01");      
	ТипыЮЗД.Добавить("ON_NKORSCHFDOPPRMARK_01_Испр"); 
	ТипыЮЗД.Добавить("ON_NKORSCHFDOPPRPROS_01"); 
	ТипыЮЗД.Добавить("ON_NKORSCHFDOPPRPROS_01_Испр");
	ТипыЮЗД.Добавить("ON_NSCHFDOPPOK_11");
	ТипыЮЗД.Добавить("ON_NSCHFDOPPOKMARK_11");
	ТипыЮЗД.Добавить("ON_NSCHFDOPPOKPROS_11");
	ТипыЮЗД.Добавить("ON_NSCHFDOPPR_01");
	ТипыЮЗД.Добавить("ON_NSCHFDOPPR_01_Испр");
	ТипыЮЗД.Добавить("ON_NSCHFDOPPRMARK_01");
	ТипыЮЗД.Добавить("ON_NSCHFDOPPRMARK_01_Испр");
	ТипыЮЗД.Добавить("ON_NSCHFDOPPRPROS_01");      
	ТипыЮЗД.Добавить("ON_NSCHFDOPPRPROS_01_Испр"); 
	ТипыЮЗД.Добавить("ON_SCHFDOPPOK_11"); 
	ТипыЮЗД.Добавить("ON_SCHFDOPPR_01"); 
	ТипыЮЗД.Добавить("ON_SCHFDOPPR_01_Испр"); 
	ТипыЮЗД.Добавить("DP_PDPOL");
	ТипыЮЗД.Добавить("DP_IZVPOL");
	ТипыЮЗД.Добавить("DP_IZVPOL_04");
	ТипыЮЗД.Добавить("DP_IZVPOL_05");
	ТипыЮЗД.Добавить("DP_IZVPOL_06");
	ТипыЮЗД.Добавить("DP_IZVPOL_08");
	ТипыЮЗД.Добавить("DP_IZVPOL_10");	
	ТипыЮЗД.Добавить("DP_PDOTPR");
	ТипыЮЗД.Добавить("DP_PDOTPR_03");
	ТипыЮЗД.Добавить("DP_PDOTPR_07");
	ТипыЮЗД.Добавить("DP_UVUTOCH_09");
	ТипыЮЗД.Добавить("DP_UVUTOCH_24");
	ТипыЮЗД.Добавить("DP_PRANNUL");
	ТипыЮЗД.Добавить("ON_SCHFDOPPOK");
	ТипыЮЗД.Добавить("ON_NSCHFDOPPOKMARK");
	ТипыЮЗД.Добавить("ON_NSCHFDOPPOKPROS");
	ТипыЮЗД.Добавить("ON_NSCHFDOPPR");     	
	ТипыЮЗД.Добавить("ON_NKORSCHFDOPPR");
	ТипыЮЗД.Добавить("ON_NKORSCHFDOPPRMARK");
	ТипыЮЗД.Добавить("ON_NKORSCHFDOPPRPROS");
	ТипыЮЗД.Добавить("ON_NSCHFDOPPRPROS");
	ТипыЮЗД.Добавить("ON_NSCHFDOPPRMARK");
	ТипыЮЗД.Добавить("ON_NSCHFDOPPRMARK");
	ТипыЮЗД.Добавить("ON_SCHFDOPPR");
	
	Возврат ТипыЮЗД;
КонецФункции

// КонецОбласти Служебные


////////////////////////////////////////////////////////////////////////////////
// Область ЗаполнениеИдентификаторовЦепочки

Процедура ЗаполнитьИдентификаторыЦепочекСредствамиRESTv2(ЗаписыватьЛог = Ложь) Экспорт
	ПолучатьИдентификаторы = ЭКОМ_ОбщегоНазначения.Настройка_Параметр_Прочитать("ЭКОМ_ПолучатьИдентификаторыЦепочек", Ложь);
	Если Не ПолучатьИдентификаторы Тогда
		Возврат;
	КонецЕсли;
	
	ИмяСобытия = "Получение идентификаторов цепочек";
	МассивЛогаСобытий = Новый Массив;
	СчетчикИзмененных = 0;
	СчетчикПустых     = 0;
	
	ДанныеДляЗаполненияИдЦепочки = ДанныеДляЗаполненияИдЦепочки();
	Если Не ДанныеДляЗаполненияИдЦепочки.ДатаЗаполнена Тогда
		ТекстЛогаСобытий = "Не заполнена служебная константа - дата начала использования идентификаторов цепочек.";
		ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);    
		ЭКОМ_ОбщегоНазначения.ЗаписатьЛогСобытийвРегистрЛогирование(МассивЛогаСобытий);    
		Возврат;
	КонецЕсли;
	
	ЗаписиДляЗаполненияИдЦепочки = ДанныеДляЗаполненияИдЦепочки.ДеревоЗаписей;
	СтрокиОрганизации = ЗаписиДляЗаполненияИдЦепочки.Строки;
	Для Каждого СтрокаОрганизация Из СтрокиОрганизации Цикл    		
		СтрокиПрофилиОбмена = СтрокаОрганизация.Строки;
		Для Каждого СтрокаПрофиль Из СтрокиПрофилиОбмена Цикл
			Для Каждого СтрокаВидДокумента Из СтрокаПрофиль.Строки Цикл
				СчетчикПустых  = СчетчикПустых + СтрокаВидДокумента.Строки.Количество();
			КонецЦикла;
		КонецЦикла;

		Если Не ЗначениеЗаполнено(СтрокаОрганизация.Организация) Тогда
			ТекстЛогаСобытий = "Имеются записи с незаполненной организацией, для таких записей идентификаторы цепочки не будут получены.";
			ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаПрофиль Из СтрокиПрофилиОбмена Цикл
			ПрофильОбмена = СтрокаПрофиль.ПрофильОбмена;   	
			
			ЕстьОшибка = РезультатПроверкиПрофиляОбмена(СтрокаПрофиль, МассивЛогаСобытий, ИмяСобытия);
			Если ЕстьОшибка Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеПодключения = ПолучитьДанныеПодключенияEvolution(ПрофильОбмена);
			ДанныеАвторизации = ВыполнитьАвторизациюАтолл_БезДанных(ДанныеПодключения);
			Если Не ДанныеАвторизации.Получены Тогда
				ТекстЛогаСобытий = "Для профиля обмена " + Строка(ПрофильОбмена) + " не удалось выполнить авторизацию в API v2. Проверьте поля: ""Сервер (обмен)"", ""логин"" и ""пароль (e-vo.ru)"" в профиле обмена.";
				ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
				МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
				Продолжить;
			КонецЕсли;
			
			СтрокиВидыДокументов = СтрокаПрофиль.Строки;
			Для Каждого СтрокаВидДокумента Из СтрокиВидыДокументов Цикл
				ЗаписиРегистра = СтрокаВидДокумента.Строки;
				
				ЛимитСообщений = ЭКОМ_ОбщегоНазначения.Настройка_Параметр_Прочитать("ЭКОМ_ЛимитСообщенийRESTv2", "50");
				// подготовка: определение типов документа, документооборота, направления обмена
				ТипыДляREST 		= ТипДокументооборотаDoctypeПоВидуДокумента(СтрокаВидДокумента.ВидДокумента);
				doc_type 			= ТипыДляREST.doc_type;
				ТипДокументооборота = ТипыДляREST.ТипДокументооборота;
				Направление			= ?(СтрокаВидДокумента.НаправлениеОбмена = Перечисления.ЭКОМ_НаправлениеОбмена.Исходящий, "исходящий", "входящий");
				
				direction  		  = ?(Направление = "исходящий", "1", "0"); // параметр для /edi/documents, определяет получать входящие или исходящие сообщения
				ИмяИдентификатора = ?(ТипДокументооборота = "EDI", "GLN", "ИдУчастника"); // определяет значение какого ресурса ЭКОМ_GLN использовать в качестве параметра метода REST API
				ИмяПоляПоиска     = ?(Направление = "входящий" ИЛИ ТипДокументооборота = "ЮЗД", "docUUID", "ftpFileName"); // определяет какое имя поля использовать для поиска в полученной таблице документов REST API
				
				Если СтрокаВидДокумента.МинимальнаяДата = Дата(1,1,1) Тогда
					ТекстЛогаСобытий = "Для вида документа " + Строка(СтрокаВидДокумента.ВидДокумента) + " имеются записи с незаполненной датой. Идентификаторы для записей с данным видом документа не будут заполнены.";
					ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
					МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
					Продолжить;
				КонецЕсли;
				// значения для параметров time_from, time_to ограничивающие список сообщений в ответе REST API
				МинимальнаяДата  = Формат(СтрокаВидДокумента.МинимальнаяДата, "ДФ=yyyy-MM-dd");
				МаксимальнаяДата = Формат(СтрокаВидДокумента.МаксимальнаяДата + 3600 * 24, "ДФ=yyyy-MM-dd");
				
				// в зависимости от типа документооборота используются разные методы API v2 (/edi/documents, /edo/documents)
				Если ТипДокументооборота = "EDI" Тогда
					ПараметрыМетода = Новый Структура("gln, doc_type, time_from, time_to, limit, direction", 
					СтрокаВидДокумента[ИмяИдентификатора], doc_type, МинимальнаяДата, МаксимальнаяДата, ЛимитСообщений, direction);
					МассивДокументов = ПолучитьСписокВходящихДокументовEDI(ПараметрыМетода, ДанныеПодключения);
					ТаблицаОтветAPI = СформироватьТаблицуИзСпискаДокументовAPI(МассивДокументов);
				ИначеЕсли ТипДокументооборота = "ЮЗД" Тогда
					ПараметрыМетода = Новый Структура("guid, time_from, time_to, limit", 
					СтрокаВидДокумента[ИмяИдентификатора], МинимальнаяДата, МаксимальнаяДата, ЛимитСообщений);
					МассивДокументов = ПолучитьСписокВходящихДокументовЮЗД(ПараметрыМетода, ДанныеПодключения, doc_type);
					ТаблицаОтветAPI = СформироватьТаблицуИзСпискаДокументовAPI(МассивДокументов);
				Иначе
					ТекстЛогаСобытий = "Не удалось определить тип документооборота для вида документа " + Строка(СтрокаВидДокумента.ВидДокумента) + ". Нельзя выполнить запрос к API v2 для получения идентификаторов.";
					ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
					МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
					Продолжить;
				КонецЕсли;
				
				// поиск chainID и в случае успеха заполнение идентификатора цепочки в записи регистра 
				Для Каждого Запись ИЗ ЗаписиРегистра Цикл
					ЗначениеДляПоиска = ЗначениеДляПоискаИзСпискаДокументовAPI(Запись.ФайлИмя, Направление, ТипДокументооборота);
					НайденнаяСтрока   = ТаблицаОтветAPI.Найти(ЗначениеДляПоиска, ИмяПоляПоиска);					
					Если НайденнаяСтрока = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					МенеджерЗаписи = РегистрыСведений.ЭКОМ_Объекты_События.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Запись);
					МенеджерЗаписи.Прочитать();
					
					Если МенеджерЗаписи.Выбран() Тогда
						МенеджерЗаписи.ИдентификаторЦепочки = НайденнаяСтрока.chainID;	
						МенеджерЗаписи.Записать();
						СчетчикИзмененных = СчетчикИзмененных + 1;
					КонецЕсли;
				КонецЦикла; // обход записей ЭКОМ_Объекты_События с группировкой по профилю и виду документа
			КонецЦикла; // обход видов документов
		КонецЦикла;	// обход строк профилей обмена	
	КонецЦикла; // обход строк организаций
	
	СтрокаРезультат = "Количество найденных записей без идентификатора: " + СчетчикПустых + ", из них заполнено: " + СчетчикИзмененных + ".";
	Если МассивЛогаСобытий.Количество() Тогда
		ТекстЛогаСобытий = "Операция получения идентификаторов завершена." + Символы.ПС + СтрокаРезультат;
		ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Предупреждение, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
	Иначе
		ТекстЛогаСобытий = "Операция получения идентификаторов завершена успешно." + Символы.ПС + СтрокаРезультат;
		ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Успешно, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
	КонецЕсли;
	
	Если ЗаписыватьЛог Тогда
		ЭКОМ_ОбщегоНазначения.ЗаписатьЛогСобытийвРегистрЛогирование(МассивЛогаСобытий);
	КонецЕсли;
КонецПроцедуры

Функция ЗначениеДляПоискаИзСпискаДокументовAPI(ИсходноеЗначение, Направление, ТипДокументооборота)
	Результат = "";
	Если ТипДокументооборота = "EDI" И Направление = "входящий" Тогда
		Попытка
			Результат = СтрЗаменить(ИсходноеЗначение, ".xml", "");
			Результат = Прав(Результат, СтрДлина(Результат) - ЭКОМ_ОбщегоНазначения.ПоискВСтроке(Результат, "_",,,2));
		Исключение
			Результат = "";
		КонецПопытки; 
	ИначеЕсли ТипДокументооборота = "EDI" И Направление = "исходящий" Тогда
		Результат = ИсходноеЗначение;
	ИначеЕсли ТипДокументооборота = "ЮЗД" Тогда
		Попытка
			Результат = СтрЗаменить(ИсходноеЗначение, ".xml", "");
			Результат = Прав(Результат, СтрДлина(Результат) - ЭКОМ_ОбщегоНазначения.ПоискВСтроке(Результат, "_", 1,, 1));
		Исключение
			Результат = "";
		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция СформироватьТаблицуИзСпискаДокументовAPI(МассивДокументов)
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("chainID"    , Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	ТаблицаРезультат.Колонки.Добавить("ftpFileName", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(50)));
	ТаблицаРезультат.Колонки.Добавить("docUUID"    , Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	
	Для Каждого Соответствие Из МассивДокументов Цикл
		НовСтр = ТаблицаРезультат.Добавить();
		НовСтр.chainID    = Соответствие.Получить("chainID");
		НовСтр.ftpFileName = Соответствие.Получить("ftpFileName");
		НовСтр.docUUID     = Соответствие.Получить("docUUID");
	КонецЦикла;
	
	Возврат ТаблицаРезультат;	
КонецФункции

Функция ДанныеДляЗаполненияИдЦепочки() 
	Результат = Новый Структура("ДеревоЗаписей, ДатаЗаполнена", Новый ДеревоЗначений, Ложь);
	
	НачалоИспользованияИдЦепочки = ЭКОМ_ОбщегоНазначения.Настройка_Параметр_Прочитать("ЭКОМ_НачалоИспользованияИдентификаторовЦепочки", Дата(1,1,1));
	Если ТипЗнч(НачалоИспользованияИдЦепочки) = Тип("Дата") И НачалоИспользованияИдЦепочки > Дата(1,1,1) Тогда	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЭКОМ_Объекты_События.ВидДокумента КАК ВидДокумента,
		|	ЭКОМ_GLN.ПрофильОбмена КАК ПрофильОбмена,
		|	ЭКОМ_Объекты_События.Организация КАК Организация,
		|	ЭКОМ_GLN.Ид_ОЭД КАК ИдУчастника,
		|	ЭКОМ_GLN.GLN КАК GLN,
		|	ЭКОМ_Объекты_События.ДатаДокумента КАК МинимальнаяДата,
		|	ЭКОМ_Объекты_События.ДатаДокумента КАК МаксимальнаяДата,
		|	ЭКОМ_Объекты_События.Документ_Основание КАК Документ_Основание,
		|	ЭКОМ_Объекты_События.ФайлИмя КАК ФайлИмя,
		|	ЭКОМ_Объекты_События.НаправлениеОбмена КАК НаправлениеОбмена,
		|	ЭКОМ_GLN.ПрофильОбмена.ПометкаУдаления КАК ПрофильПометкаУдаления,
		|	ЭКОМ_GLN.ПрофильОбмена.Активный КАК ПрофильАктивный
		|ИЗ
		|	РегистрСведений.ЭКОМ_Объекты_События КАК ЭКОМ_Объекты_События
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭКОМ_GLN КАК ЭКОМ_GLN
		|		ПО ЭКОМ_Объекты_События.Организация = ЭКОМ_GLN.Объект
		|ГДЕ
		|	ЭКОМ_Объекты_События.ИдентификаторЦепочки = """"
		|	И ЭКОМ_Объекты_События.ДатаЗаписи >= &НачалоИспользованияИдентификаторовЦепочки
		|	И НЕ ЭКОМ_Объекты_События.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.PRICAT_Исходящий)
		|	И НЕ ЭКОМ_Объекты_События.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.PRICAT_Входящий)
		|	И НЕ ЭКОМ_Объекты_События.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.CONDRA_Исходящий)
		|	И НЕ ЭКОМ_Объекты_События.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.CONDRA_Входящий)
		|ИТОГИ
		|	МАКСИМУМ(ИдУчастника),
		|	МАКСИМУМ(GLN),
		|	МИНИМУМ(МинимальнаяДата),
		|	МАКСИМУМ(МаксимальнаяДата),
		|	МАКСИМУМ(НаправлениеОбмена)
		|ПО
		|	Организация,
		|	ПрофильОбмена,
		|	ВидДокумента";
		Запрос.УстановитьПараметр("НачалоИспользованияИдентификаторовЦепочки", НачалоИспользованияИдЦепочки);
		Результат.ДеревоЗаписей = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		Результат.ДатаЗаполнена = Истина;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ТипДокументооборотаDoctypeПоВидуДокумента(ВидДокумента)
	СоответствиеDocTypeВидуДокументовEDI_Атолл = СоответствиеDocTypeВидуДокументовEDI_Атолл();
	
	ТипДокументооборота = Неопределено;
	doc_type			= СоответствиеDocTypeВидуДокументовEDI_Атолл.Получить(ВидДокумента);
	
	Если doc_type = Неопределено Тогда
		СоответствиеDocTypeВидуДокументов_Атолл = СоответствиеDocTypeВидуДокументов_Атолл();
		doc_type = СоответствиеDocTypeВидуДокументов_Атолл.Получить(ВидДокумента);
		Если Не doc_type = Неопределено Тогда
			ТипДокументооборота = "ЮЗД";
			doc_type = ПреобразоватьТипДокументаКЗначениюАтолл(doc_type, ТипДокументооборота);			
		КонецЕсли;
	Иначе
		ТипДокументооборота = "EDI";
	КонецЕсли;
	
	Возврат Новый Структура("ТипДокументооборота, doc_type", ТипДокументооборота, doc_type);
КонецФункции

Функция РезультатПроверкиПрофиляОбмена(СтрокаПрофиль, МассивЛогаСобытий, ИмяСобытия)
	Если Не ЗначениеЗаполнено(СтрокаПрофиль.ПрофильОбмена) Тогда
		ТекстЛогаСобытий = "Не найден профиль обмена для организации " + СтрокаПрофиль.Организация + ". Идентификаторы цепочек для записей по данной организации не будут получены.";
		ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		Возврат Истина;
	КонецЕсли;
	
	Если Не СтрокаПрофиль.ПрофильАктивный Или СтрокаПрофиль.ПрофильПометкаУдаления Тогда
		ТекстЛогаСобытий = "Для профиля обмена " + Строка(СтрокаПрофиль.ПрофильОбмена) + " нельзя выполнить получение идентификаторов, профиль не активен или помечен на удаление.";
		ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции
// КонецОбласти ЗаполнениеИдентификаторовЦепочки
