// Обновляет элементы справочника Инфополя из GIT
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОбновитьСправочникиИнфополей() Экспорт

	МассивЛогаСобытий = Новый Массив;
	КомандаЗапроса    = "/repos/1cdevelopexite/UpdateService/contents/InfoPole";
	ОтветСервера = ЭКОМ_ОбщегоНазначения.ПолучениеДанныхGITНаСервере(КомандаЗапроса, МассивЛогаСобытий);
	Если ОтветСервера.Количество() > 0 Тогда
		ОбновитьСправочники(ОтветСервера);
	КонецЕсли;

КонецПроцедуры // ОбновитьСправочникиИнфополей()

Процедура ОбновитьСправочники(ОтветСервера)
	
	Если НЕ ОтветСервера = Неопределено Тогда
		
		МассивЛогаСобытий = Новый Массив;     		
		
		ВременныйКаталог = КаталогВременныхФайлов() + "TempECOM" + ПолучитьРазделительПути();
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ВременныйКаталогДоступен = ЭКОМ_ОбщегоНазначенияКлиент.ЭКОМ_СоздатьКаталогПроверитьНаЗапись(ВременныйКаталог, МассивЛогаСобытий);
		#Иначе 			
			ВременныйКаталогДоступен = ЭКОМ_ОбщегоНазначения.ЭКОМ_СоздатьКаталогПроверитьНаЗапись(ВременныйКаталог, МассивЛогаСобытий);	
		#КонецЕсли
		Если ВременныйКаталогДоступен = Неопределено 
			Или (ТипЗнч(ВременныйКаталогДоступен) = Тип("Булево") И Не ВременныйКаталогДоступен) Тогда		
			ТекстЛогаСобытий = "Ошибка обновления справочников <<<ЭКОМ Инфо поля>>>!" + Символы.ПС +
			"Недоступен временный каталог, путь к каталогу: " + Символы.ПС + ВременныйКаталог; 
			ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, "Обновить справочник инфо поля через GIT");
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
			
			ЭКОМ_ОбщегоНазначения.ЗаписатьЛогСобытийвРегистрЛогирование(МассивЛогаСобытий);  			
			Возврат;		
		КонецЕсли;	  		

		Для каждого СтрФайл Из ОтветСервера Цикл
			
			Если НЕ Найти(СтрФайл.Получить("name"), ".xml") = 0  Тогда
				

				КомандаЗапроса    = "/repos/1cdevelopexite/UpdateService/contents/" + СтрФайл.Получить("path");          
				ОтветСервераПоФайлу = ЭКОМ_ОбщегоНазначения.ПолучениеДанныхGITНаСервере(КомандаЗапроса, МассивЛогаСобытий);
				
				Если НЕ ОтветСервераПоФайлу = Неопределено Тогда
					
					СтрокаBase64   = ОтветСервераПоФайлу.Получить("content");	
					СтрокаBase64   = СтрЗаменить(СтрокаBase64,"\/","/");  
					
					ВременныйФайл = СтрЗаменить(ПолучитьИмяВременногоФайла("xml"), ПолучитьРазделительПути(), Символы.ПС);
					ПолноеИмяФайлаXML = ВременныйКаталог + СтрПолучитьСтроку(ВременныйФайл, СтрЧислоСтрок(ВременныйФайл));
					ДвоичныеДанные = Base64Значение(СтрокаBase64);
					ДвоичныеДанные.Записать(ПолноеИмяФайлаXML);
					
					ФайлXMLДляОбработки = Новый Файл(ПолноеИмяФайлаXML);
					ЧтениеXMLДляТекущегоФайла = Новый ЧтениеXML();					
					Если ФайлXMLДляОбработки.Расширение = ".xml" 
						ИЛИ ФайлXMLДляОбработки.Расширение = "xml" Тогда  
						Попытка
							ЧтениеXMLДляТекущегоФайла.ОткрытьФайл(ФайлXMLДляОбработки.ПолноеИмя,,,"utf-8");							
							ЧтениеXMLДляТекущегоФайла.Прочитать();
						Исключение
							ЧтениеXMLДляТекущегоФайла.Закрыть();
							
							ТекстЛогаСобытий = "Документ XML поврежден (243): " + ФайлXMLДляОбработки.ПолноеИмя;
							ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий,
								Перечисления.ЭКОМ_УровниЛогирования.Ошибка, "Обновить справочник инфо поля через GIT");
							МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
							
							ЧтениеXMLДляТекущегоФайла = Неопределено;
						КонецПопытки;
					КонецЕсли;
					
					Попытка
						ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXMLДляТекущегоФайла);
					Исключение
						ТекстЛогаСобытий = "Ошибка при обновлении элемента - " + ОписаниеОшибки();
						ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий,
							Перечисления.ЭКОМ_УровниЛогирования.Ошибка, "Обновить справочник инфо поля через GIT");
						МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
						Продолжить;
					КонецПопытки;
					
					ФорматУПД = СокрЛП(ОбъектXDTO.FileName);	
					retailerInn = "";
					Если НЕ ОбъектXDTO.Свойства().Получить("retailerInn") = Неопределено Тогда
						retailerInn = ОбъектXDTO.retailerInn;
					КонецЕсли;
					
					ИнфПолФХЖ1 = Новый Массив;		
					ИнфПолФХЖ2 = Новый Массив;
					ИнфПолФХЖ3 = Новый Массив;
					ИнфПолФХЖ4 = Новый Массив;
					
					ДанныеИнфоПол = Новый Структура;
					ДанныеИнфоПол.Вставить("infpolfhz1", ИнфПолФХЖ1);
					ДанныеИнфоПол.Вставить("infpolfhz2", ИнфПолФХЖ2);
					ДанныеИнфоПол.Вставить("infpolfhz3", ИнфПолФХЖ3);
					ДанныеИнфоПол.Вставить("infpolfhz4", ИнфПолФХЖ4);
					
					Для каждого ЭлИнфоПол Из ДанныеИнфоПол Цикл
						Если НЕ ОбъектXDTO.Свойства().Получить("infpolfhz") = Неопределено Тогда
							// ИнфПолФХЖ1
							Если НЕ ОбъектXDTO.infpolfhz.Свойства().Получить(ЭлИнфоПол.Ключ) = Неопределено Тогда
								Если НЕ ОбъектXDTO.infpolfhz[ЭлИнфоПол.Ключ].Свойства().Получить("field") = Неопределено Тогда
									Если ТипЗнч(ОбъектXDTO.infpolfhz[ЭлИнфоПол.Ключ].field) = Тип("СписокXDTO") Тогда
										Для каждого Стр Из ОбъектXDTO.infpolfhz[ЭлИнфоПол.Ключ].field Цикл
											required = Ложь;
											Если НЕ Стр.Свойства().Получить("required") = Неопределено 
												И Стр.required = "true" Тогда
												required = Истина;
											КонецЕсли;
											source = Неопределено;
											Если НЕ Стр.Свойства().Получить("source") = Неопределено Тогда
												source = Стр.source;
											КонецЕсли;
											ДанныеИнфПол = Новый Структура;
											ДанныеИнфПол.Вставить("name"    , Стр.name);
											ДанныеИнфПол.Вставить("required", required);
											ДанныеИнфПол.Вставить("source"  , source);
											ЭлИнфоПол.Значение.Добавить(ДанныеИнфПол);
										КонецЦикла;
									Иначе
										Стр = ОбъектXDTO.infpolfhz[ЭлИнфоПол.Ключ].field;
										required = Ложь;
										Если Стр.required = "true" Тогда
											required = Истина;
										КонецЕсли;
										source = Неопределено;
										Если НЕ Стр.Свойства().Получить("source") = Неопределено Тогда
											source = Стр.source;
										КонецЕсли;
										ДанныеИнфПол = Новый Структура;
										ДанныеИнфПол.Вставить("name"    , Стр.name);
										ДанныеИнфПол.Вставить("required", required);
										ДанныеИнфПол.Вставить("source"  , source);
										ЭлИнфоПол.Значение.Добавить(ДанныеИнфПол);			
									КонецЕсли;
								КонецЕсли;					
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					ДанныеОбъекта = Новый Структура;
					ДанныеОбъекта.Вставить("intCalcPattern"          , Ложь);
					ДанныеОбъекта.Вставить("isAllowRecallAnyState"   , Ложь);
					ДанныеОбъекта.Вставить("isOnzheDisabled"         , Ложь);
					ДанныеОбъекта.Вставить("isReasonRequired"        , Ложь);
					ДанныеОбъекта.Вставить("isCustomTariffRequired"  , Ложь);
					ДанныеОбъекта.Вставить("isVatRequired"           , Ложь);
					ДанныеОбъекта.Вставить("isCompetenceTypeRequired", Ложь);
					ДанныеОбъекта.Вставить("isKPPByDeliveryPlace"    , Ложь);
					ДанныеОбъекта.Вставить("isInnByDeliveryPlace"    , Ложь);
					
					Для каждого СвойствоДанных Из ДанныеОбъекта Цикл
						Если НЕ ОбъектXDTO.Свойства().Получить(СвойствоДанных.Ключ) = Неопределено Тогда
							Если ОбъектXDTO[СвойствоДанных.Ключ] = "1" Тогда
								ДанныеОбъекта.Вставить(СвойствоДанных.Ключ, Истина);
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					// Создадим или обновим объект справочника
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ЭКОМ_ИнфоПоля.Ссылка
					|ИЗ
					|	Справочник.ЭКОМ_ИнфоПоля КАК ЭКОМ_ИнфоПоля
					|ГДЕ
					|	ЭКОМ_ИнфоПоля.ФорматУПД = &ФорматУПД";
					
					Запрос.УстановитьПараметр("ФорматУПД", ФорматУПД);
					
					РезультатЗапроса = Запрос.Выполнить();
					Если РезультатЗапроса.Пустой() Тогда
						ИнфоПолеОбъект = Справочники.ЭКОМ_ИнфоПоля.СоздатьЭлемент();				 
					Иначе
						Выборка = РезультатЗапроса.Выбрать();
						Выборка.Следующий();
						ИнфоПолеОбъект = Выборка.Ссылка.ПолучитьОбъект(); 
					КонецЕсли;
					
					Попытка
						ИнфоПолеОбъект.Заблокировать();
					Исключение
						Продолжить;
					КонецПопытки;
					
					ИнфоПолеОбъект.ФорматУПД    = ФорматУПД;
					ИнфоПолеОбъект.Наименование = ФорматУПД;
					ИнфоПолеОбъект.ИНН          = retailerInn;
					
					ИнфоПолеОбъект.СхемаПодсчета                          = ДанныеОбъекта.intCalcPattern;
					ИнфоПолеОбъект.АннулированиеБезЗавершенияЦепочки      = ДанныеОбъекта.isAllowRecallAnyState;
					ИнфоПолеОбъект.НеИспользоватьГрузОт_ОнЖе              = ДанныеОбъекта.isOnzheDisabled;
					ИнфоПолеОбъект.ОбязательноПолеОснПер                  = ДанныеОбъекта.isReasonRequired;
					ИнфоПолеОбъект.ОбязательноСтранаНомерТД               = ДанныеОбъекта.isCustomTariffRequired;
					ИнфоПолеОбъект.ОбязательноСтавкаНДС                   = ДанныеОбъекта.isVatRequired;
					ИнфоПолеОбъект.ОбязательноТНтипКомпетенции            = ДанныеОбъекта.isCompetenceTypeRequired;
					ИнфоПолеОбъект.ИспользоватьПокупателяКПП_из_ГрузПолуч = ДанныеОбъекта.isKPPByDeliveryPlace;
					ИнфоПолеОбъект.ИспользоватьПокупателяИНН_из_ГрузПолуч = ДанныеОбъекта.isInnByDeliveryPlace;
					
					ПрошлыеДанныеТЧ = ИнфоПолеОбъект.ТабличнаяЧасть.Выгрузить();
					ИнфоПолеОбъект.ТабличнаяЧасть.Очистить();
					
					// Данные по умолчанию
					Для каждого СтруктураСтр Из ИнфПолФХЖ1 Цикл
						НоваяСтрока = ИнфоПолеОбъект.ТабличнаяЧасть.Добавить();
						НоваяСтрока.Идентификатор = СтруктураСтр.name;
						НоваяСтрока.Обязательное  = СтруктураСтр.required;
						НоваяСтрока.Источники     = СтруктураСтр.source;
						НоваяСтрока.ТипПоля       = "ИнфПолФХЖ1";
						СтрокаТЧ = ПрошлыеДанныеТЧ.Найти(НоваяСтрока.Идентификатор, "Идентификатор");
						Если НЕ СтрокаТЧ = Неопределено Тогда
							ПрошлыеДанныеТЧ.Удалить(СтрокаТЧ);
						КонецЕсли;
					КонецЦикла;
					Для каждого СтруктураСтр Из ИнфПолФХЖ2 Цикл
						НоваяСтрока = ИнфоПолеОбъект.ТабличнаяЧасть.Добавить();
						НоваяСтрока.Идентификатор = СтруктураСтр.name;
						НоваяСтрока.Обязательное  = СтруктураСтр.required;
						НоваяСтрока.Источники     = СтруктураСтр.source;
						НоваяСтрока.ТипПоля       = "ИнфПолФХЖ2";
						СтрокаТЧ = ПрошлыеДанныеТЧ.Найти(НоваяСтрока.Идентификатор, "Идентификатор");
						Если НЕ СтрокаТЧ = Неопределено Тогда
							ПрошлыеДанныеТЧ.Удалить(СтрокаТЧ);
						КонецЕсли;
					КонецЦикла;
					Для каждого СтруктураСтр Из ИнфПолФХЖ3 Цикл
						НоваяСтрока = ИнфоПолеОбъект.ТабличнаяЧасть.Добавить();
						НоваяСтрока.Идентификатор = СтруктураСтр.name;
						НоваяСтрока.Обязательное  = СтруктураСтр.required;
						НоваяСтрока.Источники     = СтруктураСтр.source;
						НоваяСтрока.ТипПоля       = "ИнфПолФХЖ3";
						СтрокаТЧ = ПрошлыеДанныеТЧ.Найти(НоваяСтрока.Идентификатор, "Идентификатор");
						Если НЕ СтрокаТЧ = Неопределено Тогда
							ПрошлыеДанныеТЧ.Удалить(СтрокаТЧ);
						КонецЕсли;
					КонецЦикла;
					Для каждого СтруктураСтр Из ИнфПолФХЖ4 Цикл
						НоваяСтрока = ИнфоПолеОбъект.ТабличнаяЧасть.Добавить();
						НоваяСтрока.Идентификатор = СтруктураСтр.name;
						НоваяСтрока.Обязательное  = СтруктураСтр.required;
						НоваяСтрока.Источники     = СтруктураСтр.source;
						НоваяСтрока.ТипПоля       = "ИнфПолФХЖ4";
						СтрокаТЧ = ПрошлыеДанныеТЧ.Найти(НоваяСтрока.Идентификатор, "Идентификатор");
						Если НЕ СтрокаТЧ = Неопределено Тогда
							ПрошлыеДанныеТЧ.Удалить(СтрокаТЧ);
						КонецЕсли;
					КонецЦикла;
					
					// Допишем данными которые внесены вручную
					Для каждого  Стр Из ПрошлыеДанныеТЧ Цикл
						НоваяСтрока = ИнфоПолеОбъект.ТабличнаяЧасть.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
					КонецЦикла;
					
					ИнфоПолеОбъект.Записать();
					ИнфоПолеОбъект.Разблокировать();
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ТекстЛогаСобытий = "Элементы справочника <<<ЭКОМ Инфо поля>>> успешно обновлены!";
		ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий,
			Перечисления.ЭКОМ_УровниЛогирования.Информация, "Обновить справочник инфо поля через GIT");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
	Иначе
		
		ТекстЛогаСобытий = "Ошибка обновления справочников <<<ЭКОМ Инфо поля>>>!";
		ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий,
			Перечисления.ЭКОМ_УровниЛогирования.Ошибка, "Обновить справочник инфо поля через GIT");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		
	КонецЕсли;
	
	Если МассивЛогаСобытий.Количество() > 0 Тогда
		ЭКОМ_ОбщегоНазначения.ЗаписатьЛогСобытийвРегистрЛогирование(МассивЛогаСобытий);
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(ВременныйКаталог);
	Исключение КонецПопытки;
	
КонецПроцедуры