
// Функция возвращает доступные форматы УПД
//
// Возвращаемое значение:
//   СписокЗначений   - коллекция форматов УПД. 
//
Функция ПолучитьФорматыУПД() Экспорт
	
	СписокФорматовЮЗД = Новый СписокЗначений;
	СписокФорматовЮЗД.Добавить("УПД по умолчанию");
	СписокФорматовЮЗД.Добавить("УПД 7 шагов");
	СписокФорматовЮЗД.Добавить("УПД Азбука вкуса");
	СписокФорматовЮЗД.Добавить("УПД Атак");
	СписокФорматовЮЗД.Добавить("УПД Ашан");
	СписокФорматовЮЗД.Добавить("УПД Билла");
	СписокФорматовЮЗД.Добавить("УПД Бристоль");
	СписокФорматовЮЗД.Добавить("УПД Верный");
	СписокФорматовЮЗД.Добавить("УПД Виктория");
	СписокФорматовЮЗД.Добавить("УПД Гиперглобус");
	СписокФорматовЮЗД.Добавить("УПД Детский мир");
	СписокФорматовЮЗД.Добавить("УПД Дикси юг");
	СписокФорматовЮЗД.Добавить("УПД Елисей");
	СписокФорматовЮЗД.Добавить("УПД Зельгрос");
	СписокФорматовЮЗД.Добавить("УПД Кировский");
	СписокФорматовЮЗД.Добавить("УПД Командор");
	СписокФорматовЮЗД.Добавить("УПД Красный яр");
	СписокФорматовЮЗД.Добавить("УПД Лента СЧФ");
	СписокФорматовЮЗД.Добавить("УПД Лента СЧФДОП");
	СписокФорматовЮЗД.Добавить("УПД Магнолия");
	СписокФорматовЮЗД.Добавить("УПД Макси");
	СписокФорматовЮЗД.Добавить("УПД Метро");
	СписокФорматовЮЗД.Добавить("УПД Монетка");
	СписокФорматовЮЗД.Добавить("УПД ОКЕЙ");
	СписокФорматовЮЗД.Добавить("УПД Подружка");
	СписокФорматовЮЗД.Добавить("УПД Семья");
	СписокФорматовЮЗД.Добавить("УПД Сибирский гигант");
	СписокФорматовЮЗД.Добавить("УПД Спар");
	СписокФорматовЮЗД.Добавить("УПД Табрис");
	СписокФорматовЮЗД.Добавить("УПД Тамерлан");
	СписокФорматовЮЗД.Добавить("УПД Тандер");
	СписокФорматовЮЗД.Добавить("УПД Х5");
	СписокФорматовЮЗД.Добавить("УПД Холидей");
	СписокФорматовЮЗД.Добавить("УПД ЭССЕН");
	СписокФорматовЮЗД.Добавить("УПД Мясной двор");
	СписокФорматовЮЗД.Добавить("УПД Лето");
	СписокФорматовЮЗД.Добавить("УПД Спар-Калининград");
	СписокФорматовЮЗД.Добавить("УПД Бетховен");
	СписокФорматовЮЗД.Добавить("УПД Мособлалкоголь");
	СписокФорматовЮЗД.Добавить("УПД Ассорти");
	СписокФорматовЮЗД.Добавить("УПД Солнечный круг");
	СписокФорматовЮЗД.Добавить("УПД Фермач");
	СписокФорматовЮЗД.Добавить("УПД Торговый дом РеалЪ");
	СписокФорматовЮЗД.Добавить("УПД Ритм-2000");
	СписокФорматовЮЗД.Добавить("УПД Спар МВ");
	СписокФорматовЮЗД.Добавить("УПД Корзинка-6");	
	СписокФорматовЮЗД.Добавить("УПД ТС Гринн");	
	
	Возврат СписокФорматовЮЗД;

КонецФункции 

Функция ПолучитьФорматыИнфоПолей() Экспорт
	
	СписокФорматовИнфоПолей = Новый СписокЗначений;			
	СписокФорматовИнфоПолей.Добавить("ИнфПолФХЖ1");
	СписокФорматовИнфоПолей.Добавить("ИнфПолФХЖ2");
	СписокФорматовИнфоПолей.Добавить("ИнфПолФХЖ3");
	СписокФорматовИнфоПолей.Добавить("ИнфПолФХЖ4");
	
	Возврат СписокФорматовИнфоПолей;

КонецФункции 

Функция ПроверкаНаУникальностьСправочника(ИмяФорматаУПД, Ссылка) Экспорт   
	
	ЗначениеУникально = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭКОМ_ИнфоПоля.Ссылка
		|ИЗ
		|	Справочник.ЭКОМ_ИнфоПоля КАК ЭКОМ_ИнфоПоля
		|ГДЕ
		|	ЭКОМ_ИнфоПоля.ФорматУПД = &ФорматУПД
		|	И НЕ ЭКОМ_ИнфоПоля.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ФорматУПД", ИмяФорматаУПД);
	Запрос.УстановитьПараметр("Ссылка"   , Ссылка);	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
	     Выборка = РезультатЗапроса.Выбрать();
		 Если Выборка.Количество() = 1 
			  И НЕ ЗначениеЗаполнено(Ссылка) Тогда
		      ЗначениеУникально = Истина;
		  КонецЕсли;
	Иначе
		 ЗначениеУникально = Истина; 
	КонецЕсли;
	
	Возврат ЗначениеУникально;
	
КонецФункции

Процедура ЗаполнитьУПД_поУмолчанию(ЭКОМ_ИнфоПоляСсылка) Экспорт
	
	ЭКОМ_ИнфоПолеОбъект = ЭКОМ_ИнфоПоляСсылка.ПолучитьОбъект();
	
	ЭКОМ_ИнфоПолеОбъект.ФорматУПД = ЭКОМ_ИнфоПолеОбъект.Наименование;
	  
	НовСтр = ЭКОМ_ИнфоПолеОбъект.ТабличнаяЧасть.Добавить();
	НовСтр.Идентификатор = "отправитель";
	НовСтр.ТипПоля       = "ИнфПолФХЖ1";
	НовСтр.Источники     = "ORDER.HEAD.RECIPIENT";
	НовСтр.Обязательное  = Истина;    	
	
	НовСтр = ЭКОМ_ИнфоПолеОбъект.ТабличнаяЧасть.Добавить();
	НовСтр.Идентификатор = "получатель";
	НовСтр.ТипПоля       = "ИнфПолФХЖ1";
	НовСтр.Источники     = "ORDER.HEAD.BUYER";
	НовСтр.Обязательное  = Истина;   
	
	НовСтр = ЭКОМ_ИнфоПолеОбъект.ТабличнаяЧасть.Добавить();
	НовСтр.Идентификатор = "грузополучатель";
	НовСтр.ТипПоля       = "ИнфПолФХЖ1";
	НовСтр.Источники     = "ORDER.HEAD.DELIVERYPLACE";    
	  
	НовСтр = ЭКОМ_ИнфоПолеОбъект.ТабличнаяЧасть.Добавить();
	НовСтр.Идентификатор = "номер_накладной";
	НовСтр.ТипПоля       = "ИнфПолФХЖ1";
	НовСтр.Источники     = "RECADV.DESADVNUMBER";
	НовСтр.Обязательное  = Истина;
	
	НовСтр = ЭКОМ_ИнфоПолеОбъект.ТабличнаяЧасть.Добавить();
	НовСтр.Идентификатор = "дата_накладной";
	НовСтр.ТипПоля       = "ИнфПолФХЖ1";
	НовСтр.Источники     = "RECADV.RECEPTIONDATE";
	НовСтр.Обязательное  = Истина;
	
	НовСтр = ЭКОМ_ИнфоПолеОбъект.ТабличнаяЧасть.Добавить();
	НовСтр.Идентификатор = "номер_заказа";
	НовСтр.ТипПоля       = "ИнфПолФХЖ1";
	НовСтр.Источники     = "RECADV.DESADVNUMBER";
	НовСтр.Обязательное  = Истина;
	
	НовСтр = ЭКОМ_ИнфоПолеОбъект.ТабличнаяЧасть.Добавить();
	НовСтр.Идентификатор = "дата_заказа";
	НовСтр.ТипПоля       = "ИнфПолФХЖ1";
	НовСтр.Источники     = "RECADV.RECEPTIONDATE";
	НовСтр.Обязательное  = Истина;
	
	НовСтр = ЭКОМ_ИнфоПолеОбъект.ТабличнаяЧасть.Добавить();
	НовСтр.Идентификатор = "код_материала";
	НовСтр.ТипПоля       = "ИнфПолФХЖ2";
	НовСтр.Источники     = "ORDER.POSITION.PRODUCTIDBUYER";
	
	НовСтр = ЭКОМ_ИнфоПолеОбъект.ТабличнаяЧасть.Добавить();
	НовСтр.Идентификатор = "штрихкод";
	НовСтр.ТипПоля       = "ИнфПолФХЖ2";
	НовСтр.Источники     = "ORDER.POSITION.PRODUCT";
	НовСтр.Обязательное  = Истина;
	
	ЭКОМ_ИнфоПолеОбъект.Записать();

КонецПроцедуры
  