#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение () Экспорт
	
	ЗаполнитьПредопределенныеЭлементы();
	
КонецПроцедуры

Процедура ЗаполнитьПредопределенныеЭлементы()
	
	ЗаписатьПредопределенныйЭлемент(1,Справочники.ВидыВычетовИПН.ВычетОПВ,
		Перечисления.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов,
		Перечисления.ВидыНалоговВзносовОтчислений.ОПВ,0,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца);
	
	ЗаписатьПредопределенныйЭлемент(2,Справочники.ВидыВычетовИПН.ВычетВОСМС,
		Перечисления.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов,
		Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС,0,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца);
	
	ЗаписатьПредопределенныйЭлемент(3,Справочники.ВидыВычетовИПН.Стандартный1МЗП,
		Перечисления.ВидыПредоставленияВычетов.Стандартный,
		Перечисления.ВидыНалоговВзносовОтчислений.ПустаяСсылка(),1,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца);
	
	ЗаписатьПредопределенныйЭлемент(4,Справочники.ВидыВычетовИПН.Стандартный75МЗПИнвалиды,
		Перечисления.ВидыПредоставленияВычетов.Стандартный,
		Перечисления.ВидыНалоговВзносовОтчислений.ПустаяСсылка(),75,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода);
	
	ЗаписатьПредопределенныйЭлемент(5,Справочники.ВидыВычетовИПН.Стандартный75МЗПРодители,
		Перечисления.ВидыПредоставленияВычетов.Стандартный,
		Перечисления.ВидыНалоговВзносовОтчислений.ПустаяСсылка(),75,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода);
	
	ЗаписатьПредопределенныйЭлемент(6,Справочники.ВидыВычетовИПН.ДобровольныеПенсионныеВзносы,
		Перечисления.ВидыПредоставленияВычетов.ПоПериодическимПлатежам,
		Перечисления.ВидыНалоговВзносовОтчислений.ПустаяСсылка(),0,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца);
	
	ЗаписатьПредопределенныйЭлемент(7,Справочники.ВидыВычетовИПН.НаОплатуМедицинскихУслуг,
		Перечисления.ВидыПредоставленияВычетов.ПоПериодическимПлатежам,
		Перечисления.ВидыНалоговВзносовОтчислений.ПустаяСсылка(),8,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода);
		
	ЗаписатьПредопределенныйЭлемент(8,Справочники.ВидыВычетовИПН.ВознагражденияПоЖилищнымЗаймам,
		Перечисления.ВидыПредоставленияВычетов.ПоПериодическимПлатежам,
		Перечисления.ВидыНалоговВзносовОтчислений.ПустаяСсылка(),0,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца);
	
КонецПроцедуры

Процедура ЗаписатьПредопределенныйЭлемент(Приоритет,Ссылка,ПредоставлениеВычета,ВидВзносов,ПределВычета,ПериодПредоставления)
	
	СправочникОбъект = Ссылка.ПолучитьОбъект();
	СправочникОбъект.ОбменДанными.Загрузка = Истина;
	СправочникОбъект.Приоритет = Приоритет;
	СправочникОбъект.ПредоставлениеВычета = ПредоставлениеВычета;
	СправочникОбъект.ВидВзносов = ВидВзносов;
	СправочникОбъект.ПределВычета = ПределВычета;
	СправочникОбъект.ПериодПредоставления = ПериодПредоставления;
	СправочникОбъект.Записать();
	
КонецПроцедуры

Функция МаксимальныйПриоритет() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(ВидыВычетовИПН.Приоритет), 0) КАК Приоритет
		|ИЗ
		|	Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|ГДЕ
		|	ВидыВычетовИПН.ПометкаУдаления <> ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Приоритет;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Процедура ОбновитьСправочникВидыВычетовИПН2019() Экспорт 
	
	Стандартный75МЗПИнвалидыОбъект = Справочники.ВидыВычетовИПН.Стандартный75МЗПИнвалиды.ПолучитьОбъект();
	Стандартный75МЗПИнвалидыОбъект.Наименование = НСтр("ru = 'Стандартный вычет (инвалидам, участникам ВОВ)'");
	Стандартный75МЗПИнвалидыОбъект.ОбменДанными.Загрузка = Истина;
	Стандартный75МЗПИнвалидыОбъект.Записать();
	
	Стандартный75МЗПРодителиОбъект = Справочники.ВидыВычетовИПН.Стандартный75МЗПРодители.ПолучитьОбъект();
	Стандартный75МЗПРодителиОбъект.Наименование = НСтр("ru = 'Стандартный вычет (родителям инвалидов, приемным родителям)'");
	Стандартный75МЗПРодителиОбъект.ОбменДанными.Загрузка = Истина;
	Стандартный75МЗПРодителиОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли