#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Сформировать печатные формы объектов
//
// Параметры:
// 		МассивОбъектов - Массив - Массив ссылок на объекты которые нужно распечатать
// 		ПараметрыПечати - Структура - Структура дополнительных параметров печати
// 		КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
// 		ОбъектыПечати - Объекты печати
// 		ПараметрыВывода - Структура - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОС1") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ОС1",
			НСтр("ru='ДА-1 (Акт приемки-передачи долгосрочных активов)'"),
			СформироватьПечатнуюФормуОС1(
				МассивОбъектов,
				ОбъектыПечати,
				ПараметрыПечати,
				Неопределено));
		
	КонецЕсли;

 	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДА2") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ДА2",
			НСтр("ru='ДА-2 (Инвентарная карточка учета долгосрочных активов)'"),
			СформироватьПечатнуюФормуДА2(
				МассивОбъектов,
				ОбъектыПечати,
				ПараметрыПечати,
				Неопределено));
		
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДА3") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ДА3",
			НСтр("ru='ДА-3 (Акт на выбытие (списание) долгосрочных активов)'"),
			СформироватьПечатнуюФормуДА3(
				МассивОбъектов,
				ОбъектыПечати,
				ПараметрыПечати,
				Неопределено));
		
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуОС1(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, КомплектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОС1";
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтруктураОбъектов.Ключ);
		ДанныеДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатнойФормыОС1(ПараметрыПечати, СтруктураОбъектов.Значение);
		
		ЗаполнитьТабличныйДокументОС1(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, КомплектыПечати);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ЗаполнитьТабличныйДокументОС1(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, КомплектыПечати)
	
	ШаблонОшибки = НСтр("ru = 'В документе %1 отсутствуют основные средства. Печать ""ДА-1"" не требуется'");
	
	ТоварКод = "";
	
	ПервыйДокумент = Истина;
	ВыборкаДокументы = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ВыборкаПоТабличнымЧастям = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПоДрагоценнымМатериалам = ДанныеДляПечати.РезультатПоДрагоценнымМатериалам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СтруктураОтбора = Новый Структура("Ссылка");
	
	Пока ВыборкаДокументы.Следующий() Цикл
		
		// Для печати комплектов
		Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("Ссылка") <> Неопределено Тогда
			КомплектПечатиПоСсылке = КомплектыПечати.Найти(ВыборкаДокументы.Ссылка,"Ссылка");
			Если КомплектПечатиПоСсылке = Неопределено Тогда
				КомплектПечатиПоСсылке = КомплектыПечати[0];
			КонецЕсли;
			Если КомплектПечатиПоСсылке.Экземпляров = 0 Тогда
				Продолжить
			КонецЕсли;
		КонецЕсли;
		
		СтруктураОтбора.Ссылка = ВыборкаДокументы.Ссылка;
		ВыборкаПоТабличнымЧастям.Сбросить();
		Если Не ВыборкаПоТабличнымЧастям.НайтиСледующий(СтруктураОтбора) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ШаблонОшибки,
					ВыборкаДокументы.Ссылка
				),
				ВыборкаДокументы.Ссылка);
			Продолжить;
		КонецЕсли;
		
		ВыборкаПоСтрокам = ВыборкаПоТабличнымЧастям.Выбрать();
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		ЗаполнитьМакетДА1(ТабличныйДокумент, ВыборкаДокументы, ВыборкаПоСтрокам, ВыборкаПоДрагоценнымМатериалам);
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументы.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьМакетОС1(ТабличныйДокумент, ВыборкаПоДокументам, ВыборкаПоТабличнымЧастям, ВыборкаПоДрагоценнымМеталлам)
	
	РеквизитыОтветственныхЛиц = РеквизитыОтветственныхЛиц(ВыборкаПоДокументам);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОС1.ПФ_MXL_ОС1");
	
	Страница1 = Макет.ПолучитьОбласть("Страница1");
	Страница2_Шапка = Макет.ПолучитьОбласть("Страница2_Шапка");
	Страница2_Таблица3_Шапка = Макет.ПолучитьОбласть("Страница2_Таблица3_Шапка");
	Страница2_Таблица3_Строка = Макет.ПолучитьОбласть("Страница2_Таблица3_Строка");
	Страница2_Таблица3_Подвал = Макет.ПолучитьОбласть("Страница2_Таблица3_Подвал");
	Страница2_Подвал = Макет.ПолучитьОбласть("Страница2_Подвал");
	Страница3 = Макет.ПолучитьОбласть("Страница3");
	
	Страница1.Параметры.Заполнить(ВыборкаПоДокументам);
	Страница1.Параметры.Заполнить(ВыборкаПоТабличнымЧастям);
	Страница1.Параметры.Заполнить(РеквизитыОтветственныхЛиц);
	ЗаполнитьРеквизитыШапкиОС1(ВыборкаПоДокументам, Страница1, ТабличныйДокумент);
	Страница1.Параметры.ДатаВвода = ВыборкаПоТабличнымЧастям.ДатаВводаВЭксплуатацию;
	Если ВыборкаПоТабличнымЧастям.АмортизационнаяГруппа = 11 Тогда
		Страница1.Параметры.АмортизационнаяГруппа = НСтр("ru='Отдельная'");
	КонецЕсли;
	ТабличныйДокумент.Вывести(Страница1);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	Страница2_Шапка.Параметры.Заполнить(ВыборкаПоДокументам);
	Страница2_Шапка.Параметры.Заполнить(ВыборкаПоТабличнымЧастям);
	Страница2_Шапка.Параметры.СрокИспользованияФакт = ОбъектыЭксплуатации.КоличествоМесяцевСтрокой(
		ВыборкаПоТабличнымЧастям.СрокИспользованияФакт);
	Страница2_Шапка.Параметры.СрокИспользования = ОбъектыЭксплуатации.КоличествоМесяцевСтрокой(
		ВыборкаПоТабличнымЧастям.СрокИспользования);
	Страница2_Шапка.Параметры.СрокИспользованияРаздел2 = ОбъектыЭксплуатации.КоличествоМесяцевСтрокой(
		ВыборкаПоТабличнымЧастям.СрокИспользованияРаздел2);
	ТабличныйДокумент.Вывести(Страница2_Шапка);
	
	ТабличныйДокумент.Вывести(Страница2_Таблица3_Шапка);
	СтруктураПоиска = Новый Структура("Ссылка", ВыборкаПоДокументам.Ссылка);
	ВыборкаПоДрагоценнымМеталлам.Сбросить();
	Если ВыборкаПоДрагоценнымМеталлам.НайтиСледующий(СтруктураПоиска) Тогда
		ВыборкаПоДМ = ВыборкаПоДрагоценнымМеталлам.Выбрать();
		Пока ВыборкаПоДМ.Следующий() Цикл
			Страница2_Таблица3_Строка.Параметры.Заполнить(ВыборкаПоДМ);
			ТабличныйДокумент.Вывести(Страница2_Таблица3_Строка);
		КонецЦикла;
	Иначе
		Для к=0 По 6 Цикл // Вывод 6 пустых строк для заполнения вручную
			ТабличныйДокумент.Вывести(Страница2_Таблица3_Строка);
		КонецЦикла;
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(Страница2_Таблица3_Подвал);
	ТабличныйДокумент.Вывести(Страница2_Подвал);
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	Страница3.Параметры.Заполнить(ВыборкаПоДокументам);
	Страница3.Параметры.Заполнить(РеквизитыОтветственныхЛиц);
	Страница3.Параметры.ТабельныйНомерСдалМОЛ = ТабельныйНомерФизЛица(
		ВыборкаПоДокументам.СдалМОЛ, ВыборкаПоДокументам.Сдатчик, ВыборкаПоДокументам.ДатаДокумента);
	ТабличныйДокумент.Вывести(Страница3);
	
КонецПроцедуры

Процедура ЗаполнитьМакетОС1а(ТабличныйДокумент, ВыборкаПоДокументам, ВыборкаПоТабличнымЧастям, ВыборкаПоДрагоценнымМеталлам)
	
	РеквизитыОтветственныхЛиц = РеквизитыОтветственныхЛиц(ВыборкаПоДокументам);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОС1.ПФ_MXL_ОС1а");
	
	Страница1 = Макет.ПолучитьОбласть("Страница1");
	Страница2_Шапка = Макет.ПолучитьОбласть("Страница2_Шапка");
	Страница2_Таблица3_Шапка = Макет.ПолучитьОбласть("Страница2_Таблица3_Шапка");
	Страница2_Таблица3_Строка = Макет.ПолучитьОбласть("Страница2_Таблица3_Строка");
	Страница2_Таблица3_Подвал = Макет.ПолучитьОбласть("Страница2_Таблица3_Подвал");
	Страница3 = Макет.ПолучитьОбласть("Страница3");
	
	Страница2_Таблица4 = Макет.ПолучитьОбласть("Страница2_Таблица4");
	
	Страница1.Параметры.Заполнить(ВыборкаПоДокументам);
	Страница1.Параметры.Заполнить(ВыборкаПоТабличнымЧастям);
	Страница1.Параметры.Заполнить(РеквизитыОтветственныхЛиц);
	ЗаполнитьРеквизитыШапкиОС1(ВыборкаПоДокументам, Страница1, ТабличныйДокумент);
	Страница1.Параметры.ДатаВвода = ВыборкаПоТабличнымЧастям.ДатаВводаВЭксплуатацию;
		Если ВыборкаПоТабличнымЧастям.АмортизационнаяГруппа = 11 Тогда
		Страница1.Параметры.АмортизационнаяГруппа = НСтр("ru='Отдельная'");
	КонецЕсли;
	ТабличныйДокумент.Вывести(Страница1);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	Страница2_Шапка.Параметры.Заполнить(ВыборкаПоДокументам);
	Страница2_Шапка.Параметры.Заполнить(ВыборкаПоТабличнымЧастям);
	Страница2_Шапка.Параметры.СрокИспользованияФакт = ОбъектыЭксплуатации.КоличествоМесяцевСтрокой(
		ВыборкаПоТабличнымЧастям.СрокИспользованияФакт);
	Страница2_Шапка.Параметры.СрокИспользованияРаздел2 = ОбъектыЭксплуатации.КоличествоМесяцевСтрокой(
		ВыборкаПоТабличнымЧастям.СрокИспользованияРаздел2);
	ТабличныйДокумент.Вывести(Страница2_Шапка);
	
	ТабличныйДокумент.Вывести(Страница2_Таблица3_Шапка);
	СтруктураПоиска = Новый Структура("Ссылка", ВыборкаПоДокументам.Ссылка);
	ВыборкаПоДрагоценнымМеталлам.Сбросить();
	Если ВыборкаПоДрагоценнымМеталлам.НайтиСледующий(СтруктураПоиска) Тогда
		ВыборкаПоДМ = ВыборкаПоДрагоценнымМеталлам.Выбрать();
		Пока ВыборкаПоДМ.Следующий() Цикл
			Страница2_Таблица3_Строка.Параметры.Заполнить(ВыборкаПоДМ);
			ТабличныйДокумент.Вывести(Страница2_Таблица3_Строка);
		КонецЦикла;
	Иначе
		Для к=0 По 6 Цикл // Вывод 6 пустых строк для заполнения вручную
			ТабличныйДокумент.Вывести(Страница2_Таблица3_Строка);
		КонецЦикла;
	КонецЕсли;
	
	
	ТабличныйДокумент.Вывести(Страница2_Таблица3_Подвал);
	
	ТабличныйДокумент.Вывести(Страница2_Таблица4);
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	Страница3.Параметры.Заполнить(ВыборкаПоДокументам);
	Страница3.Параметры.Заполнить(РеквизитыОтветственныхЛиц);
	Страница3.Параметры.ТабельныйНомерСдалМОЛ = ТабельныйНомерФизЛица(
		ВыборкаПоДокументам.СдалМОЛ, ВыборкаПоДокументам.Сдатчик, ВыборкаПоДокументам.ДатаДокумента);
	ТабличныйДокумент.Вывести(Страница3);
	
КонецПроцедуры

Процедура ЗаполнитьМакетОС1б(ТабличныйДокумент, ВыборкаПоДокументам, ВыборкаПоТабличнымЧастям, ВыборкаПоДрагоценнымМеталлам)
	
	РеквизитыОтветственныхЛиц = РеквизитыОтветственныхЛиц(ВыборкаПоДокументам);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОС1.ПФ_MXL_ОС1б");
	
	ОбщаяДатаВводаВЭксплуатацию = Истина;
	ДатаВводаВЭксплуатацию = Неопределено;
	Пока ВыборкаПоТабличнымЧастям.Следующий() Цикл
		
		Если ОбщаяДатаВводаВЭксплуатацию Тогда
			Если ДатаВводаВЭксплуатацию = Неопределено Тогда
				ДатаВводаВЭксплуатацию = ВыборкаПоТабличнымЧастям.ДатаВводаВЭксплуатацию;
			КонецЕсли;
			Если ДатаВводаВЭксплуатацию <> ВыборкаПоТабличнымЧастям.ДатаВводаВЭксплуатацию Тогда
				ОбщаяДатаВводаВЭксплуатацию = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Страница1 = Макет.ПолучитьОбласть("Страница1");
	Страница2_Шапка = Макет.ПолучитьОбласть("Страница2_Шапка");
	Страница2_Таблица1_Шапка = Макет.ПолучитьОбласть("Страница2_Таблица1_Шапка");
	Страница2_Таблица1_Строка = Макет.ПолучитьОбласть("Страница2_Таблица1_Строка");
	Страница2_Таблица1_СтрокаПусто = Макет.ПолучитьОбласть("Страница2_Таблица1_СтрокаПусто");
	Страница2_Таблица1_Подвал = Макет.ПолучитьОбласть("Страница2_Таблица1_Подвал");
	Страница2_Подвал = Макет.ПолучитьОбласть("Страница2_Подвал");
	
	Страница3_Шапка = Макет.ПолучитьОбласть("Страница3_Шапка");
	Страница3_Таблица2_Шапка = Макет.ПолучитьОбласть("Страница3_Таблица2_Шапка");
	Страница3_Таблица2_Строка = Макет.ПолучитьОбласть("Страница3_Таблица2_Строка");
	Страница3_Таблица2_СтрокаПусто = Макет.ПолучитьОбласть("Страница3_Таблица2_СтрокаПусто");
	Страница3_Таблица2_Подвал = Макет.ПолучитьОбласть("Страница3_Таблица2_Подвал");
	Страница3_Подвал = Макет.ПолучитьОбласть("Страница3_Подвал");
	Страница4_Шапка = Макет.ПолучитьОбласть("Страница4_Шапка");
	Страница4_Таблица3_Шапка = Макет.ПолучитьОбласть("Страница4_Таблица3_Шапка");
	Страница4_Таблица3_Строка = Макет.ПолучитьОбласть("Страница4_Таблица3_Строка");
	Страница4_Таблица3_Подвал = Макет.ПолучитьОбласть("Страница4_Таблица3_Подвал");
	Страница4_Подвал = Макет.ПолучитьОбласть("Страница4_Подвал");
	
	СтруктураДанных = Новый Структура("СчетУчетаОС", Неопределено);
	СоответствиеСчетовУчета = Новый Соответствие;
	
	ВыборкаПоТабличнымЧастям.Сбросить();
	Пока ВыборкаПоТабличнымЧастям.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураДанных, ВыборкаПоТабличнымЧастям);
		Если ЗначениеЗаполнено(СтруктураДанных.СчетУчетаОС) Тогда
			СоответствиеСчетовУчета.Вставить(СтруктураДанных.СчетУчетаОС, Истина);
		КонецЕсли;
		
	КонецЦикла;
	Если СоответствиеСчетовУчета.Количество() <> 1 Тогда
		СтруктураДанных.СчетУчетаОС = Неопределено;
	КонецЕсли;
	
	// Страница 1 //////////////////////////////////////////////////
	Страница1.Параметры.Заполнить(ВыборкаПоДокументам);
	Страница1.Параметры.Заполнить(СтруктураДанных);
	Страница1.Параметры.Заполнить(РеквизитыОтветственныхЛиц);
	ЗаполнитьРеквизитыШапкиОС1(ВыборкаПоДокументам, Страница1, ТабличныйДокумент);
	Если ОбщаяДатаВводаВЭксплуатацию Тогда
		Страница1.Параметры.ДатаВвода = ДатаВводаВЭксплуатацию;
	КонецЕсли;
	Если ВыборкаПоТабличнымЧастям.АмортизационнаяГруппа = 11 Тогда
		Страница1.Параметры.АмортизационнаяГруппа = НСтр("ru='Отдельная'");
	КонецЕсли;
	ТабличныйДокумент.Вывести(Страница1);
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	// Страница 2 //////////////////////////////////////////////////
	
	ТабличныйДокумент.Вывести(Страница2_Шапка);
	ТабличныйДокумент.Вывести(Страница2_Таблица1_Шапка);
	
	НомПП = 0;
	ВыборкаПоТабличнымЧастям.Сбросить();
	Пока ВыборкаПоТабличнымЧастям.Следующий() Цикл
		
		НомПП = НомПП + 1;
		Страница2_Таблица1_Строка.Параметры.Заполнить(ВыборкаПоДокументам);
		Страница2_Таблица1_Строка.Параметры.Заполнить(ВыборкаПоТабличнымЧастям);
		Страница2_Таблица1_Строка.Параметры.НС = НомПП;
		
		ТабличныйДокумент.Вывести(Страница2_Таблица1_Строка);
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(Страница2_Таблица1_Подвал);
	ТабличныйДокумент.Вывести(Страница2_Подвал);
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	// Страница 3 //////////////////////////////////////////////////
	
	ТабличныйДокумент.Вывести(Страница3_Шапка);
	ТабличныйДокумент.Вывести(Страница3_Таблица2_Шапка);
	
	ИтогСтоимостьПервоначальная = 0;
	ИтогЦенаПродажи = 0;
	
	ВыборкаПоТабличнымЧастям.Сбросить();
	Пока ВыборкаПоТабличнымЧастям.Следующий() Цикл
		СтруктураСтроки = Новый Структура("СтоимостьПервоначальная, ЦенаПродажи", 0, 0);
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, ВыборкаПоТабличнымЧастям);
		ИтогСтоимостьПервоначальная = ИтогСтоимостьПервоначальная + СтруктураСтроки.СтоимостьПервоначальная;
		ИтогЦенаПродажи = ИтогЦенаПродажи + СтруктураСтроки.ЦенаПродажи;
		
		Страница3_Таблица2_Строка.Параметры.Заполнить(ВыборкаПоДокументам);
		Страница3_Таблица2_Строка.Параметры.Заполнить(ВыборкаПоТабличнымЧастям);
		Страница3_Таблица2_Строка.Параметры.СрокИспользованияФакт = ОбъектыЭксплуатации.КоличествоМесяцевСтрокой(
			ВыборкаПоТабличнымЧастям.СрокИспользованияФакт);
		Страница3_Таблица2_Строка.Параметры.СрокИспользования = ОбъектыЭксплуатации.КоличествоМесяцевСтрокой(
			ВыборкаПоТабличнымЧастям.СрокИспользованияРаздел2);
		
		ТабличныйДокумент.Вывести(Страница3_Таблица2_Строка);
		
	КонецЦикла;
	
	Страница3_Таблица2_Подвал.Параметры.ИтогСтоимостьПервоначальная = ИтогСтоимостьПервоначальная;
	Страница3_Таблица2_Подвал.Параметры.ИтогЦенаПродажи = ИтогЦенаПродажи;
	ТабличныйДокумент.Вывести(Страница3_Таблица2_Подвал);
	Страница3_Подвал.Параметры.Заполнить(ВыборкаПоДокументам);
	Страница3_Подвал.Параметры.Заполнить(РеквизитыОтветственныхЛиц);
	Страница3_Подвал.Параметры.ТабельныйНомерСдалМОЛ = ТабельныйНомерФизЛица(
		ВыборкаПоДокументам.СдалМОЛ, ВыборкаПоДокументам.Сдатчик, ВыборкаПоДокументам.ДатаДокумента);
	ТабличныйДокумент.Вывести(Страница3_Подвал);
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	// Страница 4 //////////////////////////////////////////////////
	
	ТабличныйДокумент.Вывести(Страница4_Шапка);
	ТабличныйДокумент.Вывести(Страница4_Таблица3_Шапка);
	
	СтруктураПоиска = Новый Структура("Ссылка", ВыборкаПоДокументам.Ссылка);
	ВыборкаПоДрагоценнымМеталлам.Сбросить();
	Если ВыборкаПоДрагоценнымМеталлам.НайтиСледующий(СтруктураПоиска) Тогда
		ВыборкаПоДМ = ВыборкаПоДрагоценнымМеталлам.Выбрать();
		Пока ВыборкаПоДМ.Следующий() Цикл
			Страница4_Таблица3_Строка.Параметры.Заполнить(ВыборкаПоДМ);
			ТабличныйДокумент.Вывести(Страница4_Таблица3_Строка);
		КонецЦикла;
	Иначе
		Для к=0 По 6 Цикл // Вывод 6 пустых строк для заполнения вручную
			ТабличныйДокумент.Вывести(Страница4_Таблица3_Строка);
		КонецЦикла;
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(Страница4_Таблица3_Подвал);
	
	Страница4_Подвал.Параметры.Заполнить(РеквизитыОтветственныхЛиц);
	ТабличныйДокумент.Вывести(Страница4_Подвал);
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыШапкиОС1(ДанныеПечати, ОбластьМакета, ТабличныйДокумент)
	
	// Выводим общие реквизиты шапки
	СведенияОСдатчике = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Сдатчик, ДанныеПечати.ДатаДокумента,, ДанныеПечати.БанковскийСчетСдатчика);
	СведенияОПолучателе = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Получатель, ДанныеПечати.ДатаДокумента,, ДанныеПечати.БанковскийСчетПолучателя);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Номер", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.НомерДокумента));
	СтруктураПараметров.Вставить("Дата", ДанныеПечати.ДатаДокумента);
	
	СтруктураПараметров.Вставить("ОрганизацияСдатчик", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОСдатчике, "НаименованиеДляПечатныхФорм"));
	СтруктураПараметров.Вставить("АдресСдатчика", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОСдатчике, "ФактическийАдрес, Телефоны"));
	СтруктураПараметров.Вставить("БанковскиеРеквизитыСдатчика", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОСдатчике, "НомерСчета,Банк,БИК,КоррСчет"));
	СтруктураПараметров.Вставить("КодПоОКПОСдатчика", СведенияОСдатчике.КодПоОКПО);
	СтруктураПараметров.Вставить("ОрганизацияБИН_Сдатчик", СведенияОСдатчике.ИНН);
	СтруктураПараметров.Вставить("ДолжностьСдал", ДанныеПечати.ДолжностьРуководителя);
	СтруктураПараметров.Вставить("РасшифровкаПодписиСдал", ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.Руководитель));
	
	СтруктураПараметров.Вставить("ОрганизацияПолучатель", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПолучателе, "НаименованиеДляПечатныхФорм"));
	СтруктураПараметров.Вставить("АдресПолучателя", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПолучателе, "ФактическийАдрес, Телефоны"));
	СтруктураПараметров.Вставить("БанковскиеРеквизитыПолучателя", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПолучателе, "НомерСчета,Банк,БИК,КоррСчет"));
	СтруктураПараметров.Вставить("КодПоОКПОПолучателя", СведенияОПолучателе.КодПоОКПО);
	СтруктураПараметров.Вставить("ОрганизацияБИН_Получатель", СведенияОПолучателе.ИНН);
	СтруктураПараметров.Вставить("ДолжностьПринял", ДанныеПечати.ДолжностьРуководителяПолучателя);
	СтруктураПараметров.Вставить("РасшифровкаПодписиПринял", ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.РуководительПолучателя));

	ОбластьМакета.Параметры.Заполнить(СтруктураПараметров);
	
КонецПроцедуры

Функция РеквизитыОтветственныхЛиц(Выборка)
	
	СтруктураВозврата = Новый Структура;
	
	СтруктураВозврата.Вставить("ДолжностьРуководителяСдатчика");
	СтруктураВозврата.Вставить("РуководительСдатчика");
	СтруктураВозврата.Вставить("ГлавныйБухгалтерСдатчика");
	
	СтруктураВозврата.Вставить("СдалМОЛ");
	СтруктураВозврата.Вставить("ДолжностьСдалМОЛ");
	СтруктураВозврата.Вставить("ТабельныйНомерСдалМОЛ");
	
	СтруктураВозврата.Вставить("ДолжностьРуководителяПолучателя");
	СтруктураВозврата.Вставить("РуководительПолучателя");
	СтруктураВозврата.Вставить("ГлавныйБухгалтерПолучателя");
	
	СтруктураВозврата.Вставить("ПринялМОЛ");
	СтруктураВозврата.Вставить("ДолжностьПринялМОЛ");
	СтруктураВозврата.Вставить("ТабельныйНомерПринялМОЛ");
	
	ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	
	Если Не (ЗначениеЗаполнено(СтруктураВозврата.РуководительСдатчика) И ЗначениеЗаполнено(СтруктураВозврата.ГлавныйБухгалтерСдатчика)) Тогда
		ОтветственныеЛица = ОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(Выборка.Сдатчик, Выборка.ДатаДокумента);
		
		Если Не ЗначениеЗаполнено(СтруктураВозврата.РуководительСдатчика) Тогда
			ОтветственныеЛица.Свойство("Руководитель", СтруктураВозврата.РуководительСдатчика);
			ОтветственныеЛица.Свойство("РуководительДолжность", СтруктураВозврата.ДолжностьРуководителяСдатчика);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтруктураВозврата.ГлавныйБухгалтерСдатчика) Тогда
			ОтветственныеЛица.Свойство("ГлавныйБухгалтер", СтруктураВозврата.ГлавныйБухгалтерСдатчика);
		КонецЕсли;
		
	КонецЕсли;
	Если ЗначениеЗаполнено(СтруктураВозврата.РуководительСдатчика) Тогда
		СтруктураВозврата.РуководительСдатчика = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(СтруктураВозврата.РуководительСдатчика, Выборка.ДатаДокумента);
	КонецЕсли;
	Если ЗначениеЗаполнено(СтруктураВозврата.ГлавныйБухгалтерСдатчика) Тогда
		СтруктураВозврата.ГлавныйБухгалтерСдатчика = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(СтруктураВозврата.ГлавныйБухгалтерСдатчика, Выборка.ДатаДокумента);
	КонецЕсли;
	Если ЗначениеЗаполнено(СтруктураВозврата.СдалМОЛ) Тогда
		СтруктураВозврата.СдалМОЛ = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(СтруктураВозврата.СдалМОЛ, Выборка.ДатаДокумента);
		СтруктураВозврата.ТабельныйНомерСдалМОЛ = ТабельныйНомерФизЛица(СтруктураВозврата.СдалМОЛ, Выборка.Сдатчик, Выборка.ДатаДокумента);
	КонецЕсли;
	
	Если Не (ЗначениеЗаполнено(СтруктураВозврата.РуководительПолучателя) И ЗначениеЗаполнено(СтруктураВозврата.ГлавныйБухгалтерПолучателя)) Тогда
		ОтветственныеЛица = ОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(Выборка.Получатель, Выборка.ДатаДокумента);
		
		Если Не ЗначениеЗаполнено(СтруктураВозврата.РуководительПолучателя) Тогда
			ОтветственныеЛица.Свойство("Руководитель", СтруктураВозврата.РуководительПолучателя);
			ОтветственныеЛица.Свойство("РуководительДолжность", СтруктураВозврата.ДолжностьРуководителяПолучателя);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтруктураВозврата.ГлавныйБухгалтерПолучателя) Тогда
			ОтветственныеЛица.Свойство("ГлавныйБухгалтер", СтруктураВозврата.ГлавныйБухгалтерПолучателя);
		КонецЕсли;
		
	КонецЕсли;
	Если ЗначениеЗаполнено(СтруктураВозврата.РуководительПолучателя) Тогда
		СтруктураВозврата.РуководительПолучателя = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(СтруктураВозврата.РуководительПолучателя, Выборка.ДатаДокумента);
	КонецЕсли;
	Если ЗначениеЗаполнено(СтруктураВозврата.ГлавныйБухгалтерПолучателя) Тогда
		СтруктураВозврата.ГлавныйБухгалтерПолучателя = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(СтруктураВозврата.ГлавныйБухгалтерПолучателя, Выборка.ДатаДокумента);
	КонецЕсли;
	Если ЗначениеЗаполнено(СтруктураВозврата.ПринялМОЛ) Тогда
		СтруктураВозврата.ПринялМОЛ = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(СтруктураВозврата.ПринялМОЛ, Выборка.ДатаДокумента);
		СтруктураВозврата.ТабельныйНомерПринялМОЛ = ТабельныйНомерФизЛица(СтруктураВозврата.ПринялМОЛ, Выборка.Получатель, Выборка.ДатаДокумента);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ТабельныйНомерФизЛица(ФизЛицо, Организация, Период)
	
	Если Не ЗначениеЗаполнено(ФизЛицо) Тогда
		Возврат "";
	КонецЕсли;
	Список = Новый Массив;
	Список.Добавить(ФизЛицо);
	ОсновныеСотрудники = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(Список, Истина, Организация, Период);
	Если ОсновныеСотрудники.Количество() = 1 Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновныеСотрудники[0].Сотрудник, "Код");
	КонецЕсли;
	Возврат "";
	
КонецФункции

#Область Печать_ДА1

Процедура ЗаполнитьМакетДА1(ТабличныйДокумент, ВыборкаПоДокументам, ВыборкаПоТабличнымЧастям, ВыборкаПоДрагоценнымМеталлам)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОС1.ПФ_MXL_ДА1");
	
	ШаблонОшибки = НСтр("ru = 'В документе %1 отсутствуют долгосрочные активы. Печать ""ДА-1"" не требуется'");
	
	// Получаем области макета для вывода в табличный документ
	Шапка             = Макет.ПолучитьОбласть("Шапка");
	Таблица  		  = Макет.ПолучитьОбласть("Таблица1");
	СтрокаТаблицы1	  = Макет.ПолучитьОбласть("СтрокаТаблицы1");
	ЗаголовокТаблицы  = Макет.ПолучитьОбласть("ЗаголовокТаблицы2");
	СтрокаТаблицы2     = Макет.ПолучитьОбласть("СтрокаТаблицы2");
	ИтогоСтрокаТаблицы = Макет.ПолучитьОбласть("ИтогоСтрокаТаблицы2");
	Приказ			  = Макет.ПолучитьОбласть("Приказ");
	Подвал            = Макет.ПолучитьОбласть("Подвал");	
	ШапкаОборотнойСтороны = Макет.ПолучитьОбласть("ШапкаОборотнойСтороны");	
	ОССдал			  = Макет.ПолучитьОбласть("ОССдал|Сдал");
	ПодвалВерх	      = Макет.ПолучитьОбласть("ПодвалВерх");
	ПодвалНиз	      = Макет.ПолучитьОбласть("ПодвалНиз");
	ПодвалДатаСдал    = Макет.ПолучитьОбласть("ПодвалДата|Сдал");
	ПодвалДатаПринял  = Макет.ПолучитьОбласть("ПодвалДата|Принял");
	ОСПринял		  = Макет.ПолучитьОбласть("ОССдал|Принял");
	Комиссия          = Макет.ПолучитьОбласть("Комиссия");	
	ПодписьГлавногоБухгалтера = Макет.ПолучитьОбласть("ПодписьГлавногоБухгалтера");
	ПустаяСекцияСдал  = Макет.ПолучитьОбласть("ПодвалПустаяСекция|Сдал");
	
	ВалютаПечати = Константы.ВалютаРегламентированногоУчета.Получить();
		
	Шапка.Параметры.Заполнить(ВыборкаПоДокументам);
	ЗаполнитьРеквизитыШапкиОС1(ВыборкаПоДокументам, Шапка, ТабличныйДокумент);
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, Шапка, ВыборкаПоДокументам.Ссылка);
	ТабличныйДокумент.Вывести(Шапка);

	СтруктураТаблицы1 = Новый Структура;
	СтруктураТаблицы1.Вставить("Валюта", ВалютаПечати);
	Таблица.Параметры.Заполнить(СтруктураТаблицы1);
	ТабличныйДокумент.Вывести(Таблица);
	
	СтруктураОтбора = Новый Структура("Ссылка");
	
	СтруктураОтбора.Ссылка = ВыборкаПоДокументам.Ссылка;
	ВыборкаПоТабличнымЧастям.Сбросить();
	Если Не ВыборкаПоТабличнымЧастям.НайтиСледующий(СтруктураОтбора) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонОшибки,
		ВыборкаПоДокументам.Ссылка
		),
		ВыборкаПоДокументам.Ссылка);               
	КонецЕсли;
	
	ВыборкаПоТабличнымЧастям.Сбросить();
	Пока ВыборкаПоТабличнымЧастям.Следующий() Цикл
		СтрокаТаблицы1.Параметры.Заполнить(ВыборкаПоТабличнымЧастям);
		ТабличныйДокумент.Вывести(СтрокаТаблицы1);  
	КонецЦикла;
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();

	// Вывод второй страницы
	ЗаголовокТаблицы.Параметры.Заполнить(СтруктураТаблицы1);
	ТабличныйДокумент.Вывести(ЗаголовокТаблицы);	
	
    ИтогоБалансоваяСтоимость = 0;
	ИтогоСуммаАмортизации    = 0;
	ИтогоСтоимостьРеализацииСНДС = 0;
	
	// Вывод строк таблицы	
	ВыборкаПоТабличнымЧастям.Сбросить();
	Пока ВыборкаПоТабличнымЧастям.Следующий() Цикл
		СтрокаТаблицы2.Параметры.Заполнить(ВыборкаПоТабличнымЧастям);
		ИтогоСуммаАмортизации = ИтогоСуммаАмортизации + ВыборкаПоТабличнымЧастям.АмортизацияСумма;
		ИтогоБалансоваяСтоимость = ИтогоБалансоваяСтоимость + ВыборкаПоТабличнымЧастям.СтоимостьОстаточная;
		Попытка
			ИтогоСтоимостьРеализацииСНДС = ИтогоСтоимостьРеализацииСНДС + ВыборкаПоТабличнымЧастям.СтоимостьРеализацииСНДС;
		Исключение
		КонецПопытки;
		ТабличныйДокумент.Вывести(СтрокаТаблицы2);
	КонецЦикла;	
	
	СтруктураИтогов = Новый Структура;
	СтруктураИтогов.Вставить("ИтогоСуммаАмортизации", ИтогоСуммаАмортизации);
	СтруктураИтогов.Вставить("ИтогоБалансоваяСтоимость", ИтогоБалансоваяСтоимость);
	Если ИтогоСтоимостьРеализацииСНДС <> 0 Тогда
		СтруктураИтогов.Вставить("ИтогоСтоимостьРеализацииСНДС", ИтогоСтоимостьРеализацииСНДС);
	КонецЕсли;
	ИтогоСтрокаТаблицы.Параметры.Заполнить(СтруктураИтогов);	
	ТабличныйДокумент.Вывести(ИтогоСтрокаТаблицы);
	
	//формируем список основных средств через запятую
	СписокОС = "";
	ВыборкаПоТабличнымЧастям.Сбросить();
	Пока ВыборкаПоТабличнымЧастям.Следующий() Цикл
		Если СписокОС = "" Тогда
			СписокОС = ВыборкаПоТабличнымЧастям.НаименованиеОС;
		Иначе
			СписокОС = СписокОС + ", " + ВыборкаПоТабличнымЧастям.НаименованиеОС;
		КонецЕсли;	
	КонецЦикла;	
		
	СтруктураПриказ = Новый Структура;
	СтруктураПриказ.Вставить("НаименованиеОбъекта", СписокОС);
	СтруктураПриказ.Вставить("ДокументОснованиеДата", ?(ЗначениеЗаполнено(ВыборкаПоДокументам.ДокументОснованиеДата), Формат(ВыборкаПоДокументам.ДокументОснованиеДата, "ДФ='dd.MM.yyyy""г.""'"), """___""___________20____года"));
	Если ТипЗнч(ВыборкаПоДокументам.Ссылка) = Тип("ДокументСсылка.ПодготовкаКПередачеОС") Тогда
		СтруктураПриказ.Вставить("ДокументОснованиеНомер", ?(ЗначениеЗаполнено(ВыборкаПоДокументам.ДокументОснованиеНомер), ВыборкаПоДокументам.ДокументОснованиеНомер, "__________"));
		СтруктураПриказ.Вставить("ДокументОснованиеВид", ?(ЗначениеЗаполнено(ВыборкаПоДокументам.ДокументОснованиеВид), ВыборкаПоДокументам.ДокументОснованиеВид, НСтр("ru='приказа(распоряжения)'")));
	Иначе
		СтруктураПриказ.Вставить("ДокументОснованиеНомер", "__________");
		СтруктураПриказ.Вставить("ДокументОснованиеВид", НСтр("ru='приказа (распоряжения)'"));
	КонецЕсли;
	
	Приказ.Параметры.Заполнить(ВыборкаПоДокументам);
	Приказ.Параметры.Заполнить(СтруктураПриказ);
			
	ТабличныйДокумент.Вывести(Приказ);
	
	ДрагМатериалы = "";
	СтруктураПоиска = Новый Структура("Ссылка", ВыборкаПоДокументам.Ссылка);
	ВыборкаПоДрагоценнымМеталлам.Сбросить();
	Если ВыборкаПоДрагоценнымМеталлам.НайтиСледующий(СтруктураПоиска) Тогда
		ВыборкаПоДМ = ВыборкаПоДрагоценнымМеталлам.Выбрать();
		Пока ВыборкаПоДМ.Следующий() Цикл
			ДрагМатериал = Строка(ВыборкаПоДМ.ДрагоценныйМатериал) + " " + Строка(ВыборкаПоДМ.Количество) + Строка(ВыборкаПоДМ.ЕдиницаИзмерения);
			ДрагМатериалы = ДрагМатериалы + ?(ПустаяСтрока(ДрагМатериалы), "", ", ") + ДрагМатериал;
		КонецЦикла;
		Подвал.Параметры.Заполнить(Новый Структура("ДрагоценныеМатериалы", ДрагМатериалы));
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(Подвал);
	
	// Выведем подпись председателя инвентаризационной комиссии
	СтруктураКомиссия = Новый Структура;
	СтруктураКомиссия.Вставить("ЗаголовокРазделаКомиссии",  НСтр("ru='Председатель комиссии'"));
	Комиссия.Параметры.Заполнить(СтруктураКомиссия);
	ТабличныйДокумент.Вывести(Комиссия);
	
	// Выведем подписи членов комиссии
	ВыводитьЗаголовок = Истина;
	Для Итератор = 1 По 3 Цикл
		Если НЕ ТабличныйДокумент.ПроверитьВывод(Комиссия) Тогда
			// Выведем разрыв страницы
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ВыводитьЗаголовок = Истина; // на новой странице выведем заголовок набора подписей
		КонецЕсли;
		СтруктураКомиссия.ЗаголовокРазделаКомиссии =  ?(ВыводитьЗаголовок, НСтр("ru='Члены комиссии:'"), "");
		Комиссия.Параметры.Заполнить(СтруктураКомиссия);
		
		ТабличныйДокумент.Вывести(Комиссия);
		ВыводитьЗаголовок = Ложь; // в следующей итерации вывод заголовка не нужен
	КонецЦикла;
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	ТабличныйДокумент.Вывести(ШапкаОборотнойСтороны);
	
	//список МОЛ	
	СтруктураОССдал = Новый Структура;
	СтруктураОССдал.Вставить("ОбъектОсновныхСредств", 	НСтр("ru='Долгосрочный актив'"));
	СтруктураОССдал.Вставить("Сдал", 					НСтр("ru='Сдал'"));
	СтруктураОССдал.Вставить("ДолжностьСдал", 			ВыборкаПоДокументам.ДолжностьКладовщика);
	СтруктураОССдал.Вставить("РасшифровкаПодписиСдал", 	ВыборкаПоДокументам.Кладовщик);
	
	ОССдал.Параметры.Заполнить(СтруктураОССдал);	
	ТабличныйДокумент.Вывести(ОССдал);
	
	СтруктураОСПринял = Новый Структура; 
	Если ЗначениеЗаполнено(ВыборкаПоДокументам.Принял) Тогда
		ДанныеМОЛ = УправлениеВнеоборотнымиАктивамиПереопределяемый.ДанныеФизЛиц(ВыборкаПоДокументам.Получатель, ВыборкаПоДокументам.Принял, ВыборкаПоДокументам.ДатаДокумента);
	Иначе
		ДанныеМОЛ = Новый ТаблицаЗначений;
	КонецЕсли;
	СтруктураОСПринял.Вставить("Принял",					НСтр("ru='Принял'"));
	СтруктураОСПринял.Вставить("ДолжностьПринял", 			?(ДанныеМОЛ.Количество() = 0, "", ДанныеМОЛ[0].Должность));
	СтруктураОСПринял.Вставить("РасшифровкаПодписиПринял", 	?(ДанныеМОЛ.Количество() = 0, "", ДанныеМОЛ[0].Представление));
	
	ОСПринял.Параметры.Заполнить(СтруктураОСПринял);
	ТабличныйДокумент.Присоединить(ОСПринял);
	
	ТабличныйДокумент.Вывести(ПодвалДатаСдал);
	ТабличныйДокумент.Присоединить(ПодвалДатаПринял);
	
	ТабличныйДокумент.Вывести(ПодвалВерх);
	ТабличныйДокумент.Вывести(ПодвалНиз);
	
	// Выведем подпись бухгалтера
	СтруктураГлавБух = Новый Структура;
	СтруктураГлавБух.Вставить("ГлавныйБухгалтерСдал", ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ВыборкаПоДокументам.ГлавныйБухгалтер));
	СтруктураГлавБух.Вставить("ГлавныйБухгалтерПринял", ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ВыборкаПоДокументам.ГлавныйБухгалтерПолучателя));
	ПодписьГлавногоБухгалтера.Параметры.Заполнить(СтруктураГлавБух);
	ТабличныйДокумент.Вывести(ПодписьГлавногоБухгалтера);
	
КонецПроцедуры

#КонецОбласти

#Область Печать_ДА2

Функция СформироватьПечатнуюФормуДА2(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, КомплектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСнизу = 0;  
	Если ТипЗнч(МассивОбъектов[0]) = ТипЗнч(Справочники.НематериальныеАктивы.ПустаяСсылка()) Тогда
		ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НМА_ДА2";
	Иначе	
		ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОсновныеСредства_ДА2";
	КонецЕсли;
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтруктураОбъектов.Ключ);
		ДанныеДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатнойФормыДА2(ПараметрыПечати, СтруктураОбъектов.Значение);
		
		ЗаполнитьТабличныйДокументДА2(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, КомплектыПечати);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ЗаполнитьТабличныйДокументДА2(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, КомплектыПечати)
	
	ПервыйДокумент = Истина;
	ВыборкаДанныеОС        = ДанныеДляПечати.РезультатПоОС.Выбрать();
	Если ДанныеДляПечати.РезультатПоРемонту <> Неопределено Тогда
		ВыборкаПоРемонту       = ДанныеДляПечати.РезультатПоРемонту.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;
	Если ДанныеДляПечати.РезультатПоПереоценке <> Неопределено Тогда
		ВыборкаПоПереоценке    = ДанныеДляПечати.РезультатПоПереоценке.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;
	Если ДанныеДляПечати.РезультатПоСобытиям <> Неопределено Тогда
		ВыборкаПоСобытиям = ДанныеДляПечати.РезультатПоСобытиям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;	
	Если ДанныеДляПечати.РезультатДрагМатериалы <> Неопределено Тогда
		ВыборкаДМ = ДанныеДляПечати.РезультатДрагМатериалы.Выбрать();
	КонецЕсли;	
		
	Пока ВыборкаДанныеОС.Следующий() Цикл
				
		// Для печати комплектов
		Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("ОсновноеСредство") <> Неопределено Тогда
			КомплектПечатиПоСсылке = КомплектыПечати.Найти(ВыборкаДанныеОС.Ссылка,"ОсновноеСредство");
			Если КомплектПечатиПоСсылке = Неопределено Тогда
				КомплектПечатиПоСсылке = КомплектыПечати[0];
			КонецЕсли;
			Если КомплектПечатиПоСсылке.Экземпляров = 0 Тогда
				Продолжить
			КонецЕсли;
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		ЗаполнитьМакетДА2(ТабличныйДокумент, ВыборкаДанныеОС, ВыборкаПоРемонту, ВыборкаПоПереоценке, ВыборкаПоСобытиям, ВыборкаДМ);		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		// Выведем нужное количество экземпляров (при печати комплектов)
		Если КомплектыПечати <> Неопределено И КомплектыПечати.Колонки.Найти("ОсновноеСредство") <> Неопределено И КомплектПечатиПоСсылке.Экземпляров > 1 Тогда
			ОбластьКопирования = ТабличныйДокумент.ПолучитьОбласть(НомерСтрокиНачало,,ТабличныйДокумент.ВысотаТаблицы);
			Для Итератор = 2 По КомплектПечатиПоСсылке.Экземпляров Цикл
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьКопирования);
			КонецЦикла;
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДанныеОС.ОсновноеСредство);
		
	КонецЦикла;
	
КонецПроцедуры
                                                                                              
Процедура ЗаполнитьМакетДА2(ТабличныйДокумент, ВыборкаДанныеОС, РезультатМодернизацииРемонты, ВыборкаПереоценкиОС, ВыборкаСобытияОС, ВыборкаДМ)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОС1.ПФ_MXL_ДА2");
	
	ЛицеваяСторона                   = Макет.ПолучитьОбласть("ЛицеваяСторона");
	СведенияОДостройкеИРемонтеШапка  = Макет.ПолучитьОбласть("СведенияОДостройкеИРемонтеШапка");
	СведенияОДостройкеИРемонтеСтрока = Макет.ПолучитьОбласть("СведенияОДостройкеИРемонтеСтрока");
	СведенияОПереоценкеИПеремещенииШапка      = Макет.ПолучитьОбласть("СведенияОПереоценкиИПеремещенииШапка");
	СведенияОПереоценкеИПеремещенииСтрока     = Макет.ПолучитьОбласть("СведенияОПереоценкиИПеремещенииСтрока");
	КраткаяИндивидуальнаяХарактеристикаАктива = Макет.ПолучитьОбласть("КраткаяИндивидуальнаяХарактеристикаАктива");

	Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	ДатаСведений = ТекущаяДатаСеанса();
	
	СтруктураОтбора = Новый Структура("ОсновноеСредство");
	СтруктураОтбора.ОсновноеСредство = ВыборкаДанныеОС.ОсновноеСредство;
	
	ЛицеваяСторона.Параметры.Заполнить(ВыборкаДанныеОС);
		
	СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаДанныеОС.Организация, ТекущаяДатаСеанса());
	
	СтруктураДанныхШапки = Новый Структура;
	СтруктураДанныхШапки.Вставить("ПредставлениеОрганизации", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм"));
	СтруктураДанныхШапки.Вставить("ОрганизацияИИН_БИН", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "ИНН,", Ложь));	
	
	СтруктураДанныхШапки.Вставить("ДатаДокумента", Формат(ДатаСведений, "ДФ=dd.MM.yyyy"));
	СтруктураДанныхШапки.Вставить("НомерДокумента", ВыборкаДанныеОС.ИнвентарныйНомер);
	
	// Заполнение таблицы, которая расположена сверху и имеет 19 колонок
	
	Если ВыборкаСобытияОС <> Неопределено И ВыборкаСобытияОС.Количество() <> 0 Тогда	
		ВыборкаСобытияОС.Сбросить();	
		Пока ВыборкаСобытияОС.НайтиСледующий(СтруктураОтбора) Цикл
			Если ВыборкаСобытияОС.ВидСобытияОС = Перечисления.ВидыСобытийОС.ПринятиеКУчету 
				Или ВыборкаСобытияОС.ВидСобытияОС = Перечисления.ВидыСобытийОС.ПринятиеКУчетуСВводомВЭксплуатацию 
				Или ВыборкаСобытияОС.ВидСобытияОС = Перечисления.ВидыСостоянийНМА.ПринятКУчету Тогда
			
				НомерДокумента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '№ %1 %2 %3'"), ВыборкаСобытияОС.РегистраторНомер, НСтр("ru= ' от '"), Формат(ВыборкаСобытияОС.РегистраторДата, "ДФ=dd.MM.yyyy"));
				СтруктураДанныхШапки.Вставить("ДокументВводаДатаНомер", НомерДокумента);
			ИначеЕсли ВыборкаСобытияОС.ВидСобытияОС = Перечисления.ВидыСобытийОС.Списание 
				Или ВыборкаСобытияОС.ВидСобытияОС = Перечисления.ВидыСобытийОС.ПодготовкаКПередаче 
				Или ВыборкаСобытияОС.ВидСобытияОС =Перечисления.ВидыСостоянийНМА.Списан Тогда
				
				НомерДокумента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '№ %1 %2 %3'"), ВыборкаСобытияОС.РегистраторНомер, НСтр("ru= ' от '"), Формат(ВыборкаСобытияОС.РегистраторДата, "ДФ=dd.MM.yyyy"));
				СтруктураДанныхШапки.Вставить("ДокументВыбытияДатаНомер", НомерДокумента);
				СтруктураДанныхШапки.Вставить("ПричинаВыбытия", ВыборкаСобытияОС.Событие);
			КонецЕсли;	
		КонецЦикла;		
	КонецЕсли;
	СтруктураДанныхШапки.Вставить("ГодВыпуска", Формат(ВыборкаДанныеОС.ГодВыпуска, "ДФ=yyyy"));
	СтруктураДанныхШапки.Вставить("СуммаНачисленнойАмортизации", ВыборкаДанныеОС.НакопленнаяАмортизация);
	СтруктураДанныхШапки.Вставить("ЛиквидационнаяСтоимость", 	 ВыборкаДанныеОС.ЛиквидационнаяСтоимость);
	СтруктураДанныхШапки.Вставить("БалансоваяСтоимость", 		 ВыборкаДанныеОС.НакопленнаяСтоимость - ВыборкаДанныеОС.НакопленнаяАмортизация);
	СтруктураДанныхШапки.Вставить("Валюта",						 Валюта);
	
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ЛицеваяСторона, ВыборкаДанныеОС.ОсновноеСредство); 
	
	ЛицеваяСторона.Параметры.Заполнить(СтруктураДанныхШапки);
	ТабличныйДокумент.Вывести(ЛицеваяСторона);	
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	// Заполнение таблицы, которая имеет 8 колонок и содержит сведения о ремонте, достройке и т.д. 	
	СтруктураДостройкиИРемонта = Новый Структура;		
	СтруктураДостройкиИРемонта.Вставить("Валюта", Валюта);
	
	//Заполнение сведений о драг.материалах
	ДрагМатериалы = "";
	Если ВыборкаДМ <> Неопределено И ВыборкаДМ.Количество() <> 0 Тогда
		ВыборкаДМ.Сбросить();	
		Пока ВыборкаДМ.НайтиСледующий(СтруктураОтбора) Цикл
			ДрагМатериал = Строка(ВыборкаДМ.ДрагМатериал) + " " + Строка(ВыборкаДМ.КоличествоДМ) + Строка(ВыборкаДМ.ЕдиницаИзмерения);
			ДрагМатериалы = ДрагМатериалы + ?(ПустаяСтрока(ДрагМатериалы), "", ", ") + ДрагМатериал;
		КонецЦикла;
		СтруктураДостройкиИРемонта.Вставить("ДрагоценныеМатериалы", ДрагМатериалы);
	КонецЕсли;	
	
	СведенияОДостройкеИРемонтеШапка.Параметры.Заполнить(СтруктураДостройкиИРемонта);
	ТабличныйДокумент.Вывести(СведенияОДостройкеИРемонтеШапка);
	
	// Вывод строк 
	Если РезультатМодернизацииРемонты <> Неопределено и РезультатМодернизацииРемонты.Количество() <> 0 Тогда
		ТабЗначМодернизацииОС = Новый ТаблицаЗначений();
		ТабЗначМодернизацииОС.Колонки.Добавить("ДокМодернизацииДата");
		ТабЗначМодернизацииОС.Колонки.Добавить("ДокМодернизацииНомер");
		ТабЗначМодернизацииОС.Колонки.Добавить("ИнвентарныйНомер");
		ТабЗначМодернизацииОС.Колонки.Добавить("ЗатратыНаМодернизацию");
		
		ТабЗначРемонтыОС = Новый ТаблицаЗначений();
		ТабЗначРемонтыОС.Колонки.Добавить("ДокРемонтаДата");
		ТабЗначРемонтыОС.Колонки.Добавить("ДокРемонтаНомер");
		ТабЗначРемонтыОС.Колонки.Добавить("ЗатратыНаРемонт");
		
		РезультатМодернизацииРемонты.Сбросить();	
		Пока РезультатМодернизацииРемонты.НайтиСледующий(СтруктураОтбора) Цикл
			
			Если РезультатМодернизацииРемонты.СодержимоеСтроки = "Модернизация" Тогда
				
				СтрокаТабЗначМодернизацииОС = ТабЗначМодернизацииОС.Добавить();
				СтрокаТабЗначМодернизацииОС.ДокМодернизацииДата   = Формат(РезультатМодернизацииРемонты.Период, "ДФ=dd.MM.yyyy");
				СтрокаТабЗначМодернизацииОС.ДокМодернизацииНомер  = РезультатМодернизацииРемонты.НомерДокумента;
				СтрокаТабЗначМодернизацииОС.ИнвентарныйНомер      = ВыборкаДанныеОС.ИнвентарныйНомер;
				СтрокаТабЗначМодернизацииОС.ЗатратыНаМодернизацию = РезультатМодернизацииРемонты.СуммаЗатрат;
				
			ИначеЕсли РезультатМодернизацииРемонты.СодержимоеСтроки = "Ремонт" Тогда
				
				СтрокаТабЗначРемонтыОС = ТабЗначРемонтыОС.Добавить();
				СтрокаТабЗначРемонтыОС.ДокРемонтаДата  = Формат(РезультатМодернизацииРемонты.Период, "ДФ=dd.MM.yyyy");
				СтрокаТабЗначРемонтыОС.ДокРемонтаНомер = РезультатМодернизацииРемонты.НомерДокумента;
				СтрокаТабЗначРемонтыОС.ЗатратыНаРемонт = РезультатМодернизацииРемонты.СуммаЗатрат;
				
			КонецЕсли;
			
		КонецЦикла;
		
		МаксимальныйИндексТабЗначМодернизацииОС = ТабЗначМодернизацииОС.Количество() - 1; 
		МаксимальныйИндексТабЗначРемонтыОС = ТабЗначРемонтыОС.Количество() - 1;	
		МаксимальныйИндекс = Макс(МаксимальныйИндексТабЗначМодернизацииОС, МаксимальныйИндексТабЗначРемонтыОС);
		
		Для ИндексСтроки = 0 По МаксимальныйИндекс Цикл
			
			Если МаксимальныйИндексТабЗначМодернизацииОС >= ИндексСтроки Тогда
				СтрокаТабЗначМодернизацииОС = ТабЗначМодернизацииОС.Получить(ИндексСтроки);
				ЗаполнитьЗначенияСвойств(СведенияОДостройкеИРемонтеСтрока.Параметры, СтрокаТабЗначМодернизацииОС);
			КонецЕсли;
			
			Если МаксимальныйИндексТабЗначРемонтыОС >= ИндексСтроки Тогда
				СтрокаТабЗначРемонтыОС = ТабЗначРемонтыОС.Получить(ИндексСтроки);
				ЗаполнитьЗначенияСвойств(СведенияОДостройкеИРемонтеСтрока.Параметры, СтрокаТабЗначРемонтыОС);
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(СведенияОДостройкеИРемонтеСтрока);
			
		КонецЦикла;
		
		Если МаксимальныйИндекс = -1 Тогда
			Для каждого ВыбПараметр Из СведенияОДостройкеИРемонтеСтрока.Параметры Цикл 
				ВыбПараметр = "";
			КонецЦикла;	
			ТабличныйДокумент.Вывести(СведенияОДостройкеИРемонтеСтрока);
		КонецЕсли;
	Иначе	
		Для каждого ВыбПараметр Из СведенияОДостройкеИРемонтеСтрока.Параметры Цикл 
			 ВыбПараметр = "";
		КонецЦикла;	
		ТабличныйДокумент.Вывести(СведенияОДостройкеИРемонтеСтрока);
	КонецЕсли;
	
	// Заполнение таблиц "Сведения о переоценке" и "Сведения о внутреннем перемещении"
	СтруктураПереоценкиИПеремещения = Новый Структура;		
	СтруктураПереоценкиИПеремещения.Вставить("Валюта", Валюта);
	СведенияОПереоценкеИПеремещенииШапка.Параметры.Заполнить(СтруктураПереоценкиИПеремещения);		
	ТабличныйДокумент.Вывести(СведенияОПереоценкеИПеремещенииШапка);
	
	ТабЗначПеремещенияОС = Новый ТаблицаЗначений();
	ТабЗначПеремещенияОС.Колонки.Добавить("ПеремещениеДокументДатаНомер");
	ТабЗначПеремещенияОС.Колонки.Добавить("Подразделение");
	ТабЗначПеремещенияОС.Колонки.Добавить("БалансоваяСтоимость");
	Если ВыборкаСобытияОС <> Неопределено И ВыборкаСобытияОС.Количество() <> 0 Тогда	
		ВыборкаСобытияОС.Сбросить();	
		Пока ВыборкаСобытияОС.НайтиСледующий(СтруктураОтбора) Цикл
			Если ВыборкаСобытияОС.ВидСобытияОС = Перечисления.ВидыСобытийОС.ВнутреннееПеремещение Тогда
				СтрокаТабЗначПеремещенияОС = ТабЗначПеремещенияОС.Добавить();			
				ПеремещениеДокументДатаНомер = "Документ, Дата, Номер";
				ПеремещениеДокументДатаНомер = СтрЗаменить(ПеремещениеДокументДатаНомер, "Документ", ВыборкаСобытияОС.РегистраторТип);
				ПеремещениеДокументДатаНомер = СтрЗаменить(ПеремещениеДокументДатаНомер, "Дата",     ВыборкаСобытияОС.РегистраторНомер);
				ПеремещениеДокументДатаНомер = СтрЗаменить(ПеремещениеДокументДатаНомер, "Номер",    Формат(ВыборкаСобытияОС.РегистраторДата, "ДФ=dd.MM.yyyy"));	
				СтрокаТабЗначПеремещенияОС.ПеремещениеДокументДатаНомер = ПеремещениеДокументДатаНомер;			
				СтрокаТабЗначПеремещенияОС.Подразделение       = ВыборкаСобытияОС.Местонахождение;			
				СтрокаТабЗначПеремещенияОС.БалансоваяСтоимость = ВыборкаСобытияОС.ОстаточнаяСтоимость;
			КонецЕсли;	
		КонецЦикла;		
	Иначе
		СтрокаТабЗначПеремещенияОС = ТабЗначПеремещенияОС.Добавить();
		СтрокаТабЗначПеремещенияОС.БалансоваяСтоимость = 0;
	КонецЕсли;
	
	ТабЗначПереоценкиОС = Новый ТаблицаЗначений();
	ТабЗначПереоценкиОС.Колонки.Добавить("ПереоценкаДата");
	ТабЗначПереоценкиОС.Колонки.Добавить("СтоимостьСУчетомПереоценки");
	Если ВыборкаПереоценкиОС <> Неопределено и ВыборкаПереоценкиОС.Количество() <> 0 Тогда		
		
	Иначе
		СтрокаТабЗначПереоценкиОС = ТабЗначПереоценкиОС.Добавить();
		СтрокаТабЗначПереоценкиОС.СтоимостьСУчетомПереоценки = 0;
	КонецЕсли;
	
	
	МаксимальныйИндексТабЗначПереоценкиОС = ТабЗначПереоценкиОС.Количество() - 1;
	МаксимальныйИндексТабЗначПеремещенияОС = ТабЗначПеремещенияОС.Количество() - 1;	
	МаксимальныйИндекс = Макс(МаксимальныйИндексТабЗначПереоценкиОС, МаксимальныйИндексТабЗначПеремещенияОС);
	
	Для ИндексСтроки = 0 По МаксимальныйИндекс Цикл
		
		Если МаксимальныйИндексТабЗначПереоценкиОС >= ИндексСтроки Тогда
			СтрокаТабЗначПереоценкиОС = ТабЗначПереоценкиОС.Получить(ИндексСтроки);
			ЗаполнитьЗначенияСвойств(СведенияОПереоценкеИПеремещенииСтрока.Параметры, СтрокаТабЗначПереоценкиОС);
		Иначе
			ОбластьСведенияОПереоценкиСтрока = СведенияОПереоценкеИПеремещенииСтрока.Область("СведенияОПереоценкиСтрока");
			ОбластьСведенияОПереоценкиСтрока.Очистить(Истина, Истина, Истина);
		КонецЕсли;
		
		Если МаксимальныйИндексТабЗначПеремещенияОС >= ИндексСтроки Тогда
			СтрокаТабЗначПеремещенияОС = ТабЗначПеремещенияОС.Получить(ИндексСтроки);
			ЗаполнитьЗначенияСвойств(СведенияОПереоценкеИПеремещенииСтрока.Параметры, СтрокаТабЗначПеремещенияОС);
		Иначе
			ОбластьСведенияОПеремещенииСтрока = СведенияОПереоценкеИПеремещенииСтрока.Область("СведенияОПеремещенииСтрока");
			ОбластьСведенияОПеремещенииСтрока.Очистить(Истина, Истина, Истина);		
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(СведенияОПереоценкеИПеремещенииСтрока);
		
	КонецЦикла;
	
	Если МаксимальныйИндекс = -1 Тогда
		Для каждого ВыбПараметр Из СведенияОПереоценкеИПеремещенииСтрока.Параметры Цикл 
			 ВыбПараметр = "";
		КонецЦикла;
		ТабличныйДокумент.Вывести(СведенияОПереоценкеИПеремещенииСтрока);
	КонецЕсли;
	
	//Вывод таблицы "Краткая индивидуальная характеристика актива"
	ТабличныйДокумент.Вывести(КраткаяИндивидуальнаяХарактеристикаАктива);
			
КонецПроцедуры

#КонецОбласти

#Область Печать_ДА3

Функция СформироватьПечатнуюФормуДА3(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, КомплектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	// Зададим параметры макета
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ДА3";
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтруктураОбъектов.Ключ);
		
		ДанныеДляПечати = МенеджерОбъекта.ДанныеПечатнойФормыОС4(СтруктураОбъектов.Значение);
		
		ЗаполнитьТабличныйДокументДА3(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати);
	КонецЦикла;
	Возврат ТабличныйДокумент;

КонецФункции

Процедура ЗаполнитьРеквизитыШапкиДА3(ДанныеПечати, Макет, ТабличныйДокумент)
	
	// Выводим общие реквизиты шапки
	СведенияОПокупателе = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, ДанныеПечати.Ссылка);
	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
	
	ОтветственныеЛица = ОтветственныеЛицаБП.ОтветственныеЛица(ДанныеПечати.Организация, ДанныеПечати.Дата, ДанныеПечати.ПодразделениеОрганизации);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПредставлениеОрганизации", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПокупателе, "НаименованиеДляПечатныхФорм"));
	СтруктураПараметров.Вставить("ОрганизацияБИН", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПокупателе, "ИНН,", Ложь));
	СтруктураПараметров.Вставить("НомерДок", ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ДанныеПечати.Номер));
	СтруктураПараметров.Вставить("ДатаДок", Формат(ДанныеПечати.Дата, "ДФ=dd.MM.yyyy")+ " г.");	  
	СтруктураПараметров.Вставить("РасшифровкаПодписи", ОтветственныеЛица.РуководительПредставление);
	
	ОбластьМакета.Параметры.Заполнить(СтруктураПараметров);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	// Выводим заголовок докмента
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаблицы1");
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Валюта", Константы.ВалютаРегламентированногоУчета.Получить());
	ОбластьМакета.Параметры.Заполнить(СтруктураПараметров);
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры

Процедура ЗаполнитьТабличныйДокументДА3(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати)
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
		
	ИспользоватьУчетДМ = ПолучитьФункциональнуюОпцию("ИспользоватьУчетДрагоценныхМатериалов");
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеОС_ДА3";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОС1.ПФ_MXL_ДА3");
	
	Результат = ДанныеДляПечати.ПоДокументам;
	Если ДанныеДляПечати.ПоПрочимОприходованиям <> Неопределено Тогда
		ВыборкаПрочихОприходований = ДанныеДляПечати.ПоПрочимОприходованиям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Иначе
		ВыборкаПрочихОприходований = Null;
	КонецЕсли;
	
	ВыборкаДокументов = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		ЗаполнитьРеквизитыШапкиДА3(ВыборкаДокументов, Макет, ТабличныйДокумент);
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ПодразделениеОтветственныхЛиц = ВыборкаДокументов.ПодразделениеОрганизации;
		
		ОтветственныеЛица = ОтветственныеЛицаБП.ОтветственныеЛица(ВыборкаДокументов.Организация, ВыборкаДокументов.Дата, ПодразделениеОтветственныхЛиц);
		
		ВыборкаСтрок = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		
		ДанныеФизЛица = УправлениеВнеоборотнымиАктивамиПереопределяемый.ДанныеФизЛица(ВыборкаДокументов.Организация, ВыборкаДокументов.МОЛ, ВыборкаДокументов.Дата, Истина);
		
		ПерваяИтерация = Истина;
		НомерСтроки = 1;
		СсылкаДокумента = Неопределено;
		СписокНаимОС    = "";
		Пока ВыборкаСтрок.Следующий() Цикл
			
			Если ПерваяИтерация Тогда
				
				СсылкаДокумента = ВыборкаСтрок.Ссылка;				
				ПерваяИтерация = Ложь;
				
			КонецЕсли;
			
			СписокНаимОС = СписокНаимОС + ?(СписокНаимОС <> "", ", " + ВыборкаСтрок.НаимОС, ВыборкаСтрок.НаимОС);
			
			СтрокаТаблицы1 = Макет.ПолучитьОбласть("СтрокаТаблицы1");
			СтрокаТаблицы1.Параметры.Заполнить(ВыборкаСтрок);
			СтоимостьОС = ВыборкаСтрок.НачСтоимость;
			АмортизацияОС = ВыборкаСтрок.НачАмортизация;
				
			ПараметрыСтрокТаблицы = Новый Структура;	
			ПараметрыСтрокТаблицы.Вставить("НП", НомерСтроки);
			ПараметрыСтрокТаблицы.Вставить("НачСтоимость", СтоимостьОС);
			ПараметрыСтрокТаблицы.Вставить("НачАмортизация", АмортизацияОС);
			ПараметрыСтрокТаблицы.Вставить("ОстСтоимость", ВыборкаСтрок.БалансоваяСтоимость);
			
			ДокументПринятияКУчету     = "";
			ДокументВводаВЭксплуатацию = "";
			ПринятоКУчету              = "";
			ВведеноВЭксплуатацию       = "";
			
			УчетОСВызовСервера.ПолучитьДокументБухСостоянияОС(
				ВыборкаСтрок.ОС,
				ВыборкаСтрок.Организация,
				Перечисления.СостоянияОС.ПринятоКУчету,
				ДокументВводаВЭксплуатацию,           
				ВведеноВЭксплуатацию);                
				
			ПараметрыСтрокТаблицы.Вставить("ФактическийСрокЭксплуатации", ?(ЗначениеЗаполнено(ВведеноВЭксплуатацию),
				ОбъектыЭксплуатации.КоличествоМесяцевСтрокой(УправлениеВнеоборотнымиАктивами.ОпределитьФактическийСрокИспользования(ВведеноВЭксплуатацию, ВыборкаСтрок.Дата)),
				0));
			СтрокаТаблицы1.Параметры.Заполнить(ПараметрыСтрокТаблицы);
			ТабличныйДокумент.Вывести(СтрокаТаблицы1);
			
		КонецЦикла;
		
		// Вывод информации по драг.металлам по каждому ОС
		ЗаголовокТаблицы2 = Макет.ПолучитьОбласть("ЗаголовокТаблицы2");
		ТабличныйДокумент.Вывести(ЗаголовокТаблицы2);
		
		СтрокаТаблицы2 = Макет.ПолучитьОбласть("СтрокаТаблицы2");
		ВыборкаСтрок = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.Прямой);
		ВыводСтроки = Ложь;
		Если ВыборкаСтрок.Количество() = 0 или Не ИспользоватьУчетДМ Тогда
			ТабличныйДокумент.Вывести(СтрокаТаблицы2);
		ИначеЕсли ИспользоватьУчетДМ Тогда	
			Пока ВыборкаСтрок.Следующий() Цикл
				Если ВыборкаСтрок.ДрагоценныеМатериалы <> Null тогда
					ТаблицаДМ = ВыборкаСтрок.ДрагоценныеМатериалы.Выгрузить();
					Для Каждого СтрокаДМ Из ТаблицаДМ Цикл
						ВыводСтроки = Истина;
						СтрокаТаблицы2.Параметры.Заполнить(СтрокаДМ);
						ТабличныйДокумент.Вывести(СтрокаТаблицы2);
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			Если Не ВыводСтроки Тогда
				ТабличныйДокумент.Вывести(СтрокаТаблицы2);
			КонецЕсли;	
		КонецЕсли;  

		ПодвалТаблицы2 = Макет.ПолучитьОбласть("ПодвалТаблицы2"); 
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ДокументОснованиеВид", НСтр("ru = 'приказом (распоряжением)'"));
		СтруктураПараметров.Вставить("ДокументОснованиеДата", НСтр("ru = '«__» ___20__года'"));
		СтруктураПараметров.Вставить("ДокументОснованиеНомер", "______");	
		ПодвалТаблицы2.Параметры.Заполнить(СтруктураПараметров);
		ТабличныйДокумент.Вывести(ПодвалТаблицы2);       
		
		СписокОсмотренных = Макет.ПолучитьОбласть("СписокОсмотренных");
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("НаимОС", СписокНаимОС);
		СписокОсмотренных.Параметры.Заполнить(СтруктураПараметров);
		ТабличныйДокумент.Вывести(СписокОсмотренных); 
		
		ПричинаСписания = Макет.ПолучитьОбласть("ПричинаСписания");
		ПричинаСписания.Параметры.Заполнить(Новый Структура("ПричинаСписания", ВыборкаДокументов.ПричинаСписания));
		ТабличныйДокумент.Вывести(ПричинаСписания); 
		
		// Вторая страница
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();		
		
		Страница2_ОборотнаяСторона = Макет.ПолучитьОбласть("ОборотнаяСторона");
		ТабличныйДокумент.Вывести(Страница2_ОборотнаяСторона);
		
		Страница2_Комиссия = Макет.ПолучитьОбласть("Комиссия");
		Страница2_Комиссия.Параметры.Заполнить(Новый Структура("ЗаголовокРазделаКомиссии", "Председатель комиссии"));
		ТабличныйДокумент.Вывести(Страница2_Комиссия);
		
		Страница2_Комиссия.Параметры.Заполнить(Новый Структура("ЗаголовокРазделаКомиссии", "Члены комиссии"));
		ТабличныйДокумент.Вывести(Страница2_Комиссия);
		
		Страница2_Комиссия.Параметры.Заполнить(Новый Структура("ЗаголовокРазделаКомиссии", ""));
		Для к = 1 По 2 Цикл // Чтобы было 3 члена комиссии
			ТабличныйДокумент.Вывести(Страница2_Комиссия);
		КонецЦикла;
		
		СтруктураМОЛ = Новый Структура;
		СтруктураМОЛ.Вставить("ЗаголовокРазделаКомиссии", НСтр("ru = 'Материально-ответственное лицо'"));
		СтруктураМОЛ.Вставить("РасшифровкаПодписи", ДанныеФизЛица.Представление);
		СтруктураМОЛ.Вставить("Должность", ДанныеФизЛица.Должность);
		Страница2_Комиссия.Параметры.Заполнить(СтруктураМОЛ);
		ТабличныйДокумент.Вывести(Страница2_Комиссия);
		
		// Вывод данных по запасам
		Страница2_ЗаголовокТаблицы3 = Макет.ПолучитьОбласть("ЗаголовокТаблицы3");
		Страница2_ЗаголовокТаблицы3.Параметры.Заполнить(Новый Структура("Валюта", ВалютаРегламентированногоУчета));
		ТабличныйДокумент.Вывести(Страница2_ЗаголовокТаблицы3);
		
		Страница2_СтрокаТаблицы3 = Макет.ПолучитьОбласть("СтрокаТаблицы3");	
		Если ВыборкаПрочихОприходований <> null Тогда
			ВыборкаПрочихОприходований.Сбросить();
		КонецЕсли;
		ИтогСумма = 0;
		Если ВыборкаПрочихОприходований <> null и ВыборкаПрочихОприходований.НайтиСледующий(Новый Структура("Ссылка", ВыборкаДокументов.Ссылка)) Тогда
			ВыборкаТоваров = ВыборкаПрочихОприходований.Выбрать();
			Пока ВыборкаТоваров.Следующий() Цикл
				Страница2_СтрокаТаблицы3.Параметры.Заполнить(ВыборкаТоваров);
				ИтогСумма = ИтогСумма + ВыборкаТоваров.УзелСумма;
								
				ДанныеДокумента = Новый Структура("Номер,Дата", ВыборкаТоваров.УзелДокументНомер, ВыборкаТоваров.УзелДокументДата);				
				СтруктураПараметров = Новый Структура;	
				СтруктураПараметров.Вставить("ДокументТМЗ", ВыборкаТоваров.УзелДокументНомер + " от " + Формат(ВыборкаТоваров.УзелДокументДата, "ДФ=dd.MM.yyyy") +" г.");
				СтруктураПараметров.Вставить("НаимТМЗ", НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
					ВыборкаТоваров.УзелНоменклатураНаименованиеПолное,
					ВыборкаТоваров.УзелХарактеристикаНаименованиеПолное));
					
				Страница2_СтрокаТаблицы3.Параметры.Заполнить(СтруктураПараметров);	
				ТабличныйДокумент.Вывести(Страница2_СтрокаТаблицы3);
			КонецЦикла;
		Иначе
			Для к = 0 По 6 Цикл // Пустые строки для заполнения вручную
				ТабличныйДокумент.Вывести(Страница2_СтрокаТаблицы3);
			КонецЦикла;
		КонецЕсли;
		
		Страница2_ИтогоТаблицы3 = Макет.ПолучитьОбласть("ИтогоТаблицы3");     		
		Страница2_ИтогоТаблицы3.Параметры.Заполнить(Новый Структура("ИтогоСуммаТМЗ", ИтогСумма));
		ТабличныйДокумент.Вывести(Страница2_ИтогоТаблицы3);
		
		Страница2_Подвал = Макет.ПолучитьОбласть("Подвал");   
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("РасшифровкаПодписи", ОтветственныеЛица.ГлавныйБухгалтерПредставление);
		СтруктураПараметров.Вставить("Валюта", ВалютаРегламентированногоУчета);
		Страница2_Подвал.Параметры.Заполнить(СтруктураПараметров);
		ТабличныйДокумент.Вывести(Страница2_Подвал);
		 		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
