
#Область ПрограммныйИнтерфейс

//++ НЕ УТ

//Процедура-обработчик подписки на событие ОбработкаПроведения для документов, выполняющих движения по регистрам НДС и НДСКВозмещению.
//Предназначена для формирования движений по указанным регистрам.
//
//Параметры:
//		Источник - ДокументОбъект - документ-регистратор для регистров НДС и НДСКВозмещению
//		Отказ - Булево - флаг отказа
//		РежимПроведения - РежимПроведенияДокумента - Режим проведения документа
//
Процедура ПриПроведенииДокумента(Источник, Отказ, РежимПроведения) Экспорт

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	СтруктураРегистров = Новый Структура("НДС, НДСКВозмещению, НДСЗаНерезидента",
		Не Источник.Движения.Найти("НДС") = Неопределено,
		Не Источник.Движения.Найти("НДСКВозмещению") = Неопределено,
		Не Источник.Движения.Найти("НДСЗаНерезидента") = Неопределено);

	ИнициализироватьДанныеДокумента(Источник, Источник.ДополнительныеСвойства, СтруктураРегистров);

	Если СтруктураРегистров.НДС Тогда
		ОтразитьНДС(Источник, Источник.ДополнительныеСвойства, Источник.Движения, Отказ);
	КонецЕсли;

	Если СтруктураРегистров.НДСКВозмещению Тогда
		ОтразитьНДСКВозмещению(Источник, Источник.ДополнительныеСвойства, Источник.Движения, Отказ);
	КонецЕсли;

	Если СтруктураРегистров.НДСЗаНерезидента Тогда
		ОтразитьНДСЗаНерезидента(Источник.ДополнительныеСвойства, Источник.Движения, Отказ);
	КонецЕсли;
	
КонецПроцедуры

// Формирует записи в регистре накопления "НДС" без проведения документа
//
// Параметры:
// 	 ДокументСсылка - ДокументСсылка.РеализацияТоваровУслуг, ДокументСсылка.АктВыполненныхРабот - Документ реализации
//
Процедура СформироватьЗаписиНДС(ДокументСсылка) Экспорт
	
	ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
    Если ДокументОбъект.ДополнительныеСвойства.Количество() = 0 Тогда
        ДокументОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", Ложь);
        ДокументОбъект.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
    КонецЕсли;
    ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(ДокументСсылка, ДокументОбъект.ДополнительныеСвойства);
	
	Движения = Новый Структура;
	
	НДС = РегистрыНакопления.НДС.СоздатьНаборЗаписей();
	НДС.Отбор.Регистратор.Установить(ДокументСсылка);
	Движения.Вставить("НДС", НДС);
	
	Регистры = Новый Структура;
	Регистры.Вставить("НДС", Истина);
	
    ИнициализироватьДанныеДокумента(ДокументСсылка, ДокументОбъект.ДополнительныеСвойства, Регистры);
	ОтразитьНДС(ДокументОбъект, ДокументОбъект.ДополнительныеСвойства, Движения, Ложь);
	
	Для каждого Движение Из Движения Цикл
		Движение.Значение.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьЗаданияКЗакрытиюМесяцаНДС(Регистратор, ДополнительныеСвойства)
	
 	Если НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.Свойство("МенеджерВременныхТаблицНДС") Тогда
		МенеджерВременныхТаблицНДС = Новый МенеджерВременныхТаблиц;
		ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.Вставить("МенеджерВременныхТаблицНДС", МенеджерВременныхТаблицНДС);
	Иначе
		МенеджерВременныхТаблицНДС = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблицНДС;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблицНДС;
	Запрос.УстановитьПараметр("Регистратор", Регистратор.Ссылка);
	ТекстЗапроса = "";
	
	Если МенеджерВременныхТаблицНДС.Таблицы.Найти("НДСПередЗаписью") = Неопределено Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	НДС.Период,
		|	НДС.Регистратор,
		|	НДС.Организация,
		|	НДС.ВидОперацииРеализации,
		|	НДС.СтавкаНДС,
		|	НДС.Контрагент,
		|	НДС.КорректируемыйПериод,
		|	НДС.СчетФактура,
		|	НДС.ДоговорКонтрагента,
		|	НДС.ЗаписьДополнительнойДекларации,
		|	НДС.НалоговыйПериод,
		|
		|	НДС.СуммаБезНДС,
		|	НДС.ОборотПоРеализации,
		|	НДС.СуммаНДС
		|
		|ПОМЕСТИТЬ НДСПередЗаписью
		|ИЗ
		|	РегистрНакопления.НДС КАК НДС
		|ГДЕ
		|	НДС.Регистратор = &Регистратор
		|;";
		
	КонецЕсли;
		
	Если ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаНДС") Тогда
		ТекстЗапроса  = ТекстЗапроса + "ВЫБРАТЬ
		|	ДанныеНДС.Период КАК Период,
		|	ДанныеНДС.Регистратор КАК Регистратор,
		|	ДанныеНДС.Организация КАК Организация,
		|	ДанныеНДС.ВидОперацииРеализации КАК ВидОперацииРеализации,
		|	ДанныеНДС.СтавкаНДС КАК СтавкаНДС,
		|	ДанныеНДС.Контрагент КАК Контрагент,
		|	ЕСТЬNULL(ДанныеНДС.КорректируемыйПериод, ДатаВремя(1,1,1)) КАК КорректируемыйПериод,
		|	ДанныеНДС.СчетФактура КАК СчетФактура,
		|	ВЫБОР
		|		КОГДА ДанныеНДС.ДоговорКонтрагента = НЕОПРЕДЕЛЕНО
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|		ИНАЧЕ ДанныеНДС.ДоговорКонтрагента
		|	КОНЕЦ КАК ДоговорКонтрагента,
		|	ДанныеНДС.НалоговыйПериод,
		|	ДанныеНДС.СуммаБезНДС КАК СуммаБезНДС,
		|	ДанныеНДС.ОборотПоРеализации КАК ОборотПоРеализации,
		|	ДанныеНДС.СуммаНДС КАК СуммаНДС
		|ПОМЕСТИТЬ НДСдвижения
		|ИЗ
		|	&ТаблицаНДС КАК ДанныеНДС
		|;";
		
		ТаблицаНДС = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНДС;
		Запрос.УстановитьПараметр("ТаблицаНДС", ТаблицаНДС);
		Если ТаблицаНДС.Колонки.Найти("ДоговорКонтрагента") = Неопределено Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеНДС.ДоговорКонтрагента", "ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)");
		КонецЕсли;
	Иначе
		ТекстЗапроса  = ТекстЗапроса + "ВЫБРАТЬ
		|	ДанныеНДС.Период КАК Период,
		|	ДанныеНДС.Регистратор КАК Регистратор,
		|	ДанныеНДС.Организация КАК Организация,
		|	ДанныеНДС.ВидОперацииРеализации КАК ВидОперацииРеализации,
		|	ДанныеНДС.СтавкаНДС КАК СтавкаНДС,
		|	ДанныеНДС.Контрагент КАК Контрагент,
		|	ЕСТЬNULL(ДанныеНДС.КорректируемыйПериод, ДатаВремя(1,1,1)) КАК КорректируемыйПериод,
		|	ДанныеНДС.СчетФактура КАК СчетФактура,
		|	ДанныеНДС.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ДанныеНДС.НалоговыйПериод КАК НалоговыйПериод,
		|	ДанныеНДС.СуммаБезНДС КАК СуммаБезНДС,
		|	ДанныеНДС.ОборотПоРеализации КАК ОборотПоРеализации,
		|	ДанныеНДС.СуммаНДС КАК СуммаНДС
		|ПОМЕСТИТЬ НДСдвижения
		|ИЗ
		|	РегистрНакопления.НДС КАК ДанныеНДС
		|ГДЕ
		|	ДанныеНДС.Регистратор = &Регистратор
		|;";
	КонецЕсли;
	
	ТекстЗапроса  = ТекстЗапроса + "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Таблица.Период, КВАРТАЛ), МЕСЯЦ) КАК Месяц,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииЗакрытияМесяца.РаспределениеНДС) КАК Операция,
	|	Таблица.Организация КАК Организация,
	|	Таблица.Регистратор КАК Документ
	|ПОМЕСТИТЬ НДСЗаданияКЗакрытиюМесяца
	|ИЗ
	|	(ВЫБРАТЬ
	|		НДС.Период КАК Период,
	|		НДС.Регистратор КАК Регистратор,
	|		НДС.Организация КАК Организация,
	|		НДС.ВидОперацииРеализации КАК ВидОперацииРеализации,
	|		НДС.СтавкаНДС КАК СтавкаНДС,
	|		НДС.Контрагент КАК Контрагент,
	|		ЕСТЬNULL(НДС.КорректируемыйПериод, ДАТАВРЕМЯ(1, 1, 1)) КАК КорректируемыйПериод,
	|		НДС.СчетФактура КАК СчетФактура,
	|		ВЫБОР
	|			КОГДА НДС.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ НДС.ДоговорКонтрагента
	|		КОНЕЦ КАК ДоговорКонтрагента,
	|		НДС.НалоговыйПериод КАК НалоговыйПериод,
	|		НДС.СуммаБезНДС КАК СуммаБезНДС,
	|		НДС.ОборотПоРеализации КАК ОборотПоРеализации,
	|		НДС.СуммаНДС КАК СуммаНДС
	|	ИЗ
	|		НДСПередЗаписью КАК НДС
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСдвижения.Период,
	|		НДСдвижения.Регистратор,
	|		НДСдвижения.Организация,
	|		НДСдвижения.ВидОперацииРеализации,
	|		НДСдвижения.СтавкаНДС,
	|		НДСдвижения.Контрагент,
	|		ЕСТЬNULL(НДСдвижения.КорректируемыйПериод, ДАТАВРЕМЯ(1, 1, 1)),
	|		НДСдвижения.СчетФактура,
	|		ВЫБОР
	|			КОГДА НДСдвижения.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ НДСдвижения.ДоговорКонтрагента
	|		КОНЕЦ,
	|		НДСдвижения.НалоговыйПериод,
	|		-НДСдвижения.СуммаБезНДС,
	|		-НДСдвижения.ОборотПоРеализации,
	|		-НДСдвижения.СуммаНДС
	|	ИЗ
	|		НДСдвижения КАК НДСдвижения) КАК Таблица
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Таблица.Период, КВАРТАЛ), МЕСЯЦ),
	|	Таблица.Период,
	|	Таблица.Регистратор,
	|	Таблица.Организация,
	|	Таблица.ВидОперацииРеализации,
	|	Таблица.СтавкаНДС,
	|	Таблица.Контрагент,
	|	Таблица.КорректируемыйПериод,
	|	Таблица.СчетФактура,
	|	Таблица.ДоговорКонтрагента,
	|	Таблица.НалоговыйПериод
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Таблица.СуммаБезНДС) <> 0
	|		ИЛИ СУММА(Таблица.ОборотПоРеализации) <> 0
	|		ИЛИ СУММА(Таблица.СуммаНДС) <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НДСПередЗаписью";

	Попытка
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		
		СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
		МенеджерВременныхТаблицДоЗаданийНДС = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		СтруктураВременныеТаблицы.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
		ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(Регистратор);
		
		СтруктураВременныеТаблицы.МенеджерВременныхТаблиц = МенеджерВременныхТаблицДоЗаданийНДС;
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Формирование задания к распределению НДС.'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗарегистрироватьЗаданияКЗакрытиюМесяцаНДСКВозмещению(Регистратор, ДополнительныеСвойства)
	
 	Если НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.Свойство("МенеджерВременныхТаблицНДС") Тогда
		МенеджерВременныхТаблицНДС = Новый МенеджерВременныхТаблиц;
		ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.Вставить("МенеджерВременныхТаблицНДС", МенеджерВременныхТаблицНДС);
	Иначе
		МенеджерВременныхТаблицНДС = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблицНДС;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблицНДС;
	Запрос.УстановитьПараметр("Регистратор", Регистратор.Ссылка);
	ТекстЗапроса = "";
	
	Если МенеджерВременныхТаблицНДС.Таблицы.Найти("НДСКВозмещениюПередЗаписью") = Неопределено Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	НДСКВозмещению.Период,
		|	НДСКВозмещению.Регистратор,
		|	НДСКВозмещению.Организация,
		|	НДСКВозмещению.ВидОперацииПоступления,
		|	НДСКВозмещению.СтавкаНДС,
		|	НДСКВозмещению.Контрагент,
		|	НДСКВозмещению.ВидОборота,
		|	НДСКВозмещению.КорректируемыйПериод,
		|	НДСКВозмещению.СчетФактура,
		|	ВЫБОР
		|		КОГДА НДСКВозмещению.ДоговорКонтрагента = Неопределено 
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|		ИНАЧЕ НДСКВозмещению.ДоговорКонтрагента 
		|	КОНЕЦ КАК ДоговорКонтрагента,
		|	НДСКВозмещению.ЗаписьДополнительнойДекларации,
		|	НДСКВозмещению.НалоговыйПериод,
		|
		|	НДСКВозмещению.СуммаБезНДС,
		|	НДСКВозмещению.УплаченныйНДС,
		|	НДСКВозмещению.СуммаНДС,
		|
		|	НДСКВозмещению.ЗакупкаПодДеятельность
		|
		|ПОМЕСТИТЬ НДСКВозмещениюПередЗаписью
		|ИЗ
		|	РегистрНакопления.НДСКВозмещению КАК НДСКВозмещению
		|ГДЕ
		|	НДСКВозмещению.Регистратор = &Регистратор
		|;";
		
	КонецЕсли;
		
	Если ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("НДСКВозмещению") 
		ИЛИ ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаНДСКВозмещению") Тогда
		ТекстЗапроса  = ТекстЗапроса + "ВЫБРАТЬ
		|	ДанныеНДС.Период КАК Период,
		|	ДанныеНДС.Регистратор КАК Регистратор,
		|	ДанныеНДС.Организация КАК Организация,
		|	ДанныеНДС.ВидОперацииПоступления КАК ВидОперацииПоступления,
		|	ДанныеНДС.СтавкаНДС КАК СтавкаНДС,
		|	ДанныеНДС.Контрагент КАК Контрагент,
		|	ДанныеНДС.ВидОборота КАК ВидОборота,
		|	ЕСТЬNULL(ДанныеНДС.КорректируемыйПериод, ДатаВремя(1,1,1)) КАК КорректируемыйПериод,
		|	ДанныеНДС.СчетФактура КАК СчетФактура,
		|	ВЫБОР 
		|		КОГДА ДанныеНДС.ДоговорКонтрагента = НЕОПРЕДЕЛЕНО
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|		ИНАЧЕ ДанныеНДС.ДоговорКонтрагента
		|	КОНЕЦ КАК ДоговорКонтрагента,
		|	ДанныеНДС.НалоговыйПериод КАК НалоговыйПериод,
		|	ДанныеНДС.СуммаБезНДС КАК СуммаБезНДС,
		|	ДанныеНДС.УплаченныйНДС КАК УплаченныйНДС,
		|	ДанныеНДС.СуммаНДС КАК СуммаНДС,
		|	ДанныеНДС.ЗакупкаПодДеятельность КАК ЗакупкаПодДеятельность
		|ПОМЕСТИТЬ НДСКВозмещениюДвижения
		|ИЗ
		|	&НДСКВозмещению КАК ДанныеНДС
		|;";
		Если ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("НДСКВозмещению") Тогда
			ТаблицаНДС = ДополнительныеСвойства.ТаблицыДляДвижений.НДСКВозмещению;
		Иначе
			ТаблицаНДС = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНДСКВозмещению;
		КонецЕсли;
		Запрос.УстановитьПараметр("НДСКВозмещению", ТаблицаНДС);
		
		Если ТаблицаНДС.Колонки.Найти("ДоговорКонтрагента") = Неопределено Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеНДС.ДоговорКонтрагента", "ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)");
		КонецЕсли;
		Если ТаблицаНДС.Колонки.Найти("ЗакупкаПодДеятельность") = Неопределено Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеНДС.ЗакупкаПодДеятельность", "ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)");
		КонецЕсли;
	Иначе
		ТекстЗапроса  = ТекстЗапроса + "ВЫБРАТЬ
		|	ДанныеНДС.Период КАК Период,
		|	ДанныеНДС.Регистратор КАК Регистратор,
		|	ДанныеНДС.Организация КАК Организация,
		|	ДанныеНДС.ВидОперацииПоступления КАК ВидОперацииПоступления,
		|	ДанныеНДС.СтавкаНДС КАК СтавкаНДС,
		|	ДанныеНДС.Контрагент КАК Контрагент,
		|	ДанныеНДС.ВидОборота КАК ВидОборота,
		|	ЕСТЬNULL(ДанныеНДС.КорректируемыйПериод, ДатаВремя(1,1,1)) КАК КорректируемыйПериод,
		|	ДанныеНДС.СчетФактура КАК СчетФактура,
		|	ДанныеНДС.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ДанныеНДС.НалоговыйПериод КАК НалоговыйПериод,
		|	ДанныеНДС.СуммаБезНДС КАК СуммаБезНДС,
		|	ДанныеНДС.УплаченныйНДС КАК УплаченныйНДС,
		|	ДанныеНДС.СуммаНДС КАК СуммаНДС,
		|	ДанныеНДС.ЗакупкаПодДеятельность КАК ЗакупкаПодДеятельность
		|ПОМЕСТИТЬ НДСКВозмещениюДвижения
		|ИЗ
		|	РегистрНакопления.НДСКВозмещению КАК ДанныеНДС
		|ГДЕ
		|	ДанныеНДС.Регистратор = &Регистратор
		|;";
	КонецЕсли;
	
	ТекстЗапроса  = ТекстЗапроса + "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Таблица.Период, КВАРТАЛ), МЕСЯЦ) КАК Месяц,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииЗакрытияМесяца.РаспределениеНДС) КАК Операция,
	|	Таблица.Организация КАК Организация,
	|	Таблица.Регистратор КАК Документ
	|ПОМЕСТИТЬ НДСЗаданияКЗакрытиюМесяца
	|ИЗ
	|	(ВЫБРАТЬ
	|		НДС.Период КАК Период,
	|		НДС.Регистратор КАК Регистратор,
	|		НДС.Организация КАК Организация,
	|		НДС.ВидОперацииПоступления КАК ВидОперацииПоступления,
	|		НДС.СтавкаНДС КАК СтавкаНДС,
	|		НДС.Контрагент КАК Контрагент,
	|		НДС.ВидОборота КАК ВидОборота,
	|		ЕСТЬNULL(НДС.КорректируемыйПериод, ДАТАВРЕМЯ(1, 1, 1)) КАК КорректируемыйПериод,
	|		НДС.СчетФактура КАК СчетФактура,
	|		ВЫБОР
	|			КОГДА НДС.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ НДС.ДоговорКонтрагента
	|		КОНЕЦ КАК ДоговорКонтрагента,
	|		НДС.НалоговыйПериод КАК НалоговыйПериод,
	|		НДС.СуммаБезНДС КАК СуммаБезНДС,
	|		НДС.УплаченныйНДС КАК УплаченныйНДС,
	|		НДС.СуммаНДС КАК СуммаНДС,
	|		НДС.ЗакупкаПодДеятельность КАК ЗакупкаПодДеятельность
	|	ИЗ
	|		НДСКВозмещениюПередЗаписью КАК НДС
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСКВозмещениюДвижения.Период,
	|		НДСКВозмещениюДвижения.Регистратор,
	|		НДСКВозмещениюДвижения.Организация,
	|		НДСКВозмещениюДвижения.ВидОперацииПоступления,
	|		НДСКВозмещениюДвижения.СтавкаНДС,
	|		НДСКВозмещениюДвижения.Контрагент,
	|		НДСКВозмещениюДвижения.ВидОборота,
	|		ЕСТЬNULL(НДСКВозмещениюДвижения.КорректируемыйПериод, ДАТАВРЕМЯ(1, 1, 1)),
	|		НДСКВозмещениюДвижения.СчетФактура,
	|		ВЫБОР
	|			КОГДА НДСКВозмещениюДвижения.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ НДСКВозмещениюДвижения.ДоговорКонтрагента
	|		КОНЕЦ,
	|		НДСКВозмещениюДвижения.НалоговыйПериод КАК НалоговыйПериод,
	|		-НДСКВозмещениюДвижения.СуммаБезНДС,
	|		-НДСКВозмещениюДвижения.УплаченныйНДС,
	|		-НДСКВозмещениюДвижения.СуммаНДС,
	|		НДСКВозмещениюДвижения.ЗакупкаПодДеятельность
	|	ИЗ
	|		НДСКВозмещениюДвижения КАК НДСКВозмещениюДвижения) КАК Таблица
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(Таблица.Период, КВАРТАЛ), МЕСЯЦ),
	|	Таблица.Период,
	|	Таблица.Регистратор,
	|	Таблица.Организация,
	|	Таблица.ВидОперацииПоступления,
	|	Таблица.СтавкаНДС,
	|	Таблица.Контрагент,
	|	Таблица.ВидОборота,
	|	Таблица.КорректируемыйПериод,
	|	Таблица.СчетФактура,
	|	Таблица.ДоговорКонтрагента,
	|	Таблица.НалоговыйПериод,
	|	Таблица.ЗакупкаПодДеятельность
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Таблица.СуммаБезНДС) <> 0
	|		ИЛИ СУММА(Таблица.УплаченныйНДС) <> 0
	|		ИЛИ СУММА(Таблица.СуммаНДС) <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НДСКВозмещениюПередЗаписью";
		
	Попытка
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		
		СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
		МенеджерВременныхТаблицДоЗаданийНДС = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		СтруктураВременныеТаблицы.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
		ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(Регистратор);
		
		СтруктураВременныеТаблицы.МенеджерВременныхТаблиц = МенеджерВременныхТаблицДоЗаданийНДС;
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Формирование задания к распределению НДС.'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура ПередЗаписьюЗаданияКЗакрытиюМесяцаПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = ОбменДаннымиСервер.ЭтоПодчиненныйУзелРИБ();
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Источник);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТНаборЗаписей.Организация
	|ПОМЕСТИТЬ ВТОрганизации
	|ИЗ
	|	&НаборЗаписей КАК ВТНаборЗаписей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Организации.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТОрганизации.Организация
	|			ИЗ
	|				ВТОрганизации КАК ВТОрганизации)
	|	И Организации.ОбособленноеПодразделение = ИСТИНА";
	
	Запрос.УстановитьПараметр("НаборЗаписей", Источник.Выгрузить());
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивОбособленныхПодразделений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Для НомерЗаписи = -Источник.Количество() + 1 По 0 Цикл
		
		Запись = Источник[-НомерЗаписи];
		
		Если (Запись.Операция = Перечисления.ОперацииЗакрытияМесяца.ПризнаниеРасходовПриУСН ИЛИ Запись.Операция = Перечисления.ОперацииЗакрытияМесяца.РасчетНалогаУСН) 
			ИЛИ (Запись.Операция = Перечисления.ОперацииЗакрытияМесяца.РаспределениеНДС И МассивОбособленныхПодразделений.Найти(Запись.Организация) <> Неопределено) Тогда
			Источник.Удалить(-НомерЗаписи);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
//-- НЕ УТ

Процедура ДобавитьНастройку(НастройкиОтраженияНДС, ВидНДС, Налогообложение, СчетУчета) Экспорт
	
	ШаблонНастройки = "
	|	ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) КАК АналитикаУчета,
	|		ЗНАЧЕНИЕ(Перечисление.ВидыНДС.Товары)                	   КАК МестоУчета,
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНачисленныйПриПокупке)    КАК СчетУчета
	|
	|";
	ШаблонНастройки = СтрЗаменить(ШаблонНастройки, "ПустаяСсылка",          Налогообложение);
	ШаблонНастройки = СтрЗаменить(ШаблонНастройки, "Товары",                ВидНДС);
	ШаблонНастройки = СтрЗаменить(ШаблонНастройки, "НДСНачисленныйПриПокупке", СчетУчета);
	
	НастройкиОтраженияНДС.Добавить(ШаблонНастройки);
	
КонецПроцедуры

#КонецОбласти

//++ НЕ УТ
#Область РегистрНДС

#Область ЗаполнениеТекстаЗапросаТаблицаНДС

Функция ТекстЗапросаТаблицаНДС_АктВыполненныхРабот()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаУслуги.Ссылка.СпособВыпискиАктовВыполненныхРабот = ЗНАЧЕНИЕ(Перечисление.СпособыВыпискиАктовВыполненныхРабот.ВБумажномВиде) И НЕ ТаблицаУслуги.Ссылка.ДатаПодписанияГЗ = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА ТаблицаУслуги.Ссылка.ДатаПодписанияГЗ
	|		ИНАЧЕ &Дата
	|	КОНЕЦ КАК Период,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаУслуги.Ссылка.СпособВыпискиАктовВыполненныхРабот = ЗНАЧЕНИЕ(Перечисление.СпособыВыпискиАктовВыполненныхРабот.ВБумажномВиде) И НЕ ТаблицаУслуги.Ссылка.ДатаПодписанияГЗ = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА ТаблицаУслуги.Ссылка.ДатаПодписанияГЗ
	|		 ИНАЧЕ &Дата
	|	КОНЕЦ КАК НалоговыйПериод,
	|	ЛОЖЬ КАК ЗаписьДополнительнойДекларации,
	|	NULL КАК КорректируемыйПериод,
	|	&Ссылка КАК Регистратор,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	&Ссылка КАК СчетФактура,
	|	ТаблицаУслуги.ВидОперацииРеализации КАК ВидОперацииРеализации,
	|	ТаблицаУслуги.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаУслуги.СуммаСНДС - ТаблицаУслуги.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаБезНДС,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаУслуги.СуммаСНДС - ТаблицаУслуги.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК ОборотПоРеализации,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаУслуги.СуммаСНДС - ТаблицаУслуги.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))*ЕСТЬNULL(СтавкиНДС.Ставка,0)/100) КАК СуммаНДС
	|ИЗ
	|	Документ.АктВыполненныхРабот.Услуги КАК ТаблицаУслуги
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
	|		ПО ТаблицаУслуги.СтавкаНДС = СтавкиНДС.Ссылка
	|ГДЕ
	|	ТаблицаУслуги.Ссылка = &Ссылка
	|	И &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	И &НалогообложениеНДС В(ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|							ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС))
	|	И ((НЕ ТаблицаУслуги.Ссылка.СпособВыпискиАктовВыполненныхРабот = ЗНАЧЕНИЕ(Перечисление.СпособыВыпискиАктовВыполненныхРабот.ВБумажномВиде) 
	|				И НЕ ТаблицаУслуги.Ссылка.ДатаПодписанияГЗ = ДАТАВРЕМЯ(1,1,1)) 
	|				ИЛИ ТаблицаУслуги.Ссылка.СпособВыпискиАктовВыполненныхРабот = ЗНАЧЕНИЕ(Перечисление.СпособыВыпискиАктовВыполненныхРабот.ВБумажномВиде))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаУслуги.Ссылка.СпособВыпискиАктовВыполненныхРабот = ЗНАЧЕНИЕ(Перечисление.СпособыВыпискиАктовВыполненныхРабот.ВБумажномВиде) И НЕ ТаблицаУслуги.Ссылка.ДатаПодписанияГЗ = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА ТаблицаУслуги.Ссылка.ДатаПодписанияГЗ
	|		ИНАЧЕ &Дата
	|	КОНЕЦ,
	|	ТаблицаУслуги.ВидОперацииРеализации,
	|	ТаблицаУслуги.СтавкаНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	//|	НДССостояниеРеализации0.ДатаПодтверждения КАК Период,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаУслуги.Ссылка.СпособВыпискиАктовВыполненныхРабот = ЗНАЧЕНИЕ(Перечисление.СпособыВыпискиАктовВыполненныхРабот.ВБумажномВиде) И НЕ ТаблицаУслуги.Ссылка.ДатаПодписанияГЗ = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА ТаблицаУслуги.Ссылка.ДатаПодписанияГЗ
	|		ИНАЧЕ &Дата
	|	КОНЕЦ КАК Период,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаУслуги.Ссылка.СпособВыпискиАктовВыполненныхРабот = ЗНАЧЕНИЕ(Перечисление.СпособыВыпискиАктовВыполненныхРабот.ВБумажномВиде) И НЕ ТаблицаУслуги.Ссылка.ДатаПодписанияГЗ = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА ТаблицаУслуги.Ссылка.ДатаПодписанияГЗ
	|		ИНАЧЕ &Дата
	|	КОНЕЦ КАК НалоговыйПериод,
	//|	ВЫБОР
	//|		КОГДА НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаРеализации,КВАРТАЛ) < НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаПодтверждения,КВАРТАЛ)
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК ЗаписьДополнительнойДекларации,
	|	ЛОЖЬ КАК ЗаписьДополнительнойДекларации,
	//|	ВЫБОР
	//|		КОГДА НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаРеализации,КВАРТАЛ) < НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаПодтверждения,КВАРТАЛ)
	//|			ТОГДА НДССостояниеРеализации0.ДатаРеализации
	//|		ИНАЧЕ NULL
	//|	КОНЕЦ КАК КорректируемыйПериод,
	|	NULL КАК КорректируемыйПериод,
	|	&Ссылка КАК Регистратор,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	&Ссылка КАК СчетФактура,
	|	ТаблицаУслуги.ВидОперацииРеализации КАК ВидОперацииРеализации,
	|	ЗНАЧЕНИЕ(Справочник.СтавкиНДС.НДС0) КАК СтавкаНДС,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаУслуги.СуммаСНДС * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаБезНДС,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаУслуги.СуммаСНДС * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК ОборотПоРеализации,
	|	0 КАК СуммаНДС
	|ИЗ
	|	Документ.АктВыполненныхРабот.Услуги КАК ТаблицаУслуги
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|	ПО 
	|		ТаблицаУслуги.Ссылка = НДССостояниеРеализации0.ДокументРеализации
	|
	|ГДЕ
	|	ТаблицаУслуги.Ссылка = &Ссылка
	|	И &НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
	|	И &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	//|	И НДССостояниеРеализации0.Состояние = ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ПодтвержденаРеализация0)
	|	И НДССостояниеРеализации0.Состояние В (ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение), ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ПодтвержденаРеализация0))
	|	И ((НЕ ТаблицаУслуги.Ссылка.СпособВыпискиАктовВыполненныхРабот = ЗНАЧЕНИЕ(Перечисление.СпособыВыпискиАктовВыполненныхРабот.ВБумажномВиде) 
	|				И НЕ ТаблицаУслуги.Ссылка.ДатаПодписанияГЗ = ДАТАВРЕМЯ(1,1,1)) 
	|				ИЛИ ТаблицаУслуги.Ссылка.СпособВыпискиАктовВыполненныхРабот = ЗНАЧЕНИЕ(Перечисление.СпособыВыпискиАктовВыполненныхРабот.ВБумажномВиде))
	|
	|СГРУППИРОВАТЬ ПО
	//|	НДССостояниеРеализации0.ДатаПодтверждения,
	//|	ВЫБОР
	//|		КОГДА НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаРеализации,КВАРТАЛ) < НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаПодтверждения,КВАРТАЛ)
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаРеализации,КВАРТАЛ) < НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаПодтверждения,КВАРТАЛ)
	//|			ТОГДА НДССостояниеРеализации0.ДатаРеализации
	//|		ИНАЧЕ NULL
	//|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаУслуги.Ссылка.СпособВыпискиАктовВыполненныхРабот = ЗНАЧЕНИЕ(Перечисление.СпособыВыпискиАктовВыполненныхРабот.ВБумажномВиде) И НЕ ТаблицаУслуги.Ссылка.ДатаПодписанияГЗ = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА ТаблицаУслуги.Ссылка.ДатаПодписанияГЗ
	|		ИНАЧЕ &Дата
	|	КОНЕЦ,
	|	ТаблицаУслуги.ВидОперацииРеализации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДССостояниеРеализации0.ДатаПодтверждения КАК Период,
	|	НДССостояниеРеализации0.ДатаПодтверждения КАК НалоговыйПериод,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаРеализации,КВАРТАЛ) < НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаПодтверждения,КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗаписьДополнительнойДекларации,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаРеализации,КВАРТАЛ) < НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаПодтверждения,КВАРТАЛ)
	|			ТОГДА НДССостояниеРеализации0.ДатаРеализации
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК КорректируемыйПериод,
	|	&Ссылка КАК Регистратор,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	&Ссылка КАК СчетФактура,
	|	ТаблицаУслуги.ВидОперацииРеализации КАК ВидОперацииРеализации,
	|	НДССостояниеРеализации0.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаУслуги.СуммаСНДС * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаБезНДС,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаУслуги.СуммаСНДС * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК ОборотПоРеализации,
	|	СУММА(ВЫРАЗИТЬ(
	|		ТаблицаУслуги.СуммаСНДС * &КоэффициентПересчетаВВалютуРегл
	|		* (ВЫБОР НДССостояниеРеализации0.СтавкаНДС
	|				КОГДА ЗНАЧЕНИЕ(Справочник.СтавкиНДС.НДС0)
	|					ТОГДА 0
	|				КОГДА ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС)
	|					ТОГДА 0
	|				КОГДА ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДСНеРК)
	|					ТОГДА 0
	|				ИНАЧЕ НДССостояниеРеализации0.СтавкаНДС.Ставка / 100
	|			КОНЕЦ)
	|		КАК ЧИСЛО(15, 2))) КАК СуммаНДС
	|ИЗ
	|	Документ.АктВыполненныхРабот.Услуги КАК ТаблицаУслуги
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|	ПО 
	|		ТаблицаУслуги.Ссылка = НДССостояниеРеализации0.ДокументРеализации
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.СчетФактураНаНеподтвержденнуюРеализацию0 КАК СчетФактураНаНеподтвержденнуюРеализацию0
	|	ПО
	|		ТаблицаУслуги.Ссылка = СчетФактураНаНеподтвержденнуюРеализацию0.ДокументОснование
	|		И СчетФактураНаНеподтвержденнуюРеализацию0.Проведен
	|ГДЕ
	|	ТаблицаУслуги.Ссылка = &Ссылка
	|	И &НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
	|	И &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	И НДССостояниеРеализации0.Состояние = ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.НеподтвержденаРеализация0)
	|	И СчетФактураНаНеподтвержденнуюРеализацию0.Ссылка ЕСТЬ NULL
	|	И ((НЕ ТаблицаУслуги.Ссылка.СпособВыпискиАктовВыполненныхРабот = ЗНАЧЕНИЕ(Перечисление.СпособыВыпискиАктовВыполненныхРабот.ВБумажномВиде) 
	|				И НЕ ТаблицаУслуги.Ссылка.ДатаПодписанияГЗ = ДАТАВРЕМЯ(1,1,1)) 
	|				ИЛИ ТаблицаУслуги.Ссылка.СпособВыпискиАктовВыполненныхРабот = ЗНАЧЕНИЕ(Перечисление.СпособыВыпискиАктовВыполненныхРабот.ВБумажномВиде))
	|
	|СГРУППИРОВАТЬ ПО
	|	НДССостояниеРеализации0.ДатаПодтверждения,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаРеализации,КВАРТАЛ) < НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаПодтверждения,КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаРеализации,КВАРТАЛ) < НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаПодтверждения,КВАРТАЛ)
	|			ТОГДА НДССостояниеРеализации0.ДатаРеализации
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ТаблицаУслуги.ВидОперацииРеализации,
	|	НДССостояниеРеализации0.СтавкаНДС";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаНДС_ОтчетДавальцу()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Продукция.Ссылка.СпособВыпискиАктовВыполненныхРабот = ЗНАЧЕНИЕ(Перечисление.СпособыВыпискиАктовВыполненныхРабот.ВБумажномВиде) И НЕ Продукция.Ссылка.ДатаПодписанияГЗ = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА Продукция.Ссылка.ДатаПодписанияГЗ
	|		ИНАЧЕ &Дата
	|	КОНЕЦ КАК Период,
	|	ВЫБОР
	|		КОГДА НЕ Продукция.Ссылка.СпособВыпискиАктовВыполненныхРабот = ЗНАЧЕНИЕ(Перечисление.СпособыВыпискиАктовВыполненныхРабот.ВБумажномВиде) И НЕ Продукция.Ссылка.ДатаПодписанияГЗ = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА Продукция.Ссылка.ДатаПодписанияГЗ
	|		ИНАЧЕ &Дата
	|	КОНЕЦ КАК НалоговыйПериод,
	|	NULL КАК КорректируемыйПериод,
	|	Продукция.Ссылка КАК Регистратор,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	&Ссылка КАК СчетФактура,
	|	&ВидОперацииРеализации КАК ВидОперацииРеализации,
	|	&СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВЫРАЗИТЬ((Продукция.СуммаСНДС - Продукция.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаБезНДС,
	|	СУММА(ВЫРАЗИТЬ((Продукция.СуммаСНДС - Продукция.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК ОборотПоРеализации,
	|	СУММА(ВЫРАЗИТЬ((Продукция.СуммаСНДС - Продукция.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2)) * ЕСТЬNULL(СтавкиНДС.Ставка,0)/100) КАК СуммаНДС
	|ИЗ
	|	Документ.ОтчетДавальцу.Продукция КАК Продукция
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
	|		ПО СтавкиНДС.Ссылка = &СтавкаНДС
	|	
	|ГДЕ
	|	Продукция.Ссылка = &Ссылка
	|	И &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	И &НалогообложениеНДС В(ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|							ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС))
	|	И ((НЕ Продукция.Ссылка.СпособВыпискиАктовВыполненныхРабот = ЗНАЧЕНИЕ(Перечисление.СпособыВыпискиАктовВыполненныхРабот.ВБумажномВиде) 
	|				И НЕ Продукция.Ссылка.ДатаПодписанияГЗ = ДАТАВРЕМЯ(1,1,1)) 
	|				ИЛИ Продукция.Ссылка.СпособВыпискиАктовВыполненныхРабот = ЗНАЧЕНИЕ(Перечисление.СпособыВыпискиАктовВыполненныхРабот.ВБумажномВиде))
	|СГРУППИРОВАТЬ ПО
	|	Продукция.Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаНДС_ОтчетКомитенту()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&Дата КАК Период,
	|	&Дата КАК НалоговыйПериод,
	|	NULL КАК КорректируемыйПериод,
	|	&Ссылка КАК Регистратор,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	&Ссылка КАК СчетФактура,
	|	ЗНАЧЕНИЕ(Справочник.ВидыРеализации.УслугиПоКомиссионнойТорговле) КАК ВидОперацииРеализации,
	|	ОтчетКомитенту.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	СУММА(ВЫРАЗИТЬ((ОтчетКомитенту.СуммаВознаграждения - ОтчетКомитенту.СуммаНДСВознаграждения) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаБезНДС,
	|	СУММА(ВЫРАЗИТЬ((ОтчетКомитенту.СуммаВознаграждения - ОтчетКомитенту.СуммаНДСВознаграждения) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК ОборотПоРеализации,
	|	СУММА(ВЫРАЗИТЬ((ОтчетКомитенту.СуммаВознаграждения - ОтчетКомитенту.СуммаНДСВознаграждения) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2)) * ЕСТЬNULL(СтавкиНДС.Ставка,0)/100) КАК СуммаНДС
	|ИЗ
	|	Документ.ОтчетКомитенту КАК ОтчетКомитенту
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&Дата, Организация = &Организация) КАК УчетнаяПолитикаОрганизацийСрезПоследних
	|		ПО (НЕ УчетнаяПолитикаОрганизацийСрезПоследних.УчетнаяПолитика.ПрименяетсяОсвобождениеОтУплатыНДС)
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
	|		ПО ОтчетКомитенту.СтавкаНДСВознаграждения = СтавкиНДС.Ссылка
	|ГДЕ
	|	ОтчетКомитенту.Ссылка = &Ссылка
	|	И &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	И НЕ ОтчетКомитенту.СпособРасчетаВознаграждения = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетКомитенту.СтавкаНДСВознаграждения";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаНДС_ОтчетОРозничныхПродажах()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Дата КАК Период,
	|	&Дата КАК НалоговыйПериод,
	|	NULL КАК КорректируемыйПериод,
	|	&Ссылка КАК Регистратор,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.РозничныйПокупатель) КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	&Ссылка КАК СчетФактура,
	|	ТаблицаТовары.ВидОперацииРеализации КАК ВидОперацииРеализации,
	|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаБезНДС,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК ОборотПоРеализации,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаТовары.СуммаНДС * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаНДС
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	И &НалогообложениеНДС В(ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|							ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС))
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.ВидОперацииРеализации,
	|	ТаблицаТовары.СтавкаНДС";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаНДС_ОтчетПоКомиссииМеждуОрганизациями()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&Дата КАК Период,
	|	&Дата КАК НалоговыйПериод,
	|	NULL КАК КорректируемыйПериод,
	|	&Ссылка КАК Регистратор,
	|	&Комиссионер КАК Организация,
	|	ВЫБОР
	|		КОГДА &РасчетыЧерезОтдельногоКонтрагента = ИСТИНА
	|			ТОГДА &Контрагент
	|		ИНАЧЕ &Организация
	|	КОНЕЦ КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	&Ссылка КАК СчетФактура,
	|	ЗНАЧЕНИЕ(Справочник.ВидыРеализации.УслугиПоКомиссионнойТорговле) КАК ВидОперацииРеализации,
	|	ОтчетПоКомиссииМеждуОрганизациями.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	СУММА(ВЫРАЗИТЬ((ОтчетПоКомиссииМеждуОрганизациями.СуммаВознаграждения - ОтчетПоКомиссииМеждуОрганизациями.СуммаНДСВознаграждения) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаБезНДС,
	|	СУММА(ВЫРАЗИТЬ((ОтчетПоКомиссииМеждуОрганизациями.СуммаВознаграждения - ОтчетПоКомиссииМеждуОрганизациями.СуммаНДСВознаграждения) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК ОборотПоРеализации,
	|	СУММА(ВЫРАЗИТЬ((ОтчетПоКомиссииМеждуОрганизациями.СуммаВознаграждения - ОтчетПоКомиссииМеждуОрганизациями.СуммаНДСВознаграждения) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))*ЕСТЬNULL(СтавкиНДС.Ставка,0)/100) КАК СуммаНДС
	|ИЗ
	|	Документ.ОтчетПоКомиссииМеждуОрганизациями КАК ОтчетПоКомиссииМеждуОрганизациями
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&Дата, Организация = &Комиссионер) КАК УчетнаяПолитикаОрганизацийСрезПоследних
	|		ПО (НЕ УчетнаяПолитикаОрганизацийСрезПоследних.УчетнаяПолитика.ПрименяетсяОсвобождениеОтУплатыНДС)
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
	|		ПО ОтчетПоКомиссииМеждуОрганизациями.СтавкаНДСВознаграждения = СтавкиНДС.Ссылка
	|ГДЕ
	|	ОтчетПоКомиссииМеждуОрганизациями.Ссылка = &Ссылка
	|	И &Комиссионер <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	И НЕ ОтчетПоКомиссииМеждуОрганизациями.СпособРасчетаВознаграждения = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетПоКомиссииМеждуОрганизациями.СтавкаНДСВознаграждения";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаНДС_ПередачаТоваровМеждуОрганизациями()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Дата КАК Период,
	|	&Дата КАК НалоговыйПериод,
	|	NULL КАК КорректируемыйПериод,
	|	&Ссылка КАК Регистратор,
	|	&Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА &РасчетыЧерезОтдельногоКонтрагента = ИСТИНА
	|			ТОГДА &Контрагент
	|		ИНАЧЕ &ОрганизацияПолучатель
	|	КОНЕЦ КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	&Ссылка КАК СчетФактура,
	|	ТаблицаТовары.ВидОперацииРеализации КАК ВидОперацииРеализации,
	|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВЫРАЗИТЬ((Строки.СуммаСНДС - Строки.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаБезНДС,
	|	СУММА(ВЫРАЗИТЬ((Строки.СуммаСНДС - Строки.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК ОборотПоРеализации,
	|	СУММА(ВЫРАЗИТЬ((Строки.СуммаСНДС - Строки.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))*ЕСТЬNULL(СтавкиНДС.Ставка,0)/100) КАК СуммаНДС
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями.Товары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями.ВидыЗапасов КАК Строки
	|		ПО ТаблицаТовары.Ссылка = Строки.Ссылка
	|			И ТаблицаТовары.АналитикаУчетаНоменклатуры = Строки.АналитикаУчетаНоменклатуры
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
	|		ПО ТаблицаТовары.СтавкаНДС = СтавкиНДС.Ссылка
	// Примечание - подумать над соединением, соединение по идентификатору не подходит, т.к они разные.
	// по сути таблица Товары нужно только для того, чтобы определить вид операции по реализации НДС
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	И &НалогообложениеНДС В(ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|							ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС))
	|	И (Строки.ВидЗапасов ЕСТЬ NULL
	|		ИЛИ Строки.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.СтавкаНДС,
	|	ТаблицаТовары.ВидОперацииРеализации
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаНДС_РеализацияТоваровУслуг()

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Дата КАК Период,
	|	&Дата КАК НалоговыйПериод,
	|	ЛОЖЬ КАК ЗаписьДополнительнойДекларации,
	|	NULL КАК КорректируемыйПериод,
	|	&Ссылка КАК Регистратор,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	&Ссылка КАК СчетФактура,
	|	ТаблицаТовары.ВидОперацииРеализации КАК ВидОперацииРеализации,
	|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаТовары.СуммаСНДС - ТаблицаТовары.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаБезНДС,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаТовары.СуммаСНДС - ТаблицаТовары.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК ОборотПоРеализации,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаТовары.СуммаСНДС - ТаблицаТовары.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))*ЕСТЬNULL(СтавкиНДС.Ставка,0)/100) КАК СуммаНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
	|		ПО ТаблицаТовары.СтавкаНДС = СтавкиНДС.Ссылка
	|
	|
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И &Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРеализацийТоваровУслуг.КПредоплате)
	|	И &НалогообложениеНДС В(ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|							ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС))
	|	И &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	И ВЫБОР
	|			КОГДА &ВернутьМногооборотнуюТару
	|				ТОГДА ТаблицаТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.СтавкаНДС,
	|	ТаблицаТовары.ВидОперацииРеализации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Дата КАК Период,
	|	&Дата КАК НалоговыйПериод,
	|	ЛОЖЬ КАК ЗаписьДополнительнойДекларации,
	|	NULL КАК КорректируемыйПериод,
	|	&Ссылка КАК Регистратор,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	&Ссылка КАК СчетФактура,
	|	ТаблицаУслуги.ВидОперацииРеализации КАК ВидОперацииРеализации,
	|	ТаблицаУслуги.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаУслуги.СуммаСНДС - ТаблицаУслуги.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаБезНДС,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаУслуги.СуммаСНДС - ТаблицаУслуги.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК ОборотПоРеализации,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаУслуги.СуммаСНДС - ТаблицаУслуги.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))*ЕСТЬNULL(СтавкиНДС.Ставка,0)/100) КАК СуммаНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаУслуги
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
	|		ПО ТаблицаУслуги.СтавкаНДС = СтавкиНДС.Ссылка
	|
	|ГДЕ
	|	ТаблицаУслуги.Ссылка = &Ссылка
	|	И ТаблицаУслуги.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И &Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРеализацийТоваровУслуг.КПредоплате)
	|	И &НалогообложениеНДС В(ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|							ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС))
	|	И &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУслуги.СтавкаНДС,
	|	ТаблицаУслуги.ВидОперацииРеализации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Дата КАК Период,
	|	&Дата КАК НалоговыйПериод,
	|	ЛОЖЬ КАК ЗаписьДополнительнойДекларации,
	|	NULL КАК КорректируемыйПериод,
	|	&Ссылка КАК Регистратор,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	&Ссылка КАК СчетФактура,
	|	ТаблицаТовары.ВидОперацииРеализации КАК ВидОперацииРеализации,
	|	ЗНАЧЕНИЕ(Справочник.СтавкиНДС.НДС0) КАК СтавкаНДС,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаТовары.СуммаСНДС * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаБезНДС,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаТовары.СуммаСНДС * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК ОборотПоРеализации,
	|	0 КАК СуммаНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|	ПО 
	|		ТаблицаТовары.Ссылка = НДССостояниеРеализации0.ДокументРеализации
	|
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И &Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРеализацийТоваровУслуг.КПредоплате)
	|	И &НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
	|	И &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	//|	И НДССостояниеРеализации0.Состояние В (ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение), ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ПодтвержденаРеализация0))
	|	И ВЫБОР
	|			КОГДА &ВернутьМногооборотнуюТару
	|				ТОГДА ТаблицаТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.ВидОперацииРеализации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДССостояниеРеализации0.ДатаПодтверждения КАК Период,
	|	НДССостояниеРеализации0.ДатаПодтверждения КАК НалоговыйПериод,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаРеализации,КВАРТАЛ) < НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаПодтверждения,КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗаписьДополнительнойДекларации,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаРеализации,КВАРТАЛ) < НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаПодтверждения,КВАРТАЛ)
	|			ТОГДА НДССостояниеРеализации0.ДатаРеализации
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК КорректируемыйПериод,
	|	&Ссылка КАК Регистратор,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	&Ссылка КАК СчетФактура,
	|	ТаблицаТовары.ВидОперацииРеализации КАК ВидОперацииРеализации,
	|	НДССостояниеРеализации0.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаТовары.СуммаСНДС * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаБезНДС,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаТовары.СуммаСНДС * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК ОборотПоРеализации,
	|	СУММА(ВЫРАЗИТЬ(
	|		ТаблицаТовары.СуммаСНДС * &КоэффициентПересчетаВВалютуРегл
	|		* (ВЫБОР НДССостояниеРеализации0.СтавкаНДС
	|				КОГДА ЗНАЧЕНИЕ(Справочник.СтавкиНДС.НДС0)
	|					ТОГДА 0
	|				КОГДА ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС)
	|					ТОГДА 0
	|				КОГДА ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДСНеРК)
	|					ТОГДА 0
	|				ИНАЧЕ НДССостояниеРеализации0.СтавкаНДС.Ставка / 100
	|			КОНЕЦ)
	|		КАК ЧИСЛО(15, 2))) КАК СуммаНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|	ПО 
	|		ТаблицаТовары.Ссылка = НДССостояниеРеализации0.ДокументРеализации
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.СчетФактураНаНеподтвержденнуюРеализацию0 КАК СчетФактураНаНеподтвержденнуюРеализацию0
	|	ПО
	|		ТаблицаТовары.Ссылка = СчетФактураНаНеподтвержденнуюРеализацию0.ДокументОснование
	|		И СчетФактураНаНеподтвержденнуюРеализацию0.Проведен
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И &Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРеализацийТоваровУслуг.КПредоплате)
	|	И &НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт)
	|	И &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	И НДССостояниеРеализации0.Состояние = ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.НеподтвержденаРеализация0)
	|	И СчетФактураНаНеподтвержденнуюРеализацию0.Ссылка ЕСТЬ NULL
	|	И ВЫБОР
	|			КОГДА &ВернутьМногооборотнуюТару
	|				ТОГДА ТаблицаТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ЛОЖЬ //отключенный функционал для УПК
	|
	|СГРУППИРОВАТЬ ПО
	|	НДССостояниеРеализации0.ДатаПодтверждения,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаРеализации,КВАРТАЛ) < НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаПодтверждения,КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаРеализации,КВАРТАЛ) < НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаПодтверждения,КВАРТАЛ)
	|			ТОГДА НДССостояниеРеализации0.ДатаРеализации
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	НДССостояниеРеализации0.СтавкаНДС,
	|	ТаблицаТовары.ВидОперацииРеализации";

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаНДС_РеализацияУслугПрочихАктивов()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаДоходы.Ссылка.СпособВыпискиАктовВыполненныхРабот = ЗНАЧЕНИЕ(Перечисление.СпособыВыпискиАктовВыполненныхРабот.ВБумажномВиде) И НЕ ТаблицаДоходы.Ссылка.ДатаПодписанияГЗ = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА ТаблицаДоходы.Ссылка.ДатаПодписанияГЗ
	|		ИНАЧЕ &Дата
	|	КОНЕЦ КАК Период,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаДоходы.Ссылка.СпособВыпискиАктовВыполненныхРабот = ЗНАЧЕНИЕ(Перечисление.СпособыВыпискиАктовВыполненныхРабот.ВБумажномВиде) И НЕ ТаблицаДоходы.Ссылка.ДатаПодписанияГЗ = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА ТаблицаДоходы.Ссылка.ДатаПодписанияГЗ
	|		ИНАЧЕ &Дата
	|	КОНЕЦ КАК НалоговыйПериод,
	|	NULL КАК КорректируемыйПериод,
	|	&Ссылка КАК Регистратор,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	&Ссылка КАК СчетФактура,
	|	ТаблицаДоходы.ВидОперацииРеализации КАК ВидОперацииРеализации,
	|	ТаблицаДоходы.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаДоходы.СуммаСНДС - ТаблицаДоходы.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаБезНДС,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаДоходы.СуммаСНДС - ТаблицаДоходы.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК ОборотПоРеализации,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаДоходы.СуммаСНДС - ТаблицаДоходы.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))*ЕСТЬNULL(СтавкиНДС.Ставка,0)/100) КАК СуммаНДС
	|ИЗ
	|	Документ.РеализацияУслугПрочихАктивов.Доходы КАК ТаблицаДоходы
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
	|		ПО ТаблицаДоходы.СтавкаНДС = СтавкиНДС.Ссылка
	|ГДЕ
	|	ТаблицаДоходы.Ссылка = &Ссылка
	|	И &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	И &НалогообложениеНДС В(ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|							ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС))
	|	И ((НЕ ТаблицаДоходы.Ссылка.СпособВыпискиАктовВыполненныхРабот = ЗНАЧЕНИЕ(Перечисление.СпособыВыпискиАктовВыполненныхРабот.ВБумажномВиде) 
	|				И НЕ ТаблицаДоходы.Ссылка.ДатаПодписанияГЗ = ДАТАВРЕМЯ(1,1,1)) 
	|				ИЛИ ТаблицаДоходы.Ссылка.СпособВыпискиАктовВыполненныхРабот = ЗНАЧЕНИЕ(Перечисление.СпособыВыпискиАктовВыполненныхРабот.ВБумажномВиде))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДоходы.СтавкаНДС,
	|	ВидОперацииРеализации,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаДоходы.Ссылка.СпособВыпискиАктовВыполненныхРабот = ЗНАЧЕНИЕ(Перечисление.СпособыВыпискиАктовВыполненныхРабот.ВБумажномВиде) И НЕ ТаблицаДоходы.Ссылка.ДатаПодписанияГЗ = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА ТаблицаДоходы.Ссылка.ДатаПодписанияГЗ
	|		ИНАЧЕ &Дата
	|	КОНЕЦ ";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаНДС_СчетФактураНаНеподтвержденнуюРеализацию0()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&Дата КАК Период,
	|	&Дата КАК НалоговыйПериод,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаРеализации,КВАРТАЛ) < НАЧАЛОПЕРИОДА(&Дата,КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗаписьДополнительнойДекларации,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаРеализации,КВАРТАЛ) < НАЧАЛОПЕРИОДА(&Дата,КВАРТАЛ)
	|			ТОГДА НДССостояниеРеализации0.ДатаРеализации
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК КорректируемыйПериод,
	|	&Ссылка КАК Регистратор,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	&Ссылка КАК СчетФактура,
	|	ЗНАЧЕНИЕ(Справочник.ВидыРеализации.РеализацияТМЗ) КАК ВидОперацииРеализации,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВЫРАЗИТЬ((Товары.СуммаСНДС - Товары.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаБезНДС,
	|	СУММА(ВЫРАЗИТЬ((Товары.СуммаСНДС - Товары.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК ОборотПоРеализации,
	|	СУММА(ВЫРАЗИТЬ(Товары.СуммаНДС * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаНДС
	|ИЗ
	|	Документ.СчетФактураНаНеподтвержденнуюРеализацию0.Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|			ПО Товары.Ссылка.ДокументОснование = НДССостояниеРеализации0.ДокументРеализации
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|	И &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	И (ВЫБОР
	|		КОГДА &ВернутьМногооборотнуюТару
	|			ТОГДА Товары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|		ИНАЧЕ
	|			ИСТИНА
	|		КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаРеализации, КВАРТАЛ) < НАЧАЛОПЕРИОДА(&Дата, КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаРеализации, КВАРТАЛ) < НАЧАЛОПЕРИОДА(&Дата, КВАРТАЛ)
	|			ТОГДА НДССостояниеРеализации0.ДатаРеализации
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	Товары.СтавкаНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Дата КАК Период,
	|	&Дата КАК НалоговыйПериод,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаРеализации,КВАРТАЛ) < НАЧАЛОПЕРИОДА(&Дата,КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗаписьДополнительнойДекларации,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаРеализации,КВАРТАЛ) < НАЧАЛОПЕРИОДА(&Дата,КВАРТАЛ)
	|			ТОГДА НДССостояниеРеализации0.ДатаРеализации
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК КорректируемыйПериод,
	|	&Ссылка КАК Регистратор,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	&Ссылка КАК СчетФактура,
	|	ЗНАЧЕНИЕ(Справочник.ВидыРеализации.РеализацияТМЗ) КАК ВидОперацииРеализации,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВЫРАЗИТЬ((Товары.СуммаСНДС - Товары.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаБезНДС,
	|	СУММА(ВЫРАЗИТЬ((Товары.СуммаСНДС - Товары.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК ОборотПоРеализации,
	|	СУММА(ВЫРАЗИТЬ(Товары.СуммаНДС * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаНДС
	|ИЗ
	|	Документ.СчетФактураНаНеподтвержденнуюРеализацию0.Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|			ПО Товары.Ссылка.ДокументОснование = НДССостояниеРеализации0.ДокументРеализации
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И Товары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга),
	|											 ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|	И Товары.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|	И &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаРеализации,КВАРТАЛ) < НАЧАЛОПЕРИОДА(&Дата,КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(НДССостояниеРеализации0.ДатаРеализации,КВАРТАЛ) < НАЧАЛОПЕРИОДА(&Дата,КВАРТАЛ)
	|			ТОГДА НДССостояниеРеализации0.ДатаРеализации
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	Товары.СтавкаНДС";

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаНДС_ВозвратТоваровМеждуОрганизациями()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&Дата КАК Период,
	|	&Дата КАК НалоговыйПериод,
	|	NULL КАК КорректируемыйПериод,
	|	&Ссылка КАК Регистратор,
	|	&ОрганизацияПолучатель КАК Организация,
	|	ВЫБОР
	|		КОГДА &РасчетыЧерезОтдельногоКонтрагента = ИСТИНА
	|			ТОГДА &Контрагент
	|		ИНАЧЕ &Организация
	|	КОНЕЦ КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	&Ссылка КАК СчетФактура,
	|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	|	-1 * СУММА(ВЫРАЗИТЬ((Строки.СуммаСНДС - Строки.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаБезНДС,
	|	-1 * СУММА(ВЫРАЗИТЬ((Строки.СуммаСНДС - Строки.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК ОборотПоРеализации,
	|	-1 * СУММА(ВЫРАЗИТЬ(Строки.СуммаНДС * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаНДС,
	|	ТаблицаТовары.ВидОперацииРеализации КАК ВидОперацииРеализации
	|ИЗ
	|	Документ.ВозвратТоваровМеждуОрганизациями.Товары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровМеждуОрганизациями.ВидыЗапасов КАК Строки
	|		ПО ТаблицаТовары.Ссылка = Строки.Ссылка
	|			И ТаблицаТовары.АналитикаУчетаНоменклатуры = Строки.АналитикаУчетаНоменклатуры
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И &ОрганизацияПолучатель <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	И &НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС), ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.СтавкаНДС,
	|	ТаблицаТовары.ВидОперацииРеализации";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаНДС_ВозвратТоваровОтКлиента()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&Дата КАК Период,
	|	&Дата КАК НалоговыйПериод,
	|	NULL КАК КорректируемыйПериод,
	|	&Ссылка КАК Регистратор,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	&Ссылка КАК СчетФактура,
	|	Товары.ВидОперацииРеализации КАК ВидОперацииРеализации,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВЫРАЗИТЬ((Товары.СуммаСНДС - Товары.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2)) * -1) КАК СуммаБезНДС,
	|	СУММА(ВЫРАЗИТЬ((Товары.СуммаСНДС - Товары.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2)) * -1) КАК ОборотПоРеализации,
	|	СУММА(ВЫРАЗИТЬ((Товары.СуммаСНДС - Товары.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2)) * ЕСТЬNULL(СтавкиНДС.Ставка,0)/100 * -1) КАК СуммаНДС
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента.Товары КАК Товары
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
	|		ПО Товары.СтавкаНДС = СтавкиНДС.Ссылка
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|	И &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	И &НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС), ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС))
	|	И ВЫБОР
	|			КОГДА &ВозвратПереданнойМногооборотнойТары
	|				ТОГДА Товары.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И Товары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.СтавкаНДС,
	|	Товары.ВидОперацииРеализации";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаНДС_ТаможеннаяДекларацияИмпорт()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&Дата КАК Период,
	|	&Дата КАК НалоговыйПериод,
	|	ЛОЖЬ КАК ЗаписьДополнительнойДекларации,
	|	NULL КАК КорректируемыйПериод,
	|	&Ссылка КАК Регистратор,
	|	&Ссылка КАК СчетФактура,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	Разделы.СтавкаНДС,
	|	ЗНАЧЕНИЕ(Справочник.ВидыРеализации.ИмпортТМЗМетодомЗачета) КАК ВидОперацииРеализации,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаТовары.ТаможеннаяСтоимость + ТаблицаТовары.СуммаПошлины + ТаблицаТовары.СпециальнаяПошлина + ТаблицаТовары.ТаможенныйСбор) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаБезНДС,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаТовары.СуммаНДС * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаНДС,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаТовары.ТаможеннаяСтоимость + ТаблицаТовары.СуммаПошлины + ТаблицаТовары.СпециальнаяПошлина + ТаблицаТовары.ТаможенныйСбор) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК ОборотПоРеализации
	|ИЗ
	|	Документ.ТаможеннаяДекларацияИмпорт.Товары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТаможеннаяДекларацияИмпорт.Разделы КАК Разделы
	|		ПО ТаблицаТовары.Ссылка = Разделы.Ссылка
	|			И ТаблицаТовары.НомерРаздела = Разделы.НомерРаздела
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&Дата, Организация = &Организация) КАК РегУчетнаяПолитика
	|		ПО РегУчетнаяПолитика.Организация = &Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчетныеПолитикиОрганизаций КАК СпрУчетнаяПолитика
	|		ПО РегУчетнаяПолитика.УчетнаяПолитика = СпрУчетнаяПолитика.Ссылка
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыТаможенныхДеклараций.ВыпущеноСТаможни)
	|	И &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	И ТаблицаТовары.ВидОперацииПоступления.ВидНДС = Значение(Перечисление.ВидыНДС.НДСУплачиваемыйПриИмпортеМетодомЗачета)
	|	И ВЫБОР
	|			КОГДА &ВернутьМногооборотнуюТару
	|				ТОГДА ТаблицаТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ЕСТЬNULL(СпрУчетнаяПолитика.ПрименяетсяОсвобождениеОтУплатыНДС, ИСТИНА) = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.ВидОперацииПоступления,
	|	Разделы.СтавкаНДС";

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаНДС_ЗаявлениеОВвозеТоваров()

	ТекстЗапроса =
	// для НДСУплачиваемыйПриИмпортеМетодомЗачета не требуется подтверждения оплаты	
	"ВЫБРАТЬ
	|	ТаблицаТовары.Ссылка.Дата КАК Период,
	|	ТаблицаТовары.Ссылка.Дата КАК НалоговыйПериод,
	|	ЛОЖЬ КАК ЗаписьДополнительнойДекларации,
	|	NULL КАК КорректируемыйПериод,
	|	&Ссылка КАК Регистратор,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	&Ссылка КАК СчетФактура,
	|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ЗНАЧЕНИЕ(Справочник.ВидыРеализации.ИмпортТМЗМетодомЗачета) КАК ВидОперацииРеализации,
	|	СУММА(ТаблицаТовары.НалоговаяБазаНДС) КАК СуммаБезНДС,
	|	СУММА(ТаблицаТовары.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ТаблицаТовары.НалоговаяБазаНДС) КАК ОборотПоРеализации
	|ИЗ
	|	Документ.ЗаявлениеОВвозеТоваров.Товары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&Дата, Организация = &Организация) КАК РегУчетнаяПолитика
	|		ПО РегУчетнаяПолитика.Организация = &Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчетныеПолитикиОрганизаций КАК СпрУчетнаяПолитика
	|		ПО РегУчетнаяПолитика.УчетнаяПолитика = СпрУчетнаяПолитика.Ссылка
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	И ВЫБОР
	|			КОГДА &ВозвратПереданнойМногооборотнойТары
	|				ТОГДА ТаблицаТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ТаблицаТовары.ВидОперацииПоступления.ВидНДС = Значение(Перечисление.ВидыНДС.НДСУплачиваемыйПриИмпортеМетодомЗачета)
	|	И ТаблицаТовары.ДокументПоступления.ЗакупкаПодДеятельность <>
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|	И ТаблицаТовары.ВидОперацииПоступления.ВидНДС = ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДСУплачиваемыйПриИмпортеМетодомЗачета)
	|	И ЕСТЬNULL(СпрУчетнаяПолитика.ПрименяетсяОсвобождениеОтУплатыНДС, ИСТИНА) = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.Ссылка.Дата,
	|	ТаблицаТовары.ЗакупкаПодДеятельность,
	|	ТаблицаТовары.СтавкаНДС";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаНДС_КорректировкаРеализации()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&Дата КАК Период,
	|	&Дата КАК НалоговыйПериод,
	|	NULL КАК КорректируемыйПериод,
	|	&Ссылка КАК Регистратор,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	&Ссылка КАК СчетФактура,
	|	ТаблицаРасхождения.ВидОперацииРеализации КАК ВидОперацииРеализации,
	|	ТаблицаРасхождения.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаРасхождения.СуммаСНДС - ТаблицаРасхождения.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаБезНДС,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаРасхождения.СуммаСНДС - ТаблицаРасхождения.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК ОборотПоРеализации,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаРасхождения.СуммаСНДС - ТаблицаРасхождения.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))*ЕСТЬNULL(СтавкиНДС.Ставка,0)/100) КАК СуммаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.Расхождения КАК ТаблицаРасхождения
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
	|		ПО ТаблицаРасхождения.СтавкаНДС = СтавкиНДС.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.ВидыЗапасовСписание КАК Строки
	|		ПО ТаблицаРасхождения.Ссылка = Строки.Ссылка
	|			И ТаблицаРасхождения.АналитикаУчетаНоменклатуры = Строки.АналитикаУчетаНоменклатуры
	|			И ТаблицаРасхождения.АналитикаУчетаНаборов = Строки.АналитикаУчетаНаборов
	|			И ТаблицаРасхождения.Склад = Строки.Склад
	|			И ТаблицаРасхождения.ЗаказКлиента = Строки.ЗаказКлиента
	|			И ТаблицаРасхождения.Упаковка = Строки.Упаковка
	// Примечание - подумать над соединением, соединение по идентификатору не подходит, т.к они разные.
	// по сути таблица Товары нужно только для того, чтобы определить вид операции по реализации НДС
	|ГДЕ
	|	ТаблицаРасхождения.Ссылка = &Ссылка
	|	И &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	И &НалогообложениеНДС В(ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|							ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС),
	|							ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНаЭкспорт))
	|	И ТаблицаРасхождения.Ссылка.ВидКорректировки = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияПерепоставленногоТовара)
	|	И (Строки.ВидЗапасов ЕСТЬ NULL
	|		ИЛИ Строки.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасхождения.СтавкаНДС,
	|	ТаблицаРасхождения.ВидОперацииРеализации";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаНДСКВозмещению_ТаможеннаяДекларацияИмпорт()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&Дата КАК Период,
	|	&Дата КАК НалоговыйПериод,
	|	ЛОЖЬ КАК ЗаписьДополнительнойДекларации,
	|	NULL КАК КорректируемыйПериод,
	|	&Ссылка КАК Регистратор,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	&Ссылка КАК СчетФактура,
	|	Разделы.СтавкаНДС,
	|	ТаблицаТовары.ВидОперацииПоступления КАК ВидОперацииПоступления,
	|	ВЫБОР
	|		КОГДА &ИспользоватьРаздельныйУчетПоНалогообложению
	|			ТОГДА ВЫБОР
	|					КОГДА &ПрименяетсяУчетНДСПоФактическомуИспользованию = ЛОЖЬ
	|						ТОГДА ВЫБОР
	|								КОГДА ТаблицаТовары.ЗакупкаПодДеятельность = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|									ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОборотовПоРеализации.Облагаемый)
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ТаблицаТовары.ЗакупкаПодДеятельность = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|											ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОборотовПоРеализации.Освобожденный)
	|										ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОборотовПоРеализации.Общий)
	|									КОНЕЦ
	|							КОНЕЦ
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОборотовПоРеализации.Общий)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОборотовПоРеализации.Общий)
	|	КОНЕЦ КАК ВидОборота,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаТовары.ТаможеннаяСтоимость + ТаблицаТовары.СуммаПошлины + ТаблицаТовары.СпециальнаяПошлина + ТаблицаТовары.ТаможенныйСбор) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаБезНДС,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаТовары.СуммаНДС * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаНДС,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаТовары.СуммаНДС * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК УплаченныйНДС
	|ИЗ
	|	Документ.ТаможеннаяДекларацияИмпорт.Товары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТаможеннаяДекларацияИмпорт.Разделы КАК Разделы
	|		ПО ТаблицаТовары.Ссылка = Разделы.Ссылка
	|			И ТаблицаТовары.НомерРаздела = Разделы.НомерРаздела
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&Дата, Организация = &Организация) КАК РегУчетнаяПолитика
	|		ПО РегУчетнаяПолитика.Организация = &Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчетныеПолитикиОрганизаций КАК СпрУчетнаяПолитика
	|		ПО РегУчетнаяПолитика.УчетнаяПолитика = СпрУчетнаяПолитика.Ссылка
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыТаможенныхДеклараций.ВыпущеноСТаможни)
	|	И &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	И ВЫБОР
	|			КОГДА &ВернутьМногооборотнуюТару
	|				ТОГДА ТаблицаТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ЕСТЬNULL(СпрУчетнаяПолитика.ПрименяетсяОсвобождениеОтУплатыНДС, ИСТИНА) = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.ВидОперацииПоступления,
	|	ТаблицаТовары.ЗакупкаПодДеятельность,
	|	Разделы.СтавкаНДС";

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаНДСКВозмещению_ЗаявлениеОВвозеТоваров()
	
	ТекстЗапроса =
	// для НДСУплачиваемыйПриИмпортеМетодомЗачета не требуется подтверждения оплаты	
	"ВЫБРАТЬ
	|	ТаблицаТовары.Ссылка.Дата КАК Период,
	|	ТаблицаТовары.Ссылка.Дата КАК НалоговыйПериод,
	|	ЛОЖЬ КАК ЗаписьДополнительнойДекларации,
	|	NULL КАК КорректируемыйПериод,
	|	&Ссылка КАК Регистратор,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	&Ссылка КАК СчетФактура,
	|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаТовары.ВидОперацииПоступления КАК ВидОперацииПоступления,
	|	ВЫБОР
	|		КОГДА &ИспользоватьРаздельныйУчетПоНалогообложению
	|			ТОГДА ВЫБОР
	|					КОГДА &ПрименяетсяУчетНДСПоФактическомуИспользованию = ЛОЖЬ
	|						ТОГДА ВЫБОР
	|								КОГДА ТаблицаТовары.ЗакупкаПодДеятельность = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|									ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОборотовПоРеализации.Облагаемый)
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ТаблицаТовары.ЗакупкаПодДеятельность = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|											ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОборотовПоРеализации.Освобожденный)
	|										ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОборотовПоРеализации.Общий)
	|									КОНЕЦ
	|							КОНЕЦ
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОборотовПоРеализации.Общий)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОборотовПоРеализации.Общий)
	|	КОНЕЦ КАК ВидОборота,
	|	СУММА(ТаблицаТовары.НалоговаяБазаНДС) КАК СуммаБезНДС,
	|	СУММА(ТаблицаТовары.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ТаблицаТовары.СуммаНДС) КАК УплаченныйНДС
	|ИЗ
	|	Документ.ЗаявлениеОВвозеТоваров.Товары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&Дата, Организация = &Организация) КАК РегУчетнаяПолитика
	|		ПО РегУчетнаяПолитика.Организация = &Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчетныеПолитикиОрганизаций КАК СпрУчетнаяПолитика
	|		ПО РегУчетнаяПолитика.УчетнаяПолитика = СпрУчетнаяПолитика.Ссылка
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	И ВЫБОР
	|			КОГДА &ВернутьМногооборотнуюТару
	|				ТОГДА ТаблицаТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ТаблицаТовары.ДокументПоступления.ЗакупкаПодДеятельность <>
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|   И ТаблицаТовары.ВидОперацииПоступления.ВидНДС = ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДСУплачиваемыйПриИмпортеМетодомЗачета)
	|	И ЕСТЬNULL(СпрУчетнаяПолитика.ПрименяетсяОсвобождениеОтУплатыНДС, ИСТИНА) = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.ВидОперацииПоступления,
	|	ТаблицаТовары.Ссылка.Дата,
	|	ТаблицаТовары.ЗакупкаПодДеятельность,
	|	ТаблицаТовары.СтавкаНДС";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаНДСКВозмещению_СчетФактураНалоговыйАгент()

	// движения перенесены в общий модуль, но процедура должна содержаться в модуле для совместимости с универсальным механизмом
	ТекстЗапроса = "";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаНДСЗаНерезидента_СчетФактураНалоговыйАгент()

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	СчетФактураНалоговыйАгент.Дата КАК Период,
	|	СчетФактураНалоговыйАгент.Организация,
	|	СчетФактураНалоговыйАгент.ВидОперацииПоступления КАК ВидОперацииПоступления,
	|	СчетФактураНалоговыйАгент.ДокументОснование КАК ДокументПоступления,
	|	СчетФактураНалоговыйАгент.Сумма КАК СуммаБезНДС,
	|	СчетФактураНалоговыйАгент.СуммаНДС
	|ИЗ
	|	Документ.СчетФактураНалоговыйАгент КАК СчетФактураНалоговыйАгент
	|ГДЕ
	|	СчетФактураНалоговыйАгент.Ссылка = &Ссылка";

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТаблицаНДС_ВыкупВозвратнойТарыКлиентом()

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Дата КАК Период,
	|	&Дата КАК НалоговыйПериод,
	|	ЛОЖЬ КАК ЗаписьДополнительнойДекларации,
	|	NULL КАК КорректируемыйПериод,
	|	&Ссылка КАК Регистратор,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&Договор КАК ДоговорКонтрагента,
	|	&Ссылка КАК СчетФактура,
	|	Значение(Справочник.ВидыРеализации.РеализацияТМЗ) КАК ВидОперацииРеализации,
	|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаТовары.СуммаСНДС - ТаблицаТовары.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК СуммаБезНДС,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаТовары.СуммаСНДС - ТаблицаТовары.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2))) КАК ОборотПоРеализации,
	|	СУММА(ВЫРАЗИТЬ((ТаблицаТовары.СуммаСНДС - ТаблицаТовары.СуммаНДС) * &КоэффициентПересчетаВВалютуРегл КАК ЧИСЛО(15, 2)) * ЕСТЬNULL(СтавкиНДС.Ставка,0)/100) КАК СуммаНДС
	|ИЗ
	|	Документ.ВыкупВозвратнойТарыКлиентом.Товары КАК ТаблицаТовары
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
	|		ПО ТаблицаТовары.СтавкаНДС = СтавкиНДС.Ссылка
	|
	|
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И &НалогообложениеНДС В(ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС),
	|							ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС))
	|	И &Организация <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|	И  ТаблицаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.СтавкаНДС";


	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтразитьНДС(Объект, ДополнительныеСвойства, Движения, Отказ) Экспорт

	Если НЕ ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаНДС") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Движения.НДС.ДополнительныеСвойства.Свойство("ДляПроведения") Тогда
        ПроведениеСерверУТ.ЗаполнитьДополнительныеСвойстваНабораПоДокументу(Объект, Движения.НДС);
	КонецЕсли;

	ТаблицаДвижений = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНДС;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Движения.НДС.Записывать = Истина;
	Движения.НДС.Загрузить(ТаблицаДвижений);
	
	ЗарегистрироватьЗаданияКЗакрытиюМесяцаНДС(Объект, ДополнительныеСвойства);

КонецПроцедуры

Процедура ОтразитьНДСКВозмещению(Объект, ДополнительныеСвойства, Движения, Отказ) Экспорт

	Если НЕ ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаНДСКВозмещению") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Движения.НДСКВозмещению.ДополнительныеСвойства.Свойство("ДляПроведения") Тогда
		ПроведениеСерверУТ.ЗаполнитьДополнительныеСвойстваНабораПоДокументу(Объект, Движения.НДСКВозмещению);
	КонецЕсли;
	
	ТаблицаДвижений = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНДСКВозмещению;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Движения.НДСКВозмещению.Записывать = Истина;
	Движения.НДСКВозмещению.Загрузить(ТаблицаДвижений);
	
	ЗарегистрироватьЗаданияКЗакрытиюМесяцаНДСКВозмещению(Объект, ДополнительныеСвойства);

КонецПроцедуры

Процедура ОтразитьНДСЗаНерезидента(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Если НЕ ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("ТаблицаНДСЗаНерезидента") Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаДвижений = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНДСЗаНерезидента;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Движения.НДСЗаНерезидента.Записывать = Истина;
	Движения.НДСЗаНерезидента.Загрузить(ТаблицаДвижений);

КонецПроцедуры

Процедура ИнициализироватьДанныеДокумента(ДокументОбъект, ДополнительныеСвойства, СтруктураРегистров) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	СтруктураПараметров = Новый Структура;
	ЗаполнитьСтруктуруПараметровЗапроса(СтруктураПараметров, ДокументОбъект);
	
	Запрос = Новый Запрос;
	УстановитьПараметрыЗапроса(Запрос, СтруктураПараметров);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	Для Каждого Регистр Из СтруктураРегистров Цикл
		
		Если Регистр.Значение Тогда
			Если Регистр.Ключ = "НДСКВозмещению" И 
				(ДокументОбъект.Метаданные().Имя = "РеализацияТоваровУслуг" ИЛИ ДокументОбъект.Метаданные().Имя = "КорректировкаРеализации") Тогда
				Продолжить;
			КонецЕсли;
			ИмяПроцедуры = "ТекстЗапросаТаблица" + Регистр.Ключ + "_[ИмяДокумента]()";
			ИмяПроцедуры = СтрЗаменить(ИмяПроцедуры, "[ИмяДокумента]", ДокументОбъект.Метаданные().Имя);
			ТекстЗапроса = Вычислить(ИмяПроцедуры);
			
			Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
				ТекстыЗапроса.Добавить(ТекстЗапроса, "Таблица" + Регистр.Ключ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьСтруктуруПараметровЗапроса(СтруктураПараметров, ДокументОбъект)
	
	СтруктураПараметров.Вставить("Ссылка");
	СтруктураПараметров.Вставить("Статус");
	СтруктураПараметров.Вставить("Дата");
	СтруктураПараметров.Вставить("Организация");
	СтруктураПараметров.Вставить("Контрагент");
	СтруктураПараметров.Вставить("НалогообложениеНДС");
	СтруктураПараметров.Вставить("ВернутьМногооборотнуюТару");
	СтруктураПараметров.Вставить("Валюта");
	СтруктураПараметров.Вставить("ВалютаВзаиморасчетов");
	СтруктураПараметров.Вставить("Договор");
	СтруктураПараметров.Вставить("РасчетыЧерезОтдельногоКонтрагента");
	СтруктураПараметров.Вставить("ОрганизацияПолучатель");
	СтруктураПараметров.Вставить("Комитент");
	СтруктураПараметров.Вставить("Комиссионер");
	СтруктураПараметров.Вставить("СтавкаНДС");
	СтруктураПараметров.Вставить("ЗакупкаПодДеятельность");
	СтруктураПараметров.Вставить("ВидОперацииРеализации");
	СтруктураПараметров.Вставить("ПрименяетсяУчетНДСПоФактическомуИспользованию");
	СтруктураПараметров.Вставить("ИспользоватьРаздельныйУчетПоНалогообложению");
	СтруктураПараметров.Вставить("ВозвратПереданнойМногооборотнойТары");

	ЗаполнитьЗначенияСвойств(СтруктураПараметров, ДокументОбъект);
	
КонецПроцедуры

Процедура УстановитьПараметрыЗапроса(Запрос, СтруктураПараметров)

	СтруктураПараметров.Валюта				 = ?(ЗначениеЗаполнено(СтруктураПараметров.Валюта), СтруктураПараметров.Валюта, Константы.ВалютаРегламентированногоУчета.Получить());
	СтруктураПараметров.ВалютаВзаиморасчетов = ?(ЗначениеЗаполнено(СтруктураПараметров.ВалютаВзаиморасчетов), СтруктураПараметров.ВалютаВзаиморасчетов, СтруктураПараметров.Валюта);

	Для Каждого Параметр Из СтруктураПараметров Цикл 

		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);

	КонецЦикла;

	УстановитьПараметрыЗапросаКоэффициентыВалют(Запрос);

	ПараметрыУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаОрганизаций.ПараметрыУчетнойПолитики(СтруктураПараметров.Организация, СтруктураПараметров.Дата);
	Запрос.УстановитьПараметр("ПрименяетсяУчетНДСПоФактическомуИспользованию", ?(ПараметрыУчетнойПолитики = Неопределено, Ложь, ПараметрыУчетнойПолитики.ПрименяетсяУчетНДСПоФактическомуИспользованию));
	Запрос.УстановитьПараметр("ИспользоватьРаздельныйУчетПоНалогообложению", ПолучитьФункциональнуюОпцию("ИспользоватьРаздельныйУчетПоНалогообложению"));

КонецПроцедуры

Процедура УстановитьПараметрыЗапросаКоэффициентыВалют(Запрос)

	Если Запрос.Параметры.Свойство("КоэффициентПересчетаВВалютуУПР")
		И Запрос.Параметры.Свойство("КоэффициентПересчетаВВалютуРегл")
		И Запрос.Параметры.Свойство("КоэффициентПересчетаВВалютуВзаиморасчетов") Тогда
		Возврат;
	КонецЕсли;

	Коэффициенты = РаботаСКурсамивалютУТ.ПолучитьКоэффициентыПересчетаВалюты(
		Запрос.Параметры.Валюта,
		Запрос.Параметры.ВалютаВзаиморасчетов,
		Запрос.Параметры.Дата);

	Запрос.УстановитьПараметр("КоэффициентПересчетаВВалютуУПР",            Коэффициенты.КоэффициентПересчетаВВалютуУПР);
	Запрос.УстановитьПараметр("КоэффициентПересчетаВВалютуРегл",           Коэффициенты.КоэффициентПересчетаВВалютуРегл);
	Запрос.УстановитьПараметр("КоэффициентПересчетаВВалютуВзаиморасчетов", Коэффициенты.КоэффициентПересчетаВВалютуВзаиморасчетов);

КонецПроцедуры

#КонецОбласти

#КонецОбласти
//-- НЕ УТ
