#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область СохранениеДвижений

// Добавляет в дополнительные свойства документа служебное свойство,
// в котором сохраняются дата начала и окончания периода,
// за который необходимо сохранить движения из ИБ в записываемый набор записей регистра.
//
Процедура ИнициализироватьСохранениеДвиженийДокументаЗаПериод(ДополнительныеСвойстваДокумента,
			НачалоПериода = Неопределено, КонецПериода = Неопределено) Экспорт
	
	ДополнительныеСвойстваДокумента.Вставить("ДополнитьДвижениямиИзИБЗаПериод", Новый Структура);
	
	ДополнительныеСвойстваДокумента.ДополнитьДвижениямиИзИБЗаПериод.Вставить(
		"НачалоПериода",
		?(ЗначениеЗаполнено(НачалоПериода), НачалоПериода, Дата(1,1,1)));
	
	ДополнительныеСвойстваДокумента.ДополнитьДвижениямиИзИБЗаПериод.Вставить(
		"КонецПериода", 
		?(ЗначениеЗаполнено(КонецПериода),  КонецПериода,  ДобавитьМесяц(КонецМесяца(ТекущаяДатаСеанса()), 12*100)));
	
КонецПроцедуры

Процедура ИнициализироватьСохранениеДвиженийНабораЗаписейЗаПериод(Движение, ДополнительныеСвойстваДокумента) Экспорт
	
	Если ДополнительныеСвойстваДокумента.Свойство("ДополнитьДвижениямиИзИБЗаПериод") Тогда
		
		Движение.ДополнительныеСвойства.Вставить(
			"ДополнитьДвижениямиИзИБЗаПериод",
			ДополнительныеСвойстваДокумента.ДополнитьДвижениямиИзИБЗаПериод);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Обработчик обновления УТ 11.4.1
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт

	ПолноеИмяРегистра = "РегистрНакопления.СебестоимостьТоваров";
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр(
		"ДатаПереходаНаПартионныйУчетВерсии22",
		УниверсальныеМеханизмыПартийИСебестоимостиПовтИсп.ДатаПереходаНаПартионныйУчетВерсии22());
	Запрос.УстановитьПараметр(
		"ПартионныйУчетВерсии22",
		УниверсальныеМеханизмыПартийИСебестоимостиПовтИсп.ПартионныйУчетВерсии22(НачалоМесяца(ТекущаяДатаСеанса())));
	Запрос.УстановитьПараметр(
		"ФормироватьВидыЗапасовПоСделкам",
		ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоСделкам"));
	Запрос.УстановитьПараметр(
		"ФормироватьВидыЗапасовПоПодразделениямМенеджерам",
		ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоПодразделениямМенеджерам"));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Движения.Ссылка КАК Ссылка
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Движения.Регистратор КАК Ссылка
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров КАК Движения
	|	ГДЕ
	|		Движения.Организация = ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|		И Движения.АналитикаУчетаПоПартнерам <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка)
	|		И Движения.КорВидДеятельностиНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|	
	//++ НЕ УТ
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	// Приведение хоз. операции выпуска к единообразию
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Движения.Регистратор КАК Ссылка
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров КАК Движения
	|	ГДЕ
	|		Движения.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииНаСклад),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение))
	|		И Движения.Регистратор Ссылка Документ.ПроизводствоБезЗаказа
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	// Заполнение направления деятельности документа в аналитике учета партий производства.
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Движения.Регистратор КАК Ссылка
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров КАК Движения
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК ПроизводствоБезЗаказа
	|		ПО ПроизводствоБезЗаказа.Ссылка = Движения.Партия
	|			ИЛИ ПроизводствоБезЗаказа.Ссылка = Движения.КорПартия
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПартийПроизводства КАК АналитикиПартий
	|		ПО АналитикиПартий.КлючАналитики = Движения.АналитикаУчетаПартийПроизводства
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК СпрНазначения
	|		ПО СпрНазначения.Ссылка = АналитикиПартий.Назначение
	|
	|	ГДЕ
	|		ПроизводствоБезЗаказа.ГруппировкаЗатрат В (ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВПроизводствеБезЗаказа.ПоПродукции),
	|													ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВПроизводствеБезЗаказа.ПоСпецификациям),
	|													ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВПроизводствеБезЗаказа.ПоДокументу),
	|													ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВПроизводствеБезЗаказа.ЗатратыНеУказываются))
	|		И НЕ ПроизводствоБезЗаказа.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|		И НЕ ЕСТЬNULL(СпрНазначения.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) = ПроизводствоБезЗаказа.НаправлениеДеятельности
	|		И (Движения.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|			ИЛИ Движения.КорРазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство))
	//-- НЕ УТ
	|	
	|	//%ТекстЗапросаВидыЗапасов
	|
	|	) КАК Движения
	//++ НЕ УТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Движения.Регистратор
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Движения
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|	И Движения.Регистратор ССЫЛКА Документ.ОтчетПереработчика
	|	И Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Движения.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И Движения.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	И Движения.Период >= &ДатаПереходаНаПартионныйУчетВерсии22
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Изменение раздела учета для поступлений от переработчика и отчетов переработчика для ПУ 2.2
	// раздел учета для продукции должен быть "ПроизводственныеЗатраты".
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Движения.Регистратор
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Движения
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|	И Движения.Регистратор ССЫЛКА Документ.ОтчетПереработчика
	|	И Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Движения.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|	И Движения.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчикаФиксированнаяСтоимость),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|	И Движения.Период >= &ДатаПереходаНаПартионныйУчетВерсии22
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Движения.Регистратор
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Движения
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|	И Движения.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика
	|	И Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Движения.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|	И Движения.Период >= &ДатаПереходаНаПартионныйУчетВерсии22
	//-- НЕ УТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Движения.Регистратор
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Движения
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО Аналитика.Ссылка = Движения.АналитикаУчетаНоменклатуры
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО Назначения.Ссылка = Аналитика.Назначение
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НаправленияДеятельности КАК НаправленияДеятельности
	|		ПО НаправленияДеятельности.Ссылка = Назначения.НаправлениеДеятельности
	|ГДЕ
	|	Движения.КорНаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	И (Движения.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		ИЛИ Движения.СтатьяАктивовПассивов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Заполним аналитику фин. учета ПО разделу "ТоварыВПути"
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Движения.Регистратор
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Движения
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализации
	|	ПО &ПартионныйУчетВерсии22
	|		И Движения.Период >= &ДатаПереходаНаПартионныйУчетВерсии22
	|		И Движения.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути)
	|		И Движения.Регистратор = Реализации.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|	ПО СтруктураПредприятия.Ссылка = Реализации.Подразделение
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СделкиСКлиентами КАК Сделки
	|	ПО Сделки.Ссылка = Реализации.Сделка
	|
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|	И Движения.Период >= &ДатаПереходаНаПартионныйУчетВерсии22
	|	И Движения.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути)
	|	И (&ФормироватьВидыЗапасовПоСделкам
	|			И ЕСТЬNULL(Сделки.ОбособленныйУчетТоваровПоСделке, ЛОЖЬ)
	|		ИЛИ &ФормироватьВидыЗапасовПоПодразделениямМенеджерам
	|			И ЕСТЬNULL(СтруктураПредприятия.ВариантОбособленногоУчетаТоваров, ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленногоУчетаТоваров.ПустаяСсылка))
	|				= ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленногоУчетаТоваров.ПоМенеджерамПодразделения)
	|		ИЛИ &ФормироватьВидыЗапасовПоПодразделениямМенеджерам
	|			И ЕСТЬNULL(СтруктураПредприятия.ВариантОбособленногоУчетаТоваров, ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленногоУчетаТоваров.ПустаяСсылка))
	|				= ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленногоУчетаТоваров.ПоПодразделению))
	|	И Движения.АналитикаФинансовогоУчета = НЕОПРЕДЕЛЕНО
	|";
	
	Если ПолучитьФункциональнуюОпцию("УчитыватьСебестоимостьТоваровПоВидамЗапасов") Тогда
		
		ТекстЗапросаНазначения = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|";
		
		ТекстЗапросаНазначения = ТекстЗапросаНазначения + "
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		Движения.Регистратор КАК Ссылка
		|	ИЗ
		|		РегистрНакопления.СебестоимостьТоваров КАК Движения
		|	ГДЕ
		|		Движения.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
		|		ИЛИ Движения.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		Движения.Регистратор КАК Ссылка
		|	ИЗ
		|		РегистрНакопления.СебестоимостьТоваров КАК Движения
		|	ГДЕ
		|		Движения.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
		|		И (ТИПЗНАЧЕНИЯ(Движения.АналитикаУчетаНоменклатуры.Склад) = ТИП(Справочник.Партнеры)
		|			ИЛИ ТИПЗНАЧЕНИЯ(Движения.АналитикаУчетаНоменклатуры.Склад) = ТИП(Справочник.Организации))
		|		И Движения.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
		|";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//%ТекстЗапросаВидыЗапасов", ТекстЗапросаНазначения);
		
	КонецЕсли;
	
	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяРегистра);
	
КонецПроцедуры

// Обработчик обновления УТ 11.4.1:
// - очищаются виды запасов для товаров выкупленных у комитента;
// - очищается кор. вид деятельности и аналитика учета по партнерам для управленческой организации.
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрНакопления.СебестоимостьТоваров";
	МетаданныеРегистра = Метаданные.РегистрыНакопления.СебестоимостьТоваров;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоДвижения = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = ПолноеИмяРегистра;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр(
		"ИспользоватьВидыЗапасов",
		ПолучитьФункциональнуюОпцию("УчитыватьСебестоимостьТоваровПоВидамЗапасов"));
	Запрос.УстановитьПараметр(
		"ДатаПереходаНаПартионныйУчетВерсии22",
		УниверсальныеМеханизмыПартийИСебестоимостиПовтИсп.ДатаПереходаНаПартионныйУчетВерсии22());
	Запрос.УстановитьПараметр(
		"ПартионныйУчетВерсии22",
		УниверсальныеМеханизмыПартийИСебестоимостиПовтИсп.ПартионныйУчетВерсии22(НачалоМесяца(ТекущаяДатаСеанса())));
	Запрос.УстановитьПараметр(
		"ФормироватьВидыЗапасовПоСделкам",
		ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоСделкам"));
	Запрос.УстановитьПараметр(
		"ФормироватьВидыЗапасовПоПодразделениямМенеджерам",
		ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоПодразделениямМенеджерам"));
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Движения.Период,
	|	Движения.Регистратор,
	|	Движения.ВидДвижения,
	|
	|	Движения.АналитикаУчетаНоменклатуры,
	
	|	ВЫБОР
	//++ НЕ УТ
	|		КОГДА &ПартионныйУчетВерсии22
	|				И Движения.Регистратор ССЫЛКА Документ.ОтчетПереработчика
	|				И Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И Движения.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|				И Движения.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчикаФиксированнаяСтоимость),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|				И Движения.Период >= &ДатаПереходаНаПартионныйУчетВерсии22
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		КОГДА &ПартионныйУчетВерсии22
	|				И Движения.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика
	|				И Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И Движения.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|				И Движения.Период >= &ДатаПереходаНаПартионныйУчетВерсии22
	|
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	//-- НЕ УТ
	|		КОГДА ИСТИНА
	|			ТОГДА Движения.РазделУчета
	|	КОНЕЦ КАК РазделУчета,
	
	|	ВЫБОР КОГДА &ИспользоватьВидыЗапасов
	|		И (((Ключи.Склад ССЫЛКА Справочник.Партнеры ИЛИ Ключи.Склад ССЫЛКА Справочник.Организации)
	|				И Движения.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|				И Движения.ВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка))
	|			ИЛИ Движения.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга))
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|		ИНАЧЕ Движения.ВидЗапасов
	|	КОНЕЦ КАК ВидЗапасов,
	|	Движения.Организация,
	|	Движения.Партия,
	|	Движения.АналитикаУчетаПартий,
	|	ВЫБОР
	|		КОГДА НЕ Движения.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути)
	|			ТОГДА Движения.АналитикаФинансовогоУчета
	|		КОГДА &ФормироватьВидыЗапасовПоСделкам
	|			И ЕСТЬNULL(Сделки.ОбособленныйУчетТоваровПоСделке, ЛОЖЬ)
	|			ТОГДА Реализации.Сделка
	|		КОГДА &ФормироватьВидыЗапасовПоПодразделениямМенеджерам
	|			И ЕСТЬNULL(СтруктураПредприятия.ВариантОбособленногоУчетаТоваров, ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленногоУчетаТоваров.ПустаяСсылка))
	|				= ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленногоУчетаТоваров.ПоМенеджерамПодразделения)
	|			ТОГДА Реализации.Менеджер
	|		КОГДА &ФормироватьВидыЗапасовПоПодразделениямМенеджерам
	|			И ЕСТЬNULL(СтруктураПредприятия.ВариантОбособленногоУчетаТоваров, ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленногоУчетаТоваров.ПустаяСсылка))
	|				= ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленногоУчетаТоваров.ПоПодразделению)
	|			ТОГДА Реализации.Подразделение
	|		ИНАЧЕ Движения.АналитикаФинансовогоУчета
	|	КОНЕЦ КАК АналитикаФинансовогоУчета,
	|	Движения.ВидДеятельностиНДС,
	|
	|	Движения.Количество,
	|	Движения.Стоимость,
	|	Движения.СтоимостьБезНДС,
	|	Движения.СтоимостьЗабалансовая,
	|	Движения.ДопРасходы,
	|	Движения.ДопРасходыБезНДС,
	|	Движения.Трудозатраты,
	|	Движения.ПостатейныеПостоянныеСНДС,
	|	Движения.ПостатейныеПостоянныеБезНДС,
	|	Движения.СтоимостьРегл,
	|	Движения.СтоимостьЗабалансоваяРегл,
	|	Движения.ДопРасходыРегл,
	|	Движения.ТрудозатратыРегл,
	|	Движения.ПостатейныеПостоянныеРегл,
	|	Движения.ПостояннаяРазница,
	|	Движения.ВременнаяРазница,
	|
	|	ВЫБОР
	|		КОГДА Движения.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииНаСклад),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииВПодразделение))
	//++ НЕ УТ
	|			И Движения.Регистратор Ссылка Документ.ПроизводствоБезЗаказа
	//-- НЕ УТ
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	//++ НЕ УТ
	|		КОГДА &ПартионныйУчетВерсии22
	|			И Движения.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			И Движения.Регистратор Ссылка Документ.ПоступлениеОтПереработчика
	|			И Движения.Период >= &ДатаПереходаНаПартионныйУчетВерсии22
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтПереработчика)
	//-- НЕ УТ
	|		ИНАЧЕ Движения.ХозяйственнаяОперация
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|	Движения.КорАналитикаУчетаНоменклатуры,
	|
	|	ВЫБОР
	//++ НЕ УТ
	|		КОГДА &ПартионныйУчетВерсии22
	|				И Движения.Регистратор ССЫЛКА Документ.ОтчетПереработчика
	|				И Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И Движения.КорРазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|				И Движения.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|				И Движения.Период >= &ДатаПереходаНаПартионныйУчетВерсии22
	|
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	//-- НЕ УТ
	|		КОГДА ИСТИНА
	|			ТОГДА Движения.КорРазделУчета
	|	КОНЕЦ КАК КорРазделУчета,
	|
	|	ВЫБОР КОГДА &ИспользоватьВидыЗапасов 
	|			И (((КорКлючи.Склад ССЫЛКА Справочник.Партнеры ИЛИ КорКлючи.Склад ССЫЛКА Справочник.Организации)
	|					И Движения.КорРазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|					И Движения.КорВидЗапасов <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка))
	|				ИЛИ Движения.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга))
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|		ИНАЧЕ Движения.КорВидЗапасов
	|	КОНЕЦ КАК КорВидЗапасов,
	|	Движения.КорОрганизация,
	|	Движения.КорСтоимость,
	|	ВЫБОР КОГДА Движения.Организация = ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка)
	|		ИНАЧЕ Движения.АналитикаУчетаПоПартнерам
	|	КОНЕЦ КАК АналитикаУчетаПоПартнерам,
	|	Движения.ЗаказКлиента,
	|	Движения.Подразделение,
	|	Движения.АналитикаРасходов,
	|	Движения.СтатьяРасходовСписания,
	|	Движения.СтатьяДоходов,
	|	Движения.АналитикаДоходов,
	|	Движения.ПериодПродажи,
	|	Движения.СтатьяАктивовПассивов,
	|	Движения.АналитикаАктивовПассивов,
	|	Движения.ДокументДвижения,
	|	Движения.ИдентификаторСтроки,
	|	Движения.ГруппаПродукции,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА Движения.РасчетПартий
	|	КОНЕЦ КАК РасчетПартий,
	|	Движения.РасчетСебестоимости,
	|	Движения.КорПартия,
	|	Движения.КорАналитикаУчетаПартий,
	|	Движения.КорАналитикаФинансовогоУчета,
	|	ВЫБОР КОГДА Движения.Организация = ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		ИНАЧЕ Движения.КорВидДеятельностиНДС
	|	КОНЕЦ КАК КорВидДеятельностиНДС,
	|	Движения.НДСРегл,
	//++ НЕ УТ
	|	ЕСТЬNULL(
	|		СтатьяКалькуляцииМатериалов.Ссылка,
	|		ЕСТЬNULL(
	|			СтатьяКалькуляцииОтходов.Ссылка,
	//-- НЕ УТ
	|			Движения.СтатьяКалькуляции
	//++ НЕ УТ
	|		)
	|	)
	//-- НЕ УТ
	|	КАК СтатьяКалькуляции,
	|	Движения.ТипЗаписи,
	|	Движения.ДокументИсточник,
	|	ВЫБОР
	//++ НЕ УТ
	|		КОГДА ПроизводствоБезЗаказа.Ссылка ЕСТЬ НЕ NULL
	|			И ПроизводствоБезЗаказа.ГруппировкаЗатрат В (ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВПроизводствеБезЗаказа.ПоПродукции),
	|														ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВПроизводствеБезЗаказа.ПоСпецификациям),
	|														ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВПроизводствеБезЗаказа.ПоДокументу),
	|														ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВПроизводствеБезЗаказа.ЗатратыНеУказываются))
	|			И НЕ ПроизводствоБезЗаказа.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			И НЕ ЕСТЬNULL(НазначенияПартийПроизводства.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) = ПроизводствоБезЗаказа.НаправлениеДеятельности
	|			И (Движения.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|				ИЛИ Движения.КорРазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство))
	|			ТОГДА НовыеАналитикиПартий.КлючАналитики
	//-- НЕ УТ
	|		КОГДА ИСТИНА
	|			ТОГДА Движения.АналитикаУчетаПартийПроизводства
	|		ИНАЧЕ Движения.АналитикаУчетаПартийПроизводства
	|	КОНЕЦ АналитикаУчетаПартийПроизводства,
	|	(ВЫБОР
	|		КОГДА (Движения.СтатьяРасходовСписания <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|		 ИЛИ Движения.СтатьяАктивовПассивов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка))
	|		 И Движения.КорНаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|		 И Назначения.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|			ТОГДА Назначения.НаправлениеДеятельности
	|		ИНАЧЕ Движения.КорНаправлениеДеятельности КОНЕЦ) КАК КорНаправлениеДеятельности
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Движения
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|	ПО Ключи.Ссылка = Движения.АналитикаУчетаНоменклатуры
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорКлючи
	|	ПО КорКлючи.Ссылка = Движения.КорАналитикаУчетаНоменклатуры
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО Назначения.Ссылка = Ключи.Назначение
	|
	//++ НЕ УТ
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатьиКалькуляции КАК СтатьяКалькуляцииМатериалов
	|	ПО &ПартионныйУчетВерсии22
	|		И СтатьяКалькуляцииМатериалов.УдалитьПредопределеннаяСтатьяМатериалов
	|		И Движения.Регистратор ССЫЛКА Документ.ОтчетПереработчика
	|		И Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Движения.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|		И Движения.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		И Движения.Период >= &ДатаПереходаНаПартионныйУчетВерсии22
	|		И (Движения.Количество > 0 ИЛИ Движения.Стоимость > 0)
	|
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатьиКалькуляции КАК СтатьяКалькуляцииОтходов
	|	ПО &ПартионныйУчетВерсии22
	|		И СтатьяКалькуляцииОтходов.УдалитьПредопределеннаяСтатьяВозвратныхОтходов
	|		И Движения.Регистратор ССЫЛКА Документ.ОтчетПереработчика
	|		И Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Движения.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|		И Движения.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		И Движения.Период >= &ДатаПереходаНаПартионныйУчетВерсии22
	|		И (Движения.Количество < 0 ИЛИ Движения.Стоимость < 0)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК ПроизводствоБезЗаказа
	|	ПО ПроизводствоБезЗаказа.Ссылка = Движения.Партия
	|		ИЛИ ПроизводствоБезЗаказа.Ссылка = Движения.КорПартия
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПартийПроизводства КАК АналитикиПартий
	|	ПО АналитикиПартий.КлючАналитики = Движения.АналитикаУчетаПартийПроизводства
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК НазначенияПартийПроизводства
	|	ПО НазначенияПартийПроизводства.Ссылка = АналитикиПартий.Назначение
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПартийПроизводства КАК НовыеАналитикиПартий
	|	ПО НовыеАналитикиПартий.Номенклатура = АналитикиПартий.Номенклатура
	|		И НовыеАналитикиПартий.Характеристика = АналитикиПартий.Характеристика
	|		И НовыеАналитикиПартий.Назначение = ПроизводствоБезЗаказа.НаправлениеДеятельности.Назначение
	|		И НовыеАналитикиПартий.Спецификация = АналитикиПартий.Спецификация
	|
	//-- НЕ УТ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализации
	|	ПО &ПартионныйУчетВерсии22
	|		И Движения.Период >= &ДатаПереходаНаПартионныйУчетВерсии22
	|		И Движения.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути)
	|		И Движения.Регистратор = Реализации.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|	ПО СтруктураПредприятия.Ссылка = Реализации.Подразделение
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СделкиСКлиентами КАК Сделки
	|	ПО Сделки.Ссылка = Реализации.Сделка
	|
	|ГДЕ
	|	Движения.Регистратор = &Регистратор
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|";
	
	Результат = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуРегистраторовРегистраДляОбработки(Параметры.Очередь, Неопределено, ПолноеИмяРегистра, МенеджерВременныхТаблиц);
	Если Не Результат.ЕстьДанныеДляОбработки Тогда
		
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
		
	КонецЕсли;
	
	ЗапросТипов = Новый Запрос;
	ЗапросТипов.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ЗапросТипов.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТИПЗНАЧЕНИЯ(ВТДляОбработкиСебестоимостьТоваров.Регистратор) КАК ТипРегистратора
		|ИЗ
		|	ВТДляОбработкиСебестоимостьТоваров КАК ВТДляОбработкиСебестоимостьТоваров";
	
	ВыборкаПоТипам = ЗапросТипов.Выполнить().Выбрать();
	
	Пока ВыборкаПоТипам.Следующий() Цикл
		
		ИмяТипаОбъекта = XMLТип(ВыборкаПоТипам.ТипРегистратора).ИмяТипа;
		ПолноеИмяДокумента = "Документ." + Сред(ИмяТипаОбъекта, Найти(ИмяТипаОбъекта, ".") +1);
		Выборка = ОбновлениеИнформационнойБазы.ВыбратьРегистраторыРегистраДляОбработки(Параметры.Очередь, ПолноеИмяДокумента, ПолноеИмяРегистра);
		
		Пока Выборка.Следующий() Цикл
			
			Регистратор = Выборка.Регистратор;
			
			НачатьТранзакцию();
			
			Попытка
				
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра + ".НаборЗаписей");
				ЭлементБлокировки.УстановитьЗначение("Регистратор", Регистратор);
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

				Блокировка.Заблокировать();
				
				Запрос.УстановитьПараметр("Регистратор", Регистратор);
				
				Результат = Запрос.Выполнить();
				
				Если Результат.Пустой() Тогда
					
					ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Регистратор, ДополнительныеПараметры);
					
				Иначе
					
					Набор = РегистрыНакопления.СебестоимостьТоваров.СоздатьНаборЗаписей();
					Набор.Отбор.Регистратор.Установить(Регистратор);
					Набор.Загрузить(Результат.Выгрузить());
					
					ОбновлениеИнформационнойБазы.ЗаписатьДанные(Набор);
					
				КонецЕсли;
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				
				ТекстСообщения = НСтр("ru = 'Не удалось обработать документ: %Регистратор% по причине: %Причина%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Регистратор%", Регистратор);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗаписьЖурналаРегистрации(
					ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Ошибка,
					Регистратор.Метаданные(),
					ТекстСообщения);
				
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
