////////////////////////////////////////////////////////////////////////////////
// Отражение зарплаты в учете
// Переопределяемое в пределах библиотеки поведение.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьВТУдержанияПоСотрудникамКонтрагент(МенеджерВременныхТаблиц) Экспорт

	ОтражениеЗарплатыВУчетеРасширенный.СоздатьВТУдержанияПоСотрудникамКонтрагент(МенеджерВременныхТаблиц);

КонецПроцедуры

Процедура ДополнитьТаблицуНДФЛ(ПериодРегистрации, Организация, МенеджерВременныхТаблиц) Экспорт

	ОтражениеЗарплатыВУчетеРасширенный.ДополнитьТаблицуНДФЛ(ПериодРегистрации, Организация, МенеджерВременныхТаблиц);

КонецПроцедуры

Процедура ДополнитьТаблицуНачислений(ПериодРегистрации, Организация, МенеджерВременныхТаблиц) Экспорт

	ОтражениеЗарплатыВУчетеРасширенный.ДополнитьТаблицуНачислений(ПериодРегистрации, Организация, МенеджерВременныхТаблиц);

КонецПроцедуры

Процедура ДополнитьТаблицуУдержаний(ПериодРегистрации, Организация, МенеджерВременныхТаблиц) Экспорт

	ОтражениеЗарплатыВУчетеРасширенный.ДополнитьТаблицуУдержаний(ПериодРегистрации, Организация, МенеджерВременныхТаблиц);

КонецПроцедуры

Процедура ДополнитьТаблицуРегламентированныеУдержания(ПериодРегистрации, Организация, МенеджерВременныхТаблиц) Экспорт

	ОтражениеЗарплатыВУчетеРасширенный.ДополнитьТаблицуРегламентированныеУдержания(ПериодРегистрации, Организация, МенеджерВременныхТаблиц);

КонецПроцедуры

Процедура ДополнитьМассивТиповНачисления(МассивТипов) Экспорт

	ОтражениеЗарплатыВУчетеРасширенный.ДополнитьМассивТиповНачисления(МассивТипов);
	
КонецПроцедуры

Функция ТипыПоляДокументОснование() Экспорт

	Возврат ОтражениеЗарплатыВУчетеРасширенный.ТипыПоляДокументОснование();

КонецФункции

Процедура ДополнитьТаблицуНачислениеУдержаниеВидОперации(Таблица, ПериодРегистрации = Неопределено) Экспорт

	// ЗУПК	
	ОтражениеЗарплатыВУчетеРасширенный.ДополнитьТаблицуНачислениеУдержаниеВидОперации(Таблица, ПериодРегистрации);
	// ЗУПК	

КонецПроцедуры

#КонецОбласти
