
Процедура ПриЗаписи(Отказ, Замещение)
	
	ЭКОМ_ОбменСеть      = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ОбменСеть"     , Ложь);
	ЭКОМ_ОбменПоставщик = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ОбменПоставщик", Ложь);
	ЭКОМ_ОбменЭТРН      = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ОбменЭТРН"     , Ложь);
	
	Если ЭКОМ_ОбменЭТРН = Истина Тогда		
		
		ИзменитьСтатусыДляЭТРН();
		
	КонецЕсли;
	
	Если ЭКОМ_ОбменСеть = Истина Тогда
		
		ИзменитьСтатусыДляСети();
		
	КонецЕсли;
	
	Если ЭКОМ_ОбменПоставщик = Истина Тогда
		
		ИзменитьСтатусыДляПоставщика();
		
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	ЭКОМ_ОбменСеть      = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ОбменСеть"     , Ложь);
	ЭКОМ_ОбменПоставщик = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ОбменПоставщик", Ложь);
	ЭКОМ_ОбменЭТРН      = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ОбменЭТРН"     , Ложь);
	
	Если ЭКОМ_ОбменПоставщик = Истина  Тогда
		
		Если ЭтотОбъект.Модифицированность() Тогда
			
			ИзменитьСтатусыДляПоставщика();
						
		КонецЕсли;	
		
	КонецЕсли;
	
	Если ЭКОМ_ОбменСеть = Истина Тогда
		
		Если ЭтотОбъект.Модифицированность() Тогда
			
			ИзменитьСтатусыДляСети();
						
		КонецЕсли;		
		
	КонецЕсли;	
	
	Если ЭКОМ_ОбменЭТРН = Истина Тогда
		
		Если ЭтотОбъект.Модифицированность() Тогда
			
			ИзменитьСтатусыДляЭТРН();
						
		КонецЕсли;		
		
	КонецЕсли;	

	
КонецПроцедуры

Процедура ИзменитьСтатусыДляПоставщика()
	
	Если НЕ Метаданные.РегистрыСведений.Найти("ЭКОМ_ЦепочкиДокументовПоставщика") = Неопределено Тогда
		
		ДанныеОтбора = Новый Структура;
		
		Для Каждого ТекущаяЗапись Из ЭтотОбъект Цикл
			
			ДанныеРесурсов = Новый Структура;
			ДанныеРесурсов.Вставить("Статус_Транспорт", Истина);
			
			ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента("ЭКОМ_ЦепочкиДокументовПоставщика", "Накладная", ТекущаяЗапись.Документ, ДанныеРесурсов, ДанныеОтбора);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьСтатусыДляСети()
	
		Если НЕ Метаданные.РегистрыСведений.Найти("ЭКОМ_ЦепочкиДокументовПокупателя") = Неопределено Тогда
			
			ДанныеОтбора = Новый Структура;
			
			Для Каждого ТекущаяЗапись Из ЭтотОбъект Цикл
				 				
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_Транспорт", Истина);
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента("ЭКОМ_ЦепочкиДокументовПокупателя", "Заказ", ТекущаяЗапись.Документ, ДанныеРесурсов, ДанныеОтбора);
					
			КонецЦикла;
			
		КонецЕсли;	
	
КонецПроцедуры

Процедура ИзменитьСтатусыДляЭТРН()
	
		Если НЕ Метаданные.РегистрыСведений.Найти("ЭКОМ_ЦепочкиДокументовЭТРН") = Неопределено Тогда
			
			ДанныеОтбора = Новый Структура;
			
			Для Каждого ТекущаяЗапись Из ЭтотОбъект Цикл
					
				ДанныеРесурсов = Новый Структура;
				ДанныеРесурсов.Вставить("Статус_Транспорт", Истина);
				
				Если ЗначениеЗаполнено(ТекущаяЗапись.Перевозчик) Тогда
				     ДанныеРесурсов.Вставить("Перевозчик", ТекущаяЗапись.Перевозчик);
				КонецЕсли;
				
				ЭКОМ_ОбщегоНазначения.ЗаписатьСтатусДокумента("ЭКОМ_ЦепочкиДокументовЭТРН", "Накладная", ТекущаяЗапись.Документ, ДанныеРесурсов, ДанныеОтбора);
											
			КонецЦикла;	
		КонецЕсли;	

КонецПроцедуры

