
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("НомерЗаказа", НомерЗаказа);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(НомерЗаказа) Тогда
		НомерЗаказа	= СокрЛП(ВладелецФормы.Объект.НомерПоДаннымКлиента);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаСервере
Процедура ЗапроситьКодНаСервере()
	
	КодОтправлен	= игр_ИнтеграцияКаспи.ОтправитьКодПокупателюНаВыдачу(СокрЛП(НомерЗаказа));
	Если КодОтправлен Тогда
		Элементы.Страницы.ТекущаяСтраница	= Элементы.СтраницаВыдачиЗаказа;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьКод(Команда)
	ЗапроситьКодНаСервере();
КонецПроцедуры

&НаСервере
Функция ВыдатьЗаказНаСервере()
	
	Возврат игр_ИнтеграцияКаспи.ИзменитьСтатусЗаказаВыдан(СокрЛП(НомерЗаказа), КодПодтверждения);
	
КонецФункции

&НаКлиенте
Процедура ВыдатьЗаказ(Команда)
	
	ЗаказВыдан	= ВыдатьЗаказНаСервере();
	Если ЗаказВыдан Тогда
		Элементы.Страницы.ТекущаяСтраница	= Элементы.СтраницаЗакрытия;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти