
#Область ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура игр_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	игр_ДобавитьКомандыФормы();
	игр_ДобавитьРеквизитыФормы();
	игр_ДобавитьИзменитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПриИзмененииигр_МаркетинговаяАкция(Элемент)
	ОбновитьВидимостьЗависимыхОтШаблонаПолей();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Подключаемый_ЗагрузитьИзМобильныхДанных(Команда)
	
	ПараметрыФормы	= Новый Структура;
	
	ОткрытьФорму("РегистрСведений.игр_ЖурналВходящихДанныхМобильноеПриложение.Форма.ФормаВыборПересчетаТоваров", 
		ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор,,, Новый ОписаниеОповещения("игр_ЗагрузитьИзМобильныхДанныхЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьПоАкции(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.игр_МаркетинговаяАкция) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Не выбрана маркетинговая акция';"));
		Возврат;
	КонецЕсли;

	игр_ЗаполнитьПоАкцииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДобавитьКодыМаркировки(Команда)
	
	ТекущиеДанные	= Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		ПоказатьВводСтроки(Новый ОписаниеОповещения("игр_ДобавитьКодыМаркировки_Завершение", ЭтотОбъект, ТекущиеДанные.ПолучитьИдентификатор())
			,,"Добавьте коды маркировки к строке",, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура игр_ДобавитьКодыМаркировки_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Текст	= Новый ТекстовыйДокумент;
		Текст.УстановитьТекст(Результат);
		НПП = 0;
		
		СтрокаОригинал	= Объект.Товары.НайтиПоИдентификатору(ДополнительныеПараметры);
		
		Пока НПП < Текст.КоличествоСтрок() Цикл
			
			НПП = НПП + 1;
			
			Код	= СокрЛП(Текст.ПолучитьСтроку(НПП));
			
			НоваяСтрока	= Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОригинал);
			
			НоваяСтрока.игр_КодМаркировки	= Код;
			
		КонецЦикла;

		Объект.Товары.Удалить(СтрокаОригинал);		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура игр_ЗагрузитьИзМобильныхДанныхЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		
		игр_ЗагрузитьИзМобильныхДанныхНаСервере(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура игр_ЗагрузитьИзМобильныхДанныхНаСервере(Адрес)
	
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда
		
		ТаблицаТоваров	= ПолучитьИзВременногоХранилища(Адрес);
		ДанныеДляЗагрузки = Новый Массив;
		Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
			
			Если СтрокаТаблицы.Количество > 0 Тогда
			
				ЭлементМассива	= Новый Массив;
				ЭлементМассива.Добавить(СтрокаТаблицы.Штрихкод);
				ЭлементМассива.Добавить(СтрокаТаблицы.Количество);
				
				ДанныеДляЗагрузки.Добавить(ЭлементМассива);
				
			КонецЕсли;			
			
		КонецЦикла;
		
		игр_ЗагрузитьДанныеНаСервере(ДанныеДляЗагрузки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура игр_ЗагрузитьДанныеНаСервере(Данные)
	
	Штрихкоды	= Новый Массив;
	КоличествоСоответствие	= Новый Соответствие;
	КэшированныеЗначения	= ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	Для Каждого Элемент Из Данные Цикл
		
		Попытка
			Штрихкод	= Элемент[0];
			Если ТипЗнч(Элемент[1]) = Тип("Строка") Тогда
				Количество	= Число(СтрЗаменить(Элемент[1]," ",""));
			Иначе
				Количество	= Элемент[1];
			КонецЕсли;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон("Ошибка при загрузке строки: %1", Элемент));
			Продолжить;
		КонецПопытки;
		
		Штрихкоды.Добавить(Штрихкод);
		Если КоличествоСоответствие[Штрихкод] = Неопределено Тогда
			КоличествоСоответствие.Вставить(Штрихкод, 0);
		КонецЕсли;
		КоличествоСоответствие[Штрихкод] = КоличествоСоответствие[Штрихкод] + Количество;
		
	КонецЦикла;
	
	РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьДанныеПоШтрихкодам(
		КэшированныеЗначения, Штрихкоды);
		
	Для Каждого Элемент Из Штрихкоды Цикл
		
		Описание	= КэшированныеЗначения.Штрихкоды[Элемент];
		Если Описание = Неопределено ИЛИ НЕ ЗначениеЗаполнено(Описание.Номенклатура) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон("Не найден штрихкод: %1", Элемент));
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока	= Объект.Товары.Добавить();
			
		НоваяСтрока.Номенклатура	= Описание.Номенклатура;
		НоваяСтрока.Характеристика	= Описание.Характеристика;
		НоваяСтрока.Штрихкод		= Элемент;
		НоваяСтрока.КоличествоЭтикеток	= 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура игр_ЗаполнитьПоАкцииНаСервере()
	
	Запрос	= Новый Запрос;
	Запрос.Текст = ТекстЗапросаЗаполнениеПоАкции(); 
	Запрос.УстановитьПараметр("Ссылка", Объект.игр_МаркетинговаяАкция);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока	= Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Если ЗначениеЗаполнено(НоваяСтрока.Характеристика) Тогда
			НоваяСтрока.ХарактеристикиИспользуются	= Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстЗапросаЗаполнениеПоАкции()
	
	ТекстЗапроса	= 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	игр_НоменклатураМаркетинговыхАкцийТовары.Номенклатура КАК Номенклатура,
	|	игр_НоменклатураМаркетинговыхАкцийТовары.Цена КАК Цена,
	|	игр_НоменклатураМаркетинговыхАкцийТовары.ПредыдущаяЦена КАК ЦенаДополнительно,
	|	1 КАК КоличествоЭтикеток,
	|	ЦеныНоменклатуры.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.игр_НоменклатураМаркетинговыхАкций.Товары КАК игр_НоменклатураМаркетинговыхАкцийТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО игр_НоменклатураМаркетинговыхАкцийТовары.Ссылка = ЦеныНоменклатуры.Регистратор
	|			И игр_НоменклатураМаркетинговыхАкцийТовары.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|ГДЕ
	|	игр_НоменклатураМаркетинговыхАкцийТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.Цена КАК Цена,
	|	ВТ_Товары.ЦенаДополнительно КАК ЦенаДополнительно,
	|	ВТ_Товары.КоличествоЭтикеток КАК КоличествоЭтикеток,
	|	ВТ_Товары.Характеристика КАК Характеристика,
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) КАК ОстатокНаСкладе
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО ВТ_Товары.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
	|			И ВТ_Товары.Характеристика = ШтрихкодыНоменклатуры.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ПО ВТ_Товары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И ВТ_Товары.Характеристика = ТоварыНаСкладахОстатки.Характеристика"
	;
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Процедура игр_ДобавитьИзменитьРеквизиты()
	
	ДобавляемыеРеквизиты	= Новый Массив;
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("игр_Цена", ОбщегоНазначения.ОписаниеТипаЧисло(15,2), "Объект.Товары", "Цена"));
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
КонецПроцедуры

&НаСервере
Процедура игр_ДобавитьКомандыФормы() 
	
	НоваяКоманда	= Команды.Добавить("игр_ЗагрузитьМобильныхДанных");
	НоваяКоманда.Действие	= "Подключаемый_ЗагрузитьИзМобильныхДанных";
	НоваяКоманда.Заголовок	= "Загрузить из мобильных данных";

	НоваяКоманда	= Команды.Добавить("игр_ЗаполнитьПоАкции");
	НоваяКоманда.Действие	= "Подключаемый_ЗаполнитьПоАкции";
	НоваяКоманда.Заголовок	= "Заполнить по маркетинговой акции";

	НоваяКоманда	= Команды.Добавить("игр_ДобавитьКодыМаркировки");
	НоваяКоманда.Действие	= "Подключаемый_ДобавитьКодыМаркировки";
	НоваяКоманда.Заголовок	= "Добавить коды маркировки";
	
КонецПроцедуры

&НаСервере
Процедура игр_ДобавитьИзменитьЭлементыФормы() 
	
	НовыйЭлемент	= Элементы.Добавить("игр_ЗагрузитьМобильныхДанных", Тип("КнопкаФормы"), Элементы.ДобавитьТовары);
	НовыйЭлемент.Вид		= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды	= "игр_ЗагрузитьМобильныхДанных";
	
	НовыйЭлемент	= Элементы.Добавить("игр_МаркетинговаяАкция", Тип("ПолеФормы"), Элементы.ГруппаЦены);
	НовыйЭлемент.Вид			= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным	= "Объект.игр_МаркетинговаяАкция";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПриИзмененииигр_МаркетинговаяАкция");

	НовыйЭлемент	= Элементы.Добавить("игр_ЗаполнитьПоАкции", Тип("КнопкаФормы"), Элементы.ДобавитьТовары);
	НовыйЭлемент.Вид		= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды	= "игр_ЗаполнитьПоАкции";

	НовыйЭлемент	= Элементы.Добавить("игр_ДобавитьКодыМаркировки", Тип("КнопкаФормы"), Элементы.ДобавитьТовары);
	НовыйЭлемент.Вид		= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды	= "игр_ДобавитьКодыМаркировки";
	
	НовыйЭлемент	= Элементы.Добавить("игр_КодМаркировки", Тип("ПолеФормы"), Элементы.Товары);
	НовыйЭлемент.Вид			= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным	= "Объект.Товары.игр_КодМаркировки";
	
КонецПроцедуры  

&НаСервере
Процедура игр_ДобавитьРеквизитыФормы() 
	
	ДобавленныеРеквизиты	= Новый Массив;
	
	ДобавленныеРеквизиты.Добавить(Новый РеквизитФормы("игр_КодМаркировки", ОбщегоНазначения.ОписаниеТипаСтрока(1000),
		"Объект.Товары", "Код маркировки"));
	
	ИзменитьРеквизиты(ДобавленныеРеквизиты);
	
КонецПроцедуры


&НаСервере
&ИзменениеИКонтроль("ОбновитьВидимостьЗависимыхОтШаблонаПолей")
Процедура игр_ОбновитьВидимостьЗависимыхОтШаблонаПолей()

	Если ШаблоныВлияющиеНаВидимостьЭлементов = Неопределено Тогда
		ОбновитьШаблоныВлияющиеНаВидимостьЭлементов();
	КонецЕсли;

	Если Режим = "ПечатьЭтикеток" Или Режим = "ПечатьЭтикетокИЦенников" Тогда
		Шаблоны = Объект.Товары.Выгрузить(, "ШаблонЭтикетки").ВыгрузитьКолонку("ШаблонЭтикетки");
	Иначе
		Шаблоны = Новый Массив;
	КонецЕсли;
	Если Режим = "ПечатьЦенников" Или Режим = "ПечатьЭтикетокИЦенников" Тогда
		Ценники = Объект.Товары.Выгрузить(, "ШаблонЦенника").ВыгрузитьКолонку("ШаблонЦенника");
		Для Каждого Шаблон Из Ценники Цикл
			Если Шаблоны.Найти(Шаблон) = Неопределено Тогда
				Шаблоны.Добавить(Шаблон);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	ИспользоватьВидЦеныДополнительно = Ложь;
	ВидимостьПравилоОбмена = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		Если ШаблоныВлияющиеНаВидимостьЭлементов.ВидЦеныДополнительно.Найти(Шаблон) <> Неопределено Тогда
			ИспользоватьВидЦеныДополнительно = Истина;
		КонецЕсли;
		Если ШаблоныВлияющиеНаВидимостьЭлементов.ПравилоОбмена.Найти(Шаблон) <> Неопределено Тогда
			ВидимостьПравилоОбмена = Истина;
		КонецЕсли;
	КонецЦикла;

	Элементы.ВидЦеныДополнительно.Видимость     = ИспользоватьВидЦеныДополнительно;
	Элементы.ДатаВидЦеныДополнительно.Видимость = ИспользоватьВидЦеныДополнительно;
	#Удаление
	Элементы.ТоварыЦенаДополнительно.Видимость  = ИспользоватьВидЦеныДополнительно;
	#КонецУдаления
	#Вставка
	Элементы.ТоварыЦенаДополнительно.Видимость  = ИспользоватьВидЦеныДополнительно ИЛИ ЗначениеЗаполнено(Объект.игр_МаркетинговаяАкция);
	#КонецВставки
	Элементы.ПравилоОбмена.Видимость            = ВидимостьПравилоОбмена;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПолучитьПараметры")
Функция игр_ПолучитьПараметры()

	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Товары.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Товары.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	Товары.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("ЦенаДополнительно", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка"));
	Товары.Колонки.Добавить("ШаблонЦенника", Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников"));
	Товары.Колонки.Добавить("КоличествоЦенников", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("ШаблонЭтикетки", Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников"));
	Товары.Колонки.Добавить("ШаблонЭтикеткиПодготовлено", Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников"));
	Товары.Колонки.Добавить("КоличествоЭтикеток", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("ОстатокНаСкладе", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("КоличествоВДокументе", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("Весовой", Новый ОписаниеТипов("Булево"));
	Товары.Колонки.Добавить("ДатаПоследнегоИзмененияЦены", Новый ОписаниеТипов("Дата"));
	Товары.Колонки.Добавить("ДатаПоследнегоИзмененияЦеныДополнительно", Новый ОписаниеТипов("Дата"));
	#Вставка
	Товары.Колонки.Добавить("игр_КодМаркировки", Новый ОписаниеТипов("Строка"));
	#КонецВставки

	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		Если Не СтрокаТЧ.Выбран Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.ШаблонЭтикетки) Тогда
			НоваяСтрока.КоличествоЭтикеток = 0;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.ШаблонЦенника) Тогда
			НоваяСтрока.КоличествоЦенников = 0;
		КонецЕсли;
	КонецЦикла;

	МаксимальныйКодВесовогоТовара = ПодключаемоеОборудованиеOfflineВызовСервера.МаксимальныйКодВесовогоТовара();
	УстановитьПривилегированныйРежим(Истина);
	ПравилоВыгрузкиВВесы = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПравилоОбмена, "ТипПодключаемогоОборудования") = Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток);
	УстановитьПривилегированныйРежим(Ложь);

	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("Товары", ПоместитьВоВременноеХранилище(Товары, УникальныйИдентификатор));
	ПараметрыПечати.Вставить("Организация",   Объект.Организация);
	ПараметрыПечати.Вставить("ПравилоОбмена", Объект.ПравилоОбмена);
	ПараметрыПечати.Вставить("МаксимальныйКодВесовогоТовара", МаксимальныйКодВесовогоТовара);
	ПараметрыПечати.Вставить("ПравилоВыгрузкиВВесы",          ПравилоВыгрузкиВВесы);
	ПараметрыПечати.Вставить("ВидЦены",       Объект.ВидЦены);
	ПараметрыПечати.Вставить("Дата",          Объект.Дата);
	ПараметрыПечати.Вставить("Склад",         Объект.Склад);
	ПараметрыПечати.Вставить("ВидЦеныДополнительно", Объект.ВидЦеныДополнительно);
	ПараметрыПечати.Вставить("ДатаДополнительно",    Объект.ДатаДополнительно);
	ПараметрыПечати.Вставить("СтруктураМакетаШаблона", Неопределено);

	Возврат ПараметрыПечати;

КонецФункции

#КонецОбласти