////////////////////////////////////////////////////////////////////////////////
// Отражение зарплаты в регламентированном учете.
// Переопределяемое в потребителе поведение.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция предназначена для вычисления процента ЕНВД в текущем месяце по данным бухгалтерского учета.
// 
//
//	Параметры:
//	 Организация - СправочникСсылка.Организации,
//	 ПериодРегистрации - Дата, состав дата.
//
//	Возвращаемое значение:
//		Число или Неопределено
//
Функция ПроцентЕНВД(Организация, ПериодРегистрации) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

// Процедура предназначена для формирования движений по бухучету.
//
// Параметры:
//	Движения - Коллекция движений документа, 
//	Отказ - булево, признак отказа от проведения документа.
//	Организация
//	МесяцНачисления - тип Дата, месяц, зарплата которого отражается в бухучете.
//	ДанныеДляОтражения - структура. Таблицы значений с данными, которые 
//						могут использоваться для формирования движений по бухучету.
//						При вызове процедуры ДанныеДляОтражения может содержать 
//						одно или несколько полей с приведенными ниже именами, т.е.
//						Необходимо проверять наличие того или иного элемента структуры.
//
//		Имена полей структуры ДанныеДляОтражения (таблиц значений):
//			НачисленнаяЗарплатаИВзносы
//			НачисленныйНДФЛ
//			УдержаннаяЗарплата
//			ОценочныеОбязательства - эта таблица формируется документом НачислениеОценочныхОбязательствПоОтпускам
//			Депоненты - эта таблица формируется документом Депонирование.
//
//		Структура таблиц значений:
//			НачисленнаяЗарплатаИВзносы.
//				ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//				Подразделение  - СправочникСсылка.ПодразделенияОрганизаций
//				ВидОперации    - ПеречислениеСсылка.ВидыОперацийПоЗарплате
//				СпособОтраженияЗарплатыВБухучете- СправочникСсылка.СпособыОтраженияЗарплатыВБухУчете
//				ОблагаетсяЕНВД - булево
//				ПериодПринятияРасходов - Дата, для учета РБП, определяет месяц, к которому относятся расходы. Передается дата
//				                         начала месяца.
//				ВидНачисленияОплатыТрудаДляНУ - ПеречислениеСсылка.ВидыНачисленийОплатыТрудаДляНУ
//				Сумма - Число 15.2
//				ПФРПоСуммарномуТарифу - Число 15.2
//				ПФРСПревышения - Число 15.2
//				ПФРСтраховая - Число 15.2
//				ПФРНакопительная - Число 15.2
//				ФСС - Число 15.2
//				ФФОМС - Число 15.2
//				ТФОМС - Число 15.2
//				ПФРНаДоплатуЛетчикам - Число 15.2
//				ПФРНаДоплатуШахтерам - Число 15.2
//				ПФРЗаЗанятыхНаПодземныхИВредныхРаботах - Число 15.2
//				ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах - Число 15.2
//				ФССНесчастныеСлучаи - Число 15.2.
//				
//			НачисленныйНДФЛ
//				ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//				ВидОперации    - ПеречислениеСсылка.ВидыОперацийПоЗарплате
//				КодПоОКАТО     - Строка, 11
//				КодПоОКТМО     - Строка, 11
//				КПП   - Строка, 9
//				КодНалоговогоОргана - Строка, 4
//				Сумма - Число 15.2
//				РегистрацияВНалоговомОргане - СправочникСсылка.РегистрацияВНалоговомОргане
//												поле может быть не заполнено, тогда регистрацию надо вычислять по КодПоОКАТО,КодПоОКТМО,КПП,КодНалоговогоОргана.
//				
//			УдержаннаяЗарплата
//				ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//				Подразделение  - СправочникСсылка.ПодразделенияОрганизаций
//				ВидОперации    - ПеречислениеСсылка.ВидыОперацийПоЗарплате
//				Контрагент     - СправочникСсылка.Контрагенты, контрагент, в пользу которого произведено удержание.
//				Сумма - Число 15.2.
//				
//			ОценочныеОбязательства
//				Подразделение  - СправочникСсылка.ПодразделенияОрганизаций
//				СпособОтраженияЗарплатыВБухучете- СправочникСсылка.СпособыОтраженияЗарплатыВБухУчете
//				СуммаРезерва - Число 15.2
//				СуммаРезерваСтраховыхВзносов - Число 15.2
//				СуммаРезерваНУ - Число 15.2
//				СуммаРезерваСтраховыхВзносовНУ - Число 15.2
//				СуммаРезерваФССНесчастныеСлучаи - Число 15.2
//				СуммаРезерваФССНесчастныеСлучаиНУ - Число 15.2.
//                             
Процедура СформироватьДвижения(Движения, Отказ, Организация, МесяцНачисления, ДанныеДляОтражения) Экспорт
	
КонецПроцедуры

// Процедура предназначена для корректировки движений в зависимости от кадровых данных
// для корректного заполнения в УПК
Процедура СкорректироватьВТСтраховыеВзносыСУчетомКадровыхДанных(ТекстЗапроса, МенеджерВременныхТаблиц, Организация, ПериодРегистрации) Экспорт
		
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.Организация      = Организация;
	ПараметрыПолучения.НачалоПериода    = НачалоМесяца(ПериодРегистрации);
	ПараметрыПолучения.ОкончаниеПериода = КонецМесяца(ПериодРегистрации);
	ТаблицаСотрудников = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолучения);
	Сотрудники = ТаблицаСотрудников.ВыгрузитьКолонку("Сотрудник");
	
	ПараметрыДляЗапросВТРабочиеМестаСотрудниковПоСпискуСотрудников = КадровыйУчет.ПараметрыДляЗапросВТРабочиеМестаСотрудниковПоСпискуСотрудников(Сотрудники, НачалоМесяца(ПериодРегистрации), КонецМесяца(ПериодРегистрации));	
	ПараметрыДляЗапросВТРабочиеМестаСотрудниковПоСпискуСотрудников.Организация = Организация;
	КадровыйУчет.СоздатьВТРабочиеМестаСотрудников(МенеджерВременныхТаблиц, Истина, ПараметрыДляЗапросВТРабочиеМестаСотрудниковПоСпискуСотрудников, "ВТКадроваяИсторияОбщая");
			
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ	
	|	КадроваяИстория.Сотрудник КАК Сотрудник,
	|   КадроваяИстория.Подразделение КАК Подразделение,
	|   МИНИМУМ(НАЧАЛОПЕРИОДА(КадроваяИстория.Период, ДЕНЬ)) КАК Период
	|ПОМЕСТИТЬ ВТКадроваяИстория
	|ИЗ
	|	ВТКадроваяИсторияОбщая КАК КадроваяИстория 
	|
	|ГДЕ
	// интересуют только кадровые перемещения в пределах месяца
	|	КадроваяИстория.ДатаНачала МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) 
	|
	|СГРУППИРОВАТЬ ПО 
	|	КадроваяИстория.Сотрудник,
	|   КадроваяИстория.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтраховыеВзносы.Организация,
	|	СтраховыеВзносы.ФизическоеЛицо,
	|	СтраховыеВзносы.Сотрудник,
	|	СтраховыеВзносы.Подразделение,
	|	СтраховыеВзносы.Начисление,
	|	СУММА(0) КАК ПоляВзносов,
	|	СтраховыеВзносы.ОблагаетсяЕНВД,
	|	0 КАК СН,
	|	0 КАК СО,
	|	0 КАК ОППВ,
	|	0 КАК ООСМС,
	|	СтраховыеВзносы.ДатаНачала
	|ПОМЕСТИТЬ ВТСтраховыеВзносы
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыПоФизическимЛицам КАК СтраховыеВзносы
	|ГДЕ
	|	СтраховыеВзносы.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(СтраховыеВзносы.Период, МЕСЯЦ) = &ПериодРегистрации
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносы.Подразделение,
	|	СтраховыеВзносы.Сотрудник,
	|	СтраховыеВзносы.ФизическоеЛицо,
	|	СтраховыеВзносы.Организация,
	|	СтраховыеВзносы.ОблагаетсяЕНВД,
	|	СтраховыеВзносы.ДатаНачала,
	|	СтраховыеВзносы.Начисление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СведенияОбИсчисленииНалоговВзносовОтчислений.Организация,
	|	СведенияОбИсчисленииНалоговВзносовОтчислений.ФизическоеЛицо,
	|	СведенияОбИсчисленииНалоговВзносовОтчислений.Сотрудник,
	|	СведенияОбИсчисленииНалоговВзносовОтчислений.Подразделение,
	|	СведенияОбИсчисленииНалоговВзносовОтчислений.Начисление,
	|	0 КАК ПоляВзносов,
	|	ЛОЖЬ,
	|	СУММА(СведенияОбИсчисленииНалоговВзносовОтчислений.СН),
	|	СУММА(СведенияОбИсчисленииНалоговВзносовОтчислений.СО),
	|	СУММА(СведенияОбИсчисленииНалоговВзносовОтчислений.ОППВ),
	|	СУММА(СведенияОбИсчисленииНалоговВзносовОтчислений.ООСМС),
	|	ВЫБОР
	|		КОГДА КадроваяИстория.Подразделение ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(СведенияОбИсчисленииНалоговВзносовОтчислений.Период, МЕСЯЦ)
	|		ИНАЧЕ КадроваяИстория.Период
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.НалогиВзносыОтчисленияПоСотрудникам КАК СведенияОбИсчисленииНалоговВзносовОтчислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадроваяИстория КАК КадроваяИстория 
	|       ПО СведенияОбИсчисленииНалоговВзносовОтчислений.Сотрудник = КадроваяИстория.Сотрудник
	|       	И СведенияОбИсчисленииНалоговВзносовОтчислений.Подразделение = КадроваяИстория.Подразделение 
	|
	|ГДЕ
	|	СведенияОбИсчисленииНалоговВзносовОтчислений.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(СведенияОбИсчисленииНалоговВзносовОтчислений.Период, МЕСЯЦ) = &ПериодРегистрации
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОбИсчисленииНалоговВзносовОтчислений.Организация,
	|	СведенияОбИсчисленииНалоговВзносовОтчислений.ФизическоеЛицо,
	|	СведенияОбИсчисленииНалоговВзносовОтчислений.Сотрудник,
	|	СведенияОбИсчисленииНалоговВзносовОтчислений.Подразделение,
	|	СведенияОбИсчисленииНалоговВзносовОтчислений.Начисление,
	|	ВЫБОР
	|		КОГДА КадроваяИстория.Подразделение ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(СведенияОбИсчисленииНалоговВзносовОтчислений.Период, МЕСЯЦ)
	|		ИНАЧЕ КадроваяИстория.Период
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТКадроваяИсторияОбщая 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТКадроваяИстория	
	|";
	
КонецПроцедуры

Процедура ДанныеДляОтраженияЗарплатыВБухучете(ДанныеДляОтражения, Организация, ПериодРегистрации) Экспорт
	
	Если  НЕ ЗарплатаКадры.ИспользоватьСтатьиФинансированияЗарплата() Тогда
		ДанныеДляОтражения.Вставить("ОборотПоПриобретеннымУслугамГПХВЦеляхНДС", НоваяТаблицаОборотПоПриобретеннымУслугамГПХВЦеляхНДС());
		ТаблицаОборотПоПриобретеннымУслугамГПХВЦеляхНДС = ДанныеДляОтраженияВБухучетеОборотПоПриобретеннымУслугамГПХВЦеляхНДС(Организация, ПериодРегистрации);
		ДанныеДляОтражения.ОборотПоПриобретеннымУслугамГПХВЦеляхНДС = ТаблицаОборотПоПриобретеннымУслугамГПХВЦеляхНДС;
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеДляОтраженияВБухучетеОборотПоПриобретеннымУслугамГПХВЦеляхНДС(Организация, ПериодРегистрации) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	СозатьВТОборотПоПриобретеннымУслугамГПХВЦеляхНДС(МенеджерВременныхТаблиц, Организация, ПериодРегистрации);
	Возврат ТаблицаОборотПоПриобретеннымУслугамГПХВЦеляхНДСДляОтражениеВУчете(МенеджерВременныхТаблиц);
	
КонецФункции

Процедура СозатьВТОборотПоПриобретеннымУслугамГПХВЦеляхНДС(МенеджерВременныхТаблиц, Организация, ПериодРегистрации)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ПараметрыУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаОрганизаций.ПараметрыУчетнойПолитики(Организация, НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("ПрименяетсяУчетНДСПоФактическомуИспользованию", ?(ПараметрыУчетнойПолитики = Неопределено, Ложь, ПараметрыУчетнойПолитики.ПрименяетсяУчетНДСПоФактическомуИспользованию));
	Запрос.УстановитьПараметр("ИспользоватьРаздельныйУчетПоНалогообложению", ПолучитьФункциональнуюОпцию("ИспользоватьРаздельныйУчетПоНалогообложению"));
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Начисления.ДокументОснование = НЕОПРЕДЕЛЕНО
	|			ТОГДА Начисления.Регистратор
	|		ИНАЧЕ Начисления.ДокументОснование
	|	КОНЕЦ КАК ДокументРегистрацииДохода,
	|	НАЧАЛОПЕРИОДА(Начисления.Период, МЕСЯЦ) КАК ДатаНачала,
	|	Начисления.Организация КАК Организация,
	|	Начисления.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СУММА(Начисления.Сумма) КАК Сумма,
	|	ЕСТЬNULL(СоответствияФизЛицКонтрагентам.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
	|	ЕСТЬNULL(СоответствияФизЛицКонтрагентам.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
	|	ВЫБОР
	|		КОГДА &ИспользоватьРаздельныйУчетПоНалогообложению
	|			ТОГДА ВЫБОР
	|					КОГДА &ПрименяетсяУчетНДСПоФактическомуИспользованию = ЛОЖЬ
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОборотовПоРеализации.Облагаемый)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОборотовПоРеализации.Общий)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОборотовПоРеализации.Общий)
	|	КОНЕЦ КАК ВидОборота,
	|	ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС) КАК СтавкаНДС,
	|	ЗНАЧЕНИЕ(Справочник.ВидыПоступления.ПриобретениеТМЗБезНДС) КАК ВидОперацииПоступления
	|ПОМЕСТИТЬ ВТТаблицаОборотПоПриобретеннымУслугамГПХВЦеляхНДС
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствияФизЛицКонтрагентамПоДоговорамГПХ.СрезПоследних(&НачалоПериода, ) КАК СоответствияФизЛицКонтрагентам
	|		ПО Начисления.Организация = СоответствияФизЛицКонтрагентам.Организация
	|			И Начисления.ФизическоеЛицо = СоответствияФизЛицКонтрагентам.ФизическоеЛицо
	|ГДЕ
	|	Начисления.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Начисления.Организация = &Организация
	|	И (ТИПЗНАЧЕНИЯ(Начисления.НачислениеУдержание) = ТИП(Справочник.ВидыПрочихДоходовФизическихЛиц)
	|			ИЛИ (ВЫРАЗИТЬ(Начисления.НачислениеУдержание КАК Перечисление.ВидыОсобыхНачисленийИУдержаний)) = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорАвторскогоЗаказа)
	|			ИЛИ (ВЫРАЗИТЬ(Начисления.НачислениеУдержание КАК Перечисление.ВидыОсобыхНачисленийИУдержаний)) = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорРаботыУслуги))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА Начисления.ДокументОснование = НЕОПРЕДЕЛЕНО
	|			ТОГДА Начисления.Регистратор
	|		ИНАЧЕ Начисления.ДокументОснование
	|	КОНЕЦ,
	|	Начисления.Организация,
	|	НАЧАЛОПЕРИОДА(Начисления.Период, МЕСЯЦ),
	|	Начисления.ФизическоеЛицо,
	|	ЕСТЬNULL(СоответствияФизЛицКонтрагентам.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)),
	|	ЕСТЬNULL(СоответствияФизЛицКонтрагентам.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ТаблицаОборотПоПриобретеннымУслугамГПХВЦеляхНДСДляОтражениеВУчете(МенеджерВременныхТаблиц)
	
	ТаблицаОборотПоПриобретеннымУслугамГПХВЦеляхНДС = НоваяТаблицаОборотПоПриобретеннымУслугамГПХВЦеляхНДС();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОборотГПХВЦеляхНДС.ДокументРегистрацииДохода КАК ДокументРегистрацииДохода,
	|	ОборотГПХВЦеляхНДС.ДатаНачала КАК ДатаНачала,
	|	ОборотГПХВЦеляхНДС.Организация КАК Организация,
	|	ОборотГПХВЦеляхНДС.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ОборотГПХВЦеляхНДС.Сумма КАК Сумма,
	|	ОборотГПХВЦеляхНДС.Контрагент КАК Контрагент,
	|	ОборотГПХВЦеляхНДС.Договор КАК Договор,
	|	ОборотГПХВЦеляхНДС.ВидОборота КАК ВидОборота,
	|	ОборотГПХВЦеляхНДС.СтавкаНДС КАК СтавкаНДС,
	|	ОборотГПХВЦеляхНДС.ВидОперацииПоступления КАК ВидОперацииПоступления
	|ИЗ
	|	ВТТаблицаОборотПоПриобретеннымУслугамГПХВЦеляхНДС КАК ОборотГПХВЦеляхНДС
	|ГДЕ
	|	ОборотГПХВЦеляхНДС.Сумма <> 0";

	Результат = Запрос.Выполнить().Выгрузить();
	ОтражениеЗарплатыВУчете.ДобавитьКолонкуИдентификаторСтроки(Результат);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Результат, ТаблицаОборотПоПриобретеннымУслугамГПХВЦеляхНДС);
	
	Возврат ТаблицаОборотПоПриобретеннымУслугамГПХВЦеляхНДС;
	
КонецФункции

Функция НоваяТаблицаОборотПоПриобретеннымУслугамГПХВЦеляхНДС() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Таблица.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	Таблица.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	Таблица.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	Таблица.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	Таблица.Колонки.Добавить("ВидОперацииПоступления", Новый ОписаниеТипов("СправочникСсылка.ВидыПоступления"));
	Таблица.Колонки.Добавить("ВидОборота", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОборотовПоРеализации"));
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.РегистрацияПрочихДоходов"));
	МассивТипов.Добавить(Тип("ДокументСсылка.НачислениеПоДоговорам"));
	МассивТипов.Добавить(Тип("ДокументСсылка.НачислениеЗарплаты"));
	Таблица.Колонки.Добавить("ДокументРегистрацииДохода", Новый ОписаниеТипов(МассивТипов));
	Таблица.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
	Таблица.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	
	Возврат Таблица;
	
КонецФункции

#КонецОбласти
