
#Область СлужебныйПрограммныйИнтерфейс

#Область ДатыЗапретаИзмененияДанных

// См. ДатыЗапретаИзмененияПереопределяемый.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения.
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	// Раздел Зарплата
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.МесячныйРасчетныйПоказатель",							"Период",				"Зарплата", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.РасчетСреднегоЗаработкаОрганизаций", 					"Период", 				"Зарплата", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.РасчетСреднегоЗаработкаПодразделений", 				"Период", 				"Зарплата", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.РасчетСреднегоЗаработкаСотрудников", 					"Период", 				"Зарплата", "");
	
	// Раздел НалогиВзносыОтчисления
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаявлениеНаПредоставлениеВычетовИПН", 						"Месяц", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПрекращениеПредоставленияВычетовИПН", 						"Месяц", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВедомостьНаПеречислениеВзносовОтчислений", 					"ПериодРегистрации", 	"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СведенияОНезачисленныхВзносахОтчислениях", 					"Дата", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеняПоВзносамИОтчислениям", 									"ПериодРегистрации",	"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УдержаниеНалоговВзносовПоНУ", 								"ПериодРегистрации",	"НДФЛ", "Организация");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СтатусФизическихЛицКакНалогоплательщиков",			"Период", 				"НДФЛ", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ВычетыФизическихЛицИПН", 								"Период", 				"НДФЛ", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПрименениеВычетовИПН",			 					"Период", 				"НДФЛ", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ЛьготыФизическихЛицИПН",			 					"Период", 				"НДФЛ", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПрочиеВычетыФизическихЛицИПН", 						"Период", 				"НДФЛ", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.НалогообложениеНачислений", 							"Период", 				"НДФЛ", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПорядокОкругленияРезультатовРасчетаЗарплаты", 		"Период", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СведенияОПенсионномОбеспеченииФизическихЛиц", 		"Период", 				"НДФЛ", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СведенияОСтавкахИПН", 								"Период", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СведенияОСтавкахНалоговСборовОтчислений", 			"Период", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СведенияОСтавкахОСМС", 								"Период", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СведенияОФизическихЛицахУчастникахВОВ", 				"Период", 				"НДФЛ", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СрокиПеречисленияВзносовИОтчислений", 				"Период", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.КоэффициентыСтавкиРефинансированияНБ", 				"Период", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.РазмерыВычетовИПН", 									"Период", 				"НДФЛ", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.РазмерыДоходовНеПодлежащихНалогообложениюЧастично", 	"Период", 				"НДФЛ", "");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.НалогиВзносыОтчисленияПоСотрудникам",			 	"Период", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами", 	"Период", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.НалогиВзносыРасчетыНалогоплательщиков",				"Период", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.СведенияОбИсчисленииНалоговВзносовОтчислений",		"ПериодРегистрации", 	"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.СведенияОДоходахФизическихЛиц",			 			"ПериодРегистрации", 	"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.СведенияОбИсчисленииВычетовИПН",			 		"ПериодРегистрации", 	"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ПениПоВзносамИОтчислениям",			 				"Период", 				"НДФЛ", "Организация");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СоответствиеРеквизитовНаРусскомИГосударственномЯзыках","Период", 				"", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.УчетнаяПолитикаПоНалоговомуУчету",					"Период", 				"", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ДополнениеРасчетнойБазыУдержаний",					"Период", 				"", "Организация");
   	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.УчетнаяПолитикаЗарплатаКадры",					    "Период", 				"", "Организация");
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.ВедомостьНаПеречислениеВзносовОтчислений);
	СписокОбъектов.Добавить(Документы.ЗаявлениеНаПредоставлениеВычетовИПН);
	СписокОбъектов.Добавить(Документы.ПрекращениеПредоставленияВычетовИПН);
	СписокОбъектов.Добавить(Документы.ПеняПоВзносамИОтчислениям);
	СписокОбъектов.Добавить(Документы.СведенияОНезачисленныхВзносахОтчислениях);
	// ЗУПК
	//СписокОбъектов.Добавить(Документы.ПеречислениеВзносовИОтчислений);
	//СписокОбъектов.Добавить(Документы.ПеречислениеНалоговВБюджет);

КонецПроцедуры

#КонецОбласти

Функция ВидыСплошнойРегистрацииПоНормеВремени() Экспорт 
	
	ВидыВремени = Новый Массив;
	
	Болезнь = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.Болезнь");
	Если ЗначениеЗаполнено(Болезнь) Тогда
		ВидыВремени.Добавить(Болезнь);
	КонецЕсли;	
	
	ОсновнойОтпуск = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.ОсновнойОтпуск");
	Если ЗначениеЗаполнено(ОсновнойОтпуск) Тогда
		ВидыВремени.Добавить(ОсновнойОтпуск);
	КонецЕсли;	

	ДополнительныйОтпуск = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.ДополнительныйОтпуск");
	Если ЗначениеЗаполнено(ДополнительныйОтпуск) Тогда
		ВидыВремени.Добавить(ДополнительныйОтпуск);
	КонецЕсли;	
	
	ОтпускНаОбучение = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.ОтпускНаОбучение");
	Если ЗначениеЗаполнено(ОтпускНаОбучение) Тогда
		ВидыВремени.Добавить(ОтпускНаОбучение);
	КонецЕсли;	
	
	Возврат ВидыВремени;
	
КонецФункции

Функция ВидыСплошнойРегистрацииПоНормеВремениТолькоОтпуска() Экспорт 
	
	ВидыВремени = Новый Массив;
	
	ОсновнойОтпуск = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.ОсновнойОтпуск");
	Если ЗначениеЗаполнено(ОсновнойОтпуск) Тогда
		ВидыВремени.Добавить(ОсновнойОтпуск);
	КонецЕсли;	

	ДополнительныйОтпуск = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.ДополнительныйОтпуск");
	Если ЗначениеЗаполнено(ДополнительныйОтпуск) Тогда
		ВидыВремени.Добавить(ДополнительныйОтпуск);
	КонецЕсли;	
	
	ОтпускНаОбучение = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.ОтпускНаОбучение");
	Если ЗначениеЗаполнено(ОтпускНаОбучение) Тогда
		ВидыВремени.Добавить(ОтпускНаОбучение);
	КонецЕсли;	
	
	Возврат ВидыВремени;
	
КонецФункции

Процедура УстановитьУсловноеОформлениеДокументРегистрацияПрочихДоходов(Форма) Экспорт
	
	ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
	// Вид оформления
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	// Условие для оформления
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ВидДохода");
	ЭлементОтбора.ПравоеЗначение = Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства;
	// Оформляемое поле
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("НачисленияКВыплате");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("НачисленияУдержанияВзносыУдержано");
	
	ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
	// Вид оформления
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	// Условие для оформления
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("УчитыватьОПВ");
	ЭлементОтбора.ПравоеЗначение = Ложь;
	// Оформляемое поле
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("НачисленияОПВ");
	
	ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
	// Вид оформления
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	// Условие для оформления
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("УчитыватьВОСМС");
	ЭлементОтбора.ПравоеЗначение = Ложь;
	// Оформляемое поле
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("НачисленияВОСМС");
	
	ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
	// Вид оформления
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	// Условие для оформления
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("УчитыватьИПН");
	ЭлементОтбора.ПравоеЗначение = Ложь;
	// Оформляемое поле
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("НачисленияИПН");
	
	ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
	// Вид оформления
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	// Условие для оформления
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("УчитыватьСН");
	ЭлементОтбора.ПравоеЗначение = Ложь;
	// Оформляемое поле
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("НачисленияСН");
	
	ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
	// Вид оформления
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	// Условие для оформления
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("УчитыватьСО");
	ЭлементОтбора.ПравоеЗначение = Ложь;
	// Оформляемое поле
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("НачисленияСО");
		
КонецПроцедуры

#КонецОбласти