
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ФП_НастройкаПоступленияВФонды
	Движения.ФП_НастройкаПоступленияВФонды.Записывать = Истина;
	Для Каждого ТекСтрокаСтатьиДвиженияДенежныхСредств Из СтатьиДвиженияДенежныхСредств Цикл
		Движение = Движения.ФП_НастройкаПоступленияВФонды.Добавить();
		Движение.Период = Дата;
		Движение.Фонд = ТекСтрокаСтатьиДвиженияДенежныхСредств.Фонд;
		Движение.СтатьяДвиженияДенежныхСредств = ТекСтрокаСтатьиДвиженияДенежныхСредств.Статья;
		Движение.СпособПополнения = ТекСтрокаСтатьиДвиженияДенежныхСредств.СпособПополнения;
		Движение.Значение = ТекСтрокаСтатьиДвиженияДенежныхСредств.Значение;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
