////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ПолноеИмяОбработки = ОбработкаОбъект.Метаданные().ПолноеИмя();
	
	ЭКОМ_ДеревоКонфигурации = Неопределено;
    
    ПараметрыОткрытия = ЭтаФорма.Параметры;
	Если ПараметрыОткрытия.Свойство("ДопПараметры") = Истина Тогда
		ПараметрыОткрытия.ДопПараметры.Свойство("ИмяЭлементаФормы",    ИмяЭлементаФормы);	
		ПараметрыОткрытия.ДопПараметры.Свойство("ЭКОМ_ОбменCondra",    ЭтаФорма.ЭКОМ_ОбменCondra);
		ПараметрыОткрытия.ДопПараметры.Свойство("ЭКОМ_ОбменСеть",      ЭтаФорма.ЭКОМ_ОбменСеть);
		ПараметрыОткрытия.ДопПараметры.Свойство("ЭКОМ_ОбменЭТРН",      ЭтаФорма.ЭКОМ_ОбменЭТРН);
		ПараметрыОткрытия.ДопПараметры.Свойство("ЭКОМ_ОбменПоставщик", ЭтаФорма.ЭКОМ_ОбменПоставщик);
	КонецЕсли;

    ПроверятьНаФорме = ?(ИмяЭлементаФормы = "ГруппаПоставщик" Или ИмяЭлементаФормы = "ГруппаПокупатель", Истина, Ложь); //этот реквизит передается при вызове формы по нему определяю это код для запроса динамического списка на основной форме АРМа или код вычисляемый в модуле обработки
    Элементы.ТестированиеКодаВМодулеФормы.Видимость     = ПроверятьНаФорме;
    Элементы.ТестированиеКодаВМодулеОбработки.Видимость = НЕ ПроверятьНаФорме;
    
	ТипДокументаИсточник = "";
	ПараметрыОткрытия.Свойство("ТипДокументаИсточника", ТипДокументаИсточник);
	Если ЗначениеЗаполнено(ТипДокументаИсточник) Тогда
		ЭКОМ_ДеревоКонфигурации = ОбработкаОбъект.Настройка_Параметр_Прочитать("СлужебныйДеревоКонфигурации", , "Служебный");
		Если НЕ ЭКОМ_ДеревоКонфигурации = Неопределено Тогда
			СтрокаДерева = ЭКОМ_ДеревоКонфигурации.Строки.Найти(ТипДокументаИсточник, "Синоним");
			Если НЕ СтрокаДерева = Неопределено Тогда
				ЭтаФорма.Источник = Документы[СтрокаДерева.Имя].ПустаяСсылка();
			Иначе
				ДанныеПоКолонкам = ЭКОМ_ОбщегоНазначения.ПолучитьДанныеПоКолонкамИсточника();
				Типы = ДанныеПоКолонкам.Получить(ТипДокументаИсточник);
				Если НЕ Типы = Неопределено Тогда
				     Элементы.Источник.ОграничениеТипа = Типы;
				КонецЕсли;	
				ДанныеПоТипам    = ОбработкаОбъект.ПолучитьТипДокументаКолонки(ТипДокументаИсточник, ДанныеПоКолонкам);
				СтрокаДерева     = ЭКОМ_ДеревоКонфигурации.Строки.Найти(ДанныеПоТипам.ИмяДокументаВКонфигурации, "Имя");
				Если НЕ СтрокаДерева = Неопределено Тогда
					ЭтаФорма.Источник = Документы[СтрокаДерева.Имя].ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;		
		КонецЕсли;
	Иначе
		Элементы.Источник.Видимость = Ложь; 
	КонецЕсли;
	ТипыИсточника = Элементы.Источник.ОграничениеТипа.Типы();
	Если ТипыИсточника.Количество() = 0 
		 И НЕ ЭтаФорма.Источник = Неопределено Тогда
		 МассивТипов = Новый Массив;
		 МассивТипов.Добавить(ТипЗнч(ЭтаФорма.Источник));
	     Элементы.Источник.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	КонецЕсли;	
	Если ЭтаФорма.Источник = Неопределено
		И НЕ ТипыИсточника.Количество() = 0 Тогда
		Для каждого Стр Из ТипыИсточника Цикл
			Если НЕ Стр = Тип("Null") Тогда
				ОбъектМетаданных = Метаданные.НайтиПоТипу(Стр);
				Если НЕ ОбъектМетаданных = Неопределено Тогда
					ПолноеИмяОбъекта    = ОбъектМетаданных.ПолноеИмя();
					ЭтаФорма.Источник = ПредопределенноеЗначение(ПолноеИмяОбъекта + ".ПустаяСсылка");		
					Прервать;
				КонецЕсли;				  
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;
	Элементы.Источник.ВыбиратьТип = Истина;
	
	ТипДокументаПриемник = "";
	ПараметрыОткрытия.Свойство("ТипДокументаПриемника", ТипДокументаПриемник);
	Если ЗначениеЗаполнено(ТипДокументаПриемник) Тогда
		
		Если ЭКОМ_ДеревоКонфигурации = Неопределено Тогда
			ЭКОМ_ДеревоКонфигурации = ОбработкаОбъект.Настройка_Параметр_Прочитать("СлужебныйДеревоКонфигурации", , "Служебный");
		КонецЕсли;
		
		Если НЕ ЭКОМ_ДеревоКонфигурации = Неопределено Тогда
			СтрокаДерева = ЭКОМ_ДеревоКонфигурации.Строки.Найти(ТипДокументаПриемник, "Синоним");
			Если НЕ СтрокаДерева = Неопределено Тогда
				ЭтаФорма.Приемник = Документы[СтрокаДерева.Имя].ПустаяСсылка();
			Иначе
				СтрокаДерева = ЭКОМ_ДеревоКонфигурации.Строки.Найти(ТипДокументаПриемник, "Имя");
				Если НЕ СтрокаДерева = Неопределено Тогда
					ЭтаФорма.Приемник = Документы[СтрокаДерева.Имя].ПустаяСсылка();
				КонецЕсли;			
			КонецЕсли;
		КонецЕсли;

	Иначе
		Элементы.Приемник.Видимость = Ложь;
	КонецЕсли;
	Если НЕ ЭтаФорма.Приемник = Неопределено Тогда
		 МассивТипов = Новый Массив;
		 МассивТипов.Добавить(ТипЗнч(ЭтаФорма.Приемник));
	     Элементы.Приемник.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	КонецЕсли;	
	Элементы.Приемник.ВыбиратьТип = Истина;
	
	ПараметрыОткрытия.Свойство("СправкаКФорме" , ЭтаФорма.Справка);	
	ПараметрыОткрытия.Свойство("ТекстНачальный", ЭтаФорма.ТекстНачальный);
	ПараметрыОткрытия.Свойство("Заголовок"     , ЭтаФорма.Заголовок);
    
    ДопПараметрыИзПараметровФормы = Неопределено;
    ПараметрыОткрытия.Свойство("ДопПараметры", ДопПараметрыИзПараметровФормы);
    ЭтаФорма.ДопПараметры = ЗначениеВСтрокуВнутр(ДопПараметрыИзПараметровФормы);
    
    ДопПараметрыСтрокой   = Неопределено;
    РежимСовместимости = Строка(Метаданные.РежимСовместимости); // Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_5
    ОшибкиВЗапросе = Ложь;
    Элементы.КомментарийКТекстуЗапроса.Видимость = ОшибкиВЗапросе;
			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Элементы.Источник.ОграничениеТипа.СодержитТип(ТипЗнч(ЭтаФорма.Источник)) = Ложь Тогда
	     ЭтаФорма.Источник = Неопределено;
	КонецЕсли;

	ЭтаФорма.Заголовок = ЭтаФорма.Заголовок;
    ТекстДляПоляЗапроса = СтрЗаменить(ЭтаФорма.ТекстНачальный, "¶", Символы.ПС);
	ЭтаФорма.ПолеТекст.УстановитьТекст(ТекстДляПоляЗапроса);

КонецПроцедуры   

&НаСервере
Функция ПолучитьСтруктуруДопПараметрыЗакрытия()
    ДопПараметрыСтрокой = ЭтаФорма.ДопПараметры;
    Возврат ЗначениеИзСтрокиВнутр(ДопПараметрыСтрокой);
КонецФункции

#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура КомментироватьУстановить(Команда)
	
	КомментироватьУстановитьСнять(Истина);

КонецПроцедуры

&НаКлиенте
Процедура КомментироватьСнять(Команда)
	
	КомментироватьУстановитьСнять(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментироватьУстановитьСнять(УстановитьКомментарий)
	
	НачалоСтроки = 0;
	НачалоКолонки = 0;
	КонецСтроки = 0;
	КонецКолонки = 0;
	
	ТекстовыйДок = Новый ТекстовыйДокумент;
	Если ТекущийЭлемент.Имя = "ПолеЗапроса" Тогда
		Выделение = ПолучитьВыделение();
		НачалоСтроки = Выделение.Начало;
		КонецСтроки  = Выделение.Окончание;
		
		НачалоСтрокиСимвола = НачалоСтроки;
		КонецСтрокиСимвола = КонецСтроки;
		ПреобразуемВТекст = ЭтаФорма.ПолеЗапроса.ПолучитьТекст();
	Иначе
		ПреобразуемВТекст = ЭтаФорма.ПолеТекст.ПолучитьТекст();
		Элементы.ПолеТекст.ПолучитьГраницыВыделения(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);	
	КонецЕсли;	
	
	ТекстовыйДок = Новый ТекстовыйДокумент;
	ТекстовыйДок.УстановитьТекст(ПреобразуемВТекст);

	МассивСтрок = ИзСтрокиСРазделителямиИПозициямиСимвола(ПреобразуемВТекст, Символы.ПС);	
	Если ТекущийЭлемент.Имя = "ПолеТекст" Тогда
	     НачалоСтрокиСимвола = МассивСтрок[НачалоСтроки-1].ПозицияНачала;
		 Если МассивСтрок.Количество() > КонецСтроки-1 Тогда
		     КонецСтрокиСимвола  = МассивСтрок[КонецСтроки-1].ПозицияКонец;
		 Иначе	
		     КонецСтрокиСимвола  = МассивСтрок[МассивСтрок.Количество()-1].ПозицияКонец;
		 КонецЕсли;	 	
	КонецЕсли;
	
	Если НачалоСтрокиСимвола = 0 Тогда
		НачалоСтрокиСимвола = 1;
	КонецЕсли;
	Если КонецСтрокиСимвола = 0 Тогда
		КонецСтрокиСимвола = 1;
	КонецЕсли;

	Старт = Ложь;
	ПродолжитьОбработку = Ложь;
	Финиш = Ложь;
	
	Счетчик = 1;
	Для каждого Стр Из МассивСтрок Цикл
		
		Старт = НачалоСтрокиСимвола >= Стр.ПозицияНачала И НачалоСтрокиСимвола <= Стр.ПозицияКонец;
		Если Старт Тогда
			ПродолжитьОбработку = Истина;
		КонецЕсли;
		
		Если ПродолжитьОбработку Тогда
			
			ПредыдущийТекст = ТекстовыйДок.ПолучитьСтроку(Счетчик);
			Если УстановитьКомментарий Тогда
				НовСтрока = "//" + ПредыдущийТекст;
			Иначе
				Если Не Лев(ПредыдущийТекст,2) = "//" Тогда 
					Продолжить; 
				КонецЕсли; 
				
				НовСтрока = Сред(ПредыдущийТекст, 3, СтрДлина(ПредыдущийТекст));
			КонецЕсли;
			
			ТекстовыйДок.ЗаменитьСтроку(Счетчик, НовСтрока);		 
			
			Финиш = КонецСтрокиСимвола >= Стр.ПозицияНачала И КонецСтрокиСимвола <= Стр.ПозицияКонец;
			Если Финиш Тогда
				ПродолжитьОбработку = Ложь;	 
			КонецЕсли;
			
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
	КонецЦикла;

	Если ТекущийЭлемент.Имя = "ПолеЗапроса" Тогда
		ЭтаФорма.ПолеЗапроса.УстановитьФорматированнуюСтроку(ПолучитьРаскрашенныйТекст(ТекстовыйДок.ПолучитьТекст()));
	    УстановитьВыделение(Выделение.Начало, Выделение.Окончание);
	Иначе			
		ЭтаФорма.ПолеТекст.УстановитьТекст(ТекстовыйДок.ПолучитьТекст());
		Элементы.ПолеТекст.УстановитьГраницыВыделения(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);
	КонецЕсли;
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонструкторЗапроса(Команда)
	
	Перем ОписаниеОповещения;

	//#Если НЕ ТолстыйКлиент И НЕ ТолстыйКлиентУправляемоеПриложение Тогда
	//	Сообщить("Конструктор запроса можно вызывать только в толстом клиенте");
	//	Возврат;
	//#КонецЕсли
		
	//БЛОК №1 - ИНИЦИАЛИЗАЦИЯ ПЕРЕМЕННЫХ
	Кавычка = """";
	ДвойнаяКавычка = """""";   
	ЗаменаДляДвойнойКавычки = Строка(Новый УникальныйИдентификатор);	
	КоличествоСтрок = ПолучитьСтрЧислоСтрокСервер(ЭтаФорма.ПолеЗапроса.ПолучитьТекст());  
	
	ЗакладкаНачалоТекста    = ЭтаФорма.ПолеЗапроса.ПолучитьЗакладкуПоПозиции(0);
	ЗакладкаКонецТекста     = ЭтаФорма.ПолеЗапроса.ПолучитьЗакладкуКонца();
		
	ЗакладкаНачалаВыделения = ЭтаФорма.ПолеЗапроса.ПолучитьЗакладкуНачала();
	ЗакладкаКонцаВыделения  = ЭтаФорма.ПолеЗапроса.ПолучитьЗакладкуКонца();
	Элементы.ПолеЗапроса.ПолучитьГраницыВыделения(ЗакладкаНачалаВыделения, ЗакладкаКонцаВыделения);
	//----------------------------------------------
		
	//БЛОК №2 - ОПРЕДЕЛЕНИЕ ТЕКСТА ДО КУРСОРА И ПОСЛЕ КУРСОРА
	Элементы.ПолеЗапроса.УстановитьГраницыВыделения(ЗакладкаНачалоТекста, ЗакладкаНачалаВыделения);
	ТекстДоКурсора = Элементы.ПолеЗапроса.ВыделенныйТекст;			
	Элементы.ПолеЗапроса.УстановитьГраницыВыделения(ЗакладкаКонцаВыделения, ЗакладкаКонецТекста);
	ТекстПослеКурсора = Элементы.ПолеЗапроса.ВыделенныйТекст;
	
	Элементы.ПолеЗапроса.УстановитьГраницыВыделения(ЗакладкаНачалаВыделения, ЗакладкаКонцаВыделения);	
	
	//гарантируем отсутствие в тексте двойных кавычек
	ТекстДоКурсора = СтрЗаменить(ТекстДоКурсора, ДвойнаяКавычка, ЗаменаДляДвойнойКавычки); 	
	//в тексте после курсора необходимо оставить первую кавычку, если сразу после нее идет двойная
	//случай подряд идущих кавычек в количестве более 5-ти штук обрабатывать не будем
	ТекстПослеКурсора =  СтрЗаменить(Лев(ТекстПослеКурсора, 1) + 
				СтрЗаменить(Сред(ТекстПослеКурсора, 2), ДвойнаяКавычка, ЗаменаДляДвойнойКавычки) , ДвойнаяКавычка, ЗаменаДляДвойнойКавычки) ; 
	//----------------------------------------------
	
	
	//БЛОК №3 - ИЩЕМ ПОЗИЦИЮ ОТКРВАЮЩЕЙ И ЗАКРЫВАЮЩЕЙ КАВЫЧКИ ДЛЯ СТРОКИ ЗАПРОСА
	
	ПозицияОткрывающейКавычки = 0;
	ПозицияЗакрывающейКавычки = 0;
		
	ВСтроке = Ложь;
	КавычкиЕсть = Ложь;
	ПозицияПредыдущейКавычки = 0;
	ПоизцияПоследнейКавычки = 0;	
	
	Позиция = 1;
	ДлинаТекстаДоКурсора = СтрДлина(ТекстДоКурсора);
	
	//ИЩЕМ ОТКРЫВАЮЩУЮ КАВЫЧКУ
	Пока Позиция <= ДлинаТекстаДоКурсора Цикл
		
		ТекущийСимвол = Сред(ТекстДоКурсора, Позиция, 1);
		
		ПредыдущийСимвол = " "; 
		Если Позиция > 1 Тогда
			ПредыдущийСимвол = Сред(ТекстДоКурсора, Позиция-1, 1);
		КонецЕсли;						
		
		Если ТекущийСимвол = Кавычка Тогда
			ВСтроке = НЕ ВСтроке;
			ПозицияПредыдущейКавычки = ПоизцияПоследнейКавычки;
			ПоизцияПоследнейКавычки = Позиция;
			КавычкиЕсть = Истина;
		КонецЕсли;
				
		//Обработка комментария - начало
		Если НЕ ВСтроке И ПредыдущийСимвол = "/" И ТекущийСимвол = "/" Тогда 
			//это комментарий, пропускаем символы до конца строки
			Пока ТекущийСимвол <> Символы.LF И ТекущийСимвол <> Символы.CR Цикл				
                Позиция = Позиция +1;
				Если Позиция > ДлинаТекстаДоКурсора Тогда
					Прервать;
				КонецЕсли;				
				ТекущийСимвол = Сред(ТекстДоКурсора, Позиция, 1);
			КонецЦикла;
			
			Продолжить; 
		КонецЕсли;
		//Обработка комментария - конец
			
		Позиция = Позиция + 1;				
	КонецЦикла;
	
	//ОСОБЫМ ОБРАЗОМ ОБРАБОТАЕМ СЛУЧАЙ НАХОЖДЕНИЯ КУРСОРА В 
	//ДВОЙНОЙ КАВЫЧКЕ ВНУТРИ СТРОКИ ЗАПРОСА
	Если НЕ ВСтроке И КавычкиЕсть И СтрДлина(ТекстПослеКурсора) > 0 Тогда
		Если  Сред(ТекстДоКурсора, ДлинаТекстаДоКурсора, 1) = Кавычка И Лев(ТекстПослеКурсора,1) = Кавычка Тогда
			ВСтроке = Истина;
			ПоизцияПоследнейКавычки = ПозицияПредыдущейКавычки;			
			ТекстДоКурсора = Лев(ТекстДоКурсора, ДлинаТекстаДоКурсора-1);
			ТекстПослеКурсора = ЗаменаДляДвойнойКавычки + Сред(ТекстПослеКурсора, 2);
		КонецЕсли;
	КонецЕсли;			
	
	//ЕСЛИ НАШИЛИ ОТКРЫВАЮЩУЮ КАВЫЧКУ, ТО ИЩЕМ ЗАКРЫВАЮЩУЮ
	Если ВСтроке Тогда
		ПозицияОткрывающейКавычки = ПоизцияПоследнейКавычки;
		ПозицияЗакрывающейКавычки = Найти(ТекстПослеКурсора, Кавычка);		
	КонецЕсли;
				
	//----------------------------------------------
		
	//БЛОК №4 - ОПРЕДЕЛЯЕМ ТЕКСТ ДО ЗАПРОСА, ТЕКСТ ЗАПРОСА И ТЕКСТ ПОСЛЕ ЗАПРОСА
	//ПОСЛЕ ЧЕГО ВОЗРАЩАЕМ ДВОЙНЫЕ КАВЫЧКИ В КОД, НЕ ЯВЛЯЮЩИЙСЯ ЧАСТЬЮ ЗАПРОСА
	
	Конструктор = Новый КонструкторЗапроса;
	ГраницыЗапросаНайдены = ПозицияОткрывающейКавычки <> 0 И ПозицияЗакрывающейКавычки <> 0;
		
	Если НЕ ГраницыЗапросаНайдены Тогда		
		Сообщение = "ЗАПРОС НЕ ОБНАРУЖЕН, БУДЕТ СОЗДАН НОВЫЙ ЗАПРОС";
		ПоказатьОповещениеПользователя(Сообщение, , Сообщение);
		ТекстДоНачалаЗапроса = ТекстДоКурсора + Кавычка;
		ТекстПослеКонцаЗапроса = Кавычка + ТекстПослеКурсора ;					
	Иначе
		
		ТекстДоНачалаЗапроса = Лев(ТекстДоКурсора, ПозицияОткрывающейКавычки);		
		ТекстПослеКонцаЗапроса = Сред(ТекстПослеКурсора, ПозицияЗакрывающейКавычки);		
		
		ТекстЗапросаССимвовамиВертикальнойЧерты = Сред(ТекстДоКурсора, ПозицияОткрывающейКавычки + 1) + Лев(ТекстПослеКурсора, ПозицияЗакрывающейКавычки -1);	
		//для конструктора запроса вместо двойной кавычки будем подставлять одинарную
		ТекстЗапросаССимвовамиВертикальнойЧерты = СтрЗаменить(ТекстЗапросаССимвовамиВертикальнойЧерты, ЗаменаДляДвойнойКавычки, Кавычка); 
		
		КоличествоСтрокВТексте = СтрЧислоСтрок(ТекстЗапросаССимвовамиВертикальнойЧерты);
		ТекстЗапроса = "";	
		Для К = 1 To КоличествоСтрокВТексте Цикл
			СтрокаИзТекстаЗапроса = СокрЛП(СтрПолучитьСтроку(ТекстЗапросаССимвовамиВертикальнойЧерты, К));
			Если Лев(СтрокаИзТекстаЗапроса, 1) = "|" Тогда
				//для конструктора запроса убираем вертикальную черту в начале строки
				СтрокаИзТекстаЗапроса = Сред(СтрокаИзТекстаЗапроса, 2); 
			КонецЕсли;
			                                            
			ТекстЗапроса = ТекстЗапроса + СтрокаИзТекстаЗапроса + Символы.LF;
		КонецЦикла;
		
		Конструктор.Текст = ТекстЗапроса;
	КонецЕсли;
		
	//возвращаем двойные кавычки
	ТекстДоНачалаЗапроса = СтрЗаменить(ТекстДоНачалаЗапроса, ЗаменаДляДвойнойКавычки, ДвойнаяКавычка); 
	ТекстПослеКонцаЗапроса = СтрЗаменить(ТекстПослеКонцаЗапроса, ЗаменаДляДвойнойКавычки, ДвойнаяКавычка); 
		
	
	//БЛОК №5 - ОТКРЫВАЕМ КОНСТРУКТОР ЗАПРОСА С ПОЛУЧЕННОЙ СТРОКОЙ ЗАПРОСА И В СЛУЧАЕ УСПЕШНОГО
	//РЕЗУЛЬТАТА ВЫЧИСЛЯЕМ ОТСТУП, КОТОРЫЙ БУДЕМ ДОБАВЛЯТЬ К КАЖДОЙ СТРОКЕ ЗАПРОСА	
	
	#Если ТолстыйКлиентУправляемоеПриложение Тогда
		Попытка
			Если НЕ Конструктор.ОткрытьМодально() Тогда
				Возврат;
			КонецЕсли;	
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	#КонецЕсли
	
	ТекстЗапроса = Конструктор.Текст;	
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ДлинаТекстаДоНачалаЗапроса = СтрДлина(ТекстДоНачалаЗапроса);
	Позиция = ДлинаТекстаДоНачалаЗапроса-1; 

	Пока Позиция >= 1 Цикл		
		Если Сред(ТекстДоНачалаЗапроса, Позиция, 1) = Символы.LF Тогда			
			Прервать;
		КонецЕсли;		
		Позиция = Позиция - 1;
	КонецЦикла;
	                     
	СтрокаОтступа = Сред(ТекстДоНачалаЗапроса, Позиция+1, ДлинаТекстаДоНачалаЗапроса - Позиция -1);
	ДлинаСтрокиОтступа = СтрДлина(СтрокаОтступа);
	СтрокаОтступаИзПробеловИТабуляций = "";
	

	Для К = 1 To ДлинаСтрокиОтступа Цикл
		Если Сред(СтрокаОтступа, К, 1) = Символы.Tab Тогда
			СтрокаОтступаИзПробеловИТабуляций = СтрокаОтступаИзПробеловИТабуляций + Символы.Tab;
		Иначе 
			СтрокаОтступаИзПробеловИТабуляций = СтрокаОтступаИзПробеловИТабуляций + " ";
		КонецЕсли;
	КонецЦикла;	

	Дополнительно = Новый Структура;
    Дополнительно.Вставить("Кавычка", Кавычка);
	Дополнительно.Вставить("ДвойнаяКавычка", ДвойнаяКавычка);
	Дополнительно.Вставить("СтрокаОтступаИзПробеловИТабуляций", СтрокаОтступаИзПробеловИТабуляций);
	Дополнительно.Вставить("ТекстДоНачалаЗапроса", ТекстДоНачалаЗапроса);
	Дополнительно.Вставить("ТекстПослеКонцаЗапроса", ТекстПослеКонцаЗапроса);
	
	#Если ТолстыйКлиентУправляемоеПриложение Тогда
    СконструированЗапрос(ТекстЗапроса, Дополнительно);
	Возврат;
	#КонецЕсли

	// Для тонкого клиента
	Попытка	
		Выполнить("ОписаниеОповещения = Новый ОписаниеОповещения(""СконструированЗапрос"", ЭтаФорма, Дополнительно)");
		// попытаемся создать конструктор для 8.3.5
		Конструктор = Неопределено;
		Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
			Выполнить("Конструктор = Новый КонструкторЗапроса(ТекстЗапроса);");
		Иначе
			Выполнить("Конструктор = Новый КонструкторЗапроса();");
		КонецЕсли;
		Выполнить("Конструктор.Показать(ОписаниеОповещения)");
		Возврат;
	Исключение
		Ошибка = ОписаниеОшибки();
		Если Найти(Ошибка,"Тип не определен")>0 Тогда
			ПоказатьОповещениеПользователя("Конструктор",,"Конструктор запроса для тонкого клиента доступен с версии 8.3.5!");
		Иначе
			Сообщить(Ошибка);
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
    ВызватьПроверку(Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ЗакрытьПослеПроверки = Истина;	
	Записать = Истина;

    ВызватьПроверку(ЗакрытьПослеПроверки, Записать);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекстЗапроса(Команда)
	
	Если ТекущийЭлемент.Имя = "ПолеЗапроса" Тогда
		Если НЕ ПустаяСтрока(Элементы.ПолеЗапроса) Тогда 
			ЭтаФорма.ПолеЗапроса.Удалить();
			Модифицированность 	= Истина;
		КонецЕсли;				
	Иначе
		Если НЕ ПустаяСтрока(Элементы.ПолеТекст) Тогда 
			ЭтаФорма.ПолеТекст.Очистить();
			Модифицированность 	= Истина;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	
    ОчиститьСообщения();
	ВызватьПроверку();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");	
	ОбъектТЗ = РеквизитФормыВЗначение("ТабличноеПоле");
	
	МассивЛогаСобытий = Новый Массив;
	Результат = ОбработкаОбъект.ПроверитьФормулу(ЭтаФорма.ПолеТекст.ПолучитьТекст(), МассивЛогаСобытий, ЭтаФорма.Источник, НомерИсправленияНаФорме, ЭтаФорма.Приемник);
	Если МассивЛогаСобытий.Количество() > 0  Тогда
		ТекстОшибки = ЭКОМ_ОбщегоНазначения.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекстОшибки)
		И ТипЗнч(Результат) = Тип("ТаблицаЗначений") Тогда
		
		Если Результат.Количество() = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Результат неопределен!";
			Сообщение.Сообщить();
		КонецЕсли;
		
		МассивРеквизитов = Новый Массив;
		
		// Количесвто строк
		Результат.Колонки.Добавить("НомерПоПорядку");
		НомерПоПорядку = 1;
		Для Каждого Стр Из Результат Цикл
			Стр.НомерПоПорядку = НомерПоПорядку;
			НомерПоПорядку = НомерПоПорядку + 1;	       
		КонецЦикла;
		
		//Удалим ранее созданные колонки в ТЗ    
		Для Каждого Колонка Из ОбъектТЗ.Колонки Цикл
			Если НЕ Колонка.Имя = "НомерПоПорядку" Тогда
				МассивРеквизитов.Добавить("ТабличноеПоле." + Колонка.Имя); 
			КонецЕсли;		       
		КонецЦикла;
		ИзменитьРеквизиты( , МассивРеквизитов);
		
		//Создадим реквизиты ТЗ
		МассивРеквизитов.Очистить();
		Для Каждого Колонка ИЗ Результат.Колонки Цикл
			Если НЕ Колонка.Имя = "НомерПоПорядку" Тогда
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(Колонка.ТипЗначения);
				НоваяКолонка = Новый РеквизитФормы(Колонка.Имя, Новый ОписаниеТипов(МассивТипов), "ТабличноеПоле");
				МассивРеквизитов.Добавить(НоваяКолонка);			
			КонецЕсли;
		КонецЦикла;      
		ИзменитьРеквизиты(МассивРеквизитов);  
		ЗначениеВРеквизитФормы(Результат, "ТабличноеПоле");
		
		//Создаем элементы на форме для отображения колонок
		ЭлементТЗ = Элементы.ТабличноеПоле;
		Для Каждого Колонка ИЗ Результат.Колонки Цикл
			Если НЕ Колонка.Имя = "НомерПоПорядку" Тогда
				Если Элементы.Найти("ТабличноеПоле" + Колонка.Имя) = Неопределено Тогда
					НовыйЭлементФормы = Элементы.Добавить("ТабличноеПоле" + Колонка.Имя, Тип("ПолеФормы"), ЭлементТЗ);
					НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
					НовыйЭлементФормы.ПутьКДанным = "ТабличноеПоле." + Колонка.Имя;
					НовыйЭлементФормы.ВыбиратьТип = Ложь;
				КонецЕсли;
			КонецЕсли;		
        КонецЦикла;	
        ОшибкиВЗапросе = Ложь;
	Иначе
        ОшибкиВЗапросе = Истина;
        Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "ОШИБКА: " + ТекстОшибки + Символы.ПС +
		                  "Результат = " + Строка(Результат) + "(Тип - " + ТипЗнч(Результат) + ")";
		Сообщение.Сообщить();
	КонецЕсли;
    ВывестиИнформациюОбОшибке(ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция УстановитьПараметрДинамическогоСписка(ИмяПараметра, МассивЛогаСобытий)
	
	ИмяСобытия = "Установить параметры";
    Попытка //попытка нужна чтобы предприятие не закрывалось при ошибке
        Если ДинамическийСписокДляТестирования.Параметры.Элементы.Найти(ИмяПараметра) = Неопределено Тогда //проверка на существование параметра запроса
            Возврат Ложь;
	    КонецЕсли;
    Исключение
		ТекстЛогаСобытий = "Ошибка в процессе отображения запроса как динамического списка в консоли кода на вкладке Тестирование: " + ОписаниеОшибки();
		ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

		Возврат Ложь;
    КонецПопытки;
    
    Если ИмяПараметра = "масПомеченныхДоков" Тогда
        ЗначениеПараметра = Новый Массив;
    ИначеЕсли ИмяПараметра = "ДатаНач" Тогда
        ЗначениеПараметра = ДатаНач;
    ИначеЕсли ИмяПараметра = "ДатаКон" Тогда
        ЗначениеПараметра = ДатаКон;
	ИначеЕсли ИмяПараметра = "НаправлениеОбмена" Тогда
		ЗначениеПараметра = Перечисления.ЭКОМ_НаправлениеОбмена.ПустаяСсылка();
    КонецЕсли;
        
    ДинамическийСписокДляТестирования.Параметры.УстановитьЗначениеПараметра(ИмяПараметра, ЗначениеПараметра);
    Возврат Истина;
КонецФункции
&НаСервере
Процедура СформироватьДинаминическийСписокДляТестированияНаОснованииТекстаЗапроса(РезультатПроверки)
    Попытка
	    Запрос = Новый Запрос;
	    Запрос.Текст = РезультатПроверки.ТекстЗапроса;
	    Запрос.НайтиПараметры();
    Исключение
	    Возврат;
    КонецПопытки;    
    ДинамическийСписокДляТестирования.ТекстЗапроса  = РезультатПроверки.ТекстЗапроса;
    
    КорректностьДатНаФорме();
	
	МассивЛогаСобытий = Новый Массив;
	УстановитьПараметрДинамическогоСписка("НаправлениеОбмена", МассивЛогаСобытий);
    УстановитьПараметрДинамическогоСписка("масПомеченныхДоков", МассивЛогаСобытий);
    УстановитьПараметрДинамическогоСписка("ДатаНач", МассивЛогаСобытий);
    УстановитьПараметрДинамическогоСписка("ДатаКон", МассивЛогаСобытий);
	    
    ИмяДинамическогоСписка = "ДинамическийСписокДляТестирования";
    
    Колонки = РезультатПроверки.Колонки;
    
    Для Каждого ИмяКолонки Из Колонки Цикл
        
        ЭлементыСписка = Элементы.Найти(ИмяДинамическогоСписка + ИмяКолонки); 				
        Если ЭлементыСписка = Неопределено	 Тогда
            НоваяКолонкаТаблицы = Элементы.Добавить(ИмяДинамическогоСписка + ИмяКолонки, Тип("ПолеФормы"), Элементы[ИмяДинамическогоСписка]);
            НоваяКолонкаТаблицы.Заголовок = ИмяКолонки;
            НоваяКолонкаТаблицы.ПутьКДанным = ИмяДинамическогоСписка + "." + ИмяКолонки;							
        КонецЕсли;
    КонецЦикла;
	
	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ЭКОМ_ОбщегоНазначения.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий);
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ФормаДляОповещения = Неопределено;
	Если ТипЗнч(Параметр) = Тип("Структура") Тогда
	     Параметр.Свойство("ФормаДляОповещения", ФормаДляОповещения);
	КонецЕсли;
	
	Если ФормаДляОповещения = "Обработка.УФ_ФормаКонсольЗапросов" Тогда
		
		Если ИмяСобытия = "ЭКОМ_КонецПроверкиФормулыНаФорме" Тогда
			ПроверкаКодаНаФормеАРМЗавершение(Параметр);
		КонецЕсли;

	КонецЕсли;
	    
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаКодаНаФормеАРМЗавершение(Параметры)
    
    ЗакрытьПослеПроверки = Параметры.ЗакрытьПослеПроверки;
    
    Результат = Неопределено;
    Если Параметры.Свойство("Результат", Результат) Тогда
        Если ТипЗнч(Результат) = Тип("Структура") Тогда
            СформироватьДинаминическийСписокДляТестированияНаОснованииТекстаЗапроса(Результат);
        КонецЕсли;
    КонецЕсли;

    ЗакрытьПослеПроверки = Ложь;
    Если Параметры.Свойство("ЗакрытьПослеПроверки", ЗакрытьПослеПроверки) = Ложь Тогда
        ЗакрытьПослеПроверки = Ложь;
    КонецЕсли;
    
    Результат = Новый Структура;
    
    Результат.Вставить("Текст", Параметры.Текст);
    КодИзменен = КодОбновленПроверкой(Параметры.Текст);
    
    Результат.Вставить("Изменен", КодИзменен);
    Результат.Вставить("Колонки", Параметры.Результат.Колонки);
    
    Результат.Вставить("ДопПараметры", ПолучитьСтруктуруДопПараметрыЗакрытия());
    Если ЗакрытьПослеПроверки = Истина Тогда
        Закрыть(Результат);
    Иначе
		Если Параметры.Записать = Истина Тогда
	        Результат.Вставить("ФормаДляОповещения", "Обработка.УФ_ФормаНастройкиОсновные");
            Оповестить("ОбработкаЗакрытия", Результат);
        КонецЕсли;
    КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьОператорыЯзыкаЗапросов(ТекстДляПроверки)
    Перем Результат;
    
    Результат = Ложь;
    
    ТекстДляПроверкиВРег = ВРег(ТекстДляПроверки);
    
    Если Найти(ТекстДляПроверкиВРег, "ВЫБРАТЬ ") > 0
     Или Найти(ТекстДляПроверкиВРег, "ИЗ ") > 0
     Или Найти(ТекстДляПроверкиВРег, "ПОМЕСТИТЬ ") > 0
     Или Найти(ТекстДляПроверкиВРег, "ВЫБОР ") > 0
     Или Найти(ТекстДляПроверкиВРег, "ЛЕВОЕ СОЕДИНЕНИЕ ") > 0
     Или Найти(ТекстДляПроверкиВРег, "ВНУТРЕННЕЕ СОЕДИНЕНИЕ ") > 0
     Или Найти(ТекстДляПроверкиВРег, "ВНЕШНЕЕ СОЕДИНЕНИЕ ") > 0
     Или Найти(ТекстДляПроверкиВРег, "СГРУППИРОВАТЬ ПО ") > 0
     Или Найти(ТекстДляПроверкиВРег, " ЕСТЬ NULL ") > 0
     Или Найти(ТекстДляПроверкиВРег, " ЕСТЬNULL(") > 0
     Или Найти(ТекстДляПроверкиВРег, "|ТОГДА ") > 0
     Или Найти(ТекстДляПроверкиВРег, " ТОГДА ") > 0
     Или Найти(ТекстДляПроверкиВРег, " КАК ") > 0
     Или Найти(ТекстДляПроверкиВРег, "НАЧАЛОПЕРИОДА(") > 0  
        Тогда
        Результат = Истина;
    КонецЕсли;
    
    Возврат Результат;
КонецФункции
&НаСервере
Функция ВернутьКодДляВыполнить(ТекстЗапроса = Неопределено)
    Если ТекстЗапроса = Неопределено Тогда
        ТекстЗапроса = ЭтаФорма.ПолеТекст.ПолучитьТекст();
    КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Символы.НПП, " ");
	
	// Не нужно менять запрос
	Если ЭтаФорма.ИмяЭлементаФормы = "АвтоОбмен"
		ИЛИ ЭтаФорма.ИмяЭлементаФормы = "ПодпискаДляДокументовСеть"
		ИЛИ ЭтаФорма.ИмяЭлементаФормы = "ПодпискаДляДокументовПоставщик"
		ИЛИ ЭтаФорма.ИмяЭлементаФормы = "ПодпискаДляДокументовЭТРН" 
		ИЛИ Найти(ЭтаФорма.ИмяЭлементаФормы, "СтруктураФайлаXML") > 0 Тогда
		Возврат ТекстЗапроса;
	КонецЕсли;

    НРегТекстЗапроса = НРег(ТекстЗапроса);
    ЕстьТекстЗапроса = Найти(НРегТекстЗапроса, ".текст =") > 0 Или Найти(НРегТекстЗапроса, ".текст=") > 0 Или Найти(НРегТекстЗапроса, "текстзапроса =") > 0  Или Найти(НРегТекстЗапроса, "текстзапроса=") > 0;
    
    Если ЕстьТекстЗапроса Тогда
        Возврат ТекстЗапроса; //это уже готовый код
    ИначеЕсли ЕстьТекстЗапроса = Ложь И ЕстьОператорыЯзыкаЗапросов(ТекстЗапроса) Тогда //нужно преобразовывать это чистый текст запроса
        //просто идти дальше
    Иначе
        Возврат ТекстЗапроса;
    КонецЕсли;
    
	//одинарные кавычки надо заменить на двойные
	Строка2Кавычки = Символ(34) + Символ(34);
	Строка1Кавычка = Символ(34);
    Результат	=	СтрЗаменить(ТекстЗапроса,Строка1Кавычка,Строка2Кавычки);
	
	//открывающие и закрывающие 
	Результат = Символ(34) + Результат + Символ(34) + ";";
	
	
	ТекстДок = Новый ТекстовыйДокумент; 
	ТекстДок.УстановитьТекст(Результат);
	
	Для сч = 2 по ТекстДок.КоличествоСтрок() Цикл
		Строка = ТекстДок.ПолучитьСтроку(сч);
		ТекстДок.ЗаменитьСтроку(сч,"|"+Строка);
	КонецЦикла;  
    
    Результат = "ТекстЗапроса =  " + Символы.ПС + ТекстДок.ПолучитьТекст();
    
    Возврат Результат;
КонецФункции

&НаКлиенте
Функция КодОбновленПроверкой(КодПослеПроверки = Неопределено)
	
	КодДляВыполнить = ВернутьКодДляВыполнить();
    КодИзменен = НЕ (ЭтаФорма.ТекстНачальный = КодДляВыполнить);    
	Если КодИзменен Тогда
		ЭтаФорма.ПолеТекст.УстановитьТекст(КодДляВыполнить);
        //ЭтаФорма.ПолеЗапроса.УстановитьФорматированнуюСтроку(ПолучитьРаскрашенныйТекст(КодДляВыполнить)); 
    КонецЕсли;
    
    Возврат КодИзменен;
	
КонецФункции

&НаКлиенте
Функция НачатьПроверкуФормулыНаФорме(ЗакрытьПослеПроверки = Ложь, Записать = Ложь)
    
    ТекстКода = ВернутьКодДляВыполнить();
	
	МассивЛогаСобытий = Новый Массив;	
	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("Текст"           , ТекстКода);
	ПараметрыПроверки.Вставить("ИмяЭлементаФормы", ИмяЭлементаФормы);
	ПараметрыПроверки.Вставить("МассивЛогаСобытий"   , МассивЛогаСобытий);
	ПараметрыПроверки.Вставить("ЗакрытьПослеПроверки", ЗакрытьПослеПроверки);
	ПараметрыПроверки.Вставить("Записать"            , Записать);
	ПараметрыПроверки.Вставить("ФормаДляОповещения"  , "Обработка.УФ_Форма");
	
	ПараметрыПроверки.Вставить("ЭКОМ_ОбменCondra"    , ЭтаФорма.ЭКОМ_ОбменCondra);
	ПараметрыПроверки.Вставить("ЭКОМ_ОбменПоставщик" , ЭтаФорма.ЭКОМ_ОбменПоставщик);
	ПараметрыПроверки.Вставить("ЭКОМ_ОбменСеть"      , ЭтаФорма.ЭКОМ_ОбменСеть);
	ПараметрыПроверки.Вставить("ЭКОМ_ОбменЭТРН"      , ЭтаФорма.ЭКОМ_ОбменЭТРН);
	
    Оповестить("ЭКОМ_ПроверитьФормулуНаФорме", ПараметрыПроверки);
    
КонецФункции

&НаКлиенте
Функция ВызватьПроверку(ЗакрытьПослеПроверки = Ложь, Записать = Ложь)
    
    ПроверятьНаФорме = ?(ИмяЭлементаФормы = "ГруппаПоставщик" 
	                     ИЛИ ИмяЭлементаФормы = "ГруппаПокупатель"
						 ИЛИ ИмяЭлементаФормы = "ГруппаЭТРН"
						 ИЛИ ИмяЭлементаФормы = "ГруппаПрайсЛист"
						 ИЛИ ИмяЭлементаФормы = "ГруппаCondra", Истина, Ложь); //этот реквизит передается при вызове формы по нему определяю это код для запроса динамического списка на основной форме АРМа или код вычисляемый в модуле обработки
    
    Если ПроверятьНаФорме = Истина Тогда
        НачатьПроверкуФормулыНаФорме(ЗакрытьПослеПроверки, Записать);
    Иначе
        ЗначениеРезультат = ПроверитьФормулуНаСервере();
        
        Если Записать = Истина Тогда
            Результат = Новый Структура;
            Результат.Вставить("Текст",   ВернутьКодДляВыполнить());
            Результат.Вставить("Изменен", НЕ ЭтаФорма.ТекстНачальный = ЭтаФорма.ПолеТекст.ПолучитьТекст());
            
            локДопПараметры = ПолучитьСтруктуруДопПараметрыЗакрытия();
            Результат.Вставить("ДопПараметры", локДопПараметры);
            Результат.Вставить("Значение"    , ЗначениеРезультат);
            
			Если локДопПараметры <> Неопределено Тогда
	            Результат.Вставить("ФормаДляОповещения", "Обработка.УФ_ФормаНастройкиОсновные");
                Оповестить("ОбработкаЗакрытия", Результат);
				ЭтаФорма.ТекстНачальный = Результат.Текст;
            КонецЕсли;
        КонецЕсли;
        
        Если ЗакрытьПослеПроверки = Истина Тогда
            ЭтаФорма.Закрыть();
        КонецЕсли;
    КонецЕсли;    
    
КонецФункции



// Функция проверяет корректность введенной формулы и возвращает результат ее выполнения.
//
// Параметры:
//  Текст – Строка - текст на встроенном языке 1С
//  Отказ – Булево - признак прерывания выполнения обработки
//
// Возвращаемое значение:
//   ТаблицаЗначений   - результат выполнения кода
&НаСервере
Функция ПроверитьФормулуНаСервере() Экспорт
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
    МассивЛогаСобытий = Новый Массив;
    Код = ЭтаФорма.ПолеТекст.ПолучитьТекст();
	
	// Не нужно проверять
	Если ЭтаФорма.ИмяЭлементаФормы = "ПодпискаДляДокументовСеть"
		 ИЛИ ЭтаФорма.ИмяЭлементаФормы = "ПодпискаДляДокументовПоставщик"
		 ИЛИ ЭтаФорма.ИмяЭлементаФормы = "ПодпискаДляДокументовCondra"    
		 ИЛИ ЭтаФорма.ИмяЭлементаФормы = "ПодпискаДляДокументовПрайсЛист"
		 ИЛИ ЭтаФорма.ИмяЭлементаФормы = "ПодпискаДляДокументовЭТРН" Тогда
		Значение = Неопределено;
	Иначе
		// Входящие
		Если Найти(ЭтаФорма.ИмяЭлементаФормы, "Входящие") > 0 Тогда
			ПриемникОбъект = Документы.ЭКОМ_Документы.СоздатьДокумент();
			ПриемникОбъект.НеЗагружатьДокумент = Истина;
		    Значение = ОбработкаОбъект.ПроверитьФормулу(Код, МассивЛогаСобытий, Неопределено, "", ПриемникОбъект);
			
		// Исходящие	
		ИначеЕсли Найти(ЭтаФорма.ИмяЭлементаФормы, "Исходящие") > 0 Тогда
	        Значение = ОбработкаОбъект.ПроверитьФормулу(Код, МассивЛогаСобытий, ЭтаФорма.Источник, ЭтаФорма.НомерИсправленияНаФорме, ЭтаФорма.Приемник);
			
		// Документы
		ИначеЕсли Найти(ЭтаФорма.ИмяЭлементаФормы, "Документы") > 0 Тогда
            Значение = Неопределено;
			
		Иначе
			Значение = ОбработкаОбъект.ПроверитьФормулу(Код, МассивЛогаСобытий, ЭтаФорма.Источник, ЭтаФорма.НомерИсправленияНаФорме, ЭтаФорма.Приемник);
			
		КонецЕсли;							
	КонецЕсли;

   	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ЭКОМ_ОбщегоНазначения.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий);
		Сообщение.Сообщить();
	КонецЕсли;
    
    Если ТипЗнч(Значение) = Тип("ТаблицаЗначений") Тогда
		
		Сообщить("Количество строк в таблице результата: " + Строка(Значение.Количество()));
        Элементы.ТабличноеПоле.Видимость = Истина;
		
		ОбъектТЗ = РеквизитФормыВЗначение("ТабличноеПоле");
		МассивРеквизитов = Новый Массив;
		
		// Количесвто строк
		Значение.Колонки.Добавить("НомерПоПорядку");
		НомерПоПорядку = 1;
		Для Каждого Стр Из Значение Цикл
			Стр.НомерПоПорядку = НомерПоПорядку;
			НомерПоПорядку = НомерПоПорядку + 1;	       
		КонецЦикла;
		
		// Удалим ранее созданные колонки в ТЗ    
		Для Каждого Колонка Из ОбъектТЗ.Колонки Цикл
			Если НЕ Колонка.Имя = "НомерПоПорядку" Тогда
				МассивРеквизитов.Добавить("ТабличноеПоле." + Колонка.Имя); 
			КонецЕсли;		       
		КонецЦикла;
		ИзменитьРеквизиты( , МассивРеквизитов);
		
		// Сортируем 
		СписокКолонок = Новый СписокЗначений;
		Для Каждого Колонка ИЗ Значение.Колонки Цикл
			СписокКолонок.Добавить(Колонка.ТипЗначения, Колонка.Имя);
		КонецЦикла;
		СписокКолонок.СортироватьПоПредставлению();
		
		// Создадим реквизиты ТЗ
		МассивРеквизитов.Очистить();
		Для Каждого Колонка ИЗ СписокКолонок Цикл
			Если НЕ Колонка.Представление = "НомерПоПорядку" Тогда
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(Колонка.Значение);
				НоваяКолонка = Новый РеквизитФормы(Колонка.Представление, Новый ОписаниеТипов(МассивТипов), "ТабличноеПоле");
				МассивРеквизитов.Добавить(НоваяКолонка);			
			КонецЕсли;
		КонецЦикла;      
		ИзменитьРеквизиты(МассивРеквизитов);  
		ЗначениеВРеквизитФормы(Значение, "ТабличноеПоле");
		
		// Создаем элементы на форме для отображения колонок
		ЭлементТЗ = Элементы.ТабличноеПоле;
		Для Каждого Колонка ИЗ СписокКолонок Цикл
			Если НЕ Колонка.Представление = "НомерПоПорядку" Тогда
				Если Элементы.Найти("ТабличноеПоле" + Колонка.Представление) = Неопределено Тогда
					НовыйЭлементФормы = Элементы.Добавить("ТабличноеПоле" + Колонка.Представление, Тип("ПолеФормы"), ЭлементТЗ);
					НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
					НовыйЭлементФормы.ПутьКДанным = "ТабличноеПоле." + Колонка.Представление;
					НовыйЭлементФормы.ВыбиратьТип = Ложь;
				КонецЕсли;
			КонецЕсли;		
		КонецЦикла;		
		
    Иначе
        Элементы.ТабличноеПоле.Видимость = Ложь;
    КонецЕсли;
    
	Если Найти(НРег(Код), "возврат ") > 0 Тогда
		Инфо = ?(Значение = Неопределено, "Возвращено значение Неопределено", "Возвращено: [" + Строка(Значение) + "], тип " + Строка(ТипЗнч(Значение)));
		Сообщить(Инфо);	 
	КонецЕсли;
	    
 	ИтоговоеЗначение = Новый Массив;
	Если НЕ Значение = Неопределено Тогда  
		// Преобразование типа ТаблицаЗначений		
		
		Если ТипЗнч(Значение) = Тип("ТаблицаЗначений") Тогда
			Для каждого ЭлКолнки Из Значение.Колонки Цикл
				СтрокаТЧ = Новый Структура;
				СтрокаТЧ.Вставить("КолонкаКлюч", СокрЛП(ЭлКолнки.Имя));
				ИтоговоеЗначение.Добавить(СтрокаТЧ);
			КонецЦикла;
		КонецЕсли;		
	КонецЕсли;
    
	Возврат ИтоговоеЗначение;
	
КонецФункции

&НаКлиенте
Процедура СконструированЗапрос(ТекстЗапроса, Дополнительно) Экспорт
	
	Если ТекстЗапроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//БЛОК №6 - ОБРАБАТЫВАЕМ РЕЗУЛЬТАТ, ЗАМЕНЯЕМ ОДИНАРНЫЕ КАВЫЧКИ НА ДВОЙНЫЕ, 
	//ДОБАВЛЯЕМ ОТСТУП И ВЕРТИКАЛЬНУЮ ЧЕРТУ СТРОКАМ ЗАПРОСА НАЧИНАЯ СО ВТОРОЙ	
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Дополнительно.Кавычка, Дополнительно.ДвойнаяКавычка); 		
	КоличествоСтрокВТексте = СтрЧислоСтрок(ТекстЗапроса);	
	ТекстЗапросаССимвовамиВертикальнойЧерты = СтрПолучитьСтроку(ТекстЗапроса, 1);
	
	Для К = 2 To КоличествоСтрокВТексте Цикл
		ТекстЗапросаССимвовамиВертикальнойЧерты = ТекстЗапросаССимвовамиВертикальнойЧерты + Символы.LF 
		+ Дополнительно.СтрокаОтступаИзПробеловИТабуляций + "|" + СтрПолучитьСтроку(ТекстЗапроса, К);
	КонецЦикла;
	
	//ЗАГРУЖАЕМ НОВЫЙ КОД В ТЕКСТОВОЕ ПОЛЕ И УСТАНАВЛИВАЕМ КУРСОР НА ПРЕЖНЮЮ ПОЗИЦИЮ
	ИтоговыйКод = Дополнительно.ТекстДоНачалаЗапроса + ТекстЗапросаССимвовамиВертикальнойЧерты + Дополнительно.ТекстПослеКонцаЗапроса;
	ЭтаФорма.ПолеЗапроса.УстановитьФорматированнуюСтроку(ПолучитьРаскрашенныйТекст(ИтоговыйКод));
		
КонецПроцедуры

&НаКлиенте
Процедура СконструированЗапросТекст(ТекстЗапроса, Дополнительно) Экспорт
	
	Если ТекстЗапроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//БЛОК №6 - ОБРАБАТЫВАЕМ РЕЗУЛЬТАТ, ЗАМЕНЯЕМ ОДИНАРНЫЕ КАВЫЧКИ НА ДВОЙНЫЕ, 
	//ДОБАВЛЯЕМ ОТСТУП И ВЕРТИКАЛЬНУЮ ЧЕРТУ СТРОКАМ ЗАПРОСА НАЧИНАЯ СО ВТОРОЙ	
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Дополнительно.Кавычка, Дополнительно.ДвойнаяКавычка); 		
	КоличествоСтрокВТексте = СтрЧислоСтрок(ТекстЗапроса);	
	ТекстЗапросаССимвовамиВертикальнойЧерты = СтрПолучитьСтроку(ТекстЗапроса, 1);
	
	Для К = 2 To КоличествоСтрокВТексте Цикл
		ТекстЗапросаССимвовамиВертикальнойЧерты = ТекстЗапросаССимвовамиВертикальнойЧерты + Символы.LF 
		+ Дополнительно.СтрокаОтступаИзПробеловИТабуляций + "|" + СтрПолучитьСтроку(ТекстЗапроса, К);
	КонецЦикла;
	
	//ЗАГРУЖАЕМ НОВЫЙ КОД В ТЕКСТОВОЕ ПОЛЕ И УСТАНАВЛИВАЕМ КУРСОР НА ПРЕЖНЮЮ ПОЗИЦИЮ
	ИтоговыйКод = Дополнительно.ТекстДоНачалаЗапроса + ТекстЗапросаССимвовамиВертикальнойЧерты + Дополнительно.ТекстПослеКонцаЗапроса;
	ЭтаФорма.ПолеТекст.УстановитьТекст(ИтоговыйКод);	
		
КонецПроцедуры

&НаСервере
Функция ПолучитьСтрЧислоСтрокСервер(Данные)
   Возврат СтрЧислоСтрок(Данные);
КонецФункции 

#КонецОбласти

&НаКлиенте
Функция ВхождениеСтроки(Текст, ИскомыйТекст)

	ВозвращаемоеЗначение = 0;
	
	Если РежимСовместимости = "НеИспользовать" Тогда
		Выполнить("ВозвращаемоеЗначение = СтрНайти(Текст, ИскомыйТекст);");
	Иначе
		Выполнить("ВозвращаемоеЗначение = Найти(Текст, ИскомыйТекст);");
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;

КонецФункции // ВхождениеСтроки()

&НаСервереБезКонтекста
Функция РазбитьСтрокуВМассивПодстрок(Знач Строка, Разделитель = ".", УдалятьРазделитель = Истина)

	Массив = Новый Массив;
	
	ПозицияРазделителя = Найти(Строка, Разделитель);
    
    ДлинаРазделителя = ?(УдалятьРазделитель = Истина, СтрДлина(Разделитель), -1);
    ДлинаРазделителяДляУдаления = СтрДлина(Разделитель);
    Пока ПозицияРазделителя > 0 Цикл
		Массив.Добавить(Лев(Строка, ПозицияРазделителя - ДлинаРазделителя));
		Строка = Сред(Строка, ПозицияРазделителя + ДлинаРазделителяДляУдаления);
		ПозицияРазделителя = Найти(Строка, Разделитель);
	КонецЦикла;
		
	Если СтрДлина(Строка) > 0 Тогда
		Массив.Добавить(Строка);
	КонецЕсли;
	
	Возврат Массив;
	

КонецФункции

Процедура ВывестиИнформациюОбОшибке(ТекстОшибки = Неопределено)
    Информация = ИнформацияОбОшибке();
    Если ТекстОшибки = Неопределено Тогда
        Если Информация.Причина <> Неопределено Тогда
            ТекстОшибки = Информация.Причина.Описание;
        КонецЕсли;
    КонецЕсли;
    КомментарийКТекстуЗапроса = ТекстОшибки;
    ОшибкиВЗапросе = НЕ ПустаяСтрока(ТекстОшибки);
    
    Если ОшибкиВЗапросе Тогда
        Элементы.ГруппаШапка.ТекущаяСтраница = Элементы.ГруппаЗапрос;
    КонецЕсли;
    Элементы.КомментарийКТекстуЗапроса.Видимость = ОшибкиВЗапросе;
    
КонецПроцедуры

&НаСервере
Процедура ТекстЗапросаСОшибками(ТекстЗапроса)
	
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		ОшибкиВЗапросе = Ложь;
	Иначе
		Попытка
			Запрос = Новый Запрос(ТекстЗапроса);
			ПараметрыЗапроса = Запрос.НайтиПараметры();
			ОшибкиВЗапросе = Ложь;
			КомментарийКТекстуЗапроса = "";
        Исключение
            ВывестиИнформациюОбОшибке();
		КонецПопытки;
	КонецЕсли; 

КонецПроцедуры

//ТВС: НачалоИзменений: Автор [Тюрюков Владимир] | метка автора: [ТВС] |  15.08.2019]
&НаКлиенте
Процедура ОткрытьВыборОбъектаИБ(Команда)
    ОткрытьФорму(ПолноеИмяОбработки + ".Форма.УФ_ДляКода_ВыборОбъекта", , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры

&НаКлиенте
Процедура ЭКОМОбъектыНажатие(Элемент)
    
	Если Элемент.Имя = "ЭКОМ_GLN" Тогда
	     ОткрытьФорму("РегистрСведений.ЭКОМ_GLN.ФормаСписка");
    ИначеЕсли Элемент.Имя = "ЭКОМ_НоменклатураКонтрагентов" Тогда
	     ОткрытьФорму("РегистрСведений.ЭКОМ_НоменклатураКонтрагентов.ФормаСписка");	
	ИначеЕсли Элемент.Имя = "ЭКОМ_ТочкиДоставки" Тогда
	     ОткрытьФорму("РегистрСведений.ЭКОМ_ТочкиДоставки.ФормаСписка");	 
	ИначеЕсли Элемент.Имя = "ЭКОМ_ОбъектыСобытия" Тогда
	     ОткрытьФорму("РегистрСведений.ЭКОМ_Объекты_События.ФормаСписка");	 
	ИначеЕсли Элемент.Имя = "ЭКОМ_ИсторияОбмена" Тогда
	     ОткрытьФорму("РегистрСведений.ЭКОМ_ИсторияОбмена.ФормаСписка");	
	ИначеЕсли Элемент.Имя = "ЭКОМ_ЗначениеДополнительныхКонстант" Тогда
	     ОткрытьФорму("РегистрСведений.ЭКОМ_ЗначениеДополнительныхКонстант.ФормаСписка");	 
	ИначеЕсли Элемент.Имя = "ЭКОМ_ТранспортнаяИнформация" Тогда
	     ОткрытьФорму("ЭКОМ_ТранспортнаяИнформация");	 
	ИначеЕсли Элемент.Имя = "ЭКОМ_Документы" Тогда
	     ОткрытьФорму("Документ.ЭКОМ_Документы.ФормаСписка");
	ИначеЕсли Элемент.Имя = "ЭКОМ_Сертификаты" Тогда
	     ОткрытьФорму("Справочник.ЭКОМ_Сертификаты.ФормаСписка");	 
	ИначеЕсли Элемент.Имя = "ЭКОМ_ОператорыЭДО" Тогда
	     ОткрытьФорму("Справочник.ЭКОМ_ОператорыЭДО.ФормаСписка");	 
	КонецЕсли;
    
    
КонецПроцедуры

#Область ОткрытиеВнешнейКонсолиЗапросовУФ
&НаСервере
Функция ИзвлечьКонсольЗапросовНаСервере()
    
    
    ПутьКОбработкеКонсолиЗапросовУФ = КаталогВременныхФайлов() + "ЭКОМ_КонсольЗапросовУФ.epf";
    ПутьКОбработкеКонсолиЗапросовУФ = "D:\1C\Отладочные инструменты\УФ\КонсольЗапросовУФ_8.3.5.2.epf";
    
    ФайлОбработкиКонсолиЗапросов = Новый Файл(ПутьКОбработкеКонсолиЗапросовУФ);
    Если ФайлОбработкиКонсолиЗапросов.Существует() Тогда //консоль уже есть в папке временных файлов
        Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКОбработкеКонсолиЗапросовУФ));
    	Возврат Адрес;
    КонецЕсли;
    
    ОбъектЭтаОбработка = РеквизитФормыВЗначение("Объект");
    ДвоичныеДанныеМакета = ОбъектЭтаОбработка.ПолучитьМакет("КонсольЗапросовУФ");
    
    Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанныеМакета);
    Возврат Адрес;
    
КонецФункции

&НаКлиенте
Функция ИзвлечьКонсольЗапросов()
    
    Адрес = ИзвлечьКонсольЗапросовНаСервере();
    
    //ДвоичныеДанныеМакета = ПолучитьИзВременногоХранилища(Адрес);
    //ДвоичныеДанныеМакета.Записать(ПутьКОбработкеКонсолиЗапросовУФ);
    //Возврат ПутьКОбработкеКонсолиЗапросовУФ;
    
    Возврат Адрес;
    
КонецФункции

&НаКлиенте
Функция ВыделенныйКод()
	
	Выделение = ПолучитьВыделение();
	
	ТекстовыйДок = Новый ТекстовыйДокумент;
    ВесьКод = ЭтаФорма.ПолеТекст.ПолучитьТекст();
    ТекстовыйДок.УстановитьТекст(ВесьКод);
    
    МассивСтрок = ИзСтрокиСРазделителямиИПозициямиСимвола(ЭтаФорма.ПолеТекст.ПолучитьТекст(), Символы.ПС);

    Буфер = "";
    
	Старт = Ложь;
	ПродолжитьОбработку = Ложь;
	Финиш = Ложь;
	
	Счетчик = 1;
	Для каждого Стр Из МассивСтрок Цикл
		
		Старт = Выделение.Начало >= Стр.ПозицияНачала И Выделение.Начало <= Стр.ПозицияКонец;
		Если Старт Тогда
			ПродолжитьОбработку = Истина;
		КонецЕсли;
		
		Если ПродолжитьОбработку Тогда
			
			ТекущийТекстСтроки = ТекстовыйДок.ПолучитьСтроку(Счетчик);
			
			Буфер = Буфер 
			+ ?(ПустаяСтрока(Буфер), "", Символы.ПС) 
			+ ТекущийТекстСтроки;	
				 		
			Финиш = Выделение.Окончание >= Стр.ПозицияНачала И Выделение.Окончание <= Стр.ПозицияКонец;
			Если Финиш Тогда
				ПродолжитьОбработку = Ложь;	 
			КонецЕсли;
			
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
	КонецЦикла;

    Возврат Буфер;
	
КонецФункции

&НаСервере
Процедура ЗаписатьПараметрыОткрытияКонсолиВФайл(ПараметрыКонсоли)
    Строкой = ЗначениеВСтрокуВнутр(ПараметрыКонсоли);
    ПараметрыЗаписьТекста = Новый ЗаписьТекста(КаталогВременныхФайлов() + "ЭКОМ_КонсольЗапросовПарамерыОткрытия.txt", КодировкаТекста.UTF8);
    ПараметрыЗаписьТекста.ЗаписатьСтроку(Строкой);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонсольЗапросов(Команда)
    
  
    АдресХранилища = ИзвлечьКонсольЗапросов();
    ИмяОбработки   = ПодключитьВнешнююКонсольЗапросовИзВремХранилища(АдресХранилища);
    
    СформироватьКодДляКонсолиЗапросов();
    ПараметрыКонсоли = Новый Структура("Наименование, Текст", "Docrobot" , КодДляКонсолиЗапросов);
    
    ЗаписатьПараметрыОткрытияКонсолиВФайл(ПараметрыКонсоли);
    
    ОкноОткрытия = Новый ОкноКлиентскогоПриложения;
    
    //ПоказатьВводСтроки(Новый ОписаниеОповещения, КодДляКонсолиЗапросов, "Выделенный код для консоли запросов", , Истина);
    //Если Метаданные.РежимИспользованияМодальности = РежимИспользованияМодальности.НеИспользовать Тогда
    //    ВвестиСтроку(текВыделенныйКод, "Выделенный код для консоли запросов", , Истина);
    //Иначе
    //    ПоказатьВводСтроки(Новый ОписаниеОповещения, текВыделенныйКод, "Выделенный код для консоли запросов", , Истина);
    //КонецЕсли;
    ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма", ПараметрыКонсоли, ,, ОкноОткрытия,,, );
    
КонецПроцедуры

&НаСервере
Функция ПодключитьВнешнююКонсольЗапросовИзВремХранилища(АдресХранилища)

    Защита = Новый ОписаниеЗащитыОтОпасныхДействий;
    
    Защита.ПредупреждатьОбОпасныхДействиях = Ложь;
    
    ИмяОбработкиВнешнейКонсоли = ВнешниеОбработки.Подключить(АдресХранилища,, Ложь, Защита);
    Возврат ИмяОбработкиВнешнейКонсоли;
   
КонецФункции  

Функция ПолучитьТекстЗапросаИзПеременнойКода(МассивЛогаСобытий)
    //КодДляКонсолиЗапросов = ВыделенныйКод();
    ТекстКода = ЭтаФорма.ПолеТекст.ПолучитьТекст();
    
    Попытка
        ОбъектЭтаОбработка = РеквизитФормыВЗначение("Объект");
        
        ПеременныеЗапросовСТекстомЗапроса = ОбъектЭтаОбработка.НайтиТекстыЗапросовВКоде(ТекстКода, МассивЛогаСобытий, Источник, НомерИсправленияНаФорме, Приемник);
        
        Если ПеременныеЗапросовСТекстомЗапроса = Неопределено Или ТипЗнч(ПеременныеЗапросовСТекстомЗапроса) <> Тип("СписокЗначений") Тогда
        	Возврат Неопределено;
        КонецЕсли;
        Если ПеременныеЗапросовСТекстомЗапроса.Количество() > 1 Тогда
            РезультатВыбора = ПеременныеЗапросовСТекстомЗапроса.ВыбратьЭлемент("Из какой переменной использовать текст запроса?");
            Если РезультатВыбора = Неопределено Тогда
                ТекстЗапроса = РезультатВыбора.Значение;
            КонецЕсли;
        Иначе
            ТекстЗапроса = ПеременныеЗапросовСТекстомЗапроса.Получить(0).Значение;
        КонецЕсли;
    Исключение
        Ошибка = ОписаниеОшибки();
        Попытка
            ОбъектЭтаОбработка.НайтиТекстыЗапросовВКоде(ТекстКода, МассивЛогаСобытий, Источник, НомерИсправленияНаФорме, Приемник);
        Исключение
            Ошибка = ОписаниеОшибки();
            ВызватьИсключение(Ошибка);
        КонецПопытки;
        
    КонецПопытки;
    Возврат ТекстЗапроса;
КонецФункции

&НаКлиенте
Процедура СформироватьКодДляКонсолиЗапросов()
    КодДляКонсолиЗапросов = ВыделенныйКод();
    Если ЗначениеЗаполнено(КодДляКонсолиЗапросов) = Ложь Тогда      
        МассивЛогаСобытий = Новый Массив; 
        КодДляКонсолиЗапросов = ПолучитьТекстЗапросаИзПеременнойКода(МассивЛогаСобытий);
		Если МассивЛогаСобытий.Количество() > 0  Тогда
			ТекстПредупрежедния = ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий);
			ПоказатьПредупреждение(,ТекстПредупрежедния,,"Есть ошибки при вычислении");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КодДляКонсолиЗапросов(Команда)
    СформироватьКодДляКонсолиЗапросов();
    Элементы.ГруппаШапка.ТекущаяСтраница = Элементы.ГруппаКодДляКонсолиЗапросов;
КонецПроцедуры

&НаКлиенте
Процедура НачДатаПриИзменении(Элемент)
    КорректностьДатНаФорме();
КонецПроцедуры

Процедура КорректностьДатНаФорме()
    
    Если НЕ ЗначениеЗаполнено(ЭтаФорма.ДатаНач) Тогда
        ЭтаФорма.ДатаНач 	= НачалоМесяца(ТекущаяДата());		
    Иначе
        ЭтаФорма.ДатаНач 	= НачалоДня(ЭтаФорма.ДатаНач);
    КонецЕсли;
    
    Если НЕ ЗначениеЗаполнено(ЭтаФорма.ДатаКон) Тогда
        ЭтаФорма.ДатаКон 	= КонецДня(ТекущаяДата());
    Иначе
        ЭтаФорма.ДатаКон 	= КонецДня(ЭтаФорма.ДатаКон);
    КонецЕсли;
    
    Если ЭтаФорма.ДатаНач 	> ЭтаФорма.ДатаКон Тогда 
        ЭтаФорма.ДатаНач 	= НачалоДня(ЭтаФорма.ДатаКон);
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КонДатаПриИзменении(Элемент)
    КорректностьДатНаФорме();
КонецПроцедуры

#КонецОбласти
//ТВС: КонецИзменений

////////////////////////////////////////////////////////////////////////////////
// Раскраска

&НаКлиенте
Функция ПолучитьРаскрашенныйТекст(Знач ТЗ) Экспорт 
	
	Цвет_КлючевыеСлова = WebЦвета.Красный;
	Цвет_Функции = WebЦвета.ТемноБордовый;
	Цвет_Комментарии = WebЦвета.Зеленый;
	Цвет_Параметр = WebЦвета.ЦианНейтральный;
	Цвет_Число = WebЦвета.Черный;
	Цвет_Текст = WebЦвета.Синий;
	
	СимволыНПП = Символы.НПП;
	
	ТЗ = СтрЗаменить(ТЗ, Символы.Таб, "    ");
	ТЗ = СтрЗаменить(ТЗ, СимволыНПП, " ");
	МассивФМС = Новый Массив;
	
	МассивСтрок = ИзСтрокиСРазделителями(ТЗ, Символы.ПС);
	КолСтрок = МассивСтрок.Количество();
	Для индСтрока = 0 По КолСтрок - 1 Цикл
		
		стрСтрока = МассивСтрок[индСтрока];
		
		Если Лев(СокрЛ(стрСтрока), 2)	= "//" Тогда
			МассивФМС.Добавить(Новый Структура("Строка, Цвет", стрСтрока, Цвет_Комментарии));
		ИначеЕсли Лев(СокрЛ(стрСтрока), 1)	= "|" И Прав(СокрП(стрСтрока),2) <> """;" Тогда
			МассивФМС.Добавить(Новый Структура("Строка, Цвет", стрСтрока, Цвет_Число));
		Иначе
			ПроверяемаяСтрока = ВРег(стрСтрока);
			Если НЕ ЗначениеЗаполнено(ПроверяемаяСтрока) Тогда
				 МассивФМС.Добавить(Новый Структура("Строка, Цвет", Символы.ПС, "ПереносСтроки"));
			Иначе
				МассивСлов = ПолучитьСписокСлов(стрСтрока);
				КолСлов = МассивСлов.Количество();
				Для индСлово = 0 По КолСлов - 1 Цикл
					
					стрСлово = МассивСлов[индСлово];
					
					Если ТипЗнч(стрСлово) = Тип("Структура") Тогда
						МассивФМС.Добавить(стрСлово);
						Продолжить;
					КонецЕсли;
					
					ПроверяемоеСлово = ВРег(стрСлово);
					
					Если форматирование_ЭтоКлючевоеСлово(ПроверяемоеСлово) Тогда
						МассивФМС.Добавить(Новый Структура("Строка, Цвет", стрСлово, Цвет_КлючевыеСлова));
					ИначеЕсли форматирование_ЭтоЧисло(стрСлово) Тогда
						МассивФМС.Добавить(Новый Структура("Строка, Цвет", стрСлово, Цвет_Число));
					Иначе  
						МассивФМС.Добавить(Новый Структура("Строка, Цвет", стрСлово, Цвет_Текст));
					КонецЕсли; 				
				КонецЦикла;
			КонецЕсли;				
		КонецЕсли; 
		
		Если индСтрока < КолСтрок - 1 
			И ЗначениеЗаполнено(стрСтрока) Тогда
			МассивФМС.Добавить(Новый Структура("Строка, Цвет", Символы.ПС, ""));
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если МассивФМС.Количество() = 0 Тогда
		Возврат Новый ФорматированнаяСтрока("");
	КонецЕсли;
	
	ФМС_Строка = "";
	Цвет_Текст = WebЦвета.Черный;
	ПредЦвет = МассивФМС[0].Цвет;
	Если ПредЦвет = "" Тогда
		ПредЦвет = Цвет_Текст;
	КонецЕсли;
	ФМС = Новый ФорматированнаяСтрока("");
	МассивФМСРез= Новый Массив;
	
	Для Каждого стрСлово Из МассивФМС Цикл
		Если стрСлово.Цвет = "" ИЛИ ПредЦвет = стрСлово.Цвет Тогда
			ФМС_Строка = ФМС_Строка + стрСлово.Строка;	
		Иначе
			Если ПредЦвет = Цвет_Текст Тогда
				МассивФМСРез.Добавить(ФМС_Строка);
			ИначеЕсли ПредЦвет = "ПереносСтроки" Тогда
				МассивФМСРез.Добавить(ФМС_Строка);
				ПредЦвет = "";
			Иначе
				МассивФМСРез.Добавить(Новый ФорматированнаяСтрока(ФМС_Строка,,ПредЦвет));
			КонецЕсли;
			
			ФМС_Строка = стрСлово.Строка;
			ПредЦвет = стрСлово.Цвет;
		КонецЕсли; 
	КонецЦикла;
	Если ПредЦвет = Цвет_Текст Тогда
		МассивФМСРез.Добавить(ФМС_Строка);
	Иначе
		Если ПредЦвет = "ПереносСтроки" Тогда
		    МассивФМСРез.Добавить(ФМС_Строка);
		Иначе	
		    МассивФМСРез.Добавить(Новый ФорматированнаяСтрока(ФМС_Строка,,ПредЦвет));
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(МассивФМСРез);
	
КонецФункции

&НаКлиенте
Функция ИзСтрокиСРазделителями(Знач вхСтр, вхРазделитель)
	
	Массив = Новый Массив;
	вхСтр = СтрЗаменить(вхСтр, вхРазделитель, Символы.ПС);
	ЧислоСтрок = СтрЧислоСтрок(вхСтр);
	Для Счетчик = 1 По ЧислоСтрок Цикл 
		Массив.Добавить(СтрПолучитьСтроку(вхСтр, Счетчик));
	КонецЦикла;
	Возврат Массив;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСписокСлов(Знач вхСтр)
	
	Цвет_КлючевыеСлова = WebЦвета.Красный;
	Цвет_Строка = WebЦвета.Черный;
	
	МассивРезультат = Новый Массив;
	
	ТекущееСлово = "";
	СтрДлинаСтр = СтрДлина(вхСтр);
	
	Для Поз = 1 По СтрДлинаСтр Цикл
		ТекущийСимвол = Сред(вхСтр, Поз, 1);
		
		Если ТекущийСимвол = " " Тогда
			
			Если ЗначениеЗаполнено(ТекущееСлово) Тогда
				МассивРезультат.Добавить(ТекущееСлово);
				ТекущееСлово = "";
			КонецЕсли;
			
			Пока ТекущийСимвол = " " и Поз <= СтрДлинаСтр Цикл
				ТекущееСлово = ТекущееСлово + Символы.НПП;
				Поз = Поз + 1;
				ТекущийСимвол = Сред(вхСтр, Поз, 1);
			КонецЦикла;
			МассивРезультат.Добавить(Новый Структура("Строка, Цвет", ТекущееСлово, ""));
			
			ТекущееСлово = "";
			
		КонецЕсли;
		
		Если Найти(",();=+-*<>'", ТекущийСимвол) > 0 Тогда
			
			Если ЗначениеЗаполнено(ТекущееСлово) Тогда
				МассивРезультат.Добавить(ТекущееСлово);
			КонецЕсли;
			
			//Если ТекущийСимвол = ">" Тогда
			//	МассивРезультат.Добавить(Новый Структура("Строка, Цвет", "&gt;", Цвет_КлючевыеСлова));  //Баг платформы нужен номер платформы
			//Иначе
				МассивРезультат.Добавить(Новый Структура("Строка, Цвет", ТекущийСимвол, Цвет_КлючевыеСлова));
			//КонецЕсли; 
			
			ТекущееСлово = "";
			
		ИначеЕсли ТекущийСимвол = """" ИЛИ  ТекущийСимвол = "|" Тогда
			
			Если ЗначениеЗаполнено(ТекущееСлово) Тогда
				МассивРезультат.Добавить(ТекущееСлово);
			КонецЕсли;
			
			ТекущееСлово = ТекущийСимвол;
			Поз = Поз + 1;
			ТекущийСимвол = Сред(вхСтр, Поз, 1);
			
			Пока ТекущийСимвол <> "|" и ТекущийСимвол <> """" и Поз <= СтрДлинаСтр Цикл
				ТекущееСлово = ТекущееСлово + ТекущийСимвол;
				Поз = Поз + 1;
				ТекущийСимвол = Сред(вхСтр, Поз, 1);
			КонецЦикла;
			МассивРезультат.Добавить(Новый Структура("Строка, Цвет", ТекущееСлово + ТекущийСимвол, Цвет_Строка));
			
			ТекущееСлово = "";
			
		Иначе
			
			ТекущееСлово = ТекущееСлово + ТекущийСимвол;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекущееСлово) Тогда
		МассивРезультат.Добавить(ТекущееСлово);
	КонецЕсли; 
	
	Возврат МассивРезультат;
	
КонецФункции

&НаКлиенте
Функция форматирование_ЭтоКлючевоеСлово(стрСлово)
	
	ПроверяемоеСлово = СокрЛП(стрСлово);
	
	СписокКлючевыхСлов = ";IF;ЕСЛИ;THEN;ТОГДА;ELSIF;ИНАЧЕЕСЛИ;ELSE;ИНАЧЕ;ENDIF;КОНЕЦЕСЛИ;DO;ЦИКЛ;FOR;ДЛЯ;TO;ПО;EACH;КАЖДОГО;IN;ИЗ;WHILE;ПОКА;ENDDO;КОНЕЦЦИКЛА;PROCEDURE;ПРОЦЕДУРА;ENDPROCEDURE;КОНЕЦПРОЦЕДУРЫ;FUNCTION;ФУНКЦИЯ;ENDFUNCTION;КОНЕЦФУНКЦИИ;VAR;ПЕРЕМ;EXPORT;ЭКСПОРТ;GOTO;ПЕРЕЙТИ;AND;И;OR;ИЛИ;NOT;НЕ;VAL;ЗНАЧ;BREAK;ПРЕРВАТЬ;CONTINUE;ПРОДОЛЖИТЬ;RETURN;ВОЗВРАТ;TRY;ПОПЫТКА;EXCEPT;ИСКЛЮЧЕНИЕ;ENDTRY;КОНЕЦПОПЫТКИ;RAISE;ВЫЗВАТЬИСКЛЮЧЕНИЕ;FALSE;ЛОЖЬ;TRUE;ИСТИНА;UNDEFINED;НЕОПРЕДЕЛЕНО;NULL;NEW;НОВЫЙ;EXECUTE;ВЫПОЛНИТЬ;";
	Возврат Найти(СписокКлючевыхСлов, ";"+ПроверяемоеСлово+";");
	
КонецФункции

&НаКлиенте
Функция форматирование_ЭтоЧисло(стрСлово)
	
	ЛевСимв = Лев(стрСлово, 1);
	Если ЛевСимв >= "0" и ЛевСимв <= "9" Тогда
		Возврат Истина; 
	КонецЕсли; 
	
	Возврат Ложь; 
	
КонецФункции

&НаКлиенте
Процедура ОбновитьЦветКода(Команда)
	
	Выделение = ПолучитьВыделение();		
	ЭтаФорма.ПолеЗапроса.УстановитьФорматированнуюСтроку(ПолучитьРаскрашенныйТекст(ПолеЗапроса.ПолучитьТекст()));	
	УстановитьВыделение(Выделение.Начало, Выделение.Окончание);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьВыделение()	
	
	ПозицияНачала    = 0; // позиция начала выделения
    ПозицияОкончания = 0; // позиция конца выделения
    Начало           = 0; 
	Окончание        = 0;
	
	ЗакладкаНачало = ЭтаФорма.ПолеЗапроса.ПолучитьЗакладкуНачала();
	ЗакладкаКонца = ЭтаФорма.ПолеЗапроса.ПолучитьЗакладкуКонца();
	Элементы.ПолеЗапроса.ПолучитьГраницыВыделения(Начало, Окончание);
	
	Начало    = ЭтаФорма.ПолеЗапроса.ПолучитьПозициюПоЗакладке(ЗакладкаНачало);
	Окончание = ЭтаФорма.ПолеЗапроса.ПолучитьПозициюПоЗакладке(ЗакладкаКонца);
	
	Результат = Новый Структура;
	Результат.Вставить("ЗакладкаНачало"   , ЗакладкаНачало); 
	Результат.Вставить("ЗакладкаОкончание", ЗакладкаКонца);
	Результат.Вставить("Начало"           , Начало); 
	Результат.Вставить("Окончание"        , Окончание);
		
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьВыделение(Начало, Окончание)
	
	Если ТекущийЭлемент.Имя = "ПолеЗапроса" Тогда
		ПозицияНачала = ЭтаФорма.ПолеЗапроса.ПолучитьЗакладкуПоПозиции(Начало);
		ПозицияОкончания = ЭтаФорма.ПолеЗапроса.ПолучитьЗакладкуПоПозиции(Окончание);
		Элементы.ПолеЗапроса.УстановитьГраницыВыделения(ПозицияНачала,ПозицияОкончания);
	КонецЕсли;
		
КонецПроцедуры 

&НаКлиенте
Функция ИзСтрокиСРазделителямиИПозициямиСимвола(Знач вхСтр, вхРазделитель)
	
	Массив = Новый Массив;
	вхСтр = СтрЗаменить(вхСтр, вхРазделитель, Символы.ПС);
	ЧислоСтрок = СтрЧислоСтрок(вхСтр);
	
	ПозицияНачала = 0;
	ПозицияКонец = 0;
	Для Счетчик = 1 По ЧислоСтрок Цикл 
		
		ТекСтрока = СтрПолучитьСтроку(вхСтр, Счетчик);
		
		ПозицияКонец = ПозицияНачала + СтрДлина(ТекСтрока); 
		
		Структура = Новый Структура;
		Структура.Вставить("Строка", ТекСтрока);		
		Структура.Вставить("ПозицияНачала", ПозицияНачала);
		Структура.Вставить("ПозицияКонец", ПозицияКонец);
		
		ПозицияНачала = ПозицияКонец + 1;
		
		Массив.Добавить(Структура);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
Процедура ПерейтиКСтроке(Команда)
	Подсказка = "Введите номер строки для перехода";
	Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки", ЭтаФорма);
	ПоказатьВводСтроки(Оповещение, "", Подсказка);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСтроки(Строка, Параметры) Экспорт
	
	Если НЕ Строка = Неопределено Тогда
		НомерСтроки = ЭКОМ_ОбщегоНазначенияКлиент.ЭКОМ_ПреобразоватьВЧислоОбщегоНазначения(Строка);
		МассивСтрок = ИзСтрокиСРазделителямиИПозициямиСимвола(ЭтаФорма.ПолеЗапроса.ПолучитьТекст(), Символы.ПС);
		Если НомерСтроки <= МассивСтрок.Количество()  
			И НомерСтроки > 0 Тогда
			СтрокаТекста = МассивСтрок[НомерСтроки-1];
			
		ИначеЕсли НомерСтроки = 0 Тогда
			СтрокаТекста = МассивСтрок[0]; 
		Иначе
			СтрокаТекста = МассивСтрок[МассивСтрок.Количество()-1]; 
		КонецЕсли;
		УстановитьВыделение(СтрокаТекста.ПозицияНачала, СтрокаТекста.ПозицияКонец);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БуферВырезать(Команда)
	Выделение = ПолучитьВыделение();
	ЭтаФорма.БуферТекст = ЭтаФорма.ПолеЗапроса.ПолучитьТекст(Выделение.ЗакладкаНачало, Выделение.ЗакладкаОкончание);
	ЭтаФорма.ПолеЗапроса.Удалить(Выделение.ЗакладкаНачало, Выделение.ЗакладкаОкончание); 
КонецПроцедуры

&НаКлиенте
Процедура БуферВставить(Команда)
	Выделение = ПолучитьВыделение();
	ЭтаФорма.ПолеЗапроса.Вставить(Выделение.ЗакладкаНачало, ЭтаФорма.БуферТекст);	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонструкторЗапросаТекст(Команда)
	
	Перем ОписаниеОповещения;

	//#Если НЕ ТолстыйКлиент И НЕ ТолстыйКлиентУправляемоеПриложение Тогда
	//	Сообщить("Конструктор запроса можно вызывать только в толстом клиенте");
	//	Возврат;
	//#КонецЕсли
		
	//БЛОК №1 - ИНИЦИАЛИЗАЦИЯ ПЕРЕМЕННЫХ
	ЭлементПоляТекст = Элементы.ПолеТекст;
	Кавычка = """";
	ДвойнаяКавычка = """""";   
	ЗаменаДляДвойнойКавычки = Строка(Новый УникальныйИдентификатор);	
	КоличествоСтрок = ПолучитьСтрЧислоСтрокСервер(ЭтаФорма.ПолеТекст.ПолучитьТекст());  

	НачалоСтроки = 0;
	НачалоКолонки = 0;
	КонецСтроки = 0;
	КонецКолонки = 0;
	
	ЭлементПоляТекст.ПолучитьГраницыВыделения(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки);
	ЭлементПоляТекст.УстановитьГраницыВыделения(НачалоСтроки, НачалоКолонки, Началостроки, НачалоКолонки);
	//----------------------------------------------
	
	
	//БЛОК №2 - ОПРЕДЕЛЕНИЕ ТЕКСТА ДО КУРСОРА И ПОСЛЕ КУРСОРА	
	ЭлементПоляТекст.УстановитьГраницыВыделения(1, 1, Началостроки, НачалоКолонки);
	ТекстДоКурсора = ЭлементПоляТекст.ВыделенныйТекст;			
	ЭлементПоляТекст.УстановитьГраницыВыделения(НачалоСтроки, НачалоКолонки, КоличествоСтрок+1, 1);
	ТекстПослеКурсора = ЭлементПоляТекст.ВыделенныйТекст;
	
	ЭлементПоляТекст.УстановитьГраницыВыделения(НачалоСтроки, НачалоКолонки, Началостроки, НачалоКолонки);	
	
	//гарантируем отсутствие в тексте двойных кавычек
	ТекстДоКурсора = СтрЗаменить(ТекстДоКурсора, ДвойнаяКавычка, ЗаменаДляДвойнойКавычки); 	
	//в тексте после курсора необходимо оставить первую кавычку, если сразу после нее идет двойная
	//случай подряд идущих кавычек в количестве более 5-ти штук обрабатывать не будем
	ТекстПослеКурсора =  СтрЗаменить(Лев(ТекстПослеКурсора, 1) + 
				СтрЗаменить(Сред(ТекстПослеКурсора, 2), ДвойнаяКавычка, ЗаменаДляДвойнойКавычки) , ДвойнаяКавычка, ЗаменаДляДвойнойКавычки) ; 
	//----------------------------------------------
	
	
	//БЛОК №3 - ИЩЕМ ПОЗИЦИЮ ОТКРВАЮЩЕЙ И ЗАКРЫВАЮЩЕЙ КАВЫЧКИ ДЛЯ СТРОКИ ЗАПРОСА
	
	ПозицияОткрывающейКавычки = 0;
	ПозицияЗакрывающейКавычки = 0;
		
	ВСтроке = Ложь;
	КавычкиЕсть = Ложь;
	ПозицияПредыдущейКавычки = 0;
	ПоизцияПоследнейКавычки = 0;	
	
	Позиция = 1;
	ДлинаТекстаДоКурсора = СтрДлина(ТекстДоКурсора);
	
	//ИЩЕМ ОТКРЫВАЮЩУЮ КАВЫЧКУ
	Пока Позиция <= ДлинаТекстаДоКурсора Цикл
		
		ТекущийСимвол = Сред(ТекстДоКурсора, Позиция, 1);
		
		ПредыдущийСимвол = " "; 
		Если Позиция > 1 Тогда
			ПредыдущийСимвол = Сред(ТекстДоКурсора, Позиция-1, 1);
		КонецЕсли;						
		
		Если ТекущийСимвол = Кавычка Тогда
			ВСтроке = НЕ ВСтроке;
			ПозицияПредыдущейКавычки = ПоизцияПоследнейКавычки;
			ПоизцияПоследнейКавычки = Позиция;
			КавычкиЕсть = Истина;
		КонецЕсли;
				
		//Обработка комментария - начало
		Если НЕ ВСтроке И ПредыдущийСимвол = "/" И ТекущийСимвол = "/" Тогда 
			//это комментарий, пропускаем символы до конца строки
			Пока ТекущийСимвол <> Символы.LF И ТекущийСимвол <> Символы.CR Цикл				
                Позиция = Позиция +1;
				Если Позиция > ДлинаТекстаДоКурсора Тогда
					Прервать;
				КонецЕсли;				
				ТекущийСимвол = Сред(ТекстДоКурсора, Позиция, 1);
			КонецЦикла;
			
			Продолжить; 
		КонецЕсли;
		//Обработка комментария - конец
			
		Позиция = Позиция + 1;				
	КонецЦикла;
	
	//ОСОБЫМ ОБРАЗОМ ОБРАБОТАЕМ СЛУЧАЙ НАХОЖДЕНИЯ КУРСОРА В 
	//ДВОЙНОЙ КАВЫЧКЕ ВНУТРИ СТРОКИ ЗАПРОСА
	Если НЕ ВСтроке И КавычкиЕсть И СтрДлина(ТекстПослеКурсора) > 0 Тогда
		Если  Сред(ТекстДоКурсора, ДлинаТекстаДоКурсора, 1) = Кавычка И Лев(ТекстПослеКурсора,1) = Кавычка Тогда
			ВСтроке = Истина;
			ПоизцияПоследнейКавычки = ПозицияПредыдущейКавычки;			
			ТекстДоКурсора = Лев(ТекстДоКурсора, ДлинаТекстаДоКурсора-1);
			ТекстПослеКурсора = ЗаменаДляДвойнойКавычки + Сред(ТекстПослеКурсора, 2);
		КонецЕсли;
	КонецЕсли;			
	
	//ЕСЛИ НАШИЛИ ОТКРЫВАЮЩУЮ КАВЫЧКУ, ТО ИЩЕМ ЗАКРЫВАЮЩУЮ
	Если ВСтроке Тогда
		ПозицияОткрывающейКавычки = ПоизцияПоследнейКавычки;
		ПозицияЗакрывающейКавычки = Найти(ТекстПослеКурсора, Кавычка);		
	КонецЕсли;
				
	//----------------------------------------------
		
	//БЛОК №4 - ОПРЕДЕЛЯЕМ ТЕКСТ ДО ЗАПРОСА, ТЕКСТ ЗАПРОСА И ТЕКСТ ПОСЛЕ ЗАПРОСА
	//ПОСЛЕ ЧЕГО ВОЗРАЩАЕМ ДВОЙНЫЕ КАВЫЧКИ В КОД, НЕ ЯВЛЯЮЩИЙСЯ ЧАСТЬЮ ЗАПРОСА
	
	Конструктор = Новый("КонструкторЗапроса");
	ГраницыЗапросаНайдены = ПозицияОткрывающейКавычки <> 0 И ПозицияЗакрывающейКавычки <> 0;
		
	
	Если НЕ ГраницыЗапросаНайдены Тогда		
		Сообщение = "ЗАПРОС НЕ ОБНАРУЖЕН, БУДЕТ СОЗДАН НОВЫЙ ЗАПРОС";
		ПоказатьОповещениеПользователя(Сообщение, , Сообщение);
		ТекстДоНачалаЗапроса = ТекстДоКурсора + Кавычка;
		ТекстПослеКонцаЗапроса = Кавычка + ТекстПослеКурсора ;					
	Иначе
		
		ТекстДоНачалаЗапроса = Лев(ТекстДоКурсора, ПозицияОткрывающейКавычки);		
		ТекстПослеКонцаЗапроса = Сред(ТекстПослеКурсора, ПозицияЗакрывающейКавычки);		
		
		ТекстЗапросаССимвовамиВертикальнойЧерты = Сред(ТекстДоКурсора, ПозицияОткрывающейКавычки + 1) + Лев(ТекстПослеКурсора, ПозицияЗакрывающейКавычки -1);	
		//для конструктора запроса вместо двойной кавычки будем подставлять одинарную
		ТекстЗапросаССимвовамиВертикальнойЧерты = СтрЗаменить(ТекстЗапросаССимвовамиВертикальнойЧерты, ЗаменаДляДвойнойКавычки, Кавычка); 
		
		КоличествоСтрокВТексте = СтрЧислоСтрок(ТекстЗапросаССимвовамиВертикальнойЧерты);
		ТекстЗапроса = "";	
		Для К = 1 To КоличествоСтрокВТексте Цикл
			СтрокаИзТекстаЗапроса = СокрЛП(СтрПолучитьСтроку(ТекстЗапросаССимвовамиВертикальнойЧерты, К));
			Если Лев(СтрокаИзТекстаЗапроса, 1) = "|" Тогда
				//для конструктора запроса убираем вертикальную черту в начале строки
				СтрокаИзТекстаЗапроса = Сред(СтрокаИзТекстаЗапроса, 2); 
			КонецЕсли;
			                                            
			ТекстЗапроса = ТекстЗапроса + СтрокаИзТекстаЗапроса + Символы.LF;
		КонецЦикла;
		
		Конструктор.Текст = ТекстЗапроса;
	КонецЕсли;
		
	//возвращаем двойные кавычки
	ТекстДоНачалаЗапроса = СтрЗаменить(ТекстДоНачалаЗапроса, ЗаменаДляДвойнойКавычки, ДвойнаяКавычка); 
	ТекстПослеКонцаЗапроса = СтрЗаменить(ТекстПослеКонцаЗапроса, ЗаменаДляДвойнойКавычки, ДвойнаяКавычка); 
		
	
	//БЛОК №5 - ОТКРЫВАЕМ КОНСТРУКТОР ЗАПРОСА С ПОЛУЧЕННОЙ СТРОКОЙ ЗАПРОСА И В СЛУЧАЕ УСПЕШНОГО
	//РЕЗУЛЬТАТА ВЫЧИСЛЯЕМ ОТСТУП, КОТОРЫЙ БУДЕМ ДОБАВЛЯТЬ К КАЖДОЙ СТРОКЕ ЗАПРОСА	
	
	#Если ТолстыйКлиентУправляемоеПриложение Тогда
		Попытка
			Если НЕ Конструктор.ОткрытьМодально() Тогда
				Возврат;
			КонецЕсли;	
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	#КонецЕсли
	
	ТекстЗапроса = Конструктор.Текст;	
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ДлинаТекстаДоНачалаЗапроса = СтрДлина(ТекстДоНачалаЗапроса);
	Позиция = ДлинаТекстаДоНачалаЗапроса-1; 

	Пока Позиция >= 1 Цикл		
		Если Сред(ТекстДоНачалаЗапроса, Позиция, 1) = Символы.LF Тогда			
			Прервать;
		КонецЕсли;		
		Позиция = Позиция - 1;
	КонецЦикла;
	                     
	СтрокаОтступа = Сред(ТекстДоНачалаЗапроса, Позиция+1, ДлинаТекстаДоНачалаЗапроса - Позиция -1);
	ДлинаСтрокиОтступа = СтрДлина(СтрокаОтступа);
	СтрокаОтступаИзПробеловИТабуляций = "";
	

	Для К = 1 To ДлинаСтрокиОтступа Цикл
		Если Сред(СтрокаОтступа, К, 1) = Символы.Tab Тогда
			СтрокаОтступаИзПробеловИТабуляций = СтрокаОтступаИзПробеловИТабуляций + Символы.Tab;
		Иначе 
			СтрокаОтступаИзПробеловИТабуляций = СтрокаОтступаИзПробеловИТабуляций + " ";
		КонецЕсли;
	КонецЦикла;	

	Дополнительно = Новый Структура;
    Дополнительно.Вставить("Кавычка", Кавычка);
	Дополнительно.Вставить("ДвойнаяКавычка", ДвойнаяКавычка);
	Дополнительно.Вставить("СтрокаОтступаИзПробеловИТабуляций", СтрокаОтступаИзПробеловИТабуляций);
	Дополнительно.Вставить("ТекстДоНачалаЗапроса", ТекстДоНачалаЗапроса);
	Дополнительно.Вставить("ТекстПослеКонцаЗапроса", ТекстПослеКонцаЗапроса);
	Дополнительно.Вставить("НачалоСтроки", НачалоСтроки);
	
	
	
	#Если ТолстыйКлиентУправляемоеПриложение Тогда
    СконструированЗапросТекст(ТекстЗапроса, Дополнительно);
	Возврат;
	#КонецЕсли

	// Для тонкого клиента
	Попытка	
		Выполнить("ОписаниеОповещения = Новый ОписаниеОповещения(""СконструированЗапросТекст"", ЭтаФорма, Дополнительно)");
		// попытаемся создать конструктор для 8.3.5
		Конструктор = Неопределено;
		Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
			Выполнить("Конструктор = Новый КонструкторЗапроса(ТекстЗапроса);");
		Иначе
			Выполнить("Конструктор = Новый КонструкторЗапроса();");
		КонецЕсли;
		Выполнить("Конструктор.Показать(ОписаниеОповещения)");
		Возврат;
	Исключение
		Ошибка = ОписаниеОшибки();
		Если Найти(Ошибка,"Тип не определен")>0 Тогда
			ПоказатьОповещениеПользователя("Конструктор",,"Конструктор запроса для тонкого клиента доступен с версии 8.3.5!");
		Иначе
			Сообщить(Ошибка);
		КонецЕсли;
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ГруппаШапкаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя = "ГруппаЗапрос" Тогда
	    ЭтаФорма.ПолеЗапроса.УстановитьФорматированнуюСтроку(ПолучитьРаскрашенныйТекст(ПолеТекст.ПолучитьТекст()));
	КонецЕсли;
КонецПроцедуры
