#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Выполняет обработку установки даты начала ведения УУ на плане счетов Хозрасчетный:
// - возвращает документы к отражению в регл. учете начиная с даты начала ведения УУ
// - очищает ресурс СуммаУУ в движениях регистра Хозрасчетный ранее даты начала ведения УУ.
//
Процедура ОбработкаУстановкиДатыНачалаУУНаПланеСчетовХозрасчетный(Параметры, АдресХранилища) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаНачалаУУ = Константы.ДатаНачалаУУНаПланеСчетовХозрасчетный.Получить();
	
	Результат = Новый Структура;
	Результат.Вставить("ВозвращеноКОтражению", 0);
	Результат.Вставить("ОчищенаСуммаУУ", 0);
	
	НачатьТранзакцию();
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОтражениеДокументовВРеглУчете.Регистратор
		|ИЗ
		|	РегистрСведений.ОтражениеДокументовВРеглУчете КАК ОтражениеДокументовВРеглУчете
		|ГДЕ
		|	ОтражениеДокументовВРеглУчете.ДатаОтражения >= &ДатаНачалаУУ
		|	И НЕ ОтражениеДокументовВРеглУчете.Статус В (
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыОтраженияДокументовВРеглУчете.КОтражениюВРеглУчете),
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыОтраженияДокументовВРеглУчете.КОтражениюВУчетеВручную))
		|;
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Хозрасчетный.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	Хозрасчетный.Период < &ДатаНачалаУУ
		|	И Хозрасчетный.СуммаУУ <> 0
		|	И НЕ ТИПЗНАЧЕНИЯ(Хозрасчетный.Регистратор) В (
		|			ТИП(Документ.ВводОстатков),
		|			ТИП(Документ.ОперацияБух))
		|";
		Запрос.УстановитьПараметр("ДатаНачалаУУ", ДатаНачалаУУ); 
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ОтражениеВРеглУчете = РезультатЗапроса[0];
		ВыборкаОтражениеВРеглУчете = ОтражениеВРеглУчете.Выбрать();
		КоличествоВозвращеноКОтражению = ВыборкаОтражениеВРеглУчете.Количество();
		
		Хозрасчетный = РезультатЗапроса[1];
		ВыборкаХозрасчетный = Хозрасчетный.Выбрать();
		КоличествоОчищенаСуммаУУ = ВыборкаХозрасчетный.Количество();

		Блокировка = Новый БлокировкаДанных;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОтражениеДокументовВРеглУчете.НаборЗаписей");
		ЭлементБлокировки.ИсточникДанных = ОтражениеВРеглУчете;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Регистратор", "Регистратор");
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрБухгалтерии.Хозрасчетный.НаборЗаписей");
		ЭлементБлокировки.ИсточникДанных = Хозрасчетный;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Регистратор", "Регистратор");
		
		Блокировка.Заблокировать();
		
		// Вернем документы к отражению в регл. учете
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ОтражениеДокументовВРеглУчете.Регистратор КАК Документ,
		|	ОтражениеДокументовВРеглУчете.Организация КАК Организация,
		|	ОтражениеДокументовВРеглУчете.ДатаОтражения КАК ДатаОтражения
		|ПОМЕСТИТЬ ДокументыКОтражению
		|ИЗ
		|	РегистрСведений.ОтражениеДокументовВРеглУчете КАК ОтражениеДокументовВРеглУчете
		|ГДЕ
		|	ОтражениеДокументовВРеглУчете.ДатаОтражения >= &ДатаНачалаУУ
		|";
		Запрос.УстановитьПараметр("ДатаНачалаУУ", ДатаНачалаУУ); 
		Запрос.Выполнить();
		
		РеглУчетПроведениеСервер.ВернутьДокументыКОтражению(МенеджерВременныхТаблиц);
		Результат.ВозвращеноКОтражению = КоличествоВозвращеноКОтражению;
		
		// Очистим ресурс СуммаУУ
		Пока ВыборкаХозрасчетный.Следующий() Цикл
			
			НаборЗаписей = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаХозрасчетный.Регистратор);
			НаборЗаписей.Прочитать();
			
			Для каждого Запись Из НаборЗаписей Цикл
				Если Запись.СуммаУУ <> 0 Тогда
					Запись.СуммаУУ = 0;
				КонецЕсли;
			КонецЦикла;
			
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
			
		КонецЦикла;
		Результат.ОчищенаСуммаУУ = КоличествоОчищенаСуммаУУ;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось вернуть документы к отражению по причине: %1'"),
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Установка даты начала УУ на плане счетов Хозрасчетный.'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), 
				УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
				
		ВызватьИсключение ТекстСообщения;
		
	КонецПопытки;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыКОтражению.Документ 
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|ГДЕ ТИПЗНАЧЕНИЯ(ДокументыКОтражению.Документ) = ТИП(Документ.СчетФактураВыданныйАванс)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		МассивДокументов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Документ");
	    Документы.СчетФактураВыданныйАванс.СформироватьДвиженияПоКнигамПокупокПродаж(МассивДокументов);
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыКОтражению.Документ 
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|ГДЕ ТИПЗНАЧЕНИЯ(ДокументыКОтражению.Документ) = ТИП(Документ.СчетФактураПолученныйАванс)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		МассивДокументов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Документ");
		Документы.СчетФактураПолученныйАванс.СформироватьДвиженияПоКнигеПродаж(МассивДокументов);
	КонецЕсли;
		
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыКОтражению.Документ 
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|ГДЕ ТИПЗНАЧЕНИЯ(ДокументыКОтражению.Документ) = ТИП(Документ.СчетФактураНалоговыйАгент)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		МассивДокументов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Документ");
		Документы.СчетФактураНалоговыйАгент.СформироватьДвиженияНДС(МассивДокументов);
	КонецЕсли;
		
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли