
#Область ПрограммныйИнтерфейс

Функция ВыгрузитьДанныеДляСайта(ДокументСсылка) Экспорт
	
	Запрос	= Новый Запрос;
	Запрос.Текст = ТекстЗапросаДанныеДокумента();
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Выборка	= Запрос.Выполнить().Выбрать();
	
	Запись	= Новый ЗаписьXML;
	Запись.УстановитьСтроку("UTF-8");
	Запись.ЗаписатьОбъявлениеXML();
	
	Запись.ЗаписатьНачалоЭлемента("discounts");
	
	Пока Выборка.Следующий() Цикл
		
		Запись.ЗаписатьНачалоЭлемента("item");

		Запись.ЗаписатьБезОбработки(
			СтрШаблон(
			"
			|		<articul>%1</articul>
			|		<name>%2</name>
			|		<discountType>%3</discountType>
			|		<dicsountValue>%4</dicsountValue>
			|		<activeFrom>%5</activeFrom>
			|		<activeTo>%6</activeTo>", 
			СокрЛП(Выборка.Артикул),
			СокрЛП(Выборка.Наименование),
			"fixed",
			Формат(Выборка.Цена, "ЧЦ=15; ЧДЦ=0; ЧГ="),
			Формат(Выборка.ДатаНачала, "ДФ=dd.MM.yyyy"),
			Формат(Выборка.ДатаОкончания, "ДФ=dd.MM.yyyy")));
		
		Запись.ЗаписатьКонецЭлемента();
		
	КонецЦикла;
	
	Запись.ЗаписатьКонецЭлемента();
	
	Возврат Запись.Закрыть();
	
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДанныеДокумента()
	
	ТекстЗапроса	= 
	"ВЫБРАТЬ
	|	игр_НоменклатураМаркетинговыхАкцийТовары.Номенклатура.Артикул КАК Артикул,
	|	игр_НоменклатураМаркетинговыхАкцийТовары.Номенклатура.Наименование КАК Наименование,
	|	игр_НоменклатураМаркетинговыхАкцийТовары.Цена КАК Цена,
	|	игр_НоменклатураМаркетинговыхАкцийТовары.Ссылка.ДатаНачала КАК ДатаНачала,
	|	игр_НоменклатураМаркетинговыхАкцийТовары.Ссылка.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	Документ.игр_НоменклатураМаркетинговыхАкций.Товары КАК игр_НоменклатураМаркетинговыхАкцийТовары
	|ГДЕ
	|	игр_НоменклатураМаркетинговыхАкцийТовары.Ссылка = &Ссылка"
	;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти 
