&НаКлиенте
Перем ОбработкаКС Экспорт;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Обход ошибки платформы "Параметр сеанса отсутствует или удален".
	ТабличныйДокумент.Очистить();
	
	СформироватьСтруктуруРеквизитовФормы();
	
	СоответствиеЕдиницыИзмеренияДелителю = Новый Структура;
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1", 1);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000", 1000);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000000", 1000000);
	
	// ОПИСАНИЕ ПАРАМЕТРОВ МНОГОСТРОЧНЫХ ГРУПП
	// Идентификаторы многострочных групп
   	СтруктураРеквизитовФормы.мИдГруппы11  = "П0001100002";
	СтруктураРеквизитовФормы.мИдГруппы12  = "П0001200002";
	СтруктураРеквизитовФормы.мИдГруппы13  = "П0001300002";
	СтруктураРеквизитовФормы.мИдГруппы14  = "П0001400002";
	СтруктураРеквизитовФормы.мИдГруппы15  = "П0001500002";
	СтруктураРеквизитовФормы.мИдГруппы16  = "П0001600002";

	СтруктураРеквизитовФормы.мИдГруппы21  = "П0002100002";
	СтруктураРеквизитовФормы.мИдГруппы22  = "П0002200002";
	СтруктураРеквизитовФормы.мИдГруппы23  = "П0002300002";
	СтруктураРеквизитовФормы.мИдГруппы24  = "П0002400002";
	СтруктураРеквизитовФормы.мИдГруппы25  = "П0002500002";
	СтруктураРеквизитовФормы.мИдГруппы26  = "П0002600002";
   	СтруктураРеквизитовФормы.мИдГруппы27  = "П0002700002";
	СтруктураРеквизитовФормы.мИдГруппы28  = "П0002800002";
    
    //910.01
	КолИсхСтрокИдГруппы11  = 1;
	КолИсхСтрокИдГруппы12  = 1;
	КолИсхСтрокИдГруппы13  = 1;
	КолИсхСтрокИдГруппы14  = 1;
	КолИсхСтрокИдГруппы15  = 1;
	КолИсхСтрокИдГруппы16  = 1;

	//910.02
	КолИсхСтрокИдГруппы21  = 1;
	КолИсхСтрокИдГруппы22  = 1;
	КолИсхСтрокИдГруппы23  = 1;
	КолИсхСтрокИдГруппы24  = 1;
	КолИсхСтрокИдГруппы25  = 1;
	КолИсхСтрокИдГруппы26  = 1;
   	КолИсхСтрокИдГруппы27  = 1;
	КолИсхСтрокИдГруппы28  = 1;
	    	
	//910.01
	КолКолонокИдГруппы11 = 6;
	КолКолонокИдГруппы12 = 5;
	КолКолонокИдГруппы13 = 5;
	КолКолонокИдГруппы14 = 5;
	КолКолонокИдГруппы15 = 5;
	КолКолонокИдГруппы16 = 2;

	//910.02
	КолКолонокИдГруппы21 = 6;
	КолКолонокИдГруппы22 = 5;
	КолКолонокИдГруппы23 = 7;
	КолКолонокИдГруппы24 = 5;
	КолКолонокИдГруппы25 = 5;
	КолКолонокИдГруппы26 = 5;
   	КолКолонокИдГруппы27 = 5;
	КолКолонокИдГруппы28 = 3;

	СтруктураДанныхФорма910Страница1        = Новый Структура;
	СтруктураДанныхФорма910Страница2        = Новый Структура;
	СтруктураДанныхФорма910Страница3        = Новый Структура;
    
    СтруктураДанныхФорма910_01Страница1     = Новый Структура;
	СтруктураДанныхФорма910_01Страница2     = Новый Структура;
	СтруктураДанныхФорма910_01Страница3     = Новый Структура;
	СтруктураДанныхФорма910_01Страница4     = Новый Структура;
	СтруктураДанныхФорма910_01Страница5     = Новый Структура;
	СтруктураДанныхФорма910_01Страница6     = Новый Структура;
	
	СтруктураДанныхФорма910_02Страница1     = Новый Структура;
	СтруктураДанныхФорма910_02Страница2     = Новый Структура;
	СтруктураДанныхФорма910_02Страница3     = Новый Структура;
	СтруктураДанныхФорма910_02Страница4     = Новый Структура;
	СтруктураДанныхФорма910_02Страница5     = Новый Структура;
	СтруктураДанныхФорма910_02Страница6     = Новый Структура;
    СтруктураДанныхФорма910_02Страница7     = Новый Структура;
	СтруктураДанныхФорма910_02Страница8     = Новый Структура;	
    
	СтруктураРеквизитовФормы.СписокПечатаемыхЛистов = Новый СписокЗначений;
	СтруктураРеквизитовФормы.мПечатныеформы = Новый СписокЗначений;
	
	// структура многострочных разделов формы
	мСтруктураМногострочныхРазделов = Новый Структура;

	//910.01
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы11,  СтруктураРеквизитовФормы.мИдГруппы11);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы12,  СтруктураРеквизитовФормы.мИдГруппы12);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы13,  СтруктураРеквизитовФормы.мИдГруппы13);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы14,  СтруктураРеквизитовФормы.мИдГруппы14);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы15,  СтруктураРеквизитовФормы.мИдГруппы15);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы16,  СтруктураРеквизитовФормы.мИдГруппы16);

   	//910.02
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы21,  СтруктураРеквизитовФормы.мИдГруппы21);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы22,  СтруктураРеквизитовФормы.мИдГруппы22);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы23,  СтруктураРеквизитовФормы.мИдГруппы23);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы24,  СтруктураРеквизитовФормы.мИдГруппы24);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы25,  СтруктураРеквизитовФормы.мИдГруппы25);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы26,  СтруктураРеквизитовФормы.мИдГруппы26);
    мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы27,  СтруктураРеквизитовФормы.мИдГруппы27);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы28,  СтруктураРеквизитовФормы.мИдГруппы28);

	// Структура содержит данные дополнительных страниц
	мСтруктураМногостраничныхРазделов = Новый Структура;
	
	// структура исходных строк (минимального кол-ва) многострочных разделов формы
	мСтруктураИсхКолвоСтрокРазделов = Новый Структура;
	
	//910.02
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы21, КолИсхСтрокИдГруппы21);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы22, КолИсхСтрокИдГруппы22);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы23, КолИсхСтрокИдГруппы23);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы24, КолИсхСтрокИдГруппы24);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы25, КолИсхСтрокИдГруппы25);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы26, КолИсхСтрокИдГруппы26);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы27, КолИсхСтрокИдГруппы27);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы28, КолИсхСтрокИдГруппы28);

	//910.01
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы11, КолИсхСтрокИдГруппы11);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы12, КолИсхСтрокИдГруппы12);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы13, КолИсхСтрокИдГруппы13);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы14, КолИсхСтрокИдГруппы14);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы15, КолИсхСтрокИдГруппы15);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы16, КолИсхСтрокИдГруппы16);
	
	мСтруктураКолвоКолонокРазделов = Новый Структура;
	//910.02
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы21, КолКолонокИдГруппы21);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы22, КолКолонокИдГруппы22);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы23, КолКолонокИдГруппы23);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы24, КолКолонокИдГруппы24);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы25, КолКолонокИдГруппы25);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы26, КолКолонокИдГруппы26);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы27, КолКолонокИдГруппы27);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы28, КолКолонокИдГруппы28);

	//910.1
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы11, КолКолонокИдГруппы11);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы12, КолКолонокИдГруппы12);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы13, КолКолонокИдГруппы13);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы14, КолКолонокИдГруппы14);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы15, КолКолонокИдГруппы15);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы16, КолКолонокИдГруппы16);
	
	СтруктураРеквизитовФормы.мВыбраннаяФорма          = Параметры.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета  = Параметры.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета = Параметры.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мПериодичность           = Параметры.мПериодичность;
	СтруктураРеквизитовФормы.мСкопированаФорма        = Параметры.мСкопированаФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок          = Параметры.мСохраненныйДок;
	СтруктураРеквизитовФормы.Организация              = Параметры.Организация;
	СтруктураРеквизитовФормы.ВидДокумента             = 0;
	мСписокСтруктурныхЕдиниц                          = Параметры.СписокСтруктурныхЕдиниц;
	СтруктураРеквизитовФормы.НалоговыйКомитет		  = Параметры.НалоговыйКомитет;
	НалоговыйКомитетФорма							  = Параметры.НалоговыйКомитет;
    
   	СтруктураРеквизитовФормы.мНалогоплательщикЯвляетсяИП        = (Параметры.Организация.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель);
    СтруктураРеквизитовФормы.мРазмерМРПДляЦелейНалогообложения  = ЗарплатаКадрыПовтИсп.МесячныйРасчетныйПоказатель(НачалоГода(Параметры.мДатаНачалаПериодаОтчета));
    СтруктураРеквизитовФормы.мРазмерМЗПДляЦелейНалогообложения  = ЗарплатаКадрыПовтИсп.МинимальныйРазмерОплатыТрудаРФ(НачалоГода(Параметры.мДатаНачалаПериодаОтчета));
    СтруктураРеквизитовФормы.мРазмерМРП                         = ЗарплатаКадрыПовтИсп.МесячныйРасчетныйПоказатель(Параметры.мДатаНачалаПериодаОтчета);

    ИмяРаздела = "Форма910Страница1";
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(СтрЗаменить(Сред(
		ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")), "Кв4", "Кв1") + "_" + ИмяРаздела));
	
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	
	СформироватьОтчетныйПериод();
	
	Инициализация(Параметры.БезОткрытияФормы);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруРеквизитовФормы()
	
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("Организация");
	СтруктураРеквизитовФормы.Вставить("ЕдиницаИзмерения");
	СтруктураРеквизитовФормы.Вставить("ТочностьЕдиницыИзмерения");
    СтруктураРеквизитовФормы.Вставить("мПолугодие");
	СтруктураРеквизитовФормы.Вставить("мГод");
	СтруктураРеквизитовФормы.Вставить("мДатаНачалаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мДатаКонцаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мПериодичность");
	СтруктураРеквизитовФормы.Вставить("мСкопированаФорма");
	СтруктураРеквизитовФормы.Вставить("мСохраненныйДок");
	СтруктураРеквизитовФормы.Вставить("мВыбраннаяФорма");
	СтруктураРеквизитовФормы.Вставить("мЗаписываетсяНовыйДокумент");
	СтруктураРеквизитовФормы.Вставить("мВариант");
	СтруктураРеквизитовФормы.Вставить("мПроверятьСоотношенияПриПечатиИВыгрузки");
	СтруктураРеквизитовФормы.Вставить("СписокПечатаемыхЛистов");
	СтруктураРеквизитовФормы.Вставить("мРежимПечати");
	СтруктураРеквизитовФормы.Вставить("мСчетчикСтраниц");                   
	СтруктураРеквизитовФормы.Вставить("мПечатныеФормы");
	СтруктураРеквизитовФормы.Вставить("НаимТекущегоРаздела");
	СтруктураРеквизитовФормы.Вставить("ВидДокумента");
	СтруктураРеквизитовФормы.Вставить("мМетодРасчета");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы21");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы22");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы23");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы24");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы25");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы26");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы27");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы28");
	СтруктураРеквизитовФормы.Вставить("НалоговыйКомитет");
    СтруктураРеквизитовФормы.Вставить("мРазмерМЗПДляЦелейНалогообложения");
    СтруктураРеквизитовФормы.Вставить("мРазмерМРПДляЦелейНалогообложения");
    СтруктураРеквизитовФормы.Вставить("мРазмерМРП");
  	СтруктураРеквизитовФормы.Вставить("мНалогоплательщикЯвляетсяИП");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы11");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы12");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы13");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы14");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы15");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы16");
    
    СтруктураРеквизитовФормы.Вставить("ВсегоСтр");
	СтруктураРеквизитовФормы.Вставить("ШагФорм")
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСтраницОтчета() 
	
	// Дерево содержит коллекцию страниц отчета.
	мДеревоСтраницОтчета.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма910Страница1";
	СтрокаУровня1.Представление            = "Форма 910.00 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма910Страница2";
	СтрокаУровня1.Представление            = "Форма 910.00 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма910Страница3";
	СтрокаУровня1.Представление            = "Форма 910.00 Страница 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
     СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма910Страница4";
	СтрокаУровня1.Представление            = "Форма 910.00 Страница 4";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

    СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма910_01Страница1";
	СтрокаУровня1.Представление            = "Форма 910.01 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма910_01Страница2";
	СтрокаУровня1.Представление            = "Форма 910.01 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма910_01Страница3";
	СтрокаУровня1.Представление            = "Форма 910.01 Страница 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма910_01Страница4";
	СтрокаУровня1.Представление            = "Форма 910.01 Страница 4";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма910_01Страница5";
	СтрокаУровня1.Представление            = "Форма 910.01 Страница 5";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма910_01Страница6";
	СтрокаУровня1.Представление            = "Форма 910.01 Страница 6";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма910_02Страница1";
	СтрокаУровня1.Представление            = "Форма 910.02 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма910_02Страница2";
	СтрокаУровня1.Представление            = "Форма 910.02 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма910_02Страница3";
	СтрокаУровня1.Представление            = "Форма 910.02 Страница 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма910_02Страница4";
	СтрокаУровня1.Представление            = "Форма 910.02 Страница 4";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма910_02Страница5";
	СтрокаУровня1.Представление            = "Форма 910.02 Страница 5";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма910_02Страница6";
	СтрокаУровня1.Представление            = "Форма 910.02 Страница 6";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма910_02Страница7";
	СтрокаУровня1.Представление            = "Форма 910.02 Страница 7";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма910_02Страница8";
	СтрокаУровня1.Представление            = "Форма 910.02 Страница 8";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСвойствСтраниц() Экспорт
	
	мСвойстваРазделовДекларации.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	
	СтрокаУровня1.ИмяСтраницы                          = "Форма910Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма910Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма910Страница3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
    
   	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма910Страница4";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
    
    СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма910_01Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы11;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма910_01Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы12;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма910_01Страница3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы13;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма910_01Страница4";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы14;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма910_01Страница5";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы15;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма910_01Страница6";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы16;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма910_02Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы21;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма910_02Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы22;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма910_02Страница3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы23;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма910_02Страница4";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы24;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма910_02Страница5";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы25;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма910_02Страница6";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы26;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма910_02Страница7";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы27;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма910_02Страница8";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы28;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;

КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоРазделовОтчетаНаСервере() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДеревоРазделовОтчетаНаКлиенте() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьДеревоРазделовОтчета(Форма)
	
	Форма["РазделыОтчета"].ПолучитьЭлементы().Очистить();
	
	Для Каждого ЭлементДереваСтраницОтчета Из Форма["мДеревоСтраницОтчета"].ПолучитьЭлементы() Цикл
		
		Если ЭлементДереваСтраницОтчета.ПоказатьСтраницу = 1 Тогда
			
			Если ЭтоРазделРодитель(ЭлементДереваСтраницОтчета.ИмяСтраницы) Тогда
				
				ЭлементРазделовОтчета = Форма["РазделыОтчета"].ПолучитьЭлементы().Добавить();
				ЭлементРазделовОтчета.КолонкаРазделыОтчета = Лев(ЭлементДереваСтраницОтчета.Представление,12);
				ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим = ЭлементДереваСтраницОтчета.ИмяСтраницы;
				ЭлементРазделовОтчета.РазделМногостраничный = Ложь;
				ЭлементРазделовОтчета.РазделМногострочный = МногострочныйРаздел(ЭлементДереваСтраницОтчета.ИмяСтраницы);
				
				Для НомерПодраздела = 1 По ПолучитьКоличествоПодразделовПоРодителю(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим) Цикл
					
					СтраницаРазделаОтчета = ЭлементРазделовОтчета.ПолучитьЭлементы().Добавить();
					
					СтраницаРазделаОтчета.КолонкаРазделыОтчета              = Лев(ЭлементДереваСтраницОтчета.Представление,СтрДлина(ЭлементДереваСтраницОтчета.Представление)-1) + НомерПодраздела;
					СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим      = Лев(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим, СтрДлина(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим)-1) + НомерПодраздела;
					СтраницаРазделаОтчета.РазделМногостраничный             = ЭлементРазделовОтчета.РазделМногостраничный;
					СтраницаРазделаОтчета.РазделМногострочный               = ЭлементРазделовОтчета.РазделМногострочный;
				КонецЦикла;
							
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСпискиВыбора()
	
	МакетСоставаПоказателей = Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет("СпискиВыбора2021Кв1");
	
	КоллекцияСписковВыбора = Новый Соответствие;
	Для Каждого Область Из МакетСоставаПоказателей.Области Цикл
		Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Строки Тогда
			ВерхОбласти = Область.Верх;
			НизОбласти = Область.Низ;
			ТаблСписка = Новый ТаблицаЗначений;
			ТаблСписка.Колонки.Добавить(
				"Код",,, МакетСоставаПоказателей.Область(ВерхОбласти, 1, ВерхОбласти, 1).ШиринаКолонки);
			ТаблСписка.Колонки.Добавить(
				"Название",,, МакетСоставаПоказателей.Область(ВерхОбласти, 2, ВерхОбласти, 2).ШиринаКолонки);
			Для НомСтр = ВерхОбласти По НизОбласти Цикл
				КодПоказателя = СокрП(МакетСоставаПоказателей.Область(НомСтр, 1).Текст);
				Если КодПоказателя <> "###" Тогда
					НовСтрока = ТаблСписка.Добавить();
					НовСтрока.Код = КодПоказателя;
					НовСтрока.Название = СокрП(МакетСоставаПоказателей.Область(НомСтр, 2).Текст);
				КонецЕсли;
			КонецЦикла;
			КоллекцияСписковВыбора.Вставить(Область.Имя, ТаблСписка);
		КонецЕсли;
	КонецЦикла;
	
	СвойстваПоказателей.Очистить();
	
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "СтандартныеНалоговыеВычеты2021", 1, ,
		"Стандартные налоговые вычеты", КоллекцияСписковВыбора["СтандартныеНалоговыеВычеты2021"]);
	
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "ПрочиеНалоговыеВычеты2021", 1, ,
		"Прочие налоговые вычеты", КоллекцияСписковВыбора["ПрочиеНалоговыеВычеты2021"]);
			
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "ДоходыНеПодлежащиеНалогообложению2021", 1, ,
		"Доходы, не подлежащие налогообложению", КоллекцияСписковВыбора["ДоходыНеПодлежащиеНалогообложению2021"]);
			
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "СтатусФизическогоЛица2021", 1, ,
		"Статус физического лица", КоллекцияСписковВыбора["СтатусФизическогоЛица2021"]);
			
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "КатегорияФизическогоЛица2021", 1, ,
		"Категории физического лица", КоллекцияСписковВыбора["КатегорияФизическогоЛица2021"]);
	
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "КодВидовДохода2021", 1, ,
		"Код видов дохода", КоллекцияСписковВыбора["КодВидовДохода2021"]);
	
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "КодировкаВидовМеждународныхДоговоров2021", 1, ,
		"Кодировка видов международных договоров", КоллекцияСписковВыбора["КодировкаВидовМеждународныхДоговоров2021"]);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПоказатель(Элемент, Область, КодПоказателя, Знач ЭтоСумма, Знач ТекстВыбора, ТаблицаВыбора, СтандартнаяОбработка, КолонкаПоиска = "Код") Экспорт
	
	Если ТаблицаВыбора = Неопределено Тогда //ИЛИ СтруктураРеквизитовФормы.мАвтоВыборКодов Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Область.Имя = КодПоказателя Тогда
		ИсходноеЗначение = ?(ТипЗнч(Область.Значение) = Тип("Строка"), СокрЛП(Область.Значение), Область.Значение);
	Иначе
		Разделитель = ?(Лев(Область.Имя, СтрДлина(КодПоказателя) + 1) = КодПоказателя + "_", "_", "");
		ИндексОбласти = 1;
		ИсходноеЗначение = "";
		Пока ЭтаФорма[ТекущийЭлемент.Имя].Области.Найти(
			КодПоказателя + Разделитель + Формат(ИндексОбласти, "ЧГ=")) <> Неопределено Цикл
			ИсходноеЗначение = ИсходноеЗначение + Строка(
				ЭтаФорма[ТекущийЭлемент.Имя].Области[КодПоказателя + Разделитель + Формат(ИндексОбласти, "ЧГ=")].Значение);
			ИндексОбласти = ИндексОбласти + 1;
		КонецЦикла;
		ИсходноеЗначение = СокрЛП(ИсходноеЗначение);
	КонецЕсли;
	

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок",          ТекстВыбора);
	ПараметрыФормы.Вставить("ТаблицаЗначений",    ТаблицаВыбора);
	
	Если СтрНайти(КодПоказателя, "П000110000205") > 0 Тогда
		
		ПараметрыФормы.Вставить("СтруктураДляПоиска", Новый Структура(КолонкаПоиска, ИсходноеЗначение));
		
	Иначе
		
		ПараметрыФормы.Вставить("СтруктураДляПоиска", Новый Структура(КолонкаПоиска, Строка(ИсходноеЗначение)));

	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("ИндексОбласти, КодПоказателя, КолонкаПоиска, Область, Разделитель", ИндексОбласти, КодПоказателя, КолонкаПоиска, Область, Разделитель);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВвестиПоказательЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Отчет.РегламентированныйОтчет910Форма.Форма.ФормаВыбораЗначенияИзТаблицы", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПоказательЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	ИндексОбласти = ДополнительныеПараметры.ИндексОбласти;
	КодПоказателя = ДополнительныеПараметры.КодПоказателя;
	КолонкаПоиска = ДополнительныеПараметры.КолонкаПоиска;
	Область       = ДополнительныеПараметры.Область;
	Разделитель   = ДополнительныеПараметры.Разделитель;
	ИмяРаздела    = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
	
	ВыборИзСпискаЗначений = Ложь;
	ВыборИзТаблицыЗначений = Ложь;
	ВыборИзСтроки = Ложь;
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	ИначеЕсли ТипЗнч(РезультатВыбора) = Тип("СписокЗначений") Тогда
		ВыборИзСпискаЗначений = Истина;
	ИначеЕсли ТипЗнч(РезультатВыбора) = Тип("ДанныеФормыКоллекция") Тогда
		ВыборИзТаблицыЗначений = Истина;
	Иначе
		ВыборИзСтроки = Истина;
	КонецЕсли;
	
	Если Область.Имя = КодПоказателя
		ИЛИ РегламентированнаяОтчетностьКлиентСервер.ПоказательВходитВМногострочнуюЧасть(ЭтаФорма, КодПоказателя) > 0 Тогда
		
		ОбластьИмя = Область.Имя;
		// Изменить сумму зависимой ячейки
		НомерСтроки = ПолучитьЧастьИмени(Область.Имя, "НомерСтроки");
		
		Если ВыборИзСтроки Тогда
			
			Область.Значение = РезультатВыбора[КолонкаПоиска];
			
		ИначеЕсли ВыборИзСпискаЗначений Тогда
			
			Область.Значение = РезультатВыбора;
			
		Иначе
			
			СоставноеЗначение = Новый СписокЗначений;
			
			Для Каждого СтрокаТаблицы Из РезультатВыбора Цикл
				
				Если СтрокаТаблицы.ОтметкаЗаполнения Тогда
					
					СоставноеЗначение.Добавить(СтрокаТаблицы.Код);	
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если СтрНайти(КодПоказателя, "П000140000202") = 0 Тогда
				Область.Значение = СоставноеЗначение;
			Иначе
				ЭтаФорма["П0001300002"][Число(НомерСтроки) - 1]["П000130000205"] = СоставноеЗначение;
			КонецЕсли;
			
			ИмяТаблицы  = ПолучитьЧастьИмени(ОбластьИмя, "ИмяТаблицы");
			ИмяТаблицыСНомеромКолонки = ПолучитьЧастьИмени(ОбластьИмя, "ИмяТаблицыСНомеромКолонки");
			
			ИмяСвязаннойЯчейки = Неопределено;
			СтруктураЗависимыхЯчеекДляАвторасчета.Свойство(ИмяТаблицыСНомеромКолонки, ИмяСвязаннойЯчейки);
			
			ЗависимаяТаблица = ЭтаФорма[ИмяТаблицы][Число(НомерСтроки) - 1][ИмяТаблицыСНомеромКолонки + "ТаблицаЗначений"];
			ЗависимаяТаблица.Очистить();
			
			Для Каждого СтрокаТаблицы Из РезультатВыбора Цикл
				Если СтрокаТаблицы.ОтметкаЗаполнения Тогда
					СтрокаЗависимойТаблицы = ЗависимаяТаблица.Добавить();
					СтрокаЗависимойТаблицы.КодСтроки = СтрокаТаблицы.Код;
					СтрокаЗависимойТаблицы.Сумма = СтрокаТаблицы.Сумма;
				КонецЕсли;
			КонецЦикла;
				
			Если НЕ ИмяСвязаннойЯчейки = Неопределено Тогда
				
				Если СтрНайти(ИмяСвязаннойЯчейки, "П000240000204") = 0
					ИЛИ СтрНайти(ИмяСвязаннойЯчейки, "П000240000205") = 0 Тогда
					
					ИмяТаблицыЗависимойЯчейки = Сред(ИмяСвязаннойЯчейки, 0, СтрДлина(ИмяСвязаннойЯчейки) - 2);
					ИтоговаяСумма = ЗависимаяТаблица.Итог("Сумма");
					ЭтаФорма[ИмяТаблицыЗависимойЯчейки][Число(НомерСтроки) - 1][ИмяСвязаннойЯчейки] = ИтоговаяСумма;
					
					НомерПриложения = ПолучитьЧастьИмени(ИмяСвязаннойЯчейки + "_" + НомерСтроки, "НомерПриложения");
					НомерЛиста = ПолучитьЧастьИмени(ИмяСвязаннойЯчейки + "_" + НомерСтроки, "НомерЛиста");
					РазделЗависимойЯчейки = "Форма910_0" + НомерПриложения + "Страница" + НомерЛиста;
					
					Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = РазделЗависимойЯчейки Тогда	
						ЭтотОбъект.ТабличныйДокумент.Области[ИмяСвязаннойЯчейки + "_" + НомерСтроки].Значение = ИтоговаяСумма;
						Расчет(ЭтаФорма, РазделЗависимойЯчейки, ИмяСвязаннойЯчейки);
					Иначе
						Расчет(ЭтаФорма, РазделЗависимойЯчейки, ИмяСвязаннойЯчейки);
					КонецЕсли;
					
				Иначе
					
					ИмяСвязаннойЯчейки1 = "П000240000204";
					ИмяСвязаннойЯчейки2 = "П000240000205";
					СуммаЯчейки1 = 0;
					СуммаЯчейки2 = 0;
					
					Для Каждого СтрокаЗависимаяТаблица Из ЗависимаяТаблица Цикл
						
						// условие разделения ячеек
						Если СтрНайти(СтрокаЗависимаяТаблица.КодСтроки, "341") > 0 Тогда
							СуммаЯчейки1 = СуммаЯчейки1 + СтрокаЗависимаяТаблица.Сумма;	
						ИначеЕсли СтрНайти(СтрокаЗависимаяТаблица.КодСтроки, "654") > 0 Тогда
							СуммаЯчейки2 = СуммаЯчейки2 + СтрокаЗависимаяТаблица.Сумма;	
						КонецЕсли;							
						
					КонецЦикла;
					
					НомерПриложения = ПолучитьЧастьИмени(ИмяСвязаннойЯчейки1 + "_" + НомерСтроки, "НомерПриложения");
					НомерЛиста = ПолучитьЧастьИмени(ИмяСвязаннойЯчейки1 + "_" + НомерСтроки, "НомерЛиста");
					РазделЗависимойЯчейки = "Форма910_0" + НомерПриложения + "Страница" + НомерЛиста;
					
					Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = РазделЗависимойЯчейки Тогда	
						ЭтотОбъект.ТабличныйДокумент.Области[ИмяСвязаннойЯчейки1 + "_" + НомерСтроки].Значение = СуммаЯчейки1;
						ЭтотОбъект.ТабличныйДокумент.Области[ИмяСвязаннойЯчейки2 + "_" + НомерСтроки].Значение = СуммаЯчейки2;
						Расчет(ЭтаФорма, РазделЗависимойЯчейки, ИмяСвязаннойЯчейки1);
						Расчет(ЭтаФорма, РазделЗависимойЯчейки, ИмяСвязаннойЯчейки2);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Найти(Область.Имя, "П000230000203") > 0 Тогда
			
			ИмяСвязаннойЯчейки = "П000230000204" + Прав(Область.Имя, 2);
			
			СтруктураДанныхФорма910_02Страница3.Вставить(Область.Имя, РезультатВыбора.Код);
			СтруктураДанныхФорма910_02Страница3.Вставить(ИмяСвязаннойЯчейки, РезультатВыбора.Название);
			
			Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910_02Страница3" Тогда	
				ЭтотОбъект.ТабличныйДокумент.Области[Область.Имя].Значение = РезультатВыбора.Код;
				ЭтотОбъект.ТабличныйДокумент.Области[ИмяСвязаннойЯчейки].Значение = РезультатВыбора.Название;
			КонецЕсли;
	
		ИначеЕсли Найти(Область.Имя, "П000230000204") > 0 Тогда
			
			ИмяСвязаннойЯчейки = "П000230000203" + Прав(Область.Имя, 2);
			СтруктураДанныхФорма910_02Страница3.Вставить(Область.Имя, РезультатВыбора.Код);
			СтруктураДанныхФорма910_02Страница3.Вставить(ИмяСвязаннойЯчейки, РезультатВыбора.Название);
			
			Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910_02Страница3" Тогда
				ЭтотОбъект.ТабличныйДокумент.Области[ИмяСвязаннойЯчейки].Значение = РезультатВыбора.Код;
				ЭтотОбъект.ТабличныйДокумент.Области[Область.Имя].Значение = РезультатВыбора.Название;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		СтрокаРезультатВыбора = Строка(РезультатВыбора[КолонкаПоиска]);
		Для Инд = СтрДлина(СтрокаРезультатВыбора) + 1 По ИндексОбласти - 1 Цикл
			СтрокаРезультатВыбора = " " + РезультатВыбора[КолонкаПоиска];
		КонецЦикла;
		Для Инд = 1 По ИндексОбласти - 1 Цикл
			ЭтаФорма[ТекущийЭлемент.Имя].Области[КодПоказателя + Разделитель + Формат(Инд, "ЧГ=")].Значение
				= СокрЛП(Сред(РезультатВыбора[КолонкаПоиска], Инд, 1));
		КонецЦикла;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьЧастьИмени(ОбластьИмя, Данные = "ИмяТаблицы")
	
	Если Данные = "НомерСтроки" Тогда
		Возврат	Сред(ОбластьИмя, СтрНайти(ОбластьИмя, "_") + 1, СтрДлина(ОбластьИмя));
	ИначеЕсли Данные = "ИмяТаблицы" Тогда 
		Возврат	Сред(ОбластьИмя, 0, СтрНайти(ОбластьИмя, "_") - 3);
	ИначеЕсли Данные = "ИмяТаблицыСНомеромКолонки" Тогда
		Возврат Сред(ОбластьИмя, 0, СтрНайти(ОбластьИмя, "_") - 1);
	ИначеЕсли Данные = "НомерПриложения" Тогда
		Возврат Сред(ОбластьИмя, 5, 1);
	ИначеЕсли Данные = "НомерЛиста" Тогда
		Возврат Сред(ОбластьИмя, 6, 1);
	Иначе
		Возврат "";
	КонецЕсли;		
	
КонецФункции
	
&НаКлиентеНаСервереБезКонтекста
Функция ЭтоРазделРодитель(ИмяРаздела)
	
	Результат = (ИмяРаздела = "Форма910Страница1")
			ИЛИ (ИмяРаздела = "Форма910_01Страница1")
			ИЛИ (ИмяРаздела = "Форма910_02Страница1");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МногострочныйРаздел(ИмяРаздела)
	
	Результат = (ИмяРаздела = "Форма910_01Страница1")
			ИЛИ (ИмяРаздела = "Форма910_01Страница2")
			ИЛИ (ИмяРаздела = "Форма910_01Страница3")
			ИЛИ (ИмяРаздела = "Форма910_01Страница4")
			ИЛИ (ИмяРаздела = "Форма910_01Страница5")
			ИЛИ (ИмяРаздела = "Форма910_01Страница6")
            ИЛИ (ИмяРаздела = "Форма910_02Страница1")
			ИЛИ (ИмяРаздела = "Форма910_02Страница2")
			ИЛИ (ИмяРаздела = "Форма910_02Страница3")
			ИЛИ (ИмяРаздела = "Форма910_02Страница4")
			ИЛИ (ИмяРаздела = "Форма910_02Страница5")
			ИЛИ (ИмяРаздела = "Форма910_02Страница6")
			ИЛИ (ИмяРаздела = "Форма910_02Страница7")
			ИЛИ (ИмяРаздела = "Форма910_02Страница8");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьКоличествоПодразделовПоРодителю(Родитель)
	
	Если Родитель = "Форма910Страница1" Тогда
		Возврат 4;
	ИначеЕсли Родитель = "Форма910_01Страница1" Тогда
		Возврат 6;
	ИначеЕсли Родитель = "Форма910_02Страница1" Тогда
		Возврат 8;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура СформироватьОтчетныйПериод()
	
	СтрПериодОтчета = ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета,СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ФП = истина");
    
   	СтруктураРеквизитовФормы.мГод     	= Формат(Год(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета), "ЧГ="); // удаляем разделительный пробел, так как 		
	СтруктураРеквизитовФормы.мПолугодие	= ?(Месяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) < 6, 1, 2); // удаляем разделительный пробел, так как 	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета()
	
	СтруктураЗависимыхЯчеекДляАвторасчета = Новый Структура;
	//910Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("ВидДекларации", "Первоначальная;Очередная;Дополнительная;ПоУведомлению;Ликвидационная");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("НаличиеПриложений", "Приложение01;Приложение02");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("КатегорияНалПл", "ДоверительныйУправляющий;Учредитель;ВедетБУ;НеВедетБУ");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("РезидентУчереждение", "Резидент;Нерезидент");
    СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("ТИС", "ТрехкомпонентнаяИС");
    СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010001101", "П000010001201;П000010001301");
    СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010005101", "П000010001101");
    СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010006101", "П000010001101;П000010003101;П000010004101;П000010005101");
    СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010007101", "П000010001101;П000010005101;П000010006101");
    СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010008101", "П000010001101;П000010006101;П000010007101");
    СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010009101", "П000010001101;П000010006101;П000010007101;П000020013101;П000020013201;П000020013301;П000020013401;П000020013501;П000020013601;П000020013701;П000030021101;
                                                                     |П000030021201;П000030021301;П000030021401;П000030021501;П000030021601;П000030021701");
    СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010010101", "П000010010101");
    СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010011101", "П000010001101;П000010006101;П000010007101;П000010008101;П000010010101");

	//910Стр2
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020012701", "П000020012101;П000020012201;П000020012301;П000020012401;П000020012501;П000020012601");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020013701", "П000020013101;П000020013201;П000020013301;П000020013401;П000020013501;П000020013601");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020014701", "П000020014101;П000020014201;П000020014301;П000020014401;П000020014501;П000020014601");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020015701", "П000020015101;П000020015201;П000020015301;П000020015401;П000020015501;П000020015601");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020016701", "П000020016101;П000020016201;П000020016301;П000020016401;П000020016501;П000020016601");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020017701", "П000020017101;П000020017201;П000020017301;П000020017401;П000020017501;П000020017601");
	//910Стр3
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030018701", "П000030018101;П000030018201;П000030018301;П000030018401;П000030018501;П000030018601");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030019701", "П000030019101;П000030019201;П000030019301;П000030019401;П000030019501;П000030019601");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030020701", "П000030020101;П000030020201;П000030020301;П000030020401;П000030020501;П000030020601");
   	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030021701", "П000030021101;П000030021201;П000030021301;П000030021401;П000030021501;П000030021601");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030022701", "П000030022101;П000030022201;П000030022301;П000030022401;П000030022501;П000030022601");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030023701", "П000030023101;П000030023201;П000030023301;П000030023401;П000030023501;П000030023601");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030024701", "П000030024101;П000030024201;П000030024301;П000030024401;П000030024501;П000030024601");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030025701", "П000030025101;П000030025201;П000030025301;П000030025401;П000030025501;П000030025601");
    //910Стр4
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000040026701", "П000040026101;П000040026201;П000040026301;П000040026401;П000040026501;П000040026601");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000040027701", "П000040027101;П000040027201;П000040027301;П000040027401;П000040027501;П000040027601");

    //910.01Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000110000201_1", "П000110000202_1;П000110000203_1;П000110000204_1;П000110000205_1;П000110000206_1");//Заполнение 1й строки в многострочной форме	
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000110000106", "П000110000206"); 

	//910.01Стр2
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000120000201_1", "П000120000202_1;П000120000203_1;П000120000204_1;П000120000205_1");//Заполнение 1й строки в многострочной форме
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000120000103", "П000120000203");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000120000104", "П000120000204");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000120000105", "П000120000205");

	//910.01Стр3
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000130000201_1", "П000130000202_1;П000130000203_1;П000130000204_1;П000130000205_1");//Заполнение 1й строки в многострочной форме
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000130000103", "П000130000203");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000130000105", "П000130000205");
	
	//910.01Стр4
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000140000201_1", "П000140000202_1;П000140000203_1;П000140000204_1;П000140000205_1");//Заполнение 1й строки в многострочной форме
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000140000102", "П000140000202");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000140000103", "П000140000203");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000140000104", "П000140000204");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000140000105", "П000140000205");

	//910.01Стр5
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000150000201_1", "П000150000202_1;П000150000203_1;П000150000204_1;П000150000205_1");//Заполнение 1й строки в многострочной форме
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000150000102", "П000150000202");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000150000103", "П000150000203");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000150000104", "П000150000204");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000150000105", "П000150000205");
	
	//910.01Стр6
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000160000201_1", "П000160000202_1");//Заполнение 1й строки в многострочной форме
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000160000102", "П000160000202");
    
    //910.02Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000210000201_1", "П000210000202_1;П000210000203_1;П000210000204_1;П000210000205_1;П000210000206_1");//Заполнение 1й строки в многострочной форме
	//910.02Стр2
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000220000201_1", "П000220000201_1;П000220000203_1;П000220000204_1;П000220000205_1");//Заполнение 1й строки в многострочной форме
	//910.02Стр3
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000230000201_1", "П000230000202_1;П000230000203_1;П000230000204_1;П000230000205_1;П000230000206_1;П000230000207_1");//Заполнение 1й строки в многострочной форме
   	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000230000107", "П000230000207");
	//910.02Стр4
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000240000201_1", "П000240000202_1;П000240000203_1;П000240000204_1;П000240000205_1");//Заполнение 1й строки в многострочной форме
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000240000103", "П000240000203");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000240000104", "П000240000204");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000240000105", "П000240000205");
	//910.02Стр5
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000250000201_1", "П000250000202_1;П000250000203_1;П000250000204_1;П000250000205_1");//Заполнение 1й строки в многострочной форме
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000250000102", "П000250000202");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000250000104", "П000250000204");
	//910.02Стр6
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000260000201_1", "П000260000202_1;П000260000203_1;П000260000204_1;П000260000205_1");//Заполнение 1й строки в многострочной форме
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000260000102", "П000260000202");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000260000103", "П000260000203");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000260000104", "П000260000204");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000260000105", "П000260000205");
	//910.02Стр7
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000270000201_1", "П000270000202_1;П000270000203_1;П000270000204_1;П000270000205_1");//Заполнение 1й строки в многострочной форме
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000270000102", "П000270000202");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000270000103", "П000270000203");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000270000104", "П000270000204");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000270000105", "П000270000205");
	//910.02Стр8
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000280000201_1", "П000280000202_1;П000280000203_1");//Заполнение 1й строки в многострочной форме
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000280000102", "П000280000202");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000280000103", "П000280000203");
	
КонецПроцедуры

&НаСервере
Процедура Инициализация(БезОткрытияФормы = Ложь) Экспорт
	
	ФормироватьСтруктуруСтраницОтчета();
	ФормироватьСтруктуруСвойствСтраниц();
	СформироватьДеревоРазделовОтчетаНаСервере();
	ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета();
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
	Если СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		ЗаполнитьПустыеСтруктурыДанных();
		ЗаполнитьСведенияОбОрганизацииНаСервере();
		НачальныеОперацииСМногострочнымиБлоками();
		СтруктураРеквизитовФормы.ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
		СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 0;
		КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
		РасчетНаСервере("Форма910Страница1","Очередная");
		Модифицированность = Истина;
	Иначе
		ВосстановитьСохраненныеДанные();
		ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма910Страница1");
	КонецЕсли;
	
	Если НЕ БезОткрытияФормы Тогда
		СформироватьСпискиВыбора();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизацииНаСервере()
	
	ЗаполнитьСведенияОбОрганизации(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизации(Форма)
	
	СтрокаСведений = "ИННЮЛ, НаимЮЛПол, ФИОРук,КБЕ, ФИО";
	СведенияОбОрганизации = РегламентированнаяОтчетностьРК.ПолучитьСведенияОбОрганизации(СтруктураРеквизитовФормы.Организация,,СтрокаСведений);
	
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ИИН_БИН"].Значение) Тогда
		ТабличныйДокумент.Области["ИИН_БИН"].Значение = СведенияОбОрганизации.ИННЮЛ;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Полугодие"].Значение) Тогда
		ТабличныйДокумент.Области["Полугодие"].Значение = СтруктураРеквизитовФормы.мПолугодие;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Год"].Значение) Тогда
		ТабличныйДокумент.Области["Год"].Значение = СтруктураРеквизитовФормы.мГод;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ОргНазв") <> Неопределено Тогда
		ТабличныйДокумент.Области["ОргНазв"].Значение = ?(ЗначениеЗаполнено(СведенияОбОрганизации.ФИО), СведенияОбОрганизации.ФИО, СведенияОбОрганизации.НаимЮЛПол);
		Если ТабличныйДокумент.Области.Найти("ОргНазв3") <> Неопределено Тогда
			НачПозиция = 1;
			Для Шаг = 1 По 3 Цикл
				ДлинаСтроки = ТабличныйДокумент.Области["ОргНазв" + Шаг].ТипЗначения.КвалификаторыСтроки.Длина;
				НазОрганизации = Сред(?(ЗначениеЗаполнено(СведенияОбОрганизации.ФИО), СведенияОбОрганизации.ФИО, СведенияОбОрганизации.НаимЮЛПол), НачПозиция, ДлинаСтроки); 
				ТабличныйДокумент.Области["ОргНазв" + Шаг].Значение = НазОрганизации;
				НачПозиция =НачПозиция + ДлинаСтроки;
			КонецЦикла
		Иначе
			НачПозиция = 1;
			Для Шаг = 1 По 2 Цикл
				ДлинаСтроки = ТабличныйДокумент.Области["ОргНазв" + Шаг].ТипЗначения.КвалификаторыСтроки.Длина;
				НазОрганизации = Сред(?(ЗначениеЗаполнено(СведенияОбОрганизации.ФИО), СведенияОбОрганизации.ФИО, СведенияОбОрганизации.НаимЮЛПол), НачПозиция, ДлинаСтроки); 
				ТабличныйДокумент.Области["ОргНазв" + Шаг].Значение = НазОрганизации;
				НачПозиция =НачПозиция + ДлинаСтроки;
			КонецЦикла
		КонецЕсли;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("Руководитель") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Руководитель"].Значение) Тогда
		ТабличныйДокумент.Области["Руководитель"].Значение = СведенияОбОрганизации.ФИОРук;
	КонецЕсли;
	
	Резидент = ?(Лев(СведенияОбОрганизации.КБе,1) = "2", Ложь, Истина);
	
	Если ТабличныйДокумент.Области.Найти("Резидент") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Резидент"].Значение) Тогда
		ТабличныйДокумент.Области["Резидент"].Значение = ?(Резидент,    "Х", "");
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("Нерезидент") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Нерезидент"].Значение) Тогда
		ТабличныйДокумент.Области["Нерезидент"].Значение = ?(НЕ Резидент, "Х", "");
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ПоУведомлению") <> Неопределено Тогда
		
		Если ТабличныйДокумент.Области["ПоУведомлению"].Значение = "Х" Тогда
			ТабличныйДокумент.Области.НомерУведомления.Защита = Ложь;
			ТабличныйДокумент.Области.ДатаУведомления.Защита = Ложь;
		Иначе
			Если ТабличныйДокумент.Области.Найти("Очередная") <> Неопределено И
				ТабличныйДокумент.Области["Очередная"].Значение = "" И
				ТабличныйДокумент.Области["Дополнительная"].Значение = "" И 
				ТабличныйДокумент.Области["Ликвидационная"].Значение = "" И
				ТабличныйДокумент.Области["Первоначальная"].Значение = "" Тогда
				
				ТабличныйДокумент.Области["Очередная"].Значение = "Х"; 
            КонецЕсли
            
		КонецЕсли;
		
	КонецЕсли;
	Если ТабличныйДокумент.Области.Найти("КодВалюты") <> Неопределено Тогда
		ТабличныйДокумент.Области.КодВалюты.Значение = "KZT";
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ДатаПодачи") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ДатаПодачи"].Значение) Тогда
		ТабличныйДокумент.Области.ДатаПодачи.Значение = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьСохраненныеДанные()
	
	Перем ДанныеМногострочныхРазделов;
	Перем ПоказателиОтчета;
	Перем СписокСтруктурныхЕдиниц;
	Перем СписокРегистраций;
	Перем НалоговыйКомитет;
		
	// восстанавливаем сохраненные данные отчета
	СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	
	// восстановим сохраненные данные редактируемых ячеек
	СписокСохранения.Свойство("ПоказателиОтчета", ПоказателиОтчета);
	СписокСохранения.Свойство("СписокСтруктурныхЕдиниц", СписокСтруктурныхЕдиниц);
	СписокСохранения.Свойство("СписокРегистраций", СписокРегистраций);
	СписокСохранения.Свойство("НалоговыйКомитет", НалоговыйКомитет);
	
	Если СписокСохранения.Свойство( "ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов) Тогда
		
		Для Каждого ЭлементСтруктуры Из ДанныеМногострочныхРазделов Цикл
			
			НайденноеЗначение = Неопределено;
			мСтруктураМногострочныхРазделов.Свойство(ЭлементСтруктуры.Ключ, НайденноеЗначение);
			
			// поддержим новую колонку в сохраненных отчетах
			Если ЭлементСтруктуры.Ключ = "П0002100002"
				ИЛИ ЭлементСтруктуры.Ключ = "П0001100002" Тогда
				
				Если ЭлементСтруктуры.Значение.Колонки.Найти(ЭлементСтруктуры.Ключ + "02Ссылка") = Неопределено Тогда
					ЭлементСтруктуры.Значение.Колонки.Добавить(ЭлементСтруктуры.Ключ + "02Ссылка", 	Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));	
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ НайденноеЗначение = Неопределено Тогда
				ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, ЭтаФорма[НайденноеЗначение]);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;	

	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы] = ПоказателиОтчета[Префикс + Раздел.ИмяСтраницы];
	КонецЦикла;
	
	СформироватьДеревоРазделовОтчетаНаСервере();
	
	Комментарий = СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий;
	СтруктураРеквизитовФормы.ЕдиницаИзмерения = СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения;
	
	мСписокСтруктурныхЕдиниц = СписокСтруктурныхЕдиниц;
	НалоговыйКомитетФорма = НалоговыйКомитет;
	РегламентированнаяОтчетность.ОперацииПриВосстановленииРегламентированногоОтчета(ЭтаФорма);
	
	КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
	
КонецПроцедуры

&НаСервере
Процедура НачальныеОперацииСМногострочнымиБлоками()
	Перем ИсходноеКоличествоСтрокГруппы;

	// создаем исходную структуру многострочных разделов
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		ИмяГруппы = ЭлементСтруктуры.Ключ;
		СтруктураГруппы = ЭтаФорма[ЭлементСтруктуры.Значение];
		
		мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);

		Если ИсходноеКоличествоСтрокГруппы > СтруктураГруппы.Количество() Тогда 
			Для НСтр = 1 По ИсходноеКоличествоСтрокГруппы Цикл
				СтруктураГруппы.Добавить();
			КонецЦикла;
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазделыОтчетаПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ОчиститьТекущуюСтраницу.Видимость = НЕ Элемент.ТекущиеДанные.РазделМногостраничный;
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим, Элемент.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета);
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, 1);
	ЗаполнитьСведенияОбОрганизацииНаСервере();
	
	ДоступнаРасшифровкаПоФизЛицу = СтрНайти(Элемент.ТекущиеДанные.КолонкаРазделыОтчета, "910.01") > 0 ИЛИ СтрНайти(Элемент.ТекущиеДанные.КолонкаРазделыОтчета, "910.02") > 0;
	Элементы.РасшифроватьПоФизЛицу.Видимость = ДоступнаРасшифровкаПоФизЛицу;	
	Элементы.Расшифровать.Видимость  = НЕ ДоступнаРасшифровкаПоФизЛицу;	
    
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетСтраницыВТабличныйДокументНаСервере(ИмяТекРаздела,НомерСтраницыРазделаОтчета = 1)
	
	ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела,НомерСтраницыРазделаОтчета) ;
	СтруктураРеквизитовФормы.НаимТекущегоРаздела  = ИмяТекРаздела;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела,НомерСтраницыРазделаОтчета)
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(СтрЗаменить(Сред(
		ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")), "Кв4", "Кв1") + "_" + ИмяТекРаздела));
		
	//многострочные разделы
	Если ИмяТекРаздела = "Форма910_01Страница1"
		ИЛИ ИмяТекРаздела = "Форма910_01Страница2"
		ИЛИ ИмяТекРаздела = "Форма910_01Страница3"
		ИЛИ ИмяТекРаздела = "Форма910_01Страница4"
		ИЛИ ИмяТекРаздела = "Форма910_01Страница5"
		ИЛИ ИмяТекРаздела = "Форма910_01Страница6"
        ИЛИ ИмяТекРаздела = "Форма910_02Страница1"
		ИЛИ ИмяТекРаздела = "Форма910_02Страница2"
		ИЛИ ИмяТекРаздела = "Форма910_02Страница3"
		ИЛИ ИмяТекРаздела = "Форма910_02Страница4"
		ИЛИ ИмяТекРаздела = "Форма910_02Страница5"
		ИЛИ ИмяТекРаздела = "Форма910_02Страница6"
		ИЛИ ИмяТекРаздела = "Форма910_02Страница7"
		ИЛИ ИмяТекРаздела = "Форма910_02Страница8" Тогда
		
		СтруктураДанныхРаздела = ЭтаФорма["СтруктураДанных" + ИмяТекРаздела];
		
		Для Каждого ЭлСтруктуры Из СтруктураДанныхРаздела Цикл
			Попытка
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
		ТекТабличноеПоле = ЭтаФорма.ТабличныйДокумент;
		
		ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяТекРаздела);
		
		СтруктураГруппы = Неопределено;
		
		мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
		
		СтруктураГруппы = ЭтаФорма[СтруктураГруппы];
		
		ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
		
		ЕстьДопСтроки = Ложь;
		
		Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
			Если СтрЧислоВхождений(ОбластьТД.Имя, "_2") > 0 Тогда
				ЕстьДопСтроки = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьДопСтроки Тогда
			Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
				Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
					ОбластьТД.Гиперссылка = Истина;
					ОбластьТД.Текст = "х";
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
				Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
					ОбластьТД.Гиперссылка = Ложь;
					ОбластьТД.Текст = "";
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
        
    ИначеЕсли ЭтаФорма["СтруктураДанных" + ИмяТекРаздела]<> Неопределено Тогда
		
		Для Каждого ЭлСтруктуры Из ЭтаФорма["СтруктураДанных" + ИмяТекРаздела] Цикл
			Попытка
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиРазделВТабличныйДокумент(Форма, ИмяГруппы, СтруктураГруппы)
	Перем ИсходноеКоличествоСтрокГруппы;
	
	#Если НаКлиенте Тогда
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИмяГруппы);
	#Иначе
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИмяГруппы);
	#КонецЕсли
		
	// определим исходное колво строк многострочного раздела,
	// соответствующее бумажной форме отчета
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
	
	// реальное кол-во строк (колво заполненных строк)
	ТекущееКоличествоСтрокГруппы = СтруктураГруппы.Количество();
		
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
		
	ПерерисоватьСтроки = (НЕ ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы);
		
	Раздел = Форма[ТекТабличноеПолеИмя];
	
	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// При восстановлении сохраненных данных отчета сравниваем исходное кол-во
	// отображаемых в форме строк многострочного раздела с реальным количеством
	// созданных строк в сохраненном отчете.
	Если ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы Тогда
		
		// При превышении реального кол-ва строк над исходным кол-вом (по шаблону),
		// автоматически добавляем необходимое колво строк.
		Форма.ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки);

		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
	КонецЕсли;
	
	// выводим значения строк
	Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
		НомерСтрокиВТаблице      = СтруктураГруппы.Индекс(СтрокаТаблицы);
		НомерСтрокиВФормеТаблицыСтр = Формат(НомерСтрокиВТаблице + 1, "ЧГ=");
		
		Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
			
			КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
				
			Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
				
				ЗначениеЯчейки = СтрокаТаблицы[КолонкаТаблицыИмя];
				ИмяЯчейки      = КолонкаТаблицыИмя + "_" + НомерСтрокиВФормеТаблицыСтр;
				
				ОбластьЯчейкиТаблицы = ТекТабличноеПоле.Области[ИмяЯчейки];
				
				Если ОбластьЯчейкиТаблицы.СодержитЗначение = Истина Тогда
					ОбластьЯчейкиТаблицы.Значение = ЗначениеЯчейки;
					Если КолонкаТаблицыИмя = "П000210000202" ИЛИ КолонкаТаблицыИмя = "П000110000202" Тогда
						ОбластьЯчейкиТаблицы.Расшифровка = СтрокаТаблицы[КолонкаТаблицыИмя + "Ссылка"];
					КонецЕсли;
				Иначе
					ОбластьЯчейкиТаблицы.Текст = ЗначениеЯчейки;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки) Экспорт
		
	ОбластьДопСтроки = ТекТабличноеПоле.ПолучитьОбласть("МногострочнаяЧасть");
	
	КоординатыОбластей = Новый Структура();
	
	Для Каждого Область Из ТекТабличноеПоле.Области Цикл
		
		Если СтрНайти(Область.Имя, "_") Тогда
			
			КоординатыОбластей.Вставить(Область.Имя, Область.Верх);
			
		КонецЕсли;
		
	КонецЦикла;
		
	МногострочнаяЧастьВерх = ТекТабличноеПоле.Области.МногострочнаяЧасть.Верх;
	
	МногострочнаяЧастьНиз = ТекТабличноеПоле.Области.МногострочнаяЧасть.Низ;
			
	ТекТабличноеПоле.ВставитьОбласть(ОбластьДопСтроки.Область(), ТекТабличноеПоле.Область(МногострочнаяЧастьНиз + 1, , МногострочнаяЧастьНиз + (ТекущееКоличествоСтрокГруппы - 1) * ВысотаСтроки), ТипСмещенияТабличногоДокумента.ПоВертикали);
		
	Для НомНовойСтроки = ИсходноеКоличествоСтрокГруппы По ТекущееКоличествоСтрокГруппы Цикл
		
		Постфикс = Формат(ТекущееКоличествоСтрокГруппы - НомНовойСтроки + 1, "ЧГ=");
		
		Для Каждого Область Из ОбластьДопСтроки.Области Цикл
			
			Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			
				ОбластьТаблДок = ТекТабличноеПоле.Область(КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Лево, КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Право);
							
				Если ОбластьТаблДок.СодержитЗначение Тогда
					ОбластьТаблДок.Очистить();
				КонецЕсли;
				
				ОбластьТаблДок.Имя = Лев(Область.Имя, СтрНайти(Область.Имя, "_")) + Постфикс;
				
			КонецЕсли;
			
		КонецЦикла;
						
	КонецЦикла;	
		
	ТекТабличноеПоле.Область(ТекТабличноеПоле.Области.МногострочнаяЧасть.Верх, , ТекТабличноеПоле.Области.МногострочнаяЧасть.Низ).Имя = "";
	
	ТекТабличноеПоле.Область(МногострочнаяЧастьВерх, , МногострочнаяЧастьНиз).Имя = "МногострочнаяЧасть";
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеРаздела(НаимРаздела, ИзменятьАктивнуюСтраницу = Истина)
	
	// Многострочные разделы.
    Если НаимРаздела = "Форма910_02Страница1"
    	ИЛИ НаимРаздела = "Форма910_02Страница2"
    	ИЛИ НаимРаздела = "Форма910_02Страница3"
    	ИЛИ НаимРаздела = "Форма910_02Страница4"
    	ИЛИ НаимРаздела = "Форма910_02Страница5"
    	ИЛИ НаимРаздела = "Форма910_02Страница6"
    	ИЛИ НаимРаздела = "Форма910_02Страница7"
    	ИЛИ НаимРаздела = "Форма910_02Страница8" 
        ИЛИ НаимРаздела = "Форма910_01Страница1"
    	ИЛИ НаимРаздела = "Форма910_01Страница2"
    	ИЛИ НаимРаздела = "Форма910_01Страница3"
    	ИЛИ НаимРаздела = "Форма910_01Страница4"
    	ИЛИ НаимРаздела = "Форма910_01Страница5"
    	ИЛИ НаимРаздела = "Форма910_01Страница6" Тогда
    	
    	ЭтаФорма["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");
    	
    	ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(НаимРаздела);
    	
    	ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппы);
    		
    Иначе
    	
        Если НаимРаздела = "Форма910Страница1"
        	ИЛИ НаимРаздела = "Форма910Страница2" Тогда
        	
        	Если ЭтаФорма["СтруктураДанных" + НаимРаздела].Свойство("РегистрацияВНО") Тогда
        		РегистрацияВНО = ЭтаФорма["СтруктураДанных" + НаимРаздела].РегистрацияВНО;		
        	Иначе
        		РегистрацияВНО = Неопределено;
        	КонецЕсли;
        	
        КонецЕсли;
    	
    	ЭтаФорма["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");	
    	
        Если НаимРаздела = "Форма910Страница1"
        	ИЛИ НаимРаздела = "Форма910Страница2" Тогда
        	
        	ЭтаФорма["СтруктураДанных" + НаимРаздела].Вставить("РегистрацияВНО", РегистрацияВНО);
        	
        КонецЕсли;
    	
    КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппы) Экспорт
	
	Перем СтруктураГруппы;
	
	ОбновитьСтруктуруМногострочногоРаздела(ЭтаФорма, ИмяГруппы);
	
КонецПроцедуры

Процедура ОбновитьСтруктуруМногострочногоРаздела(Форма, ИмяГруппы) Экспорт
	Перем СтруктураГруппы;
    	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = Форма[СтруктураГруппы];
	
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	Для НСтр = 1 По СтруктураГруппы.Количество() Цикл
		ТекСтрокаТаблицы = СтруктураГруппы[НСтр - 1];
		НСтрСтр = Формат(НСтр, "ЧГ=0");
		
		Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
		
		    ИмяКолонки = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
		
			Если СтруктураГруппы[0].Свойство(ИмяКолонки) Тогда
				
				ИмяЯчейки     = ИмяКолонки + "_" + НСтрСтр;
				ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяЯчейки];
				
				Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
					ЗначениеЯчейки = ОбластьЯчейки.Значение;
					Если ЗначениеЗаполнено(ОбластьЯчейки.Расшифровка) Тогда
						
						ТекСтрокаТаблицы[ИмяКолонки + "Ссылка"] = ОбластьЯчейки.Расшифровка;
						
					КонецЕсли;
				Иначе
					ЗначениеЯчейки = ОбластьЯчейки.Текст;
				КонецЕсли;
				
				ТекСтрокаТаблицы[ИмяКолонки] = ЗначениеЯчейки;
				
			КонецЕсли;
				
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	Модифицированность = Истина;
	
	ИмяРаздела = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
	
	РасчетНаКлиенте(ИмяРаздела,Область.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетНаКлиенте(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт

	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);

КонецПроцедуры

&НаСервере
Процедура РасчетНаСервере(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт

	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура Расчет(Форма, ИмяСтраницыПанели = "", ОбластьИмя = "")
	Перем ТаблицаСтраницРаздела;
	
	Если Форма.СтруктураРеквизитовФормы.мРежимПечати Тогда
		Возврат;
	КонецЕсли;
    
   	ЕстьДанныеПриложение1 = Форма.П0001100002.Количество() > 1 ИЛИ (Форма.П0001100002.Количество() > 0 И Форма.П0001100002[0].П000110000201 > 0);
	ЕстьДанныеПриложение2 = Форма.П0002100002.Количество() > 1 ИЛИ (Форма.П0002100002.Количество() > 0 И Форма.П0002100002[0].П000210000201 > 0);

	Если ИмяСтраницыПанели = "Форма910Страница1" Тогда
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.ВидДекларации, ОбластьИмя) > 0 Тогда
			
			Первоначальная = "";
			Очередная =      "";
			Дополнительная = "";
			ПоУведомлению =  "";
			Ликвидационная = "";
            
            ДоверительныйУправляющий = "";
            Учредитель               = "";
            ВедетБУ                  = "";
            НеВедетБУ                = "";
            
			Если ОбластьИмя = "Первоначальная" Тогда
				Первоначальная = "Х";
			ИначеЕсли ОбластьИмя = "Очередная" Тогда
				Очередная = "Х";
			ИначеЕсли ОбластьИмя = "Дополнительная" Тогда
				Дополнительная = "Х";
			ИначеЕсли ОбластьИмя = "ПоУведомлению" Тогда
				ПоУведомлению = "Х";
			ИначеЕсли ОбластьИмя = "Ликвидационная" Тогда
				Ликвидационная = "Х";
			Иначе
				Очередная = "Х";
            КонецЕсли;
            
            Если ОбластьИмя = "ДоверительныйУправляющий" Тогда
				ДоверительныйУправляющий = "Х";
			ИначеЕсли ОбластьИмя = "Учредитель" Тогда
				Учредитель = "Х";
			ИначеЕсли ОбластьИмя = "ВедетБУ" Тогда
				ВедетБУ = "Х";
			ИначеЕсли ОбластьИмя = "НеВедетБУ" Тогда
				НеВедетБУ = "Х";
			КонецЕсли;
				
			Форма.СтруктураДанныхФорма910Страница1.Вставить("Первоначальная", Первоначальная);
			Форма.СтруктураДанныхФорма910Страница1.Вставить("Очередная",      Очередная);
			Форма.СтруктураДанныхФорма910Страница1.Вставить("Дополнительная", Дополнительная);
			Форма.СтруктураДанныхФорма910Страница1.Вставить("ПоУведомлению",  ПоУведомлению);
			Форма.СтруктураДанныхФорма910Страница1.Вставить("Ликвидационная", Ликвидационная);
            
   			Форма.СтруктураДанныхФорма910Страница1.Вставить("ДоверительныйУправляющий", ДоверительныйУправляющий);
			Форма.СтруктураДанныхФорма910Страница1.Вставить("Учредитель",               Учредитель);
			Форма.СтруктураДанныхФорма910Страница1.Вставить("ВедетБУ",                  ВедетБУ);
			Форма.СтруктураДанныхФорма910Страница1.Вставить("НеВедетБУ",                НеВедетБУ);

			Если Не ПоУведомлению = "Х" Тогда
				Форма.СтруктураДанныхФорма910Страница1.Вставить("НомерУведомления", "");
				Форма.СтруктураДанныхФорма910Страница1.Вставить("ДатаУведомления", "");
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
				Форма.ТабличныйДокумент.Области.Первоначальная.Значение             = Первоначальная;
				Форма.ТабличныйДокумент.Области.Очередная.Значение                  = Очередная;
				Форма.ТабличныйДокумент.Области.Дополнительная.Значение             = Дополнительная;
				Форма.ТабличныйДокумент.Области.ПоУведомлению.Значение              = ПоУведомлению;
				Форма.ТабличныйДокумент.Области.Ликвидационная.Значение             = Ликвидационная;
                
                Форма.ТабличныйДокумент.Области.ДоверительныйУправляющий.Значение   = ДоверительныйУправляющий;
				Форма.ТабличныйДокумент.Области.Учредитель.Значение                 = Учредитель;
				Форма.ТабличныйДокумент.Области.ВедетБУ.Значение                    = ВедетБУ;
				Форма.ТабличныйДокумент.Области.НеВедетБУ.Значение                  = НеВедетБУ;

				Если ПоУведомлению = "Х" Тогда
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Ложь;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Ложь;
				Иначе
					Форма.ТабличныйДокумент.Области.НомерУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Истина;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Истина;
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.НаличиеПриложений, ОбластьИмя) > 0 Тогда
			
			Приложение01 = "";
			Приложение02 = "";
			
			Если ОбластьИмя = "Приложение01" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
					Приложение01 = Форма.ТабличныйДокумент.Области.Приложение01.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма910Страница1.Свойство("Приложение01") Тогда
					Приложение01 = Форма.СтруктураДанныхФорма910Страница1.Приложение01;
				КонецЕсли;
				
				Приложение01 = ?(Приложение01 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма910Страница1.Вставить("Приложение01", Приложение01);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение01.Значение = Приложение01;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение02" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
					Приложение02 = Форма.ТабличныйДокумент.Области.Приложение02.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма910Страница1.Свойство("Приложение02") Тогда
					Приложение02 = Форма.СтруктураДанныхФорма910Страница1.Приложение02;
				КонецЕсли;
				
				Приложение02 = ?(Приложение02 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма910Страница1.Вставить("Приложение02", Приложение02);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение02.Значение = Приложение02;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
        
        Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.КатегорияНалПл, ОбластьИмя) > 0 Тогда
                       
            ДоверительныйУправляющий = "";
            Учредитель               = "";
            ВедетБУ                  = "";
            НеВедетБУ                = "";
                    
            Если ОбластьИмя = "ДоверительныйУправляющий" Тогда
				ДоверительныйУправляющий = "Х";
			ИначеЕсли ОбластьИмя = "Учредитель" Тогда
				Учредитель = "Х";
			ИначеЕсли ОбластьИмя = "ВедетБУ" Тогда
				ВедетБУ = "Х";
			ИначеЕсли ОбластьИмя = "НеВедетБУ" Тогда
				НеВедетБУ = "Х";
			КонецЕсли;
            
   			Форма.СтруктураДанныхФорма910Страница1.Вставить("ДоверительныйУправляющий", ДоверительныйУправляющий);
			Форма.СтруктураДанныхФорма910Страница1.Вставить("Учредитель",               Учредитель);
			Форма.СтруктураДанныхФорма910Страница1.Вставить("ВедетБУ",                  ВедетБУ);
			Форма.СтруктураДанныхФорма910Страница1.Вставить("НеВедетБУ",                НеВедетБУ);
		
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
                
                Форма.ТабличныйДокумент.Области.ДоверительныйУправляющий.Значение   = ДоверительныйУправляющий;
				Форма.ТабличныйДокумент.Области.Учредитель.Значение                 = Учредитель;
				Форма.ТабличныйДокумент.Области.ВедетБУ.Значение                    = ВедетБУ;
				Форма.ТабличныйДокумент.Области.НеВедетБУ.Значение                  = НеВедетБУ;
					
			КонецЕсли;
            
        КонецЕсли;
        
       	Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.РезидентУчереждение, ОбластьИмя) > 0 Тогда
			
			Резидент                = "";
			Нерезидент              = "";
			
			Если ОбластьИмя = "Резидент" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
					Резидент = Форма.ТабличныйДокумент.Области.Резидент.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма910Страница1.Свойство("Резидент") Тогда
					Резидент = Форма.СтруктураДанныхФорма910Страница1.Резидент;
				КонецЕсли;
				
				Резидент = ?(Резидент = "Х","","Х");
				
				Форма.СтруктураДанныхФорма910Страница1.Вставить("Резидент", Резидент);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Резидент.Значение = Резидент;
				КонецЕсли;
				
				Форма.СтруктураДанныхФорма910Страница1.Вставить("Нерезидент", "");
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Нерезидент.Значение = "";
				КонецЕсли;
				
				
			ИначеЕсли ОбластьИмя = "Нерезидент" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
					Нерезидент = Форма.ТабличныйДокумент.Области.Нерезидент.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма910Страница1.Свойство("Нерезидент") Тогда
					Нерезидент = Форма.СтруктураДанныхФорма910Страница1.Нерезидент;
				КонецЕсли;
				
				Нерезидент = ?(Нерезидент = "Х","","Х");
				
				Форма.СтруктураДанныхФорма910Страница1.Вставить("Нерезидент", Нерезидент);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Нерезидент.Значение = Нерезидент;
				КонецЕсли;
				
				Форма.СтруктураДанныхФорма910Страница1.Вставить("Резидент", "");
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Резидент.Значение = "";
				КонецЕсли;

			КонецЕсли;
        КонецЕсли;
        
        Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.ТИС, ОбластьИмя) > 0 Тогда
            
            ТрехкомпонентнаяИС                = "";
            
            Если ОбластьИмя = "ТрехкомпонентнаяИС" Тогда
                
                Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
                    ТрехкомпонентнаяИС = Форма.ТабличныйДокумент.Области.ТрехкомпонентнаяИС.Значение;
                ИначеЕсли Форма.СтруктураДанныхФорма910Страница1.Свойство("ТрехкомпонентнаяИС") Тогда
                    ТрехкомпонентнаяИС = Форма.СтруктураДанныхФорма910Страница1.ТрехкомпонентнаяИС;
                КонецЕсли;
                
                ТрехкомпонентнаяИС = ?(ТрехкомпонентнаяИС = "Х","","Х");
                
                Форма.СтруктураДанныхФорма910Страница1.Вставить("ТрехкомпонентнаяИС", ТрехкомпонентнаяИС);
                Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
                    Форма.ТабличныйДокумент.Области.ТрехкомпонентнаяИС.Значение = ТрехкомпонентнаяИС;
                КонецЕсли;
                
            КонецЕсли;
        КонецЕсли;
        
      	//910.00.001
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010001101, ОбластьИмя) > 0 Тогда
			                                                                                                    
			ОкрП000010001201 = 0;
			ОкрП000010001301 = 0;
                        
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
				ОкрП000010001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма910Страница1.Свойство("П000010001201") Тогда
				ОкрП000010001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница1.П000010001201);
			КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
				ОкрП000010001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма910Страница1.Свойство("П000010001301") Тогда
				ОкрП000010001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница1.П000010001301);
			КонецЕсли;

			П000010001101 = ОкрП000010001201 + ОкрП000010001301;
			
			Форма.СтруктураДанныхФорма910Страница1.Вставить("П000010001101", П000010001101);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010001101.Значение = П000010001101;
			КонецЕсли;
			
		КонецЕсли;
                
		//910.00.005
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010005101, ОбластьИмя) > 0 Тогда
			                                                                                                    
			ОкрП000010001101 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
				ОкрП000010001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма910Страница1.Свойство("П000010001101") Тогда
				ОкрП000010001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница1.П000010001101);
			КонецЕсли;
						
			П000010005101 = ОкрП000010001101 * 0.03;
			
			Форма.СтруктураДанныхФорма910Страница1.Вставить("П000010005101", П000010005101);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010005101.Значение = П000010005101;
			КонецЕсли;
			
		КонецЕсли;
		
		//910.00.006
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010006101, ОбластьИмя) > 0 Тогда
			
			ОкрП000010005101 = 0;
			ОкрП000010003101 = 0;
			ОкрП000010004101 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
				ОкрП000010005101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010005101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма910Страница1.Свойство("П000010005101") Тогда
				ОкрП000010005101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница1.П000010005101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
				ОкрП000010003101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010003101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма910Страница1.Свойство("П000010003101") Тогда
				ОкрП000010003101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница1.П000010003101);
            КонецЕсли;
            
           	Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
				ОкрП000010004101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010004101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма910Страница1.Свойство("П000010004101") Тогда
				ОкрП000010004101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница1.П000010004101);
			КонецЕсли;
            
            П000010006101 = 0;
            Если (Форма.СтруктураРеквизитовФормы.мНалогоплательщикЯвляетсяИП и ОкрП000010004101 >= 23 * Форма.СтруктураРеквизитовФормы.мРазмерМРПДляЦелейНалогообложения)
                ИЛИ (НЕ Форма.СтруктураРеквизитовФормы.мНалогоплательщикЯвляетсяИП И ОкрП000010004101 >= 29 * Форма.СтруктураРеквизитовФормы.мРазмерМРПДляЦелейНалогообложения) Тогда
                // статья 687
                // для ИП корректировка осуществляется, если средняя заработная плата на одного наемного работника не менее 23-х МРП
                // для ЮЛ - не менее 29 МРП		
                П000010006101 = ОкрП000010005101 * ОкрП000010003101 * 0.015;
            КонецЕсли;
            
            Форма.СтруктураДанныхФорма910Страница1.Вставить("П000010006101", П000010006101);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010006101.Значение = П000010006101;
			КонецЕсли;
			
        КонецЕсли;
        
        //910.00.007
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010007101, ОбластьИмя) > 0 Тогда
			
			ОкрП000010006101 = 0;
			ОкрП000010005101 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
				ОкрП000010005101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010005101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма910Страница1.Свойство("П000010005101") Тогда
				ОкрП000010005101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница1.П000010005101);
			КонецЕсли;
			     
           	Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
				ОкрП000010006101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010006101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма910Страница1.Свойство("П000010006101") Тогда
				ОкрП000010006101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница1.П000010006101);
			КонецЕсли;
            
            П000010007101 = Макс(ОкрП000010005101 - ОкрП000010006101, 0);
            
            Форма.СтруктураДанныхФорма910Страница1.Вставить("П000010007101", П000010007101);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010007101.Значение = П000010007101;
			КонецЕсли;
			
		КонецЕсли;

        //910.00.008
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010008101, ОбластьИмя) > 0 Тогда
			
			ОкрП000010007101 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
				ОкрП000010007101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010007101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма910Страница1.Свойство("П000010007101") Тогда
				ОкрП000010007101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница1.П000010007101);
			КонецЕсли;
			     
            
            П000010008101 = ОкрП000010007101 * 0.5;
            
            Форма.СтруктураДанныхФорма910Страница1.Вставить("П000010008101", П000010008101);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010008101.Значение = П000010008101;
			КонецЕсли;
			
		КонецЕсли;

        //910.00.009
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010009101, ОбластьИмя) > 0 Тогда
			
			ОкрП000010007101 = 0;                                                          
            ОкрП000020013701 = 0;
            ОкрП000030021701 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
				ОкрП000010007101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010007101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма910Страница1.Свойство("П000010007101") Тогда
				ОкрП000010007101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница1.П000010007101);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
				ОкрП000020013701 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020013701.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020013701") Тогда
				ОкрП000020013701 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020013701);
			КонецЕсли;
            
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
				ОкрП000030021701 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030021701.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030021701") Тогда
				ОкрП000030021701 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030021701);
			КонецЕсли;
			     
            П000010009101 = Макс(ОкрП000010007101 * 0.5 - Окр(ОкрП000020013701) - Окр(ОкрП000030021701), 0);
            
            Форма.СтруктураДанныхФорма910Страница1.Вставить("П000010009101", П000010009101);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010009101.Значение = П000010009101;
			КонецЕсли;
			
        КонецЕсли;
        
        //910.00.010
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010010101, ОбластьИмя) > 0 Тогда
            
            П000010010101 = 0;
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
            	П000010010101 = Форма.ТабличныйДокумент.Области.П000010010101.Значение;
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница1.Свойство("П000010010101") Тогда
                П000010010101 = Форма.СтруктураДанныхФорма910Страница1.П000010010101;
            КонецЕсли;
            
            Если П000010010101 > 60000 Тогда
                
                Сообщение = Новый СообщениеПользователю;
                Сообщение.Текст = НСтр("ru='Значение введенное в строке 910.00.010 очищено, так как превышает максимально допустимую сумму: 60 000.'");
                Сообщение.Сообщить();
        
                П000010010101 = 0;
                Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
                    Форма.ТабличныйДокумент.Области.П000010010101.Значение = П000010010101;
                КонецЕсли;
                
            КонецЕсли;
			
		КонецЕсли;

        //910.00.011
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010011101, ОбластьИмя) > 0 Тогда
			
			ОкрП000010008101 = 0;
			ОкрП000010010101 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
				ОкрП000010008101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010008101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма910Страница1.Свойство("П000010008101") Тогда
				ОкрП000010008101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница1.П000010008101);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
				ОкрП000010010101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010010101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма910Страница1.Свойство("П000010010101") Тогда
				ОкрП000010010101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница1.П000010010101);
			КонецЕсли;
                      
            П000010011101 = Макс(ОкрП000010008101 - ОкрП000010010101, 0);
            
            Форма.СтруктураДанныхФорма910Страница1.Вставить("П000010011101", П000010011101);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010011101.Значение = П000010011101;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма910Страница2" Тогда
        
        //910.00.012 VII
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020012701, ОбластьИмя) > 0 Тогда
			
			ОкрП000020012101 = 0;
            ОкрП000020012201 = 0;
            ОкрП000020012301 = 0;
            ОкрП000020012401 = 0;
            ОкрП000020012501 = 0;
            ОкрП000020012601 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020012101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012101.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020012101") Тогда
                ОкрП000020012101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020012101);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020012201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012201.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020012201") Тогда
                ОкрП000020012201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020012201);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020012301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012301.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020012301") Тогда
                ОкрП000020012301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020012301);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020012401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012401.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020012401") Тогда
                ОкрП000020012401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020012401);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020012501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012501.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020012501") Тогда
                ОкрП000020012501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020012501);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020012601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012601.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020012601") Тогда
                ОкрП000020012601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020012601);
            КонецЕсли;
			
			П000020012701 = ОкрП000020012101 + ОкрП000020012201 + ОкрП000020012301 + ОкрП000020012401 + ОкрП000020012501 + ОкрП000020012601;
			
			Форма.СтруктураДанныхФорма910Страница2.Вставить("П000020012701", П000020012701);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020012701.Значение = П000020012701;
			КонецЕсли;
			
		КонецЕсли;

		//910.00.013 VII
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020013701, ОбластьИмя) > 0 Тогда
			
			ОкрП000020013101 = 0;
            ОкрП000020013201 = 0;
            ОкрП000020013301 = 0;
            ОкрП000020013401 = 0;
            ОкрП000020013501 = 0;
            ОкрП000020013601 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020013101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020013101.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020013101") Тогда
                ОкрП000020013101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020013101);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020013201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020013201.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020013201") Тогда
                ОкрП000020013201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020013201);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020013301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020013301.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020013301") Тогда
                ОкрП000020013301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020013301);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020013401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020013401.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020013401") Тогда
                ОкрП000020013401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020013401);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020013501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020013501.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020013501") Тогда
                ОкрП000020013501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020013501);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020013601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020013601.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020013601") Тогда
                ОкрП000020013601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020013601);
            КонецЕсли;
			
			П000020013701 = ОкрП000020013101 + ОкрП000020013201 + ОкрП000020013301 + ОкрП000020013401 + ОкрП000020013501 + ОкрП000020013601;
			
			Форма.СтруктураДанныхФорма910Страница2.Вставить("П000020013701", П000020013701);
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020013701.Значение = П000020013701;
			КонецЕсли;

			Расчет(Форма, "Форма910Страница1", "П000020013701");  
			
		КонецЕсли;
		
		//910.00.014 VII
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020014701, ОбластьИмя) > 0 Тогда
			
			ОкрП000020014101 = 0;
            ОкрП000020014201 = 0;
            ОкрП000020014301 = 0;
            ОкрП000020014401 = 0;
            ОкрП000020014501 = 0;
            ОкрП000020014601 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020014101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020014101.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020014101") Тогда
                ОкрП000020014101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020014101);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020014201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020014201.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020014201") Тогда
                ОкрП000020014201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020014201);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020014301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020014301.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020014301") Тогда
                ОкрП000020014301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020014301);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020014401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020014401.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020014401") Тогда
                ОкрП000020014401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020014401);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020014501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020014501.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020014501") Тогда
                ОкрП000020014501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020014501);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020014601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020014601.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020014601") Тогда
                ОкрП000020014601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020014601);
            КонецЕсли;

			П000020014701 = ОкрП000020014101 + ОкрП000020014201 + ОкрП000020014301 + ОкрП000020014401 + ОкрП000020014501 + ОкрП000020014601;
			
			Форма.СтруктураДанныхФорма910Страница2.Вставить("П000020014701", П000020014701);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020014701.Значение = П000020014701;
			КонецЕсли;
			
		КонецЕсли;
		
        //910.00.015 VII
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020015701, ОбластьИмя) > 0 Тогда
			
			ОкрП000020015101 = 0;
            ОкрП000020015201 = 0;
            ОкрП000020015301 = 0;
            ОкрП000020015401 = 0;
            ОкрП000020015501 = 0;
            ОкрП000020015601 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020015101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020015101.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020015101") Тогда
                ОкрП000020015101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020015101);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020015201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020015201.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020015201") Тогда
                ОкрП000020015201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020015201);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020015301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020015301.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020015301") Тогда
                ОкрП000020015301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020015301);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020015401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020015401.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020015401") Тогда
                ОкрП000020015401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020015401);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020015501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020015501.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020015501") Тогда
                ОкрП000020015501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020015501);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020015601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020015601.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020015601") Тогда
                ОкрП000020015601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020015601);
            КонецЕсли;
			
			П000020015701 = ОкрП000020015101 + ОкрП000020015201 + ОкрП000020015301 + ОкрП000020015401 + ОкрП000020015501 + ОкрП000020015601;
			
			Форма.СтруктураДанныхФорма910Страница2.Вставить("П000020015701", П000020015701);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020015701.Значение = П000020015701;
			КонецЕсли;
			
		КонецЕсли;

        //910.00.016 VII
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020016701, ОбластьИмя) > 0 Тогда
			
			ОкрП000020016101 = 0;
            ОкрП000020016201 = 0;
            ОкрП000020016301 = 0;
            ОкрП000020016401 = 0;
            ОкрП000020016501 = 0;
            ОкрП000020016601 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020016101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020016101.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020016101") Тогда
                ОкрП000020016101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020016101);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020016201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020016201.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020016201") Тогда
                ОкрП000020016201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020016201);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020016301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020016301.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020016301") Тогда
                ОкрП000020016301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020016301);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020016401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020016401.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020016401") Тогда
                ОкрП000020016401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020016401);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020016501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020016501.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020016501") Тогда
                ОкрП000020016501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020016501);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020016601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020016601.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020016601") Тогда
                ОкрП000020016601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020016601);
            КонецЕсли;
			
			П000020016701 = ОкрП000020016101 + ОкрП000020016201 + ОкрП000020016301 + ОкрП000020016401 + ОкрП000020016501 + ОкрП000020016601;
			
			Форма.СтруктураДанныхФорма910Страница2.Вставить("П000020016701", П000020016701);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020016701.Значение = П000020016701;
			КонецЕсли;
			
		КонецЕсли;

        //910.00.017 VII
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020017701, ОбластьИмя) > 0 Тогда
			
			ОкрП000020017101 = 0;
            ОкрП000020017201 = 0;
            ОкрП000020017301 = 0;
            ОкрП000020017401 = 0;
            ОкрП000020017501 = 0;
            ОкрП000020017601 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020017101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020017101.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020017101") Тогда
                ОкрП000020017101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020017101);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020017201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020017201.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020017201") Тогда
                ОкрП000020017201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020017201);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020017301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020017301.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020017301") Тогда
                ОкрП000020017301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020017301);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020017401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020017401.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020017401") Тогда
                ОкрП000020017401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020017401);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020017501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020017501.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020017501") Тогда
                ОкрП000020017501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020017501);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
                ОкрП000020017601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020017601.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница2.Свойство("П000020017601") Тогда
                ОкрП000020017601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница2.П000020017601);
            КонецЕсли;
			
			П000020017701 = ОкрП000020017101 + ОкрП000020017201 + ОкрП000020017301 + ОкрП000020017401 + ОкрП000020017501 + ОкрП000020017601;
			
			Форма.СтруктураДанныхФорма910Страница2.Вставить("П000020017701", П000020017701);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020017701.Значение = П000020017701;
			КонецЕсли;
			
		КонецЕсли;
        
    ИначеЕсли ИмяСтраницыПанели = "Форма910Страница3" Тогда

         //910.00.018 VII
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030018701, ОбластьИмя) > 0 Тогда
			
			ОкрП000030018101 = 0;
            ОкрП000030018201 = 0;
            ОкрП000030018301 = 0;
            ОкрП000030018401 = 0;
            ОкрП000030018501 = 0;
            ОкрП000030018601 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030018101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030018101.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030018101") Тогда
                ОкрП000030018101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030018101);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030018201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030018201.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030018201") Тогда
                ОкрП000030018201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030018201);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030018301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030018301.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030018301") Тогда
                ОкрП000030018301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030018301);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030018401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030018401.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030018401") Тогда
                ОкрП000030018401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030018401);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030018501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030018501.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030018501") Тогда
                ОкрП000030018501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030018501);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030018601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030018601.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030018601") Тогда
                ОкрП000030018601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030018601);
            КонецЕсли;
			
			П000030018701 = ОкрП000030018101 + ОкрП000030018201 + ОкрП000030018301 + ОкрП000030018401 + ОкрП000030018501 + ОкрП000030018601;
			
			Форма.СтруктураДанныхФорма910Страница3.Вставить("П000030018701", П000030018701);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030018701.Значение = П000030018701;
			КонецЕсли;
			
		КонецЕсли;

         //910.00.019 VII
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030019701, ОбластьИмя) > 0 Тогда
			
			ОкрП000030019101 = 0;
            ОкрП000030019201 = 0;
            ОкрП000030019301 = 0;
            ОкрП000030019401 = 0;
            ОкрП000030019501 = 0;
            ОкрП000030019601 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030019101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030019101.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030019101") Тогда
                ОкрП000030019101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030019101);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030019201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030019201.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030019201") Тогда
                ОкрП000030019201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030019201);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030019301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030019301.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030019301") Тогда
                ОкрП000030019301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030019301);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030019401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030019401.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030019401") Тогда
                ОкрП000030019401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030019401);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030019501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030019501.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030019501") Тогда
                ОкрП000030019501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030019501);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030019601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030019601.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030019601") Тогда
                ОкрП000030019601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030019601);
            КонецЕсли;
			
			П000030019701 = ОкрП000030019101 + ОкрП000030019201 + ОкрП000030019301 + ОкрП000030019401 + ОкрП000030019501 + ОкрП000030019601;
			
			Форма.СтруктураДанныхФорма910Страница3.Вставить("П000030019701", П000030019701);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030019701.Значение = П000030019701;
			КонецЕсли;
			
        КонецЕсли;
        
        //910.00.020 VII
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030020701, ОбластьИмя) > 0 Тогда
			
			ОкрП000030020101 = 0;
            ОкрП000030020201 = 0;
            ОкрП000030020301 = 0;
            ОкрП000030020401 = 0;
            ОкрП000030020501 = 0;
            ОкрП000030020601 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030020101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030020101.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030020101") Тогда
                ОкрП000030020101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030020101);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030020201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030020201.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030020201") Тогда
                ОкрП000030020201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030020201);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030020301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030020301.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030020301") Тогда
                ОкрП000030020301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030020301);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030020401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030020401.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030020401") Тогда
                ОкрП000030020401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030020401);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030020501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030020501.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030020501") Тогда
                ОкрП000030020501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030020501);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030020601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030020601.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030020601") Тогда
                ОкрП000030020601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030020601);
            КонецЕсли;
			
			П000030020701 = ОкрП000030020101 + ОкрП000030020201 + ОкрП000030020301 + ОкрП000030020401 + ОкрП000030020501 + ОкрП000030020601;
			
			Форма.СтруктураДанныхФорма910Страница3.Вставить("П000030020701", П000030020701);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030020701.Значение = П000030020701;
            КонецЕсли;
          	Расчет(Форма, "Форма910Страница1", "П000030020701");  
		
		КонецЕсли;

        //910.00.021 VII
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030021701, ОбластьИмя) > 0 Тогда
			
			ОкрП000030021101 = 0;
            ОкрП000030021201 = 0;
            ОкрП000030021301 = 0;
            ОкрП000030021401 = 0;
            ОкрП000030021501 = 0;
            ОкрП000030021601 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030021101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030021101.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030021101") Тогда
                ОкрП000030021101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030021101);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030021201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030021201.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030021201") Тогда
                ОкрП000030021201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030021201);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030021301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030021301.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030021301") Тогда
                ОкрП000030021301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030021301);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030021401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030021401.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030021401") Тогда
                ОкрП000030021401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030021401);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030021501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030021501.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030021501") Тогда
                ОкрП000030021501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030021501);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030021601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030021601.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030021601") Тогда
                ОкрП000030021601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030021601);
            КонецЕсли;

			П000030021701 = ОкрП000030021101 + ОкрП000030021201 + ОкрП000030021301 + ОкрП000030021401 + ОкрП000030021501 + ОкрП000030021601;
			
			Форма.СтруктураДанныхФорма910Страница3.Вставить("П000030021701", П000030021701);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030021701.Значение = П000030021701;
            КонецЕсли;
            
            Расчет(Форма, "Форма910Страница1", "П000030021701");  
			
		КонецЕсли;

        //910.00.022 VII
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030022701, ОбластьИмя) > 0 Тогда
			
			ОкрП000030022101 = 0;
            ОкрП000030022201 = 0;
            ОкрП000030022301 = 0;
            ОкрП000030022401 = 0;
            ОкрП000030022501 = 0;
            ОкрП000030022601 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030022101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030022101.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030022101") Тогда
                ОкрП000030022101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030022101);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030022201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030022201.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030022201") Тогда
                ОкрП000030022201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030022201);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030022301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030022301.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030022301") Тогда
                ОкрП000030022301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030022301);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030022401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030022401.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030022401") Тогда
                ОкрП000030022401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030022401);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030022501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030022501.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030022501") Тогда
                ОкрП000030022501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030022501);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030022601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030022601.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030022601") Тогда
                ОкрП000030022601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030022601);
            КонецЕсли;
			
			П000030022701 = ОкрП000030022101 + ОкрП000030022201 + ОкрП000030022301 + ОкрП000030022401 + ОкрП000030022501 + ОкрП000030022601;
			
			Форма.СтруктураДанныхФорма910Страница3.Вставить("П000030022701", П000030022701);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030022701.Значение = П000030022701;
			КонецЕсли;
			
        КонецЕсли;
        
        //910.00.023 VII
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030023701, ОбластьИмя) > 0 Тогда
			
			ОкрП000030023101 = 0;
            ОкрП000030023201 = 0;
            ОкрП000030023301 = 0;
            ОкрП000030023401 = 0;
            ОкрП000030023501 = 0;
            ОкрП000030023601 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030023101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030023101.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030023101") Тогда
                ОкрП000030023101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030023101);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030023201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030023201.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030023201") Тогда
                ОкрП000030023201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030023201);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030023301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030023301.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030023301") Тогда
                ОкрП000030023301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030023301);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030023401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030023401.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030023401") Тогда
                ОкрП000030023401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030023401);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030023501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030023501.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030023501") Тогда
                ОкрП000030023501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030023501);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030023601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030023601.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030023601") Тогда
                ОкрП000030023601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030023601);
            КонецЕсли;
			
			П000030023701 = ОкрП000030023101 + ОкрП000030023201 + ОкрП000030023301 + ОкрП000030023401 + ОкрП000030023501 + ОкрП000030023601;
			
			Форма.СтруктураДанныхФорма910Страница3.Вставить("П000030023701", П000030023701);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030023701.Значение = П000030023701;
			КонецЕсли;
			
		КонецЕсли;

        //910.00.024 VII
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030024701, ОбластьИмя) > 0 Тогда
			
			ОкрП000030024101 = 0;
            ОкрП000030024201 = 0;
            ОкрП000030024301 = 0;
            ОкрП000030024401 = 0;
            ОкрП000030024501 = 0;
            ОкрП000030024601 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030024101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030024101.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030024101") Тогда
                ОкрП000030024101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030024101);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030024201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030024201.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030024201") Тогда
                ОкрП000030024201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030024201);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030024301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030024301.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030024301") Тогда
                ОкрП000030024301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030024301);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030024401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030024401.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030024401") Тогда
                ОкрП000030024401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030024401);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030024501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030024501.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030024501") Тогда
                ОкрП000030024501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030024501);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030024601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030024601.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030024601") Тогда
                ОкрП000030024601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030024601);
            КонецЕсли;

			П000030024701 = ОкрП000030024101 + ОкрП000030024201 + ОкрП000030024301 + ОкрП000030024401 + ОкрП000030024501 + ОкрП000030024601;
			
			Форма.СтруктураДанныхФорма910Страница3.Вставить("П000030024701", П000030024701);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030024701.Значение = П000030024701;
			КонецЕсли;
			
		КонецЕсли;

        //910.00.025 VII
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030025701, ОбластьИмя) > 0 Тогда
			
			ОкрП000030025101 = 0;
            ОкрП000030025201 = 0;
            ОкрП000030025301 = 0;
            ОкрП000030025401 = 0;
            ОкрП000030025501 = 0;
            ОкрП000030025601 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030025101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030025101.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030025101") Тогда
                ОкрП000030025101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030025101);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030025201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030025201.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030025201") Тогда
                ОкрП000030025201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030025201);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030025301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030025301.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030025301") Тогда
                ОкрП000030025301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030025301);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030025401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030025401.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030025401") Тогда
                ОкрП000030025401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030025401);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030025501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030025501.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030025501") Тогда
                ОкрП000030025501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030025501);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
                ОкрП000030025601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030025601.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница3.Свойство("П000030025601") Тогда
                ОкрП000030025601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница3.П000030025601);
            КонецЕсли;
			
			П000030025701 = ОкрП000030025101 + ОкрП000030025201 + ОкрП000030025301 + ОкрП000030025401 + ОкрП000030025501 + ОкрП000030025601;
			
			Форма.СтруктураДанныхФорма910Страница3.Вставить("П000030025701", П000030025701);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030025701.Значение = П000030025701;
			КонецЕсли;
			
		КонецЕсли;

	ИначеЕсли ИмяСтраницыПанели = "Форма910Страница4" Тогда
        
        //910.00.026 VII
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000040026701, ОбластьИмя) > 0 Тогда
			
			ОкрП000040026101 = 0;
            ОкрП000040026201 = 0;
            ОкрП000040026301 = 0;
            ОкрП000040026401 = 0;
            ОкрП000040026501 = 0;
            ОкрП000040026601 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница4" Тогда
                ОкрП000040026101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040026101.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница4.Свойство("П000040026101") Тогда
                ОкрП000040026101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница4.П000040026101);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница4" Тогда
                ОкрП000040026201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040026201.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница4.Свойство("П000040026201") Тогда
                ОкрП000040026201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница4.П000040026201);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница4" Тогда
                ОкрП000040026301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040026301.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница4.Свойство("П000040026301") Тогда
                ОкрП000040026301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница4.П000040026301);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница4" Тогда
                ОкрП000040026401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040026401.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница4.Свойство("П000040026401") Тогда
                ОкрП000040026401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница4.П000040026401);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница4" Тогда
                ОкрП000040026501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040026501.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница4.Свойство("П000040026501") Тогда
                ОкрП000040026501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница4.П000040026501);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница4" Тогда
                ОкрП000040026601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040026601.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница4.Свойство("П000040026601") Тогда
                ОкрП000040026601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница4.П000040026601);
            КонецЕсли;
			
			П000040026701 = ОкрП000040026101 + ОкрП000040026201 + ОкрП000040026301 + ОкрП000040026401 + ОкрП000040026501 + ОкрП000040026601;
			
			Форма.СтруктураДанныхФорма910Страница4.Вставить("П000040026701", П000040026701);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница4" Тогда
				Форма.ТабличныйДокумент.Области.П000040026701.Значение = П000040026701;
			КонецЕсли;
			
		КонецЕсли;
        
         //910.00.027 VII
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000040027701, ОбластьИмя) > 0 Тогда
			
			ОкрП000040027101 = 0;
            ОкрП000040027201 = 0;
            ОкрП000040027301 = 0;
            ОкрП000040027401 = 0;
            ОкрП000040027501 = 0;
            ОкрП000040027601 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница4" Тогда
                ОкрП000040027101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040027101.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница4.Свойство("П000040027101") Тогда
                ОкрП000040027101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница4.П000040027101);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница4" Тогда
                ОкрП000040027201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040027201.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница4.Свойство("П000040027201") Тогда
                ОкрП000040027201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница4.П000040027201);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница4" Тогда
                ОкрП000040027301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040027301.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница4.Свойство("П000040027301") Тогда
                ОкрП000040027301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница4.П000040027301);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница4" Тогда
                ОкрП000040027401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040027401.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница4.Свойство("П000040027401") Тогда
                ОкрП000040027401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница4.П000040027401);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница4" Тогда
                ОкрП000040027501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040027501.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница4.Свойство("П000040027501") Тогда
                ОкрП000040027501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница4.П000040027501);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница4" Тогда
                ОкрП000040027601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040027601.Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма910Страница4.Свойство("П000040027601") Тогда
                ОкрП000040027601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма910Страница4.П000040027601);
            КонецЕсли;
			
			П000040027701 = ОкрП000040027101 + ОкрП000040027201 + ОкрП000040027301 + ОкрП000040027401 + ОкрП000040027501 + ОкрП000040027601;
			
			Форма.СтруктураДанныхФорма910Страница4.Вставить("П000040027701", П000040027701);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница4" Тогда
				Форма.ТабличныйДокумент.Области.П000040027701.Значение = П000040027701;
			КонецЕсли;
			
		КонецЕсли;
        
    ИначеЕсли ИмяСтраницыПанели = "Форма910_01Страница1" Тогда
        
        Форма.СтруктураДанныхФорма910Страница1.Вставить("Приложение01", "Х");
        Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
            Форма.ТабличныйДокумент.Области.Приложение01.Значение = ?(ЕстьДанныеПриложение1, "Х", "");
        КонецЕсли;
        
        Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000110000201_1, ОбластьИмя)> 0 Тогда 
            
            НомерСтроки = 2;
            Форма.СтруктураДанныхФорма910_01Страница1.Вставить("П000110000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_01Страница2.Вставить("П000120000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_01Страница3.Вставить("П000130000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_01Страница4.Вставить("П000140000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_01Страница5.Вставить("П000150000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_01Страница6.Вставить("П000160000201_1", НомерСтроки);
            
            Форма.П0001100002[0].П000110000201 = НомерСтроки;
            Форма.П0001200002[0].П000120000201 = НомерСтроки;
            Форма.П0001300002[0].П000130000201 = НомерСтроки;
            Форма.П0001400002[0].П000140000201 = НомерСтроки;
            Форма.П0001500002[0].П000150000201 = НомерСтроки;
            Форма.П0001600002[0].П000160000201 = НомерСтроки;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                Форма.ТабличныйДокумент.Области.П000110000201_1.Значение = 2;
            КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000110000106, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000110000106 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы11]].Количество() Цикл
                    СуммаП000110000106 = СуммаП000110000106 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000110000206_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000110000106.Значение = СуммаП000110000106;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы11]].Количество() Цикл
                    СуммаП000110000106 = СуммаП000110000106 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы11]][Ном - 1].П000110000206);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_01Страница1.Вставить("П000110000106", СуммаП000110000106);
                
            КонецЕсли;
            
        КонецЕсли;
        
	ИначеЕсли ИмяСтраницыПанели = "Форма910_01Страница2" Тогда
		
		Форма.СтруктураДанныхФорма910Страница1.Вставить("Приложение01", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение01.Значение = ?(ЕстьДанныеПриложение1, "Х", "");
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000120000201_1, ОбластьИмя)> 0 Тогда 
			                                                               
			НомерСтроки = 2;
			Форма.СтруктураДанныхФорма910_01Страница1.Вставить("П000110000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма910_01Страница2.Вставить("П000120000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма910_01Страница3.Вставить("П000130000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма910_01Страница4.Вставить("П000140000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма910_01Страница5.Вставить("П000150000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма910_01Страница6.Вставить("П000160000201_1", НомерСтроки);
			
			Форма.П0001100002[0].П000110000201 = НомерСтроки;
			Форма.П0001200002[0].П000120000201 = НомерСтроки;
			Форма.П0001300002[0].П000130000201 = НомерСтроки;
			Форма.П0001400002[0].П000140000201 = НомерСтроки;
			Форма.П0001500002[0].П000150000201 = НомерСтроки;
			Форма.П0001600002[0].П000160000201 = НомерСтроки;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000120000201_1.Значение = 2;
			КонецЕсли;
			
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000120000103, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000120000103 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы12]].Количество() Цикл
                    СуммаП000120000103 = СуммаП000120000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000120000203_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000120000103.Значение = СуммаП000120000103;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы12]].Количество() Цикл
                    СуммаП000120000103 = СуммаП000120000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы12]][Ном - 1].П000120000203);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_01Страница2.Вставить("П000120000103", СуммаП000120000103);
                
            КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000120000104, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000120000104 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы12]].Количество() Цикл
                    СуммаП000120000104 = СуммаП000120000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000120000204_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000120000104.Значение = СуммаП000120000104;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы12]].Количество() Цикл
                    СуммаП000120000104 = СуммаП000120000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы12]][Ном - 1].П000120000204);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_01Страница2.Вставить("П000120000104", СуммаП000120000104);
                
            КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000120000105, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000120000105 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы12]].Количество() Цикл
                    СуммаП000120000105 = СуммаП000120000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000120000205_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000120000105.Значение = СуммаП000120000105;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы12]].Количество() Цикл
                    СуммаП000120000105 = СуммаП000120000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы12]][Ном - 1].П000120000205);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_01Страница2.Вставить("П000120000105", СуммаП000120000105);
                
            КонецЕсли;
            
        КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма910_01Страница3"  Тогда
		
		Форма.СтруктураДанныхФорма910Страница1.Вставить("Приложение01", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение01.Значение = ?(ЕстьДанныеПриложение1, "Х", "");
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000130000201_1, ОбластьИмя)> 0 Тогда 
			
			НомерСтроки = 2;
			Форма.СтруктураДанныхФорма910_01Страница1.Вставить("П000110000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма910_01Страница2.Вставить("П000120000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма910_01Страница3.Вставить("П000130000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма910_01Страница4.Вставить("П000140000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма910_01Страница5.Вставить("П000150000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма910_01Страница6.Вставить("П000160000201_1", НомерСтроки);
			
			Форма.П0001100002[0].П000110000201 = НомерСтроки;
			Форма.П0001200002[0].П000120000201 = НомерСтроки;
			Форма.П0001300002[0].П000130000201 = НомерСтроки;
			Форма.П0001400002[0].П000140000201 = НомерСтроки;
			Форма.П0001500002[0].П000150000201 = НомерСтроки;
			Форма.П0001600002[0].П000160000201 = НомерСтроки;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000130000201_1.Значение = 2;
			КонецЕсли;
			
        КонецЕсли;

        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000130000103, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000130000103 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы13]].Количество() Цикл
                    СуммаП000130000103 = СуммаП000130000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000130000203_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000130000103.Значение = СуммаП000130000103;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы13]].Количество() Цикл
                    СуммаП000130000103 = СуммаП000130000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы13]][Ном - 1].П000130000203);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_01Страница3.Вставить("П000130000103", СуммаП000130000103);
                
            КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000130000105, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000130000105 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы13]].Количество() Цикл
                    СуммаП000130000105 = СуммаП000130000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000130000205_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000130000105.Значение = СуммаП000130000105;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы13]].Количество() Цикл
                    СуммаП000130000105 = СуммаП000130000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы13]][Ном - 1].П000130000205);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_01Страница3.Вставить("П000130000105", СуммаП000130000105);
                
            КонецЕсли;
            
        КонецЕсли;
		
    ИначеЕсли ИмяСтраницыПанели = "Форма910_01Страница4" Тогда
        
        Форма.СтруктураДанныхФорма910Страница1.Вставить("Приложение01", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение01.Значение = ?(ЕстьДанныеПриложение1, "Х", "");
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000140000201_1, ОбластьИмя)> 0 Тогда 
			
			НомерСтроки = 2;
			Форма.СтруктураДанныхФорма910_01Страница1.Вставить("П000110000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма910_01Страница2.Вставить("П000120000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма910_01Страница3.Вставить("П000130000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма910_01Страница4.Вставить("П000140000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма910_01Страница5.Вставить("П000150000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма910_01Страница6.Вставить("П000160000201_1", НомерСтроки);
			
			Форма.П0001100002[0].П000110000201 = НомерСтроки;
			Форма.П0001200002[0].П000120000201 = НомерСтроки;
			Форма.П0001300002[0].П000130000201 = НомерСтроки;
			Форма.П0001400002[0].П000140000201 = НомерСтроки;
			Форма.П0001500002[0].П000150000201 = НомерСтроки;
			Форма.П0001600002[0].П000160000201 = НомерСтроки;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000140000201_1.Значение = 2;
			КонецЕсли;
			
        КонецЕсли;

        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000140000102, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000140000102 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы14]].Количество() Цикл
                    СуммаП000140000102 = СуммаП000140000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000140000202_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000140000102.Значение = СуммаП000140000102;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы14]].Количество() Цикл
                    СуммаП000140000102 = СуммаП000140000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы14]][Ном - 1].П000140000202);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_01Страница4.Вставить("П000140000102", СуммаП000140000102);
                
            КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000140000103, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000140000103 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы14]].Количество() Цикл
                    СуммаП000140000103 = СуммаП000140000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000140000203_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000140000103.Значение = СуммаП000140000103;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы14]].Количество() Цикл
                    СуммаП000140000103 = СуммаП000140000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы14]][Ном - 1].П000140000203);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_01Страница4.Вставить("П000140000103", СуммаП000140000103);
                
            КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000140000104, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000140000104 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы14]].Количество() Цикл
                    СуммаП000140000104 = СуммаП000140000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000140000204_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000140000104.Значение = СуммаП000140000104;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы14]].Количество() Цикл
                    СуммаП000140000104 = СуммаП000140000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы14]][Ном - 1].П000140000204);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_01Страница4.Вставить("П000140000104", СуммаП000140000104);
                
            КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000140000105, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000140000105 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы14]].Количество() Цикл
                    СуммаП000140000105 = СуммаП000140000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000140000205_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000140000105.Значение = СуммаП000140000105;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы14]].Количество() Цикл
                    СуммаП000140000105 = СуммаП000140000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы14]][Ном - 1].П000140000205);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_01Страница4.Вставить("П000140000105", СуммаП000140000105);
                
            КонецЕсли;
            
        КонецЕсли;
        
    ИначеЕсли ИмяСтраницыПанели = "Форма910_01Страница5" Тогда
        
        Форма.СтруктураДанныхФорма910Страница1.Вставить("Приложение01", "Х");
        Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
            Форма.ТабличныйДокумент.Области.Приложение01.Значение = ?(ЕстьДанныеПриложение1, "Х", "");
        КонецЕсли;
        
        Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000150000201_1, ОбластьИмя)> 0 Тогда 
            
            НомерСтроки = 2;
            Форма.СтруктураДанныхФорма910_01Страница1.Вставить("П000110000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_01Страница2.Вставить("П000120000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_01Страница3.Вставить("П000130000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_01Страница4.Вставить("П000140000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_01Страница5.Вставить("П000150000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_01Страница6.Вставить("П000160000201_1", НомерСтроки);
            
            Форма.П0001100002[0].П000110000201 = НомерСтроки;
            Форма.П0001200002[0].П000120000201 = НомерСтроки;
            Форма.П0001300002[0].П000130000201 = НомерСтроки;
            Форма.П0001400002[0].П000140000201 = НомерСтроки;
            Форма.П0001500002[0].П000150000201 = НомерСтроки;
            Форма.П0001600002[0].П000160000201 = НомерСтроки;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                Форма.ТабличныйДокумент.Области.П000150000201_1.Значение = 2;
            КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000150000102, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000150000102 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]].Количество() Цикл
                    СуммаП000150000102 = СуммаП000150000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000150000202_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000150000102.Значение = СуммаП000150000102;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]].Количество() Цикл
                    СуммаП000150000102 = СуммаП000150000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]][Ном - 1].П000150000202);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_01Страница5.Вставить("П000150000102", СуммаП000150000102);
                
            КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000150000103, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000150000103 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]].Количество() Цикл
                    СуммаП000150000103 = СуммаП000150000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000150000203_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000150000103.Значение = СуммаП000150000103;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]].Количество() Цикл
                    СуммаП000150000103 = СуммаП000150000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]][Ном - 1].П000150000203);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_01Страница5.Вставить("П000150000103", СуммаП000150000103);
                
            КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000150000104, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000150000104 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]].Количество() Цикл
                    СуммаП000150000104 = СуммаП000150000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000150000204_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000150000104.Значение = СуммаП000150000104;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]].Количество() Цикл
                    СуммаП000150000104 = СуммаП000150000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]][Ном - 1].П000150000204);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_01Страница5.Вставить("П000150000104", СуммаП000150000104);
                
            КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000150000105, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000150000105 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]].Количество() Цикл
                    СуммаП000150000105 = СуммаП000150000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000150000205_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000150000105.Значение = СуммаП000150000105;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]].Количество() Цикл
                    СуммаП000150000105 = СуммаП000150000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]][Ном - 1].П000150000205);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_01Страница5.Вставить("П000150000105", СуммаП000150000105);
                
            КонецЕсли;
            
        КонецЕсли;
        
    ИначеЕсли ИмяСтраницыПанели = "Форма910_01Страница6" Тогда
        
        Форма.СтруктураДанныхФорма910Страница1.Вставить("Приложение01", "Х");
        Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
            Форма.ТабличныйДокумент.Области.Приложение01.Значение = ?(ЕстьДанныеПриложение1, "Х", "");
        КонецЕсли;
        
        Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000160000201_1, ОбластьИмя)> 0 Тогда 
            
            НомерСтроки = 2;
            Форма.СтруктураДанныхФорма910_01Страница1.Вставить("П000110000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_01Страница2.Вставить("П000120000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_01Страница3.Вставить("П000130000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_01Страница4.Вставить("П000140000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_01Страница5.Вставить("П000150000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_01Страница6.Вставить("П000160000201_1", НомерСтроки);
            
            Форма.П0001100002[0].П000110000201 = НомерСтроки;
            Форма.П0001200002[0].П000120000201 = НомерСтроки;
            Форма.П0001300002[0].П000130000201 = НомерСтроки;
            Форма.П0001400002[0].П000140000201 = НомерСтроки;
            Форма.П0001500002[0].П000150000201 = НомерСтроки;
            Форма.П0001600002[0].П000160000201 = НомерСтроки;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                Форма.ТабличныйДокумент.Области.П000160000201_1.Значение = 2;
            КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000160000102, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000160000102 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы16]].Количество() Цикл
                    СуммаП000160000102 = СуммаП000160000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000160000202_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000160000102.Значение = СуммаП000160000102;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы16]].Количество() Цикл
                    СуммаП000160000102 = СуммаП000160000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы16]][Ном - 1].П000160000202);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_01Страница6.Вставить("П000160000102", СуммаП000160000102);
                
            КонецЕсли;
            
        КонецЕсли;
        
    ИначеЕсли ИмяСтраницыПанели = "Форма910_02Страница1" Тогда
        
        Форма.СтруктураДанныхФорма910Страница1.Вставить("Приложение02", "Х");
        Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
            Форма.ТабличныйДокумент.Области.Приложение02.Значение = ?(ЕстьДанныеПриложение2, "Х", "");
        КонецЕсли;
        
        Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210000201_1, ОбластьИмя)> 0 Тогда 
            
            НомерСтроки = 2;
            Форма.СтруктураДанныхФорма910_02Страница1.Вставить("П000210000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница2.Вставить("П000220000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница3.Вставить("П000230000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница4.Вставить("П000240000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница5.Вставить("П000250000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница6.Вставить("П000260000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница7.Вставить("П000270000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница8.Вставить("П000280000201_1", НомерСтроки);
            
            Форма.П0002100002[0].П000210000201 = НомерСтроки;
            Форма.П0002200002[0].П000220000201 = НомерСтроки;
            Форма.П0002300002[0].П000230000201 = НомерСтроки;
            Форма.П0002400002[0].П000240000201 = НомерСтроки;
            Форма.П0002500002[0].П000250000201 = НомерСтроки;
            Форма.П0002600002[0].П000260000201 = НомерСтроки;
            Форма.П0002700002[0].П000270000201 = НомерСтроки;
            Форма.П0002800002[0].П000280000201 = НомерСтроки;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                Форма.ТабличныйДокумент.Области.П000210000201_1.Значение = 2;
            КонецЕсли;
            
        КонецЕсли;
        
    ИначеЕсли ИмяСтраницыПанели = "Форма910_02Страница2" Тогда
        
        Форма.СтруктураДанныхФорма910Страница1.Вставить("Приложение02", "Х");
        Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
            Форма.ТабличныйДокумент.Области.Приложение02.Значение = ?(ЕстьДанныеПриложение2, "Х", "");
        КонецЕсли;
        
        Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000220000201_1, ОбластьИмя)> 0 Тогда 
            
            НомерСтроки = 2;
            Форма.СтруктураДанныхФорма910_02Страница1.Вставить("П000210000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница2.Вставить("П000220000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница3.Вставить("П000230000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница4.Вставить("П000240000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница5.Вставить("П000250000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница6.Вставить("П000260000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница7.Вставить("П000270000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница8.Вставить("П000280000201_1", НомерСтроки);
            
            Форма.П0002100002[0].П000210000201 = НомерСтроки;
            Форма.П0002200002[0].П000220000201 = НомерСтроки;
            Форма.П0002300002[0].П000230000201 = НомерСтроки;
            Форма.П0002400002[0].П000240000201 = НомерСтроки;
            Форма.П0002500002[0].П000250000201 = НомерСтроки;
            Форма.П0002600002[0].П000260000201 = НомерСтроки;
            Форма.П0002700002[0].П000270000201 = НомерСтроки;
            Форма.П0002800002[0].П000280000201 = НомерСтроки;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                Форма.ТабличныйДокумент.Области.П000220000201_1.Значение = 2;
            КонецЕсли;
            
        КонецЕсли;
        
    ИначеЕсли ИмяСтраницыПанели = "Форма910_02Страница3" Тогда
        
        Форма.СтруктураДанныхФорма910Страница1.Вставить("Приложение02", "Х");
        Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
            Форма.ТабличныйДокумент.Области.Приложение02.Значение = ?(ЕстьДанныеПриложение2, "Х", "");
        КонецЕсли;
        
        Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000230000201_1, ОбластьИмя)> 0 Тогда 
            
            НомерСтроки = 2;
            Форма.СтруктураДанныхФорма910_02Страница1.Вставить("П000210000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница2.Вставить("П000220000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница3.Вставить("П000230000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница4.Вставить("П000240000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница5.Вставить("П000250000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница6.Вставить("П000260000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница7.Вставить("П000270000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница8.Вставить("П000280000201_1", НомерСтроки);
            
            Форма.П0002100002[0].П000210000201 = НомерСтроки;
            Форма.П0002200002[0].П000220000201 = НомерСтроки;
            Форма.П0002300002[0].П000230000201 = НомерСтроки;
            Форма.П0002400002[0].П000240000201 = НомерСтроки;
            Форма.П0002500002[0].П000250000201 = НомерСтроки;
            Форма.П0002600002[0].П000260000201 = НомерСтроки;
            Форма.П0002700002[0].П000270000201 = НомерСтроки;
            Форма.П0002800002[0].П000280000201 = НомерСтроки;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                Форма.ТабличныйДокумент.Области.П000230000201_1.Значение = 2;
            КонецЕсли;
            
        КонецЕсли;

        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000230000107, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000230000107 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы23]].Количество() Цикл
                    СуммаП000230000107 = СуммаП000230000107 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000230000207_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000230000107.Значение = СуммаП000230000107;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы23]].Количество() Цикл
                    СуммаП000230000107 = СуммаП000230000107 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы23]][Ном - 1].П000230000207);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_02Страница3.Вставить("П000230000107", СуммаП000230000107);
                
            КонецЕсли;
            
        КонецЕсли;
        
    ИначеЕсли ИмяСтраницыПанели = "Форма910_02Страница3" Тогда
        
        Форма.СтруктураДанныхФорма910Страница1.Вставить("Приложение02", "Х");
        Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
            Форма.ТабличныйДокумент.Области.Приложение02.Значение = ?(ЕстьДанныеПриложение2, "Х", "");
        КонецЕсли;
        
        Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000230000201_1, ОбластьИмя)> 0 Тогда 
            
            НомерСтроки = 2;
            Форма.СтруктураДанныхФорма910_02Страница1.Вставить("П000210000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница2.Вставить("П000220000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница3.Вставить("П000230000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница4.Вставить("П000240000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница5.Вставить("П000250000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница6.Вставить("П000260000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница7.Вставить("П000270000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница8.Вставить("П000280000201_1", НомерСтроки);
            
            Форма.П0002100002[0].П000210000201 = НомерСтроки;
            Форма.П0002200002[0].П000220000201 = НомерСтроки;
            Форма.П0002300002[0].П000230000201 = НомерСтроки;
            Форма.П0002400002[0].П000240000201 = НомерСтроки;
            Форма.П0002500002[0].П000250000201 = НомерСтроки;
            Форма.П0002600002[0].П000260000201 = НомерСтроки;
            Форма.П0002700002[0].П000270000201 = НомерСтроки;
            Форма.П0002800002[0].П000280000201 = НомерСтроки;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                Форма.ТабличныйДокумент.Области.П000230000201_1.Значение = 2;
            КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000230000107, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000230000107 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы23]].Количество() Цикл
                    СуммаП000230000107 = СуммаП000230000107 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000230000207_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000230000107.Значение = СуммаП000230000107;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы23]].Количество() Цикл
                    СуммаП000230000107 = СуммаП000230000107 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы23]][Ном - 1].П000230000207);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_02Страница3.Вставить("П000230000107", СуммаП000230000107);
                
            КонецЕсли;
            
        КонецЕсли;
        
    ИначеЕсли ИмяСтраницыПанели = "Форма910_02Страница4" Тогда
        
        Форма.СтруктураДанныхФорма910Страница1.Вставить("Приложение02", "Х");
        Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
            Форма.ТабличныйДокумент.Области.Приложение02.Значение = ?(ЕстьДанныеПриложение2, "Х", "");
        КонецЕсли;
        
        Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000240000201_1, ОбластьИмя)> 0 Тогда 
            
            НомерСтроки = 2;
            Форма.СтруктураДанныхФорма910_02Страница1.Вставить("П000210000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница2.Вставить("П000220000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница3.Вставить("П000230000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница4.Вставить("П000240000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница5.Вставить("П000250000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница6.Вставить("П000260000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница7.Вставить("П000270000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница8.Вставить("П000280000201_1", НомерСтроки);
            
            Форма.П0002100002[0].П000210000201 = НомерСтроки;
            Форма.П0002200002[0].П000220000201 = НомерСтроки;
            Форма.П0002300002[0].П000230000201 = НомерСтроки;
            Форма.П0002400002[0].П000240000201 = НомерСтроки;
            Форма.П0002500002[0].П000250000201 = НомерСтроки;
            Форма.П0002600002[0].П000260000201 = НомерСтроки;
            Форма.П0002700002[0].П000270000201 = НомерСтроки;
            Форма.П0002800002[0].П000280000201 = НомерСтроки;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                Форма.ТабличныйДокумент.Области.П000240000201_1.Значение = 2;
            КонецЕсли;
            
        КонецЕсли;
        
       Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000240000103, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000240000103 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы24]].Количество() Цикл
                    СуммаП000240000103 = СуммаП000240000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000240000203_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000240000103.Значение = СуммаП000240000103;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы24]].Количество() Цикл
                    СуммаП000240000103 = СуммаП000240000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы24]][Ном - 1].П000240000203);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_02Страница4.Вставить("П000240000103", СуммаП000240000103);
                
            КонецЕсли;
            
        КонецЕсли;

        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000240000104, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000240000104 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы24]].Количество() Цикл
                    СуммаП000240000104 = СуммаП000240000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000240000204_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000240000104.Значение = СуммаП000240000104;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы24]].Количество() Цикл
                    СуммаП000240000104 = СуммаП000240000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы24]][Ном - 1].П000240000204);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_02Страница4.Вставить("П000240000104", СуммаП000240000104);
                
            КонецЕсли;
            
        КонецЕсли;

        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000240000105, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000240000105 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы24]].Количество() Цикл
                    СуммаП000240000105 = СуммаП000240000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000240000205_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000240000105.Значение = СуммаП000240000105;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы24]].Количество() Цикл
                    СуммаП000240000105 = СуммаП000240000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы24]][Ном - 1].П000240000205);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_02Страница4.Вставить("П000240000105", СуммаП000240000105);
                
            КонецЕсли;
            
        КонецЕсли;

    ИначеЕсли ИмяСтраницыПанели = "Форма910_02Страница5" Тогда
        
        Форма.СтруктураДанныхФорма910Страница1.Вставить("Приложение02", "Х");
        Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
            Форма.ТабличныйДокумент.Области.Приложение02.Значение = ?(ЕстьДанныеПриложение2, "Х", "");
        КонецЕсли;
        
        Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000250000201_1, ОбластьИмя)> 0 Тогда 
            
            НомерСтроки = 2;
            Форма.СтруктураДанныхФорма910_02Страница1.Вставить("П000210000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница2.Вставить("П000220000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница3.Вставить("П000230000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница4.Вставить("П000240000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница5.Вставить("П000250000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница6.Вставить("П000260000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница7.Вставить("П000270000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница8.Вставить("П000280000201_1", НомерСтроки);
            
            Форма.П0002100002[0].П000210000201 = НомерСтроки;
            Форма.П0002200002[0].П000220000201 = НомерСтроки;
            Форма.П0002300002[0].П000230000201 = НомерСтроки;
            Форма.П0002400002[0].П000240000201 = НомерСтроки;
            Форма.П0002500002[0].П000250000201 = НомерСтроки;
            Форма.П0002600002[0].П000260000201 = НомерСтроки;
            Форма.П0002700002[0].П000270000201 = НомерСтроки;
            Форма.П0002800002[0].П000280000201 = НомерСтроки;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                Форма.ТабличныйДокумент.Области.П000250000201_1.Значение = 2;
            КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000250000102, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000250000102 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы25]].Количество() Цикл
                    СуммаП000250000102 = СуммаП000250000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000250000202_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000250000102.Значение = СуммаП000250000102;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы25]].Количество() Цикл
                    СуммаП000250000102 = СуммаП000250000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы25]][Ном - 1].П000250000202);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_02Страница5.Вставить("П000250000102", СуммаП000250000102);
                
            КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000250000104, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000250000104 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы25]].Количество() Цикл
                    СуммаП000250000104 = СуммаП000250000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000250000204_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000250000104.Значение = СуммаП000250000104;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы25]].Количество() Цикл
                    СуммаП000250000104 = СуммаП000250000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы25]][Ном - 1].П000250000204);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_02Страница5.Вставить("П000250000104", СуммаП000250000104);
                
            КонецЕсли;
            
        КонецЕсли;
        
    ИначеЕсли ИмяСтраницыПанели = "Форма910_02Страница6" Тогда
        
        Форма.СтруктураДанныхФорма910Страница1.Вставить("Приложение02", "Х");
        Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
            Форма.ТабличныйДокумент.Области.Приложение02.Значение = ?(ЕстьДанныеПриложение2, "Х", "");
        КонецЕсли;
        
        Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000260000201_1, ОбластьИмя)> 0 Тогда 
            
            НомерСтроки = 2;
            Форма.СтруктураДанныхФорма910_02Страница1.Вставить("П000210000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница2.Вставить("П000220000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница3.Вставить("П000230000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница4.Вставить("П000240000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница5.Вставить("П000250000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница6.Вставить("П000260000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница7.Вставить("П000270000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница8.Вставить("П000280000201_1", НомерСтроки);
            
            Форма.П0002100002[0].П000210000201 = НомерСтроки;
            Форма.П0002200002[0].П000220000201 = НомерСтроки;
            Форма.П0002300002[0].П000230000201 = НомерСтроки;
            Форма.П0002400002[0].П000240000201 = НомерСтроки;
            Форма.П0002500002[0].П000250000201 = НомерСтроки;
            Форма.П0002600002[0].П000260000201 = НомерСтроки;
            Форма.П0002700002[0].П000270000201 = НомерСтроки;
            Форма.П0002800002[0].П000280000201 = НомерСтроки;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                Форма.ТабличныйДокумент.Области.П000260000201_1.Значение = 2;
            КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000260000102, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000260000102 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы26]].Количество() Цикл
                    СуммаП000260000102 = СуммаП000260000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000260000202_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000260000102.Значение = СуммаП000260000102;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы26]].Количество() Цикл
                    СуммаП000260000102 = СуммаП000260000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы26]][Ном - 1].П000260000202);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_02Страница6.Вставить("П000260000102", СуммаП000260000102);
                
            КонецЕсли;
            
        КонецЕсли;

        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000260000103, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000260000103 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы26]].Количество() Цикл
                    СуммаП000260000103 = СуммаП000260000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000260000203_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000260000103.Значение = СуммаП000260000103;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы26]].Количество() Цикл
                    СуммаП000260000103 = СуммаП000260000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы26]][Ном - 1].П000260000203);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_02Страница6.Вставить("П000260000103", СуммаП000260000103);
                
            КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000260000104, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000260000104 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы26]].Количество() Цикл
                    СуммаП000260000104 = СуммаП000260000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000260000204_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000260000104.Значение = СуммаП000260000104;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы26]].Количество() Цикл
                    СуммаП000260000104 = СуммаП000260000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы26]][Ном - 1].П000260000204);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_02Страница6.Вставить("П000260000104", СуммаП000260000104);
                
            КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000260000105, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000260000105 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы26]].Количество() Цикл
                    СуммаП000260000105 = СуммаП000260000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000260000205_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000260000105.Значение = СуммаП000260000105;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы26]].Количество() Цикл
                    СуммаП000260000105 = СуммаП000260000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы26]][Ном - 1].П000260000205);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_02Страница6.Вставить("П000260000105", СуммаП000260000105);
                
            КонецЕсли;
            
        КонецЕсли;
        
    ИначеЕсли ИмяСтраницыПанели = "Форма910_02Страница7" Тогда
        
        Форма.СтруктураДанныхФорма910Страница1.Вставить("Приложение02", "Х");
        Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
            Форма.ТабличныйДокумент.Области.Приложение02.Значение = ?(ЕстьДанныеПриложение2, "Х", "");
        КонецЕсли;
        
        Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000270000201_1, ОбластьИмя)> 0 Тогда 
            
            НомерСтроки = 2;
            Форма.СтруктураДанныхФорма910_02Страница1.Вставить("П000210000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница2.Вставить("П000220000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница3.Вставить("П000230000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница4.Вставить("П000240000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница5.Вставить("П000250000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница6.Вставить("П000260000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница7.Вставить("П000270000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница8.Вставить("П000280000201_1", НомерСтроки);
            
            Форма.П0002100002[0].П000210000201 = НомерСтроки;
            Форма.П0002200002[0].П000220000201 = НомерСтроки;
            Форма.П0002300002[0].П000230000201 = НомерСтроки;
            Форма.П0002400002[0].П000240000201 = НомерСтроки;
            Форма.П0002500002[0].П000250000201 = НомерСтроки;
            Форма.П0002600002[0].П000260000201 = НомерСтроки;
            Форма.П0002700002[0].П000270000201 = НомерСтроки;
            Форма.П0002800002[0].П000280000201 = НомерСтроки;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                Форма.ТабличныйДокумент.Области.П000270000201_1.Значение = 2;
            КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000270000102, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000270000102 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы27]].Количество() Цикл
                    СуммаП000270000102 = СуммаП000270000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000270000202_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000270000102.Значение = СуммаП000270000102;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы27]].Количество() Цикл
                    СуммаП000270000102 = СуммаП000270000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы27]][Ном - 1].П000270000202);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_02Страница7.Вставить("П000270000102", СуммаП000270000102);
                
            КонецЕсли;
            
        КонецЕсли;
        
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000270000103, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000270000103 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы27]].Количество() Цикл
                    СуммаП000270000103 = СуммаП000270000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000270000203_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000270000103.Значение = СуммаП000270000103;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы27]].Количество() Цикл
                    СуммаП000270000103 = СуммаП000270000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы27]][Ном - 1].П000270000203);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_02Страница7.Вставить("П000270000103", СуммаП000270000103);
                
            КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000270000104, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000270000104 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы27]].Количество() Цикл
                    СуммаП000270000104 = СуммаП000270000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000270000204_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000270000104.Значение = СуммаП000270000104;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы27]].Количество() Цикл
                    СуммаП000270000104 = СуммаП000270000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы27]][Ном - 1].П000270000204);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_02Страница7.Вставить("П000270000104", СуммаП000270000104);
                
            КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000270000105, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000270000105 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы27]].Количество() Цикл
                    СуммаП000270000105 = СуммаП000270000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000270000205_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000270000105.Значение = СуммаП000270000105;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы27]].Количество() Цикл
                    СуммаП000270000105 = СуммаП000270000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы27]][Ном - 1].П000270000205);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_02Страница7.Вставить("П000270000105", СуммаП000270000105);
                
            КонецЕсли;
            
        КонецЕсли;
        
    ИначеЕсли ИмяСтраницыПанели = "Форма910_02Страница8" Тогда
        
        Форма.СтруктураДанныхФорма910Страница1.Вставить("Приложение02", "Х");
        Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма910Страница1" Тогда
            Форма.ТабличныйДокумент.Области.Приложение02.Значение = ?(ЕстьДанныеПриложение2, "Х", "");
        КонецЕсли;
        
        Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000280000201_1, ОбластьИмя)> 0 Тогда 
            
            НомерСтроки = 2;
            Форма.СтруктураДанныхФорма910_02Страница1.Вставить("П000210000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница2.Вставить("П000220000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница3.Вставить("П000230000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница4.Вставить("П000240000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница5.Вставить("П000250000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница6.Вставить("П000260000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница7.Вставить("П000270000201_1", НомерСтроки);
            Форма.СтруктураДанныхФорма910_02Страница8.Вставить("П000280000201_1", НомерСтроки);
            
            Форма.П0002100002[0].П000210000201 = НомерСтроки;
            Форма.П0002200002[0].П000220000201 = НомерСтроки;
            Форма.П0002300002[0].П000230000201 = НомерСтроки;
            Форма.П0002400002[0].П000240000201 = НомерСтроки;
            Форма.П0002500002[0].П000250000201 = НомерСтроки;
            Форма.П0002600002[0].П000260000201 = НомерСтроки;
            Форма.П0002700002[0].П000270000201 = НомерСтроки;
            Форма.П0002800002[0].П000280000201 = НомерСтроки;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                Форма.ТабличныйДокумент.Области.П000280000201_1.Значение = 2;
            КонецЕсли;
            
        КонецЕсли;
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000280000102, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000280000102 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы28]].Количество() Цикл
                    СуммаП000280000102 = СуммаП000280000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000280000202_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000280000102.Значение = СуммаП000280000102;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы28]].Количество() Цикл
                    СуммаП000280000102 = СуммаП000280000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы28]][Ном - 1].П000280000202);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_02Страница8.Вставить("П000280000102", СуммаП000280000102);
                
            КонецЕсли;
            
        КонецЕсли;
        
        
        Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000280000103, Лев(ОбластьИмя,13)) > 0 Тогда
            
            СуммаП000280000103 = 0;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы28]].Количество() Цикл
                    СуммаП000280000103 = СуммаП000280000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000280000203_" + Ном].Значение);
                КонецЦикла;                                                                                                                                            
                
                Форма.ТабличныйДокумент.Области.П000280000103.Значение = СуммаП000280000103;
                
            Иначе
                
                Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы28]].Количество() Цикл
                    СуммаП000280000103 = СуммаП000280000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы28]][Ном - 1].П000280000203);
                КонецЦикла;
                
                Форма.СтруктураДанныхФорма910_02Страница8.Вставить("П000280000103", СуммаП000280000103);
                
            КонецЕсли;
            
        КонецЕсли;          
			
	//Авторасчет
	ИначеЕсли ИмяСтраницыПанели = "" Тогда
		Расчет(Форма,"Форма910Страница2", "");
   		Расчет(Форма,"Форма910Страница3", "");
		Расчет(Форма,"Форма910Страница1", "");
   		Расчет(Форма,"Форма910Страница4", "");
        Расчет(Форма,"Форма910_01Страница1", "");
		Расчет(Форма,"Форма910_01Страница2", "");
		Расчет(Форма,"Форма910_01Страница3", "");
		Расчет(Форма,"Форма910_01Страница4", "");
		Расчет(Форма,"Форма910_01Страница5", "");
		Расчет(Форма,"Форма910_01Страница6", "");
		Расчет(Форма,"Форма910_02Страница1", "");
		Расчет(Форма,"Форма910_02Страница2", "");
		Расчет(Форма,"Форма910_02Страница3", "");
		Расчет(Форма,"Форма910_02Страница4", "");
		Расчет(Форма,"Форма910_02Страница5", "");
		Расчет(Форма,"Форма910_02Страница6", "");
		Расчет(Форма,"Форма910_02Страница7", "");
		Расчет(Форма,"Форма910_02Страница8", "");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьЗавершение", ЭтотОбъект);

	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВыгрузитьОтчет(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчет(ДополнительныеПараметры) Экспорт
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьОтчетЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Если Модифицированность Тогда
		СохранитьНаКлиенте(,ОписаниеОповещения);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчетЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ФормаВыгрузкиРеглОтчета = ПолучитьФорму("Документ.ВыгрузкаРегламентированныхОтчетов.Форма.ФормаДокумента", , ЭтаФорма);
    
    СпДокОсн = Новый СписокЗначений;
    СпДокОсн.Добавить(СтруктураРеквизитовФормы.мСохраненныйДок);
    
    ФормаВыгрузкиРеглОтчета.СформироватьИЗаписать(СпДокОсн);
         
КонецПроцедуры

&НаКлиенте
Функция УниверсальнаяВыгрузка (ТекстВыгрузки = Неопределено, ПроверятьБлокировки = Истина, ИмяФайлаВыгрузки = "", ВыгружатьСОшибками = Ложь) Экспорт
	
	ИмяФайлаВыгрузки = СформироватьИмяФайла();
	
	СформироватьСписокФормБезИерархии();
	
	ТекстВыгрузки =  УниверсальнаяВыгрузкаНаСервере();
	
	Если ТекстВыгрузки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция СформироватьИмяФайла()
	
	Перем ПолученноеЗначение;
	
	ИмяФайлаXML = "Форма910_"+ Прав(Этаформа.ИмяФормы,7)+ "_" + СтрЗаменить(СтрЗаменить(Строка(ТекущаяДата())," ","_"),":","-") + ".xml";
	
	Возврат ИмяФайлаXML;
	
КонецФункции

&НаКлиенте
Функция СформироватьМногострочнуюСтруктуруДляВыгрузки (ТекущееИмяФормы, ТаблицаМногострочнойФормы = Неопределено) Экспорт
	
	Возврат СформироватьМногострочнуюСтруктуруДляВыгрузкиНаСервере(ТекущееИмяФормы);	
	
КонецФункции

&НаСервере
Функция СформироватьМногострочнуюСтруктуруДляВыгрузкиНаСервере(ТекущееИмяФормы, ТаблицаМногострочнойФормы = Неопределено) Экспорт
	
	Перем ТаблицаСтраницРаздела;
	
	Если ТекущееИмяФормы <> Неопределено тогда
			
		МногострочнаяСтруктура = Новый Структура;
		
		ТекущийЛист = Неопределено;
		НомерСтроки = 0;
		КоличествоСтрок = ТаблицаМногострочнойФормы.Количество();
		
		Пока Истина Цикл 
			
			Если НомерСтроки >= КоличествоСтрок Тогда 
				Прервать;
			КонецЕсли;
			
			СтрокаТЗ = ТаблицаМногострочнойФормы[НомерСтроки];
			
			Если Не СтрокаТЗ.ИмяЛиста = ТекущийЛист Тогда
				
				МногострочнаяСтруктура.Вставить(СтрокаТЗ.ИмяЛиста, Новый Структура);
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста].Вставить("Строки", Новый ТаблицаЗначений);
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста].Вставить("ШапкаИПодвал", Новый ТаблицаЗначений);
				
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("Значение");
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("ИмяОбласти");
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("ИмяПараметра");
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("Итог");
				
				
				ТекущийЛист = СтрокаТЗ.ИмяЛиста;
				
			КонецЕсли;
			
			Если СтрокаТЗ.КоличествоROW = "0" Тогда
				//Заполняем таблицу значений параметров шапки
				Если ЗначениеЗаполнено(СтрокаТЗ.ИмяЯчейки) Тогда
					//Добавим новую строку в ТЗ значений шапки таблицы
					НоваяСтрока = МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Добавить();
					
					//Получим значение параметра из структуры формы
					ЗначениеПараметра = ЭтаФорма["СтруктураДанных" + СтрокаТЗ.КодФормы + ?((СтрокаТЗ.КодФормы = "Форма910_01" ИЛИ СтрокаТЗ.КодФормы = "Форма910_02"), СтрокаТЗ.ИмяЛиста, "Страница1")][СтрокаТЗ.ИмяЯчейки];
					
					НоваяСтрока.Значение 		= ЗначениеПараметра;
					НоваяСтрока.ИмяПараметра 	= СтрокаТЗ.ИмяЯчейки;
					НоваяСтрока.ИмяОбласти 		= СтрокаТЗ.ИмяЯчейки;
					НоваяСтрока.Итог 			= Ложь;
				КонецЕсли;
			Иначе 
				//А это уже строки таблицы
				//Определим состав колонок многострочной формы
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("ИмяЛиста", СтрокаТЗ.ИмяЛиста);
				Если ТекущееИмяФормы = "Форма910_01" Тогда
					СтруктураПоиска.Вставить("КоличествоROW", "10");
				Иначе
					СтруктураПоиска.Вставить("КоличествоROW", "15");
				КонецЕсли;
				СтрокиТаблицы = ТаблицаМногострочнойФормы.НайтиСтроки(СтруктураПоиска);
				
				ИмяТаблицы = Сред(СтрокаТЗ.ИмяЯчейки, 1, 11);
				
				//Проверям есть ли у нас вообще записи в многострочной форме
				//И формируем набор колонок таблицы значений
				ЕстьЗаписи = Ложь;
				Если ЭтотОбъект[ИмяТаблицы].Количество() = 1 Тогда
					Для Каждого Строка Из СтрокиТаблицы Цикл
						ИмяЯчейки = Сред(Строка.ИмяЯчейки, 1, 13);
						МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["Строки"].Колонки.Добавить(ИмяЯчейки);
                    КонецЦикла;
                    Если ТекущееИмяФормы = "Форма910_01" Тогда 
						СтрокаПервойСтраницы = ЭтотОбъект["П0001100002"][0];
						ЕстьЗаписи = ЗначениеЗаполнено(СтрокаПервойСтраницы["П000110000201"]) ИЛИ ЗначениеЗаполнено(СтрокаПервойСтраницы["П000110000203"]);
					Иначе
						СтрокаПервойСтраницы = ЭтотОбъект["П0002100002"][0];
						ЕстьЗаписи = ЗначениеЗаполнено(СтрокаПервойСтраницы["П000210000202"]) ИЛИ ЗначениеЗаполнено(СтрокаПервойСтраницы["П000210000203"]);
					КонецЕсли;
                ИначеЕсли Не ЭтотОбъект[ИмяТаблицы].Количество() = 0 Тогда
					Для Каждого Строка Из СтрокиТаблицы Цикл
						ИмяЯчейки = Сред(Строка.ИмяЯчейки, 1, 13);
						МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["Строки"].Колонки.Добавить(ИмяЯчейки);
					КонецЦикла;
					ЕстьЗаписи = Истина;
				КонецЕсли;
				
				Если ЕстьЗаписи Тогда
					//Если записи обнаружены то заполняем таблицу значений
					Для Каждого СтрокаТаблицы Из ЭтотОбъект[ИмяТаблицы] Цикл 
						НоваяСтрока = МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["Строки"].Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
					КонецЦикла;
				КонецЕсли;
				
				НомерСтроки = НомерСтроки + СтрокиТаблицы.Количество() - 1;
				
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + 1;
			
        КонецЦикла;
    КонецЕсли;
    		
	Возврат МногострочнаяСтруктура;

КонецФункции

&НаСервере
Процедура СформироватьСписокФормБезИерархии()
	
	мСписокФормБезИерархии.ПолучитьЭлементы().Очистить();
	
	МакетПоказателей = Отчеты[Сред(Лев(ЭтотОбъект.ИмяФормы, СтрНайти(ЭтотОбъект.ИмяФормы, ".Форма.") - 1), 7)].ПолучитьМакет("Показатели");
	Префикс = СтрЗаменить(Прав(ЭтаФорма.СтруктураРеквизитовФормы.мВыбраннаяФорма,7), "Кв4", "Кв1");
	
	Попытка
		ОбластьПоказателей = МакетПоказателей.Область("Форма910_" + Префикс);
	Исключение
		СообщениеТабл = ТаблицаСообщений.Добавить();
		СообщениеТабл.Описание = НСтр("ru = 'Отсутствует актуальный шаблон для выгрузки'");
	КонецПопытки;
	
	Для Ном = ОбластьПоказателей.Верх По ОбластьПоказателей.Низ Цикл
		
		НоваяСтрока = мСписокФормБезИерархии.ПолучитьЭлементы().Добавить();
		НоваяСтрока.ИмяФормы			= СокрП(МакетПоказателей.Область(Ном, 1).Текст);
		НоваяСтрока.Выгружать			= ?(СокрП(МакетПоказателей.Область(Ном, 2).Текст)= "1",Истина,Ложь);
		НоваяСтрока.Многострочность		= ?(СокрП(МакетПоказателей.Область(Ном, 3).Текст)= "1",Истина,Ложь);
		НоваяСтрока.КодФормы			= СокрП(МакетПоказателей.Область(Ном, 4).Текст);
		НоваяСтрока.КоличествоНаЛисте	= Число(СокрП(МакетПоказателей.Область(Ном, 5).Текст));
		НоваяСтрока.КоличествоСтраницПриложения = Число(СокрП(МакетПоказателей.Область(Ном, 6).Текст));
		
		Если НоваяСтрока.Многострочность <> Истина Тогда
			Для КолСтр = 1 По НоваяСтрока.КоличествоСтраницПриложения  Цикл
				Для Каждого Элемент Из ЭтаФорма["СтруктураДанных"+ НоваяСтрока.КодФормы + "Страница" + КолСтр] Цикл
					НовыйЭлемент = НоваяСтрока.Значение.Добавить();
					НовыйЭлемент.ИмяОбласти = Элемент.Ключ;
					НовыйЭлемент.Значение = Элемент.Значение;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция  УниверсальнаяВыгрузкаНаСервере()
	Возврат РегламентированнаяОтчетностьРК.ВыгрузитьОтчетВXMLДляСОНО(ЭтотОбъект);
КонецФункции

&НаКлиенте
Процедура ОчиститьТекущуюСтраницу(Команда)
	
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьТекущийЭкземплярМногостраничногоРаздела" + Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтчет(Команда)
	
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьВесьОтчет");
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(ВыполняемоеОповещение = Неопределено) Экспорт
	
	РегламентированнаяОтчетностьКлиент.Очистить(ЭтаФорма, ВыполняемоеОповещение);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере() Экспорт
	
	СтруктураДанныхФорма910Страница1.Очистить();
	СтруктураДанныхФорма910Страница2.Очистить();
	СтруктураДанныхФорма910_01Страница1.Очистить();
	СтруктураДанныхФорма910_01Страница2.Очистить();
	СтруктураДанныхФорма910_01Страница3.Очистить();
	СтруктураДанныхФорма910_01Страница4.Очистить();
	СтруктураДанныхФорма910_01Страница5.Очистить();
	СтруктураДанныхФорма910_01Страница6.Очистить();
    СтруктураДанныхФорма910_02Страница1.Очистить();
	СтруктураДанныхФорма910_02Страница2.Очистить();
	СтруктураДанныхФорма910_02Страница3.Очистить();
	СтруктураДанныхФорма910_02Страница4.Очистить();
	СтруктураДанныхФорма910_02Страница5.Очистить();
	СтруктураДанныхФорма910_02Страница6.Очистить();
	СтруктураДанныхФорма910_02Страница7.Очистить();
	СтруктураДанныхФорма910_02Страница8.Очистить();
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	ОчиститьТабличноеПолеНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма910Страница1", 1);
	
	НачальныеОперацииСМногострочнымиБлоками();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОчисткаРегламентированногоОтчетаНаСервере(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаСервере(ИмяСтраницы);
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаРегламентированногоОтчетаНаКлиенте(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаКлиенте(ИмяСтраницы);
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
	ОткрытьФормуВыбораСтраниц("ВыбратьДляНастройки");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраниц(ВариантВыбора)
	Перем ТекущийРазделОтчетаСокрНаим;
	Перем НомерСтраницыРазделаОтчета;
	
	// Запоминаем текущий раздел, установленный в дереве разделов отчета.
	Если НЕ Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		ТекущийРазделОтчетаСокрНаим = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
		НомерСтраницыРазделаОтчета  = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	КонецЕсли;
	
	мПараметры = Новый Структура;
	мПараметры.Вставить("Автосохранение", Ложь);
	мПараметры.Вставить("мАвтоВыборКодов", Ложь);
	мПараметры.Вставить("ЗначенияИзСписка", Ложь);
	мПараметры.Вставить("ОтключитьАвтоРасчет", Ложь);
	мПараметры.Вставить("СчетчикСтраниц", Ложь);
	мПараметры.Вставить("ПараметрыОтображенияСумм", Ложь);
	мПараметры.Вставить("ИмеетсяРеквизитДеревоВыбранныхСтраниц", Истина);
	мПараметры.Вставить("Выгрузка", Истина);
	мПараметры.Вставить("ИмяОтчета", ИмяОтчета(ЭтаФорма.ИмяФормы));
	мПараметры.Вставить("СписокСтруктурныхЕдиниц", Истина);
	мПараметры.Вставить("РежимВыбораСтруктурныхЕдиниц", "ПоНалогоплательщику");
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("СтруктурныеЕдиницы",        мСписокСтруктурныхЕдиниц);
	ПараметрыФормы.Вставить("НалоговыйКомитет", 		 НалоговыйКомитетФорма);
	ПараметрыФормы.Вставить("мПараметры",                мПараметры);
	
	ФормаНастройкиОтчета = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("НастройкиОтчета", ПараметрыФормы, ЭтаФорма);
	
	ПодготовитьДеревоСтраницДляНастройки();
	
	КопироватьДанныеФормы(мДеревоВыбранныхСтраниц, ФормаНастройкиОтчета.Дерево);
	
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
	
	ЗначениеЕдИзм       = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	ЗначениеЗпт         = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;
	
	ДополнительныеПараметры = Новый Структура("ЗначениеАвторасчета, ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим", , ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуВыбораСтраницЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ФормаНастройкиОтчета.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаНастройкиОтчета.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаНастройкиОтчета.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьДеревоСтраницДляНастройки()
	
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
	ДеревоСтраниц = РеквизитФормыВЗначение("мДеревоСтраницОтчета");
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма910Страница1";
	СтрокаУровня1.Представление            = "Форма 910.00";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма910Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);

	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма910_01Страница1";
	СтрокаУровня1.Представление            = "Форма 910.01";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма910_01Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма910_02Страница1";
	СтрокаУровня1.Представление            = "Форма 910.02";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма910_02Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраницЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	//ЗначениеАвторасчета = ДополнительныеПараметры.ЗначениеАвторасчета;
	ЗначениеЕдИзм = ДополнительныеПараметры.ЗначениеЕдИзм;
	ЗначениеЗпт = ДополнительныеПараметры.ЗначениеЗпт;
	НомерСтраницыРазделаОтчета = ДополнительныеПараметры.НомерСтраницыРазделаОтчета;
	ТекущийРазделОтчетаСокрНаим = ДополнительныеПараметры.ТекущийРазделОтчетаСокрНаим;
	
	//СформироватьПодменюПечать(ЭтаФорма);
	Модифицированность = Истина;
	
	флЗначенияИдентичны = Истина;
	
	флЗначенияИдентичны = ПеренестиДанныеДереваСтраниц();
	
	Если НЕ флЗначенияИдентичны Тогда
		
		СформироватьДеревоРазделовОтчетаНаКлиенте();
		
		Если НЕ ТекущийРазделОтчетаСокрНаим = Неопределено Тогда
			
			// Пытаемся найти ранее запомненный раздел.
			НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(РазделыОтчета.ПолучитьЭлементы(), "КолонкаРазделыОтчетаСокрНаим", ТекущийРазделОтчетаСокрНаим);
			
			Если НЕ НайденнаяСтрока = Неопределено 
				И НЕ НомерСтраницыРазделаОтчета = Неопределено 
				И НайденнаяСтрока.ПолучитьЭлементы().Количество() > 0 Тогда
				
				НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(НайденнаяСтрока.ПолучитьЭлементы(), "КолонкаНомерСтраницыРазделаОтчета", НомерСтраницыРазделаОтчета);
				
			КонецЕсли;
			
			// В случае успешного поиска, устанавливаем курсор на найденный раздел.
			Если НЕ НайденнаяСтрока = Неопределено Тогда
				Элементы.РазделыОтчета.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПеренестиДанныеДереваСтраниц()
	
	флЗначенияИдентичны = Истина;
	
	ДеревоВыбСтраниц = РеквизитФормыВЗначение("мДеревоВыбранныхСтраниц");
	
	Для Каждого ЭлементДерева Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		Строка = ДеревоВыбСтраниц.Строки.Найти(Лев(ЭлементДерева.Представление,12),"Представление");
		
		Если ЭлементДерева.ПоказатьСтраницу <> ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1) Тогда
			
			флЗначенияИдентичны = Ложь;
			
		КонецЕсли;
		
		ЭлементДерева.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
		ЭлементДерева.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
		ЭлементДерева.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
		
	КонецЦикла;
	
	Возврат флЗначенияИдентичны;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьАвто(Команда) Экспорт
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоПредупредитьОСохранении", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередЗаполнениемРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоПредупредитьОСохранении(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоСохранениеОтчета", ЭтотОбъект, ДополнительныеПараметры);
	
	ТекстВопроса = НСтр("ru = 'Автоматическое заполнение приведет к сохранению отчета с новыми данными. Заполнить отчет?'");
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Заполнить", "Заполнить и сохранить");
	Кнопки.Добавить("НеЗаполнять", "Не заполнять");
	
	КнопкаПоУмолчанию = "НеЗаполнять";
	
	ЗаголовокВопроса = НСтр("ru = 'Автоматическое заполнение отчета'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , КнопкаПоУмолчанию, ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоСохранениеОтчета(ОтветПользователя, ДополнительныеПараметры) Экспорт
	
	Если ОтветПользователя <> "Заполнить" Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ЗаполнитьАвтоПослеСохранениеОтчета", 
		ЭтотОбъект, 
		ДополнительныеПараметры); 
	
	СохранитьНаКлиенте(,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоПослеСохранениеОтчета(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		Возврат;
	КонецЕсли;
	
	Команда = ДополнительныеПараметры.Команда;
	
	ЗаполнитьАвтоНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАвтоНаСервере()
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела, Ложь);

	ЗаполнитьПустыеСтруктурыДанных();
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("Организация",              СтруктураРеквизитовФормы.Организация);
	ПараметрыОтчета.Вставить("мДатаНачалаПериодаОтчета", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	ПараметрыОтчета.Вставить("мДатаКонцаПериодаОтчета",  СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	ПараметрыОтчета.Вставить("СписокСтруктурныхЕдиниц",  мСписокСтруктурныхЕдиниц);
	ПараметрыОтчета.Вставить("НалоговыйКомитет",		 СтруктураРеквизитовФормы.НалоговыйКомитет);
	
	Контейнер = Новый Структура();
	Контейнер.Вставить("Форма910Страница1", СтруктураДанныхФорма910Страница1);
	Контейнер.Вставить("Форма910Страница2", СтруктураДанныхФорма910Страница2);
	Контейнер.Вставить("Форма910Страница3", СтруктураДанныхФорма910Страница3);
	Контейнер.Вставить("Форма910Страница4", СтруктураДанныхФорма910Страница4);
        
	Контейнер.Вставить("Форма910_01Страница1", СтруктураДанныхФорма910_01Страница1);
	Контейнер.Вставить("Форма910_01Страница1_ДанныеДопСтрок", ДанныеФормыВЗначение(П0001100002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма910_01Страница2", СтруктураДанныхФорма910_01Страница2);
	Контейнер.Вставить("Форма910_01Страница2_ДанныеДопСтрок", ДанныеФормыВЗначение(П0001200002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма910_01Страница3", СтруктураДанныхФорма910_01Страница3);
	Контейнер.Вставить("Форма910_01Страница3_ДанныеДопСтрок", ДанныеФормыВЗначение(П0001300002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма910_01Страница4", СтруктураДанныхФорма910_01Страница4);
	Контейнер.Вставить("Форма910_01Страница4_ДанныеДопСтрок", ДанныеФормыВЗначение(П0001400002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма910_01Страница5", СтруктураДанныхФорма910_01Страница5);
	Контейнер.Вставить("Форма910_01Страница5_ДанныеДопСтрок", ДанныеФормыВЗначение(П0001500002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма910_01Страница6", СтруктураДанныхФорма910_01Страница6);
	Контейнер.Вставить("Форма910_01Страница6_ДанныеДопСтрок", ДанныеФормыВЗначение(П0001600002, Тип("ТаблицаЗначений")));
    
	Контейнер.Вставить("Форма910_02Страница1", СтруктураДанныхФорма910_02Страница1);
	Контейнер.Вставить("Форма910_02Страница1_ДанныеДопСтрок", ДанныеФормыВЗначение(П0002100002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма910_02Страница2", СтруктураДанныхФорма910_02Страница2);
	Контейнер.Вставить("Форма910_02Страница2_ДанныеДопСтрок", ДанныеФормыВЗначение(П0002200002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма910_02Страница3", СтруктураДанныхФорма910_02Страница3);
	Контейнер.Вставить("Форма910_02Страница3_ДанныеДопСтрок", ДанныеФормыВЗначение(П0002300002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма910_02Страница4", СтруктураДанныхФорма910_02Страница4);
	Контейнер.Вставить("Форма910_02Страница4_ДанныеДопСтрок", ДанныеФормыВЗначение(П0002400002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма910_02Страница5", СтруктураДанныхФорма910_02Страница5);
	Контейнер.Вставить("Форма910_02Страница5_ДанныеДопСтрок", ДанныеФормыВЗначение(П0002500002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма910_02Страница6", СтруктураДанныхФорма910_02Страница6);
	Контейнер.Вставить("Форма910_02Страница6_ДанныеДопСтрок", ДанныеФормыВЗначение(П0002600002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма910_02Страница7", СтруктураДанныхФорма910_02Страница7);
	Контейнер.Вставить("Форма910_02Страница7_ДанныеДопСтрок", ДанныеФормыВЗначение(П0002700002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма910_02Страница8", СтруктураДанныхФорма910_02Страница8);
	Контейнер.Вставить("Форма910_02Страница8_ДанныеДопСтрок", ДанныеФормыВЗначение(П0002800002, Тип("ТаблицаЗначений")));


	РегламентированнаяОтчетностьПереопределяемый.ЗаполнитьОтчет(ИмяОтчета(ЭтаФорма.ИмяФормы), ИмяФормыОтчета(ЭтаФорма.ИмяФормы), ПараметрыОтчета, Контейнер);
	
	Для Каждого ЭлементКонтейнера Из Контейнер Цикл
		
		ИмяСтраницы = ЭлементКонтейнера.Ключ;
		
		Если ИмяСтраницы = "Форма910_04" Тогда
			Продолжить
        ИначеЕсли ИмяСтраницы = "Форма910_01Страница1_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0001100002);
		ИначеЕсли ИмяСтраницы = "Форма910_01Страница2_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0001200002);
		ИначеЕсли ИмяСтраницы = "Форма910_01Страница3_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0001300002);
		ИначеЕсли ИмяСтраницы = "Форма910_01Страница4_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0001400002);
		ИначеЕсли ИмяСтраницы = "Форма910_01Страница5_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0001500002);
		ИначеЕсли ИмяСтраницы = "Форма910_01Страница6_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0001600002);
		ИначеЕсли ИмяСтраницы = "Форма910_02Страница1_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0002100002);
		ИначеЕсли ИмяСтраницы = "Форма910_02Страница2_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0002200002);
		ИначеЕсли ИмяСтраницы = "Форма910_02Страница3_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0002300002);
		ИначеЕсли ИмяСтраницы = "Форма910_02Страница4_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0002400002);
		ИначеЕсли ИмяСтраницы = "Форма910_02Страница5_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0002500002);
		ИначеЕсли ИмяСтраницы = "Форма910_02Страница6_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0002600002);
		ИначеЕсли ИмяСтраницы = "Форма910_02Страница7_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0002700002);
		ИначеЕсли ИмяСтраницы = "Форма910_02Страница8_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0002800002);
		Иначе
			ЭтаФорма["СтруктураДанных" + ИмяСтраницы] = ЭлементКонтейнера.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);

	ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма910Страница1", 1);
	ЗаполнитьСведенияОбОрганизацииНаСервере();
	
	РасчетНаСервере();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПустыеСтруктурыДанных()
	
	СохрТабличныйДокумент = Новый ТабличныйДокумент;
	
	СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
    
    П0001100002.Очистить();
	П0001200002.Очистить();
	П0001300002.Очистить();
	П0001400002.Очистить();
	П0001500002.Очистить();
	П0001600002.Очистить();

	П0002100002.Очистить();
	П0002200002.Очистить();
	П0002300002.Очистить();
	П0002400002.Очистить();
	П0002500002.Очистить();
	П0002600002.Очистить();
	П0002700002.Очистить();
	П0002800002.Очистить();

	Для Каждого Раздел Из мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
		
		ТабличныйДокумент.Очистить();
		ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(СтрЗаменить(Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")), "Кв4", "Кв1") + "_" + Раздел.ИмяСтраницы));
		
		СохранитьДанныеРаздела(Раздел.ИмяСтраницы, Ложь);
		
	КонецЦикла;
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Если Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	Оповещение = Новый ОписаниеОповещения("ПослеСохраненияФормыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	СохранитьНаКлиенте(, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиенте(Автосохранение = Ложь, ВыполняемоеОповещение = Неопределено) Экспорт
	
	
	Вариант = СтруктураРеквизитовФормы.ВидДокумента;
	
	Если НЕ РегламентированнаяОтчетностьКлиент.ПриЗаписиРегламентированногоОтчетаНаКлиенте(ЭтаФорма, , Автосохранение, Вариант) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатСохранения = ПередСохранением();
	
	ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения);
	
КонецПроцедуры

&НаСервере
Функция ПередСохранением()
	
	Возврат Сохранить();
	
КонецФункции

&НаСервере
Функция Сохранить()
	
	Если НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.ПолучитьОбъект();
	КонецЕсли;
			
	Если НЕ РегламентированнаяОтчетность.ПриЗаписиРегламентированногоОтчетаНаСервере(ЭтаФорма, , ,СтруктураРеквизитовФормы.ВидДокумента, , СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ИсточникОтчета           = Метаданные.Отчеты[Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7)].Имя;
	СтруктураРеквизитовФормы.мСохраненныйДок.НаименованиеОтчета       = Метаданные.Отчеты[Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7)].ОсновнаяФорма.Синоним;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаНачала               = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаОкончания            = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.Периодичность            = СтруктураРеквизитовФормы.мПериодичность;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВыбраннаяФорма           = СтруктураРеквизитовФормы.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок.Организация              = СтруктураРеквизитовФормы.Организация;
	СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий              = Комментарий;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаПодписи              = ТекущаяДата(); 
	СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения         = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВидОтчетности            = Перечисления.ВидыОтчетности.РегламентированнаяОтчетность;
	СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий              = Комментарий;
	СтруктураРеквизитовФормы.мСохраненныйДок.КодНалоговогоОргана      = ?(СтруктураРеквизитовФормы.Организация.РегистрацияВНалоговомОргане = Неопределено,"",СтруктураРеквизитовФормы.Организация.РегистрацияВНалоговомОргане.Код);
	СтруктураРеквизитовФормы.мСохраненныйДок.КПП                      = "";
	СтруктураРеквизитовФормы.мСохраненныйДок.Вид                      = СтруктураРеквизитовФормы.ВидДокумента;
	СтруктураРеквизитовФормы.мСохраненныйДок.ПредставлениеВида        = РегламентированнаяОтчетность.ПредставлениеВидаДокумента(СтруктураРеквизитовФормы.мСохраненныйДок.Вид);
	СтруктураРеквизитовФормы.мВариант                                 = СтруктураРеквизитовФормы.ВидДокумента;
		
	СтруктураРеквизитовФормы.мСохраненныйДок.ФорматВыгрузки = "Автоматически";
	//сохранение данных текущего раздела
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	// формируем данные редактируемых ячеек таблицы
	ПоказателиОтчета = Новый Структура();
	
	ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета);
	// формируем список сохранения
	СписокСохранения = Новый Структура();

	// вставляем данные редактируемых ячеек таблицы
	СписокСохранения.Вставить("ПоказателиОтчета", ПоказателиОтчета);
	СписокСохранения.Вставить("СписокСтруктурныхЕдиниц", мСписокСтруктурныхЕдиниц);
	СписокСохранения.Вставить("НалоговыйКомитет", 		 НалоговыйКомитетФорма);
	
	МассивТиповНеопределено = Новый Массив;
	МассивТиповНеопределено.Добавить(Тип("Неопределено"));
	ОписаниеТиповНеопределено = Новый ОписаниеТипов(МассивТиповНеопределено);
	
	ДанныеМногострочныхРазделов = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		
		ДанныеМногострочныхРазделов.Вставить(ЭлементСтруктуры.Ключ, ДанныеФормыВЗначение(ЭтаФорма[ЭлементСтруктуры.Значение], Тип("ТаблицаЗначений")));
		
	КонецЦикла;
	
	СписокСохранения.Вставить("ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов);
	
	ДанныеМногостраничныхРазделов = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногостраничныхРазделов Цикл
		ИмяРаздела = ЭлементСтруктуры.Ключ;
		ИмяСтруктурыДанных = ЭлементСтруктуры.Значение;
		ДанныеВТаблицеЗначений = СведенияМногостраничногоРазделаВТаблице(ИмяСтруктурыДанных);
		Если ДанныеВТаблицеЗначений <> Неопределено Тогда
			ДанныеМногостраничныхРазделов.Вставить(ИмяРаздела, ДанныеВТаблицеЗначений);
		КонецЕсли;
	КонецЦикла;

	ХранилищеДанных = Новый ХранилищеЗначения(СписокСохранения);
	СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета = ХранилищеДанных;
	
	Попытка
		СтруктураРеквизитовФормы.мСохраненныйДок.Записать();
	Исключение
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецПопытки;
	Модифицированность = Ложь;
	
	СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения)
	
	КлючУникальности = СтруктураРеквизитовФормы.мСохраненныйДок;
	
	Если РезультатСохранения Тогда
		
		РегламентированнаяОтчетностьКлиент.ПослеЗаписиРегламентированногоОтчета(ЭтаФорма);
		
		Если ВыполняемоеОповещение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ВыполняемоеОповещение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСохраненияФормыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.Форма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета)
	
	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		ПоказателиОтчета.Вставить(Префикс + Раздел.ИмяСтраницы, ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы]);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СведенияМногостраничногоРазделаВТаблице(ИмяСтруктурыДанных)
	
	ОписаниеТиповНеопределено = Новый ОписаниеТипов("Неопределено");
	
	ТаблицаЗначенийСДанными = ДанныеФормыВЗначение(ЭтаФорма[ИмяСтруктурыДанных], Тип("ТаблицаЗначений"));
	
	Если ТаблицаЗначенийСДанными <> Неопределено Тогда
		
		Если ТаблицаЗначенийСДанными.Колонки.Найти("Данные") <> Неопределено Тогда
			ТаблицаЗначенийСДанными.Колонки.Удалить("Данные");
			ТаблицаЗначенийСДанными.Колонки.Добавить("Данные", ОписаниеТиповНеопределено);
			
			Ном = 0;
			Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначенийСДанными Цикл
				СтрокаТаблицыЗначений.Данные = ЭтаФорма[ИмяСтруктурыДанных][Ном].Данные[0].Значение;
				Ном = Ном + 1;
			КонецЦикла;
		КонецЕсли;
		
		Если ТаблицаЗначенийСДанными.Колонки.Найти("ДанныеДопСтрок") <> Неопределено Тогда
			ТаблицаЗначенийСДанными.Колонки.Удалить("ДанныеДопСтрок");
			ТаблицаЗначенийСДанными.Колонки.Добавить("ДанныеДопСтрок", ОписаниеТиповНеопределено);
			
			Ном = 0;
			Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначенийСДанными Цикл
				
				Если ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок.Количество() > 0
				   И ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок[0].Представление = "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела" Тогда
					СтрокаТаблицыЗначений.ДанныеДопСтрок = ДанныеФормыВЗначение(ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок[0].Значение, Тип("ТаблицаЗначений"));
					
					Ном = Ном + 1;
					Продолжить;
				КонецЕсли;
				
				СтруктураДанныхДопСтрок = Новый Структура;
				
				Для Каждого ЭлСтруктуры Из ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок Цикл
					СтруктураДанныхДопСтрок.Вставить(ДанныеФормыВЗначение(ЭлСтруктуры.Значение, Тип("ТаблицаЗначений")));
				КонецЦикла;
				
				СтрокаТаблицыЗначений.ДанныеДопСтрок = СтруктураДанныхДопСтрок;
				
				Ном = Ном + 1;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаЗначенийСДанными;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьБланк(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБланкЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Команда = ДополнительныеПараметры.Команда;
	
	Если Команда <> Неопределено Тогда
		Печать(Команда.Имя);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьСразу(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьСразуЗавершение (Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Команда = ДополнительныеПараметры.Команда;
	
	ДополнительныеПараметрыПечати = Новый Структура;
	ДополнительныеПараметрыПечати.Вставить("ВидПечати", Команда.Имя);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПечатьЗавершение", ЭтотОбъект, ДополнительныеПараметрыПечати);
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
		
	Иначе
		
		СохранитьНаКлиенте(, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(ВидПечати, НеИзФормыОтчета = Ложь) Экспорт
	
	Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1. Формируется печатная форма...'"), ЭтаФорма.Заголовок), , , БиблиотекаКартинок.Печать);
	
	Если СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки <> Неопределено И СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки Тогда
		РегламентированнаяОтчетностьКлиент.ПроверитьКонтрольныеСоотношения(ЭтаФорма, ОбработкаКС);
	КонецЕсли;
	
	Если НЕ ПечатьНаСервере(ВидПечати) Тогда
		Возврат;
	КонецЕсли;
	
	ОбщиеРеквизитыРазделов = Новый Структура;
	
	РегламентированнаяОтчетностьКлиент.ОткрытьФормуПредварительногоПросмотра(ЭтаФорма, ВидПечати, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере(ВидПечати)
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	Раздел = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	СтруктураРеквизитовФормы.мПечатныеФормы.Очистить();
	СтруктураРеквизитовФормы.мРежимПечати = Истина;
	
	Для Каждого ЭлеменетДерева Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
        Если ЭлеменетДерева.ВыводНаПечать = 1 Тогда
            
            ВывестиМакетСтраницыВТабличныйДокументНаСервере(ЭлеменетДерева.ИмяСтраницы);
            СтруктураПараметров = Новый Структура;
            СтруктураПараметров.Вставить("НаименованиеЛиста",  ЭлеменетДерева.Представление);
            СтруктураПараметров.Вставить("ОриентацияЛиста",    ЭлеменетДерева.ОриентацияСтраницы);
            СтруктураПараметров.Вставить("ИмяСтраницы",        ЭлеменетДерева.ИмяСтраницы);
            Структурапараметров.Вставить("ИмяОбластиТаблПоля", "ТабличныйДокумент");
            СтруктураПараметров.Вставить("ВидПечати",          ВидПечати);
            
            РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, СтруктураПараметров, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
            
        КонецЕсли;
        
	КонецЦикла;
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(Раздел);
	
	РегламентированнаяОтчетностьКлиентСервер.ПроставлениеНомеровЛистов(ЭтаФорма, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	РегламентированнаяОтчетностьКлиент.ПередЗакрытиемРегламентированногоОтчета(ЭтаФорма, Отказ, СтандартнаяОбработка,ЗавершениеРаботы, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПриЗакрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	РегламентированнаяОтчетность.ПриЗакрытииРегламентированногоОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	ИмяЯчейки = Область.Имя;
	
	ПараметрВводаПоля = СвойстваПоказателей.НайтиСтроки(Новый Структура("Показатель", Область.Имя));
	
	Если ПараметрВводаПоля.Количество() = 0 Тогда
		
		ПараметрВводаПоля = Неопределено;
		
		Если СтрНайти(Область.Имя, "П000250000203") > 0
			ИЛИ СтрНайти(Область.Имя, "П000130000202") > 0 Тогда
			
			ОбластьСписка = "СтандартныеНалоговыеВычеты2021";
			
		ИначеЕсли СтрНайти(Область.Имя, "П000250000205") > 0
			ИЛИ СтрНайти(Область.Имя, "П000130000204") > 0 Тогда
			
			ОбластьСписка = "ПрочиеНалоговыеВычеты2021";
			
		// доходы, не подлежащие налогообложению	
		ИначеЕсли СтрНайти(Область.Имя, "П000240000202") > 0
			ИЛИ СтрНайти(Область.Имя, "П000120000202") > 0 Тогда
			
			ОбластьСписка = "ДоходыНеПодлежащиеНалогообложению2021";
			
		ИначеЕсли СтрНайти(Область.Имя, "П000110000204") > 0 Тогда
			
			ОбластьСписка = "СтатусФизическогоЛица2021";
			
		ИначеЕсли СтрНайти(Область.Имя, "П000110000205") > 0 Тогда
			
			ОбластьСписка = "КатегорияФизическогоЛица2021";
			
		ИначеЕсли СтрНайти(Область.Имя, "П000230000202") > 0 Тогда
			
			ОбластьСписка = "КодВидовДохода2021";
			
		ИначеЕсли (Найти(ИмяЯчейки, "П000230000203") > 0
			ИЛИ Найти(ИмяЯчейки, "П000230000204") > 0)  Тогда

			ОбластьСписка = "КодировкаВидовМеждународныхДоговоров2021";
			
		Иначе
			
			ОбластьСписка = Область.Имя;
			
		КонецЕсли;
		
		Для Каждого Стр из СвойстваПоказателей Цикл
			Если ОбластьСписка = Стр.Показатель Тогда
				ПараметрВводаПоля = Стр;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ПараметрВводаПоля = ПараметрВводаПоля[0];
	КонецЕсли;
	
	Если ПараметрВводаПоля <> Неопределено И ПараметрВводаПоля.ТаблицаЗначений.Количество() > 0 Тогда
		ВвестиПоказатель(Элемент, Область, Область.Имя, Ложь, ПараметрВводаПоля.ТекстПриВыборе, ПараметрВводаПоля.ТаблицаЗначений, СтандартнаяОбработка);
	КонецЕсли;

	ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка)
	
	Если СтрЧислоВхождений(Область.Имя, "ДобавитьСтроку") > 0 Тогда
		ДобавитьСтроку("");
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "УдалитьСтроку") > 0 И Область.Гиперссылка Тогда
		УдалитьСтроку("");
	ИначеЕсли Найти(Область.Имя, "П000210000202") > 0 ИЛИ Найти(Область.Имя, "П000110000202")> 0 Тогда
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("ИмяЯчейки", Область.Имя);
	
		НачЗначение = Область.Значение;
		
		ЗначениеРасшифровки = Область.Расшифровка;
		
		Если ЗначениеЗаполнено(Область.Расшифровка) Тогда
			ОткрытьФорму("Справочник.ФизическиеЛица.ФормаОбъекта", Новый Структура("Ключ", Область.Расшифровка), ЭтаФорма);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НачЗначение) ИЛИ ЗначениеЗаполнено(ЗначениеРасшифровки) Тогда
			Возврат;
		КонецЕсли; 	 
		
		ПараметрыОткрытияФормы = Новый Структура;
		СтруктураОтбора = Новый Структура;
		
		ПараметрыОткрытияФормы.Вставить("РежимВыбора", Истина);
		ПараметрыОткрытияФормы.Вставить("МножественныйВыбор", Ложь);
		ПараметрыОткрытияФормы.Вставить("ЗакрыватьПриВыборе", Истина);

		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораЗначений", ЭтотОбъект, ПараметрыОповещения);
		ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора", ПараметрыОткрытияФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
	ИмяЯчейки = Область.Имя;
	
	Если (Найти(ИмяЯчейки, "Первоначальная") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Очередная") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Дополнительная") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "ПоУведомлению") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Ликвидационная") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Приложение01") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Приложение02") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Резидент") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Нерезидент") > 0) 
   	 ИЛИ (Найти(ИмяЯчейки, "ТрехкомпонентнаяИС") > 0) 
	 ИЛИ (Найти(ИмяЯчейки, "ДоверительныйУправляющий") > 0) 
     ИЛИ (Найти(ИмяЯчейки, "Учредитель") > 0) 
	 ИЛИ (Найти(ИмяЯчейки, "ВедетБУ") > 0) 
	 ИЛИ (Найти(ИмяЯчейки, "НеВедетБУ") > 0)       
	 ИЛИ (Найти(ИмяЯчейки, "П000230000106") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "П000230000107") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "П000110000204") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "П000110000205") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "П000110000206") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "П000110000207") > 0) Тогда
		РасчетНаКлиенте(СтруктураРеквизитовФормы.НаимТекущегоРаздела,ИмяЯчейки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПостроениеПервоначальнойСтруктурыНаСервере(Первый = Истина, НаимРаздела)
	
	ПостроениеПервоначальнойСтруктуры(ЭтаФорма, Первый, НаимРаздела);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПостроениеПервоначальнойСтруктуры(Форма, Первый = Истина, НаимРаздела)
	Перем ТаблицаСтраницРаздела;
	Перем ТаблицаДоходовИсточника;

    //Если Не Форма.мСтруктураФорма200_03Страница1и2.Свойство("Форма200_03", ТаблицаСтраницРаздела) Тогда
    //	Возврат;
    //КонецЕсли;
    //
    //ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];

    //Если Первый Тогда
    //			
    //	ОчиститьТабличноеПоле(Форма, НаимРаздела);
    //	СтруктураДанныхТекущейТаблицыРаздел1 = СобратьДанныеТекущегоТаблПоля(Форма, "ТабличныйДокумент");

    //	СтрНоваяСтраница = ТаблицаСтраницРаздела.Добавить();
    //	СтрНоваяСтраница.Представление      = "";
    //	СтрНоваяСтраница.АктивнаяСтраница   = Истина;
    //	СтрНоваяСтраница.АвтоматическоеПредставление = Истина;
    //	СтрНоваяСтраница.Страница1.Добавить(СтруктураДанныхТекущейТаблицыРаздел1);
    //	
    //	СтруктураДанных = Новый Структура;
    //	СтрНоваяСтраница.Страница2.Добавить(СтруктураДанных);
    //	
    //КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТабличноеПолеНаКлиенте(ВыбТабличноеПолеИмя) Экспорт
	
	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличноеПолеНаСервере(ВыбТабличноеПолеИмя) Экспорт
	
	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьТабличноеПоле(Форма, ВыбТабличноеПолеИмя)
	
	ВыбТабличноеПоле = Форма.ТабличныйДокумент;
	
	// Непосредственно очищаем ячейки табличного документа.
	Для Инд = 0 По ВыбТабличноеПоле.Области.Количество() - 1 Цикл
		ТекущаяОбласть = ВыбТабличноеПоле.Области[Инд];
		
		Если Не ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;
	
		Если ТекущаяОбласть.СодержитЗначение <> Истина Тогда
			Продолжить;
		КонецЕсли;
		
		Если (СтрНайти(ТекущаяОбласть.Имя, "ИИН") > 0 ) 
			ИЛИ (СтрНайти(ТекущаяОбласть.Имя, "Год") > 0 ) Тогда
			Если ТекущаяОбласть.Защита Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
			
		Если ТипЗнч(ТекущаяОбласть.Значение) = Тип("Число") 
			И ТекущаяОбласть.Значение <> 0 Тогда
			ТекущаяОбласть.Очистить();
		КонецЕсли;
		
		Если ТекущаяОбласть.Защита Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущаяОбласть.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СобратьДанныеТекущегоТаблПоляНаСервере(ИмяТабличногоПоля) Экспорт
	
	Возврат СобратьДанныеТекущегоТаблПоля(ЭтаФорма, ИмяТабличногоПоля);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СобратьДанныеТекущегоТаблПоля(Форма, ИмяТабличногоПоля)

	ТабличноеПоле = Форма[ИмяТабличногоПоля];
	
	СтруктураДанныхПоля = Новый Структура;
	
	Для Инд = 0 По ТабличноеПоле.Области.Количество() - 1 Цикл
		ТекущаяОбласть = ТабличноеПоле.Области[Инд];

		Если Не ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;

		Если ТекущаяОбласть.СодержитЗначение <> Истина Тогда
			Продолжить;
		КонецЕсли;

		ИмяПоказателя      = ТекущаяОбласть.Имя;
		ЗначениеПоказателя = ТекущаяОбласть.Значение;
		
		Если ЗначениеЗаполнено(ТекущаяОбласть.Расшифровка) Тогда
			СтруктураДанныхПоля.Вставить(СтрЗаменить(ИмяПоказателя, "_", "Ссылка_"), ЗначениеПоказателя);		
		КонецЕсли;

		СтруктураДанныхПоля.Вставить(ИмяПоказателя, ЗначениеПоказателя);

	КонецЦикла;

	Возврат СтруктураДанныхПоля;

КонецФункции

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	#Если ВебКлиент Тогда
		ВставитьДополнительнуюСтрокуНаСервере();
	#Иначе
		ВставитьДополнительнуюСтрокуНаКлиенте();
	#КонецЕсли
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура ВставитьДополнительнуюСтрокуНаСервере()
	
	ВставитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьДополнительнуюСтрокуНаКлиенте()
	
	ВставитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВставитьДополнительнуюСтроку(Форма, ИмяГруппыБлока = Неопределено, СпециальноеДобавление = Ложь, ИмяКолонкиНомера = Неопределено) Экспорт
	
	Перем СтруктураГруппы;
	Перем МаксимальноеКоличествоСтрокГруппы;
	
	Если ИмяГруппыБлока = Неопределено Тогда
		// Сначала выполним проверку на активную страницу панели формы,
		// которая содержит многострочный раздел
		#Если НаКлиенте Тогда
			ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		#Иначе
			ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		#КонецЕсли
		
		Если ИмяГруппы = Неопределено Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Не выбран многострочный раздел, в который необходимо добавить строку.'");
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли;
		
	Иначе
		ИмяГруппы = ИмяГруппыБлока;
	КонецЕсли;
	
	// Исходное количество строк группы
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, МаксимальноеКоличествоСтрокГруппы);

	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = Форма[СтруктураГруппы];

	// определяем последнюю строку многострочной группы
	КолСтрок = СтруктураГруппы.Количество();
	
	КолСтрокСтр = Формат(КолСтрок, "ЧГ=");

	ИмяПервойЯчейкиПоследнейСтроки = ИмяГруппы + "01_" + КолСтрокСтр;
	
	// область первой ячейки последней строки многострочного раздела
	ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяПервойЯчейкиПоследнейСтроки];

	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// номера строк исходной области
	НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;
	НомерНижнЯчейкиОбласти = ОбластьЯчейки.Верх + ВысотаСтроки - 1;
		
	СдвигСтрок = НомерНижнЯчейкиОбласти - НомерВерхЯчейкиОбласти + 1;

	// номера строк вставляемой области
	НомерВерхЯчейкиНовойОбласти = НомерВерхЯчейкиОбласти + СдвигСтрок;
	НомерНижнЯчейкиНовойОбласти = НомерНижнЯчейкиОбласти + СдвигСтрок;
	
	НазначитьИмяОбластиМЧ = Ложь;
	ВставляемаяОбласть = ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, );
	Если СтрНайти(ВставляемаяОбласть.Имя, "МногострочнаяЧасть") Тогда
		НазначитьИмяОбластиМЧ = Истина;
		ИмяМногострочнойЧасти = ВставляемаяОбласть.Имя;
	КонецЕсли;
	
	Если НЕ СпециальноеДобавление Тогда
		
		РегламентированнаяОтчетностьВызовСервера.ВставитьОбластьВТабличныйДокумент(ТекТабличноеПоле, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
		
		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
	КонецЕсли;
	
	Если НазначитьИмяОбластиМЧ Тогда
		ТекТабличноеПоле.Область(НомерНижнЯчейкиОбласти + 1, , НомерНижнЯчейкиОбласти + (НомерНижнЯчейкиОбласти - НомерВерхЯчейкиОбласти) + 1, ).Имя = "";
		ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, ).Имя = ИмяМногострочнойЧасти;
	КонецЕсли;
	
	КолСтрокСтр1 = Формат(КолСтрок + 1, "ЧГ=");
	
	Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
		
		ИмяКолонки = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
		
		
		// переопределяем имена вставленной области
		Если СтруктураГруппы[0].Свойство(ИмяКолонки) Тогда
			
			ИмяОбластиЯчейки    = ИмяКолонки + "_" + КолСтрокСтр;
			ИмяНовОбластиЯчейки = ИмяКолонки + "_" + КолСтрокСтр1;
			
			ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяОбластиЯчейки];
			ОбластьЯчейки.Имя = ИмяНовОбластиЯчейки;
			
			Если (НомерГрафы = 1) Тогда
				ТекТабличноеПоле.Области["УдалитьСтроку" + ИмяОбластиЯчейки].Имя = "УдалитьСтроку" + ИмяНовОбластиЯчейки;
			КонецЕсли;
			
			// определяем границы ячейки исходной области
			НомерВерхСтрокиЯчейки  = ОбластьЯчейки.Верх - СдвигСтрок;
			НомерНижнСтрокиЯчейки  = ОбластьЯчейки.Низ  - СдвигСтрок;
			НомерЛевоКолонкиЯчейки = ОбластьЯчейки.Лево;
			НомерПравКолонкиЯчейки = ОбластьЯчейки.Право;
			
			// Назначаем имя ячейки исходной области,
			// (т.к. в результате вставки новой области оно было очищено)
			ОбластьЯчейкиИсходнойОбласти = ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки, НомерНижнСтрокиЯчейки, НомерПравКолонкиЯчейки);
			ОбластьЯчейкиИсходнойОбласти.Имя = ИмяОбластиЯчейки;
			
			Если (НомерГрафы = 1) Тогда
				
					ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки - 1, НомерНижнСтрокиЯчейки, НомерЛевоКолонкиЯчейки - 1).Имя  = "УдалитьСтроку" + ИмяОбластиЯчейки;
				
			КонецЕсли;
			
			// очищаем значения ячеек вставленной области
			Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
				ОбластьЯчейки.Очистить();
			КонецЕсли;
			
			Если ИмяКолонкиНомера <> Неопределено Тогда
				Если ИмяКолонкиНомера = ИмяКолонки Тогда
					Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
						ОбластьЯчейки.Значение = КолСтрокСтр1;
					Иначе
						ОбластьЯчейки.Текст = КолСтрокСтр1;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИмяГруппыБлока = Неопределено Тогда
		
			
		ИмяТекущейОбласти = ИмяГруппы + "01_" + КолСтрокСтр1;
		
		Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];
		
		// установим фокус на поле табличн. документа
		ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
		
	КонецЕсли;
	
	// добавляем в структуру многострочной группы новую строку
	ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,Форма);
	
	//ПрописатьФункцию добавления по всем страницам приложения
	
	Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
		Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
			ОбластьТД.Гиперссылка = Истина;
			ОбластьТД.Текст = "х";
		КонецЕсли;
	КонецЦикла;
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	
	ТекТабличноеПоле = ЭтаФорма["ТабличныйДокумент"];
	
	ТекущаяОбласть = ТекТабличноеПоле.ТекущаяОбласть;
	
	ИмяГруппы = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(ЭтаФорма, ТекущаяОбласть);
	
	Если ИмяГруппы = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не выбрана удаляемая строка многострочного раздела.'");
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьСтрокуЗавершение", ЭтотОбъект);
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Удалить выбранную строку?'"), Символы.ПС);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	#Если ВебКлиент Тогда
		УдалитьДополнительнуюСтрокуНаСервере();
	#Иначе
		УдалитьДополнительнуюСтрокуНаКлиенте();
	#КонецЕсли
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	МассивПересчета = Новый Массив;
	МассивПересчета.Добавить("Форма910_02Страница4");
	МассивПересчета.Добавить("Форма910_02Страница5");
	МассивПересчета.Добавить("Форма910_02Страница6");
	МассивПересчета.Добавить("Форма910_02Страница7");
	МассивПересчета.Добавить("Форма910_02Страница8");
	
	Для каждого Элемент из МассивПересчета Цикл
		РасчетНаКлиенте(Элемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДополнительнуюСтрокуНаСервере()
	
	УдалитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДополнительнуюСтрокуНаКлиенте()
	
	УдалитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьДополнительнуюСтроку(Форма, СпециальноеДобавление = Ложь, ИмяКолонкиНомера = Неопределено) Экспорт
	
	Перем ИсходноеКоличествоСтрокГруппы;
	Перем СтруктураГруппы;

	ТекущаяСтраница = Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	ТекТабличноеПоле = Форма.ТабличныйДокумент;

	ТекущаяОбласть = Форма.Элементы["ТабличныйДокумент"].ТекущаяОбласть;

	#Если НаКлиенте ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		ИмяГруппы = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(Форма, ТекущаяОбласть);
	#Иначе
		ИмяГруппы = РегламентированнаяОтчетностьВызовСервера.РазделТекущейОбластиНаСервере(Форма, ТекущаяОбласть);
	#КонецЕсли

	// исходное количество строк группы
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);

	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = Форма[СтруктураГруппы];

	// Выполним также проверку вхождения текущей (выделенной) ячейки в многострочный раздел
	ТекущаяОбласть = Форма.Элементы["ТабличныйДокумент"].ТекущаяОбласть;
	
	ИмяЯчейки = ТекущаяОбласть.Имя;

	// номер строки многострочного раздела определим
	// по имени выделенной ячейки
	НомУдаляемойСтроки = Число(Сред(ИмяЯчейки, СтрНайти(ИмяЯчейки, "_") + 1));
	НомерСтрокиТаблицы = НомУдаляемойСтроки - 1; // нумерация строк в таблице значений начинается с нуля
	
	Если СтруктураГруппы.Количество() > ИсходноеКоличествоСтрокГруппы Тогда
		
		ИмяПервойЯчейкиУдаляемойСтроки = "УдалитьСтроку" + ИмяГруппы + "01_" + Формат(НомУдаляемойСтроки, "ЧГ=0");

		// область первой ячейки удаляемой строки многострочного раздела
		ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяПервойЯчейкиУдаляемойСтроки];

		НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
		ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
		
		НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;
		НомерНижнЯчейкиОбласти = ОбластьЯчейки.Верх + ВысотаСтроки - 1;
		
		МногострочностьВРазделе = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе");
		МногострочностьВРазделеТип = ТипЗнч(МногострочностьВРазделе);
		Если МногострочностьВРазделеТип = Тип("Число") Тогда
			ИмяОбластиМнгЧ = "МногострочнаяЧасть";
		ИначеЕсли МногострочностьВРазделеТип = Тип("ДанныеФормыКоллекция") Тогда
			ИмяОбластиМнгЧ = МногострочностьВРазделе.НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0].Область;
		КонецЕсли;
		// Найдем координаты области, для последующего восстановления.

		Если ТекТабличноеПоле.Области.Найти(ИмяОбластиМнгЧ) <> Неопределено Тогда
			ОбластьВерх = ТекТабличноеПоле.Области[ИмяОбластиМнгЧ].Верх;
			ОбластьНиз = ТекТабличноеПоле.Области[ИмяОбластиМнгЧ].Низ;
		КонецЕсли;

		Если СпециальноеДобавление Тогда
			
		Иначе
					
			РегламентированнаяОтчетностьВызовСервера.УдалитьОбластьИзТабличногоДокумента(ТекТабличноеПоле, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
		
			Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
			
		КонецЕсли;
		// Восстановим область.
		ТекТабличноеПоле.Область(ОбластьВерх, 0, ОбластьНиз, 0).Имя = ИмяОбластиМнгЧ;

		КолвоСдвигаемыхСтрок = СтруктураГруппы.Количество() - НомУдаляемойСтроки;

		// обновим имена ячеек сдвинутых строк
		Если КолвоСдвигаемыхСтрок > 0 Тогда

			Для НСтр = НомУдаляемойСтроки + 1 По СтруктураГруппы.Количество() Цикл

				ТекСтрока = СтруктураГруппы[НСтр - 1];

				НСтрСтр = Формат(НСтр, "ЧГ=0");
				НСтрСтр1 = Формат(НСтр - 1, "ЧГ=0");
				
				Для НомерГрафы = 0 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
					
					Если НомерГрафы = 0 Тогда
						
						КолонкаИмя = "УдалитьСтроку" + ИмяГруппы + Формат( 1, "ЧЦ=2; ЧВН=");
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ИмяКолонкиНомера <> Неопределено Тогда
							Если ИмяКолонкиНомера = КолонкаИмя Тогда
								// обновляем порядковый номер строки
								
								СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
								НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
								ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер;
								
								// обновляем значение элемента таблицы значений
								ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
					КолонкаИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
					
					Если СтруктураГруппы[0].Свойство(КолонкаИмя) Тогда
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ИмяКолонкиНомера <> Неопределено Тогда
							Если ИмяКолонкиНомера = КолонкаИмя Тогда
								// обновляем порядковый номер строки
								
								СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
								НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
								ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер;
								
								// обновляем значение элемента таблицы значений
								ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
		КонецЕсли;
		// обновляем структуру многострочного раздела
		
		//Процедура удаления по всем страницам приложения
		УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма);
		
	Иначе
		// строка не удаляется в форме табличного документа,
		// а должна осуществляться сдвиг строк

		// обновляем структуру многострочного раздела
		// методом удаления выбранной строки и добавления пустой строки
		
		//Процедура удаления по всем страницам приложения
		УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма);
		
		//Процедура удаления по всем страницам приложения
		ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,Форма);
		
		// обновляем порядковые номера строк, выводимых в табличный документ
		Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
			
			НомерСтрокиВТаблице = СтруктураГруппы.Индекс(СтрокаТаблицы);
			НомерСтрокиВФормеТаблицы = Формат(НомерСтрокиВТаблице + 1, "ЧГ=0");
			
			Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
				
				КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
				
				Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
					
					Если ИмяКолонкиНомера <> Неопределено Тогда
						Если ИмяКолонкиНомера = КолонкаТаблицыИмя Тогда
							// обновляем порядковый номер строки
							СтрокаТаблицы[КолонкаТаблицыИмя] = НомерСтрокиВФормеТаблицы;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;	
				
			КонецЦикла;
		
		КонецЦикла;

		// Данные в многострочном блоке обновляются в декларациях!
		// Форма.ОбновитьСтруктуруМногострочногоРаздела(ИмяГруппы);
		// Обновляем экранную форму табличного документа
		#Если НаКлиенте Тогда
			Форма.ВывестиРазделВТабличныйДокументНаКлиенте(ИмяГруппы, СтруктураГруппы);
		#Иначе
			Форма.ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппы, СтруктураГруппы);
		#КонецЕсли
	
	КонецЕсли;
	
	// назначим текущей областью таблицы первую редактируемую ячейку
	// удаленной строки, если ее порядковый номер меньше кол-ва строк
	// многострочного раздела, или последней строки раздела в противном случае

	// определяем текущую область таблицы
	НомТекущейСтроки = Мин(НомУдаляемойСтроки, СтруктураГруппы.Количество());
	
	ИмяТекущейОбласти = "УдалитьСтроку" + ИмяГруппы + "01_" + Формат(НомТекущейСтроки, "ЧГ=0");
		
	Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];

	// установим фокус на поле табличн. документа
	ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
	
	ЕстьДопСтроки = Ложь;
	
	Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
		Если СтрЧислоВхождений(ОбластьТД.Имя, "_2") > 0 Тогда
			ЕстьДопСтроки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьДопСтроки Тогда
		Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
			Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
				ОбластьТД.Гиперссылка = Ложь;
				ОбластьТД.Текст = "";
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;
   	ИдГрупп.Вставить("мИдГруппы11", СтруктураРеквизитовФормы.мИдГруппы11);
	ИдГрупп.Вставить("мИдГруппы12", СтруктураРеквизитовФормы.мИдГруппы12);
	ИдГрупп.Вставить("мИдГруппы13", СтруктураРеквизитовФормы.мИдГруппы13);
	ИдГрупп.Вставить("мИдГруппы14", СтруктураРеквизитовФормы.мИдГруппы14);
	ИдГрупп.Вставить("мИдГруппы15", СтруктураРеквизитовФормы.мИдГруппы15);
	ИдГрупп.Вставить("мИдГруппы16", СтруктураРеквизитовФормы.мИдГруппы16);
    ИдГрупп.Вставить("мИдГруппы21", СтруктураРеквизитовФормы.мИдГруппы21);
	ИдГрупп.Вставить("мИдГруппы22", СтруктураРеквизитовФормы.мИдГруппы22);
	ИдГрупп.Вставить("мИдГруппы23", СтруктураРеквизитовФормы.мИдГруппы23);
	ИдГрупп.Вставить("мИдГруппы24", СтруктураРеквизитовФормы.мИдГруппы24);
	ИдГрупп.Вставить("мИдГруппы25", СтруктураРеквизитовФормы.мИдГруппы25);
	ИдГрупп.Вставить("мИдГруппы26", СтруктураРеквизитовФормы.мИдГруппы26);
	ИдГрупп.Вставить("мИдГруппы27", СтруктураРеквизитовФормы.мИдГруппы27);
	ИдГрупп.Вставить("мИдГруппы28", СтруктураРеквизитовФормы.мИдГруппы28);
	
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста, , ИдГрупп);
	
КонецФункции

&НаКлиенте
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы11", СтруктураРеквизитовФормы.мИдГруппы11);
	ИдГрупп.Вставить("мИдГруппы12", СтруктураРеквизитовФормы.мИдГруппы12);
	ИдГрупп.Вставить("мИдГруппы13", СтруктураРеквизитовФормы.мИдГруппы13);
	ИдГрупп.Вставить("мИдГруппы14", СтруктураРеквизитовФормы.мИдГруппы14);
	ИдГрупп.Вставить("мИдГруппы15", СтруктураРеквизитовФормы.мИдГруппы15);
	ИдГрупп.Вставить("мИдГруппы16", СтруктураРеквизитовФормы.мИдГруппы16);
	ИдГрупп.Вставить("мИдГруппы21", СтруктураРеквизитовФормы.мИдГруппы21);
	ИдГрупп.Вставить("мИдГруппы22", СтруктураРеквизитовФормы.мИдГруппы22);
	ИдГрупп.Вставить("мИдГруппы23", СтруктураРеквизитовФормы.мИдГруппы23);
	ИдГрупп.Вставить("мИдГруппы24", СтруктураРеквизитовФормы.мИдГруппы24);
	ИдГрупп.Вставить("мИдГруппы25", СтруктураРеквизитовФормы.мИдГруппы25);
	ИдГрупп.Вставить("мИдГруппы26", СтруктураРеквизитовФормы.мИдГруппы26);
	ИдГрупп.Вставить("мИдГруппы27", СтруктураРеквизитовФормы.мИдГруппы27);
	ИдГрупп.Вставить("мИдГруппы28", СтруктураРеквизитовФормы.мИдГруппы28);
	
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста, , ИдГрупп);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста = Неопределено, ТекущаяСтраница, ИдГрупп)
	
	Перем ИмяГруппы;
	
	Если ИмяЛиста = Неопределено Тогда
		ИмяТекущейСтраницыПанели = ТекущаяСтраница.Имя;
	Иначе
		ИмяТекущейСтраницыПанели = ИмяЛиста;
	КонецЕсли;
	
	Если ИмяТекущейСтраницыПанели = "Форма910_01Страница1" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы11;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма910_01Страница2" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы12;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма910_01Страница3" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы13;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма910_01Страница4" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы14;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма910_01Страница5" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы15;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма910_01Страница6" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы16;
    ИначеЕсли ИмяТекущейСтраницыПанели = "Форма910_02Страница1" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы21;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма910_02Страница2" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы22;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма910_02Страница3" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы23;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма910_02Страница4" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы24;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма910_02Страница5" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы25;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма910_02Страница6" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы26;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма910_02Страница7" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы27;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма910_02Страница8" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы28;
	КонецЕсли;
	
	Возврат ИмяГруппы;
	
КонецФункции

&НаКлиенте
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
    ИдГрупп.Вставить("мИдГруппы11", СтруктураРеквизитовФормы.мИдГруппы11);
	ИдГрупп.Вставить("мИдГруппы12", СтруктураРеквизитовФормы.мИдГруппы12);
	ИдГрупп.Вставить("мИдГруппы13", СтруктураРеквизитовФормы.мИдГруппы13);
	ИдГрупп.Вставить("мИдГруппы14", СтруктураРеквизитовФормы.мИдГруппы14);
	ИдГрупп.Вставить("мИдГруппы15", СтруктураРеквизитовФормы.мИдГруппы15);
	ИдГрупп.Вставить("мИдГруппы16", СтруктураРеквизитовФормы.мИдГруппы16);
    ИдГрупп.Вставить("мИдГруппы21", СтруктураРеквизитовФормы.мИдГруппы21);
	ИдГрупп.Вставить("мИдГруппы22", СтруктураРеквизитовФормы.мИдГруппы22);
	ИдГрупп.Вставить("мИдГруппы23", СтруктураРеквизитовФормы.мИдГруппы23);
	ИдГрупп.Вставить("мИдГруппы24", СтруктураРеквизитовФормы.мИдГруппы24);
	ИдГрупп.Вставить("мИдГруппы25", СтруктураРеквизитовФормы.мИдГруппы25);
	ИдГрупп.Вставить("мИдГруппы26", СтруктураРеквизитовФормы.мИдГруппы26);
	ИдГрупп.Вставить("мИдГруппы27", СтруктураРеквизитовФормы.мИдГруппы27);
	ИдГрупп.Вставить("мИдГруппы28", СтруктураРеквизитовФормы.мИдГруппы28);	
	
	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

&НаСервере
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
   	ИдГрупп.Вставить("мИдГруппы11", СтруктураРеквизитовФормы.мИдГруппы11);
	ИдГрупп.Вставить("мИдГруппы12", СтруктураРеквизитовФормы.мИдГруппы12);
	ИдГрупп.Вставить("мИдГруппы13", СтруктураРеквизитовФормы.мИдГруппы13);
	ИдГрупп.Вставить("мИдГруппы14", СтруктураРеквизитовФормы.мИдГруппы14);
	ИдГрупп.Вставить("мИдГруппы15", СтруктураРеквизитовФормы.мИдГруппы15);
	ИдГрупп.Вставить("мИдГруппы16", СтруктураРеквизитовФормы.мИдГруппы16);
	ИдГрупп.Вставить("мИдГруппы21", СтруктураРеквизитовФормы.мИдГруппы21);
	ИдГрупп.Вставить("мИдГруппы22", СтруктураРеквизитовФормы.мИдГруппы22);
	ИдГрупп.Вставить("мИдГруппы23", СтруктураРеквизитовФормы.мИдГруппы23);
	ИдГрупп.Вставить("мИдГруппы24", СтруктураРеквизитовФормы.мИдГруппы24);
	ИдГрупп.Вставить("мИдГруппы25", СтруктураРеквизитовФормы.мИдГруппы25);
	ИдГрупп.Вставить("мИдГруппы26", СтруктураРеквизитовФормы.мИдГруппы26);
	ИдГрупп.Вставить("мИдГруппы27", СтруктураРеквизитовФормы.мИдГруппы27);
	ИдГрупп.Вставить("мИдГруппы28", СтруктураРеквизитовФормы.мИдГруппы28);

	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп) Экспорт
	
	Перем ТекТабличноеПоле;
	
	Если ИдГруппы = ИдГрупп.мИдГруппы11 Тогда
		
		ТекТабличноеПоле = "Форма910_01Страница1";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы12 Тогда
		
		ТекТабличноеПоле = "Форма910_01Страница2";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы13 Тогда
		
		ТекТабличноеПоле = "Форма910_01Страница3";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы14 Тогда
		
		ТекТабличноеПоле = "Форма910_01Страница4";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы15 Тогда
		
		ТекТабличноеПоле = "Форма910_01Страница5";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы16 Тогда
		
		ТекТабличноеПоле = "Форма910_01Страница6";
        
    ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы21 Тогда
		
		ТекТабличноеПоле = "Форма910_02Страница1";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы22 Тогда
		
		ТекТабличноеПоле = "Форма910_02Страница2";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы23 Тогда
		
		ТекТабличноеПоле = "Форма910_02Страница3";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы24 Тогда
		
		ТекТабличноеПоле = "Форма910_02Страница4";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы25 Тогда
		
		ТекТабличноеПоле = "Форма910_02Страница5";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы26 Тогда
		
		ТекТабличноеПоле = "Форма910_02Страница6";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы27 Тогда
		
		ТекТабличноеПоле = "Форма910_02Страница7";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы28 Тогда
		
		ТекТабличноеПоле = "Форма910_02Страница8";
				
	КонецЕсли;
	
	Возврат ТекТабличноеПоле;
	
КонецФункции

&НаКлиенте
Процедура ВывестиРазделВТабличныйДокументНаКлиенте(ИмяГруппы, СтруктураГруппы) Экспорт
	ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
КонецПроцедуры

&НаСервере
Процедура ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппы, СтруктураГруппы) Экспорт
	ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма)
	
	Если Число(Сред(ИмяГруппы,5,1)) = 1 Тогда
		
		СтруктураГруппы = Форма["П0001100002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0001200002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0001300002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);

		СтруктураГруппы = Форма["П0001400002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);

		СтруктураГруппы = Форма["П0001500002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0001600002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
    ИначеЕсли Число(Сред(ИмяГруппы,5,1)) = 2 Тогда
		
		СтруктураГруппы = Форма["П0002100002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0002200002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0002300002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0002400002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0002500002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0002600002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0002700002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0002800002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
	КонецЕсли;
	
	ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма,НомерСтрокиТаблицы, Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы, Форма)
	
	Если Число(Сред(ИмяГруппы,5,1)) = 1 Тогда
		
		СтруктураГруппы = Форма["П0001100002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0001200002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();	
		
		СтруктураГруппы = Форма["П0001300002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0001400002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0001500002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0001600002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
        
     ИначеЕсли Число(Сред(ИмяГруппы,5,1)) = 2 Тогда
		
		СтруктураГруппы = Форма["П0002100002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0002200002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0002300002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0002400002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0002500002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0002600002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0002700002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0002800002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
				
	КонецЕсли;
	
	ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма, СтруктураГруппы.Количество(), Ложь);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма, НомерСтроки, УдалитьСтроку)
	
	Если УдалитьСтроку = Ложь Тогда
		ИндексПересчета = НомерСтроки - 2
	Иначе
		ИндексПересчета = НомерСтроки;
	КонецЕсли;
	
    Если Число(Сред(ИмяГруппы,5,1)) = 1 Тогда
		
		СтруктураГруппы = Форма["П0001100002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000110000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0001200002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000120000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0001300002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000130000201 = Индекс + 2;
		КонецЦикла;

		СтруктураГруппы = Форма["П0001400002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000140000201 = Индекс + 2;
		КонецЦикла;

		СтруктураГруппы = Форма["П0001500002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000150000201 = Индекс + 2;
		КонецЦикла;
	
		СтруктураГруппы = Форма["П0001600002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000160000201 = Индекс + 2;
		КонецЦикла;
	
    ИначеЕсли Число(Сред(ИмяГруппы,5,1)) = 2 Тогда
		
		СтруктураГруппы = Форма["П0002100002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000210000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0002200002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000220000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0002300002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000230000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0002400002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000240000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0002500002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000250000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0002600002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000260000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0002700002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000270000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0002800002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000280000201 = Индекс + 2;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяОтчета(ЭтаФормаИмя)
	Форма_Имя = СтрЗаменить(ЭтаФормаИмя, "Внешний", "");
	Возврат Сред(Лев(Форма_Имя, СтрНайти(Форма_Имя, ".Форма.") - 1), 7);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяФормыОтчета(ЭтаФормаИмя)
	Возврат Сред(ЭтаФормаИмя, СтрНайти(ЭтаФормаИмя, ".Форма.") + 7);
КонецФункции

&НаКлиенте
Процедура ПечатьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Печать(ДополнительныеПараметры.ВидПечати);
	
КонецПроцедуры

&НаКлиенте
Процедура Расшифровать(Команда)
	
	Если Команда.Имя = "РасшифроватьОбщая" Тогда
		
		Если СтрНайти(Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчета, "910.02") > 1 Тогда
			ИмяЯчейки = "П000210000202_1";
		Иначе
			ИмяЯчейки = "П000110000202_1";
		КонецЕсли;
		
	Иначе
		
		Попытка
			ИмяЯчейки = ЭтотОбъект.ТекущийЭлемент.ТекущаяОбласть.Имя;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Активизируйте нужную ячейку отчета для расшифровки.'"));
			Возврат;
		КонецПопытки;
		
	КонецЕсли;
	
	ЦветРасшифровки = Новый Цвет(225, 253, 253);
	Если ЭтотОбъект.ТекущийЭлемент.Имя = "ТабличныйДокумент"
		И ЭтотОбъект.ТекущийЭлемент.ТекущаяОбласть.ЦветФона = ЦветРасшифровки Тогда 
        
        Если РегламентированнаяОтчетностьРК.ЮридическоеЛицо(СтруктураРеквизитовФормы.Организация) Тогда
			
			Если Лев(ИмяЯчейки,10)= "П000020012"
				ИЛИ Лев(ИмяЯчейки,10)= "П000020013"
				ИЛИ Лев(ИмяЯчейки,10)= "П000020014"
				ИЛИ Лев(ИмяЯчейки,10)= "П000020015"
				ИЛИ Лев(ИмяЯчейки,10)= "П000020016" Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Расшифровка данной ячейки поддерживается только для индивидуального предпринимателя.'"));
					Возврат;
			КонецЕсли;
			
		КонецЕсли;

		ОткрытьФормуРасшифровки(ИмяЯчейки, Команда.Имя);
		
	ИначеЕсли Команда.Имя = "РасшифроватьОбщая" Тогда
		
		ОткрытьФормуРасшифровки(ИмяЯчейки, Команда.Имя);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Расшифровка данной ячейки не поддерживается.'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеИндивидуальногоПредпринимателя() 
	
	МассивЯчеекИП = Новый Массив;
	
	МассивЯчеекИП.Добавить("П000020012101");
	МассивЯчеекИП.Добавить("П000020012201");
	МассивЯчеекИП.Добавить("П000020012301");
	МассивЯчеекИП.Добавить("П000020012401");
	МассивЯчеекИП.Добавить("П000020012501");
	МассивЯчеекИП.Добавить("П000020012601");
	МассивЯчеекИП.Добавить("П000020012701");
    
    МассивЯчеекИП.Добавить("П000020013101");
	МассивЯчеекИП.Добавить("П000020013201");
	МассивЯчеекИП.Добавить("П000020013301");
	МассивЯчеекИП.Добавить("П000020013401");
	МассивЯчеекИП.Добавить("П000020013501");
	МассивЯчеекИП.Добавить("П000020013601");
	МассивЯчеекИП.Добавить("П000020013701");
    
    МассивЯчеекИП.Добавить("П000020014101");
	МассивЯчеекИП.Добавить("П000020014201");
	МассивЯчеекИП.Добавить("П000020014301");
	МассивЯчеекИП.Добавить("П000020014401");
	МассивЯчеекИП.Добавить("П000020014501");
	МассивЯчеекИП.Добавить("П000020014601");
	МассивЯчеекИП.Добавить("П000020014701");
    
    МассивЯчеекИП.Добавить("П000020015101");
	МассивЯчеекИП.Добавить("П000020015201");
	МассивЯчеекИП.Добавить("П000020015301");
	МассивЯчеекИП.Добавить("П000020015401");
	МассивЯчеекИП.Добавить("П000020015501");
	МассивЯчеекИП.Добавить("П000020015601");
	МассивЯчеекИП.Добавить("П000020015701");
    
    МассивЯчеекИП.Добавить("П000020016101");
	МассивЯчеекИП.Добавить("П000020016201");
	МассивЯчеекИП.Добавить("П000020016301");
	МассивЯчеекИП.Добавить("П000020016401");
	МассивЯчеекИП.Добавить("П000020016501");
	МассивЯчеекИП.Добавить("П000020016601");
	МассивЯчеекИП.Добавить("П000020016701");

	Возврат МассивЯчеекИП;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуРасшифровки(ИмяЯчейки, ИмяКоманды)
	
	ПараметрыОтчета = Новый Структура();
	НомерФормы = "910.0" + Сред(ИмяЯчейки,5,1);
	НомерМесяца = Сред(ИмяЯчейки,11,1);
	НомерСтроки = ПолучитьНомерСтрокиПоЯчейке(ИмяЯчейки);
    
    Если Найти(ИмяЯчейки, "П000010001") > 0 Тогда
        
        СтруктураСоответствияКодовСтрок = Новый Структура;
        
        СтруктураСоответствияКодовСтрок.Вставить("П000010001201", "910.00.001.А");
        СтруктураСоответствияКодовСтрок.Вставить("П000010001301", "910.00.001.В");
        
        Если СтруктураСоответствияКодовСтрок.Свойство(ИмяЯчейки) <> Ложь Тогда
            ИмяЯчейки = СтруктураСоответствияКодовСтрок[ИмяЯчейки];
        Иначе
            ИмяЯчейки = "910.00.001";
        КонецЕсли;	
        
        СписокДохКодовСтрок = Новый СписокЗначений;
        СписокДохКодовСтрок.Добавить("910.00.001.А");
        СписокДохКодовСтрок.Добавить("910.00.001.В");
    
        ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
        
        ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("НачалоПериода", 	СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
        ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("КонецПериода",  	СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
        ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ТипДанных", 		"РегистрыБухгалтерии");
        ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ИмяОбъекта", 	"Хозрасчетный");
        ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ИмяТаблицы", 	"Обороты");
        
        ВключатьПР = Ложь;
        ИмяСхемыКомпоновкиДанных = Неопределено;
        ИмяРазделаРасшифровки = "Декларация по КПН:" + СтруктураРеквизитовФормы.мГод + ", Доходы";
        
        ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СхемаКомпоновкиДанных", ПолучитьАдресМакетаСКД(ИмяСхемыКомпоновкиДанных));
        
        // Группировки	
        МассивГруппировок = Новый Массив();
        МассивГруппировок.Добавить(Новый Структура("Использование, Поле, Представление, ТипГруппировки", Истина, "КодСтроки", НСтр("ru = 'Код строки'"), 3));	
        
        ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Группировка",  МассивГруппировок);
        
        // Сортировка
        ПользовательскиеСортировки = ПользовательскиеНастройки.Элементы.Добавить(Тип("ПорядокКомпоновкиДанных"));
        ПользовательскиеСортировки.ИдентификаторПользовательскойНастройки = "Порядок";
        
        НовыйЭлементПорядка = ПользовательскиеСортировки.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
        НовыйЭлементПорядка.Использование  = Истина;
        НовыйЭлементПорядка.Поле  = новый ПолеКомпоновкиДанных("Регистратор");
        
        //Параметры
        МассивПараметровДанных = Новый Массив();   
          
        КодыСтрокРасшифровки = Новый СписокЗначений;
        
        Если ИмяЯчейки = "910.00.001.А" Тогда 
            КодыСтрокРасшифровки.Добавить("910.00.001.А");
        ИначеЕсли ИмяЯчейки = "910.00.001.В" Тогда 
            КодыСтрокРасшифровки.Добавить("910.00.001.В");
        Иначе
            КодыСтрокРасшифровки.Добавить("910.00.001.А");
            КодыСтрокРасшифровки.Добавить("910.00.001.В");
        КонецЕсли;
        
        ДобавитьПараметр(МассивПараметровДанных, "КодСтрокиРасшифровки",   КодыСтрокРасшифровки);
        ДобавитьПараметр(МассивПараметровДанных, "КодСтроки", 							"910.00%");
        
        ДобавитьПараметр(МассивПараметровДанных, "НачалоПериода", 				НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета));
        ДобавитьПараметр(МассивПараметровДанных, "КонецПериода", 				КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));
        ДобавитьПараметр(МассивПараметровДанных, "НачПериода", 					СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
        ДобавитьПараметр(МассивПараметровДанных, "КонПериода", 					СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
        ДобавитьПараметр(МассивПараметровДанных, "НачГраница", 					СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
        ДобавитьПараметр(МассивПараметровДанных, "КонГраница", 					КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета) + 1);
        ДобавитьПараметр(МассивПараметровДанных, "Организация", 				СтруктураРеквизитовФормы.Организация);
        ДобавитьПараметр(МассивПараметровДанных, "ПустаяОрганизация", 			ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));
        ДобавитьПараметр(МассивПараметровДанных, "ПустоеЗначение", 				Неопределено);
        
        ВидСубконтоЗатрат = Новый Массив;
        ВидСубконтоЗатрат.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат"));
        ВидСубконтоЗатрат.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ТипыЗатрат"));
        
        ДобавитьПараметр(МассивПараметровДанных, "ВидСубконтоПроизводственныхЗатрат",		ВидСубконтоЗатрат);
        ДобавитьПараметр(МассивПараметровДанных, "ВидСубконтоЗатрат", 			ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат"));
        ДобавитьПараметр(МассивПараметровДанных, "ВидСубконтоДоходов", 			ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы"));
        
        ДобавитьПараметр(МассивПараметровДанных,  "ВидСубконтоСтатьиДДС", 		ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДвиженияДенежныхСредств"));

        ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПараметрыДанных", МассивПараметровДанных);
        
        ПользовательскиеПоля = ПользовательскиеНастройки.Элементы.Добавить(Тип("ВыбранныеПоляКомпоновкиДанных"));	
        ПользовательскиеПоля.ИдентификаторПользовательскойНастройки = "Выбор";	
        
        БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "КорСубконто1", 	"Кор субконто 1");
        БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "СуммаВДекларации", "Сумма в декларации");
        БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "СуммаНУ", 			"Сумма НУ");
        БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "СуммаПР", 			"Сумма ПР");
        БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "СуммаВР", 			"Сумма ВР");
        
        БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "Регистратор", "Документ движения");		
        
        // Прочие настройки
        ТекстЗаголовка = НСтр("ru = 'Регистр налогового учета к строке %1 для Декларации по КПН'");	
        ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Заголовок", 	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗаголовка, ИмяЯчейки));
        ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ВыводитьЗаголовок", Истина);	
        ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ВыводитьПодписи", Истина); 	
        
        ПараметрыФормы = Новый Структура;
        ПараметрыФормы.Вставить("ВидРасшифровки", 2);
        ПараметрыФормы.Вставить("РежимРасшифровки", Истина);
        ПараметрыФормы.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
        ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);	
        ПараметрыФормы.Вставить("ВыводитьЗаголовок", Истина);	
        ПараметрыФормы.Вставить("КлючНазначенияИспользования", ИмяРазделаРасшифровки);

        ОткрытьФорму("Отчет.РасшифровкаРегламентированныхОтчетов.Форма.ФормаОтчета", ПараметрыФормы,,Истина);

    Иначе 
        
        Если НомерФормы = "910.01" ИЛИ НомерФормы = "910.02" Тогда
            ДатаНачала = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
            ДатаОкончания = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
        ИначеЕсли НомерМесяца = "1" Тогда // месяц 1
            ДатаНачала = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
            ДатаОкончания = КонецМесяца(ДатаНачала);
        ИначеЕсли НомерМесяца = "2" Тогда // месяц 2
            ДатаНачала = ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета,1);
            ДатаОкончания = КонецМесяца(ДатаНачала);
        ИначеЕсли НомерМесяца = "3" Тогда // месяц 3
            ДатаНачала = ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета,2);
            ДатаОкончания = КонецМесяца(ДатаНачала);
        ИначеЕсли НомерМесяца = "4" Тогда // месяц 4
            ДатаНачала = ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета,3);
            ДатаОкончания = КонецМесяца(ДатаНачала);
        ИначеЕсли НомерМесяца = "5" Тогда // месяц 5
            ДатаНачала = ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета,4);
            ДатаОкончания = КонецМесяца(ДатаНачала);
        ИначеЕсли НомерМесяца = "6" Тогда // месяц 6
            ДатаНачала = ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета,5);
            ДатаОкончания = КонецМесяца(ДатаНачала);
        Иначе // итог или другие ячейки
            ДатаНачала = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
            ДатаОкончания = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
        КонецЕсли;
        
        ПараметрыОтчета.Вставить("Организация",              СтруктураРеквизитовФормы.Организация);
        ПараметрыОтчета.Вставить("ДатаНачалаПериодаОтчета",  ДатаНачала);
        ПараметрыОтчета.Вставить("ДатаКонцаПериодаОтчета",   ДатаОкончания);
        ПараметрыОтчета.Вставить("СписокСтруктурныхЕдиниц",  мСписокСтруктурныхЕдиниц);
        ПараметрыОтчета.Вставить("НалоговыйКомитет",         СтруктураРеквизитовФормы.НалоговыйКомитет);
        ПараметрыОтчета.Вставить("Форма",                    НомерФормы);
        
        ПараметрыОтчета.Вставить("ЗаголовокРасшифровки",     "Расшифровка ""Регламентированный отчет форма " + НомерФормы + """");
        
        Если РегламентированнаяОтчетностьРК.ИндивидуальныйПредприниматель(СтруктураРеквизитовФормы.Организация) Тогда
            ПараметрыОтчета.Вставить("ИндивидуальныйПредприниматель",Истина);
        Иначе
            ПараметрыОтчета.Вставить("ИндивидуальныйПредприниматель",Ложь);
        КонецЕсли;
        
        ДанныеИндивидуальногоПредпринимателя = ДанныеИндивидуальногоПредпринимателя();
        
        Если ДанныеИндивидуальногоПредпринимателя.Найти(ИмяЯчейки) = Неопределено Тогда
            ПараметрыОтчета.Вставить("ЭтоРасшиврофкаИП", Ложь);
        Иначе
            ПараметрыОтчета.Вставить("ЭтоРасшиврофкаИП", Истина);
        КонецЕсли;
        
        ИДИменПоказателей = Новый Массив();
        ИДИменПоказателей.Добавить(ИмяЯчейки);
        
        Если ИмяКоманды = "РасшифроватьПоРаботнику" Тогда
            
            Если НомерФормы = "910.02" Тогда
                ПараметрыОтчета.Вставить("ФизическоеЛицо", П0002100002[НомерСтроки - 1].П000210000202Ссылка);
            ИначеЕсли НомерФормы = "910.01" Тогда
                ПараметрыОтчета.Вставить("ФизическоеЛицо", П0001100002[НомерСтроки - 1].П000110000202Ссылка);
            КонецЕсли;
            
        КонецЕсли;
        
        Если СтрНайти(ИмяЯчейки, "П000020017") > 0 Тогда
            ПараметрыОтчета.Вставить("ТолькоГражданеРК",Истина);
        КонецЕсли; 
        
        ПараметрыОтчета.Вставить("ИмяОтчетаРасшифровки","РегистрНалоговогоУчетаПоИПНиСН");
        ПараметрыОтчета.Вставить("ИДИменПоказателей",ИДИменПоказателей);
        ПараметрыОтчета.Вставить("ИмяСКД","ОсновнаяСхемаКомпоновкиДанных");
        ПараметрыОтчета.Вставить("Строка", Лев(ИмяЯчейки, 10));
        
        ФормаРасшифровки = ПолучитьФорму("ОбщаяФорма.РасшифровкаРегламентированногоОтчетаЗарплата", ПараметрыОтчета);
        
        Если ФормаРасшифровки = Неопределено Тогда
            ПоказатьПредупреждение(, НСтр("ru='Для выбранной ячейки расшифровка не существует.'"),,
            НСтр("ru = 'Расшифровка регламентированных отчетов'"));
        Иначе
            ФормаРасшифровки.Открыть();
        КонецЕсли;
    КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьАдресМакетаСКД(Знач ИмяРаздела, ТекстЗапроса = "", СписокСчетов = Неопределено, СписокКодовСтрок = Неопределено)
    
    ОбщаяСКД = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("МакетСКДФорма9102021Кв1");
    Если ИмяРаздела = Неопределено Тогда
        СхемаКомпоновкиДанных = ОбщаяСКД;
    Иначе
        СхемаКомпоновкиДанных = ОбщаяСКД.ВложенныеСхемыКомпоновкиДанных.Найти(ИмяРаздела).Схема;
    КонецЕсли;
    
    Возврат ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
    
КонецФункции


&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьНомерСтрокиПоЯчейке(ИмяЯчейки, ДлинаНаименованияДоСпецСимвола = 15)
	
	Возврат Сред(ИмяЯчейки, ДлинаНаименованияДоСпецСимвола, СтрДлина(ИмяЯчейки));
	
КонецФункции
	
&НаКлиенте
Процедура ДобавитьПараметр(ЭлементСтруктуры, Знач Поле, Значение, Использовать = Истина) Экспорт
	
	Если ТипЗнч(Поле) = Тип("Строка") Тогда
		Поле = Новый ПараметрКомпоновкиДанных(Поле);
	КонецЕсли;
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("Массив") Тогда
		СтруктураПараметра = Новый Структура("Параметр, Значение, Использование", Поле, Значение, Истина);
		ЭлементСтруктуры.Добавить(СтруктураПараметра);
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОбработкаВыбораЗначений(Результат, ПараметрыВыбора) экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаВыбораЗначенийНаСервере(Результат, ПараметрыВыбора.ИмяЯчейки);

КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораЗначенийНаСервере(Результат, ИмяЯчейки) экспорт
	
	Если ТипЗнч(Результат) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		
		ИИН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Результат, "ИНН");
		
		Если Найти(ИмяЯчейки, "П000210000202") > 0 Тогда
			                                                             
			ЭтаФорма.СтруктураДанныхФорма910_02Страница1.Вставить(СтрЗаменить(ИмяЯчейки, "_", "Ссылка_"), Результат);
			
			Если ЗначениеЗаполнено(ИИН) Тогда
				ЭтотОбъект.ТабличныйДокумент.Области["П000210000203_" + ПолучитьНомерСтрокиПоЯчейке(ИмяЯчейки)].Значение = ИИН;
			КонецЕсли;
			
		ИначеЕсли Найти(ИмяЯчейки, "П000110000202") > 0 Тогда
			
			ЭтаФорма.СтруктураДанныхФорма910_01Страница1.Вставить(СтрЗаменить(ИмяЯчейки, "_", "Ссылка_"), Результат); 
			
			Если ЗначениеЗаполнено(ИИН) Тогда
				ЭтотОбъект.ТабличныйДокумент.Области["П000110000203_" + ПолучитьНомерСтрокиПоЯчейке(ИмяЯчейки)].Значение = ИИН;
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеФЛ = РегламентированнаяОтчетность.ПолучитьФИОФизЛица(Результат, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
		ЭтотОбъект.ТабличныйДокумент.Области[ИмяЯчейки].Значение = СокрЛП(СокрЛП(ДанныеФЛ.Фамилия) + " " + СокрЛП(ДанныеФЛ.Имя) + " " + СокрЛП(ДанныеФЛ.Отчество));
		ЭтотОбъект.ТабличныйДокумент.Области[ИмяЯчейки].Расшифровка = Результат;

	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры
