#Область ПрограммныйИнтерфейс 

Функция ПользовательСогласования(Статья) Экспорт
	
	Результат	= Неопределено;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос	= Новый Запрос; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ФП_ПраваСогласованияЗаявок.Пользователь, НЕОПРЕДЕЛЕНО) КАК Пользователь
	|ИЗ
	|	РегистрСведений.ФП_СоответствиеСтатейФондам.СрезПоследних КАК ФП_СоответствиеСтатейФондамСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФП_ПраваСогласованияЗаявок КАК ФП_ПраваСогласованияЗаявок
	|		ПО ФП_СоответствиеСтатейФондамСрезПоследних.Фонд = ФП_ПраваСогласованияЗаявок.Фонд
	|ГДЕ
	|	ФП_СоответствиеСтатейФондамСрезПоследних.СтатьяДвиженияДенежныхСредств = &Статья"
	;
	
	Запрос.УстановитьПараметр("Статья", Статья);
	
	РезультатЗапроса	= Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда  
		Выборка	= РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат	= Выборка.Пользователь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПользовательОплаты(Статья) Экспорт
	
	Результат	= Неопределено;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос	= Новый Запрос; 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ФП_ПраваКОплатеЗаявок.Пользователь, НЕОПРЕДЕЛЕНО) КАК Пользователь
	|ИЗ
	|	РегистрСведений.ФП_СоответствиеСтатейФондам.СрезПоследних КАК ФП_СоответствиеСтатейФондамСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФП_ПраваКОплатеЗаявок КАК ФП_ПраваКОплатеЗаявок
	|		ПО ФП_СоответствиеСтатейФондамСрезПоследних.Фонд = ФП_ПраваКОплатеЗаявок.Фонд
	|ГДЕ
	|	ФП_СоответствиеСтатейФондамСрезПоследних.СтатьяДвиженияДенежныхСредств = &Статья"
	;
	
	Запрос.УстановитьПараметр("Статья", Статья);
	
	РезультатЗапроса	= Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда  
		Выборка	= РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат	= Выборка.Пользователь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ОтразитьДвиженияФонды(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаФП_ДвиженияФондов = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаФП_ДвиженияФондов;
	
	Если Отказ ИЛИ ТаблицаФП_ДвиженияФондов.Количество() = 0 Тогда
	
		Возврат;
		
	КонецЕсли;
	
	ДвиженияФП_ДвиженияФондов = Движения.ФП_ДвиженияФондов;
	ДвиженияФП_ДвиженияФондов.Записывать = Истина;
	ДвиженияФП_ДвиженияФондов.Загрузить(ТаблицаФП_ДвиженияФондов);
	
КонецПроцедуры

#КонецОбласти