#Область ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура игр_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	игр_ДобавитьКоманды();
	игр_ДобавитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Подключаемый_ВыгрузитьДанныеДляСайта(Команда)
	
	Если Модифицированность ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Необходимо предварительно записать документ';"));
		Возврат;
	КонецЕсли;
		
	СтрокаДанных	= ВыгрузитьДанныеДляСайтаНаСервере();
	
	Диалог	= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	Диалог.Фильтр	= "*.xml|*.xml";
	
	Диалог.Показать(Новый ОписаниеОповещения("ВыгрузитьДанныеДляСайтаВыборФайла_Завершение", ЭтотОбъект, СтрокаДанных));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыгрузитьДанныеДляСайтаВыборФайла_Завершение(Результат, СтрокаДанных) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Текст	= Новый ТекстовыйДокумент;
	Текст.УстановитьТекст(СтрокаДанных);
	Текст.Записать(Результат[0], КодировкаТекста.UTF8);
	
КонецПроцедуры

&НаСервере
Процедура игр_ДобавитьКоманды()
	
	НоваяКоманда			= Команды.Добавить("игр_ВыгрузитьДанныеСкидокДляСайта");
	НоваяКоманда.Заголовок	= НСтр("ru='Выгрузить данные для сайта';");
	НоваяКоманда.Действие	= "Подключаемый_ВыгрузитьДанныеДляСайта";
	
КонецПроцедуры

&НаСервере
Процедура игр_ДобавитьЭлементыФормы()
	
	НовыйЭлемент	= Элементы.Добавить("игр_ВыгрузитьДанныеСкидокДляСайта", Тип("КнопкаФормы"), Элементы.ТоварыКоманднаяПанель);
	НовыйЭлемент.Вид		= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды	= "игр_ВыгрузитьДанныеСкидокДляСайта";
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьДанныеДляСайтаНаСервере()
	
	Возврат Документы.игр_НоменклатураМаркетинговыхАкций.ВыгрузитьДанныеДляСайта(Объект.Ссылка);	
	
КонецФункции

#КонецОбласти
