////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция Счет(УсловныйКодСчета) Экспорт
	
	ПС = ПланыСчетов.Хозрасчетный;
	Результат = ПС.ПустаяСсылка();
	
	Если УсловныйКодСчета = "01" Тогда
		Результат = ПС.ОсновныеСредства;
	ИначеЕсли УсловныйКодСчета = "01.01" Тогда
		Результат = ПС.ОСвОрганизации;
	ИначеЕсли УсловныйКодСчета = "01.03" Тогда
		Результат = ПС.АрендованноеИмущество;
	ИначеЕсли УсловныйКодСчета = "01.08" Тогда
		Результат = ПС.ОСБезГосРегистрации;
	ИначеЕсли УсловныйКодСчета = "01.09" Тогда
		Результат = ПС.ВыбытиеОС;
	ИначеЕсли УсловныйКодСчета = "01.ЦФ" Тогда
		Результат = ПС.ОСвОрганизации_ЦФ;
	ИначеЕсли УсловныйКодСчета = "02" Тогда
		Результат = ПС.АмортизацияОсновныхСредств;
	ИначеЕсли УсловныйКодСчета = "02.01" Тогда
		Результат = ПС.АмортизацияОС_01;
	ИначеЕсли УсловныйКодСчета = "02.02" Тогда
		Результат = ПС.АмортизацияОС_03;
	ИначеЕсли УсловныйКодСчета = "02.03" Тогда
		Результат = ПС.АмортизацияАрендованногоИмущества;
	ИначеЕсли УсловныйКодСчета = "02.ЦФ" Тогда
		Результат = ПС.АмортизацияОС_01_ЦФ;
	ИначеЕсли УсловныйКодСчета = "03" Тогда
		Результат = ПС.ДоходныеВложенияВ_МЦ;
	ИначеЕсли УсловныйКодСчета = "03.01" Тогда
		Результат = ПС.МЦвОрганизации;
	ИначеЕсли УсловныйКодСчета = "03.02" Тогда
		Результат = ПС.МЦ_ПредоставленныеВоВременноеВладение;
	ИначеЕсли УсловныйКодСчета = "03.03" Тогда
		Результат = ПС.МЦ_ПредоставленныеВоВременноеПользование;
	ИначеЕсли УсловныйКодСчета = "03.04" Тогда
		Результат = ПС.ПрочиеДоходныеВложения;
	ИначеЕсли УсловныйКодСчета = "03.09" Тогда
		Результат = ПС.ВыбытиеМЦ;
	ИначеЕсли УсловныйКодСчета = "04" Тогда
		Результат = ПС.НематериальныеАктивы;
	ИначеЕсли УсловныйКодСчета = "04.01" Тогда
		Результат = ПС.НематериальныеАктивыОрганизации;
	ИначеЕсли УсловныйКодСчета = "04.02" Тогда
		Результат = ПС.РасходыНаНИОКР;
	ИначеЕсли УсловныйКодСчета = "05" Тогда
		Результат = ПС.АмортизацияНематериальныхАктивов;
	ИначеЕсли УсловныйКодСчета = "07" Тогда
		Результат = ПС.ОборудованиеКУстановке;
	ИначеЕсли УсловныйКодСчета = "08" Тогда
		Результат = ПС.ВложенияВоВнеоборотныеАктивы;
	ИначеЕсли УсловныйКодСчета = "08.01" Тогда
		Результат = ПС.ПриобретениеЗемельныхУчастков;
	ИначеЕсли УсловныйКодСчета = "08.02" Тогда
		Результат = ПС.ПриобретениеОбъектовПриродопользования;
	ИначеЕсли УсловныйКодСчета = "08.03" Тогда
		Результат = ПС.СтроительствоОбъектовОсновныхСредств;
	ИначеЕсли УсловныйКодСчета = "08.04" Тогда
		Результат = ПС.ПриобретениеОбъектовОсновныхСредств;
	ИначеЕсли УсловныйКодСчета = "08.05" Тогда
		Результат = ПС.ПриобретениеНематериальныхАктивов;
	ИначеЕсли УсловныйКодСчета = "08.06" Тогда
		Результат = ПС.ПереводМолоднякаЖивотныхВОсновноеСтадо;
	ИначеЕсли УсловныйКодСчета = "08.07" Тогда
		Результат = ПС.ПриобретениеВзрослыхЖивотных;
	ИначеЕсли УсловныйКодСчета = "08.08" Тогда
		Результат = ПС.ВыполнениеНИОКР;
	ИначеЕсли УсловныйКодСчета = "08.11" Тогда
		Результат = ПС.НематериальныеПоисковыеАктивы;
	ИначеЕсли УсловныйКодСчета = "08.12" Тогда
		Результат = ПС.МатериальныеПоисковыеАктивы;
	ИначеЕсли УсловныйКодСчета = "09" Тогда
		Результат = ПС.ОтложенныеНалоговыеАктивы;
	ИначеЕсли УсловныйКодСчета = "10" Тогда
		Результат = ПС.Материалы;
	ИначеЕсли УсловныйКодСчета = "11" Тогда
		Результат = ПС.ЖивотныеНаВыращиванииИОткорме;
	ИначеЕсли УсловныйКодСчета = "14" Тогда
		Результат = ПС.РезервыПодСнижениеСтоимостиМЦ;
	ИначеЕсли УсловныйКодСчета = "14.01" Тогда
		Результат = ПС.РезервыПодСнижениеСтоимостиМатериалов;
	ИначеЕсли УсловныйКодСчета = "14.02" Тогда
		Результат = ПС.РезервыПодСнижениеСтоимостиТоваров;
	ИначеЕсли УсловныйКодСчета = "14.03" Тогда
		Результат = ПС.РезервыПодСнижениеСтоимостиГотовойПродукции;
	ИначеЕсли УсловныйКодСчета = "14.04" Тогда
		Результат = ПС.РезервыПодСнижениеСтоимостиНезавершенногоПроизводства;
	ИначеЕсли УсловныйКодСчета = "15" Тогда
		Результат = ПС.ЗаготовлениеИПриобретениеМЦ;
	ИначеЕсли УсловныйКодСчета = "15.01" Тогда
		Результат = ПС.ЗаготовлениеИПриобретениеМатериалов;
	ИначеЕсли УсловныйКодСчета = "15.02" Тогда
		Результат = ПС.ПриобретениеТоваров;
	ИначеЕсли УсловныйКодСчета = "16" Тогда
		Результат = ПС.ОтклонениеВСтоимостиМЦ;
	ИначеЕсли УсловныйКодСчета = "16.01" Тогда
		Результат = ПС.ОтклонениеВСтоимостиМатериалов;
	ИначеЕсли УсловныйКодСчета = "16.02" Тогда
		Результат = ПС.ОтклонениеВСтоимостиТоваров;
	ИначеЕсли УсловныйКодСчета = "19" Тогда
		Результат = ПС.НДСпоПриобретеннымЦенностям;
	ИначеЕсли УсловныйКодСчета = "19.01" Тогда
		Результат = ПС.НДСприПриобретенииОсновныхСредств;
	ИначеЕсли УсловныйКодСчета = "19.02" Тогда
		Результат = ПС.НДСпоПриобретеннымНематериальнымАктивам;
	ИначеЕсли УсловныйКодСчета = "19.03" Тогда
		Результат = ПС.НДСпоПриобретеннымМПЗ;
	ИначеЕсли УсловныйКодСчета = "19.04" Тогда
		Результат = ПС.НДСпоПриобретеннымУслугам;
	ИначеЕсли УсловныйКодСчета = "19.05" Тогда
		Результат = ПС.НДСуплачиваемыйТаможеннымОрганам;
	ИначеЕсли УсловныйКодСчета = "19.06" Тогда
		Результат = ПС.АкцизыПоОплаченнымМатериальнымЦенностям;
	ИначеЕсли УсловныйКодСчета = "19.07" Тогда
		Результат = ПС.НДСПоТоварамРеализованнымПоСтавке0;
	ИначеЕсли УсловныйКодСчета = "19.08" Тогда
		Результат = ПС.НДСприСтроительствеОсновныхСредств;
	ИначеЕсли УсловныйКодСчета = "19.10" Тогда
		Результат = ПС.НДСУплачиваемыйПриИмпортеИзТаможенногоСоюза;
	ИначеЕсли УсловныйКодСчета = "20" Тогда
		Результат = ПС.ОсновноеПроизводство;
	ИначеЕсли УсловныйКодСчета = "21" Тогда
		Результат = ПС.Полуфабрикаты;
	ИначеЕсли УсловныйКодСчета = "23" Тогда
		Результат = ПС.ВспомогательныеПроизводства;
	ИначеЕсли УсловныйКодСчета = "25" Тогда
		Результат = ПС.ОбщепроизводственныеРасходы;
	ИначеЕсли УсловныйКодСчета = "26" Тогда
		Результат = ПС.ОбщехозяйственныеРасходы;
	ИначеЕсли УсловныйКодСчета = "28" Тогда
		Результат = ПС.БракВПроизводстве;
	ИначеЕсли УсловныйКодСчета = "29" Тогда
		Результат = ПС.ОбслуживающиеПроизводства;
	ИначеЕсли УсловныйКодСчета = "41" Тогда
		Результат = ПС.Товары;
	ИначеЕсли УсловныйКодСчета = "41.01" Тогда
		Результат = ПС.ТоварыНаСкладах;
	ИначеЕсли УсловныйКодСчета = "41.02" Тогда
		Результат = ПС.ТоварыВРозничнойТорговле;
	ИначеЕсли УсловныйКодСчета = "41.03" Тогда
		Результат = ПС.ТараПодТоваромИПорожняя;
	ИначеЕсли УсловныйКодСчета = "41.04" Тогда
		Результат = ПС.ПокупныеИзделия;
	ИначеЕсли УсловныйКодСчета = "41.11" Тогда
		Результат = ПС.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ;
	ИначеЕсли УсловныйКодСчета = "41.12" Тогда
		Результат = ПС.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ;
	ИначеЕсли УсловныйКодСчета = "42" Тогда
		Результат = ПС.ТорговаяНаценка;
	ИначеЕсли УсловныйКодСчета = "43" Тогда
		Результат = ПС.ГотоваяПродукция;
	ИначеЕсли УсловныйКодСчета = "44" Тогда
		Результат = ПС.РасходыНаПродажу;
	ИначеЕсли УсловныйКодСчета = "45" Тогда
		Результат = ПС.ТоварыОтгруженные;
	ИначеЕсли УсловныйКодСчета = "45.01" Тогда
		Результат = ПС.ПокупныеТоварыОтгруженные;
	ИначеЕсли УсловныйКодСчета = "45.02" Тогда
		Результат = ПС.ГотоваяПродукцияОтгруженная;
	ИначеЕсли УсловныйКодСчета = "45.03" Тогда
		Результат = ПС.ПрочиеТоварыОтгруженные;
	ИначеЕсли УсловныйКодСчета = "46" Тогда
		Результат = ПС.ВыполненныеЭтапыПоНезавершеннымРаботам;
	ИначеЕсли УсловныйКодСчета = "50" Тогда
		Результат = ПС.Касса;
	ИначеЕсли УсловныйКодСчета = "50.01" Тогда
		Результат = ПС.КассаОрганизации;
	ИначеЕсли УсловныйКодСчета = "50.02" Тогда
		Результат = ПС.ОперационнаяКасса;
	ИначеЕсли УсловныйКодСчета = "50.03" Тогда
		Результат = ПС.ДенежныеДокументы;
	ИначеЕсли УсловныйКодСчета = "50.04" Тогда
		Результат = ПС.КассаПлатежногоАгента;
	ИначеЕсли УсловныйКодСчета = "50.21" Тогда
		Результат = ПС.КассаОрганизацииВал;
	ИначеЕсли УсловныйКодСчета = "50.23" Тогда
		Результат = ПС.ДенежныеДокументыВал;
	ИначеЕсли УсловныйКодСчета = "51" Тогда
		Результат = ПС.РасчетныеСчета;
	ИначеЕсли УсловныйКодСчета = "51.02" Тогда
		Результат = ПС.ОперационнаяКасса;
	ИначеЕсли УсловныйКодСчета = "51.21" Тогда
		Результат = ПС.КассаОрганизацииВал;
	ИначеЕсли УсловныйКодСчета = "52" Тогда
		Результат = ПС.ВалютныеСчета;
	ИначеЕсли УсловныйКодСчета = "55" Тогда
		Результат = ПС.СпециальныеСчета;
	ИначеЕсли УсловныйКодСчета = "55.01" Тогда
		Результат = ПС.Аккредитивы;
	ИначеЕсли УсловныйКодСчета = "55.02" Тогда
		Результат = ПС.ЧековыеКнижки;
	ИначеЕсли УсловныйКодСчета = "55.03" Тогда
		Результат = ПС.ДепозитныеСчета;
	ИначеЕсли УсловныйКодСчета = "55.04" Тогда
		Результат = ПС.ПрочиеСпециальныеСчета;
	ИначеЕсли УсловныйКодСчета = "55.21" Тогда
		Результат = ПС.АккредитивыВал;
	ИначеЕсли УсловныйКодСчета = "55.23" Тогда
		Результат = ПС.ДепозитныеСчетаВал;
	ИначеЕсли УсловныйКодСчета = "55.24" Тогда
		Результат = ПС.ПрочиеСпециальныеСчетаВал;
	ИначеЕсли УсловныйКодСчета = "57" Тогда
		Результат = ПС.ПереводыВПути_;
	ИначеЕсли УсловныйКодСчета = "57.01" Тогда
		Результат = ПС.ПереводыВПути;
	ИначеЕсли УсловныйКодСчета = "57.21" Тогда
		Результат = ПС.ПереводыВПутиВал;
	ИначеЕсли УсловныйКодСчета = "57.02" Тогда
		Результат = ПС.ПриобретениеИностраннойВалюты;
	ИначеЕсли УсловныйКодСчета = "57.22" Тогда
		Результат = ПС.РеализацияИностраннойВалюты;
	ИначеЕсли УсловныйКодСчета = "57.03" Тогда
		Результат = ПС.ПродажиПоПлатежнымКартам;
	ИначеЕсли УсловныйКодСчета = "58.01.1" Тогда
		Результат = ПС.Паи;
	ИначеЕсли УсловныйКодСчета = "58.01.2" Тогда
		Результат = ПС.Акции;
	ИначеЕсли УсловныйКодСчета = "58.02" Тогда
		Результат = ПС.ДолговыеЦенныеБумаги;
	ИначеЕсли УсловныйКодСчета = "58.03" Тогда
		Результат = ПС.ПредоставленныеЗаймы;
	ИначеЕсли УсловныйКодСчета = "58.04" Тогда
		Результат = ПС.ВкладыПоДоговоруПростогоТоварищества;
	ИначеЕсли УсловныйКодСчета = "58.05" Тогда
		Результат = ПС.ПриобретенныеПрава;
	ИначеЕсли УсловныйКодСчета = "59" Тогда
		Результат = ПС.РезервыПодОбесценениеФинансовыхВложений;
	ИначеЕсли УсловныйКодСчета = "60.01" Тогда
		Результат = ПС.РасчетыСПоставщиками;
	ИначеЕсли УсловныйКодСчета = "60.02" Тогда
		Результат = ПС.РасчетыПоАвансамВыданным;
	ИначеЕсли УсловныйКодСчета = "60.03" Тогда
		Результат = ПС.ВекселяВыданные;
	ИначеЕсли УсловныйКодСчета = "60.21" Тогда
		Результат = ПС.РасчетыСПоставщикамиВал;
	ИначеЕсли УсловныйКодСчета = "60.22" Тогда
		Результат = ПС.РасчетыПоАвансамВыданнымВал;
	ИначеЕсли УсловныйКодСчета = "60.31" Тогда
		Результат = ПС.РасчетыСПоставщикамиУЕ;
	ИначеЕсли УсловныйКодСчета = "60.32" Тогда
		Результат = ПС.РасчетыПоАвансамВыданнымУЕ;
	ИначеЕсли УсловныйКодСчета = "60.НП" Тогда
		Результат = ПС.ОбязательстваПоНеотфактурованнымПоставкам;
	ИначеЕсли УсловныйКодСчета = "62.01" Тогда
		Результат = ПС.РасчетыСПокупателями;
	ИначеЕсли УсловныйКодСчета = "62.02" Тогда
		Результат = ПС.РасчетыПоАвансамПолученным;
	ИначеЕсли УсловныйКодСчета = "62.03" Тогда
		Результат = ПС.ВекселяПолученные;
	ИначеЕсли УсловныйКодСчета = "62.21" Тогда
		Результат = ПС.РасчетыСПокупателямиВал;
	ИначеЕсли УсловныйКодСчета = "62.22" Тогда
		Результат = ПС.РасчетыПоАвансамПолученнымВал;
	ИначеЕсли УсловныйКодСчета = "62.31" Тогда
		Результат = ПС.РасчетыСПокупателямиУЕ;
	ИначеЕсли УсловныйКодСчета = "62.32" Тогда
		Результат = ПС.РасчетыПоАвансамПолученнымУЕ;
	ИначеЕсли УсловныйКодСчета = "63" Тогда
		Результат = ПС.РезервыПоСомнительнымДолгам;
	ИначеЕсли УсловныйКодСчета = "66" Тогда
		Результат = ПС.РасчетыПоКраткосрочнымКредитамИЗаймам;
	ИначеЕсли УсловныйКодСчета = "66.01" Тогда
		Результат = ПС.КраткосрочныеКредиты;
	ИначеЕсли УсловныйКодСчета = "66.02" Тогда
		Результат = ПС.ПроцентыПоКраткосрочнымКредитам;
	ИначеЕсли УсловныйКодСчета = "66.03" Тогда
		Результат = ПС.КраткосрочныеЗаймы;
	ИначеЕсли УсловныйКодСчета = "66.04" Тогда
		Результат = ПС.ПроцентыПоКраткосрочнымЗаймам;
	ИначеЕсли УсловныйКодСчета = "66.21" Тогда
		Результат = ПС.КраткосрочныеКредитыВал;
	ИначеЕсли УсловныйКодСчета = "66.22" Тогда
		Результат = ПС.ПроцентыПоКраткосрочнымКредитамВал;
	ИначеЕсли УсловныйКодСчета = "66.23" Тогда
		Результат = ПС.КраткосрочныеЗаймыВал;
	ИначеЕсли УсловныйКодСчета = "66.24" Тогда
		Результат = ПС.ПроцентыПоКраткосрочнымЗаймамВал;
	ИначеЕсли УсловныйКодСчета = "67" Тогда
		Результат = ПС.РасчетыПоДолгосрочнымКредитамИЗаймам;
	ИначеЕсли УсловныйКодСчета = "67.01" Тогда
		Результат = ПС.ДолгосрочныеКредиты;
	ИначеЕсли УсловныйКодСчета = "67.02" Тогда
		Результат = ПС.ПроцентыПоДолгосрочнымКредитам;
	ИначеЕсли УсловныйКодСчета = "67.03" Тогда
		Результат = ПС.ДолгосрочныеЗаймы;
	ИначеЕсли УсловныйКодСчета = "67.04" Тогда
		Результат = ПС.ПроцентыПоДолгосрочнымЗаймам;
	ИначеЕсли УсловныйКодСчета = "67.21" Тогда
		Результат = ПС.ДолгосрочныеКредитыВал;
	ИначеЕсли УсловныйКодСчета = "67.22" Тогда
		Результат = ПС.ПроцентыПоДолгосрочнымКредитамВал;
	ИначеЕсли УсловныйКодСчета = "67.23" Тогда
		Результат = ПС.ДолгосрочныеЗаймыВал;
	ИначеЕсли УсловныйКодСчета = "67.24" Тогда
		Результат = ПС.ПроцентыПоДолгосрочнымЗаймамВал;
	ИначеЕсли УсловныйКодСчета = "68" Тогда
		Результат = ПС.РасчетыПоНалогам;
	ИначеЕсли УсловныйКодСчета = "68.01" Тогда
		Результат = ПС.НДФЛ;
	ИначеЕсли УсловныйКодСчета = "68.02" Тогда
		Результат = ПС.НДС;
	ИначеЕсли УсловныйКодСчета = "68.03" Тогда
		Результат = ПС.Акцизы;
	ИначеЕсли УсловныйКодСчета = "68.04" Тогда
		Результат = ПС.НалогНаПрибыль;
	ИначеЕсли УсловныйКодСчета = "68.04.1" Тогда
		Результат = ПС.РасчетыСБюджетом;
	ИначеЕсли УсловныйКодСчета = "68.04.2" Тогда
		Результат = ПС.РасчетНалогаНаПрибыль;
	ИначеЕсли УсловныйКодСчета = "68.06" Тогда
		Результат = ПС.ЗемельныйНалог;
	ИначеЕсли УсловныйКодСчета = "68.07" Тогда
		Результат = ПС.ТранспортныйНалог;
	ИначеЕсли УсловныйКодСчета = "68.08" Тогда
		Результат = ПС.НалогНаИмущество;
	ИначеЕсли УсловныйКодСчета = "68.09" Тогда
		Результат = ПС.НалогНаРекламу;
	ИначеЕсли УсловныйКодСчета = "68.10" Тогда
		Результат = ПС.ПрочиеНалогиИСборы;
	ИначеЕсли УсловныйКодСчета = "68.11" Тогда
		Результат = ПС.ЕНВД;
	ИначеЕсли УсловныйКодСчета = "68.12" Тогда
		Результат = ПС.ЕНприУСН;
	ИначеЕсли УсловныйКодСчета = "68.13" Тогда
		Результат = ПС.ТорговыйСбор;
	ИначеЕсли УсловныйКодСчета = "68.21" Тогда
		Результат = ПС.НДФЛ_ИП;
	ИначеЕсли УсловныйКодСчета = "68.22" Тогда
		Результат = ПС.НДСпоЭкспортуКВозмещению;
	ИначеЕсли УсловныйКодСчета = "68.32" Тогда
		Результат = ПС.НДСНалоговогоАгента;
	ИначеЕсли УсловныйКодСчета = "68.42" Тогда
		Результат = ПС.НДСТаможенныйСоюзКУплате;
	ИначеЕсли УсловныйКодСчета = "68.52" Тогда
		Результат = ПС.НДСНалоговогоАгентаПоОтдельнымВидамТоваров;
	ИначеЕсли УсловныйКодСчета = "69" Тогда
		Результат = ПС.РасчетыПоСоциальномуСтрахованию;
	ИначеЕсли УсловныйКодСчета = "69.01" Тогда
		Результат = ПС.ФСС;
	ИначеЕсли УсловныйКодСчета = "69.02" Тогда
		Результат = ПС.ПФР;
	ИначеЕсли УсловныйКодСчета = "69.02.1" Тогда
		Результат = ПС.ПФР_страх;
	ИначеЕсли УсловныйКодСчета = "69.02.2" Тогда
		Результат = ПС.ПФР_нак;
	ИначеЕсли УсловныйКодСчета = "69.02.3" Тогда
		Результат = ПС.ПФР_доп;
	ИначеЕсли УсловныйКодСчета = "69.02.4" Тогда
		Результат = ПС.ПФР_доп_шахтеры;
	ИначеЕсли УсловныйКодСчета = "69.02.5" Тогда
		Результат = ПС.ПФР_доп_ВредныеУсловияТруда;
	ИначеЕсли УсловныйКодСчета = "69.02.6" Тогда
		Результат = ПС.ПФР_доп_ТяжелыеУсловияТруда;
	ИначеЕсли УсловныйКодСчета = "69.02.7" Тогда
		Результат = ПС.ПФР_ОПС;
	ИначеЕсли УсловныйКодСчета = "69.03" Тогда
		Результат = ПС.ФОМС;
	ИначеЕсли УсловныйКодСчета = "69.03.1" Тогда
		Результат = ПС.ФФОМС;
	ИначеЕсли УсловныйКодСчета = "69.03.2" Тогда
		Результат = ПС.ТФОМС;
	ИначеЕсли УсловныйКодСчета = "69.04" Тогда
		Результат = ПС.ЕСН_ФБ;
	ИначеЕсли УсловныйКодСчета = "69.05" Тогда
		Результат = ПС.ПФР_ДОБР;
	ИначеЕсли УсловныйКодСчета = "69.05.1" Тогда
		Результат = ПС.ПФР_ДОБР_орг;
	ИначеЕсли УсловныйКодСчета = "69.05.2" Тогда
		Результат = ПС.ПФР_ДОБР_сотр;
	ИначеЕсли УсловныйКодСчета = "69.06.1" Тогда
		Результат = ПС.ПФР_Страх_СтраховойГод;
	ИначеЕсли УсловныйКодСчета = "69.06.2" Тогда
		Результат = ПС.ПФР_Нак_СтраховойГод;
	ИначеЕсли УсловныйКодСчета = "69.06.3" Тогда
		Результат = ПС.ФОМС_СтраховойГод;
	ИначеЕсли УсловныйКодСчета = "69.06.4" Тогда
		Результат = ПС.ФСС_СтраховойГод;
	ИначеЕсли УсловныйКодСчета = "69.06.5" Тогда
		Результат = ПС.ПФР_ОПС_ИП;
	ИначеЕсли УсловныйКодСчета = "69.11" Тогда
		Результат = ПС.ФСС_НСиПЗ;
	ИначеЕсли УсловныйКодСчета = "69.12" Тогда
		Результат = ПС.ФСС_ДобровольныеВзносы;
	ИначеЕсли УсловныйКодСчета = "69.13" Тогда
		Результат = ПС.ФСС_СПЕЦ;
	ИначеЕсли УсловныйКодСчета = "69.13.1" Тогда
		Результат = ПС.ФСС_СПЕЦ_ЕНВД;
	ИначеЕсли УсловныйКодСчета = "69.13.2" Тогда
		Результат = ПС.ФСС_СПЕЦ_УСН;
	ИначеЕсли УсловныйКодСчета = "70" Тогда
		Результат = ПС.РасчетыСПерсоналомПоОплатеТруда;
	ИначеЕсли УсловныйКодСчета = "71" Тогда
		Результат = ПС.РасчетыСПодотчетнымиЛицами_;
	ИначеЕсли УсловныйКодСчета = "71.01" Тогда
		Результат = ПС.РасчетыСПодотчетнымиЛицами;
	ИначеЕсли УсловныйКодСчета = "71.21" Тогда
		Результат = ПС.РасчетыСПодотчетнымиЛицамиВал;
	ИначеЕсли УсловныйКодСчета = "73" Тогда
		Результат = ПС.РасчетыСПерсоналомПоПрочимОперациям;
	ИначеЕсли УсловныйКодСчета = "73.01" Тогда
		Результат = ПС.РасчетыПоПредоставленнымЗаймам;
	ИначеЕсли УсловныйКодСчета = "73.02" Тогда
		Результат = ПС.РасчетыПоВозмещениюМатериальногоУщерба;
	ИначеЕсли УсловныйКодСчета = "73.03" Тогда
		Результат = ПС.РасчетыПоПрочимОперациям;
	ИначеЕсли УсловныйКодСчета = "75.01" Тогда
		Результат = ПС.РасчетыПоВкладамВУставныйКапитал;
	ИначеЕсли УсловныйКодСчета = "75.02" Тогда
		Результат = ПС.РасчетыПоВыплатеДоходов;
	ИначеЕсли УсловныйКодСчета = "76" Тогда
		Результат = ПС.РасчетыСРазнымиДебиторамиИКредиторами;
	ИначеЕсли УсловныйКодСчета = "76.01" Тогда
		Результат = ПС.РасчетыПоИмущественномуЛичномуИДобровольномуСтрахованию;
	ИначеЕсли УсловныйКодСчета = "76.01.1" Тогда
		Результат = ПС.РасчетыПоИмущественномуИЛичномуСтрахованию;
	ИначеЕсли УсловныйКодСчета = "76.01.2" Тогда
		Результат = ПС.ПлатежиПоДобровольномуСтрахованиюРаботников;
	ИначеЕсли УсловныйКодСчета = "76.01.9" Тогда
		Результат = ПС.ПлатежиПоПрочимВидамСтрахования;
	ИначеЕсли УсловныйКодСчета = "76.02" Тогда
		Результат = ПС.РасчетыПоПретензиям;
	ИначеЕсли УсловныйКодСчета = "76.03" Тогда
		Результат = ПС.РасчетыПоПричитающимсяДивидендам;
	ИначеЕсли УсловныйКодСчета = "76.04" Тогда
		Результат = ПС.РасчетыПоДепонированнымСуммам;
	ИначеЕсли УсловныйКодСчета = "76.05" Тогда
		Результат = ПС.РасчетыСПрочимиПоставщикамиИПодрядчиками;
	ИначеЕсли УсловныйКодСчета = "76.06" Тогда
		Результат = ПС.РасчетыСПрочимиПокупателямиИЗаказчиками;
	ИначеЕсли УсловныйКодСчета = "76.07.1" Тогда
		Результат = ПС.АрендныеОбязательства;
	ИначеЕсли УсловныйКодСчета = "76.07.2" Тогда
		Результат = ПС.ЛизинговыеПлатежи;
	ИначеЕсли УсловныйКодСчета = "76.07.3" Тогда
		Результат = ПС.АвансыПоАренде;
	ИначеЕсли УсловныйКодСчета = "76.07.4" Тогда
		Результат = ПС.ВыкупЛизинговогоИмущества;
	ИначеЕсли УсловныйКодСчета = "76.07.9" Тогда
		Результат = ПС.НДСпоАренднымОбязательствам;
	ИначеЕсли УсловныйКодСчета = "76.09" Тогда
		Результат = ПС.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
	ИначеЕсли УсловныйКодСчета = "76.21" Тогда
		Результат = ПС.РасчетыПоИмущественномуИЛичномуСтрахованиюВал;
	ИначеЕсли УсловныйКодСчета = "76.22" Тогда
		Результат = ПС.РасчетыПоПретензиямВал;
	ИначеЕсли УсловныйКодСчета = "76.25" Тогда
		Результат = ПС.РасчетыСПрочимиПоставщикамиИПодрядчикамиВал;
	ИначеЕсли УсловныйКодСчета = "76.26" Тогда
		Результат = ПС.РасчетыСПрочимиПокупателямиИЗаказчикамиВал;
	ИначеЕсли УсловныйКодСчета = "76.29" Тогда
		Результат = ПС.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиВал;
	ИначеЕсли УсловныйКодСчета = "76.32" Тогда
		Результат = ПС.РасчетыПоПретензиямУЕ;
	ИначеЕсли УсловныйКодСчета = "76.35" Тогда
		Результат = ПС.РасчетыСПрочимиПоставщикамиИПодрядчикамиУЕ;
	ИначеЕсли УсловныйКодСчета = "76.36" Тогда
		Результат = ПС.РасчетыСПрочимиПокупателямиИЗаказчикамиУЕ;
	ИначеЕсли УсловныйКодСчета = "76.39" Тогда
		Результат = ПС.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиУЕ;
	ИначеЕсли УсловныйКодСчета = "76.41" Тогда
		Результат = ПС.РасчетыПоИсполнительнымДокументамРаботников;
	ИначеЕсли УсловныйКодСчета = "76.49" Тогда
		Результат = ПС.РасчетыПоПрочимУдержаниямРаботников;
	ИначеЕсли УсловныйКодСчета = "76.ВА" Тогда
		Результат = ПС.НДСпоАвансамИПредоплатамВыданным;
	ИначеЕсли УсловныйКодСчета = "76.АВ" Тогда
		Результат = ПС.НДСпоАвансамИПредоплатам;
	ИначеЕсли УсловныйКодСчета = "76.К" Тогда
		Результат = ПС.КорректировкаРасчетовПрошлогоПериода;
	ИначеЕсли УсловныйКодСчета = "76.Н" Тогда
		Результат = ПС.РасчетыПоНДСотложенномуДляУплатыВБюджет;
	ИначеЕсли УсловныйКодСчета = "76.НА" Тогда
		Результат = ПС.РасчетыНДСНалоговогоАгента;
	ИначеЕсли УсловныйКодСчета = "76.ОТ" Тогда
		Результат = ПС.НДСНачисленныйПоОтгрузке;
	ИначеЕсли УсловныйКодСчета = "77" Тогда
		Результат = ПС.ОтложенныеНалоговыеОбязательства;
	ИначеЕсли УсловныйКодСчета = "79" Тогда
		Результат = ПС.ВнутрихозяйственныеРасчеты;
	ИначеЕсли УсловныйКодСчета = "80" Тогда
		Результат = ПС.УставныйКапитал;
	ИначеЕсли УсловныйКодСчета = "81" Тогда
		Результат = ПС.СобственныеАкции;
	ИначеЕсли УсловныйКодСчета = "82" Тогда
		Результат = ПС.РезервныйКапитал;
	ИначеЕсли УсловныйКодСчета = "82.01" Тогда
		Результат = ПС.РезервыОбразованныеВСоответствииСЗаконодательством;
	ИначеЕсли УсловныйКодСчета = "82.02" Тогда
		Результат = ПС.РезервыОбразованныеВСоответствииСУчредительнымиДокументами;
	ИначеЕсли УсловныйКодСчета = "83" Тогда
		Результат = ПС.ДобавочныйКапитал;
	ИначеЕсли УсловныйКодСчета = "83.01" Тогда
		Результат = ПС.ПриростСтоимостиПоПереоценке;
	ИначеЕсли УсловныйКодСчета = "83.01.1" Тогда
		Результат = ПС.ПриростСтоимостиИмуществаПоПереоценке;
	ИначеЕсли УсловныйКодСчета = "83.01.2" Тогда
		Результат = ПС.ПриростСтоимостиНМАПоПереоценке;
	ИначеЕсли УсловныйКодСчета = "83.01.3" Тогда
		Результат = ПС.ПриростСтоимостиПрочихВнеоборотныхАктивоПоПереоценке;
	ИначеЕсли УсловныйКодСчета = "84" Тогда
		Результат = ПС.НераспределеннаяПрибыль;
	ИначеЕсли УсловныйКодСчета = "84.01" Тогда
		Результат = ПС.ПрибыльПодлежащаяРаспределению;
	ИначеЕсли УсловныйКодСчета = "84.02" Тогда
		Результат = ПС.УбытокПодлежащийПокрытию;
	ИначеЕсли УсловныйКодСчета = "86" Тогда
		Результат = ПС.ЦелевоеФинансирование;
	ИначеЕсли УсловныйКодСчета = "90"Тогда
		Результат = ПС.Продажи;
	ИначеЕсли УсловныйКодСчета = "90.01" Тогда
		Результат = ПС.Выручка;
	ИначеЕсли УсловныйКодСчета = "90.02" Тогда
		Результат = ПС.СебестоимостьПродаж;
	ИначеЕсли УсловныйКодСчета = "90.03" Тогда
		Результат = ПС.Продажи_НДС;
	ИначеЕсли УсловныйКодСчета = "90.04" Тогда
		Результат = ПС.Продажи_Акцизы;
	ИначеЕсли УсловныйКодСчета = "90.05" Тогда
		Результат = ПС.Продажи_ЭкспортныеПошлины;
	ИначеЕсли УсловныйКодСчета = "90.08" Тогда
		Результат = ПС.Продажи_УправленческиеРасходы;
	ИначеЕсли УсловныйКодСчета = "90.07" Тогда
		Результат = ПС.Продажи_РасходыНаПродажу;
	ИначеЕсли УсловныйКодСчета = "90.01.1" Тогда
		Результат = ПС.ВыручкаНеЕНВД;
	ИначеЕсли УсловныйКодСчета = "90.01.2" Тогда
		Результат = ПС.ВыручкаЕНВД;
	ИначеЕсли УсловныйКодСчета = "90.02.1" Тогда
		Результат = ПС.СебестоимостьПродажНеЕНВД;
	ИначеЕсли УсловныйКодСчета = "90.02.2" Тогда
		Результат = ПС.СебестоимостьПродажЕНВД;
	ИначеЕсли УсловныйКодСчета = "90.07.1" Тогда
		Результат = ПС.Продажи_РасходыНаПродажуНеЕНВД;
	ИначеЕсли УсловныйКодСчета = "90.07.2" Тогда
		Результат = ПС.Продажи_РасходыНаПродажуЕНВД;
	ИначеЕсли УсловныйКодСчета = "90.08.1" Тогда
		Результат = ПС.Продажи_УправленческиеРасходыНеЕНВД;
	ИначеЕсли УсловныйКодСчета = "90.08.2" Тогда
		Результат = ПС.Продажи_УправленческиеРасходыЕНВД;
	ИначеЕсли УсловныйКодСчета = "91" Тогда
		Результат = ПС.ПрочиеДоходыИРасходы;
	ИначеЕсли УсловныйКодСчета = "91.01" Тогда
		Результат = ПС.ПрочиеДоходы;
	ИначеЕсли УсловныйКодСчета = "91.02" Тогда
		Результат = ПС.ПрочиеРасходы;
	ИначеЕсли УсловныйКодСчета = "99" Тогда
		Результат = ПС.ПрибылиИУбытки;
	ИначеЕсли УсловныйКодСчета = "99.01" Тогда
		Результат = ПС.ПрибылиИУбыткиБезНалогаНаПрибыль;
	ИначеЕсли УсловныйКодСчета = "99.02" Тогда
		Результат = ПС.ПрибылиИУбытки_НалогНаПрибыль;
	ИначеЕсли УсловныйКодСчета = "99.02.3" Тогда
		Результат = ПС.ПостоянноеНалоговоеОбязательство;
	ИначеЕсли УсловныйКодСчета = "99.02.4" Тогда
		Результат = ПС.ПрибылиИУбыткиОтПересчетаОНА_ОНО;
	ИначеЕсли УсловныйКодСчета = "99.01.1" Тогда
		Результат = ПС.ПрибылиИУбыткиНеЕНВД;
	ИначеЕсли УсловныйКодСчета = "99.01.2" Тогда
		Результат = ПС.ПрибылиИУбыткиЕНВД;
	ИначеЕсли УсловныйКодСчета = "99.09" Тогда
		Результат = ПС.ПрочиеПрибылиИУбытки;
	ИначеЕсли УсловныйКодСчета = "94" Тогда
		Результат = ПС.НедостачиИПотериОтПорчиЦенностей;
	ИначеЕсли УсловныйКодСчета = "96" Тогда
		Результат = ПС.РезервыПредстоящихРасходов;
	ИначеЕсли УсловныйКодСчета = "96.01" Тогда
		Результат = ПС.ОценочныеОбязательстваПоВознаграждениямРаботникам;
	ИначеЕсли УсловныйКодСчета = "96.01.1" Тогда
		Результат = ПС.ОценочныеОбязательстваПоВознаграждениям;
	ИначеЕсли УсловныйКодСчета = "96.01.2" Тогда
		Результат = ПС.ОценочныеОбязательстваПостраховымВзносам;
	ИначеЕсли УсловныйКодСчета = "96.09" Тогда
		Результат = ПС.РезервыПредстоящихРасходовПрочие;
	ИначеЕсли УсловныйКодСчета = "97" Тогда
		Результат = ПС.РасходыБудущихПериодов;
	ИначеЕсли УсловныйКодСчета = "98" Тогда
		Результат = ПС.ДоходыБудущихПериодов;
	ИначеЕсли УсловныйКодСчета = "98.01" Тогда
		Результат = ПС.ДоходыПолученныеВСчетБудущихПериодов;
	ИначеЕсли УсловныйКодСчета = "98.02" Тогда
		Результат = ПС.БезвозмездныеПоступления;
	ИначеЕсли УсловныйКодСчета = "98.03" Тогда
		Результат = ПС.ПредстоящиеПоступленияПоНедостачамВыявленнымЗаПрошлыеГоды;
	ИначеЕсли УсловныйКодСчета = "98.04" Тогда
		Результат = ПС.РазницаМеждуСуммойПодлежащейВзысканиюСВиновныхЛицИБалансовойСтоимостьюПоНедостачамЦенностей;
	ИначеЕсли УсловныйКодСчета = "001" Тогда
		Результат = ПС.АрендованныеОсновныеСредства;
	ИначеЕсли УсловныйКодСчета = "008" Тогда
		Результат = ПС.ОбеспеченияОбязательствПолученные;
	ИначеЕсли УсловныйКодСчета = "009" Тогда
		Результат = ПС.ОбеспеченияОбязательствВыданные;
	ИначеЕсли УсловныйКодСчета = "011" Тогда
		Результат = ПС.ОсновныеСредстваСданныеВАренду;
	ИначеЕсли УсловныйКодСчета = "1000" Тогда
		Результат = ПС.ДенежныеСредства;	
	ИначеЕсли УсловныйКодСчета = "1010" Тогда
		Результат = ПС.ДенежныеСредстваВКассе;
	ИначеЕсли УсловныйКодСчета = "1020" Тогда
		Результат = ПС.ДенежныеСредстваВПути_;
	ИначеЕсли УсловныйКодСчета = "1021" Тогда
		Результат = ПС.ДенежныеСредстваВПути;
	ИначеЕсли УсловныйКодСчета = "1022" Тогда
		Результат = ПС.ДенежныеСредстваВПутиКонвертацияВалюты;
	ИначеЕсли УсловныйКодСчета = "1023" Тогда
		Результат = ПС.ОперационнаяКасса;
	ИначеЕсли УсловныйКодСчета = "1024" Тогда
		Результат = ПС.ДенежныеСредстваВПутиКассы;
	ИначеЕсли УсловныйКодСчета = "1025" Тогда
		Результат = ПС.ПродажиПоПлатежнымКартам;
	ИначеЕсли УсловныйКодСчета = "1030" Тогда
		Результат = ПС.ДенежныеСредстваНаТекущихБанковскихСчетах;
	ИначеЕсли УсловныйКодСчета = "Я104" Тогда
		Результат = ПС.ДенежныеСредстваНаКартСчетах;	
	ИначеЕсли УсловныйКодСчета = "1040" Тогда
		Результат = ПС.ДенежныеСредстваНаКорреспондентскихСчетах;
	ИначеЕсли УсловныйКодСчета = "1050" Тогда
		Результат = ПС.ДенежныеСредстваНаСберегательныхСчетах;
	ИначеЕсли УсловныйКодСчета = "1060" Тогда
		Результат = ПС.ДенежныеСредстваОграниченныеВИспользовании;
	ИначеЕсли УсловныйКодСчета = "1070" Тогда
		Результат = ПС.УчетЭлектронныхДенежныхСредств;
	ИначеЕсли УсловныйКодСчета = "1080" Тогда
		Результат = ПС.ПрочиеДенежныеСредства;
	ИначеЕсли УсловныйКодСчета = "1090" Тогда
		Результат = ПС.ОценочныйРезервПодУбыткиОтОбесцененияДенежныхСредств;
	ИначеЕсли УсловныйКодСчета = "1100" Тогда
		Результат = ПС.КраткосрочныеФинансовыеИнвестиции;
	ИначеЕсли УсловныйКодСчета = "Я111" Тогда
		Результат = ПС.КраткосрочныеПредоставленныеЗаймы;
	ИначеЕсли УсловныйКодСчета = "Я112" Тогда
		Результат = ПС.КраткосрочныеФинансовыеАктивыПредназначенныеДляТорговли;
	ИначеЕсли УсловныйКодСчета = "Я113" Тогда
		Результат = ПС.КраткосрочныеИнвестицииУдерживаемыеДоПогашения;
	ИначеЕсли УсловныйКодСчета = "Я114" Тогда
		Результат = ПС.КраткосрочныеФинансовыеИнвестицииДляПродажи;
	ИначеЕсли УсловныйКодСчета = "1110" Тогда
		Результат = ПС.КраткосрочныеФинансовыеАктивыОцениваемыеПоАмортизированнойСтоимости;
	ИначеЕсли УсловныйКодСчета = "1120" Тогда
		Результат = ПС.КраткосрочныеФинансовыеАктивыОцениваемыеПоСправедливойСтоимостиЧерезПрочийСовокупныйДоход;
	ИначеЕсли УсловныйКодСчета = "1130" Тогда
		Результат = ПС.КраткосрочныеФинансовыеАктивыОцениваемыеПоСправедливойСтоимостиЧерезПрибыльУбыток;
	ИначеЕсли УсловныйКодСчета = "1140" Тогда
		Результат = ПС.КраткосрочныеДебиторскиеПроизводныеФинансовыеИнструменты;	
	ИначеЕсли УсловныйКодСчета = "1150" Тогда
		Результат = ПС.КраткосрочныеВознагражденияКПолучению;	
	ИначеЕсли УсловныйКодСчета = "1160" Тогда
		Результат = ПС.ПрочиеКраткосрочныеФинансовыеИнвестиции_;
	ИначеЕсли УсловныйКодСчета = "1161" Тогда
		Результат = ПС.ПрочиеКраткосрочныеФинансовыеИнвестиции;
	ИначеЕсли УсловныйКодСчета = "1162" Тогда
		Результат = ПС.ДенежныеДокументы;
	ИначеЕсли УсловныйКодСчета = "1163" Тогда
		Результат = ПС.ДенежныеДокументыВал;
	ИначеЕсли УсловныйКодСчета = "1170" Тогда
		Результат = ПС.ОценочныйРезервПодУбыткиПоКраткосрочнымФинансовымАктивам;
	ИначеЕсли УсловныйКодСчета = "1200" Тогда
		Результат = ПС.ДенежныеДокументыВал;
	ИначеЕсли УсловныйКодСчета = "1210" Тогда
		Результат = ПС.КраткосрочнаяДебиторскаяЗадолженностьПокупателейИЗаказчиков;
	ИначеЕсли УсловныйКодСчета = "1220" Тогда
		Результат = ПС.КраткосрочнаяДебиторскаяЗадолженностьДочернихОрганизаций;
	ИначеЕсли УсловныйКодСчета = "1230" Тогда
		Результат = ПС.КраткосрочнаяДебиторскаяЗадолженностьАссоциированныхИСовместныхОрганизаций;
	ИначеЕсли УсловныйКодСчета = "1240" Тогда
		Результат = ПС.КраткосрочнаяДебиторскаяЗадолженностьФилиаловИСтруктурныхПодразделений;
	ИначеЕсли УсловныйКодСчета = "1250" Тогда
		Результат = ПС.КраткосрочнаяДебиторскаяЗадолженностьРаботников;
	ИначеЕсли УсловныйКодСчета = "1251" Тогда
		Результат = ПС.РасчетыСПодотчетнымиЛицами;
	ИначеЕсли УсловныйКодСчета = "1252" Тогда
		Результат = ПС.РасчетыСПодотчетнымиЛицамиВал;
	ИначеЕсли УсловныйКодСчета = "1253" Тогда
		Результат = ПС.КраткосрочнаяЗадолженностьПоВыплаченнойЗаработнойПлате;
	ИначеЕсли УсловныйКодСчета = "1254" Тогда
		Результат = ПС.РасчетыПоПредоставленнымЗаймам;
	ИначеЕсли УсловныйКодСчета = "1255" Тогда
		Результат = ПС.РасчетыПоПрочимОперациям;
	ИначеЕсли УсловныйКодСчета = "1260" Тогда
		Результат = ПС.КраткосрочнаяДебиторскаяЗадолженностьПоАренде;
	ИначеЕсли УсловныйКодСчета = "1270" Тогда
		Результат = ПС.ПрочаяКраткосрочнаяДебиторскаяЗадолженность_;
	ИначеЕсли УсловныйКодСчета = "1271" Тогда
		Результат = ПС.КраткосрочнаяЗадолженностьПоВозвратамИПретензиямПоставщикам;
	ИначеЕсли УсловныйКодСчета = "1272" Тогда
		Результат = ПС.КраткосрочнаяЗадолженностьПоВыявленнымНедостачамТМЗ;
	ИначеЕсли УсловныйКодСчета = "1273" Тогда
		Результат = ПС.РасчетыСРозничнымиПокупателями;
	ИначеЕсли УсловныйКодСчета = "1274" Тогда
		Результат = ПС.ПрочаяКраткосрочнаяДебиторскаяЗадолженность;
	ИначеЕсли УсловныйКодСчета = "1280" Тогда
		Результат = ПС.РезервыПоСомнительнымДолгам;
	ИначеЕсли УсловныйКодСчета = "1300" Тогда
		Результат = ПС.Запасы;
	ИначеЕсли УсловныйКодСчета = "1310" Тогда
		Результат = ПС.СырьеИМатериалы;
	ИначеЕсли УсловныйКодСчета = "1320" Тогда
		Результат = ПС.ГотоваяПродукция;
	ИначеЕсли УсловныйКодСчета = "1330" Тогда
		Результат = ПС.Товары;
	ИначеЕсли УсловныйКодСчета = "1340" Тогда
		Результат = ПС.НезавершенноеПроизводство;
	ИначеЕсли УсловныйКодСчета = "1341" Тогда
		Результат = ПС.НезавершенноеПроизводство_ОсновноеПроизводство;
	ИначеЕсли УсловныйКодСчета = "1342" Тогда
		Результат = ПС.НезавершенноеПроизводство_Полуфабрикаты;
	ИначеЕсли УсловныйКодСчета = "1343" Тогда
		Результат = ПС.НезавершенноеПроизводство_ВспомогательныеПроизводства;
	ИначеЕсли УсловныйКодСчета = "1350" Тогда
		Результат = ПС.ПрочиеЗапасы;
	ИначеЕсли УсловныйКодСчета = "1351" Тогда
		Результат = ПС.МатериалыПереданныеВПереработку;
	ИначеЕсли УсловныйКодСчета = "1352" Тогда
		Результат = ПС.ТараПереданная;
	ИначеЕсли УсловныйКодСчета = "1353" Тогда
		Результат = ПС.ТоварыОтгруженные;
	ИначеЕсли УсловныйКодСчета = "1353.1" Тогда
		Результат = ПС.ПокупныеТоварыОтгруженные;
	ИначеЕсли УсловныйКодСчета = "1353.2" Тогда
		Результат = ПС.ГотоваяПродукцияОтгруженная;
	ИначеЕсли УсловныйКодСчета = "1353.3" Тогда
		Результат = ПС.ПрочиеТоварыОтгруженные;
	ИначеЕсли УсловныйКодСчета = "1354" Тогда
		Результат = ПС.СпецоснасткаИСпецодеждаВЭксплуатации;
	ИначеЕсли УсловныйКодСчета = "1354.1" Тогда
		Результат = ПС.СпецодеждаВЭксплуатации;
	ИначеЕсли УсловныйКодСчета = "1354.2" Тогда
		Результат = ПС.СпецоснасткаВЭксплуатации;
	ИначеЕсли УсловныйКодСчета = "1354.3" Тогда
		Результат = ПС.ИнвентарьВЭксплуатации;
	ИначеЕсли УсловныйКодСчета = "1360" Тогда
		Результат = ПС.РезервыПодСнижениеСтоимостиМЦ;
	ИначеЕсли УсловныйКодСчета = "1361" Тогда
		Результат = ПС.РезервыПодСнижениеСтоимостиМатериалов;
	ИначеЕсли УсловныйКодСчета = "1362" Тогда
		Результат = ПС.РезервыПодСнижениеСтоимостиГотовойПродукции;
	ИначеЕсли УсловныйКодСчета = "1363" Тогда
		Результат = ПС.РезервыПодСнижениеСтоимостиТоваров;
	ИначеЕсли УсловныйКодСчета = "1370" Тогда
		Результат = ПС.АктивПоПравуНаВозвратЗапасов;	
	ИначеЕсли УсловныйКодСчета = "1410" Тогда
		Результат = ПС.КорпоративныйПодоходныйНалог_;
	ИначеЕсли УсловныйКодСчета = "1420" Тогда
		Результат = ПС.НалогНаДобавленнуюСтоимостьКВозмещению_;
	ИначеЕсли УсловныйКодСчета = "1430" Тогда
		Результат = ПС.ПрочиеНалогиИДругиеОбязательныеПлатежиВБюджет;
	ИначеЕсли УсловныйКодСчета = "1510" Тогда
		Результат = ПС.ДолгосрочныеАктивыДляПродажи;
	ИначеЕсли УсловныйКодСчета = "1520" Тогда
		Результат = ПС.ГруппаНаВыбытиеДляПродажи;
	ИначеЕсли УсловныйКодСчета = "1530" Тогда
		Результат = ПС.ОценочныйРезервПодУбыткиОтОбесцененияДАПредназначенныхДляПродажи;	
	ИначеЕсли УсловныйКодСчета = "1600" Тогда
		Результат = ПС.КраткосрочныеБиологическиеАктивы;
	ИначеЕсли УсловныйКодСчета = "1610" Тогда
		Результат = ПС.КраткосрочныеРастения;
	ИначеЕсли УсловныйКодСчета = "1620" Тогда
		Результат = ПС.КраткосрочныеЖивотные;	
	ИначеЕсли УсловныйКодСчета = "1630" Тогда
		Результат = ПС.ОценочныйРезервПодУбыткиОтОбесценениКраткосрочныхБиологическихАктивов;	
	ИначеЕсли УсловныйКодСчета = "1700" Тогда
		Результат = ПС.ПрочиеКраткосрочныеАктивы_;
	ИначеЕсли УсловныйКодСчета = "1710" Тогда
		Результат = ПС.КраткосрочныеАвансыВыданные;
	ИначеЕсли УсловныйКодСчета = "1720" Тогда
		Результат = ПС.КраткосрочныеРасходыБудущихПериодов;
	ИначеЕсли УсловныйКодСчета = "1730" Тогда
		Результат = ПС.КраткосрочныеАктивыПоДоговорам;
	ИначеЕсли УсловныйКодСчета = "1740" Тогда
		Результат = ПС.ОценочныйРезервПодУбыткиПоКраткосрочнымАктивамПоДоговорамСПокупателями;
	ИначеЕсли УсловныйКодСчета = "1750" Тогда
		Результат = ПС.ПрочиеКраткосрочныеАктивы;
	ИначеЕсли УсловныйКодСчета = "1760" Тогда
		Результат = ПС.УбыткиПрошлыхЛет;	
	ИначеЕсли УсловныйКодСчета = "2000" Тогда
		Результат = ПС.ДолгосрочныеФинансовыеИнвестиции;
	ИначеЕсли УсловныйКодСчета = "Я201" Тогда
		Результат = ПС.ДолгосрочныеПредоставленныеЗаймы;
	ИначеЕсли УсловныйКодСчета = "Я202" Тогда
		Результат = ПС.ДолгосрочныеИнвестицииУдерживаемыеДоПогашения;
	ИначеЕсли УсловныйКодСчета = "Я203" Тогда
		Результат = ПС.ДолгосрочныеФинансовыеИнвестицииДляПродажи;	
	ИначеЕсли УсловныйКодСчета = "2010" Тогда
		Результат = ПС.ДолгосрочныеФинансовыеАктивыОцениваемыеПоАмортизированнойСтоимости;
	ИначеЕсли УсловныйКодСчета = "2020" Тогда
		Результат = ПС.ДолгосрочныеФинансовыеАктивыОцениваемыеПоСправедливойСтоимостиЧерезПрочийСовокупныйДоход;
	ИначеЕсли УсловныйКодСчета = "2030" Тогда
		Результат = ПС.ДолгосрочныеФинансовыеАктивыОцениваемыеПоСправедливойСтоимостиЧерезПрибыльУбыток;
	ИначеЕсли УсловныйКодСчета = "2040" Тогда
		Результат = ПС.ДолгосрочныеДебиторскиеПроизводныеФинансовыеИнструменты;	
	ИначеЕсли УсловныйКодСчета = "2050" Тогда
		Результат = ПС.ДолгосрочныеВознагражденияКПолучению_;
	ИначеЕсли УсловныйКодСчета = "2051" Тогда
		Результат = ПС.ДолгосрочныеВознагражденияКПолучению;
	ИначеЕсли УсловныйКодСчета = "2052" Тогда
		Результат = ПС.ДолгосрочныеВознагражденияКПолучениюОтРаботников;	
	ИначеЕсли УсловныйКодСчета = "2060" Тогда
		Результат = ПС.ДолевыеИнструменты;	
	ИначеЕсли УсловныйКодСчета = "2070" Тогда
		Результат = ПС.ПрочиеДолгосрочныеФинансовыеИнвестиции;
	ИначеЕсли УсловныйКодСчета = "2080" Тогда
		Результат = ПС.ОценочныйРезервПодУбыткиПоДолгосрочнымФинансовымАктивам;	
	ИначеЕсли УсловныйКодСчета = "2100" Тогда
		Результат = ПС.ДолгосрочнаяДебиторскаяЗадолженность;
	ИначеЕсли УсловныйКодСчета = "2110" Тогда
		Результат = ПС.ДолгосрочнаяЗадолженностьПокупателейИЗаказчиков;
	ИначеЕсли УсловныйКодСчета = "2120" Тогда
		Результат = ПС.ДолгосрочнаяДебиторскаяЗадолженностьДочернихОрганизаций;
	ИначеЕсли УсловныйКодСчета = "2130" Тогда
		Результат = ПС.ДолгосрочнаяДебиторскаяЗадолженностьАссоциированныхИСовместныхОрганизаций;
	ИначеЕсли УсловныйКодСчета = "2140" Тогда
		Результат = ПС.ДолгосрочнаяДебиторскаяЗадолженностьФилиаловИСтруктурныхПодразделений;
	ИначеЕсли УсловныйКодСчета = "2150" Тогда
		Результат = ПС.ДолгосрочнаяДебиторскаяЗадолженностьРаботников;
	ИначеЕсли УсловныйКодСчета = "2151" Тогда
		Результат = ПС.ДолгосрочнаяЗадолженностьПодотчетныхЛиц;
	ИначеЕсли УсловныйКодСчета = "2152" Тогда
		Результат = ПС.ДолгосрочнаяЗадолженностьПодотчетныхЛицВВалюте;
	ИначеЕсли УсловныйКодСчета = "2153" Тогда
		Результат = ПС.ДолгосрочнаяЗадолженностьПоВыплаченнойЗаработнойПлате;
	ИначеЕсли УсловныйКодСчета = "2154" Тогда
		Результат = ПС.ДолгосрочнаяЗадолженностьПоПредоставленнымРаботникамЗаймам;
	ИначеЕсли УсловныйКодСчета = "2155" Тогда
		Результат = ПС.ПрочаяДолгосрочнаяЗадолженностьРаботников;
	ИначеЕсли УсловныйКодСчета = "2160" Тогда
		Результат = ПС.ДолгосрочнаяДебиторскаяЗадолженностьПоАренде;
	ИначеЕсли УсловныйКодСчета = "2170" Тогда
		Результат = ПС.ПрочаяДолгосрочнаяДебиторскаяЗадолженность_;
	ИначеЕсли УсловныйКодСчета = "2171" Тогда
		Результат = ПС.ДолгосрочнаяЗадолженностьПоВозвратамИПретензиям;
	ИначеЕсли УсловныйКодСчета = "2172" Тогда
		Результат = ПС.ДолгосрочнаяЗадолженностьПоВыявленнымНедостачамТМЗ;
	ИначеЕсли УсловныйКодСчета = "2173" Тогда
		Результат = ПС.ПрочаяДолгосрочнаяДебиторскаяЗадолженность;
	ИначеЕсли УсловныйКодСчета = "2180" Тогда
		Результат = ПС.ОценочныйРезервПодУбыткиОтОбесцененияДолгосрочнойДебиторскойЗадолженности;
	ИначеЕсли УсловныйКодСчета = "2200" Тогда
		Результат = ПС.ИнвестицииУчитываемыеМетодомДолевогоУчастия_;
	ИначеЕсли УсловныйКодСчета = "2210" Тогда
		Результат = ПС.ИнвестицииУчитываемыеМетодомДолевогоУчастия;
	ИначеЕсли УсловныйКодСчета = "2220" Тогда
		Результат = ПС.ИнвестицииУчитываемыеПоПервоначальнойСтоимости;
	ИначеЕсли УсловныйКодСчета = "2230" Тогда
		Результат = ПС.ОценочныйРезервПодУбыткиОтОбесцененияИнвестиций;	
	ИначеЕсли УсловныйКодСчета = "2300" Тогда
		Результат = ПС.ИнвестицииВНедвижимость_;
	ИначеЕсли УсловныйКодСчета = "2310" Тогда
		Результат = ПС.ДоходныеВложенияВ_МЦ;
	ИначеЕсли УсловныйКодСчета = "2311" Тогда
		Результат = ПС.ПодготовкаКВводуВЭксплуатациюИнвестицийВНедвижимость;
	ИначеЕсли УсловныйКодСчета = "2312" Тогда
		Результат = ПС.МЦвОрганизации;
	ИначеЕсли УсловныйКодСчета = "2313" Тогда
		Результат = ПС.ИнвестицииВНедвижимостьПереданныеВАренду;
	ИначеЕсли УсловныйКодСчета = "2320" Тогда
		Результат = ПС.АмортизацияИнвестицийВНедвижимость_;
	ИначеЕсли УсловныйКодСчета = "2321" Тогда
		Результат = ПС.АмортизацияОС_03;
	ИначеЕсли УсловныйКодСчета = "2322" Тогда
		Результат = ПС.АмортизацияИнвестицийВНедвижимостьПереданныхВАренду;
	ИначеЕсли УсловныйКодСчета = "2330" Тогда
		Результат = ПС.УбытокОтОбесцененияИнвестицийВНедвижимость;
	ИначеЕсли УсловныйКодСчета = "2400" Тогда
		Результат = ПС.ОсновныеСредства_;
	ИначеЕсли УсловныйКодСчета = "2410" Тогда
		Результат = ПС.ОсновныеСредства;
	ИначеЕсли УсловныйКодСчета = "2411" Тогда
		Результат = ПС.ПодготовкаКВводуВЭксплуатацию;
	ИначеЕсли УсловныйКодСчета = "2412" Тогда
		Результат = ПС.ОСвОрганизации;
	ИначеЕсли УсловныйКодСчета = "2413" Тогда
		Результат = ПС.ОсновныеСредстваПереданныеВАренду;
	ИначеЕсли УсловныйКодСчета = "2420" Тогда
		Результат = ПС.АмортизацияОсновныхСредств;
	ИначеЕсли УсловныйКодСчета = "2421" Тогда
		Результат = ПС.АмортизацияОС_01;
	ИначеЕсли УсловныйКодСчета = "2422" Тогда
		Результат = ПС.АмортизацияОсновныхСредствПереданныхВАренду;
	ИначеЕсли УсловныйКодСчета = "2430" Тогда
		Результат = ПС.УбытокОтОбесцененияОсновныхСредств;
	ИначеЕсли УсловныйКодСчета = "2440" Тогда
		Результат = ПС.АрендованноеИмущество_;	
	ИначеЕсли УсловныйКодСчета = "2441" Тогда
		Результат = ПС.ПодготовкаКВводуВЭксплуатациюАрендованногоИмущества;
	ИначеЕсли УсловныйКодСчета = "2442" Тогда
		Результат = ПС.АрендованноеИмущество;	
	ИначеЕсли УсловныйКодСчета = "2450" Тогда
		Результат = ПС.АмортизацияАрендованногоИмущества;	
	ИначеЕсли УсловныйКодСчета = "2460" Тогда
		Результат = ПС.ОценочныйРезервПодУбыткиОтОбесцененияПраваПользованияАктивом	
	ИначеЕсли УсловныйКодСчета = "2500" Тогда
		Результат = ПС.БиологическиеАктивы;
	ИначеЕсли УсловныйКодСчета = "2510" Тогда
		Результат = ПС.Растения;
	ИначеЕсли УсловныйКодСчета = "2520" Тогда
		Результат = ПС.Животные;
	ИначеЕсли УсловныйКодСчета = "2530" Тогда
		Результат = ПС.АмортизацияБиологическихАктивов;
	ИначеЕсли УсловныйКодСчета = "2540" Тогда
		Результат = ПС.ОценочныйРезервПодУбыткиОтОбесцененияБиологическихАктивов;	
	ИначеЕсли УсловныйКодСчета = "2600" Тогда
		Результат = ПС.РазведочныеИОценочныеАктивы_;
	ИначеЕсли УсловныйКодСчета = "2610" Тогда
		Результат = ПС.РазведочныеИОценочныеАктивы;
	ИначеЕсли УсловныйКодСчета = "2620" Тогда
		Результат = ПС.АмортизацияРазведочныхИОценочныхАктивов;
	ИначеЕсли УсловныйКодСчета = "2630" Тогда
		Результат = ПС.УбытокОтОбесцененияРазведочныхИОценочныхАктивов;
	ИначеЕсли УсловныйКодСчета = "2700" Тогда
		Результат = ПС.НематериальныеАктивы;
	ИначеЕсли УсловныйКодСчета = "2710" Тогда
		Результат = ПС.Гудвилл;
	ИначеЕсли УсловныйКодСчета = "2720" Тогда
		Результат = ПС.ОбесценениеГудвилла;
	ИначеЕсли УсловныйКодСчета = "2730" Тогда
		Результат = ПС.НематериальныеАктивыОрганизации;
	ИначеЕсли УсловныйКодСчета = "2740" Тогда
		Результат = ПС.АмортизацияНематериальныхАктивов;
	ИначеЕсли УсловныйКодСчета = "2750" Тогда
		Результат = ПС.УбытокОтОбесцененияПрочихНематериальныхАктивов;
	ИначеЕсли УсловныйКодСчета = "2760" Тогда
		Результат = ПС.АрендованныеНематериальныеАктивы;
	ИначеЕсли УсловныйКодСчета = "2770" Тогда
		Результат = ПС.АмортизацияАрендованныхНематериальныхАктивов;
	ИначеЕсли УсловныйКодСчета = "2780" Тогда
		Результат = ПС.УбытокОтОбесцененияАрендованныхНематериальныхАктивов;	
	ИначеЕсли УсловныйКодСчета = "2800" Тогда
		Результат = ПС.ОтложенныеНалоговыеАктивы;
	ИначеЕсли УсловныйКодСчета = "2810" Тогда
		Результат = ПС.ОтложенныеНалоговыеАктивыПоКорпоративномуПодоходномуНалогу;
	ИначеЕсли УсловныйКодСчета = "2900" Тогда
		Результат = ПС.ПрочиеДолгосрочныеАктивы_;
	ИначеЕсли УсловныйКодСчета = "2910" Тогда
		Результат = ПС.ДолгосрочныеАвансыВыданные;
	ИначеЕсли УсловныйКодСчета = "2920" Тогда
		Результат = ПС.ДолгосрочныеРасходыБудущихПериодов;
	ИначеЕсли УсловныйКодСчета = "2930" Тогда
		Результат = ПС.НезавершенноеСтроительство_;
	ИначеЕсли УсловныйКодСчета = "2931" Тогда
		Результат = ПС.НезавершенноеСтроительство;
	ИначеЕсли УсловныйКодСчета = "2932" Тогда
		Результат = ПС.МонтажОборудования;
	ИначеЕсли УсловныйКодСчета = "2933" Тогда
		Результат = ПС.КапитальныйРемонтОС;
	ИначеЕсли УсловныйКодСчета = "2940" Тогда
		Результат = ПС.ДолгосрочныеАктивыПоДоговорам;	
	ИначеЕсли УсловныйКодСчета = "2950" Тогда
		Результат = ПС.ОценочныйРезервПодУбыткиОтОбесцененияДолгосрочныхАктивовПоДоговорам;	
	ИначеЕсли УсловныйКодСчета = "2960" Тогда
		Результат = ПС.ЗатратыПоДоговорам;	
	ИначеЕсли УсловныйКодСчета = "2970" Тогда
		Результат = ПС.АмортизацияЗатратПоДоговорам;		
	ИначеЕсли УсловныйКодСчета = "2980" Тогда
		Результат = ПС.ОценочныйРезервПодУбыткиОтОбесцененияЗатратПоДоговорам;	
	ИначеЕсли УсловныйКодСчета = "2990" Тогда
		Результат = ПС.ПрочиеДолгосрочныеАктивы;
	ИначеЕсли УсловныйКодСчета = "Я301" Тогда
		Результат = ПС.КраткосрочныеБанковскиеЗаймы;
	ИначеЕсли УсловныйКодСчета = "Я302" Тогда
		Результат = ПС.КраткосрочныеЗаймыПолученные;
	ИначеЕсли УсловныйКодСчета = "Я304" Тогда
		Результат = ПС.ТекущаяЧастьДолгосрочныхФинансовыхОбязательств;	
	ИначеЕсли УсловныйКодСчета = "3010" Тогда
		Результат = ПС.КраткосрочныеФинансовыеОбязательстваОцениваемыеПоАмортизированнойСтоимости;
	ИначеЕсли УсловныйКодСчета = "3020" Тогда
		Результат = ПС.КраткосрочныеФинансовыеОбязательстваОцениваемыеПоСправедливойСтоимостиЧерезПрибыльУбыток;	
	ИначеЕсли УсловныйКодСчета = "3030" Тогда
		Результат = ПС.КраткосрочныеКредиторскиеПроизводныеФинансовыеИнструменты;	
	ИначеЕсли УсловныйКодСчета = "3040" Тогда
		Результат = ПС.КраткосрочнаяКредиторскаяЗадолженностьПоДивидендамИДоходамУчастников;
	ИначеЕсли УсловныйКодСчета = "3050" Тогда
		Результат = ПС.КраткосрочныеВознагражденияКВыплате;	
	ИначеЕсли УсловныйКодСчета = "3060" Тогда
		Результат = ПС.ТекущаяЧастьДолгосрочныхФинансовыхОбязательствПоАмортизированнойСтоимости;
	ИначеЕсли УсловныйКодСчета = "3070" Тогда
		Результат = ПС.ТекущаяЧастьДолгосрочныхФинансовыхОбязательствПоСправедливойСтоимости;	
	ИначеЕсли УсловныйКодСчета = "3080" Тогда
		Результат = ПС.ПрочиеКраткосрочныеФинансовыеОбязательства;
	ИначеЕсли УсловныйКодСчета = "3110" Тогда
		Результат = ПС.КорпоративныйПодоходныйНалогПодлежащийУплате_;
	ИначеЕсли УсловныйКодСчета = "3120" Тогда
		Результат = ПС.ИндивидуальныйПодоходныйНалог;
	ИначеЕсли УсловныйКодСчета = "3130" Тогда
		Результат = ПС.НалогНаДобавленнуюСтоимость;
	ИначеЕсли УсловныйКодСчета = "3140" Тогда
		Результат = ПС.Акцизы;
	ИначеЕсли УсловныйКодСчета = "3150" Тогда
		Результат = ПС.СоциальныйНалог;
	ИначеЕсли УсловныйКодСчета = "3160" Тогда
		Результат = ПС.ЗемельныйНалог;
	ИначеЕсли УсловныйКодСчета = "3170" Тогда
		Результат = ПС.ТранспортныйНалог;
	ИначеЕсли УсловныйКодСчета = "3180" Тогда
		Результат = ПС.НалогНаИмущество;
	ИначеЕсли УсловныйКодСчета = "3190" Тогда
		Результат = ПС.ПрочиеНалоги;
	ИначеЕсли УсловныйКодСчета = "3210" Тогда
		Результат = ПС.ОбязательстваПоСоциальномуСтрахованию_;
	ИначеЕсли УсловныйКодСчета = "3220" Тогда
		Результат = ПС.ОбязательстваПоПенсионнымОтчислениям;
	ИначеЕсли УсловныйКодСчета = "3230" Тогда
		Результат = ПС.ПрочиеОбязательстваПоДругимОбязательнымПлатежам;
	ИначеЕсли УсловныйКодСчета = "3240" Тогда
		Результат = ПС.ПрочиеОбязательстваПоДругимДобровольнымПлатежам;
	ИначеЕсли УсловныйКодСчета = "3310" Тогда
		Результат = ПС.КраткосрочнаяЗадолженностьПоставщикамИПодрядчикам;
	ИначеЕсли УсловныйКодСчета = "3320" Тогда
		Результат = ПС.КраткосрочнаяКредиторскаяЗадолженностьДочернимОрганизациям;
	ИначеЕсли УсловныйКодСчета = "3330" Тогда
		Результат = ПС.КраткосрочнаяКредиторскаяЗадолженностьАссоциированнымИСовместнымОрганизациям;
	ИначеЕсли УсловныйКодСчета = "3340" Тогда
		Результат = ПС.КраткосрочнаяКредиторскаяЗадолженностьФилиаламИСтруктурнымПодразделениям;
	ИначеЕсли УсловныйКодСчета = "3350" Тогда
		Результат = ПС.РасчетыСПерсоналомПоОплатеТруда;
	ИначеЕсли УсловныйКодСчета = "3360" Тогда
		Результат = ПС.КраткосрочнаяЗадолженностьПоАренде;
	ИначеЕсли УсловныйКодСчета = "3370" Тогда
		Результат = ПС.ТекущаяЧастьДолгосрочнойКредиторскойЗадолженности;
	ИначеЕсли УсловныйКодСчета = "3381" Тогда
		Результат = ПС.КраткосрочнаяЗадолженностьПоВозвратамРеализованныхГотовойПродукцииТоваровРаботУслуг;
	ИначеЕсли УсловныйКодСчета = "3382" Тогда
		Результат = ПС.КраткосрочнаяЗадолженностьПоПрисужденнымШтрафамПенямНеустойкам;
	ИначеЕсли УсловныйКодСчета = "3383" Тогда
		Результат = ПС.КраткосрочнаяЗадолженностьПоОшибочноЗачисленнымСуммамНаСчетахВБанках;
	ИначеЕсли УсловныйКодСчета = "3384" Тогда
		Результат = ПС.РасчетыПоДепонированнымСуммам;
	ИначеЕсли УсловныйКодСчета = "3385" Тогда
		Результат = ПС.КраткосрочнаяЗадолженностьПоИсполнительнымЛистам;
	ИначеЕсли УсловныйКодСчета = "3386" Тогда
		Результат = ПС.КраткосрочнаяЗадолженностьПередПодотчетнымиЛицами;
	ИначеЕсли УсловныйКодСчета = "3387" Тогда
		Результат = ПС.КраткосрочнаяЗадолженностьПередПодотчетнымиЛицамиВВалюте;
	ИначеЕсли УсловныйКодСчета = "3388" Тогда
		Результат = ПС.ПрочаяКраткосрочнаяКредиторскаяЗадолженность;
	ИначеЕсли УсловныйКодСчета = "3389" Тогда
		Результат = ПС.ТоварыКОформлениюОтчетовКомитенту;
	ИначеЕсли УсловныйКодСчета = "3410" Тогда
		Результат = ПС.КраткосрочныеГарантийныеОбязательстваРезервы;
	ИначеЕсли УсловныйКодСчета = "3420" Тогда
		Результат = ПС.КраткосрочныеОбязательстваПоЮридическимПретензиямрезервы;
	ИначеЕсли УсловныйКодСчета = "3430" Тогда
		Результат = ПС.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам;
	ИначеЕсли УсловныйКодСчета = "3440" Тогда
		Результат = ПС.ПрочиеКраткосрочныеОценочныеОбязательстваРезервы;
	ИначеЕсли УсловныйКодСчета = "3510" Тогда
		Результат = ПС.КраткосрочныеАвансыПолученные;
	ИначеЕсли УсловныйКодСчета = "3520" Тогда
		Результат = ПС.КраткосрочныеДоходыБудущихПериодов;
	ИначеЕсли УсловныйКодСчета = "3530" Тогда
		Результат = ПС.ОбязательстваГруппыНаВыбытиеПредназначеннойДляПродажи;
	ИначеЕсли УсловныйКодСчета = "3540" Тогда
		Результат = ПС.КраткосрочныеОбязательстваПоДоговорам;	
	ИначеЕсли УсловныйКодСчета = "3550" Тогда
		Результат = ПС.ДолговойКомпонентКомбинированногоКраткосрочногоФинансовогоИнструмента;	
	ИначеЕсли УсловныйКодСчета = "3560" Тогда
		Результат = ПС.ПрочиеКраткосрочныеОбязательства;
	ИначеЕсли УсловныйКодСчета = "Я401" Тогда
		Результат = ПС.ДолгосрочныеБанковскиеЗаймы;
	ИначеЕсли УсловныйКодСчета = "Я402" Тогда
		Результат = ПС.ДолгосрочныеЗаймыПолученные;
	ИначеЕсли УсловныйКодСчета = "4010" Тогда
		Результат = ПС.ДолгосрочныеФинансовыеОбязательстваОцениваемыеПоАмортизированнойСтоимости;
	ИначеЕсли УсловныйКодСчета = "4020" Тогда
		Результат = ПС.ДолгосрочныеФинансовыеОбязательстваОцениваемыеПоСправедливойСтоимостиЧерезПрибыльУбыток;	
	ИначеЕсли УсловныйКодСчета = "4030" Тогда
		Результат = ПС.ДолгосрочныеКредиторскиеПроизводныеФинансовыеИнструменты;	
	ИначеЕсли УсловныйКодСчета = "4040" Тогда
		Результат = ПС.ДолгосрочнаяЗадолженностьПоДивидендамДоходамУчастников;	
	ИначеЕсли УсловныйКодСчета = "4050" Тогда
		Результат = ПС.ДолгосрочныеВознагражденияКВыплате;	
	ИначеЕсли УсловныйКодСчета = "4060" Тогда
		Результат = ПС.ПрочиеДолгосрочныеФинансовыеОбязательства;
	ИначеЕсли УсловныйКодСчета = "4110" Тогда
		Результат = ПС.ДолгосрочнаяЗадолженностьПоставщикамИПодрядчикам;
	ИначеЕсли УсловныйКодСчета = "4120" Тогда
		Результат = ПС.ДолгосрочнаяКредиторскаяЗадолженностьДочернимОрганизациям;
	ИначеЕсли УсловныйКодСчета = "4130" Тогда
		Результат = ПС.ДолгосрочнаяКредиторскаяЗадолженностьАссоциированнымИСовместнымОрганизациям;
	ИначеЕсли УсловныйКодСчета = "4140" Тогда
		Результат = ПС.ДолгосрочнаяКредиторскаяЗадолженностьФилиаламИСтруктурнымПодразделениям;
	ИначеЕсли УсловныйКодСчета = "4150" Тогда
		Результат = ПС.ДолгосрочнаяЗадолженностьПоАренде;
	ИначеЕсли УсловныйКодСчета = "4161" Тогда
		Результат = ПС.ДолгосрочнаяЗадолженностьПоВозвратамРеализованныхГотовойПродукцииТоваровРаботУслуг;
	ИначеЕсли УсловныйКодСчета = "4162" Тогда
		Результат = ПС.ДолгосрочнаяЗадолженностьПоПрисужденнымШтрафамПенямНеустойкам;
	ИначеЕсли УсловныйКодСчета = "4163" Тогда
		Результат = ПС.ДолгосрочнаяЗадолженностьПоОшибочноЗачисленнымСуммамНаСчетахВБанках;
	ИначеЕсли УсловныйКодСчета = "4164" Тогда
		Результат = ПС.ДолгосрочнаяЗадолженностьПоДепонированнойЗаработнойПлате;
	ИначеЕсли УсловныйКодСчета = "4165" Тогда
		Результат = ПС.ДолгосрочнаяЗадолженностьПоИсполнительнымЛистам;
	ИначеЕсли УсловныйКодСчета = "4166" Тогда
		Результат = ПС.ДолгосрочнаяЗадолженностьПередПодотчетнымиЛицами;
	ИначеЕсли УсловныйКодСчета = "4167" Тогда
		Результат = ПС.ПрочаяДолгосрочнаяКредиторскаяЗадолженность;
	ИначеЕсли УсловныйКодСчета = "4210" Тогда
		Результат = ПС.ДолгосрочныеГарантийныеОбязательстваРезервы;
	ИначеЕсли УсловныйКодСчета = "4220" Тогда
		Результат = ПС.ДолгосрочныеОценочныеОбязательстваПоЮридическимПретензиямРезервы;
	ИначеЕсли УсловныйКодСчета = "4230" Тогда
		Результат = ПС.ДолгосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам;
	ИначеЕсли УсловныйКодСчета = "4240" Тогда
		Результат = ПС.ПрочиеДолгосрочныеОценочныеОбязательстваРезервы;
	ИначеЕсли УсловныйКодСчета = "4310" Тогда
		Результат = ПС.ОтложенныеНалоговыеОбязательстваПоКорпоративномуПодоходномуНалогу;
	ИначеЕсли УсловныйКодСчета = "4410" Тогда
		Результат = ПС.ДолгосрочныеАвансыПолученные;
	ИначеЕсли УсловныйКодСчета = "4420" Тогда
		Результат = ПС.ДолгосрочныеДоходыБудущихПериодов;
	ИначеЕсли УсловныйКодСчета = "4430" Тогда
		Результат = ПС.ДолгосрочныеОбязательстваПоДоговорам;	
	ИначеЕсли УсловныйКодСчета = "4440" Тогда
		Результат = ПС.ДолговойКомпонентКомбинированногоДолгосрочногоФинансовогоИнструмента;	
	ИначеЕсли УсловныйКодСчета = "4450" Тогда
		Результат = ПС.ПрочиеДолгосрочныеОбязательства;
	ИначеЕсли УсловныйКодСчета = "5000" Тогда
		Результат = ПС.УставныйКапитал;
	ИначеЕсли УсловныйКодСчета = "5010" Тогда
		Результат = ПС.ПривилегированныеАкции;
	ИначеЕсли УсловныйКодСчета = "5020" Тогда
		Результат = ПС.ПростыеАкции;
	ИначеЕсли УсловныйКодСчета = "5030" Тогда
		Результат = ПС.ВкладыИПаи;
	ИначеЕсли УсловныйКодСчета = "5100" Тогда
		Результат = ПС.НеоплаченныйКапитал_;
	ИначеЕсли УсловныйКодСчета = "5110" Тогда
		Результат = ПС.НеоплаченныйКапитал;
	ИначеЕсли УсловныйКодСчета = "5200" Тогда
		Результат = ПС.ВыкупленныеСобственныеДолевыеИнструменты_;
	ИначеЕсли УсловныйКодСчета = "5210" Тогда
		Результат = ПС.ВыкупленныеСобственныеДолевыеИнструменты;
	ИначеЕсли УсловныйКодСчета = "5300" Тогда
		Результат = ПС.ЭмиссионныйДоход_;
	ИначеЕсли УсловныйКодСчета = "5310" Тогда
		Результат = ПС.ЭмиссионныйДоход;
	ИначеЕсли УсловныйКодСчета = "5400" Тогда
		Результат = ПС.ДополнительноОплаченныйКапитал;
	ИначеЕсли УсловныйКодСчета = "5410" Тогда
		Результат = ПС.ДополнительноОплаченныйКапиталПоБезвозмезднымОперациямСОсновнойОрганизацией;
	ИначеЕсли УсловныйКодСчета = "5420" Тогда
		Результат = ПС.ДополнительноОплаченныйКапиталПоПрочимОперациям;	
	ИначеЕсли УсловныйКодСчета = "5500" Тогда
		Результат = ПС.Резервы;
	ИначеЕсли УсловныйКодСчета = "5510" Тогда
		Результат = ПС.РезервныйКапиталУстановленныйУчредительнымиДокументами;
	ИначеЕсли УсловныйКодСчета = "5520" Тогда
		Результат = ПС.РезервНаПереоценкуОсновныхСредств;
	ИначеЕсли УсловныйКодСчета = "5530" Тогда
		Результат = ПС.РезервНаПереоценкуНематериальныхАктивов;
	ИначеЕсли УсловныйКодСчета = "5540" Тогда
		Результат = ПС.РезервНаПереоценкуФинансовыхАктивовПредназначенныхДляПродажи;
	ИначеЕсли УсловныйКодСчета = "5550" Тогда
		Результат = ПС.РезервПодУбыткиПоФинансовымАктивам;	
	ИначеЕсли УсловныйКодСчета = "5560" Тогда
		Результат = ПС.РезервНаПересчетИностраннойВалютыПоЗарубежнойДеятельности;
	ИначеЕсли УсловныйКодСчета = "5570" Тогда
		Результат = ПС.ПрочиеРезервы;
	ИначеЕсли УсловныйКодСчета = "5600" Тогда
		Результат = ПС.НераспределеннаяПрибыльНепокрытыйУбыток;
	ИначеЕсли УсловныйКодСчета = "5610" Тогда
		Результат = ПС.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода;
	ИначеЕсли УсловныйКодСчета = "5620" Тогда
		Результат = ПС.НераспределеннаяПрибыльНепокрытыйУбытокПредыдущихЛет;
	ИначеЕсли УсловныйКодСчета = "5700" Тогда
		Результат = ПС.ИтоговаяПрибыльИтоговыйУбыток_;
	ИначеЕсли УсловныйКодСчета = "5710" Тогда
		Результат = ПС.ИтоговаяПрибыльИтоговыйУбыток;
	ИначеЕсли УсловныйКодСчета = "6000" Тогда
		Результат = ПС.ДоходОтРеализацииПродукцииИОказанияУслуг_;
	ИначеЕсли УсловныйКодСчета = "6010" Тогда
		Результат = ПС.ДоходОтРеализацииПродукцииИОказанияУслуг;
	ИначеЕсли УсловныйКодСчета = "6020" Тогда
		Результат = ПС.ВозвратПроданнойПродукции;
	ИначеЕсли УсловныйКодСчета = "6030" Тогда
		Результат = ПС.СкидкиСЦеныИПродаж;
	ИначеЕсли УсловныйКодСчета = "6100" Тогда
		Результат = ПС.ДоходыОтФинансирования;
	ИначеЕсли УсловныйКодСчета = "6110" Тогда
		Результат = ПС.ДоходыПоВознаграждениям;
	ИначеЕсли УсловныйКодСчета = "6120" Тогда
		Результат = ПС.ДоходыПоДивидендам;
	ИначеЕсли УсловныйКодСчета = "6130" Тогда
		Результат = ПС.ДоходыОтФинансовойАренды;
	ИначеЕсли УсловныйКодСчета = "6140" Тогда
		Результат = ПС.ДоходыОтОперацийСИнвестиционнойНедвижимостью;
	ИначеЕсли УсловныйКодСчета = "6150" Тогда
		Результат = ПС.ДоходыОтИзмененияСправедливойСтоимостиФинансовыхИнструментов;
	ИначеЕсли УсловныйКодСчета = "6160" Тогда
		Результат = ПС.ПрочиеДоходыОтФинансирования;
	ИначеЕсли УсловныйКодСчета = "6200" Тогда
		Результат = ПС.ПрочиеДоходы_;
	ИначеЕсли УсловныйКодСчета = "6210" Тогда
		Результат = ПС.ДоходыОтВыбытияАктивов;
	ИначеЕсли УсловныйКодСчета = "6220" Тогда
		Результат = ПС.ДоходыОтБезвозмездноПолученныхАктивов;
	ИначеЕсли УсловныйКодСчета = "6230" Тогда
		Результат = ПС.ДоходыОтГосударственныхСубсидий;
	ИначеЕсли УсловныйКодСчета = "6240" Тогда
		Результат = ПС.ДоходыОтВосстановленияУбыткаОтОбесценения;
	ИначеЕсли УсловныйКодСчета = "6250" Тогда
		Результат = ПС.ДоходыОтКурсовойРазницы;
	ИначеЕсли УсловныйКодСчета = "6260" Тогда
		Результат = ПС.ДоходыОтОперационнойАренды;
	ИначеЕсли УсловныйКодСчета = "6270" Тогда
		Результат = ПС.ДоходыОтИзмененияСправедливойСтоимостиБиологическихАктивов;
	ИначеЕсли УсловныйКодСчета = "6280" Тогда
		Результат = ПС.ДоходыОтВосстановленияУбыткаОтОбесцененияПоФинансовымАктивам;	
	ИначеЕсли УсловныйКодСчета = "6290" Тогда
		Результат = ПС.ПрочиеДоходы;
	ИначеЕсли УсловныйКодСчета = "6300" Тогда
		Результат = ПС.ДоходыСвязанныеСПрекращаемойДеятельностью_;
	ИначеЕсли УсловныйКодСчета = "6310" Тогда
		Результат = ПС.ДоходыСвязанныеСПрекращаемойДеятельностью;
	ИначеЕсли УсловныйКодСчета = "6400" Тогда
		Результат = ПС.ДоляПрибылиОрганизацийУчитываемыхПоМетодуДолевогоУчастия;
	ИначеЕсли УсловныйКодСчета = "6410" Тогда
		Результат = ПС.ДоляПрибылиАссоциированныхОрганизаций;	
	ИначеЕсли УсловныйКодСчета = "6420" Тогда
		Результат = ПС.ДоляПрибылиДочернихОрганизаций;
	ИначеЕсли УсловныйКодСчета = "7000" Тогда
		Результат = ПС.СебестоимостьРеализованнойПродукцииИОказанныхУслуг_;
	ИначеЕсли УсловныйКодСчета = "7010" Тогда
		Результат = ПС.СебестоимостьРеализованнойПродукцииИОказанныхУслуг;
	ИначеЕсли УсловныйКодСчета = "7100" Тогда
		Результат = ПС.РасходыПоРеализацииПродукцииИОказаниюУслуг_;
	ИначеЕсли УсловныйКодСчета = "7110" Тогда
		Результат = ПС.РасходыПоРеализацииПродукцииИОказаниюУслуг;
	ИначеЕсли УсловныйКодСчета = "7200" Тогда
		Результат = ПС.АдминистративныеРасходы_;
	ИначеЕсли УсловныйКодСчета = "7210" Тогда
		Результат = ПС.АдминистративныеРасходы;
	ИначеЕсли УсловныйКодСчета = "7300" Тогда
		Результат = ПС.РасходыНаФинансирование;
	ИначеЕсли УсловныйКодСчета = "7310" Тогда
		Результат = ПС.РасходыПоВознаграждениям;
	ИначеЕсли УсловныйКодСчета = "7320" Тогда
		Результат = ПС.РасходыНаВыплатуПроцентовПоФинансовойАренде;
	ИначеЕсли УсловныйКодСчета = "7330" Тогда
		Результат = ПС.РасходыОтИзмененияСправедливойСтоимостиФинансовыхИнструментов;
	ИначеЕсли УсловныйКодСчета = "7340" Тогда
		Результат = ПС.ПрочиеРасходыНаФинансирование;
	ИначеЕсли УсловныйКодСчета = "7400" Тогда
		Результат = ПС.ПрочиеРасходы_;
	ИначеЕсли УсловныйКодСчета = "7410" Тогда
		Результат = ПС.РасходыПоВыбытиюАктивов;
	ИначеЕсли УсловныйКодСчета = "7420" Тогда
		Результат = ПС.РасходыОтОбесцененияАктивов;
	ИначеЕсли УсловныйКодСчета = "7430" Тогда
		Результат = ПС.РасходыПоКурсовойРазнице;
	ИначеЕсли УсловныйКодСчета = "7440" Тогда
		Результат = ПС.РасходыПоСозданиюРезерваИСписаниюБезнадежныхТребований;
	ИначеЕсли УсловныйКодСчета = "7450" Тогда
		Результат = ПС.РасходыПоОперационнойАренде;
	ИначеЕсли УсловныйКодСчета = "7460" Тогда
		Результат = ПС.РасходыОтИзмененияСправедливойСтоимостиБиологическихАктивов;
	ИначеЕсли УсловныйКодСчета = "7470" Тогда
		Результат = ПС.РасходыОтОбесцененияФинансовыхИнструментов;	
	ИначеЕсли УсловныйКодСчета = "7480" Тогда
		Результат = ПС.ПрочиеРасходы;
	ИначеЕсли УсловныйКодСчета = "7490" Тогда
		Результат = ПС.ПрочиеРасходыВНалоговомУчете;
	ИначеЕсли УсловныйКодСчета = "7500" Тогда
		Результат = ПС.РасходыСвязанныеСПрекращаемойДеятельностью_;
	ИначеЕсли УсловныйКодСчета = "7510" Тогда
		Результат = ПС.РасходыСвязанныеСПрекращаемойДеятельностью;
	ИначеЕсли УсловныйКодСчета = "7600" Тогда
		Результат = ПС.ДоляВУбыткеОрганизацийУчитываемыхМетодомДолевогоУчастия;
	ИначеЕсли УсловныйКодСчета = "7610" Тогда
		Результат = ПС.ДоляВУбыткеАссоциированныхОрганизаций;
	ИначеЕсли УсловныйКодСчета = "7620" Тогда
		Результат = ПС.ДоляВУбыткеСовместныхОрганизаций;
	ИначеЕсли УсловныйКодСчета = "7700" Тогда
		Результат = ПС.РасходыПоКорпоративномуПодоходномуНалогу_;
	ИначеЕсли УсловныйКодСчета = "7710" Тогда
		Результат = ПС.РасходыПоКорпоративномуПодоходномуНалогу;
	Иначе
		ОписаниеОшибки = НСтр("ru='Не определен счет с условным кодом %1 в соответствии счетов'");
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеОшибки, УсловныйКодСчета);
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СальдоИОборотыПоСчетам(ПараметрыИтогов) Экспорт
	
	Организация   = ПараметрыИтогов.Организация;
	НачалоПериода = ПараметрыИтогов.НачалоПериода;
	КонецПериода  = ПараметрыИтогов.КонецПериода;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ХозрасчетныйОстаткиИОбороты.Счет КАК Счет,
	               |	ХозрасчетныйОстаткиИОбороты.Счет.Вид КАК ВидСчета,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокДт КАК СуммаНачальныйОстатокДт,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокКт КАК СуммаНачальныйОстатокКт,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйРазвернутыйОстатокДт КАК СуммаНачальныйРазвернутыйОстатокДт,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйРазвернутыйОстатокКт КАК СуммаНачальныйРазвернутыйОстатокКт,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт КАК СуммаОборотДт,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК СуммаОборотКт,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК СуммаКонечныйОстатокДт,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокКт КАК СуммаКонечныйОстатокКт,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйРазвернутыйОстатокДт КАК СуммаКонечныйРазвернутыйОстатокДт,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйРазвернутыйОстатокКт КАК СуммаКонечныйРазвернутыйОстатокКт
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, ПЕРИОД, , , , Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
	               |ИТОГИ
	               |	СУММА(СуммаНачальныйОстатокДт),
	               |	СУММА(СуммаНачальныйОстатокКт),
	               |	СУММА(СуммаНачальныйРазвернутыйОстатокДт),
	               |	СУММА(СуммаНачальныйРазвернутыйОстатокКт),
	               |	СУММА(СуммаОборотДт),
	               |	СУММА(СуммаОборотКт),
	               |	СУММА(СуммаКонечныйОстатокДт),
	               |	СУММА(СуммаКонечныйОстатокКт),
	               |	СУММА(СуммаКонечныйРазвернутыйОстатокДт),
	               |	СУММА(СуммаКонечныйРазвернутыйОстатокКт)
	               |ПО
	               |	Счет ТОЛЬКО ИЕРАРХИЯ";
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецПериода);
	
	Запрос.Текст = ТекстЗапроса;
	
	ИтоговаяТаблица = Запрос.Выполнить().Выгрузить();
	ИтоговаяТаблица.Индексы.Добавить("Счет");
	
	Возврат ИтоговаяТаблица;
	
КонецФункции

Функция СальдоИОборотыПоСчетамИСубконто(ПараметрыИтогов) Экспорт
	
	Организация   = ПараметрыИтогов.Организация;
	НачалоПериода = ПараметрыИтогов.НачалоПериода;
	КонецПериода  = ПараметрыИтогов.КонецПериода;
	
	Если ТипЗнч(ПараметрыИтогов.Счета) <> Тип("Массив") Тогда
		ВидыСубконто = Новый Массив;
		ВидыСубконто.Добавить(ПараметрыИтогов.Счета);
	Иначе
		Счета = ПараметрыИтогов.Счета;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыИтогов.ВидыСубконто) <> Тип("Массив") Тогда
		ВидыСубконто = Новый Массив;
		ВидыСубконто.Добавить(ПараметрыИтогов.ВидыСубконто);
	Иначе
		ВидыСубконто = ПараметрыИтогов.ВидыСубконто;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ХозрасчетныйОстаткиИОбороты.Счет КАК Счет,
	               |	ХозрасчетныйОстаткиИОбороты.Счет.Вид КАК ВидСчета,
	               |	%1
	               |	СУММА(ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокДт) КАК СуммаНачальныйОстатокДт,
	               |	СУММА(ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокКт) КАК СуммаНачальныйОстатокКт,
	               |	СУММА(ХозрасчетныйОстаткиИОбороты.СуммаНачальныйРазвернутыйОстатокДт) КАК СуммаНачальныйРазвернутыйОстатокДт,
	               |	СУММА(ХозрасчетныйОстаткиИОбороты.СуммаНачальныйРазвернутыйОстатокКт) КАК СуммаНачальныйРазвернутыйОстатокКт,
	               |	СУММА(ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт) КАК СуммаКонечныйОстатокДт,
	               |	СУММА(ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокКт) КАК СуммаКонечныйОстатокКт,
	               |	СУММА(ХозрасчетныйОстаткиИОбороты.СуммаКонечныйРазвернутыйОстатокДт) КАК СуммаКонечныйРазвернутыйОстатокДт,
	               |	СУММА(ХозрасчетныйОстаткиИОбороты.СуммаКонечныйРазвернутыйОстатокКт) КАК СуммаКонечныйРазвернутыйОстатокКт
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, ПЕРИОД, , Счет В (&Счета), &ВидыСубконто, Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ХозрасчетныйОстаткиИОбороты.Счет,
	               |	ХозрасчетныйОстаткиИОбороты.Счет.Вид";
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецПериода);
	
	Запрос.УстановитьПараметр("Счета", Счета);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	
	СтрокаЗамены1 = "";
	
	Для Инд = 1 По ВидыСубконто.Количество() Цикл
		СтрокаЗамены1 = СтрокаЗамены1
		              + ?(Инд <> 1, Символы.ПС + Символы.Таб, "")
		              + "КОЛИЧЕСТВО(ХозрасчетныйОстаткиИОбороты.Субконто" + Инд + ") КАК Субконто" + Инд + ",";
	КонецЦикла;
	
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапроса, СтрокаЗамены1);
	
	ИтоговаяТаблица = Запрос.Выполнить().Выгрузить();
	ИтоговаяТаблица.Индексы.Добавить("Счет");
	
	Возврат ИтоговаяТаблица;
	
КонецФункции

Функция ОборотыМеждуСчетами(ПараметрыИтогов) Экспорт
	
	Организация   = ПараметрыИтогов.Организация;
	НачалоПериода = ПараметрыИтогов.НачалоПериода;
	КонецПериода  = ПараметрыИтогов.КонецПериода;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОбороты.Счет КАК Счет,
	               |	ХозрасчетныйОбороты.Счет.Вид КАК ВидСчета,
	               |	ХозрасчетныйОбороты.КорСчет КАК КорСчет,
	               |	ХозрасчетныйОбороты.СуммаОборотДт КАК СуммаКорОборотДт
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, ПЕРИОД, , , Организация = &Организация, , ) КАК ХозрасчетныйОбороты";
	
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецПериода);
	
	ИтоговаяТаблица = Запрос.Выполнить().Выгрузить();
	ИтоговаяТаблица.Индексы.Добавить("Счет");
	ИтоговаяТаблица.Индексы.Добавить("КорСчет");
	
	Возврат ИтоговаяТаблица;
	
КонецФункции

Функция ОборотыМеждуСчетамиПоАналитике(ПараметрыИтогов) Экспорт
	
	Организация   = ПараметрыИтогов.Организация;
	НачалоПериода = ПараметрыИтогов.НачалоПериода;
	КонецПериода  = ПараметрыИтогов.КонецПериода;
	
	Счет    = ПараметрыИтогов.Счет;
	Если ТипЗнч(Счет) = Тип("Строка") Тогда
		Счет = Счет(Счет); // Приведение к ссылочному типу
	КонецЕсли;
	
	КорСчет = ПараметрыИтогов.КорСчет;
	Если ТипЗнч(КорСчет) = Тип("Строка") Тогда
		КорСчет = Счет(КорСчет); // Приведение к ссылочному типу
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СУММА(ХозрасчетныйОбороты.СуммаОборотДт) КАК СуммаКорОборотДт
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, ПЕРИОД, Счет = &Счет, %1, Организация = &Организация, КорСчет = &КорСчет, %2) КАК ХозрасчетныйОбороты
	               |%3";
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецПериода);
	
	Запрос.УстановитьПараметр("Счет",    Счет);
	Запрос.УстановитьПараметр("КорСчет", КорСчет);
	
	СтрокаЗамены3 = ""; // условие запроса
	
	СтрокаЗамены1 = ""; // виды субконто
	Если ПараметрыИтогов.Свойство("Субконто") Тогда
		ВидыСубконто = Новый Массив;
		Для Инд = 1 По ПараметрыИтогов.Субконто.Количество() Цикл
			ОписаниеСубконто = ПараметрыИтогов.Субконто[Инд - 1];
			ВидыСубконто.Добавить(ОписаниеСубконто.ВидСубконто);
			
			Если ЗначениеЗаполнено(ОписаниеСубконто.Отбор) Тогда
				СтрокаЗамены3 = Символы.Таб + ?(ЗначениеЗаполнено(СтрокаЗамены3), "И ", "")
				              + "ХозрасчетныйОбороты.Субконто" + Инд + " = &Субконто" + Инд;
				Запрос.УстановитьПараметр("Субконто" + Инд, ОписаниеСубконто.Отбор);
			КонецЕсли;
		КонецЦикла;
		
		СтрокаЗамены1 = "&ВидыСубконто";
		Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	КонецЕсли;
	
	СтрокаЗамены2 = ""; // виды корреспондирующих субконто
	Если ПараметрыИтогов.Свойство("КорСубконто") Тогда
		ВидыКорСубконто = Новый Массив;
		Для Инд = 1 По ПараметрыИтогов.КорСубконто.Количество() Цикл
			ОписаниеСубконто = ПараметрыИтогов.КорСубконто[Инд -1];
			ВидыКорСубконто.Добавить(ОписаниеСубконто.ВидСубконто);
			
			Если ЗначениеЗаполнено(ОписаниеСубконто.Отбор) Тогда
				СтрокаЗамены3 = Символы.Таб + ?(ЗначениеЗаполнено(СтрокаЗамены3), "И ", "")
				              + "ХозрасчетныйОбороты.КорСубконто" + Инд + " = &КорСубконто" + Инд;
				Запрос.УстановитьПараметр("КорСубконто" + Инд, ОписаниеСубконто.Отбор);
			КонецЕсли;
		КонецЦикла;
		
		СтрокаЗамены2 = "&ВидыКорСубконто";
		Запрос.УстановитьПараметр("ВидыКорСубконто", ВидыКорСубконто);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаЗамены3) Тогда
		СтрокаЗамены3 = "ГДЕ" + Символы.ПС + СтрокаЗамены3;
	КонецЕсли;
	
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапроса, СтрокаЗамены1, СтрокаЗамены2, СтрокаЗамены3);
	
	ИтоговаяТаблица = Запрос.Выполнить().Выгрузить();
	
	Возврат ИтоговаяТаблица.Итог("СуммаКорОборотДт");
	
КонецФункции

Функция ОБ(Знач Счет, Знач КорСчет, ОборотыМеждуСчетами) Экспорт
	
	СчетаДт = Новый Массив;
	СчетаКт = Новый Массив;
	
	Если ТипЗнч(Счет) = Тип("Строка") Тогда
		Если Прав(Счет, 1) = "*" Тогда
			Счет = Лев(Счет, СтрДлина(Счет) - 1);
			Счет = Счет(Счет);
			СубСчета = БухгалтерскийУчетПовтИсп.СчетаВИерархии(Счет);
			Для Каждого СубСчет Из СубСчета Цикл
				СчетаДт.Добавить(СубСчет);
			КонецЦикла;
		Иначе
			Счет = Счет(Счет);
			СчетаДт.Добавить(Счет);
		КонецЕсли;
	Иначе
		СчетаДт.Добавить(Счет);
	КонецЕсли;
	
	Если ТипЗнч(КорСчет) = Тип("Строка") Тогда
		Если Прав(КорСчет, 1) = "*" Тогда
			КорСчет = Лев(КорСчет, СтрДлина(КорСчет) - 1);
			КорСчет = Счет(КорСчет);
			СубСчета = БухгалтерскийУчетПовтИсп.СчетаВИерархии(КорСчет);
			Для Каждого СубСчет Из СубСчета Цикл
				СчетаКт.Добавить(СубСчет);
			КонецЦикла;
		Иначе
			КорСчет = Счет(КорСчет);
			СчетаКт.Добавить(КорСчет);
		КонецЕсли;
	Иначе
		СчетаКт.Добавить(КорСчет);
	КонецЕсли;
	
	Оборот = 0;
	
	Для Каждого СчетДт Из СчетаДт Цикл
		Для Каждого СчетКт Из СчетаКт Цикл
			СтрокиПоСчетам = ОборотыМеждуСчетами.НайтиСтроки(Новый Структура("Счет, КорСчет", СчетДт, СчетКт));
			Если СтрокиПоСчетам.Количество() <> 0 Тогда
				Оборот = Оборот + СтрокиПоСчетам[0].СуммаКорОборотДт;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Оборот;
	
КонецФункции

Функция ДО(Счет, СальдоИОбороты) Экспорт
	
	Возврат ОборотПоСчету(Счет, "СуммаОборотДт", СальдоИОбороты);
	
КонецФункции

Функция КО(Счет, СальдоИОбороты) Экспорт
	
	Возврат ОборотПоСчету(Счет, "СуммаОборотКт", СальдоИОбороты);
	
КонецФункции

Функция СКД(Счет, СальдоИОбороты) Экспорт
	
	Возврат СальдоПоСчету(Счет, "СуммаКонечныйОстатокДт", СальдоИОбороты);
	
КонецФункции

Функция СКДР(Счет, СальдоИОбороты) Экспорт
	
	Возврат СальдоПоСчету(Счет, "СуммаКонечныйРазвернутыйОстатокДт", СальдоИОбороты);
	
КонецФункции

Функция СКК(Счет, СальдоИОбороты) Экспорт
	
	Возврат СальдоПоСчету(Счет, "СуммаКонечныйОстатокКт", СальдоИОбороты);
	
КонецФункции

Функция СККР(Счет, СальдоИОбороты) Экспорт
	
	Возврат СальдоПоСчету(Счет, "СуммаКонечныйРазвернутыйОстатокКт", СальдоИОбороты);
	
КонецФункции

Функция РазделенноеСальдоСчета_02_01(НачалоПериода, КонецПериода, Организация) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК ОС,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК СуммаКонечныйОстатокДт
	               |ПОМЕСТИТЬ ВТ_Сальдо_01_01
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачПериода, &КонПериода, Период, , Счет = &Счет01_01, &ВидыСубконто, Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК ОС,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК СуммаКонечныйОстатокДт
	               |ПОМЕСТИТЬ ВТ_Сальдо_01_08
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачПериода, &КонПериода, Период, , Счет = &Счет01_08, &ВидыСубконто, Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК ОС,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокКт
	               |ПОМЕСТИТЬ ВТ_Амортизация
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачПериода, &КонПериода, Период, , Счет = &Счет02_01, &ВидыСубконто, Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ВТ_Сальдо_01_01.СуммаКонечныйОстатокДт ЕСТЬ NULL 
	               |			ТОГДА 0
	               |		ИНАЧЕ ВТ_Амортизация.СуммаКонечныйОстатокКт
	               |	КОНЕЦ КАК СКК_02_01__01_01,
	               |	ВЫБОР
	               |		КОГДА ВТ_Сальдо_01_01.СуммаКонечныйОстатокДт ЕСТЬ NULL 
	               |				И НЕ ВТ_Сальдо_01_08.СуммаКонечныйОстатокДт ЕСТЬ NULL 
	               |			ТОГДА ВТ_Амортизация.СуммаКонечныйОстатокКт
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СКК_02_01__01_08
	               |ИЗ
	               |	ВТ_Амортизация КАК ВТ_Амортизация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сальдо_01_01 КАК ВТ_Сальдо_01_01
	               |		ПО ВТ_Амортизация.ОС = ВТ_Сальдо_01_01.ОС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сальдо_01_08 КАК ВТ_Сальдо_01_08
	               |		ПО ВТ_Амортизация.ОС = ВТ_Сальдо_01_08.ОС
	               |ИТОГИ
	               |	СУММА(СКК_02_01__01_01),
	               |	СУММА(СКК_02_01__01_08)
	               |ПО
	               |	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("НачПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонПериода", КонецПериода);
	Запрос.УстановитьПараметр("ВидыСубконто", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Счет01_01", Счет("01.01"));
	Запрос.УстановитьПараметр("Счет01_08", Счет("01.08"));
	Запрос.УстановитьПараметр("Счет02_01", Счет("02.01"));
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("СКК_02_01__01_01", 0);
	ВозвращаемоеЗначение.Вставить("СКК_02_01__01_08", 0);
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ВозвращаемоеЗначение, Выборка);
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция РазделенноеСальдоСчета_02_02(НачалоПериода, КонецПериода, Организация) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК ОС,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК СуммаКонечныйОстатокДт
	               |ПОМЕСТИТЬ ВТ_Сальдо_03_01
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачПериода, &КонПериода, Период, , Счет = &Счет03_01, &ВидыСубконто, Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК ОС,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК СуммаКонечныйОстатокДт
	               |ПОМЕСТИТЬ ВТ_Сальдо_03_02
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачПериода, &КонПериода, Период, , Счет = &Счет03_02, &ВидыСубконто, Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК ОС,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК СуммаКонечныйОстатокДт
	               |ПОМЕСТИТЬ ВТ_Сальдо_03_03
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачПериода, &КонПериода, Период, , Счет = &Счет03_03, &ВидыСубконто, Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК ОС,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК СуммаКонечныйОстатокДт
	               |ПОМЕСТИТЬ ВТ_Сальдо_03_04
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачПериода, &КонПериода, Период, , Счет = &Счет03_04, &ВидыСубконто, Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК ОС,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокКт
	               |ПОМЕСТИТЬ ВТ_Амортизация
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачПериода, &КонПериода, Период, , Счет = &Счет02_02, &ВидыСубконто, Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ОС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ВТ_Сальдо_03_01.СуммаКонечныйОстатокДт ЕСТЬ NULL 
	               |			ТОГДА 0
	               |		ИНАЧЕ ВТ_Амортизация.СуммаКонечныйОстатокКт
	               |	КОНЕЦ КАК СКК_02_02__03_01,
	               |	ВЫБОР
	               |		КОГДА ВТ_Сальдо_03_01.СуммаКонечныйОстатокДт ЕСТЬ NULL 
	               |				И НЕ ВТ_Сальдо_03_02.СуммаКонечныйОстатокДт ЕСТЬ NULL 
	               |			ТОГДА ВТ_Амортизация.СуммаКонечныйОстатокКт
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СКК_02_02__03_02,
	               |	ВЫБОР
	               |		КОГДА ВТ_Сальдо_03_01.СуммаКонечныйОстатокДт ЕСТЬ NULL 
	               |				И ВТ_Сальдо_03_02.СуммаКонечныйОстатокДт ЕСТЬ NULL 
	               |				И НЕ ВТ_Сальдо_03_03.СуммаКонечныйОстатокДт ЕСТЬ NULL 
	               |			ТОГДА ВТ_Амортизация.СуммаКонечныйОстатокКт
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СКК_02_02__03_03,
	               |	ВЫБОР
	               |		КОГДА ВТ_Сальдо_03_01.СуммаКонечныйОстатокДт ЕСТЬ NULL 
	               |				И ВТ_Сальдо_03_02.СуммаКонечныйОстатокДт ЕСТЬ NULL 
	               |				И ВТ_Сальдо_03_03.СуммаКонечныйОстатокДт ЕСТЬ NULL 
	               |				И НЕ ВТ_Сальдо_03_04.СуммаКонечныйОстатокДт ЕСТЬ NULL 
	               |			ТОГДА ВТ_Амортизация.СуммаКонечныйОстатокКт
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СКК_02_02__03_04
	               |ИЗ
	               |	ВТ_Амортизация КАК ВТ_Амортизация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сальдо_03_01 КАК ВТ_Сальдо_03_01
	               |		ПО ВТ_Амортизация.ОС = ВТ_Сальдо_03_01.ОС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сальдо_03_02 КАК ВТ_Сальдо_03_02
	               |		ПО ВТ_Амортизация.ОС = ВТ_Сальдо_03_02.ОС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сальдо_03_03 КАК ВТ_Сальдо_03_03
	               |		ПО ВТ_Амортизация.ОС = ВТ_Сальдо_03_03.ОС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сальдо_03_04 КАК ВТ_Сальдо_03_04
	               |		ПО ВТ_Амортизация.ОС = ВТ_Сальдо_03_04.ОС
	               |ИТОГИ
	               |	СУММА(СКК_02_02__03_01),
	               |	СУММА(СКК_02_02__03_02),
	               |	СУММА(СКК_02_02__03_03),
	               |	СУММА(СКК_02_02__03_04)
	               |ПО
	               |	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("НачПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонПериода", КонецПериода);
	Запрос.УстановитьПараметр("ВидыСубконто", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Счет03_01", Счет("03.01"));
	Запрос.УстановитьПараметр("Счет03_02", Счет("03.02"));
	Запрос.УстановитьПараметр("Счет03_03", Счет("03.03"));
	Запрос.УстановитьПараметр("Счет03_04", Счет("03.04"));
	Запрос.УстановитьПараметр("Счет02_02", Счет("02.02"));
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("СКК_02_02__03_01", 0);
	ВозвращаемоеЗначение.Вставить("СКК_02_02__03_02", 0);
	ВозвращаемоеЗначение.Вставить("СКК_02_02__03_03", 0);
	ВозвращаемоеЗначение.Вставить("СКК_02_02__03_04", 0);
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ВозвращаемоеЗначение, Выборка);
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция РазделенноеСальдоСчета_97(НачалоПериода, КонецПериода, Организация) Экспорт
	
	СтруктураСальдо97 = Новый Соответствие;
	Для Каждого ВидАктиваРБП Из Перечисления.ВидыАктивовДляРБП Цикл
		СтруктураСальдо97.Вставить(ВидАктиваРБП, 0);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходыБудущихПериодов.Ссылка КАК РБП,
	|	ВЫБОР
	|		КОГДА РасходыБудущихПериодов.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляРБП.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляРБП.ПрочиеОборотныеАктивы)
	|		ИНАЧЕ РасходыБудущихПериодов.ВидАктива
	|	КОНЕЦ КАК ВидАктива
	|ПОМЕСТИТЬ ВТ_ВидыАктивовРБП
	|ИЗ
	|	ПланВидовХарактеристик.СтатьиРасходов КАК РасходыБудущихПериодов
	|ГДЕ
	|	РасходыБудущихПериодов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	|	
	|ИНДЕКСИРОВАТЬ ПО
	|	РБП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК РБП,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК СуммаКонечныйОстатокДт
	|ПОМЕСТИТЬ ВТ_Сальдо
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачПериода, &КонПериода, Период, Движения, Счет В (&СчетаРБП), &ВидСубконтоРБП, Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РБП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ВидыАктивовРБП.ВидАктива, ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляРБП.ПрочиеОборотныеАктивы)) КАК ВидАктиваРБП,
	|	СУММА(ВТ_Сальдо.СуммаКонечныйОстатокДт) КАК СуммаКонечныйОстатокДт
	|ИЗ
	|	ВТ_Сальдо КАК ВТ_Сальдо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВидыАктивовРБП КАК ВТ_ВидыАктивовРБП
	|		ПО ВТ_Сальдо.РБП = ВТ_ВидыАктивовРБП.РБП
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ВТ_ВидыАктивовРБП.ВидАктива, ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляРБП.ПрочиеОборотныеАктивы))";
	
	Запрос.УстановитьПараметр("НачПериода",     НачалоПериода);
	Запрос.УстановитьПараметр("КонПериода",     КонецПериода);
	Запрос.УстановитьПараметр("ВидСубконтоРБП", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РасходыБудущихПериодов);
	Запрос.УстановитьПараметр("Организация",    Организация);
	Запрос.УстановитьПараметр("СчетаРБП",       БухгалтерскийУчетПовтИсп.СчетаВИерархии(Счет("97")));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураСальдо97.Вставить(Выборка.ВидАктиваРБП, Выборка.СуммаКонечныйОстатокДт);
	КонецЦикла;
	
	Возврат СтруктураСальдо97;
	
КонецФункции

Функция РазделенноеСальдоСчета_76(Субсчет, НачалоПериода, КонецПериода, Организация) Экспорт
	
	СтруктураСальдо = Новый Соответствие;
	Для Каждого ВидАктиваРБП Из Перечисления.ВидыАктивовДляРБП Цикл
		СтруктураСальдо.Вставить(ВидАктиваРБП, 0);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасходыБудущихПериодов.Ссылка КАК РБП,
	               |	ВЫБОР
	               |		КОГДА РасходыБудущихПериодов.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляРБП.ПустаяСсылка)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляРБП.ПрочиеОборотныеАктивы)
	               |		ИНАЧЕ РасходыБудущихПериодов.ВидАктива
	               |	КОНЕЦ КАК ВидАктива
	               |ПОМЕСТИТЬ ВТ_ВидыАктивовРБП
	               |ИЗ
	               |	ПланВидовХарактеристик.СтатьиРасходов КАК РасходыБудущихПериодов
	               |ГДЕ
	               |	РасходыБудущихПериодов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	РБП
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Контрагент,
	               |	ХозрасчетныйОстаткиИОбороты.Субконто2 КАК РБП,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК СуммаКонечныйОстатокДт
	               |ПОМЕСТИТЬ ВТ_Сальдо
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачПериода, &КонПериода, Период, Движения, Счет = &СчетРБП, , Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	РБП
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ВТ_ВидыАктивовРБП.ВидАктива, ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляРБП.ПрочиеОборотныеАктивы)) КАК ВидАктиваРБП,
	               |	ВТ_Сальдо.Контрагент КАК Контрагент,
	               |	ВТ_Сальдо.СуммаКонечныйОстатокДт КАК СуммаКонечныйОстатокДт
	               |ИЗ
	               |	ВТ_Сальдо КАК ВТ_Сальдо
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВидыАктивовРБП КАК ВТ_ВидыАктивовРБП
	               |		ПО ВТ_Сальдо.РБП = ВТ_ВидыАктивовРБП.РБП
	               |ИТОГИ
	               |	СУММА(СуммаКонечныйОстатокДт)
	               |ПО
	               |	ВидАктиваРБП";
	
	Запрос.УстановитьПараметр("НачПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонПериода", КонецПериода);
	Запрос.УстановитьПараметр("ВидСубконтоРБП", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РасходыБудущихПериодов);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетРБП", Субсчет);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		СтруктураСальдо.Вставить(Выборка.ВидАктиваРБП, Выборка.СуммаКонечныйОстатокДт);
	КонецЦикла;
	
	Возврат СтруктураСальдо;
	
КонецФункции

Функция ДанныеСчета97ПоВидуАктива(ВидАктиваРБП, Организация, ДатаНачалаПериодаОтчета, ДатаКонцаПериодаОтчета) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокДт КАК СНД,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт КАК ДО,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК КО,
	               |	СУММА(ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт) КАК СКД
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	               |			&НачПериода,
	               |			&КонПериода,
	               |			Период,
	               |			Движения,
	               |			Счет В (&СчетаРБП),
	               |			&ВидСубконтоРБП,
	               |			Организация = &Организация
	               |				И Субконто1.ВидАктива = &ВидАктива) КАК ХозрасчетныйОстаткиИОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокДт,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
	               |	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт";
	
	Запрос.УстановитьПараметр("НачПериода",     ДатаНачалаПериодаОтчета);
	Запрос.УстановитьПараметр("КонПериода",     ДатаКонцаПериодаОтчета);
	Запрос.УстановитьПараметр("ВидСубконтоРБП", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РасходыБудущихПериодов);
	Запрос.УстановитьПараметр("ВидАктива",      ВидАктиваРБП);
	Запрос.УстановитьПараметр("Организация",    Организация);
	Запрос.УстановитьПараметр("СчетаРБП",       БухгалтерскийУчетПовтИсп.СчетаВИерархии(Счет("97")));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Структура;
	Результат.Вставить("СНД", 0);
	Результат.Вставить("ДО",  0);
	Результат.Вставить("КО",  0);
	Результат.Вставить("СКД", 0);
	
	Если Выборка.Следующий() Тогда
		Результат.СНД = Выборка.СНД;
		Результат.ДО  = Выборка.ДО;
		Результат.КО  = Выборка.КО;
		Результат.СКД = Выборка.СКД;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОборотыСчета99_01ПоАналитике(ПараметрыИтогов) Экспорт
	
	Организация   = ПараметрыИтогов.Организация;
	НачалоПериода = ПараметрыИтогов.НачалоПериода;
	КонецПериода  = ПараметрыИтогов.КонецПериода;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПрибылиИУбытки.Ссылка КАК ВидПрибылиИУбытка
	               |ПОМЕСТИТЬ ВТ_ВидыПрибылейИУбытков
	               |ИЗ
	               |	Перечисление.ПрибылиИУбытки КАК ПрибылиИУбытки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОбороты.Субконто1 КАК ВидПрибылиУбытка,
	               |	ХозрасчетныйОбороты.СуммаОборотДт КАК ДО,
	               |	ХозрасчетныйОбороты.СуммаОборотКт КАК КО
	               |ПОМЕСТИТЬ ВТ_Обороты
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачПериода, &КонПериода, Период, Счет В (&Счета), &ВидСубконто, Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВидыПрибылейИУбытков.ВидПрибылиИУбытка КАК ВидПрибылиИУбытка,
	               |	ЕСТЬNULL(ВТ_Обороты.ДО, 0) КАК ДО,
	               |	ЕСТЬNULL(ВТ_Обороты.КО, 0) КАК КО
	               |ИЗ
	               |	ВТ_ВидыПрибылейИУбытков КАК ВТ_ВидыПрибылейИУбытков
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Обороты КАК ВТ_Обороты
	               |		ПО ВТ_ВидыПрибылейИУбытков.ВидПрибылиИУбытка = ВТ_Обороты.ВидПрибылиУбытка";
	
	Запрос.УстановитьПараметр("НачПериода",  НачалоПериода);
	Запрос.УстановитьПараметр("КонПериода",  КонецПериода);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Счета",       БухгалтерскийУчетПовтИсп.СчетаВИерархии(Счет("99.01")));
	Запрос.УстановитьПараметр("ВидСубконто", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрибылиИУбытки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураОборотов = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		СтруктураОборотов.Вставить(Выборка.ВидПрибылиИУбытка , Новый Структура("ДО, КО", Выборка.ДО, Выборка.КО));
	КонецЦикла;
	
	Возврат СтруктураОборотов;
	
КонецФункции

Функция Обороты91ПоПереоценке(ПараметрыИтогов) Экспорт
	
	Организация   = ПараметрыИтогов.Организация;
	НачалоПериода = ПараметрыИтогов.НачалоПериода;
	КонецПериода  = ПараметрыИтогов.КонецПериода;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Хозрасчетный.Ссылка КАК Счет
	               |ПОМЕСТИТЬ ВТ_Счета
	               |ИЗ
	               |	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	               |ГДЕ
	               |	Хозрасчетный.Ссылка В ИЕРАРХИИ(&Счета)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Счет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Хозрасчетный.Ссылка КАК Счет
	               |ПОМЕСТИТЬ ВТ_КорСчета1
	               |ИЗ
	               |	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	               |ГДЕ
	               |	Хозрасчетный.Ссылка В ИЕРАРХИИ(&КорСчета1)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Счет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Хозрасчетный.Ссылка КАК Счет
	               |ПОМЕСТИТЬ ВТ_КорСчета2
	               |ИЗ
	               |	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	               |ГДЕ
	               |	Хозрасчетный.Ссылка В ИЕРАРХИИ(&КорСчета2)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Счет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СуммированиеДанных.Счет,
	               |	СУММА(СуммированиеДанных.СуммаОборотДт1) КАК СуммаОборотДт1,
	               |	СУММА(СуммированиеДанных.СуммаОборотКт1) КАК СуммаОборотКт1,
	               |	СУММА(СуммированиеДанных.СуммаОборотДт2) КАК СуммаОборотДт2,
	               |	СУММА(СуммированиеДанных.СуммаОборотКт2) КАК СуммаОборотКт2
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ХозрасчетныйОбороты.Счет КАК Счет,
	               |		ХозрасчетныйОбороты.СуммаОборотДт КАК СуммаОборотДт1,
	               |		ХозрасчетныйОбороты.СуммаОборотКт КАК СуммаОборотКт1,
	               |		0 КАК СуммаОборотДт2,
	               |		0 КАК СуммаОборотКт2
	               |	ИЗ
	               |		РегистрБухгалтерии.Хозрасчетный.Обороты(
	               |				&НачПериода,
	               |				&КонПериода,
	               |				ПЕРИОД,
	               |				Счет В
	               |					(ВЫБРАТЬ
	               |						ВТ_Счета.Счет
	               |					ИЗ
	               |						ВТ_Счета КАК ВТ_Счета),
	               |				&ВидСубконто,
	               |				Организация = &Организация,
	               |				КорСчет В
	               |					(ВЫБРАТЬ
	               |						ВТ_КорСчета1.Счет
	               |					ИЗ
	               |						ВТ_КорСчета1 КАК ВТ_КорСчета1),
	               |				) КАК ХозрасчетныйОбороты
	               |	ГДЕ
	               |		ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК ПланВидовХарактеристик.СтатьиДоходов).ВидПрочихДоходов = &ВидПрочихДоходовИРасходов
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ХозрасчетныйОбороты.Счет,
	               |		0,
	               |		0,
	               |		ХозрасчетныйОбороты.СуммаОборотДт,
	               |		ХозрасчетныйОбороты.СуммаОборотКт
	               |	ИЗ
	               |		РегистрБухгалтерии.Хозрасчетный.Обороты(
	               |				&НачПериода,
	               |				&КонПериода,
	               |				ПЕРИОД,
	               |				Счет В
	               |					(ВЫБРАТЬ
	               |						ВТ_Счета.Счет
	               |					ИЗ
	               |						ВТ_Счета КАК ВТ_Счета),
	               |				&ВидСубконто,
	               |				Организация = &Организация,
	               |				КорСчет В
	               |					(ВЫБРАТЬ
	               |						ВТ_КорСчета2.Счет
	               |					ИЗ
	               |						ВТ_КорСчета2 КАК ВТ_КорСчета2),
	               |				) КАК ХозрасчетныйОбороты
	               |	ГДЕ
	               |		ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ВидПрочихРасходов = &ВидПрочихДоходовИРасходов) КАК СуммированиеДанных
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СуммированиеДанных.Счет";
	
	Счет_91_01 = Счет("91.01");
	Счет_91_02 = Счет("91.02");
	
	Счета = Новый Массив();
	Счета.Добавить(Счет_91_01);
	Счета.Добавить(Счет_91_02);
	
	КорСчета1 = Новый Массив();
	КорСчета1.Добавить(Счет("01"));
	КорСчета1.Добавить(Счет("03"));
	КорСчета1.Добавить(Счет("04"));
	
	КорСчета2 = Новый Массив();
	КорСчета2.Добавить(Счет("02"));
	КорСчета2.Добавить(Счет("05"));
	
	Запрос.УстановитьПараметр("НачПериода",  НачалоПериода);
	Запрос.УстановитьПараметр("КонПериода",  КонецПериода);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Счета",       Счета);
	Запрос.УстановитьПараметр("КорСчета1",   КорСчета1);
	Запрос.УстановитьПараметр("КорСчета2",   КорСчета2);
	Запрос.УстановитьПараметр("ВидСубконто", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы);
	Запрос.УстановитьПараметр("ВидПрочихДоходовИРасходов", Перечисления.ВидыПрочихДоходовИРасходов.ПереоценкаВнеоборотныхАктивов);
	
	КО_91_01__010304_ПереоценкаВнеоборотныхАктивов = 0;
	КО_91_01__0205_ПереоценкаВнеоборотныхАктивов   = 0;
	ДО_91_02__010304_ПереоценкаВнеоборотныхАктивов = 0;
	ДО_91_02__0205_ПереоценкаВнеоборотныхАктивов   = 0;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Счет = Счет_91_01 Тогда
			КО_91_01__010304_ПереоценкаВнеоборотныхАктивов = Выборка.СуммаОборотКт1;
			КО_91_01__0205_ПереоценкаВнеоборотныхАктивов   = Выборка.СуммаОборотКт2;
		ИначеЕсли Выборка.Счет = Счет_91_02 Тогда
			ДО_91_02__010304_ПереоценкаВнеоборотныхАктивов = Выборка.СуммаОборотДт1;
			ДО_91_02__0205_ПереоценкаВнеоборотныхАктивов   = Выборка.СуммаОборотДт2;
		КонецЕсли;
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("КО_91_01__010304_ПереоценкаВнеоборотныхАктивов", КО_91_01__010304_ПереоценкаВнеоборотныхАктивов);
	Результат.Вставить("КО_91_01__0205_ПереоценкаВнеоборотныхАктивов",   КО_91_01__0205_ПереоценкаВнеоборотныхАктивов);
	Результат.Вставить("ДО_91_02__010304_ПереоценкаВнеоборотныхАктивов", ДО_91_02__010304_ПереоценкаВнеоборотныхАктивов);
	Результат.Вставить("ДО_91_02__0205_ПереоценкаВнеоборотныхАктивов",   ДО_91_02__0205_ПереоценкаВнеоборотныхАктивов);
	
	Возврат Результат;
	
КонецФункции

Функция Обороты91ПоВПДР(ПараметрыИтогов) Экспорт
	
	Организация   = ПараметрыИтогов.Организация;
	НачалоПериода = ПараметрыИтогов.НачалоПериода;
	КонецПериода  = ПараметрыИтогов.КонецПериода;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыПрочихДоходовИРасходов.Ссылка КАК ВПДР
	               |ПОМЕСТИТЬ ВТ_ВПДР
	               |ИЗ
	               |	Перечисление.ВидыПрочихДоходовИРасходов КАК ВидыПрочихДоходовИРасходов
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ВПДР
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОбъединениеДанных.ВПДР КАК ВПДР,
	               |	СУММА(ОбъединениеДанных.КО_91_01) КАК КО_91_01,
	               |	СУММА(ОбъединениеДанных.ДО_91_02) КАК ДО_91_02,
	               |	СУММА(ОбъединениеДанных.ДО_91_02__68_02) КАК ДО_91_02__68_02
	               |ПОМЕСТИТЬ ВТ_ОборотыПоСчетам
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК ПланВидовХарактеристик.СтатьиДоходов).ВидПрочихДоходов КАК ВПДР,
	               |		ХозрасчетныйОбороты.СуммаОборотКт КАК КО_91_01,
	               |		0 КАК ДО_91_02,
	               |		0 КАК ДО_91_02__68_02
	               |	ИЗ
	               |		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачПериода, &КонПериода, Период, Счет = &Счет91_01, &СубконтроПрочихДоходовИРасходов, Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ВидПрочихРасходов,
	               |		0,
	               |		ХозрасчетныйОбороты.СуммаОборотДт,
	               |		0
	               |	ИЗ
	               |		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачПериода, &КонПериода, Период, Счет = &Счет91_02, &СубконтроПрочихДоходовИРасходов, Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ВидПрочихРасходов,
	               |		0,
	               |		0,
	               |		ХозрасчетныйОбороты.СуммаОборотДт
	               |	ИЗ
	               |		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачПериода, &КонПериода, Период, Счет = &Счет91_02, &СубконтроПрочихДоходовИРасходов, Организация = &Организация, КорСчет = &Счет68_02, ) КАК ХозрасчетныйОбороты) КАК ОбъединениеДанных
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОбъединениеДанных.ВПДР
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ВПДР
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВПДР.ВПДР КАК ВПДР,
	               |	ЕСТЬNULL(ВТ_ОборотыПоСчетам.КО_91_01, 0) КАК КО_91_01,
	               |	ЕСТЬNULL(ВТ_ОборотыПоСчетам.ДО_91_02, 0) КАК ДО_91_02,
	               |	ЕСТЬNULL(ВТ_ОборотыПоСчетам.ДО_91_02__68_02, 0) КАК ДО_91_02__68_02
	               |ИЗ
	               |	ВТ_ВПДР КАК ВТ_ВПДР
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОборотыПоСчетам КАК ВТ_ОборотыПоСчетам
	               |		ПО ВТ_ВПДР.ВПДР = ВТ_ОборотыПоСчетам.ВПДР";
	
	Запрос.УстановитьПараметр("НачПериода",  НачалоПериода);
	Запрос.УстановитьПараметр("КонПериода",  КонецПериода);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Счет91_01",   Счет("91.01"));
	Запрос.УстановитьПараметр("Счет91_02",   Счет("91.02"));
	Запрос.УстановитьПараметр("Счет68_02",   Счет("68.02"));
	Запрос.УстановитьПараметр("СубконтроПрочихДоходовИРасходов", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы);
	
	КО_91_01_ВПДР = Новый Структура;
	ДО_91_02_ВПДР = Новый Структура;
	ДО_91_02__68_02_ВПДР = Новый Структура;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ИндексВидаПДР = Перечисления.ВидыПрочихДоходовИРасходов.Индекс(Выборка.ВПДР);
		ИмяВидаПДР = Метаданные.Перечисления.ВидыПрочихДоходовИРасходов.ЗначенияПеречисления[ИндексВидаПДР].Имя;
		КО_91_01_ВПДР.Вставить(ИмяВидаПДР, Выборка.КО_91_01);
		ДО_91_02_ВПДР.Вставить(ИмяВидаПДР, Выборка.ДО_91_02);
		ДО_91_02__68_02_ВПДР.Вставить(ИмяВидаПДР, Выборка.ДО_91_02__68_02);
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("КО_91_01_ВПДР", КО_91_01_ВПДР);
	Результат.Вставить("ДО_91_02_ВПДР", ДО_91_02_ВПДР);
	Результат.Вставить("ДО_91_02__68_02_ВПДР", ДО_91_02__68_02_ВПДР);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СальдоПоСчету(Знач Счет, Знач ВидОстатка, СальдоИОбороты)
	
	Если ТипЗнч(Счет) = Тип("Строка") Тогда
		Счет = Счет(Счет); // Приведение к ссылочному типу
	КонецЕсли;
	
	СтрокиПоСчету = СальдоИОбороты.НайтиСтроки(Новый Структура("Счет", Счет));
	
	Сальдо = 0;
	
	Если СтрокиПоСчету.Количество() <> 0 Тогда
		ТипСальдо = Прав(ВидОстатка, 2);
		
		Если СтрокиПоСчету[0].ВидСчета = ВидСчета.Активный И СтрНайти(ВидОстатка, "Развернутый") = 0 Тогда
			ВидОстаткаДополнительный = СтрЗаменить(ВидОстатка, "Дт", "Кт");
			Сальдо = СтрокиПоСчету[0][ВидОстатка] - СтрокиПоСчету[0][ВидОстаткаДополнительный];
			
			Если ТипСальдо = "Кт" Тогда
				ОписаниеОшибки = "Обращение к кредитовому остатку активного счета с кодом " + Счет.Код;
			КонецЕсли;
			
		ИначеЕсли СтрокиПоСчету[0].ВидСчета = ВидСчета.Пассивный И СтрНайти(ВидОстатка, "Развернутый") = 0 Тогда
			ВидОстаткаДополнительный = СтрЗаменить(ВидОстатка, "Кт", "Дт");
			Сальдо = СтрокиПоСчету[0][ВидОстатка] - СтрокиПоСчету[0][ВидОстаткаДополнительный];
			
			Если ТипСальдо = "Дт" Тогда
				ОписаниеОшибки = "Обращение к дебетовому остатку пассивного счета с кодом " + Счет.Код;
			КонецЕсли;
			
		Иначе
			Сальдо = СтрокиПоСчету[0][ВидОстатка];
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Сальдо;
	
КонецФункции

Функция ОборотПоСчету(Знач Счет, Знач ВидОстатка, СальдоИОбороты)
	
	Если ТипЗнч(Счет) = Тип("Строка") Тогда
		Счет = Счет(Счет); // Приведение к ссылочному типу
	КонецЕсли;
	
	СтрокиПоСчету = СальдоИОбороты.НайтиСтроки(Новый Структура("Счет", Счет));
	
	Сальдо = 0;
	
	Если СтрокиПоСчету.Количество() <> 0 Тогда
		Сальдо = СтрокиПоСчету[0][ВидОстатка];
	КонецЕсли;
	
	Возврат Сальдо;
	
КонецФункции

#КонецОбласти
