&НаКлиенте
Перем ОбработкаКС Экспорт;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Обход ошибки платформы "Параметр сеанса отсутствует или удален".
	ТабличныйДокумент.Очистить();
	
	СформироватьСтруктуруРеквизитовФормы();
	
	СоответствиеЕдиницыИзмеренияДелителю = Новый Структура;
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1", 1);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000", 1000);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000000", 1000000);
	
	//+
	// ОПИСАНИЕ ПАРАМЕТРОВ МНОГОСТРОЧНЫХ ГРУПП
	// Идентификаторы многострочных групп
	СтруктураРеквизитовФормы.мИдГруппы11  = "П0001100002";
	СтруктураРеквизитовФормы.мИдГруппы12  = "П0001200002";
	
	//700.02
	КолИсхСтрокИдГруппы11  = 1;
	КолИсхСтрокИдГруппы12  = 1;
		
	//700.02
	КолКолонокИдГруппы11 = 5;
	КолКолонокИдГруппы12 = 3;
	
	//-
	
	СтруктураДанныхФорма70101Страница1        = Новый Структура;
	СтруктураДанныхФорма70101Страница2        = Новый Структура;
	
	СтруктураДанныхФорма70101_001Страница1    = Новый Структура;
	СтруктураДанныхФорма70101_001Страница2    = Новый Структура;
	
	//+
	// структура многострочных разделов формы
	мСтруктураМногострочныхРазделов = Новый Структура;
	//70101.001
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы11,  СтруктураРеквизитовФормы.мИдГруппы11);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы12,  СтруктураРеквизитовФормы.мИдГруппы12);

	// Структура содержит данные дополнительных страниц
	мСтруктураМногостраничныхРазделов = Новый Структура;
	
	// структура исходных строк (минимального кол-ва) многострочных разделов формы
	мСтруктураИсхКолвоСтрокРазделов = Новый Структура;
	
	//70101.001
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы11, КолИсхСтрокИдГруппы11);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы12, КолИсхСтрокИдГруппы12);

	мСтруктураКолвоКолонокРазделов = Новый Структура;
	
	//70101.001
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы11, КолКолонокИдГруппы11);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы12, КолКолонокИдГруппы12);
	//-
	
	СтруктураРеквизитовФормы.СписокПечатаемыхЛистов = Новый СписокЗначений;
	СтруктураРеквизитовФормы.мПечатныеформы = Новый СписокЗначений;
	
	СтруктураРеквизитовФормы.мВыбраннаяФорма          = Параметры.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета  = Параметры.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета = Параметры.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мПериодичность           = Параметры.мПериодичность;
	СтруктураРеквизитовФормы.мСкопированаФорма        = Параметры.мСкопированаФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок          = Параметры.мСохраненныйДок;
	СтруктураРеквизитовФормы.Организация              = Параметры.Организация;
	СтруктураРеквизитовФормы.НалоговыйКомитет         = Параметры.НалоговыйКомитет;
	СтруктураРеквизитовФормы.ВидРасчета               = Параметры.ВидРасчета;
	СтруктураРеквизитовФормы.ВидДокумента = 0;
	
	ИмяРаздела = "Форма70101Страница1";
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(
		ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяРаздела));
	
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	
	СформироватьОтчетныйПериод();
	
	Инициализация(Параметры.БезОткрытияФормы);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруРеквизитовФормы()
	
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("Организация");
	СтруктураРеквизитовФормы.Вставить("ЕдиницаИзмерения");
	СтруктураРеквизитовФормы.Вставить("ТочностьЕдиницыИзмерения");
	СтруктураРеквизитовФормы.Вставить("мКвартал");
	СтруктураРеквизитовФормы.Вставить("мГод");
	СтруктураРеквизитовФормы.Вставить("мДатаНачалаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мДатаКонцаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мПериодичность");
	СтруктураРеквизитовФормы.Вставить("мСкопированаФорма");
	СтруктураРеквизитовФормы.Вставить("мСохраненныйДок");
	СтруктураРеквизитовФормы.Вставить("мВыбраннаяФорма");
	СтруктураРеквизитовФормы.Вставить("мЗаписываетсяНовыйДокумент");
	СтруктураРеквизитовФормы.Вставить("мВариант");
	СтруктураРеквизитовФормы.Вставить("мПроверятьСоотношенияПриПечатиИВыгрузки");
	СтруктураРеквизитовФормы.Вставить("СписокПечатаемыхЛистов");
	СтруктураРеквизитовФормы.Вставить("мРежимПечати");
	СтруктураРеквизитовФормы.Вставить("мСчетчикСтраниц");
	СтруктураРеквизитовФормы.Вставить("мПечатныеФормы");
	СтруктураРеквизитовФормы.Вставить("НаимТекущегоРаздела");
	СтруктураРеквизитовФормы.Вставить("ВидДокумента");
	СтруктураРеквизитовФормы.Вставить("мМетодРасчета");
	СтруктураРеквизитовФормы.Вставить("НалоговыйКомитет");
	СтруктураРеквизитовФормы.Вставить("ВидРасчета");
	
	СтруктураРеквизитовФормы.Вставить("мИдГруппы11");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы12");

	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСтраницОтчета() 
	
	// Дерево содержит коллекцию страниц отчета.
	мДеревоСтраницОтчета.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма70101Страница1";
	СтрокаУровня1.Представление            = "Форма 701.01 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма70101Страница2";
	СтрокаУровня1.Представление            = "Форма 701.01 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма70101_001Страница1";
	СтрокаУровня1.Представление            = "Форма 701.01.001 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма70101_001Страница2";
	СтрокаУровня1.Представление            = "Форма 701.01.001 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСвойствСтраниц() Экспорт
	
	мСвойстваРазделовДекларации.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	
	СтрокаУровня1.ИмяСтраницы                          = "Форма70101Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма70101Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма70101_001Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы11;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма70101_001Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы12;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоРазделовОтчетаНаСервере() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДеревоРазделовОтчетаНаКлиенте() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьДеревоРазделовОтчета(Форма)
	
	//Форма["РазделыОтчета"].ПолучитьЭлементы().Очистить();
	//
	//Для Каждого ЭлементДереваСтраницОтчета Из Форма["мДеревоСтраницОтчета"].ПолучитьЭлементы() Цикл
	//	
	//	Если ЭлементДереваСтраницОтчета.ПоказатьСтраницу = 1 Тогда
	//		Если ЭтоРазделРодитель(ЭлементДереваСтраницОтчета.ИмяСтраницы) Тогда
	//				
	//			ЭлементРазделовОтчета = Форма["РазделыОтчета"].ПолучитьЭлементы().Добавить();
	//			ЭлементРазделовОтчета.КолонкаРазделыОтчета = Лев(ЭлементДереваСтраницОтчета.Представление,12);
	//			ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим = ЭлементДереваСтраницОтчета.ИмяСтраницы;
	//			ЭлементРазделовОтчета.РазделМногострочный = МногострочныйРаздел(ЭлементДереваСтраницОтчета.ИмяСтраницы);
	//			
	//			Для НомерПодраздела = 1 По ПолучитьКоличествоПодразделовПоРодителю(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим) Цикл
	//				
	//				СтраницаРазделаОтчета = ЭлементРазделовОтчета.ПолучитьЭлементы().Добавить();
	//				
	//				СтраницаРазделаОтчета.КолонкаРазделыОтчета              = Лев(ЭлементДереваСтраницОтчета.Представление,СтрДлина(ЭлементДереваСтраницОтчета.Представление)-1) + НомерПодраздела;
	//				СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим      = Лев(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим, СтрДлина(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим)-1) + НомерПодраздела;
	//				СтраницаРазделаОтчета.РазделМногострочный               = ЭлементРазделовОтчета.РазделМногострочный;
	//			КонецЦикла;
	//			
	//		КонецЕсли;
	//КонецЦикла;
	//
	//
	
	Форма["РазделыОтчета"].ПолучитьЭлементы().Очистить();
	МассивНаименований = Новый Массив;
	
	Для Каждого ЭлементДереваСтраницОтчета Из Форма["мДеревоСтраницОтчета"].ПолучитьЭлементы() Цикл
		
		Если ЭлементДереваСтраницОтчета.ПоказатьСтраницу = 1 Тогда
			
			Если МассивНаименований.Найти(ЭлементДереваСтраницОтчета.ИмяСтраницы) = Неопределено Тогда 
				
				ЭлементРазделовОтчета = Форма["РазделыОтчета"].ПолучитьЭлементы().Добавить();
				Если СтрЧислоВхождений(ЭлементДереваСтраницОтчета.Представление, ".") = 2 Тогда
					ЭлементРазделовОтчета.КолонкаРазделыОтчета = Лев(ЭлементДереваСтраницОтчета.Представление,16);
				Иначе
					ЭлементРазделовОтчета.КолонкаРазделыОтчета = Лев(ЭлементДереваСтраницОтчета.Представление,12);
				КонецЕсли;
					
				ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим = ЭлементДереваСтраницОтчета.ИмяСтраницы;
				МассивНаименований.Добавить(ЭлементДереваСтраницОтчета.ИмяСтраницы);
				ЭлементРазделовОтчета.РазделМногострочный = МногострочныйРаздел(ЭлементДереваСтраницОтчета.ИмяСтраницы);
				
				Если ЭтоРазделРодитель(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим) Тогда
					
					Для НомерПодраздела = 1 По ПолучитьКоличествоПодразделовПоРодителю(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим) Цикл
						
						СтраницаРазделаОтчета = ЭлементРазделовОтчета.ПолучитьЭлементы().Добавить();
						
						СтраницаРазделаОтчета.КолонкаРазделыОтчета              = Лев(ЭлементДереваСтраницОтчета.Представление,СтрДлина(ЭлементДереваСтраницОтчета.Представление)-1) + НомерПодраздела;
						СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим      = Лев(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим, СтрДлина(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим)-1) + НомерПодраздела;
						МассивНаименований.Добавить(СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим);
						СтраницаРазделаОтчета.РазделМногострочный               = ЭлементРазделовОтчета.РазделМногострочный;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетныйПериод()
	
	СтрПериодОтчета = ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета,СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ФП = истина");
	
	СтруктураРеквизитовФормы.мКвартал = Лев(СтрПериодОтчета,1);
	СтруктураРеквизитовФормы.мГод = Лев(Прав(СтрПериодОтчета,7),4);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета()
	
	СтруктураЗависимыхЯчеекДляАвторасчета = Новый Структура;
	//701.01 Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("ВидРасчета", "Первоначальный;Очередной;Дополнительный;ПоУведомлению");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("КатегорияНалПл", "ПрименяющийСНР;ДовУправляющийУчредитель;ДовУправляющий;Недропользователь");
	
	//701.01 Стр2
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000210430905", "П000210430901;П000210430902;П000210430903;П000210430904;П000210430905");  //Зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000210410105", "П000210410101;П000210410102;П000210410103;П000210410104;П000210410105");  //Зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000210430205", "П000210430201;П000210430202;П000210430203;П000210430204;П000210430205");  //Зависимость самой от себя
	
	//70101_001 Страница2
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000120000103", "П000110000103;П000110000104;П000110000105;П000120000102");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000120000203", "П000110000203;П000110000204;П000110000205;П000120000202");

КонецПроцедуры

&НаСервере
Процедура Инициализация(БезОткрытияФормы = Ложь) Экспорт
	
	ФормироватьСтруктуруСтраницОтчета();
	ФормироватьСтруктуруСвойствСтраниц();
	СформироватьДеревоРазделовОтчетаНаСервере();
	ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета();
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
	Если СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		//+
		ЗаполнитьПустыеСтруктурыДанных();
		//-
		ЗаполнитьСведенияОбОрганизацииНаСервере();
		НачальныеОперацииСМногострочнымиБлоками();
		СтруктураРеквизитовФормы.ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
		СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 0;
		КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
		РасчетНаСервере("Форма70101Страница1", СтруктураРеквизитовФормы.ВидРасчета);
	Иначе
		ВосстановитьСохраненныеДанные();
		ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма70101Страница1");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизацииНаСервере()
	
	ЗаполнитьСведенияОбОрганизации(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизации(Форма)
	
	СтрокаСведений = "ИННЮЛ, НаимЮЛПол, ФИОРук";
	СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(СтруктураРеквизитовФормы.Организация,,СтрокаСведений);
	
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ИИН_БИН"].Значение) Тогда
		ТабличныйДокумент.Области["ИИН_БИН"].Значение = СведенияОбОрганизации.ИННЮЛ;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Год"].Значение) Тогда
		ТабличныйДокумент.Области["Год"].Значение = СтруктураРеквизитовФормы.мГод;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ОргНазв") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ОргНазв"].Значение) Тогда
		ТабличныйДокумент.Области["ОргНазв"].Значение = СведенияОбОрганизации.НаимЮЛПол;
		Если ТабличныйДокумент.Области.Найти("ОргНазв3") <> Неопределено Тогда
			КонецШага = 3;
		Иначе
			КонецШага = 2;
		КонецЕсли;
		НачПозиция = 1;
		Для Шаг = 1 По КонецШага Цикл
			ДлинаСтроки = ТабличныйДокумент.Области["ОргНазв" + Шаг].ТипЗначения.КвалификаторыСтроки.Длина;
			НазОрганизации = Сред(СведенияОбОрганизации.НаимЮЛПол, НачПозиция, ДлинаСтроки); 
			ТабличныйДокумент.Области["ОргНазв" + Шаг].Значение = НазОрганизации;
			НачПозиция =НачПозиция + ДлинаСтроки;
		КонецЦикла;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("Руководитель") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Руководитель"].Значение) Тогда
		ТабличныйДокумент.Области["Руководитель"].Значение = СведенияОбОрганизации.ФИОРук;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("КодНалоговогоОргана") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["КодНалоговогоОргана"].Значение) Тогда
		ТабличныйДокумент.Области["КодНалоговогоОргана"].Значение = СтруктураРеквизитовФормы.НалоговыйКомитет.Код;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ПоУведомлению") <> Неопределено Тогда
		
		Если ТабличныйДокумент.Области["ПоУведомлению"].Значение = "Х" Тогда
			ТабличныйДокумент.Области.НомерУведомления.Защита = Ложь;
			ТабличныйДокумент.Области.ДатаУведомления.Защита = Ложь;
		ИначеЕсли ТабличныйДокумент.Области["Очередной"].Значение = "" И
				  ТабличныйДокумент.Области["Дополнительный"].Значение = "" И 
				  ТабличныйДокумент.Области["Первоначальный"].Значение = "" Тогда
				
				ТабличныйДокумент.Области["Очередной"].Значение = "Х";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("КодВалюты") <> Неопределено Тогда
		
		ТабличныйДокумент.Области["КодВалюты"].Значение = "KZT";
		
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ДатаПодачи") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ДатаПодачи"].Значение) Тогда
		ТабличныйДокумент.Области.ДатаПодачи.Значение = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьСохраненныеДанные()
	
	Перем ДанныеМногострочныхРазделов;
	Перем ПоказателиОтчета;
	Перем НалоговыйКомитет;
		
	// восстанавливаем сохраненные данные отчета
	СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	
	// восстановим сохраненные данные редактируемых ячеек
	СписокСохранения.Свойство("ПоказателиОтчета", ПоказателиОтчета);
	СписокСохранения.Свойство("НалоговыйКомитет", НалоговыйКомитет);
	Если СписокСохранения.Свойство("ИсключатьИзОсновнойФормыСуммыПоАкиматам") Тогда
		СписокСохранения.Свойство("ИсключатьИзОсновнойФормыСуммыПоАкиматам", ИсключатьИзОсновнойФормыСуммыПоАкиматам);
	КонецЕсли;	
	
	//+
	Если СписокСохранения.Свойство( "ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов) Тогда
		
		Для Каждого ЭлементСтруктуры Из ДанныеМногострочныхРазделов Цикл
			
			НайденноеЗначение = Неопределено;
			мСтруктураМногострочныхРазделов.Свойство(ЭлементСтруктуры.Ключ, НайденноеЗначение);
			
			Если НЕ НайденноеЗначение = Неопределено Тогда
				ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, ЭтаФорма[НайденноеЗначение]);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	//-
	
	Префикс = "ПолеТабличногоДокумента";
	
	
	Для Каждого Раздел Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы] = ПоказателиОтчета[Префикс + Раздел.ИмяСтраницы];
		
	КонецЦикла;
	
	СформироватьДеревоРазделовОтчетаНаСервере();
	
	Комментарий = СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий;
	СтруктураРеквизитовФормы.НалоговыйКомитет = НалоговыйКомитет;
	СтруктураРеквизитовФормы.ЕдиницаИзмерения = СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения;
	
	Если СтруктураДанныхФорма70101Страница1.Дополнительный = "Х" Тогда
		СтруктураРеквизитовФормы.ВидРасчета = "Дополнительный";
	Иначе
		СтруктураРеквизитовФормы.ВидРасчета = "Очередной";
	КонецЕсли;
	
	РегламентированнаяОтчетность.ОперацииПриВосстановленииРегламентированногоОтчета(ЭтаФорма);
	
	КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделыОтчетаПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим, Элемент.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета);
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, 1);
	ЗаполнитьСведенияОбОрганизацииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетСтраницыВТабличныйДокументНаСервере(ИмяТекРаздела,НомерСтраницыРазделаОтчета = 1)
	
	ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела,НомерСтраницыРазделаОтчета) ;
	СтруктураРеквизитовФормы.НаимТекущегоРаздела  = ИмяТекРаздела;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела,НомерСтраницыРазделаОтчета)
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(
		ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяТекРаздела));
		
	//многострочные разделы
	Если ИмяТекРаздела = "Форма70101_001Страница1"
		ИЛИ ИмяТекРаздела = "Форма70101_001Страница2" Тогда
		
		СтруктураДанныхРаздела = ЭтаФорма["СтруктураДанных" + ИмяТекРаздела];
		
		Для Каждого ЭлСтруктуры Из СтруктураДанныхРаздела Цикл
			Попытка
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
		ТекТабличноеПоле = ЭтаФорма.ТабличныйДокумент;
		
		ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяТекРаздела);
		
		СтруктураГруппы = Неопределено;
		
		мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
		
		СтруктураГруппы = ЭтаФорма[СтруктураГруппы];
		
		ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
		
		ЕстьДопСтроки = Ложь;
		
		Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
			Если СтрЧислоВхождений(ОбластьТД.Имя, "_2") > 0 Тогда
				ЕстьДопСтроки = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьДопСтроки Тогда
			Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
				Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
					ОбластьТД.Гиперссылка = Истина;
					ОбластьТД.Текст = "х";
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
				Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
					ОбластьТД.Гиперссылка = Ложь;
					ОбластьТД.Текст = "";
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ЭтаФорма["СтруктураДанных" + ИмяТекРаздела]<> Неопределено Тогда
		
		Для Каждого ЭлСтруктуры Из ЭтаФорма["СтруктураДанных" + ИмяТекРаздела] Цикл
			Попытка
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеРаздела(НаимРаздела, ИзменятьАктивнуюСтраницу = Истина)
	
	// Многострочные разделы.
	Если НаимРаздела = "Форма70101_001Страница1"
		ИЛИ НаимРаздела = "Форма70101_001Страница2" Тогда
		
		ЭтаФорма["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");
		
		ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(НаимРаздела);
		
		ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппы);

	Иначе
		ЭтаФорма["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область)
	Модифицированность = Истина;
	
	ИмяРаздела = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
	
	РасчетНаКлиенте(ИмяРаздела,Область.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетНаКлиенте(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт

	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);

КонецПроцедуры

&НаСервере
Процедура РасчетНаСервере(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт

	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура Расчет(Форма, ИмяСтраницыПанели = "", ОбластьИмя = "")
	Перем ТаблицаСтраницРаздела;
	
	Если Форма.СтруктураРеквизитовФормы.мРежимПечати Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСтраницыПанели = "Форма70101Страница1" Тогда
		
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.ВидРасчета, ОбластьИмя) > 0 Тогда
			
			Первоначальный = "";
			Очередной =      "";
			Дополнительный = "";
			ПоУведомлению =  "";
			
			
			Если ОбластьИмя = "Первоначальный" Тогда
				Первоначальный = "Х";
			ИначеЕсли ОбластьИмя = "Очередной" Тогда
				Очередной = "Х";
			ИначеЕсли ОбластьИмя = "Дополнительный" Тогда
				Дополнительный = "Х";
			ИначеЕсли ОбластьИмя = "ПоУведомлению" Тогда
				ПоУведомлению = "Х";
			ИначеЕсли Форма.СтруктураРеквизитовФормы.ВидРасчета = "Дополнительный" И Не ЗначениеЗаполнено(ОбластьИмя) Тогда
				Дополнительный = "Х";
			Иначе
				Очередной = "Х";
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма70101Страница1.Вставить("Первоначальный", Первоначальный);
			Форма.СтруктураДанныхФорма70101Страница1.Вставить("Очередной",           Очередной);
			Форма.СтруктураДанныхФорма70101Страница1.Вставить("Дополнительный", Дополнительный);
			Форма.СтруктураДанныхФорма70101Страница1.Вставить("ПоУведомлению",   ПоУведомлению);
			Если Не ПоУведомлению = "Х" Тогда
				Форма.СтруктураДанныхФорма70101Страница1.Вставить("НомерУведомления", "");
				Форма.СтруктураДанныхФорма70101Страница1.Вставить("ДатаУведомления", "");
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница1" Тогда
				Форма.ТабличныйДокумент.Области.Первоначальный.Значение = Первоначальный;
				Форма.ТабличныйДокумент.Области.Очередной.Значение = Очередной;
				Форма.ТабличныйДокумент.Области.Дополнительный.Значение = Дополнительный;
				Форма.ТабличныйДокумент.Области.ПоУведомлению.Значение = ПоУведомлению;
				Если ПоУведомлению = "Х" Тогда
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Ложь;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Ложь;
				Иначе
					Форма.ТабличныйДокумент.Области.НомерУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Истина;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Истина;
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.КатегорияНалПл, ОбластьИмя) > 0 Тогда
			
			ПрименяющийСНР           = "";
			ДовУправляющийУчредитель = "";
			ДовУправляющий           = "";
			Недропользователь        = "";
			
			Если ОбластьИмя = "ПрименяющийСНР" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница1" Тогда
					ПрименяющийСНР = Форма.ТабличныйДокумент.Области.ПрименяющийСНР.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма70101Страница1.Свойство("ПрименяющийСНР") Тогда
					ПрименяющийСНР = Форма.СтруктураДанныхФорма70101Страница1.ПрименяющийСНР;
				КонецЕсли;
				
				ПрименяющийСНР = ?(ПрименяющийСНР = "Х","","Х");
				
				Форма.СтруктураДанныхФорма70101Страница1.Вставить("ПрименяющийСНР", ПрименяющийСНР);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница1" Тогда
					Форма.ТабличныйДокумент.Области.ПрименяющийСНР.Значение = ПрименяющийСНР;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "ДовУправляющийУчредитель" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница1" Тогда
					ДовУправляющийУчредитель = Форма.ТабличныйДокумент.Области.ДовУправляющийУчредитель.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма70101Страница1.Свойство("ДовУправляющийУчредитель") Тогда
					ДовУправляющийУчредитель = Форма.СтруктураДанныхФорма70101Страница1.ДовУправляющийУчредитель;
				КонецЕсли;
				
				ДовУправляющийУчредитель = ?(ДовУправляющийУчредитель = "Х","","Х");
				
				Форма.СтруктураДанныхФорма70101Страница1.Вставить("ДовУправляющийУчредитель", ДовУправляющийУчредитель);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница1" Тогда
					Форма.ТабличныйДокумент.Области.ДовУправляющийУчредитель.Значение = ДовУправляющийУчредитель;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "ДовУправляющий" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница1" Тогда
					ДовУправляющий = Форма.ТабличныйДокумент.Области.ДовУправляющий.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма70101Страница1.Свойство("ДовУправляющий") Тогда
					ДовУправляющий = Форма.СтруктураДанныхФорма70101Страница1.ДовУправляющий;
				КонецЕсли;
				
				ДовУправляющий = ?(ДовУправляющий = "Х","","Х");
				
				Форма.СтруктураДанныхФорма70101Страница1.Вставить("ДовУправляющий", ДовУправляющий);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница1" Тогда
					Форма.ТабличныйДокумент.Области.ДовУправляющий.Значение = ДовУправляющий;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Недропользователь" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница1" Тогда
					Недропользователь = Форма.ТабличныйДокумент.Области.Недропользователь.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма70101Страница1.Свойство("Недропользователь") Тогда
					Недропользователь = Форма.СтруктураДанныхФорма70101Страница1.Недропользователь;
				КонецЕсли;
				
				Недропользователь = ?(Недропользователь = "Х","","Х");
				
				Форма.СтруктураДанныхФорма70101Страница1.Вставить("Недропользователь", Недропользователь);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Недропользователь.Значение = Недропользователь;
				КонецЕсли;
				
				Если Не Недропользователь = "Х" Тогда
					Форма.СтруктураДанныхФорма70101Страница1.Вставить("НомерУведомления", "");
					Форма.СтруктураДанныхФорма70101Страница1.Вставить("ДатаУведомления", "");
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница1" Тогда
					Если Недропользователь = "Х" Тогда
						Форма.ТабличныйДокумент.Области.НомерКонтракта.Защита = Ложь;
						Форма.ТабличныйДокумент.Области.ДатаКонтракта.Защита = Ложь;
					Иначе
						Форма.ТабличныйДокумент.Области.НомерКонтракта.Значение = "";
						Форма.ТабличныйДокумент.Области.ДатаКонтракта.Значение = "";
						Форма.ТабличныйДокумент.Области.НомерКонтракта.Защита = Истина;
						Форма.ТабличныйДокумент.Области.ДатаКонтракта.Защита = Истина;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210430905, ОбластьИмя) > 0 Тогда
			
			ОкрП000210430901 = 0;
			ОкрП000210430902 = 0;
			ОкрП000210430903 = 0;
			ОкрП000210430904 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница1" Тогда
				ОкрП000210430901 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210430901.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница1.Свойство("П000210430901") Тогда
				ОкрП000210430901 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница1.П000210430901);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница1" Тогда
				ОкрП000210430902 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210430902.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница1.Свойство("П000210430902") Тогда
				ОкрП000210430902 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница1.П000210430902);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница2" Тогда
				ОкрП000210430903 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210430903.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница2.Свойство("П000210430903") Тогда
				ОкрП000210430903 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница2.П000210430903);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница2" Тогда
				ОкрП000210430904 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210430904.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница2.Свойство("П000210430904") Тогда
				ОкрП000210430904 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница2.П000210430904);
			КонецЕсли;
			
			П000210430905 = ОкрП000210430901 + ОкрП000210430902 + ОкрП000210430903 + ОкрП000210430904;
			
			Форма.СтруктураДанныхФорма70101Страница2.Вставить("П000210430905", П000210430905);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000210430905.Значение = П000210430905;
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210430205, ОбластьИмя) > 0 Тогда
			
			ОкрП000210430201 = 0;
			ОкрП000210430202 = 0;
			ОкрП000210430203 = 0;
			ОкрП000210430204 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница1" Тогда
				ОкрП000210430201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210430201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница1.Свойство("П000210430201") Тогда
				ОкрП000210430201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница1.П000210430201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница1" Тогда
				ОкрП000210430202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210430202.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница1.Свойство("П000210430202") Тогда
				ОкрП000210430202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница1.П000210430202);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница2" Тогда
				ОкрП000210430203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210430203.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница2.Свойство("П000210430203") Тогда
				ОкрП000210430203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница2.П000210430203);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница2" Тогда
				ОкрП000210430204 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210430204.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница2.Свойство("П000210430204") Тогда
				ОкрП000210430204 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница2.П000210430204);
			КонецЕсли;
			
			П000210430205 = ОкрП000210430201 + ОкрП000210430202 + ОкрП000210430203 + ОкрП000210430204;
			
			Форма.СтруктураДанныхФорма70101Страница2.Вставить("П000210430205", П000210430205);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000210430205.Значение = П000210430205;
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210410105, ОбластьИмя) > 0 Тогда
			
			ОкрП000210410101 = 0;
			ОкрП000210410102 = 0;
			ОкрП000210410103 = 0;
			ОкрП000210410104 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница1" Тогда
				ОкрП000210410101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210410101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница1.Свойство("П000210410101") Тогда
				ОкрП000210410101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница1.П000210410101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница1" Тогда
				ОкрП000210410102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210410102.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница1.Свойство("П000210410102") Тогда
				ОкрП000210410102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница1.П000210410102);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница2" Тогда
				ОкрП000210410103 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210410103.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница2.Свойство("П000210410103") Тогда
				ОкрП000210410103 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница2.П000210410103);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница2" Тогда
				ОкрП000210410104 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210410104.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница2.Свойство("П000210410104") Тогда
				ОкрП000210410104 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница2.П000210410104);
			КонецЕсли;
			
			П000210410105 = ОкрП000210410101 + ОкрП000210410102 + ОкрП000210410103 + ОкрП000210410104;
			
			Форма.СтруктураДанныхФорма70101Страница2.Вставить("П000210410105", П000210410105);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000210410105.Значение = П000210410105;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма70101Страница2" Тогда
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210430905, ОбластьИмя) > 0 Тогда
			
			ОкрП000210430901 = 0;
			ОкрП000210430902 = 0;
			ОкрП000210430903 = 0;
			ОкрП000210430904 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница1" Тогда
				ОкрП000210430901 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210430901.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница1.Свойство("П000210430901") Тогда
				ОкрП000210430901 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница1.П000210430901);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница1" Тогда
				ОкрП000210430902 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210430902.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница1.Свойство("П000210430902") Тогда
				ОкрП000210430902 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница1.П000210430902);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница2" Тогда
				ОкрП000210430903 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210430903.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница2.Свойство("П000210430903") Тогда
				ОкрП000210430903 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница2.П000210430903);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница2" Тогда
				ОкрП000210430904 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210430904.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница2.Свойство("П000210430904") Тогда
				ОкрП000210430904 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница2.П000210430904);
			КонецЕсли;
			
			П000210430905 = ОкрП000210430901 + ОкрП000210430902 + ОкрП000210430903 + ОкрП000210430904;
			
			Форма.СтруктураДанныхФорма70101Страница2.Вставить("П000210430905", П000210430905);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000210430905.Значение = П000210430905;
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210430205, ОбластьИмя) > 0 Тогда
			
			ОкрП000210430201 = 0;
			ОкрП000210430202 = 0;
			ОкрП000210430203 = 0;
			ОкрП000210430204 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница1" Тогда
				ОкрП000210430201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210430201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница1.Свойство("П000210430201") Тогда
				ОкрП000210430201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница1.П000210430201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница1" Тогда
				ОкрП000210430202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210430202.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница1.Свойство("П000210430202") Тогда
				ОкрП000210430202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница1.П000210430202);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница2" Тогда
				ОкрП000210430203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210430203.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница2.Свойство("П000210430203") Тогда
				ОкрП000210430203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница2.П000210430203);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница2" Тогда
				ОкрП000210430204 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210430204.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница2.Свойство("П000210430204") Тогда
				ОкрП000210430204 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница2.П000210430204);
			КонецЕсли;
			
			П000210430205 = ОкрП000210430201 + ОкрП000210430202 + ОкрП000210430203 + ОкрП000210430204;
			
			Форма.СтруктураДанныхФорма70101Страница2.Вставить("П000210430205", П000210430205);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000210430205.Значение = П000210430205;
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210410105, ОбластьИмя) > 0 Тогда
			
			ОкрП000210410101 = 0;
			ОкрП000210410102 = 0;
			ОкрП000210410103 = 0;
			ОкрП000210410104 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница1" Тогда
				ОкрП000210410101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210410101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница1.Свойство("П000210410101") Тогда
				ОкрП000210410101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница1.П000210410101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница1" Тогда
				ОкрП000210410102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210410102.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница1.Свойство("П000210410102") Тогда
				ОкрП000210410102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница1.П000210410102);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница2" Тогда
				ОкрП000210410103 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210410103.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница2.Свойство("П000210410103") Тогда
				ОкрП000210410103 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница2.П000210410103);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница2" Тогда
				ОкрП000210410104 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210410104.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101Страница2.Свойство("П000210410104") Тогда
				ОкрП000210410104 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101Страница2.П000210410104);
			КонецЕсли;
			
			П000210410105 = ОкрП000210410101 + ОкрП000210410102 + ОкрП000210410103 + ОкрП000210410104;
			
			Форма.СтруктураДанныхФорма70101Страница2.Вставить("П000210410105", П000210410105);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000210410105.Значение = П000210410105;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма70101_001Страница1" Тогда
		
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
			
			СуммаП000110000103 = 0;
			СуммаП000110000104 = 0;
			СуммаП000110000105 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы11]].Количество() Цикл
				
				СуммаП000110000103 = СуммаП000110000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000110000203_" + Ном].Значение);
				СуммаП000110000104 = СуммаП000110000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000110000204_" + Ном].Значение);
				СуммаП000110000105 = СуммаП000110000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000110000205_" + Ном].Значение);
				
			КонецЦикла;
			
			Форма.ТабличныйДокумент.Области.П000110000103.Значение = СуммаП000110000103;
			Форма.ТабличныйДокумент.Области.П000110000104.Значение = СуммаП000110000104;
			Форма.ТабличныйДокумент.Области.П000110000105.Значение = СуммаП000110000105;
						
		Иначе
			
			СуммаП000110000103 = 0;
			СуммаП000110000104 = 0;
			СуммаП000110000105 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы11]].Количество() Цикл
				
				СуммаП000110000103 = СуммаП000110000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы11]][Ном - 1].П000110000203);
				СуммаП000110000104 = СуммаП000110000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы11]][Ном - 1].П000110000204);
				СуммаП000110000105 = СуммаП000110000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы11]][Ном - 1].П000110000205);
				
			КонецЦикла;
			
			Форма.СтруктураДанныхФорма70101_001Страница1.Вставить("П000110000103", СуммаП000110000103);
			Форма.СтруктураДанныхФорма70101_001Страница1.Вставить("П000110000104", СуммаП000110000104);
			Форма.СтруктураДанныхФорма70101_001Страница1.Вставить("П000110000105", СуммаП000110000105);
			
		КонецЕсли;
		
		Если    "П000110000103" = ОбластьИмя 
			ИЛИ "П000110000104" = ОбластьИмя 
			ИЛИ "П000110000105" = ОбластьИмя 
			ИЛИ "П000110000203" = Лев(ОбластьИмя,13)
			ИЛИ "П000110000204" = Лев(ОбластьИмя,13)
			ИЛИ "П000110000205" = Лев(ОбластьИмя,13) Тогда
			
			Расчет(Форма, "Форма70101_001Страница2", ОбластьИмя);  //перерасчет 3й стр. форма 300.03
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма70101_001Страница2" Тогда
		
		//00000001L
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000120000103, ОбластьИмя) > 0 Тогда
			
			ОкрП000110000103 = 0;
			ОкрП000110000104 = 0;
			ОкрП000110000105 = 0;
			ОкрП000120000102 = 0;
			
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101_001Страница1" Тогда
				ОкрП000110000103 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110000103.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101_001Страница1.Свойство("П000110000103") Тогда
				ОкрП000110000103 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101_001Страница1.П000110000103);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101_001Страница1" Тогда
				ОкрП000110000104 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110000104.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101_001Страница1.Свойство("П000110000104") Тогда
				ОкрП000110000104 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101_001Страница1.П000110000104);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101_001Страница1" Тогда
				ОкрП000110000105 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110000105.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101_001Страница1.Свойство("П000110000105") Тогда
				ОкрП000110000105 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101_001Страница1.П000110000105);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101_001Страница2" Тогда
				ОкрП000120000102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120000102.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101_001Страница2.Свойство("П000120000102") Тогда
				ОкрП000120000102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101_001Страница2.П000120000102);
			КонецЕсли;
			
			П000120000103 = ОкрП000110000103 + ОкрП000110000104 + ОкрП000110000105 + ОкрП000120000102;
			
			Форма.СтруктураДанныхФорма70101_001Страница2.Вставить("П000120000103", П000120000103);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101_001Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000120000103.Значение = П000120000103;
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000120000203, Лев(ОбластьИмя,13)) > 0 Тогда
			
			Префикс = Сред(ОбластьИмя,Найти(ОбластьИмя,"_"),СтрДлина(ОбластьИмя) - (Найти(ОбластьИмя,"_")-1));
			Индекс = Число(Прав(Префикс,СтрДлина(Префикс)-1)) - 1;
			
			ОкрП000110000203 = 0;
			ОкрП000110000204 = 0;
			ОкрП000110000205 = 0;
			ОкрП000120000202 = 0;

			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101_001Страница1" Тогда
				ОкрП000110000203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000110000203"+Префикс].Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101_001Страница1.Свойство("П000110000203" + Префикс) Тогда
				ОкрП000110000203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101_001Страница1["П000110000203"+Префикс]);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101_001Страница1" Тогда
				ОкрП000110000204 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000110000204"+Префикс].Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101_001Страница1.Свойство("П000110000204" + Префикс) Тогда
				ОкрП000110000204 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101_001Страница1["П000110000204"+Префикс]);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101_001Страница1" Тогда
				ОкрП000110000205 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000110000205"+Префикс].Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101_001Страница1.Свойство("П000110000205" + Префикс) Тогда
				ОкрП000110000205 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101_001Страница1["П000110000205"+Префикс]);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101_001Страница2" Тогда
				ОкрП000120000202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000120000202"+Префикс].Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма70101_001Страница2.Свойство("П000120000202" + Префикс) Тогда
				ОкрП000120000202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма70101_001Страница2["П000120000202"+Префикс]);
			КонецЕсли;
			
			П000120000203 = ОкрП000110000203 + ОкрП000110000204 + ОкрП000110000205 + ОкрП000120000202;
			
			Форма.СтруктураДанныхФорма70101_001Страница2.Вставить("П000120000203" + Префикс, П000120000203);
			
			Форма.П0001200002[Индекс].П000120000203 = П000120000203;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма70101_001Страница2" Тогда
				Форма.ТабличныйДокумент.Области["П000120000203"+Префикс].Значение = П000120000203;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
			
			СуммаП000120000102 = 0;
			СуммаП000120000103 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы12]].Количество() Цикл
				
				СуммаП000120000102 = СуммаП000120000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000120000202_" + Ном].Значение);
				СуммаП000120000103 = СуммаП000120000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000120000203_" + Ном].Значение);
				
			КонецЦикла;
			
			Форма.ТабличныйДокумент.Области.П000120000102.Значение = СуммаП000120000102;
			Форма.ТабличныйДокумент.Области.П000120000103.Значение = СуммаП000120000103;
			
			
		Иначе
			
			СуммаП000120000102 = 0;
			СуммаП000120000103 = 0;
			
			Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы12]].Количество() Цикл
				
				СуммаП000120000102 = СуммаП000120000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы12]][Ном - 1].П000120000202);
				СуммаП000120000103 = СуммаП000120000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы12]][Ном - 1].П000120000203);
				
			КонецЦикла;
			
			Форма.СтруктураДанныхФорма70101_001Страница2.Вставить("П000120000102", СуммаП000120000102);
			Форма.СтруктураДанныхФорма70101_001Страница2.Вставить("П000120000103", СуммаП000120000103);
			
		КонецЕсли;	
		
	//Авторасчет
	ИначеЕсли ИмяСтраницыПанели = "" Тогда
		
		Расчет(Форма,"Форма70101Страница1", "");
		Расчет(Форма,"Форма70101Страница2", "");
		
		Расчет(Форма,"Форма70101_001Страница1", "");
		Расчет(Форма,"Форма70101_001Страница2", "");
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьЗавершение", ЭтотОбъект);

	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВыгрузитьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчет() Экспорт
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьОтчетЗавершение", ЭтотОбъект);
	
	Если Модифицированность Тогда
		СохранитьНаКлиенте(,ОписаниеОповещения);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчетЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ФормаВыгрузкиРеглОтчета = ПолучитьФорму("Документ.ВыгрузкаРегламентированныхОтчетов.Форма.ФормаДокумента", , ЭтаФорма);
	
	СпДокОсн = Новый СписокЗначений;
	СпДокОсн.Добавить(СтруктураРеквизитовФормы.мСохраненныйДок);
	
	ФормаВыгрузкиРеглОтчета.СформироватьИЗаписать(СпДокОсн);
	
КонецПроцедуры

&НаКлиенте
Функция УниверсальнаяВыгрузка (ТекстВыгрузки = Неопределено, ПроверятьБлокировки = Истина, ИмяФайлаВыгрузки = "", ВыгружатьСОшибками = Ложь) Экспорт
	
	ИмяФайлаВыгрузки = СформироватьИмяФайла();
	
	СформироватьСписокФормБезИерархии();
	
	ТекстВыгрузки =  УниверсальнаяВыгрузкаНаСервере();
	
	Если ТекстВыгрузки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция СформироватьИмяФайла()
	
	Перем ПолученноеЗначение;
	
	ИмяФайлаXML = "Форма701.01_"+ Прав(Этаформа.ИмяФормы,7)+ "_" + СтрЗаменить(СтрЗаменить(Строка(ТекущаяДата())," ","_"),":","-") + ".xml";
	
	Возврат ИмяФайлаXML;
	
КонецФункции

&НаСервере
Процедура СформироватьСписокФормБезИерархии()
	
	мСписокФормБезИерархии.ПолучитьЭлементы().Очистить();
	
	МакетПоказателей = Отчеты[Сред(Лев(ЭтотОбъект.ИмяФормы, СтрНайти(ЭтотОбъект.ИмяФормы, ".Форма.") - 1), 7)].ПолучитьМакет("Показатели");
	
	Префикс = Прав(ЭтаФорма.СтруктураРеквизитовФормы.мВыбраннаяФорма,7);
	
	ОбластьПоказателей = МакетПоказателей.Область("Форма70101_" + Префикс);
	
	Для Ном = ОбластьПоказателей.Верх По ОбластьПоказателей.Низ Цикл
		
		НоваяСтрока = мСписокФормБезИерархии.ПолучитьЭлементы().Добавить();
		НоваяСтрока.ИмяФормы			= СокрП(МакетПоказателей.Область(Ном, 1).Текст);
		НоваяСтрока.Выгружать			= ?(СокрП(МакетПоказателей.Область(Ном, 2).Текст)= "1",Истина,Ложь);
		НоваяСтрока.Многострочность		= ?(СокрП(МакетПоказателей.Область(Ном, 3).Текст)= "1",Истина,Ложь);
		НоваяСтрока.КодФормы			= СокрП(МакетПоказателей.Область(Ном, 4).Текст);
		НоваяСтрока.КоличествоНаЛисте	= Число(СокрП(МакетПоказателей.Область(Ном, 5).Текст));
		НоваяСтрока.КоличествоСтраницПриложения = Число(СокрП(МакетПоказателей.Область(Ном, 6).Текст));
		
		Если НоваяСтрока.Многострочность <> Истина Тогда
			Для КолСтр = 1 По НоваяСтрока.КоличествоСтраницПриложения  Цикл
				Для Каждого Элемент Из ЭтаФорма["СтруктураДанных"+ НоваяСтрока.КодФормы + "Страница" + КолСтр] Цикл
					НовыйЭлемент = НоваяСтрока.Значение.Добавить();
					НовыйЭлемент.ИмяОбласти = Элемент.Ключ;
					НовыйЭлемент.Значение = Элемент.Значение;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция  УниверсальнаяВыгрузкаНаСервере()
	Возврат РегламентированнаяОтчетностьРК.ВыгрузитьОтчетВXMLДляСОНО(ЭтотОбъект);
КонецФункции

&НаКлиенте
Процедура РасшифровкаПоЗемельномуНалогу(Команда)
	
	Если СтруктураРеквизитовФормы.ВидРасчета = "Дополнительный" Тогда
		Если Месяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) = 1 Тогда
			ДатаНачала = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
			// второй квартал
		ИначеЕсли Месяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) = 4 Тогда
			ДатаНачала = Дата(СтруктураРеквизитовФормы.мГод,2,1);
			// третий квартал
		ИначеЕсли Месяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) = 7 Тогда
			ДатаНачала = Дата(СтруктураРеквизитовФормы.мГод,5,1);
			// четвертый квартал
		ИначеЕсли Месяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) = 10 Тогда
			ДатаНачала = Дата(СтруктураРеквизитовФормы.мГод,8,1);
		КонецЕсли;
		
		ДатаОкончания = КонецМесяца(Дата(СтруктураРеквизитовФормы.мГод,Месяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета),1));
		
		ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
		
		ЕстьОтбор = ПользовательскиеНастройки.Элементы.Найти("Отбор") <> Неопределено;
		ЗаполняемыеНастройки = Новый Структура("Показатели, Группировка, Отбор, ВыводимыеДанные", Ложь, Ложь, ЕстьОтбор, Ложь);
		
		ДополнительныеСвойства = ПользовательскиеНастройки.ДополнительныеСвойства;
		ДополнительныеСвойства.Вставить("РежимРасшифровки",  Истина);
		ДополнительныеСвойства.Вставить("Организация",       СтруктураРеквизитовФормы.Организация);
		ДополнительныеСвойства.Вставить("НачалоПериода",     ДатаНачала);
		ДополнительныеСвойства.Вставить("КонецПериода",      ДатаОкончания);
		ДополнительныеСвойства.Вставить("ВыводитьЗаголовок", Истина);
		ДополнительныеСвойства.Вставить("КлючВарианта",     "РасчетЗемельногоНалога");
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ВидРасшифровки", 2);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("ИДРасшифровки", "РасчетЗемельногоНалога");
		ПараметрыФормы.Вставить("ЗаполняемыеНастройки", ЗаполняемыеНастройки);
		ПараметрыФормы.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
		
		ОткрытьФорму("Отчет.СправкаРасчетЗемельногоНалога.Форма.ФормаОтчета", ПараметрыФормы,, Новый УникальныйИдентификатор);
		
	ИначеЕсли СтруктураРеквизитовФормы.ВидРасчета = "Очередной" Тогда
		//Даты   
		ДатаНачала 		= СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
		ДатаОкончания	= СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
		Период = Новый СтандартныйПериод;
		Период.ДатаНачала = ДатаНачала;
		Период.ДатаОкончания = ДатаОкончания;
		
		ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
		
		// Группировки	
		МассивГруппировок = Новый Массив();
		МассивГруппировок.Добавить(Новый Структура("Использование, Поле, Представление, ТипГруппировки", Истина, "ИФНС", НСтр("ru = 'Налоговый орган'"), "Без групп"));	

		ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Группировка",  МассивГруппировок);
		
		
		//Выбранные поля
		ПользовательскиеПоля = ПользовательскиеНастройки.Элементы.Добавить(Тип("ВыбранныеПоляКомпоновкиДанных"));	
		ПользовательскиеПоля.ИдентификаторПользовательскойНастройки = "Выбор";	
		
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "ОсновноеСредство", 										"Объект");
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "КадастровыйНомер",    										"Кадастровый номер земельного участка");
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "Период",    												"Дата регистрации");
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "КодКатегорииЗемель", 										"Категория земель");
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "КБК", 														"КБК");
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "ДоляНалогоплательщика", 									"Доля налогоплательщика в праве на земельный участок");
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "ПлощадьНеОблагаемая", 										"Не облагаемая площадь земельного участка (га, кв.м.)");
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "ПлощадьОблагаемая",     									"Облагаемая площадь земельного участка (га. кв.м.)");
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "НалоговаяБаза", 											"Налоговая база");
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "НалоговаяСтавка", 											"Ставка налога");
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "КорректировкаБазовойСтавкиНалога", 						"Корректировка базовой ставки налога");
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "КорректировкаБазовойСтавкиНалогаНаТерриторияхСЭЗ", 		"Корректировка базовой ставки налога на территориях СЭЗ");
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "КорректировкаБазовойСтавкиНалогаПоРешениюМестныхОрганов", 	"Корректировка базовой ставки налога по решению местных органов");
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "ПроцентИзмененияБазовойСтавкиНалога", 						"Процент изменения базовой ставки налога");
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "СуммаНалога", 												"Исчисленная сумма налога, подлежащая уплате в бюджет (тенге)");
		
		
		// Прочие настройки
		ТекстЗаголовка = НСтр("ru = 'Расшифровка к форме 701.01 - Расчет земельного налога'");	
		ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Заголовок", 	ТекстЗаголовка);
		
		
		
		
		
		//Параметры
		МассивПараметровДанных = Новый Массив(); 
		
		ДатаОтчета = СоздатьГраницу(НачалоГода(ДатаНачала)); 
		
		СписокОрганизаций = СформироватьСписокОрганизаций(СтруктураРеквизитовФормы.Организация, СтруктураРеквизитовФормы.НалоговыйКомитет, ДатаОкончания);
		
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьПараметр(МассивПараметровДанных, "ДатаОтчета",    			ДатаОтчета);
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьПараметр(МассивПараметровДанных, "НалоговыйОрганОсновной", 	ПолучитьНалоговыйКомитетОрганизации(СтруктураРеквизитовФормы.Организация));
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьПараметр(МассивПараметровДанных, "НалоговыйОрганОтчета",   	СтруктураРеквизитовФормы.НалоговыйКомитет);
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьПараметр(МассивПараметровДанных, "СписокОрганизаций",	 	СписокОрганизаций);
		
		ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПараметрыДанных", МассивПараметровДанных);
		
		
		
		ДополнительныеСвойства = ПользовательскиеНастройки.ДополнительныеСвойства;
		ДополнительныеСвойства.Вставить("Организация",      	СтруктураРеквизитовФормы.Организация);
		ДополнительныеСвойства.Вставить("НачалоПериода",    	ДатаНачала);
		ДополнительныеСвойства.Вставить("КонецПериода",     	ДатаОкончания);
		ДополнительныеСвойства.Вставить("Период",				Период);
		ДополнительныеСвойства.Вставить("ВыводитьЗаголовок",	Истина);
		ДополнительныеСвойства.Вставить("ТипДанных",			"РегистрыСведений");
		ДополнительныеСвойства.Вставить("ИмяОбъекта",			"РасчетЗемельногоНалога");
		
		
		
		СхемаКомпоновки = ПодменитьТекстЗапросаСхемыКомпоновкиДанных(,"РасчетЗемельногоНалога", "Расшифровка");
		ДополнительныеСвойства.Вставить("СхемаКомпоновкиДанных", СхемаКомпоновки);
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ВидРасшифровки", 2);
		ПараметрыФормы.Вставить("РежимРасшифровки", Истина);
		ПараметрыФормы.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("ИДРасшифровки", "РасчетЗемельногоНалога");
		
		
		ОткрытьФорму("Отчет.РасшифровкаРегламентированныхОтчетов.Форма.ФормаОтчета", ПараметрыФормы,, Истина);
	
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПоНалогуНаИмущество(Команда)
	
	Если СтруктураРеквизитовФормы.ВидРасчета = "Дополнительный" Тогда
		Если Месяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) = 1 Тогда
			ДатаНачала = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
			// второй квартал
		ИначеЕсли Месяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) = 4 Тогда
			ДатаНачала = Дата(СтруктураРеквизитовФормы.мГод,2,1);
			// третий квартал
		ИначеЕсли Месяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) = 7 Тогда
			ДатаНачала = Дата(СтруктураРеквизитовФормы.мГод,5,1);
			// четвертый квартал
		ИначеЕсли Месяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета) = 10 Тогда
			ДатаНачала = Дата(СтруктураРеквизитовФормы.мГод,8,1);
		КонецЕсли;
		
		ДатаОкончания = КонецМесяца(Дата(СтруктураРеквизитовФормы.мГод,Месяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета),1));
		
		ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
		
		ЕстьОтбор = ПользовательскиеНастройки.Элементы.Найти("Отбор") <> Неопределено;
		ЗаполняемыеНастройки = Новый Структура("Показатели, Группировка, Отбор, ВыводимыеДанные", Ложь, Ложь, ЕстьОтбор, Ложь);
		
		ДополнительныеСвойства = ПользовательскиеНастройки.ДополнительныеСвойства;
		ДополнительныеСвойства.Вставить("РежимРасшифровки",  Истина);
		ДополнительныеСвойства.Вставить("Организация",       СтруктураРеквизитовФормы.Организация);
		ДополнительныеСвойства.Вставить("НачалоПериода",     ДатаНачала);
		ДополнительныеСвойства.Вставить("КонецПериода",      ДатаОкончания);
		ДополнительныеСвойства.Вставить("ВыводитьЗаголовок", Истина);
		ДополнительныеСвойства.Вставить("КлючВарианта",     "РасчетНалогаНаИмущество");
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ВидРасшифровки", 2);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("ИДРасшифровки", "РасчетНалогаНаИмущество");
		ПараметрыФормы.Вставить("ЗаполняемыеНастройки", ЗаполняемыеНастройки);
		ПараметрыФормы.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
		
		ОткрытьФорму("Отчет.СправкаРасчетНалогаНаИмущество.Форма.ФормаОтчета", ПараметрыФормы,, Новый УникальныйИдентификатор);
		
	ИначеЕсли СтруктураРеквизитовФормы.ВидРасчета = "Очередной" Тогда
		
		//Даты   
		ДатаНачала 		= СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
		ДатаОкончания	= СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
		Период = Новый СтандартныйПериод;
		Период.ДатаНачала = ДатаНачала;
		Период.ДатаОкончания = ДатаОкончания;
		
		ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
		
		// Группировки	
		МассивГруппировок = Новый Массив();
		МассивГруппировок.Добавить(Новый Структура("Использование, Поле, Представление, ТипГруппировки", Истина, "ИФНС", НСтр("ru = 'Вид налоговой базы'"), "Без групп"));	
		
		ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Группировка",  МассивГруппировок);
		
			
		//Выбранные поля
		ПользовательскиеПоля = ПользовательскиеНастройки.Элементы.Добавить(Тип("ВыбранныеПоляКомпоновкиДанных"));	
		ПользовательскиеПоля.ИдентификаторПользовательскойНастройки = "Выбор";	
		
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "ОсновноеСредствоИмущество",								"Налоговый орган, Объект");
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "ИнвентарныйНомер", 										"Инвентарный номер");
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "ДатаСостояния",    										"Дата ввода в эксплуатацию");
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "ДоляСтоимости",		 									"Доля стоимости");
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "НалоговаяБаза", 											"Налоговая база");
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "НалоговаяСтавка", 											"Ставка налога");
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "ОбщаяСумма",     											"Исчисленная сумма налога, подлежащая уплате в бюджет (тенге)");
		
		// Прочие настройки
		ТекстЗаголовка = НСтр("ru = 'Расшифровка к форме 701.01 - Расчет налога на имущество'");	
		ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Заголовок", 	ТекстЗаголовка);
		
		
		
		
		
		//Параметры
		МассивПараметровДанных = Новый Массив(); 
		
		ГраницаНачалоПериода = СоздатьГраницу(НачалоГода(ДатаНачала)); 
		СписокОрганизаций = СформироватьСписокОрганизаций(СтруктураРеквизитовФормы.Организация, СтруктураРеквизитовФормы.НалоговыйКомитет, ДатаОкончания);
		
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьПараметр(МассивПараметровДанных, "ОсновнойНалоговыйОрган", 		ПолучитьНалоговыйКомитетОрганизации(СтруктураРеквизитовФормы.Организация));
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьПараметр(МассивПараметровДанных, "НалоговыйКомитет",   			СтруктураРеквизитовФормы.НалоговыйКомитет);
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьПараметр(МассивПараметровДанных, "СписокОрганизаций",	  		СписокОрганизаций);
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьПараметр(МассивПараметровДанных, "ГраницаНачалоПериодаОтчета",	ГраницаНачалоПериода);
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьПараметр(МассивПараметровДанных, "НачалоГода",					НачалоГода(Период.ДатаНачала));
		РегламентированнаяОтчетностьКлиентСерверРК.ДобавитьПараметр(МассивПараметровДанных, "ДатаОкончания",				Период.ДатаОкончания);



		
		ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПараметрыДанных", МассивПараметровДанных);
		
		
		
		ДополнительныеСвойства = ПользовательскиеНастройки.ДополнительныеСвойства;
		ДополнительныеСвойства.Вставить("Организация",      	СтруктураРеквизитовФормы.Организация);
		ДополнительныеСвойства.Вставить("НачалоПериода",    	ДатаНачала);
		ДополнительныеСвойства.Вставить("КонецПериода",     	ДатаОкончания);
		ДополнительныеСвойства.Вставить("Период",				Период);
		ДополнительныеСвойства.Вставить("ВыводитьЗаголовок",	Истина);
		ДополнительныеСвойства.Вставить("ТипДанных",			"РегистрыСведений");
		ДополнительныеСвойства.Вставить("ИмяОбъекта",			"РасчетНалогаНаИмущество");
	
		
		СхемаКомпоновки = ПодменитьТекстЗапросаСхемыКомпоновкиДанных(,"РасчетНалогаНаИмущество", "Расшифровка");
		ДополнительныеСвойства.Вставить("СхемаКомпоновкиДанных", СхемаКомпоновки);

		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ВидРасшифровки", 2);
		ПараметрыФормы.Вставить("РежимРасшифровки", Истина);
		ПараметрыФормы.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("ИДРасшифровки", "РасчетЗемельногоНалога");
		
		
		ОткрытьФорму("Отчет.РасшифровкаРегламентированныхОтчетов.Форма.ФормаОтчета", ПараметрыФормы,, Истина);
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекущуюСтраницу(Команда)
	
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьТекущийЭкземплярМногостраничногоРаздела" + Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекущийРаздел(Команда)
	
	//РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьТекущийРаздел" + Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтчет(Команда)
	
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьВесьОтчет");
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(ВыполняемоеОповещение = Неопределено) Экспорт
	
	РегламентированнаяОтчетностьКлиент.Очистить(ЭтаФорма, ВыполняемоеОповещение);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере() Экспорт
	
	СтруктураДанныхФорма70101Страница1.Очистить();
	СтруктураДанныхФорма70101Страница2.Очистить();
	
	СтруктураДанныхФорма70101_001Страница1.Очистить();
	СтруктураДанныхФорма70101_001Страница2.Очистить();
		
	ЗаполнитьПустыеСтруктурыДанных();
	
	ОчиститьТабличноеПолеНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма70101Страница1", 1);
	
	НачальныеОперацииСМногострочнымиБлоками();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОчисткаРегламентированногоОтчетаНаСервере(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаСервере(ИмяСтраницы);
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаРегламентированногоОтчетаНаКлиенте(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаКлиенте(ИмяСтраницы);
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
	ОткрытьФормуВыбораСтраниц("ВыбратьДляНастройки");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраниц(ВариантВыбора)
	Перем ТекущийРазделОтчетаСокрНаим;
	Перем НомерСтраницыРазделаОтчета;
	
	// Запоминаем текущий раздел, установленный в дереве разделов отчета.
	Если НЕ Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		ТекущийРазделОтчетаСокрНаим = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
		НомерСтраницыРазделаОтчета  = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	КонецЕсли;
	
	мПараметры = Новый Структура;
	мПараметры.Вставить("Автосохранение", Ложь);
	мПараметры.Вставить("мАвтоВыборКодов", Ложь);
	мПараметры.Вставить("ЗначенияИзСписка", Ложь);
	мПараметры.Вставить("ОтключитьАвтоРасчет", Ложь);
	мПараметры.Вставить("СчетчикСтраниц", Ложь);
	мПараметры.Вставить("ПараметрыОтображенияСумм", Ложь);
	мПараметры.Вставить("ИмеетсяРеквизитДеревоВыбранныхСтраниц", Истина);
	мПараметры.Вставить("ИмяОтчета", ИмяОтчета(ЭтаФорма.ИмяФормы));
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("мПараметры",                              мПараметры);
	
	ФормаНастройкиОтчета = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("НастройкиОтчета", ПараметрыФормы, ЭтаФорма);
	
	ПодготовитьДеревоСтраницДляНастройки();
	
	КопироватьДанныеФормы(мДеревоВыбранныхСтраниц, ФормаНастройкиОтчета.Дерево);
	
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
	
	ЗначениеЕдИзм       = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	ЗначениеЗпт         = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;
	
	ДополнительныеПараметры = Новый Структура("ЗначениеАвторасчета, ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим", , ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуВыбораСтраницЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ФормаНастройкиОтчета.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаНастройкиОтчета.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаНастройкиОтчета.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьДеревоСтраницДляНастройки()
	
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
	ДеревоСтраниц = РеквизитФормыВЗначение("мДеревоСтраницОтчета");
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма70101Страница1";
	СтрокаУровня1.Представление            = "Форма 701.01";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма70101Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраницЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	//ЗначениеАвторасчета = ДополнительныеПараметры.ЗначениеАвторасчета;
	ЗначениеЕдИзм = ДополнительныеПараметры.ЗначениеЕдИзм;
	ЗначениеЗпт = ДополнительныеПараметры.ЗначениеЗпт;
	НомерСтраницыРазделаОтчета = ДополнительныеПараметры.НомерСтраницыРазделаОтчета;
	ТекущийРазделОтчетаСокрНаим = ДополнительныеПараметры.ТекущийРазделОтчетаСокрНаим;
	
	//СформироватьПодменюПечать(ЭтаФорма);
	Модифицированность = Истина;
	
	флЗначенияИдентичны = Истина;
	
	флЗначенияИдентичны = ПеренестиДанныеДереваСтраниц();
	
	Если НЕ флЗначенияИдентичны Тогда
		
		СформироватьДеревоРазделовОтчетаНаКлиенте();
		
		Если НЕ ТекущийРазделОтчетаСокрНаим = Неопределено Тогда
			
			// Пытаемся найти ранее запомненный раздел.
			НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(РазделыОтчета.ПолучитьЭлементы(), "КолонкаРазделыОтчетаСокрНаим", ТекущийРазделОтчетаСокрНаим);
			
			Если НЕ НайденнаяСтрока = Неопределено 
				И НЕ НомерСтраницыРазделаОтчета = Неопределено 
				И НайденнаяСтрока.ПолучитьЭлементы().Количество() > 0 Тогда
				
				НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(НайденнаяСтрока.ПолучитьЭлементы(), "КолонкаНомерСтраницыРазделаОтчета", НомерСтраницыРазделаОтчета);
				
			КонецЕсли;
			
			// В случае успешного поиска, устанавливаем курсор на найденный раздел.
			Если НЕ НайденнаяСтрока = Неопределено Тогда
				Элементы.РазделыОтчета.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПеренестиДанныеДереваСтраниц()
	
	флЗначенияИдентичны = Истина;
	
	ДеревоВыбСтраниц = РеквизитФормыВЗначение("мДеревоВыбранныхСтраниц");
	
	Для Каждого ЭлементДерева Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		Строка = ДеревоВыбСтраниц.Строки.Найти(Лев(ЭлементДерева.Представление,12),"Представление");
		
		Если ЭлементДерева.ПоказатьСтраницу <> ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1) Тогда
			
			флЗначенияИдентичны = Ложь;
			
		КонецЕсли;
		
		ЭлементДерева.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
		ЭлементДерева.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
		ЭлементДерева.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
		
	КонецЦикла;
	
	Возврат флЗначенияИдентичны;
	
КонецФункции


&НаКлиенте
Процедура Обновить(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПериодЗаполнения(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвто(Команда) Экспорт
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоПредупредитьОСохранении", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередЗаполнениемРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоПредупредитьОСохранении(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоСохранениеОтчета", ЭтотОбъект, ДополнительныеПараметры);
	
	ТекстВопроса = НСтр("ru = 'Автоматическое заполнение приведет к сохранению отчета с новыми данными. Заполнить отчет?'");
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Заполнить", "Заполнить и сохранить");
	Кнопки.Добавить("НеЗаполнять", "Не заполнять");
	
	КнопкаПоУмолчанию = "НеЗаполнять";
	
	ЗаголовокВопроса = НСтр("ru = 'Автоматическое заполнение отчета'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , КнопкаПоУмолчанию, ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоСохранениеОтчета(ОтветПользователя, ДополнительныеПараметры) Экспорт
	
	Если ОтветПользователя <> "Заполнить" Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ЗаполнитьАвтоПослеСохранениеОтчета", 
		ЭтотОбъект, 
		ДополнительныеПараметры); 
	
	СохранитьНаКлиенте(,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоПослеСохранениеОтчета(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		Возврат;
	КонецЕсли;
	
	Команда = ДополнительныеПараметры.Команда;
	
	ЗаполнитьАвтоНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАвтоНаСервере()
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела, Ложь);
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("Организация",              				СтруктураРеквизитовФормы.Организация);
	ПараметрыОтчета.Вставить("НалоговыйКомитет",         				СтруктураРеквизитовФормы.НалоговыйКомитет);
	ПараметрыОтчета.Вставить("мДатаНачалаПериодаОтчета", 				СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	ПараметрыОтчета.Вставить("мДатаКонцаПериодаОтчета",  				СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	ПараметрыОтчета.Вставить("мГод",                     				СтруктураРеквизитовФормы.мГод);
	ПараметрыОтчета.Вставить("ВидРасчета",               				СтруктураРеквизитовФормы.ВидРасчета);
	ПараметрыОтчета.Вставить("ИсключатьИзОсновнойФормыСуммыПоАкиматам", ИсключатьИзОсновнойФормыСуммыПоАкиматам);
	
	Контейнер = Новый Структура();
	Контейнер.Вставить("Форма70101Страница1", СтруктураДанныхФорма70101Страница1);
	Контейнер.Вставить("Форма70101Страница2", СтруктураДанныхФорма70101Страница2);
	
	Контейнер.Вставить("Форма70101_001Страница1", СтруктураДанныхФорма70101_001Страница1);
	Контейнер.Вставить("Форма70101_001Страница1_ДанныеДопСтрок", ДанныеФормыВЗначение(П0001100002, Тип("ТаблицаЗначений")));
	
	Контейнер.Вставить("Форма70101_001Страница2", СтруктураДанныхФорма70101_001Страница2);
	Контейнер.Вставить("Форма70101_001Страница2_ДанныеДопСтрок", ДанныеФормыВЗначение(П0001200002, Тип("ТаблицаЗначений")));
		
	РегламентированнаяОтчетностьПереопределяемый.ЗаполнитьОтчет(ИмяОтчета(ЭтаФорма.ИмяФормы), ИмяФормыОтчета(ЭтаФорма.ИмяФормы), ПараметрыОтчета, Контейнер);
	
	Для Каждого ЭлементКонтейнера Из Контейнер Цикл
		
		ИмяСтраницы = ЭлементКонтейнера.Ключ;
		
		Если ИмяСтраницы = "Форма70101_001Страница1_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0001100002);
			
		ИначеЕсли ИмяСтраницы = "Форма70101_001Страница2_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0001200002);

		Иначе	
			ЭтаФорма["СтруктураДанных" + ИмяСтраницы] = ЭлементКонтейнера.Значение;
		КонецЕсли;	
		
	КонецЦикла;
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма70101Страница1", 1);
	ЗаполнитьСведенияОбОрганизацииНаСервере();
	НачальныеОперацииСМногострочнымиБлоками();
	
	РасчетНаСервере();
	
	НачальныеОперацииСМногострочнымиБлоками();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПустыеСтруктурыДанных()
	
	СохрТабличныйДокумент = Новый ТабличныйДокумент;
	
	СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
	
	//П0001100002.Очистить();
	//П0001200002.Очистить();
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		ИмяГруппы = ЭлементСтруктуры.Ключ;
		СтруктураГруппы = ЭтаФорма[ЭлементСтруктуры.Значение];
		СтруктураГруппы.Очистить();
	КонецЦикла;
	
	Для Каждого Раздел Из мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
		
		ТабличныйДокумент.Очистить();
		ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + Раздел.ИмяСтраницы));
		
		СохранитьДанныеРаздела(Раздел.ИмяСтраницы, Ложь);
		
	КонецЦикла;
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Если Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	Оповещение = Новый ОписаниеОповещения("ПослеСохраненияФормыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	СохранитьНаКлиенте(, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиенте(Автосохранение = Ложь, ВыполняемоеОповещение = Неопределено) Экспорт
	
	
	Вариант = СтруктураРеквизитовФормы.ВидДокумента;
	
	Если НЕ РегламентированнаяОтчетностьКлиент.ПриЗаписиРегламентированногоОтчетаНаКлиенте(ЭтаФорма, , Автосохранение, Вариант) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатСохранения = ПередСохранением();
	
	ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения);
	
КонецПроцедуры

&НаСервере
Функция ПередСохранением()
	
	Возврат Сохранить();
	
КонецФункции

&НаСервере
Функция Сохранить()
	
	Если НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.ПолучитьОбъект();
	КонецЕсли;
			
	Если НЕ РегламентированнаяОтчетность.ПриЗаписиРегламентированногоОтчетаНаСервере(ЭтаФорма, , ,СтруктураРеквизитовФормы.ВидДокумента, , СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ИсточникОтчета           = Метаданные.Отчеты[Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7)].Имя;
	СтруктураРеквизитовФормы.мСохраненныйДок.НаименованиеОтчета       = Метаданные.Отчеты[Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7)].ОсновнаяФорма.Синоним;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаНачала               = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаОкончания            = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.Периодичность            = СтруктураРеквизитовФормы.мПериодичность;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВыбраннаяФорма           = СтруктураРеквизитовФормы.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок.Организация              = СтруктураРеквизитовФормы.Организация;
	СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий              = Комментарий;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаПодписи              = ТекущаяДата(); 
	СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения         = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВидОтчетности            = Перечисления.ВидыОтчетности.РегламентированнаяОтчетность;
	СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий              = Комментарий;
	СтруктураРеквизитовФормы.мСохраненныйДок.КодНалоговогоОргана      = СтруктураРеквизитовФормы.НалоговыйКомитет.Код;
	СтруктураРеквизитовФормы.мСохраненныйДок.КПП                      = "";
	СтруктураРеквизитовФормы.мСохраненныйДок.Вид                      = СтруктураРеквизитовФормы.ВидДокумента;
	СтруктураРеквизитовФормы.мСохраненныйДок.ПредставлениеВида        = РегламентированнаяОтчетность.ПредставлениеВидаДокумента(СтруктураРеквизитовФормы.мСохраненныйДок.Вид);
	СтруктураРеквизитовФормы.мВариант                                 = СтруктураРеквизитовФормы.ВидДокумента;
		
	СтруктураРеквизитовФормы.мСохраненныйДок.ФорматВыгрузки = "Автоматически";
	//сохранение данных текущего раздела
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	// формируем данные редактируемых ячеек таблицы
	ПоказателиОтчета = Новый Структура();
	
	ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета);
	// формируем список сохранения
	СписокСохранения = Новый Структура();

	// вставляем данные редактируемых ячеек таблицы
	СписокСохранения.Вставить("ПоказателиОтчета", ПоказателиОтчета);
	СписокСохранения.Вставить("НалоговыйКомитет", СтруктураРеквизитовФормы.НалоговыйКомитет);
	
	СписокСохранения.Вставить("ИсключатьИзОсновнойФормыСуммыПоАкиматам", ИсключатьИзОсновнойФормыСуммыПоАкиматам);
	
	
	МассивТиповНеопределено = Новый Массив;
	МассивТиповНеопределено.Добавить(Тип("Неопределено"));
	ОписаниеТиповНеопределено = Новый ОписаниеТипов(МассивТиповНеопределено);
	
	//+
	ДанныеМногострочныхРазделов = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		
		ДанныеМногострочныхРазделов.Вставить(ЭлементСтруктуры.Ключ, ДанныеФормыВЗначение(ЭтаФорма[ЭлементСтруктуры.Значение], Тип("ТаблицаЗначений")));
		
	КонецЦикла;

	СписокСохранения.Вставить("ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов);
	//-
	
	ХранилищеДанных = Новый ХранилищеЗначения(СписокСохранения);
	СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета = ХранилищеДанных;
	
	Попытка
		СтруктураРеквизитовФормы.мСохраненныйДок.Записать();
	Исключение
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецПопытки;
	Модифицированность = Ложь;
	
	СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения)
	
	КлючУникальности = СтруктураРеквизитовФормы.мСохраненныйДок;
	
	Если РезультатСохранения Тогда
		
		РегламентированнаяОтчетностьКлиент.ПослеЗаписиРегламентированногоОтчета(ЭтаФорма);
		
		Если ВыполняемоеОповещение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ВыполняемоеОповещение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСохраненияФормыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.Форма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета)
	
	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		ПоказателиОтчета.Вставить(Префикс + Раздел.ИмяСтраницы, ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы]);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБланк(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБланкЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Команда = ДополнительныеПараметры.Команда;
	
	ДополнительныеПараметрыПечати = Новый Структура;
	ДополнительныеПараметрыПечати.Вставить("ВидПечати", Команда.Имя);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПечатьЗавершение", ЭтотОбъект, ДополнительныеПараметрыПечати);
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
						
	Иначе
		
		СохранитьНаКлиенте(, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьСразу(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьСразуЗавершение (Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Команда = ДополнительныеПараметры.Команда;
	
	Если Команда <> Неопределено Тогда
		Печать(Команда.Имя);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(ВидПечати, НеИзФормыОтчета = Ложь) Экспорт
	
	Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1. Формируется печатная форма...'"), ЭтаФорма.Заголовок), , , БиблиотекаКартинок.Печать);
	
	Если СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки <> Неопределено И СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки Тогда
		РегламентированнаяОтчетностьКлиент.ПроверитьКонтрольныеСоотношения(ЭтаФорма, ОбработкаКС);
	КонецЕсли;
	
	Если НЕ ПечатьНаСервере(ВидПечати) Тогда
		Возврат;
	КонецЕсли;
	
	
	ОбщиеРеквизитыРазделов = Новый Структура;
	
	
	РегламентированнаяОтчетностьКлиент.ОткрытьФормуПредварительногоПросмотра(ЭтаФорма, ВидПечати, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере(ВидПечати)
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	Раздел = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	СтруктураРеквизитовФормы.мПечатныеФормы.Очистить();
	СтруктураРеквизитовФормы.мРежимПечати = Истина;
	
	Для Каждого ЭлеменетДерева Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		Если ЭлеменетДерева.ВыводНаПечать = 1 Тогда
			
			ВывестиМакетСтраницыВТабличныйДокументНаСервере(ЭлеменетДерева.ИмяСтраницы);
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("НаименованиеЛиста",  ЭлеменетДерева.Представление);
			СтруктураПараметров.Вставить("ОриентацияЛиста",    ЭлеменетДерева.ОриентацияСтраницы);
			СтруктураПараметров.Вставить("ИмяСтраницы",        ЭлеменетДерева.ИмяСтраницы);
			Структурапараметров.Вставить("ИмяОбластиТаблПоля", "ТабличныйДокумент");
			СтруктураПараметров.Вставить("ВидПечати",          ВидПечати);
			
			РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, СтруктураПараметров, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
			
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(Раздел);
	
	РегламентированнаяОтчетностьКлиентСервер.ПроставлениеНомеровЛистов(ЭтаФорма, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	РегламентированнаяОтчетностьКлиент.ПередЗакрытиемРегламентированногоОтчета(ЭтаФорма, Отказ, СтандартнаяОбработка,ЗавершениеРаботы, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПриЗакрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	РегламентированнаяОтчетность.ПриЗакрытииРегламентированногоОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка)
	
	Если СтрЧислоВхождений(Область.Имя, "ДобавитьСтроку") > 0 Тогда
		ДобавитьСтроку("");
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "УдалитьСтроку") > 0 И Область.Гиперссылка Тогда
		УдалитьСтроку("");
	КонецЕсли;

	//Если РегламентированнаяОтчетностьКлиент.ВыбраннаяОбластьРегламентированногоОтчетаНеВерна(ЭтаФорма, Область, СтандартнаяОбработка) Тогда
	//	Возврат;
	//КонецЕсли;
	
	ИмяЯчейки = Область.Имя;
	
	Если (Найти(ИмяЯчейки, "Первоначальный") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Очередной") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Дополнительный") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "ПоУведомлению") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "ПрименяющийСНР") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "ДовУправляющий") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Недропользователь") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "ДовУправляющийУчредитель") > 0)Тогда
		РасчетНаКлиенте("Форма70101Страница1",ИмяЯчейки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТабличноеПолеНаКлиенте(ВыбТабличноеПолеИмя) Экспорт
	
	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличноеПолеНаСервере(ВыбТабличноеПолеИмя) Экспорт
	
	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьТабличноеПоле(Форма, ВыбТабличноеПолеИмя)
	
	ВыбТабличноеПоле = Форма.ТабличныйДокумент;
	
	// Непосредственно очищаем ячейки табличного документа.
	Для Инд = 0 По ВыбТабличноеПоле.Области.Количество() - 1 Цикл
		ТекущаяОбласть = ВыбТабличноеПоле.Области[Инд];
		
		Если Не ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;
	
		Если ТекущаяОбласть.СодержитЗначение <> Истина Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекущаяОбласть.Защита Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущаяОбласть.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СобратьДанныеТекущегоТаблПоляНаСервере(ИмяТабличногоПоля) Экспорт
	
	Возврат СобратьДанныеТекущегоТаблПоля(ЭтаФорма, ИмяТабличногоПоля);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СобратьДанныеТекущегоТаблПоля(Форма, ИмяТабличногоПоля)

	ТабличноеПоле = Форма[ИмяТабличногоПоля];
	
	СтруктураДанныхПоля = Новый Структура;
	
	Для Инд = 0 По ТабличноеПоле.Области.Количество() - 1 Цикл
		ТекущаяОбласть = ТабличноеПоле.Области[Инд];

		Если Не ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;

		Если ТекущаяОбласть.СодержитЗначение <> Истина Тогда
			Продолжить;
		КонецЕсли;

		ИмяПоказателя      = ТекущаяОбласть.Имя;
		ЗначениеПоказателя = ТекущаяОбласть.Значение;

		СтруктураДанныхПоля.Вставить(ИмяПоказателя, ЗначениеПоказателя);

	КонецЦикла;

	Возврат СтруктураДанныхПоля;

КонецФункции

//+
&НаКлиентеНаСервереБезКонтекста
Функция ЭтоРазделРодитель(ИмяРаздела)
	
	Результат = (ИмяРаздела = "Форма70101Страница1")
			Или (ИмяРаздела = "Форма70101_001Страница1");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МногострочныйРаздел(ИмяРаздела)
	
	Результат = (ИмяРаздела = "Форма70101_001Страница1")
			ИЛИ (ИмяРаздела = "Форма70101_001Страница2");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьКоличествоПодразделовПоРодителю(Родитель)
	
	Если Родитель = "Форма70101Страница1" Тогда
		Возврат 2;
	ИначеЕсли Родитель = "Форма70101_001Страница1" Тогда
		Возврат 2;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура НачальныеОперацииСМногострочнымиБлоками()
	Перем ИсходноеКоличествоСтрокГруппы;

	// создаем исходную структуру многострочных разделов
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		ИмяГруппы = ЭлементСтруктуры.Ключ;
		СтруктураГруппы = ЭтаФорма[ЭлементСтруктуры.Значение];
		
		мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);

		Если ИсходноеКоличествоСтрокГруппы > СтруктураГруппы.Количество() Тогда 
			Для НСтр = 1 По ИсходноеКоличествоСтрокГруппы Цикл
				СтруктураГруппы.Добавить();
			КонецЦикла;
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы11", СтруктураРеквизитовФормы.мИдГруппы11);
	ИдГрупп.Вставить("мИдГруппы12", СтруктураРеквизитовФормы.мИдГруппы12);
		
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста, , ИдГрупп);
	
КонецФункции

&НаКлиенте
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы11", СтруктураРеквизитовФормы.мИдГруппы11);
	ИдГрупп.Вставить("мИдГруппы12", СтруктураРеквизитовФормы.мИдГруппы12);
		
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста, , ИдГрупп);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста = Неопределено, ТекущаяСтраница, ИдГрупп)
	
	Перем ИмяГруппы;
	
	Если ИмяЛиста = Неопределено Тогда
		ИмяТекущейСтраницыПанели = ТекущаяСтраница.Имя;
	Иначе
		ИмяТекущейСтраницыПанели = ИмяЛиста;
	КонецЕсли;
	
	Если ИмяТекущейСтраницыПанели = "Форма70101_001Страница1" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы11;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма70101_001Страница2" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы12;
	КонецЕсли;
	
	Возврат ИмяГруппы;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	#Если ВебКлиент Тогда
		ВставитьДополнительнуюСтрокуНаСервере();
	#Иначе
		ВставитьДополнительнуюСтрокуНаКлиенте();
	#КонецЕсли
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура ВставитьДополнительнуюСтрокуНаСервере()
	
	ВставитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьДополнительнуюСтрокуНаКлиенте()
	
	ВставитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВставитьДополнительнуюСтроку(Форма, ИмяГруппыБлока = Неопределено, СпециальноеДобавление = Ложь, ИмяКолонкиНомера = Неопределено) Экспорт
	
	Перем СтруктураГруппы;
	Перем МаксимальноеКоличествоСтрокГруппы;
	
	Если ИмяГруппыБлока = Неопределено Тогда
		// Сначала выполним проверку на активную страницу панели формы,
		// которая содержит многострочный раздел
		#Если НаКлиенте Тогда
			ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		#Иначе
			ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		#КонецЕсли
		
		Если ИмяГруппы = Неопределено Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Не выбран многострочный раздел, в который необходимо добавить строку.'");
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли;
		
	Иначе
		ИмяГруппы = ИмяГруппыБлока;
	КонецЕсли;
	
	// Исходное количество строк группы
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, МаксимальноеКоличествоСтрокГруппы);

	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = Форма[СтруктураГруппы];

	// определяем последнюю строку многострочной группы
	КолСтрок = СтруктураГруппы.Количество();
	
	КолСтрокСтр = Формат(КолСтрок, "ЧГ=");

	ИмяПервойЯчейкиПоследнейСтроки = ИмяГруппы + "01_" + КолСтрокСтр;
	
	// область первой ячейки последней строки многострочного раздела
	ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяПервойЯчейкиПоследнейСтроки];

	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// номера строк исходной области
	НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;
	НомерНижнЯчейкиОбласти = ОбластьЯчейки.Верх + ВысотаСтроки - 1;
		
	СдвигСтрок = НомерНижнЯчейкиОбласти - НомерВерхЯчейкиОбласти + 1;

	// номера строк вставляемой области
	НомерВерхЯчейкиНовойОбласти = НомерВерхЯчейкиОбласти + СдвигСтрок;
	НомерНижнЯчейкиНовойОбласти = НомерНижнЯчейкиОбласти + СдвигСтрок;
	
	НазначитьИмяОбластиМЧ = Ложь;
	ВставляемаяОбласть = ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, );
	Если СтрНайти(ВставляемаяОбласть.Имя, "МногострочнаяЧасть") Тогда
		НазначитьИмяОбластиМЧ = Истина;
		ИмяМногострочнойЧасти = ВставляемаяОбласть.Имя;
	КонецЕсли;
	
	Если НЕ СпециальноеДобавление Тогда
		
		РегламентированнаяОтчетностьВызовСервера.ВставитьОбластьВТабличныйДокумент(ТекТабличноеПоле, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
		
		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
	КонецЕсли;
	
	Если НазначитьИмяОбластиМЧ Тогда
		ТекТабличноеПоле.Область(НомерНижнЯчейкиОбласти + 1, , НомерНижнЯчейкиОбласти + (НомерНижнЯчейкиОбласти - НомерВерхЯчейкиОбласти) + 1, ).Имя = "";
		ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, ).Имя = ИмяМногострочнойЧасти;
	КонецЕсли;
	
	КолСтрокСтр1 = Формат(КолСтрок + 1, "ЧГ=");
	
	Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
		
		ИмяКолонки = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
		
		
		// переопределяем имена вставленной области
		Если СтруктураГруппы[0].Свойство(ИмяКолонки) Тогда
			
			ИмяОбластиЯчейки    = ИмяКолонки + "_" + КолСтрокСтр;
			ИмяНовОбластиЯчейки = ИмяКолонки + "_" + КолСтрокСтр1;
			
			ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяОбластиЯчейки];
			ОбластьЯчейки.Имя = ИмяНовОбластиЯчейки;
			
			Если (НомерГрафы = 1) Тогда
				ТекТабличноеПоле.Области["УдалитьСтроку" + ИмяОбластиЯчейки].Имя = "УдалитьСтроку" + ИмяНовОбластиЯчейки;
			КонецЕсли;
			
			// определяем границы ячейки исходной области
			НомерВерхСтрокиЯчейки  = ОбластьЯчейки.Верх - СдвигСтрок;
			НомерНижнСтрокиЯчейки  = ОбластьЯчейки.Низ  - СдвигСтрок;
			НомерЛевоКолонкиЯчейки = ОбластьЯчейки.Лево;
			НомерПравКолонкиЯчейки = ОбластьЯчейки.Право;
			
			// Назначаем имя ячейки исходной области,
			// (т.к. в результате вставки новой области оно было очищено)
			ОбластьЯчейкиИсходнойОбласти = ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки, НомерНижнСтрокиЯчейки, НомерПравКолонкиЯчейки);
			ОбластьЯчейкиИсходнойОбласти.Имя = ИмяОбластиЯчейки;
			
			Если (НомерГрафы = 1) Тогда
				
					ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки - 1, НомерНижнСтрокиЯчейки, НомерЛевоКолонкиЯчейки - 1).Имя  = "УдалитьСтроку" + ИмяОбластиЯчейки;
				
			КонецЕсли;
			
			// очищаем значения ячеек вставленной области
			Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
				ОбластьЯчейки.Очистить();
			КонецЕсли;
			
			Если ИмяКолонкиНомера <> Неопределено Тогда
				Если ИмяКолонкиНомера = ИмяКолонки Тогда
					Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
						ОбластьЯчейки.Значение = КолСтрокСтр1;
					Иначе
						ОбластьЯчейки.Текст = КолСтрокСтр1;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИмяГруппыБлока = Неопределено Тогда
		
			
		ИмяТекущейОбласти = ИмяГруппы + "01_" + КолСтрокСтр1;
		
		Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];
		
		// установим фокус на поле табличн. документа
		ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
		
	КонецЕсли;
	
	// добавляем в структуру многострочной группы новую строку
	ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,Форма);
	
	//ПрописатьФункцию добавления по всем страницам приложения
	
	Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
		Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
			ОбластьТД.Гиперссылка = Истина;
			ОбластьТД.Текст = "х";
		КонецЕсли;
	КонецЦикла;
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	
	ТекТабличноеПоле = ЭтаФорма["ТабличныйДокумент"];
	
	ТекущаяОбласть = ТекТабличноеПоле.ТекущаяОбласть;
	
	ИмяГруппы = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(ЭтаФорма, ТекущаяОбласть);
	
	Если ИмяГруппы = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не выбрана удаляемая строка многострочного раздела.'");
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьСтрокуЗавершение", ЭтотОбъект);
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Удалить выбранную строку?'"), Символы.ПС);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	#Если ВебКлиент Тогда
		УдалитьДополнительнуюСтрокуНаСервере();
	#Иначе
		УдалитьДополнительнуюСтрокуНаКлиенте();
	#КонецЕсли
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	МассивПересчета = Новый Массив;
	МассивПересчета.Добавить("Форма200_02Страница4");
	МассивПересчета.Добавить("Форма200_02Страница5");
	МассивПересчета.Добавить("Форма200_02Страница6");
	МассивПересчета.Добавить("Форма200_02Страница7");
	МассивПересчета.Добавить("Форма200_02Страница8");
	
	Для каждого Элемент из МассивПересчета Цикл
		РасчетНаКлиенте(Элемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДополнительнуюСтрокуНаСервере()
	
	УдалитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДополнительнуюСтрокуНаКлиенте()
	
	УдалитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьДополнительнуюСтроку(Форма, СпециальноеДобавление = Ложь, ИмяКолонкиНомера = Неопределено) Экспорт
	
	Перем ИсходноеКоличествоСтрокГруппы;
	Перем СтруктураГруппы;

	ТекущаяСтраница = Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	ТекТабличноеПоле = Форма.ТабличныйДокумент;

	ТекущаяОбласть = Форма.Элементы["ТабличныйДокумент"].ТекущаяОбласть;

	#Если НаКлиенте ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		ИмяГруппы = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(Форма, ТекущаяОбласть);
	#Иначе
		ИмяГруппы = РегламентированнаяОтчетностьВызовСервера.РазделТекущейОбластиНаСервере(Форма, ТекущаяОбласть);
	#КонецЕсли

	// исходное количество строк группы
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);

	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = Форма[СтруктураГруппы];

	// Выполним также проверку вхождения текущей (выделенной) ячейки в многострочный раздел
	ТекущаяОбласть = Форма.Элементы["ТабличныйДокумент"].ТекущаяОбласть;
	
	ИмяЯчейки = ТекущаяОбласть.Имя;

	// номер строки многострочного раздела определим
	// по имени выделенной ячейки
	НомУдаляемойСтроки = Число(Сред(ИмяЯчейки, СтрНайти(ИмяЯчейки, "_") + 1));
	НомерСтрокиТаблицы = НомУдаляемойСтроки - 1; // нумерация строк в таблице значений начинается с нуля
	
	Если СтруктураГруппы.Количество() > ИсходноеКоличествоСтрокГруппы Тогда
		
		ИмяПервойЯчейкиУдаляемойСтроки = "УдалитьСтроку" + ИмяГруппы + "01_" + Формат(НомУдаляемойСтроки, "ЧГ=0");

		// область первой ячейки удаляемой строки многострочного раздела
		ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяПервойЯчейкиУдаляемойСтроки];

		НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
		ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
		
		НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;
		НомерНижнЯчейкиОбласти = ОбластьЯчейки.Верх + ВысотаСтроки - 1;
		
		МногострочностьВРазделе = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе");
		МногострочностьВРазделеТип = ТипЗнч(МногострочностьВРазделе);
		Если МногострочностьВРазделеТип = Тип("Число") Тогда
			ИмяОбластиМнгЧ = "МногострочнаяЧасть";
		ИначеЕсли МногострочностьВРазделеТип = Тип("ДанныеФормыКоллекция") Тогда
			ИмяОбластиМнгЧ = МногострочностьВРазделе.НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0].Область;
		КонецЕсли;
		// Найдем координаты области, для последующего восстановления.

		Если ТекТабличноеПоле.Области.Найти(ИмяОбластиМнгЧ) <> Неопределено Тогда
			ОбластьВерх = ТекТабличноеПоле.Области[ИмяОбластиМнгЧ].Верх;
			ОбластьНиз = ТекТабличноеПоле.Области[ИмяОбластиМнгЧ].Низ;
		КонецЕсли;

		Если СпециальноеДобавление Тогда
			
		Иначе
					
			РегламентированнаяОтчетностьВызовСервера.УдалитьОбластьИзТабличногоДокумента(ТекТабличноеПоле, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
		
			Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
			
		КонецЕсли;
		// Восстановим область.
		ТекТабличноеПоле.Область(ОбластьВерх, 0, ОбластьНиз, 0).Имя = ИмяОбластиМнгЧ;

		КолвоСдвигаемыхСтрок = СтруктураГруппы.Количество() - НомУдаляемойСтроки;

		// обновим имена ячеек сдвинутых строк
		Если КолвоСдвигаемыхСтрок > 0 Тогда

			Для НСтр = НомУдаляемойСтроки + 1 По СтруктураГруппы.Количество() Цикл

				ТекСтрока = СтруктураГруппы[НСтр - 1];

				НСтрСтр = Формат(НСтр, "ЧГ=0");
				НСтрСтр1 = Формат(НСтр - 1, "ЧГ=0");
				
				Для НомерГрафы = 0 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
					
					Если НомерГрафы = 0 Тогда
						
						КолонкаИмя = "УдалитьСтроку" + ИмяГруппы + Формат( 1, "ЧЦ=2; ЧВН=");
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ИмяКолонкиНомера <> Неопределено Тогда
							Если ИмяКолонкиНомера = КолонкаИмя Тогда
								// обновляем порядковый номер строки
								
								СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
								НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
								ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер;
								
								// обновляем значение элемента таблицы значений
								ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
					КолонкаИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
					
					Если СтруктураГруппы[0].Свойство(КолонкаИмя) Тогда
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ИмяКолонкиНомера <> Неопределено Тогда
							Если ИмяКолонкиНомера = КолонкаИмя Тогда
								// обновляем порядковый номер строки
								
								СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
								НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
								ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер;
								
								// обновляем значение элемента таблицы значений
								ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
		КонецЕсли;
		// обновляем структуру многострочного раздела
		
		//Процедура удаления по всем страницам приложения
		УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма);
		
	Иначе
		// строка не удаляется в форме табличного документа,
		// а должна осуществляться сдвиг строк

		// обновляем структуру многострочного раздела
		// методом удаления выбранной строки и добавления пустой строки
		
		//Процедура удаления по всем страницам приложения
		УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма);
		
		//Процедура удаления по всем страницам приложения
		ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,Форма);
		
		// обновляем порядковые номера строк, выводимых в табличный документ
		Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
			
			НомерСтрокиВТаблице = СтруктураГруппы.Индекс(СтрокаТаблицы);
			НомерСтрокиВФормеТаблицы = Формат(НомерСтрокиВТаблице + 1, "ЧГ=0");
			
			Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
				
				КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
				
				Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
					
					Если ИмяКолонкиНомера <> Неопределено Тогда
						Если ИмяКолонкиНомера = КолонкаТаблицыИмя Тогда
							// обновляем порядковый номер строки
							СтрокаТаблицы[КолонкаТаблицыИмя] = НомерСтрокиВФормеТаблицы;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;	
				
			КонецЦикла;
		
		КонецЦикла;

		// Данные в многострочном блоке обновляются в декларациях!
		// Форма.ОбновитьСтруктуруМногострочногоРаздела(ИмяГруппы);
		// Обновляем экранную форму табличного документа
		#Если НаКлиенте Тогда
			Форма.ВывестиРазделВТабличныйДокументНаКлиенте(ИмяГруппы, СтруктураГруппы);
		#Иначе
			Форма.ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппы, СтруктураГруппы);
		#КонецЕсли
	
	КонецЕсли;
	
	// назначим текущей областью таблицы первую редактируемую ячейку
	// удаленной строки, если ее порядковый номер меньше кол-ва строк
	// многострочного раздела, или последней строки раздела в противном случае

	// определяем текущую область таблицы
	НомТекущейСтроки = Мин(НомУдаляемойСтроки, СтруктураГруппы.Количество());
	
	ИмяТекущейОбласти = "УдалитьСтроку" + ИмяГруппы + "01_" + Формат(НомТекущейСтроки, "ЧГ=0");
		
	Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];

	// установим фокус на поле табличн. документа
	ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
	
	ЕстьДопСтроки = Ложь;
	
	Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
		Если СтрЧислоВхождений(ОбластьТД.Имя, "_2") > 0 Тогда
			ЕстьДопСтроки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьДопСтроки Тогда
		Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
			Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
				ОбластьТД.Гиперссылка = Ложь;
				ОбластьТД.Текст = "";
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма)
	
	Если Число(Сред(ИмяГруппы,5,1)) = 1 Тогда
		
		СтруктураГруппы = Форма["П0001100002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0001200002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
	КонецЕсли;
	
	ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма,НомерСтрокиТаблицы, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппы) Экспорт
	
	Перем СтруктураГруппы;
	
	РегламентированнаяОтчетностьКлиентСервер.ОбновитьСтруктуруМногострочногоРаздела(ЭтаФорма, ИмяГруппы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы, Форма)
	
	Если Число(Сред(ИмяГруппы,5,1)) = 1 Тогда
		
		СтруктураГруппы = Форма["П0001100002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0001200002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
				
	КонецЕсли;
	
	ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма, СтруктураГруппы.Количество(), Ложь);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма, НомерСтроки, УдалитьСтроку)
	
	Если УдалитьСтроку = Ложь Тогда
		ИндексПересчета = НомерСтроки - 2
	Иначе
		ИндексПересчета = НомерСтроки;
	КонецЕсли;
	
	Если Число(Сред(ИмяГруппы,5,1)) = 1 Тогда
		
		СтруктураГруппы = Форма["П0001100002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000110000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0001200002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000120000201 = Индекс + 2;
		КонецЦикла;
				
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиРазделВТабличныйДокумент(Форма, ИмяГруппы, СтруктураГруппы)
	Перем ИсходноеКоличествоСтрокГруппы;
	
	#Если НаКлиенте Тогда
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИмяГруппы);
	#Иначе
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИмяГруппы);
	#КонецЕсли
		
	// определим исходное колво строк многострочного раздела,
	// соответствующее бумажной форме отчета
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
	
	// реальное кол-во строк (колво заполненных строк)
	ТекущееКоличествоСтрокГруппы = СтруктураГруппы.Количество();
		
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
		
	ПерерисоватьСтроки = (НЕ ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы);
		
	Раздел = Форма[ТекТабличноеПолеИмя];
	
	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// При восстановлении сохраненных данных отчета сравниваем исходное кол-во
	// отображаемых в форме строк многострочного раздела с реальным количеством
	// созданных строк в сохраненном отчете.
	Если ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы Тогда
		
		// При превышении реального кол-ва строк над исходным кол-вом (по шаблону),
		// автоматически добавляем необходимое колво строк.
		Форма.ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки);

		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
	КонецЕсли;
	
	// выводим значения строк
	Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
		НомерСтрокиВТаблице      = СтруктураГруппы.Индекс(СтрокаТаблицы);
		НомерСтрокиВФормеТаблицыСтр = Формат(НомерСтрокиВТаблице + 1, "ЧГ=");
		
		Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
			
			КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
				
			Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
				
				ЗначениеЯчейки = СтрокаТаблицы[КолонкаТаблицыИмя];
				ИмяЯчейки      = КолонкаТаблицыИмя + "_" + НомерСтрокиВФормеТаблицыСтр;
				
				ОбластьЯчейкиТаблицы = ТекТабличноеПоле.Области[ИмяЯчейки];
				
				Если ОбластьЯчейкиТаблицы.СодержитЗначение = Истина Тогда
					ОбластьЯчейкиТаблицы.Значение = ЗначениеЯчейки;
				Иначе
					ОбластьЯчейкиТаблицы.Текст = ЗначениеЯчейки;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы21", СтруктураРеквизитовФормы.мИдГруппы11);
	ИдГрупп.Вставить("мИдГруппы22", СтруктураРеквизитовФормы.мИдГруппы12);
		
	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

&НаСервере
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы11", СтруктураРеквизитовФормы.мИдГруппы11);
	ИдГрупп.Вставить("мИдГруппы12", СтруктураРеквизитовФормы.мИдГруппы12);
	
	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп) Экспорт
	
	Перем ТекТабличноеПоле;
	
	Если ИдГруппы = ИдГрупп.мИдГруппы11 Тогда
		
		ТекТабличноеПоле = "Форма70101_001Страница1";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы12 Тогда
		
		ТекТабличноеПоле = "Форма70101_001Страница2";
		
	КонецЕсли;
	
	Возврат ТекТабличноеПоле;
	
КонецФункции

&НаСервере
Процедура ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки) Экспорт
		
	ОбластьДопСтроки = ТекТабличноеПоле.ПолучитьОбласть("МногострочнаяЧасть");
	
	КоординатыОбластей = Новый Структура();
	
	Для Каждого Область Из ТекТабличноеПоле.Области Цикл
		
		Если СтрНайти(Область.Имя, "_") Тогда
			
			КоординатыОбластей.Вставить(Область.Имя, Область.Верх);
			
		КонецЕсли;
		
	КонецЦикла;
		
	МногострочнаяЧастьВерх = ТекТабличноеПоле.Области.МногострочнаяЧасть.Верх;
	
	МногострочнаяЧастьНиз = ТекТабличноеПоле.Области.МногострочнаяЧасть.Низ;
			
	ТекТабличноеПоле.ВставитьОбласть(ОбластьДопСтроки.Область(), ТекТабличноеПоле.Область(МногострочнаяЧастьНиз + 1, , МногострочнаяЧастьНиз + (ТекущееКоличествоСтрокГруппы - 1) * ВысотаСтроки), ТипСмещенияТабличногоДокумента.ПоВертикали);
		
	Для НомНовойСтроки = ИсходноеКоличествоСтрокГруппы По ТекущееКоличествоСтрокГруппы Цикл
		
		Постфикс = Формат(ТекущееКоличествоСтрокГруппы - НомНовойСтроки + 1, "ЧГ=");
		
		Для Каждого Область Из ОбластьДопСтроки.Области Цикл
			
			Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			
				ОбластьТаблДок = ТекТабличноеПоле.Область(КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Лево, КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Право);
							
				Если ОбластьТаблДок.СодержитЗначение Тогда
					ОбластьТаблДок.Очистить();
				КонецЕсли;
				
				ОбластьТаблДок.Имя = Лев(Область.Имя, СтрНайти(Область.Имя, "_")) + Постфикс;
				
			КонецЕсли;
			
		КонецЦикла;
						
	КонецЦикла;	
		
	ТекТабличноеПоле.Область(ТекТабличноеПоле.Области.МногострочнаяЧасть.Верх, , ТекТабличноеПоле.Области.МногострочнаяЧасть.Низ).Имя = "";
	
	ТекТабличноеПоле.Область(МногострочнаяЧастьВерх, , МногострочнаяЧастьНиз).Имя = "МногострочнаяЧасть";
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьМногострочнуюСтруктуруДляВыгрузки (ТекущееИмяФормы, ТаблицаМногострочнойФормы = Неопределено) Экспорт
	
	Возврат СформироватьМногострочнуюСтруктуруДляВыгрузкиНаСервере(ТекущееИмяФормы);	
	
КонецФункции

&НаСервере
Функция СформироватьМногострочнуюСтруктуруДляВыгрузкиНаСервере(ТекущееИмяФормы, ТаблицаМногострочнойФормы = Неопределено) Экспорт
	
	Перем ТаблицаСтраницРаздела;
	
	Если ТекущееИмяФормы = Неопределено тогда
		ТекущееИмяФормы = "Форма70101_001";
	КонецЕсли;	
	
	Если ТекущееИмяФормы = "Форма70101_001" Тогда
		
		МногострочнаяСтруктура = Новый Структура;
		
		ТекущийЛист = Неопределено;
		НомерСтроки = 0;
		КоличествоСтрок = ТаблицаМногострочнойФормы.Количество();
		
		Пока Истина Цикл 
			
			Если НомерСтроки >= КоличествоСтрок Тогда 
				Прервать;
			КонецЕсли;
			
			СтрокаТЗ = ТаблицаМногострочнойФормы[НомерСтроки];
			
			Если Не СтрокаТЗ.ИмяЛиста = ТекущийЛист Тогда
				
				МногострочнаяСтруктура.Вставить(СтрокаТЗ.ИмяЛиста, Новый Структура);
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста].Вставить("Строки", Новый ТаблицаЗначений);
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста].Вставить("ШапкаИПодвал", Новый ТаблицаЗначений);
				
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("Значение");
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("ИмяОбласти");
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("ИмяПараметра");
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("Итог");
				
				
				ТекущийЛист = СтрокаТЗ.ИмяЛиста;
				
			КонецЕсли;
			
			Если СтрокаТЗ.КоличествоROW = "0" Тогда
				//Заполняем таблицу значений параметров шапки
				Если ЗначениеЗаполнено(СтрокаТЗ.ИмяЯчейки) Тогда
					//Добавим новую строку в ТЗ значений шапки таблицы
					НоваяСтрока = МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Добавить();
					
					//Получим значение параметра из структуры формы
					ЗначениеПараметра = ЭтаФорма["СтруктураДанных" + СтрокаТЗ.КодФормы + ?(СтрокаТЗ.КодФормы = "Форма70101_001", СтрокаТЗ.ИмяЛиста, "Страница1")][СтрокаТЗ.ИмяЯчейки];
					
					НоваяСтрока.Значение 		= ЗначениеПараметра;
					НоваяСтрока.ИмяПараметра 	= СтрокаТЗ.ИмяЯчейки;
					НоваяСтрока.ИмяОбласти 		= СтрокаТЗ.ИмяЯчейки;
					НоваяСтрока.Итог 			= Ложь;
				КонецЕсли;
			Иначе 
				//А это уже строки таблицы
				//Определим состав колонок многострочной формы
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("ИмяЛиста", СтрокаТЗ.ИмяЛиста);
				СтруктураПоиска.Вставить("КоличествоROW", "15"); //вернуться
				СтрокиТаблицы = ТаблицаМногострочнойФормы.НайтиСтроки(СтруктураПоиска);
				
				ИмяТаблицы = Сред(СтрокаТЗ.ИмяЯчейки, 1, 11);
				
				//Проверям есть ли у нас вообще записи в многострочной форме
				//И формируем набор колонок таблицы значений
				ЕстьЗаписи = Ложь;
				Если Не ЭтотОбъект[ИмяТаблицы].Количество() = 0 Тогда
					Для Каждого Строка Из СтрокиТаблицы Цикл
						ИмяЯчейки = Сред(Строка.ИмяЯчейки, 1, 13);
						МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["Строки"].Колонки.Добавить(ИмяЯчейки);
						Если ЗначениеЗаполнено(ЭтотОбъект[ИмяТаблицы][0][ИмяЯчейки]) Тогда 
							ЕстьЗаписи = Истина;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				Если ЕстьЗаписи Тогда
					//Если записи обнаружены то заполняем таблицу значений
					Для Каждого СтрокаТаблицы Из ЭтотОбъект[ИмяТаблицы] Цикл 
						НоваяСтрока = МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["Строки"].Добавить();
						
						//Значение = ОпределитьЗначениеПараметра(ЭтотОбъект[ТаблицаВыгрузки[НомерСтроки].ИмяФормы][ТаблицаВыгрузки[НомерСтроки].ИмяЯчейки], ТаблицаВыгрузки[НомерСтроки].ИмяЯчейки);
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
						
						Если ИмяТаблицы = "П0001100002" Тогда
							НоваяСтрока.П000110000201 = ОпределитьЗначениеПараметра(СтрокаТаблицы.П000110000201,,Истина);	
						ИначеЕсли 	ИмяТаблицы = "П0001200002" Тогда
							НоваяСтрока.П000120000201 = ОпределитьЗначениеПараметра(СтрокаТаблицы.П000120000201,,Истина);	
						КонецЕсли;
						
						
					КонецЦикла;
				КонецЕсли;
				
				НомерСтроки = НомерСтроки + СтрокиТаблицы.Количество() - 1;
				
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
	КонецЕсли;
		
	Возврат МногострочнаяСтруктура;

КонецФункции

//+
&НаСервереБезКонтекста
Функция СоздатьГраницу (Дата)
	Граница =  Новый Граница(Дата,ВидГраницы.Исключая);
	Возврат Граница;	
КонецФункции

&НаСервере
Функция ПодменитьТекстЗапросаСхемыКомпоновкиДанных(СхемаКомпоновкиДанных = Неопределено, НаборДанных, ВидДействия = "")
	Если СхемаКомпоновкиДанных = Неопределено Тогда
		СхемаКомпоновкиДанных = Отчеты.РегламентированныйОтчет70101Форма.ПолучитьМакет("Расшифровка");
	ИначеЕсли ТипЗнч(СхемаКомпоновкиДанных) = Тип("Строка") Тогда
		СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(СхемаКомпоновкиДанных);
	КонецЕсли;
	СхемаКомпоновкиДанных.НаборыДанных.Найти(НаборДанных).Запрос = Отчеты.РегламентированныйОтчет70101Форма.СформироватьТекстЗапроса(НаборДанных);
	СхемаКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	Возврат СхемаКомпоновкиДанных;
	
КонецФункции

&НаСервере
Функция ПолучитьНалоговыйКомитетОрганизации(Организация)
	Возврат Организация.РегистрацияВНалоговомОргане;	
КонецФункции

&НаСервере
Функция СформироватьСписокОрганизаций(Организация, НалоговыйКомитет, ДатаОкончания) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НалоговыйКомитет", НалоговыйКомитет);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
    |	СтавкиНалогаНаИмущество.Организация
    |ИЗ
    |	РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.СрезПоследних(&ДатаОкончания, ) КАК СтавкиНалогаНаИмущество
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО СтавкиНалогаНаИмущество.Организация = Организации.Ссылка
    |ГДЕ
    |	СтавкиНалогаНаИмущество.НалоговыйОрган = &НалоговыйКомитет
	|	И (СтавкиНалогаНаИмущество.Организация = &Организация
	|	ИЛИ Организации.ГоловнаяОрганизация = &Организация)
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СписокОрганизаций = Новый Массив;
	Если Не РезультатЗапроса.Пустой() Тогда
		СписокОрганизаций = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Организация");
	КонецЕсли;
	СписокОрганизаций.Добавить(Организация);
	
	Возврат СписокОрганизаций;
	
КонецФункции	

Функция ОпределитьЗначениеПараметра(ЗначениеПараметра, ИмяАтрибута = Неопределено, НомерСтроки = Ложь,ВыгружатьНулевыеЗначения = Ложь)
	
	//МассивОпций = Новый Массив;
	//МассивОпций.Добавить("Пропорциональный");
	//МассивОпций.Добавить("Раздельный");
	//МассивОпций.Добавить("ПропорцИРаздел");
	//МассивОпций.Добавить("Дополнительная");
	//МассивОпций.Добавить("Ликвидационная");
	//МассивОпций.Добавить("Первоначальная");
	//МассивОпций.Добавить("ПоУведомлению");
	//МассивОпций.Добавить("Очередная");
	//МассивОпций.Добавить("Условие_B");
	//МассивОпций.Добавить("Условие_A");
	//МассивОпций.Добавить("ОтказОтВозврата");
	//
	//Если Не МассивОпций.Найти(ИмяАтрибута) = Неопределено Тогда
	//	Значение = ?(ЗначениеПараметра = "Х", Истина, Ложь);
	//Иначе 
	Значение = ?(Не ЗначениеЗаполнено(ЗначениеПараметра) И НЕ ВыгружатьНулевыеЗначения, "", ЗначениеПараметра);
	//КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Дата") Тогда
		Если Значение = Дата("00010101000000") Тогда 
			Значение = "";
		Иначе 
			Значение = Формат(Значение, "ДЛФ=Д");
		КонецЕсли;
	КонецЕсли;
	Если ТипЗнч(Значение) = Тип("Булево") Тогда 
		Значение = ?(Значение, "true", "");
	КонецЕсли;
	Если ТипЗнч(Значение) = Тип("Число") Тогда 
		Значение = Окр(Значение, 2);
		
		Если НомерСтроки Тогда
			Значение = Строка(Значение);
			ДлиннаНомера = СтрДлина(Значение);
			
			Для Счетчик = ДлиннаНомера По 5 Цикл 
				Значение = "0" + Значение;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат XMLСтрока(Значение);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяОтчета(ЭтаФормаИмя)
	Форма_Имя = СтрЗаменить(ЭтаФормаИмя, "Внешний", "");
	Возврат Сред(Лев(Форма_Имя, СтрНайти(Форма_Имя, ".Форма.") - 1), 7);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяФормыОтчета(ЭтаФормаИмя)
	Возврат Сред(ЭтаФормаИмя, СтрНайти(ЭтаФормаИмя, ".Форма.") + 7);
КонецФункции

&НаКлиенте
Процедура ПечатьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Печать(ДополнительныеПараметры.ВидПечати);
	
КонецПроцедуры
