
&ИзменениеИКонтроль("СформироватьПечатныеФормыЭтикетокИЦенниковТоваров")
Процедура игр_СформироватьПечатныеФормыЭтикетокИЦенниковТоваров(ДанныеПечати, ОбъектыПечати, КоллекцияПечатныхФормБСП)

	ИсходныеДанные = ПолучитьИзВременногоХранилища(ДанныеПечати.Товары);
	#Вставка
	КэшированныеЗначения = Новый Соответствие;
	#КонецВставки

	НужноПечататьЭтикетки = Ложь;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФормБСП, "ЭтикеткаТовары") Тогда
		НужноПечататьЭтикетки = Истина;
		КоллекцияПечатныхФормБСП.Удалить(КоллекцияПечатныхФормБСП.Найти(ВРег("ЭтикеткаТовары"), "ИмяВРЕГ"));
	КонецЕсли;

	НужноПечататьЦенники = Ложь;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФормБСП, "ЦенникТовары") Тогда
		НужноПечататьЦенники = Истина;
		КоллекцияПечатныхФормБСП.Удалить(КоллекцияПечатныхФормБСП.Найти(ВРег("ЦенникТовары"), "ИмяВРЕГ"));
	КонецЕсли;

	СтруктураНастроек = СтруктураНастроек();
	СтруктураНастроек.ОбязательныеПоля.Добавить("КоличествоЦенниковДляПечати");
	СтруктураНастроек.ОбязательныеПоля.Добавить("КоличествоЭтикетокДляПечати");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ШаблонЦенникаДляПечати");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ШаблонЭтикеткиДляПечати");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Номенклатура");
	Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры") Тогда
		СтруктураНастроек.ОбязательныеПоля.Добавить("Характеристика");
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры") Тогда
		СтруктураНастроек.ОбязательныеПоля.Добавить("Упаковка");
	КонецЕсли;

	#Удаление
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ПоляШаблонаПечатьТовары";
	#КонецУдаления
	#Вставка
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "игр_ПоляШаблонаПечатьТовары";
	ПредыдущиеЦены	= Неопределено;
	#КонецВставки

	// Собираем используемые поля из шаблонов.
	СоответствиеШаблонов = Новый Соответствие;
	Для Каждого СтрокаТЧ Из ИсходныеДанные Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ШаблонЭтикетки) И СтрокаТЧ.КоличествоЭтикеток > 0 И НужноПечататьЭтикетки Тогда
			СоответствиеШаблонов.Вставить(СтрокаТЧ.ШаблонЭтикетки);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТЧ.ШаблонЦенника) И СтрокаТЧ.КоличествоЦенников > 0 И НужноПечататьЦенники Тогда
			СоответствиеШаблонов.Вставить(СтрокаТЧ.ШаблонЦенника);
		КонецЕсли;
	КонецЦикла;
	Если ДанныеПечати.Свойство("СтруктураМакетаШаблона") И ЗначениеЗаполнено(ДанныеПечати.СтруктураМакетаШаблона) Тогда
		СоответствиеШаблонов.Вставить(Справочники.ШаблоныЭтикетокИЦенников.ПустаяСсылка());
	КонецЕсли;

	// Заполняем коллекцию обязательных полей и формируем соответствие шаблонов.
	Для Каждого КлючИЗначение ИЗ СоответствиеШаблонов Цикл

		ШаблонЭтикетокИЦенников = КлючИЗначение.Ключ;

		Если ЗначениеЗаполнено(ШаблонЭтикетокИЦенников) Тогда
			СтруктураШаблона = КлючИЗначение.Ключ.Шаблон.Получить();
		Иначе
			СтруктураШаблона = ДанныеПечати.СтруктураМакетаШаблона;
		КонецЕсли;

		// Структура шаблонов.
		СтруктураНастроек.СоответствиеШаблоновИСтруктурыШаблонов.Вставить(ШаблонЭтикетокИЦенников, СтруктураШаблона);

		// Добавляем в массив обязательных полей поля, присутствующие в печатной форме ценника.
		Для Каждого Элемент Из СтруктураШаблона.ПараметрыШаблона Цикл
			СтруктураНастроек.ОбязательныеПоля.Добавить(Элемент.Ключ);
		КонецЦикла;

	КонецЦикла;

	СтруктураНастроек.ПараметрыДанных.Вставить("Организация", ДанныеПечати.Организация);

	СтруктураНастроек.ПараметрыДанных.Вставить("ПравилоОбмена",                 ДанныеПечати.ПравилоОбмена);
	СтруктураНастроек.ПараметрыДанных.Вставить("МаксимальныйКодВесовогоТовара", ДанныеПечати.МаксимальныйКодВесовогоТовара);
	СтруктураНастроек.ПараметрыДанных.Вставить("ПравилоВыгрузкиВВесы",          ДанныеПечати.ПравилоВыгрузкиВВесы);

	СтруктураНастроек.ПараметрыДанных.Вставить("ВидЦены",       ДанныеПечати.ВидЦены);
	СтруктураНастроек.ПараметрыДанных.Вставить("Дата",          ДанныеПечати.Дата);

	СтруктураНастроек.ПараметрыДанных.Вставить("ВидЦеныДополнительно", ДанныеПечати.ВидЦеныДополнительно);
	СтруктураНастроек.ПараметрыДанных.Вставить("ДатаДополнительно",    ДанныеПечати.ДатаДополнительно);

	СтруктураНастроек.ИсходныеДанные = ИсходныеДанные;

	#Область ПодготовкаСтруктурыДанныхШаблона

	СтруктураРезультата = ПодготовитьСтруктуруДанных(СтруктураНастроек, "Товары");

	#КонецОбласти

	#Область ФормированиеТабличногоДокумента

	Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;

	// Подготовка коллекции печатных форм.
	КоллекцияПечатныхФорм = Новый ТаблицаЗначений;
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("СинонимМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("ТабличныйДокумент");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяКолонкиКоличество");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяКолонкиШаблон");
	КоллекцияПечатныхФорм.Колонки.Добавить("Шаблон");

	Для Каждого КлючИЗначение Из СтруктураНастроек.СоответствиеШаблоновИСтруктурыШаблонов Цикл

		Если ((ЗначениеЗаполнено(КлючИЗначение.Ключ) И КлючИЗначение.Ключ.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляТоваров) ИЛИ Не ЗначениеЗаполнено(КлючИЗначение.Ключ))
			И НужноПечататьЭтикетки Тогда

			ПечатнаяФорма = КоллекцияПечатныхФорм.Добавить();
			ПечатнаяФорма.ИмяМакета            = "Этикетка: "+КлючИЗначение.Ключ;
			ПечатнаяФорма.СинонимМакета        = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Этикетка: %1'"), КлючИЗначение.Ключ);
			ПечатнаяФорма.ИмяКолонкиКоличество = "КоличествоЭтикетокДляПечати";
			ПечатнаяФорма.ИмяКолонкиШаблон     = "ШаблонЭтикеткиДляПечати";
			ПечатнаяФорма.Шаблон = КлючИЗначение.Ключ;

		КонецЕсли;

		Если ((ЗначениеЗаполнено(КлючИЗначение.Ключ) И КлючИЗначение.Ключ.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЦенникДляТоваров) ИЛИ Не ЗначениеЗаполнено(КлючИЗначение.Ключ))
			И НужноПечататьЦенники Тогда

			ПечатнаяФорма = КоллекцияПечатныхФорм.Добавить();
			ПечатнаяФорма.ИмяМакета            = "Ценник: " + КлючИЗначение.Ключ;
			ПечатнаяФорма.СинонимМакета        = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Ценник: %1'"), КлючИЗначение.Ключ);
			ПечатнаяФорма.ИмяКолонкиКоличество = "КоличествоЦенниковДляПечати";
			ПечатнаяФорма.ИмяКолонкиШаблон     = "ШаблонЦенникаДляПечати";
			ПечатнаяФорма.Шаблон = КлючИЗначение.Ключ;

		КонецЕсли;

	КонецЦикла;

	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл

		НомерКолонки = 0;
		НомерРяда = 0;

		Для Каждого СтрокаТовары Из СтруктураРезультата.Таблица Цикл

			Если СтрокаТовары[ПечатнаяФорма.ИмяКолонкиКоличество] > 0 И СтрокаТовары[ПечатнаяФорма.ИмяКолонкиШаблон] = ПечатнаяФорма.Шаблон Тогда

				СтруктураШаблона = СтруктураНастроек.СоответствиеШаблоновИСтруктурыШаблонов.Получить(СтрокаТовары[ПечатнаяФорма.ИмяКолонкиШаблон]);

				Если ПечатнаяФорма.ТабличныйДокумент = Неопределено Тогда
					ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
				КонецЕсли;

				Область = СтруктураШаблона.МакетЭтикетки.ПолучитьОбласть(СтруктураШаблона.ИмяОбластиПечати);

				// Применение настроек табличного документа.
				ЗаполнитьЗначенияСвойств(ПечатнаяФорма.ТабличныйДокумент, СтруктураШаблона.МакетЭтикетки, , "ОбластьПечати");

				НомерСтрокиНачало = ПечатнаяФорма.ТабличныйДокумент.ВысотаТаблицы + 1;

				Для каждого ПараметрШаблона Из СтруктураШаблона.ПараметрыШаблона Цикл
					Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Область.Параметры, ПараметрШаблона.Значение) Тогда
						НаименованиеКолонки = СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить(Справочники.ШаблоныЭтикетокИЦенников.ИмяПоляВШаблоне(ПараметрШаблона.Ключ));
						Если НаименованиеКолонки <> Неопределено Тогда
							Область.Параметры[ПараметрШаблона.Значение] = СтрокаТовары[НаименованиеКолонки];
							#Вставка
							ВВерхний = (Найти(ПараметрШаблона.Ключ, "Наименование") > 0);
							Если ВВерхний Тогда
								Область.Параметры[ПараметрШаблона.Значение] = ВРег(СтрокаТовары[НаименованиеКолонки]);
							КонецЕсли;
							Если ПараметрШаблона.Ключ = "ЦенаПредыдущая" Тогда
								Если ПредыдущиеЦены = Неопределено Тогда
									ПредыдущиеЦены = игр_ПолучитьПредыдущиеЦены(СтруктураРезультата.Таблица, СтруктураНастроек.ПараметрыДанных.ВидЦены);
								КонецЕсли;
								Область.Параметры[ПараметрШаблона.Значение] = ПредыдущиеЦены[СтрокаТовары.Номенклатура];
							КонецЕсли;
							Если ПараметрШаблона.Ключ = "СуммаБонусов" Тогда
								Область.Параметры[ПараметрШаблона.Значение] = ОКР(СтрокаТовары.Цена * 0.03, 0);
							КонецЕсли;
							Если ПараметрШаблона.Ключ = "СимволБазовойЦены" Тогда
								Область.Параметры[ПараметрШаблона.Значение] = игр_СимволБазовойЦены(СтрокаТовары.Номенклатура, КэшированныеЗначения);
							КонецЕсли;
							Если ПараметрШаблона.Ключ = "ОсновнаяЯчейка" И ДанныеПечати.Свойство("Склад") Тогда
								Область.Параметры[ПараметрШаблона.Значение] = игр_ОсновнаяЯчейка(СтрокаТовары.Номенклатура, ДанныеПечати.Склад, КэшированныеЗначения);
							КонецЕсли;
							#КонецВставки
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;

				Для каждого Рисунок Из Область.Рисунки Цикл

					#Вставка     
					Если Рисунок.Имя = "КодМаркировки" Тогда
						Рисунок.Картинка = игр_ПолучитьШтрихкодМаркировки(
							СтрЗаменить(СтрокаТовары.игр_КодМаркировки, Символ(29),""),
							20, 
							Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе),
							Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе)); 
						Продолжить;
					КонецЕсли;
					#КонецВставки
					Если СтрНайти(Рисунок.Имя, Справочники.ШаблоныЭтикетокИЦенников.ИмяПараметраШтрихкод()) = 1 Тогда
						
						ЗначениеШтрихкода = СтрокаТовары[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить(Справочники.ШаблоныЭтикетокИЦенников.ИмяПараметраШтрихкод())];
						Если ЗначениеЗаполнено(ЗначениеШтрихкода) Тогда
							ЗначениеШтрихкодаДляКомпоненты = ЗначениеШтрихкода;
							Если СтруктураШаблона.ТипКода = 2 ИЛИ СтруктураШаблона.ТипКода = 17 Тогда
								ЧтениеШтрихкода = ШтрихкодыУпаковокКлиентСервер.ПараметрыШтрихкода(СокрЛП(ЗначениеШтрихкода));
								Если НЕ ЧтениеШтрихкода.Результат = Неопределено Тогда
									Если ЧтениеШтрихкода.ТипШтрихкода = Перечисления.ТипыШтрихкодов.GS1_128
										ИЛИ ЧтениеШтрихкода.ТипШтрихкода = Перечисления.ТипыШтрихкодов.GS1_DataBarExpandedStacked Тогда
										ЗначениеШтрихкодаДляКомпоненты = ШтрихкодыУпаковокКлиентСервер.ШтрихкодGS1(ЧтениеШтрихкода.Результат,
										Истина, ШтрихкодыУпаковокКлиентСервер.СимволОкончанияСтрокиПеременнойДлины());
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;

							ПараметрыШтрихкода = Новый Структура;
							ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
							ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
							ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(ЗначениеШтрихкодаДляКомпоненты));
							ПараметрыШтрихкода.Вставить("ТипКода",         СтруктураШаблона.ТипКода);
							ПараметрыШтрихкода.Вставить("ОтображатьТекст", СтруктураШаблона.ОтображатьТекст);
							ПараметрыШтрихкода.Вставить("РазмерШрифта",    СтруктураШаблона.РазмерШрифта);

							Рисунок.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);

						КонецЕсли;

					КонецЕсли;

					Если СтрНайти(Рисунок.Имя, "ЗнакВалюты") = 1 Тогда
						ЗначениеКодаВалюты = СтрокаТовары[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить(Справочники.ШаблоныЭтикетокИЦенников.ИмяПараметраКодВалюты())];
						Попытка
							Рисунок.Картинка = Новый Картинка(Справочники.ШаблоныЭтикетокИЦенников.ПолучитьМакет("ЗнакВалюты" + ЗначениеКодаВалюты), Истина);
						Исключение
							Рисунок.Картинка = Новый Картинка;
						КонецПопытки;
					КонецЕсли;

				КонецЦикла;

				Для Инд = 1 По СтрокаТовары[ПечатнаяФорма.ИмяКолонкиКоличество] Цикл // Цикл по количеству экземпляров

					НомерКолонки = НомерКолонки + 1;

					Если НомерКолонки = 1 Тогда

						НомерРяда = НомерРяда + 1;

						ПечатнаяФорма.ТабличныйДокумент.Вывести(Область);

					Иначе

						ПечатнаяФорма.ТабличныйДокумент.Присоединить(Область);

					КонецЕсли;

					Если НомерКолонки = СтруктураШаблона.КоличествоПоГоризонтали И НомерРяда = СтруктураШаблона.КоличествоПоВертикали Тогда

						НомерРяда    = 0;
						НомерКолонки = 0;

						ПечатнаяФорма.ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();

					ИначеЕсли НомерКолонки = СтруктураШаблона.КоличествоПоГоризонтали Тогда

						НомерКолонки = 0;

					КонецЕсли;

				КонецЦикла; // Цикл по количеству экземпляров

			КонецЕсли;

		КонецЦикла; // Цикл по строкам таблицы товаров

	КонецЦикла;

	#КонецОбласти

	МассивСтрокДляУдаления = Новый Массив;

	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
		Если ПечатнаяФорма.ТабличныйДокумент <> Неопределено Тогда
			НоваяСтрока = КоллекцияПечатныхФормБСП.Добавить();

			НоваяСтрока.ИмяМакета = ПечатнаяФорма.ИмяМакета;
			НоваяСтрока.ИмяВРЕГ   = ВРег(ПечатнаяФорма.ИмяМакета);
			НоваяСтрока.Экземпляров = 1;

			НоваяСтрока.ТабличныйДокумент = ПечатнаяФорма.ТабличныйДокумент;
			НоваяСтрока.СинонимМакета = ПечатнаяФорма.СинонимМакета;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция игр_ПолучитьШтрихкодМаркировки(ЗначШтрихкод, ЗначТипШтрихкода, ШиринаШтрихкода, ВысотаШтрихкода)
	
	Менеджер	= ОбщегоНазначения.ОбщийМодуль("игр_ГенерацияШтрихкода");
	
	СтрокаШК	= ЗначШтрихкод;
//	СтрокаШК	= СтрЗаменить(ЗначШтрихкод, "91", Символ(29)+"91");
//	СтрокаШК	= СтрЗаменить(СтрокаШК, "92", Символ(29)+"92");
	
	ПараметрыШтрихкода = Менеджер.ПараметрыГенерацииШтрихкода();
	
	ПараметрыШтрихкода.Ширина = ШиринаШтрихкода;
	ПараметрыШтрихкода.Высота = ВысотаШтрихкода;
	ПараметрыШтрихкода.ТипКода = ЗначТипШтрихкода;
	ПараметрыШтрихкода.Штрихкод = СтрокаШК;
	
	//ПараметрыШтрихкода.УголПоворота = Число(УголПоворота);
	//ПараметрыШтрихкода.ПрозрачныйФон = ПрозрачныйФон;
	//ПараметрыШтрихкода.УровеньКоррекцииQR = УровеньКоррекцииQR;
	//ПараметрыШтрихкода.ОтображатьТекст = ОтображатьТекст;
	//ПараметрыШтрихкода.Масштабировать = Масштабировать;
	//ПараметрыШтрихкода.СохранятьПропорции = СохранятьПропорции;
	//ПараметрыШтрихкода.ВертикальноеВыравнивание = ВертикальноеВыравнивание; 
	//ПараметрыШтрихкода.GS1DatabarКоличествоСтрок = КоличествоСтрокGS1Databar;
	//ПараметрыШтрихкода.ТипВходныхДанных = 0;  // Тип входных данных (0-Строка, 1-Base64).
	//ПараметрыШтрихкода.УбратьЛишнийФон = УбратьЛишнийФон;
	//ПараметрыШтрихкода.ЛоготипКартинка = КартинкаBase64;
	//ПараметрыШтрихкода.ЛоготипРазмерПроцентОтШК = ЛоготипРазмерПроцентОтШК;
	
	ПараметрыШтрихкода.НовыйВызовКомпоненты = Истина;
	РезультатШтрихкод = Менеджер.ИзображениеШтрихкода(ПараметрыШтрихкода);
	
	Если НЕ РезультатШтрихкод.Результат Тогда
		Сообщить(НСтр("ru='Ошибка генерации штрихкода.'"));
	КонецЕсли;
	
	Возврат РезультатШтрихкод.Картинка; 
	
КонецФункции

Функция игр_ПолучитьПредыдущиеЦены(ИсходнаяТаблица, ВидЦены) 
	
	Результат	= Новый Соответствие;
	
	Запрос	= Новый Запрос;
	Запрос.Текст = игр_ТекстЗапросаПредыдущиеЦены();
	
	Запрос.УстановитьПараметр("Таблица", ИсходнаяТаблица);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Номенклатура, Выборка.Цена);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция игр_СимволБазовойЦены(Номенклатура, Кэш)
	
	Результат = "!";
	
	Запрос	= Новый Запрос;
	
	Если Кэш["БазоваяЦена"] = Неопределено Тогда
		Запрос.Текст = "ВЫБРАТЬ Т.Ссылка КАК Ссылка ИЗ Справочник.ВидыЦен КАК Т ГДЕ Т.Наименование = ""2. Базовая Оптовая""";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Кэш.Вставить("БазоваяЦена", Выборка.Ссылка);
		Иначе
			Кэш.Вставить("БазоваяЦена", Справочники.ВидыЦен.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;
	
	Если Кэш["БазовыеЦены"] <> Неопределено
		И Кэш["БазовыеЦены"][Номенклатура] <> Неопределено Тогда
		
		Если Кэш["БазовыеЦены"][Номенклатура] > 0 Тогда
			Возврат Результат;
		Иначе
			Возврат "";
		КонецЕсли;
		
	КонецЕсли;
	
	Если Кэш["БазовыеЦены"] = Неопределено Тогда
		Кэш["БазовыеЦены"] = Новый Соответствие;
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			,
	|			ВидЦены = &ВидЦены
	|				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Характеристика"
	;
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ВидЦены", Кэш["БазоваяЦена"]);
	Выборка	= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Кэш["БазовыеЦены"].Вставить(Номенклатура, Выборка.Цена);	
	Иначе
		Кэш["БазовыеЦены"].Вставить(Номенклатура, 0);	
	КонецЕсли;
	
	Если Кэш["БазовыеЦены"][Номенклатура] > 0 Тогда
		Возврат "";
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

Функция игр_ОсновнаяЯчейка(Номенклатура, Склад, Кэш)
	
	Запрос	= Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Размещение.Ячейка КАК Ячейка
	|ИЗ
	|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК Размещение
	|
	|ГДЕ 
	|	Размещение.Номенклатура = &Номенклатура
	|	И Размещение.Склад = &Склад
	|	И Размещение.ОсновнаяЯчейка"
	;
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	Выборка	= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ячейка;	
	Иначе
		Возврат "";	
	КонецЕсли;
		
КонецФункции

Функция игр_ТекстЗапросаПредыдущиеЦены() 
	
	ТекстЗапроса	= 
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&Таблица КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.Характеристика КАК Характеристика,
	|	ЦеныНоменклатуры.Период КАК Период,
	|	ЦеныНоменклатуры.Цена КАК Цена
	|ПОМЕСТИТЬ ВТ_ВыборкаЦен
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО ВТ_Товары.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|			И ВТ_Товары.Характеристика = ЦеныНоменклатуры.Характеристика
	|			И (ЦеныНоменклатуры.ВидЦены = &ВидЦены)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыборкаЦен.Номенклатура КАК Номенклатура,
	|	ВТ_ВыборкаЦен.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ВТ_ВыборкаЦен.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_МаксимальныйПериод
	|ИЗ
	|	ВТ_ВыборкаЦен КАК ВТ_ВыборкаЦен
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыборкаЦен.Номенклатура,
	|	ВТ_ВыборкаЦен.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыборкаЦен.Номенклатура КАК Номенклатура,
	|	ВТ_ВыборкаЦен.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ВТ_ВыборкаЦен.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ПредыдущийПериод
	|ИЗ
	|	ВТ_ВыборкаЦен КАК ВТ_ВыборкаЦен
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксимальныйПериод КАК ВТ_МаксимальныйПериод
	|		ПО ВТ_ВыборкаЦен.Номенклатура = ВТ_МаксимальныйПериод.Номенклатура
	|			И ВТ_ВыборкаЦен.Характеристика = ВТ_МаксимальныйПериод.Характеристика
	|			И ВТ_ВыборкаЦен.Период < ВТ_МаксимальныйПериод.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыборкаЦен.Номенклатура,
	|	ВТ_ВыборкаЦен.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыборкаЦен.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ВТ_ВыборкаЦен.Цена) КАК Цена
	|ИЗ
	|	ВТ_ВыборкаЦен КАК ВТ_ВыборкаЦен
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПредыдущийПериод КАК ВТ_ПредыдущийПериод
	|		ПО ВТ_ВыборкаЦен.Номенклатура = ВТ_ПредыдущийПериод.Номенклатура
	|			И ВТ_ВыборкаЦен.Характеристика = ВТ_ПредыдущийПериод.Характеристика
	|			И ВТ_ВыборкаЦен.Период = ВТ_ПредыдущийПериод.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыборкаЦен.Номенклатура"
	;
	
	Возврат ТекстЗапроса;
	
КонецФункции

&ИзменениеИКонтроль("ПодготовитьСтруктуруДанных")
Функция игр_ПодготовитьСтруктуруДанных(СтруктураНастроек, Режим)

	Если СтруктураНастроек.ИсходныеДанные <> Неопределено Тогда
		ИсходныеДанные = СтруктураНастроек.ИсходныеДанные.Скопировать();
	Иначе
		ИсходныеДанные = Неопределено;
	КонецЕсли;

	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("Таблица",                             Неопределено);
	СтруктураРезультата.Вставить("СоответствиеПолейСКДКолонкамТаблицы", Новый Соответствие);

	// Схема компоновки.
	СхемаКомпоновкиДанных = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет(СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных);
	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных.НаборДанных.Запрос;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
	"&ТекстЗапросаКоэффициентУпаковки1",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"УпаковкиНоменклатуры",
	"ИсходныеДанные.Номенклатура"));

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
	"&ТекстЗапросаКоэффициентУпаковки2",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ЕдиничныеУпаковкиВладельцы.Упаковка",
	"ЕдиничныеУпаковкиВладельцы.Номенклатура"));

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
	"&ТекстЗапросаКоэффициентУпаковки3",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ИсходныеДанные.Упаковка",
	"ИсходныеДанные.Номенклатура"));

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
	"&ТекстЗапросаКоэффициентУпаковки4",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ЕдиничныеУпаковкиНоменклатур.Упаковка",
	"ЕдиничныеУпаковкиНоменклатур.Номенклатура"));

	Если Режим = "ШтрихкодыУпаковок" Тогда
		// Добавляем поля в текст запроса СКД
		// Поля для GS1_128 и GS1_DataBarExpandedStacked одинаковы
		ИдентификаторыТипыКолонок = ШтрихкодыУпаковокКлиентСерверПовтИсп.ТипыКолонокПечатиПоТипуШтрихкода(Перечисления.ТипыШтрихкодов.GS1_128);

		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		ТекстРазрешенныхПолейИсходный =
		"{ВЫБРАТЬ
		|	ШтрихкодУпаковкиТовара.*,
		|	Штрихкод,
		|	Номенклатура.*,
		|	Характеристика.*,
		|	ЦифраРасширения,
		|	ПрефиксКомпанииGS1,
		|	СерийныйНомер,
		|	КонтрольноеЧисло,
		|	ИдентификаторОрганизации,
		|	ДатаМаркировки,
		|	НомерПоПорядку}";
		ТекстРазрешенныхПолейДобавляемый = "";

		Для каждого ИдентификаторИТипКолонки Из ИдентификаторыТипыКолонок Цикл
			ИдентификаторПрименения = ИдентификаторИТипКолонки.Ключ;
			ИмяКолонки  = "ИдентификаторПрименения_" + ИдентификаторПрименения;
			ТипЗначения = ИдентификаторИТипКолонки.Значение;
			Если ТипЗначения.СодержитТип(Тип("Число")) Тогда
				ВыражениеПоля = "0";
			ИначеЕсли ТипЗначения.СодержитТип(Тип("Дата")) Тогда
				ВыражениеПоля = "ДАТАВРЕМЯ(1, 1, 1)";
			Иначе
				ВыражениеПоля = """""";
			КонецЕсли;
			СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Источники[0].Источник.Запрос.Операторы[0].ВыбираемыеПоля.Добавить(ВыражениеПоля);
			ИндексПоследнейКолонки = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Источники[0].Источник.Запрос.Колонки.Количество() - 1;
			ДобавленнаяКолонка = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Источники[0].Источник.Запрос.Колонки[ИндексПоследнейКолонки];
			ДобавленнаяКолонка.Псевдоним   = ИмяКолонки;
			СхемаЗапроса.ПакетЗапросов[0].Операторы[0].ВыбираемыеПоля.Добавить("ИсходныеДанные." + ИмяКолонки);
			СхемаЗапроса.ПакетЗапросов[1].Операторы[0].ВыбираемыеПоля.Добавить("ИсходныеДанныеПоследнийЗапрос." + ИмяКолонки);

			ТекстРазрешенныхПолейДобавляемый = ТекстРазрешенныхПолейДобавляемый
			+ 	",
			|	" + ИмяКолонки;

			ПолеНабора = ФинансоваяОтчетностьСервер.НовоеПолеНабора(
			СхемаКомпоновкиДанных.НаборыДанных.НаборДанных,
			ИмяКолонки,
			"ПоляGS1." + ИмяКолонки,
			ИмяКолонки,
			ТипЗначения);
		КонецЦикла;

		ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
		ТекстРазрешенныхПолейДобавляемый = СтрЗаменить(ТекстРазрешенныхПолейИсходный, "}", ТекстРазрешенныхПолейДобавляемый + "}");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстРазрешенныхПолейИсходный, ТекстРазрешенныхПолейДобавляемый);

	КонецЕсли;

	СхемаКомпоновкиДанных.НаборыДанных.НаборДанных.Запрос = ТекстЗапроса;

	// Подготовка компоновщика макета компоновки данных.
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Компоновщик.Настройки.Отбор.Элементы.Очистить();

	// Отбор компоновщика настроек.
	Если СтруктураНастроек.КомпоновщикНастроек <> Неопределено Тогда
		КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(Компоновщик.Настройки.Отбор, СтруктураНастроек.КомпоновщикНастроек.Настройки.Отбор);
	КонецЕсли;

	// Выбранные поля компоновщика настроек.
	Для Каждого ОбязательноеПоле Из СтруктураНастроек.ОбязательныеПоля Цикл
		ПолеСКД = КомпоновкаДанныхСервер.НайтиПолеСКДПоПолномуИмени(Компоновщик.Настройки.Выбор.ДоступныеПоляВыбора.Элементы, ОбязательноеПоле);
		Если ПолеСКД <> Неопределено Тогда
			ВыбранноеПоле = Компоновщик.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Поле = ПолеСКД.Поле;
		КонецЕсли;
	КонецЦикла;

	Если Режим = "Товары" Тогда
		// Заполнение параметров.
		Для Каждого ПараметрДанных Из СтруктураНастроек.ПараметрыДанных Цикл
			Если ПараметрДанных.Ключ = "Склад" Тогда // Если склад не заполнен - не используем параметр
				УстановитьЗначениеПараметраСКД(Компоновщик, ПараметрДанных.Ключ, ПараметрДанных.Значение, Ложь);
			Иначе
				УстановитьЗначениеПараметраСКД(Компоновщик, ПараметрДанных.Ключ, ПараметрДанных.Значение);
			КонецЕсли;
		КонецЦикла;
		УстановитьЗначениеПараметраСКД(Компоновщик, "ТекущееВремя",        ТекущаяДатаСеанса());
		УстановитьЗначениеПараметраСКД(Компоновщик, "ТекущийПользователь", Пользователи.ТекущийПользователь());
	КонецЕсли;

	// Компоновка макета компоновки данных.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Если Режим = "Товары" Тогда
		СегментыСервер.ВключитьОтборПоСегментуНоменклатурыВСКД(Компоновщик);
	КонецЕсли;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Компоновщик.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	Для каждого Поле Из МакетКомпоновкиДанных.НаборыДанных.НаборДанных.Поля Цикл
		СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Вставить(Справочники.ШаблоныЭтикетокИЦенников.ИмяПоляВШаблоне(Поле.ПутьКДанным), Поле.Имя);
	КонецЦикла;

	Запрос = Новый Запрос(МакетКомпоновкиДанных.НаборыДанных.НаборДанных.Запрос);

	// Заполнение параметров с полей отбора компоновщика настроек формы обработки.
	Для каждого Параметр Из МакетКомпоновкиДанных.ЗначенияПараметров Цикл
		Запрос.Параметры.Вставить(Параметр.Имя, Параметр.Значение);
	КонецЦикла;

	Если Режим = "Товары" Тогда
		// Подмена запроса для расчета цен...
		Если ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры") Тогда

			ЗаменяемыйТекст = "ЦеныНоменклатурыСрезПоследних.Цена";
			ТекстЗамены = " ВЫРАЗИТЬ(
			|          ЦеныНоменклатурыСрезПоследних.Цена
			|          / 
			|          ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) 
			|          * 
			|          ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) КАК Число(15,2)) ";

			ТекстЗамены = СтрЗаменить(ТекстЗамены, "&ТекстЗапросаКоэффициентУпаковки1",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ЦеныНоменклатурыСрезПоследних.Упаковка",
			"ЦеныНоменклатурыСрезПоследних.Номенклатура"));
			ТекстЗамены = СтрЗаменить(ТекстЗамены, "&ТекстЗапросаКоэффициентУпаковки2",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ИсходныеДанныеПоследнийЗапрос.Упаковка",
			"ИсходныеДанныеПоследнийЗапрос.Номенклатура"));
			Запрос.Текст = СтрЗаменить(Запрос.Текст, ЗаменяемыйТекст, ТекстЗамены);

			ЗаменяемыйТекст = "ЦеныНоменклатурыСрезПоследнихДополнительно.Цена";
			ТекстЗамены = " ВЫРАЗИТЬ(
			|          ЦеныНоменклатурыСрезПоследнихДополнительно.Цена
			|          / 
			|          ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) 
			|          * 
			|          ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) КАК Число(15,2)) ";
			ТекстЗамены = СтрЗаменить(ТекстЗамены, "&ТекстЗапросаКоэффициентУпаковки1",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ЦеныНоменклатурыСрезПоследнихДополнительно.Упаковка",
			"ЦеныНоменклатурыСрезПоследнихДополнительно.Номенклатура"));
			ТекстЗамены = СтрЗаменить(ТекстЗамены, "&ТекстЗапросаКоэффициентУпаковки2",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ИсходныеДанныеПоследнийЗапрос.Упаковка",
			"ИсходныеДанныеПоследнийЗапрос.Номенклатура"));
			Запрос.Текст = СтрЗаменить(Запрос.Текст, ЗаменяемыйТекст, ТекстЗамены);

			ЗаменяемыйТекст = "ТоварыНаСкладахОстатки.ВНаличииОстаток";
			ТекстЗамены = " ВЫРАЗИТЬ(
			|          ТоварыНаСкладахОстатки.ВНаличииОстаток
			|          / 
			|          ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК Число(15,2)) ";
			ТекстЗамены = СтрЗаменить(ТекстЗамены, "&ТекстЗапросаКоэффициентУпаковки",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ИсходныеДанныеПоследнийЗапрос.Упаковка",
			"ИсходныеДанныеПоследнийЗапрос.Номенклатура"));
			Запрос.Текст = СтрЗаменить(Запрос.Текст, ЗаменяемыйТекст, ТекстЗамены);

		КонецЕсли;

		// Подмена запроса при печати этикеток...
		Если ИсходныеДанные <> Неопределено Тогда

			ТекстВременнойТаблицы =
			"	(ВЫБРАТЬ
			|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
			|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
			|		ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
			|		0 КАК Порядок,
			|		0 КАК Количество)";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, ТекстВременнойТаблицы, "&Таблица");

			ОбщегоНазначенияУТ.ПронумероватьТаблицуЗначений(ИсходныеДанные, "Порядок");
			Запрос.Параметры.Вставить("Таблица", ИсходныеДанные);

			Запрос.Текст = СтрЗаменить(Запрос.Текст, """КоличествоЦенников""", "ИсходныеДанные.КоличествоЦенников");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """КоличествоЭтикеток""", "ИсходныеДанные.КоличествоЭтикеток");

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "КОЛИЧЕСТВО(ИсходныеДанные.КоличествоЦенников)",
			"СУММА(ИсходныеДанные.КоличествоЦенниковДляПечати)");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "КОЛИЧЕСТВО(ИсходныеДанные.КоличествоЭтикеток)",
			"СУММА(ИсходныеДанные.КоличествоЭтикеток)");	

			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ШаблонЦенника""", "ИсходныеДанные.ШаблонЦенника");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ШаблонЭтикетки""", "ИсходныеДанные.ШаблонЭтикетки");

			Запрос.Текст = СтрЗаменить(Запрос.Текст, """Штрихкод""", "ИсходныеДанные.Штрихкод");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """Цена""", "ИсходныеДанные.Цена");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ЦенаДополнительно""", "ИсходныеДанные.ЦенаДополнительно");

			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ДатаПоследнегоИзмененияЦены""", "ИсходныеДанные.ДатаПоследнегоИзмененияЦены");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ДатаПоследнегоИзмененияЦеныДополнительно""", "ИсходныеДанные.ДатаПоследнегоИзмененияЦеныДополнительно");
			#Вставка       
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсходныеДанные.Цена КАК Цена", 
				"ИсходныеДанные.Цена КАК Цена, ИсходныеДанные.игр_КодМаркировки КАК игр_КодМаркировки");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИсходныеДанныеПоследнийЗапрос.Цена КАК Цена", 
				"ИсходныеДанныеПоследнийЗапрос.Цена КАК Цена, ИсходныеДанныеПоследнийЗапрос.игр_КодМаркировки КАК игр_КодМаркировки");

			#КонецВставки

		КонецЕсли;

	ИначеЕсли Режим = "СкладскиеЯчейки" Тогда

		Если ИсходныеДанные <> Неопределено Тогда

			ТекстВременнойТаблицы =
			"	(ВЫБРАТЬ
			|		ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка) КАК Ячейка,
			|		"""" КАК Штрихкод,
			|		0 КАК Порядок)";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, ТекстВременнойТаблицы, "&Таблица");

			ОбщегоНазначенияУТ.ПронумероватьТаблицуЗначений(ИсходныеДанные, "Порядок");
			Запрос.Параметры.Вставить("Таблица", ИсходныеДанные);

		КонецЕсли;

	ИначеЕсли Режим = "СерииНоменклатуры" Тогда

		Если ИсходныеДанные <> Неопределено Тогда

			ТекстВременнойТаблицы =
			"	(ВЫБРАТЬ
			|		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
			|		"""" КАК Штрихкод,
			|		0 КАК Порядок)";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, ТекстВременнойТаблицы, "&Таблица");

			ОбщегоНазначенияУТ.ПронумероватьТаблицуЗначений(ИсходныеДанные, "Порядок");
			Запрос.Параметры.Вставить("Таблица", ИсходныеДанные);

		КонецЕсли;

	ИначеЕсли Режим = "Доставка" Тогда

		Если ИсходныеДанные <> Неопределено Тогда

			ТекстВременнойТаблицы =
			"	(ВЫБРАТЬ
			|		ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка) КАК Ссылка,
			|		0 КАК Порядок,
			|		0 КАК КоличествоПозиций,
			|		0 КАК Мест,
			|		0 КАК ОбъемНакладной,
			|		0 КАК ВесНакладной)";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, ТекстВременнойТаблицы, "&Таблица");

			ТекстВременнойТаблицы =
			"	(ВЫБРАТЬ
			|		ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка) КАК Ссылка,
			|		0 КАК Порядок,
			|		0 КАК КоличествоПозиций,
			|		0 КАК Мест,
			|		0 КАК ОбъемНакладной,
			|		0 КАК ВесНакладной)";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, ТекстВременнойТаблицы, "&Таблица");

			ТекстВременнойТаблицы =
			"	(ВЫБРАТЬ
			|		ЗНАЧЕНИЕ(Документ.ЗаявкаНаВозвратТоваровОтКлиента.ПустаяСсылка) КАК Ссылка,
			|		0 КАК Порядок,
			|		0 КАК КоличествоПозиций,
			|		0 КАК Мест,
			|		0 КАК ОбъемНакладной,
			|		0 КАК ВесНакладной)";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, ТекстВременнойТаблицы, "&Таблица");

			ТекстВременнойТаблицы =
			"	(ВЫБРАТЬ
			|		ЗНАЧЕНИЕ(Документ.ВозвратТоваровПоставщику.ПустаяСсылка) КАК Ссылка,
			|		0 КАК Порядок,
			|		0 КАК КоличествоПозиций,
			|		0 КАК Мест,
			|		0 КАК ОбъемНакладной,
			|		0 КАК ВесНакладной)";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, ТекстВременнойТаблицы, "&Таблица");

			ТекстВременнойТаблицы =
			"	(ВЫБРАТЬ
			|		ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка) КАК Ссылка,
			|		0 КАК Порядок,
			|		0 КАК КоличествоПозиций,
			|		0 КАК Мест,
			|		0 КАК ОбъемНакладной,
			|		0 КАК ВесНакладной)";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, ТекстВременнойТаблицы, "&Таблица");

			ТекстВременнойТаблицы =
			"	(ВЫБРАТЬ
			|		ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение.ПустаяСсылка) КАК Ссылка,
			|		0 КАК Порядок,
			|		0 КАК КоличествоПозиций,
			|		0 КАК Мест,
			|		0 КАК ОбъемНакладной,
			|		0 КАК ВесНакладной)";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, ТекстВременнойТаблицы, "&Таблица");


			//++ НЕ УТ
			ТекстВременнойТаблицы =
			"	(ВЫБРАТЬ
			|		ЗНАЧЕНИЕ(Документ.ПередачаСырьяПереработчику.ПустаяСсылка) КАК Ссылка,
			|		0 КАК Порядок,
			|		0 КАК КоличествоПозиций,
			|		0 КАК Мест,
			|		0 КАК ОбъемНакладной,
			|		0 КАК ВесНакладной)";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, ТекстВременнойТаблицы, "&Таблица");

			ТекстВременнойТаблицы =
			"	(ВЫБРАТЬ
			|		ЗНАЧЕНИЕ(Документ.ЗаказПереработчику.ПустаяСсылка) КАК Ссылка,
			|		0 КАК Порядок,
			|		0 КАК КоличествоПозиций,
			|		0 КАК Мест,
			|		0 КАК ОбъемНакладной,
			|		0 КАК ВесНакладной)";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, ТекстВременнойТаблицы, "&Таблица");
			//-- НЕ УТ

			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ШаблонЭтикетки""", "ИсходныеДанные.ШаблонЭтикетки");

			ОбщегоНазначенияУТ.ПронумероватьТаблицуЗначений(ИсходныеДанные, "Порядок");
			Запрос.Параметры.Вставить("Таблица", ИсходныеДанные);

		КонецЕсли;

	ИначеЕсли Режим = "УпаковочныеЛисты" Тогда

		Если ИсходныеДанные <> Неопределено Тогда

			ТекстВременнойТаблицы =
			"	(ВЫБРАТЬ
			|		ЗНАЧЕНИЕ(Документ.УпаковочныйЛист.ПустаяСсылка) КАК Ссылка,
			|		"""" КАК Штрихкод,
			|		0 КАК Порядок)";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, ТекстВременнойТаблицы, "&Таблица");

			ОбщегоНазначенияУТ.ПронумероватьТаблицуЗначений(ИсходныеДанные, "Порядок");
			Запрос.Параметры.Вставить("Таблица", ИсходныеДанные);

		КонецЕсли;

	ИначеЕсли Режим = "АкцизныеМарки" Тогда

		Если ИсходныеДанные <> Неопределено Тогда

			ТекстВременнойТаблицы =
			"	(ВЫБРАТЬ
			|		ЗНАЧЕНИЕ(Документ.ЗапросАкцизныхМарокЕГАИС.ПустаяСсылка) КАК Ссылка,
			|		"""" КАК КодАкцизнойМарки,
			|		"""" КАК СерияМарки,
			|		"""" КАК НомерМарки,
			|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
			|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
			|		0 КАК Порядок)";

			Запрос.Текст = СтрЗаменить(Запрос.Текст, ТекстВременнойТаблицы, "&Таблица");

			ОбщегоНазначенияУТ.ПронумероватьТаблицуЗначений(ИсходныеДанные, "Порядок");
			Запрос.Параметры.Вставить("Таблица", ИсходныеДанные);

		КонецЕсли;

	ИначеЕсли Режим = "ШтрихкодыУпаковок" Тогда

		Если ИсходныеДанные <> Неопределено Тогда

			ЗаполнитьДополнительныеПараметрыШтрихкодовУпаковок(ИсходныеДанные);

			НомерНачальнойПозиции = СтрНайти(Запрос.Текст, "(ВЫБРАТЬ");
			СодержимоеКонечнойПозиции = ") КАК ИсходныеДанные";
			НомерКонечнойПозиции  = СтрНайти(Запрос.Текст, СодержимоеКонечнойПозиции);
			ТекстЗаменяемогоПодзапроса = Сред(Запрос.Текст, НомерНачальнойПозиции, НомерКонечнойПозиции
			+ СтрДлина(СодержимоеКонечнойПозиции) - НомерНачальнойПозиции);

			Запрос.Текст = СтрЗаменить(Запрос.Текст, ТекстЗаменяемогоПодзапроса, "&Таблица КАК ИсходныеДанные");
			ОбщегоНазначенияУТ.ПронумероватьТаблицуЗначений(ИсходныеДанные, "Порядок");
			Запрос.Параметры.Вставить("Таблица", ИсходныеДанные);

		КонецЕсли;

	КонецЕсли;

	СтруктураРезультата.Таблица = Запрос.Выполнить().Выгрузить();

	Возврат СтруктураРезультата;

КонецФункции
