
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗагрузкаИзВнешнегоФайла(Команда)
	
	Диалог	= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр	= "*.xlsx|*.xlsx";
	
	Диалог.Показать(Новый ОписаниеОповещения("ВыборФайла_Завершение", ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции     

&НаКлиенте
Процедура ВыборФайла_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайла	= Результат[0];
	ЗагрузитьДанныеИзВнешнегоФайла(ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзВнешнегоФайла(ИмяФайла)

	НачатьПомещениеФайлаНаСервер(Новый ОписаниеОповещения("ПередачаФайлаНаСервер_Завершение", ЭтотОбъект),
		,,, ИмяФайла, УникальныйИдентификатор);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПередачаФайлаНаСервер_Завершение(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт
	
	Если ОписаниеПомещенногоФайла = Неопределено
		ИЛИ ОписаниеПомещенногоФайла.ПомещениеФайлаОтменено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Ошибка при передаче файла на сервер';"));
		Возврат;
	КонецЕсли;
	
	 ЗагрузитьДанныеНаСервере(ОписаниеПомещенногоФайла.Адрес);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеНаСервере(Адрес)

	ИмяФайла	= ПолучитьИмяВременногоФайла("xlsx");
	
	Данные	= ПолучитьИзВременногоХранилища(Адрес);
	Данные.Записать(ИмяФайла);
	
	ТабДокумент	= Новый ТабличныйДокумент;
	ТабДокумент.Прочитать(ИмяФайла); 
	
	Объект.Товары.Очистить();
	ТаблицаТоваров	= Объект.Товары.Выгрузить();
	
	ТипЧисло	= ОбщегоНазначения.ОписаниеТипаЧисло(15, 2);
	
	НПП = 0;
	Пока НПП < ТабДокумент.ВысотаТаблицы Цикл
		
		НПП = НПП + 1;
		
		Код	= СокрЛП(ТабДокумент.Область(НПП,1, НПП, 1).Текст);
		Цена1	= СокрЛП(ТабДокумент.Область(НПП,2, НПП, 2).Текст);
		Цена2	= СокрЛП(ТабДокумент.Область(НПП,3, НПП, 3).Текст);
		Цена3	= СокрЛП(ТабДокумент.Область(НПП,4, НПП, 4).Текст);
		
		Если Не ЗначениеЗаполнено(Код) Тогда
			Прервать;
		КонецЕсли;
		
		Номенклатура	= Справочники.Номенклатура.НайтиПоКоду(Код);
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(
				НСтр("ru='Не найдена номенклатура с кодом %1';"), Код));
				
			Продолжить;
		КонецЕсли;     
		
		НоваяСтрока	= ТаблицаТоваров.Добавить();
		НоваяСтрока.Номенклатура	= Номенклатура;
		НоваяСтрока.ПредыдущаяЦена	= ТипЧисло.ПривестиЗначение(Цена1);
		НоваяСтрока.Цена			= ТипЧисло.ПривестиЗначение(Цена2);
		НоваяСтрока.ЦенаПослеАкции	= ТипЧисло.ПривестиЗначение(Цена3);
		
	КонецЦикла;
	
	ТаблицаТоваров.Свернуть("Номенклатура, ПредыдущаяЦена, Цена, ЦенаПослеАкции");
	
	Объект.Товары.Загрузить(ТаблицаТоваров);
	
	УдалитьФайлы(ИмяФайла);
	
КонецПроцедуры

#КонецОбласти