
&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура игр_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда

		ЗаполнитьПоРасходномуКассовомуОрдеру(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") Тогда

		ЗаполнитьПоСписаниюБезналичныхДенежныхСредств(
		ДанныеЗаполнения,
		ДанныеЗаполнения);
	#Вставка
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеДенежныхДокументов")
		И НЕ ДанныеЗаполнения.Проведен Тогда

		ПодотчетноеЛицо	= ДанныеЗаполнения.ПодотчетноеЛицо;
		Для Каждого Строка Из ДанныеЗаполнения.ДенежныеДокументы Цикл
			НоваяСтрока	= ПрочиеРасходы.Добавить();
			
			НоваяСтрока.НаименованиеВходящегоДокумента	= Строка.НаименованиеДенежногоДокумента;
			НоваяСтрока.Сумма	= Строка.Сумма;
		КонецЦикла;
		
	#КонецВставки
	КонецЕсли;

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда

		Если Не ДанныеЗаполнения.Свойство("Валюта") Тогда
			Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("СуммаИзрасходовано") Тогда
			Расход = ПрочиеРасходы.Добавить();
			Расход.Сумма = ДанныеЗаполнения.СуммаИзрасходовано;
			Если ДанныеЗаполнения.Свойство("ЦельВыдачи") Тогда
				Расход.СтатьяДвиженияДенежныхСредств = ДанныеЗаполнения.ЦельВыдачи;
			КонецЕсли;
		КонецЕсли;

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда

		Шапка = ДанныеЗаполнения[0];
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Шапка);

		Для каждого Аванс Из ДанныеЗаполнения Цикл
			Расход = ПрочиеРасходы.Добавить();
			Расход.Сумма = Аванс.СуммаОстаток;
			Если Аванс.Свойство("ЦельВыдачи") Тогда
				Расход.СтатьяДвиженияДенежныхСредств = Аванс.ЦельВыдачи;
			КонецЕсли;
		КонецЦикла;
		СуммаИзрасходовано = ПрочиеРасходы.Итог("Сумма");
	КонецЕсли;

	ИнициализироватьДокумент(ДанныеЗаполнения);

	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьСвойстваОбъекта(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры
