&НаСервере
Процедура Команда1НаСервере()
	о=РеквизитФормыВЗначение("Объект");
	мак=о.получитьМакет("КатеорииИграйка");
	
	для к=1 по мак.высотаТаблицы цикл  
		наим=мак.область(к,1).текст;
		наимК=мак.область(к,2).текст;
		спр=Справочники.КатегорииТовараКаспи.НайтиПоНаименованию(наим);
		если не ЗначениеЗаполнено(спр) тогда
			спр=Справочники.КатегорииТовараКаспи.СоздатьЭлемент();
			спр.Наименование=наим;
			спр.НаименованиеКаспи=наимК;
			спр.ВидНоменклатуры=ПолучитьВидНом(наим);
			//сообщить(спр);
			спр.Записать(); 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры  

Функция получитьвидном(наим)
	//о=РеквизитФормыВЗначение("Объект");
	//мак=о.получитьМакет("МаппингВидНоменклатуры");
	//
	//для к=1 по мак.высотаТаблицы цикл  
	//	наим=мак.область(к,2).текст;
	//	вид=мак.область(к,1).текст;
	//	спр=Справочники.КатегорииТовараКаспи.НайтиПоНаименованию(наим);
	//	если не ЗначениеЗаполнено(спр) тогда
	//		спр=Справочники.КатегорииТовараКаспи.СоздатьЭлемент();
	//		спр.Наименование=наим;
	//		спр.НаименованиеКаспи=наимК;
	//		спр.ВидНоменклатуры=ПолучитьВидНом(наим);
	//		//сообщить(спр);
	//		спр.Записать(); 
	//	КонецЕсли;
	//КонецЦикла;
КонецФункции

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаолнитьРегистрСвойствКаспиНаСервере()     
	о=РеквизитФормыВЗначение("Объект");

	
	мкат=ПолучитьКатегории();   
	
	тз0=РеквизитФормыВЗначение("тз");
	
	для к=0 по мкат.количество()-1 цикл
		с=тз0.Добавить();
		с.код=мкат[к].code;
		с.назв=мкат[к].title;
	КонецЦикла;    
	
	
	тз20=РеквизитФормыВЗначение("тз2");;
	
	мак=о.ПолучитьМакет("КатеорииИграйка");
	
	для к0=1 по мак.ВысотаТаблицы цикл   
		
		катт=мак.Область(к0,1).Текст; 
		
		сс=тз0.Найти(катт,"назв");  
		
		если сс=Неопределено тогда сообщить("----ОШ-----"+катт); Продолжить; КонецЕсли;
		
		мхар=ПолучитьХарактеристикиКатегории(сс.код);    
		
		с=тз20.Добавить();
		с.колонка1=катт;
		
		
		для к=0 по мхар.количество()-1 цикл  
			м=СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(мхар[к].code,"*");
			с=тз20.Добавить();
			с.колонка1=катт;
			с.колонка2=м[2];  
			с.колонка22=мхар[к].code;  
			с.колонка3=мхар[к].mandatory;  
			с.колонка4=мхар[к].type;
			
			если мхар[к].type="enum" тогда
				менум=ПолучитьЗначенияЕнум(сс.код,мхар[к].code);
				для кк=0 по менум.количество()-1 цикл
					с=тз20.Добавить();
					с.колонка1=катт;
					с.колонка2=м[2];  
					с.колонка22=мхар[к].code;  
					с.колонка3=менум[кк].name;   
					с.колонка4=мхар[к].type;
				КонецЦикла;                   
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;      
	
	обяз=ложь;
	для каждого ст из тз20 цикл   
		если ст.колонка3="" тогда Продолжить; КонецЕсли;
		рег=РегистрыСведений.ДопСвойстваТоваровКаспи.СоздатьМенеджерЗаписи(); 
		кат=Справочники.КатегорииТовараКаспи.НайтиПоНаименованию(ст.колонка1);
		если ЗначениеЗаполнено(кат) тогда
			рег.Категория=кат;
		иначе     
			сообщить("Не найден ---"+ст.колонка1);
		КонецЕсли;
		рег.Свойство=ст.колонка2;
		рег.СвойствоКаспи=ст.колонка22;  
		рег.Тип=ст.колонка4;
		если ст.колонка3="Да" или ст.колонка3="Нет" тогда
			рег.Обязательный=?(ст.колонка3="Да",истина,ложь);   
			обяз=рег.Обязательный;
		иначе
			рег.Обязательный=обяз;
			рег.значение=ст.колонка3;
		КонецЕсли;
		рег.Записать();
	КонецЦикла;
	
	
	
	
	ЗначениеВРеквизитФормы(тз0,"тз");
	ЗначениеВРеквизитФормы(тз20,"тз2");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаолнитьРегистрСвойствКаспи(Команда)  
	ОчиститьРегистрНаСервере();
	ЗаолнитьРегистрСвойствКаспиНаСервере();
КонецПроцедуры

Функция ПолучитьКатегории()
	WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
	
	WinHttp.Open("GET","https://kaspi.kz/shop/api/products/classification/categories/",0); 
	
	
	WinHttp.setRequestHeader("Content-Type", "application/json");
	WinHttp.setRequestHeader("X-Auth-Token", "Ku7Z94wIKPRZ5BYlyBrNuG2FGTMkr16SFUAxf12lERY=");  
	
	WinHttp.Send();
	ТекстОтвета = WinHttp.ResponseText();
	
	если не WinHttp.Status=200 тогда
		Сообщить("Соединение с сервером не установлено ("+WinHttp.StatusText+")");
		возврат новый массив
	КонецЕсли;
	
	Чтение = Новый ЧтениеJSON;
	чтение.УстановитьСтроку(ТекстОтвета);
	Структура = ПрочитатьJSON(Чтение);
	Чтение.Закрыть(); 

	возврат Структура;
КонецФункции
Функция ПолучитьХарактеристикиКатегории(кат)
	WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
	
	WinHttp.Open("GET","https://kaspi.kz/shop/api/products/classification/attributes?c="+кат,0); 
	WinHttp.setRequestHeader("Content-Type", "application/json");
	WinHttp.setRequestHeader("X-Auth-Token", "Ku7Z94wIKPRZ5BYlyBrNuG2FGTMkr16SFUAxf12lERY=");  
	WinHttp.Send();
	ТекстОтвета = WinHttp.ResponseText();
	
	если не WinHttp.Status=200 тогда
		Сообщить("Соединение с сервером не установлено ("+WinHttp.StatusText+")");
		
		возврат новый массив
	КонецЕсли;
	
	Чтение = Новый ЧтениеJSON;
	чтение.УстановитьСтроку(ТекстОтвета);
	Структура = ПрочитатьJSON(Чтение);
	Чтение.Закрыть(); 

	возврат Структура;
КонецФункции
Функция ПолучитьЗначенияЕнум(кат,хар)
	WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
	
	WinHttp.Open("GET","https://kaspi.kz/shop/api/products/classification/attribute/values?c="+кат+"&a="+хар,0); 
	
	
	//WinHttp.setRequestHeader("Host", "kaspi.kz");
	WinHttp.setRequestHeader("Content-Type", "application/json");
	WinHttp.setRequestHeader("X-Auth-Token", "Ku7Z94wIKPRZ5BYlyBrNuG2FGTMkr16SFUAxf12lERY=");  
	WinHttp.Send();
	ТекстОтвета = WinHttp.ResponseText();
	
	//сообщить(ТекстОтвета);
	если не WinHttp.Status=200 тогда
		Сообщить("Соединение с сервером не установлено ("+WinHttp.StatusText+")");
		
		возврат новый массив
	КонецЕсли;
	
	Чтение = Новый ЧтениеJSON;
	чтение.УстановитьСтроку(ТекстОтвета);
	Структура = ПрочитатьJSON(Чтение);
	Чтение.Закрыть(); 

	возврат Структура;
КонецФункции

&НаСервере
Процедура ОчиститьРегистрНаСервере()
	рег=РегистрыСведений.ДопСвойстваТоваровКаспи.СоздатьНаборЗаписей();
	рег.Записать()
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРегистр(Команда)
	ОчиститьРегистрНаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда2НаСервере()
	спр=Справочники.КатегорииТовараКаспи.Выбрать();
	
	пока спр.Следующий() цикл
		о=спр.ПолучитьОбъект();
		о.Удалить();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	Команда2НаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьМаппингВидНом(Команда)
	СоздатьМаппингВидНомНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьМаппингВидНомНаСервере()
	о=РеквизитФормыВЗначение("Объект");
	
	мак=о.получитьМакет("МаппингВидНоменклатуры"); 
	
	для к=1 по мак.высотаТаблицы цикл
		вид1с=мак.область(к,1).текст;
		видКс=мак.область(к,2).текст;
		спр=Справочники.ВидыНоменклатуры.НайтиПоНаименованию(вид1с);
		если ЗначениеЗаполнено(спр) тогда   
			если не ЗначениеЗаполнено(спр.игр_КатегорияКаспи) тогда
				о=спр.ПолучитьОбъект();
				о.игр_КатегорияКаспи=Справочники.КатегорииТовараКаспи.НайтиПоНаименованию(видКс);
				о.Записать();
				сообщить(о);                 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура загрузкаСкладыРазмерыЦветыНаСервере()
	
	о=РеквизитФормыВЗначение("Объект");
	макСкл=о.получитьМакет("склады");
	макРазм=о.получитьМакет("размеры");
	макЦвет=о.получитьМакет("цвет");
	
	настр=Справочники.TRP_S_НастройкиМаркетплейса.НастройкиКаспи;

	о=настр.ПолучитьОбъект();
	
	о.Наименование="Настройки Каспи";
	о.ВидЦены=Справочники.ВидыЦен.НайтиПоНаименованию("Розничная РК");
	о.ВидЦеныСоСкидкой=Справочники.ВидыЦен.НайтиПоНаименованию("Розничная со скидкой РК");
	
	о.АдресСервера="45.86.81.198";  
	о.Порт=21;
	о.ИмяПользователя="1cftp1";
	о.Пароль="bZAFYQzLvOS1";    
	о.АдресРесурса="kaspi.kz";
	
	
	о.СкладыКаспи.Очистить();
	для к=1 по макСкл.ВысотаТаблицы цикл
		скл=Справочники.Склады.НайтиПоНаименованию(макСкл.Область(к,2).Текст);
		с=о.СкладыКаспи.Добавить();
		с.Склад=скл;
		с.КодКаспи=макСкл.Область(к,1).Текст;
	КонецЦикла;
	
	о.МаппингЦветов.Очистить();
	для к=1 по макЦвет.ВысотаТаблицы цикл
		с=о.МаппингЦветов.Добавить();
		с.Цвет1с=макЦвет.Область(к,2).Текст;
		с.ЦветКаспи=макЦвет.Область(к,3).Текст;
	КонецЦикла;
	
	о.МаппингРазмеров.Очистить();
	для к=1 по макРазм.ВысотаТаблицы цикл
		с=о.МаппингРазмеров.Добавить();
		с.Размер1с=макРазм.Область(к,2).Текст;
		с.РазмерКаспи=макРазм.Область(к,3).Текст;
	КонецЦикла;   
	
	с=о.НеВыгружатьКатегории.Добавить();
	с.ВидНоменклатуры=Справочники.ВидыНоменклатуры.НайтиПоНаименованию("нижнее белье");   
	
	о.ХарактеристикаРазмер=ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Размер");
	о.ХарактеристикаЦвет=ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Цвет");

	
	о.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура загрузкаСкладыРазмерыЦветы(Команда)
	загрузкаСкладыРазмерыЦветыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьJSONДляОтправкиНаСервере()   
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	НоменклатураХарактеристикиТовараКаспи.Ссылка КАК Ссылка,
	|	КОЛИЧЕСТВО(ЕСТЬNULL(НоменклатураХарактеристикиТовараКаспи.Значение, 0)) КАК ЕстьДанные,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(НоменклатураХарактеристикиТовараКаспи.Значение, 0) <> """"
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК заполн
	|ПОМЕСТИТЬ втДанные
	|ИЗ
	|	Справочник.Номенклатура.ХарактеристикиТовараКаспи КАК НоменклатураХарактеристикиТовараКаспи
	|ГДЕ
	|	НоменклатураХарактеристикиТовараКаспи.Обязательный
	|	И НЕ НоменклатураХарактеристикиТовараКаспи.Ссылка.ВыгруженНаКаспи
	|
	|СГРУППИРОВАТЬ ПО
	|	НоменклатураХарактеристикиТовараКаспи.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанные.Ссылка КАК Номенклатура
	|ПОМЕСТИТЬ втЗаполненаяНоменклатура
	|ИЗ
	|	втДанные КАК втДанные
	|ГДЕ
	|	втДанные.ЕстьДанные - втДанные.заполн = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры.КатегорияКаспи КАК КатегорияКаспи,
	|	ТоварыНаСкладахОстатки.Номенклатура.Артикул КАК артикул,
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика1,
	|	ПОДСТРОКА(ТоварыНаСкладахОстатки.Номенклатура.Описание, 1, 200) КАК описание,
	|	ПОДСТРОКА(ТоварыНаСкладахОстатки.Номенклатура.ZM_Описание, 1, 1024) КАК описаниеZM,
	|	цвет.Значение.Наименование КАК цвет,
	|	размер.Значение.Наименование КАК размер,
	|	ПОДСТРОКА(линкиФото.Линк, 1, 1024) КАК фото,
	|	ЦветаКаспи.ЦветКаспи КАК ЦветКаспи,
	|	РазмерыКаспи.РазмерКаспи КАК РазмерКаспи
	|ИЗ
	|	втЗаполненаяНоменклатура КАК втЗаполненаяНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК цвет
	|			ПО ТоварыНаСкладахОстатки.Характеристика = цвет.Ссылка
	|				И (цвет.Свойство = &Свойство)
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК размер
	|			ПО ТоварыНаСкладахОстатки.Характеристика = размер.Ссылка
	|				И (размер.Свойство = &Свойство2)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.TRP_ЛинкиКартинокИнтернетМагазина КАК линкиФото
	|			ПО ТоварыНаСкладахОстатки.Номенклатура = линкиФото.Номенклатура
	|				И ТоварыНаСкладахОстатки.Характеристика = линкиФото.Характеристика
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.TRP_S_НастройкиМаркетплейса.МаппингЦветов КАК ЦветаКаспи
	|			ПО (цвет.Значение.Наименование = ЦветаКаспи.Цвет1с)
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.TRP_S_НастройкиМаркетплейса.МаппингРазмеров КАК РазмерыКаспи
	|			ПО (размер.Значение.Наименование = РазмерыКаспи.Размер1с)
	|		ПО (ТоварыНаСкладахОстатки.Номенклатура = втЗаполненаяНоменклатура.Номенклатура)
	|ГДЕ
	|	ТоварыНаСкладахОстатки.Склад В (&Склад)
	|	И НЕ ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры В (&ВидНоменклатуры)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Номенклатура,
	|	размер.Значение.Наименование,
	|	цвет.Значение.Наименование,
	|	ТоварыНаСкладахОстатки.Характеристика,
	|	ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры.КатегорияКаспи,
	|	ТоварыНаСкладахОстатки.Номенклатура.Артикул,
	|	ПОДСТРОКА(ТоварыНаСкладахОстатки.Номенклатура.Описание, 1, 200),
	|	ПОДСТРОКА(ТоварыНаСкладахОстатки.Номенклатура.ZM_Описание, 1, 1024),
	|	ПОДСТРОКА(линкиФото.Линк, 1, 1024),
	|	ЦветаКаспи.ЦветКаспи,
	|	РазмерыКаспи.РазмерКаспи
	|ИТОГИ ПО
	|	Номенклатура,
	|	Характеристика1";    
	
	настр=Справочники.TRP_S_НастройкиМаркетплейса.НастройкиКаспи;
	
	списВидНом=настр.НеВыгружатьКатегории.ВыгрузитьКолонку("ВидНоменклатуры");
	списСклад=настр.СкладыКаспи.ВыгрузитьКолонку("Склад");

	Запрос.УстановитьПараметр("ВидНоменклатуры", списВидНом);
	Запрос.УстановитьПараметр("Свойство", настр.ХарактеристикаЦвет);
	Запрос.УстановитьПараметр("Свойство2", настр.ХарактеристикаРазмер);
	Запрос.УстановитьПараметр("Склад", списСклад);
	
	данныеПоТоварам = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	   	
	м=новый массив;
	
	для каждого ст из данныеПоТоварам.Строки цикл
		для каждого ст1 из ст.Строки цикл
			структ=создатьДжсонТоваров(ст1); 
			
			м.Добавить(структ);
			
		КонецЦикла;    
	КонецЦикла;    
	
	если м.Количество()<>0 тогда
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON,м);
		СтрокаJS = ЗаписьJSON.Закрыть();
		
		
		кодОтправки=отправитьДжсон(СтрокаJS);  
		//
		//рег=РегистрыСведений.ЛогОтравкиКарточекТовараКаспи.СоздатьМенеджерЗаписи();
		//рег.Активность=Истина;
		//рег.КодОтправки=кодОтправки;
		//рег.Период=ТекущаяДата();
		//рег.СтрокаЖС=СтрокаJS;
		//рег.Записать();  
	иначе
		//рег=РегистрыСведений.ЛогОтравкиКарточекТовараКаспи.СоздатьМенеджерЗаписи();
		//рег.Активность=Истина;
		//рег.КодОтправки="";
		//рег.Период=ТекущаяДата();
		//рег.СтрокаЖС="Все валидные карты товаров выгружены";
		//рег.Записать();  
	КонецЕсли;
	
КонецПроцедуры             

Функция  отправитьДжсон(жс)
	WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
	
	WinHttp.Open("POST","https://kaspi.kz/shop/api/products/import",0); 
	
	
	WinHttp.setRequestHeader("Accept", "application/json");
	WinHttp.setRequestHeader("Content-Type", "text/plain");
	WinHttp.setRequestHeader("X-Auth-Token", "Ku7Z94wIKPRZ5BYlyBrNuG2FGTMkr16SFUAxf12lERY=");  
	WinHttp.Send(жс);
	ТекстОтвета = WinHttp.ResponseText();
	
	если не WinHttp.Status=200 тогда
		Сообщить("Соединение с сервером не установлено ("+WinHttp.StatusText+")");
		
		возврат новый массив
	КонецЕсли;
	
	Чтение = Новый ЧтениеJSON;   
	ТекстОтвета=СтрЗаменить(ТекстОтвета,"$","");
	чтение.УстановитьСтроку(ТекстОтвета);
	Структура = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();  	
	
	возврат Структура.code;   
КонецФункции

Функция создатьДжсонТоваров(ст)

	
	структ=новый Структура;  
	
	артКасп=""+ст.артикул+"_"+ст.Характеристика1.УникальныйИдентификатор() ; 
	цветК=ст.Строки[0].цветКаспи;
	размерК=ст.Строки[0].РазмерКаспи;
	НаимКаспи=""+ст.номенклатура+"   цвет:"+цветК+" размер:"+размерК;
	структ.Вставить("sku",артКасп);
	структ.Вставить("title",НаимКаспи);
	структ.Вставить("brand","TERRA PRO");
	структ.Вставить("category",ст.категорияКаспи.НаименованиеКаспи);  
	если СокрЛП(ст.описание)="" и СокрЛП(ст.описаниеZM)="" тогда
		структ.Вставить("description",НаимКаспи);    
	иначе           
		если СокрЛП(ст.описаниеZM)="" тогда
			структ.Вставить("description",ст.описание);             
		иначе
			структ.Вставить("description",ст.описаниеZM);             
		КонецЕсли;
	КонецЕсли;
	
	матр=новый массив; 

	для каждого стт из ст.номенклатура.ХарактеристикиТовараКаспи цикл 
		если не ЗначениеЗаполнено(стт.значение) тогда Продолжить; КонецЕсли; 
		мартструкт=новый Структура();
		мартструкт.Вставить("code",стт.характеристикаКаспи);
		если стт.характеристика="color" или стт.характеристика="colour" тогда
			мартструкт.Вставить("value",цветК);
		иначеесли стт.характеристика="manufacturer code" тогда
			мартструкт.Вставить("value",ст.артикул);
		иначеесли стт.характеристика="size" тогда
			мартструкт.Вставить("value",размерК);
		иначе  
			если стт.Тип="number" тогда
				мартструкт.Вставить("value",число(стт.значение));
			иначеесли стт.Тип="boolean" тогда
				мартструкт.Вставить("value",Булево(стт.значение));
			иначе
				мартструкт.Вставить("value",стт.значение);
			КонецЕсли;
		КонецЕсли;
		матр.Добавить(мартструкт);   
	КонецЦикла;

	
	структ.Вставить("attributes",матр);

	мимж=новый массив;   
	
	к=1;
	для каждого стт из ст.строки цикл
		мимж.Добавить(новый Структура("url",стт.фото));   
		если к=7 тогда Прервать; КонецЕсли;
	КонецЦикла;
	
	структ.Вставить("images",мимж);  
	
	 
	возврат структ;
КонецФункции

&НаКлиенте
Процедура СоздатьJSONДляОтправки(Команда)
	СоздатьJSONДляОтправкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабЧастьХарактеристикНаСервере()
	
	т1=ТекущаяДата();
	спр=Справочники.Номенклатура.Выбрать();
	пока спр.Следующий() цикл
		если спр.ЭтоГруппа или спр.ПометкаУдаления тогда Продолжить; КонецЕсли;
		
		кат=спр.ВидНоменклатуры.игр_КатегорияКаспи;		
		если спр.ХарактеристикиТовараКаспи.Количество()=0 тогда
			о=спр.получитьОбъект();  
			получитьХарКасп(кат,о);  
			о.КатегорияТовара=кат;
			о.записать();   
		иначе
			о=спр.получитьОбъект();  
			обновитьХарКасп(кат,о);	
		КонецЕсли; 
		
	КонецЦикла; 
	т2=ТекущаяДата();
	
	сообщить("Прошло минут -"+((т2-т1)/60));
КонецПроцедуры

&НаСервере
Функция получитьХарКасп(кат,о)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДопСвойстваТоваровКаспи.Свойство КАК Характеристика,
		|	ДопСвойстваТоваровКаспи.Обязательный КАК Обязательный,
		|	ДопСвойстваТоваровКаспи.Тип КАК Тип,
		|	ДопСвойстваТоваровКаспи.СвойствоКаспи КАК ХарактеристикаКаспи
		|ИЗ
		|	РегистрСведений.ДопСвойстваТоваровКаспи КАК ДопСвойстваТоваровКаспи
		|ГДЕ
		|	ДопСвойстваТоваровКаспи.Категория = &Категория
		|
		|СГРУППИРОВАТЬ ПО
		|	ДопСвойстваТоваровКаспи.Свойство,
		|	ДопСвойстваТоваровКаспи.Обязательный,
		|	ДопСвойстваТоваровКаспи.Тип,
		|	ДопСвойстваТоваровКаспи.СвойствоКаспи";
	
	Запрос.УстановитьПараметр("Категория", кат);
	
	тзСвойства = Запрос.Выполнить().Выгрузить(); 
	
	о.ХарактеристикиТовараКаспи.загрузить(тзСвойства);
	
КонецФункции
&НаСервере
Функция обновитьХарКасп(кат,о)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДопСвойстваТоваровКаспи.Свойство КАК Характеристика,
		|	ДопСвойстваТоваровКаспи.Значение КАК Значение,
		|	ДопСвойстваТоваровКаспи.Обязательный КАК Обязательный,
		|	ДопСвойстваТоваровКаспи.Тип КАК Тип,
		|	ДопСвойстваТоваровКаспи.СвойствоКаспи КАК ХарактеристикаКаспи
		|ИЗ
		|	РегистрСведений.ДопСвойстваТоваровКаспи КАК ДопСвойстваТоваровКаспи
		|ГДЕ
		|	ДопСвойстваТоваровКаспи.Категория = &Категория";
	
	Запрос.УстановитьПараметр("Категория", кат);
	
	тз1 = Запрос.Выполнить().Выгрузить(); 
	
	тзСвойства=тз1.Скопировать();
	
	тзСвойства.Свернуть("Характеристика,Обязательный,тип,ХарактеристикаКаспи",""); 
	
	если тзСвойства.Количество()<>о.ХарактеристикиТовараКаспи.Количество() тогда
		для каждого ст из тзСвойства цикл
			с=о.ХарактеристикиТовараКаспи.Найти(ст.характеристика);
			если не ЗначениеЗаполнено(с) тогда
				сс=о.ХарактеристикиТовараКаспи.добавить();
				ЗаполнитьЗначенияСвойств(сс,ст);
			КонецЕсли;
		КонецЦикла;  
		о.КатегорияТовара=кат;
		о.записать();   
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТабЧастьХарактеристик(Команда)
	ЗаполнитьТабЧастьХарактеристикНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаСтатусаОтправки(Команда)   
	
	кк=получитьКодВыгрузки();
	объект.ккк=кк;
	
	ОчиститьСообщения();
	
		
	WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
	
	WinHttp.Open("GET","https://kaspi.kz/shop/api/products/import?i="+объект.ккк,0);   

	WinHttp.setRequestHeader("Content-Type", "application/json");
	WinHttp.setRequestHeader("X-Auth-Token", "Ku7Z94wIKPRZ5BYlyBrNuG2FGTMkr16SFUAxf12lERY=");  
	WinHttp.Send();
	ТекстОтвета = WinHttp.ResponseText();
	
	если не WinHttp.Status=200 тогда
		Сообщить("Соединение с сервером не установлено ("+WinHttp.StatusText+")");
		
		возврат 
	КонецЕсли;
	
	Чтение = Новый ЧтениеJSON;   
	ТекстОтвета=СтрЗаменить(ТекстОтвета,"$","");
	чтение.УстановитьСтроку(ТекстОтвета);
	Структура = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();   
	
	
	фл=ложь;
	попытка
		сообщить("code-"+Структура.code);
	Исключение КонецПопытки;    
	
	попытка
		сообщить("description-"+Структура.description);
	Исключение КонецПопытки;    
	
	попытка
		сообщить("message-"+Структура.message);
	Исключение КонецПопытки;
	попытка
		сообщить("status-"+Структура.status);  
		если Структура.status="FINISHED" тогда
			фл=истина;
		КонецЕсли;
	Исключение КонецПопытки;   
	
	
	
	//если не фл тогда возврат КонецЕсли;
	
	сообщить("---------------------------------------");
	
	
	
	
	
	WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
	
	WinHttp.Open("GET","https://kaspi.kz/shop/api/products/import/result?i="+объект.ккк,0);   
	

	WinHttp.setRequestHeader("Content-Type", "application/json");
	WinHttp.setRequestHeader("X-Auth-Token", "Ku7Z94wIKPRZ5BYlyBrNuG2FGTMkr16SFUAxf12lERY=");  
	WinHttp.Send();
	ТекстОтвета = WinHttp.ResponseText();
	
	//сообщить(ТекстОтвета);
	если не WinHttp.Status=200 тогда
		Сообщить("Соединение с сервером не установлено ("+WinHttp.StatusText+")");
		
		возврат 
	КонецЕсли;
	
	м=сформДерев(ТекстОтвета);  
	
	для каждого ст из м["result"] цикл   
		если ст.значение["state"]="FINISHED" тогда
			мм=СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ст.Ключ,"_");
			если мм.количество()<>0 тогда
				рез=ТоварОтгружен(мм[0]); 
				
				сообщить(""+ст.Ключ+"		"+ст.значение["state"]+"		"+рез);
			КонецЕсли; 
			
		иначеесли ст.Значение["state"]="ERRORS" тогда     
			
			мВ=ст.Значение["warnings"];
			сообщить("warnings");
			для к=0 по мВ.количество()-1 цикл
				сообщить("warnings "+мВ[к]);
			КонецЦикла;
			
			сообщить("");
			сообщить("");
			
			мВ=ст.Значение["errors"];
			сообщить("errors");
			для к=0 по мВ.количество()-1 цикл
				сообщить("errors "+мВ[к]);
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	

	//возврат Структура;
КонецПроцедуры     


&НаСервере
Процедура ПрочитатьJSONНаСервере()
	рег=РегистрыСведений.ЛогОтравкиКарточекТовараКаспи.СоздатьНаборЗаписей();
	рег.Отбор.кодОтправки.видсравнения=ВидСравнения.Равно;
	рег.Отбор.кодОтправки.значение=объект.ккк;
	рег.Отбор.кодОтправки.использование=истина;
	
	рег.Прочитать(); 
	
	стрДЖ=рег[0].СтрокаЖС;
	
	ч=новый ЧтениеJSON;
	ч.УстановитьСтроку(стрДЖ);
	
	//пока д.Прочитать() цикл
	//	СООБЩИТЬ(д);	
	//КонецЦикла;    
	
	м = Неопределено;
	СформироватьДерево(ч, м);  
	
	для к=1 по м.количество()-1 цикл   
		попытка        
			мм=СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(м[к]["sku"],"_");
			если мм.количество()<>0 тогда
				//спр=Справочники.Номенклатура.НайтиПоРеквизиту("артикул",мм[0]);
				//о=спр.ПолучитьОбъект();
				//о.ВыгруженНаКаспи=Истина;
				//о.Записать();
			КонецЕсли;
		//зн=""+м[к]["sku"]+"	"+м[к]["title"];
		//зн=""+м[к]["sku"];
		//сообщить(зн);
		исключение КонецПопытки;
	КонецЦикла;

	
	к=1;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьJSON1(Команда)
	ПрочитатьJSONНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)    
	кк=получитьКодВыгрузки();
	объект.ккк=кк;
КонецПроцедуры               

Функция ПолучитьКодВыгрузки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛогОтравкиКарточекТовараКаспиСрезПоследних.Период КАК Период,
		|	ЛогОтравкиКарточекТовараКаспиСрезПоследних.КодОтправки КАК КодОтправки
		|ИЗ
		|	РегистрСведений.ЛогОтравкиКарточекТовараКаспи.СрезПоследних КАК ЛогОтравкиКарточекТовараКаспиСрезПоследних
		|ГДЕ
		|	ЛогОтравкиКарточекТовараКаспиСрезПоследних.КодОтправки <> """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	рез = Запрос.Выполнить().Выгрузить();
	

	если рез.Количество()<>0 тогда
		возврат рез[0].КодОтправки;
	иначе
		возврат "";
	КонецЕсли;
КонецФункции
&НаСервере
Функция ТоварОтгружен(арт)
	спр=Справочники.Номенклатура.НайтиПоРеквизиту("артикул",арт); 
	фл=ложь;
	если ЗначениеЗаполнено(спр) тогда  
		если не спр.ВыгруженНаКаспи тогда
			о=спр.ПолучитьОбъект();
			о.ВыгруженНаКаспи=Истина;
			о.Записать();
		КонецЕсли;
		фл=истина;
	КонецЕсли;
	
	если фл тогда  
		возврат "ОК";
	иначе
		возврат "НЕ НАЙДЕН";
	КонецЕсли;
	
КонецФункции
&НаСервере
Функция  сформДерев(текст)   
	Чтение = Новый ЧтениеJSON;   
	///ТекстОтвета=СтрЗаменить(ТекстОтвета,"$","");
	чтение.УстановитьСтроку(текст);
	//Структура = ПрочитатьJSON(Чтение); 
	д=Неопределено;
	СформироватьДерево(Чтение,д);
	Чтение.Закрыть(); 
	
	
	возврат д;
КонецФункции
&НаСервере
Процедура СформироватьДерево(ЧтениеJSON, Дерево)
    
    ИмяСвойства = Неопределено;
    
    Пока ЧтениеJSON.Прочитать() Цикл
        TипJSON = ЧтениеJSON.ТипТекущегоЗначения;
        
        Если TипJSON = ТипЗначенияJSON.НачалоОбъекта 
        ИЛИ TипJSON = ТипЗначенияJSON.НачалоМассива Тогда
            НовыйОбъект = ?(TипJSON = ТипЗначенияJSON.НачалоОбъекта, Новый Соответствие, Новый Массив);
            
            Если ТипЗнч(Дерево) = Тип("Массив") Тогда
                Дерево.Добавить(НовыйОбъект);
            ИначеЕсли ТипЗнч(Дерево) = Тип("Соответствие") И ЗначениеЗаполнено(ИмяСвойства) Тогда
                Дерево.Вставить(ИмяСвойства, НовыйОбъект);
            КонецЕсли;
            
            СформироватьДерево(ЧтениеJSON, НовыйОбъект);
            
            Если Дерево = Неопределено Тогда
                Дерево = НовыйОбъект;
            КонецЕсли;
        ИначеЕсли TипJSON = ТипЗначенияJSON.ИмяСвойства Тогда
            ИмяСвойства = ЧтениеJSON.ТекущееЗначение;
        ИначеЕсли TипJSON = ТипЗначенияJSON.Число 
        ИЛИ TипJSON = ТипЗначенияJSON.Строка 
        ИЛИ TипJSON = ТипЗначенияJSON.Булево 
        ИЛИ TипJSON = ТипЗначенияJSON.Null Тогда
            Если ТипЗнч(Дерево) = Тип("Массив") Тогда
                Дерево.Добавить(ЧтениеJSON.ТекущееЗначение);
            ИначеЕсли ТипЗнч(Дерево) = Тип("Соответствие") Тогда
                Дерево.Вставить(ИмяСвойства, ЧтениеJSON.ТекущееЗначение);
            КонецЕсли;
        Иначе
            Возврат;
        КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры

&НаСервере
Процедура ОтправитьПрайсНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры.КатегорияКаспи КАК КатегорияКаспи,
	|	ТоварыНаСкладахОстатки.Номенклатура.Артикул КАК артикул,
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	|	ТоварыНаСкладахОстатки.Склад КАК Склад,
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ост,
	|	ценаСкидка.Цена КАК ЦенаСкидка,
	|	ценаРозн2.Цена КАК ЦенаРозн
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ) КАК ценаСкидка
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ценаСкидка.Номенклатура
	|			И ТоварыНаСкладахОстатки.Характеристика = ценаСкидка.Характеристика
	|			И (ценаСкидка.ВидЦены = &ВидЦены)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ) КАК ценаРозн2
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ценаРозн2.Номенклатура
	|			И ТоварыНаСкладахОстатки.Характеристика = ценаРозн2.Характеристика
	|			И (ценаРозн2.ВидЦены = &ВидЦены2)
	|ГДЕ
	|	ТоварыНаСкладахОстатки.Склад В ИЕРАРХИИ(&Склад)
	|	И НЕ ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры В (&ВидНоменклатуры)
	|ИТОГИ ПО
	|	артикул,
	|	Характеристика";
	
	
	настр=Справочники.TRP_S_НастройкиМаркетплейса.НастройкиКаспи;
	
	списВидНом=настр.НеВыгружатьКатегории.ВыгрузитьКолонку("ВидНоменклатуры");
	списСклад=настр.СкладыКаспи.ВыгрузитьКолонку("Склад");
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", списВидНом);
	Запрос.УстановитьПараметр("ВидЦены", настр.ВидЦеныСоСкидкой);
	Запрос.УстановитьПараметр("ВидЦены2", настр.ВидЦены);
	Запрос.УстановитьПараметр("Склад",списСклад);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	рез = РезультатЗапроса.выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	ЗаписьXML = Новый ЗаписьXML;  
	ф=ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML.ОткрытьФайл(ф);
	
	
	тзСклады=ПолучитьСписСкладов();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("kaspi_catalog");
	ЗаписьXML.ЗаписатьАтрибут("xmlns", "kaspiShopping");
	ЗаписьXML.ЗаписатьАтрибут("xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьАтрибут("date", "string");
	ЗаписьXML.ЗаписатьАтрибут("xsi:schemaLocation", "kaspiShopping http://kaspi.kz/kaspishopping.xsd");
	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("company");
	ЗаписьXML.ЗаписатьТекст("TerraPro");
	ЗаписьXML.ЗаписатьКонецЭлемента(); //company
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("merchantid");
	ЗаписьXML.ЗаписатьТекст("12286008");
	ЗаписьXML.ЗаписатьКонецЭлемента(); //company
	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("offers");
	
	для каждого ст из рез.Строки цикл
		если  сокрлп(ст.артикул)="" тогда Продолжить; КонецЕсли;
		для каждого ст1 из ст.строки Цикл
			к=1;   
			для каждого ст2 из ст1.строки Цикл
				если к=1 тогда
					ЗаписьXML.ЗаписатьНачалоЭлемента("offer");
					ЗаписьXML.ЗаписатьАтрибут("sku", ст2.артикул+"_"+ст2.Характеристика.уникальныйИдентификатор());
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("model");
					ЗаписьXML.ЗаписатьТекст(строка(""+ст2.номенклатура+" "+ст2.Характеристика));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //model
					ЗаписьXML.ЗаписатьНачалоЭлемента("brand");
					ЗаписьXML.ЗаписатьТекст(строка("TERRA PRO"));
					ЗаписьXML.ЗаписатьКонецЭлемента(); //brand
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("availabilities");
					к=2;
				КонецЕсли;
				
				кодСклад=ПолучитьКодСклада(ст2.склад);				
				стр=тзСклады.Найти(сокрлп(кодСклад));
				если стр<>Неопределено тогда
					стр.уже=1;
				КонецЕсли;
				
				если ст2.склад<>null тогда
					ЗаписьXML.ЗаписатьНачалоЭлемента("availability");
					ЗаписьXML.ЗаписатьАтрибут("available", ?(ст2.ост>0,"yes","no"));
					ЗаписьXML.ЗаписатьАтрибут("storeId", кодСклад);
					ЗаписьXML.ЗаписатьКонецЭлемента();//availability
				КонецЕсли;
				ц=?(ст2.ценаСкидка=null,ст2.ценаРозн,ст2.ценаСкидка);
				цена=формат(ц,"ЧГ=");
			КонецЦикла;   
			
			
			
			для каждого сстт из тзСклады цикл
				если сстт.уже<>1 тогда
					ЗаписьXML.ЗаписатьНачалоЭлемента("availability");
					ЗаписьXML.ЗаписатьАтрибут("available", "no");
					ЗаписьXML.ЗаписатьАтрибут("storeId", сстт.код);
					ЗаписьXML.ЗаписатьКонецЭлемента();//availability
				КонецЕсли;
			КонецЦикла;
			
			для каждого сстт из тзСклады цикл сстт.уже=0 КонецЦикла;
			
			ЗаписьXML.ЗаписатьКонецЭлемента(); //availabilities
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("price");
			ЗаписьXML.ЗаписатьТекст(цена);
			ЗаписьXML.ЗаписатьКонецЭлемента(); //price
			
			ЗаписьXML.ЗаписатьКонецЭлемента(); //offer
		КонецЦикла;
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); //offers

	
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); //kaspi_catalog    
	
	ЗаписьXML.Закрыть();
	
	ОтправитьНаФТП(ф);
	
	УдалитьФайлы(ф);

КонецПроцедуры    

Процедура ОтправитьНаФТП(фф)  
	спр=Справочники.TRP_S_НастройкиМаркетплейса.НастройкиКаспи; 
	
	АдресСайта = спр.АдресСервера;
	Порт = спр.Порт;
	Логин = спр.ИмяПользователя;
	Пароль = спр.Пароль;
	ИмяКаталога = "/";
	FTPСоединение = Новый FTPСоединение(АдресСайта,Порт,Логин,Пароль,,истина);
	FTPСоединение.УстановитьТекущийКаталог(ИмяКаталога);
	
	FTPСоединение.Записать(фф,"Kaspy/KaspiFeed.xml");  
КонецПроцедуры

Функция  ПолучитьСписСкладов()  
	спр=Справочники.TRP_S_НастройкиМаркетплейса.НастройкиКаспи; 
	
	тз1=новый ТаблицаЗначений;
	тз1.Колонки.Добавить("код");
	тз1.Колонки.Добавить("уже");
	
	для каждого ст из спр.СкладыКаспи цикл  
		с=тз1.Добавить();
		с.код=ст.КодКаспи;
		с.уже=0;
	КонецЦикла;
	
	возврат тз1;
КонецФункции


Функция ПолучитьКодСклада(скл)
	спр=Справочники.TRP_S_НастройкиМаркетплейса.НастройкиКаспи; 
	с=спр.СкладыКаспи.Найти(скл);
	
	возврат с.КодКаспи;
КонецФункции

&НаКлиенте
Процедура ОтправитьПрайс(Команда)
	ОтправитьПрайсНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКатегорииКаспиИграйка(Команда)
	ПолучитьКатегорииКаспиИграйкаФрагмент();

КонецПроцедуры

&НаСервере
Процедура ПолучитьКатегорииКаспиИграйкаФрагмент()
	
	//Перем к, мак, мкат, получитьма, с;
	
	мкат=ПолучитьКатегории();   
	
	о=РеквизитФормыВЗначение("Объект");
	тз0=РеквизитФормыВЗначение("тз");
	
	для к=0 по мкат.количество()-1 цикл
		с=тз0.Добавить();
		с.код=мкат[к].code;
		с.назв=нрег(мкат[к].title);
	КонецЦикла;   
	
	мак=о.получитьмакет("КатеорииИграйка"); 
	
	для к=1 по мак.высотаТаблицы цикл
		кат=мак.область(к,1).текст;  
		найдКат=тз0.найти(НРег(кат));  
		если найдКат=Неопределено тогда
			сообщить(""+кат);
		иначе
			сообщить(""+кат+"/"+найдКат.код+"/"+найдКат.назв);
		КонецЕсли;
	КонецЦикла;
	
	
	ЗначениеВРеквизитФормы(тз0,"тз");
	
КонецПроцедуры

