
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТабДокумент.Область(1,1,1,1).Текст = "Штрихкод";
	ТабДокумент.Область(1,1,1,1).ШиринаКолонки = 15;

	ТабДокумент.Область(1,2,1,2).Текст = "Артикул";
	ТабДокумент.Область(1,2,1,2).ШиринаКолонки = 10;
	
	ТабДокумент.Область(1,3,1,3).Текст = "Наименование";
	ТабДокумент.Область(1,3,1,3).ШиринаКолонки = 55;
	
	ТабДокумент.Область(1,4,1,4).Текст = "Цена";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Перенести(Команда)
	
	Закрыть(ПолучитьТаблицуРезультата(ЭтотОбъект.ВладелецФормы.УникальныйИдентификатор));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьТаблицуРезультата(Адрес)
	
	Данные	= Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("Штрихкод");
	Данные.Колонки.Добавить("Артикул");
	Данные.Колонки.Добавить("Наименование");
	Данные.Колонки.Добавить("Цена");
	
	Тип	= ОбщегоНазначения.ОписаниеТипаЧисло(15, 2);
	
	НПП = 1;
	Пока НПП < ТабДокумент.ВысотаТаблицы Цикл
		
		НПП = НПП + 1;
		
		НоваяСтрока	= Данные.Добавить();
		НоваяСтрока.Штрихкод	= ТабДокумент.Область(НПП, 1, НПП, 1).Текст;
		НоваяСтрока.Артикул		= ТабДокумент.Область(НПП, 2, НПП, 2).Текст;
		НоваяСтрока.Наименование	= ТабДокумент.Область(НПП, 3, НПП, 3).Текст;
		НоваяСтрока.Цена			= Тип.ПривестиЗначение(ТабДокумент.Область(НПП, 4, НПП, 4).Текст);
		
	КонецЦикла; 
	
	Возврат ПоместитьВоВременноеХранилище(Данные, Адрес);
	
КонецФункции

#КонецОбласти