
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ВедущийОбъект", ОбъектВладелец);
	Если Не ЗначениеЗаполнено(ОбъектВладелец) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Если объект еще не заблокирован для изменений и есть права на изменение набора        //Проверка Роли?
	// попытаемся установить блокировку.
	Если Ложь Тогда
		
		ТолькоПросмотр = Истина;
		
	КонецЕсли; 
	
	Если ТолькоПросмотр Тогда
		
		Элементы.НаборЗаписей.ТолькоПросмотр = Истина;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, 
			"ФормаКомандаОК",
			"Доступность",
			Ложь);
			
		Элементы.ФормаКомандаОтмена.КнопкаПоУмолчанию = Истина;
		
	КонецЕсли;
	
	УправлениеФормой(ЭтаФорма);
		
	Для Каждого ЗаписьНабора Из Параметры.МассивЗаписей Цикл
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), ЗаписьНабора);
	КонецЦикла;
	
	НаборЗаписей.Сортировать("Период");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	РедактированиеПериодическихСведенийКлиент.ОповеститьОЗавершении(ЭтаФорма, "НалогообложениеНачислений", ОбъектВладелец);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыНаборЗаписей

&НаКлиенте
Процедура НаборЗаписейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Не НоваяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовыйПериод = НачалоМесяца(ОбщегоНазначенияКлиент.ДатаСеанса());
	Если НаборЗаписей.Количество() > 1 Тогда
		ПоследнийПериод = НаборЗаписей.Получить(НаборЗаписей.Количество() - 2).Период;
	Иначе
		ПоследнийПериод = '00010101000000';
	КонецЕсли; 
	Если НовыйПериод <= ПоследнийПериод Тогда
		НовыйПериод = КонецДня(ПоследнийПериод) + 1;
	КонецЕсли; 
	Элемент.ТекущиеДанные.Период = НовыйПериод;
	НайденныеСтроки = НаборЗаписей.НайтиСтроки(Новый Структура("Период", Элемент.ТекущиеДанные.Период));
	
	Если ТипЗнч(ОбъектВладелец) = Тип("СправочникСсылка.ВидыВыплатБывшимСотрудникам")
		ИЛИ ТипЗнч(ОбъектВладелец) = Тип("СправочникСсылка.ВидыПрочихДоходовФизическихЛиц") Тогда
		ПроинициализироватьПоУмолчаниюПрочиеДоходы(НайденныеСтроки);
	Иначе
		ПроинициализироватьПоУмолчанию(НайденныеСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Период) Тогда
		СообщениеОбОшибке = НСтр("ru = 'Необходимо указать дату сведений'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке, , "НаборЗаписей.Период", , Отказ);
	Иначе
		Элемент.ТекущиеДанные.Период = НачалоМесяца(Элемент.ТекущиеДанные.Период);
		НайденныеСтроки = НаборЗаписей.НайтиСтроки(Новый Структура("Период", Элемент.ТекущиеДанные.Период));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Если НайденнаяСтрока <> Элемент.ТекущиеДанные Тогда
				СообщениеОбОшибке = НСтр("ru = 'Уже есть запись с указанной датой сведений'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке, , "НаборЗаписей.Период", , Отказ);
				Прервать;
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	Элемент.ТекущиеДанные.Начисление = ОбъектВладелец;
	
	РедактированиеПериодическихСведенийКлиент.УпорядочитьНаборЗаписейВФорме(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьПризнакиУчета(ВидДохода)

	УчитыватьИПН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьИПН");
	УчитыватьОПВ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьОПВ");
	УчитыватьСН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьСН");
	УчитыватьСО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьСО");
	УчитыватьОППВ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьОППВ");
	УчитыватьВОСМС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьВОСМС");
	УчитыватьООСМС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьООСМС");

КонецПроцедуры

&НаКлиенте
Процедура ПроинициализироватьПоУмолчанию(Данные)
	
	Данные[0].ВидДохода				= ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтРаботодателя");
	Данные[0].СпособОбложенияИПН	= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом");
	Данные[0].СпособОбложенияОПВ	= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом");
	Данные[0].СпособОбложенияСН		= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом");
	Данные[0].СпособОбложенияСО		= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом");
	Данные[0].СпособОбложенияОППВ	= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом");
	Данные[0].СпособОбложенияВОСМС	= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом");
	Данные[0].СпособОбложенияООСМС	= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроинициализироватьПоУмолчаниюПрочиеДоходы(Данные)
	
	Данные[0].ВидДохода				= ПредопределенноеЗначение("Справочник.ВидыДоходов.ПрочиеДоходы");
	Данные[0].СпособОбложенияИПН	= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом");
	Данные[0].СпособОбложенияОПВ	= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом");
	Данные[0].СпособОбложенияСН		= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом");
	Данные[0].СпособОбложенияСО		= Неопределено;
	Данные[0].СпособОбложенияОППВ	= Неопределено;
	Данные[0].СпособОбложенияВОСМС	= Неопределено;
	Данные[0].СпособОбложенияООСМС	= Неопределено;
	
КонецПроцедуры 

&НаКлиенте
Процедура НаборЗаписейВидДоходаПриИзменении(Элемент)
	
	ВидДохода = Элементы.НаборЗаписей.ТекущиеДанные.ВидДохода;
	ПолучитьПризнакиУчета(ВидДохода);
	
	Элементы.НаборЗаписей.ТекущиеДанные.СпособОбложенияИПН	= ?(УчитыватьИПН, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Элементы.НаборЗаписей.ТекущиеДанные.СпособОбложенияОПВ	= ?(УчитыватьОПВ, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Элементы.НаборЗаписей.ТекущиеДанные.СпособОбложенияСН	= ?(УчитыватьСН, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Элементы.НаборЗаписей.ТекущиеДанные.СпособОбложенияСО	= ?(УчитыватьСО, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Элементы.НаборЗаписей.ТекущиеДанные.СпособОбложенияОППВ	= ?(УчитыватьОППВ, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Элементы.НаборЗаписей.ТекущиеДанные.СпособОбложенияВОСМС= ?(УчитыватьВОСМС, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Элементы.НаборЗаписей.ТекущиеДанные.СпособОбложенияООСМС= ?(УчитыватьООСМС, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Если ТипЗнч(Форма.ОбъектВладелец) = Тип("СправочникСсылка.ВидыВыплатБывшимСотрудникам") Тогда
		
		Элементы.НаборЗаписейСпособОбложенияОППВ.Видимость = Ложь;
		Элементы.НаборЗаписейСпособОбложенияСН.Видимость = Ложь;
		Элементы.НаборЗаписейСпособОбложенияСО.Видимость = Ложь;
		Элементы.НаборЗаписейСпособОбложенияООСМС.Видимость = Ложь;
		
	ИначеЕсли ТипЗнч(Форма.ОбъектВладелец) = Тип("СправочникСсылка.ВидыПрочихДоходовФизическихЛиц") Тогда
		
		Элементы.НаборЗаписейСпособОбложенияОППВ.Видимость = Ложь;
		Элементы.НаборЗаписейСпособОбложенияООСМС.Видимость = Ложь;
		
	КонецЕсли;

КонецПроцедуры        

#КонецОбласти


