#Область ПрограммныйИнтерфейс

Процедура РасчетВычетовПоНалогамВНУ(СтруктураШапкиДокумента, Движения, Отказ) Экспорт
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	
	ПараметрыПроведения = ПодготовитьДанныеРасчетаВычетовПоНалогам(СтруктураШапкиДокумента, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ
	
	ТаблицаРасчетаВычетовПоНалогам = ПодготовитьТаблицыРасчетаВычетовПоНалогам(
		ПараметрыПроведения.ТаблицаРеквизитыРасчетВычетовПоНалогам,
		СтруктураШапкиДокумента.СписокОрганизаций,
		Отказ);
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	СформироватьДвиженияРасчетаВычетовПоНалогам(
		ТаблицаРасчетаВычетовПоНалогам,
		ПараметрыПроведения.ТаблицаРеквизитыРасчетВычетовПоНалогам,
		Движения,
		Отказ);
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПодготовитьДанныеРасчетаВычетовПоНалогам(СтруктураШапки, Отказ) Экспорт
	
	Запрос     = Новый Запрос;
	Содержание = "Уменьшение вычета на сумму неоплаченной части налога";
	Запрос.УстановитьПараметр("Ссылка",          СтруктураШапки.Ссылка);
	Запрос.УстановитьПараметр("Содержание",      Содержание);
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаРасчетВычетовПоНалогам(НомераТаблиц);
	Результат    = Запрос.ВыполнитьПакет();
	
	Возврат ТаблицыПроведения(НомераТаблиц, Результат);
	
КонецФункции

Функция ТекстЗапросаРасчетВычетовПоНалогам(НомераТаблиц)
	
	// Временные таблицы
	НомераТаблиц.Вставить("ТаблицаРеквизитыРасчетВычетовПоНалогам", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РегламентнаяОперация.Ссылка КАК Регистратор,
	|	РегламентнаяОперация.Организация КАК Организация,
	|	РегламентнаяОперация.Дата КАК Период,
	|	НАЧАЛОПЕРИОДА(РегламентнаяОперация.Дата, МЕСЯЦ) КАК НачДата,
	|	КОНЕЦПЕРИОДА(РегламентнаяОперация.Дата, МЕСЯЦ) КАК КонДата,
	|	&Содержание КАК Содержание
	|ИЗ
	|	Документ.РегламентнаяОперация КАК РегламентнаяОперация
	|ГДЕ
	|	РегламентнаяОперация.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ПодготовитьТаблицыРасчетаВычетовПоНалогам(ТаблицаРеквизиты, СписокОрганизаций, Отказ) Экспорт
	
	РасчетВычетовПоНалогамВБюджет = ПолучитьТаблицаРасчетаВычетовПоНалогам();
	Параметры = ПодготовитьПараметрыРасчетВычетовПоНалогам(РасчетВычетовПоНалогамВБюджет, ТаблицаРеквизиты);
	Реквизиты = Параметры.Реквизиты[0];
	ТаблицаПроводок = Параметры.ТаблицаРасчетаВычетовПоНалогам;
	
	Запрос    = Новый Запрос;
	Запрос.УстановитьПараметр("НачДата",           Новый Граница (НачалоГода(Реквизиты.НачДата),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонДата",           Новый Граница (КонецМесяца(Реквизиты.КонДата),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СписокОрганизаций", СписокОрганизаций);
	
	СчетаПрочихНалоговИОбязательств = Новый СписокЗначений;
	СчетаПрочихНалоговИОбязательств.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеОбязательстваПоДругимОбязательнымПлатежам);
	СчетаПрочихНалоговИОбязательств.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеНалоги);
	
	Запрос.УстановитьПараметр("СчетаПрочихНалоговИОбязательств", СчетаПрочихНалоговИОбязательств);
	
	// Штрафы и пени не разрешены к вычету, поэтому игнорируем их
	СписокИсключаемыхПлатежей = Новый СписокЗначений;
	СписокИсключаемыхПлатежей.Добавить(Перечисления.ВидыПлатежейВГосБюджет.ПениАкт);
	СписокИсключаемыхПлатежей.Добавить(Перечисления.ВидыПлатежейВГосБюджет.ПениСам);
	СписокИсключаемыхПлатежей.Добавить(Перечисления.ВидыПлатежейВГосБюджет.Штраф);	
	
	Запрос.УстановитьПараметр("СписокИсключаемыхПлатежей", СписокИсключаемыхПлатежей);
	
	СписокИсключаемыхТиповНалогов = Новый СписокЗначений;
	СписокИсключаемыхТиповНалогов.Добавить(Перечисления.ТипыНалогов.НДС);
	СписокИсключаемыхТиповНалогов.Добавить(Перечисления.ТипыНалогов.НДС_ВвозимыеТовары);
	СписокИсключаемыхТиповНалогов.Добавить(Перечисления.ТипыНалогов.НДС_НалоговыйАгент);
	СписокИсключаемыхТиповНалогов.Добавить(Перечисления.ТипыНалогов.ИПН);
	СписокИсключаемыхТиповНалогов.Добавить(Перечисления.ТипыНалогов.КПН);
	СписокИсключаемыхТиповНалогов.Добавить(Перечисления.ТипыНалогов.КПНУИсточникаВыплаты);

	СписокИсключаемыхТиповНалогов.Добавить(Перечисления.ТипыНалогов.ОПВ);
	СписокИсключаемыхТиповНалогов.Добавить(Перечисления.ТипыНалогов.ИПНДивиденды);
	СписокИсключаемыхТиповНалогов.Добавить(Перечисления.ТипыНалогов.НДС_Импорт);
	
	
	Запрос.УстановитьПараметр("СписокИсключаемыхТиповНалогов", СписокИсключаемыхТиповНалогов);
	
	ПрочиеСчетаНалогов = Новый СписокЗначений;
	ПрочиеСчетаНалогов.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеНалоги);
	ПрочиеСчетаНалогов.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеОбязательстваПоДругимОбязательнымПлатежам);
	
	Запрос.УстановитьПараметр("ПрочиеСчетаНалогов", ПрочиеСчетаНалогов);
	
	// Получаем сумму затрат по статье "Налоги в бюджет" за отчетный год
	// Сумма вычета = Мин(СальдоНачПоНалогу + Начисление; Сумма уплаты)
	// Невычет образует ВР	
	// При получении сальдо налога, считаем его в полном объеме НУ
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НастройкаТиповНалоговНалоговогоУчетаСрезПоследних.ТипНалога = ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ЗемельныйНалог)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗемельныйНалог)
	|		КОГДА НастройкаТиповНалоговНалоговогоУчетаСрезПоследних.ТипНалога = ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.НалогНаИмущество)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалогНаИмущество)
	|		КОГДА НастройкаТиповНалоговНалоговогоУчетаСрезПоследних.ТипНалога = ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.СН)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СоциальныйНалог)
	|		КОГДА НастройкаТиповНалоговНалоговогоУчетаСрезПоследних.ТипНалога = ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ТранспортныйНалог)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТранспортныйНалог)
	|		КОГДА НастройкаТиповНалоговНалоговогоУчетаСрезПоследних.ТипНалога = ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ООСМС)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбязательстваПоОтчислениямОСМС)
	|		КОГДА НастройкаТиповНалоговНалоговогоУчетаСрезПоследних.ТипНалога = ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ВОСМС)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбязательстваПоВзносамОСМС)
	|		КОГДА НастройкаТиповНалоговНалоговогоУчетаСрезПоследних.ТипНалога = ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ОППВ)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбязательныеПрофессиональныеПенсионныеВзносы)
	|		КОГДА НастройкаТиповНалоговНалоговогоУчетаСрезПоследних.ТипНалога = ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.СО)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбязательстваПоСоциальномуСтрахованию)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|	КОНЕЦ КАК СчетУчета,
	|	НастройкаТиповНалоговНалоговогоУчетаСрезПоследних.ТипНалога КАК Налог
	|ПОМЕСТИТЬ ВТ_СписокСчетов
	|ИЗ
	|	РегистрСведений.НастройкаТиповНалоговНалоговогоУчета.СрезПоследних(&КонДата, ) КАК НастройкаТиповНалоговНалоговогоУчетаСрезПоследних
	|ГДЕ
	|	НастройкаТиповНалоговНалоговогоУчетаСрезПоследних.ОтноситьНаВычетыВПределахУплаченнойСуммы = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленныйНалог.Счет КАК Счет,
	|	НачисленныйНалог.Организация КАК Организация,
	|	НачисленныйНалог.Подразделение КАК Подразделение,
	|	НачисленныйНалог.Субконто1 КАК Субконто1,
	|	НачисленныйНалог.Субконто2 КАК Субконто2,
	|	НачисленныйНалог.Субконто3 КАК Субконто3,
	|	ВЫБОР
	|		КОГДА НачисленныйНалог.КорСубконто1 ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов
	|			ТОГДА НачисленныйНалог.КорСубконто1
	|		КОГДА НачисленныйНалог.КорСубконто2 ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов
	|			ТОГДА НачисленныйНалог.КорСубконто2
	|		ИНАЧЕ НачисленныйНалог.КорСубконто3
	|	КОНЕЦ КАК СтатьяЗатрат,
	|	НачисленныйНалог.СуммаНУОборотКт КАК НачисленныйНалог,
	|	0 КАК СуммаОстаток,
	|	0 КАК СуммаОплаты
	|ПОМЕСТИТЬ ВТ_ОбщиеДанныеПоНалогам
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачДата,
	|			&КонДата,
	|			,
	|			Счет В
	|				(ВЫБРАТЬ
	|					СписокСчетов.СчетУчета
	|				ИЗ
	|					ВТ_СписокСчетов КАК СписокСчетов
	|				ГДЕ
	|					СписокСчетов.СчетУчета <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)),
	|			,
	|			Организация В (&СписокОрганизаций)
	|				И (ТИПЗНАЧЕНИЯ(КорСубконто1) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|					ИЛИ ТИПЗНАЧЕНИЯ(КорСубконто2) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|					ИЛИ ТИПЗНАЧЕНИЯ(КорСубконто3) = ТИП(ПланВидовХарактеристик.СтатьиРасходов))
	|				И НЕ Субконто1 В (&СписокИсключаемыхПлатежей),
	|			,
	|			) КАК НачисленныйНалог
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Счет,
	|	ХозрасчетныйОстатки.Организация,
	|	ХозрасчетныйОстатки.Подразделение,
	|	ХозрасчетныйОстатки.Субконто1,
	|	ХозрасчетныйОстатки.Субконто2,
	|	ХозрасчетныйОстатки.Субконто3,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.СуммаНУОстатокКт + ХозрасчетныйОстатки.СуммаВРОстатокКт > 0
	|			ТОГДА ХозрасчетныйОстатки.СуммаНУОстатокКт + ХозрасчетныйОстатки.СуммаВРОстатокКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.СуммаНУОстатокКт + ХозрасчетныйОстатки.СуммаВРОстатокКт < 0
	|			ТОГДА -(ХозрасчетныйОстатки.СуммаОстатокКт + ХозрасчетныйОстатки.СуммаВРОстатокКт)
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&НачДата,
	|			Счет В
	|				(ВЫБРАТЬ
	|					СписокСчетов.СчетУчета
	|				ИЗ
	|					ВТ_СписокСчетов КАК СписокСчетов
	|				ГДЕ
	|					СписокСчетов.СчетУчета <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)),
	|			,
	|			Организация В (&СписокОрганизаций)
	|				И НЕ Субконто1 В (&СписокИсключаемыхПлатежей)) КАК ХозрасчетныйОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УплаченныйНалог.Счет,
	|	УплаченныйНалог.Организация,
	|	УплаченныйНалог.Подразделение,
	|	УплаченныйНалог.Субконто1,
	|	УплаченныйНалог.Субконто2,
	|	УплаченныйНалог.Субконто3,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	УплаченныйНалог.СуммаНУОборот
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачДата,
	|			&КонДата,
	|			,
	|			Счет В
	|				(ВЫБРАТЬ
	|					СписокСчетов.СчетУчета
	|				ИЗ
	|					ВТ_СписокСчетов КАК СписокСчетов
	|				ГДЕ
	|					СписокСчетов.СчетУчета <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)),
	|			,
	|			Организация В (&СписокОрганизаций)
	|				И НЕ Субконто1 В (&СписокИсключаемыхПлатежей)
	|				И ТИПЗНАЧЕНИЯ(КорСубконто1) <> ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|				И ТИПЗНАЧЕНИЯ(КорСубконто2) <> ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|				И ТИПЗНАЧЕНИЯ(КорСубконто3) <> ТИП(ПланВидовХарактеристик.СтатьиРасходов),
	|			,
	|			) КАК УплаченныйНалог
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленныйНалог.Счет КАК Счет,
	|	НачисленныйНалог.Организация КАК Организация,
	|	НачисленныйНалог.Подразделение КАК Подразделение,
	|	НачисленныйНалог.Субконто1 КАК Субконто1,
	|	НачисленныйНалог.Субконто2 КАК Субконто2,
	|	НачисленныйНалог.Субконто3 КАК Субконто3,
	|	ВЫБОР
	|		КОГДА НачисленныйНалог.КорСубконто1 ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов
	|			ТОГДА НачисленныйНалог.КорСубконто1
	|		КОГДА НачисленныйНалог.КорСубконто2 ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов
	|			ТОГДА НачисленныйНалог.КорСубконто2
	|		ИНАЧЕ НачисленныйНалог.КорСубконто3
	|	КОНЕЦ КАК СтатьяЗатрат,
	|	НачисленныйНалог.СуммаОборотКт КАК НачисленныйНалог,
	|	0 КАК СуммаОстаток,
	|	0 КАК СуммаОплаты
	|ПОМЕСТИТЬ ВТ_ОбщиеДанныеПоПрочимНалогам
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачДата,
	|			&КонДата,
	|			,
	|			Счет В (&СчетаПрочихНалоговИОбязательств),
	|			,
	|			Организация В (&СписокОрганизаций)
	|				И (ТИПЗНАЧЕНИЯ(КорСубконто1) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|					ИЛИ ТИПЗНАЧЕНИЯ(КорСубконто2) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|					ИЛИ ТИПЗНАЧЕНИЯ(КорСубконто3) = ТИП(ПланВидовХарактеристик.СтатьиРасходов))
	|				И НЕ Субконто1 В (&СписокИсключаемыхПлатежей)
	|				И НЕ Субконто2 В (&СписокИсключаемыхТиповНалогов)
	|				И Субконто2 В
	|					(ВЫБРАТЬ
	|						ВТ_СписокСчетов.Налог КАК Налог
	|					ИЗ
	|						ВТ_СписокСчетов КАК ВТ_СписокСчетов),
	|			,
	|			) КАК НачисленныйНалог
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Счет,
	|	ХозрасчетныйОстатки.Организация,
	|	ХозрасчетныйОстатки.Подразделение,
	|	ХозрасчетныйОстатки.Субконто1,
	|	ХозрасчетныйОстатки.Субконто2,
	|	ХозрасчетныйОстатки.Субконто3,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.СуммаНУОстатокКт + ХозрасчетныйОстатки.СуммаВРОстатокКт > 0
	|			ТОГДА ХозрасчетныйОстатки.СуммаНУОстатокКт + ХозрасчетныйОстатки.СуммаВРОстатокКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.СуммаНУОстатокКт + ХозрасчетныйОстатки.СуммаВРОстатокКт < 0
	|			ТОГДА -(ХозрасчетныйОстатки.СуммаОстатокКт + ХозрасчетныйОстатки.СуммаВРОстатокКт)
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&НачДата,
	|			Счет В (&СчетаПрочихНалоговИОбязательств),
	|			,
	|			Организация В (&СписокОрганизаций)
	|				И НЕ Субконто1 В (&СписокИсключаемыхПлатежей)
	|				И НЕ Субконто2 В (&СписокИсключаемыхТиповНалогов)
	|				И Субконто2 В
	|					(ВЫБРАТЬ
	|						ВТ_СписокСчетов.Налог КАК Налог
	|					ИЗ
	|						ВТ_СписокСчетов КАК ВТ_СписокСчетов)) КАК ХозрасчетныйОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УплаченныйНалог.Счет,
	|	УплаченныйНалог.Организация,
	|	УплаченныйНалог.Подразделение,
	|	УплаченныйНалог.Субконто1,
	|	УплаченныйНалог.Субконто2,
	|	УплаченныйНалог.Субконто3,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	УплаченныйНалог.СуммаНУОборот
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачДата,
	|			&КонДата,
	|			,
	|			Счет В (&СчетаПрочихНалоговИОбязательств),
	|			,
	|			Организация В (&СписокОрганизаций)
	|				И НЕ Субконто1 В (&СписокИсключаемыхПлатежей)
	|				И ТИПЗНАЧЕНИЯ(КорСубконто1) <> ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|				И ТИПЗНАЧЕНИЯ(КорСубконто2) <> ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|				И ТИПЗНАЧЕНИЯ(КорСубконто3) <> ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|				И НЕ Субконто2 В (&СписокИсключаемыхТиповНалогов)
	|				И Субконто2 В
	|					(ВЫБРАТЬ
	|						ВТ_СписокСчетов.Налог КАК Налог
	|					ИЗ
	|						ВТ_СписокСчетов КАК ВТ_СписокСчетов),
	|			,
	|			) КАК УплаченныйНалог
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбщиеДанныеПоНалогам.Счет КАК Счет,
	|	ОбщиеДанныеПоНалогам.Организация КАК Организация,
	|	ОбщиеДанныеПоНалогам.Подразделение КАК Подразделение,
	|	ОбщиеДанныеПоНалогам.Субконто1 КАК Субконто1,
	|	ОбщиеДанныеПоНалогам.Субконто2 КАК Субконто2,
	|	ОбщиеДанныеПоНалогам.Субконто3 КАК Субконто3,
	|	МАКСИМУМ(ОбщиеДанныеПоНалогам.СтатьяЗатрат) КАК СтатьяЗатрат,
	|	СУММА(ОбщиеДанныеПоНалогам.НачисленныйНалог) КАК НачисленныйНалог,
	|	СУММА(ОбщиеДанныеПоНалогам.СуммаОстаток) КАК СуммаОстаток,
	|	СУММА(ОбщиеДанныеПоНалогам.СуммаОплаты) КАК УплаченныйНалог
	|ПОМЕСТИТЬ ВТ_ВычетыПоНалогам
	|ИЗ
	|	ВТ_ОбщиеДанныеПоНалогам КАК ОбщиеДанныеПоНалогам
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбщиеДанныеПоНалогам.Счет,
	|	ОбщиеДанныеПоНалогам.Организация,
	|	ОбщиеДанныеПоНалогам.Подразделение,
	|	ОбщиеДанныеПоНалогам.Субконто1,
	|	ОбщиеДанныеПоНалогам.Субконто2,
	|	ОбщиеДанныеПоНалогам.Субконто3

	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОбщиеДанныеПоПрочимНалогам.Счет,
	|	ОбщиеДанныеПоПрочимНалогам.Организация,
	|	ОбщиеДанныеПоПрочимНалогам.Подразделение,
	|	ОбщиеДанныеПоПрочимНалогам.Субконто1,
	|	ОбщиеДанныеПоПрочимНалогам.Субконто2,
	|	ОбщиеДанныеПоПрочимНалогам.Субконто3,
	|	МАКСИМУМ(ОбщиеДанныеПоПрочимНалогам.СтатьяЗатрат),
	|	СУММА(ОбщиеДанныеПоПрочимНалогам.НачисленныйНалог),
	|	СУММА(ОбщиеДанныеПоПрочимНалогам.СуммаОстаток),
	|	СУММА(ОбщиеДанныеПоПрочимНалогам.СуммаОплаты)
	|ИЗ
	|	ВТ_ОбщиеДанныеПоПрочимНалогам КАК ОбщиеДанныеПоПрочимНалогам
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбщиеДанныеПоПрочимНалогам.Счет,
	|	ОбщиеДанныеПоПрочимНалогам.Организация,
	|	ОбщиеДанныеПоПрочимНалогам.Подразделение,
	|	ОбщиеДанныеПоПрочимНалогам.Субконто1,
	|	ОбщиеДанныеПоПрочимНалогам.Субконто2,
	|	ОбщиеДанныеПоПрочимНалогам.Субконто3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВычетыПоНалогам.Счет КАК Счет,
	|	ВычетыПоНалогам.Организация КАК Организация,
	|	ВычетыПоНалогам.Подразделение КАК Подразделение,
	|	ВычетыПоНалогам.Субконто1 КАК Субконто1,
	|	ВычетыПоНалогам.Субконто2 КАК Субконто2,
	|	ВычетыПоНалогам.Субконто3 КАК Субконто3,
	|	ВычетыПоНалогам.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВычетыПоНалогам.НачисленныйНалог КАК НачисленныйНалог,
	|	ВычетыПоНалогам.СуммаОстаток КАК СуммаОстаток,
	|	ВычетыПоНалогам.УплаченныйНалог КАК УплаченныйНалог
	|ИЗ
	|	ВТ_ВычетыПоНалогам КАК ВычетыПоНалогам
	|ГДЕ
	|	(ВычетыПоНалогам.НачисленныйНалог <> 0
	|			ИЛИ ВычетыПоНалогам.СуммаОстаток <> 0
	|			ИЛИ ВычетыПоНалогам.УплаченныйНалог <> 0)";


	
	Результат    = Запрос.Выполнить();
	Выборка	     = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СуммаКВычету = Мин(Макс(Выборка.СуммаОстаток,0) + Выборка.НачисленныйНалог, Макс(Выборка.УплаченныйНалог,0));
		СуммаНеРазрешеннаяКВычету = Выборка.НачисленныйНалог - СуммаКВычету;

		Если СуммаНеРазрешеннаяКВычету <> 0 Тогда
			Запись = ТаблицаПроводок.Добавить();
			
			Запись.Организация	  = Выборка.Организация;
			Запись.СчетДт         = Выборка.Счет;
			Запись.СчетКт         = ПланыСчетов.Хозрасчетный.ПрочиеРасходыВНалоговомУчете;
			
			Запись.Подразделение  = Выборка.Подразделение;
			
			Запись.СубконтоДт1    = Выборка.Субконто1;
			Запись.СубконтоДт2    = Выборка.Субконто2;
			Запись.СубконтоДт3    = Выборка.Субконто3;
			
			Запись.СтатьяЗатрат	  = Выборка.СтатьяЗатрат;
			
			Запись.Сумма          = 0;
			Запись.СуммаНУ        = СуммаНеРазрешеннаяКВычету;
			Запись.СуммаПР        = 0;
			Запись.СуммаВР        = -СуммаНеРазрешеннаяКВычету;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаПроводок;

КонецФункции

Функция ТаблицыПроведения(НомераТаблиц, Результат)
	
	ТаблицыПроведения = Новый Структура;
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		Если НРег(Лев(НомерТаблицы.Ключ, 7)) = "таблица" Тогда
			ТаблицыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицыПроведения;
	
КонецФункции

Функция ПолучитьТаблицаРасчетаВычетовПоНалогам()
	
	ОписаниеТипаЧисла15_2 = ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15, 2);
	ОписаниеТипаСчетХозр  = Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный");
	
	ТаблицаРасчета = Новый ТаблицаЗначений;
	ТаблицаРасчета.Колонки.Добавить("СчетДт",         ОписаниеТипаСчетХозр);
	ТаблицаРасчета.Колонки.Добавить("СчетКт",         ОписаниеТипаСчетХозр);
	ТаблицаРасчета.Колонки.Добавить("Сумма",          ОписаниеТипаЧисла15_2);
	ТаблицаРасчета.Колонки.Добавить("СуммаНУ",        ОписаниеТипаЧисла15_2);
	ТаблицаРасчета.Колонки.Добавить("СуммаПР",        ОписаниеТипаЧисла15_2);
	ТаблицаРасчета.Колонки.Добавить("СуммаВР",        ОписаниеТипаЧисла15_2);
	
	ТаблицаРасчета.Колонки.Добавить("СубконтоДт1",    );
	ТаблицаРасчета.Колонки.Добавить("СубконтоДт2",    );
	ТаблицаРасчета.Колонки.Добавить("СубконтоДт3",    );
	
	ТаблицаРасчета.Колонки.Добавить("СтатьяЗатрат",   Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
	
	ТаблицаРасчета.Колонки.Добавить("Подразделение",  Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	ТаблицаРасчета.Колонки.Добавить("Организация",  Новый ОписаниеТипов("СправочникСсылка.Организации"));
	
	Возврат ТаблицаРасчета;
	
КонецФункции

Функция ПодготовитьПараметрыРасчетВычетовПоНалогам(ТаблицаПроводок, ТаблицаРеквизиты)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы Параметры.ТаблицаРасчетаВычетовПоНалогам
	
	СписокОбязательныхКолонок = ""
	+ "Сумма,"          // <Число, 15, 2>
	+ "СуммаНУ,"        // <Число, 15, 2>
	+ "СуммаПР,"        // <Число, 15, 2>
	+ "СуммаВР,"        // <Число, 15, 2>
	+ "СчетДт,"         // <ПланСчетовСсылка.Хозрасчетный>
	+ "СчетКт,"         // <ПланСчетовСсылка.Хозрасчетный>
	+ "СубконтоДт1,"    // <ПланВидовХарактеристикСсылка.ВидыСубконтоХозрасчетные>
	+ "СубконтоДт2,"    // <ПланВидовХарактеристикСсылка.ВидыСубконтоХозрасчетные>
	+ "СубконтоДт3,"    // <ПланВидовХарактеристикСсылка.ВидыСубконтоХозрасчетные>
	+ "СтатьяЗатрат,"   // <ПланВидовХарактеристикСсылка.СтатьиРасходов>
	+ "Подразделение,"  // <Ссылка на справочник подразделений>
	+ "Организация"     // <Ссылка на справочник организаций>
	;
	
	ТаблицаПараметров = ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаПроводок,
		СписокОбязательныхКолонок);
	Параметры.Вставить("ТаблицаРасчетаВычетовПоНалогам", ТаблицаПараметров);
	
	// Подготовка таблицы Параметры.Реквизиты
	
	СписокОбязательныхКолонок = ""
	+ "Период,"          // <Дата>
	+ "НачДата,"         // <Дата>
	+ "КонДата,"         // <Дата>
	+ "Организация,"     // <СправочникСсылка.Организации>
	+ "Регистратор,"     // <ДокументСсылка.*>
	+ "Содержание"       // <Строка, 150>
	;
	
	ТаблицаПараметров = ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаРеквизиты,
		СписокОбязательныхКолонок);
	Параметры.Вставить("Реквизиты", ТаблицаПараметров);
	
	Возврат Параметры;
	
КонецФункции

Процедура СформироватьДвиженияРасчетаВычетовПоНалогам(ТаблицаПроводок, ТаблицаРеквизиты, Движения, Отказ)
	
	Параметры       = ПодготовитьПараметрыРасчетВычетовПоНалогам(ТаблицаПроводок, ТаблицаРеквизиты);
	Реквизиты       = Параметры.Реквизиты[0];
	ПоддержкаПБУ18  = УчетнаяПолитика.ПоддержкаПБУ18(Реквизиты.Организация, Реквизиты.Период);
	
	Для каждого Запись Из Параметры.ТаблицаРасчетаВычетовПоНалогам Цикл
		Проводка = Движения.Хозрасчетный.Добавить();
		Проводка.Период      = Реквизиты.Период;
		Проводка.Организация = Запись.Организация;
		Проводка.СчетДт      = Запись.СчетДт;
		Проводка.СчетКт      = Запись.СчетКт;
		
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Запись.СубконтоДт1);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Запись.СубконтоДт2);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, Запись.СубконтоДт3);
		
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиЗатрат", Запись.СтатьяЗатрат);
		
		БухгалтерскийУчет.УстановитьПодразделенияПроводки(Проводка, Запись.Подразделение, Запись.Подразделение);
		
		Проводка.Сумма = Запись.Сумма;
		СуммаНУ        = Запись.СуммаНУ;
		СуммаПР        = Запись.СуммаПР;
		СуммаВР        = Запись.СуммаВР;
		
		НалоговыйУчет.ЗаполнитьНалоговыеСуммыПроводки(СуммаНУ, СуммаНУ, СуммаПР, СуммаПР,
								СуммаВР, СуммаВР, Проводка, ПоддержкаПБУ18);
		Проводка.Содержание = Реквизиты.Содержание;
		
	КонецЦикла;
	
	Движения.Хозрасчетный.Записывать = Истина;

КонецПроцедуры
// Возвращает Истина, если переданный счет является 
//  счетом учета краткосрочных оценочных обязательств по вознаграждениям работников.
//
// Параметры:
//	Счет - ПланСчетовСсылка.Хозрасчетный - Проверяемый счет.
//
// Возвращаемое значение:
//	Булево - Признак.
//
Функция ЭтоСчетКраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам(Знач Счет) Экспорт
	
	Возврат Счет = ПланыСчетов.Хозрасчетный.КраткосрочныеОценочныеОбязательстваПоВознаграждениямРаботникам;
	
КонецФункции

#КонецОбласти

