
Функция ВерсияФорматаВыгрузки(Знач НаДату = Неопределено, ВыбраннаяФорма = Неопределено) Экспорт
	
	Возврат Перечисления.ВерсииФорматовВыгрузки.ВерсияРПН;//Версия500;
	
КонецФункции

Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(254));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  	20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 	5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 	5);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета7012016Кв1";
	НоваяФорма.ОписаниеОтчета     = "Расчет текущих платежей по налогу на транспортные средства. Версия шаблона ФНО для ИС СОНО: 701.00.v12.r42 от 18.01.2016 г."; 
	НоваяФорма.ДатаНачалоДействия = '20160101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20161231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета7012017Кв1";
	НоваяФорма.ОписаниеОтчета     = "Расчет текущих платежей по налогу на транспортные средства. Версия шаблона ФНО для ИС СОНО: 701.00.v13.r45 от 25.12.2016 г.";
	НоваяФорма.ДатаНачалоДействия = '20170101';
	НоваяФорма.ДатаКонецДействия  = '20171231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета7012018Кв1";
	НоваяФорма.ОписаниеОтчета     = "Расчет текущих платежей по налогу на транспортные средства. Версия шаблона ФНО для ИС СОНО: 701.00.v15.r47 от 27.04.2018 г.";
	НоваяФорма.ДатаНачалоДействия = '20180101';
	НоваяФорма.ДатаКонецДействия  = '20181231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета7012019Кв1";
	НоваяФорма.ОписаниеОтчета     = "Расчет текущих платежей по налогу на транспортные средства. Версия шаблона ФНО для ИС СОНО: 701.00.v15.r49 от 26.12.2018 г.";
	НоваяФорма.ДатаНачалоДействия = '20190101';
	НоваяФорма.ДатаКонецДействия  = '20191231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета7012020Кв1";
	НоваяФорма.ОписаниеОтчета     = "Расчет текущих платежей по налогу на транспортные средства. Версия шаблона ФНО для ИС СОНО: 701.00.v15.r53 от 23.12.2021 г.";
	НоваяФорма.ДатаНачалоДействия = '20200101';
	НоваяФорма.ДатаКонецДействия  = РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));

	Возврат ТаблицаФормОтчета;
	
КонецФункции