////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
     ПараметрыФормы = ЭтаФорма.Параметры;
     ПараметрыФормы.Свойство("АлгоритмПодписи"           , ЭтаФорма.АлгоритмПодписи);
     ПараметрыФормы.Свойство("СертификатНаСервере"       , ЭтаФорма.СертификатыНаСервере);
	 ПараметрыФормы.Свойство("УстановленВЛичномХранилище", ЭтаФорма.ТолькоЛичные);
     Элементы.АлгоритмПодписи.СписокВыбора.ЗагрузитьЗначения(ЭКОМ_ОбщегоНазначения.ВсеАлгоритмыПодписей());
	 	 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьТаблицу();
	  
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВнешнейКомпонентыXMLDSig(Контекст) Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ПослеПодключения", ЭтаФорма, Контекст);
	НачатьПодключениеВнешнейКомпоненты(Оповещение, "Справочник.ЭКОМ_Сертификаты.Макет.КомпонентаXMLDSIG", "XMLDSignAddInSymbolicName");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодключения(Подключено, Контекст) Экспорт
	
	ИмяСобытия = "Подключение внешней компоненты XMLDSig";
	Если Подключено Тогда
        Попытка
            Контекст.ОбъектКомпоненты = Новый("AddIn.XMLDSignAddInSymbolicName.XMLDSignAddIn");
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
            ТекстЛогаСобытий = "Не удалось подключить внешнюю компоненту XMLDSig.";
			ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначенияКлиент.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
			Контекст.МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		КонецПопытки;  
		ПродолжитьОбновитьТаблицу(Контекст.ОбъектКомпоненты);
	ИначеЕсли Контекст.УстановитьЕслиНеПодключено Тогда
		Контекст.УстановитьЕслиНеПодключено = Ложь;//Docrobot 1.20.0 MOD-1918
        НачатьУстановкуВнешнейКомпоненты(Новый ОписаниеОповещения("ОбъектВнешнейКомпонентыXMLDSig", ЭКОМ_ОбщегоНазначенияКлиент, Контекст),
		"Справочник.ЭКОМ_Сертификаты.Макет.КомпонентаXMLDSIG");	
	Иначе
		ПродолжитьОбновитьТаблицу(Контекст.ОбъектКомпоненты);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСертификатовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Результат = ВыбраннаяСтрока();
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
		
	Результат = ВыбраннаяСтрока();
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицу()
	
	МассивЛогаСобытий = Новый Массив;
	
	Контекст = Новый Структура;	
	Контекст.Вставить("ОбъектКомпоненты"          , Неопределено);
	Контекст.Вставить("УстановитьЕслиНеПодключено", Истина);
	Контекст.Вставить("МассивЛогаСобытий"         , МассивЛогаСобытий);

	ОбъектВнешнейКомпонентыXMLDSig(Контекст);

КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОбновитьТаблицу(ОбъектКомпоненты)
    МассивЛогаСобытий = Новый Массив;
    
	ЭтаФорма.ТаблицаСертификатов.Очистить();
    
    Если ЭтаФорма.СертификатыНаСервере Тогда
	     МассивСтруктурСертификатов = ЭКОМ_ОбщегоНазначения.ЭЦП_ПолучитьСертификатыКриптографии(ЭтаФорма.АлгоритмПодписи, ЭтаФорма.ТолькоЛичные, ТолькоДействующие, МассивЛогаСобытий);
	Иначе	
	     МассивСтруктурСертификатов = ЭКОМ_ОбщегоНазначенияКлиент.ЭЦП_ПолучитьСертификатыКриптографииНаКлиенте(ЭтаФорма.АлгоритмПодписи, ЭтаФорма.ТолькоЛичные, ТолькоДействующие, ОбъектКомпоненты, МассивЛогаСобытий);
	КонецЕсли;
		
	Для Каждого Элемент Из МассивСтруктурСертификатов Цикл
		Строка = ЭтаФорма.ТаблицаСертификатов.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Элемент);
    КонецЦикла;
	
	Если МассивЛогаСобытий.Количество() > 0 Тогда
		    ЭтаФорма.ТекстСообщения = ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий);		
	КонецЕсли;

    Элементы.ТекстСообщения.ЦветТекста = ?(ПустаяСтрока(ТекстСообщения), WebЦвета.Черный, WebЦвета.Кирпичный);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
    
    ОбновитьТаблицу();

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Функция ВыбраннаяСтрока()
	
	Результат = Неопределено;
	
	ТекущиеДанные = Элементы.ТаблицаСертификатов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Результат = Новый Структура;
		Результат.Вставить("ИмяСертификата"      , ТекущиеДанные.ИмяСертификата);
		Результат.Вставить("ДолжностьПодписанта" , ТекущиеДанные.ДолжностьПодписанта);
		Результат.Вставить("ФамилияПодписанта"   , ТекущиеДанные.ФамилияПодписанта);
		Результат.Вставить("ИмяПодписанта"       , ТекущиеДанные.ИмяПодписанта);
		Результат.Вставить("ОтчествоПодписанта"  , ТекущиеДанные.ОтчествоПодписанта);
		Результат.Вставить("ОтпечатокСертификата", ТекущиеДанные.ОтпечатокСертификата);
		Результат.Вставить("ДействителенДо"      , ТекущиеДанные.ДействителенДо);
		Результат.Вставить("АлгоритмПодписи"     , ТекущиеДанные.АлгоритмПодписи);
		Результат.Вставить("ИНН"                 , ТекущиеДанные.ИНН);
		Результат.Вставить("СертификатНаСервере"       , ЭтаФорма.СертификатыНаСервере);
		Результат.Вставить("УстановленВЛичномХранилище", ЭтаФорма.ТолькоЛичные);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ТекстСообщенияНажатие(Элемент, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
    ПоказатьПредупреждение(Новый ОписаниеОповещения, ЭтаФорма.ТекстСообщения, , "События и ошибки");
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПодписиПриИзменении(Элемент)
    ОбновитьТаблицу();
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьСертификатНаСервереПриИзменении(Элемент)
    ОбновитьТаблицу();
КонецПроцедуры

&НаКлиенте
Процедура ТолькоЛичныеПриИзменении(Элемент)
    ОбновитьТаблицу();
КонецПроцедуры









