
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ПриЗаписи")
Процедура игр_ПриЗаписи(Отказ, Замещение)
	
	ТаблицаТоваров	= ЭтотОбъект.Выгрузить(); 
	
	Запрос	= Новый Запрос;  
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладах.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&Таблица КАК ТоварыНаСкладах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.Характеристика КАК Характеристика
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ВТ_Товары.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	СпрНоменклатура.ВыгруженНаКаспи = ИСТИНА"
	;    
	
	Запрос.УстановитьПараметр("Таблица", ТаблицаТоваров);
	
	МассивВыгрузки	= Новый Массив;
	
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		МассивВыгрузки.Добавить(Новый Структура("Номенклатура,Характеристика", 
			Выборка.Номенклатура, Выборка.Характеристика));
	КонецЦикла;
		
	РегистрыСведений.игр_НоменклатураКВыгрузке.ЗаписатьНоменклатуруКВыгрузке(МассивВыгрузки);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
