
&НаКлиенте
Процедура КартинакаАльбомнаяОриентацияНажатие(Элемент)
	
	ОриентацияСтраницы = "Альбомная";
	УстановитьВыделениеКартинки(ОриентацияСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура КартинакаКнижнаяОриентацияНажатие(Элемент)
	
	ОриентацияСтраницы = "Книжная";
	УстановитьВыделениеКартинки(ОриентацияСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВыделениеКартинки(ОриентацияСтраницы)
	
	Если ОриентацияСтраницы = "Книжная" Тогда		
		Элементы.КартинакаКнижнаяОриентация.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.Двойная,2);
		Элементы.КартинакаАльбомнаяОриентация.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки,0);
	Иначе
		Элементы.КартинакаАльбомнаяОриентация.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.Двойная,2);
		Элементы.КартинакаКнижнаяОриентация.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки,0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыСохранитьИЗакрыть(Команда)
	
	ОтменаОперации = Ложь;
	СохранитьТекущиеНастройкиЮЗД();		
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыОтмена(Команда)
	
	ОтменаОперации = Истина;	
	СохранитьТекущиеНастройкиЮЗД();		
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаСервере
Процедура СохранитьТекущиеНастройкиЮЗД()
	
	ОбработкаОбъект 	= РеквизитФормыВЗначение("Объект");
	ТекущийПользователь = ОбработкаОбъект.НайтиТекущегоПользователя();
	
	Настройки = Новый Массив;
	Настройки.Добавить("ОриентацияСтраницы");
	Настройки.Добавить("РежимЗагрузкиДокументов");
	Настройки.Добавить("ОтменаОперации");
	
	Для Каждого Настройка Из Настройки Цикл
		ХранилищеНастроекДанныхФорм.Сохранить("Docrobot_ФормаНастроекПечати", Настройка, ЭтаФорма[Настройка], , ТекущийПользователь.Наименование); 
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ВосстановитьТекущиеНастройкиЮЗД()
	
	ОбработкаОбъект 	= РеквизитФормыВЗначение("Объект");
	ТекущийПользователь = ОбработкаОбъект.НайтиТекущегоПользователя();
	
	ПараметрыОтбора = Новый Структура("КлючОбъекта, ИмяПользователя", "Docrobot_ФормаНастроекПечати", ТекущийПользователь.Наименование);
	ВыборкаНастроек = ХранилищеНастроекДанныхФорм.Выбрать(ПараметрыОтбора);
	
	Пока ВыборкаНастроек.Следующий() Цикл	
		Попытка
			Если Не ВыборкаНастроек.КлючНастроек = "ОтменаОперации" Тогда
				ЭтаФорма[ВыборкаНастроек.КлючНастроек] = ВыборкаНастроек.Настройки;
			КонецЕсли;
		Исключение КонецПопытки;	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	Если ИмяДокументаЮЗД = "ДокументЭКОМ_ЮЗД" Тогда
		Элементы.РежимЗагрузкиДокументов.Видимость = Ложь;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ОриентацияСтраницы) Тогда
		УстановитьВыделениеКартинки(ОриентацияСтраницы);
	Иначе
		ОриентацияСтраницы = "Альбомная";
		УстановитьВыделениеКартинки(ОриентацияСтраницы);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РежимЗагрузкиДокументов) Тогда
		РежимЗагрузкиДокументов = "ЗагружатьПоследнююВерсиюДокумента";		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ИмяДокументаЮЗД",ИмяДокументаЮЗД);	
	ВосстановитьТекущиеНастройкиЮЗД();		
	ОтменаОперации = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	СтруктураПараметровОповещения = Новый Структура;
	
	СтруктураПараметровОповещения.Вставить("ИмяДокументаЮЗД",ИмяДокументаЮЗД);
	СтруктураПараметровОповещения.Вставить("ОриентацияСтраницы",ОриентацияСтраницы);
	СтруктураПараметровОповещения.Вставить("РежимЗагрузкиДокументов",РежимЗагрузкиДокументов);
	СтруктураПараметровОповещения.Вставить("ОтменаОперации",ОтменаОперации);
	
	 ОповеститьОВыборе(СтруктураПараметровОповещения);
	
КонецПроцедуры
