#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МассивИсключаемыхЗначений = Новый Массив;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ОтключенныйФункционал") Тогда
		МассивИсключаемыхЗначений.Добавить(Перечисления.ТипыРегламентныхОпераций.ПризнаниеРасходовПриУСН);
		МассивИсключаемыхЗначений.Добавить(Перечисления.ТипыРегламентныхОпераций.РасчетНалогаУСН);
		МассивИсключаемыхЗначений.Добавить(Перечисления.ТипыРегламентныхОпераций.РасчетТорговогоСбора);
        МассивИсключаемыхЗначений.Добавить(Перечисления.ТипыРегламентныхОпераций.РасчетДолейСписанияКосвенныхРасходов);
	КонецЕсли;
	
	ОбщегоНазначенияУТВызовСервера.ДоступныеДляВыбораЗначенияПеречисления(
		"ТипыРегламентныхОпераций",
		ДанныеВыбора,
		Параметры,
		МассивИсключаемыхЗначений);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли