
&ИзменениеИКонтроль("РассчитатьПоРеализацииТоваровУслуг")
Функция игр_РассчитатьПоРеализацииТоваровУслуг(Объект, ВходныеПараметры)

	УстановитьПривилегированныйРежим(Истина);

	ЗаполнитьКлючиСвязиВТабличнойЧастиТовары(Объект, "Товары");

	ИспользоватьНаборы = ПолучитьФункциональнуюОпцию("ИспользоватьНаборы");

	// Обработка табличной части "Товары".
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Товары.КодСтроки          КАК КодСтроки,
	|	Товары.КлючСвязи          КАК КлючСвязи,
	|	%ПоляНабора%
	|	Товары.Номенклатура       КАК Номенклатура,
	|	Товары.Характеристика     КАК Характеристика,
	|	Товары.Упаковка           КАК Упаковка,
	|	Товары.Серия              КАК Серия,
	|	Товары.Склад              КАК Склад,
	|	Товары.ВидЦены            КАК ВидЦены,
	|	Товары.Количество         КАК Количество,
	|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	Товары.Цена                             КАК Цена,
	|	Товары.КоличествоУпаковок * Товары.Цена КАК Сумма
	|ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.КлючСвязи,
	|	%Поля%
	|	Таблица.Номенклатура,
	|	Таблица.Характеристика,
	|	Таблица.Упаковка,
	|	Таблица.Серия,
	|	Таблица.Склад,
	|	Таблица.ВидЦены,
	|	СправочникНоменклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	Таблица.Количество,
	|	Таблица.КоличествоУпаковок,
	|	Таблица.Цена,
	|	Таблица.Сумма
	|%ИмяВременнойТаблицы%
	|ИЗ
	|	ВТТовары КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО СправочникНоменклатура.Ссылка = Таблица.Номенклатура
	|		%Соединение%
	|ГДЕ
	|	ВЫБОР 
	|		КОГДА &ВозвратТары ТОГДА
	|			Таблица.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|	ИНАЧЕ
	|		ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР 
	|		КОГДА &РеализацияСверхЗаказа ТОГДА 
	|			Таблица.КодСтроки = 0 
	|		ИНАЧЕ 
	|			ИСТИНА
	|	КОНЕЦ
	|%ЗапросНаборы%
	|";

	ТаблицаТовары = Объект.Товары.Выгрузить();

	ПараметрыЗапроса = ПараметрыРасчета();
	ПараметрыЗапроса.Вставить("Товары", ТаблицаТовары);
	ПараметрыЗапроса.Вставить("РеализацияСверхЗаказа", ВходныеПараметры.РеализацияСверхЗаказа);
	ПараметрыЗапроса.Вставить("ВозвратТары", Объект.ВернутьМногооборотнуюТару);

	ДанныеПоТоварамИНаборам = ДанныеПоТоварамИНаборам(ТекстЗапроса, ПараметрыЗапроса, ИспользоватьНаборы);

	СкидкиНаценки = ПолучитьТаблицуСкидокНаценокДляОптовойТорговли(
	Объект.Дата,
	Объект.Склад,
	Объект.Соглашение,
	Объект.КартаЛояльности);

	ПараметрыРасчета = ПараметрыРасчета();
	ПараметрыРасчета.СкидкиНаценки = СкидкиНаценки;
	ПараметрыРасчета.Партнер       = Объект.Партнер;
	ПараметрыРасчета.Соглашение    = Объект.Соглашение;
	ПараметрыРасчета.Регистратор   = Объект.Ссылка;

	// Для скидки "За форму оплаты".
	ПараметрыРасчета.ФормаОплаты = Объект.ФормаОплаты;

	// Для скидки "За время продажи".
	ПараметрыРасчета.ДеньНедели   = Перечисления.ДниНедели.Получить(ДеньНедели(Объект.Дата) - 1);
	ПараметрыРасчета.ТекущееВремя = ПолучитьТекущееВремяОбъекта(Объект);
	ПараметрыРасчета.ТекущаяДата  = ПолучитьТекущуюДатуОбъекта(Объект);

	// Для скидки "За соблюдение графика оплаты".
	ПараметрыРасчета.ГрафикОплаты = Неопределено;

	// Карты лояльности
	ПараметрыРасчета.КартаЛояльности = Объект.КартаЛояльности;

	ПараметрыРасчета.Товары                     = ДанныеПоТоварамИНаборам.Товары;
	ПараметрыРасчета.ВалютаДокумента            = Объект.Валюта;
	ПараметрыРасчета.ВалютаУправленческогоУчета = Константы.ВалютаУправленческогоУчета.Получить();
	ПараметрыРасчета.Пользователь               = Объект.Менеджер;
	ПараметрыРасчета.Объект                     = Объект;

	ПодготовитьДанныеОВыбранныхУправляемыхСкидках(Объект, ПараметрыРасчета, ВходныеПараметры);
	ПримененныеСкидкиНаценки = РассчитатьДеревоСкидокНаценок(ПараметрыРасчета, ВходныеПараметры);

	Если ИспользоватьНаборы И НЕ ВходныеПараметры.ТолькоПредварительныйРасчет Тогда
		РаспределитьСкидкиНабораПоКомплектующим(ПримененныеСкидкиНаценки, ДанныеПоТоварамИНаборам.СоответствиеКлючей, ТаблицаТовары);
	КонецЕсли;
	
	#Вставка     
	игр_СкидкиНаценки.РассчитатьСкидкиОптовыхБонусов(Объект, ПримененныеСкидкиНаценки);
	#КонецВставки
	Если ВходныеПараметры.ПрименятьКОбъекту Тогда

		ПрименитьРезультатРасчетаКРеализацииТоваровУслуг(Объект, ПримененныеСкидкиНаценки, ВходныеПараметры.РеализацияСверхЗаказа);

	КонецЕсли;

	Возврат ПримененныеСкидкиНаценки;

КонецФункции
