
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


// Формирует сведения об учете основного средства
//
// Параметры:
//  ОсновноеСредство - СправочникСсылка.ОбъектыЭксплуатации - Основное средство для которого нужно получить сведения.
// 
// Возвращаемое значение:
//  Структура - Содержит сведения об учете.
//
Функция СведенияОбУчете(ОсновноеСредство) Экспорт

	Если НЕ ПравоДоступа("Чтение", Метаданные.РегистрыСведений.МестонахождениеОС)
		ИЛИ НЕ ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПервоначальныеСведенияОС)
		ИЛИ НЕ ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПорядокУчетаОС)
		ИЛИ НЕ ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПорядокУчетаОСУУ)
		ИЛИ НЕ ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПорядокУчетаОСБУ)
		ИЛИ НЕ ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПараметрыАмортизацииОСБУ)
		ИЛИ НЕ ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПараметрыАмортизацииОСУУ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВводаВЭксплуатациюБУ,
	|	ЕСТЬNULL(ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюУУ, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВводаВЭксплуатациюУУ,
	|	ЕСТЬNULL(ПервоначальныеСведенияОС.ДокументВводаВЭксплуатациюБУ, НЕОПРЕДЕЛЕНО) КАК ДокументВводаВЭксплуатациюБУ,
	|	ЕСТЬNULL(ПервоначальныеСведенияОС.ДокументВводаВЭксплуатациюУУ, НЕОПРЕДЕЛЕНО) КАК ДокументВводаВЭксплуатациюУУ,
	|	ЕСТЬNULL(ПервоначальныеСведенияОС.ДокументСнятияСУчета, НЕОПРЕДЕЛЕНО) КАК ДокументСнятияСУчета,
	|	ЕСТЬNULL(ПервоначальныеСведенияОС.ДокументСнятияСУчета.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСнятияСУчета,
	|	ЕСТЬNULL(ПорядокУчетаОССрезПоследних.ГруппаФинансовогоУчета, НЕОПРЕДЕЛЕНО) КАК ГруппаФинансовогоУчета,
	|	ЕСТЬNULL(ПорядокУчетаОССрезПоследних.ГруппаФинансовогоУчета.Представление, """") КАК ГруппаФинансовогоУчетаПредставление,
	|	ЕСТЬNULL(ПорядокУчетаОСБУСрезПоследних.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.НеПринятоКУчету)) КАК СостояниеБУ,
	|	ЕСТЬNULL(ПорядокУчетаОСУУСрезПоследних.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.НеПринятоКУчету)) КАК СостояниеУУ,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСУУСрезПоследних.СрокИспользования, 0) КАК СрокИспользованияУУ,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУСрезПоследних.СрокПолезногоИспользованияБУ, 0) КАК СрокИспользованияБУ,
	|	ЕСТЬNULL(ПараметрыАмортизацииОСБУСрезПоследних.СрокПолезногоИспользованияНУ, 0) КАК СрокИспользованияНУ,
	|	МестонахождениеОССрезПоследних.Период КАК ПериодСведенийОМестонахождении,
	|	МестонахождениеОССрезПоследних.Организация КАК Организация,
	|	ЕСТЬNULL(МестонахождениеОССрезПоследних.Организация.Представление, """") КАК ОрганизацияПредставление,
	|	МестонахождениеОССрезПоследних.МОЛ КАК МОЛ,
	|	ЕСТЬNULL(МестонахождениеОССрезПоследних.МОЛ.Представление, """") КАК МОЛПредставление,
	|	МестонахождениеОССрезПоследних.Местонахождение КАК Подразделение,
	|	ЕСТЬNULL(МестонахождениеОССрезПоследних.Местонахождение.Представление, """") КАК ПодразделениеПредставление,
	|	МестонахождениеОССрезПоследних.АдресМестонахождения КАК АдресМестонахождения
	|ИЗ
	|	РегистрСведений.МестонахождениеОС.СрезПоследних(, ОсновноеСредство = &Ссылка) КАК МестонахождениеОССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОС.СрезПоследних(, ОсновноеСредство = &Ссылка) КАК ПервоначальныеСведенияОС
	|		ПО (ПервоначальныеСведенияОС.ОсновноеСредство = МестонахождениеОССрезПоследних.ОсновноеСредство)
	|			И (ПервоначальныеСведенияОС.Организация = МестонахождениеОССрезПоследних.Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаОС.СрезПоследних(, ОсновноеСредство = &Ссылка) КАК ПорядокУчетаОССрезПоследних
	|		ПО (ПорядокУчетаОССрезПоследних.ОсновноеСредство = МестонахождениеОССрезПоследних.ОсновноеСредство)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаОСУУ.СрезПоследних(, ОсновноеСредство = &Ссылка) КАК ПорядокУчетаОСУУСрезПоследних
	|		ПО (ПорядокУчетаОСУУСрезПоследних.ОсновноеСредство = МестонахождениеОССрезПоследних.ОсновноеСредство)
	|			И (ПорядокУчетаОСУУСрезПоследних.Организация = МестонахождениеОССрезПоследних.Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаОСБУ.СрезПоследних(, ОсновноеСредство = &Ссылка) КАК ПорядокУчетаОСБУСрезПоследних
	|		ПО (ПорядокУчетаОСБУСрезПоследних.ОсновноеСредство = МестонахождениеОССрезПоследних.ОсновноеСредство)
	|			И (ПорядокУчетаОСБУСрезПоследних.Организация = МестонахождениеОССрезПоследних.Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСБУ.СрезПоследних(, ОсновноеСредство = &Ссылка) КАК ПараметрыАмортизацииОСБУСрезПоследних
	|		ПО (ПараметрыАмортизацииОСБУСрезПоследних.ОсновноеСредство = МестонахождениеОССрезПоследних.ОсновноеСредство)
	|			И (ПараметрыАмортизацииОСБУСрезПоследних.Организация = МестонахождениеОССрезПоследних.Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСУУ.СрезПоследних(, ОсновноеСредство = &Ссылка) КАК ПараметрыАмортизацииОСУУСрезПоследних
	|		ПО (ПараметрыАмортизацииОСУУСрезПоследних.ОсновноеСредство = МестонахождениеОССрезПоследних.ОсновноеСредство)
	|			И (ПараметрыАмортизацииОСУУСрезПоследних.Организация = МестонахождениеОССрезПоследних.Организация)";

	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ОсновноеСредство);
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СведенияОбУчете = Новый Структура;
	Для каждого КолонкаЗапроса Из Результат.Колонки Цикл
		СведенияОбУчете.Вставить(КолонкаЗапроса.Имя);
	КонецЦикла; 
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(СведенияОбУчете, Выборка);
	
	Возврат СведенияОбУчете;

КонецФункции

// Возвращает сведения об основном средстве.
//
// Параметры:
//  ОсновноеСредство - СправочникСсылка.ОбъектыЭксплуатации	 - Основное средство для которого нужно получить сведения.
//  Период			 - Дата - На какую дату нужно получить сведения.
// 
// Возвращаемое значение:
//  Структура - Содержит сведения об основном средстве.
//
Функция ПервоначальныеСведения(ОсновноеСредство, Период = '000101010000') Экспорт
	
	ПервоначальныеСведения = Новый Структура;
	ПервоначальныеСведения.Вставить("Организация", Неопределено);
	ПервоначальныеСведения.Вставить("Местонахождение", Неопределено);
	ПервоначальныеСведения.Вставить("МОЛ", Неопределено);
	ПервоначальныеСведения.Вставить("ДатаВводаВЭксплуатациюБУ", '000101010000');
	ПервоначальныеСведения.Вставить("ДатаВводаВЭксплуатациюУУ", '000101010000');
	ПервоначальныеСведения.Вставить("ДокументВводаВЭксплуатациюБУ", Неопределено);
	ПервоначальныеСведения.Вставить("ДокументВводаВЭксплуатациюУУ", Неопределено);
	ПервоначальныеСведения.Вставить("СостояниеУУ", Перечисления.СостоянияОС.НеПринятоКУчету);
	ПервоначальныеСведения.Вставить("СостояниеБУ", Перечисления.СостоянияОС.НеПринятоКУчету);
	
	Если НЕ ПравоДоступа("Чтение", Метаданные.РегистрыСведений.МестонахождениеОС)
		ИЛИ НЕ ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПервоначальныеСведенияОС)
		ИЛИ НЕ ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПорядокУчетаОСУУ)
		ИЛИ НЕ ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПорядокУчетаОСБУ) Тогда
		
		Возврат ПервоначальныеСведения;
	КонецЕсли; 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	МестонахождениеОС.Организация,
	|	МестонахождениеОС.Местонахождение,
	|	МестонахождениеОС.МОЛ,
	|	ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ,
	|	ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюУУ,
	|	ПервоначальныеСведенияОС.ДокументВводаВЭксплуатациюБУ,
	|	ПервоначальныеСведенияОС.ДокументВводаВЭксплуатациюУУ,
	|	ПервоначальныеСведенияОС.ДоговорЛизинга,
	|	ЕСТЬNULL(ПорядокУчетаОСУУ.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.НеПринятоКУчету)) КАК СостояниеУУ,
	|	ЕСТЬNULL(ПорядокУчетаОСБУ.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.НеПринятоКУчету)) КАК СостояниеБУ
	|ИЗ
	|	РегистрСведений.МестонахождениеОС.СрезПоследних(&Период, ОсновноеСредство = &Ссылка) КАК МестонахождениеОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОС.СрезПоследних(&Период, ОсновноеСредство = &Ссылка) КАК ПервоначальныеСведенияОС
	|		ПО МестонахождениеОС.ОсновноеСредство = ПервоначальныеСведенияОС.ОсновноеСредство
	|			И МестонахождениеОС.Организация = ПервоначальныеСведенияОС.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаОСУУ.СрезПоследних(&Период, ОсновноеСредство = &Ссылка) КАК ПорядокУчетаОСУУ
	|		ПО МестонахождениеОС.ОсновноеСредство = ПорядокУчетаОСУУ.ОсновноеСредство
	|			И МестонахождениеОС.Организация = ПорядокУчетаОСУУ.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаОСБУ.СрезПоследних(&Период, ОсновноеСредство = &Ссылка) КАК ПорядокУчетаОСБУ
	|		ПО МестонахождениеОС.ОсновноеСредство = ПорядокУчетаОСБУ.ОсновноеСредство
	|			И МестонахождениеОС.Организация = ПорядокУчетаОСБУ.Организация";

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ОсновноеСредство);
	Запрос.УстановитьПараметр("Период", Период);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат ПервоначальныеСведения;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(ПервоначальныеСведения, Выборка);
	
	Возврат ПервоначальныеСведения;

КонецФункции

Функция ПредставлениеСведенийОбУчете(СведенияОбУчете, ВключитьНезаполненные = Истина) Экспорт

	СведенияПринятКУчету1 = Новый Массив;
	СведенияПринятКУчету2 = Новый Массив;
	СведенияСрокИспользования1 = Новый Массив;
	СведенияСрокИспользования2 = Новый Массив;
	СведенияСрокИспользования3 = Новый Массив;
	СведенияСнятСУчета = Новый Массив;
	СведенияГФУ = Новый Массив;
	
	СведенияМестонахождениеОрганизация = Новый Массив;
	СведенияМестонахождениеПодразделение = Новый Массив;
	СведенияМестонахождениеМОЛ = Новый Массив;
	СведенияМестонахождениеАдрес = Новый Массив;
	Период = '000101010000';
	
	#Область ОбщиеСведения
	
	Если СведенияОбУчете <> Неопределено Тогда
		
		ДоступенВыборОтраженияВУчетах = ВнеоборотныеАктивыСлужебный.ДоступенВыборОтраженияВУчетах();
		
		Если СведенияОбУчете.СостояниеУУ = Перечисления.СостоянияОС.ПринятоКУчету
			ИЛИ СведенияОбУчете.СостояниеБУ = Перечисления.СостоянияОС.ПринятоКУчету
			ИЛИ СведенияОбУчете.СостояниеУУ = Перечисления.СостоянияОС.СнятоСУчета
			ИЛИ СведенияОбУчете.СостояниеБУ = Перечисления.СостоянияОС.СнятоСУчета Тогда
		
			Если ЗначениеЗаполнено(СведенияОбУчете.ДатаВводаВЭксплуатациюУУ) 
					И ЗначениеЗаполнено(СведенияОбУчете.ДатаВводаВЭксплуатациюБУ)
					И СведенияОбУчете.ДатаВводаВЭксплуатациюУУ = СведенияОбУчете.ДатаВводаВЭксплуатациюБУ
				ИЛИ ЗначениеЗаполнено(СведенияОбУчете.ДатаВводаВЭксплуатациюУУ) 
					И НЕ ДоступенВыборОтраженияВУчетах Тогда
				
				СведенияПринятКУчету1.Добавить(НСтр("ru = 'Дата принятия к учету:'"));
				СведенияПринятКУчету1.Добавить(" ");
				ДатаДокумента = Формат(СведенияОбУчете.ДатаВводаВЭксплуатациюУУ, "ДЛФ=D");
				Если ЗначениеЗаполнено(СведенияОбУчете.ДокументВводаВЭксплуатациюУУ) Тогда
					СсылкаНаОбъект = ПолучитьНавигационнуюСсылку(СведенияОбУчете.ДокументВводаВЭксплуатациюУУ);
				Иначе
					СсылкаНаОбъект = Неопределено;
				КонецЕсли;
				СведенияПринятКУчету1.Добавить(Новый ФорматированнаяСтрока(ДатаДокумента,,,, СсылкаНаОбъект));
				
			Иначе
				
				Если ДоступенВыборОтраженияВУчетах
					И (СведенияОбУчете.СостояниеУУ <> Перечисления.СостоянияОС.СнятоСУчета 
						ИЛИ ЗначениеЗаполнено(СведенияОбУчете.ДатаВводаВЭксплуатациюБУ)) Тогда
						
					СведенияПринятКУчету1.Добавить(НСтр("ru = 'Дата принятия в регл. учете:'"));
					СведенияПринятКУчету1.Добавить(" ");
					Если ЗначениеЗаполнено(СведенияОбУчете.ДатаВводаВЭксплуатациюБУ) Тогда
						ДатаДокумента = Формат(СведенияОбУчете.ДатаВводаВЭксплуатациюБУ, "ДЛФ=D");
						Если ЗначениеЗаполнено(СведенияОбУчете.ДокументВводаВЭксплуатациюБУ) Тогда
							СсылкаНаОбъект = ПолучитьНавигационнуюСсылку(СведенияОбУчете.ДокументВводаВЭксплуатациюБУ);
						Иначе
							СсылкаНаОбъект = Неопределено;
						КонецЕсли;
						СведенияПринятКУчету1.Добавить(Новый ФорматированнаяСтрока(ДатаДокумента,,,, СсылкаНаОбъект));
					Иначе	
						СведенияПринятКУчету1.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'принять к учету'"),,,, "#Создать"));
					КонецЕсли; 
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СведенияОбУчете.ДатаВводаВЭксплуатациюУУ)
					ИЛИ СведенияОбУчете.ДокументВводаВЭксплуатациюБУ <> Тип("ДокументСсылка.ПоступлениеАрендованныхОС")
						И СведенияОбУчете.СостояниеБУ <> Перечисления.СостоянияОС.СнятоСУчета Тогда
					
					СведенияПринятКУчету2.Добавить(НСтр("ru = 'Дата принятия в упр. учете:'"));
					СведенияПринятКУчету2.Добавить(" ");
					Если ЗначениеЗаполнено(СведенияОбУчете.ДатаВводаВЭксплуатациюУУ) Тогда
						ДатаДокумента = Формат(СведенияОбУчете.ДатаВводаВЭксплуатациюУУ, "ДЛФ=D");
						Если ЗначениеЗаполнено(СведенияОбУчете.ДокументВводаВЭксплуатациюУУ) Тогда
							СсылкаНаОбъект = ПолучитьНавигационнуюСсылку(СведенияОбУчете.ДокументВводаВЭксплуатациюУУ);
						Иначе
							СсылкаНаОбъект = Неопределено;
						КонецЕсли;
						СведенияПринятКУчету2.Добавить(Новый ФорматированнаяСтрока(ДатаДокумента,,,, СсылкаНаОбъект));
					Иначе
						СведенияПринятКУчету2.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'принять к учету'"),,,, "#Создать"));
					КонецЕсли; 
				КонецЕсли; 
				
			КонецЕсли;
			
			СрокИспользованияУУ = ВнеоборотныеАктивы.РасшифровкаСрокаПолезногоИспользования(СведенияОбУчете.СрокИспользованияУУ);
			СрокИспользованияБУ = ВнеоборотныеАктивы.РасшифровкаСрокаПолезногоИспользования(СведенияОбУчете.СрокИспользованияБУ);
			СрокИспользованияНУ = ВнеоборотныеАктивы.РасшифровкаСрокаПолезногоИспользования(СведенияОбУчете.СрокИспользованияНУ);
			
			Если СведенияОбУчете.СрокИспользованияБУ = СведенияОбУчете.СрокИспользованияНУ
					И СведенияОбУчете.СрокИспользованияБУ = СведенияОбУчете.СрокИспользованияУУ 
					И СведенияОбУчете.СрокИспользованияУУ <> 0
				ИЛИ СведенияОбУчете.СрокИспользованияУУ <> 0
					И СведенияОбУчете.СрокИспользованияБУ = 0
					И СведенияОбУчете.СрокИспользованияБУ = 0 Тогда
				
				СведенияСрокИспользования1.Добавить(СтрШаблон(НСтр("ru = 'Срок использования: %1'"), СрокИспользованияУУ));
				
			ИначеЕсли СведенияОбУчете.СрокИспользованияБУ <> 0
				И СведенияОбУчете.СрокИспользованияУУ = 0
				И (СведенияОбУчете.СрокИспользованияНУ = 0
					ИЛИ СведенияОбУчете.СрокИспользованияНУ = СведенияОбУчете.СрокИспользованияБУ) Тогда
					
				СведенияСрокИспользования1.Добавить(СтрШаблон(НСтр("ru = 'Срок использования: %1'"), СрокИспользованияБУ));
				
			ИначеЕсли СведенияОбУчете.СрокИспользованияНУ <> 0
				И СведенияОбУчете.СрокИспользованияУУ = 0
				И (СведенияОбУчете.СрокИспользованияБУ = 0
					ИЛИ СведенияОбУчете.СрокИспользованияБУ = СведенияОбУчете.СрокИспользованияНУ) Тогда				
					
				СведенияСрокИспользования1.Добавить(СтрШаблон(НСтр("ru = 'Срок использования: %1'"), СрокИспользованияНУ));
				
			Иначе
				
				Если СведенияОбУчете.СрокИспользованияБУ <> 0 Тогда
					СведенияСрокИспользования1.Добавить(СтрШаблон(НСтр("ru = 'Срок использования (БУ):  %1'"), СрокИспользованияБУ));
				КонецЕсли;
				Если СведенияОбУчете.СрокИспользованияНУ <> 0 Тогда
					СведенияСрокИспользования2.Добавить(СтрШаблон(НСтр("ru = 'Срок использования (НУ):  %1'"), СрокИспользованияНУ));
				КонецЕсли;
				Если СведенияОбУчете.СрокИспользованияУУ <> 0 Тогда
					СведенияСрокИспользования3.Добавить(СтрШаблон(НСтр("ru = 'Срок использования (УУ):  %1'"), СрокИспользованияУУ));
				КонецЕсли;
				
			КонецЕсли;
				
			//
			Если СведенияОбУчете.СостояниеУУ = Перечисления.СостоянияОС.СнятоСУчета
				ИЛИ СведенияОбУчете.СостояниеБУ = Перечисления.СостоянияОС.СнятоСУчета Тогда
				СведенияСнятСУчета.Добавить(НСтр("ru = 'Дата снятия с учета:'"));
				СведенияСнятСУчета.Добавить(" ");
				ДатаДокумента = Формат(СведенияОбУчете.ДатаСнятияСУчета, "ДЛФ=D");
				Если ЗначениеЗаполнено(СведенияОбУчете.ДокументСнятияСУчета) Тогда
					СсылкаНаОбъект = ПолучитьНавигационнуюСсылку(СведенияОбУчете.ДокументСнятияСУчета);
					СведенияСнятСУчета.Добавить(Новый ФорматированнаяСтрока(ДатаДокумента,,,, СсылкаНаОбъект));
				Иначе
					СведенияСнятСУчета.Добавить(ДатаДокумента);
				КонецЕсли;
			КонецЕсли; 
			
			СведенияГФУ.Добавить(НСтр("ru = 'Группа финансового учета:'"));
			СведенияГФУ.Добавить(" ");
			Если ЗначениеЗаполнено(СведенияОбУчете.ГруппаФинансовогоУчета) Тогда
				СсылкаНаОбъект = ПолучитьНавигационнуюСсылку(СведенияОбУчете.ГруппаФинансовогоУчета);
			Иначе
				СсылкаНаОбъект = Неопределено;
			КонецЕсли;
			СведенияГФУ.Добавить(Новый ФорматированнаяСтрока(СведенияОбУчете.ГруппаФинансовогоУчетаПредставление,,,, СсылкаНаОбъект));
		
		ИначеЕсли СведенияОбУчете.СостояниеБУ = Перечисления.СостоянияОС.ПринятоКЗабалансовомуУчету
			ИЛИ СведенияОбУчете.СостояниеУУ = Перечисления.СостоянияОС.ПринятоКЗабалансовомуУчету Тогда
			
			СведенияПринятКУчету1.Добавить(НСтр("ru = 'Дата принятия к забалансовому учету:'"));
			СведенияПринятКУчету1.Добавить(" ");
			ДатаДокумента = Формат(СведенияОбУчете.ДатаВводаВЭксплуатациюБУ, "ДЛФ=D");
			Если ЗначениеЗаполнено(СведенияОбУчете.ДокументВводаВЭксплуатациюБУ) Тогда
				СсылкаНаОбъект = ПолучитьНавигационнуюСсылку(СведенияОбУчете.ДокументВводаВЭксплуатациюБУ);
			Иначе
				СсылкаНаОбъект = Неопределено;
			КонецЕсли;
			СведенияПринятКУчету1.Добавить(Новый ФорматированнаяСтрока(ДатаДокумента,,,, СсылкаНаОбъект));
			
		КонецЕсли; 
		
	Иначе
		СведенияПринятКУчету1.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Принять к учету'"),,,, "#Создать"));
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Местонахождение
	
	Если СведенияОбУчете <> Неопределено Тогда
		
		Период = СведенияОбУчете.ПериодСведенийОМестонахождении; 
		
		СведенияМестонахождениеОрганизация.Добавить(СтрШаблон(НСтр("ru = 'Организация: %1'"), СведенияОбУчете.ОрганизацияПредставление));
		СведенияМестонахождениеПодразделение.Добавить(СтрШаблон(НСтр("ru = 'Подразделение: %1'"), СведенияОбУчете.ПодразделениеПредставление));
		
		СведенияМестонахождениеМОЛ.Добавить(НСтр("ru = 'МОЛ:'"));
		СведенияМестонахождениеМОЛ.Добавить(" ");
		Если ЗначениеЗаполнено(СведенияОбУчете.МОЛ) Тогда
			СсылкаНаОбъект = ПолучитьНавигационнуюСсылку(СведенияОбУчете.МОЛ);
			СведенияМестонахождениеМОЛ.Добавить(Новый ФорматированнаяСтрока(СведенияОбУчете.МОЛПредставление,,,, СсылкаНаОбъект));
		ИначеЕсли ВключитьНезаполненные Тогда
			СведенияМестонахождениеМОЛ.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'не указан'"),, ЦветаСтиля.НезаполненноеПолеТаблицы));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СведенияОбУчете.АдресМестонахождения) Тогда
			СведенияМестонахождениеАдрес.Добавить(НСтр("ru = 'Адрес:'"));
			СведенияМестонахождениеАдрес.Добавить(" ");
			СведенияМестонахождениеАдрес.Добавить(СведенияОбУчете.АдресМестонахождения);
			СведенияМестонахождениеАдрес.Добавить(" ");
			СведенияМестонахождениеАдрес.Добавить(Новый ФорматированнаяСтрока(БиблиотекаКартинок.ПоказатьНаКарте,,,, СведенияОбУчете.АдресМестонахождения));
		ИначеЕсли ВключитьНезаполненные Тогда
			СведенияМестонахождениеАдрес.Добавить(НСтр("ru = 'Адрес:'"));
			СведенияМестонахождениеАдрес.Добавить(" ");
			СведенияМестонахождениеАдрес.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'не указан'"),, ЦветаСтиля.НезаполненноеПолеТаблицы));
		КонецЕсли; 
		
	КонецЕсли; 
	
	#КонецОбласти
	
	ПредставлениеСведений = Новый Структура;
	ПредставлениеСведений.Вставить("Период", Период);
	ПредставлениеСведений.Вставить("СведенияПринятКУчету1", СведенияПринятКУчету1);
	ПредставлениеСведений.Вставить("СведенияПринятКУчету2", СведенияПринятКУчету2);
	ПредставлениеСведений.Вставить("СведенияСрокИспользования1", СведенияСрокИспользования1);
	ПредставлениеСведений.Вставить("СведенияСрокИспользования2", СведенияСрокИспользования2);
	ПредставлениеСведений.Вставить("СведенияСрокИспользования3", СведенияСрокИспользования3);
	ПредставлениеСведений.Вставить("СведенияСнятСУчета", СведенияСнятСУчета);
	ПредставлениеСведений.Вставить("СведенияГФУ", СведенияГФУ);
	ПредставлениеСведений.Вставить("СведенияМестонахождениеОрганизация", СведенияМестонахождениеОрганизация);
	ПредставлениеСведений.Вставить("СведенияМестонахождениеПодразделение", СведенияМестонахождениеПодразделение);
	ПредставлениеСведений.Вставить("СведенияМестонахождениеМОЛ", СведенияМестонахождениеМОЛ);
	ПредставлениеСведений.Вставить("СведенияМестонахождениеАдрес", СведенияМестонахождениеАдрес);
	
	Возврат ПредставлениеСведений;

КонецФункции
 
// Возвращает имена блокруемых реквизитов для механизма блокирования реквизитов БСП
//
// Возвращаемое значание:
// 		Массив - имена блокируемых реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ГруппаОС");
	Результат.Добавить("АмортизационнаяГруппа");
	Результат.Добавить("НаправлениеДеятельности");
	Результат.Добавить("ШифрПоЕНАОФ");
	Результат.Добавить("КодПоОКОФ");
	Результат.Добавить("ГруппаОСМеждународныйУчет");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаВыбора" 
		И ВнеоборотныеАктивыВызовСервера.ДоступенВыборОбъектовЭксплуатации2_4(Параметры) Тогда
		
		// В концепции 2.4 своя форма выбора
		ВыбраннаяФорма = "ФормаВыбора2_4";
		СтандартнаяОбработка = Ложь;
		Возврат;

	КонецЕсли;
	
	Если ВидФормы = "ФормаВыбора" Тогда
		
		Если Не Параметры.Свойство("Отбор") Тогда
			Параметры.Вставить("Отбор", Новый Структура);
		КонецЕсли;
		
		
		Если Параметры.Отбор.Свойство("ГруппаОС") Тогда
			Параметры.Отбор.Вставить("БУГруппаОС", Параметры.Отбор.ГруппаОС);
		ИначеЕсли Параметры.Свойство("БУГруппаОС") Тогда
			Параметры.Отбор.Вставить("ГруппаОС", Параметры.Отбор.БУГруппаОС);
		КонецЕсли;
		Если Параметры.Отбор.Свойство("АмортизационнаяГруппа") Тогда
			Параметры.Отбор.Вставить("БУАмортизационнаяГруппа", Параметры.Отбор.АмортизационнаяГруппа);
		ИначеЕсли Параметры.Свойство("БУАмортизационнаяГруппа") Тогда
			Параметры.Отбор.Вставить("АмортизационнаяГруппа", Параметры.Отбор.БУАмортизационнаяГруппа);
		КонецЕсли;
		
		Если Параметры.Свойство("ДоговорЛизинга") И ЗначениеЗаполнено(Параметры.ДоговорЛизинга) Тогда
			Параметры.Отбор.Вставить("НаправлениеДеятельности", ВнеоборотныеАктивыВызовСервера.НаправлениеДеятельности(Параметры.ДоговорЛизинга));
		КонецЕсли;
		
		Если Параметры.Свойство("ВариантПримененияЦелевогоФинансирования")
			И Параметры.ВариантПримененияЦелевогоФинансирования = ПредопределенноеЗначение("Перечисление.ВариантыПримененияЦелевогоФинансирования.НеИспользуется") Тогда
			Параметры.Отбор.Удалить("НаправлениеДеятельности");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ДанныеВыбора = ВнеоборотныеАктивыВызовСервера.ДанныеВыбораОбъектовЭксплуатации(Параметры, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеЗапросаДляВыбора(Параметры, УстановитьВсеОтборы = Ложь) Экспорт

	Если Параметры.Свойство("Контекст") Тогда
		ДоступныеКонтексты = Новый Структура(Параметры.Контекст);
	Иначе
		ДоступныеКонтексты = Новый Структура("БУ,УУ"); // По умолчанию доступны все контексты.
	КонецЕсли;
	
	ОтборСписка = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отбор", Новый Структура);
	
	Если ОтборСписка.Свойство("ОтражатьВРеглУчете")
		И НЕ ОтборСписка.ОтражатьВРеглУчете
		И ДоступныеКонтексты.Свойство("БУ") Тогда
		ДоступныеКонтексты.Удалить("БУ"); // Доступен выбор отражения в учете и в регл. учете нет отражения.
	КонецЕсли; 
	
	Если ОтборСписка.Свойство("ОтражатьВУпрУчете")
		И НЕ ОтборСписка.ОтражатьВУпрУчете
		И ДоступныеКонтексты.Свойство("УУ") Тогда
		ДоступныеКонтексты.Удалить("УУ"); // Доступен выбор отражения в учете и в упр. учете нет отражения.
	КонецЕсли; 
	
	Если ОтборСписка.Свойство("АмортизационнаяГруппа") Тогда
		Если ЗначениеЗаполнено(ОтборСписка.АмортизационнаяГруппа) Тогда
			СписокВыбора = Новый Массив;
			СписокВыбора.Добавить(ОтборСписка.АмортизационнаяГруппа);
			СписокВыбора.Добавить(Перечисления.АмортизационныеГруппы.ПустаяСсылка());
			ОтборСписка.Вставить("АмортизационнаяГруппа", СписокВыбора);
		Иначе
			ОтборСписка.Удалить("АмортизационнаяГруппа");
		КонецЕсли; 
	КонецЕсли; 
	
	Если ОтборСписка.Свойство("ГруппаОС") Тогда
		Если ЗначениеЗаполнено(ОтборСписка.ГруппаОС) Тогда
			СписокВыбора = Новый Массив;
			СписокВыбора.Добавить(ОтборСписка.ГруппаОС);
			СписокВыбора.Добавить(Перечисления.ГруппыОС.ПустаяСсылка());
			ОтборСписка.Вставить("ГруппаОС", СписокВыбора);
		Иначе
			ОтборСписка.Удалить("ГруппаОС");
		КонецЕсли; 
	КонецЕсли; 
	
	Если Параметры.Свойство("ВариантПримененияЦелевогоФинансирования")
		И Параметры.ВариантПримененияЦелевогоФинансирования = Перечисления.ВариантыПримененияЦелевогоФинансирования.НеИспользуется Тогда
		ОтборСписка.Удалить("НаправлениеДеятельности");
	КонецЕсли;
	
	Если НЕ ПравоДоступа("Чтение", Метаданные.РегистрыСведений.МестонахождениеОС) Тогда
		ОтборСписка.Удалить("Подразделение");
		ОтборСписка.Удалить("Организация");
		ОтборСписка.Удалить("МОЛ");
	КонецЕсли;
	
	ДополнительныеПоля = "";
	ТекстСоединения = "";
	ТекстОтборы = "";
	ПараметрыЗапроса = Новый Структура;
	ДоступныеПоля = Новый Массив;
	
	Если (ДоступныеКонтексты.Свойство("БУ") ИЛИ ДоступныеКонтексты.Свойство("УУ"))
		И ПравоДоступа("Чтение", Метаданные.РегистрыСведений.МестонахождениеОС) Тогда
		
		ПолеОрганизация = "ЕСТЬNULL(МестонахождениеОС.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))";
		ПолеМОЛ = "ЕСТЬNULL(МестонахождениеОС.МОЛ, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))";
		ПолеПодразделение = "ЕСТЬNULL(МестонахождениеОС.Местонахождение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))";
		ПолеАдресМестонахождения = "ЕСТЬNULL(МестонахождениеОС.АдресМестонахождения, """""""")";
		
		ТекстСоединения = ТекстСоединения + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОС.СрезПоследних(//ПАРАМЕТРЫ_СРЕЗАПОСЛЕДНИХ//) КАК МестонахождениеОС
		|		ПО СправочникОбъектыЭксплуатации.Ссылка = МестонахождениеОС.ОсновноеСредство";
		
	Иначе
		
		ПолеОрганизация = "ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";
		ПолеМОЛ = "ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)";
		ПолеПодразделение = "ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)";
		ПолеАдресМестонахождения = """""";
		
	КонецЕсли;
	
	Если (ДоступныеКонтексты.Свойство("БУ") ИЛИ ДоступныеКонтексты.Свойство("УУ"))
		И ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПорядокУчетаОС) Тогда
		
		ПолеГФУ = "ЕСТЬNULL(ПорядокУчетаОС.ГруппаФинансовогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаВнеоборотныхАктивов.ПустаяСсылка))";
		
		ТекстСоединения = ТекстСоединения + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаОС.СрезПоследних(//ПАРАМЕТРЫ_СРЕЗАПОСЛЕДНИХ//) КАК ПорядокУчетаОС
		|		ПО СправочникОбъектыЭксплуатации.Ссылка = ПорядокУчетаОС.ОсновноеСредство";
		
	Иначе
		
		ПолеГФУ = "ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаВнеоборотныхАктивов.ПустаяСсылка)";
		
	КонецЕсли;
	
	ДополнительныеПоля = ДополнительныеПоля + "
		|,%1 КАК Организация
		|,%2 КАК МОЛ
		|,%3 КАК Подразделение
		|,%4 КАК АдресМестонахождения
		|,%5 КАК ГруппаФинансовогоУчета";
	
	ДополнительныеПоля = СтрШаблон(ДополнительныеПоля, ПолеОрганизация, ПолеМОЛ, ПолеПодразделение, ПолеАдресМестонахождения, ПолеГФУ);
	
	Если ДоступныеКонтексты.Свойство("БУ") 
		И ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПорядокУчетаОСБУ) Тогда
		
		ДоступныеПоля.Добавить("СостояниеБУ");
		ДополнительныеПоля = ДополнительныеПоля + "
			|,ЕСТЬNULL(ПорядокУчетаОСБУ.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.НеПринятоКУчету)) КАК СостояниеБУ";
		
		ТекстСоединения = ТекстСоединения + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаОСБУ.СрезПоследних(//ПАРАМЕТРЫ_СРЕЗАПОСЛЕДНИХ//) КАК ПорядокУчетаОСБУ
		|		ПО СправочникОбъектыЭксплуатации.Ссылка = ПорядокУчетаОСБУ.ОсновноеСредство
		|			И ПорядокУчетаОСБУ.Организация = МестонахождениеОС.Организация";
		
	Иначе
		
		ДополнительныеПоля = ДополнительныеПоля + ",ЗНАЧЕНИЕ(Перечисление.СостоянияОС.НеПринятоКУчету) КАК СостояниеБУ";
		
	КонецЕсли; 
	
	Если ДоступныеКонтексты.Свойство("УУ")
		И ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПорядокУчетаОСУУ) Тогда
		
		ДополнительныеПоля = ДополнительныеПоля + "
			|,ЕСТЬNULL(ПорядокУчетаОСУУ.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.НеПринятоКУчету)) КАК СостояниеУУ";
		
		ТекстСоединения = ТекстСоединения + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаОСУУ.СрезПоследних(//ПАРАМЕТРЫ_СРЕЗАПОСЛЕДНИХ//) КАК ПорядокУчетаОСУУ
		|		ПО СправочникОбъектыЭксплуатации.Ссылка = ПорядокУчетаОСУУ.ОсновноеСредство
		|			И ПорядокУчетаОСУУ.Организация = МестонахождениеОС.Организация";
		
		
	Иначе
		
		ДополнительныеПоля = ДополнительныеПоля + ",ЗНАЧЕНИЕ(Перечисление.СостоянияОС.НеПринятоКУчету) КАК СостояниеУУ";
		
	КонецЕсли;
	
	ПараметрыСрезаПоследних = "";
	Если Параметры.Свойство("ДатаСведений") Тогда
		ПараметрыСрезаПоследних = "&ДатаСведений";
		ПараметрыЗапроса.Вставить("ДатаСведений", КонецДня(Параметры.ДатаСведений));
	КонецЕсли; 
	Если Параметры.Свойство("ТекущийРегистратор") Тогда
		ПараметрыСрезаПоследних = ПараметрыСрезаПоследних 
			+ ",Регистратор <> &ТекущийРегистратор";
		ПараметрыЗапроса.Вставить("ТекущийРегистратор", Параметры.ТекущийРегистратор);
	КонецЕсли; 
	ТекстСоединения = СтрЗаменить(ТекстСоединения, "//ПАРАМЕТРЫ_СРЕЗАПОСЛЕДНИХ//", ПараметрыСрезаПоследних);
	
	ДоступенВыборУчета = ОтборСписка.Свойство("ОтражатьВРеглУчете") ИЛИ ОтборСписка.Свойство("ОтражатьВУпрУчете");
	
	Если ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПорядокУчетаОСУУ) 
		И ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПорядокУчетаОСБУ) Тогда
		
		Если ОтборСписка.Свойство("Состояние") Тогда
				
			Если ДоступныеКонтексты.Свойство("БУ") И ДоступныеКонтексты.Свойство("УУ") Тогда
				Если ДоступенВыборУчета Тогда
					ТекстОтборы = "
					|	ЕСТЬNULL(ПорядокУчетаОСБУ.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.НеПринятоКУчету)) В(&Состояние)
					|	И ЕСТЬNULL(ПорядокУчетаОСУУ.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.НеПринятоКУчету)) В(&Состояние)";
				Иначе
					ТекстОтборы = "
					|	(ЕСТЬNULL(ПорядокУчетаОСБУ.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.НеПринятоКУчету)) В(&Состояние)
					|		ИЛИ ЕСТЬNULL(ПорядокУчетаОСУУ.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.НеПринятоКУчету)) В(&Состояние))";
				КонецЕсли; 
			ИначеЕсли ДоступныеКонтексты.Свойство("БУ") Тогда
				ТекстОтборы = "
				|	ЕСТЬNULL(ПорядокУчетаОСБУ.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.НеПринятоКУчету)) В(&Состояние)";
			ИначеЕсли ДоступныеКонтексты.Свойство("УУ") Тогда
				ТекстОтборы = "
				|	ЕСТЬNULL(ПорядокУчетаОСУУ.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.НеПринятоКУчету)) В(&Состояние)";
			КонецЕсли;
			Если ТипЗнч(ОтборСписка.Состояние) = Тип("ФиксированныйМассив") Тогда
				ПараметрыЗапроса.Вставить("Состояние", Новый Массив(ОтборСписка.Состояние));
			Иначе
				ПараметрыЗапроса.Вставить("Состояние", ОтборСписка.Состояние);
			КонецЕсли;
			Параметры.Отбор.Удалить("Состояние");
			
		Иначе
			
			Если ДоступныеКонтексты.Свойство("БУ") И ДоступныеКонтексты.Свойство("УУ") Тогда
				ТекстОтборы = "
				|	(ЕСТЬNULL(ПорядокУчетаОСБУ.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.НеПринятоКУчету)) = &Состояние
				|		ИЛИ ЕСТЬNULL(ПорядокУчетаОСУУ.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.НеПринятоКУчету)) = &Состояние
				|		ИЛИ &Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПустаяСсылка))";
			ИначеЕсли ДоступныеКонтексты.Свойство("БУ") Тогда
				ТекстОтборы = "
				|	(ЕСТЬNULL(ПорядокУчетаОСБУ.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.НеПринятоКУчету)) = &Состояние
				|		ИЛИ &Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПустаяСсылка))";
			ИначеЕсли ДоступныеКонтексты.Свойство("УУ") Тогда
				ТекстОтборы = "
				|	(ЕСТЬNULL(ПорядокУчетаОСУУ.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.НеПринятоКУчету)) = &Состояние
				|		ИЛИ &Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПустаяСсылка))";
			КонецЕсли;
			Если ТекстОтборы <> "" Тогда
				ПараметрыЗапроса.Вставить("Состояние", Перечисления.СостоянияОС.ПустаяСсылка());
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Если УстановитьВсеОтборы Тогда
		
		Для каждого КлючИЗначение Из ОтборСписка Цикл
			
			Если НЕ ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
				Продолжить;
			КонецЕсли;
			
			Если КлючИЗначение.Ключ = "Организация" Тогда
				ПутьКПолю = ПолеОрганизация;
			ИначеЕсли КлючИЗначение.Ключ = "Подразделение" Тогда
				ПутьКПолю = ПолеПодразделение;
			ИначеЕсли КлючИЗначение.Ключ = "МОЛ" Тогда
				ПутьКПолю = ПолеМОЛ;
			ИначеЕсли КлючИЗначение.Ключ = "АмортизационнаяГруппа"
				ИЛИ КлючИЗначение.Ключ = "ГруппаОС"
				ИЛИ КлючИЗначение.Ключ = "НаправлениеДеятельности" Тогда
				
				ПутьКПолю = "СправочникОбъектыЭксплуатации." + КлючИЗначение.Ключ;
			Иначе
				Продолжить;
			КонецЕсли;
			
			ЭтоМассив = ТипЗнч(КлючИЗначение.Значение) = Тип("ФиксированныйМассив") 
						ИЛИ ТипЗнч(КлючИЗначение.Значение) = Тип("Массив");
						
			ТекстОтборы = ТекстОтборы 
							+ Символы.ПС 
							+ ?(ТекстОтборы <> "", "И ","")
							+ ПутьКПолю 
							+ ?(ЭтоМассив, " В (&" + КлючИЗначение.Ключ + ")", " = &" + КлючИЗначение.Ключ);
							
			ПараметрыЗапроса.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла; 
		
	КонецЕсли; 
	
	ТекстПервые = "";
	Если Параметры.Свойство("СтрокаПоиска") Тогда
		ТекстОтборы = ТекстОтборы + "
		|" + ?(ТекстОтборы <> "", "И ","")
		+ "СправочникОбъектыЭксплуатации.Наименование ПОДОБНО &СтрокаПоиска
			|	И НЕ СправочникОбъектыЭксплуатации.ЭтоГруппа
			|	И НЕ СправочникОбъектыЭксплуатации.ПометкаУдаления";
		ТекстПервые = "РАЗРЕШЕННЫЕ ПЕРВЫЕ 10";
		ПараметрыЗапроса.Вставить("СтрокаПоиска", "%" + Параметры.СтрокаПоиска + "%");
	КонецЕсли;
	
	Если ТекстОтборы <> "" Тогда
		ТекстОтборы = "
		|ГДЕ
		|" + ТекстОтборы;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ //ПЕРВЫЕ//
	|	СправочникОбъектыЭксплуатации.Ссылка,
	|	СправочникОбъектыЭксплуатации.ПометкаУдаления,
	|	СправочникОбъектыЭксплуатации.Родитель,
	|	СправочникОбъектыЭксплуатации.ЭтоГруппа,
	|	СправочникОбъектыЭксплуатации.Код,
	|	СправочникОбъектыЭксплуатации.Наименование,
	|	СправочникОбъектыЭксплуатации.ИнвентарныйНомер,
	|	СправочникОбъектыЭксплуатации.ГруппаОС,
	|	СправочникОбъектыЭксплуатации.ГруппаОСМеждународныйУчет,
	|	СправочникОбъектыЭксплуатации.КодПоОКОФ,
	|	СправочникОбъектыЭксплуатации.ШифрПоЕНАОФ,
	|	СправочникОбъектыЭксплуатации.ДатаВыпуска,
	|	СправочникОбъектыЭксплуатации.ЗаводскойНомер,
	|	СправочникОбъектыЭксплуатации.Изготовитель,
	|	СправочникОбъектыЭксплуатации.Класс,
	|	СправочникОбъектыЭксплуатации.Модель,
	|	СправочникОбъектыЭксплуатации.НаименованиеПолное,
	|	СправочникОбъектыЭксплуатации.НомерПаспорта,
	|	СправочникОбъектыЭксплуатации.ОбъектБытовогоНазначения,
	|	СправочникОбъектыЭксплуатации.Подкласс,
	|	СправочникОбъектыЭксплуатации.Расположение,
	|	СправочникОбъектыЭксплуатации.РемонтирующееПодразделение,
	|	СправочникОбъектыЭксплуатации.СерийныйНомер,
	|	СправочникОбъектыЭксплуатации.Статус,
	|	СправочникОбъектыЭксплуатации.НаправлениеДеятельности,
	|	СправочникОбъектыЭксплуатации.АмортизационнаяГруппа,
	|	СправочникОбъектыЭксплуатации.Комментарий
	|	//ДОПОЛНИТЕЛЬНЫЕ_ПОЛЯ//
	|ИЗ
	|	Справочник.ОбъектыЭксплуатации КАК СправочникОбъектыЭксплуатации
	|	//СОЕДИНЕНИЯ//
	|	//ОТБОРЫ//";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДОПОЛНИТЕЛЬНЫЕ_ПОЛЯ//", ДополнительныеПоля);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//СОЕДИНЕНИЯ//", ТекстСоединения);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ОТБОРЫ//", ТекстОтборы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ПЕРВЫЕ//", ТекстПервые);

	Возврат Новый Структура("ТекстЗапроса,ПараметрыЗапроса,ДоступныеПоля", ТекстЗапроса, ПараметрыЗапроса, ДоступныеПоля);
	
КонецФункции


#Область ПодключаемыеКоманды

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Если ПравоДоступа("Изменение", Метаданные.Справочники.ОбъектыЭксплуатации)
		И ПолучитьФункциональнуюОпцию("ИспользоватьРеглУчет") Тогда
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Обработка.ПечатьОС1";
		КомандаПечати.Идентификатор = "ДА2";
		КомандаПечати.Представление = НСтр("ru = 'ДА-2 (Инвентарная карточка)'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		КомандаПечати.СписокФорм = "ФормаЭлемента,ФормаСпискаБУ";
		
	КонецЕсли;
	
КонецПроцедуры

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Команда = Документы.ПринятиеКУчетуОС.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		Команда.ВидимостьВФормах = "ФормаЭлемента, ФормаСпискаБУ";
		Команда.РежимЗаписи = "";
	КонецЕсли;
	
	Команда = Документы.ПринятиеКУчетуОС2_4.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		Команда.ВидимостьВФормах = "ФормаЭлемента, ФормаСпискаБУ";
		Команда.РежимЗаписи = "";
	КонецЕсли;
	
	Команда = Документы.ИзменениеСостоянияОС.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		Команда.ВидимостьВФормах = "ФормаЭлемента, ФормаСпискаБУ";
		Команда.РежимЗаписи = "";
	КонецЕсли;
	
	Команда = Документы.ИзменениеПараметровОС.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		Команда.ВидимостьВФормах = "ФормаЭлемента, ФормаСпискаБУ";
		Команда.РежимЗаписи = "";
	КонецЕсли;
	
	Команда = Документы.ИзменениеПараметровОС2_4.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		Команда.ВидимостьВФормах = "ФормаЭлемента, ФормаСпискаБУ";
		Команда.РежимЗаписи = "";
	КонецЕсли;
	
	Команда = Документы.МодернизацияОС2_4.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		Команда.ВидимостьВФормах = "ФормаЭлемента, ФормаСпискаБУ";
		Команда.РежимЗаписи = "";
	КонецЕсли;
	
	Команда = Документы.ПереоценкаОС2_4.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		Команда.ВидимостьВФормах = "ФормаЭлемента, ФормаСпискаБУ";
		Команда.РежимЗаписи = "";
	КонецЕсли;
	
	Команда = Документы.ПеремещениеОС2_4.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		Команда.ВидимостьВФормах = "ФормаЭлемента, ФормаСпискаБУ";
		Команда.РежимЗаписи = "";
	КонецЕсли;
	
	Команда = Документы.ПодготовкаКПередачеОС2_4.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		Команда.ВидимостьВФормах = "ФормаЭлемента, ФормаСпискаБУ";
		Команда.РежимЗаписи = "";
	КонецЕсли;
	
	Команда = Документы.ПередачаОСАрендатору2_4.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		Команда.ВидимостьВФормах = "ФормаЭлемента, ФормаСпискаБУ";
		Команда.РежимЗаписи = "";
	КонецЕсли;
	
	Команда = Документы.ВозвратОСОтАрендатора2_4.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		Команда.ВидимостьВФормах = "ФормаЭлемента, ФормаСпискаБУ";
		Команда.РежимЗаписи = "";
	КонецЕсли;
	
	Команда = Документы.СписаниеОС.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		Команда.ВидимостьВФормах = "ФормаЭлемента, ФормаСпискаБУ";
		Команда.РежимЗаписи = "";
	КонецЕсли;
	
	Команда = Документы.СписаниеОС2_4.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		Команда.ВидимостьВФормах = "ФормаЭлемента, ФормаСпискаБУ";
		Команда.РежимЗаписи = "";
	КонецЕсли;
	
	Команда = Документы.РегистрацияНаработок.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		Команда.ВидимостьВФормах = "ФормаЭлемента, ФормаСписка, ФормаСпискаБУ";
		Команда.РежимЗаписи = "";
	КонецЕсли;
	
	
КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	Возврат; // В КА обработчик пустой
	
КонецПроцедуры

#КонецОбласти

#Область Печать

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОС6") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ОС6",
			НСтр("ru = 'Инвентарная карточка ОС (ОС-6)'"),
			ПечатьОС6_2003(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьОС6_2003(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОсновныеСредства_ОС6";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.ОбъектыЭксплуатации.ПФ_MXL_ОС6");
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ШапкаРазделов1и2 = Макет.ПолучитьОбласть("ШапкаРазделов1и2");
	ШапкаРаздела3 = Макет.ПолучитьОбласть("ШапкаРаздела3");
	СтрокиРаздела3 = Макет.ПолучитьОбласть("СтрокиРаздела3");
	ШапкаРаздела4 = Макет.ПолучитьОбласть("ШапкаРаздела4");
	СтрокаРаздела4 = Макет.ПолучитьОбласть("СтрокаРаздела4");
	ПодвалСтраницы1 = Макет.ПолучитьОбласть("ПодвалСтраницы1");
	ШапкаРазделов5и6 = Макет.ПолучитьОбласть("ШапкаРазделов5и6");
	СтрокаРазделов5и6 = Макет.ПолучитьОбласть("СтрокаРазделов5и6");
	ШапкаРаздела7_1 = Макет.ПолучитьОбласть("ШапкаРаздела7_1");
	СтрокиРаздела7_1 = Макет.ПолучитьОбласть("СтрокиРаздела7_1");
	ШапкаРаздела7_2 = Макет.ПолучитьОбласть("ШапкаРаздела7_2");
	ПодвалСтраницы2 = Макет.ПолучитьОбласть("ПодвалСтраницы2");
	
	Если ПараметрыПечати.Свойство("ДатаСведений") Тогда
		ДатаСведений = ПараметрыПечати.ДатаСведений;
	Иначе
		ДатаСведений = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ТаблицаОбъектов = Новый ТаблицаЗначений;
	ТаблицаОбъектов.Колонки.Добавить("ОС", Новый ОписаниеТипов("СправочникСсылка.ОбъектыЭксплуатации"));
	ТаблицаОбъектов.Колонки.Добавить("Номер", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	НомерСтроки = 1;
	Для каждого ОС Из МассивОбъектов Цикл
		СтрокаТаблицы = ТаблицаОбъектов.Добавить();
		СтрокаТаблицы.ОС = ОС;
		СтрокаТаблицы.Номер = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаОбъектов", ТаблицаОбъектов);
	Запрос.УстановитьПараметр("ДатаСведений", ДатаСведений);
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ВидСобытияПереоценки", Перечисления.ВидыСобытийОС.Переоценка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаОС.ОС КАК ОС,
	|	ТаблицаОС.Номер КАК Порядок
	|ПОМЕСТИТЬ ТаблицаОС
	|ИЗ
	|	&ТаблицаОбъектов КАК ТаблицаОС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияПоОрганизации.ОсновноеСредство КАК ОС,
	|	СведенияПоОрганизации.Организация КАК Организация,
	|	ЕСТЬNULL(ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ, ДАТАВРЕМЯ(1,1,1)) КАК ДатаВводаВЭксплуатациюБУ
	|ПОМЕСТИТЬ СведенияПоОрганизации
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(&ДатаСведений, ОсновноеСредство В (&МассивОбъектов)) КАК СведенияПоОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОС.СрезПоследних(&ДатаСведений, ОсновноеСредство В (&МассивОбъектов)) КАК ПервоначальныеСведенияОС
	|		ПО СведенияПоОрганизации.ОсновноеСредство = ПервоначальныеСведенияОС.ОсновноеСредство
	|			И СведенияПоОрганизации.Организация = ПервоначальныеСведенияОС.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновныеСредства.Ссылка КАК Ссылка,
	|	ОсновныеСредства.Код КАК Код,
	|	ОсновныеСредства.Наименование КАК Наименование,
	|	ОсновныеСредства.ДатаВыпуска КАК ДатаВыпуска,
	|	ОсновныеСредства.ЗаводскойНомер КАК ЗаводскойНомер,
	|	ОсновныеСредства.Изготовитель КАК Изготовитель,
	|	ОсновныеСредства.НаименованиеПолное КАК НаименованиеПолное,
	|	ОсновныеСредства.НомерПаспорта КАК НомерПаспорта,
	|	ЕСТЬNULL(СведенияПоОрганизации.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
	|	ТаблицаОС.Порядок КАК Порядок,
	|	СведенияПоОрганизации.ДатаВводаВЭксплуатациюБУ КАК ДатаВводаВЭксплуатациюБУ,
	|	ОсновныеСредства.ДрагоценныеМатериалы.(
	|		ДрагоценныйМатериал КАК ДрагоценныйМатериал,
	|		Количество КАК Количество,
	|		ДрагоценныйМатериал.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|	) КАК ДрагоценныеМатериалы
	|ИЗ
	|	ТаблицаОС КАК ТаблицаОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыЭксплуатации КАК ОсновныеСредства
	|		ПО ТаблицаОС.ОС = ОсновныеСредства.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияПоОрганизации КАК СведенияПоОрганизации
	|		ПО ТаблицаОС.ОС = СведенияПоОрганизации.ОС
	|ГДЕ
	|	ОсновныеСредства.ЭтоГруппа = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Переоценка.Дата КАК ДатаПереоценки,
	|	ПереоценкаТЧ.ОсновноеСредство КАК ОсновноеСредство,
	|	ПереоценкаТЧ.Стоимость КАК ВосстановительнаяСтоимостьПереоценки
	|ИЗ
	|	СведенияПоОрганизации КАК ТаблицаОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СобытияОСОрганизаций КАК СобытияОСОрганизаций
	|		ПО ТаблицаОС.ОС = СобытияОСОрганизаций.ОсновноеСредство
	|			И ТаблицаОС.Организация = СобытияОСОрганизаций.Организация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереоценкаОС.ОС КАК ПереоценкаТЧ
	|		ПО (СобытияОСОрганизаций.Регистратор = ПереоценкаТЧ.Ссылка)
	|			И (СобытияОСОрганизаций.ОсновноеСредство = ПереоценкаТЧ.ОсновноеСредство)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереоценкаОС КАК Переоценка
	|		ПО (СобытияОСОрганизаций.Регистратор = Переоценка.Ссылка)
	|ГДЕ
	|	СобытияОСОрганизаций.Событие.ВидСобытияОС = &ВидСобытияПереоценки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Переоценка.Дата КАК ДатаПереоценки,
	|	ПереоценкаТЧ.ОсновноеСредство КАК ОсновноеСредство,
	|	ПереоценкаТЧ.СтоимостьБУ КАК ВосстановительнаяСтоимостьПереоценки
	|ИЗ
	|	СведенияПоОрганизации КАК СведенияПоОрганизации
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СобытияОСОрганизаций КАК СобытияОСОрганизаций
	|		ПО СобытияОСОрганизаций.ОсновноеСредство = СведенияПоОрганизации.ОС
	|			И СобытияОСОрганизаций.Период >= СведенияПоОрганизации.ДатаВводаВЭксплуатациюБУ
	|			И СобытияОСОрганизаций.Регистратор ССЫЛКА Документ.ПереоценкаОС2_4
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереоценкаОС2_4.ОС КАК ПереоценкаТЧ
	|		ПО (СобытияОСОрганизаций.Регистратор = ПереоценкаТЧ.Ссылка)
	|			И (СобытияОСОрганизаций.ОсновноеСредство = ПереоценкаТЧ.ОсновноеСредство)
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереоценкаОС2_4 КАК Переоценка
	|		ПО (СобытияОСОрганизаций.Регистратор = Переоценка.Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОсновноеСредство,
	|	ДатаПереоценки";
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ИспользоватьУчетДМ = ПолучитьФункциональнуюОпцию("ИспользоватьУчетДрагоценныхМатериалов");
	
	ВыборкаОбъектов = Пакет[Пакет.ВГраница()-1].Выбрать();
	ВыборкаПереоценок = Пакет[Пакет.ВГраница()].Выбрать();
	ЕстьПереоценки = Не Пакет[Пакет.ВГраница()].Пустой();
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаОбъектов.Следующий() Цикл
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Организация", ВыборкаОбъектов.Организация);
		Запрос.УстановитьПараметр("ДатаСведений", ДатаСведений);
		Запрос.УстановитьПараметр("ОсновноеСредство", ВыборкаОбъектов.Ссылка);
		Запрос.УстановитьПараметр("СубконтоОС", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство,
		|	ВЫБОР 
		|		КОГДА СчетаБухгалтерскогоУчетаОССрезПоследних.ГруппаФинансовогоУчета <> ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаВнеоборотныхАктивов.ПустаяСсылка)
		|			ТОГДА СчетаБухгалтерскогоУчетаОССрезПоследних.ГруппаФинансовогоУчета.СчетУчета
		|		ИНАЧЕ СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета
		|	КОНЕЦ КАК СчетУчета,
		|	ВЫБОР 
		|		КОГДА СчетаБухгалтерскогоУчетаОССрезПоследних.ГруппаФинансовогоУчета <> ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаВнеоборотныхАктивов.ПустаяСсылка)
		|			ТОГДА СчетаБухгалтерскогоУчетаОССрезПоследних.ГруппаФинансовогоУчета.СчетУчетаАмортизации
		|		ИНАЧЕ СчетаБухгалтерскогоУчетаОССрезПоследних.СчетНачисленияАмортизации
		|	КОНЕЦ КАК СчетНачисленияАмортизации
		|ПОМЕСТИТЬ втСчетаУчета
		|ИЗ
		|	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
		|			&ДатаСведений,
		|			Организация = &Организация
		|				И ОсновноеСредство = &ОсновноеСредство) КАК СчетаБухгалтерскогоУчетаОССрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.СтоимостьДляВычисленияАмортизации,
		|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОбъемПродукцииРаботДляВычисленияАмортизации,
		|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.КоэффициентАмортизации,
		|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.КоэффициентУскорения,
		|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.Период,
		|	СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.СчетУчета,
		|	СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.СчетНачисленияАмортизации,
		|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.СпособНачисленияАмортизации,
		|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ПервоначальнаяСтоимость,
		|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.СрокПолезногоИспользования,
		|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.Местонахождение,
		|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.МОЛ,
		|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.Местонахождение.Наименование,
		|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство,
		|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ИнвентарныйНомер,
		|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ГруппаОС КАК ГруппаОС,
		|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.КодПоОКОФ.Код КАК КодПоОКОФ,
		|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ШифрПоЕНАОФ КАК ШифрПоЕНАОФ,
		|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.АмортизационнаяГруппа.Порядок + 1 КАК АмортизационнаяГруппа,
		|	ЕСТЬNULL(ХозрасчетныйОстаткиСчетУчета.СуммаОстаток, 0) + ЕСТЬNULL(ХозрасчетныйОстаткиСчетАмортизации.СуммаОстаток, 0) КАК ОстаточнаяСтоимость,
		|	-ЕСТЬNULL(ХозрасчетныйОстаткиСчетАмортизации.СуммаОстаток, 0) КАК СуммаНачисленнойАммортизации
		|ИЗ
		|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
		|			&ДатаСведений,
		|			Организация = &Организация
		|				И ОсновноеСредство = &ОсновноеСредство) КАК ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(
		|				&ДатаСведений,
		|				Организация = &Организация
		|					И ОсновноеСредство = &ОсновноеСредство) КАК ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних
		|		ПО ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство = ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ втСчетаУчета КАК СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних
		|		ПО ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство = СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(
		|				&ДатаСведений,
		|				Организация = &Организация
		|					И ОсновноеСредство = &ОсновноеСредство) КАК МестонахождениеОСБухгалтерскийУчетСрезПоследних
		|		ПО ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство = МестонахождениеОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
		|				&ДатаСведений,
		|				Счет В
		|					(ВЫБРАТЬ
		|						втСчетаУчета.СчетУчета
		|					ИЗ
		|						втСчетаУчета КАК втСчетаУчета),
		|				&СубконтоОС,
		|				Организация = &Организация
		|					И Субконто1 В
		|						(ВЫБРАТЬ
		|							втСчетаУчета.ОсновноеСредство
		|						ИЗ
		|							втСчетаУчета КАК втСчетаУчета)) КАК ХозрасчетныйОстаткиСчетУчета
		|		ПО (СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.ОсновноеСредство = ХозрасчетныйОстаткиСчетУчета.Субконто1)
		|			И (СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.СчетУчета = ХозрасчетныйОстаткиСчетУчета.Счет)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(
		|				&ДатаСведений,
		|				Счет В
		|					(ВЫБРАТЬ
		|						втСчетаУчета.СчетНачисленияАмортизации
		|					ИЗ
		|						втСчетаУчета КАК втСчетаУчета),
		|				&СубконтоОС,
		|				Организация = &Организация
		|					И Субконто1 В
		|						(ВЫБРАТЬ
		|							втСчетаУчета.ОсновноеСредство
		|						ИЗ
		|							втСчетаУчета КАК втСчетаУчета)) КАК ХозрасчетныйОстаткиСчетАмортизации
		|		ПО (СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.ОсновноеСредство = ХозрасчетныйОстаткиСчетАмортизации.Субконто1)
		|			И (СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.СчетНачисленияАмортизации = ХозрасчетныйОстаткиСчетАмортизации.Счет)
		|ГДЕ
		|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.Организация = &Организация";
		ТекущиеСведенияОС = Запрос.Выполнить().Выбрать();
		ТекущиеСведенияОС.Следующий();
		
		Если НЕ ПервыйДокумент Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
		
		СчетУчетаСтоимостиБУ = ТекущиеСведенияОС.СчетУчета;
		СрокИспользования   = ТекущиеСведенияОС.СрокПолезногоИспользования;
		
		Отбор  = Новый Структура( "ОсновноеСредство", ВыборкаОбъектов.Ссылка);
		Подразделение  = ТекущиеСведенияОС.МестонахождениеНаименование;
		
		СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаОбъектов.Организация, ТекущаяДатаСеанса());
		
		Шапка.Параметры.Заполнить(ВыборкаОбъектов);
		Шапка.Параметры.Заполнить(ТекущиеСведенияОС);
		
		Шапка.Параметры.Организация = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм");
		Шапка.Параметры.КодПоОКПО = ВыборкаОбъектов.Организация.КодПоОКПО;
		Шапка.Параметры.Подразделение = Подразделение;
		Шапка.Параметры.НаименованиеОС = ?(НЕ ЗначениеЗаполнено(ВыборкаОбъектов.НаименованиеПолное), ВыборкаОбъектов.Наименование, ВыборкаОбъектов.НаименованиеПолное);
		
		Шапка.Параметры.НомерДок = ТекущиеСведенияОС.ИнвентарныйНомер;
		Шапка.Параметры.ДатаДок = Формат(ДатаСведений,"ДЛФ=D");
		Шапка.Параметры.МестоНахождениеОС = Подразделение;
		Шапка.Параметры.ИзготовительОС = ВыборкаОбъектов.Изготовитель;
		Шапка.Параметры.НомерГруппы = ТекущиеСведенияОС.АмортизационнаяГруппа;
		Если ТекущиеСведенияОС.АмортизационнаяГруппа = 11 Тогда
			Шапка.Параметры.НомерГруппы = НСтр("ru='Отдельная'");
		КонецЕсли;
		Шапка.Параметры.НомерПаспорта = ВыборкаОбъектов.НомерПаспорта;
		Шапка.Параметры.ЗаводскойНомер = ВыборкаОбъектов.ЗаводскойНомер;
		Шапка.Параметры.ИнвентарныйНомер = ТекущиеСведенияОС.ИнвентарныйНомер;
		Шапка.Параметры.СубСчет = Строка(СчетУчетаСтоимостиБУ);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияОСОрганизаций.Состояние КАК Состояние,
		|	СостоянияОСОрганизаций.ДатаСостояния КАК ДатаСостояния,
		|	СобытияОСОрганизаций.НазваниеДокумента КАК НазваниеДокумента,
		|	СобытияОСОрганизаций.НомерДокумента КАК НомерДокумента,
		|	СобытияОСОрганизаций.Событие КАК Событие,
		|	СостоянияОСОрганизаций.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.СобытияОСОрганизаций КАК СобытияОСОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОСОрганизаций
		|		ПО СобытияОСОрганизаций.Период = СостоянияОСОрганизаций.ДатаСостояния
		|			И СобытияОСОрганизаций.Регистратор = СостоянияОСОрганизаций.Регистратор
		|			И СобытияОСОрганизаций.Организация = СостоянияОСОрганизаций.Организация
		|			И СобытияОСОрганизаций.ОсновноеСредство = СостоянияОСОрганизаций.ОсновноеСредство
		|ГДЕ
		|	СобытияОСОрганизаций.ОсновноеСредство = &ОсновноеСредство
		|	И СобытияОСОрганизаций.Период >= &ДатаВводаВЭксплуатациюБУ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	СобытияОСОрганизацийСрезПоследних.Период,
		|	СобытияОСОрганизацийСрезПоследних.НазваниеДокумента,
		|	СобытияОСОрганизацийСрезПоследних.НомерДокумента,
		|	СобытияОСОрганизацийСрезПоследних.Событие,
		|	СобытияОСОрганизацийСрезПоследних.Регистратор
		|ИЗ
		|	РегистрСведений.СобытияОСОрганизаций.СрезПоследних(
		|			&ДатаСведений,
		|			ОсновноеСредство = &ОсновноеСредство
		|				И Событие.ВидСобытияОС В (&МодернизацияИКапРемонт)) КАК СобытияОСОрганизацийСрезПоследних
		|ГДЕ
		|	СобытияОСОрганизацийСрезПоследних.Период >= &ДатаВводаВЭксплуатациюБУ";
		
		Запрос.УстановитьПараметр("Организация", ВыборкаОбъектов.Организация);
		Запрос.УстановитьПараметр("ОсновноеСредство", ВыборкаОбъектов.Ссылка);
		Запрос.УстановитьПараметр("ДатаСведений", ДатаСведений);
		Запрос.УстановитьПараметр("ДатаВводаВЭксплуатациюБУ", ВыборкаОбъектов.ДатаВводаВЭксплуатациюБУ);
		
		ВидыСобытий = Новый СписокЗначений;
		ВидыСобытий.Добавить(Перечисления.ВидыСобытийОС.Модернизация);
		ВидыСобытий.Добавить(Перечисления.ВидыСобытийОС.Достройка);
		ВидыСобытий.Добавить(Перечисления.ВидыСобытийОС.Дооборудование);
		ВидыСобытий.Добавить(Перечисления.ВидыСобытийОС.КапитальныйРемонт);
		
		Запрос.УстановитьПараметр("МодернизацияИКапРемонт", ВидыСобытий);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ДатаПринятия = '00010101';
		ДокументПринятия = "";
		
		ДатаВвода = '00010101';
		ДокументВвода = "";
		ДокументВводаНомер = "";
		
		ДатаСписания = '00010101';
		ДокументСписания = "";
		РегистраторСписания = Неопределено;
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.Состояние   = Перечисления.СостоянияОС.ПринятоКУчету Тогда
				ДатаПринятия = Выборка.ДатаСостояния;
				ДокументПринятия = Выборка.НазваниеДокумента;
				ДокументПринятияНомер = Выборка.НомерДокумента;
			ИначеЕсли Выборка.Состояние = Перечисления.СостоянияОС.СнятоСУчета Тогда
				ДатаСписания        = Выборка.ДатаСостояния;
				ДокументСписания    = Выборка.НазваниеДокумента;
				РегистраторСписания = Выборка.Регистратор;
			Иначе
				ДатаПоследнейМодернизации     = Выборка.ДатаСостояния;
				ДокументПоследнейМодернизации = Выборка.НазваниеДокумента;
			КонецЕсли; 
		КонецЦикла;
		
		Шапка.Параметры.ДатаВвода    = ДатаПринятия;
		Шапка.Параметры.ДатаСписания = ДатаСписания;
		
		ТабДок.Вывести(Шапка);
		
		// Балансовая стоимость ОС на момент поступления и первоначально принятый срок полезного использования.
		ШапкаРазделов1и2.Параметры.Заполнить(ВыборкаОбъектов);
		ШапкаРазделов1и2.Параметры.Заполнить(ТекущиеСведенияОС);
		ШапкаРазделов1и2.Параметры.ПервоначальнаяСтоимость= ТекущиеСведенияОС.ПервоначальнаяСтоимость;
		ШапкаРазделов1и2.Параметры.СрокПолезногоИспользования = ОбъектыЭксплуатации.КоличествоМесяцевСтрокой(СрокИспользования);
		Если ЗначениеЗаполнено(ДатаПринятия) Тогда
			ШапкаРазделов1и2.Параметры.ДокументВвода = ДокументПринятия;
			ШапкаРазделов1и2.Параметры.ДокументВводаДата = ДатаПринятия;
			ШапкаРазделов1и2.Параметры.ДокументВводаНомер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДокументПринятияНомер, Истина, Ложь);
			ШапкаРазделов1и2.Параметры.ДатаКапремонта = ДатаПоследнейМодернизации;
			ШапкаРазделов1и2.Параметры.СрокЭксплуатации = ОбъектыЭксплуатации.КоличествоМесяцевСтрокой(
				УправлениеВнеоборотнымиАктивами.ОпределитьФактическийСрокИспользования(
					ДатаПринятия, ?(ЗначениеЗаполнено(ДатаСписания), ДатаСписания, ТекущаяДатаСеанса())));
		КонецЕсли;
		
		ТабДок.Вывести(ШапкаРазделов1и2);
		
		// Переоценки
		ТабДок.Вывести(ШапкаРаздела3);
		Если ЕстьПереоценки Тогда
			ВосстановительнаяСтоимость = ТекущиеСведенияОС.ПервоначальнаяСтоимость;
			ЗаполненныхПереоценок = 0;
			СтруктураПустойСтроки = Новый Структура(
				"ДатаПереоценки1, КоэффициентПереоценки1, ВосстановительнаяСтоимостьПереоценки1,
				|ДатаПереоценки2, КоэффициентПереоценки2, ВосстановительнаяСтоимостьПереоценки2,
				|ДатаПереоценки3, КоэффициентПереоценки3, ВосстановительнаяСтоимостьПереоценки3");
			
			Пока Истина Цикл
				
				Если ЗаполненныхПереоценок = 3 Тогда
					ТабДок.Вывести(СтрокиРаздела3);
					ЗаполненныхПереоценок = 0;
					СтрокиРаздела3.Параметры.Заполнить(СтруктураПустойСтроки);
				КонецЕсли;
				
				Если ВыборкаПереоценок.НайтиСледующий(Отбор) Тогда
					ЗаполненныхПереоценок = ЗаполненныхПереоценок + 1;
					СтрокиРаздела3.Параметры["ДатаПереоценки" + ЗаполненныхПереоценок] = ВыборкаПереоценок.ДатаПереоценки;
					
					СтрокиРаздела3.Параметры["ВосстановительнаяСтоимостьПереоценки" + ЗаполненныхПереоценок] = 
						ВыборкаПереоценок.ВосстановительнаяСтоимостьПереоценки;
					
					СтрокиРаздела3.Параметры["КоэффициентПереоценки" + ЗаполненныхПереоценок] =
						Формат(ВыборкаПереоценок.ВосстановительнаяСтоимостьПереоценки / ВосстановительнаяСтоимость, "ЧЦ=15; ЧДЦ=3");
					
					ВосстановительнаяСтоимость = ВыборкаПереоценок.ВосстановительнаяСтоимостьПереоценки;
				Иначе
					Если ЗаполненныхПереоценок > 0 Тогда
						ТабДок.Вывести(СтрокиРаздела3);
					КонецЕсли;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
		Иначе
			ТабДок.Вывести(СтрокиРаздела3);
		КонецЕсли;
		
		// Сведения о приемке, внутренних перемещениях и выбытии	
		ТабДок.Вывести(ШапкаРаздела4);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Период",           ДатаСведений);
		Запрос.УстановитьПараметр("Организация",      ВыборкаОбъектов.Организация);
		Запрос.УстановитьПараметр("ОсновноеСредство", ВыборкаОбъектов.Ссылка);
		Запрос.УстановитьПараметр("ДатаВводаВЭксплуатациюБУ", ВыборкаОбъектов.ДатаВводаВЭксплуатациюБУ);
		Запрос.УстановитьПараметр("ТекстПринятиеКУчету",      НСтр("ru = 'Принятие к учету'"));
		Запрос.УстановитьПараметр("ТекстПеремещение",         НСтр("ru = 'Внутреннее перемещение'"));
		Запрос.УстановитьПараметр("ТекстСписание",            НСтр("ru = 'Списание'"));
		Запрос.УстановитьПараметр("ТекстПодготовкаКПередаче", НСтр("ru = 'Подготовка к передаче'"));
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СобытияОС.Ссылка
		|ПОМЕСТИТЬ втСписокСобытий
		|ИЗ
		|	Справочник.СобытияОС КАК СобытияОС
		|ГДЕ
		|	СобытияОС.ВидСобытияОС В (
		|		ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету), 
		|		ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчетуСВводомВЭксплуатацию), 
		|		ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВнутреннееПеремещение), 
		|		ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание), 
		|		ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Передача))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СобытияОСОрганизаций.НазваниеДокумента КАК НазваниеДокумента,
		|	СобытияОСОрганизаций.НомерДокумента КАК НомерДокумента,
		|	СобытияОСОрганизаций.Период КАК Период,
		|	СобытияОСОрганизаций.Период КАК ПериодОстатков,
		|	СобытияОСОрганизаций.Событие КАК Событие,
		|	СобытияОСОрганизаций.Событие.ВидСобытияОС КАК ВидСобытияОС,
		|	СобытияОСОрганизаций.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ СобытияОС
		|ИЗ
		|	РегистрСведений.СобытияОСОрганизаций КАК СобытияОСОрганизаций
		|ГДЕ
		|	СобытияОСОрганизаций.ОсновноеСредство = &ОсновноеСредство
		|	И СобытияОСОрганизаций.Период < &Период
		|	И СобытияОСОрганизаций.Организация = &Организация
		|	И СобытияОСОрганизаций.Событие В (
		|		ВЫБРАТЬ
		|			СобытияОС.Ссылка
		|		ИЗ
		|			втСписокСобытий КАК СобытияОС)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СобытияОСОрганизаций.НазваниеДокумента КАК НазваниеДокумента,
		|	СобытияОСОрганизаций.НомерДокумента КАК НомерДокумента,
		|	СобытияОСОрганизаций.Период КАК Период,
		|	СобытияОСОрганизаций.Период КАК ПериодОстатков,
		|	ВЫБОР ТИПЗНАЧЕНИЯ(СобытияОСОрганизаций.Регистратор) 
		|		КОГДА ТИП(Документ.ПринятиеКУчетуОС2_4)
		|			ТОГДА &ТекстПринятиеКУчету
		|		КОГДА ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
		|			ТОГДА &ТекстПринятиеКУчету
		|		КОГДА ТИП(Документ.ПеремещениеОС2_4)
		|			ТОГДА &ТекстПеремещение
		|		КОГДА ТИП(Документ.СписаниеОС2_4)
		|			ТОГДА &ТекстСписание
		|		КОГДА ТИП(Документ.ПодготовкаКПередачеОС2_4)
		|			ТОГДА &ТекстПодготовкаКПередаче
		|	КОНЕЦ КАК Событие,
		|	ВЫБОР ТИПЗНАЧЕНИЯ(СобытияОСОрганизаций.Регистратор) 
		|		КОГДА ТИП(Документ.ПринятиеКУчетуОС2_4)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)
		|		КОГДА ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)
		|		КОГДА ТИП(Документ.ПеремещениеОС2_4)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВнутреннееПеремещение)
		|		КОГДА ТИП(Документ.СписаниеОС2_4)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание)
		|		КОГДА ТИП(Документ.ПодготовкаКПередачеОС2_4)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Передача)
		|	КОНЕЦ КАК ВидСобытияОС,
		|	СобытияОСОрганизаций.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.СобытияОСОрганизаций КАК СобытияОСОрганизаций
		|ГДЕ
		|	СобытияОСОрганизаций.ОсновноеСредство = &ОсновноеСредство
		|	И СобытияОСОрганизаций.Период < &Период
		|	И СобытияОСОрганизаций.Период >= &ДатаВводаВЭксплуатациюБУ
		|	И ТИПЗНАЧЕНИЯ(СобытияОСОрганизаций.Регистратор) В (
		|		ТИП(Документ.ПринятиеКУчетуОС2_4),
		|		ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4),
		|		ТИП(Документ.ПеремещениеОС2_4),
		|		ТИП(Документ.СписаниеОС2_4),
		|		ТИП(Документ.ПодготовкаКПередачеОС2_4))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МестонахождениеОСБухгалтерскийУчет.Период КАК Период,
		|	МестонахождениеОСБухгалтерскийУчет.МОЛ КАК МОЛ,
		|	МестонахождениеОСБухгалтерскийУчет.Местонахождение КАК Местонахождение
		|ПОМЕСТИТЬ МестонахождениеОСБухгалтерскийУчет
		|ИЗ
		|	РегистрСведений.МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОСБухгалтерскийУчет
		|ГДЕ
		|	МестонахождениеОСБухгалтерскийУчет.ОсновноеСредство = &ОсновноеСредство
		|	И МестонахождениеОСБухгалтерскийУчет.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СобытияОС.Период КАК Период,
		|	МАКСИМУМ(МестонахождениеОСБухгалтерскийУчет.Период) КАК ПоследнийПериод
		|ПОМЕСТИТЬ МестонахождениеОСБухгалтерскийУчетСрезПоследнихПериодов
		|ИЗ
		|	СобытияОС КАК СобытияОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОСБухгалтерскийУчет
		|		ПО СобытияОС.Период >= МестонахождениеОСБухгалтерскийУчет.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	СобытияОС.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МестонахождениеОСБухгалтерскийУчетСрезПоследнихПериодов.Период КАК Период,
		|	МестонахождениеОСБухгалтерскийУчет.МОЛ КАК МОЛ,
		|	МестонахождениеОСБухгалтерскийУчет.Местонахождение КАК Местонахождение
		|ПОМЕСТИТЬ МестонахождениеОСБухгалтерскийУчетСрезПоследних
		|ИЗ
		|	МестонахождениеОСБухгалтерскийУчетСрезПоследнихПериодов КАК МестонахождениеОСБухгалтерскийУчетСрезПоследнихПериодов
		|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОСБухгалтерскийУчет
		|		ПО МестонахождениеОСБухгалтерскийУчетСрезПоследнихПериодов.ПоследнийПериод = МестонахождениеОСБухгалтерскийУчет.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СчетаБухгалтерскогоУчетаОС.Период КАК Период,
		|	ВЫБОР 
		|		КОГДА СчетаБухгалтерскогоУчетаОС.ГруппаФинансовогоУчета <> ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаВнеоборотныхАктивов.ПустаяСсылка)
		|			ТОГДА СчетаБухгалтерскогоУчетаОС.ГруппаФинансовогоУчета.СчетУчета
		|		ИНАЧЕ СчетаБухгалтерскогоУчетаОС.СчетУчета
		|	КОНЕЦ КАК СчетУчета,
		|	ВЫБОР 
		|		КОГДА СчетаБухгалтерскогоУчетаОС.ГруппаФинансовогоУчета <> ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаВнеоборотныхАктивов.ПустаяСсылка)
		|			ТОГДА СчетаБухгалтерскогоУчетаОС.ГруппаФинансовогоУчета.СчетУчетаАмортизации
		|		ИНАЧЕ СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации
		|	КОНЕЦ КАК СчетНачисленияАмортизации
		|ПОМЕСТИТЬ СчетаБухгалтерскогоУчетаОС
		|ИЗ
		|	РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаБухгалтерскогоУчетаОС
		|ГДЕ
		|	СчетаБухгалтерскогоУчетаОС.ОсновноеСредство = &ОсновноеСредство
		|	И СчетаБухгалтерскогоУчетаОС.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СобытияОС.ПериодОстатков КАК ПериодОстатков,
		|	МАКСИМУМ(СчетаБухгалтерскогоУчетаОС.Период) КАК ПоследнийПериод
		|ПОМЕСТИТЬ СчетаБухгалтерскогоУчетаОССрезПоследнихПериодов
		|ИЗ
		|	СобытияОС КАК СобытияОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаБухгалтерскогоУчетаОС КАК СчетаБухгалтерскогоУчетаОС
		|		ПО СобытияОС.ПериодОстатков >= СчетаБухгалтерскогоУчетаОС.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	СобытияОС.ПериодОстатков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СчетаБухгалтерскогоУчетаОССрезПоследнихПериодов.ПериодОстатков КАК ПериодОстатков,
		|	СчетаБухгалтерскогоУчетаОС.СчетУчета КАК СчетУчета,
		|	СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации КАК СчетНачисленияАмортизации
		|ПОМЕСТИТЬ СчетаБухгалтерскогоУчетаОССрезПоследних
		|ИЗ
		|	СчетаБухгалтерскогоУчетаОССрезПоследнихПериодов КАК СчетаБухгалтерскогоУчетаОССрезПоследнихПериодов
		|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаБухгалтерскогоУчетаОС КАК СчетаБухгалтерскогоУчетаОС
		|		ПО СчетаБухгалтерскогоУчетаОССрезПоследнихПериодов.ПоследнийПериод = СчетаБухгалтерскогоУчетаОС.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОстаткиИОбороты.Период КАК Период,
		|	ХозрасчетныйОстаткиИОбороты.Счет КАК Счет,
		|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК СуммаКонечныйОстатокДт,
		|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокКт КАК СуммаКонечныйОстатокКт,
		|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт КАК СуммаОборотДт,
		|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК СуммаОборотКт
		|ПОМЕСТИТЬ ХозрасчетныйОстаткиИОбороты
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
		|			,
		|			&Период,
		|			Регистратор,
		|			,
		|			Счет В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета
		|				ИЗ
		|					СчетаБухгалтерскогоУчетаОССрезПоследних
		|			
		|				ОБЪЕДИНИТЬ ВСЕ
		|			
		|				ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					СчетаБухгалтерскогоУчетаОССрезПоследних.СчетНачисленияАмортизации
		|				ИЗ
		|					СчетаБухгалтерскогоУчетаОССрезПоследних),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
		|			Организация = &Организация
		|				И Субконто1 = &ОсновноеСредство) КАК ХозрасчетныйОстаткиИОбороты
		|ГДЕ
		|	НЕ ХозрасчетныйОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СобытияОС.ПериодОстатков КАК ПериодОстатков,
		|	ХозрасчетныйОстаткиИОбороты.Счет КАК Счет,
		|	МАКСИМУМ(ХозрасчетныйОстаткиИОбороты.Период) КАК ПоследнийПериод
		|ПОМЕСТИТЬ ХозрасчетныйОстаткиИОборотыСрезПоследнихПериодов
		|ИЗ
		|	СобытияОС КАК СобытияОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ХозрасчетныйОстаткиИОбороты КАК ХозрасчетныйОстаткиИОбороты
		|		ПО СобытияОС.ПериодОстатков >= ХозрасчетныйОстаткиИОбороты.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	СобытияОС.ПериодОстатков,
		|	ХозрасчетныйОстаткиИОбороты.Счет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОстаткиИОборотыСрезПоследнихПериодов.ПериодОстатков КАК ПериодОстатков,
		|	ХозрасчетныйОстаткиИОбороты.Счет КАК Счет,
		|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК СуммаКонечныйОстатокДт,
		|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокКт КАК СуммаКонечныйОстатокКт,
		|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт КАК СуммаОборотДт,
		|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК СуммаОборотКт
		|ПОМЕСТИТЬ ХозрасчетныйОстаткиИОборотыСрезПоследних
		|ИЗ
		|	ХозрасчетныйОстаткиИОборотыСрезПоследнихПериодов КАК ХозрасчетныйОстаткиИОборотыСрезПоследнихПериодов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ХозрасчетныйОстаткиИОбороты КАК ХозрасчетныйОстаткиИОбороты
		|		ПО ХозрасчетныйОстаткиИОборотыСрезПоследнихПериодов.ПоследнийПериод = ХозрасчетныйОстаткиИОбороты.Период
		|			И ХозрасчетныйОстаткиИОборотыСрезПоследнихПериодов.Счет = ХозрасчетныйОстаткиИОбороты.Счет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТИПЗНАЧЕНИЯ(СобытияОС.Регистратор) КАК НазваниеДокумента,
		|	СобытияОС.НомерДокумента КАК НомерДокумента,
		|	СобытияОС.Период КАК Период,
		|	СобытияОС.Событие КАК Событие,
		|	СобытияОС.Регистратор КАК Регистратор,
		|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.МОЛ КАК МОЛ,
		|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.Местонахождение КАК Местонахождение,
		|	СтоимостьОС.СуммаОборотКт КАК СтоимостьОборот,
		|	АмортизацияОС.СуммаОборотДт КАК АмортизацияОборот,
		|	ВЫБОР
		|		КОГДА СобытияОС.ВидСобытияОС В (ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание), ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Передача))
		|			ТОГДА ЕСТЬNULL(СтоимостьОС.СуммаОборотКт, 0) - ЕСТЬNULL(АмортизацияОС.СуммаОборотДт, 0)
		|		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СуммаКонечныйОстатокДт, 0) - ЕСТЬNULL(АмортизацияОС.СуммаКонечныйОстатокКт, 0)
		|	КОНЕЦ КАК ОстаточнаяСтоимость
		|ИЗ
		|	СобытияОС КАК СобытияОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОСБухгалтерскийУчетСрезПоследних КАК МестонахождениеОСБухгалтерскийУчетСрезПоследних
		|		ПО СобытияОС.Период = МестонахождениеОСБухгалтерскийУчетСрезПоследних.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаБухгалтерскогоУчетаОССрезПоследних КАК СчетаБухгалтерскогоУчетаОССрезПоследних
		|		ПО СобытияОС.ПериодОстатков = СчетаБухгалтерскогоУчетаОССрезПоследних.ПериодОстатков
		|		ЛЕВОЕ СОЕДИНЕНИЕ ХозрасчетныйОстаткиИОборотыСрезПоследних КАК СтоимостьОС
		|		ПО (СчетаБухгалтерскогоУчетаОССрезПоследних.ПериодОстатков = СтоимостьОС.ПериодОстатков)
		|			И (СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета = СтоимостьОС.Счет)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ХозрасчетныйОстаткиИОборотыСрезПоследних КАК АмортизацияОС
		|		ПО (СчетаБухгалтерскогоУчетаОССрезПоследних.ПериодОстатков = АмортизацияОС.ПериодОстатков)
		|			И (СчетаБухгалтерскогоУчетаОССрезПоследних.СчетНачисленияАмортизации = АмортизацияОС.Счет)";
		ВыборкаЗаписей = Запрос.Выполнить().Выбрать();
		Пока ВыборкаЗаписей.Следующий() Цикл
			
			ТекущаяОперация = ВыборкаЗаписей.Событие;
			
			СтрокаРаздела4.Параметры.ДатаНомерДокумента = СтрШаблон(
				НСтр("ru='%1 № %2 от %3'"),
				Строка(ВыборкаЗаписей.НазваниеДокумента),
				ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаЗаписей.НомерДокумента),
				Формат(ВыборкаЗаписей.Период,"ДЛФ=D"));
			
			СтрокаРаздела4.Параметры.ВидОперации = ТекущаяОперация;
			СтрокаРаздела4.Параметры.ФИОМОЛДвижения = "";
			СтрокаРаздела4.Параметры.Подразделение = "";
			СтрокаРаздела4.Параметры.ФИОМОЛДвижения = ВыборкаЗаписей.МОЛ;
			СтрокаРаздела4.Параметры.Подразделение = ВыборкаЗаписей.Местонахождение;
				
			Если ВыборкаЗаписей.СтоимостьОборот = NULL И ВыборкаЗаписей.АмортизацияОборот = NULL Тогда // ввод начальных остатков
				
				СтрокаРаздела4.Параметры.ОстаточнаяСтоимость = ТекущиеСведенияОС.ПервоначальнаяСтоимость;
				
			Иначе
				
				СтрокаРаздела4.Параметры.ОстаточнаяСтоимость = ВыборкаЗаписей.ОстаточнаяСтоимость;
				
			КонецЕсли;
			
			ТабДок.Вывести(СтрокаРаздела4);
			
		КонецЦикла;
		
		ТабДок.Вывести(ПодвалСтраницы1);
		
		// модернизация ос и ремонт
		ТаблицаМодернизаций = Новый ТаблицаЗначений;
		ТаблицаМодернизаций.Колонки.Добавить("ВидОперации");
		ТаблицаМодернизаций.Колонки.Добавить("Название");
		ТаблицаМодернизаций.Колонки.Добавить("Дата");
		ТаблицаМодернизаций.Колонки.Добавить("Номер");
		ТаблицаМодернизаций.Колонки.Добавить("Сумма");
		
		ТаблицаРемонтов = Новый ТаблицаЗначений;
		ТаблицаРемонтов.Колонки.Добавить("ВидОперации");
		ТаблицаРемонтов.Колонки.Добавить("Название");
		ТаблицаРемонтов.Колонки.Добавить("Дата");
		ТаблицаРемонтов.Колонки.Добавить("Номер");
		ТаблицаРемонтов.Колонки.Добавить("Сумма");
		
		ТабДок.Вывести(ШапкаРазделов5и6);
		
		СписокМодернизаций = Новый Массив;
		СписокМодернизаций.Добавить(Перечисления.ВидыСобытийОС.Модернизация);
		СписокМодернизаций.Добавить(Перечисления.ВидыСобытийОС.Достройка);
		СписокМодернизаций.Добавить(Перечисления.ВидыСобытийОС.Реконструкция);
		СписокМодернизаций.Добавить(Перечисления.ВидыСобытийОС.Дооборудование);
		СписокМодернизаций.Добавить(Перечисления.ВидыСобытийОС.ЧастичнаяЛиквидация);
		
		СписокРемонтов = Новый Массив;
		СписокРемонтов.Добавить(Перечисления.ВидыСобытийОС.СреднийРемонт);
		СписокРемонтов.Добавить(Перечисления.ВидыСобытийОС.ТекущийРемонт);
		СписокРемонтов.Добавить(Перечисления.ВидыСобытийОС.КапитальныйРемонт);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Организация", ВыборкаОбъектов.Организация);
		Запрос.УстановитьПараметр("ОсновноеСредство", ВыборкаОбъектов.Ссылка);
		Запрос.УстановитьПараметр("УсловиеМодернизаций",СписокМодернизаций);
		Запрос.УстановитьПараметр("УсловиеРемонтов", СписокРемонтов);
		Запрос.УстановитьПараметр("ВидСобытияОС", Перечисления.ВидыСобытийОС.ПринятиеКУчету);
		Запрос.УстановитьПараметр("ТекстМодернизация", НСтр("ru = 'Модернизация'"));
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА СобытияОСОрганизаций.Событие.ВидСобытияОС В (&УсловиеМодернизаций)
		|			ТОГДА СобытияОСОрганизаций.СуммаЗатратБУ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаЗатратБУМодернизаций,
		|	ВЫБОР
		|		КОГДА СобытияОСОрганизаций.Событие.ВидСобытияОС В (&УсловиеРемонтов)
		|			ТОГДА СобытияОСОрганизаций.СуммаЗатратБУ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаЗатратБУРемонтов,
		|	СобытияОСОрганизаций.Регистратор КАК Регистратор,
		|	СобытияОСОрганизаций.Период КАК Период,
		|	СобытияОСОрганизаций.Событие КАК Операция,
		|	СобытияОСОрганизаций.НомерДокумента КАК НомерДокумента,
		|	ВЫРАЗИТЬ(СобытияОСОрганизаций.НазваниеДокумента КАК СТРОКА(200)) КАК НазваниеДокумента
		|ИЗ
		|	РегистрСведений.СобытияОСОрганизаций КАК СобытияОСОрганизаций
		|ГДЕ
		|	СобытияОСОрганизаций.Организация = &Организация
		|	И СобытияОСОрганизаций.Событие.ВидСобытияОС <> &ВидСобытияОС
		|	И СобытияОСОрганизаций.ОсновноеСредство = &ОсновноеСредство
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СобытияОСОрганизаций.СуммаЗатратБУ КАК СуммаЗатратБУМодернизаций,
		|	0 КАК СуммаЗатратБУРемонтов,
		|	СобытияОСОрганизаций.Регистратор КАК Регистратор,
		|	СобытияОСОрганизаций.Период КАК Период,
		|	&ТекстМодернизация КАК Операция,
		|	СобытияОСОрганизаций.НомерДокумента КАК НомерДокумента,
		|	ВЫРАЗИТЬ(СобытияОСОрганизаций.НазваниеДокумента КАК СТРОКА(200)) КАК НазваниеДокумента
		|ИЗ
		|	РегистрСведений.СобытияОСОрганизаций КАК СобытияОСОрганизаций
		|ГДЕ
		|	СобытияОСОрганизаций.Организация = &Организация
		|	И СобытияОСОрганизаций.ОсновноеСредство = &ОсновноеСредство
		|	И СобытияОСОрганизаций.Регистратор ССЫЛКА Документ.МодернизацияОС2_4
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период,
		|	Регистратор";
		
		Результат = Запрос.Выполнить();
		
		СпособВыборки = ОбходРезультатаЗапроса.Прямой;
		ВыборкаРегистраторов = Результат.Выбрать(СпособВыборки);
		Пока ВыборкаРегистраторов.Следующий() Цикл
			
			СуммаМодернизаций = ?(ВыборкаРегистраторов.СуммаЗатратБУМодернизаций = NULL, 0, ВыборкаРегистраторов.СуммаЗатратБУМодернизаций);
			СуммаРемонтов = ?(ВыборкаРегистраторов.СуммаЗатратБУРемонтов = NULL, 0, ВыборкаРегистраторов.СуммаЗатратБУРемонтов);
			
			Если СуммаМодернизаций <> 0 Тогда
				СтрокаТаблицыМодернизаций = ТаблицаМодернизаций.Добавить();
				СтрокаТаблицыМодернизаций.ВидОперации = ВыборкаРегистраторов.Операция;
				СтрокаТаблицыМодернизаций.Название = ВыборкаРегистраторов.НазваниеДокумента;
				СтрокаТаблицыМодернизаций.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаРегистраторов.НомерДокумента);
				СтрокаТаблицыМодернизаций.Дата = ВыборкаРегистраторов.Период;
				СтрокаТаблицыМодернизаций.Сумма = СуммаМодернизаций;
			КонецЕсли;
			
			Если СуммаРемонтов <> 0 Тогда
				СтрокаТаблицыРемонтов = ТаблицаРемонтов.Добавить();
				СтрокаТаблицыРемонтов.ВидОперации = ВыборкаРегистраторов.Операция;
				СтрокаТаблицыРемонтов.Название = ВыборкаРегистраторов.НазваниеДокумента;
				СтрокаТаблицыРемонтов.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаРегистраторов.НомерДокумента);
				СтрокаТаблицыРемонтов.Дата = ВыборкаРегистраторов.Период;
				СтрокаТаблицыРемонтов.Сумма = СуммаРемонтов;
			КонецЕсли;
			
		КонецЦикла;
		
		КоличествоСтрок = Макс(ТаблицаМодернизаций.Количество(),ТаблицаРемонтов.Количество(),1); 
		Для СчетСтрок = 1 По КоличествоСтрок Цикл
			Если СчетСтрок <= ТаблицаМодернизаций.Количество() Тогда
				СтрокаТаблицы = ТаблицаМодернизаций.Получить(СчетСтрок - 1);
				СтрокаРазделов5и6.Параметры.Модернизация          = СтрокаТаблицы.ВидОперации;
				СтрокаРазделов5и6.Параметры.ДокМодернизации       = СтрокаТаблицы.Название;
				СтрокаРазделов5и6.Параметры.ДокМодернизацииДата   = СтрокаТаблицы.Дата;
				СтрокаРазделов5и6.Параметры.ДокМодернизацииНомер  = СтрокаТаблицы.Номер;
				СтрокаРазделов5и6.Параметры.ЗатратыНаМодернизацию = СтрокаТаблицы.Сумма; 
			Иначе
				СтрокаРазделов5и6.Параметры.Модернизация          = "";
				СтрокаРазделов5и6.Параметры.ДокМодернизации       = "";
				СтрокаРазделов5и6.Параметры.ДокМодернизацииДата   = "";
				СтрокаРазделов5и6.Параметры.ДокМодернизацииНомер  = "";
				СтрокаРазделов5и6.Параметры.ЗатратыНаМодернизацию = ""; 
			КонецЕсли;
			
			СтрокаРазделов5и6.Параметры.Ремонт          = "";
			СтрокаРазделов5и6.Параметры.ДокРемонта      = "";
			СтрокаРазделов5и6.Параметры.ДокРемонтаДата  = "";
			СтрокаРазделов5и6.Параметры.ДокРемонтаНомер = "";
			СтрокаРазделов5и6.Параметры.ЗатратыНаРемонт = "";
			ТабДок.Вывести(СтрокаРазделов5и6);
		КонецЦикла;
		
		ТабДок.Вывести(ШапкаРаздела7_1);
		ТаблицаДМ = ВыборкаОбъектов.ДрагоценныеМатериалы.Выгрузить();
		Если ИспользоватьУчетДМ И ТаблицаДМ.Количество() <> 0 Тогда
			Для Каждого Строка Из ТаблицаДМ Цикл
				СтрокиРаздела7_1.Параметры.Заполнить(Строка);
				ТабДок.Вывести(СтрокиРаздела7_1);
			КонецЦикла;
		Иначе
			Для к=0 По 6 Цикл // Вывод пустых строк для заполнения вручную
				ТабДок.Вывести(СтрокиРаздела7_1);
			КонецЦикла;
		КонецЕсли;
		ТабДок.Вывести(ШапкаРаздела7_2);
		ТабДок.Вывести(ПодвалСтраницы2);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, НомерСтрокиНачало, ОбъектыПечати, ВыборкаОбъектов.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьДанныеДляПечатнойФормыДА2(ПараметрыПечати, МассивОбъектов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ДатаСведений", ТекущаяДатаСеанса());    
	Запрос.УстановитьПараметр("МассивСубконто", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	МассивВидовСобытийМодернизации = Новый Массив();
	МассивВидовСобытийМодернизации.Добавить(Перечисления.ВидыСобытийОС.Модернизация);
	МассивВидовСобытийМодернизации.Добавить(Перечисления.ВидыСобытийОС.Достройка);
	МассивВидовСобытийМодернизации.Добавить(Перечисления.ВидыСобытийОС.Реконструкция);
	МассивВидовСобытийМодернизации.Добавить(Перечисления.ВидыСобытийОС.Дооборудование);
	МассивВидовСобытийМодернизации.Добавить(Перечисления.ВидыСобытийОС.ЧастичнаяЛиквидация);
	Запрос.УстановитьПараметр("МассивВидовСобытийМодернизации", МассивВидовСобытийМодернизации);
	Запрос.УстановитьПараметр("ТекстПринятиеКУчету",      НСтр("ru = 'Принятие к учету'"));
	Запрос.УстановитьПараметр("ТекстПеремещение",         НСтр("ru = 'Внутреннее перемещение'"));
	Запрос.УстановитьПараметр("ТекстСписание",            НСтр("ru = 'Списание'"));
	Запрос.УстановитьПараметр("ТекстПодготовкаКПередаче", НСтр("ru = 'Подготовка к передаче'"));
	Запрос.УстановитьПараметр("ТекстМодернизация", 		  НСтр("ru = 'Модернизация'"));
	
	МассивВидовСобытийРемонта = Новый Массив();
	МассивВидовСобытийРемонта.Добавить(Перечисления.ВидыСобытийОС.СреднийРемонт);
	МассивВидовСобытийРемонта.Добавить(Перечисления.ВидыСобытийОС.ТекущийРемонт);
	МассивВидовСобытийРемонта.Добавить(Перечисления.ВидыСобытийОС.КапитальныйРемонт);
	Запрос.УстановитьПараметр("МассивВидовСобытийРемонта", МассивВидовСобытийРемонта);
	
	#Область ТекстЗапроса
	Запрос.Текст ="ВЫБРАТЬ
	              |	ОбъектыЭксплуатации.Ссылка КАК ОС,
	              |	ОбъектыЭксплуатации.Код КАК Порядок
	              |ПОМЕСТИТЬ ТаблицаОС
	              |ИЗ
	              |	Справочник.ОбъектыЭксплуатации КАК ОбъектыЭксплуатации
	              |
	              |ИНДЕКСИРОВАТЬ ПО
	              |	ОС
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	СведенияПоОрганизации.ОсновноеСредство КАК ОС,
	              |	СведенияПоОрганизации.Организация КАК Организация
	              |ПОМЕСТИТЬ СведенияПоОрганизации
	              |ИЗ
	              |	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(&ДатаСведений, ОсновноеСредство В (&МассивОбъектов)) КАК СведенияПоОрганизации
	              |
	              |ИНДЕКСИРОВАТЬ ПО
	              |	ОС,
	              |	Организация
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              |	ОсновныеСредства.Ссылка КАК Ссылка,
	              |	ОсновныеСредства.Код КАК Код,
	              |	ОсновныеСредства.Наименование КАК Наименование,
	              |	ОсновныеСредства.ДатаВыпуска КАК ДатаВыпуска,
	              |	ОсновныеСредства.ЗаводскойНомер КАК ЗаводскойНомер,
	              |	ОсновныеСредства.Изготовитель КАК Изготовитель,
	              |	ОсновныеСредства.НаименованиеПолное КАК НаименованиеПолное,
	              |	ОсновныеСредства.НомерПаспорта КАК НомерПаспорта,
	              |	ЕСТЬNULL(СведенияПоОрганизации.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
	              |	ТаблицаОС.Порядок КАК Порядок
	              |ПОМЕСТИТЬ ДанныеСправочника
	              |ИЗ
	              |	ТаблицаОС КАК ТаблицаОС
	              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыЭксплуатации КАК ОсновныеСредства
	              |		ПО ТаблицаОС.ОС = ОсновныеСредства.Ссылка
	              |		ЛЕВОЕ СОЕДИНЕНИЕ СведенияПоОрганизации КАК СведенияПоОрганизации
	              |		ПО ТаблицаОС.ОС = СведенияПоОрганизации.ОС
	              |ГДЕ
	              |	ОсновныеСредства.ЭтоГруппа = ЛОЖЬ
	              |
	              |ИНДЕКСИРОВАТЬ ПО
	              |	Ссылка,
	              |	Организация
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ДанныеСправочника.Ссылка КАК ОсновноеСредство,
	              |	ДанныеСправочника.Код КАК Код,
	              |	ДанныеСправочника.Наименование КАК Наименование,
	              |	ДанныеСправочника.ДатаВыпуска КАК ДатаВыпуска,
	              |	ДанныеСправочника.ЗаводскойНомер КАК ЗаводскойНомер,
	              |	ДанныеСправочника.Изготовитель КАК Изготовитель,
	              |	ДанныеСправочника.НаименованиеПолное КАК НаименованиеПолное,
	              |	ДанныеСправочника.НомерПаспорта КАК НомерПаспорта,
	              |	ДанныеСправочника.Организация КАК Организация,
	              |	ДанныеСправочника.Порядок КАК Порядок,
	              |	МАКСИМУМ(ПервоначальныеСведенияОСБухгалтерскийУчет.Период) КАК ПервоначальныеСведенияОСБухУчетПериод
	              |ПОМЕСТИТЬ СведенияОСБухгалтерскийУчетПериоды
	              |ИЗ
	              |	ДанныеСправочника КАК ДанныеСправочника
	              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет КАК ПервоначальныеСведенияОСБухгалтерскийУчет
	              |		ПО ДанныеСправочника.Ссылка = ПервоначальныеСведенияОСБухгалтерскийУчет.ОсновноеСредство
	              |			И ДанныеСправочника.Организация = ПервоначальныеСведенияОСБухгалтерскийУчет.Организация
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ДанныеСправочника.Код,
	              |	ДанныеСправочника.Ссылка,
	              |	ДанныеСправочника.Наименование,
	              |	ДанныеСправочника.ДатаВыпуска,
	              |	ДанныеСправочника.ЗаводскойНомер,
	              |	ДанныеСправочника.Изготовитель,
	              |	ДанныеСправочника.НаименованиеПолное,
	              |	ДанныеСправочника.НомерПаспорта,
	              |	ДанныеСправочника.Организация,
	              |	ДанныеСправочника.Порядок
	              |
	              |ИНДЕКСИРОВАТЬ ПО
	              |	ОсновноеСредство,
	              |	Организация
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	              |	СчетаБухгалтерскогоУчетаОССрезПоследних.Организация КАК Организация,
				  | ВЫБОР
				  |		КОГДА СчетаБухгалтерскогоУчетаОССрезПоследних.ГруппаФинансовогоУчета = ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаВнеоборотныхАктивов.ПустаяСсылка)
				  |			ТОГДА СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета
				  |		ИНАЧЕ
				  |			СчетаБухгалтерскогоУчетаОССрезПоследних.ГруппаФинансовогоУчета.СчетУчета
				  |	КОНЕЦ КАК СчетУчета,
	              | ВЫБОР
				  |		КОГДА СчетаБухгалтерскогоУчетаОССрезПоследних.ГруппаФинансовогоУчета = ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаВнеоборотныхАктивов.ПустаяСсылка)
				  |			ТОГДА СчетаБухгалтерскогоУчетаОССрезПоследних.СчетНачисленияАмортизации
				  |		ИНАЧЕ
				  |			СчетаБухгалтерскогоУчетаОССрезПоследних.ГруппаФинансовогоУчета.СчетУчетаАмортизации
				  |	КОНЕЦ КАК СчетНачисленияАмортизации
	              |ПОМЕСТИТЬ СчетаОС
	              |ИЗ
	              |	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	              |			&ДатаСведений,
	              |			(ОсновноеСредство, Организация) В
	              |				(ВЫБРАТЬ
	              |					СведенияПоОрганизации.ОС,
	              |					СведенияПоОрганизации.Организация
	              |				ИЗ
	              |					СведенияПоОрганизации КАК СведенияПоОрганизации)) КАК СчетаБухгалтерскогоУчетаОССрезПоследних
				  |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ХозрасчетныйОстатки.Организация КАК Организация,
	              |	ХозрасчетныйОстатки.Субконто1 КАК ОсновноеСредство,
	              |	ХозрасчетныйОстатки.СуммаОстатокДт КАК СуммаОстаток
	              |ПОМЕСТИТЬ ОстатокСчетУчета
	              |ИЗ
	              |	РегистрБухгалтерии.Хозрасчетный.Остатки(
	              |			&ДатаСведений,
	              |			Счет В
	              |				(ВЫБРАТЬ
	              |					СчетаОС.СчетУчета
	              |				ИЗ
	              |					СчетаОС КАК СчетаОС),
	              |			&МассивСубконто,
	              |			) КАК ХозрасчетныйОстатки
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ХозрасчетныйОстатки.Организация КАК Организация,
	              |	ХозрасчетныйОстатки.Субконто1 КАК ОсновноеСредство,
	              |	ХозрасчетныйОстатки.СуммаОстатокКт КАК СуммаОстаток
	              |ПОМЕСТИТЬ ОстатокСчетАмортизации
	              |ИЗ
	              |	РегистрБухгалтерии.Хозрасчетный.Остатки(
	              |			&ДатаСведений,
	              |			Счет В
	              |				(ВЫБРАТЬ
	              |					СчетаОС.СчетНачисленияАмортизации
	              |				ИЗ
	              |					СчетаОС КАК СчетаОС),
	              |			&МассивСубконто,
	              |			) КАК ХозрасчетныйОстатки
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	СобытияОСОрганизаций.НазваниеДокумента КАК НазваниеДокумента,
	              |	СобытияОСОрганизаций.НомерДокумента КАК НомерДокумента,
	              |	СобытияОСОрганизаций.Период КАК Период,
	              |	СобытияОСОрганизаций.Период КАК ПериодОстатков,
	              |	СобытияОСОрганизаций.Событие КАК Событие,
	              |	СобытияОСОрганизаций.Событие.ВидСобытияОС КАК ВидСобытияОС,
	              |	СобытияОСОрганизаций.Регистратор КАК Регистратор,
	              |	СобытияОСОрганизаций.ОсновноеСредство КАК ОсновноеСредство
	              |ПОМЕСТИТЬ СобытияОС
	              |ИЗ
	              |	РегистрСведений.СобытияОСОрганизаций КАК СобытияОСОрганизаций
	              |ГДЕ
	              |	СобытияОСОрганизаций.ОсновноеСредство В
	              |			(ВЫБРАТЬ
	              |				СведенияПоОрганизации.ОС
	              |			ИЗ
	              |				СведенияПоОрганизации)
	              |	И СобытияОСОрганизаций.Период < &ДатаСведений
	              |	И СобытияОСОрганизаций.Организация В
	              |			(ВЫБРАТЬ
	              |				СведенияПоОрганизации.Организация
	              |			ИЗ
	              |				СведенияПоОрганизации)
	              |	И СобытияОСОрганизаций.Событие.ВидСобытияОС В (ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету), ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчетуСВводомВЭксплуатацию), ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВнутреннееПеремещение), ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание), ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Передача))
	              |
				  |ОБЪЕДИНИТЬ ВСЕ
				  |
				  |ВЫБРАТЬ
	              |	СобытияОСОрганизаций.НазваниеДокумента КАК НазваниеДокумента,
	              |	СобытияОСОрганизаций.НомерДокумента КАК НомерДокумента,
	              |	СобытияОСОрганизаций.Период КАК Период,
	              |	СобытияОСОрганизаций.Период КАК ПериодОстатков,
	              |	ВЫБОР ТИПЗНАЧЕНИЯ(СобытияОСОрганизаций.Регистратор) 
				  |		КОГДА ТИП(Документ.ПринятиеКУчетуОС2_4)
				  |			ТОГДА &ТекстПринятиеКУчету
				  |		КОГДА ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
				  |			ТОГДА &ТекстПринятиеКУчету
				  |		КОГДА ТИП(Документ.ПеремещениеОС2_4)
				  |			ТОГДА &ТекстПеремещение
				  |		КОГДА ТИП(Документ.СписаниеОС2_4)
				  |			ТОГДА &ТекстСписание
				  |		КОГДА ТИП(Документ.ПодготовкаКПередачеОС2_4)
				  |			ТОГДА &ТекстПодготовкаКПередаче
				  |	КОНЕЦ КАК Событие,
				  |	ВЫБОР ТИПЗНАЧЕНИЯ(СобытияОСОрганизаций.Регистратор) 
				  |		КОГДА ТИП(Документ.ПринятиеКУчетуОС2_4)
				  |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)
				  |		КОГДА ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
				  |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)
				  |		КОГДА ТИП(Документ.ПеремещениеОС2_4)
				  |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВнутреннееПеремещение)
				  |		КОГДА ТИП(Документ.СписаниеОС2_4)
				  |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание)
				  |		КОГДА ТИП(Документ.ПодготовкаКПередачеОС2_4)
				  |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Передача)
				  | 	КОНЕЦ КАК ВидСобытияОС,
	              |	СобытияОСОрганизаций.Регистратор КАК Регистратор,
	              |	СобытияОСОрганизаций.ОсновноеСредство КАК ОсновноеСредство
	              |ИЗ
	              |	РегистрСведений.СобытияОСОрганизаций КАК СобытияОСОрганизаций
	              |ГДЕ
	              |	СобытияОСОрганизаций.ОсновноеСредство В
	              |			(ВЫБРАТЬ
	              |				СведенияПоОрганизации.ОС
	              |			ИЗ
	              |				СведенияПоОрганизации)
	              |	И СобытияОСОрганизаций.Период < &ДатаСведений
	              |	И СобытияОСОрганизаций.Организация В
	              |			(ВЫБРАТЬ
	              |				СведенияПоОрганизации.Организация
	              |			ИЗ
	              |				СведенияПоОрганизации)
	              |	И ТИПЗНАЧЕНИЯ(СобытияОСОрганизаций.Регистратор) В (
				  |		ТИП(Документ.ПринятиеКУчетуОС2_4),
				  |		ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4),
				  |		ТИП(Документ.ПеремещениеОС2_4),
				  |		ТИП(Документ.СписаниеОС2_4),
				  |		ТИП(Документ.ПодготовкаКПередачеОС2_4))
				  |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	МестонахождениеОСБухгалтерскийУчет.Период КАК Период,
	              |	МестонахождениеОСБухгалтерскийУчет.МОЛ КАК МОЛ,
	              |	МестонахождениеОСБухгалтерскийУчет.Местонахождение КАК Местонахождение,
	              |	МестонахождениеОСБухгалтерскийУчет.ОсновноеСредство
	              |ПОМЕСТИТЬ МестонахождениеОСБухгалтерскийУчет
	              |ИЗ
	              |	РегистрСведений.МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОСБухгалтерскийУчет
	              |ГДЕ
	              |	МестонахождениеОСБухгалтерскийУчет.ОсновноеСредство В
	              |			(ВЫБРАТЬ
	              |				СведенияПоОрганизации.ОС
	              |			ИЗ
	              |				СведенияПоОрганизации)
	              |	И МестонахождениеОСБухгалтерскийУчет.Организация В
	              |			(ВЫБРАТЬ
	              |				СведенияПоОрганизации.Организация
	              |			ИЗ
	              |				СведенияПоОрганизации)
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	СобытияОС.Период КАК Период,
	              |	МАКСИМУМ(МестонахождениеОСБухгалтерскийУчет.Период) КАК ПоследнийПериод,
	              |	СобытияОС.ОсновноеСредство КАК ОсновноеСредство
	              |ПОМЕСТИТЬ МестонахождениеОСБухгалтерскийУчетСрезПоследнихПериодов
	              |ИЗ
	              |	СобытияОС КАК СобытияОС
	              |		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОСБухгалтерскийУчет
	              |		ПО СобытияОС.Период >= МестонахождениеОСБухгалтерскийУчет.Период
	              |			И СобытияОС.ОсновноеСредство = МестонахождениеОСБухгалтерскийУчет.ОсновноеСредство
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	СобытияОС.Период,
	              |	СобытияОС.ОсновноеСредство
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	МестонахождениеОСБухгалтерскийУчетСрезПоследнихПериодов.Период КАК Период,
	              |	МестонахождениеОСБухгалтерскийУчет.МОЛ КАК МОЛ,
	              |	МестонахождениеОСБухгалтерскийУчет.Местонахождение КАК Местонахождение,
	              |	МестонахождениеОСБухгалтерскийУчетСрезПоследнихПериодов.ОсновноеСредство КАК ОсновноеСредство
	              |ПОМЕСТИТЬ МестонахождениеОСБухгалтерскийУчетСрезПоследних
	              |ИЗ
	              |	МестонахождениеОСБухгалтерскийУчетСрезПоследнихПериодов КАК МестонахождениеОСБухгалтерскийУчетСрезПоследнихПериодов
	              |		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОСБухгалтерскийУчет
	              |		ПО МестонахождениеОСБухгалтерскийУчетСрезПоследнихПериодов.ПоследнийПериод = МестонахождениеОСБухгалтерскийУчет.Период
	              |			И МестонахождениеОСБухгалтерскийУчетСрезПоследнихПериодов.ОсновноеСредство = МестонахождениеОСБухгалтерскийУчет.ОсновноеСредство
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	СчетаБухгалтерскогоУчетаОС.Период КАК Период,
				  | ВЫБОР
				  |		КОГДА СчетаБухгалтерскогоУчетаОС.ГруппаФинансовогоУчета = ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаВнеоборотныхАктивов.ПустаяСсылка)
				  |			ТОГДА СчетаБухгалтерскогоУчетаОС.СчетУчета
				  |		ИНАЧЕ
				  |			СчетаБухгалтерскогоУчетаОС.ГруппаФинансовогоУчета.СчетУчета
				  |	КОНЕЦ КАК СчетУчета,
	              | ВЫБОР
				  |		КОГДА СчетаБухгалтерскогоУчетаОС.ГруппаФинансовогоУчета = ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаВнеоборотныхАктивов.ПустаяСсылка)
				  |			ТОГДА СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации
				  |		ИНАЧЕ
				  |			СчетаБухгалтерскогоУчетаОС.ГруппаФинансовогоУчета.СчетУчетаАмортизации
				  |	КОНЕЦ КАК СчетНачисленияАмортизации,
	              |	СчетаБухгалтерскогоУчетаОС.ОсновноеСредство КАК ОсновноеСредство
	              |ПОМЕСТИТЬ СчетаБухгалтерскогоУчетаОС
	              |ИЗ
	              |	РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаБухгалтерскогоУчетаОС
	              |ГДЕ
	              |	СчетаБухгалтерскогоУчетаОС.ОсновноеСредство В
	              |			(ВЫБРАТЬ
	              |				СведенияПоОрганизации.ОС
	              |			ИЗ
	              |				СведенияПоОрганизации)
	              |	И СчетаБухгалтерскогоУчетаОС.Организация В
	              |			(ВЫБРАТЬ
	              |				СведенияПоОрганизации.Организация
	              |			ИЗ
	              |				СведенияПоОрганизации)
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	СобытияОС.ПериодОстатков КАК ПериодОстатков,
	              |	МАКСИМУМ(СчетаБухгалтерскогоУчетаОС.Период) КАК ПоследнийПериод,
	              |	СобытияОС.ОсновноеСредство КАК ОсновноеСредство
	              |ПОМЕСТИТЬ СчетаБухгалтерскогоУчетаОССрезПоследнихПериодов
	              |ИЗ
	              |	СобытияОС КАК СобытияОС
	              |		ЛЕВОЕ СОЕДИНЕНИЕ СчетаБухгалтерскогоУчетаОС КАК СчетаБухгалтерскогоУчетаОС
	              |		ПО СобытияОС.ПериодОстатков >= СчетаБухгалтерскогоУчетаОС.Период
	              |			И СобытияОС.ОсновноеСредство = СчетаБухгалтерскогоУчетаОС.ОсновноеСредство
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	СобытияОС.ПериодОстатков,
	              |	СобытияОС.ОсновноеСредство
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	СчетаБухгалтерскогоУчетаОССрезПоследнихПериодов.ПериодОстатков КАК ПериодОстатков,
	              |	СчетаБухгалтерскогоУчетаОС.СчетУчета КАК СчетУчета,
	              |	СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации КАК СчетНачисленияАмортизации,
	              |	СчетаБухгалтерскогоУчетаОССрезПоследнихПериодов.ОсновноеСредство КАК ОсновноеСредство
	              |ПОМЕСТИТЬ СчетаБухгалтерскогоУчетаОССрезПоследних
	              |ИЗ
	              |	СчетаБухгалтерскогоУчетаОССрезПоследнихПериодов КАК СчетаБухгалтерскогоУчетаОССрезПоследнихПериодов
	              |		ЛЕВОЕ СОЕДИНЕНИЕ СчетаБухгалтерскогоУчетаОС КАК СчетаБухгалтерскогоУчетаОС
	              |		ПО СчетаБухгалтерскогоУчетаОССрезПоследнихПериодов.ПоследнийПериод = СчетаБухгалтерскогоУчетаОС.Период
	              |			И СчетаБухгалтерскогоУчетаОССрезПоследнихПериодов.ОсновноеСредство = СчетаБухгалтерскогоУчетаОС.ОсновноеСредство
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ХозрасчетныйОстаткиИОбороты.Период КАК Период,
	              |	ХозрасчетныйОстаткиИОбороты.Счет КАК Счет,
	              |	МАКСИМУМ(ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт) КАК СуммаКонечныйОстатокДт,
	              |	МАКСИМУМ(ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокКт) КАК СуммаКонечныйОстатокКт,
	              |	СУММА(ХозрасчетныйОстаткиИОбороты.СуммаОборотДт) КАК СуммаОборотДт,
	              |	СУММА(ХозрасчетныйОстаткиИОбороты.СуммаОборотКт) КАК СуммаОборотКт,
	              |	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК ОсновноеСредство
	              |ПОМЕСТИТЬ ХозрасчетныйОстаткиИОбороты
	              |ИЗ
	              |	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	              |			,
	              |			&ДатаСведений,
	              |			Регистратор,
	              |			,
	              |			Счет В
	              |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	              |					СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета
	              |				ИЗ
	              |					СчетаБухгалтерскогоУчетаОССрезПоследних
	              |			
	              |				ОБЪЕДИНИТЬ ВСЕ
	              |			
	              |				ВЫБРАТЬ РАЗЛИЧНЫЕ
	              |					СчетаБухгалтерскогоУчетаОССрезПоследних.СчетНачисленияАмортизации
	              |				ИЗ
	              |					СчетаБухгалтерскогоУчетаОССрезПоследних),
	              |			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	              |			Организация В
	              |					(ВЫБРАТЬ
	              |						СведенияПоОрганизации.Организация
	              |					ИЗ
	              |						СведенияПоОрганизации)
	              |				И Субконто1 В
	              |					(ВЫБРАТЬ
	              |						СведенияПоОрганизации.ОС
	              |					ИЗ
	              |						СведенияПоОрганизации)) КАК ХозрасчетныйОстаткиИОбороты
	              |ГДЕ
	              |	НЕ ХозрасчетныйОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	              |
				  |СГРУППИРОВАТЬ ПО
				  |	ХозрасчетныйОстаткиИОбороты.Период,
				  |	ХозрасчетныйОстаткиИОбороты.Счет,
				  |	ХозрасчетныйОстаткиИОбороты.Субконто1
				  |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	СобытияОС.ПериодОстатков КАК ПериодОстатков,
	              |	ХозрасчетныйОстаткиИОбороты.Счет КАК Счет,
	              |	МАКСИМУМ(ХозрасчетныйОстаткиИОбороты.Период) КАК ПоследнийПериод,
	              |	СобытияОС.ОсновноеСредство КАК ОсновноеСредство
	              |ПОМЕСТИТЬ ХозрасчетныйОстаткиИОборотыСрезПоследнихПериодов
	              |ИЗ
	              |	СобытияОС КАК СобытияОС
	              |		ЛЕВОЕ СОЕДИНЕНИЕ ХозрасчетныйОстаткиИОбороты КАК ХозрасчетныйОстаткиИОбороты
	              |		ПО СобытияОС.ПериодОстатков >= ХозрасчетныйОстаткиИОбороты.Период
	              |			И СобытияОС.ОсновноеСредство = ХозрасчетныйОстаткиИОбороты.ОсновноеСредство
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	СобытияОС.ПериодОстатков,
	              |	ХозрасчетныйОстаткиИОбороты.Счет,
	              |	СобытияОС.ОсновноеСредство
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ХозрасчетныйОстаткиИОборотыСрезПоследнихПериодов.ПериодОстатков КАК ПериодОстатков,
	              |	ХозрасчетныйОстаткиИОбороты.Счет КАК Счет,
	              |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК СуммаКонечныйОстатокДт,
	              |	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокКт КАК СуммаКонечныйОстатокКт,
	              |	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт КАК СуммаОборотДт,
	              |	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК СуммаОборотКт,
	              |	ХозрасчетныйОстаткиИОборотыСрезПоследнихПериодов.ОсновноеСредство КАК ОсновноеСредство
	              |ПОМЕСТИТЬ ХозрасчетныйОстаткиИОборотыСрезПоследних
	              |ИЗ
	              |	ХозрасчетныйОстаткиИОборотыСрезПоследнихПериодов КАК ХозрасчетныйОстаткиИОборотыСрезПоследнихПериодов
	              |		ЛЕВОЕ СОЕДИНЕНИЕ ХозрасчетныйОстаткиИОбороты КАК ХозрасчетныйОстаткиИОбороты
	              |		ПО ХозрасчетныйОстаткиИОборотыСрезПоследнихПериодов.Счет = ХозрасчетныйОстаткиИОбороты.Счет
	              |			И ХозрасчетныйОстаткиИОборотыСрезПоследнихПериодов.ПоследнийПериод = ХозрасчетныйОстаткиИОбороты.Период
	              |			И ХозрасчетныйОстаткиИОборотыСрезПоследнихПериодов.ОсновноеСредство = ХозрасчетныйОстаткиИОбороты.ОсновноеСредство
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	СведенияОСБухгалтерскийУчетПериоды.ОсновноеСредство КАК ОсновноеСредство,
	              |	СведенияОСБухгалтерскийУчетПериоды.Код КАК Код,
	              |	СведенияОСБухгалтерскийУчетПериоды.Наименование КАК Наименование,
	              |	СведенияОСБухгалтерскийУчетПериоды.ДатаВыпуска КАК ДатаВыпуска,
	              |	СведенияОСБухгалтерскийУчетПериоды.ЗаводскойНомер КАК ЗаводскойНомер,
	              |	СведенияОСБухгалтерскийУчетПериоды.Изготовитель КАК ИзготовительАктива,
	              |	СведенияОСБухгалтерскийУчетПериоды.НаименованиеПолное КАК НаименованиеАктива,
	              |	СведенияОСБухгалтерскийУчетПериоды.НомерПаспорта КАК НомерПаспорта,
	              |	СведенияОСБухгалтерскийУчетПериоды.Организация КАК Организация,
	              |	СведенияОСБухгалтерскийУчетПериоды.Порядок КАК Порядок,
	              |	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	              |	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	              |	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.КоэффициентАмортизации КАК КоэффициентАмортизации,
	              |	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.КоэффициентУскорения КАК КоэффициентУскорения,
	              |	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.Период КАК Период,
	              |	СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.СчетУчета КАК СчетУчета,
	              |	СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.СчетНачисленияАмортизации КАК СчетНачисленияАмортизации,
	              |	СведенияОСБухгалтерскийУчет.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	              |	СведенияОСБухгалтерскийУчет.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	              |	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	              |	МестонахождениеОСБухгалтерскийУчетСрезПоследних.Местонахождение КАК Местонахождение,
	              |	МестонахождениеОСБухгалтерскийУчетСрезПоследних.МОЛ КАК МОЛ,
	              |	МестонахождениеОСБухгалтерскийУчетСрезПоследних.Местонахождение.Наименование КАК МестонахождениеОС,
	              |	МестонахождениеОСБухгалтерскийУчетСрезПоследних.Местонахождение.Наименование КАК Подразделение,
	              |	СведенияОСБухгалтерскийУчет.ИнвентарныйНомер КАК ИнвентарныйНомер,
	              |	СведенияОСБухгалтерскийУчет.ГруппаОС КАК ГруппаОС,
	              |	ВЫРАЗИТЬ(СведенияОСБухгалтерскийУчет.ОсновноеСредство.Изготовитель КАК СТРОКА(1000)) КАК ИзготовительОС,
	              |	СведенияОСБухгалтерскийУчет.ОсновноеСредство.ДатаВыпуска КАК ГодВыпуска,
	              |	ЕСТЬNULL(ОстатокСчетУчета.СуммаОстаток, 0) КАК НакопленнаяСтоимость,
	              |	ЕСТЬNULL(ОстатокСчетАмортизации.СуммаОстаток, 0) КАК НакопленнаяАмортизация,
				  |	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость
	              |ИЗ
	              |	СведенияОСБухгалтерскийУчетПериоды КАК СведенияОСБухгалтерскийУчетПериоды
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет КАК СведенияОСБухгалтерскийУчет
	              |		ПО СведенияОСБухгалтерскийУчетПериоды.ОсновноеСредство = СведенияОСБухгалтерскийУчет.ОсновноеСредство
	              |			И СведенияОСБухгалтерскийУчетПериоды.Организация = СведенияОСБухгалтерскийУчет.Организация
	              |			И СведенияОСБухгалтерскийУчетПериоды.ПервоначальныеСведенияОСБухУчетПериод = СведенияОСБухгалтерскийУчет.Период
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	              |				&ДатаСведений,
	              |				(Организация, ОсновноеСредство) В
	              |					(ВЫБРАТЬ
	              |						Таб.Организация,
	              |						Таб.ОсновноеСредство
	              |					ИЗ
	              |						СведенияОСБухгалтерскийУчетПериоды КАК Таб)) КАК ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних
	              |		ПО СведенияОСБухгалтерскийУчетПериоды.ОсновноеСредство = ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство
	              |			И СведенияОСБухгалтерскийУчетПериоды.Организация = ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.Организация
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	              |				&ДатаСведений,
	              |				(Организация, ОсновноеСредство) В
	              |					(ВЫБРАТЬ
	              |						Таб.Организация,
	              |						Таб.ОсновноеСредство
	              |					ИЗ
	              |						СведенияОСБухгалтерскийУчетПериоды КАК Таб)) КАК СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних
	              |		ПО СведенияОСБухгалтерскийУчетПериоды.ОсновноеСредство = СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.ОсновноеСредство
	              |			И СведенияОСБухгалтерскийУчетПериоды.Организация = СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.Организация
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(
	              |				&ДатаСведений,
	              |				(Организация, ОсновноеСредство) В
	              |					(ВЫБРАТЬ
	              |						Таб.Организация,
	              |						Таб.ОсновноеСредство
	              |					ИЗ
	              |						СведенияОСБухгалтерскийУчетПериоды КАК Таб)) КАК МестонахождениеОСБухгалтерскийУчетСрезПоследних
	              |		ПО СведенияОСБухгалтерскийУчетПериоды.ОсновноеСредство = МестонахождениеОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство
	              |			И СведенияОСБухгалтерскийУчетПериоды.Организация = МестонахождениеОСБухгалтерскийУчетСрезПоследних.Организация
	              |		ЛЕВОЕ СОЕДИНЕНИЕ ОстатокСчетУчета КАК ОстатокСчетУчета
	              |		ПО СведенияОСБухгалтерскийУчетПериоды.ОсновноеСредство = ОстатокСчетУчета.ОсновноеСредство
	              |			И СведенияОСБухгалтерскийУчетПериоды.Организация = ОстатокСчетУчета.Организация
	              |		ЛЕВОЕ СОЕДИНЕНИЕ ОстатокСчетАмортизации КАК ОстатокСчетАмортизации
	              |		ПО СведенияОСБухгалтерскийУчетПериоды.ОсновноеСредство = ОстатокСчетАмортизации.ОсновноеСредство
	              |			И СведенияОСБухгалтерскийУчетПериоды.Организация = ОстатокСчетАмортизации.Организация
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ТИПЗНАЧЕНИЯ(СобытияОС.Регистратор) КАК РегистраторТип,
	              |	СобытияОС.Регистратор.Номер КАК РегистраторНомер,
	              |	СобытияОС.Регистратор.Дата КАК РегистраторДата,
	              |	СобытияОС.Период КАК Период,
				  |	СобытияОС.Событие КАК Событие,
				  |	СобытияОС.ВидСобытияОС КАК ВидСобытияОС,
	              |	МестонахождениеОСБухгалтерскийУчетСрезПоследних.Местонахождение КАК Местонахождение,
	              |	ВЫБОР
	              |		КОГДА СобытияОС.ВидСобытияОС В (ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание), ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Передача))
	              |			ТОГДА ЕСТЬNULL(СтоимостьОС.СуммаОборотКт, 0) - ЕСТЬNULL(АмортизацияОС.СуммаОборотДт, 0)
	              |		ИНАЧЕ ЕСТЬNULL(СтоимостьОС.СуммаКонечныйОстатокДт, 0) - ЕСТЬNULL(АмортизацияОС.СуммаКонечныйОстатокКт, 0)
	              |	КОНЕЦ КАК ОстаточнаяСтоимость,
	              |	СобытияОС.ОсновноеСредство КАК ОсновноеСредство
	              |ИЗ
	              |	СобытияОС КАК СобытияОС
	              |		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОСБухгалтерскийУчетСрезПоследних КАК МестонахождениеОСБухгалтерскийУчетСрезПоследних
	              |		ПО СобытияОС.Период = МестонахождениеОСБухгалтерскийУчетСрезПоследних.Период
	              |			И СобытияОС.ОсновноеСредство = МестонахождениеОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство
	              |		ЛЕВОЕ СОЕДИНЕНИЕ СчетаБухгалтерскогоУчетаОССрезПоследних КАК СчетаБухгалтерскогоУчетаОССрезПоследних
	              |		ПО СобытияОС.ПериодОстатков = СчетаБухгалтерскогоУчетаОССрезПоследних.ПериодОстатков
	              |			И СобытияОС.ОсновноеСредство = СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство
	              |		ЛЕВОЕ СОЕДИНЕНИЕ ХозрасчетныйОстаткиИОборотыСрезПоследних КАК СтоимостьОС
	              |		ПО (СчетаБухгалтерскогоУчетаОССрезПоследних.ПериодОстатков = СтоимостьОС.ПериодОстатков)
	              |			И (СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета = СтоимостьОС.Счет)
	              |			И СобытияОС.ОсновноеСредство = СтоимостьОС.ОсновноеСредство
	              |		ЛЕВОЕ СОЕДИНЕНИЕ ХозрасчетныйОстаткиИОборотыСрезПоследних КАК АмортизацияОС
	              |		ПО (СчетаБухгалтерскогоУчетаОССрезПоследних.ПериодОстатков = АмортизацияОС.ПериодОстатков)
	              |			И (СчетаБухгалтерскогоУчетаОССрезПоследних.СчетНачисленияАмортизации = АмортизацияОС.Счет)
	              |			И СобытияОС.ОсновноеСредство = АмортизацияОС.ОсновноеСредство
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              |	СобытияОС.Регистратор КАК Регистратор,
	              |	СобытияОС.Период КАК Период,
	              |	СобытияОС.НомерДокумента КАК НомерДокумента,
	              |	СобытияОС.СуммаЗатратБУ КАК СуммаЗатрат,
	              |	ВЫБОР
	              |		КОГДА СобытияОС.Событие.ВидСобытияОС В (&МассивВидовСобытийМодернизации)
	              |			ТОГДА ""Модернизация""
	              |		КОГДА СобытияОС.Событие.ВидСобытияОС В (&МассивВидовСобытийРемонта)
	              |			ТОГДА ""Ремонт""
	              |		ИНАЧЕ """"
	              |	КОНЕЦ КАК СодержимоеСтроки,
	              |	СобытияОС.ОсновноеСредство КАК ОсновноеСредство
	              |ИЗ
	              |	РегистрСведений.СобытияОСОрганизаций КАК СобытияОС
	              |ГДЕ
	              |	(СобытияОС.ОсновноеСредство, СобытияОС.Организация) В
	              |			(ВЫБРАТЬ
	              |				СведенияПоОрганизации.ОС,
	              |				СведенияПоОрганизации.Организация
	              |			ИЗ
	              |				СведенияПоОрганизации)
	              |	И СобытияОС.Период < &ДатаСведений
	              |
				  |ОБЪЕДИНИТЬ ВСЕ
				  |
				  |ВЫБРАТЬ 
	              |	СобытияОС.Регистратор КАК Регистратор,
	              |	СобытияОС.Период КАК Период,
	              |	СобытияОС.НомерДокумента КАК НомерДокумента,
	              |	СобытияОС.СуммаЗатратБУ КАК СуммаЗатрат,
	              |	&ТекстМодернизация КАК СодержимоеСтроки,
	              |	СобытияОС.ОсновноеСредство КАК ОсновноеСредство
	              |ИЗ
	              |	РегистрСведений.СобытияОСОрганизаций КАК СобытияОС
	              |ГДЕ
	              |	(СобытияОС.ОсновноеСредство, СобытияОС.Организация) В
	              |			(ВЫБРАТЬ
	              |				СведенияПоОрганизации.ОС,
	              |				СведенияПоОрганизации.Организация
	              |			ИЗ
	              |				СведенияПоОрганизации)
	              |	И СобытияОС.Период < &ДатаСведений
				  |	И СобытияОС.Регистратор ССЫЛКА Документ.МодернизацияОС2_4
				  |
				  |УПОРЯДОЧИТЬ ПО
	              |	Период
				  |
				  |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
				  |	ДрагМатериалы.Ссылка КАК ОсновноеСредство,
				  |	ДрагМатериалы.ДрагоценныйМатериал КАК ДрагМатериал,
				  |	ДрагМатериалы.Количество КАК КоличествоДМ,
				  |	ДрагМатериалы.ДрагоценныйМатериал.ЕдиницаИзмерения КАК ЕдиницаИзмерения
				  |ИЗ
				  |	Справочник.ОбъектыЭксплуатации.ДрагоценныеМатериалы КАК ДрагМатериалы
				  |
				  |ГДЕ
				  | ДрагМатериалы.Ссылка В  
				  |			(ВЫБРАТЬ
	              |				СведенияПоОрганизации.ОС
	              |			ИЗ
	              |				СведенияПоОрганизации)
	              |";
				  
	#КонецОбласти
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Возврат Новый Структура(  
		"РезультатПоОС, РезультатПоРемонту, РезультатПоПереоценке, РезультатПоСобытиям, РезультатДрагМатериалы",
		РезультатыЗапроса[17], РезультатыЗапроса[19], Неопределено, РезультатыЗапроса[18], РезультатыЗапроса[20]);

КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбъектыЭксплуатации.Ссылка
	|ИЗ
	|	Справочник.ОбъектыЭксплуатации КАК ОбъектыЭксплуатации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних КАК ПервоначальныеСведенияОС
	|		ПО ОбъектыЭксплуатации.Ссылка = ПервоначальныеСведенияОС.ОсновноеСредство
	|ГДЕ
	|	ОбъектыЭксплуатации.ГруппаОС = ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ПустаяСсылка)
	|				И ПервоначальныеСведенияОС.ГруппаОС <> ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ПустаяСсылка)
	|			ИЛИ ОбъектыЭксплуатации.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПустаяСсылка)
	|				И ПервоначальныеСведенияОС.АмортизационнаяГруппа <> ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПустаяСсылка)
	|			ИЛИ ОбъектыЭксплуатации.ИнвентарныйНомер = """"
	|				И ПервоначальныеСведенияОС.ИнвентарныйНомер <> """"
	|			ИЛИ ОбъектыЭксплуатации.КодПоОКОФ = ЗНАЧЕНИЕ(Справочник.ОбщероссийскийКлассификаторОсновныхФондов.ПустаяСсылка)
	|				И ПервоначальныеСведенияОС.КодПоОКОФ <> ЗНАЧЕНИЕ(Справочник.ОбщероссийскийКлассификаторОсновныхФондов.ПустаяСсылка)
	|			ИЛИ ОбъектыЭксплуатации.ШифрПоЕНАОФ = ЗНАЧЕНИЕ(Справочник.ЕдиныеНормыАмортизационныхОтчисленийОсновныхФондов.ПустаяСсылка)
	|				И ПервоначальныеСведенияОС.ШифрПоЕНАОФ <> ЗНАЧЕНИЕ(Справочник.ЕдиныеНормыАмортизационныхОтчисленийОсновныхФондов.ПустаяСсылка)";
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "Справочник.ОбъектыЭксплуатации";
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ПараметрыТаблицыДляОбработки = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуСсылокДляОбработки(
										Параметры.Очередь, ПолноеИмяОбъекта, МенеджерВременныхТаблиц);

	Если НЕ ПараметрыТаблицыДляОбработки.ЕстьДанныеДляОбработки Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	Если НЕ ПараметрыТаблицыДляОбработки.ЕстьЗаписиВоВременнойТаблице Тогда
		Параметры.ОбработкаЗавершена = Ложь;
		Возврат;
	КонецЕсли; 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДляОбработки.Ссылка,
	|	ОбъектыЭксплуатации.ВерсияДанных
	|ИЗ
	|	ВТДляОбработки КАК ДанныеДляОбработки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыЭксплуатации КАК ОбъектыЭксплуатации
	|		ПО (ОбъектыЭксплуатации.Ссылка = ДанныеДляОбработки.Ссылка)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВТДляОбработки", ПараметрыТаблицыДляОбработки.ИмяВременнойТаблицы);
	
	ТекстЗапросаПервоначальныеСведенияОС = 
	"ВЫБРАТЬ
	|	ПервоначальныеСведенияОС.ГруппаОС,
	|	ПервоначальныеСведенияОС.АмортизационнаяГруппа,
	|	ПервоначальныеСведенияОС.ИнвентарныйНомер,
	|	ПервоначальныеСведенияОС.КодПоОКОФ,
	|	ПервоначальныеСведенияОС.ШифрПоЕНАОФ,
	|	Заблокировано_ПервоначальныеСведения.Регистратор ЕСТЬ NULL КАК ЧитаемыеДанныеОбновлены
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(, ОсновноеСредство = &ОсновноеСредство) КАК ПервоначальныеСведенияОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаблокировано_ПервоначальныеСведения КАК Заблокировано_ПервоначальныеСведения
	|		ПО (Заблокировано_ПервоначальныеСведения.Регистратор = ПервоначальныеСведенияОС.Регистратор)";
	
	ПараметрыТаблицыЗаблокированныхДанных = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуЗаблокированныхДляЧтенияИИзмененияДанных(
												Параметры.Очередь, "РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет", МенеджерВременныхТаблиц);
	
	ТекстЗапросаПервоначальныеСведенияОС = СтрЗаменить(
		ТекстЗапросаПервоначальныеСведенияОС, "ВТЗаблокировано_ПервоначальныеСведения", ПараметрыТаблицыЗаблокированныхДанных.ИмяВременнойТаблицы);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
 	Пока Выборка.Следующий() Цикл
 		
 		НачатьТранзакцию();
		
 		Попытка
			
 			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить("Справочник.ОбъектыЭксплуатации");
 			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет");
 			ЭлементБлокировки.УстановитьЗначение("ОсновноеСредство", Выборка.Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
 			Блокировка.Заблокировать();
 			
			ДанныеОбъекта = ОбновлениеИнформационнойБазыУТ.ПроверитьПолучитьОбъект(Выборка.Ссылка, Выборка.ВерсияДанных, Параметры.Очередь);
			Если ДанныеОбъекта <> Неопределено Тогда
			
				Запрос = Новый Запрос(ТекстЗапросаПервоначальныеСведенияОС);
				Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
				Запрос.УстановитьПараметр("ОсновноеСредство", Выборка.Ссылка);
				
				Результат = Запрос.Выполнить();
				Если НЕ Результат.Пустой() Тогда
					
					ВыборкаПервоначальныеСведенияОС = Результат.Выбрать();
					ВыборкаПервоначальныеСведенияОС.Следующий();
					Если ВыборкаПервоначальныеСведенияОС.ЧитаемыеДанныеОбновлены Тогда
						
						Если НЕ ЗначениеЗаполнено(ДанныеОбъекта.ГруппаОС) Тогда
							ДанныеОбъекта.ГруппаОС = ВыборкаПервоначальныеСведенияОС.ГруппаОС;
						КонецЕсли; 
						Если НЕ ЗначениеЗаполнено(ДанныеОбъекта.АмортизационнаяГруппа) Тогда
							ДанныеОбъекта.АмортизационнаяГруппа = ВыборкаПервоначальныеСведенияОС.АмортизационнаяГруппа;
						КонецЕсли; 
						Если НЕ ЗначениеЗаполнено(ДанныеОбъекта.ИнвентарныйНомер) Тогда
							ДанныеОбъекта.ИнвентарныйНомер = ВыборкаПервоначальныеСведенияОС.ИнвентарныйНомер;
						КонецЕсли; 
						Если НЕ ЗначениеЗаполнено(ДанныеОбъекта.КодПоОКОФ) Тогда
							ДанныеОбъекта.КодПоОКОФ = ВыборкаПервоначальныеСведенияОС.КодПоОКОФ;
						КонецЕсли; 
						Если НЕ ЗначениеЗаполнено(ДанныеОбъекта.ШифрПоЕНАОФ) Тогда
							ДанныеОбъекта.ШифрПоЕНАОФ = ВыборкаПервоначальныеСведенияОС.ШифрПоЕНАОФ;
						КонецЕсли; 
						
						Если ДанныеОбъекта.Модифицированность() Тогда
							ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДанныеОбъекта);
						Иначе
							ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
						КонецЕсли;
						
					КонецЕсли; 
					
				Иначе
					ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
				КонецЕсли; 
				
			КонецЕсли;
	
			ЗафиксироватьТранзакцию();
			
 		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru = 'Не удалось обработать объект: %Ссылка% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", Выборка.Ссылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
									УровеньЖурналаРегистрации.Предупреждение,
									Выборка.Ссылка.Метаданные(),
									Выборка.Ссылка,
									ТекстСообщения);
									
 		КонецПопытки;
 
 	КонецЦикла;
 		
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
