
&НаСервере
Процедура СоздатьНоменклатуруНаСервере()
			
	Путь	= КаталогВременныхФайлов() + "temp.xlsx";
	Файл	= ПолучитьИзВременногоХранилища(АдресХранения);
	
	Файл.Записать(Путь);
	
	ТабДок = Новый ТабличныйДокумент; 
	ТабДок.Прочитать(Путь);

	ПЗ = Новый ПостроительЗапроса;
	ПЗ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДок.Область());//передаем ТЗ
	ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
	ПЗ.ЗаполнитьНастройки();
	ПЗ.Выполнить();
	ТаблицаДанных = ПЗ.Результат.Выгрузить();   
	
	Если ТаблицаДанных.Количество() > 0 Тогда 
		
		Для Каждого СтрТД Из ТаблицаДанных Цикл 
			
			Если Не ЗначениеЗаполнено(СтрТД.Код) Тогда
				Прервать;				
			КонецЕсли;
			
			Штрихкод = СтрЗаменить(СтрТД.Штрихкод, " ", "");
			
			НаборЗаписей = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Штрихкод.Установить(Штрихкод);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() > 0 Тогда
				Сообщить("У данного штрихкода уже есть номенклатура - " + НаборЗаписей[0].Номенклатура.Наименование) 
			Иначе
				
				Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(СтрТД.Наименование, Истина); 
				
				Если Не ЗначениеЗаполнено(Номенклатура) Тогда 
					
					Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
					
                    Номенклатура.Наименование       = СтрТД.Наименование; 
					Номенклатура.НаименованиеПолное = СтрТД.НаименованиеДляПечати; 
					Номенклатура.ВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
					Номенклатура.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать;
					Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар; 
					
					Если СтрТД.СтавкаНДС = "БезНДС" Или СтрТД.СтавкаНДС = "" Тогда 
						Номенклатура.СтавкаНДС          = Справочники.СтавкиНДС.БезНДС;
					ИначеЕсли СтрТД.СтавкаНДС = "12" Или СтрТД.СтавкаНДС = "12%" Тогда
						Номенклатура.СтавкаНДС          = Справочники.СтавкиНДС.НДС12;
					КонецЕсли;
					Номенклатура.Артикул            = СтрТД.Артикул;
					Номенклатура.ВидНоменклатуры    = Справочники.ВидыНоменклатуры.НайтиПоНаименованию(СтрТД.ВидНоменклатуры);
					Номенклатура.Качество           = Перечисления.ГрадацииКачества.Новый;
					
					Если ЗначениеЗаполнено(СтрТД.ГруппаСписка) Тогда
						Родитель = Справочники.Номенклатура.НайтиПоНаименованию(СтрТД.ГруппаСписка, Истина);
						Если ЗначениеЗаполнено(Родитель) Тогда
							Номенклатура.Родитель       = Родитель;
						КонецЕсли;
					КонецЕсли;
					
					Запрос = Новый("Запрос");
					Запрос.УстановитьПараметр("Наименование", СтрТД.Ед_Изм);
					Запрос.Текст = "ВЫБРАТЬ
					               |	УпаковкиЕдиницыИзмерения.Ссылка КАК ЕдиницаИзмерения
					               |ИЗ
					               |	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
					               |ГДЕ
					               |	УпаковкиЕдиницыИзмерения.Наименование = &Наименование
					               |	И НЕ УпаковкиЕдиницыИзмерения.ПометкаУдаления";
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						Номенклатура.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;	
					КонецЕсли;
					
					Попытка
						Номенклатура.Записать(); 
						Сообщить("Создана номенклатура с наименованием -" + Строка(Номенклатура));
						
						НовыйШтрихкод = НаборЗаписей.Добавить();
						НовыйШтрихкод.Номенклатура = Номенклатура.Ссылка;
						НовыйШтрихкод.Штрихкод     = СтрТД.Штрихкод;
						НовыйШтрихкод.Упаковка     = Номенклатура.ЕдиницаИзмерения;
						НаборЗаписей.Записать();
					Исключение 						
					
						ТекстОшибки = ИнформацияОбОшибке();
						Сообщить(ТекстОшибки.Описание + " " + ТекстОшибки.Причина.Описание);
					КонецПопытки;
				Иначе
					
					НаборЗаписей = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Штрихкод.Установить(Штрихкод);
					НаборЗаписей.Прочитать();
					
					Если НаборЗаписей.Количество() = 0 Тогда 
						НовыйШтрихкод = НаборЗаписей.Добавить();
						НовыйШтрихкод.Номенклатура = Номенклатура.Ссылка;
						НовыйШтрихкод.Штрихкод     = СтрТД.Штрихкод;
						НовыйШтрихкод.Упаковка     = Номенклатура.ЕдиницаИзмерения;
						НаборЗаписей.Записать();
					КонецЕсли;

					Сообщить("Номенклатура с такием наименованием существует - " + Номенклатура.Наименование); 
				
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;
		
	Стоп = Истина;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатуру(Команда)
	
	Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
		Сообщить("Выбирите файл для загрузки");
		Возврат;	
	КонецЕсли;
    
	СоздатьНоменклатуруНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка	= Ложь;
	Описание	= Новый ОписаниеОповещения("ЗакончитьВыборФайла", ЭтотОбъект);
	НачатьПомещениеФайла(Описание,,,Истина, УникальныйИдентификатор); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьВыборФайла(Результат, Адрес, Имя, ДопПараметры) Экспорт 
	
	Если Результат Тогда 
		ПутьКФайлу		= Имя;
		АдресХранения	= Адрес;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Номенклатура") Тогда
		Элементы.ГруппаНоменклатура.Видимость    = Истина;
		Элементы.ГруппаЗаказПоставщику.Видимость = Ложь;
	ИначеЕсли Параметры.Свойство("ЗаказПоставщику") Тогда
		Элементы.ГруппаНоменклатура.Видимость    = Ложь;
		Элементы.ГруппаЗаказПоставщику.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
  Процедура СоздатьЗаказПоставщикуНаСервере()
	
	Путь	= КаталогВременныхФайлов() + "temp.xlsx";
	Файл	= ПолучитьИзВременногоХранилища(АдресХранения);
	
	Файл.Записать(Путь);
	
	ТабДок = Новый ТабличныйДокумент; 
	ТабДок.Прочитать(Путь);

	ПЗ = Новый ПостроительЗапроса;
	ПЗ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДок.Область());//передаем ТЗ
	ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
	ПЗ.ЗаполнитьНастройки();
	ПЗ.Выполнить();
	ТаблицаДанных = ПЗ.Результат.Выгрузить();
	
	Если ТаблицаДанных.Количество() > 0 Тогда
		
		Если ЗначениеЗаполнено(ЗаказПоставщику) Тогда
			ДокЗаказ = ЗаказПоставщику.ПолучитьОбъект();
		Иначе
			ДокЗаказ = Документы.ЗаказПоставщику.СоздатьДокумент(); 
		КонецЕсли; 
		
		ДокЗаказ.Дата = ТекущаяДата();
		
		Если ЗначениеЗаполнено(Организация) Тогда
			ДокЗаказ.Организация = Организация;
		Иначе
			ДокЗаказ.Организация = Справочники.Организации.НайтиПоНаименованию("ТОО ""Ромашка"""); 
		КонецЕсли;
		
		БИНЧисло  = Число(СокрЛП(СтрЗаменить(ТаблицаДанных[0].БИН, " ", "")));
		БинСтрока = Формат(БИНЧисло, "ЧГ=");			
		
		Если ЗначениеЗаполнено(Контрагент) Тогда 
			ДокЗаказ.Контрагент = Контрагент;
		Иначе
			ДокЗаказ.Контрагент  = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", БинСтрока);
		КонецЕсли;
		
		ДокЗаказ.Партнер     = ДокЗаказ.Контрагент.Партнер;
		ДокЗаказ.Приоритет   = Справочники.Приоритеты.НайтиПоНаименованию("Средний");  
		ДокЗаказ.Валюта      = Справочники.Валюты.НайтиПоНаименованию("KZT");
		ДокЗаказ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
		ДокЗаказ.ЦенаВключаетНДС = Истина;
		ДокЗаказ.Менеджер = ПользователиКлиентСервер.ТекущийПользователь();
		ДокЗаказ.Автор = ПользователиКлиентСервер.ТекущийПользователь();
		ДокЗаказ.РегистрироватьЦеныПоставщика = Истина;
		ДокЗаказ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		ДокЗаказ.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада;
		ДокЗаказ.ПеревозчикПартнер = ДокЗаказ.Партнер; 
		ДокЗаказ.Статус = Перечисления.СтатусыЗаказовПоставщикам.Подтвержден;
		ДокЗаказ.ДокументОснование = Документы.ЗаказКлиента.ПустаяСсылка();
		ДокЗаказ.Склад = Склад;
		
		ДокЗаказ.Товары.Очистить();
		
		ТЗ = ДокЗаказ.Товары.Выгрузить(); 
		ТЗ.Колонки.Добавить("СуммаОтменено");
		ТЗ.Колонки.Добавить("СуммаНДСОтменено");
		ТЗ.Колонки.Добавить("СуммаСНДСОтменено");
		ТЗ.Колонки.Добавить("СуммаРучнойСкидкиОтменено");
		ТЗ.Колонки.Добавить("БезВозвратнойТары");
		ТЗ.Колонки.Добавить("СуммаБезВозвратнойТары");
		ТЗ.Колонки.Добавить("ОтмененоБезВозвратнойТары");
		ТЗ.Колонки.Добавить("СуммаНДСБезВозвратнойТары");
		ТЗ.Колонки.Добавить("СуммаСНДСБезВозвратнойТары");
		ТЗ.Колонки.Добавить("СуммаОтмененоБезВозвратнойТары");
		ТЗ.Колонки.Добавить("СуммаНДСОтмененоБезВозвратнойТары");
		ТЗ.Колонки.Добавить("СуммаСНДСОтмененоБезВозвратнойТары"); 
		ТЗ.Колонки.Добавить("СуммаРучнойСкидкиБезВозвратнойТары"); 
		ТЗ.Колонки.Добавить("СуммаРучнойСкидкиОтмененоБезВозвратнойТары");
				
		СтрокаТЗ = ТЗ.Добавить();
		СтрокаТЗ.СуммаОтменено                      = 0;
		СтрокаТЗ.СуммаНДСОтменено                   = 0;
		СтрокаТЗ.СуммаСНДСОтменено                  = 0;
		СтрокаТЗ.СуммаРучнойСкидкиОтменено          = 0;
		СтрокаТЗ.БезВозвратнойТары                  = Ложь;
		СтрокаТЗ.СуммаБезВозвратнойТары             = 0;
		СтрокаТЗ.СуммаНДСБезВозвратнойТары          = 0;
		СтрокаТЗ.СуммаСНДСБезВозвратнойТары         = 0;
		СтрокаТЗ.ОтмененоБезВозвратнойТары          = Ложь;	
		СтрокаТЗ.СуммаОтмененоБезВозвратнойТары     = 0;
		СтрокаТЗ.СуммаНДСОтмененоБезВозвратнойТары  = 0;
		СтрокаТЗ.СуммаРучнойСкидкиБезВозвратнойТары = 0;	
		СтрокаТЗ.СуммаСНДСОтмененоБезВозвратнойТары = 0;
		СтрокаТЗ.СуммаРучнойСкидкиОтмененоБезВозвратнойТары = 0;
		
		Для Каждого ТсрТовары из ТаблицаДанных Цикл 
			
			Если Не ЗначениеЗаполнено(ТсрТовары.Код) Тогда
				Прервать;				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТсрТовары.Штрихкод) Тогда
				
				Штрихкод = СтрЗаменить(ТсрТовары.Штрихкод, " ", "");
				
				Если ТсрТовары.Подтверждено = "да" или ТсрТовары.Подтверждено = "Да" Тогда
					
					НаборЗаписей = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей(); 
					НаборЗаписей.Отбор.Штрихкод.Установить(Штрихкод);
				
					НаборЗаписей.Прочитать();
				
					Если НаборЗаписей.Количество() > 0 Тогда 
						
						НовСтрТовары = ДокЗаказ.Товары.Добавить();						
																		
						НовСтрТовары.Номенклатура  		= НаборЗаписей[0].Номенклатура;
						//НовСтрТовары.Упаковка       	= НаборЗаписей[0].Упаковка;
						НовСтрТовары.Упаковка       	= Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
						НовСтрТовары.Характеристика 	= НаборЗаписей[0].Характеристика;
						НовСтрТовары.Цена          		= Число(ТсрТовары.Цена);
						НовСтрТовары.СтавкаНДС          = НовСтрТовары.Номенклатура.СтавкаНДС;
						НовСтрТовары.Количество    	    = Число(ТсрТовары.КоличествоЗаказа);
						НовСтрТовары.КоличествоУпаковок = Число(ТсрТовары.КоличествоЗаказа); 
						НовСтрТовары.Склад              = ДокЗаказ.Склад;
						
						СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(ДокЗаказ);
		
						ЗависимыеРеквизиты = Новый Структура(
									"БезВозвратнойТары,ОтмененоБезВозвратнойТары,Отменено",
									"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки",
									"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки",
									"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки");
						//ЗависимыеРеквизиты.Вставить("Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки");
		
						СтруктураДействий = Новый Структура;
						СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
						СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
						СтруктураДействий.Вставить("ПересчитатьСумму");
						СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
						СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты);
				
						КэшированныеЗначения = Неопределено;
		
						Если КэшированныеЗначения = Неопределено Тогда
							КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
						КонецЕсли;		
						
						ЗаполнитьЗначенияСвойств(СтрокаТз, НовСтрТовары); 
						
						ОбработкаТабличнойЧастиВызовСервера.ОбработатьСтрокуТЧ(СтрокаТз, СтруктураДействий, КэшированныеЗначения);
		
						ЗаполнитьЗначенияСвойств(НовСтрТовары, СтрокаТз);

					КонецЕсли;
				
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
				
	КонецЕсли; 
	
	Попытка 
		ДокЗаказ.МаксимальныйКодСтроки = ДокЗаказ.Товары.Количество();
		ДокЗаказ.Записать();
		ЗаказПоставщику = ДокЗаказ.Ссылка; 
		Сообщить("Документ заказ поставщику успешно создан! -" + Строка(ЗаказПоставщику)); 
	Исключение
		ТекстОшибки = ИнформацияОбОшибке();
		Сообщить(ТекстОшибки.Описание);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказПоставщику(Команда)
	
	Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
		Сообщить("Выбирите файл для загрузки");
		Возврат;	
	КонецЕсли;

	СоздатьЗаказПоставщикуНаСервере();
КонецПроцедуры
