#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Если Параметры.Ключ.Пустая() Тогда
		ОблагаетсяНДФЛ = 1;
		НалогообложениеНачислений.ВидДохода = ПредопределенноеЗначение("Справочник.ВидыДоходов.ПрочиеДоходы");
		РедактированиеПериодическихСведений.ИнициализироватьЗаписьДляРедактированияВФорме(ЭтаФорма, "НалогообложениеНачислений", Объект.Ссылка);
	КонецЕсли;
	
	ПроинициализироватьФорму();
	ПолучитьПризнакиУчета(НалогообложениеНачислений.ВидДохода);
	
	УстановитьДоступностьКодаДоходаНДФЛ(ЭтаФорма);
	КодДоходаНДФЛПрежнееЗначение = Объект.КодДоходаНДФЛ; 
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОблагаетсяНДФЛ = ?(ЗначениеЗаполнено(Объект.КодДоходаНДФЛ),1,0);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьСпособовОблажения();

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьНалогообложениеНачислений(ТекущийОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ПараметрыЗаписи.Свойство("ПроверкаПередЗаписьюВыполнена") Тогда 
		Отказ = Истина;
		ЗаписатьНаКлиенте(Ложь);
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
		Если ОблагаетсяНДФЛ = 1 И Не ЗначениеЗаполнено(Объект.КодДоходаНДФЛ) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Код дохода НДФЛ не заполнен.'"), , , "Объект.КодДоходаНДФЛ" , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	РедактированиеПериодическихСведений.ПроверитьЗаписьВФорме(ЭтаФорма, "НалогообложениеНачислений", Объект.Ссылка, Отказ);

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ВедущийОбъект = Источник;
	РедактированиеПериодическихСведенийКлиент.ОбработкаОповещения(ЭтаФорма, ВедущийОбъект, ИмяСобытия, Параметр, Источник);
	Если Параметр.Свойство("ИмяРегистра") И Параметр.ИмяРегистра = "НалогообложениеНачислений" Тогда
		ПолучитьПризнакиУчета(НалогообложениеНачислений.ВидДохода);
		ОбновитьВидимостьСпособовОблажения();
	КонецЕсли;

	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область НалогооблажениеНачислений

&НаКлиенте
Процедура НалогообложениеНачисленийВидДоходаПриИзменении(Элемент)
	
	УстановитьСпособНалогообложенияПоУмолчанию();
	ОбновитьВидимостьСпособовОблажения();
	
КонецПроцедуры

&НаКлиенте
Процедура НалогообложениеНачисленийСпособОбложенияИПНПриИзменении(Элемент)
	ОбновитьВидимостьСпособовОблажения();
	ОбновитьОтображениеПолейВводаНалогооблаженияНачислений();
КонецПроцедуры

&НаКлиенте
Процедура НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюИПНПриИзменении(Элемент)
	ОбновитьВидимостьСпособовОблажения();
	ОбновитьОтображениеПолейВводаНалогооблаженияНачислений();
КонецПроцедуры

&НаКлиенте
Процедура НалогообложениеНачисленийПериодПриИзменении(Элемент)
	НалогообложениеНачислений.Период = НачалоМесяца(НалогообложениеНачислений.Период);
КонецПроцедуры

&НаКлиенте
Процедура НалогообложениеНачисленийСпособОбложенияОПВПриИзменении(Элемент)
	ОбновитьВидимостьСпособовОблажения();
	ОбновитьОтображениеПолейВводаНалогооблаженияНачислений();
КонецПроцедуры

&НаКлиенте
Процедура НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюОПВПриИзменении(Элемент)
	ОбновитьВидимостьСпособовОблажения();
	ОбновитьОтображениеПолейВводаНалогооблаженияНачислений();
КонецПроцедуры

&НаКлиенте
Процедура НалогообложениеНачисленийСпособОбложенияВОСМСПриИзменении(Элемент)
	ОбновитьВидимостьСпособовОблажения();
	ОбновитьОтображениеПолейВводаНалогооблаженияНачислений();
КонецПроцедуры

&НаКлиенте
Процедура НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюВОСМСПриИзменении(Элемент)
	ОбновитьВидимостьСпособовОблажения();
	ОбновитьОтображениеПолейВводаНалогооблаженияНачислений();
КонецПроцедуры

&НаКлиенте
Процедура НалогообложениеНачисленийСпособОбложенияСОПриИзменении(Элемент)
	ОбновитьВидимостьСпособовОблажения();
	ОбновитьОтображениеПолейВводаНалогооблаженияНачислений();
КонецПроцедуры

&НаКлиенте
Процедура НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюСОПриИзменении(Элемент)
	ОбновитьВидимостьСпособовОблажения();
	ОбновитьОтображениеПолейВводаНалогооблаженияНачислений();
КонецПроцедуры

&НаКлиенте
Процедура НалогообложениеНачисленийСпособОбложенияСНПриИзменении(Элемент)
	ОбновитьВидимостьСпособовОблажения();
	ОбновитьОтображениеПолейВводаНалогооблаженияНачислений();
КонецПроцедуры

&НаКлиенте
Процедура НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюСНПриИзменении(Элемент)
	ОбновитьВидимостьСпособовОблажения();
	ОбновитьОтображениеПолейВводаНалогооблаженияНачислений();
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОблагаетсяНДФЛПриИзменении(Элемент)
	
	Если ОблагаетсяНДФЛ = 1 Тогда
		Объект.КодДоходаНДФЛ = КодДоходаНДФЛПрежнееЗначение;
	Иначе
		КодДоходаНДФЛПрежнееЗначение = Объект.КодДоходаНДФЛ;
		Объект.КодДоходаНДФЛ = Неопределено;
	КонецЕсли;
	
	УстановитьДоступностьКодаДоходаНДФЛ(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура РедактированиеИсторииНалогооблажениеНачислений(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СотрудникиКлиент.ОткрытьФормуРедактированияИстории("НалогообложениеНачислений", Объект.Ссылка, ЭтаФорма);
	Иначе
		ТекстСообщения = Нстр("ru = 'Необходимо записать вид прочего дохода.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКодаДоходаНДФЛ(Форма)
	
	ДоступностьКодаНДФЛ = Форма.ОблагаетсяНДФЛ = 1;
	
	Форма.Элементы.КодДоходаНДФЛ.Доступность = ДоступностьКодаНДФЛ;
	Форма.Элементы.КодДоходаНДФЛ.АвтоОтметкаНезаполненного = ДоступностьКодаНДФЛ;
	Форма.Элементы.КодДоходаНДФЛ.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Форма.Объект.КодДоходаНДФЛ);
	
КонецПроцедуры

&НаСервере
Процедура ПроинициализироватьФорму()
	
	Если НалогообложениеНачисленийПрежняя = Неопределено Тогда
		РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(ЭтаФорма, "НалогообложениеНачислений", Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПризнакиУчета(ВидДохода)
	
	НалогообложениеНачисленийУчитыватьИПН	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьИПН");
	НалогообложениеНачисленийУчитыватьВОСМС	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьВОСМС");
	НалогообложениеНачисленийУчитыватьОПВ	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьОПВ");
	НалогообложениеНачисленийУчитыватьСО	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьСО");
	НалогообложениеНачисленийУчитыватьСН	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьСН");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСпособНалогообложенияПоУмолчанию()
	
	ПолучитьПризнакиУчета(НалогообложениеНачислений.ВидДохода);
	
	НалогообложениеНачислений.СпособОбложенияИПН	= ?(НалогообложениеНачисленийУчитыватьИПН, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	НалогообложениеНачислений.СпособОбложенияВОСМС	= ?(НалогообложениеНачисленийУчитыватьВОСМС, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	НалогообложениеНачислений.СпособОбложенияОПВ	= ?(НалогообложениеНачисленийУчитыватьОПВ, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	НалогообложениеНачислений.СпособОбложенияСО		= ?(НалогообложениеНачисленийУчитыватьСО, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	НалогообложениеНачислений.СпособОбложенияСН		= ?(НалогообложениеНачисленийУчитыватьСН, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьСпособовОблажения()
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.НалогообложениеНачислений.ВидДохода) Тогда
		 ЭтаФорма.НалогообложениеНачислений.ВидДохода = ПредопределенноеЗначение("Справочник.ВидыДоходов.ПрочиеДоходы");
		 УстановитьСпособНалогообложенияПоУмолчанию();
	КонецЕсли;
	 
	НеОблагаетсяЧастично = ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично"); 
	
	Элементы.НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюИПН.Видимость		= НалогообложениеНачислений.СпособОбложенияИПН	= НеОблагаетсяЧастично;
	Элементы.НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюВОСМС.Видимость	= НалогообложениеНачислений.СпособОбложенияВОСМС= НеОблагаетсяЧастично;
	Элементы.НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюОПВ.Видимость		= НалогообложениеНачислений.СпособОбложенияОПВ	= НеОблагаетсяЧастично;
	Элементы.НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюСО.Видимость		= НалогообложениеНачислений.СпособОбложенияСО	= НеОблагаетсяЧастично;
	Элементы.НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюСН.Видимость		= НалогообложениеНачислений.СпособОбложенияСН	= НеОблагаетсяЧастично;
	
	Элементы.НалогообложениеНачисленийСпособОбложенияИПН.Видимость	 = НалогообложениеНачисленийУчитыватьИПН;
	Элементы.НалогообложениеНачисленийСпособОбложенияВОСМС.Видимость = НалогообложениеНачисленийУчитыватьВОСМС;
	Элементы.НалогообложениеНачисленийСпособОбложенияОПВ.Видимость	 = НалогообложениеНачисленийУчитыватьОПВ;
	Элементы.НалогообложениеНачисленийСпособОбложенияСО.Видимость	 = НалогообложениеНачисленийУчитыватьСО;
	Элементы.НалогообложениеНачисленийСпособОбложенияСН.Видимость	 = НалогообложениеНачисленийУчитыватьСН;
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.НалогообложениеНачислений.Период) Тогда
		ЭтаФорма.НалогообложениеНачислений.Период = НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(ЭтаФорма, "НалогообложениеНачислений", Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаборЗаписейПериодическихСведений(ИмяРегистра, ВедущийОбъект) Экспорт
	
	РедактированиеПериодическихСведений.ПрочитатьНаборЗаписей(ЭтаФорма, ИмяРегистра, ВедущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНалогообложениеНачислений(ТекущийОбъект)
	
	РедактированиеПериодическихСведений.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтаФорма, "НалогообложениеНачислений", ТекущийОбъект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеПолейВводаНалогооблаженияНачислений()
	
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(ЭтаФорма, "НалогообложениеНачислений", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНаКлиенте(ЗакрытьПослеЗаписи) 
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если НЕ НалогообложениеНачисленийНоваяЗапись Тогда
			
			ИзменилсяПериод = (НалогообложениеНачислений.Период <> НалогообложениеНачисленийПрежняя.Период);
			ИзменилисьДанные = Ложь;
			Для Каждого Поле Из НалогообложениеНачисленийПрежняя Цикл
				Если Поле.Ключ = "Период" Тогда
					Продолжить;
				КонецЕсли;
				ИзменилисьДанные = НалогообложениеНачислений[Поле.Ключ] <> Поле.Значение;
				Если ИзменилисьДанные Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ИзменилисьДанные ИЛИ ИзменилсяПериод Тогда
				ОткрытьФормуПредупрежденияОбИзмененииНалогообложения(ЗакрытьПослеЗаписи);	
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура("ПроверкаПередЗаписьюВыполнена", Истина);
	Если Записать(ПараметрыЗаписи) И ЗакрытьПослеЗаписи Тогда 
		Закрыть();
	Иначе
		Если НалогообложениеНачисленийНоваяЗапись Тогда
			НалогообложениеНачисленийНоваяЗапись = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПредупрежденияОбИзмененииНалогообложения(ЗакрытьПослеИсправления = Истина, ЗаписатьДанные = Истина)
	
	ТекстКнопкиДа = НСтр("ru = 'Изменился вид дохода'");
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'При редактировании Вы изменили вид прочего дохода. 
					|Если Вы исправили прежнюю запись (она была ошибочной), нажмите ""Исправлена ошибка"".
					|Если у элемента изменился вид дохода с %1, нажмите ""%2""'"), 
			Формат(НалогообложениеНачислений.Период, "ДФ='д ММММ гггг ""г""'"),
			ТекстКнопкиДа);
			
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗакрытьПослеИсправления", ЗакрытьПослеИсправления);
	ДополнительныеПараметры.Вставить("ЗаписатьДанные", ЗаписатьДанные);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьФормуПредупрежденияОИзмененииНалогообложенияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			
	РедактированиеПериодическихСведенийКлиент.ЗапроситьРежимИзмененияРегистра(ЭтотОбъект, "НалогообложениеНачислений", ТекстВопроса, ТекстКнопкиДа, , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПредупрежденияОИзмененииНалогообложенияЗавершение(Отказ, ДополнительныеПараметры) Экспорт 

	Если НЕ НалогообложениеНачисленийНоваяЗапись Тогда
		
		ЗаписатьНалогообложениеНачислений(Объект.Ссылка);
		
		НалогообложениеНачисленийСтруктура = Новый Структура;
		
		Для Каждого Поле Из НалогообложениеНачисленийПрежняя Цикл
			НалогообложениеНачисленийСтруктура.Вставить(Поле.Ключ, НалогообложениеНачислений[Поле.Ключ]);
		КонецЦикла;
		
		НалогообложениеНачисленийПрежняя = Новый ФиксированнаяСтруктура(НалогообложениеНачисленийСтруктура);
		
	КонецЕсли;
	
	ОбновитьВидимостьСпособовОблажения();
	
	Если ДополнительныеПараметры.ЗаписатьДанные Тогда 
		ЗаписатьНаКлиенте(ДополнительныеПараметры.ЗакрытьПослеИсправления);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьНаКлиенте(Истина);
КонецПроцедуры


#КонецОбласти
