////////////////////////////////////////////////////////////////////////////////
// Подсистема "Расчет имущественных налогов".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает необходимость уплаты авансов по налогу на имущество.
//
// Параметры:
// 	Организации - СправочникСсылка.Организации - Организация, для которой необходимо выполнить проверку.
// 	Период - Дата - Дата закрытия месяца.
//
// Возвращаемое значение:
// 	Результат - Булево - Признак необходимости уплаты аванса.
//
Функция УплачиваютсяАвансыПоНалогуНаИмущество(Организации, Период) Экспорт
	
	УплачиваютсяАвансы = Ложь;
	
	Запрос = Новый Запрос;         
	
	Запрос.УстановитьПараметр("Организации", Организации);
	Запрос.УстановитьПараметр("Период", Период);
	
	Запрос.Текст =                                     
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.НалоговыйОрган КАК НалоговыйОрган
	|ПОМЕСТИТЬ ВТ_НалоговыеОрганы
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Организация КАК Организация,
	|		СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.НалоговыйОрган КАК НалоговыйОрган
	|	ИЗ
	|		РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.СрезПоследних(
	|				КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Период, ГОД, -1), ГОД),
	|				Организация В (&Организации)
	|					И ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)) КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Организация,
	|		СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.НалоговыйОрган
	|	ИЗ
	|		РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Период, КВАРТАЛ),
	|				Организация В (&Организации)
	|					И ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)) КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Организация,
	|		СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.НалоговыйОрган
	|	ИЗ
	|		РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам
	|	ГДЕ
	|		СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Организация В (&Организации)
	|		И СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
	|		И СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ГОД) И КОНЕЦПЕРИОДА(&Период, КВАРТАЛ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Организации.Ссылка,
	|		Организации.РегистрацияВНалоговомОргане
	|	ИЗ
	|		Справочник.Организации КАК Организации
	|	ГДЕ
	|		Организации.Ссылка В (&Организации)) КАК ВложенныйЗапрос
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НалоговыйОрган
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.Организация КАК Организация,
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.УплачиваютсяАвансы КАК УплачиваютсяАвансы
	|ПОМЕСТИТЬ ВТ_УплачиваютсяАвансыПоОрганизации
	|ИЗ
	|	РегистрСведений.ПорядокУплатыНалоговНаМестах.СрезПоследних(
	|			&Период,
	|			Организация В (&Организации)
	|				И РегистрацияВНалоговомОргане = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				И Налог = ЗНАЧЕНИЕ(Перечисление.ВидыИмущественныхНалогов.НалогНаИмущество)) КАК ПорядокУплатыНалоговНаМестахСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.Организация КАК Организация,
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.УплачиваютсяАвансы КАК УплачиваютсяАвансы
	|ПОМЕСТИТЬ ВТ_УплачиваютсяАвансыПоИФНС
	|ИЗ
	|	РегистрСведений.ПорядокУплатыНалоговНаМестах.СрезПоследних(
	|			&Период,
	|			Организация В (&Организации)
	|				И РегистрацияВНалоговомОргане <> ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				И Налог = ЗНАЧЕНИЕ(Перечисление.ВидыИмущественныхНалогов.НалогНаИмущество)) КАК ПорядокУплатыНалоговНаМестахСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(ВЫБОР
	|			КОГДА ВТ_УплачиваютсяАвансыПоИФНС.УплачиваютсяАвансы ЕСТЬ NULL 
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_УплачиваютсяАвансыПоОрганизации.УплачиваютсяАвансы ЕСТЬ NULL 
	|							ТОГДА ЛОЖЬ
	|						ИНАЧЕ ВТ_УплачиваютсяАвансыПоОрганизации.УплачиваютсяАвансы
	|					КОНЕЦ
	|			ИНАЧЕ ВТ_УплачиваютсяАвансыПоИФНС.УплачиваютсяАвансы
	|		КОНЕЦ), ЛОЖЬ) КАК УплачиваютсяАвансы
	|ИЗ
	|	ВТ_НалоговыеОрганы КАК ВТ_НалоговыеОрганы
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			ВТ_УплачиваютсяАвансыПоОрганизации КАК ВТ_УплачиваютсяАвансыПоОрганизации
	|		ПО 
	|			ВТ_НалоговыеОрганы.Организация = ВТ_УплачиваютсяАвансыПоОрганизации.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			ВТ_УплачиваютсяАвансыПоИФНС КАК ВТ_УплачиваютсяАвансыПоИФНС
	|		ПО 
	|			ВТ_НалоговыеОрганы.Организация = ВТ_УплачиваютсяАвансыПоИФНС.Организация
	|			И ВТ_НалоговыеОрганы.НалоговыйОрган = ВТ_УплачиваютсяАвансыПоИФНС.РегистрацияВНалоговомОргане";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока Выборка.Следующий() Цикл
			УплачиваютсяАвансы = Выборка.УплачиваютсяАвансы;
		КонецЦикла;
		
	КонецЕсли;
		
	Возврат УплачиваютсяАвансы;
	
КонецФункции

// Возвращает результат расчета налога (или аванса по налогу) на имущество.
//
// Параметры:
//  Организация				 		- СправочникСсылка.Организации - Организация, для которой необходимо выполнить проверку.
//  ПериодРасчета			 		- Дата - Дата закрытия месяца.
//  РасчетПоФактическойСтоимости	- Булево - Истина, если нужно выполнить расчет по фактической стоимости.
// 
// Возвращаемое значение:
//  ТаблицаРасчетНалога - ТаблицаЗначений - Результат расчета налога.
//
Функция ПолучитьРасчетПоНалогуНаИмущество(Организация, ПериодРасчета, МенеджерВТДляРасчетаПоФактическойСтоимости = Неопределено) Экспорт
	
	ГодовойРасчет = Месяц(ПериодРасчета) = 12;
	
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "РегистрацияВНалоговомОргане");
	
	мДатаНачалаПериодаОтчета = НачалоГода(ПериодРасчета);
	мДатаКонцаПериодаОтчета  = КонецКвартала(ПериодРасчета);
	
	ТаблицаРасчетНалога = ПустаяСправкаРасчет("РасчетНалогаНаИмущество");

	ЭтоНеЮрЛицо = НЕ ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Организация);
	
	Если Месяц(ПериодРасчета)%3 <> 0 ИЛИ ЭтоНеЮрЛицо Тогда
		Возврат ТаблицаРасчетНалога;
	КонецЕсли;
	
	// ПО СРЕДНЕЙ СТОИМОСТИ
	
	// Сведения о налоговых льготах в виде уменьшения суммы налога.
	ПроцентУменьшенияСуммыНалога = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",      мДатаКонцаПериодаОтчета);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СтавкиНалогаНаИмуществоСрезПоследних.ПроцентУменьшения, 0) КАК ПроцентУменьшения
	|ИЗ
	|	РегистрСведений.СтавкиНалогаНаИмущество.СрезПоследних(&Период) КАК СтавкиНалогаНаИмуществоСрезПоследних
	|ГДЕ
	|	СтавкиНалогаНаИмуществоСрезПоследних.Организация = &Организация";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ПроцентУменьшенияСуммыНалога = РезультатЗапроса.Выгрузить()[0].ПроцентУменьшения;
	Иначе
		ПроцентУменьшенияСуммыНалога = 0;
	КонецЕсли;

	Запрос = Новый Запрос;
	Если МенеджерВТДляРасчетаПоФактическойСтоимости <> Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = МенеджерВТДляРасчетаПоФактическойСтоимости;
		РасчетПоФактическойСтоимости = Истина;
	Иначе
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		РасчетПоФактическойСтоимости = Ложь;
	КонецЕсли; 
	Запрос.УстановитьПараметр("Период", мДатаКонцаПериодаОтчета);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	// Признак применения ЕНВД.
	ПрименениеЕНВД = УчетнаяПолитика.ПлательщикЕНВД(Организация, мДатаКонцаПериодаОтчета);
	Если ПрименениеЕНВД Тогда 
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СпособыОтраженияРасходовПоАмортизации.ОсновноеСредство,
		|	СпособыОтраженияРасходовПоАмортизации.СтатьяРасходов,
		|	СпособыОтраженияРасходовПоАмортизации.СпособОтраженияРасходовЗаданДокументом,
		|	СпособыОтраженияРасходовПоАмортизации.СпособОтраженияРасходов
		|ПОМЕСТИТЬ СпособыОтраженияРасходовПоАмортизации
		|ИЗ
		|	РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.СрезПоследних(&Период, Организация = &Организация) КАК СпособыОтраженияРасходовПоАмортизации
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СпособыОтраженияРасходовПоАмортизации.СпособОтраженияРасходов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СпособыОтраженияРасходовПоАмортизации.ОсновноеСредство,
		|	ВЫБОР
		|		КОГДА СпособыОтраженияРасходовПоАмортизации.СпособОтраженияРасходовЗаданДокументом
		|			ТОГДА СпособыОтраженияРасходовПоАмортизацииТаблица.СтатьяРасходов
		|		ИНАЧЕ СпособыОтраженияРасходовПоАмортизации.СтатьяРасходов
		|	КОНЕЦ КАК СтатьяРасходов,
		|	ВЫБОР
		|		КОГДА СпособыОтраженияРасходовПоАмортизации.СпособОтраженияРасходовЗаданДокументом
		|			ТОГДА СпособыОтраженияРасходовПоАмортизацииТаблица.Коэффициент
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Коэффициент
		|ПОМЕСТИТЬ ВТ_ВыборкаКоэффициентов
		|ИЗ
		|	СпособыОтраженияРасходовПоАмортизации КАК СпособыОтраженияРасходовПоАмортизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеПараметровОС.ОтражениеАмортизационныхРасходов КАК СпособыОтраженияРасходовПоАмортизацииТаблица
		|		ПО СпособыОтраженияРасходовПоАмортизации.СпособОтраженияРасходов = СпособыОтраженияРасходовПоАмортизацииТаблица.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СпособыОтраженияРасходовПоАмортизации.ОсновноеСредство КАК ОсновноеСредство,
		|	СУММА(СпособыОтраженияРасходовПоАмортизацииТаблица.Коэффициент) КАК СуммаКоэффициентов
		|ПОМЕСТИТЬ ВТ_ВыборкаСуммыКоэффициентов
		|ИЗ
		|	СпособыОтраженияРасходовПоАмортизации КАК СпособыОтраженияРасходовПоАмортизации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеПараметровОС.ОтражениеАмортизационныхРасходов КАК СпособыОтраженияРасходовПоАмортизацииТаблица
		|		ПО СпособыОтраженияРасходовПоАмортизации.СпособОтраженияРасходов = СпособыОтраженияРасходовПоАмортизацииТаблица.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	СпособыОтраженияРасходовПоАмортизации.ОсновноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыборкаКоэффициентов.ОсновноеСредство КАК ОсновноеСредство,
		|	СУММА(ВЫБОР
		|			КОГДА СтатьиРасходов.ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
		|				ТОГДА ВыборкаКоэффициентов.Коэффициент / ЕСТЬNULL(ВыборкаСуммыКоэффициентов.СуммаКоэффициентов, 1)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НеЕНВД,
		|	СУММА(ВЫБОР
		|			КОГДА СтатьиРасходов.ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты)
		|				ТОГДА ВыборкаКоэффициентов.Коэффициент / ЕСТЬNULL(ВыборкаСуммыКоэффициентов.СуммаКоэффициентов, 1)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Распределение
		|ПОМЕСТИТЬ КоэффициентыЕНВД
		|ИЗ
		|	ВТ_ВыборкаКоэффициентов КАК ВыборкаКоэффициентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|		ПО ВыборкаКоэффициентов.СтатьяРасходов = СтатьиРасходов.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыборкаСуммыКоэффициентов КАК ВыборкаСуммыКоэффициентов
		|		ПО ВыборкаКоэффициентов.ОсновноеСредство = ВыборкаСуммыКоэффициентов.ОсновноеСредство
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыборкаКоэффициентов.ОсновноеСредство
		|";
		
		Запрос.Выполнить();
	КонецЕсли;
	ГоловнаяОрганизация = Организация.ГоловнаяОрганизация;
	Если Не ЗначениеЗаполнено(ГоловнаяОрганизация) Тогда
		ГоловнаяОрганизация = Организация;
	КонецЕсли;
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("КонецПериодаОтчета", КонецГода(ПериодРасчета));
	
	Если ВнеоборотныеАктивы.ИспользуетсяУправлениеВНА_2_4(ПериодРасчета) Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПервоначальныеСведенияОС.ОсновноеСредство КАК ОС
		|ПОМЕСТИТЬ ВТДвижимоеИмуществоПринятоеКУчетуПосле2013
		|ИЗ
		|	РегистрСведений.ПервоначальныеСведенияОС КАК ПервоначальныеСведенияОС
		|ГДЕ
		|	ПервоначальныеСведенияОС.Активность
		|	И ПервоначальныеСведенияОС.Период <= &КонецПериодаОтчета
		|	И ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ >= ДАТАВРЕМЯ(2013, 1, 1)
		|	И ПервоначальныеСведенияОС.Организация В
		|			(ВЫБРАТЬ
		|				Организации.Ссылка КАК Ссылка
		|			ИЗ
		|				Справочник.Организации КАК Организации
		|			ГДЕ
		|				(Организации.Ссылка = &ГоловнаяОрганизация
		|					ИЛИ Организации.ГоловнаяОрганизация = &ГоловнаяОрганизация))
		|	И НЕ ПервоначальныеСведенияОС.ОсновноеСредство.ГруппаОС В (
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Здания), 
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Сооружения), 
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.МноголетниеНасаждения), 
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ЗемельныеУчастки), 
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ПрочееИмуществоТребующееГосударственнойРегистрации), 
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ОбъектыПриродопользования))
		|
		|СГРУППИРОВАТЬ ПО
		|	ПервоначальныеСведенияОС.ОсновноеСредство
		|
		|ИМЕЮЩИЕ
		|	МИНИМУМ(ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ) >= ДАТАВРЕМЯ(2013, 1, 1)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОС";
	Иначе	
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СостоянияОСОрганизаций.ОсновноеСредство КАК ОС
		|ПОМЕСТИТЬ ВТДвижимоеИмуществоПринятоеКУчетуПосле2013
		|ИЗ
		|	РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОСОрганизаций
		|ГДЕ
		|	СостоянияОСОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
		|	И СостоянияОСОрганизаций.Период <= &КонецПериодаОтчета
		|	И СостоянияОСОрганизаций.Организация В
		|			(ВЫБРАТЬ
		|				Организации.Ссылка КАК Ссылка
		|			ИЗ
		|				Справочник.Организации КАК Организации
		|			ГДЕ
		|				(Организации.Ссылка = &ГоловнаяОрганизация
		|					ИЛИ Организации.ГоловнаяОрганизация = &ГоловнаяОрганизация))
		|	И НЕ СостоянияОСОрганизаций.ОсновноеСредство.ГруппаОС В (
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Здания), 
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Сооружения), 
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.МноголетниеНасаждения), 
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ЗемельныеУчастки), 
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ПрочееИмуществоТребующееГосударственнойРегистрации), 
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ОбъектыПриродопользования))
		|
		|СГРУППИРОВАТЬ ПО
		|	СостоянияОСОрганизаций.ОсновноеСредство
		|
		|ИМЕЮЩИЕ
		|	МИНИМУМ(СостоянияОСОрганизаций.Период) >= ДАТАВРЕМЯ(2013, 1, 1)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОС";
	КонецЕсли; 
	Запрос.Выполнить();
	
	ТекстОбъединяющегоЗапроса = "";
	
	Период  = мДатаНачалаПериодаОтчета;
	Счетчик = 1;
	
	Пока Период <= НачалоМесяца(ДобавитьМесяц(мДатаКонцаПериодаОтчета, 1)) Цикл
		
		ПрименениеУСН = УчетнаяПолитика.ПрименяетсяУСН(Организация,
			?(Год(Период) = Год(ПериодРасчета), КонецКвартала(Период), мДатаКонцаПериодаОтчета));
		
		Если НЕ ПрименениеУСН Тогда
			
			КонецПериода = ?(Год(Период) = Год(ПериодРасчета), Период, мДатаКонцаПериодаОтчета);
			
			ИспользуетсяУправлениеВНА_2_4 = ВнеоборотныеАктивы.ИспользуетсяУправлениеВНА_2_4(Период);
			
			Запрос.УстановитьПараметр("Период", Период);
			Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Период));
			Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Период));
			Запрос.УстановитьПараметр("НачалоПредыдущегоМесяца", ДобавитьМесяц(Период, -1));
			Запрос.УстановитьПараметр("КонецПредыдущегоМесяца", Период-1);
			Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
			Запрос.УстановитьПараметр("ИспользуетсяУправлениеВНА_2_4", ИспользуетсяУправлениеВНА_2_4);
			
			// Срез последних записей по основному средству в регистре "Ставки налога на имущество по отдельным основным средствам".
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СтавкиПоОтдельнымОС.ОсновноеСредство,
			|	МАКСИМУМ(СтавкиПоОтдельнымОС.Период) КАК ПериодСреза
			|ПОМЕСТИТЬ СтавкиПоОтдельнымОССрезПоследнихПериоды
			|ИЗ
			|	РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам КАК СтавкиПоОтдельнымОС
			|ГДЕ
			|	СтавкиПоОтдельнымОС.Период <= &КонецПериода
			|	И СтавкиПоОтдельнымОС.Организация = &Организация
			|
			|СГРУППИРОВАТЬ ПО
			|	СтавкиПоОтдельнымОС.ОсновноеСредство
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СтавкиПоОтдельнымОС.ОсновноеСредство,
			|	СтавкиПоОтдельнымОС.НалоговыйОрган,
			|	СтавкиПоОтдельнымОС.ПорядокНалогообложения,
			|	СтавкиПоОтдельнымОС.НалоговаяБаза
			|ПОМЕСТИТЬ СтавкиПоОтдельнымОССрезПоследних
			|ИЗ
			|	СтавкиПоОтдельнымОССрезПоследнихПериоды КАК СтавкиПоОтдельнымОССрезПоследнихПериоды
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам КАК СтавкиПоОтдельнымОС
			|		ПО СтавкиПоОтдельнымОССрезПоследнихПериоды.ОсновноеСредство = СтавкиПоОтдельнымОС.ОсновноеСредство
			|			И СтавкиПоОтдельнымОССрезПоследнихПериоды.ПериодСреза = СтавкиПоОтдельнымОС.Период";
			Запрос.Выполнить();
			
			// Выборка объектов по основному налоговому органу организации (его нет в справочнике Регистрация в налоговом органе).
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СостоянияОСОрганизаций.ОсновноеСредство КАК ОсновноеСредство
			|ПОМЕСТИТЬ СписокРазрешенныхОС
			|ИЗ
			|	РегистрСведений.СостоянияОСОрганизаций.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|			И НЕ ОсновноеСредство.ГруппаОС В (
			|						ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ЗемельныеУчастки), 
			|						ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ОбъектыПриродопользования))
			|			//ОТБОР_ОС//
			|	) КАК СостоянияОСОрганизаций
			|ГДЕ
			|	СостоянияОСОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
			|	И НЕ СостоянияОСОрганизаций.ОсновноеСредство В
			|				(ВЫБРАТЬ
			|					СтавкиНалога.ОсновноеСредство
			|				ИЗ
			|					СтавкиПоОтдельнымОССрезПоследних КАК СтавкиНалога
			|				ГДЕ
			|					СтавкиНалога.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.НалоговаяБазаПоНалогуНаИмущество.КадастроваяСтоимость))
			|	И НЕ СостоянияОСОрганизаций.ОсновноеСредство В
			|				(ВЫБРАТЬ
			|					СтавкиНалога.ОсновноеСредство
			|				ИЗ
			|					СтавкиПоОтдельнымОССрезПоследних КАК СтавкиНалога
			|				ГДЕ
			|					СтавкиНалога.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.НеПодлежитНалогообложению))
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	СостоянияОСОрганизаций.ОсновноеСредство
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПервоначальныеСведения.ОсновноеСредство КАК ОсновноеСредство,
			|	ПервоначальныеСведения.ПорядокПогашенияСтоимости КАК ПорядокПогашенияСтоимости
			|ПОМЕСТИТЬ СписокОС
			|ИЗ
			|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|				И ОсновноеСредство В
			|					(ВЫБРАТЬ
			|						СписокРазрешенныхОС.ОсновноеСредство
			|					ИЗ
			|						СписокРазрешенныхОС КАК СписокРазрешенныхОС)) КАК ПервоначальныеСведения
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ПервоначальныеСведения.ОсновноеСредство";
			Если РасчетПоФактическойСтоимости Тогда
				ТекстОтбораОС = "И ОсновноеСредство В
				|					(ВЫБРАТЬ
				|						ВТ_РазницаВСтоимостиОС.ОбъектУчета
				|					ИЗ
				|						ВТ_РазницаВСтоимостиОС КАК ВТ_РазницаВСтоимостиОС
				|					ГДЕ
				|						ВТ_РазницаВСтоимостиОС.СтоимостьРегл > 0)";
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ОТБОР_ОС//", ТекстОтбораОС);
			КонецЕсли; 
			Запрос.Выполнить();
			
			// Выборка счетов учета ОС
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ЕСТЬNULL(СчетаБухгалтерскогоУчета.ГруппаФинансовогоУчета.СчетУчета, СчетаБухгалтерскогоУчета.СчетУчета) КАК СчетУчета,
			|	ЕСТЬNULL(СчетаБухгалтерскогоУчета.ГруппаФинансовогоУчета.СчетУчетаАмортизации, СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации) КАК СчетНачисленияАмортизации
			|ПОМЕСТИТЬ СчетаУчетаОС
			|
			|ИЗ
			|	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
			|		&КонецПериода, 
			|		Организация = &Организация 
			|		И ОсновноеСредство В (ВЫБРАТЬ СписокОС.ОсновноеСредство ИЗ СписокОС)) КАК СчетаБухгалтерскогоУчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СчетаБухгалтерскогоУчета.СчетУчета,
			|	СчетаБухгалтерскогоУчета.СчетАмортизации
			|
			|ИЗ
			|	РегистрСведений.ПараметрыЦелевогоФинансированияОС.СрезПоследних(
			|		&КонецПериода, 
			|		ОсновноеСредство В (ВЫБРАТЬ СписокОС.ОсновноеСредство ИЗ СписокОС)) КАК СчетаБухгалтерскогоУчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыбытиеОС),
			|	NULL
			|";
			Запрос.Выполнить();
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МАКСИМУМ(СтавкиНалогаПоОтдельнымОС.Период) КАК Период,
			|	СтавкиНалогаПоОтдельнымОС.ОсновноеСредство КАК ОсновноеСредство
			|ПОМЕСТИТЬ ВТ_СрезПоследних
			|ИЗ
			|	РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.СрезПоследних(
			|			&КонецПериода,
			|			Организация = &Организация
			|				И ОсновноеСредство В
			|					(ВЫБРАТЬ
			|						СписокОС.ОсновноеСредство
			|					ИЗ
			|						СписокОС)) КАК СтавкиНалогаПоОтдельнымОС
			|
			|СГРУППИРОВАТЬ ПО
			|	СтавкиНалогаПоОтдельнымОС.ОсновноеСредство
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ОсновноеСредство,
			|	Период
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СрезПоследних.ОсновноеСредство,
			|	СтавкиНалогаПоОтдельнымОС.Организация,
			|	СтавкиНалогаПоОтдельнымОС.КодПоОКТМО,
			|	СтавкиНалогаПоОтдельнымОС.ПостановкаНаУчетВНалоговомОргане,
			|	СтавкиНалогаПоОтдельнымОС.НалоговыйОрган,
			|	СтавкиНалогаПоОтдельнымОС.ПорядокНалогообложения,
			|	СтавкиНалогаПоОтдельнымОС.НалоговаяСтавка,
			|	СтавкиНалогаПоОтдельнымОС.КодНалоговойЛьготыОсвобождениеОтНалогообложения,
			|	СтавкиНалогаПоОтдельнымОС.СниженнаяНалоговаяСтавка,
			|	СтавкиНалогаПоОтдельнымОС.КодВидаИмущества,
			|	СтавкиНалогаПоОтдельнымОС.ДоляСтоимостиЧислитель,
			|	СтавкиНалогаПоОтдельнымОС.ДоляСтоимостиЗнаменатель,
			|	СтавкиНалогаПоОтдельнымОС.ДвижимоеИмуществоПодлежащееНалогообложению,
			|	СтавкиНалогаПоОтдельнымОС.КБК,
			|	СтавкиНалогаПоОтдельнымОС.УсловныйНомер,
			|	СтавкиНалогаПоОтдельнымОС.КадастровыйНомер,
			|	СтавкиНалогаПоОтдельнымОС.КадастровыйНомерПомещения
			|ПОМЕСТИТЬ ВТ_СтавкиНалогаПоОтдельнымОС
			|ИЗ
			|	ВТ_СрезПоследних КАК СрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.СрезПоследних(
			|				&КонецПериода,
			|				Организация = &Организация
			|					И ОсновноеСредство В
			|						(ВЫБРАТЬ
			|							СписокОС.ОсновноеСредство
			|						ИЗ
			|							СписокОС)) КАК СтавкиНалогаПоОтдельнымОС
			|		ПО СрезПоследних.Период = СтавкиНалогаПоОтдельнымОС.Период
			|			И СрезПоследних.ОсновноеСредство = СтавкиНалогаПоОтдельнымОС.ОсновноеСредство
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СчетаБухгалтерскогоУчетаОССрезПоследних.Период,
			|	СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство,
			|	СчетаБухгалтерскогоУчетаОССрезПоследних.Организация,
			|	СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета КАК СчетУчета,
			|	СчетаБухгалтерскогоУчетаОССрезПоследних.СчетНачисленияАмортизации КАК СчетНачисленияАмортизации
			|ПОМЕСТИТЬ ВТ_СчетаБухгалтерскогоУчетаОССрезПоследних
			|ИЗ
			|	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
			|			&КонецПериода,
			|			Организация = &Организация
			|				И ОсновноеСредство В
			|					(ВЫБРАТЬ
			|						СписокОС.ОсновноеСредство
			|					ИЗ
			|						СписокОС)) КАК СчетаБухгалтерскогоУчетаОССрезПоследних
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	СчетаБухгалтерскогоУчетаОССрезПоследних.Период,
			|	СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство,
			|	&Организация,
			|	СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета,
			|	СчетаБухгалтерскогоУчетаОССрезПоследних.СчетАмортизации
			|ИЗ
			|	РегистрСведений.ПараметрыЦелевогоФинансированияОС.СрезПоследних(
			|			&КонецПериода,
			|			ОсновноеСредство В
			|					(ВЫБРАТЬ
			|						СписокОС.ОсновноеСредство
			|					ИЗ
			|						СписокОС)) КАК СчетаБухгалтерскогоУчетаОССрезПоследних
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПервоначальныеСведения.Период,
			|	ПервоначальныеСведения.ОсновноеСредство,
			|	ПервоначальныеСведения.Организация,
			|	ПервоначальныеСведения.ИнвентарныйНомер,
			|	ПервоначальныеСведения.СпособПоступления,
			|	ПервоначальныеСведения.ПорядокПогашенияСтоимости,
			|	ПервоначальныеСведения.АмортизационнаяГруппа,
			|	ПервоначальныеСведения.ДоговорЛизинга
			|ПОМЕСТИТЬ ВТ_ПервоначальныеСведенияОС
			|ИЗ
			|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|				И ОсновноеСредство В
			|					(ВЫБРАТЬ
			|						СписокОС.ОсновноеСредство
			|					ИЗ
			|						СписокОС)) КАК ПервоначальныеСведения
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ПервоначальныеСведения.ОсновноеСредство
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|";
			
			Если ИспользуетсяУправлениеВНА_2_4 Тогда
				
				Если Месяц(мДатаКонцаПериодаОтчета)+1 = Месяц(Период) И НЕ РасчетПоФактическойСтоимости Тогда
					
					Запрос.Текст = Запрос.Текст +
					"ВЫБРАТЬ
					|	СтоимостьОС.СтоимостьБУ КАК СтоимостьРегл,
					|	СтоимостьОС.ОсновноеСредство КАК ОсновноеСредство
					|ПОМЕСТИТЬ СписокОС_РасчетПоПредварительнойСтоимости
					|ИЗ
					|	Документ.ПринятиеКУчетуОС2_4 КАК ПринятиеКУчетуОС
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОС2_4.ОС КАК СтоимостьОС
					|		ПО (СтоимостьОС.Ссылка = ПринятиеКУчетуОС.Ссылка)
					|ГДЕ
					|	ПринятиеКУчетуОС.Организация = &Организация
					|	И ПринятиеКУчетуОС.Проведен
					|	И ПринятиеКУчетуОС.ОтражатьВРеглУчете
					|	И ПринятиеКУчетуОС.Дата МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
					|	И СтоимостьОС.ОсновноеСредство В
					|			(ВЫБРАТЬ
					|				СписокОС.ОсновноеСредство
					|			ИЗ
					|				СписокОС КАК СписокОС)
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|
					|ВЫБРАТЬ
					|	СтоимостьОС.СтоимостьБУ,
					|	СтоимостьОС.ОсновноеСредство
					|ИЗ
					|	Документ.МодернизацияОС2_4 КАК МодернизацияОС2_4
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МодернизацияОС2_4.ОС КАК СтоимостьОС
					|		ПО (СтоимостьОС.Ссылка = МодернизацияОС2_4.Ссылка)
					|ГДЕ
					|	МодернизацияОС2_4.Организация = &Организация
					|	И МодернизацияОС2_4.Проведен
					|	И МодернизацияОС2_4.ОтражатьВРеглУчете
					|	И МодернизацияОС2_4.Дата МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
					|	И СтоимостьОС.ОсновноеСредство В
					|			(ВЫБРАТЬ
					|				СписокОС.ОсновноеСредство
					|			ИЗ
					|				СписокОС)
					|
					|ИНДЕКСИРОВАТЬ ПО
					|	ОсновноеСредство
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
					|	СУММА(СписокОС.СтоимостьРегл) КАК СтоимостьРегл
					|ПОМЕСТИТЬ ВТ_ПредварительнаяСтоимостьОС
					|ИЗ
					|	(ВЫБРАТЬ
					|		СтоимостьОС.ОсновноеСредство КАК ОсновноеСредство,
					|		СтоимостьОС.СтоимостьРеглОстаток + СтоимостьОС.СтоимостьЦФОстаток КАК СтоимостьРегл
					|	ИЗ
					|		РегистрНакопления.СтоимостьОС.Остатки(
					|				&НачалоПредыдущегоМесяца,
					|				Организация = &Организация
					|					И ОсновноеСредство В
					|						(ВЫБРАТЬ
					|							СписокОС.ОсновноеСредство
					|						ИЗ
					|							СписокОС_РасчетПоПредварительнойСтоимости КАК СписокОС)) КАК СтоимостьОС
					|	
					|	ОБЪЕДИНИТЬ ВСЕ
					|	
					|	ВЫБРАТЬ
					|		СтоимостьОС.ОсновноеСредство,
					|		СтоимостьОС.СтоимостьРегл
					|	ИЗ
					|		СписокОС_РасчетПоПредварительнойСтоимости КАК СтоимостьОС) КАК СписокОС
					|
					|СГРУППИРОВАТЬ ПО
					|	СписокОС.ОсновноеСредство
					|
					|ИНДЕКСИРОВАТЬ ПО
					|	ОсновноеСредство
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	СУММА(СтоимостьОС.СтоимостьРеглОстаток + СтоимостьОС.СтоимостьЦФОстаток) КАК СтоимостьРегл,
					|	СтоимостьОС.ОсновноеСредство КАК ОсновноеСредство
					|ПОМЕСТИТЬ ВТ_СтоимостьОС
					|ИЗ
					|	РегистрНакопления.СтоимостьОС.Остатки(
					|			&Период,
					|			Организация = &Организация
					|				И ОсновноеСредство В
					|					(ВЫБРАТЬ
					|						СписокОС.ОсновноеСредство
					|					ИЗ
					|						СписокОС КАК СписокОС)) КАК СтоимостьОС
					|
					|СГРУППИРОВАТЬ ПО
					|	СтоимостьОС.ОсновноеСредство
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьРегл, СтоимостьОС.СтоимостьРегл) КАК СуммаОстатокДт,
					|	СтоимостьОС.ОсновноеСредство КАК Субконто1,
					|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК Счет
					|ПОМЕСТИТЬ ВТ_ПервоначальнаяСтоимостьОС
					|ИЗ
					|	ВТ_СтоимостьОС КАК СтоимостьОС
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПредварительнаяСтоимостьОС КАК ПредварительнаяСтоимостьОС
					|		ПО (ПредварительнаяСтоимостьОС.ОсновноеСредство = СтоимостьОС.ОсновноеСредство)
					|
					|ИНДЕКСИРОВАТЬ ПО
					|	СтоимостьОС.ОсновноеСредство
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|";
					
				Иначе
					
					Запрос.Текст = Запрос.Текст +
					"ВЫБРАТЬ
					|	СтоимостьОС.СтоимостьРеглОстаток + СтоимостьОС.СтоимостьЦФОстаток  КАК СуммаОстатокДт,
					|	СтоимостьОС.ОсновноеСредство КАК Субконто1,
					|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК Счет
					|ПОМЕСТИТЬ ВТ_ПервоначальнаяСтоимостьОС
					|ИЗ
					|	РегистрНакопления.СтоимостьОС.Остатки(
					|			&Период,
					|			Организация = &Организация
					|				И ОсновноеСредство В
					|					(ВЫБРАТЬ
					|						СписокОС.ОсновноеСредство
					|					ИЗ
					|						СписокОС)) КАК СтоимостьОС
					|
					|ИНДЕКСИРОВАТЬ ПО
					|	СтоимостьОС.ОсновноеСредство
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|";
				
				КонецЕсли; 
				
				Запрос.Текст = Запрос.Текст +
				"ВЫБРАТЬ
				|	-(АмортизацияОС.АмортизацияРеглОстаток + АмортизацияОС.АмортизацияЦФОстаток) КАК СуммаОстатокДт,
				|	-(АмортизацияОС.АмортизацияРеглОстаток + АмортизацияОС.АмортизацияЦФОстаток) КАК СуммаОстатокКт,
				|	АмортизацияОС.ОсновноеСредство КАК Субконто1,
				|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК Счет
				|ПОМЕСТИТЬ ВТ_АмортизацияОС
				|ИЗ
				|	РегистрНакопления.АмортизацияОС.Остатки(
				|			&Период,
				|			Организация = &Организация
				|				И ОсновноеСредство В
				|					(ВЫБРАТЬ
				|						СписокОС.ОсновноеСредство
				|					ИЗ
				|						СписокОС)) КАК АмортизацияОС
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	АмортизацияОС.ОсновноеСредство";
				
			Иначе
				
				Запрос.Текст = Запрос.Текст +
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ПервоначальнаяСтоимостьОС.СуммаОстатокДт,
				|	ПервоначальнаяСтоимостьОС.Субконто1,
				|	ПервоначальнаяСтоимостьОС.Счет
				|ПОМЕСТИТЬ ВТ_ПервоначальнаяСтоимостьОС
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный.Остатки(
				|			&Период,
				|			Счет В
				|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|					СчетаУчетаОС.СчетУчета
				|				ИЗ
				|					СчетаУчетаОС
				|				ГДЕ
				|					СчетаУчетаОС.СчетУчета ЕСТЬ НЕ NULL ),
				|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
				|			Организация = &Организация) КАК ПервоначальнаяСтоимостьОС
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	ПервоначальнаяСтоимостьОС.Субконто1
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	АмортизацияОС.СуммаОстатокДт,
				|	АмортизацияОС.СуммаОстатокКт,
				|	АмортизацияОС.Субконто1,
				|	АмортизацияОС.Счет
				|ПОМЕСТИТЬ ВТ_АмортизацияОС
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный.Остатки(
				|			&Период,
				|			Счет В
				|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|					СчетаУчетаОС.СчетНачисленияАмортизации
				|				ИЗ
				|					СчетаУчетаОС
				|				ГДЕ
				|					СчетаУчетаОС.СчетНачисленияАмортизации ЕСТЬ НЕ NULL ),
				|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
				|			Организация = &Организация) КАК АмортизацияОС
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	АмортизацияОС.Субконто1";
				
			КонецЕсли; 
			
			Запрос.Текст = Запрос.Текст + "
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтавкиНалогаНаИмуществоСрезПоследних.Период,
			|	СтавкиНалогаНаИмуществоСрезПоследних.Организация,
			|	СтавкиНалогаНаИмуществоСрезПоследних.НалоговаяСтавка,
			|	СтавкиНалогаНаИмуществоСрезПоследних.НалоговаяСтавкаДвижимоеИмущество,
			|	СтавкиНалогаНаИмуществоСрезПоследних.ОсвобождениеОтНалогообложения,
			|	СтавкиНалогаНаИмуществоСрезПоследних.ОсвобождениеОтНалогообложенияДвижимогоИмущества,
			|	СтавкиНалогаНаИмуществоСрезПоследних.КодНалоговойЛьготыОсвобождениеОтНалогообложения,
			|	СтавкиНалогаНаИмуществоСрезПоследних.СнижениеНалоговойСтавки,
			|	СтавкиНалогаНаИмуществоСрезПоследних.СнижениеНалоговойСтавкиДвижимоеИмущество,
			|	СтавкиНалогаНаИмуществоСрезПоследних.УменьшениеСуммыНалогаВПроцентах,
			|	СтавкиНалогаНаИмуществоСрезПоследних.ПроцентУменьшения
			|ПОМЕСТИТЬ ВТ_СтавкиНалогаНаИмуществоСрезПоследних
			|ИЗ
			|	РегистрСведений.СтавкиНалогаНаИмущество.СрезПоследних(&КонецПериода, Организация = &Организация) КАК СтавкиНалогаНаИмуществоСрезПоследних
			|;";
			
			Запрос.УстановитьПараметр("ОсновнойНалоговыйОрган", РеквизитыОрганизации.РегистрацияВНалоговомОргане);
			Запрос.УстановитьПараметр("Год", Год(ПериодРасчета));
			
			Если ПрименениеЕНВД Тогда
				
				// Получение коэффициента доли выручки от деятельности, облагаемой ЕНВД.
				ПериодПолученияКоэффициентаЕНВД = ?(Период = мДатаНачалаПериодаОтчета, Период, ДобавитьМесяц(Период, -1));
				КоэффициентРаспределенияЕНВД = УправлениеВнеоборотнымиАктивамиПереопределяемый.КоэффициентРаспределенияВыручкиПоВидамДеятельности(Организация, НачалоКвартала(ПериодПолученияКоэффициентаЕНВД), КонецКвартала(ПериодПолученияКоэффициентаЕНВД));
				Запрос.УстановитьПараметр("КоэффициентРаспределенияЕНВД", КоэффициентРаспределенияЕНВД);
				
				Запрос.Текст = Запрос.Текст +
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	СписокОС.ОсновноеСредство,
				|	ПервоначальныеСведенияОС.АмортизационнаяГруппа В (
				|				ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПерваяГруппа), 
				|				ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ВтораяГруппа)) КАК ЭтоПерваяВтораяАмортизационныеГруппы,
				|	ВЫБОР
				|		КОГДА СтавкиНалогаПоОтдельнымОС.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
				|			ТОГДА СтавкиНалогаПоОтдельнымОС.НалоговыйОрган
				|		ИНАЧЕ &ОсновнойНалоговыйОрган
				|	КОНЕЦ КАК РегистрацияВНалоговомОргане,
				|	ВЫБОР
				|		КОГДА СтавкиНалогаПоОтдельнымОС.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.СДругимКодомПоОКАТО)
				|				ИЛИ СтавкиНалогаПоОтдельнымОС.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
				|			ТОГДА СтавкиНалогаПоОтдельнымОС.КодПоОКТМО
				|		ИНАЧЕ ЕСТЬNULL(СтавкиНалогаНаИмуществоСрезПоследних.Организация.РегистрацияВНалоговомОргане.КодПоОКТМО, """")
				|	КОНЕЦ КАК КодПоОКТМО,
				|	ЕСТЬNULL(ВЫБОР
				|			КОГДА СтавкиНалогаПоОтдельнымОС.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке)
				|				ТОГДА СтавкиНалогаПоОтдельнымОС.СниженнаяНалоговаяСтавка
				|			КОГДА СтавкиНалогаПоОтдельнымОС.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
				|				ТОГДА СтавкиНалогаПоОтдельнымОС.НалоговаяСтавка
				|			ИНАЧЕ 
				|				ВЫБОР
				|					КОГДА СписокОС.ОсновноеСредство В (ВЫБРАТЬ ВТДвижимоеИмуществоПринятоеКУчетуПосле2013.ОС ИЗ ВТДвижимоеИмуществоПринятоеКУчетуПосле2013 КАК ВТДвижимоеИмуществоПринятоеКУчетуПосле2013)
				|						И НЕ ЕСТЬNULL(СтавкиНалогаПоОтдельнымОС.ДвижимоеИмуществоПодлежащееНалогообложению, ЛОЖЬ)
				|						И &Год >= 2018 ТОГДА
				|							СтавкиНалогаНаИмуществоСрезПоследних.НалоговаяСтавкаДвижимоеИмущество
				|					ИНАЧЕ
				|							СтавкиНалогаНаИмуществоСрезПоследних.НалоговаяСтавка
				|				КОНЕЦ
				|		КОНЕЦ, СтавкиНалогаНаИмуществоСрезПоследних.НалоговаяСтавка) КАК НалоговаяСтавка,
				|	ВЫБОР
				|		КОГДА СтавкиНалогаПоОтдельнымОС.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке)
				|			ТОГДА ИСТИНА
				|		КОГДА СтавкиНалогаПоОтдельнымОС.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
				|			ТОГДА ЛОЖЬ
				|		КОГДА СписокОС.ОсновноеСредство В (ВЫБРАТЬ ВТДвижимоеИмуществоПринятоеКУчетуПосле2013.ОС ИЗ ВТДвижимоеИмуществоПринятоеКУчетуПосле2013 КАК ВТДвижимоеИмуществоПринятоеКУчетуПосле2013)
				|				И НЕ ЕСТЬNULL(СтавкиНалогаПоОтдельнымОС.ДвижимоеИмуществоПодлежащееНалогообложению, ЛОЖЬ)
				|				И &Год >= 2018
				|			ТОГДА СтавкиНалогаНаИмуществоСрезПоследних.СнижениеНалоговойСтавкиДвижимоеИмущество
				|		ИНАЧЕ ЕСТЬNULL(СтавкиНалогаНаИмуществоСрезПоследних.СнижениеНалоговойСтавки, ЛОЖЬ)
				|	КОНЕЦ КАК СнижениеНалоговойСтавки,
				|	ВЫБОР
				|		КОГДА СтавкиНалогаПоОтдельнымОС.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения)
				|			ТОГДА ИСТИНА
				|		КОГДА СтавкиНалогаПоОтдельнымОС.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
				|			ТОГДА ЛОЖЬ
				|		ИНАЧЕ ЕСТЬNULL(СтавкиНалогаНаИмуществоСрезПоследних.ОсвобождениеОтНалогообложения, ЛОЖЬ)
				|	КОНЕЦ КАК ОсвобождениеОтНалогообложения,
				|	СтавкиНалогаНаИмуществоСрезПоследних.ОсвобождениеОтНалогообложенияДвижимогоИмущества КАК ОсвобождениеОтНалогообложенияДвижимогоИмущества,
				|	СписокОС.ОсновноеСредство.ГруппаОС В (
				|					ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Здания), 
				|					ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Сооружения), 
				|					ЗНАЧЕНИЕ(Перечисление.ГруппыОС.МноголетниеНасаждения), 
				|					ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ПрочееИмуществоТребующееГосударственнойРегистрации)) КАК ЭтоНедвижимость,
				|	ВЫБОР
				|		КОГДА СписокОС.ОсновноеСредство В
				|				(ВЫБРАТЬ
				|					Т.ОС
				|				ИЗ
				|					ВТДвижимоеИмуществоПринятоеКУчетуПосле2013 КАК Т)
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ДвижимоеИмуществоПринятоеКУчетуПосле2013,
				|	ВЫБОР
				|		КОГДА СтавкиНалогаПоОтдельнымОС.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения)
				|			ТОГДА СтавкиНалогаПоОтдельнымОС.КодНалоговойЛьготыОсвобождениеОтНалогообложения
				|		ИНАЧЕ СтавкиНалогаНаИмуществоСрезПоследних.КодНалоговойЛьготыОсвобождениеОтНалогообложения
				|	КОНЕЦ КАК КодНалоговойЛьготыОсвобождениеОтНалогообложения,
				|	ЕСТЬNULL(СтавкиНалогаПоОтдельнымОС.КодВидаИмущества, ""03"") КАК КодВидаИмущества,
				|	СтавкиНалогаПоОтдельнымОС.ДоляСтоимостиЧислитель КАК ДоляСтоимостиЧислитель,
				|	СтавкиНалогаПоОтдельнымОС.ДоляСтоимостиЗнаменатель КАК ДоляСтоимостиЗнаменатель,
				|	СтавкиНалогаПоОтдельнымОС.ДвижимоеИмуществоПодлежащееНалогообложению КАК ДвижимоеИмуществоПодлежащееНалогообложению,
				|	СтавкиНалогаПоОтдельнымОС.УсловныйНомер КАК УсловныйНомер,
				|	СтавкиНалогаПоОтдельнымОС.КадастровыйНомер КАК КадастровыйНомер,
				|	СтавкиНалогаПоОтдельнымОС.КадастровыйНомерПомещения КАК КадастровыйНомерПомещения,
				|	СтавкиНалогаПоОтдельнымОС.КБК КАК КБК,
				|	&Счетчик КАК Период,
				|	ВЫРАЗИТЬ((ЕСТЬNULL(ПервоначальнаяСтоимостьОС.СуммаОстатокДт, 0) - ЕСТЬNULL(ВЫБОР
				|				КОГДА СписокОС.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеИзноса)
				|						ИЛИ СписокОС.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеИзносаПоЕНАОФ)
				|					ТОГДА АмортизацияОС.СуммаОстатокДт
				|				ИНАЧЕ АмортизацияОС.СуммаОстатокКт
				|			КОНЕЦ, 0)) * КоэффициентыЕНВД.НеЕНВД + (ЕСТЬNULL(ПервоначальнаяСтоимостьОС.СуммаОстатокДт, 0) - ЕСТЬNULL(ВЫБОР
				|				КОГДА СписокОС.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеИзноса)
				|						ИЛИ СписокОС.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеИзносаПоЕНАОФ)
				|					ТОГДА АмортизацияОС.СуммаОстатокДт
				|				ИНАЧЕ АмортизацияОС.СуммаОстатокКт
				|			КОНЕЦ, 0)) * КоэффициентыЕНВД.Распределение * &КоэффициентРаспределенияЕНВД КАК ЧИСЛО(15, 2)) КАК ОстаточнаяСтоимость
				|ПОМЕСТИТЬ ВыборкаСчетчик
				|ИЗ
				|	СписокОС КАК СписокОС
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервоначальныеСведенияОС КАК ПервоначальныеСведенияОС
				|		ПО СписокОС.ОсновноеСредство = ПервоначальныеСведенияОС.ОсновноеСредство
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаБухгалтерскогоУчетаОССрезПоследних КАК СчетаБухгалтерскогоУчетаОССрезПоследних
				|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервоначальнаяСтоимостьОС КАК ПервоначальнаяСтоимостьОС
				|			ПО СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство = ПервоначальнаяСтоимостьОС.Субконто1
				|				И (СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета = ПервоначальнаяСтоимостьОС.Счет
				|					ИЛИ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыбытиеОС) = ПервоначальнаяСтоимостьОС.Счет)
				|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АмортизацияОС КАК АмортизацияОС
				|			ПО СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство = АмортизацияОС.Субконто1
				|				И СчетаБухгалтерскогоУчетаОССрезПоследних.СчетНачисленияАмортизации = АмортизацияОС.Счет
				|		ПО СписокОС.ОсновноеСредство = СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтавкиНалогаПоОтдельнымОС КАК СтавкиНалогаПоОтдельнымОС
				|		ПО СписокОС.ОсновноеСредство = СтавкиНалогаПоОтдельнымОС.ОсновноеСредство
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.СрезПоследних(
				|				&Период,
				|				Организация = &Организация
				|					И ОсновноеСредство В
				|						(ВЫБРАТЬ
				|							СписокОС.ОсновноеСредство
				|						ИЗ
				|							СписокОС)) КАК СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних
				|			ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыЕНВД КАК КоэффициентыЕНВД
				|			ПО СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство = КоэффициентыЕНВД.ОсновноеСредство
				|		ПО СписокОС.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство,
				|	ВТ_СтавкиНалогаНаИмуществоСрезПоследних КАК СтавкиНалогаНаИмуществоСрезПоследних";
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Счетчик", Счетчик);
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВыборкаСчетчик", "Выборка" + Формат(Счетчик, "ЧЦ=2; ЧВН="));
				Запрос.Выполнить();
				
			Иначе
				
				Запрос.Текст = Запрос.Текст +
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	СписокОС.ОсновноеСредство,
				|	ВЫБОР
				|		КОГДА ПервоначальныеСведенияОС.АмортизационнаяГруппа В (ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПерваяГруппа), ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ВтораяГруппа))
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЭтоПерваяВтораяАмортизационныеГруппы,
				|	ВЫБОР
				|		КОГДА СтавкиНалогаПоОтдельнымОС.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
				|			ТОГДА СтавкиНалогаПоОтдельнымОС.НалоговыйОрган
				|		ИНАЧЕ &ОсновнойНалоговыйОрган
				|	КОНЕЦ КАК РегистрацияВНалоговомОргане,
				|	ВЫБОР
				|		КОГДА СтавкиНалогаПоОтдельнымОС.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.СДругимКодомПоОКАТО)
				|				ИЛИ СтавкиНалогаПоОтдельнымОС.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
				|			ТОГДА СтавкиНалогаПоОтдельнымОС.КодПоОКТМО
				|		ИНАЧЕ ЕСТЬNULL(СтавкиНалогаНаИмуществоСрезПоследних.Организация.РегистрацияВНалоговомОргане.КодПоОКТМО, """")
				|	КОНЕЦ КАК КодПоОКТМО,
				|	ЕСТЬNULL(ВЫБОР
				|			КОГДА СтавкиНалогаПоОтдельнымОС.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке)
				|				ТОГДА СтавкиНалогаПоОтдельнымОС.СниженнаяНалоговаяСтавка
				|			КОГДА СтавкиНалогаПоОтдельнымОС.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
				|				ТОГДА СтавкиНалогаПоОтдельнымОС.НалоговаяСтавка
				|			ИНАЧЕ 
				|				ВЫБОР
				|					КОГДА СписокОС.ОсновноеСредство В (ВЫБРАТЬ ВТДвижимоеИмуществоПринятоеКУчетуПосле2013.ОС ИЗ ВТДвижимоеИмуществоПринятоеКУчетуПосле2013 КАК ВТДвижимоеИмуществоПринятоеКУчетуПосле2013)
				|						И НЕ ЕСТЬNULL(СтавкиНалогаПоОтдельнымОС.ДвижимоеИмуществоПодлежащееНалогообложению, ЛОЖЬ)
				|						И &Год >= 2018 ТОГДА
				|							СтавкиНалогаНаИмуществоСрезПоследних.НалоговаяСтавкаДвижимоеИмущество
				|					ИНАЧЕ
				|							СтавкиНалогаНаИмуществоСрезПоследних.НалоговаяСтавка
				|				КОНЕЦ
				|		КОНЕЦ, СтавкиНалогаНаИмуществоСрезПоследних.НалоговаяСтавка) КАК НалоговаяСтавка,
				|	ВЫБОР
				|		КОГДА СтавкиНалогаПоОтдельнымОС.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке)
				|			ТОГДА ИСТИНА
				|		КОГДА СтавкиНалогаПоОтдельнымОС.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
				|			ТОГДА ЛОЖЬ
				|		КОГДА СписокОС.ОсновноеСредство В (ВЫБРАТЬ ВТДвижимоеИмуществоПринятоеКУчетуПосле2013.ОС ИЗ ВТДвижимоеИмуществоПринятоеКУчетуПосле2013 КАК ВТДвижимоеИмуществоПринятоеКУчетуПосле2013)
				|				И НЕ ЕСТЬNULL(СтавкиНалогаПоОтдельнымОС.ДвижимоеИмуществоПодлежащееНалогообложению, ЛОЖЬ)
				|				И &Год >= 2018
				|			ТОГДА СтавкиНалогаНаИмуществоСрезПоследних.СнижениеНалоговойСтавкиДвижимоеИмущество
				|		ИНАЧЕ ЕСТЬNULL(СтавкиНалогаНаИмуществоСрезПоследних.СнижениеНалоговойСтавки, ЛОЖЬ)
				|	КОНЕЦ КАК СнижениеНалоговойСтавки,
				|	ВЫБОР
				|		КОГДА СтавкиНалогаПоОтдельнымОС.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения)
				|			ТОГДА ИСТИНА
				|		КОГДА СтавкиНалогаПоОтдельнымОС.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
				|			ТОГДА ЛОЖЬ
				|		ИНАЧЕ ЕСТЬNULL(СтавкиНалогаНаИмуществоСрезПоследних.ОсвобождениеОтНалогообложения, ЛОЖЬ)
				|	КОНЕЦ КАК ОсвобождениеОтНалогообложения,
				|	СтавкиНалогаНаИмуществоСрезПоследних.ОсвобождениеОтНалогообложенияДвижимогоИмущества КАК ОсвобождениеОтНалогообложенияДвижимогоИмущества,
				|	ВЫБОР
				|		КОГДА СписокОС.ОсновноеСредство.ГруппаОС В (
				|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Здания), 
				|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Сооружения), 
				|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.МноголетниеНасаждения), 
				|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ПрочееИмуществоТребующееГосударственнойРегистрации))
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЭтоНедвижимость,
				|	ВЫБОР
				|		КОГДА СписокОС.ОсновноеСредство В
				|				(ВЫБРАТЬ
				|					Т.ОС
				|				ИЗ
				|					ВТДвижимоеИмуществоПринятоеКУчетуПосле2013 КАК Т)
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ДвижимоеИмуществоПринятоеКУчетуПосле2013,
				|	ВЫБОР
				|		КОГДА СтавкиНалогаПоОтдельнымОС.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения)
				|			ТОГДА СтавкиНалогаПоОтдельнымОС.КодНалоговойЛьготыОсвобождениеОтНалогообложения
				|		ИНАЧЕ СтавкиНалогаНаИмуществоСрезПоследних.КодНалоговойЛьготыОсвобождениеОтНалогообложения
				|	КОНЕЦ КАК КодНалоговойЛьготыОсвобождениеОтНалогообложения,
				|	ЕСТЬNULL(СтавкиНалогаПоОтдельнымОС.КодВидаИмущества, ""03"") КАК КодВидаИмущества,
				|	СтавкиНалогаПоОтдельнымОС.ДоляСтоимостиЧислитель КАК ДоляСтоимостиЧислитель,
				|	СтавкиНалогаПоОтдельнымОС.ДоляСтоимостиЗнаменатель КАК ДоляСтоимостиЗнаменатель,
				|	СтавкиНалогаПоОтдельнымОС.ДвижимоеИмуществоПодлежащееНалогообложению КАК ДвижимоеИмуществоПодлежащееНалогообложению,
				|	СтавкиНалогаПоОтдельнымОС.УсловныйНомер КАК УсловныйНомер,
				|	СтавкиНалогаПоОтдельнымОС.КадастровыйНомер КАК КадастровыйНомер,
				|	СтавкиНалогаПоОтдельнымОС.КадастровыйНомерПомещения КАК КадастровыйНомерПомещения,
				|	СтавкиНалогаПоОтдельнымОС.КБК КАК КБК,
				|	&Счетчик КАК Период,
				|	ВЫРАЗИТЬ(ЕСТЬNULL(ПервоначальнаяСтоимостьОС.СуммаОстатокДт, 0) - ЕСТЬNULL(ВЫБОР
				|				КОГДА СписокОС.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеИзноса)
				|						ИЛИ СписокОС.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеИзносаПоЕНАОФ)
				|					ТОГДА АмортизацияОС.СуммаОстатокДт
				|				ИНАЧЕ АмортизацияОС.СуммаОстатокКт
				|			КОНЕЦ, 0) КАК ЧИСЛО(15, 2)) КАК ОстаточнаяСтоимость
				|ПОМЕСТИТЬ ВыборкаСчетчик
				|ИЗ
				|	СписокОС КАК СписокОС
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервоначальныеСведенияОС КАК ПервоначальныеСведенияОС
				|		ПО СписокОС.ОсновноеСредство = ПервоначальныеСведенияОС.ОсновноеСредство
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаБухгалтерскогоУчетаОССрезПоследних КАК СчетаБухгалтерскогоУчета
				|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервоначальнаяСтоимостьОС КАК ПервоначальнаяСтоимостьОС
				|			ПО (СчетаБухгалтерскогоУчета.СчетУчета = ПервоначальнаяСтоимостьОС.Счет
				|					ИЛИ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыбытиеОС) = ПервоначальнаяСтоимостьОС.Счет)
				|				И СчетаБухгалтерскогоУчета.ОсновноеСредство = ПервоначальнаяСтоимостьОС.Субконто1
				|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АмортизацияОС КАК АмортизацияОС
				|			ПО СчетаБухгалтерскогоУчета.ОсновноеСредство = АмортизацияОС.Субконто1
				|				И СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации = АмортизацияОС.Счет
				|		ПО СписокОС.ОсновноеСредство = СчетаБухгалтерскогоУчета.ОсновноеСредство
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтавкиНалогаПоОтдельнымОС КАК СтавкиНалогаПоОтдельнымОС
				|		ПО СписокОС.ОсновноеСредство = СтавкиНалогаПоОтдельнымОС.ОсновноеСредство,
				|	ВТ_СтавкиНалогаНаИмуществоСрезПоследних КАК СтавкиНалогаНаИмуществоСрезПоследних";
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Счетчик", Счетчик);
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВыборкаСчетчик", "Выборка" + Формат(Счетчик, "ЧЦ=2; ЧВН="));
				Запрос.Выполнить();
				
			КонецЕсли;
			
			Запрос.Текст = 
			"УНИЧТОЖИТЬ СтавкиПоОтдельнымОССрезПоследних;
			|УНИЧТОЖИТЬ СтавкиПоОтдельнымОССрезПоследнихПериоды;
			|УНИЧТОЖИТЬ ВТ_СтавкиНалогаПоОтдельнымОС;
			|УНИЧТОЖИТЬ ВТ_СрезПоследних;
			|УНИЧТОЖИТЬ СписокОС;
			|УНИЧТОЖИТЬ СчетаУчетаОС;
			|УНИЧТОЖИТЬ ВТ_ПервоначальнаяСтоимостьОС;
			|УНИЧТОЖИТЬ ВТ_ПервоначальныеСведенияОС;
			|УНИЧТОЖИТЬ ВТ_СчетаБухгалтерскогоУчетаОССрезПоследних;
			|УНИЧТОЖИТЬ ВТ_СтавкиНалогаНаИмуществоСрезПоследних;
			|УНИЧТОЖИТЬ ВТ_АмортизацияОС;
			|УНИЧТОЖИТЬ СписокРазрешенныхОС";
			Запрос.Выполнить();
			
			ТекстОбъединяющегоЗапроса = 
				ТекстОбъединяющегоЗапроса
				+ ?(ПустаяСтрока(ТекстОбъединяющегоЗапроса), 
						"ВЫБРАТЬ РАЗРЕШЕННЫЕ *
						|",
						"ОБЪЕДИНИТЬ ВСЕ
						|ВЫБРАТЬ *
						|")
				+ ?(ПустаяСтрока(ТекстОбъединяющегоЗапроса), 
						"ПОМЕСТИТЬ НалоговаяБазаПоНалогуНаИмущество
						|",
						"")
				+ "ИЗ Выборка" + Формат(Счетчик, "ЧЦ=2; ЧВН=") + "
				|ГДЕ
				|	ОстаточнаяСтоимость > 0
				|";
			
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		Период  = ДобавитьМесяц(Период, 1);
	КонецЦикла;
	
	Если ТекстОбъединяющегоЗапроса <> "" Тогда
		
		Запрос.Текст = ТекстОбъединяющегоЗапроса;
		Запрос.Выполнить();
		
		РасчетИмущественныхНалогов.СоздатьНалоговыеОрганыСУстановленнойУплатойАвансов(
			Запрос.МенеджерВременныхТаблиц, Организация, ПериодРасчета, "НалогНаИмущество");
		
		Делитель = Месяц(ПериодРасчета) + 1;
		Запрос.УстановитьПараметр("КонечныйПериод", Делитель);
		Запрос.УстановитьПараметр("КодЛьготыДвижимоеИмуществоПринятоеКУчетуПосле2013", "2010257");
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НалоговаяБазаПоНалогуНаИмущество.Период КАК Период,
		|	ЕСТЬNULL(НалоговаяБазаПоНалогуНаИмущество.КодВидаИмущества, ""03"") КАК КодВидаИмущества,
		|	ЕСТЬNULL(НалоговаяБазаПоНалогуНаИмущество.ДоляСтоимостиЧислитель, 0) КАК ДоляСтоимостиЧислитель,
		|	ЕСТЬNULL(НалоговаяБазаПоНалогуНаИмущество.ДоляСтоимостиЗнаменатель, 0) КАК ДоляСтоимостиЗнаменатель,
		|	ЕСТЬNULL(НалоговаяБазаПоНалогуНаИмущество.УсловныйНомер, """") КАК УсловныйНомер,
		|	ЕСТЬNULL(НалоговаяБазаПоНалогуНаИмущество.КадастровыйНомер, """") КАК КадастровыйНомер,
		|	ЕСТЬNULL(НалоговаяБазаПоНалогуНаИмущество.КадастровыйНомерПомещения, """") КАК КадастровыйНомерПомещения,
		|	ЕСТЬNULL(НалоговаяБазаПоНалогуНаИмущество.КБК, """") КАК КБК,
		|	НалоговаяБазаПоНалогуНаИмущество.РегистрацияВНалоговомОргане КАК ИФНС,
		|	НалоговаяБазаПоНалогуНаИмущество.КодПоОКТМО КАК КодПоОКТМО,
		|	ЕСТЬNULL(НалоговаяБазаПоНалогуНаИмущество.НалоговаяСтавка, 0) КАК НалоговаяСтавка,
		|	НалоговаяБазаПоНалогуНаИмущество.СнижениеНалоговойСтавки КАК ПонижениеНалоговойСтавки,
		|	ВЫБОР
		|		КОГДА НалоговаяБазаПоНалогуНаИмущество.ОсвобождениеОтНалогообложения
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ВЫБОР
		|				КОГДА &Год >= 2015
		|						И (НалоговаяБазаПоНалогуНаИмущество.ДвижимоеИмуществоПринятоеКУчетуПосле2013
		|							И НЕ ЕСТЬNULL(НалоговаяБазаПоНалогуНаИмущество.ДвижимоеИмуществоПодлежащееНалогообложению, ЛОЖЬ))
		|						И ВЫБОР
		|							КОГДА &Год >= 2018
		|								ТОГДА НалоговаяБазаПоНалогуНаИмущество.ОсвобождениеОтНалогообложенияДвижимогоИмущества
		|							ИНАЧЕ ИСТИНА
		|						КОНЕЦ
		|						И НЕ НалоговаяБазаПоНалогуНаИмущество.ЭтоПерваяВтораяАмортизационныеГруппы
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|	КОНЕЦ КАК ОсвобождениеОтНалогообложения,
		|	ВЫБОР
		|		КОГДА НалоговаяБазаПоНалогуНаИмущество.ОсвобождениеОтНалогообложения
		|			ТОГДА НалоговаяБазаПоНалогуНаИмущество.КодНалоговойЛьготыОсвобождениеОтНалогообложения
		|		ИНАЧЕ ВЫБОР
		|				КОГДА &Год >= 2015
		|						И (НалоговаяБазаПоНалогуНаИмущество.ДвижимоеИмуществоПринятоеКУчетуПосле2013
		|							И НЕ ЕСТЬNULL(НалоговаяБазаПоНалогуНаИмущество.ДвижимоеИмуществоПодлежащееНалогообложению, ЛОЖЬ))
		|						И ВЫБОР
		|							КОГДА &Год >= 2018
		|								ТОГДА НалоговаяБазаПоНалогуНаИмущество.ОсвобождениеОтНалогообложенияДвижимогоИмущества
		|							ИНАЧЕ ИСТИНА
		|						КОНЕЦ
		|						И НЕ НалоговаяБазаПоНалогуНаИмущество.ЭтоПерваяВтораяАмортизационныеГруппы
		|					ТОГДА &КодЛьготыДвижимоеИмуществоПринятоеКУчетуПосле2013
		|				ИНАЧЕ """"
		|			КОНЕЦ
		|	КОНЕЦ КАК КодНалоговойЛьготыОсвобождениеОтНалогообложения,
		|	НалоговаяБазаПоНалогуНаИмущество.ОсновноеСредство КАК ОсновноеСредство,
		|	ВЫБОР
		|		КОГДА ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов.НалоговыйОрган ЕСТЬ NULL 
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК УплачиваютсяАвансы,
		|	ВЫБОР
		|		КОГДА &Год < 2015
		|					И НалоговаяБазаПоНалогуНаИмущество.ДвижимоеИмуществоПринятоеКУчетуПосле2013
		|				ИЛИ &Год >= 2015
		|					И НалоговаяБазаПоНалогуНаИмущество.ЭтоПерваяВтораяАмортизационныеГруппы
		|			ТОГДА 0
		|		ИНАЧЕ НалоговаяБазаПоНалогуНаИмущество.ОстаточнаяСтоимость
		|	КОНЕЦ КАК ОстаточнаяСтоимость,
		|	ВЫБОР
		|		КОГДА НалоговаяБазаПоНалогуНаИмущество.ЭтоНедвижимость
		|			ТОГДА НалоговаяБазаПоНалогуНаИмущество.ОстаточнаяСтоимость
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОстаточнаяСтоимостьНедвижимости,
		|	НалоговаяБазаПоНалогуНаИмущество.ОстаточнаяСтоимость КАК ОстаточнаяСтоимостьОсновныхСредств
		|ПОМЕСТИТЬ ВТ_НалоговаяБаза
		|ИЗ
		|	НалоговаяБазаПоНалогуНаИмущество КАК НалоговаяБазаПоНалогуНаИмущество
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов КАК ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов
		|		ПО НалоговаяБазаПоНалогуНаИмущество.РегистрацияВНалоговомОргане = ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов.НалоговыйОрган
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НалоговаяБаза.КодВидаИмущества,
		|	ВТ_НалоговаяБаза.ДоляСтоимостиЧислитель,
		|	ВТ_НалоговаяБаза.ДоляСтоимостиЗнаменатель,
		|	ВТ_НалоговаяБаза.ИФНС,
		|	ВТ_НалоговаяБаза.КодПоОКТМО,
		|	ВТ_НалоговаяБаза.НалоговаяСтавка,
		|	ВТ_НалоговаяБаза.ПонижениеНалоговойСтавки,
		|	ВТ_НалоговаяБаза.ОсвобождениеОтНалогообложения,
		|	ВТ_НалоговаяБаза.КодНалоговойЛьготыОсвобождениеОтНалогообложения,
		|	ВТ_НалоговаяБаза.ОсновноеСредство,
		|	ВТ_НалоговаяБаза.УплачиваютсяАвансы,
		|	ВТ_НалоговаяБаза.УсловныйНомер,
		|	ВТ_НалоговаяБаза.КадастровыйНомер,
		|	ВТ_НалоговаяБаза.КадастровыйНомерПомещения,
		|	ВТ_НалоговаяБаза.КБК,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 1
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0101,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 2
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0102,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 3
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0103,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 4
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0104,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 5
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0105,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 6
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0106,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 7
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0107,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 8
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0108,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 9
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0109,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 10
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0110,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 11
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0111,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 12
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа0112,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = 13
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНа3112,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = &КонечныйПериод
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимостьНедвижимости
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьНедвижимости,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_НалоговаяБаза.Период = &КонечныйПериод
		|				ТОГДА ВТ_НалоговаяБаза.ОстаточнаяСтоимостьОсновныхСредств
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОстаточнаяСтоимостьОсновныхСредств
		|ИЗ
		|	ВТ_НалоговаяБаза КАК ВТ_НалоговаяБаза
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_НалоговаяБаза.КодВидаИмущества,
		|	ВТ_НалоговаяБаза.ДоляСтоимостиЧислитель,
		|	ВТ_НалоговаяБаза.ДоляСтоимостиЗнаменатель,
		|	ВТ_НалоговаяБаза.ИФНС,
		|	ВТ_НалоговаяБаза.КодПоОКТМО,
		|	ВТ_НалоговаяБаза.НалоговаяСтавка,
		|	ВТ_НалоговаяБаза.ПонижениеНалоговойСтавки,
		|	ВТ_НалоговаяБаза.ОсвобождениеОтНалогообложения,
		|	ВТ_НалоговаяБаза.КодНалоговойЛьготыОсвобождениеОтНалогообложения,
		|	ВТ_НалоговаяБаза.ОсновноеСредство,
		|	ВТ_НалоговаяБаза.УплачиваютсяАвансы,
		|	ВТ_НалоговаяБаза.УсловныйНомер,
		|	ВТ_НалоговаяБаза.КадастровыйНомер,
		|	ВТ_НалоговаяБаза.КадастровыйНомерПомещения,
		|	ВТ_НалоговаяБаза.КБК";
		
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			
			РасчетНалога = Результат.Выгрузить();
			
			КолонкиГруппировок = ""
			+ "УплачиваютсяАвансы,"
			+ "ИФНС,"
			+ "КодПоОКТМО,"
			+ "КодВидаИмущества,"
			+ "КБК,"
			+ "ДоляСтоимостиЧислитель,"
			+ "ДоляСтоимостиЗнаменатель,"
			+ "НалоговаяСтавка,"
			+ "ПонижениеНалоговойСтавки,"
			+ "ОсвобождениеОтНалогообложения,"
			+ "КодНалоговойЛьготыОсвобождениеОтНалогообложения";
			
			КолонкиСуммирования = ""
			+ "ОстаточнаяСтоимостьНа0101,"
			+ "ОстаточнаяСтоимостьНа0102,"
			+ "ОстаточнаяСтоимостьНа0103,"
			+ "ОстаточнаяСтоимостьНа0104,"
			+ "ОстаточнаяСтоимостьНа0105,"
			+ "ОстаточнаяСтоимостьНа0106,"
			+ "ОстаточнаяСтоимостьНа0107,"
			+ "ОстаточнаяСтоимостьНа0108,"
			+ "ОстаточнаяСтоимостьНа0109,"
			+ "ОстаточнаяСтоимостьНа0110,"
			+ "ОстаточнаяСтоимостьНа0111,"
			+ "ОстаточнаяСтоимостьНа0112,"
			+ "ОстаточнаяСтоимостьНа3112";
			
			КолонкиРасчета = "" 
			+ "СредняяСтоимость,"
			+ "НеоблагаемаяСредняяСтоимость,"
			+ "НалоговаяБаза,"
			+ "СуммаНалога,"
			+ "СуммаУменьшенияСуммыНалога,"
			+ "СуммаНалогаКУплате,"
			+ "СуммаАвансовыхПлатежей1Кв,"
			+ "СуммаАвансовыхПлатежей2Кв,"
			+ "СуммаАвансовыхПлатежей3Кв";
			
			РасчетНалогаПоЛистам = РасчетНалога.Скопировать();
			РасчетНалогаПоЛистам.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
			
			ДопКолонки = Новый Структура(КолонкиРасчета);
			Для каждого Колонка Из ДопКолонки Цикл
				РасчетНалогаПоЛистам.Колонки.Добавить(Колонка.Ключ,
					ОбщегоНазначения.ОписаниеТипаЧисло(15, 0, ДопустимыйЗнак.Неотрицательный));
			КонецЦикла;
			
			// С целью оптимизации производительности список имён полей-периодов формируется заранее, а не динамически в циклах.
			КолонкиПериоды = Новый ТаблицаЗначений;
			КолонкиПериоды.Колонки.Добавить("Счетчик", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2, 0, ДопустимыйЗнак.Неотрицательный)));
			КолонкиПериоды.Колонки.Добавить("ОстаточнаяСтоимостьИмя", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(25, ДопустимаяДлина.Фиксированная)));
			Для Счетчик = 1 По Делитель Цикл
				
				КолонкаПериод = КолонкиПериоды.Добавить();
				КолонкаПериод.Счетчик = Счетчик;
				КолонкаПериод.ОстаточнаяСтоимостьИмя = "ОстаточнаяСтоимостьНа" + ?(Счетчик = 13, "3112", "01" + Формат(Счетчик, "ЧЦ=2; ЧВН="));
			
			КонецЦикла;
				
			Отбор = Новый Структура(КолонкиГруппировок);
			РасчетНалогаПоЛистам.Индексы.Добавить(КолонкиГруппировок);
				
			Для Каждого СтрокаТаблицы Из РасчетНалогаПоЛистам Цикл
				
				Если НЕ ГодовойРасчет И НЕ СтрокаТаблицы.УплачиваютсяАвансы Тогда
					Продолжить;
				КонецЕсли;
				
				Если НЕ ГодовойРасчет И (СтрокаТаблицы.КодВидаИмущества = "04" ИЛИ СтрокаТаблицы.КодВидаИмущества = "07") Тогда
					Продолжить;
				КонецЕсли;
				
				УчитыватьАвансы = ГодовойРасчет И СтрокаТаблицы.УплачиваютсяАвансы;
				
				ДоляСтоимости = 1;
				
				КодВидаИмущества = ?(ПустаяСтрока(СтрокаТаблицы.КодВидаИмущества), "03", СтрокаТаблицы.КодВидаИмущества);
				Если КодВидаИмущества = "04" Тогда
					ДоляСтоимости = 0;
				ИначеЕсли КодВидаИмущества = "02" Тогда
					ДоляСтоимости = СтрокаТаблицы.ДоляСтоимостиЧислитель / СтрокаТаблицы.ДоляСтоимостиЗнаменатель;
				КонецЕсли;
				
				ДелимоеСредняяСтоимость = 0;
				ДелимоеНеоблагаемаяСредняяСтоимость = 0;
				Для каждого КолонкаПериод Из КолонкиПериоды Цикл
					Счетчик = КолонкаПериод.Счетчик;
					
					СтрокаТаблицы[КолонкаПериод.ОстаточнаяСтоимостьИмя] = Окр(СтрокаТаблицы[КолонкаПериод.ОстаточнаяСтоимостьИмя]);
					ДелимоеСредняяСтоимость = ДелимоеСредняяСтоимость + СтрокаТаблицы[КолонкаПериод.ОстаточнаяСтоимостьИмя];
					
					Если СтрокаТаблицы.ОсвобождениеОтНалогообложения Тогда
						ДелимоеНеоблагаемаяСредняяСтоимость = ДелимоеНеоблагаемаяСредняяСтоимость + СтрокаТаблицы[КолонкаПериод.ОстаточнаяСтоимостьИмя];
					КонецЕсли;
					
					Если УчитыватьАвансы Тогда
						Если Счетчик = 4 Тогда
							СредняяСтоимость1Кв = ДелимоеСредняяСтоимость / Счетчик;
							НеоблагаемаяСредняяСтоимость1Кв = ДелимоеНеоблагаемаяСредняяСтоимость / Счетчик;
						ИначеЕсли Счетчик = 7 Тогда
							СредняяСтоимость2Кв = ДелимоеСредняяСтоимость / Счетчик;
							НеоблагаемаяСредняяСтоимость2Кв = ДелимоеНеоблагаемаяСредняяСтоимость / Счетчик;
						ИначеЕсли Счетчик = 10 Тогда
							СредняяСтоимость3Кв = ДелимоеСредняяСтоимость / Счетчик;
							НеоблагаемаяСредняяСтоимость3Кв = ДелимоеНеоблагаемаяСредняяСтоимость / Счетчик;
						КонецЕсли;			
					КонецЕсли;
					
				КонецЦикла;
				
				СтрокаТаблицы.СредняяСтоимость = Окр(ДелимоеСредняяСтоимость / Делитель);
				СтрокаТаблицы.НеоблагаемаяСредняяСтоимость = Окр(ДелимоеНеоблагаемаяСредняяСтоимость / Делитель);
				
				СтоимостьОблагаемогоНалогомИмущества = Макс(СтрокаТаблицы.СредняяСтоимость - СтрокаТаблицы.НеоблагаемаяСредняяСтоимость, 0);
				
				Если УчитыватьАвансы Тогда
					СтоимостьОблагаемогоНалогомИмущества1Кв = Макс(СредняяСтоимость1Кв - НеоблагаемаяСредняяСтоимость1Кв, 0);
					СтоимостьОблагаемогоНалогомИмущества2Кв = Макс(СредняяСтоимость2Кв - НеоблагаемаяСредняяСтоимость2Кв, 0);
					СтоимостьОблагаемогоНалогомИмущества3Кв = Макс(СредняяСтоимость3Кв - НеоблагаемаяСредняяСтоимость3Кв, 0);
				КонецЕсли;
				
				СтрокаТаблицы.НалоговаяБаза = Окр(СтоимостьОблагаемогоНалогомИмущества * ДоляСтоимости);	
				
				Если УчитыватьАвансы Тогда
					НалоговаяБаза1Кв = Окр(СтоимостьОблагаемогоНалогомИмущества1Кв * ДоляСтоимости);
					НалоговаяБаза2Кв = Окр(СтоимостьОблагаемогоНалогомИмущества2Кв * ДоляСтоимости);
					НалоговаяБаза3Кв = Окр(СтоимостьОблагаемогоНалогомИмущества3Кв * ДоляСтоимости);
				КонецЕсли;
				
				Если ГодовойРасчет Тогда
					СтрокаТаблицы.СуммаНалога = Окр(СтрокаТаблицы.НалоговаяБаза * СтрокаТаблицы.НалоговаяСтавка / 100);
				Иначе	
					СтрокаТаблицы.СуммаНалога = Окр(СтрокаТаблицы.НалоговаяБаза * СтрокаТаблицы.НалоговаяСтавка / 100 / 4);
				КонецЕсли;
				
				Если УчитыватьАвансы Тогда
					
					СтрокаТаблицы.СуммаАвансовыхПлатежей1Кв = Окр(НалоговаяБаза1Кв * СтрокаТаблицы.НалоговаяСтавка / 100 / 4);
					СтрокаТаблицы.СуммаАвансовыхПлатежей2Кв = Окр(НалоговаяБаза2Кв * СтрокаТаблицы.НалоговаяСтавка / 100 / 4);
					СтрокаТаблицы.СуммаАвансовыхПлатежей3Кв = Окр(НалоговаяБаза3Кв * СтрокаТаблицы.НалоговаяСтавка / 100 / 4);
					
				КонецЕсли;
				
				
				Если СтрокаТаблицы.ИФНС = РеквизитыОрганизации.РегистрацияВНалоговомОргане Тогда
				
					СтрокаТаблицы.СуммаУменьшенияСуммыНалога = Окр(СтрокаТаблицы.СуммаНалога * ПроцентУменьшенияСуммыНалога / 100);
					СтрокаТаблицы.СуммаНалогаКУплате = Макс(СтрокаТаблицы.СуммаНалога - СтрокаТаблицы.СуммаУменьшенияСуммыНалога, 0);
					
					Если УчитыватьАвансы Тогда
						
						СтрокаТаблицы.СуммаАвансовыхПлатежей1Кв = СтрокаТаблицы.СуммаАвансовыхПлатежей1Кв
							- Окр(СтрокаТаблицы.СуммаАвансовыхПлатежей1Кв * ПроцентУменьшенияСуммыНалога / 100);
						СтрокаТаблицы.СуммаАвансовыхПлатежей2Кв = СтрокаТаблицы.СуммаАвансовыхПлатежей2Кв
							- Окр(СтрокаТаблицы.СуммаАвансовыхПлатежей2Кв * ПроцентУменьшенияСуммыНалога / 100);
						СтрокаТаблицы.СуммаАвансовыхПлатежей3Кв = СтрокаТаблицы.СуммаАвансовыхПлатежей3Кв
							- Окр(СтрокаТаблицы.СуммаАвансовыхПлатежей3Кв * ПроцентУменьшенияСуммыНалога / 100);
							
					КонецЕсли;
					
				Иначе
					
					СтрокаТаблицы.СуммаНалогаКУплате = СтрокаТаблицы.СуммаНалога;
					
				КонецЕсли;
				
				// Распределим полученные суммы по объектам ОС
				
				ЗаполнитьЗначенияСвойств(Отбор, СтрокаТаблицы);
				РасчетНалогаПоОбъектамОС = РасчетНалога.Скопировать(Отбор);
					
				КоэффициентыРаспределения = Новый Массив;
				КоэффициентыРаспределения1Кв = Новый Массив;
				КоэффициентыРаспределения2Кв = Новый Массив;
				КоэффициентыРаспределения3Кв = Новый Массив;
				
				Для Каждого СтрокаПоОбъектуОС Из РасчетНалогаПоОбъектамОС Цикл
					
					ДелимоеСредняяСтоимость = 0;
					Для каждого КолонкаПериод Из КолонкиПериоды Цикл
						Счетчик = КолонкаПериод.Счетчик;
						
						СтрокаПоОбъектуОС[КолонкаПериод.ОстаточнаяСтоимостьИмя] = Окр(СтрокаПоОбъектуОС[КолонкаПериод.ОстаточнаяСтоимостьИмя], 2);
						ДелимоеСредняяСтоимость = ДелимоеСредняяСтоимость + СтрокаПоОбъектуОС[КолонкаПериод.ОстаточнаяСтоимостьИмя];
						
						Если УчитыватьАвансы Тогда
							Если Счетчик = 4 Тогда
								СредняяСтоимость1Кв = Окр(ДелимоеСредняяСтоимость / Счетчик, 2);
							ИначеЕсли Счетчик = 7 Тогда
								СредняяСтоимость2Кв = Окр(ДелимоеСредняяСтоимость / Счетчик, 2);
							ИначеЕсли Счетчик = 10 Тогда
								СредняяСтоимость3Кв = Окр(ДелимоеСредняяСтоимость / Счетчик, 2);
							КонецЕсли;			
						КонецЕсли;
						
					КонецЦикла;
					СредняяСтоимость = Окр(ДелимоеСредняяСтоимость / Делитель, 2);
					
					КоэффициентыРаспределения.Добавить(СредняяСтоимость);
					
					Если УчитыватьАвансы Тогда
						КоэффициентыРаспределения1Кв.Добавить(СредняяСтоимость1Кв);
						КоэффициентыРаспределения2Кв.Добавить(СредняяСтоимость2Кв);
						КоэффициентыРаспределения3Кв.Добавить(СредняяСтоимость3Кв);
					КонецЕсли;
					
				КонецЦикла;	
				
				Для каждого Колонка Из ДопКолонки Цикл
					
					РасчетНалогаПоОбъектамОС.Колонки.Добавить(Колонка.Ключ,
						ОбщегоНазначения.ОписаниеТипаЧисло(15, 2, ДопустимыйЗнак.Неотрицательный));
						
					Если Колонка.Ключ = "СуммаАвансовыхПлатежей1Кв" Тогда
						Коэффициенты = КоэффициентыРаспределения1Кв;
					ИначеЕсли Колонка.Ключ = "СуммаАвансовыхПлатежей2Кв" Тогда
						Коэффициенты = КоэффициентыРаспределения2Кв;
					ИначеЕсли Колонка.Ключ = "СуммаАвансовыхПлатежей3Кв" Тогда
						Коэффициенты = КоэффициентыРаспределения3Кв;
					Иначе
						Коэффициенты = КоэффициентыРаспределения;
					КонецЕсли;
						
					Если СтрокаТаблицы[Колонка.Ключ] > 0 Тогда
						РаспределенныеСуммы = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
												СтрокаТаблицы[Колонка.Ключ], Коэффициенты);
						Если РаспределенныеСуммы <> Неопределено Тогда
							РасчетНалогаПоОбъектамОС.ЗагрузитьКолонку(РаспределенныеСуммы, Колонка.Ключ);
						КонецЕсли;
					КонецЕсли;	
					
				КонецЦикла;
				
				Для Каждого СтрокаПоОбъектуОС Из РасчетНалогаПоОбъектамОС Цикл
					
					НоваяСтрока = ТаблицаРасчетНалога.Добавить();
					НоваяСтрока.ВидНалоговойБазы = Перечисления.НалоговаяБазаПоНалогуНаИмущество.СреднегодоваяСтоимость;
					НоваяСтрока.КодВидаИмущества = КодВидаИмущества;
					
					СвойстваПоСтрокеТаблицы = ""
					+ "ИФНС,"
					+ "КодПоОКТМО,"
					+ "КодНалоговойЛьготыОсвобождениеОтНалогообложения,"
					+ "НалоговаяСтавка,"
					+ "КБК,"
					+ "ПонижениеНалоговойСтавки";
					
					Если КодВидаИмущества = "02" Тогда
						СвойстваПоСтрокеТаблицы = СвойстваПоСтрокеТаблицы + ","
						+ "ДоляСтоимостиЧислитель,"
						+ "ДоляСтоимостиЗнаменатель";
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы, СвойстваПоСтрокеТаблицы);
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПоОбъектуОС, ,СвойстваПоСтрокеТаблицы);
					
					Если УчитыватьАвансы Тогда
						
						НоваяСтрока.СуммаАвансовыхПлатежей = СтрокаПоОбъектуОС.СуммаАвансовыхПлатежей1Кв
															+ СтрокаПоОбъектуОС.СуммаАвансовыхПлатежей2Кв
															+ СтрокаПоОбъектуОС.СуммаАвансовыхПлатежей3Кв;
						
						НоваяСтрока.СуммаНалогаКУплате = НоваяСтрока.СуммаНалогаКУплате - НоваяСтрока.СуммаАвансовыхПлатежей;
						
					КонецЕсли;
					
					Если НЕ ГодовойРасчет Тогда
						
						НоваяСтрока.СуммаАвансовыхПлатежей = НоваяСтрока.СуммаНалогаКУплате;
						
					КонецЕсли;
						
				КонецЦикла;
				
			КонецЦикла;
						
		КонецЕсли;
			
	КонецЕсли;
	
	ПрименениеОСНО = УчетнаяПолитика.СистемаНалогообложения(Организация, ПериодРасчета) = Перечисления.СистемыНалогообложения.Общая;
	ПрименениеУСН = УчетнаяПолитика.СистемаНалогообложения(Организация, ПериодРасчета) = Перечисления.СистемыНалогообложения.Упрощенная;
	ПлательщикЕНВД = УчетнаяПолитика.ПлательщикЕНВД(Организация, ПериодРасчета);
	
	Если ПериодРасчета >= '20150101' ИЛИ ПрименениеОСНО 
		ИЛИ (ПериодРасчета >= '20140701' И ПериодРасчета < '20150101' И ПлательщикЕНВД) Тогда

		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; // Хранит НалоговыеОрганыСУстановленнойУплатойАвансов
		РасчетИмущественныхНалогов.СоздатьНалоговыеОрганыСУстановленнойУплатойАвансов(
			МенеджерВременныхТаблиц, Организация, ПериодРасчета, "НалогНаИмущество");
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("ПериодРасчета", ПериодРасчета);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ОсновнойНалоговыйОрган", РеквизитыОрганизации.РегистрацияВНалоговомОргане);
		Запрос.УстановитьПараметр("ПрименениеУСН", ПрименениеУСН);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
		|			ТОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.НалоговыйОрган
		|		ИНАЧЕ &ОсновнойНалоговыйОрган
		|	КОНЕЦ КАК ИФНС,
		|	ВЫБОР
		|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.СДругимКодомПоОКАТО)
		|				ИЛИ СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
		|			ТОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КодПоОКТМО
		|		ИНАЧЕ ЕСТЬNULL(СтавкиНалогаНаИмуществоСрезПоследних.Организация.РегистрацияВНалоговомОргане.КодПоОКТМО, """")
		|	КОНЕЦ КАК КодПоОКТМО,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ОсновноеСредство,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КадастровыйНомер КАК КадастровыйНомер,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КадастровыйНомерПомещения КАК КадастровыйНомерПомещения,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КадастроваяСтоимость,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.НеоблагаемаяКадастроваяСтоимость,
		|	ВЫБОР
		|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОсвобождениеОтНалогообложения,
		|	ВЫБОР
		|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения)
		|			ТОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КодНалоговойЛьготыОсвобождениеОтНалогообложения
		|		ИНАЧЕ СтавкиНалогаНаИмуществоСрезПоследних.КодНалоговойЛьготыОсвобождениеОтНалогообложения
		|	КОНЕЦ КАК КодНалоговойЛьготыОсвобождениеОтНалогообложения,
		|	ВЫБОР
		|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПонижениеНалоговойСтавки,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляСтоимостиЧислитель,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляСтоимостиЗнаменатель,
		|	ВЫБОР
		|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке)
		|			ТОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.СниженнаяНалоговаяСтавка
		|		ИНАЧЕ СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.НалоговаяСтавка
		|	КОНЕЦ КАК НалоговаяСтавка,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДатаРегистрацииПраваСобственности,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДатаПрекращенияПраваСобственности,
		|	&ПрименениеУСН
		|		ИЛИ СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ИспользуетсяТолькоВДеятельностиОблагаемойЕНВД КАК ИспользуетсяТолькоВДеятельностиОблагаемойЕНВД,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.КодВидаИмущества,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляВПравеОбщейСобственностиЧислитель,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляВПравеОбщейСобственностиЗнаменатель,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляПлощадиЧислитель,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляПлощадиЗнаменатель
		|ПОМЕСТИТЬ ОбъектыОблагаемыеПоКадастровойСтоимости
		|ИЗ
		|	РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.СрезПоследних(КОНЕЦПЕРИОДА(&ПериодРасчета, МЕСЯЦ), Организация = &Организация) КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаИмущество.СрезПоследних(КОНЕЦПЕРИОДА(&ПериодРасчета, ГОД), Организация = &Организация) КАК СтавкиНалогаНаИмуществоСрезПоследних
		|		ПО (ИСТИНА)
		|ГДЕ
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.НалоговаяБазаПоНалогуНаИмущество.КадастроваяСтоимость)
		|	И СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения <> ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.НеПодлежитНалогообложению)
		|	И НЕ СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДатаРегистрацииПраваСобственности > КОНЕЦПЕРИОДА(&ПериодРасчета, МЕСЯЦ)
		|	И ВЫБОР
		|			КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДатаПрекращенияПраваСобственности = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ НЕ СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДатаПрекращенияПраваСобственности < НАЧАЛОПЕРИОДА(&ПериодРасчета, ГОД)
		|		КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИФНС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ИФНС,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.КодПоОКТМО,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ОсновноеСредство,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.КадастровыйНомер,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.КадастровыйНомерПомещения,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.КадастроваяСтоимость,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.НеоблагаемаяКадастроваяСтоимость,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ОсвобождениеОтНалогообложения,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.КодНалоговойЛьготыОсвобождениеОтНалогообложения,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ПонижениеНалоговойСтавки,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ДоляСтоимостиЧислитель,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ДоляСтоимостиЗнаменатель,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.НалоговаяСтавка,
		|	ВЫБОР
		|		КОГДА ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов.НалоговыйОрган ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК УплачиваютсяАвансы,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ДатаРегистрацииПраваСобственности,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ДатаПрекращенияПраваСобственности,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ИспользуетсяТолькоВДеятельностиОблагаемойЕНВД,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.КодВидаИмущества,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ДоляВПравеОбщейСобственностиЧислитель,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ДоляВПравеОбщейСобственностиЗнаменатель,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ДоляПлощадиЧислитель,
		|	ОбъектыОблагаемыеПоКадастровойСтоимости.ДоляПлощадиЗнаменатель
		|ИЗ
		|	ОбъектыОблагаемыеПоКадастровойСтоимости КАК ОбъектыОблагаемыеПоКадастровойСтоимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов КАК ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов
		|		ПО ОбъектыОблагаемыеПоКадастровойСтоимости.ИФНС = ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов.НалоговыйОрган";
		
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
		
			РасчетНалогаНаИмуществоПоКадастровойСтоимости = Результат.Выгрузить();
		
			Для Каждого СтрокаТаблицы Из РасчетНалогаНаИмуществоПоКадастровойСтоимости Цикл
				
				Если НЕ ГодовойРасчет И НЕ СтрокаТаблицы.УплачиваютсяАвансы Тогда
					Продолжить;
				КонецЕсли;
				
				УчитыватьАвансы = ГодовойРасчет И СтрокаТаблицы.УплачиваютсяАвансы;
				
				Если ПериодРасчета < '20140701' И СтрокаТаблицы.ИспользуетсяТолькоВДеятельностиОблагаемойЕНВД Тогда
					Продолжить;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаРегистрацииПраваСобственности) Тогда
					Продолжить;
				КонецЕсли;
				
				ГодРасчета = Год(ПериодРасчета);
				
				Если ГодРасчета < 2016 ИЛИ ГодовойРасчет Тогда
					НачалоПериода = 1;
				Иначе
					НачалоПериода = Месяц(НачалоКвартала(ПериодРасчета));
				КонецЕсли;
				
				КоличествоМесяцевВладения = 0;
				КоличествоМесяцевВладенияЗаКвартал = 0;
				МесяцыВладения = Новый Соответствие;
				Для Сч = НачалоПериода По Месяц(ПериодРасчета) Цикл
					
					Если ГодРасчета < 2016 Тогда
						ПредельнаяДатаВозникновенияПрава = КонецМесяца(Дата(ГодРасчета, Сч, 1));
						ПредельнаяДатаПрекращенияПрава = Дата(ГодРасчета, Сч, 1);
					Иначе
						ПредельнаяДатаВозникновенияПрава = Дата(ГодРасчета, Сч, 15, 23, 59, 59);
						ПредельнаяДатаПрекращенияПрава = Дата(ГодРасчета, Сч, 16);
					КонецЕсли;
					
					Если СтрокаТаблицы.ДатаРегистрацииПраваСобственности <= ПредельнаяДатаВозникновенияПрава
						И (НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаПрекращенияПраваСобственности)
							ИЛИ СтрокаТаблицы.ДатаПрекращенияПраваСобственности >= ПредельнаяДатаПрекращенияПрава) Тогда
							
						КоличествоМесяцевВладения = КоличествоМесяцевВладения + 1;
						КоличествоМесяцевВладенияЗаКвартал = КоличествоМесяцевВладенияЗаКвартал + 1;
					КонецЕсли;
					
					Если ГодовойРасчет И Сч%3 = 0 Тогда
						МесяцыВладения.Вставить(Сч, КоличествоМесяцевВладенияЗаКвартал);
						
						Если ГодРасчета >= 2016 Тогда
							КоличествоМесяцевВладенияЗаКвартал = 0;
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
				
				Если КоличествоМесяцевВладения = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = ТаблицаРасчетНалога.Добавить(); 
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				
				НоваяСтрока.ВидНалоговойБазы = Перечисления.НалоговаяБазаПоНалогуНаИмущество.КадастроваяСтоимость;
				
				Если СтрокаТаблицы.ОсвобождениеОтНалогообложения Тогда
					НоваяСтрока.НеоблагаемаяКадастроваяСтоимость = НоваяСтрока.КадастроваяСтоимость;
				КонецЕсли;
				
				Если ГодовойРасчет
				   И ГодРасчета = 2014
				   И ПлательщикЕНВД
				   И СтрокаТаблицы.ИспользуетсяТолькоВДеятельностиОблагаемойЕНВД Тогда
				   
					НоваяСтрока.КадастроваяСтоимость = НоваяСтрока.КадастроваяСтоимость / 2;
					НоваяСтрока.НеоблагаемаяКадастроваяСтоимость = НоваяСтрока.НеоблагаемаяКадастроваяСтоимость / 2;
					
				КонецЕсли;
				
				Если СтрокаТаблицы.ДоляСтоимостиЧислитель > 0 И СтрокаТаблицы.ДоляСтоимостиЗнаменатель > 0 Тогда
					ДоляСтоимости = СтрокаТаблицы.ДоляСтоимостиЧислитель / СтрокаТаблицы.ДоляСтоимостиЗнаменатель;	
				Иначе
					ДоляСтоимости = 1;
				КонецЕсли;
				
				Если СтрокаТаблицы.ДоляВПравеОбщейСобственностиЧислитель > 0 И СтрокаТаблицы.ДоляВПравеОбщейСобственностиЗнаменатель > 0 Тогда
					ДоляВПравеОбщейСобственности = 
						СтрокаТаблицы.ДоляВПравеОбщейСобственностиЧислитель / СтрокаТаблицы.ДоляВПравеОбщейСобственностиЗнаменатель;
				Иначе
					ДоляВПравеОбщейСобственности = 1;
				КонецЕсли;
				
				НоваяСтрока.НалоговаяБаза = Окр(Макс(НоваяСтрока.КадастроваяСтоимость - НоваяСтрока.НеоблагаемаяКадастроваяСтоимость, 0)
					* ДоляСтоимости * ДоляВПравеОбщейСобственности);
				
				НоваяСтрока.КоличествоМесяцевВладения = КоличествоМесяцевВладения;
				КоэффициентК = НоваяСтрока.КоличествоМесяцевВладения / ?(ГодРасчета < 2016 ИЛИ ГодовойРасчет, Месяц(ПериодРасчета), 3);
				
				Если ГодовойРасчет Тогда
					НоваяСтрока.СуммаНалога = Окр(НоваяСтрока.НалоговаяБаза * КоэффициентК * НоваяСтрока.НалоговаяСтавка / 100);
				Иначе
					НоваяСтрока.СуммаНалога = Окр(Макс(НоваяСтрока.КадастроваяСтоимость - НоваяСтрока.НеоблагаемаяКадастроваяСтоимость, 0)
						* ДоляСтоимости * ДоляВПравеОбщейСобственности * КоэффициентК * НоваяСтрока.НалоговаяСтавка / 100 / 4);
				КонецЕсли;
				
				Если УчитыватьАвансы Тогда
					
					КоэффициентК3 = МесяцыВладения[3] / 3;
					СуммаАвансовыхПлатежей3 = Окр(Макс(НоваяСтрока.КадастроваяСтоимость - НоваяСтрока.НеоблагаемаяКадастроваяСтоимость, 0)
						* ДоляСтоимости * ДоляВПравеОбщейСобственности * КоэффициентК3 * НоваяСтрока.НалоговаяСтавка / 100 / 4);
					
					КоэффициентК6 = МесяцыВладения[6] / ?(ГодРасчета < 2016, 6, 3);
					СуммаАвансовыхПлатежей6 = Окр(Макс(НоваяСтрока.КадастроваяСтоимость - НоваяСтрока.НеоблагаемаяКадастроваяСтоимость, 0)
						* ДоляСтоимости * ДоляВПравеОбщейСобственности * КоэффициентК6 * НоваяСтрока.НалоговаяСтавка / 100 / 4);
					
					КоэффициентК9 = МесяцыВладения[9] / ?(ГодРасчета < 2016, 9, 3);
					СуммаАвансовыхПлатежей9 = Окр(Макс(НоваяСтрока.КадастроваяСтоимость - НоваяСтрока.НеоблагаемаяКадастроваяСтоимость, 0)
						* ДоляСтоимости * ДоляВПравеОбщейСобственности * КоэффициентК9 * НоваяСтрока.НалоговаяСтавка / 100 / 4);
					
				КонецЕсли;
				
				Если НоваяСтрока.ИФНС = РеквизитыОрганизации.РегистрацияВНалоговомОргане Тогда
				
					НоваяСтрока.СуммаУменьшенияСуммыНалога = Окр(НоваяСтрока.СуммаНалога * ПроцентУменьшенияСуммыНалога / 100);
					НоваяСтрока.СуммаНалогаКУплате = Макс(НоваяСтрока.СуммаНалога - НоваяСтрока.СуммаУменьшенияСуммыНалога, 0);
					
					Если УчитыватьАвансы Тогда
						СуммаАвансовыхПлатежей3 = Макс(СуммаАвансовыхПлатежей3
							- Окр(СуммаАвансовыхПлатежей3 * ПроцентУменьшенияСуммыНалога / 100), 0);
						СуммаАвансовыхПлатежей6 = Макс(СуммаАвансовыхПлатежей6
							- Окр(СуммаАвансовыхПлатежей6 * ПроцентУменьшенияСуммыНалога / 100), 0);
						СуммаАвансовыхПлатежей9 = Макс(СуммаАвансовыхПлатежей9
							- Окр(СуммаАвансовыхПлатежей9 * ПроцентУменьшенияСуммыНалога / 100), 0);
					КонецЕсли;
					
				Иначе
					
					НоваяСтрока.СуммаНалогаКУплате = НоваяСтрока.СуммаНалога;
					
				КонецЕсли;
				
				Если УчитыватьАвансы Тогда
					
					Если ГодРасчета = 2014
					   И ПлательщикЕНВД
					   И СтрокаТаблицы.ИспользуетсяТолькоВДеятельностиОблагаемойЕНВД Тогда
						НоваяСтрока.СуммаАвансовыхПлатежей = 2 * СуммаАвансовыхПлатежей9;
					Иначе
						НоваяСтрока.СуммаАвансовыхПлатежей = СуммаАвансовыхПлатежей3 + СуммаАвансовыхПлатежей6 + СуммаАвансовыхПлатежей9;
					КонецЕсли;
					НоваяСтрока.СуммаНалогаКУплате = НоваяСтрока.СуммаНалогаКУплате - НоваяСтрока.СуммаАвансовыхПлатежей;
					
				КонецЕсли;
				
				Если НЕ ГодовойРасчет Тогда
					НоваяСтрока.СуммаАвансовыхПлатежей = НоваяСтрока.СуммаНалогаКУплате;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТаблицаРасчетНалога.ЗаполнитьЗначения(мДатаКонцаПериодаОтчета, "ПериодРасчета");
	ТаблицаРасчетНалога.ЗаполнитьЗначения(Организация, "Организация");
	
	Возврат ТаблицаРасчетНалога;
	
КонецФункции

// Возвращает таблицы выполнения регламентных операций расчета имущественных налогов.
//
// Параметры:
// 	ТаблицаРеквизиты 
// 	Отказ - Булево - Флаг отказа проведения.
// 
// Возвращаемое значение:
// 	 СтруктураТаблиц - Структура - Таблицы расчета налога:
// 							Ключи:
// 								ТаблицаСправкиРасчета - ТаблицаЗначений - Справка-расчет налога.
// 								ТаблицаРасходыПоНалогу - ТаблицаЗначений - Отражение расходов по налогу.
//
Функция ПодготовитьТаблицыРасчетНалога(ТаблицаРеквизиты, Отказ) Экспорт
	
	СтруктураТаблиц = Новый Структура();
	СтруктураТаблиц.Вставить("ТаблицаСправкиРасчета");
	СтруктураТаблиц.Вставить("ТаблицаРасходыПоНалогу");
	СтруктураТаблиц.Вставить("ТаблицаРасходыНаПлатон");
	
	Параметры = ПодготовитьПараметрыРасчетНалога(ТаблицаРеквизиты);
	Если Параметры.Реквизиты.Количество() = 0 Тогда
		Возврат СтруктураТаблиц;
	КонецЕсли;
	
	Реквизиты = Параметры.Реквизиты[0];
	ТаблицыРасчетНалога = ТаблицыРасчетНалога(Реквизиты);
	
	Результат = РасходыПоНалогу(Реквизиты, ТаблицыРасчетНалога.СправкаРасчет, ТаблицыРасчетНалога.РасходыНаПлатон, Отказ);
	
	СтруктураТаблиц.Вставить("ТаблицаСправкиРасчета",      ТаблицыРасчетНалога.СправкаРасчет);
	СтруктураТаблиц.Вставить("ТаблицаРасходыПоНалогу",     Результат.ПрочиеРасходы);
	СтруктураТаблиц.Вставить("ТаблицаПрочиеАктивыПассивы", Результат.ПрочиеАктивыПассивы);
	СтруктураТаблиц.Вставить("ТаблицаРасходыНаПлатон",     ТаблицыРасчетНалога.РасходыНаПлатон);
	
	Возврат СтруктураТаблиц;

КонецФункции

// Формирует движения регистров по данным расчета налога.
//
Процедура СформироватьДвиженияРасчетНалога(ТаблицыНачислениеНалога, ТаблицаРеквизитов, Движения, Отказ) Экспорт

	Параметры = ПодготовитьПараметрыДвиженийРасчетНалога(ТаблицаРеквизитов);
	Если Параметры.Реквизиты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = Параметры.Реквизиты[0];
	
	РасчетИмущественныхНалогов.ДополнитьПараметрыДвиженийСправкаРасчет(Параметры, Реквизиты, ТаблицыНачислениеНалога.ТаблицаСправкиРасчета);
	
	// Данные для справки-расчета
	ЗакрытиеМесяца.ЗаписьВоВспомогательныеРегистрыСведений(
		Движения, 
		Параметры.СправкаРасчет, 
		Параметры.Реквизиты, 
		Реквизиты.ИмяРегистраРасчетНалогов);
		
	Если ТаблицыНачислениеНалога.ТаблицаРасходыПоНалогу.Количество() <> 0 Тогда
		Движения.ПрочиеРасходы.Записывать = Истина;
		Движения.ПрочиеРасходы.Загрузить(ТаблицыНачислениеНалога.ТаблицаРасходыПоНалогу);
	КонецЕсли;
	
	Если ТаблицыНачислениеНалога.ТаблицаПрочиеАктивыПассивы.Количество() <> 0 Тогда
		Движения.ПрочиеАктивыПассивы.Записывать = Истина;
		Движения.ПрочиеАктивыПассивы.Загрузить(ТаблицыНачислениеНалога.ТаблицаПрочиеАктивыПассивы);
	КонецЕсли;

КонецПроцедуры

// Определяет расходы на Платон.
//
// Параметры:
//  Организация						 - СправочникСсылка.Организации -  Организация, для которой выполняется расчет транспортного налога.
//  ПериодРасчета					 - Дата - Дата закрытия месяца.
//  ТаблицаРасчетТранспортногоНалога - ТаблицаЗначений - Содержит расчет транспортного налога.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Содержит расходы на Платон.
//
Функция ПолучитьРасходыНаПлатон(Организация, ПериодРасчета, ТаблицаРасчетТранспортногоНалога) Экспорт

	ГодовойРасчет = КонецКвартала(ПериодРасчета) = КонецГода(ПериодРасчета);
	ДатаКонцаПериодаОтчета = КонецКвартала(ПериодРасчета);
	
	ТаблицаРасходыНаПлатон = ПустаяТаблицаРасходыНаПлатон();
	Возврат ТаблицаРасходыНаПлатон;
	
	СтруктураПоиска = Новый Структура("УплачиваютсяАвансы", Ложь);
	СписокОСБезАвансов = ТаблицаРасчетТранспортногоНалога.Скопировать(СтруктураПоиска).ВыгрузитьКолонку("ОсновноеСредство");
	УплачиваютсяАвансы = СписокОСБезАвансов.Количество() = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",    Организация);
	Запрос.УстановитьПараметр("СледующийМесяц", ДатаКонцаПериодаОтчета + 1);
	Запрос.УстановитьПараметр("ПериодРасчета",  ПериодРасчета);
	Запрос.УстановитьПараметр("НачалоКвартала", НачалоКвартала(ПериодРасчета));
	Запрос.УстановитьПараметр("КонецКвартала",  КонецКвартала(ПериодРасчета));
	Запрос.УстановитьПараметр("НачалоПериода",  ?(НЕ УплачиваютсяАвансы И ГодовойРасчет, НачалоГода(ПериодРасчета), НачалоКвартала(ПериодРасчета)));
	Запрос.УстановитьПараметр("КонецПериода",   ?(НЕ УплачиваютсяАвансы И ГодовойРасчет, КонецГода(ПериодРасчета), КонецКвартала(ПериодРасчета)));
	Запрос.УстановитьПараметр("СписокОСБезАвансов", СписокОСБезАвансов);
	Запрос.УстановитьПараметр("ГодовойРасчет",  ГодовойРасчет);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(РасчетыСПоставщиками.Период, КВАРТАЛ) КАК Период,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщиками.РасчетныйДокумент ССЫЛКА Документ.ОтчетОператораСистемыПлатон
	|			ТОГДА РасчетыСПоставщиками.РасчетныйДокумент
	|		ИНАЧЕ РасчетыСПоставщиками.Регистратор
	|	КОНЕЦ КАК ОтчетОператора,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА РасчетыСПоставщиками.ДолгРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ + ВЫБОР
	|			КОГДА РасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА РасчетыСПоставщиками.ПредоплатаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПлатежа,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСПоставщиками.Период < &НачалоКвартала 
	|					ИЛИ РасчетыСПоставщиками.Период > &КонецКвартала
	|				ТОГДА 0
	|			КОГДА РасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА РасчетыСПоставщиками.ДолгРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ + ВЫБОР
	|			КОГДА РасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА РасчетыСПоставщиками.ПредоплатаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПлатежаЗаКвартал
	|ПОМЕСТИТЬ ФактическиеПлатежи
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПоставщиками
	|ГДЕ
	|	РасчетыСПоставщиками.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасчетыСПоставщиками.АналитикаУчетаПоПартнерам.Организация = &Организация
	|	И РасчетыСПоставщиками.ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика), 
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику))
	|	И РасчетыСПоставщиками.Активность
	|	И (РасчетыСПоставщиками.РасчетныйДокумент ССЫЛКА Документ.ОтчетОператораСистемыПлатон
	|			ИЛИ РасчетыСПоставщиками.Регистратор ССЫЛКА Документ.ОтчетОператораСистемыПлатон)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(РасчетыСПоставщиками.Период, КВАРТАЛ),
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщиками.РасчетныйДокумент ССЫЛКА Документ.ОтчетОператораСистемыПлатон
	|			ТОГДА РасчетыСПоставщиками.РасчетныйДокумент
	|		ИНАЧЕ РасчетыСПоставщиками.Регистратор
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА РасчетыСПоставщиками.ДолгРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ + ВЫБОР
	|			КОГДА РасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА РасчетыСПоставщиками.ПредоплатаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОтчетОператора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетТранспортногоНалога.ПериодРасчета КАК Период,
	|	РасчетТранспортногоНалога.ОсновноеСредство КАК ОсновноеСредство,
	|	СУММА(РасчетТранспортногоНалога.СуммаПлатыОператоруСистемыПлатон) КАК СуммаПлатежа
	|ИЗ
	|	РегистрСведений.РасчетТранспортногоНалога КАК РасчетТранспортногоНалога
	|ГДЕ
	|	РасчетТранспортногоНалога.ПериодРасчета >= &НачалоПериода
	|	И РасчетТранспортногоНалога.ПериодРасчета < &НачалоКвартала
	|	И РасчетТранспортногоНалога.Организация = &Организация
	|	И РасчетТранспортногоНалога.Активность
	|	И &ГодовойРасчет
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетТранспортногоНалога.ПериодРасчета,
	|	РасчетТранспортногоНалога.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФактическиеПлатежи.Период                 КАК Период,
	|	ФактическиеПлатежи.ОтчетОператора         КАК ОтчетОператора,
	|	ФактическиеПлатежи.СуммаПлатежа           КАК СуммаПлатежа,
	|	ФактическиеПлатежи.СуммаПлатежаЗаКвартал  КАК СуммаПлатежаЗаКвартал
	|ИЗ
	|	ФактическиеПлатежи КАК ФактическиеПлатежи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Операция.Ссылка                           КАК ОтчетОператора,
	|	РасходыНаПлатон.ОсновноеСредство          КАК ОсновноеСредство,
	|	РасходыНаПлатон.Подразделение             КАК Подразделение,
	|	РасходыНаПлатон.СтатьяРасходов            КАК СтатьяРасходов,
	|	РасходыНаПлатон.АналитикаРасходов         КАК АналитикаРасходов,
	|	РасходыНаПлатон.НаправлениеДеятельности   КАК НаправлениеДеятельности,
	|	0                                         КАК СуммаРегл,
	|	РасходыНаПлатон.Сумма                     КАК База,
	|	ВЫБОР 
	|		КОГДА РасходыНаПлатон.ОсновноеСредство В (&СписокОСБезАвансов)
	|			ТОГДА ЛОЖЬ 
	|		ИНАЧЕ ИСТИНА 
	|	КОНЕЦ КАК УплачиваютсяАвансы
	|ИЗ
	|	Документ.ОтчетОператораСистемыПлатон КАК Операция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОператораСистемыПлатон.ОС КАК РасходыНаПлатон
	|		ПО РасходыНаПлатон.Ссылка = Операция.Ссылка
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Ссылка В
	|			(ВЫБРАТЬ
	|				ФактическиеПлатежи.ОтчетОператора
	|			ИЗ
	|				ФактическиеПлатежи КАК ФактическиеПлатежи)";
	
	Результат = Запрос.ВыполнитьПакет();
	
	Если Не Результат[Результат.ВГраница()].Пустой() Тогда
		
		ТаблицаРасчетТранспортногоНалога.Индексы.Добавить("ЗарегистрированоВРеестреСистемыПлатон,ОсновноеСредство");
		
		ТаблицаРасходыНаПлатон.Колонки.Добавить("УплачиваютсяАвансы", Новый ОписаниеТипов("Булево"));
		
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Результат[Результат.ВГраница()].Выгрузить(), ТаблицаРасходыНаПлатон);
		ТаблицаРасходыНаПлатон.Индексы.Добавить("ОтчетОператора");
		ТаблицаРасходыНаПлатон.Индексы.Добавить("ОсновноеСредство");
		
		УчтенныеПлатежи = Результат[Результат.ВГраница() - 2].Выгрузить();
		УчтенныеПлатежи.Индексы.Добавить("ОсновноеСредство");
		
		// 1. Распределение платежа по ОС.
		ВыборкаПлатежи = Результат[Результат.ВГраница()-1].Выбрать();
		Пока ВыборкаПлатежи.Следующий() Цикл
			
			СтруктураПоиска = Новый Структура("ОтчетОператора");
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаПлатежи);
			СписокСтрок = ТаблицаРасходыНаПлатон.НайтиСтроки(СтруктураПоиска);
			КоэффициентыОплаты = Новый Массив;
			Для каждого Расход Из СписокСтрок Цикл
				КоэффициентыОплаты.Добавить(Расход.База);
			КонецЦикла;
			
			РаспределениеПлатежа = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
										ВыборкаПлатежи.СуммаПлатежа, КоэффициентыОплаты);
										
			РаспределениеПлатежаЗаКвартал = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
										ВыборкаПлатежи.СуммаПлатежаЗаКвартал, КоэффициентыОплаты);
										
			СтрокиКУдалению = Новый Массив;
			Для Сч = 0 По КоэффициентыОплаты.ВГраница() Цикл
				Расход = СписокСтрок[Сч];
				
				Если Расход.УплачиваютсяАвансы Тогда
					Расход.СуммаРегл = РаспределениеПлатежаЗаКвартал[Сч];
				Иначе
					Расход.СуммаРегл = РаспределениеПлатежа[Сч];
				КонецЕсли; 
				
				// Нужно уменьшить сумму оплат на суммы, которые были учтены при авансовых платежах по налогу.
				Если ГодовойРасчет Тогда
					СтруктураПоиска = Новый Структура("ОсновноеСредство", Расход.ОсновноеСредство);
					СписокСтрокУчтенныхПлатежей = УчтенныеПлатежи.НайтиСтроки(СтруктураПоиска);
					Для каждого СтрокаУчтенныеПлатежи Из СписокСтрокУчтенныхПлатежей Цикл
						Если НачалоКвартала(СтрокаУчтенныеПлатежи.Период) = ВыборкаПлатежи.Период
							И СтрокаУчтенныеПлатежи.СуммаПлатежа > 0 Тогда
							СуммаПлатежа = Мин(Расход.СуммаРегл, СтрокаУчтенныеПлатежи.СуммаПлатежа);
							Расход.СуммаРегл = Расход.СуммаРегл - СуммаПлатежа;
							СтрокаУчтенныеПлатежи.СуммаПлатежа = СтрокаУчтенныеПлатежи.СуммаПлатежа - СуммаПлатежа;
						КонецЕсли; 
					КонецЦикла; 
				КонецЕсли; 
				
				Если Расход.СуммаРегл = 0 Тогда
					СтрокиКУдалению.Добавить(Расход);
				КонецЕсли;
			КонецЦикла;
			
			Для каждого Расход Из СтрокиКУдалению Цикл
				ТаблицаРасходыНаПлатон.Удалить(Расход);
			КонецЦикла; 
			
		КонецЦикла;
		
		// 2. Уменьшение суммы налога.
		СтруктураПоиска = Новый Структура("ЗарегистрированоВРеестреСистемыПлатон", Истина);
		СтрокиРасчетаНалога = ТаблицаРасчетТранспортногоНалога.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого СтрокаРасчетаНалога Из СтрокиРасчетаНалога Цикл
			
			СуммаНалогаКУплате = СтрокаРасчетаНалога.СуммаНалогаКУплате - СтрокаРасчетаНалога.СуммаНалоговогоВычета;
			
			Если СуммаНалогаКУплате = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураПоиска = Новый Структура("ОсновноеСредство");
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаРасчетаНалога);
			СписокСтрок = ТаблицаРасходыНаПлатон.НайтиСтроки(СтруктураПоиска);
			КоэффициентыОплаты = Новый Массив;
			Для каждого Расход Из СписокСтрок Цикл
				КоэффициентыОплаты.Добавить(Расход.СуммаРегл);
				СтрокаРасчетаНалога.СуммаПлатыОператоруСистемыПлатон = 
					СтрокаРасчетаНалога.СуммаПлатыОператоруСистемыПлатон + Расход.СуммаРегл;
			КонецЦикла;
			
			РаспределениеНалога = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
										СуммаНалогаКУплате, КоэффициентыОплаты);
										
			Для Сч = 0 По КоэффициентыОплаты.ВГраница() Цикл
				
				Расход = СписокСтрок[Сч];
				Расход.СуммаНалога = РаспределениеНалога[Сч];
				
				Если Расход.СуммаНалога > Расход.СуммаРегл Тогда
					СтрокаРасчетаНалога.СуммаНалоговогоВычета = СтрокаРасчетаНалога.СуммаНалоговогоВычета + Расход.СуммаРегл;
				Иначе
					СтрокаРасчетаНалога.СуммаНалоговогоВычета = СтрокаРасчетаНалога.СуммаНалоговогоВычета + Расход.СуммаНалога;
				КонецЕсли; 
				
			КонецЦикла;
			
			Если ГодовойРасчет Тогда
				СтрокаРасчетаНалога.СуммаНалогаКУплате = СтрокаРасчетаНалога.СуммаНалогаКУплате - СтрокаРасчетаНалога.СуммаНалоговогоВычета;
			Иначе
				СтрокаРасчетаНалога["СуммаАвансовыхПлатежей" + Формат(ПериодРасчета, "ДФ='q''Кв'''")] = 0;
				СтрокаРасчетаНалога.СуммаНалогаКУплате = 0;
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе	
		
		Для Каждого СтрокаРасчетаНалога Из ТаблицаРасчетТранспортногоНалога Цикл
			
			Если НЕ СтрокаРасчетаНалога.ЗарегистрированоВРеестреСистемыПлатон Тогда
				Продолжить;
			КонецЕсли; 
			
			Если ГодовойРасчет Тогда
				СтрокаРасчетаНалога.СуммаНалогаКУплате = СтрокаРасчетаНалога.СуммаНалогаКУплате - СтрокаРасчетаНалога.СуммаНалоговогоВычета;
			Иначе
				СтрокаРасчетаНалога["СуммаАвансовыхПлатежей" + Формат(ПериодРасчета, "ДФ='q''Кв'''")] = 0;
				СтрокаРасчетаНалога.СуммаНалогаКУплате = 0;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

	Возврат ТаблицаРасходыНаПлатон;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПодготовитьПараметрыРасчетНалога(ТаблицаРеквизиты)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы Параметры.Реквизиты
	
	СписокОбязательныхКолонок = ""
	+ "Период,"						// <Дата>
	+ "Организация,"				// <СправочникСсылка.Организации>
	+ "Регистратор,"				// <ДокументСсылка.*>
	+ "ВидНалога,"					// <Перечисление.ВидыИмущественныхНалогов>
	+ "Содержание,"					// <Строка, 150>
	+ "ИмяРегистраРасчетНалогов"	// <Строка, 0>
	;
	
	Параметры.Вставить("Реквизиты", 
		УправлениеВнеоборотнымиАктивамиПереопределяемый.ПараметрыПроведения(ТаблицаРеквизиты, СписокОбязательныхКолонок));
	
	Возврат Параметры;
	
КонецФункции

Функция ПодготовитьПараметрыДвиженийРасчетНалога(ТаблицаРеквизитов)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы Параметры.Реквизиты
	
	СписокОбязательныхКолонок = ""
	+ "Период,"						// <Дата>
	+ "Организация,"				// <СправочникСсылка.Организации>
	+ "Регистратор,"				// <ДокументСсылка.*>
	+ "ВидНалога,"					// <ПеречислениеСсылка.ВидыИмущественныхНалогов>
	+ "ИмяРегистраРасчетНалогов"	// <Строка, 0>
	;
	
	Параметры.Вставить("Реквизиты", 
		УправлениеВнеоборотнымиАктивамиПереопределяемый.ПараметрыПроведения(ТаблицаРеквизитов, СписокОбязательныхКолонок));
	
	Возврат Параметры;
	
КонецФункции

Функция РасходыПоНалогу(Реквизиты, СправкаРасчет, РасходыНаПлатон, Отказ)
	
	ТекстЗапроса =
	//0. СправкаРасчет
	"ВЫБРАТЬ
	|	СправкаРасчет.ОсновноеСредство КАК ОсновноеСредство,
	|	СправкаРасчет.ИФНС КАК РегистрацияВНалоговомОргане,
	|	СправкаРасчет.СуммаНалогаКУплате КАК СуммаРегл,
	|	СправкаРасчет.СуммаНалогаКУплате * &КоэффициентПересчетаВУпр КАК СуммаБезНДС,
	|	СправкаРасчет.СуммаНалогаКУплате * &КоэффициентПересчетаВУпр КАК Сумма,
	|	ВЫБОР КОГДА &УправленческийУчетОрганизаций
	|		ТОГДА СправкаРасчет.СуммаНалогаКУплате * &КоэффициентПересчетаВУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаУпр
	|ПОМЕСТИТЬ СправкаРасчет
	|ИЗ
	|	&СправкаРасчет КАК СправкаРасчет
	|ГДЕ
	|	СправкаРасчет.СуммаНалогаКУплате <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	//1. РасходыНаПлатон
	|ВЫБРАТЬ
	|	РасходыНаПлатон.ОсновноеСредство КАК ОсновноеСредство,
	|	РасходыНаПлатон.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	РасходыНаПлатон.Подразделение КАК Подразделение,
	|	РасходыНаПлатон.СтатьяРасходов КАК СтатьяРасходов,
	|	РасходыНаПлатон.АналитикаРасходов КАК АналитикаРасходов,
	|
	|	ВЫБОР 
	|		КОГДА РасходыНаПлатон.СуммаРегл > РасходыНаПлатон.СуммаНалога
	|			ТОГДА РасходыНаПлатон.СуммаРегл - РасходыНаПлатон.СуммаНалога 
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК СуммаНУ,
	|
	|	ВЫБОР 
	|		КОГДА РасходыНаПлатон.СуммаРегл > РасходыНаПлатон.СуммаНалога
	|			ТОГДА РасходыНаПлатон.СуммаНалога 
	|		ИНАЧЕ РасходыНаПлатон.СуммаРегл 
	|	КОНЕЦ КАК ПостояннаяРазница,
	|
	|	-РасходыНаПлатон.СуммаРегл КАК ВременнаяРазница
	|
	|ПОМЕСТИТЬ РасходыНаПлатон
	|ИЗ
	|	&РасходыНаПлатон КАК РасходыНаПлатон
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	//2. СпособыОтраженияРасходов
	|ВЫБРАТЬ
	|	СпособыОтраженияРасходов.ОсновноеСредство КАК ОсновноеСредство,
	|	СпособыОтраженияРасходов.СтатьяРасходов КАК СтатьяРасходов,
	|	СпособыОтраженияРасходов.СпособОтраженияРасходовЗаданДокументом КАК СпособОтраженияРасходовЗаданДокументом,
	|	СпособыОтраженияРасходов.СпособОтраженияРасходов КАК СпособОтраженияРасходов,
	|	СпособыОтраженияРасходов.АналитикаРасходов КАК АналитикаРасходов
	|ПОМЕСТИТЬ СпособыОтраженияРасходов
	|ИЗ
	|	РегистрСведений.СпособыОтраженияРасходовПоИмущественнымНалогам.СрезПоследних(
	|		&Период, 
	|		ОсновноеСредство В (
	|			ВЫБРАТЬ 
	|				СправкаРасчет.ОсновноеСредство 
	|			ИЗ 
	|				СправкаРасчет КАК СправкаРасчет)
	|		И Организация = &Организация) КАК СпособыОтраженияРасходов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	СпособОтраженияРасходов
	|;
	|
	//3. МестонахождениеОС
	|ВЫБРАТЬ
	|	МестонахождениеОС.ОсновноеСредство КАК ОсновноеСредство,
	|	МестонахождениеОС.Местонахождение КАК Подразделение
	|ПОМЕСТИТЬ МестонахождениеОС
	|ИЗ
	|	РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(
	|		&Период, 
	|		ОсновноеСредство В (
	|			ВЫБРАТЬ 
	|				СправкаРасчет.ОсновноеСредство 
	|			ИЗ 
	|				СправкаРасчет КАК СправкаРасчет)
	|		И Организация = &Организация) КАК МестонахождениеОС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	//4. РасходыБезРаспределения
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	ОсновныеСредства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СправкаРасчет.ОсновноеСредство КАК ОсновноеСредство,
	|	СправкаРасчет.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СправкаРасчет.СуммаРегл КАК СуммаРегл,
	|	СправкаРасчет.Сумма КАК Сумма,
	|	СправкаРасчет.СуммаБезНДС КАК СуммаБезНДС,
	|	СправкаРасчет.СуммаУпр КАК СуммаУпр,
	|	ВЫБОР КОГДА НЕ ЕСТЬNULL(СпособыОтраженияРасходов.СтатьяРасходов.ПринятиеКНалоговомуУчету, ИСТИНА) ТОГДА
	|		СправкаРасчет.СуммаРегл
	|	ИНАЧЕ
	|		0
	|	КОНЕЦ КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	МестонахождениеОС.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(СпособыОтраженияРасходов.СтатьяРасходов, НЕОПРЕДЕЛЕНО) КАК СтатьяРасходов,
	|	ЕСТЬNULL(СпособыОтраженияРасходов.АналитикаРасходов, НЕОПРЕДЕЛЕНО) КАК АналитикаРасходов,
	|	&ХозяйственнаяОперация
	|ИЗ
	|	СправкаРасчет КАК СправкаРасчет
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		СпособыОтраженияРасходов КАК СпособыОтраженияРасходов
	|	ПО
	|		СправкаРасчет.ОсновноеСредство = СпособыОтраженияРасходов.ОсновноеСредство
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		МестонахождениеОС КАК МестонахождениеОС
	|	ПО
	|		СправкаРасчет.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.ОбъектыЭксплуатации КАК ОсновныеСредства
	|	ПО
	|		СправкаРасчет.ОсновноеСредство = ОсновныеСредства.Ссылка
	|	
	|ГДЕ
	|	НЕ ЕСТЬNULL(СпособыОтраженияРасходов.СпособОтраженияРасходовЗаданДокументом, ЛОЖЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	РасходыНаПлатон.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	РасходыНаПлатон.ОсновноеСредство КАК ОсновноеСредство,
	|	НЕОПРЕДЕЛЕНО КАК РегистрацияВНалоговомОргане,
	|	0 КАК СуммаРегл,
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	0 КАК СуммаУпр,
	|	ВЫБОР КОГДА НЕ ВЫРАЗИТЬ(РасходыНаПлатон.СтатьяРасходов КАК ПланВидовХарактеристик.СтатьиРасходов).ПринятиеКНалоговомуУчету ТОГДА
	|		РасходыНаПлатон.ПостояннаяРазница + РасходыНаПлатон.СуммаНУ
	|	ИНАЧЕ
	|		РасходыНаПлатон.ПостояннаяРазница
	|	КОНЕЦ КАК ПостояннаяРазница,
	|	РасходыНаПлатон.ВременнаяРазница КАК ВременнаяРазница,
	|	РасходыНаПлатон.Подразделение КАК Подразделение,
	|	РасходыНаПлатон.СтатьяРасходов КАК СтатьяРасходов,
	|	РасходыНаПлатон.АналитикаРасходов КАК АналитикаРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРБП)
	|ИЗ
	|	РасходыНаПлатон КАК РасходыНаПлатон
	|;
	|
	//5. РасходыСРаспределением
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	ОсновныеСредства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СправкаРасчет.ОсновноеСредство КАК ОсновноеСредство,
	|	СправкаРасчет.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СправкаРасчет.Сумма КАК Сумма,
	|	СправкаРасчет.СуммаРегл КАК СуммаРегл,
	|	СправкаРасчет.СуммаБезНДС КАК СуммаБезНДС,
	|	СправкаРасчет.СуммаУпр КАК СуммаУпр,
	|	ИзменениеПараметровОС.ОтражениеАмортизационныхРасходов.(
	|		Подразделение КАК Подразделение,
	|		СтатьяРасходовНалог КАК СтатьяРасходов,
	|		ЕСТЬNULL(СтатьяРасходовНалог.ПринятиеКНалоговомуУчету, ИСТИНА) КАК ПринятиеКНалоговомуУчету,
	|		АналитикаРасходовНалог КАК АналитикаРасходов,
	|		Коэффициент КАК Коэффициент
	|	) КАК ТаблицаРаспределения,
	|	&ХозяйственнаяОперация
	|ИЗ
	|	СправкаРасчет КАК СправкаРасчет
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		СпособыОтраженияРасходов КАК СпособыОтраженияРасходов
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			Документ.ИзменениеПараметровОС КАК ИзменениеПараметровОС
	|		ПО
	|			СпособыОтраженияРасходов.СпособОтраженияРасходов = ИзменениеПараметровОС.Ссылка
	|	ПО
	|		СправкаРасчет.ОсновноеСредство = СпособыОтраженияРасходов.ОсновноеСредство
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.ОбъектыЭксплуатации КАК ОсновныеСредства
	|	ПО
	|		СправкаРасчет.ОсновноеСредство = ОсновныеСредства.Ссылка
	|	
	|ГДЕ
	|	ЕСТЬNULL(СпособыОтраженияРасходов.СпособОтраженияРасходовЗаданДокументом, ЛОЖЬ)
	|	И НЕ ИзменениеПараметровОС.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	ОсновныеСредства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СправкаРасчет.ОсновноеСредство КАК ОсновноеСредство,
	|	СправкаРасчет.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СправкаРасчет.Сумма КАК Сумма,
	|	СправкаРасчет.СуммаРегл КАК СуммаРегл,
	|	СправкаРасчет.СуммаБезНДС КАК СуммаБезНДС,
	|	СправкаРасчет.СуммаУпр КАК СуммаУпр,
	|	ДокументСпособ.ОтражениеРасходов.(
	|		Подразделение КАК Подразделение,
	|		СтатьяРасходов КАК СтатьяРасходов,
	|		ЕСТЬNULL(СтатьяРасходов.ПринятиеКНалоговомуУчету, ИСТИНА) КАК ПринятиеКНалоговомуУчету,
	|		АналитикаРасходов КАК АналитикаРасходов,
	|		Коэффициент КАК Коэффициент
	|	) КАК ТаблицаРаспределения,
	|	&ХозяйственнаяОперация
	|ИЗ
	|	СправкаРасчет КАК СправкаРасчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияРасходов КАК СпособыОтраженияРасходов
	|		ПО СправкаРасчет.ОсновноеСредство = СпособыОтраженияРасходов.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияЗемельныхУчастков КАК ДокументСпособ
	|		ПО СпособыОтраженияРасходов.СпособОтраженияРасходов = ДокументСпособ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыЭксплуатации КАК ОсновныеСредства
	|		ПО СправкаРасчет.ОсновноеСредство = ОсновныеСредства.Ссылка
	|	
	|	
	|ГДЕ
	|	ЕСТЬNULL(СпособыОтраженияРасходов.СпособОтраженияРасходовЗаданДокументом, ЛОЖЬ)
	|	И НЕ ДокументСпособ.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	ОсновныеСредства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СправкаРасчет.ОсновноеСредство КАК ОсновноеСредство,
	|	СправкаРасчет.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СправкаРасчет.Сумма КАК Сумма,
	|	СправкаРасчет.СуммаРегл КАК СуммаРегл,
	|	СправкаРасчет.СуммаБезНДС КАК СуммаБезНДС,
	|	СправкаРасчет.СуммаУпр КАК СуммаУпр,
	|	ДокументСпособ.ОтражениеРасходов.(
	|		Подразделение КАК Подразделение,
	|		СтатьяРасходов КАК СтатьяРасходов,
	|		ЕСТЬNULL(СтатьяРасходов.ПринятиеКНалоговомуУчету, ИСТИНА) КАК ПринятиеКНалоговомуУчету,
	|		АналитикаРасходов КАК АналитикаРасходов,
	|		Коэффициент КАК Коэффициент
	|	) КАК ТаблицаРаспределения,
	|	&ХозяйственнаяОперация
	|ИЗ
	|	СправкаРасчет КАК СправкаРасчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияРасходов КАК СпособыОтраженияРасходов
	|		ПО СправкаРасчет.ОсновноеСредство = СпособыОтраженияРасходов.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияТранспортныхСредств КАК ДокументСпособ
	|		ПО СпособыОтраженияРасходов.СпособОтраженияРасходов = ДокументСпособ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыЭксплуатации КАК ОсновныеСредства
	|		ПО СправкаРасчет.ОсновноеСредство = ОсновныеСредства.Ссылка
	|	
	|ГДЕ
	|	ЕСТЬNULL(СпособыОтраженияРасходов.СпособОтраженияРасходовЗаданДокументом, ЛОЖЬ)
	|	И НЕ ДокументСпособ.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	ОсновныеСредства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СправкаРасчет.ОсновноеСредство КАК ОсновноеСредство,
	|	СправкаРасчет.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СправкаРасчет.Сумма КАК Сумма,
	|	СправкаРасчет.СуммаРегл КАК СуммаРегл,
	|	СправкаРасчет.СуммаБезНДС КАК СуммаБезНДС,
	|	СправкаРасчет.СуммаУпр КАК СуммаУпр,
	|	ДокументСпособ.ОтражениеРасходов.(
	|		Подразделение КАК Подразделение,
	|		СтатьяРасходов КАК СтатьяРасходов,
	|		ЕСТЬNULL(СтатьяРасходов.ПринятиеКНалоговомуУчету, ИСТИНА) КАК ПринятиеКНалоговомуУчету,
	|		АналитикаРасходов КАК АналитикаРасходов,
	|		Коэффициент КАК Коэффициент
	|	) КАК ТаблицаРаспределения,
	|	&ХозяйственнаяОперация
	|ИЗ
	|	СправкаРасчет КАК СправкаРасчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияРасходов КАК СпособыОтраженияРасходов
	|		ПО СправкаРасчет.ОсновноеСредство = СпособыОтраженияРасходов.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество КАК ДокументСпособ
	|		ПО СпособыОтраженияРасходов.СпособОтраженияРасходов = ДокументСпособ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыЭксплуатации КАК ОсновныеСредства
	|		ПО СправкаРасчет.ОсновноеСредство = ОсновныеСредства.Ссылка
	|	
	|ГДЕ
	|	ЕСТЬNULL(СпособыОтраженияРасходов.СпособОтраженияРасходовЗаданДокументом, ЛОЖЬ)
	|	И НЕ ДокументСпособ.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	ОсновныеСредства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СправкаРасчет.ОсновноеСредство КАК ОсновноеСредство,
	|	СправкаРасчет.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СправкаРасчет.Сумма КАК Сумма,
	|	СправкаРасчет.СуммаРегл КАК СуммаРегл,
	|	СправкаРасчет.СуммаБезНДС КАК СуммаБезНДС,
	|	СправкаРасчет.СуммаУпр КАК СуммаУпр,
	|	ДокументСпособ.ОтражениеРасходов.(
	|		Подразделение КАК Подразделение,
	|		СтатьяРасходов КАК СтатьяРасходов,
	|		ЕСТЬNULL(СтатьяРасходов.ПринятиеКНалоговомуУчету, ИСТИНА) КАК ПринятиеКНалоговомуУчету,
	|		АналитикаРасходов КАК АналитикаРасходов,
	|		Коэффициент КАК Коэффициент
	|	) КАК ТаблицаРаспределения,
	|	&ХозяйственнаяОперация
	|ИЗ
	|	СправкаРасчет КАК СправкаРасчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияРасходов КАК СпособыОтраженияРасходов
	|		ПО СправкаРасчет.ОсновноеСредство = СпособыОтраженияРасходов.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеСпособаОтраженияИмущественныхНалогов КАК ДокументСпособ
	|		ПО СпособыОтраженияРасходов.СпособОтраженияРасходов = ДокументСпособ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыЭксплуатации КАК ОсновныеСредства
	|		ПО СправкаРасчет.ОсновноеСредство = ОсновныеСредства.Ссылка
	|	
	|ГДЕ
	|	ЕСТЬNULL(СпособыОтраженияРасходов.СпособОтраженияРасходовЗаданДокументом, ЛОЖЬ)
	|	И НЕ ДокументСпособ.Ссылка ЕСТЬ NULL";
	
	ВалютаУпр = Константы.ВалютаУправленческогоУчета.Получить();
	ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();

	КоэффициентПересчетаВУпр = РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(
												ВалютаРегл, ВалютаУпр, Реквизиты.Период);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СправкаРасчет", СправкаРасчет);
	Запрос.УстановитьПараметр("РасходыНаПлатон", РасходыНаПлатон);
	Запрос.УстановитьПараметр("Период",        Реквизиты.Период);
	Запрос.УстановитьПараметр("Организация",   Реквизиты.Организация);
	Запрос.УстановитьПараметр("КоэффициентПересчетаВУпр", КоэффициентПересчетаВУпр);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.НачислениеИмущественныхНалогов);
	
	Запрос.УстановитьПараметр("УправленческийУчетОрганизаций",
		УниверсальныеМеханизмыПартийИСебестоимостиПовтИсп.УправленческийУчетОрганизаций(НачалоМесяца(Реквизиты.Период)));
	
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаРасходыБезРаспределения = Результат[Результат.ВГраница()-1].Выбрать();
	ВыборкаРасходыСРаспределением = Результат[Результат.ВГраница()].Выбрать();
	
	ТаблицаРасходовПоНалогу = ТаблицаРасходовПоНалогу(
		Реквизиты.ВидНалога, 
		ВыборкаРасходыБезРаспределения,
		ВыборкаРасходыСРаспределением,
		Отказ);
	
	Возврат ТаблицаРасходовПоНалогу;
	
КонецФункции

Функция ТаблицаРасходовПоНалогу(ВидНалога, ВыборкаРасходыБезРаспределения, ВыборкаРасходыСРаспределением, Отказ) Экспорт

	ПрочиеРасходы = РегистрыНакопления.ПрочиеРасходы.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	ПрочиеАктивыПассивы = РегистрыНакопления.ПрочиеАктивыПассивы.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	ДвиженияДоходыРасходыПрочиеАктивыПассивы = РегистрыНакопления.ДвиженияДоходыРасходыПрочиеАктивыПассивы.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	
	СтатьяАктивовПассивов = ПланыВидовХарактеристик.СтатьиАктивовПассивов.Налоги;
	АналитикаАктивовПассивов = Неопределено;
	Если ВидНалога = Перечисления.ВидыИмущественныхНалогов.ЗемельныйНалог Тогда
		АналитикаАктивовПассивов = Перечисления.ТипыНалогов.ЗемельныйНалог;
	ИначеЕсли ВидНалога = Перечисления.ВидыИмущественныхНалогов.НалогНаИмущество Тогда
		АналитикаАктивовПассивов = Перечисления.ТипыНалогов.НалогНаИмущество;
	ИначеЕсли ВидНалога = Перечисления.ВидыИмущественныхНалогов.ТранспортныйНалог Тогда
		АналитикаАктивовПассивов = Перечисления.ТипыНалогов.ТранспортныйНалог;
	КонецЕсли;
	
	Пока ВыборкаРасходыБезРаспределения.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(ВыборкаРасходыБезРаспределения.СтатьяРасходов) Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru='Для основного средства ""%1"" не установлен способ отражения расходов по налогам.'"),
								ВыборкаРасходыБезРаспределения.ОсновноеСредство);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ВыборкаРасходыБезРаспределения.ОсновноеСредство, , , Отказ);
		КонецЕсли;
		
		Запись = ПрочиеРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаРасходыБезРаспределения);
		
		Запись = ПрочиеАктивыПассивы.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаРасходыБезРаспределения);
		Запись.Статья = СтатьяАктивовПассивов;
		Запись.Аналитика = АналитикаАктивовПассивов;
		
		Запись = ДвиженияДоходыРасходыПрочиеАктивыПассивы.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаРасходыБезРаспределения, "Период, ХозяйственнаяОперация, Организация, Сумма, СуммаРегл");
		
		Запись.Статья = СтатьяАктивовПассивов;
		Запись.АналитикаАктивовПассивов = АналитикаАктивовПассивов;
		Запись.Подразделение = ВыборкаРасходыБезРаспределения.Подразделение;
		
		Запись.КорСтатья = ВыборкаРасходыБезРаспределения.СтатьяРасходов;
		Запись.КорАналитикаРасходов = ВыборкаРасходыБезРаспределения.АналитикаРасходов;
		Запись.КорПодразделение = ВыборкаРасходыБезРаспределения.Подразделение;
		Запись.КорНаправлениеДеятельности = ВыборкаРасходыБезРаспределения.НаправлениеДеятельности;
		
	КонецЦикла;
	
	Если ВыборкаРасходыСРаспределением <> Неопределено Тогда
		
		Пока ВыборкаРасходыСРаспределением.Следующий() Цикл
			
			ТаблицаРаспределения = ВыборкаРасходыСРаспределением.ТаблицаРаспределения.Выгрузить();
		Если ТаблицаРаспределения.Количество() = 0 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru='Для основного средства ""%1"" не установлен способ отражения расходов по налогам.'"),
								ВыборкаРасходыСРаспределением.ОсновноеСредство);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ВыборкаРасходыСРаспределением.ОсновноеСредство, , , Отказ);
		КонецЕсли;
		
			Коэффициенты = ТаблицаРаспределения.ВыгрузитьКолонку("Коэффициент");
			Суммы = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ВыборкаРасходыСРаспределением.Сумма, Коэффициенты);
			СуммыРегл = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ВыборкаРасходыСРаспределением.СуммаРегл, Коэффициенты);
			СуммыБезНДС = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ВыборкаРасходыСРаспределением.СуммаБезНДС, Коэффициенты);
			СуммыУпр = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ВыборкаРасходыСРаспределением.СуммаУпр, Коэффициенты);
			
			Если Суммы = Неопределено И СуммыРегл = Неопределено И СуммыБезНДС = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Для Индекс = 0 По ТаблицаРаспределения.Количество()-1 Цикл
				ПравилоОтражения = ТаблицаРаспределения[Индекс];
				Запись = ПрочиеРасходы.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, ВыборкаРасходыСРаспределением, "Период, Организация, РегистрацияВНалоговомОргане, НаправлениеДеятельности");
				ЗаполнитьЗначенияСвойств(Запись, ПравилоОтражения, "Подразделение, СтатьяРасходов, АналитикаРасходов");
				Запись.Сумма = ?(Суммы = Неопределено, 0, Суммы[Индекс]);
				Запись.СуммаРегл = ?(СуммыРегл = Неопределено, 0, СуммыРегл[Индекс]);
				Запись.СуммаБезНДС = ?(СуммыБезНДС = Неопределено, 0, СуммыБезНДС[Индекс]);
				Запись.СуммаУпр = ?(СуммыУпр = Неопределено, 0, СуммыУпр[Индекс]);
				Если НЕ ПравилоОтражения.ПринятиеКНалоговомуУчету Тогда
					Запись.ПостояннаяРазница = Запись.СуммаРегл; 
				КонецЕсли;
				
				Запись = ДвиженияДоходыРасходыПрочиеАктивыПассивы.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, ВыборкаРасходыСРаспределением, "Период, ХозяйственнаяОперация, Организация");
				
				Запись.Статья = СтатьяАктивовПассивов;
				Запись.АналитикаАктивовПассивов = АналитикаАктивовПассивов;
			
				Запись.КорСтатья = ПравилоОтражения.СтатьяРасходов;
				Запись.КорАналитикаРасходов = ПравилоОтражения.АналитикаРасходов;
				Запись.КорПодразделение = ПравилоОтражения.Подразделение;
				Запись.КорНаправлениеДеятельности = ВыборкаРасходыСРаспределением.НаправлениеДеятельности;
				Запись.Сумма = ?(Суммы = Неопределено, 0, Суммы[Индекс]);
				Запись.СуммаРегл = ?(СуммыРегл = Неопределено, 0, СуммыРегл[Индекс]);
				
			КонецЦикла;
			
			Запись = ПрочиеАктивыПассивы.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, ВыборкаРасходыСРаспределением);
			Запись.Статья = СтатьяАктивовПассивов;
			Запись.Аналитика = АналитикаАктивовПассивов;
			
		КонецЦикла;
	
	КонецЕсли; 
	
	КолонкиГруппировки = "Период, Организация, Подразделение, НаправлениеДеятельности, СтатьяРасходов, АналитикаРасходов, РегистрацияВНалоговомОргане, ХозяйственнаяОперация";
	КолонкиСуммирования = "Сумма, СуммаБезНДС, СуммаУпр, СуммаРегл, ПостояннаяРазница, ВременнаяРазница";
	ПрочиеРасходы.Свернуть(КолонкиГруппировки, КолонкиСуммирования);
	
	ПрочиеАктивыПассивы.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход, "ВидДвижения");
	КолонкиГруппировки = "ВидДвижения, Период, Организация, Подразделение, Статья, Аналитика";
	КолонкиСуммирования = "Сумма";
	ПрочиеАктивыПассивы.Свернуть(КолонкиГруппировки, КолонкиСуммирования);
	
	КолонкиГруппировки = "Период, ХозяйственнаяОперация, Организация, 
		|Подразделение, Статья, АналитикаРасходов, АналитикаДоходов, АналитикаАктивовПассивов, НаправлениеДеятельности,
		|КорПодразделение, КорСтатья, КорАналитикаРасходов, КорАналитикаДоходов, КорАналитикаАктивовПассивов, КорНаправлениеДеятельности";
	КолонкиСуммирования = "Сумма, СуммаРегл";
	ДвиженияДоходыРасходыПрочиеАктивыПассивы.Свернуть(КолонкиГруппировки, КолонкиСуммирования);
	
	Результат = Новый Структура;
	Результат.Вставить("ПрочиеРасходы",       ПрочиеРасходы);
	Результат.Вставить("ПрочиеАктивыПассивы", ПрочиеАктивыПассивы);
	Результат.Вставить("ДвиженияДоходыРасходыПрочиеАктивыПассивы", ДвиженияДоходыРасходыПрочиеАктивыПассивы);
	
	Возврат Результат;

КонецФункции

Функция ТаблицыРасчетНалога(Реквизиты)
	
	СправкаРасчет = ПустаяСправкаРасчет(Реквизиты.ИмяРегистраРасчетНалогов);
	РасходыНаПлатон = ПустаяТаблицаРасходыНаПлатон();
	
	Если Реквизиты.ВидНалога = Перечисления.ВидыИмущественныхНалогов.НалогНаИмущество Тогда
		
		РасчетПоНалогу = РасчетИмущественныхНалогов.ПолучитьРасчетПоНалогуНаИмущество(Реквизиты.Организация, Реквизиты.Период);
		
	ИначеЕсли Реквизиты.ВидНалога = Перечисления.ВидыИмущественныхНалогов.ТранспортныйНалог Тогда
		
		РасчетыПоНалогу = РасчетИмущественныхНалогов.ПолучитьРасчетПоТранспортномуНалогу(Реквизиты.Организация, Реквизиты.Период);
		РасчетПоНалогу = РасчетыПоНалогу.Налог;
		
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РасчетыПоНалогу.Платон, РасходыНаПлатон);
		
	ИначеЕсли Реквизиты.ВидНалога = Перечисления.ВидыИмущественныхНалогов.ЗемельныйНалог Тогда
		
		РасчетПоНалогу = РасчетИмущественныхНалогов.ПолучитьРасчетПоЗемельномуНалогу(Реквизиты.Организация, Реквизиты.Период);
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РасчетПоНалогу, СправкаРасчет);
	
	ТаблицыРасчетНалога = Новый Структура;
	ТаблицыРасчетНалога.Вставить("СправкаРасчет", СправкаРасчет);
	ТаблицыРасчетНалога.Вставить("РасходыНаПлатон", РасходыНаПлатон);
	
	Возврат ТаблицыРасчетНалога;
	
КонецФункции

Функция ПустаяТаблицаРасходыНаПлатон() Экспорт

	РасходыНаПлатон = Новый ТаблицаЗначений;
	
	РасходыНаПлатон.Колонки.Добавить("ОтчетОператора", Новый ОписаниеТипов("ДокументСсылка.ОтчетОператораСистемыПлатон"));
	РасходыНаПлатон.Колонки.Добавить("ОсновноеСредство", Новый ОписаниеТипов("СправочникСсылка.ОбъектыЭксплуатации"));
	РасходыНаПлатон.Колонки.Добавить("СтатьяРасходов", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
	РасходыНаПлатон.Колонки.Добавить("АналитикаРасходов", Метаданные.ПланыВидовХарактеристик.СтатьиРасходов.Тип);
	РасходыНаПлатон.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	РасходыНаПлатон.Колонки.Добавить("НаправлениеДеятельности", Новый ОписаниеТипов("СправочникСсылка.НаправленияДеятельности"));
	РасходыНаПлатон.Колонки.Добавить("СуммаРегл", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	РасходыНаПлатон.Колонки.Добавить("СуммаНалога", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	РасходыНаПлатон.Колонки.Добавить("База", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	
	Возврат РасходыНаПлатон;

КонецФункции

Функция ПустаяСправкаРасчет(ИмяРегистраСведений) Экспорт

	СправкаРасчет = РасчетИмущественныхНалогов.ПустаяСправкаРасчет(ИмяРегистраСведений);

	Если ИмяРегистраСведений = "РасчетТранспортногоНалога" Тогда
		СправкаРасчет.Колонки.Добавить("УплачиваютсяАвансы", Новый ОписаниеТипов("Булево"));
	КонецЕсли; 
	
	Возврат СправкаРасчет;
	
КонецФункции
 
#Область ЗаданияКЗакрытиюМесяца

// Формирует задание к расчету налога на имущество, на основании измененных данных.
//
// Параметры:
//  ДокументСсылка	 - ДокументСсылка	 - Ссылка на документ.
//  ДанныеТаблиц	 - Структура		 - Содержит список таблиц в которых произошли изменения.
//
Процедура СформироватьЗаданиеКРасчетуНалогаНаИмущество(ДокументСсылка, ДанныеТаблиц) Экспорт

	ТипОбъекта = ТипЗнч(ДокументСсылка);
	
	ЕстьОсновныеСредства = (ТипОбъекта <> Тип("ДокументСсылка.РегламентнаяОперация")
							И ДокументСсылка <> Неопределено);
								
	ПроверитьЧтоОСПринятоКУчету = (ТипОбъекта = Тип("ДокументСсылка.ВводОстатковВнеоборотныхАктивов")
									ИЛИ ТипОбъекта = Тип("ДокументСсылка.ВводОстатковВнеоборотныхАктивов2_4")
									ИЛИ ТипОбъекта = Тип("ДокументСсылка.ПринятиеКУчетуОС")
									ИЛИ ТипОбъекта = Тип("ДокументСсылка.РегистрацияТранспортныхСредств"));
									
	ПринятиеКУчетуЗаданоДокументом = (ТипОбъекта = Тип("ДокументСсылка.ВводОстатковВнеоборотныхАктивов")
										ИЛИ ТипОбъекта = Тип("ДокументСсылка.ВводОстатковВнеоборотныхАктивов2_4")
										ИЛИ ТипОбъекта = Тип("ДокументСсылка.ПринятиеКУчетуОС"));
	
	СписокТаблиц = Новый Массив;
	СписокТаблиц.Добавить("ИзменениеПараметровОС");
	СписокТаблиц.Добавить("ИзменениеСпособаОтраженияИмущественныхНалогов");
	СписокТаблиц.Добавить("МестонахождениеОСБухгалтерскийУчет");
	СписокТаблиц.Добавить("ПервоначальныеСведенияОСБухгалтерскийУчет");
	СписокТаблиц.Добавить("РегламентнаяОперацияРасчетНалогаНаИмущество");
	СписокТаблиц.Добавить("РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество");
	СписокТаблиц.Добавить("СостоянияОСОрганизаций");
	СписокТаблиц.Добавить("СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет");
	СписокТаблиц.Добавить("СпособыОтраженияРасходовПоИмущественнымНалогам");
	СписокТаблиц.Добавить("СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам");
	СписокТаблиц.Добавить("СчетаБухгалтерскогоУчетаОС");
	СписокТаблиц.Добавить("СтавкиНалогаНаИмущество");
	СписокТаблиц.Добавить("ПорядокУплатыНалоговНаМестах");
	
	// Версия 2.4
	СписокТаблиц.Добавить("СтоимостьОС");
	СписокТаблиц.Добавить("МестонахождениеОС");
	СписокТаблиц.Добавить("ПервоначальныеСведенияОС");
	СписокТаблиц.Добавить("ПорядокУчетаОСБУ");
	
	СписокДопПолей = "ОтражатьВРеглУчете" + ?(ЕстьОсновныеСредства, ",ОсновноеСредство", "");
	ТекстОбъединенияДанных = ВнеоборотныеАктивы.СформироватьТекстОбъединенияДанныхДляФормированияЗадания(
									СписокТаблиц, ДанныеТаблиц, СписокДопПолей);
	
	Если ТекстОбъединенияДанных = "" Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	МИНИМУМ(ВЫБОР 
	|				КОГДА ТИПЗНАЧЕНИЯ(ИзмененныеДанные.Документ) = ТИП(Документ.ВводОстатковВнеоборотныхАктивов)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ВводОстатков22.Дата, МЕСЯЦ, 1)
	|				КОГДА ТИПЗНАЧЕНИЯ(ИзмененныеДанные.Документ) = ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ВводОстатков24.Дата, МЕСЯЦ, 1)
	|				КОГДА ИзмененныеДанные.ИмяТаблицы = ""ПорядокУчетаОСБУ""
	|						И ИзмененныеДанные.Период < &ДатаНачалаУчета24
	|					ТОГДА &ДатаНачалаУчета24
	|				ИНАЧЕ ИзмененныеДанные.Период 
	|			КОНЕЦ) КАК Период,
	|	ИзмененныеДанные.Организация       КАК Организация,
	|	" + ?(ЕстьОсновныеСредства, "ИзмененныеДанные.ОсновноеСредство КАК ОсновноеСредство,", "") + "
	|	ИзмененныеДанные.Документ          КАК Документ
	|ПОМЕСТИТЬ ИзмененныеДанные
	|ИЗ
	|	(" + ТекстОбъединенияДанных + ") КАК ИзмененныеДанные
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводОстатковВнеоборотныхАктивов КАК ВводОстатков22
	|	ПО ВводОстатков22.Ссылка = ИзмененныеДанные.Документ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводОстатковВнеоборотныхАктивов2_4 КАК ВводОстатков24
	|	ПО ВводОстатков24.Ссылка = ИзмененныеДанные.Документ
	|
	|ГДЕ
	|	ИзмененныеДанные.ОтражатьВРеглУчете
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзмененныеДанные.Организация,
	|	" + ?(ЕстьОсновныеСредства, "ИзмененныеДанные.ОсновноеСредство,", "") + "
	|	ИзмененныеДанные.Документ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|	" + ?(ЕстьОсновныеСредства, ",ОсновноеСредство", "");
	
	Если ЕстьОсновныеСредства Тогда
		
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИзмененныеДанные.ОсновноеСредство КАК ОсновноеСредство
		|ПОМЕСТИТЬ СписокОС
		|ИЗ
		|	ИзмененныеДанные КАК ИзмененныеДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыЭксплуатации КАК ОбъектыЭксплуатации
		|		ПО (ОбъектыЭксплуатации.Ссылка = ИзмененныеДанные.ОсновноеСредство)
		|ГДЕ
		|	ОбъектыЭксплуатации.Ссылка В 
		|		(ВЫБРАТЬ
		|			ПервоначальныеСведения.ОсновноеСредство
		|		ИЗ
		|			РегистрСведений.ПервоначальныеСведенияОС КАК ПервоначальныеСведения
		|		ГДЕ
		|			ПервоначальныеСведения.ОбъектИмущественногоНалога
		|			И ПервоначальныеСведения.Период <= ИзмененныеДанные.Период
		|			И ПервоначальныеСведения.Организация = ИзмененныеДанные.Организация
		|		ОБЪЕДИНИТЬ ВСЕ
		|
		|       ВЫБРАТЬ
		|			ПервоначальныеСведения.ОсновноеСредство
		|		ИЗ
		|			РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет КАК ПервоначальныеСведения
		|		ГДЕ
		|			ПервоначальныеСведения.ОбъектИмущественногоНалога
		|			И ПервоначальныеСведения.Период <= ИзмененныеДанные.Период
		|			И ПервоначальныеСведения.Организация = ИзмененныеДанные.Организация
		|		)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство";
		
	КонецЕсли; 
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
	"ВЫБРАТЬ
	|	ИзмененныеДанные.Организация КАК Организация,
	|	УчетнаяПолитикаОрганизаций.УчетнаяПолитика КАК УчетнаяПолитика,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитикаОрганизаций.Период > ИзмененныеДанные.Период
	|				И УчетнаяПолитикаОрганизаций.Период > &ДатаНачалаВеденияРеглУчета
	|			ТОГДА УчетнаяПолитикаОрганизаций.Период
	|		КОГДА &ДатаНачалаВеденияРеглУчета > ИзмененныеДанные.Период
	|			ТОГДА &ДатаНачалаВеденияРеглУчета
	|		ИНАЧЕ ИзмененныеДанные.Период
	|	КОНЕЦ КАК Начало
	|ПОМЕСТИТЬ УчетнаяПолитикаОрганизаций
	|ИЗ
	|	ИзмененныеДанные КАК ИзмененныеДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
	|		ПО (УчетнаяПолитикаОрганизаций.Организация = ИзмененныеДанные.Организация)
	|			И (УчетнаяПолитикаОрганизаций.УчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
	|				ИЛИ ИзмененныеДанные.Период >= ДАТАВРЕМЯ(2015, 1, 1))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций КАК СледующаяУчетнаяПолитикаОрганизаций
	|		ПО (СледующаяУчетнаяПолитикаОрганизаций.Организация = УчетнаяПолитикаОрганизаций.Организация)
	|			И (СледующаяУчетнаяПолитикаОрганизаций.Период > УчетнаяПолитикаОрганизаций.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзмененныеДанные.Организация,
	|	УчетнаяПолитикаОрганизаций.УчетнаяПолитика,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитикаОрганизаций.Период > ИзмененныеДанные.Период
	|				И УчетнаяПолитикаОрганизаций.Период > &ДатаНачалаВеденияРеглУчета
	|			ТОГДА УчетнаяПолитикаОрганизаций.Период
	|		КОГДА &ДатаНачалаВеденияРеглУчета > ИзмененныеДанные.Период
	|			ТОГДА &ДатаНачалаВеденияРеглУчета
	|		ИНАЧЕ ИзмененныеДанные.Период
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	(ЕСТЬNULL(МИНИМУМ(СледующаяУчетнаяПолитикаОрганизаций.Период), ДАТАВРЕМЯ(1, 1, 1)) > МИНИМУМ(ИзмененныеДанные.Период)
	|			И ЕСТЬNULL(МИНИМУМ(СледующаяУчетнаяПолитикаОрганизаций.Период), ДАТАВРЕМЯ(1, 1, 1)) > &ДатаНачалаВеденияРеглУчета
	|		ИЛИ ЕСТЬNULL(МИНИМУМ(СледующаяУчетнаяПолитикаОрганизаций.Период), ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация";
	
	Если ПроверитьЧтоОСПринятоКУчету Тогда
		
		Если ПринятиеКУчетуЗаданоДокументом Тогда
			
			Если ДанныеТаблиц.МенеджерВременныхТаблиц.Таблицы.Найти("СостоянияОСОрганизаций") <> Неопределено Тогда
			
				ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
					"ВЫБРАТЬ
					|	УчетнаяПолитикаОрганизаций.Организация КАК Организация,
					|	МИНИМУМ(КОНЕЦПЕРИОДА(ВЫБОР 
					|							КОГДА ПринятыеКУчету.Период > УчетнаяПолитикаОрганизаций.Начало 
					|								ТОГДА ПринятыеКУчету.Период 
					|							ИНАЧЕ 
					|								УчетнаяПолитикаОрганизаций.Начало 
					|						КОНЕЦ, МЕСЯЦ)) КАК Период
					|ПОМЕСТИТЬ ПериодЗадания
					|ИЗ
					|	УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СостоянияОСОрганизаций КАК ПринятыеКУчету
					|		ПО (ПринятыеКУчету.Организация = УчетнаяПолитикаОрганизаций.Организация)
					|			И (ПринятыеКУчету.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету))
					|ГДЕ
					|	УчетнаяПолитикаОрганизаций.УчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
					|	
					|СГРУППИРОВАТЬ ПО
					|	УчетнаяПолитикаОрганизаций.Организация
					|	
					|ИНДЕКСИРОВАТЬ ПО
					|	Организация";
					
			Иначе
					
				ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
					"ВЫБРАТЬ
					|	УчетнаяПолитикаОрганизаций.Организация КАК Организация,
					|	МИНИМУМ(КОНЕЦПЕРИОДА(ВЫБОР 
					|							КОГДА ПринятыеКУчету.Период > УчетнаяПолитикаОрганизаций.Начало 
					|								ТОГДА ПринятыеКУчету.Период 
					|							ИНАЧЕ 
					|								УчетнаяПолитикаОрганизаций.Начало 
					|						КОНЕЦ, МЕСЯЦ)) КАК Период
					|ПОМЕСТИТЬ ПериодЗадания
					|ИЗ
					|	УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИзмененныеДанные КАК ИзмененныеДанные
					|		ПО ИзмененныеДанные.Организация = УчетнаяПолитикаОрганизаций.Организация
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК ПринятыеКУчету
					|		ПО (ПринятыеКУчету.Организация = УчетнаяПолитикаОрганизаций.Организация)
					|			И (ПринятыеКУчету.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету))
					|			И (ПринятыеКУчету.Регистратор = ИзмененныеДанные.Документ)
					|			И (ПринятыеКУчету.Активность)
					|ГДЕ
					|	УчетнаяПолитикаОрганизаций.УчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
					|	
					|СГРУППИРОВАТЬ ПО
					|	УчетнаяПолитикаОрганизаций.Организация
					|	
					|ИНДЕКСИРОВАТЬ ПО
					|	Организация";

			КонецЕсли;		
		Иначе
		
			ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
				"ВЫБРАТЬ
				|	ВложенныйЗапрос.Организация,
				|	МИНИМУМ(НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, МЕСЯЦ)) КАК Период
				|ПОМЕСТИТЬ ПериодЗадания
				|ИЗ
				|	(ВЫБРАТЬ
				|		УчетнаяПолитикаОрганизаций.Организация КАК Организация,
				|		МИНИМУМ(КОНЕЦПЕРИОДА(ВЫБОР 
				|								КОГДА ПринятыеКУчету.Период > УчетнаяПолитикаОрганизаций.Начало 
				|									ТОГДА ПринятыеКУчету.Период 
				|								ИНАЧЕ 
				|									УчетнаяПолитикаОрганизаций.Начало 
				|							КОНЕЦ, МЕСЯЦ)) КАК Период
				|	ИЗ
				|		УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК ПринятыеКУчету
				|			ПО (ПринятыеКУчету.Организация = УчетнаяПолитикаОрганизаций.Организация)
				|				И (ПринятыеКУчету.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету))
				|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК СледующееСостояниеОС
				|			ПО (СледующееСостояниеОС.Организация = ПринятыеКУчету.Организация)
				|				И (СледующееСостояниеОС.ОсновноеСредство = ПринятыеКУчету.ОсновноеСредство)
				|				И (СледующееСостояниеОС.Период > ПринятыеКУчету.Период)
				|				И (СледующееСостояниеОС.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету))
				|	ГДЕ
				|		УчетнаяПолитикаОрганизаций.УчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
				|		" + ?(ЕстьОсновныеСредства, "И ПринятыеКУчету.ОсновноеСредство В
				|				(ВЫБРАТЬ
				|					СписокОС.ОсновноеСредство
				|				ИЗ
				|					СписокОС КАК СписокОС)", "") + "
				|	
				|	СГРУППИРОВАТЬ ПО
				|		УчетнаяПолитикаОрганизаций.Организация
				|	
				|	ИМЕЮЩИЕ
				|		(МИНИМУМ(СледующееСостояниеОС.Период) >= МИНИМУМ(УчетнаяПолитикаОрганизаций.Начало)
				|			ИЛИ ЕСТЬNULL(МИНИМУМ(СледующееСостояниеОС.Период), ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1))
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		УчетнаяПолитикаОрганизаций.Организация,
				|		МИНИМУМ(КОНЕЦПЕРИОДА(ВЫБОР 
				|								КОГДА СтавкиНалога.Период > УчетнаяПолитикаОрганизаций.Начало 
				|									ТОГДА СтавкиНалога.Период 
				|								ИНАЧЕ 
				|									УчетнаяПолитикаОрганизаций.Начало 
				|							КОНЕЦ, МЕСЯЦ))
				|	ИЗ
				|		УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам КАК СтавкиНалога
				|			ПО (СтавкиНалога.Организация = УчетнаяПолитикаОрганизаций.Организация)
				|				И (СтавкиНалога.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.НалоговаяБазаПоНалогуНаИмущество.КадастроваяСтоимость))
				|				И (СтавкиНалога.Период >= УчетнаяПолитикаОрганизаций.Начало)
				|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам КАК СледующееСтавкиНалога
				|			ПО (СледующееСтавкиНалога.Организация = СтавкиНалога.Организация)
				|				И (СледующееСтавкиНалога.ОсновноеСредство = СтавкиНалога.ОсновноеСредство)
				|				И (СледующееСтавкиНалога.Период > СтавкиНалога.Период)
				|				И (СледующееСтавкиНалога.НалоговаяБаза <> ЗНАЧЕНИЕ(Перечисление.НалоговаяБазаПоНалогуНаИмущество.КадастроваяСтоимость))
				|	" + ?(ЕстьОсновныеСредства, "ГДЕ
				|		СтавкиНалога.ОсновноеСредство В
				|				(ВЫБРАТЬ
				|					СписокОС.ОсновноеСредство
				|				ИЗ
				|					СписокОС КАК СписокОС)", "") + "
				|	
				|	СГРУППИРОВАТЬ ПО
				|		УчетнаяПолитикаОрганизаций.Организация
				|	
				|	ИМЕЮЩИЕ
				|		(МИНИМУМ(СледующееСтавкиНалога.Период) >= МИНИМУМ(УчетнаяПолитикаОрганизаций.Начало)
				|			ИЛИ ЕСТЬNULL(МИНИМУМ(СледующееСтавкиНалога.Период), ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1))) КАК ВложенныйЗапрос
				|
				|СГРУППИРОВАТЬ ПО
				|	ВложенныйЗапрос.Организация
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	Организация";
			
		КонецЕсли;
		
	Иначе

		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
			"ВЫБРАТЬ
			|	ВложенныйЗапрос.Организация,
			|	МИНИМУМ(НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, МЕСЯЦ)) КАК Период
			|ПОМЕСТИТЬ ПериодЗадания
			|ИЗ
			|	(ВЫБРАТЬ
			|		УчетнаяПолитикаОрганизаций.Организация КАК Организация,
			|		МИНИМУМ(КОНЕЦПЕРИОДА(УчетнаяПолитикаОрганизаций.Начало, МЕСЯЦ)) КАК Период
			|	ИЗ
			|		УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
			|	ГДЕ
			|		УчетнаяПолитикаОрганизаций.УчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
			|	
			|	СГРУППИРОВАТЬ ПО
			|		УчетнаяПолитикаОрганизаций.Организация
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		УчетнаяПолитикаОрганизаций.Организация,
			|		МИНИМУМ(КОНЕЦПЕРИОДА(ВЫБОР 
			|								КОГДА СтавкиНалога.Период > УчетнаяПолитикаОрганизаций.Начало 
			|									ТОГДА СтавкиНалога.Период 
			|								ИНАЧЕ 
			|									УчетнаяПолитикаОрганизаций.Начало 
			|							КОНЕЦ, МЕСЯЦ))
			|	ИЗ
			|		УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам КАК СтавкиНалога
			|			ПО (СтавкиНалога.Организация = УчетнаяПолитикаОрганизаций.Организация)
			|				И (СтавкиНалога.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.НалоговаяБазаПоНалогуНаИмущество.КадастроваяСтоимость))
			|				И (СтавкиНалога.Период >= УчетнаяПолитикаОрганизаций.Начало)
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам КАК СледующееСтавкиНалога
			|			ПО (СледующееСтавкиНалога.Организация = СтавкиНалога.Организация)
			|				И (СледующееСтавкиНалога.ОсновноеСредство = СтавкиНалога.ОсновноеСредство)
			|				И (СледующееСтавкиНалога.Период > СтавкиНалога.Период)
			|				И (СледующееСтавкиНалога.НалоговаяБаза <> ЗНАЧЕНИЕ(Перечисление.НалоговаяБазаПоНалогуНаИмущество.КадастроваяСтоимость))
			|	" + ?(ЕстьОсновныеСредства, "ГДЕ
			|		СтавкиНалога.ОсновноеСредство В
			|				(ВЫБРАТЬ
			|					СписокОС.ОсновноеСредство
			|				ИЗ
			|					СписокОС КАК СписокОС)", "") + "
			|	
			|	СГРУППИРОВАТЬ ПО
			|		УчетнаяПолитикаОрганизаций.Организация
			|	
			|	ИМЕЮЩИЕ
			|		(МИНИМУМ(СледующееСтавкиНалога.Период) >= МИНИМУМ(УчетнаяПолитикаОрганизаций.Начало)
			|			ИЛИ ЕСТЬNULL(МИНИМУМ(СледующееСтавкиНалога.Период), ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1))) КАК ВложенныйЗапрос
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.Организация
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ВложенныйЗапрос.Организация";
			
	КонецЕсли; 
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
	"ВЫБРАТЬ
	|	ИзмененныеДанные.Организация,
	|	ИзмененныеДанные.Документ,
	|	&Операция КАК Операция,
	|	МИНИМУМ(ВЫБОР 
	|				КОГДА НАЧАЛОПЕРИОДА(ПериодЗадания.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ПериодЗадания.Период, КВАРТАЛ)
	|					ТОГДА НАЧАЛОПЕРИОДА(ПериодЗадания.Период, КВАРТАЛ)
	|				КОГДА КОНЕЦПЕРИОДА(ПериодЗадания.Период, КВАРТАЛ) = КОНЕЦПЕРИОДА(ПериодЗадания.Период, ГОД)
	|					ТОГДА НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ПериодЗадания.Период, КВАРТАЛ), МЕСЯЦ)
	|				ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ПериодЗадания.Период, КВАРТАЛ), МЕСЯЦ), МЕСЯЦ, 1)
	|			КОНЕЦ) КАК Месяц
	|ИЗ
	|	ИзмененныеДанные КАК ИзмененныеДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодЗадания КАК ПериодЗадания
	|		ПО (ПериодЗадания.Организация = ИзмененныеДанные.Организация)
	|
	|	" + ?(ЕстьОсновныеСредства, "ГДЕ
	|		ИзмененныеДанные.ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					СписокОС.ОсновноеСредство
	|				ИЗ
	|					СписокОС КАК СписокОС)", "") + "
	|СГРУППИРОВАТЬ ПО
	|	ИзмененныеДанные.Организация,
	|	ИзмененныеДанные.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПериодЗадания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ИзмененныеДанные";
	
	Если ЕстьОсновныеСредства Тогда
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
		"УНИЧТОЖИТЬ СписокОС";
	КонецЕсли;

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ДанныеТаблиц.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНачалаВеденияРеглУчета", Константы.ДатаНачалаВеденияРеглУчета.Получить());
	Запрос.УстановитьПараметр("ДатаНачалаУчета24", Константы.ДатаНачалаУчетаВнеоборотныхАктивов2_4.Получить());
	Запрос.УстановитьПараметр("Операция", Перечисления.ОперацииЗакрытияМесяца.РасчетНалогаНаИмущество);
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РегистрыСведений.ЗаданияКЗакрытиюМесяца.СоздатьЗаписиРегистраПоДаннымВыборки(РезультатЗапроса.Выбрать());
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Формирует задание к расчету транспортного налога, на основании измененных данных.
//
// Параметры:
//  ДокументСсылка		 - ДокументСсылка	 - Ссылка на документ.
//  ДанныеТаблиц		 - Структура		 - Содержит список таблиц в которых произошли изменения.
//  ЕстьОсновныеСредства - Булево			 - Истина, если измененные данные содержат информацию об основных средствах.
//
Процедура СформироватьЗаданиеКРасчетуТранспортногоНалога(ДокументСсылка, ДанныеТаблиц, ЕстьОсновныеСредства = Неопределено) Экспорт

	ТипОбъекта = ТипЗнч(ДокументСсылка);
	
	ЕстьОсновныеСредства = (ТипОбъекта <> Тип("ДокументСсылка.РегламентнаяОперация")
							И ДокументСсылка <> Неопределено
							ИЛИ ЕстьОсновныеСредства <> Неопределено И ЕстьОсновныеСредства);
	
	ПроверитьЧтоОСЗарегистрировано = 
		(ТипОбъекта <> Тип("ДокументСсылка.ОтменаРегистрацииТранспортныхСредств")
			И ТипОбъекта <> Тип("ДокументСсылка.РегистрацияТранспортныхСредств"));
	
	СписокТаблиц = Новый Массив;
	СписокТаблиц.Добавить("ИзменениеПараметровОС");
	СписокТаблиц.Добавить("ИзменениеСпособаОтраженияИмущественныхНалогов");
	СписокТаблиц.Добавить("МестонахождениеОСБухгалтерскийУчет");
	СписокТаблиц.Добавить("ПорядокУплатыНалоговНаМестах");
	СписокТаблиц.Добавить("РегламентнаяОперацияРасчетТранспортногоНалога");
	СписокТаблиц.Добавить("РегистрацияТранспортныхСредств");
	СписокТаблиц.Добавить("СпособыОтраженияРасходовПоИмущественнымНалогам");
	СписокТаблиц.Добавить("РасходыНаПлатон");
	СписокТаблиц.Добавить("РасчетыСПоставщикамиПоДокументам_ЗаданияКРасчетуТранспортногоНалога");
	
	// Версия 2.4
	СписокТаблиц.Добавить("МестонахождениеОС");
	
	СписокДопПолей = "ОтражатьВРеглУчете" + ?(ЕстьОсновныеСредства, ",ОсновноеСредство", "");
	ТекстОбъединенияДанных = ВнеоборотныеАктивы.СформироватьТекстОбъединенияДанныхДляФормированияЗадания(
									СписокТаблиц, ДанныеТаблиц, СписокДопПолей);
	
	Если ТекстОбъединенияДанных = "" Тогда
		Возврат;
	КонецЕсли;
	
	// Условия формирования задания:
	// - если с начала квартала были зарегистрированы транспортные средства (дата задания - наименьшая дата регистрации)
	// - или если на начало квартала есть зарегистрированные транспортные средства (дата задания - начало квартала).
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	МИНИМУМ(ВЫБОР 
	|				КОГДА ТИПЗНАЧЕНИЯ(ИзмененныеДанные.Документ) = ТИП(Документ.ВводОстатковВнеоборотныхАктивов)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ВводОстатков22.Дата, МЕСЯЦ, 1)
	|				КОГДА ТИПЗНАЧЕНИЯ(ИзмененныеДанные.Документ) = ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ВводОстатков24.Дата, МЕСЯЦ, 1)
	|				КОГДА ТИПЗНАЧЕНИЯ(ИзмененныеДанные.Документ) = ТИП(Документ.РегистрацияТранспортныхСредств)
	|					ТОГДА РегистрацияТранспортныхСредств.Дата
	|				ИНАЧЕ ИзмененныеДанные.Период 
	|			КОНЕЦ)   КАК Период,
	|	ИзмененныеДанные.Организация       КАК Организация,
	|	" + ?(ЕстьОсновныеСредства, "ИзмененныеДанные.ОсновноеСредство КАК ОсновноеСредство,", "") + "
	|	ИзмененныеДанные.Документ          КАК Документ
	|ПОМЕСТИТЬ ИзмененныеДанные
	|ИЗ
	|	(" + ТекстОбъединенияДанных + ") КАК ИзмененныеДанные
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводОстатковВнеоборотныхАктивов КАК ВводОстатков22
	|	ПО ВводОстатков22.Ссылка = ИзмененныеДанные.Документ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводОстатковВнеоборотныхАктивов2_4 КАК ВводОстатков24
	|	ПО ВводОстатков24.Ссылка = ИзмененныеДанные.Документ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
	|	ПО РегистрацияТранспортныхСредств.Ссылка = ИзмененныеДанные.Документ
	|ГДЕ
	|	ИзмененныеДанные.ОтражатьВРеглУчете
	|	И ВЫРАЗИТЬ(ИзмененныеДанные.Организация КАК Справочник.Организации).ЮридическоеФизическоеЛицо <> ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзмененныеДанные.Организация,
	|	" + ?(ЕстьОсновныеСредства, "ИзмененныеДанные.ОсновноеСредство,", "") + "
	|	ИзмененныеДанные.Документ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|	" + ?(ЕстьОсновныеСредства, ",ОсновноеСредство", "");
	
	Если ПроверитьЧтоОСЗарегистрировано Тогда
		
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	РегистрацияТранспортныхСредствПоследние.Организация КАК Организация
			|ПОМЕСТИТЬ РегистрацияТранспортныхСредствНаНачало
			|ИЗ
			|	(ВЫБРАТЬ
			|		РегистрацияТранспортныхСредств.Организация КАК Организация,
			|		РегистрацияТранспортныхСредств.ОсновноеСредство КАК ОсновноеСредство,
			|		МАКСИМУМ(РегистрацияТранспортныхСредств.Период) КАК Период
			|	ИЗ
			|		ИзмененныеДанные КАК ИзмененныеДанные
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
			|			ПО (РегистрацияТранспортныхСредств.Организация = ИзмененныеДанные.Организация)
			|				И (РегистрацияТранспортныхСредств.Период < НАЧАЛОПЕРИОДА(ИзмененныеДанные.Период, КВАРТАЛ))
			|				" + ?(ЕстьОсновныеСредства, "И РегистрацияТранспортныхСредств.ОсновноеСредство = ИзмененныеДанные.ОсновноеСредство", "") + "
			|	
			|	СГРУППИРОВАТЬ ПО
			|		РегистрацияТранспортныхСредств.Организация,
			|		РегистрацияТранспортныхСредств.ОсновноеСредство
			|	) КАК РегистрацияТранспортныхСредствПоследние
			|
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
			|		ПО (РегистрацияТранспортныхСредств.Организация = РегистрацияТранспортныхСредствПоследние.Организация)
			|			И (РегистрацияТранспортныхСредств.ОсновноеСредство = РегистрацияТранспортныхСредствПоследние.ОсновноеСредство)
			|			И (РегистрацияТранспортныхСредств.Период = РегистрацияТранспортныхСредствПоследние.Период)
			|ГДЕ
			|	РегистрацияТранспортныхСредств.ВключатьВНалоговуюБазу
			|
			|СГРУППИРОВАТЬ ПО
			|	РегистрацияТранспортныхСредствПоследние.Организация
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Организация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РегистрацияТранспортныхСредств.Организация,
			|	МИНИМУМ(РегистрацияТранспортныхСредств.Период) КАК Период
			|ПОМЕСТИТЬ ПериодЗадания
			|ИЗ
			|	(ВЫБРАТЬ
			|		ИзмененныеДанные.Организация КАК Организация,
			|		МИНИМУМ(НАЧАЛОПЕРИОДА(ИзмененныеДанные.Период, МЕСЯЦ)) КАК Период
			|	ИЗ
			|		ИзмененныеДанные КАК ИзмененныеДанные
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрацияТранспортныхСредствНаНачало КАК РегистрацияТранспортныхСредствНаНачало
			|			ПО (РегистрацияТранспортныхСредствНаНачало.Организация = ИзмененныеДанные.Организация)
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ИзмененныеДанные.Организация
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ИзмененныеДанные.Организация,
			|		МИНИМУМ(НАЧАЛОПЕРИОДА(РегистрацияТранспортныхСредств.Период, МЕСЯЦ))
			|	ИЗ
			|		ИзмененныеДанные КАК ИзмененныеДанные
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
			|			ПО (РегистрацияТранспортныхСредств.Организация = ИзмененныеДанные.Организация)
			|				И (РегистрацияТранспортныхСредств.Период >= НАЧАЛОПЕРИОДА(ИзмененныеДанные.Период, КВАРТАЛ))
			|				И (РегистрацияТранспортныхСредств.ВключатьВНалоговуюБазу)
			|				" + ?(ЕстьОсновныеСредства, "И РегистрацияТранспортныхСредств.ОсновноеСредство = ИзмененныеДанные.ОсновноеСредство", "") + "
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ИзмененныеДанные.Организация) КАК РегистрацияТранспортныхСредств
			|
			|СГРУППИРОВАТЬ ПО
			|	РегистрацияТранспортныхСредств.Организация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ИзмененныеДанные.Организация,
			|	ИзмененныеДанные.Документ,
			|	&Операция КАК Операция,
			|	МИНИМУМ(ВЫБОР 
			|				КОГДА МЕСЯЦ(ПериодЗадания.Период) <= 6
			|					ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ПериодЗадания.Период, ГОД), МЕСЯЦ, 5)
			|				ИНАЧЕ НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ПериодЗадания.Период, ГОД), МЕСЯЦ)
			|			КОНЕЦ) КАК Месяц
			|ИЗ
			|	ИзмененныеДанные КАК ИзмененныеДанные
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодЗадания КАК ПериодЗадания
			|		ПО (ПериодЗадания.Организация = ИзмененныеДанные.Организация)
			|
			|СГРУППИРОВАТЬ ПО
			|	ИзмененныеДанные.Организация,
			|	ИзмененныеДанные.Документ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ПериодЗадания
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ИзмененныеДанные";
	Иначе
		
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
			"ВЫБРАТЬ
			|	ИзмененныеДанные.Организация,
			|	ИзмененныеДанные.Документ,
			|	&Операция КАК Операция,
			|	МИНИМУМ(ВЫБОР 
			|				КОГДА МЕСЯЦ(ИзмененныеДанные.Период) <= 6
			|					ТОГДА ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ИзмененныеДанные.Период, ГОД), МЕСЯЦ, 5)
			|				ИНАЧЕ НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ИзмененныеДанные.Период, ГОД), МЕСЯЦ)
			|			КОНЕЦ) КАК Месяц
			|ИЗ
			|	ИзмененныеДанные КАК ИзмененныеДанные
			|
			|СГРУППИРОВАТЬ ПО
			|	ИзмененныеДанные.Организация,
			|	ИзмененныеДанные.Документ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ИзмененныеДанные";

	КонецЕсли; 
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ДанныеТаблиц.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНачалаВеденияРеглУчета", Константы.ДатаНачалаВеденияРеглУчета.Получить());
	Запрос.УстановитьПараметр("Операция", Перечисления.ОперацииЗакрытияМесяца.РасчетТранспортногоНалога);
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РегистрыСведений.ЗаданияКЗакрытиюМесяца.СоздатьЗаписиРегистраПоДаннымВыборки(РезультатЗапроса.Выбрать());
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Формирует задание к расчету земельного налога, на основании измененных данных.
//
// Параметры:
//  ДокументСсылка	 - ДокументСсылка	 - Ссылка на документ.
//  ДанныеТаблиц	 - Структура		 - Содержит список таблиц в которых произошли изменения.
//
Процедура СформироватьЗаданиеКРасчетуЗемельногоНалога(ДокументСсылка, ДанныеТаблиц) Экспорт
	
	ТипОбъекта = ТипЗнч(ДокументСсылка);
	
	ЕстьОсновныеСредства = (ТипОбъекта <> Тип("ДокументСсылка.РегламентнаяОперация")
							И ДокументСсылка <> Неопределено);
	
	ПроверитьЧтоОСЗарегистрировано = 
		(ТипОбъекта <> Тип("ДокументСсылка.ОтменаРегистрацииЗемельныхУчастков")
			И ТипОбъекта <> Тип("ДокументСсылка.РегистрацияЗемельныхУчастков"));
	
	СписокТаблиц = Новый Массив;
	СписокТаблиц.Добавить("ИзменениеПараметровОС");
	СписокТаблиц.Добавить("ИзменениеСпособаОтраженияИмущественныхНалогов");
	СписокТаблиц.Добавить("МестонахождениеОСБухгалтерскийУчет");
	СписокТаблиц.Добавить("ПорядокУплатыНалоговНаМестах");
	СписокТаблиц.Добавить("РегистрацияЗемельныхУчастков");
	СписокТаблиц.Добавить("РегламентнаяОперацияРасчетЗемельногоНалога");
	СписокТаблиц.Добавить("СпособыОтраженияРасходовПоИмущественнымНалогам");
	СписокТаблиц.Добавить("СтавкиНалогаНаИмущество");
	СписокТаблиц.Добавить("СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам");
	
	// Версия 2.4
	СписокТаблиц.Добавить("МестонахождениеОС");
	
	СписокДопПолей = "ОтражатьВРеглУчете" + ?(ЕстьОсновныеСредства, ",ОсновноеСредство", "");
	ТекстОбъединенияДанных = ВнеоборотныеАктивы.СформироватьТекстОбъединенияДанныхДляФормированияЗадания(
									СписокТаблиц, ДанныеТаблиц, СписокДопПолей);
	
	Если ТекстОбъединенияДанных = "" Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	МИНИМУМ(ВЫБОР 
	|				КОГДА ТИПЗНАЧЕНИЯ(ИзмененныеДанные.Документ) = ТИП(Документ.ВводОстатковВнеоборотныхАктивов)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ВводОстатков22.Дата, МЕСЯЦ, 1)
	|				КОГДА ТИПЗНАЧЕНИЯ(ИзмененныеДанные.Документ) = ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ВводОстатков24.Дата, МЕСЯЦ, 1)
	|				ИНАЧЕ ИзмененныеДанные.Период 
	|			КОНЕЦ)   КАК Период,
	|	ИзмененныеДанные.Организация       КАК Организация,
	|	" + ?(ЕстьОсновныеСредства, "ИзмененныеДанные.ОсновноеСредство КАК ОсновноеСредство,", "") + "
	|	ИзмененныеДанные.Документ          КАК Документ
	|ПОМЕСТИТЬ ИзмененныеДанные
	|ИЗ
	|	(" + ТекстОбъединенияДанных + ") КАК ИзмененныеДанные
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводОстатковВнеоборотныхАктивов КАК ВводОстатков22
	|	ПО ВводОстатков22.Ссылка = ИзмененныеДанные.Документ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводОстатковВнеоборотныхАктивов2_4 КАК ВводОстатков24
	|	ПО ВводОстатков24.Ссылка = ИзмененныеДанные.Документ
	|
	|ГДЕ
	|	ИзмененныеДанные.ОтражатьВРеглУчете
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзмененныеДанные.Организация,
	|	" + ?(ЕстьОсновныеСредства, "ИзмененныеДанные.ОсновноеСредство,", "") + "
	|	ИзмененныеДанные.Документ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|	" + ?(ЕстьОсновныеСредства, ",ОсновноеСредство", "");
	
	Если ПроверитьЧтоОСЗарегистрировано Тогда
		
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	РегистрацияЗемельныхУчастковПоследние.Организация КАК Организация
			|ПОМЕСТИТЬ РегистрацияЗемельныхУчастковНаНачало
			|ИЗ
			|	(ВЫБРАТЬ
			|		РегистрацияЗемельныхУчастков.Организация КАК Организация,
			|		РегистрацияЗемельныхУчастков.ОсновноеСредство КАК ОсновноеСредство,
			|		МАКСИМУМ(РегистрацияЗемельныхУчастков.Период) КАК Период
			|	ИЗ
			|		ИзмененныеДанные КАК ИзмененныеДанные
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияЗемельныхУчастков КАК РегистрацияЗемельныхУчастков
			|			ПО (РегистрацияЗемельныхУчастков.Организация = ИзмененныеДанные.Организация)
			|				И (РегистрацияЗемельныхУчастков.Период < НАЧАЛОПЕРИОДА(ИзмененныеДанные.Период, МЕСЯЦ))
			|				" + ?(ЕстьОсновныеСредства, "И РегистрацияЗемельныхУчастков.ОсновноеСредство = ИзмененныеДанные.ОсновноеСредство", "") + "
			|	
			|	СГРУППИРОВАТЬ ПО
			|		РегистрацияЗемельныхУчастков.Организация,
			|		РегистрацияЗемельныхУчастков.ОсновноеСредство
			|	) КАК РегистрацияЗемельныхУчастковПоследние
			|
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияЗемельныхУчастков КАК РегистрацияЗемельныхУчастков
			|		ПО (РегистрацияЗемельныхУчастков.Организация = РегистрацияЗемельныхУчастковПоследние.Организация)
			|			И (РегистрацияЗемельныхУчастков.ОсновноеСредство = РегистрацияЗемельныхУчастковПоследние.ОсновноеСредство)
			|			И (РегистрацияЗемельныхУчастков.Период = РегистрацияЗемельныхУчастковПоследние.Период)
			|ГДЕ
			|	РегистрацияЗемельныхУчастков.ВключатьВНалоговуюБазу
			|
			|СГРУППИРОВАТЬ ПО
			|	РегистрацияЗемельныхУчастковПоследние.Организация
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Организация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РегистрацияЗемельныхУчастков.Организация,
			|	МИНИМУМ(РегистрацияЗемельныхУчастков.Период) КАК Период
			|ПОМЕСТИТЬ ПериодЗадания
			|ИЗ
			|	(ВЫБРАТЬ
			|		ИзмененныеДанные.Организация КАК Организация,
			|		МИНИМУМ(НАЧАЛОПЕРИОДА(ИзмененныеДанные.Период, МЕСЯЦ)) КАК Период
			|	ИЗ
			|		ИзмененныеДанные КАК ИзмененныеДанные
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрацияЗемельныхУчастковНаНачало КАК РегистрацияЗемельныхУчастковНаНачало
			|			ПО (РегистрацияЗемельныхУчастковНаНачало.Организация = ИзмененныеДанные.Организация)
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ИзмененныеДанные.Организация
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ИзмененныеДанные.Организация,
			|		МИНИМУМ(НАЧАЛОПЕРИОДА(РегистрацияЗемельныхУчастков.Период, МЕСЯЦ))
			|	ИЗ
			|		ИзмененныеДанные КАК ИзмененныеДанные
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияЗемельныхУчастков КАК РегистрацияЗемельныхУчастков
			|			ПО (РегистрацияЗемельныхУчастков.Организация = ИзмененныеДанные.Организация)
			|				И (РегистрацияЗемельныхУчастков.Период >= НАЧАЛОПЕРИОДА(ИзмененныеДанные.Период, МЕСЯЦ))
			|				И (РегистрацияЗемельныхУчастков.ВключатьВНалоговуюБазу)
			|				" + ?(ЕстьОсновныеСредства, "И РегистрацияЗемельныхУчастков.ОсновноеСредство = ИзмененныеДанные.ОсновноеСредство", "") + "
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ИзмененныеДанные.Организация) КАК РегистрацияЗемельныхУчастков
			|
			|СГРУППИРОВАТЬ ПО
			|	РегистрацияЗемельныхУчастков.Организация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ИзмененныеДанные.Организация,
			|	ИзмененныеДанные.Документ,
			|	&Операция КАК Операция,
			|	МИНИМУМ(ВЫБОР 
			|				КОГДА НАЧАЛОПЕРИОДА(ИзмененныеДанные.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ПериодЗадания.Период, КВАРТАЛ)
			|					ТОГДА НАЧАЛОПЕРИОДА(ПериодЗадания.Период, КВАРТАЛ)
			|				КОГДА КОНЕЦПЕРИОДА(ПериодЗадания.Период, КВАРТАЛ) = КОНЕЦПЕРИОДА(ПериодЗадания.Период, ГОД)
			|					ТОГДА НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ПериодЗадания.Период, КВАРТАЛ), МЕСЯЦ)
			|				ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ПериодЗадания.Период, КВАРТАЛ), МЕСЯЦ), МЕСЯЦ, 1)
			|			КОНЕЦ) КАК Месяц
			|ИЗ
			|	ИзмененныеДанные КАК ИзмененныеДанные
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодЗадания КАК ПериодЗадания
			|		ПО (ПериодЗадания.Организация = ИзмененныеДанные.Организация)
			|
			|СГРУППИРОВАТЬ ПО
			|	ИзмененныеДанные.Организация,
			|	ИзмененныеДанные.Документ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ПериодЗадания
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ИзмененныеДанные";
	Иначе
		
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
			"ВЫБРАТЬ
			|	ИзмененныеДанные.Организация,
			|	ИзмененныеДанные.Документ,
			|	&Операция КАК Операция,
			|	МИНИМУМ(ВЫБОР 
			|				КОГДА НАЧАЛОПЕРИОДА(ИзмененныеДанные.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ИзмененныеДанные.Период, КВАРТАЛ)
			|					ТОГДА НАЧАЛОПЕРИОДА(ИзмененныеДанные.Период, КВАРТАЛ)
			|				КОГДА КОНЕЦПЕРИОДА(ИзмененныеДанные.Период, КВАРТАЛ) = КОНЕЦПЕРИОДА(ИзмененныеДанные.Период, ГОД)
			|					ТОГДА НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ИзмененныеДанные.Период, КВАРТАЛ), МЕСЯЦ)
			|				ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ИзмененныеДанные.Период, КВАРТАЛ), МЕСЯЦ), МЕСЯЦ, 1)
			|			КОНЕЦ) КАК Месяц
			|ИЗ
			|	ИзмененныеДанные КАК ИзмененныеДанные
			|
			|СГРУППИРОВАТЬ ПО
			|	ИзмененныеДанные.Организация,
			|	ИзмененныеДанные.Документ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ИзмененныеДанные";
			
	КонецЕсли; 
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ДанныеТаблиц.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНачалаВеденияРеглУчета", Константы.ДатаНачалаВеденияРеглУчета.Получить());
	Запрос.УстановитьПараметр("Операция", Перечисления.ОперацииЗакрытияМесяца.РасчетЗемельногоНалога);
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РегистрыСведений.ЗаданияКЗакрытиюМесяца.СоздатьЗаписиРегистраПоДаннымВыборки(РезультатЗапроса.Выбрать());
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Определяет необходимость расчета налога на имущество в указанном периоде.
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации - Организация для которой требуется определить необходимость расчета налога на имущество.
//  Период		 - Дата - Период в котором нужно проверить необходимость расчета.
// 
// Возвращаемое значение:
//  Булево - Истина, если требуется расчет налога на имущество.
//
Функция ТребуетсяРасчетНалогаНаИмущество(Организация, Период) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Организация КАК Ссылка,
	|	ВЫБОР
	|		КОГДА СпрУчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОСНО
	|ПОМЕСТИТЬ Организации
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчетныеПолитикиОрганизаций КАК СпрУчетнаяПолитика
	|		ПО Т.УчетнаяПолитика = СпрУчетнаяПолитика.Ссылка
	|			И (СпрУчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
	|				ИЛИ &НачалоПериода >= ДАТАВРЕМЯ(2015, 1, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	РегистрСведений.СостоянияОСОрганизаций.СрезПоследних(
	|			&НачалоПериода,
	|			Организация В
	|				(ВЫБРАТЬ
	|					Организации.Ссылка
	|				ИЗ
	|					Организации
	|				ГДЕ
	|					Организации.ОСНО)) КАК ПринятыеКУчету
	|ГДЕ
	|	ПринятыеКУчету.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОСБУ.СрезПоследних(
	|			&НачалоПериода,
	|			Организация В
	|				(ВЫБРАТЬ
	|					Организации.Ссылка
	|				ИЗ
	|					Организации
	|				ГДЕ
	|					Организации.ОСНО)) КАК ПринятыеКУчету
	|ГДЕ
	|	ПринятыеКУчету.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1
	|ИЗ
	|	РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.СрезПоследних(
	|			&НачалоПериода,
	|			Организация В
	|				(ВЫБРАТЬ
	|					Организации.Ссылка
	|				ИЗ
	|					Организации)) КАК СтавкиНалога
	|ГДЕ
	|	СтавкиНалога.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.НалоговаяБазаПоНалогуНаИмущество.КадастроваяСтоимость)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат НЕ Результат.Пустой();

КонецФункции

// Определяет необходимость расчета земельного налога в указанном периоде.
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации - Организация для которой требуется определить необходимость расчета земельного налога.
//  Период		 - Дата - Период в котором нужно проверить необходимость расчета.
// 
// Возвращаемое значение:
//  Булево - Истина, если требуется расчет земельного налога.
//
Функция ТребуетсяРасчетЗемельногоНалога(Организация, Период) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	РегистрСведений.РегистрацияЗемельныхУчастков.СрезПоследних(
	|			ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&НачалоПериода, ГОД), СЕКУНДА, -1),
	|			Организация = &Организация
	|				И ВключатьВНалоговуюБазу) КАК Регистрация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1
	|ИЗ
	|	РегистрСведений.РегистрацияЗемельныхУчастков КАК Регистрация
	|ГДЕ
	|	Регистрация.ВключатьВНалоговуюБазу
	|	И Регистрация.Период МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ГОД) И &ОкончаниеПериода
	|	И Регистрация.Организация = &Организация";

	Если Месяц(Период) <> 12 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ГОД", "КВАРТАЛ");
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат НЕ Результат.Пустой();
		
КонецФункции

// Определяет необходимость расчета транспортного налога в указанном периоде.
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации - Организация для которой требуется определить необходимость расчета транспортного налога.
//  Период		 - Дата - Период в котором нужно проверить необходимость расчета.
// 
// Возвращаемое значение:
//  Булево - Истина, если требуется расчет транспортного налога.
//
Функция ТребуетсяРасчетТранспортногоНалога(Организация, Период) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Организации.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Организации
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &Организация
	|	И Организации.ЮридическоеФизическоеЛицо <> ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	РегистрСведений.РегистрацияТранспортныхСредств.СрезПоследних(
	|			ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&НачалоПериода, ГОД), СЕКУНДА, -1),
	|			Организация В
	|					(ВЫБРАТЬ
	|						Организации.Ссылка
	|					ИЗ
	|						Организации)
	|				И ВключатьВНалоговуюБазу) КАК РегистрацияТC
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1
	|ИЗ
	|	РегистрСведений.РегистрацияТранспортныхСредств КАК РегистрацияТC
	|ГДЕ
	|	РегистрацияТC.ВключатьВНалоговуюБазу
	|	И РегистрацияТC.Период МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ГОД) И &ОкончаниеПериода
	|	И РегистрацияТC.Организация В
	|			(ВЫБРАТЬ
	|				Организации.Ссылка
	|			ИЗ
	|				Организации)";
	
	Если Месяц(Период) <> 12 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ГОД", "КВАРТАЛ");
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат НЕ Результат.Пустой();

КонецФункции

Процедура ПолучитьСостоянияОСОрганизацийДляФормированияЗаданийКЗакрытиюМесяца(ДанныеТаблиц, Регистратор) Экспорт

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СостоянияОСОрганизаций.Период КАК Период,
	|	СостоянияОСОрганизаций.Организация КАК Организация,
	|	СостоянияОСОрганизаций.Состояние КАК Состояние
	|ПОМЕСТИТЬ СостоянияОСОрганизаций
	|ИЗ
	|	РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОСОрганизаций
	|ГДЕ
	|	СостоянияОСОрганизаций.Регистратор = &Регистратор
	|	И СостоянияОСОрганизаций.Активность
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПорядокУчетаОСБУ.Период,
	|	ПорядокУчетаОСБУ.Организация,
	|	ПорядокУчетаОСБУ.Состояние
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОСБУ КАК ПорядокУчетаОСБУ
	|ГДЕ
	|	ПорядокУчетаОСБУ.Регистратор = &Регистратор
	|	И ПорядокУчетаОСБУ.Активность";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ДанныеТаблиц.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ТранспортныйНалог

Функция СформироватьСтуктуруСтавокНалогаНаТранспорт(Период) Экспорт 
	
	СтруктураСтавок = Новый Структура;			
	МакетСтавок = РегистрыСведений.РегистрацияТранспортныхСредств.ПолучитьМакет("СтавкиНалогаНаТранспорт");	
	
	СтруктураТаблицы = Новый ТаблицаЗначений;
	СтруктураТаблицы.Колонки.Добавить("НижнийПредел");
	СтруктураТаблицы.Колонки.Добавить("ВерхнийПредел");
	СтруктураТаблицы.Колонки.Добавить("БезОграничения");
	СтруктураТаблицы.Колонки.Добавить("СтавкаНалога");
	                              	
	Область = МакетСтавок.Области.Найти("Строка" + Период);
	Если Область <> Неопределено Тогда
		Для Ном = Область.Верх По Область.Низ Цикл
			Наименование  = СокрЛП(МакетСтавок.Область(Ном, 1).Текст);
			НижнийПредел  = СокрЛП(МакетСтавок.Область(Ном, 2).Текст);
			ВерхнийПредел = СокрЛП(МакетСтавок.Область(Ном, 3).Текст);
			СтавкаНалога  = СокрЛП(МакетСтавок.Область(Ном, 4).Текст);
			
			Если Не СтруктураСтавок.Свойство(Наименование) Тогда			
				СтруктураСтавок.Вставить(Наименование, СтруктураТаблицы.Скопировать());
			КонецЕсли;	
			
			Строка = СтруктураСтавок[Наименование].Добавить();
			Строка.БезОграничения = ВерхнийПредел = "*";
			Строка.НижнийПредел   = ?(Не НижнийПредел = "*", Число(НижнийПредел), 0);
			Строка.ВерхнийПредел  = ?(НЕ ВерхнийПредел = "*",Число(ВерхнийПредел), 999999);
			Строка.СтавкаНалога	  = Число(СтавкаНалога);
		КонецЦикла;
	Иначе
		СтруктураСтавок = Неопределено;
	КонецЕсли;
	
	Возврат СтруктураСтавок;
	
КонецФункции

Функция ПолучитьСтавкуНалогаНаТранспортДляОбъекта(ТаблицаСтавок, ЗначениеПоказателя = Неопределено, РассчитатьОтПревышения = 0, ОбъемПревышения = 0)  Экспорт
	
	Если ЗначениеПоказателя = Неопределено Тогда
		ЗначениеПоказателя  = 0;
	КонецЕсли;
	
	Если НЕ ТипЗнч(ТаблицаСтавок) = Тип("ТаблицаЗначений") Тогда	
		Возврат 0;
	КонецЕсли;	                       
	ТаблицаСтавок.Сортировать("НижнийПредел");
	Для Каждого СтрокаСтавок Из ТаблицаСтавок Цикл
		НижнийПредел   = СтрокаСтавок.НижнийПредел;
		ВерхнийПредел  = СтрокаСтавок.ВерхнийПредел;
		БезОграничения = СтрокаСтавок.БезОграничения;
		
		Если БезОграничения Тогда
			Если РассчитатьОтпревышения = 1 Тогда
				ОбъемПревышения = ЗначениеПоказателя - НижнийПредел;				
			КонецЕсли; 
			Возврат СтрокаСтавок.СтавкаНалога;
		КонецЕсли;
		
		Если (ЗначениеПоказателя > НижнийПредел) И
			 ((ЗначениеПоказателя <= ВерхнийПредел) Или БезОграничения) Тогда			
			 
			Если РассчитатьОтпревышения = 1 Тогда
				ОбъемПревышения = ЗначениеПоказателя - НижнийПредел;				
			КонецЕсли;      
			
			Возврат СтрокаСтавок.СтавкаНалога;
		КонецЕсли;	
	КонецЦикла;

	Возврат 0;
	
КонецФункции

Функция ПолучитьРазмерПревышенияПоОбъему(КодВидаТранспортногоСредства, ЗначениеХарактеристикиОбъекта, СтруктураСтавокНалога, Префикс = "") Экспорт
	
	Если ТипЗнч(КодВидаТранспортногоСредства) = Тип("ПеречислениеСсылка.ВидыТранспортныхСредств") 
		И КодВидаТранспортногоСредства = Перечисления.ВидыТранспортныхСредств.ЛегковойАвтомобиль Тогда
		
		ТаблицаСтавокНалога = Неопределено;	
		
		ПревышенияПоVЛегковых = "ПревышенияПоVЛегковых" + Префикс;
		Если СтруктураСтавокНалога.Свойство(ПревышенияПоVЛегковых, ТаблицаСтавокНалога) Тогда				 	
			ОбъемПревышения = 0;
			ПолучитьСтавкуНалогаНаТранспортДляОбъекта(ТаблицаСтавокНалога, ЗначениеХарактеристикиОбъекта, 1, ОбъемПревышения);
			Возврат ОбъемПревышения;
		КонецЕсли;					 							
	КонецЕсли;	
	
	Возврат 0;
	
КонецФункции

Функция РазностьДатВМесяцах(знач Дата1, Дата2) Экспорт
	
	КоличествоЛет     = Год(Дата2) - Год(Дата1);
	КоличествоМесяцев = Месяц(Дата2) - Месяц(Дата1);	
	// корректировка для случая Дата1 = 15 марта, Дата2 = 10 апреля. месяц еще не истек
	Если не Месяц(Дата2) = Месяц(Дата1) и
		День(Дата2) < День(Дата1)	ТОгда
		КоличествоМесяцев =  КоличествоМесяцев - 1;
	КонецЕсли;	                                              	
	РазностьВМесяцах = КоличествоЛет * 12 + КоличествоМесяцев;		
	
	Возврат РазностьВМесяцах;	                              	
	
КонецФункции

Функция ПолучитьРазмерКорректировки(КодВидаТранспортногоСредства, ЭксплуатацияВРКдо1апреля, ДатаВыпуска, СтруктураСтавокНалога, ДатаКонцаПериодаОтчета)	Экспорт
	
	ПоправочныйКоэффициент = 1;
	Если НЕ ТипЗнч(КодВидаТранспортногоСредства) = Тип("ПеречислениеСсылка.ВидыТранспортныхСредств")
		ИЛИ НЕ КодВидаТранспортногоСредства = Перечисления.ВидыТранспортныхСредств.ЛетательныйАппарат Тогда
		Возврат ПоправочныйКоэффициент;
	КонецЕсли;
	// 01 июля отчетного года
	ОтчетнаяДата = Дата(Год(ДатаКонцаПериодаОтчета), 07, 01) ;
	
	// - Коэффициенты (*К) - летательные аппараты
	Если КодВидаТранспортногоСредства = Перечисления.ВидыТранспортныхСредств.ЛетательныйАппарат 
		 и ДатаВыпуска <> Дата(1,1,1) ТОгда
		 
		 ТаблицаСтавокНалога = Неопределено;				  
		 Если ЭксплуатацияВРКдо1апреля = Ложь Тогда
		 	 Если СтруктураСтавокНалога.Свойство("КЛетательныеАппаратыПосле010499", ТаблицаСтавокНалога) Тогда				 	
				ПоправочныйКоэффициент = ПолучитьСтавкуНалогаНаТранспортДляОбъекта(ТаблицаСтавокНалога, РазностьДатВМесяцах(ДатаВыпуска, ОтчетнаяДата)/12) ;						
			 КонецЕсли;					 											
		 Иначе
			 Если СтруктураСтавокНалога.Свойство("КЛетательныеАппаратыДо010499", ТаблицаСтавокНалога) Тогда				 	
				ПоправочныйКоэффициент = ПолучитьСтавкуНалогаНаТранспортДляОбъекта(ТаблицаСтавокНалога, РазностьДатВМесяцах(ДатаВыпуска, ОтчетнаяДата)/12) ;						
			 КонецЕсли;					 											
		КонецЕсли;		
	КонецЕсли;
		
	Возврат ПоправочныйКоэффициент;
		
КонецФункции

// Возвращает результат расчета транспортного налога (или аванса по налогу)
//
// Параметры:
// 	Организация - СправочникСсылка.Организации - Организация, для которой необходимо выполнить расчет
// 	Период - Дата - Дата закрытия месяца
//
// Возвращаемое значение:
// 	ТаблицаРасчетТранспортногоНалога - ТаблицаЗначений - Результат расчета транспортного налога
//
Функция ПолучитьРасчетПоТранспортномуНалогуРК(Организация, ПериодРасчета) Экспорт
	
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "РегистрацияВНалоговомОргане");
	
	ГодовойРасчет = КонецМесяца(ПериодРасчета) = КонецГода(ПериодРасчета);
	
	ДатаНачалаПериодаОтчета = НачалоГода(ПериодРасчета);
	ДатаКонцаПериодаОтчета = ?(ГодовойРасчет, КонецГода(ПериодРасчета), ДобавитьМесяц(КонецГода(ПериодРасчета),-6));
	
	ТаблицаРасчетТранспортногоНалога = РасчетИмущественныхНалогов.ПустаяСправкаРасчет("РасчетТранспортногоНалога");
	ТаблицаРасходыНаПлатон = РасчетИмущественныхНалоговПереопределяемый.ПустаяТаблицаРасходыНаПлатон();
	
	ЭтоНеЮрЛицо = НЕ ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Организация);
	
	Если Месяц(ПериодРасчета)%6 <> 0 ИЛИ ЭтоНеЮрЛицо Тогда
		Возврат Новый Структура("Налог, Платон", ТаблицаРасчетТранспортногоНалога, ТаблицаРасходыНаПлатон);
    КонецЕсли;
	
	СтруктураСтавокНалога = СформироватьСтуктуруСтавокНалогаНаТранспорт(Строка(Формат(Год(ПериодРасчета), "ЧГ=0")));
	Если СтруктураСтавокНалога = Неопределено Тогда
		Возврат Новый Структура("Налог, Платон", ТаблицаРасчетТранспортногоНалога, ТаблицаРасходыНаПлатон); //возвращаем пустую таблицу
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодРасчета", ПериодРасчета);
	Запрос.УстановитьПараметр("ОсновнойНалоговыйОрган", РеквизитыОрганизации.РегистрацияВНалоговомОргане);
	
	ТекстОбъединяющегоЗапроса = "";
	
	Период = ДатаНачалаПериодаОтчета;
	
	Пока Период <= ДатаКонцаПериодаОтчета Цикл
		
		Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Период));
		Запрос.УстановитьПараметр("КонецИюня", КонецМесяца(Дата(Год(ПериодРасчета),6,30)));
		Запрос.УстановитьПараметр("ГодовойРасчет", ГодовойРасчет);
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегистрацияТранспортныхСредствСрезПоследних.Период КАК Период,
		|	РегистрацияТранспортныхСредствСрезПоследних.Организация КАК Организация,
		|	РегистрацияТранспортныхСредствСрезПоследних.ОсновноеСредство КАК ОсновноеСредство
		|ПОМЕСТИТЬ ВТ_ПериодРегистрацииТранспортныхСредств
		|ИЗ
		|	РегистрСведений.РегистрацияТранспортныхСредств.СрезПоследних(&КонецМесяца, Организация = &Организация) КАК РегистрацияТранспортныхСредствСрезПоследних
		|ГДЕ
		|	РегистрацияТранспортныхСредствСрезПоследних.ВключатьВНалоговуюБазу
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	ОсновноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ПериодРегистрацииТранспортныхСредств.Период КАК ДатаРегистрационныхДанных,
		|	ВТ_ПериодРегистрацииТранспортныхСредств.ОсновноеСредство КАК ОсновноеСредство,
		|	РегистрацияТранспортныхСредств.РегистрационныйЗнак КАК РегистрационныйЗнак,
		|	РегистрацияТранспортныхСредств.Марка КАК Марка,
		|	РегистрацияТранспортныхСредств.ИдентификационныйНомер КАК ИдентификационныйНомер,
		|	ВЫБОР
		|		КОГДА РегистрацияТранспортныхСредств.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
		|			ТОГДА РегистрацияТранспортныхСредств.НалоговыйОрган
		|		ИНАЧЕ &ОсновнойНалоговыйОрган
		|	КОНЕЦ КАК РегистрацияВНалоговомОргане,
		|	ВЫБОР
		|		КОГДА РегистрацияТранспортныхСредств.НалоговыйОрган = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
		|			ТОГДА ЕСТЬNULL(РегистрацияТранспортныхСредств.Организация.РегистрацияВНалоговомОргане.КодПоОКТМО, """")
		|		ИНАЧЕ РегистрацияТранспортныхСредств.КодПоОКТМО
		|	КОНЕЦ КАК КодПоОКТМО,
		|	РегистрацияТранспортныхСредств.КодВидаТранспортногоСредства КАК КодВидаТранспортногоСредства,
		|	РегистрацияТранспортныхСредств.НалоговаяБаза КАК НалоговаяБаза,
		|	РегистрацияТранспортныхСредств.ЕдиницаИзмеренияНалоговойБазы КАК ЕдиницаИзмеренияНалоговойБазы,
		|	РегистрацияТранспортныхСредств.НалоговаяСтавка КАК НалоговаяСтавка,
		|	РегистрацияТранспортныхСредств.НалоговаяЛьгота КАК НалоговаяЛьгота,
		|	РегистрацияТранспортныхСредств.КодНалоговойЛьготы КАК КодНалоговойЛьготы,
		|	РегистрацияТранспортныхСредств.РегиональныйКодЛьготы КАК РегиональныйКодЛьготы,
		|	РегистрацияТранспортныхСредств.ЛьготнаяСтавка КАК ЛьготнаяСтавка,
		|	РегистрацияТранспортныхСредств.ПроцентУменьшения КАК ПроцентУменьшения,
		|	РегистрацияТранспортныхСредств.СуммаУменьшения КАК СуммаУменьшения,
		|	РегистрацияТранспортныхСредств.ЭкологическийКласс КАК ЭкологическийКласс,
		|	ВЫБОР
		|		КОГДА РегистрацияТранспортныхСредств.ОбщаяСобственность
		|			ТОГДА РегистрацияТранспортныхСредств.ДоляВПравеОбщейСобственностиЧислитель
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ДоляВПравеОбщейСобственностиЧислитель,
		|	ВЫБОР
		|		КОГДА РегистрацияТранспортныхСредств.ОбщаяСобственность
		|			ТОГДА РегистрацияТранспортныхСредств.ДоляВПравеОбщейСобственностиЗнаменатель
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ДоляВПравеОбщейСобственностиЗнаменатель,
		|	РегистрацияТранспортныхСредств.ПовышающийКоэффициент КАК ПовышающийКоэффициент,
		|	РегистрацияТранспортныхСредств.НалоговаяСтавкаЗависитОтГодаВыпускаТС КАК НалоговаяСтавкаЗависитОтГодаВыпускаТС,
		|	РегистрацияТранспортныхСредств.ЭксплуатацияВРКдо1апреля1999г КАК ЭксплуатацияВРКдо1апреля1999г,
		|	РегистрацияТранспортныхСредств.СтранаПроизводитель КАК СтранаПроизводитель,
		|	РегистрацияТранспортныхСредств.ДатаВвозаНаТерриториюРК КАК ДатаВвозаНаТерриториюРК,
		|	ВЫБОР 
		|		КОГДА &ГодовойРасчет 
		|			ТОГДА 1 
		|		ИНАЧЕ 
		|			ВЫБОР 
		|				КОГДА &КонецМесяца = &КонецИюня 
		|					ТОГДА 7
		|				ИНАЧЕ 1
		|		    КОНЕЦ
		|	КОНЕЦ КАК КоличествоМесяцев
		|ПОМЕСТИТЬ РегистрацияТранспортныхСредств
		|ИЗ
		|	ВТ_ПериодРегистрацииТранспортныхСредств КАК ВТ_ПериодРегистрацииТранспортныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
		|		ПО ВТ_ПериодРегистрацииТранспортныхСредств.Период = РегистрацияТранспортныхСредств.Период
		|			И ВТ_ПериодРегистрацииТранспортныхСредств.Организация = РегистрацияТранспортныхСредств.Организация
		|			И ВТ_ПериодРегистрацииТранспортныхСредств.ОсновноеСредство = РегистрацияТранспортныхСредств.ОсновноеСредство";
		
		Подстрока = "ПОМЕСТИТЬ РегистрацияТранспортныхСредств";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, Подстрока, Подстрока + Формат(Период, "ДФ=MM"));
		
		Запрос.Выполнить();
		
		ТекстОбъединяющегоЗапроса = ТекстОбъединяющегоЗапроса
								  + ?(ПустаяСтрока(ТекстОбъединяющегоЗапроса), 
									  "ВЫБРАТЬ РАЗРЕШЕННЫЕ *
		                              |",
									  "ОБЪЕДИНИТЬ ВСЕ
									  |ВЫБРАТЬ *
		                              |")
								  + ?(ПустаяСтрока(ТекстОбъединяющегоЗапроса), 
									  "ПОМЕСТИТЬ РегистрацияТранспортныхСредств
									  |",
									  "")
								  + "ИЗ РегистрацияТранспортныхСредств" + Формат(Период, "ДФ=MM") + "
									|";
									
		Запрос.Текст = 
		"УНИЧТОЖИТЬ ВТ_ПериодРегистрацииТранспортныхСредств";
		Запрос.Выполнить();
		
		Период = ДобавитьМесяц(Период, 1);
		
	КонецЦикла;
	
	Запрос.Текст = ТекстОбъединяющегоЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	РасчетИмущественныхНалогов.СоздатьНалоговыеОрганыСУстановленнойУплатойАвансов(
		Запрос.МенеджерВременныхТаблиц, Организация, ПериодРасчета, "ТранспортныйНалог");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрацияТранспортныхСредств.Период КАК Период,
	|	РегистрацияТранспортныхСредств.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ ВТ_Регистрации
	|ИЗ
	|	РегистрСведений.РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
	|ГДЕ
	|	РегистрацияТранспортныхСредств.Организация = &Организация
	|	И РегистрацияТранспортныхСредств.Период <= &ПериодРасчета
	|	И РегистрацияТранспортныхСредств.ВидЗаписи = ЗНАЧЕНИЕ(Перечисление.ВидЗаписиОРегистрации.Регистрация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрацияТранспортныхСредств.Период КАК Период,
	|	РегистрацияТранспортныхСредств.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ ВТ_Снятия
	|ИЗ
	|	РегистрСведений.РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
	|ГДЕ
	|	РегистрацияТранспортныхСредств.Организация = &Организация
	|	И РегистрацияТранспортныхСредств.Период <= &ПериодРасчета
	|	И РегистрацияТранспортныхСредств.ВидЗаписи = ЗНАЧЕНИЕ(Перечисление.ВидЗаписиОРегистрации.СнятиеСРегистрационногоУчета)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Регистрации.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_Регистрации.Период КАК Период,
	|	МАКСИМУМ(ЕСТЬNULL(ВТ_Снятия.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК ПериодПредыдущегоСнятия
	|ПОМЕСТИТЬ ВТ_ПредыдущиеСнятия
	|ИЗ
	|	ВТ_Регистрации КАК ВТ_Регистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Снятия КАК ВТ_Снятия
	|		ПО ВТ_Регистрации.ОсновноеСредство = ВТ_Снятия.ОсновноеСредство
	|			И ВТ_Регистрации.Период > ВТ_Снятия.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Регистрации.ОсновноеСредство,
	|	ВТ_Регистрации.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПредыдущиеСнятия.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_ПредыдущиеСнятия.Период КАК Период,
	|	МИНИМУМ(ВТ_Регистрации.Период) КАК ПериодПервоначальнойРегистрации
	|ПОМЕСТИТЬ ВТ_ПервоначальныеРегистрации
	|ИЗ
	|	ВТ_ПредыдущиеСнятия КАК ВТ_ПредыдущиеСнятия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Регистрации КАК ВТ_Регистрации
	|		ПО ВТ_ПредыдущиеСнятия.ОсновноеСредство = ВТ_Регистрации.ОсновноеСредство
	|			И ВТ_ПредыдущиеСнятия.ПериодПредыдущегоСнятия < ВТ_Регистрации.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПредыдущиеСнятия.ОсновноеСредство,
	|	ВТ_ПредыдущиеСнятия.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Регистрации.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_Регистрации.Период КАК Период,
	|	МИНИМУМ(ЕСТЬNULL(ВТ_Снятия.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК ПериодСнятияСУчета
	|ПОМЕСТИТЬ ВТ_СнятияСУчета
	|ИЗ
	|	ВТ_Регистрации КАК ВТ_Регистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Снятия КАК ВТ_Снятия
	|		ПО ВТ_Регистрации.ОсновноеСредство = ВТ_Снятия.ОсновноеСредство
	|			И ВТ_Регистрации.Период < ВТ_Снятия.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Регистрации.ОсновноеСредство,
	|	ВТ_Регистрации.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Регистрации.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_Регистрации.Период КАК Период,
	|	МАКСИМУМ(ВТ_ПервоначальныеРегистрации.ПериодПервоначальнойРегистрации) КАК ПериодПервоначальнойРегистрации,
	|	МАКСИМУМ(ВТ_СнятияСУчета.ПериодСнятияСУчета) КАК ПериодСнятияСУчета
	|ПОМЕСТИТЬ ВТ_ДатыПостановкиИСнятия
	|ИЗ
	|	ВТ_Регистрации КАК ВТ_Регистрации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПервоначальныеРегистрации КАК ВТ_ПервоначальныеРегистрации
	|		ПО ВТ_Регистрации.ОсновноеСредство = ВТ_ПервоначальныеРегистрации.ОсновноеСредство
	|			И ВТ_Регистрации.Период = ВТ_ПервоначальныеРегистрации.Период
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СнятияСУчета КАК ВТ_СнятияСУчета
	|		ПО ВТ_Регистрации.ОсновноеСредство = ВТ_СнятияСУчета.ОсновноеСредство
	|			И ВТ_Регистрации.Период = ВТ_СнятияСУчета.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Регистрации.ОсновноеСредство,
	|	ВТ_Регистрации.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(РегистрацияТранспортныхСредств.ДатаРегистрационныхДанных) КАК ДатаРегистрационныхДанных,
	|	СУММА(РегистрацияТранспортныхСредств.КоличествоМесяцев) КАК КоличествоМесяцевВладения,
	|	РегистрацияТранспортныхСредств.ОсновноеСредство КАК ОсновноеСредство,
	|	РегистрацияТранспортныхСредств.РегистрационныйЗнак,
	|	РегистрацияТранспортныхСредств.Марка,
	|	РегистрацияТранспортныхСредств.ИдентификационныйНомер,
	|	РегистрацияТранспортныхСредств.РегистрацияВНалоговомОргане КАК ИФНС,
	|	РегистрацияТранспортныхСредств.КодПоОКТМО КАК КодПоОКТМО,
	|	РегистрацияТранспортныхСредств.КодВидаТранспортногоСредства,
	|	РегистрацияТранспортныхСредств.НалоговаяБаза,
	|	РегистрацияТранспортныхСредств.ЕдиницаИзмеренияНалоговойБазы КАК ЕдиницаИзмерения,
	|	РегистрацияТранспортныхСредств.НалоговаяСтавка,
	|	РегистрацияТранспортныхСредств.НалоговаяЛьгота,
	|	РегистрацияТранспортныхСредств.КодНалоговойЛьготы,
	|	РегистрацияТранспортныхСредств.РегиональныйКодЛьготы,
	|	РегистрацияТранспортныхСредств.ЛьготнаяСтавка,
	|	РегистрацияТранспортныхСредств.ПроцентУменьшения,
	|	РегистрацияТранспортныхСредств.СуммаУменьшения,
	|	РегистрацияТранспортныхСредств.ЭкологическийКласс,
	|	РегистрацияТранспортныхСредств.ДоляВПравеОбщейСобственностиЧислитель,
	|	РегистрацияТранспортныхСредств.ДоляВПравеОбщейСобственностиЗнаменатель,
	|	РегистрацияТранспортныхСредств.ПовышающийКоэффициент,
	|	РегистрацияТранспортныхСредств.НалоговаяСтавкаЗависитОтГодаВыпускаТС,
	|	ВЫБОР
	|		КОГДА ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов.НалоговыйОрган ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УплачиваютсяАвансы,
	|	РегистрацияТранспортныхСредств.ЭксплуатацияВРКдо1апреля1999г,
	|	РегистрацияТранспортныхСредств.СтранаПроизводитель,
	|	РегистрацияТранспортныхСредств.ДатаВвозаНаТерриториюРК,
	|	ОсновныеСредства.ДатаВыпуска,
	|	ВТ_ДатыПостановкиИСнятия.ПериодПервоначальнойРегистрации КАК ДатаРегистрации,
	|	ВТ_ДатыПостановкиИСнятия.ПериодСнятияСУчета КАК ДатаПрекращенияРегистрации
	|ИЗ
	|	РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов КАК ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов
	|		ПО РегистрацияТранспортныхСредств.РегистрацияВНалоговомОргане = ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов.НалоговыйОрган
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыЭксплуатации КАК ОсновныеСредства
	|		ПО РегистрацияТранспортныхСредств.ОсновноеСредство = ОсновныеСредства.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыПостановкиИСнятия КАК ВТ_ДатыПостановкиИСнятия
	|		ПО РегистрацияТранспортныхСредств.ОсновноеСредство = ВТ_ДатыПостановкиИСнятия.ОсновноеСредство
	|			И РегистрацияТранспортныхСредств.ДатаРегистрационныхДанных = ВТ_ДатыПостановкиИСнятия.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	РегистрацияТранспортныхСредств.ОсновноеСредство,
	|	РегистрацияТранспортныхСредств.РегистрационныйЗнак,
	|	РегистрацияТранспортныхСредств.Марка,
	|	РегистрацияТранспортныхСредств.ИдентификационныйНомер,
	|	РегистрацияТранспортныхСредств.РегистрацияВНалоговомОргане,
	|	РегистрацияТранспортныхСредств.КодПоОКТМО,
	|	РегистрацияТранспортныхСредств.КодВидаТранспортногоСредства,
	|	РегистрацияТранспортныхСредств.НалоговаяБаза,
	|	РегистрацияТранспортныхСредств.ЕдиницаИзмеренияНалоговойБазы,
	|	РегистрацияТранспортныхСредств.НалоговаяСтавка,
	|	РегистрацияТранспортныхСредств.НалоговаяЛьгота,
	|	РегистрацияТранспортныхСредств.КодНалоговойЛьготы,
	|	РегистрацияТранспортныхСредств.РегиональныйКодЛьготы,
	|	РегистрацияТранспортныхСредств.ЛьготнаяСтавка,
	|	РегистрацияТранспортныхСредств.ПроцентУменьшения,
	|	РегистрацияТранспортныхСредств.СуммаУменьшения,
	|	РегистрацияТранспортныхСредств.ЭкологическийКласс,
	|	РегистрацияТранспортныхСредств.ДоляВПравеОбщейСобственностиЧислитель,
	|	РегистрацияТранспортныхСредств.ДоляВПравеОбщейСобственностиЗнаменатель,
	|	РегистрацияТранспортныхСредств.ПовышающийКоэффициент,
	|	РегистрацияТранспортныхСредств.НалоговаяСтавкаЗависитОтГодаВыпускаТС,
	|	РегистрацияТранспортныхСредств.ЭксплуатацияВРКдо1апреля1999г,
	|	РегистрацияТранспортныхСредств.СтранаПроизводитель,
	|	РегистрацияТранспортныхСредств.ДатаВвозаНаТерриториюРК,
	|	ВЫБОР
	|		КОГДА ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов.НалоговыйОрган ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ОсновныеСредства.ДатаВыпуска,
	|	ВТ_ДатыПостановкиИСнятия.ПериодПервоначальнойРегистрации,
	|	ВТ_ДатыПостановкиИСнятия.ПериодСнятияСУчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИФНС,
	|	КодПоОКТМО,
	|	ОсновноеСредство";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		РасчетТранспортногоНалога = Результат.Выгрузить();
		
		МРП = РегистрыСведений.МесячныйРасчетныйПоказатель.ПолучитьПоследнее(ДатаНачалаПериодаОтчета);
		ВеличинаМРП = ?(МРП = Неопределено, 0, МРП.Размер);
		
		Если ГодовойРасчет Тогда
			
			РасчетНалога2Кв = ТаблицаРасчетТранспортногоНалога.СкопироватьКолонки();
			
			Отбор = Новый Структура("ИФНС, КодПоОКТМО, ОсновноеСредство, ДатаРегистрационныхДанных");
			
			НайденнаяСтрока = РасчетТранспортногоНалога.Найти(Истина, "УплачиваютсяАвансы");
			Если НайденнаяСтрока <> Неопределено Тогда
				РасчетНалога2Кв = ПолучитьРасчетПоТранспортномуНалогуРК(Организация, Дата(Год(ПериодРасчета), 06, 30)).Налог;
			КонецЕсли;
			
		КонецЕсли;
		
		Для Каждого СтрокаРасчета Из РасчетТранспортногоНалога Цикл
			
			Если НЕ ГодовойРасчет И НЕ СтрокаРасчета.УплачиваютсяАвансы Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не СтрокаРасчета.КодВидаТранспортногоСредства = Null И Не СтрокаРасчета.КодВидаТранспортногоСредства.Пустая() Тогда
				
				Если СтрокаРасчета.ДоляВПравеОбщейСобственностиЧислитель <> 0 И СтрокаРасчета.ДоляВПравеОбщейСобственностиЗнаменатель <> 0 Тогда
					ДоляВПравеОбщейСобственности = 
						Мин(1, СтрокаРасчета.ДоляВПравеОбщейСобственностиЧислитель / СтрокаРасчета.ДоляВПравеОбщейСобственностиЗнаменатель);
				Иначе
					ДоляВПравеОбщейСобственности = 1;
				КонецЕсли;
				
				НоваяСтрока = ТаблицаРасчетТранспортногоНалога.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасчета);
					
				// Базовая ставка Налога
				ТаблицаСтавокНалога = Неопределено;				 
				СуммаНалога 		= 0;
				СтавкаНалога 		= 0;
				Префикс 			= "";
				
				МетаданныеЗначенияПеречисления = Метаданные.Перечисления["ВидыТранспортныхСредств"].ЗначенияПеречисления[Перечисления.ВидыТранспортныхСредств.Индекс(СтрокаРасчета.КодВидаТранспортногоСредства)];
				ВидТранспортногоСредстваСтрока = СокрЛП(МетаданныеЗначенияПеречисления.Имя);
				
				Если СтрокаРасчета.КодВидаТранспортногоСредства = Перечисления.ВидыТранспортныхСредств.Мотоцикл Тогда				
					// У мотоцикла мощность в лошадиных силах и мощность в киловаттах хранится в ресурсе МощностьВКиловаттах.				
					Если СтрокаРасчета.ЕдиницаИзмерения = "251" Тогда // Лошадиные силы
						ВидТранспортногоСредстваДляШкалыНалога = "МотоциклЛошадиныеСилы";		
					Иначе
						ВидТранспортногоСредстваДляШкалыНалога = "МотоциклКиловатты";
					КонецЕсли;
					
					Если НЕ СтруктураСтавокНалога.Свойство(ВидТранспортногоСредстваДляШкалыНалога) Тогда
						ВидТранспортногоСредстваДляШкалыНалога = ВидТранспортногоСредстваСтрока;
					КонецЕсли;
				
				Иначе
					ВидТранспортногоСредстваДляШкалыНалога = ВидТранспортногоСредстваСтрока;	
				КонецЕсли;  				
				
				// Для легковых автомобилей применяется разная шкала в зависимости от даты и места производства
				Если СтрокаРасчета.КодВидаТранспортногоСредства = Перечисления.ВидыТранспортныхСредств.ЛегковойАвтомобиль Тогда 
					// Для легковых автомобилей с объемом двигателя свыше 3000 кубических сантиметров,
					// произведенных (изготовленных или собранных) в Республике Казахстан после 31 декабря 2013 года
					// или ввезенных на территорию Республики Казахстан после 31 декабря 2013 года, исчисление налога
					// производится по следующим ставкам, установленным в месячных расчетных показателях...
					// см. п. 1. ст. 367 НК РК
					Если СтрокаРасчета.СтранаПроизводитель = Справочники.СтраныМира.Казахстан Или СтрокаРасчета.СтранаПроизводитель.Код = "398" Тогда
						// анализируется дата выпуска
						Если СтрокаРасчета.ДатаВыпуска >= Дата(2014,1,1) Тогда
							Префикс = "После2013";
						Иначе
							Префикс = "До2013";
						КонецЕсли;       					
					Иначе
						// анализируется дата ввоза в РК
						Если СтрокаРасчета.ДатаВвозаНаТерриториюРК >= Дата(2014,1,1) Тогда
							Префикс = "После2013";
						Иначе
							Префикс = "До2013";
						КонецЕсли;       										
					КонецЕсли;
						
					ВидТранспортногоСредстваДляШкалыНалога = ВидТранспортногоСредстваСтрока + Префикс;
				КонецЕсли;
				
				Если СтруктураСтавокНалога.Свойство(ВидТранспортногоСредстваДляШкалыНалога, ТаблицаСтавокНалога) Тогда				 	
					СтавкаНалога = ПолучитьСтавкуНалогаНаТранспортДляОбъекта(ТаблицаСтавокНалога, СтрокаРасчета.НалоговаяБаза);
					
					НоваяСтрока.НалоговаяСтавка = СтавкаНалога;
					
					Если СтрокаРасчета.КодВидаТранспортногоСредства = Перечисления.ВидыТранспортныхСредств.ЛетательныйАппарат
						Или СтрокаРасчета.КодВидаТранспортногоСредства = Перечисления.ВидыТранспортныхСредств.ЖелезнодорожныйТяговыйПодвижнойСостав
						Или СтрокаРасчета.КодВидаТранспортногоСредства = Перечисления.ВидыТранспортныхСредств.МотороВагонныйПодвижнойСостав Тогда
						СуммаНалога = СтавкаНалога * СтрокаРасчета.НалоговаяБаза * ВеличинаМРП;
					Иначе
						СуммаНалога = СтавкаНалога * ВеличинаМРП;						 
					КонецЕсли;
					
				КонецЕсли;
				
				// Для легковых автомобилей рассчитываем размер превышения
				СуммаПревышения = 0;
				Если СтрокаРасчета.КодВидаТранспортногоСредства = Перечисления.ВидыТранспортныхСредств.ЛегковойАвтомобиль Тогда
					
					РазмерПревышения = ПолучитьРазмерПревышенияПоОбъему(СтрокаРасчета.КодВидаТранспортногоСредства, СтрокаРасчета.НалоговаяБаза, СтруктураСтавокНалога, Префикс);
					СуммаПревышения = РазмерПревышения*7;						
					
				КонецЕсли;
				
				ОбщаяСуммаНалога = СуммаНалога + СуммаПревышения;
				РазмерКорректировки = ПолучитьРазмерКорректировки(СтрокаРасчета.КодВидаТранспортногоСредства, СтрокаРасчета.ЭксплуатацияВРКдо1апреля1999г, СтрокаРасчета.ДатаВыпуска, СтруктураСтавокНалога, ДатаКонцаПериодаОтчета);
				
				СуммаСУчетомКорректировки = ОбщаяСуммаНалога * РазмерКорректировки;
					
				ОбщаяСуммаНалога = Окр(СуммаСУчетомКорректировки * СтрокаРасчета.КоличествоМесяцевВладения/12,0);
							
				НоваяСтрока.СуммаНалога = ОбщаяСуммаНалога * ДоляВПравеОбщейСобственности;
				НоваяСтрока.СуммаНалогаКУплате = НоваяСтрока.СуммаНалога;
				
				Если ГодовойРасчет И СтрокаРасчета.УплачиваютсяАвансы Тогда
					
					ЗаполнитьЗначенияСвойств(Отбор, НоваяСтрока);
					
					НоваяСтрока.СуммаАвансовыхПлатежей2Кв = 0;
					СтрокиРасчетаАвансовыхПлатежей = РасчетНалога2Кв.НайтиСтроки(Отбор);
					Для Каждого СтрокаРасчетаАвансовыхПлатежей Из СтрокиРасчетаАвансовыхПлатежей Цикл
						НоваяСтрока.СуммаАвансовыхПлатежей2Кв = НоваяСтрока.СуммаАвансовыхПлатежей2Кв
							+ СтрокаРасчетаАвансовыхПлатежей.СуммаНалогаКУплате;
					КонецЦикла;
					НоваяСтрока.СуммаНалогаКУплате = НоваяСтрока.СуммаНалогаКУплате - НоваяСтрока.СуммаАвансовыхПлатежей2Кв;
					
				КонецЕсли;

				Если НЕ ГодовойРасчет Тогда
					НоваяСтрока["СуммаАвансовыхПлатежей" + Формат(ПериодРасчета, "ДФ='q''Кв'''")] = НоваяСтрока.СуммаНалогаКУплате;
				КонецЕсли;
				
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаРасчетТранспортногоНалога.ЗаполнитьЗначения(ДатаКонцаПериодаОтчета, "ПериодРасчета");
	ТаблицаРасчетТранспортногоНалога.ЗаполнитьЗначения(Организация, "Организация");
	
	ТаблицаРасходыНаПлатон = РасчетИмущественныхНалоговПереопределяемый.ПолучитьРасходыНаПлатон(
		Организация, ПериодРасчета, ТаблицаРасчетТранспортногоНалога);
	
	Возврат Новый Структура("Налог, Платон", ТаблицаРасчетТранспортногоНалога, ТаблицаРасходыНаПлатон);

КонецФункции

#КонецОбласти

#Область ЗемельныйНалог

// Возвращает дату начала отчетного периода, исходя из номера отчетного квартала
//
// Параметры:
//  ПериодРасчета - Дата - период расчета текущего платежа по налогу
//
// Возвращаемое значение:
//  ДатаНачала - Дата - дата начала периода расчета текущего платежа
//
Функция ПолучитьДатуНачала(ПериодРасчета)
	// первый квартал
	Если Месяц(НачалоКвартала(ПериодРасчета)) = 1 Тогда
		ДатаНачала = НачалоКвартала(ПериодРасчета);
	КонецЕсли;
	// второй квартал
	Если Месяц(НачалоКвартала(ПериодРасчета)) = 4 Тогда
		ДатаНачала = Дата(Год(ПериодРасчета),2,1);
	КонецЕсли;
	// третий квартал
	Если Месяц(НачалоКвартала(ПериодРасчета)) = 7 Тогда
		ДатаНачала = Дата(Год(ПериодРасчета),5,1);
	КонецЕсли;
	// четвертый квартал
	Если Месяц(НачалоКвартала(ПериодРасчета)) = 10 Тогда
		ДатаНачала = Дата(Год(ПериодРасчета),8,1);
	КонецЕсли;
	
	Возврат ДатаНачала;
	
КонецФункции // ПолучитьДатуНачала

// Возвращает дату окончания отчетного периода, исходя из номера отчетного квартала
//
// Параметры:
//  ПериодРасчета - Дата, период расчета текущего платежа по налогу
//
// Возвращаемое значение:
//  ДатаОкончания - Дата - дата начала периода расчета текущего платежа
//
Функция ПолучитьДатуОкончания(ПериодРасчета)
	
	ДатаОкончания = КонецМесяца(ПериодРасчета);
	
	Возврат ДатаОкончания;
	
КонецФункции // ПолучитьДатуОкончания

// Возвращает расчет земельного налога за квартал
//
// Параметры:
//  Организация - СправочникСсылка.Организации - организация, по которому нужно получить расчет
//  ПериодРасчета - Дата - период, для которого нужно получить расчет (конец января, апреля, июля, октярбя и декабря)
//
// Возвращаемое значение:
//  ТаблицаРасчета - ТаблицаЗначений - таблица, содержащая данные по расчету за указанный квартал
//
Функция ПолучитьРасчетЗемельногоНалогаЗаКвартал(Организация, ПериодРасчета)

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасчетЗемельногоНалога.ПериодРасчета,
	               |	РасчетЗемельногоНалога.Организация,
	               |	РасчетЗемельногоНалога.ИФНС,
	               |	РасчетЗемельногоНалога.ОсновноеСредство,
				   |	РасчетЗемельногоНалога.СуммаАвансовыхПлатежей1Кв,
				   |	РасчетЗемельногоНалога.СуммаАвансовыхПлатежей2Кв,
				   |	РасчетЗемельногоНалога.СуммаАвансовыхПлатежей3Кв,
				   |	РасчетЗемельногоНалога.СуммаАвансовыхПлатежей4Кв,
	               |	РасчетЗемельногоНалога.СуммаИзмененияНалога
	               |ИЗ
	               |	РегистрСведений.РасчетЗемельногоНалога КАК РасчетЗемельногоНалога
	               |ГДЕ
	               |	РасчетЗемельногоНалога.Организация = &Организация
	               |	И РасчетЗемельногоНалога.ПериодРасчета = &ПериодРасчета";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодРасчета", ПериодРасчета);
	
	ТаблицаРасчета = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРасчета;
	
КонецФункции
 
// Возвращает результат расчета земельного налога (или аванса по налогу)
//
// Параметры:
// 	Организация - СправочникСсылка.Организации - Организация, для которой необходимо выполнить расчет
// 	Период - Дата - Дата закрытия месяца
//
// Возвращаемое значение:
// 	ТаблицаРасчетНалога - ТаблицаЗначений - Результат расчета земельного налога
//
Функция ПолучитьРасчетПоЗемельномуНалогуРК(Организация, ПериодРасчета) Экспорт
	
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "РегистрацияВНалоговомОргане");
	
	ГодовойРасчет = КонецМесяца(ПериодРасчета) = КонецГода(ПериодРасчета);
	
	ДатаНачалаПериодаОтчета = ?(ГодовойРасчет,	НачалоГода(ПериодРасчета),	ПолучитьДатуНачала(ПериодРасчета));
	ДатаКонцаПериодаОтчета = ?(ГодовойРасчет, КонецГода(ПериодРасчета), ПолучитьДатуОкончания(ПериодРасчета));
		
	ТаблицаРасчетНалога = РасчетИмущественныхНалогов.ПустаяСправкаРасчет("РасчетЗемельногоНалога");
	
	ЭтоНеЮрЛицо = НЕ ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Организация);
	
	Если Не (Месяц(ПериодРасчета) = 1 ИЛИ Месяц(ПериодРасчета) = 4 Или Месяц(ПериодРасчета) = 7 Или Месяц(ПериодРасчета) = 10 Или Месяц(ПериодРасчета) = 12)
		Или ЭтоНеЮрЛицо Тогда
		
		Возврат ТаблицаРасчетНалога;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаКонцаПериодаОтчета", ДатаКонцаПериодаОтчета);
	Запрос.УстановитьПараметр("ОсновнойНалоговыйОрган", РеквизитыОрганизации.РегистрацияВНалоговомОргане);
	Запрос.УстановитьПараметр("Период", КонецГода(ПериодРасчета));
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(ПериодРасчета));
	Запрос.УстановитьПараметр("ГраницаНачалоГода", Новый Граница(НачалоГода(ПериодРасчета), ВидГраницы.Исключая));
		
	Период = ДатаНачалаПериодаОтчета;
	
	ТекстОбъединяющегоЗапроса = "";
	
	Пока Период <= ДатаКонцаПериодаОтчета Цикл
		
		Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Период));
		Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Период));
		Запрос.УстановитьПараметр("ГраницаНачалоМесяца", Новый Граница(НачалоМесяца(Период), ВидГраницы.Исключая));
		
		Если Не ГодовойРасчет Тогда
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	РегистрацияЗемельныхУчастковСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
						   |	ВЫБОР
						   |		КОГДА РегистрацияЗемельныхУчастковСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
						   |			ТОГДА РегистрацияЗемельныхУчастковСрезПоследних.НалоговыйОрган
						   |		ИНАЧЕ &ОсновнойНалоговыйОрган
						   |	КОНЕЦ КАК ИФНС
			               |ПОМЕСТИТЬ ВТ_ВладениеЗемельнымиУчасткамиНачалоПериода
			               |ИЗ
			               |	РегистрСведений.РегистрацияЗемельныхУчастков.СрезПоследних(&ГраницаНачалоМесяца, Организация = &Организация) КАК РегистрацияЗемельныхУчастковСрезПоследних
			               |ГДЕ
			               |	РегистрацияЗемельныхУчастковСрезПоследних.ВключатьВНалоговуюБазу
			               |
			               |ИНДЕКСИРОВАТЬ ПО
			               |	ОсновноеСредство,
						   |	ИФНС
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	РегистрацияЗемельныхУчастковСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
			               |	РегистрацияЗемельныхУчастковСрезПоследних.Организация КАК Организация,
			               |	РегистрацияЗемельныхУчастковСрезПоследних.Период КАК Период,
						   |	ВЫБОР
						   |		КОГДА РегистрацияЗемельныхУчастковСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
						   |			ТОГДА РегистрацияЗемельныхУчастковСрезПоследних.НалоговыйОрган
						   |		ИНАЧЕ &ОсновнойНалоговыйОрган
						   |	КОНЕЦ КАК ИФНС,
						   |	ВладениеЗемельнымиУчасткамиНачалоПериода.ИФНС КАК ИФНССтарый,
			               |	ВЫБОР
			               |		КОГДА РегистрацияЗемельныхУчастковСрезПоследних.ВключатьВНалоговуюБазу
			               |			ТОГДА ВЫБОР
			               |					КОГДА ВладениеЗемельнымиУчасткамиНачалоПериода.ОсновноеСредство ЕСТЬ NULL 
			               |						ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(РегистрацияЗемельныхУчастковСрезПоследних.Период, МЕСЯЦ), ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(РегистрацияЗемельныхУчастковСрезПоследних.Период, ГОД), СЕКУНДА, 1), МЕСЯЦ)
						   |					КОГДА 
						   |						(ВЫБОР
						   |							КОГДА РегистрацияЗемельныхУчастковСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
						   |								ТОГДА РегистрацияЗемельныхУчастковСрезПоследних.НалоговыйОрган
						   |							ИНАЧЕ &ОсновнойНалоговыйОрган
						   |						КОНЕЦ) <> ВладениеЗемельнымиУчасткамиНачалоПериода.ИФНС
						   |						ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(РегистрацияЗемельныхУчастковСрезПоследних.Период, МЕСЯЦ), ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(РегистрацияЗемельныхУчастковСрезПоследних.Период, ГОД), СЕКУНДА, 1), МЕСЯЦ)
			               |					ИНАЧЕ 0
			               |				КОНЕЦ
			               |		ИНАЧЕ ВЫБОР
			               |				КОГДА НЕ ВладениеЗемельнымиУчасткамиНачалоПериода.ОсновноеСредство ЕСТЬ NULL 
			               |					ТОГДА -РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(РегистрацияЗемельныхУчастковСрезПоследних.Период, МЕСЯЦ), ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(РегистрацияЗемельныхУчастковСрезПоследних.Период, ГОД), СЕКУНДА, 1), МЕСЯЦ)
			               |				ИНАЧЕ 0
			               |			КОНЕЦ
			               |	КОНЕЦ КАК КоличествоМесяцев
			               |ПОМЕСТИТЬ ВТ_ВладениеЗемельнымиУчастками
			               |ИЗ
			               |	РегистрСведений.РегистрацияЗемельныхУчастков.СрезПоследних(&КонецМесяца, Организация = &Организация) КАК РегистрацияЗемельныхУчастковСрезПоследних
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВладениеЗемельнымиУчасткамиНачалоПериода КАК ВладениеЗемельнымиУчасткамиНачалоПериода
			               |		ПО РегистрацияЗемельныхУчастковСрезПоследних.ОсновноеСредство = ВладениеЗемельнымиУчасткамиНачалоПериода.ОсновноеСредство
			               |
			               |ИНДЕКСИРОВАТЬ ПО
			               |	ОсновноеСредство,
						   |	ИФНС,
						   |	ИФНССтарый,
			               |	Организация";
						   
			Запрос.Выполнить();
			
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	ВладениеУчастками.ОсновноеСредство КАК ОсновноеСредство,
						   |	ВладениеУчастками.Организация КАК Организация,
			               |	ВладениеУчастками.ИФНС КАК ИФНС,
			               |	СУММА(ВладениеУчастками.КоличествоМесяцев) КАК КоличествоМесяцев
			               |ПОМЕСТИТЬ ВладениеЗемельнымиУчасткамиИФНС
			               |ИЗ
			               |	ВТ_ВладениеЗемельнымиУчастками КАК ВладениеУчастками
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ВладениеУчастками.ОсновноеСредство,
						   |	ВладениеУчастками.Организация,
			               |	ВладениеУчастками.ИФНС
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	ВладениеУчастками.ОсновноеСредство,
						   |	ВладениеУчастками.Организация,
			               |	ВладениеУчастками.ИФНССтарый,
			               |	ВЫБОР
			               |		КОГДА СУММА(ВладениеУчастками.КоличествоМесяцев) > 0
			               |			ТОГДА -СУММА(ВладениеУчастками.КоличествоМесяцев)
			               |		ИНАЧЕ СУММА(ВладениеУчастками.КоличествоМесяцев)
			               |	КОНЕЦ
			               |ИЗ
			               |	ВТ_ВладениеЗемельнымиУчастками КАК ВладениеУчастками
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВладениеЗемельнымиУчастками КАК ВладениеЗемельнымиУчасткамиИФНС
			               |		ПО ВладениеУчастками.ОсновноеСредство = ВладениеЗемельнымиУчасткамиИФНС.ОсновноеСредство
			               |			И ВладениеУчастками.ИФНССтарый = ВладениеЗемельнымиУчасткамиИФНС.ИФНС
						   |ГДЕ
						   |	ВладениеУчастками.ИФНС <> ВладениеУчастками.ИФНССтарый
						   |
			               |СГРУППИРОВАТЬ ПО
			               |	ВладениеУчастками.ОсновноеСредство,
						   |	ВладениеУчастками.Организация,
			               |	ВладениеУчастками.ИФНССтарый
						   |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВладениеЗемельнымиУчасткамиИФНС.ОсновноеСредство КАК ОсновноеСредство,
						   |	ВладениеЗемельнымиУчасткамиИФНС.Организация КАК Организация,
			               |	ВладениеЗемельнымиУчасткамиИФНС.ИФНС,
			               |	СУММА(ВладениеЗемельнымиУчасткамиИФНС.КоличествоМесяцев) КАК КоличествоМесяцев
			               |ПОМЕСТИТЬ ВладениеЗемельнымиУчастками
			               |ИЗ
			               |	ВладениеЗемельнымиУчасткамиИФНС КАК ВладениеЗемельнымиУчасткамиИФНС
			               |ГДЕ
			               |	НЕ ВладениеЗемельнымиУчасткамиИФНС.ИФНС ЕСТЬ NULL 
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ВладениеЗемельнымиУчасткамиИФНС.ОсновноеСредство,
						   |	ВладениеЗемельнымиУчасткамиИФНС.Организация,
			               |	ВладениеЗемельнымиУчасткамиИФНС.ИФНС
						   |ИНДЕКСИРОВАТЬ ПО
			               |	ОсновноеСредство,
			               |	Организация";

						   
		ИНАЧЕ
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	РегистрацияЗемельныхУчастковСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
			               |	РегистрацияЗемельныхУчастковСрезПоследних.Организация КАК Организация,
			               |	РегистрацияЗемельныхУчастковСрезПоследних.Период КАК Период,
						   |	ВЫБОР
						   |		КОГДА РегистрацияЗемельныхУчастковСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
						   |			ТОГДА РегистрацияЗемельныхУчастковСрезПоследних.НалоговыйОрган
						   |		ИНАЧЕ &ОсновнойНалоговыйОрган
						   |	КОНЕЦ КАК ИФНС,
			               |	1 КАК КоличествоМесяцев
			               |ПОМЕСТИТЬ ВладениеЗемельнымиУчастками
			               |ИЗ
			               |	РегистрСведений.РегистрацияЗемельныхУчастков.СрезПоследних(&КонецМесяца, Организация = &Организация) КАК РегистрацияЗемельныхУчастковСрезПоследних
			               |ГДЕ
			               |	РегистрацияЗемельныхУчастковСрезПоследних.ВключатьВНалоговуюБазу
			               |
			               |ИНДЕКСИРОВАТЬ ПО
			               |	ОсновноеСредство,
			               |	Организация";
		КонецЕсли;	
		
		Запрос.Выполнить();
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МЕСЯЦ(&НачалоМесяца) КАК НомерМесяца,
		|	ВладениеЗемельнымиУчастками.ОсновноеСредство,
		|	ВладениеЗемельнымиУчастками.ИФНС,
		|	ВладениеЗемельнымиУчастками.КоличествоМесяцев
		|ПОМЕСТИТЬ ВладениеЗемельнымиУчастками" + Формат(Период, "ДФ=MM") + "
		|ИЗ
		|	ВладениеЗемельнымиУчастками КАК ВладениеЗемельнымиУчастками
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВладениеЗемельнымиУчастками
		|;
		|";
		
		Запрос.Выполнить();
		
		Если Не ГодовойРасчет Тогда
			Запрос.Текст = "
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТ_ВладениеЗемельнымиУчасткамиНачалоПериода;
			|УНИЧТОЖИТЬ ВТ_ВладениеЗемельнымиУчастками;
			|УНИЧТОЖИТЬ ВладениеЗемельнымиУчасткамиИФНС"; 
			
			Запрос.Выполнить();
		КонецЕсли;	
		
		ТекстОбъединяющегоЗапроса = ТекстОбъединяющегоЗапроса
								  + ?(ПустаяСтрока(ТекстОбъединяющегоЗапроса), 
									  "ВЫБРАТЬ РАЗРЕШЕННЫЕ *
		                              |",
									  "ОБЪЕДИНИТЬ ВСЕ
									  |ВЫБРАТЬ *
		                              |")
								  + ?(ПустаяСтрока(ТекстОбъединяющегоЗапроса), 
									  "ПОМЕСТИТЬ ВладениеЗемельнымиУчастками
									  |",
									  "")
								  + "ИЗ ВладениеЗемельнымиУчастками" + Формат(Период, "ДФ=MM") + "
									|";
		
		Период = ДобавитьМесяц(Период, 1);
		
	КонецЦикла;

	Запрос.Текст = ТекстОбъединяющегоЗапроса;
	Запрос.Выполнить();
	
	Запрос.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВладениеЗемельнымиУчастками.ОсновноеСредство КАК ОсновноеСредство,
	|	ВладениеЗемельнымиУчастками.ИФНС КАК ИФНС,
	|	СУММА(ВладениеЗемельнымиУчастками.КоличествоМесяцев) КАК КоличествоМесяцевВладения
	|ПОМЕСТИТЬ ВТ_ВладениеУчастками
	|ИЗ
	|	ВладениеЗемельнымиУчастками КАК ВладениеЗемельнымиУчастками
	|
	|ГДЕ ВладениеЗемельнымиУчастками.КоличествоМесяцев <> 0
	|СГРУППИРОВАТЬ ПО
	|	ВладениеЗемельнымиУчастками.ОсновноеСредство,
	|	ВладениеЗемельнымиУчастками.ИФНС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство, ИФНС
	|";
	
	Запрос.Выполнить();

	Если ГодовойРасчет Тогда	
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВладениеУчастками.ОсновноеСредство,
		|	ВладениеУчастками.ИФНС КАК ИФНС,
		|	ЕСТЬNULL(ВладениеУчастками.КоличествоМесяцевВладения, 0) КАК КоличествоМесяцевВладения,
		|	РегистрацияЗемельныхУчастковСрезПоследних.КодКатегорииЗемель,
		|	РегистрацияЗемельныхУчастковСрезПоследних.КадастровыйНомер,
		|	РегистрацияЗемельныхУчастковСрезПоследних.КБК КАК КБК,
		|	ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ОбщаяСобственность, ЛОЖЬ) КАК ОбщаяСобственность,
		|	ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ДоляВПравеОбщейСобственностиЧислитель, 0) КАК ДоляВПравеОбщейСобственностиЧислитель,
		|	ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ДоляВПравеОбщейСобственностиЗнаменатель, 0) КАК ДоляВПравеОбщейСобственностиЗнаменатель,
		|	ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.НалоговаяСтавка, 0) КАК НалоговаяСтавка,
		|	ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ПлощадьОблагаемая, 0) КАК ПлощадьОблагаемая,
		|	ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ПлощадьНеОблагаемая, 0) КАК ПлощадьНеОблагаемая,
		|	РегистрацияЗемельныхУчастковСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалога, 0) КАК КорректировкаБазовойСтавкиНалога,
		|	ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалогаНаТерриторияхСЭЗ, 0) КАК КорректировкаБазовойСтавкиНалогаНаТерриторияхСЭЗ,
		|	ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалогаПоРешениюМестныхОрганов, 0) КАК КорректировкаБазовойСтавкиНалогаПоРешениюМестныхОрганов,
		|	ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ПроцентИзмененияБазовойСтавкиНалога, 0) КАК ПроцентИзмененияБазовойСтавкиНалога,
		|	(ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.НалоговаяСтавка, 0) + ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ПроцентИзмененияБазовойСтавкиНалога, 0) * ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.НалоговаяСтавка, 0) / 100) * ВЫБОР
	    |		КОГДА ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалога, 0) = 0
	    |			ТОГДА 1
	    |			ИНАЧЕ ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалога, 0)
	    |		КОНЕЦ * ВЫБОР
	    |			КОГДА ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалогаНаТерриторияхСЭЗ, 0) = 0
	    |				ТОГДА 1
	    |			ИНАЧЕ ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалогаНаТерриторияхСЭЗ, 0)
	    |		КОНЕЦ * ВЫБОР
	    |			КОГДА ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалогаПоРешениюМестныхОрганов, 0) = 0
	    |				ТОГДА 1
	    |			ИНАЧЕ ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалогаПоРешениюМестныхОрганов, 0)
	    |		КОНЕЦ КАК СтавкаНалогаСУчетомКорректировки
		|ПОМЕСТИТЬ ВТ_РасчетНалога
		|ИЗ
		|	ВТ_ВладениеУчастками КАК ВладениеУчастками
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияЗемельныхУчастков.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					) КАК РегистрацияЗемельныхУчастковСрезПоследних
		|		ПО ВладениеУчастками.ОсновноеСредство = РегистрацияЗемельныхУчастковСрезПоследних.ОсновноеСредство
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИФНС
		|";
		
	Иначе	
		
		Запрос.УстановитьПараметр("НачалоПериода", ДатаНачалаПериодаОтчета);
		Запрос.УстановитьПараметр("КонецПериода", ДатаКонцаПериодаОтчета);
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РегистрацияЗемельныхУчастковСрезПоследних.Период,
		|	ВЫБОР
		|		КОГДА РегистрацияЗемельныхУчастковСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
		|			ТОГДА РегистрацияЗемельныхУчастковСрезПоследних.НалоговыйОрган
		|		ИНАЧЕ &ОсновнойНалоговыйОрган
		|	КОНЕЦ КАК ИФНС,
		|	РегистрацияЗемельныхУчастковСрезПоследних.ОсновноеСредство
		|ПОМЕСТИТЬ ВТ_ОбъектыНаКонецПериода
		|ИЗ
		|	РегистрСведений.РегистрацияЗемельныхУчастков.СрезПоследних(&ГраницаНачалоГода, Организация = &Организация) КАК РегистрацияЗемельныхУчастковСрезПоследних
		|ГДЕ
		|	РегистрацияЗемельныхУчастковСрезПоследних.ВключатьВНалоговуюБазу = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РегистрацияЗемельныхУчастков.Период,
		|	ВЫБОР
		|		КОГДА РегистрацияЗемельныхУчастков.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
		|			ТОГДА РегистрацияЗемельныхУчастков.НалоговыйОрган
		|		ИНАЧЕ &ОсновнойНалоговыйОрган
		|	КОНЕЦ,
		|	РегистрацияЗемельныхУчастков.ОсновноеСредство
		|ИЗ
		|	РегистрСведений.РегистрацияЗемельныхУчастков КАК РегистрацияЗемельныхУчастков
		|ГДЕ
		|	РегистрацияЗемельныхУчастков.Организация = &Организация
		|	И РегистрацияЗемельныхУчастков.Период МЕЖДУ &НачалоГода И &КонецПериода
		|	И РегистрацияЗемельныхУчастков.ВключатьВНалоговуюБазу = ИСТИНА
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	РегистрацияЗемельныхУчастковСрезПоследних.ОсновноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОбъектыНаКонецПериода.ОсновноеСредство,
		|	ОбъектыНаКонецПериода.ИФНС
		|ПОМЕСТИТЬ ВТ_Объекты
		|ИЗ
		|	ВТ_ОбъектыНаКонецПериода КАК ОбъектыНаКонецПериода
		|;
		|";
		
		Запрос.Выполнить();
		
		Запрос.Текст = "		
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РегистрацияЗемельныхУчастковСрезПоследних.ОсновноеСредство,
		|	ВЫБОР
		|		КОГДА РегистрацияЗемельныхУчастковСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
		|			ТОГДА РегистрацияЗемельныхУчастковСрезПоследних.НалоговыйОрган
		|		ИНАЧЕ &ОсновнойНалоговыйОрган
		|	КОНЕЦ КАК ИФНС,
		|	ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ПлощадьОблагаемая, 0) * (ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.НалоговаяСтавка, 0) + ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ПроцентИзмененияБазовойСтавкиНалога, 0) * ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.НалоговаяСтавка, 0) / 100) * ВЫБОР
		|		КОГДА ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалога, 0) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалога, 0)
		|	КОНЕЦ * ВЫБОР
		|		КОГДА ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалогаНаТерриторияхСЭЗ, 0) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалогаНаТерриторияхСЭЗ, 0)
		|	КОНЕЦ * ВЫБОР
		|		КОГДА ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалогаПоРешениюМестныхОрганов, 0) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалогаПоРешениюМестныхОрганов, 0)
		|	КОНЕЦ * ВЫБОР
		|		КОГДА ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ОбщаяСобственность, ЛОЖЬ) = ЛОЖЬ
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ДоляВПравеОбщейСобственностиЧислитель, 0) / ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ДоляВПравеОбщейСобственностиЗнаменатель, 1)
		|	КОНЕЦ КАК СуммаЗемельногоНалога,
		|	12 КАК КоличествоМесяцевВладения
		|ПОМЕСТИТЬ ВТ_ЗемельныйНалогНаНачалоГода
		|ИЗ
		|	РегистрСведений.РегистрацияЗемельныхУчастков.СрезПоследних(&ГраницаНачалоГода, Организация = &Организация) КАК РегистрацияЗемельныхУчастковСрезПоследних
		|ГДЕ
		|	РегистрацияЗемельныхУчастковСрезПоследних.ВключатьВНалоговуюБазу = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Объекты.ОсновноеСредство,
		|	РегистрацияЗемельныхУчастковСрезПоследних.Организация КАК Организация,
		|	РегистрацияЗемельныхУчастковСрезПоследних.КодКатегорииЗемель,
		|	РегистрацияЗемельныхУчастковСрезПоследних.КадастровыйНомер,
		|	РегистрацияЗемельныхУчастковСрезПоследних.КБК КАК КБК,
		|	Объекты.ИФНС КАК ИФНС,
		|	ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ОбщаяСобственность, ЛОЖЬ) КАК ОбщаяСобственность,
		|	ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ДоляВПравеОбщейСобственностиЧислитель, 0) КАК ДоляВПравеОбщейСобственностиЧислитель,
		|	ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ДоляВПравеОбщейСобственностиЗнаменатель, 0) КАК ДоляВПравеОбщейСобственностиЗнаменатель,
		|	ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.НалоговаяСтавка, 0) КАК НалоговаяСтавка,
		|	ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ПлощадьОблагаемая, 0) КАК ПлощадьОблагаемая,
		|	ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ПлощадьНеОблагаемая, 0) КАК ПлощадьНеОблагаемая,
		|	РегистрацияЗемельныхУчастковСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалога, 0) КАК КорректировкаБазовойСтавкиНалога,
		|	ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалогаНаТерриторияхСЭЗ, 0) КАК КорректировкаБазовойСтавкиНалогаНаТерриторияхСЭЗ,
		|	ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалогаПоРешениюМестныхОрганов, 0) КАК КорректировкаБазовойСтавкиНалогаПоРешениюМестныхОрганов,
		|	ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ПроцентИзмененияБазовойСтавкиНалога, 0) КАК ПроцентИзмененияБазовойСтавкиНалога,
		|	(ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.НалоговаяСтавка, 0) + ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ПроцентИзмененияБазовойСтавкиНалога, 0) * ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.НалоговаяСтавка, 0) / 100) * ВЫБОР
		|		КОГДА ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалога, 0) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалога, 0)
		|	КОНЕЦ * ВЫБОР
		|		КОГДА ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалогаНаТерриторияхСЭЗ, 0) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалогаНаТерриторияхСЭЗ, 0)
		|	КОНЕЦ * ВЫБОР
		|		КОГДА ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалогаПоРешениюМестныхОрганов, 0) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалогаПоРешениюМестныхОрганов, 0)
		|	КОНЕЦ КАК СтавкаНалогаСУчетомКорректировки,
		|	ЕСТЬNULL(ВладениеУчастками.КоличествоМесяцевВладения, 0) КАК КоличествоМесяцевВладения,
		|	ЕСТЬNULL(ЗемельныйНалогНаНачалоГода.СуммаЗемельногоНалога, 0) КАК СуммаНалогаНаНачалоГода,
		|	ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ПлощадьОблагаемая, 0) * (ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.НалоговаяСтавка, 0) + ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ПроцентИзмененияБазовойСтавкиНалога, 0) * ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.НалоговаяСтавка, 0) / 100) * ВЫБОР
		|		КОГДА ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалога, 0) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалога, 0)
		|	КОНЕЦ * ВЫБОР
		|		КОГДА ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалогаНаТерриторияхСЭЗ, 0) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалогаНаТерриторияхСЭЗ, 0)
		|	КОНЕЦ * ВЫБОР
		|		КОГДА ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалогаПоРешениюМестныхОрганов, 0) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.КорректировкаБазовойСтавкиНалогаПоРешениюМестныхОрганов, 0)
		|	КОНЕЦ * ВЫБОР
		|		КОГДА ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ОбщаяСобственность, ЛОЖЬ) = ЛОЖЬ
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ДоляВПравеОбщейСобственностиЧислитель, 0) / ЕСТЬNULL(РегистрацияЗемельныхУчастковСрезПоследних.ДоляВПравеОбщейСобственностиЗнаменатель, 1)
		|	КОНЕЦ КАК СуммаИзмененийНалога
		|ПОМЕСТИТЬ ВТ_РасчетНалога
		|ИЗ
		|	ВТ_Объекты КАК Объекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВладениеУчастками КАК ВладениеУчастками
		|		ПО Объекты.ОсновноеСредство = ВладениеУчастками.ОсновноеСредство
		|			И Объекты.ИФНС = ВладениеУчастками.ИФНС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗемельныйНалогНаНачалоГода КАК ЗемельныйНалогНаНачалоГода
		|		ПО Объекты.ОсновноеСредство = ЗемельныйНалогНаНачалоГода.ОсновноеСредство
		|			И Объекты.ИФНС = ЗемельныйНалогНаНачалоГода.ИФНС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияЗемельныхУчастков.СрезПоследних(&ДатаКонцаПериодаОтчета, Организация = &Организация) КАК РегистрацияЗемельныхУчастковСрезПоследних
		|		ПО Объекты.ОсновноеСредство = РегистрацияЗемельныхУчастковСрезПоследних.ОсновноеСредство
		|";
		
	КонецЕсли;
	
	Запрос.Выполнить();
	
	РасчетИмущественныхНалогов.СоздатьНалоговыеОрганыСУстановленнойУплатойАвансов(
		Запрос.МенеджерВременныхТаблиц, Организация, ПериодРасчета, "ЗемельныйНалог");
		
	Запрос.УстановитьПараметр("ГодовойРасчет", ГодовойРасчет);	
		
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВТ_РасчетНалога.ОсновноеСредство,
	|	ВТ_РасчетНалога.КоличествоМесяцевВладения,
	|	ВТ_РасчетНалога.КодКатегорииЗемель,
	|	ВТ_РасчетНалога.КадастровыйНомер,
	|	ВТ_РасчетНалога.КБК,
	|	ВТ_РасчетНалога.ИФНС,
	|	ВТ_РасчетНалога.ОбщаяСобственность,
	|	ВТ_РасчетНалога.ДоляВПравеОбщейСобственностиЧислитель,
	|	ВТ_РасчетНалога.ДоляВПравеОбщейСобственностиЗнаменатель,
	|	ВТ_РасчетНалога.НалоговаяСтавка,
	|	ВТ_РасчетНалога.ПлощадьОблагаемая,
	|	ВТ_РасчетНалога.ПлощадьНеОблагаемая,
	|	ВТ_РасчетНалога.ЕдиницаИзмерения,
	|	ВТ_РасчетНалога.КорректировкаБазовойСтавкиНалога,
	|	ВТ_РасчетНалога.КорректировкаБазовойСтавкиНалогаНаТерриторияхСЭЗ,
	|	ВТ_РасчетНалога.КорректировкаБазовойСтавкиНалогаПоРешениюМестныхОрганов,
	|	ВТ_РасчетНалога.ПроцентИзмененияБазовойСтавкиНалога,
	|	ВТ_РасчетНалога.СтавкаНалогаСУчетомКорректировки,
	|	ВЫБОР
	|		КОГДА ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов.НалоговыйОрган ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УплачиваютсяАвансы
	|	//КвартальныйРасчет , ВТ_РасчетНалога.СуммаНалогаНаНачалоГода КАК СуммаЗемельногоНалогаНаНачалоГода
	|	//КвартальныйРасчет , ВТ_РасчетНалога.СуммаИзмененийНалога КАК СуммаИзмененийНалога
	|ИЗ
	|	ВТ_РасчетНалога КАК ВТ_РасчетНалога
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов КАК ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов
	|		ПО ВТ_РасчетНалога.ИФНС = ВТ_НалоговыеОрганыСУстановленнойУплатойАвансов.НалоговыйОрган";
	
	Если Не ГодовойРасчет Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//КвартальныйРасчет", "");
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		РасчетЗемельногоНалога = РезультатЗапроса.Выгрузить();
		
		Отбор = Новый Структура("ИФНС, ОсновноеСредство");
		Если ГодовойРасчет Тогда
			
			РасчетНалога1Кв = ТаблицаРасчетНалога.СкопироватьКолонки();
			РасчетНалога2Кв = ТаблицаРасчетНалога.СкопироватьКолонки();
			РасчетНалога3Кв = ТаблицаРасчетНалога.СкопироватьКолонки();
			РасчетНалога4Кв = ТаблицаРасчетНалога.СкопироватьКолонки();
			
			НайденнаяСтрока = РасчетЗемельногоНалога.Найти(Истина, "УплачиваютсяАвансы");
			Если НайденнаяСтрока <> Неопределено Тогда
				РасчетНалога1Кв = ПолучитьРасчетПоЗемельномуНалогуРК(Организация, Дата(Год(ПериодРасчета), 01, 31));
				РасчетНалога2Кв = ПолучитьРасчетПоЗемельномуНалогуРК(Организация, Дата(Год(ПериодРасчета), 04, 30));
				РасчетНалога3Кв = ПолучитьРасчетПоЗемельномуНалогуРК(Организация, Дата(Год(ПериодРасчета), 07, 31));
				РасчетНалога4Кв = ПолучитьРасчетПоЗемельномуНалогуРК(Организация, Дата(Год(ПериодРасчета), 10, 31));
			КонецЕсли;
			
		КонецЕсли;
		
		Для Каждого СтрокаРасчета Из РасчетЗемельногоНалога Цикл
			
			Если НЕ ГодовойРасчет И НЕ СтрокаРасчета.УплачиваютсяАвансы Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаРасчетНалога.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасчета);
			
			ЧислоМесяцевВОтчетномПериоде = 12;
			
			Если НоваяСтрока.ДоляВПравеОбщейСобственностиЧислитель <> 0 И НоваяСтрока.ДоляВПравеОбщейСобственностиЗнаменатель <> 0 Тогда
				ДоляВПравеОбщейСобственности = 
					Мин(1, НоваяСтрока.ДоляВПравеОбщейСобственностиЧислитель / НоваяСтрока.ДоляВПравеОбщейСобственностиЗнаменатель);
			Иначе
				ДоляВПравеОбщейСобственности = 1;
			КонецЕсли;
			
			//Расчет налоговой базы
			НоваяСтрока.НалоговаяБаза = СтрокаРасчета.ПлощадьОблагаемая;
						
			//Коэффициент Кв определяется как отношение числа полных месяцев, 
			//в течение которых данный земельный участок находился в собственности
			//налогоплательщика к числу календарных месяцев в налоговом периоде.
			
			КоэффициентКв = НоваяСтрока.КоличествоМесяцевВладения / ЧислоМесяцевВОтчетномПериоде;
			
			Если ГодовойРасчет Тогда
				НоваяСтрока.СуммаНалога = Окр(НоваяСтрока.НалоговаяБаза * СтрокаРасчета.СтавкаНалогаСУчетомКорректировки * КоэффициентКв * ДоляВПравеОбщейСобственности);
			Иначе 
				//ОбщаяСумма - величина изменений налогового обязательства
				Если СтрокаРасчета.СуммаИзмененийНалога = 0 Тогда
					ОбщаяСумма = 0;
				Иначе	
					ОбщаяСумма = Окр(СтрокаРасчета.СуммаИзмененийНалога * КоэффициентКв);
				КонецЕсли;	
				
				НоваяСтрока.СуммаИзмененияНалога = ОбщаяСумма;
				
				НомерТекущегоКвартала = Цел((Месяц(ДатаКонцаПериодаОтчета) - 1) / 3) + 1;
				КоличествоОставшихсяПериодовПлатежа = 4 - НомерТекущегоКвартала + 1;	
				
				// сумму платежа за последний месяц считаем таким способом, чтобы избежать ошибок
				// округления
				СуммаВМесяц = Окр(ОбщаяСумма/КоличествоОставшихсяПериодовПлатежа);
				СуммаВПоследнийМесяц = Окр(ОбщаяСумма - (СуммаВМесяц*(КоличествоОставшихсяПериодовПлатежа - 1)));
				СуммаИзмененийТекКвартал = ?(НомерТекущегоКвартала = 4, СуммаВПоследнийМесяц, СуммаВМесяц);
				
				//Изменения налога в пред.периодах
				СуммаИзменений = 0;
				ЗаполнитьЗначенияСвойств(Отбор, НоваяСтрока);
				
				//округлим площадь до 2-х знаков после запятой
				НоваяСтрока.ПлощадьОблагаемая 	= Окр(СтрокаРасчета.ПлощадьОблагаемая, 2);
				НоваяСтрока.ПлощадьНеОблагаемая = Окр(СтрокаРасчета.ПлощадьНеОблагаемая, 2);
				
				Если НомерТекущегоКвартала > 1 Тогда
					Для НомерКвартала = 1 По НомерТекущегоКвартала-1 Цикл
						
						ПериодКвартал = ДобавитьМесяц(Дата(Год(ПериодРасчета), 01, 31), ?(НомерКвартала <> 1, (НомерКвартала-1)*3, 0));
						РасчетПоКварталу = ПолучитьРасчетЗемельногоНалогаЗаКвартал(Организация, ПериодКвартал);
						
						СтрокиРасчетаАвансовыхПлатежей = РасчетПоКварталу.НайтиСтроки(Отбор);
						
						СуммаИзмененияНалога = 0;
						Для Каждого СтрокаРасчетаАвансовыхПлатежей Из СтрокиРасчетаАвансовыхПлатежей Цикл
							
							НомерКвартала = Цел((Месяц(ПериодКвартал) - 1) / 3) + 1;
							КоличествоОставшихсяПериодовПлатежа = 4 - НомерКвартала + 1;	
				
							СуммаВМесяц = Окр(СтрокаРасчетаАвансовыхПлатежей.СуммаИзмененияНалога/КоличествоОставшихсяПериодовПлатежа);
							СуммаВПоследнийМесяц = Окр(СтрокаРасчетаАвансовыхПлатежей.СуммаИзмененияНалога - (СуммаВМесяц*(КоличествоОставшихсяПериодовПлатежа - 1)));
							СуммаИзмененияНалога = ?(НомерКвартала = 4, СуммаВПоследнийМесяц, СуммаВМесяц);
							
						КонецЦикла;
						
						СуммаИзменений = СуммаИзменений + СуммаИзмененияНалога;
					КонецЦикла;
				КонецЕсли;				
				
				//найдем размер текущего платежа, рассчитанный для текущего квартала, по состоянию на начало года
				СуммаНаНачалоГода = СтрокаРасчета.СуммаЗемельногоНалогаНаНачалоГода;
				СуммаВМесяц = Окр(СуммаНаНачалоГода/4);
				СуммаВПоследнийМесяц = Окр(СуммаНаНачалоГода - (СуммаВМесяц*(4 - 1)));
				ТекПлатежНаНачалоГода = ?(НомерТекущегоКвартала = 4, СуммаВПоследнийМесяц, СуммаВМесяц);
				
				ИтоговаяСуммаНалога = ТекПлатежНаНачалоГода + СуммаИзменений + СуммаИзмененийТекКвартал;
				
				НоваяСтрока.СуммаНалога = ИтоговаяСуммаНалога;
			КонецЕсли;
			
			//Расчет суммы налога к уплате
			НоваяСтрока.СуммаНалогаКУплате = НоваяСтрока.СуммаНалога;
						
			Если ГодовойРасчет И СтрокаРасчета.УплачиваютсяАвансы Тогда
				
				ЗаполнитьЗначенияСвойств(Отбор, НоваяСтрока);
				
				НоваяСтрока.СуммаАвансовыхПлатежей1Кв = 0;
				СтрокиРасчетаАвансовыхПлатежей = РасчетНалога1Кв.НайтиСтроки(Отбор);
				Для Каждого СтрокаРасчетаАвансовыхПлатежей Из СтрокиРасчетаАвансовыхПлатежей Цикл
					НоваяСтрока.СуммаАвансовыхПлатежей1Кв = НоваяСтрока.СуммаАвансовыхПлатежей1Кв
						+ СтрокаРасчетаАвансовыхПлатежей.СуммаНалогаКУплате;
				КонецЦикла;
				
				НоваяСтрока.СуммаАвансовыхПлатежей2Кв = 0;
				СтрокиРасчетаАвансовыхПлатежей = РасчетНалога2Кв.НайтиСтроки(Отбор);
				Для Каждого СтрокаРасчетаАвансовыхПлатежей Из СтрокиРасчетаАвансовыхПлатежей Цикл
					НоваяСтрока.СуммаАвансовыхПлатежей2Кв = НоваяСтрока.СуммаАвансовыхПлатежей2Кв
						+ СтрокаРасчетаАвансовыхПлатежей.СуммаНалогаКУплате;
				КонецЦикла;
				
				НоваяСтрока.СуммаАвансовыхПлатежей3Кв = 0;
				СтрокиРасчетаАвансовыхПлатежей = РасчетНалога3Кв.НайтиСтроки(Отбор);
				Для Каждого СтрокаРасчетаАвансовыхПлатежей Из СтрокиРасчетаАвансовыхПлатежей Цикл
					НоваяСтрока.СуммаАвансовыхПлатежей3Кв = НоваяСтрока.СуммаАвансовыхПлатежей3Кв
					+ СтрокаРасчетаАвансовыхПлатежей.СуммаНалогаКУплате;
				КонецЦикла;
				
				НоваяСтрока.СуммаАвансовыхПлатежей4Кв = 0;
				СтрокиРасчетаАвансовыхПлатежей = РасчетНалога4Кв.НайтиСтроки(Отбор);
				Для Каждого СтрокаРасчетаАвансовыхПлатежей Из СтрокиРасчетаАвансовыхПлатежей Цикл
					НоваяСтрока.СуммаАвансовыхПлатежей4Кв = НоваяСтрока.СуммаАвансовыхПлатежей4Кв
					+ СтрокаРасчетаАвансовыхПлатежей.СуммаНалогаКУплате;
				КонецЦикла;

				
				НоваяСтрока.СуммаНалогаКУплате = НоваяСтрока.СуммаНалогаКУплате - НоваяСтрока.СуммаАвансовыхПлатежей1Кв
					- НоваяСтрока.СуммаАвансовыхПлатежей2Кв - НоваяСтрока.СуммаАвансовыхПлатежей3Кв - НоваяСтрока.СуммаАвансовыхПлатежей4Кв;
				
			КонецЕсли;
			
			Если НЕ ГодовойРасчет Тогда
				НоваяСтрока["СуммаАвансовыхПлатежей" + Формат(ПериодРасчета, "ДФ='q''Кв'''")] = НоваяСтрока.СуммаНалогаКУплате;
			КонецЕсли;
				
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаРасчетНалога.ЗаполнитьЗначения(ДатаКонцаПериодаОтчета, "ПериодРасчета");
	ТаблицаРасчетНалога.ЗаполнитьЗначения(Организация, "Организация");

	Возврат ТаблицаРасчетНалога;
	
КонецФункции

#КонецОбласти

#Область НалогНаИмущество

// Возвращает расчет земельного налога за квартал
//
// Параметры:
//  Организация - СправочникСсылка.Организации - организация, по которому нужно получить расчет
//  ПериодРасчета - Дата - период, для которого нужно получить расчет (конец января, апреля, июля, октярбя и декабря)
//
// Возвращаемое значение:
//  ТаблицаРасчета - ТаблицаЗначений - таблица, содержащая данные по расчету за указанный квартал
//
Функция ПолучитьРасчетНалогаНаИмуществоЗаКвартал(Организация, ПериодРасчета)

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасчетНалогаНаИмущество.ПериодРасчета,
	               |	РасчетНалогаНаИмущество.Организация,
	               |	РасчетНалогаНаИмущество.ИФНС,
	               |	РасчетНалогаНаИмущество.ОсновноеСредство,
	               |	РасчетНалогаНаИмущество.СуммаНалогаКУплате,
	               |	РасчетНалогаНаИмущество.СуммаИзмененияНалога
	               |ИЗ
	               |	РегистрСведений.РасчетНалогаНаИмущество КАК РасчетНалогаНаИмущество
	               |ГДЕ
	               |	РасчетНалогаНаИмущество.Организация = &Организация
	               |	И РасчетНалогаНаИмущество.ПериодРасчета = &ПериодРасчета";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодРасчета", ПериодРасчета);
	
	ТаблицаРасчета = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРасчета;
	
КонецФункции
 
// Возвращает результат расчета налога (или аванса по налогу) на имущество
//
// Параметры:
// 	Организация - СправочникСсылка.Организации - Организация, для которой необходимо выполнить проверку
// 	Период - Дата - Дата закрытия месяца
//
// Возвращаемое значение:
// 	ТаблицаРасчетНалога - ТаблицаЗначений - Результат расчета налога
//
Функция ПолучитьРасчетПоНалогуНаИмуществоРК(Организация, ПериодРасчета, МенеджерВТДляРасчетаПоФактическойСтоимости = Неопределено) Экспорт
	
	ГодовойРасчет = Месяц(ПериодРасчета) = 12;
	
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "РегистрацияВНалоговомОргане");
	
	мДатаНачалаПериодаОтчета = ?(ГодовойРасчет,	НачалоГода(ПериодРасчета),	ПолучитьДатуНачала(ПериодРасчета));
	мДатаКонцаПериодаОтчета = ?(ГодовойРасчет, КонецГода(ПериодРасчета), ПолучитьДатуОкончания(ПериодРасчета));
	
	ТаблицаРасчетНалога = РасчетИмущественныхНалогов.ПустаяСправкаРасчет("РасчетНалогаНаИмущество");

	ЭтоНеЮрЛицо = НЕ ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Организация);
	
	Если Не (Месяц(ПериодРасчета) = 1 ИЛИ Месяц(ПериодРасчета) = 4 Или Месяц(ПериодРасчета) = 7 Или Месяц(ПериодРасчета) = 10 Или Месяц(ПериодРасчета) = 12)
		Или ЭтоНеЮрЛицо Тогда
		
		Возврат ТаблицаРасчетНалога;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Если МенеджерВТДляРасчетаПоФактическойСтоимости <> Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = МенеджерВТДляРасчетаПоФактическойСтоимости;
		РасчетПоФактическойСтоимости = Истина;
	Иначе
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		РасчетПоФактическойСтоимости = Ложь;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("КонецПериодаОтчета", мДатаКонцаПериодаОтчета);
			
	СчетаУчетаОС = Новый Массив;
	СчетаУчетаОС.Добавить(ПланыСчетов.Хозрасчетный.ОСвОрганизации); //2413
	СчетаУчетаОС.Добавить(ПланыСчетов.Хозрасчетный.ОсновныеСредстваПереданныеВАренду); //2414
	СчетаУчетаОС.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияОсновныхСредств); //2420
	СчетаУчетаОС.Добавить(ПланыСчетов.Хозрасчетный.УбытокОтОбесцененияОсновныхСредств); //2430
	
	СчетаУчетаОС.Добавить(ПланыСчетов.Хозрасчетный.МЦвОрганизации);// 2312
	СчетаУчетаОС.Добавить(ПланыСчетов.Хозрасчетный.ИнвестицииВНедвижимостьПереданныеВАренду); //2313
	СчетаУчетаОС.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияИнвестицийВНедвижимость_); //2320
	СчетаУчетаОС.Добавить(ПланыСчетов.Хозрасчетный.УбытокОтОбесцененияИнвестицийВНедвижимость); //2330
	
	Запрос.УстановитьПараметр("СчетаУчетаОС", СчетаУчетаОС);
	
	СчетаУчетаОСПервоначальнойСтоимости = Новый Массив;
	СчетаУчетаОСПервоначальнойСтоимости.Добавить(ПланыСчетов.Хозрасчетный.ОСвОрганизации);
	СчетаУчетаОСПервоначальнойСтоимости.Добавить(ПланыСчетов.Хозрасчетный.ОсновныеСредстваПереданныеВАренду);
	СчетаУчетаОСПервоначальнойСтоимости.Добавить(ПланыСчетов.Хозрасчетный.МЦвОрганизации);
	СчетаУчетаОСПервоначальнойСтоимости.Добавить(ПланыСчетов.Хозрасчетный.ИнвестицииВНедвижимостьПереданныеВАренду);
	
	Запрос.УстановитьПараметр("СчетаУчетаОСПервоначальнойСтоимости", СчетаУчетаОСПервоначальнойСтоимости);
	
	ТекстОбъединяющегоЗапроса = "";

	Период  = НачалоГода(ПериодРасчета);
	ИспользуетсяУправлениеВНА_2_4 = ВнеоборотныеАктивы.ИспользуетсяУправлениеВНА_2_4(Период);
	
	Счетчик = 1;
	
	Пока  Период <= ?(ГодовойРасчет, НачалоМесяца(ДобавитьМесяц(мДатаКонцаПериодаОтчета, 1)), мДатаКонцаПериодаОтчета) Цикл
		
		КонецПериода = ?(Год(Период) = Год(ПериодРасчета), Период, мДатаКонцаПериодаОтчета);
		
		Запрос.УстановитьПараметр("Период", Период);
		Запрос.УстановитьПараметр("КонецПериода", ?(ГодовойРасчет, КонецПериода, КонецМесяца(Период)));
		Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Период));
		Запрос.УстановитьПараметр("КонецПредыдущегоМесяца", ДобавитьМесяц(КонецМесяца(Период),-1));
		
		// Срез последних записей по основному средству в регистре "Ставки налога на имущество по отдельным основным средствам".
		Если Не ГодовойРасчет И Период >= мДатаНачалаПериодаОтчета Тогда
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.ОсновноеСредство,
			|	МАКСИМУМ(СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Период) КАК ПериодСреза
			|ПОМЕСТИТЬ СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследнихПериодов
			|ИЗ
			|	РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам
			|ГДЕ
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Период <= &КонецПредыдущегоМесяца
			|	И СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Организация = &Организация
			|
			|СГРУППИРОВАТЬ ПО
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.ОсновноеСредство
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.ОсновноеСредство,
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.НалоговыйОрган,
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.ПорядокНалогообложения,
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.ПостановкаНаУчетВНалоговомОргане
			|ПОМЕСТИТЬ СтавкиНалогаНаИмуществоПоОтдельнымОСКонецПредыдущегоМесяца
			|ИЗ
			|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследнихПериодов КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследнихПериодов
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам
			|		ПО СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследнихПериодов.ОсновноеСредство = СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.ОсновноеСредство
			|			И СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследнихПериодов.ПериодСреза = СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Период
			|;
			|";
			Запрос.Выполнить();
			
		КонецЕсли;
		
		Запрос.Текст = "
		|////////////////////////////////////////////////////////////////////////////////
		|//////////////Отдельные запросы по состоянию на начало месяца////////////////////
		|ВЫБРАТЬ
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.ОсновноеСредство,
		|	МАКСИМУМ(СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Период) КАК ПериодСреза
		|ПОМЕСТИТЬ СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамНачалоМесяца
		|ИЗ
		|	РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам
		|ГДЕ
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Период <= &Период
		|	И СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.ОсновноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.ОсновноеСредство,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.НалоговыйОрган,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.ПорядокНалогообложения,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.НалоговаяБаза
		|ПОМЕСТИТЬ СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследнихНачалоМесяца
		|ИЗ
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамНачалоМесяца КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамНачалоМесяца
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам
		|		ПО СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамНачалоМесяца.ОсновноеСредство = СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.ОсновноеСредство
		|			И СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамНачалоМесяца.ПериодСреза = СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Период
		|";
		
		Запрос.Выполнить();
		
		// Основные средства, находящиеся в состоянии "принято к учету".
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СостоянияОСОрганизаций.ОсновноеСредство КАК ОсновноеСредство,
		|	СостоянияОСОрганизаций.Состояние КАК Состояние
		|ПОМЕСТИТЬ
		|	ОСПринятыеКУчету
		|ИЗ
		|	РегистрСведений.СостоянияОСОрганизаций.СрезПоследних(" + ?(ГодовойРасчет, "&Период", "&КонецМесяца") + ", Организация = &Организация) КАК СостоянияОСОрганизаций
		|ГДЕ
		|	СостоянияОСОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
		|	ИЛИ СостоянияОСОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета)
		|	
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СостоянияОСОрганизаций.ОсновноеСредство КАК ОсновноеСредство,
		|	СостоянияОСОрганизаций.Состояние КАК Состояние
		|ПОМЕСТИТЬ
		|	ОСПринятыеКУчетуНачалоМесяца
		|ИЗ
		|	РегистрСведений.СостоянияОСОрганизаций.СрезПоследних(&Период, Организация = &Организация) КАК СостоянияОСОрганизаций
		|ГДЕ
		|	СостоянияОСОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
		|	ИЛИ СостоянияОСОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство";
		
		Запрос.Выполнить();
		
		// Выборка объектов по основному налоговому органу организации (его нет в справочнике Регистрация в налоговом органе).
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОС.Ссылка КАК ОсновноеСредство
		|ПОМЕСТИТЬ
		|	СписокРазрешенныхОС
		|ИЗ
		|	Справочник.ОбъектыЭксплуатации КАК ОС
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		ОСПринятыеКУчету КАК ОСПринятыеКУчету
		|	ПО
		|		ОС.Ссылка = ОСПринятыеКУчету.ОсновноеСредство
		|		
		|ГДЕ
		|	(ОС.Ссылка В 
		|		(ВЫБРАТЬ
		|			ПервоначальныеСведения.ОсновноеСредство
		|		ИЗ
		|			РегистрСведений.ПервоначальныеСведенияОС"+?(ИспользуетсяУправлениеВНА_2_4, "", "БухгалтерскийУчет")+" КАК ПервоначальныеСведения
		|		ГДЕ
		|			ПервоначальныеСведения.ОбъектИмущественногоНалога
		|			И ПервоначальныеСведения.Период < &КонецПериода
		|			И ПервоначальныеСведения.Организация = &Организация
		|			//ОТБОР_ОС//
		|			))
		|ИНДЕКСИРОВАТЬ ПО
		|	ОС.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство
		|
		|ПОМЕСТИТЬ
		|	СписокОС
		|
		|ИЗ
		|	РегистрСведений.ПервоначальныеСведенияОС"+?(ИспользуетсяУправлениеВНА_2_4, "", "БухгалтерскийУчет")+".СрезПоследних(
		|			" + ?(ГодовойРасчет, "&Период", "&КонецПериода") + ",
		|			Организация = &Организация
		|			И (ОсновноеСредство В (ВЫБРАТЬ РАЗЛИЧНЫЕ СписокРазрешенныхОС.ОсновноеСредство ИЗ СписокРазрешенныхОС КАК СписокРазрешенныхОС))
		|	) КАК ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.СрезПоследних(
		|			" + ?(ГодовойРасчет, "&Период", "&КонецПериода") + ",
		|			Организация = &Организация
		|			И (ОсновноеСредство В (ВЫБРАТЬ РАЗЛИЧНЫЕ СписокРазрешенныхОС.ОсновноеСредство ИЗ СписокРазрешенныхОС КАК СписокРазрешенныхОС))) КАК СтавкиНалогаПоОтдельнымОбъектам
		|		ПО ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство = СтавкиНалогаПоОтдельнымОбъектам.ОсновноеСредство
		|ГДЕ
		|	ВЫБОР 
		|		КОГДА ЕСТЬNULL(СтавкиНалогаПоОтдельнымОбъектам.ПорядокНалогообложения, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ СтавкиНалогаПоОтдельнымОбъектам.ПорядокНалогообложения <> ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.НеПодлежитНалогообложению)
		|	КОНЕЦ
		|ИНДЕКСИРОВАТЬ ПО
		|	 ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство";
		Если РасчетПоФактическойСтоимости Тогда
			ТекстОтбораОС = "И ПервоначальныеСведения.ОсновноеСредство В
			|					(ВЫБРАТЬ
			|						ВТ_РазницаВСтоимостиОС.ОбъектУчета
			|					ИЗ
			|						ВТ_РазницаВСтоимостиОС КАК ВТ_РазницаВСтоимостиОС
			|					ГДЕ
			|						ВТ_РазницаВСтоимостиОС.СтоимостьРегл > 0)";
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ОТБОР_ОС//", ТекстОтбораОС);
		КонецЕсли;
		Запрос.Выполнить();
		
		Если Период >= мДатаНачалаПериодаОтчета Тогда
			// Выборка счетов учета ОС
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	"+?(ИспользуетсяУправлениеВНА_2_4,"ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)", "СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета")+" КАК СчетУчета,
			|	"+?(ИспользуетсяУправлениеВНА_2_4,"ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)", "СчетаБухгалтерскогоУчетаОССрезПоследних.СчетНачисленияАмортизации")+" КАК СчетНачисленияАмортизации
			|
			|ПОМЕСТИТЬ
			|	СчетаУчетаОС
			|
			|ИЗ
			|	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
			|		&КонецПериода, 
			|		Организация = &Организация 
			|		И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК СчетаБухгалтерскогоУчетаОССрезПоследних
			|;
			|
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СчетаБухгалтерскогоУчетаОССрезПоследних.Период,
			|	СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство,
			|	СчетаБухгалтерскогоУчетаОССрезПоследних.Организация,
			|	"+?(ИспользуетсяУправлениеВНА_2_4,"ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)", "СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета")+" КАК СчетУчета,
			|	"+?(ИспользуетсяУправлениеВНА_2_4,"ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)", "СчетаБухгалтерскогоУчетаОССрезПоследних.СчетНачисленияАмортизации")+" КАК СчетНачисленияАмортизации
			|ПОМЕСТИТЬ ВТ_СчетаБухгалтерскогоУчетаОССрезПоследних
			|ИЗ
			|	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(&КонецПериода, Организация = &Организация И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК СчетаБухгалтерскогоУчетаОССрезПоследних
			|ИНДЕКСИРОВАТЬ ПО
			|	СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство
			|;
			|
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПервоначальныеСведения.*
			|ПОМЕСТИТЬ ВТ_ПервоначальныеСведенияОС
			|ИЗ
			|	РегистрСведений.ПервоначальныеСведенияОС"+?(ИспользуетсяУправлениеВНА_2_4, "", "БухгалтерскийУчет")+".СрезПоследних(" + ?(ГодовойРасчет, "&Период", "&КонецПериода") + ", Организация = &Организация И ОсновноеСредство В (ВЫБРАТЬ СписокОС.ОсновноеСредство ИЗ СписокОС)) КАК ПервоначальныеСведения
			|ИНДЕКСИРОВАТЬ ПО
			|	ПервоначальныеСведения.ОсновноеСредство
			|;
			|
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтавкиНалогаНаИмуществоСрезПоследних.*
			|ПОМЕСТИТЬ ВТ_СтавкиНалогаНаИмуществоСрезПоследних
			|ИЗ
			|	РегистрСведений.СтавкиНалогаНаИмущество.СрезПоследних(&КонецПериода, Организация = &Организация) КАК СтавкиНалогаНаИмуществоСрезПоследних
			|;";
			
			Если ИспользуетсяУправлениеВНА_2_4 Тогда
				
				Если Месяц(мДатаКонцаПериодаОтчета)+1 = Месяц(Период) И НЕ РасчетПоФактическойСтоимости Тогда
					
					Запрос.Текст = Запрос.Текст +
					"ВЫБРАТЬ
					|	СтоимостьОС.СтоимостьБУ КАК СтоимостьРегл,
					|	СтоимостьОС.ОсновноеСредство КАК ОсновноеСредство
					|ПОМЕСТИТЬ СписокОС_РасчетПоПредварительнойСтоимости
					|ИЗ
					|	Документ.ПринятиеКУчетуОС2_4 КАК ПринятиеКУчетуОС
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОС2_4.ОС КАК СтоимостьОС
					|		ПО (СтоимостьОС.Ссылка = ПринятиеКУчетуОС.Ссылка)
					|ГДЕ
					|	ПринятиеКУчетуОС.Организация = &Организация
					|	И ПринятиеКУчетуОС.Проведен
					|	И ПринятиеКУчетуОС.ОтражатьВРеглУчете
					|	И ПринятиеКУчетуОС.Дата МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
					|	И СтоимостьОС.ОсновноеСредство В
					|			(ВЫБРАТЬ
					|				СписокОС.ОсновноеСредство
					|			ИЗ
					|				СписокОС КАК СписокОС)
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|
					|ВЫБРАТЬ
					|	СтоимостьОС.СтоимостьБУ,
					|	СтоимостьОС.ОсновноеСредство
					|ИЗ
					|	Документ.МодернизацияОС2_4 КАК МодернизацияОС2_4
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МодернизацияОС2_4.ОС КАК СтоимостьОС
					|		ПО (СтоимостьОС.Ссылка = МодернизацияОС2_4.Ссылка)
					|ГДЕ
					|	МодернизацияОС2_4.Организация = &Организация
					|	И МодернизацияОС2_4.Проведен
					|	И МодернизацияОС2_4.ОтражатьВРеглУчете
					|	И МодернизацияОС2_4.Дата МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
					|	И СтоимостьОС.ОсновноеСредство В
					|			(ВЫБРАТЬ
					|				СписокОС.ОсновноеСредство
					|			ИЗ
					|				СписокОС)
					|
					|ИНДЕКСИРОВАТЬ ПО
					|	ОсновноеСредство
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
					|	СУММА(СписокОС.СтоимостьРегл) КАК СтоимостьРегл
					|ПОМЕСТИТЬ ВТ_ПредварительнаяСтоимостьОС
					|ИЗ
					|	(ВЫБРАТЬ
					|		СтоимостьОС.ОсновноеСредство КАК ОсновноеСредство,
					|		СтоимостьОС.СтоимостьРеглОстаток + СтоимостьОС.СтоимостьЦФОстаток КАК СтоимостьРегл
					|	ИЗ
					|		РегистрНакопления.СтоимостьОС.Остатки(
					|				&НачалоПредыдущегоМесяца,
					|				Организация = &Организация
					|					И ОсновноеСредство В
					|						(ВЫБРАТЬ
					|							СписокОС.ОсновноеСредство
					|						ИЗ
					|							СписокОС_РасчетПоПредварительнойСтоимости КАК СписокОС)) КАК СтоимостьОС
					|	
					|	ОБЪЕДИНИТЬ ВСЕ
					|	
					|	ВЫБРАТЬ
					|		СтоимостьОС.ОсновноеСредство,
					|		СтоимостьОС.СтоимостьРегл
					|	ИЗ
					|		СписокОС_РасчетПоПредварительнойСтоимости КАК СтоимостьОС) КАК СписокОС
					|
					|СГРУППИРОВАТЬ ПО
					|	СписокОС.ОсновноеСредство
					|
					|ИНДЕКСИРОВАТЬ ПО
					|	ОсновноеСредство
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	СУММА(СтоимостьОС.СтоимостьРеглОстаток + СтоимостьОС.СтоимостьЦФОстаток) КАК СтоимостьРегл,
					|	СтоимостьОС.ОсновноеСредство КАК ОсновноеСредство
					|ПОМЕСТИТЬ ВТ_СтоимостьОС
					|ИЗ
					|	РегистрНакопления.СтоимостьОС.Остатки(
					|			&Период,
					|			Организация = &Организация
					|				И ОсновноеСредство В
					|					(ВЫБРАТЬ
					|						СписокОС.ОсновноеСредство
					|					ИЗ
					|						СписокОС КАК СписокОС)) КАК СтоимостьОС
					|
					|СГРУППИРОВАТЬ ПО
					|	СтоимостьОС.ОсновноеСредство
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьРегл, СтоимостьОС.СтоимостьРегл) КАК СуммаОстатокДт,
					|	СтоимостьОС.ОсновноеСредство КАК Субконто1,
					|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК Счет
					|ПОМЕСТИТЬ ВТ_ПервоначальнаяСтоимостьОС
					|ИЗ
					|	ВТ_СтоимостьОС КАК СтоимостьОС
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПредварительнаяСтоимостьОС КАК ПредварительнаяСтоимостьОС
					|		ПО (ПредварительнаяСтоимостьОС.ОсновноеСредство = СтоимостьОС.ОсновноеСредство)
					|
					|ИНДЕКСИРОВАТЬ ПО
					|	СтоимостьОС.ОсновноеСредство
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|";
					
				Иначе
					
					Запрос.Текст = Запрос.Текст +
					"ВЫБРАТЬ
					|	СтоимостьОС.СтоимостьРеглОстаток + СтоимостьОС.СтоимостьЦФОстаток  КАК СуммаОстатокДт,
					|	СтоимостьОС.ОсновноеСредство КАК Субконто1,
					|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК Счет
					|ПОМЕСТИТЬ ВТ_ПервоначальнаяСтоимостьОС
					|ИЗ
					|	РегистрНакопления.СтоимостьОС.Остатки(
					|			&Период,
					|			Организация = &Организация
					|				И ОсновноеСредство В
					|					(ВЫБРАТЬ
					|						СписокОС.ОсновноеСредство
					|					ИЗ
					|						СписокОС)) КАК СтоимостьОС
					|
					|ИНДЕКСИРОВАТЬ ПО
					|	СтоимостьОС.ОсновноеСредство
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|";
				
				КонецЕсли; 
				
				Запрос.Текст = Запрос.Текст +
				"ВЫБРАТЬ
				|	-(АмортизацияОС.АмортизацияРеглОстаток + АмортизацияОС.АмортизацияЦФОстаток) КАК СуммаОстатокДт,
				|	-(АмортизацияОС.АмортизацияРеглОстаток + АмортизацияОС.АмортизацияЦФОстаток) КАК СуммаОстатокКт,
				|	АмортизацияОС.ОсновноеСредство КАК Субконто1,
				|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК Счет
				|ПОМЕСТИТЬ ВТ_АмортизацияОС
				|ИЗ
				|	РегистрНакопления.АмортизацияОС.Остатки(
				|			&Период,
				|			Организация = &Организация
				|				И ОсновноеСредство В
				|					(ВЫБРАТЬ
				|						СписокОС.ОсновноеСредство
				|					ИЗ
				|						СписокОС)) КАК АмортизацияОС
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	АмортизацияОС.ОсновноеСредство";
				
			Иначе
				
				Запрос.Текст = Запрос.Текст +
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ПервоначальнаяСтоимостьОС.СуммаОстатокДт,
				|	ПервоначальнаяСтоимостьОС.Субконто1,
				|	ПервоначальнаяСтоимостьОС.Счет
				|ПОМЕСТИТЬ ВТ_ПервоначальнаяСтоимостьОС
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный.Остатки(
				|			&Период,
				|			Счет В
				|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|					СчетаУчетаОС.СчетУчета
				|				ИЗ
				|					СчетаУчетаОС
				|				ГДЕ
				|					СчетаУчетаОС.СчетУчета ЕСТЬ НЕ NULL ),
				|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
				|			Организация = &Организация) КАК ПервоначальнаяСтоимостьОС
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	ПервоначальнаяСтоимостьОС.Субконто1
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	АмортизацияОС.СуммаОстатокДт,
				|	АмортизацияОС.СуммаОстатокКт,
				|	АмортизацияОС.Субконто1,
				|	АмортизацияОС.Счет
				|ПОМЕСТИТЬ ВТ_АмортизацияОС
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный.Остатки(
				|			&Период,
				|			Счет В
				|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|					СчетаУчетаОС.СчетНачисленияАмортизации
				|				ИЗ
				|					СчетаУчетаОС
				|				ГДЕ
				|					СчетаУчетаОС.СчетНачисленияАмортизации ЕСТЬ НЕ NULL ),
				|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
				|			Организация = &Организация) КАК АмортизацияОС
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	АмортизацияОС.Субконто1";
				
			КонецЕсли; 
			
			Запрос.Выполнить();
		КонецЕсли;
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.Период) КАК Период,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ОсновноеСредство КАК ОсновноеСредство
		|ПОМЕСТИТЬ ВТ_СрезПоследних
		|ИЗ
		|	РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.СрезПоследних(&КонецПериода, Организация = &Организация И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних
		|СГРУППИРОВАТЬ ПО
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ОсновноеСредство
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство,Период
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СрезПоследних.ОсновноеСредство,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.Организация,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ОсновноеСредство КАК ОсновноеСредство1,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПостановкаНаУчетВНалоговомОргане,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.НалоговыйОрган,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.НалоговаяСтавка,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляВПравеОбщейСобственностиЧислитель,
		|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляВПравеОбщейСобственностиЗнаменатель
		|ПОМЕСТИТЬ ВТ_СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних
		|ИЗ
		|	ВТ_СрезПоследних КАК СрезПоследних
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.СрезПоследних(&КонецПериода, Организация = &Организация И ОсновноеСредство В (ВЫБРАТЬ ОсновноеСредство ИЗ СписокОС)) КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних
		|	ПО СрезПоследних.Период = СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.Период
		|	И СрезПоследних.ОсновноеСредство = СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ОсновноеСредство
		|;";

		
		Если НЕ ГодовойРасчет И Период >= мДатаНачалаПериодаОтчета Тогда
			Если ИспользуетсяУправлениеВНА_2_4 Тогда
				
				Если Месяц(мДатаКонцаПериодаОтчета)+1 = Месяц(Период) И НЕ РасчетПоФактическойСтоимости Тогда
					
					Запрос.Текст = Запрос.Текст +
					"ВЫБРАТЬ
					|	СтоимостьОС.СтоимостьБУ КАК СтоимостьРегл,
					|	СтоимостьОС.ОсновноеСредство КАК ОсновноеСредство
					|ПОМЕСТИТЬ СписокОС_РасчетПоПредварительнойСтоимостиОбороты
					|ИЗ
					|	Документ.ПринятиеКУчетуОС2_4 КАК ПринятиеКУчетуОС
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОС2_4.ОС КАК СтоимостьОС
					|		ПО (СтоимостьОС.Ссылка = ПринятиеКУчетуОС.Ссылка)
					|ГДЕ
					|	ПринятиеКУчетуОС.Организация = &Организация
					|	И ПринятиеКУчетуОС.Проведен
					|	И ПринятиеКУчетуОС.ОтражатьВРеглУчете
					|	И ПринятиеКУчетуОС.Дата МЕЖДУ &Период И &КонецМесяца
					|	И СтоимостьОС.ОсновноеСредство В
					|			(ВЫБРАТЬ
					|				СписокОС.ОсновноеСредство
					|			ИЗ
					|				СписокОС КАК СписокОС)
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|
					|ВЫБРАТЬ
					|	СтоимостьОС.СтоимостьБУ,
					|	СтоимостьОС.ОсновноеСредство
					|ИЗ
					|	Документ.МодернизацияОС2_4 КАК МодернизацияОС2_4
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МодернизацияОС2_4.ОС КАК СтоимостьОС
					|		ПО (СтоимостьОС.Ссылка = МодернизацияОС2_4.Ссылка)
					|ГДЕ
					|	МодернизацияОС2_4.Организация = &Организация
					|	И МодернизацияОС2_4.Проведен
					|	И МодернизацияОС2_4.ОтражатьВРеглУчете
					|	И МодернизацияОС2_4.Дата МЕЖДУ &Период И &КонецМесяца
					|	И СтоимостьОС.ОсновноеСредство В
					|			(ВЫБРАТЬ
					|				СписокОС.ОсновноеСредство
					|			ИЗ
					|				СписокОС)
					|
					|ИНДЕКСИРОВАТЬ ПО
					|	ОсновноеСредство
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
					|	СУММА(СписокОС.СтоимостьРегл) КАК СтоимостьРегл
					|ПОМЕСТИТЬ ВТ_ПредварительнаяСтоимостьОСОбороты
					|ИЗ
					|	(ВЫБРАТЬ
					|		СтоимостьОС.ОсновноеСредство,
					|		СтоимостьОС.СтоимостьРегл
					|	ИЗ
					|		СписокОС_РасчетПоПредварительнойСтоимостиОбороты КАК СтоимостьОС) КАК СписокОС
					|
					|СГРУППИРОВАТЬ ПО
					|	СписокОС.ОсновноеСредство
					|
					|ИНДЕКСИРОВАТЬ ПО
					|	ОсновноеСредство
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	СУММА(СтоимостьОС.СтоимостьРегл + СтоимостьОС.СтоимостьЦФ) КАК СтоимостьРегл,
					|	СтоимостьОС.ОсновноеСредство КАК ОсновноеСредство
					|ПОМЕСТИТЬ ВТ_СтоимостьОСОбороты
					|ИЗ
					|	РегистрНакопления.СтоимостьОС КАК СтоимостьОС
					|ГДЕ
					|	СтоимостьОС.Период МЕЖДУ &Период И &КонецМесяца
					|	И СтоимостьОС.Активность
					|	И СтоимостьОС.ХозяйственнаяОперация В (
					|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуОС),
					|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуОСпоИнвентаризации),
					|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.МодернизацияОС))
					|	И СтоимостьОС.Организация = &Организация
					|	И СтоимостьОС.ОсновноеСредство В
					|					(ВЫБРАТЬ
					|						СписокОС.ОсновноеСредство
					|					ИЗ
					|						СписокОС)
					|	И СтоимостьОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
					|
					|СГРУППИРОВАТЬ ПО
					|	СтоимостьОС.ОсновноеСредство
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ЕСТЬNULL(ПредварительнаяСтоимостьОСОбороты.СтоимостьРегл, СтоимостьОСОбороты.СтоимостьРегл) КАК СуммаОборотДт,
					|	СтоимостьОСОбороты.ОсновноеСредство КАК Субконто1,
					|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК Счет
					|ПОМЕСТИТЬ ВТ_ПервоначальнаяСтоимостьОСПоступивших
					|ИЗ
					|	ВТ_СтоимостьОСОбороты КАК СтоимостьОСОбороты
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПредварительнаяСтоимостьОСОбороты КАК ПредварительнаяСтоимостьОСОбороты
					|		ПО (ПредварительнаяСтоимостьОСОбороты.ОсновноеСредство = СтоимостьОСОбороты.ОсновноеСредство)
					|
					|ИНДЕКСИРОВАТЬ ПО
					|	СтоимостьОСОбороты.ОсновноеСредство
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|";
					
				Иначе
					
					Запрос.Текст = Запрос.Текст +
					"ВЫБРАТЬ
					|	СУММА(СтоимостьОС.СтоимостьРегл + СтоимостьОС.СтоимостьЦФ) КАК СуммаОборотДт,
					|	СтоимостьОС.ОсновноеСредство КАК Субконто1,
					|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК Счет
					|ПОМЕСТИТЬ ВТ_ПервоначальнаяСтоимостьОСПоступивших
					|ИЗ
					|	РегистрНакопления.СтоимостьОС КАК СтоимостьОС
					|ГДЕ
					|	СтоимостьОС.Период МЕЖДУ &Период И &КонецМесяца
					|	И СтоимостьОС.Активность
					|	И СтоимостьОС.ХозяйственнаяОперация В (
					|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуОС),
					|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуОСпоИнвентаризации),
					|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.УвеличениеСтоимостиОС),
					|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.УменьшениеВеличиныДооценкиСтоимостиОС),
					|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.МодернизацияОС))
					|	И СтоимостьОС.Организация = &Организация
					|	И СтоимостьОС.ОсновноеСредство В
					|					(ВЫБРАТЬ
					|						СписокОС.ОсновноеСредство
					|					ИЗ
					|						СписокОС)
					|	И СтоимостьОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
					|
					|СГРУППИРОВАТЬ ПО
					|	СтоимостьОС.ОсновноеСредство
					|
					|ИНДЕКСИРОВАТЬ ПО
					|	СтоимостьОС.ОсновноеСредство
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|";
		
				КонецЕсли; 
				
				Запрос.Текст = Запрос.Текст +
				"ВЫБРАТЬ
				|	СУММА(СтоимостьОС.СтоимостьРегл + СтоимостьОС.СтоимостьЦФ) КАК СуммаОборотКт,
				|	СтоимостьОС.ОсновноеСредство КАК Субконто1,
				|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК Счет
				|ПОМЕСТИТЬ ВТ_УменьшениеСтоимости
				|ИЗ
				|	РегистрНакопления.СтоимостьОС КАК СтоимостьОС
				|ГДЕ
				|	СтоимостьОС.Период МЕЖДУ &Период И &КонецМесяца
				|	И СтоимостьОС.Активность
				|	И НЕ СтоимостьОС.ХозяйственнаяОперация В (
				|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИзменениеПараметровСтоимостиОС),
				|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеАмортизацииОС))
				|	И СтоимостьОС.Организация = &Организация
				|	И СтоимостьОС.ОсновноеСредство В
				|					(ВЫБРАТЬ
				|						СписокОС.ОсновноеСредство
				|					ИЗ
				|						СписокОС)
				|	И СтоимостьОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
				|
				|СГРУППИРОВАТЬ ПО
				|	СтоимостьОС.ОсновноеСредство
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	СтоимостьОС.ОсновноеСредство
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|";
				
			Иначе
				
				Запрос.Текст = Запрос.Текст +
				"
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ПервоначальнаяСтоимостьОС.СуммаОборотДт,
				|	ПервоначальнаяСтоимостьОС.Субконто1,
				|	ПервоначальнаяСтоимостьОС.Счет
				|ПОМЕСТИТЬ ВТ_ПервоначальнаяСтоимостьОСПоступивших
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный.Обороты(&Период, &КонецМесяца, , 
				|			Счет В (ВЫБРАТЬ РАЗЛИЧНЫЕ СчетУчета ИЗ СчетаУчетаОС ГДЕ СчетУчета ЕСТЬ НЕ NULL), 
				|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства), 
				|			Организация = &Организация, КорСчет НЕ В ИЕРАРХИИ (&СчетаУчетаОС)
				|	) КАК ПервоначальнаяСтоимостьОС
				|ИНДЕКСИРОВАТЬ ПО
				|	ПервоначальнаяСтоимостьОС.Субконто1
				|;
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	СтоимостьОС.СуммаОборотКт,
				|	СтоимостьОС.Субконто1,
				|	СтоимостьОС.Счет
				|ПОМЕСТИТЬ ВТ_УменьшениеСтоимости //переоценки, частичное списание
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный.Обороты(&Период, &КонецМесяца, , 
				|			Счет В (ВЫБРАТЬ РАЗЛИЧНЫЕ СчетУчета ИЗ СчетаУчетаОС ГДЕ СчетУчета ЕСТЬ НЕ NULL), 
				|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства), 
				|			Организация = &Организация, КорСчет НЕ В ИЕРАРХИИ (&СчетаУчетаОС)
				|	) КАК СтоимостьОС
				|ИНДЕКСИРОВАТЬ ПО
				|	СтоимостьОС.Субконто1
				|;
				|";
				
			КонецЕсли; 
			
		КонецЕсли;	
		
		Запрос.УстановитьПараметр("ОсновнойНалоговыйОрган", РеквизитыОрганизации.РегистрацияВНалоговомОргане);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СписокОС.ОсновноеСредство,
		|	ВЫБОР
		|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
		|			ТОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.НалоговыйОрган
		|		ИНАЧЕ 
		|			&ОсновнойНалоговыйОрган
		|	КОНЕЦ КАК РегистрацияВНалоговомОргане,
		|	ВЫБОР 
		|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследнихНачалоМесяца.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.НеПодлежитНалогообложению)
		|			ТОГДА ЛОЖЬ 
		|		КОГДА ОСПринятыеКУчетуНачалоМесяца.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета)
		|			ТОГДА ЛОЖЬ 
		|		ИНАЧЕ ИСТИНА 
		|	КОНЕЦ КАК ВключатьВНалоговуюБазу,
		//|	ВЫБОР 
		//|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.НеПодлежитНалогообложению)
		//|			ТОГДА ЛОЖЬ 
		//|		КОГДА ОСПринятыеКУчету.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета)
		//|			ТОГДА ЛОЖЬ 
		//|		ИНАЧЕ ИСТИНА 
		//|	КОНЕЦ КАК ВключатьВНалоговуюБазуПоСостояниюНаКонецМесяца,
		|	ОСПринятыеКУчету.Состояние КАК Состояние,
		|	" + Счетчик + " КАК Период" + 
		?(Период >= мДатаНачалаПериодаОтчета, ",
		//+
		|	ОСПринятыеКУчету.Состояние КАК СостояниеВОтчетномПериоде,
		|	ВЫБОР 
		|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.НеПодлежитНалогообложению)
		|			ТОГДА ЛОЖЬ 
		|		КОГДА ОСПринятыеКУчету.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета)
		|			ТОГДА ЛОЖЬ 
		|		ИНАЧЕ ИСТИНА 
		|	КОНЕЦ КАК ВключатьВНалоговуюБазуПоСостояниюНаКонецМесяца,
		//-
		|	ВЫБОР
		|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения)
		|			ТОГДА ИСТИНА
		|		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ЕСТЬNULL(СтавкиНалогаНаИмуществоСрезПоследних.ОсвобождениеОтНалогообложения, ЛОЖЬ)
		|	КОНЕЦ КАК ОсвобождениеОтНалогообложения,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ПервоначальнаяСтоимостьОС.СуммаОстатокДт, 0) - ЕСТЬNULL(АмортизацияОС.СуммаОстатокКт, 0) КАК ЧИСЛО(15, 2)) КАК ОстаточнаяСтоимость
		|//КвартальныйРасчет	,ВЫРАЗИТЬ(ЕСТЬNULL(ПервоначальнаяСтоимостьОСПоступивших.СуммаОборотДт, 0) КАК ЧИСЛО(15, 2)) КАК ПервоначальнаяСтоимостьПоступивших
		|//КвартальныйРасчет	,ВЫРАЗИТЬ(ЕСТЬNULL(УменьшениеСтоимости.СуммаОборотКт, 0) КАК ЧИСЛО(15, 2)) КАК УменьшениеСтоимости
		|//КвартальныйРасчет	,ВЫБОР
		|//КвартальныйРасчет		КОГДА СтавкиНалогаНаИмуществоПоОтдельнымОСКонецПредыдущегоМесяца.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
		|//КвартальныйРасчет			ТОГДА СтавкиНалогаНаИмуществоПоОтдельнымОСКонецПредыдущегоМесяца.НалоговыйОрган
		|//КвартальныйРасчет		ИНАЧЕ 
		|//КвартальныйРасчет			&ОсновнойНалоговыйОрган
		|//КвартальныйРасчет	КОНЕЦ КАК РегистрацияВНалоговомОрганеСтарый" 
		,"
		//+
		|	,NULL КАК СостояниеВОтчетномПериоде
		|	,NULL КАК ВключатьВНалоговуюБазуПоСостояниюНаКонецМесяца
		//-
		|	,ЛОЖЬ КАК ОсвобождениеОтНалогообложения,
		|	0 КАК ОстаточнаяСтоимость
		|//КвартальныйРасчет	,0 КАК ПервоначальнаяСтоимостьПоступивших
		|//КвартальныйРасчет	,0 КАК УменьшениеСтоимости
		|//КвартальныйРасчет	,NULL КАК РегистрацияВНалоговомОрганеСтарый") + "
		|ПОМЕСТИТЬ
		|	Выборка" + Формат(Счетчик, "ЧЦ=2; ЧВН=") + "
		|ИЗ
		|	СписокОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних
		|		ПО СписокОС.ОсновноеСредство = СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследнихНачалоМесяца КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследнихНачалоМесяца
		|		ПО СписокОС.ОсновноеСредство = СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследнихНачалоМесяца.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОСПринятыеКУчету КАК ОСПринятыеКУчету
		|		ПО СписокОС.ОсновноеСредство = ОСПринятыеКУчету.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОСПринятыеКУчетуНачалоМесяца КАК ОСПринятыеКУчетуНачалоМесяца
		|		ПО СписокОС.ОсновноеСредство = ОСПринятыеКУчетуНачалоМесяца.ОсновноеСредство" 
		+ ?(Период >= мДатаНачалаПериодаОтчета, "
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервоначальныеСведенияОС КАК ПервоначальныеСведенияОС
		|		ПО СписокОС.ОсновноеСредство = ПервоначальныеСведенияОС.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаБухгалтерскогоУчетаОССрезПоследних КАК СчетаБухгалтерскогоУчетаОССрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервоначальнаяСтоимостьОС КАК ПервоначальнаяСтоимостьОС
		|			ПО (СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета = ПервоначальнаяСтоимостьОС.Счет)
		|			 И СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство = ПервоначальнаяСтоимостьОС.Субконто1
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АмортизацияОС КАК АмортизацияОС
		|			ПО СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство = АмортизацияОС.Субконто1
		|			 И СчетаБухгалтерскогоУчетаОССрезПоследних.СчетНачисленияАмортизации = АмортизацияОС.Счет
		|//КвартальныйРасчет	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервоначальнаяСтоимостьОСПоступивших КАК ПервоначальнаяСтоимостьОСПоступивших
		|//КвартальныйРасчет	ПО (СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета = ПервоначальнаяСтоимостьОСПоступивших.Счет)
		|//КвартальныйРасчет	 И СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство = ПервоначальнаяСтоимостьОСПоступивших.Субконто1
		|//КвартальныйРасчет	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УменьшениеСтоимости КАК УменьшениеСтоимости
		|//КвартальныйРасчет	ПО (СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета = УменьшениеСтоимости.Счет)
		|//КвартальныйРасчет	 И СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство = УменьшениеСтоимости.Субконто1
		|		ПО СписокОС.ОсновноеСредство = СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство
		|//КвартальныйРасчет	ЛЕВОЕ СОЕДИНЕНИЕ СтавкиНалогаНаИмуществоПоОтдельнымОСКонецПредыдущегоМесяца КАК СтавкиНалогаНаИмуществоПоОтдельнымОСКонецПредыдущегоМесяца
		|//КвартальныйРасчет	ПО СписокОС.ОсновноеСредство = СтавкиНалогаНаИмуществоПоОтдельнымОСКонецПредыдущегоМесяца.ОсновноеСредство
		|	,ВТ_СтавкиНалогаНаИмуществоСрезПоследних КАК СтавкиНалогаНаИмуществоСрезПоследних", "");
		Если НЕ ГодовойРасчет Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "//КвартальныйРасчет", "");
		КонецЕсли;	
		Запрос.Выполнить();
		
		Запрос.Текст = 
		"УНИЧТОЖИТЬ ОСПринятыеКУчету;
		|УНИЧТОЖИТЬ ВТ_СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних;
		|УНИЧТОЖИТЬ ВТ_СрезПоследних;
		|УНИЧТОЖИТЬ СписокОС;
		|УНИЧТОЖИТЬ ОСПринятыеКУчетуНачалоМесяца;
		|УНИЧТОЖИТЬ СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамНачалоМесяца;
		|УНИЧТОЖИТЬ СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследнихНачалоМесяца;
		|УНИЧТОЖИТЬ СписокРазрешенныхОС;"
		+ ?(Период >= мДатаНачалаПериодаОтчета, "
		|//КвартальныйРасчет	УНИЧТОЖИТЬ СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследнихПериодов;
		|//КвартальныйРасчет	УНИЧТОЖИТЬ СтавкиНалогаНаИмуществоПоОтдельнымОСКонецПредыдущегоМесяца;
		|//КвартальныйРасчет	УНИЧТОЖИТЬ ВТ_ПервоначальнаяСтоимостьОСПоступивших;
		|//КвартальныйРасчет	УНИЧТОЖИТЬ ВТ_УменьшениеСтоимости;
		|УНИЧТОЖИТЬ СчетаУчетаОС;
		|УНИЧТОЖИТЬ ВТ_ПервоначальнаяСтоимостьОС;
		|УНИЧТОЖИТЬ ВТ_ПервоначальныеСведенияОС;
		|УНИЧТОЖИТЬ ВТ_СчетаБухгалтерскогоУчетаОССрезПоследних;
		|УНИЧТОЖИТЬ ВТ_СтавкиНалогаНаИмуществоСрезПоследних;
		|УНИЧТОЖИТЬ ВТ_АмортизацияОС;", "");
		
		Если НЕ ГодовойРасчет Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "//КвартальныйРасчет", "");
		КонецЕсли;	
		Запрос.Выполнить();
				
		ТекстОбъединяющегоЗапроса = 
			ТекстОбъединяющегоЗапроса
			+ ?(ПустаяСтрока(ТекстОбъединяющегоЗапроса), 
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ *
					|",
					"ОБЪЕДИНИТЬ ВСЕ
					|ВЫБРАТЬ *
					|")
			+ ?(ПустаяСтрока(ТекстОбъединяющегоЗапроса), 
					"ПОМЕСТИТЬ НалоговаяБазаПоНалогуНаИмущество
					|",
					"")
			+ "ИЗ Выборка" + Формат(Счетчик, "ЧЦ=2; ЧВН=") + ?(Период >= мДатаНачалаПериодаОтчета, "
			|ГДЕ
			|	ОстаточнаяСтоимость > 0
			|//КвартальныйРасчет	ИЛИ ПервоначальнаяСтоимостьПоступивших > 0 ИЛИ УменьшениеСтоимости > 0
			|", "
			|");
			
		Счетчик = Счетчик + 1;
		Период  = ДобавитьМесяц(Период, 1);
	КонецЦикла;
	
	Если ТекстОбъединяющегоЗапроса <> "" Тогда
		
		Запрос.Текст = ТекстОбъединяющегоЗапроса;
		Если НЕ ГодовойРасчет Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "//КвартальныйРасчет", "");
		КонецЕсли;	
		Запрос.Выполнить();
		
		Делитель = Месяц(ПериодРасчета) + 1;
		Запрос.УстановитьПараметр("КонечныйПериод", Делитель);
		Запрос.УстановитьПараметр("НачалоГода", НачалоГода(мДатаНачалаПериодаОтчета));
		Запрос.УстановитьПараметр("ГраницаНачалоПериодаОтчета", Новый Граница(НачалоМесяца(мДатаНачалаПериодаОтчета), ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("НачалоПериодаОтчета", НачалоМесяца(мДатаНачалаПериодаОтчета));
				
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПорядокУплатыНалоговНаМестахСрезПоследних.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	ПорядокУплатыНалоговНаМестахСрезПоследних.УплачиваютсяАвансы КАК УплачиваютсяАвансы
		|ПОМЕСТИТЬ ВТ_УплачиваютсяАвансыПоОрганизации
		|ИЗ
		|	РегистрСведений.ПорядокУплатыНалоговНаМестах.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И РегистрацияВНалоговомОргане = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
		|				И Налог = ЗНАЧЕНИЕ(Перечисление.ВидыИмущественныхНалогов.НалогНаИмущество)) КАК ПорядокУплатыНалоговНаМестахСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПорядокУплатыНалоговНаМестахСрезПоследних.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	ПорядокУплатыНалоговНаМестахСрезПоследних.УплачиваютсяАвансы КАК УплачиваютсяАвансы
		|ПОМЕСТИТЬ ВТ_УплачиваютсяАвансыПоИФНС
		|ИЗ
		|	РегистрСведений.ПорядокУплатыНалоговНаМестах.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И РегистрацияВНалоговомОргане <> ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
		|				И Налог = ЗНАЧЕНИЕ(Перечисление.ВидыИмущественныхНалогов.НалогНаИмущество)) КАК ПорядокУплатыНалоговНаМестахСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	РегистрацияВНалоговомОргане
		|";
		Запрос.Выполнить();
		
		Если Не ГодовойРасчет Тогда
			
			Если ИспользуетсяУправлениеВНА_2_4 Тогда
				Запрос.Текст = "
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	СУММА(ПервоначальнаяСтоимостьОС.СтоимостьРегл) КАК СуммаОборотДт,
				|	ПервоначальнаяСтоимостьОС.ОсновноеСредство КАК Субконто1,
				|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК Счет
				|ПОМЕСТИТЬ ВТ_ПервоначальнаяСтоимостьОСПоступившихСНачалаГода
				|ИЗ
				|	РегистрНакопления.СтоимостьОС КАК ПервоначальнаяСтоимостьОС
				|ГДЕ
				|	ПервоначальнаяСтоимостьОС.Период МЕЖДУ &НачалоГода И &НачалоПериодаОтчета
				|	И ПервоначальнаяСтоимостьОС.Активность
				|	И ПервоначальнаяСтоимостьОС.ХозяйственнаяОперация В (
				|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуОС),
				|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПринятиеКУчетуОСпоИнвентаризации),
				|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.УвеличениеСтоимостиОС),
				|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.УменьшениеВеличиныДооценкиСтоимостиОС),
				|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.МодернизацияОС))
				|	И ПервоначальнаяСтоимостьОС.Организация = &Организация
				|	И ПервоначальнаяСтоимостьОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
				|
				|СГРУППИРОВАТЬ ПО
				|	ПервоначальнаяСтоимостьОС.ОсновноеСредство					
				|ИНДЕКСИРОВАТЬ ПО
				|	ПервоначальнаяСтоимостьОС.ОсновноеСредство
				|;
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство,
				|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетУчета,
				|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетНачисленияАмортизации
				|ПОМЕСТИТЬ ВТ_СчетаУчетаОС
				|ИЗ
				|	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(&ГраницаНачалоПериодаОтчета, Организация = &Организация И ОсновноеСредство В (ВЫБРАТЬ РАЗЛИЧНЫЕ НалоговаяБаза.ОсновноеСредство ИЗ НалоговаяБазаПоНалогуНаИмущество КАК НалоговаяБаза)) КАК СчетаБухгалтерскогоУчетаОССрезПоследних
				|ИНДЕКСИРОВАТЬ ПО
				|	СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство
				|;
				|
				|ВЫБРАТЬ
				|	СтоимостьОС.СтоимостьРеглОстаток + СтоимостьОС.СтоимостьЦФОстаток  КАК СуммаОстатокДт,
				|	СтоимостьОС.ОсновноеСредство КАК Субконто1,
				|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК Счет
				|ПОМЕСТИТЬ ВТ_ПервоначальнаяСтоимостьОС
				|ИЗ
				|	РегистрНакопления.СтоимостьОС.Остатки(
				|			&НачалоГода,
				|			Организация = &Организация
				|				И ОсновноеСредство В
				|					(ВЫБРАТЬ
				|						НалоговаяБаза.ОсновноеСредство
				|					ИЗ
				|						НалоговаяБазаПоНалогуНаИмущество КАК НалоговаяБаза)) КАК СтоимостьОС
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	СтоимостьОС.ОсновноеСредство
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	-(АмортизацияОС.АмортизацияРеглОстаток + АмортизацияОС.АмортизацияЦФОстаток) КАК СуммаОстатокДт,
				|	-(АмортизацияОС.АмортизацияРеглОстаток + АмортизацияОС.АмортизацияЦФОстаток) КАК СуммаОстатокКт,
				|	АмортизацияОС.ОсновноеСредство КАК Субконто1,
				|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК Счет
				|ПОМЕСТИТЬ ВТ_АмортизацияОС
				|ИЗ
				|	РегистрНакопления.АмортизацияОС.Остатки(
				|			&НачалоГода,
				|			Организация = &Организация
				|				И ОсновноеСредство В
				|					(ВЫБРАТЬ
				|						НалоговаяБаза.ОсновноеСредство
				|					ИЗ
				|						НалоговаяБазаПоНалогуНаИмущество КАК НалоговаяБаза)) КАК АмортизацияОС
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	АмортизацияОС.ОсновноеСредство";
	
			Иначе
				Запрос.Текст = "
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ПервоначальнаяСтоимостьОС.СуммаОборотДт,
				|	ПервоначальнаяСтоимостьОС.Субконто1,
				|	ПервоначальнаяСтоимостьОС.Счет
				|ПОМЕСТИТЬ ВТ_ПервоначальнаяСтоимостьОСПоступившихСНачалаГода
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоГода, &ГраницаНачалоПериодаОтчета, , Счет В ИЕРАРХИИ(&СчетаУчетаОСПервоначальнойСтоимости), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства), Организация = &Организация, КорСчет НЕ В ИЕРАРХИИ (&СчетаУчетаОС)) КАК ПервоначальнаяСтоимостьОС
				|ИНДЕКСИРОВАТЬ ПО
				|	ПервоначальнаяСтоимостьОС.Субконто1
				|;
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство,
				|	СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета,
				|	СчетаБухгалтерскогоУчетаОССрезПоследних.СчетНачисленияАмортизации
				|ПОМЕСТИТЬ ВТ_СчетаУчетаОС
				|ИЗ
				|	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(&ГраницаНачалоПериодаОтчета, Организация = &Организация И ОсновноеСредство В (ВЫБРАТЬ РАЗЛИЧНЫЕ НалоговаяБаза.ОсновноеСредство ИЗ НалоговаяБазаПоНалогуНаИмущество КАК НалоговаяБаза)) КАК СчетаБухгалтерскогоУчетаОССрезПоследних
				|ИНДЕКСИРОВАТЬ ПО
				|	СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство
				|;
				|
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ПервоначальнаяСтоимостьОС.СуммаОстатокДт,
				|	ПервоначальнаяСтоимостьОС.Субконто1,
				|	ПервоначальнаяСтоимостьОС.Счет
				|ПОМЕСТИТЬ ВТ_ПервоначальнаяСтоимостьОС
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный.Остатки(&НачалоГода, 
				|			Счет В (ВЫБРАТЬ РАЗЛИЧНЫЕ СчетУчета ИЗ ВТ_СчетаУчетаОС ГДЕ СчетУчета ЕСТЬ НЕ NULL), 
				|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства), 
				|			Организация = &Организация
				|		) КАК ПервоначальнаяСтоимостьОС
				|ИНДЕКСИРОВАТЬ ПО
				|	ПервоначальнаяСтоимостьОС.Субконто1
				|;
				|
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	АмортизацияОС.СуммаОстатокДт,
				|	АмортизацияОС.СуммаОстатокКт,
				|	АмортизацияОС.Субконто1,
				|	АмортизацияОС.Счет
				|ПОМЕСТИТЬ ВТ_АмортизацияОС
				|ИЗ
				|	РегистрБухгалтерии.Хозрасчетный.Остатки(&НачалоГода, 
				|			Счет В (ВЫБРАТЬ РАЗЛИЧНЫЕ СчетНачисленияАмортизации ИЗ ВТ_СчетаУчетаОС ГДЕ СчетНачисленияАмортизации ЕСТЬ НЕ NULL), 
				|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства), 
				|			Организация = &Организация
				|		) КАК АмортизацияОС
				|ИНДЕКСИРОВАТЬ ПО
				|	АмортизацияОС.Субконто1
				|";
			КонецЕсли;
			
			Запрос.Выполнить();
			
		КонецЕсли;	
		
		Запрос.Текст = "
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.РегистрацияВНалоговомОргане КАК ИФНС,
		|	ВложенныйЗапрос.ОсвобождениеОтНалогообложения,
		|	ВложенныйЗапрос.ОсновноеСредство,
		|	СУММА(ВложенныйЗапрос.ОстаточнаяСтоимостьНа0101) КАК ОстаточнаяСтоимостьНа0101,
		|	СУММА(ВложенныйЗапрос.ОстаточнаяСтоимостьНа0102) КАК ОстаточнаяСтоимостьНа0102,
		|	СУММА(ВложенныйЗапрос.ОстаточнаяСтоимостьНа0103) КАК ОстаточнаяСтоимостьНа0103,
		|	СУММА(ВложенныйЗапрос.ОстаточнаяСтоимостьНа0104) КАК ОстаточнаяСтоимостьНа0104,
		|	СУММА(ВложенныйЗапрос.ОстаточнаяСтоимостьНа0105) КАК ОстаточнаяСтоимостьНа0105,
		|	СУММА(ВложенныйЗапрос.ОстаточнаяСтоимостьНа0106) КАК ОстаточнаяСтоимостьНа0106,
		|	СУММА(ВложенныйЗапрос.ОстаточнаяСтоимостьНа0107) КАК ОстаточнаяСтоимостьНа0107,
		|	СУММА(ВложенныйЗапрос.ОстаточнаяСтоимостьНа0108) КАК ОстаточнаяСтоимостьНа0108,
		|	СУММА(ВложенныйЗапрос.ОстаточнаяСтоимостьНа0109) КАК ОстаточнаяСтоимостьНа0109,
		|	СУММА(ВложенныйЗапрос.ОстаточнаяСтоимостьНа0110) КАК ОстаточнаяСтоимостьНа0110,
		|	СУММА(ВложенныйЗапрос.ОстаточнаяСтоимостьНа0111) КАК ОстаточнаяСтоимостьНа0111,
		|	СУММА(ВложенныйЗапрос.ОстаточнаяСтоимостьНа0112) КАК ОстаточнаяСтоимостьНа0112,
		|	СУММА(ВложенныйЗапрос.ОстаточнаяСтоимостьНа3112) КАК ОстаточнаяСтоимостьНа3112,
		|	СУММА(ВложенныйЗапрос.ОстаточнаяСтоимостьОсновныхСредств) КАК ОстаточнаяСтоимостьОсновныхСредств,
		|	ЕСТЬNULL(УплачиваютсяАвансыПоИФНС.УплачиваютсяАвансы, ЕСТЬNULL(УплачиваютсяАвансыПоОрганизации.УплачиваютсяАвансы, ЛОЖЬ)) КАК УплачиваютсяАвансы
		|//КвартальныйРасчет	,СУММА(ВложенныйЗапрос.ПервоначальнаяСтоимостьПоступивших) КАК ПервоначальнаяСтоимостьПоступивших
		|//КвартальныйРасчет	,СУММА(ВложенныйЗапрос.УменьшениеСтоимости) КАК УменьшениеСтоимости
		|//КвартальныйРасчет	,(13 - (ВЫБОР КОГДА МИНИМУМ(ВложенныйЗапрос.ПериодПоступления) = 0 ТОГДА 13 ИНАЧЕ МИНИМУМ(ВложенныйЗапрос.ПериодПоступления) КОНЕЦ)) КАК КоличествоМесяцевВладенияПоступивших
		|//КвартальныйРасчет	,(13 - (ВЫБОР КОГДА МИНИМУМ(ВложенныйЗапрос.ПериодВыбытия)= 0 ТОГДА 13 ИНАЧЕ МИНИМУМ(ВложенныйЗапрос.ПериодВыбытия) КОНЕЦ)) КАК КоличествоМесяцевВладенияВыбывших
		|//КвартальныйРасчет	,(13 - (ВЫБОР КОГДА МИНИМУМ(ВложенныйЗапрос.ПериодУценки) = 0 ТОГДА 13 ИНАЧЕ МИНИМУМ(ВложенныйЗапрос.ПериодУценки) КОНЕЦ)) КАК КоличествоМесяцевВладенияУцененных
		|//КвартальныйРасчет	,(13 - (ВЫБОР КОГДА МИНИМУМ(ВложенныйЗапрос.ПериодИФНС) = 0 ТОГДА 13 ИНАЧЕ МИНИМУМ(ВложенныйЗапрос.ПериодИФНС) КОНЕЦ)) КАК КоличествоМесяцевИзмененияИФНС
		|//КвартальныйРасчет	,МАКСИМУМ(ВложенныйЗапрос.РегистрацияВНалоговомОрганеСтарый) КАК РегистрацияВНалоговомОрганеСтарый
		|ПОМЕСТИТЬ ВТ_ИтоговыйЗапрос
		|ИЗ
		|	(ВЫБРАТЬ
		|		НалоговаяБазаПоНалогуНаИмущество.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|		НалоговаяБазаПоНалогуНаИмущество.ОсвобождениеОтНалогообложения КАК ОсвобождениеОтНалогообложения,
		|		НалоговаяБазаПоНалогуНаИмущество.ОсновноеСредство КАК ОсновноеСредство,
		|		ВЫБОР
		|			КОГДА НалоговаяБазаПоНалогуНаИмущество.Период = 1
		|					И НалоговаяБазаПоНалогуНаИмущество.ВключатьВНалоговуюБазу
		|				ТОГДА НалоговаяБазаПоНалогуНаИмущество.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ОстаточнаяСтоимостьНа0101,
		|		ВЫБОР
		|			КОГДА НалоговаяБазаПоНалогуНаИмущество.Период = 2
		|					И НалоговаяБазаПоНалогуНаИмущество.ВключатьВНалоговуюБазу
		|				ТОГДА НалоговаяБазаПоНалогуНаИмущество.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ОстаточнаяСтоимостьНа0102,
		|		ВЫБОР
		|			КОГДА НалоговаяБазаПоНалогуНаИмущество.Период = 3
		|					И НалоговаяБазаПоНалогуНаИмущество.ВключатьВНалоговуюБазу
		|				ТОГДА НалоговаяБазаПоНалогуНаИмущество.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ОстаточнаяСтоимостьНа0103,
		|		ВЫБОР
		|			КОГДА НалоговаяБазаПоНалогуНаИмущество.Период = 4
		|					И НалоговаяБазаПоНалогуНаИмущество.ВключатьВНалоговуюБазу
		|				ТОГДА НалоговаяБазаПоНалогуНаИмущество.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ОстаточнаяСтоимостьНа0104,
		|		ВЫБОР
		|			КОГДА НалоговаяБазаПоНалогуНаИмущество.Период = 5
		|					И НалоговаяБазаПоНалогуНаИмущество.ВключатьВНалоговуюБазу
		|				ТОГДА НалоговаяБазаПоНалогуНаИмущество.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ОстаточнаяСтоимостьНа0105,
		|		ВЫБОР
		|			КОГДА НалоговаяБазаПоНалогуНаИмущество.Период = 6
		|					И НалоговаяБазаПоНалогуНаИмущество.ВключатьВНалоговуюБазу
		|				ТОГДА НалоговаяБазаПоНалогуНаИмущество.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ОстаточнаяСтоимостьНа0106,
		|		ВЫБОР
		|			КОГДА НалоговаяБазаПоНалогуНаИмущество.Период = 7
		|					И НалоговаяБазаПоНалогуНаИмущество.ВключатьВНалоговуюБазу
		|				ТОГДА НалоговаяБазаПоНалогуНаИмущество.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ОстаточнаяСтоимостьНа0107,
		|		ВЫБОР
		|			КОГДА НалоговаяБазаПоНалогуНаИмущество.Период = 8
		|					И НалоговаяБазаПоНалогуНаИмущество.ВключатьВНалоговуюБазу
		|				ТОГДА НалоговаяБазаПоНалогуНаИмущество.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ОстаточнаяСтоимостьНа0108,
		|		ВЫБОР
		|			КОГДА НалоговаяБазаПоНалогуНаИмущество.Период = 9
		|					И НалоговаяБазаПоНалогуНаИмущество.ВключатьВНалоговуюБазу
		|				ТОГДА НалоговаяБазаПоНалогуНаИмущество.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ОстаточнаяСтоимостьНа0109,
		|		ВЫБОР
		|			КОГДА НалоговаяБазаПоНалогуНаИмущество.Период = 10
		|					И НалоговаяБазаПоНалогуНаИмущество.ВключатьВНалоговуюБазу
		|				ТОГДА НалоговаяБазаПоНалогуНаИмущество.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ОстаточнаяСтоимостьНа0110,
		|		ВЫБОР
		|			КОГДА НалоговаяБазаПоНалогуНаИмущество.Период = 11
		|					И НалоговаяБазаПоНалогуНаИмущество.ВключатьВНалоговуюБазу
		|				ТОГДА НалоговаяБазаПоНалогуНаИмущество.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ОстаточнаяСтоимостьНа0111,
		|		ВЫБОР
		|			КОГДА НалоговаяБазаПоНалогуНаИмущество.Период = 12
		|					И НалоговаяБазаПоНалогуНаИмущество.ВключатьВНалоговуюБазу
		|				ТОГДА НалоговаяБазаПоНалогуНаИмущество.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ОстаточнаяСтоимостьНа0112,
		|		ВЫБОР
		|			КОГДА НалоговаяБазаПоНалогуНаИмущество.Период = 13
		|					И НалоговаяБазаПоНалогуНаИмущество.ВключатьВНалоговуюБазу
		|				ТОГДА НалоговаяБазаПоНалогуНаИмущество.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ОстаточнаяСтоимостьНа3112,
		|		ВЫБОР
		|			КОГДА НалоговаяБазаПоНалогуНаИмущество.Период = &КонечныйПериод
		|				ТОГДА НалоговаяБазаПоНалогуНаИмущество.ОстаточнаяСтоимость
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ОстаточнаяСтоимостьОсновныхСредств" + ?(ГодовойРасчет, "", ",
		|		ВЫБОР 
		|			КОГДА НалоговаяБазаПоНалогуНаИмущество.РегистрацияВНалоговомОрганеСтарый = НалоговаяБазаПоНалогуНаИмущество.РегистрацияВНалоговомОргане 
		|					ИЛИ НалоговаяБазаПоНалогуНаИмущество.РегистрацияВНалоговомОрганеСтарый ЕСТЬ NULL
		|				ТОГДА NULL
		|			ИНАЧЕ НалоговаяБазаПоНалогуНаИмущество.РегистрацияВНалоговомОрганеСтарый
		|		КОНЕЦ КАК РегистрацияВНалоговомОрганеСтарый,
		|		ВЫБОР
		|			КОГДА НалоговаяБазаПоНалогуНаИмущество.ВключатьВНалоговуюБазуПоСостояниюНаКонецМесяца
		|				ТОГДА НалоговаяБазаПоНалогуНаИмущество.ПервоначальнаяСтоимостьПоступивших
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ПервоначальнаяСтоимостьПоступивших,
		|		ВЫБОР
		|			КОГДА НалоговаяБазаПоНалогуНаИмущество.ВключатьВНалоговуюБазуПоСостояниюНаКонецМесяца
		|				ТОГДА НалоговаяБазаПоНалогуНаИмущество.УменьшениеСтоимости
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК УменьшениеСтоимости,
		|		ВЫБОР 
		|			КОГДА ЕСТЬNULL(НалоговаяБазаПоНалогуНаИмущество.ПервоначальнаяСтоимостьПоступивших, 0) <> 0 
		|				ТОГДА НалоговаяБазаПоНалогуНаИмущество.Период
		|			ИНАЧЕ 13
		|		КОНЕЦ КАК ПериодПоступления,
		|		ВЫБОР 
		//|			КОГДА (НЕ НалоговаяБазаПоНалогуНаИмущество.ВключатьВНалоговуюБазуПоСостояниюНаКонецМесяца) Или (НалоговаяБазаПоНалогуНаИмущество.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета))
		|			КОГДА (НЕ НалоговаяБазаПоНалогуНаИмущество.ВключатьВНалоговуюБазуПоСостояниюНаКонецМесяца) Или (НалоговаяБазаПоНалогуНаИмущество.СостояниеВОтчетномПериоде = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета))
		|				ТОГДА НалоговаяБазаПоНалогуНаИмущество.Период
		|			ИНАЧЕ 13
		|		КОНЕЦ КАК ПериодВыбытия,
		|		ВЫБОР 
		|			КОГДА ЕСТЬNULL(НалоговаяБазаПоНалогуНаИмущество.УменьшениеСтоимости, 0) <> 0
		|				ТОГДА НалоговаяБазаПоНалогуНаИмущество.Период
		|			ИНАЧЕ 13
		|		КОНЕЦ КАК ПериодУценки,
		|		ВЫБОР
		|			КОГДА НалоговаяБазаПоНалогуНаИмущество.ВключатьВНалоговуюБазуПоСостояниюНаКонецМесяца
		|				И НалоговаяБазаПоНалогуНаИмущество.РегистрацияВНалоговомОрганеСтарый <> НалоговаяБазаПоНалогуНаИмущество.РегистрацияВНалоговомОргане 
		|					И (НЕ НалоговаяБазаПоНалогуНаИмущество.РегистрацияВНалоговомОрганеСтарый ЕСТЬ NULL)
		|				ТОГДА НалоговаяБазаПоНалогуНаИмущество.Период
		|			ИНАЧЕ 13
		|		КОНЕЦ КАК ПериодИФНС") + "
		|	ИЗ
		|		НалоговаяБазаПоНалогуНаИмущество КАК НалоговаяБазаПоНалогуНаИмущество) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УплачиваютсяАвансыПоИФНС КАК УплачиваютсяАвансыПоИФНС
		|		ПО ВложенныйЗапрос.РегистрацияВНалоговомОргане = УплачиваютсяАвансыПоИФНС.РегистрацияВНалоговомОргане
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УплачиваютсяАвансыПоОрганизации КАК УплачиваютсяАвансыПоОрганизации
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.РегистрацияВНалоговомОргане,
		|	ВложенныйЗапрос.ОсвобождениеОтНалогообложения,
		|	ВложенныйЗапрос.ОсновноеСредство,
		|	ЕСТЬNULL(УплачиваютсяАвансыПоИФНС.УплачиваютсяАвансы, ЕСТЬNULL(УплачиваютсяАвансыПоОрганизации.УплачиваютсяАвансы, ЛОЖЬ))
		|;
		|";
		Если НЕ ГодовойРасчет Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "//КвартальныйРасчет", "");
		КонецЕсли;	
		Результат = Запрос.Выполнить();
		
		Если Не ГодовойРасчет Тогда
			Запрос.Текст = "
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ИтоговыйЗапрос.ИФНС КАК ИФНС,
			|	ИтоговыйЗапрос.ОсновноеСредство КАК ОсновноеСредство,
			|	ИтоговыйЗапрос.КоличествоМесяцевИзмененияИФНС КАК КоличествоМесяцевПоступивших,
			|	0 КАК КоличествоМесяцевВыбывших,
			|	ИтоговыйЗапрос.ОсвобождениеОтНалогообложения,
			|	ИтоговыйЗапрос.УплачиваютсяАвансы,
			|	ИтоговыйЗапрос.ПервоначальнаяСтоимостьПоступивших,
			|	ИтоговыйЗапрос.УменьшениеСтоимости,
			|	ИтоговыйЗапрос.КоличествоМесяцевВладенияПоступивших,
			|	ИтоговыйЗапрос.КоличествоМесяцевВладенияВыбывших,
			|	ИтоговыйЗапрос.КоличествоМесяцевВладенияУцененных,
			|	ИтоговыйЗапрос.ОстаточнаяСтоимостьНа0101
			|ПОМЕСТИТЬ ВТ_ИФНСМесяцы
			|ИЗ
			|	ВТ_ИтоговыйЗапрос КАК ИтоговыйЗапрос
			|	
			|ОБЪЕДИНИТЬ ВСЕ
			|ВЫБРАТЬ
			|	ИтоговыйЗапрос.РегистрацияВНалоговомОрганеСтарый,
			|	ИтоговыйЗапрос.ОсновноеСредство,
			|	0,
			|	ИтоговыйЗапрос.КоличествоМесяцевИзмененияИФНС,
			|	ИтоговыйЗапрос.ОсвобождениеОтНалогообложения,
			|	ИтоговыйЗапрос.УплачиваютсяАвансы,
			|	ИтоговыйЗапрос.ПервоначальнаяСтоимостьПоступивших,
			|	ИтоговыйЗапрос.УменьшениеСтоимости,
			|	ИтоговыйЗапрос.КоличествоМесяцевВладенияПоступивших,
			|	ИтоговыйЗапрос.КоличествоМесяцевВладенияВыбывших,
			|	ИтоговыйЗапрос.КоличествоМесяцевВладенияУцененных,
			|	ИтоговыйЗапрос.ОстаточнаяСтоимостьНа0101
			|ИЗ
			|	ВТ_ИтоговыйЗапрос КАК ИтоговыйЗапрос
			|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыйЗапрос КАК ИтоговыйЗапросИФНС
			|		ПО ИтоговыйЗапрос.РегистрацияВНалоговомОрганеСтарый = ИтоговыйЗапросИФНС.ИФНС 
			|		И ИтоговыйЗапрос.ОсновноеСредство = ИтоговыйЗапросИФНС.ОсновноеСредство
			|			
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ 
			|	ИФНСМесяцы.ОсновноеСредство КАК ОсновноеСредство,
			|	ИФНСМесяцы.ИФНС,
			|	СУММА(ИФНСМесяцы.КоличествоМесяцевПоступивших) КАК КоличествоМесяцевПоступивших,
			|	СУММА(ИФНСМесяцы.КоличествоМесяцевВыбывших) КАК КоличествоМесяцевВыбывших,
			|	МАКСИМУМ(ИФНСМесяцы.ОсвобождениеОтНалогообложения) КАК ОсвобождениеОтНалогообложения,
			|	МАКСИМУМ(ИФНСМесяцы.УплачиваютсяАвансы) КАК УплачиваютсяАвансы,
			|	МАКСИМУМ(ИФНСМесяцы.ПервоначальнаяСтоимостьПоступивших) КАК ПервоначальнаяСтоимостьПоступивших,
			|	МАКСИМУМ(ИФНСМесяцы.УменьшениеСтоимости) КАК УменьшениеСтоимости,
			|	МАКСИМУМ(ИФНСМесяцы.КоличествоМесяцевВладенияПоступивших) КАК КоличествоМесяцевВладенияПоступивших,
			|	МАКСИМУМ(ИФНСМесяцы.КоличествоМесяцевВладенияВыбывших) КАК КоличествоМесяцевВладенияВыбывших,
			|	МАКСИМУМ(ИФНСМесяцы.КоличествоМесяцевВладенияУцененных) КАК КоличествоМесяцевВладенияУцененных,
			|	МАКСИМУМ(ИФНСМесяцы.ОстаточнаяСтоимостьНа0101) КАК ОстаточнаяСтоимостьНа0101
			|ПОМЕСТИТЬ ВТ_ИФНС
			|ИЗ 
			|	ВТ_ИФНСМесяцы КАК ИФНСМесяцы
			|
			|ГДЕ 
			|	НЕ ИФНСМесяцы.ИФНС ЕСТЬ NULL
			|СГРУППИРОВАТЬ ПО
			|	ИФНСМесяцы.ОсновноеСредство,
			|	ИФНСМесяцы.ИФНС
			|;
			|";
			Запрос.Выполнить();
			
		КонецЕсли;
		
		Если ГодовойРасчет Тогда
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЕСТЬNULL(СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляВПравеОбщейСобственностиЧислитель, 0) КАК ДоляСтоимостиЧислитель,
			               |	ЕСТЬNULL(СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляВПравеОбщейСобственностиЗнаменатель, 0) КАК ДоляСтоимостиЗнаменатель,
			               |	ИтоговыйЗапрос.ИФНС,
			               |	ЕСТЬNULL(ВЫБОР
			               |			КОГДА ЕСТЬNULL(СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.НалоговаяСтавка, 0) <> 0
			               |				ТОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.НалоговаяСтавка
			               |			ИНАЧЕ СтавкиНалогаНаИмуществоСрезПоследних.НалоговаяСтавка
			               |		КОНЕЦ, СтавкиНалогаНаИмуществоСрезПоследних.НалоговаяСтавка) КАК НалоговаяСтавка,
			               |	ИтоговыйЗапрос.ОсвобождениеОтНалогообложения,
			               |	ИтоговыйЗапрос.ОсновноеСредство,
			               |	ИтоговыйЗапрос.ОстаточнаяСтоимостьНа0101,
			               |	ИтоговыйЗапрос.ОстаточнаяСтоимостьНа0102,
			               |	ИтоговыйЗапрос.ОстаточнаяСтоимостьНа0103,
			               |	ИтоговыйЗапрос.ОстаточнаяСтоимостьНа0104,
			               |	ИтоговыйЗапрос.ОстаточнаяСтоимостьНа0105,
			               |	ИтоговыйЗапрос.ОстаточнаяСтоимостьНа0106,
			               |	ИтоговыйЗапрос.ОстаточнаяСтоимостьНа0107,
			               |	ИтоговыйЗапрос.ОстаточнаяСтоимостьНа0108,
			               |	ИтоговыйЗапрос.ОстаточнаяСтоимостьНа0109,
			               |	ИтоговыйЗапрос.ОстаточнаяСтоимостьНа0110,
			               |	ИтоговыйЗапрос.ОстаточнаяСтоимостьНа0111,
			               |	ИтоговыйЗапрос.ОстаточнаяСтоимостьНа0112,
			               |	ИтоговыйЗапрос.ОстаточнаяСтоимостьНа3112,
			               |	ИтоговыйЗапрос.ОстаточнаяСтоимостьОсновныхСредств,
			               |	ИтоговыйЗапрос.УплачиваютсяАвансы
			               |ИЗ
			               |	ВТ_ИтоговыйЗапрос КАК ИтоговыйЗапрос
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.СрезПоследних(
			               |				&КонецПериодаОтчета,
			               |				Организация = &Организация
			               |					И ОсновноеСредство В
			               |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |							НалоговаяБазаПоНалогуНаИмущество.ОсновноеСредство
			               |						ИЗ
			               |							НалоговаяБазаПоНалогуНаИмущество КАК НалоговаяБазаПоНалогуНаИмущество)) КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних
			               |		ПО ИтоговыйЗапрос.ОсновноеСредство = СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ОсновноеСредство,
			               |	РегистрСведений.СтавкиНалогаНаИмущество.СрезПоследних(&КонецПериодаОтчета, Организация = &Организация) КАК СтавкиНалогаНаИмуществоСрезПоследних";

		Иначе	
			Запрос.Текст = "ВЫБРАТЬ
			               |	НалоговыеОрганы.ИФНС,
			               |	НалоговыеОрганы.ОсновноеСредство,
			               |	ЕСТЬNULL(СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляВПравеОбщейСобственностиЧислитель, 0) КАК ДоляСтоимостиЧислитель,
			               |	ЕСТЬNULL(СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ДоляВПравеОбщейСобственностиЗнаменатель, 0) КАК ДоляСтоимостиЗнаменатель,
			               |	ЕСТЬNULL(ВЫБОР
			               |			КОГДА ЕСТЬNULL(СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.НалоговаяСтавка, 0) <> 0
			               |				ТОГДА СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.НалоговаяСтавка
			               |			ИНАЧЕ СтавкиНалогаНаИмуществоСрезПоследних.НалоговаяСтавка
			               |		КОНЕЦ, СтавкиНалогаНаИмуществоСрезПоследних.НалоговаяСтавка) КАК НалоговаяСтавка,
			               |	НалоговыеОрганы.ОсвобождениеОтНалогообложения,
			               |	НалоговыеОрганы.УплачиваютсяАвансы,
			               |	НалоговыеОрганы.ПервоначальнаяСтоимостьПоступивших,
			               |	НалоговыеОрганы.УменьшениеСтоимости,
			               |	НалоговыеОрганы.КоличествоМесяцевВладенияПоступивших КАК КоличествоМесяцевПоступивших, //количество месяцев до конца НП, начиная с месяца поступления и/или увеличения стоимости объекта
			               |	НалоговыеОрганы.КоличествоМесяцевПоступивших КАК КоличествоМесяцевПеремещения, //количество месяцев до конца НП, начиная с месяца, в котором объект был перемещен в налоговый орган с другого налоговго органа
			               |	ЕСТЬNULL(ПервоначальнаяСтоимостьОСПоступившихСНачалаГода.СуммаОборотДт, 0) КАК СтоимостьПеремещения, //хранится стоимость признаваемая налоговой базой поступивших объектов в новый налоговый орган. При этом, в соответствии с п.6 статьи 399 в качестве стоимости берем первоначальную стоимость поступивших
			               |	ВЫБОР
			               |		КОГДА НалоговыеОрганы.ОстаточнаяСтоимостьНа0101 <> 0
			               |			ТОГДА НалоговыеОрганы.ОстаточнаяСтоимостьНа0101
			               |		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ПервоначальнаяСтоимостьОС.СуммаОстатокДт, 0) - ЕСТЬNULL(АмортизацияОС.СуммаОстатокКт, 0) КАК ЧИСЛО(15, 2))
			               |	КОНЕЦ КАК БалансоваяСтоимостьНаНачалоГода,
			               |	ВЫБОР
			               |		КОГДА НалоговыеОрганы.КоличествоМесяцевВладенияВыбывших <> 0
			               |			ТОГДА ВЫБОР
			               |					КОГДА НалоговыеОрганы.КоличествоМесяцевВладенияВыбывших >= НалоговыеОрганы.КоличествоМесяцевВыбывших
			               |						ТОГДА НалоговыеОрганы.КоличествоМесяцевВладенияВыбывших
			               |					ИНАЧЕ НалоговыеОрганы.КоличествоМесяцевВыбывших
			               |				КОНЕЦ
			               |		ИНАЧЕ ВЫБОР
			               |				КОГДА НалоговыеОрганы.КоличествоМесяцевВыбывших <> 0
			               |					ТОГДА НалоговыеОрганы.КоличествоМесяцевВыбывших
			               |				ИНАЧЕ НалоговыеОрганы.КоличествоМесяцевВладенияУцененных
			               |			КОНЕЦ
			               |	КОНЕЦ КАК КоличествоМесяцевВыбывших, // количество месяцев отсчитываем от наиболее раннего события из: выбытие объекта с организации, прекращение признанения объекта объектом обложения, перемещение с одного налогового органа в другой
			               |	ВЫБОР
			               |		КОГДА НалоговыеОрганы.КоличествоМесяцевВладенияВыбывших <> 0
			               |				ИЛИ НалоговыеОрганы.КоличествоМесяцевВыбывших <> 0
			               |			ТОГДА ВЫБОР
			               |					КОГДА НалоговыеОрганы.ОстаточнаяСтоимостьНа0101 <> 0
			               |						ТОГДА НалоговыеОрганы.ОстаточнаяСтоимостьНа0101
			               |					КОГДА (ВЫРАЗИТЬ(ЕСТЬNULL(ПервоначальнаяСтоимостьОС.СуммаОстатокДт, 0) - ЕСТЬNULL(АмортизацияОС.СуммаОстатокКт, 0) КАК ЧИСЛО(15, 2))) <> 0
			               |						ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ПервоначальнаяСтоимостьОС.СуммаОстатокДт, 0) - ЕСТЬNULL(АмортизацияОС.СуммаОстатокКт, 0) КАК ЧИСЛО(15, 2))
			               |					ИНАЧЕ НалоговыеОрганы.ПервоначальнаяСтоимостьПоступивших + ЕСТЬNULL(ПервоначальнаяСтоимостьОСПоступившихСНачалаГода.СуммаОборотДт, 0)
			               |				КОНЕЦ
			               |		КОГДА НалоговыеОрганы.КоличествоМесяцевВладенияУцененных <> 0
			               |			ТОГДА НалоговыеОрганы.УменьшениеСтоимости
			               |		ИНАЧЕ 0
			               |	КОНЕЦ КАК ИзменениеСтоимостиВыбывших
			               |ИЗ
			               |	ВТ_ИФНС КАК НалоговыеОрганы
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.СрезПоследних(
			               |				&КонецПериодаОтчета,
			               |				Организация = &Организация
			               |					И ОсновноеСредство В
			               |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |							НалоговаяБазаПоНалогуНаИмущество.ОсновноеСредство
			               |						ИЗ
			               |							НалоговаяБазаПоНалогуНаИмущество КАК НалоговаяБазаПоНалогуНаИмущество)) КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних
			               |		ПО НалоговыеОрганы.ОсновноеСредство = СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствамСрезПоследних.ОсновноеСредство
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаУчетаОС КАК СчетаБухгалтерскогоУчетаОССрезПоследних
			               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервоначальнаяСтоимостьОС КАК ПервоначальнаяСтоимостьОС
			               |			ПО СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета = ПервоначальнаяСтоимостьОС.Счет
			               |				И СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство = ПервоначальнаяСтоимостьОС.Субконто1
			               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АмортизацияОС КАК АмортизацияОС
			               |			ПО СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство = АмортизацияОС.Субконто1
			               |				И СчетаБухгалтерскогоУчетаОССрезПоследних.СчетНачисленияАмортизации = АмортизацияОС.Счет
			               |		ПО НалоговыеОрганы.ОсновноеСредство = СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервоначальнаяСтоимостьОСПоступившихСНачалаГода КАК ПервоначальнаяСтоимостьОСПоступившихСНачалаГода
			               |		ПО НалоговыеОрганы.ОсновноеСредство = ПервоначальнаяСтоимостьОСПоступившихСНачалаГода.Субконто1,
			               |	РегистрСведений.СтавкиНалогаНаИмущество.СрезПоследних(&КонецПериодаОтчета, Организация = &Организация) КАК СтавкиНалогаНаИмуществоСрезПоследних";

		КонецЕсли;	
		Результат = Запрос.Выполнить();
				
		Если Не Результат.Пустой() Тогда
			
			РасчетНалога = Результат.Выгрузить();
				
			Для Каждого СтрокаТаблицы Из РасчетНалога Цикл
				
				Если НЕ ГодовойРасчет И НЕ СтрокаТаблицы.УплачиваютсяАвансы Тогда
					Продолжить;
				КонецЕсли;
				
				Отбор = Новый Структура("ИФНС, ОсновноеСредство");
				
				Если ГодовойРасчет Тогда
					
					РасчетНалога1Кв = ТаблицаРасчетНалога.СкопироватьКолонки();
					РасчетНалога2Кв = ТаблицаРасчетНалога.СкопироватьКолонки();
					РасчетНалога3Кв = ТаблицаРасчетНалога.СкопироватьКолонки();
					РасчетНалога4Кв = ТаблицаРасчетНалога.СкопироватьКолонки();
					
					НайденнаяСтрока = РасчетНалога.Найти(Истина, "УплачиваютсяАвансы");
					Если НайденнаяСтрока <> Неопределено Тогда
						РасчетНалога1Кв = ПолучитьРасчетНалогаНаИмуществоЗаКвартал(Организация, Дата(Год(ПериодРасчета), 01, 31));
						РасчетНалога2Кв = ПолучитьРасчетНалогаНаИмуществоЗаКвартал(Организация, Дата(Год(ПериодРасчета), 04, 30));
						РасчетНалога3Кв = ПолучитьРасчетНалогаНаИмуществоЗаКвартал(Организация, Дата(Год(ПериодРасчета), 07, 31));
						РасчетНалога4Кв = ПолучитьРасчетНалогаНаИмуществоЗаКвартал(Организация, Дата(Год(ПериодРасчета), 10, 31));
					КонецЕсли;
					
				КонецЕсли;
				
				НоваяСтрока = ТаблицаРасчетНалога.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				
				УчитыватьАвансы = ГодовойРасчет И СтрокаТаблицы.УплачиваютсяАвансы;
				
				ДоляСтоимости = 1;
				Если СтрокаТаблицы.ДоляСтоимостиЧислитель > 0 И СтрокаТаблицы.ДоляСтоимостиЗнаменатель > 0 Тогда
					ДоляСтоимости = СтрокаТаблицы.ДоляСтоимостиЧислитель / СтрокаТаблицы.ДоляСтоимостиЗнаменатель;
				КонецЕсли;
				
				Если ГодовойРасчет Тогда
					ДелимоеСредняяСтоимость = 0;
					ДелимоеНеоблагаемаяСредняяСтоимость = 0;
					
					Для Счетчик = 1 По Делитель Цикл
						
						Период = ?(Счетчик = 13, "3112", "01" + Формат(Счетчик, "ЧЦ=2; ЧВН="));
						НоваяСтрока["ОстаточнаяСтоимостьНа" + Период] = Окр(СтрокаТаблицы["ОстаточнаяСтоимостьНа" + Период]);
						ДелимоеСредняяСтоимость = ДелимоеСредняяСтоимость + СтрокаТаблицы["ОстаточнаяСтоимостьНа" + Период];
						
						Если СтрокаТаблицы.ОсвобождениеОтНалогообложения Тогда
							ДелимоеНеоблагаемаяСредняяСтоимость = ДелимоеНеоблагаемаяСредняяСтоимость + НоваяСтрока["ОстаточнаяСтоимостьНа" + Период];		
						КонецЕсли;
						
					КонецЦикла;
					
					НоваяСтрока.СредняяСтоимость = Окр(ДелимоеСредняяСтоимость / Делитель);
					НоваяСтрока.НеоблагаемаяСредняяСтоимость = Окр(ДелимоеНеоблагаемаяСредняяСтоимость / Делитель);
					
					СтоимостьОблагаемогоНалогомИмущества = Макс(НоваяСтрока.СредняяСтоимость - НоваяСтрока.НеоблагаемаяСредняяСтоимость, 0);
					
					НоваяСтрока.НалоговаяБаза = Окр(СтоимостьОблагаемогоНалогомИмущества * ДоляСтоимости);	
				
					НоваяСтрока.СуммаНалога = Окр(НоваяСтрока.НалоговаяБаза * СтрокаТаблицы.НалоговаяСтавка / 100);
				Иначе	
					ЧислоМесяцевВОтчетномПериоде = 13;
					КоличествоМесяцевПоступивших = СтрокаТаблицы.КоличествоМесяцевПоступивших;
					КоличествоМесяцевВыбывших = СтрокаТаблицы.КоличествоМесяцевВыбывших;
					КоличествоМесяцевПеремещения = СтрокаТаблицы.КоличествоМесяцевПеремещения;
					
					КоэффициентПоступивших = КоличествоМесяцевПоступивших / ЧислоМесяцевВОтчетномПериоде;
					КоэффициентВыбывших  = КоличествоМесяцевВыбывших / ЧислоМесяцевВОтчетномПериоде;
					
					//для перемещений по налоговым органам
					КоэффициентПеремещения = КоличествоМесяцевПеремещения / ЧислоМесяцевВОтчетномПериоде;
					
					Если СтрокаТаблицы.ПервоначальнаяСтоимостьПоступивших <> 0 Или СтрокаТаблицы.ИзменениеСтоимостиВыбывших <> 0 Или СтрокаТаблицы.СтоимостьПеремещения <> 0 Тогда
						
						//каждую составляющую рассчитываем по отдельности
						//н-р, если в отчетном периоде были и увеличения стоимости и уменьшения стоимости актива
						//то при расчете базы, к каждому из этих показателей применяем количество месяцев до конца НП, начиная с месяца изменения каждого из них
						СуммаНалогаПоступивших = Окр(СтрокаТаблицы.ПервоначальнаяСтоимостьПоступивших * КоэффициентПоступивших * ДоляСтоимости * СтрокаТаблицы.НалоговаяСтавка / 100);
						СуммаНалогаВыбывших = Окр(СтрокаТаблицы.ИзменениеСтоимостиВыбывших * КоэффициентВыбывших * ДоляСтоимости * СтрокаТаблицы.НалоговаяСтавка / 100);
						
						// стоимость перемещения (читай поступления) в налоговый орган
						// - показатель выделен отдельно, т.к. в одном отчетном периоде могут быть случаи когда
						// объект перемещен в данный налоговый орган, и в этом же периоде было произведено увеличение стоимости объекта
						// в этом случае для каждой базы применяем коэффициент исходя из количества месяцев в НП, начиная с месяца изменения каждого из этих показателей
						СуммаНалогаПеремещение = Окр(СтрокаТаблицы.СтоимостьПеремещения * КоэффициентПеремещения * ДоляСтоимости * СтрокаТаблицы.НалоговаяСтавка / 100);
						
						
						НоваяСтрока.СтоимостьПоступивших = СтрокаТаблицы.ПервоначальнаяСтоимостьПоступивших + СтрокаТаблицы.СтоимостьПеремещения;
						НоваяСтрока.СтоимостьВыбывших = СтрокаТаблицы.ИзменениеСтоимостиВыбывших;
						
						//пока запишем наибольшее значение количества месяцев владения
						НоваяСтрока.КоличествоМесяцевВладения = Макс(КоличествоМесяцевПоступивших, КоличествоМесяцевПеремещения); //пока запишем показатели в одной колонке
						НоваяСтрока.КоличествоМесяцевВладенияВыбывших = КоличествоМесяцевВыбывших;
						
						ОбщаяСумма = СуммаНалогаПоступивших + СуммаНалогаПеремещение - СуммаНалогаВыбывших;
					Иначе	
						ОбщаяСумма = 0;
					КонецЕсли;	
					НоваяСтрока.СуммаИзмененияНалога = ОбщаяСумма;
					
					НомерТекущегоКвартала = Цел((Месяц(мДатаКонцаПериодаОтчета) - 1) / 3) + 1;
					КоличествоОставшихсяПериодовПлатежа = 4 - НомерТекущегоКвартала + 1;	
					
					// сумму платежа за последний месяц считаем таким способом, чтобы избежать ошибок
					// округления
					СуммаВМесяц = Окр(ОбщаяСумма/КоличествоОставшихсяПериодовПлатежа);
					СуммаВПоследнийМесяц = Окр(ОбщаяСумма - (СуммаВМесяц*(КоличествоОставшихсяПериодовПлатежа - 1)));
					СуммаИзмененийТекКвартал = ?(НомерТекущегоКвартала = 4, СуммаВПоследнийМесяц, СуммаВМесяц);
					
					//Изменения налога в пред.периодах
					СуммаИзменений = 0;
					ЗаполнитьЗначенияСвойств(Отбор, СтрокаТаблицы);
					
					Если НомерТекущегоКвартала > 1 Тогда
						Для НомерКвартала = 1 По НомерТекущегоКвартала-1 Цикл
							
							ПериодКвартал = ДобавитьМесяц(Дата(Год(ПериодРасчета), 01, 31), ?(НомерКвартала <> 1, (НомерКвартала-1)*3, 0));
							РасчетПоКварталу = ПолучитьРасчетНалогаНаИмуществоЗаКвартал(Организация, ПериодКвартал);
							
							СтрокиРасчетаАвансовыхПлатежей = РасчетПоКварталу.НайтиСтроки(Отбор);
							
							СуммаИзмененияНалога = 0;
							Для Каждого СтрокаРасчетаАвансовыхПлатежей Из СтрокиРасчетаАвансовыхПлатежей Цикл
								
								НомерКварталаРасчет = Цел((Месяц(ПериодКвартал) - 1) / 3) + 1;
								КоличествоОставшихсяПериодовПлатежа = 4 - НомерКварталаРасчет + 1;	
					
								СуммаВМесяц = Окр(СтрокаРасчетаАвансовыхПлатежей.СуммаИзмененияНалога/КоличествоОставшихсяПериодовПлатежа);
								СуммаВПоследнийМесяц = Окр(СтрокаРасчетаАвансовыхПлатежей.СуммаИзмененияНалога - (СуммаВМесяц*(КоличествоОставшихсяПериодовПлатежа - 1)));
								СуммаИзмененияНалога = ?(НомерТекущегоКвартала = 4, СуммаВПоследнийМесяц, СуммаВМесяц);
							
							КонецЦикла;
							СуммаИзменений = СуммаИзменений + СуммаИзмененияНалога;
							
						КонецЦикла;
					КонецЕсли;				
					
					//найдем размер текущего платежа, рассчитанный для текущего квартала, по состоянию на начало года
					//налоговой базой считается балансовая стоимость на начало года,
					СуммаНаНачалоГода = СтрокаТаблицы.БалансоваяСтоимостьНаНачалоГода * ДоляСтоимости * СтрокаТаблицы.НалоговаяСтавка / 100;
					СуммаВМесяц = Окр(СуммаНаНачалоГода/4);
					СуммаВПоследнийМесяц = Окр(СуммаНаНачалоГода - (СуммаВМесяц*(4 - 1)));
					ТекПлатежНаНачалоГода = ?(НомерТекущегоКвартала = 4, СуммаВПоследнийМесяц, СуммаВМесяц);
					
					ИтоговаяСуммаНалога = ТекПлатежНаНачалоГода + СуммаИзменений + СуммаИзмененийТекКвартал;
					
					НоваяСтрока.СуммаНалога = ИтоговаяСуммаНалога;
				
				КонецЕсли;
				
				НоваяСтрока.СуммаНалогаКУплате = НоваяСтрока.СуммаНалога;
				
				Если ГодовойРасчет И СтрокаТаблицы.УплачиваютсяАвансы Тогда
				
					ЗаполнитьЗначенияСвойств(Отбор, НоваяСтрока);
					
					СуммаАвансовыхПлатежей1Кв = 0;
					СтрокиРасчетаАвансовыхПлатежей = РасчетНалога1Кв.НайтиСтроки(Отбор);
					Для Каждого СтрокаРасчетаАвансовыхПлатежей Из СтрокиРасчетаАвансовыхПлатежей Цикл
						СуммаАвансовыхПлатежей1Кв = СуммаАвансовыхПлатежей1Кв
							+ СтрокаРасчетаАвансовыхПлатежей.СуммаНалогаКУплате;
					КонецЦикла;
					
					СуммаАвансовыхПлатежей2Кв = 0;
					СтрокиРасчетаАвансовыхПлатежей = РасчетНалога2Кв.НайтиСтроки(Отбор);
					Для Каждого СтрокаРасчетаАвансовыхПлатежей Из СтрокиРасчетаАвансовыхПлатежей Цикл
						СуммаАвансовыхПлатежей2Кв = СуммаАвансовыхПлатежей2Кв
							+ СтрокаРасчетаАвансовыхПлатежей.СуммаНалогаКУплате;
					КонецЦикла;
					
					СуммаАвансовыхПлатежей3Кв = 0;
					СтрокиРасчетаАвансовыхПлатежей = РасчетНалога3Кв.НайтиСтроки(Отбор);
					Для Каждого СтрокаРасчетаАвансовыхПлатежей Из СтрокиРасчетаАвансовыхПлатежей Цикл
						СуммаАвансовыхПлатежей3Кв = СуммаАвансовыхПлатежей3Кв
						+ СтрокаРасчетаАвансовыхПлатежей.СуммаНалогаКУплате;
					КонецЦикла;
					
					СуммаАвансовыхПлатежей4Кв = 0;
					СтрокиРасчетаАвансовыхПлатежей = РасчетНалога4Кв.НайтиСтроки(Отбор);
					Для Каждого СтрокаРасчетаАвансовыхПлатежей Из СтрокиРасчетаАвансовыхПлатежей Цикл
						СуммаАвансовыхПлатежей4Кв = СуммаАвансовыхПлатежей4Кв
						+ СтрокаРасчетаАвансовыхПлатежей.СуммаНалогаКУплате;
					КонецЦикла;

					
					СуммаАвансовыхПлатежей = СуммаАвансовыхПлатежей1Кв + СуммаАвансовыхПлатежей2Кв + СуммаАвансовыхПлатежей3Кв + СуммаАвансовыхПлатежей4Кв;
					НоваяСтрока.СуммаАвансовыхПлатежей = СуммаАвансовыхПлатежей;
					
					НоваяСтрока.СуммаНалогаКУплате = НоваяСтрока.СуммаНалогаКУплате - СуммаАвансовыхПлатежей;						
					
				Иначе
					НоваяСтрока.СуммаНалогаКУплате = НоваяСтрока.СуммаНалога;
					НоваяСтрока.СуммаАвансовыхПлатежей = НоваяСтрока.СуммаНалога;
				КонецЕсли;	
				
			КонецЦикла;
			
		КонецЕсли;
			
	КонецЕсли;
	
	ТаблицаРасчетНалога.ЗаполнитьЗначения(мДатаКонцаПериодаОтчета, "ПериодРасчета");
	ТаблицаРасчетНалога.ЗаполнитьЗначения(Организация, "Организация");
	
	Возврат ТаблицаРасчетНалога;
	
КонецФункции

#КонецОбласти
