
Функция ImageGET(Запрос)
	
	ПараметрыЗапроса	= Запрос.ПараметрыЗапроса;
	
	Если ПараметрыЗапроса.Получить("id") = Неопределено Тогда
		Ответ	= Новый HTTPСервисОтвет(400);
		Ответ.УстановитьТелоИзСтроки("Need 'id' parameter");
	Иначе
		Ответ	= ПолучитьОтветСервиса(ПараметрыЗапроса.Получить("id"));
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьОтветСервиса(Идентификатор) 
	
	Попытка	
		УИД_Изображения	= Новый УникальныйИдентификатор(Идентификатор);
	Исключение
		Ответ	= Новый HTTPСервисОтвет(400);
		Ответ.УстановитьТелоИзСтроки("Bad id");
		Возврат Ответ;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СсылкаФайл	= Справочники.НоменклатураПрисоединенныеФайлы.ПолучитьСсылку(УИД_Изображения);
	Расширение	= СтрЗаменить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаФайл, "Расширение"),".","");
	ДвоичныеДанные	= РаботаСФайлами.ХранилищеФайлаИзИнформационнойБазы(СсылкаФайл);
	
	Если ДвоичныеДанные = Неопределено Тогда
		Ответ	= Новый HTTPСервисОтвет(404);
		Ответ.УстановитьТелоИзСтроки("File not found");
		Возврат Ответ;
	КонецЕсли;
	
	Ответ	= Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", СтрШаблон("image/%1", Расширение));
	Ответ.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанные.Получить());
	
	Возврат Ответ;
	
КонецФункции