
Процедура АвтоматическийОбменEDI() Экспорт
		
	//Docrobot 1.19.0 MOD-1581 [+]
	Если Не Метаданные.Справочники.Найти("ДополнительныеОтчетыИОбработки") = Неопределено Тогда
		ВнешняяФорма = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Docrobot: Интеграция EDI", Истина); 
		ДвоичныеДанные = ВнешняяФорма.ХранилищеОбработки.Получить();
	ИначеЕсли Не Метаданные.Справочники.Найти("ВнешниеОбработки") = Неопределено Тогда
		ВнешняяФорма = Справочники.ВнешниеОбработки.НайтиПоНаименованию("Docrobot: Интеграция EDI", Истина);
		ДвоичныеДанные = ВнешняяФорма.ХранилищеВнешнейОбработки.Получить();
	Иначе
		ВнешняяФорма = Неопределено;
	КонецЕсли;
	//Docrobot 1.19.0 MOD-1581 [-]
	
	Если ЗначениеЗаполнено(ВнешняяФорма) Тогда
		ИмяФайла = ПолучитьИмяВременногоФайла(); 
		
		ДвоичныеДанные.Записать(ИмяФайла); 
		
		ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла, Ложь);
		ВнешняяОбработка.АвтоматическийОбменEDI();
	Иначе
		Сообщить("Внешняя обработка - 'Docrobot: Интеграция EDI' не найдена!");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЭКОМ_GLN_ОбновитьИлиСоздать(п_Объект, п_Структура)
	МЗ = РегистрыСведений.ЭКОМ_GLN.СоздатьМенеджерЗаписи();
	МЗ.Объект   = п_Объект;
    МЗ.Прочитать();
	
	Если НЕ МЗ.Выбран() Тогда
    		МЗ.Объект = п_Объект; 
	КонецЕсли; 
	
	Для Каждого Элемент Из п_Структура Цикл
			Если ЗначениеЗаполнено(Элемент.Значение) Тогда
				МЗ[Элемент.Ключ] = Элемент.Значение; 	
			КонецЕсли;	
	КонецЦикла;
		
	МЗ.Записать();	

КонецПроцедуры // ЭКОМ_GLN_ОбновитьИлиСоздать(п_Объект)

Процедура ЭКОМ_ТочкиДоставки_ОбновитьИлиСоздать(п_Объект, п_Структура)
	МЗ = РегистрыСведений.ЭКОМ_ТочкиДоставки.СоздатьМенеджерЗаписи();
	МЗ.Объект   = п_Объект;
    МЗ.Прочитать();
	
	Если НЕ МЗ.Выбран() Тогда
    		МЗ.Объект = п_Объект; 
	КонецЕсли; 
	
	Для Каждого Элемент Из п_Структура Цикл
			Если ЗначениеЗаполнено(Элемент.Значение) Тогда
				МЗ[Элемент.Ключ] = Элемент.Значение; 	
			КонецЕсли;	
	КонецЦикла;
		
	МЗ.Записать();	

КонецПроцедуры // ЭКОМ_GLN_ОбновитьИлиСоздать(п_Объект)

Функция ПолучитьАдрес(п_Объект)
	СтруктураАдреса = Новый Структура;
	СтруктураАдреса.Вставить("СведенияЕсть", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Объект,
		|	КонтактнаяИнформация.Тип,
		|	КонтактнаяИнформация.Вид,
		|	КонтактнаяИнформация.Представление,
		|	КонтактнаяИнформация.Поле1,
		|	КонтактнаяИнформация.Поле2,
		|	КонтактнаяИнформация.Поле3,
		|	КонтактнаяИнформация.Поле4,
		|	КонтактнаяИнформация.Поле5,
		|	КонтактнаяИнформация.Поле6,
		|	КонтактнаяИнформация.Поле7,
		|	КонтактнаяИнформация.Поле8,
		|	КонтактнаяИнформация.Поле9,
		|	КонтактнаяИнформация.Поле10,
		|	КонтактнаяИнформация.Комментарий,
		|	КонтактнаяИнформация.ЗначениеПоУмолчанию,
		|	КонтактнаяИнформация.ТипДома,
		|	КонтактнаяИнформация.ТипКорпуса,
		|	КонтактнаяИнформация.ТипКвартиры
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтактнаяИнформация.ЗначениеПоУмолчанию УБЫВ";
	
	Запрос.УстановитьПараметр("Объект", п_Объект);	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Если НЕ РезультатЗапроса.Пустой() Тогда
	        Выборка.Следующий();   
		    СтруктураАдреса = ПолучитьСтруктуруАдреса(Выборка);
			СтруктураАдреса.Вставить("СведенияЕсть", Истина);
	КонецЕсли;
		
	Возврат СтруктураАдреса;
	
КонецФункции // ПолучитьАдрес(Объект)

Функция ПолучитьСтруктуруАдреса(Выборка) Экспорт
	
	СтруктураАдреса = Новый Структура;
	
	СтруктураАдреса.Вставить("Индекс"         , СокрЛП(Выборка.Поле1));	
	СтруктураАдреса.Вставить("Регион"         , СокрЛП(Выборка.Поле2));
	СтруктураАдреса.Вставить("Район"          , СокрЛП(Выборка.Поле3));	
	СтруктураАдреса.Вставить("Город"          , СокрЛП(Выборка.Поле4));
	СтруктураАдреса.Вставить("НаселенныйПункт", СокрЛП(Выборка.Поле5));
	СтруктураАдреса.Вставить("Улица"          , СокрЛП(Выборка.Поле6));
	СтруктураАдреса.Вставить("Дом"            , СокрЛП(Выборка.Поле7));
	СтруктураАдреса.Вставить("Корпус"         , СокрЛП(Выборка.Поле8));
	СтруктураАдреса.Вставить("Квартира"       , СокрЛП(Выборка.Поле9));
	
	Возврат СтруктураАдреса;

КонецФункции

Процедура ЭКОМ_ЗаписьВРегистрОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт
	  Если Источник.Метаданные().Имя = "Организации" ИЛИ
		   Источник.Метаданные().Имя = "Контрагенты" Тогда
		   
		  ПараметрыОтбора = Новый Структура;
		  Форма = Источник.ПолучитьФорму();
		  Если Источник.Метаданные().Имя = "Организации" Тогда
		       Свойство      = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("GLN организации", Истина);
			   ПараметрыОтбора.Вставить("Свойство", Свойство);
			   НайденныеСтроки = Форма.ОбработкаОбъектЗначенияСвойств.СвойстваИЗначения.НайтиСтроки(ПараметрыОтбора);
		  ИначеЕсли Источник.Метаданные().Имя = "Контрагенты" Тогда
		       Свойство      = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("GLN контрагента", Истина);	  
			   ПараметрыОтбора.Вставить("Свойство", Свойство);
			   НайденныеСтроки = Форма.Свойства.СвойстваИЗначения.НайтиСтроки(ПараметрыОтбора);
		  КонецЕсли; 	                                  			  		  	  	                                  
		  ЗначениеGLN   = СокрЛП(НайденныеСтроки[0].Значение);		  
		  Если ЗначениеЗаполнено(ЗначениеGLN) Тогда			 
			  Структура = Новый Структура;
			  Структура.Вставить("GLN", ЗначениеGLN); 
			  СтруктураАдреса = ПолучитьАдрес(Источник.Ссылка);
			  Если СтруктураАдреса.СведенияЕсть Тогда
				  Структура.Вставить("eXiteАдр_Город"              , СтруктураАдреса.Город);
				  Структура.Вставить("eXiteАдр_Дом"                , СтруктураАдреса.Дом);
				  Структура.Вставить("eXiteАдр_Индекс"             , СтруктураАдреса.Индекс);
				  Структура.Вставить("eXiteАдр_КодРегиона"         , СтруктураАдреса.Регион);
				  Структура.Вставить("eXiteАдр_Улица"              , СтруктураАдреса.Улица);
				  Структура.Вставить("eXiteАдр_Район"              , СтруктураАдреса.Район);
				  Структура.Вставить("eXiteАдр_НаселПункт"         , СтруктураАдреса.НаселенныйПункт);
				  Структура.Вставить("eXiteАдр_Корпус"             , СтруктураАдреса.Корпус);
				  Структура.Вставить("eXiteАдр_Кварт"              , СтруктураАдреса.Квартира);	
			  КонецЕсли;
			  ЭКОМ_GLN_ОбновитьИлиСоздать(Источник.Ссылка, Структура);   
		  КонецЕсли;
	  ИначеЕсли Источник.Метаданные().Имя = "Склады" Тогда
		  
		  Свойство      = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("GLN точки доставки", Истина); 	
		  ПараметрыОтбора = Новый Структура;
		  ПараметрыОтбора.Вставить("Свойство", Свойство);
		  Форма = Источник.ПолучитьФорму();
		  НайденныеСтроки = Форма.Свойства.СвойстваИЗначения.НайтиСтроки(ПараметрыОтбора);	  	                                  
		  ЗначениеGLN   = СокрЛП(НайденныеСтроки[0].Значение);
		  Если ЗначениеЗаполнено(ЗначениеGLN) Тогда			 
			  Структура = Новый Структура;
			  Структура.Вставить("GLN" , ЗначениеGLN); 
			  
			  Запрос = Новый Запрос;
			  Запрос.Текст =
			  "ВЫБРАТЬ
			  |	СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение,
			  |	СоответствиеПодразделенийИПодразделенийОрганизаций.Организация,
			  |	СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации
			  |ИЗ
			  |	РегистрСведений.СоответствиеПодразделенийИПодразделенийОрганизаций КАК СоответствиеПодразделенийИПодразделенийОрганизаций
			  |ГДЕ
			  |	СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение = &Подразделение";
			  
			  Запрос.УстановитьПараметр("Подразделение",	Источник.Ссылка.Подразделение);
			  РезультатЗапроса = Запрос.Выполнить();
			  Выборка = РезультатЗапроса.Выбрать();	
			  Если НЕ РезультатЗапроса.Пустой() Тогда
				  Выборка.Следующий();   
				  Структура.Вставить("Владелец", Выборка.Организация);
				  Структура.Вставить("КПП"     , Выборка.ПодразделениеОрганизации.КПП);
				  Структура.Вставить("ИНН"     , Выборка.Организация.ИНН);
				  Структура.Вставить("Адрес"   , Выборка.ПодразделениеОрганизации.мсх_Адрес);
			  КонецЕсли;
 
			  ЭКОМ_ТочкиДоставки_ОбновитьИлиСоздать(Источник.Ссылка, Структура);   
		  КонецЕсли;
	  КонецЕсли;
КонецПроцедуры

Процедура ОткрытьОбработкуЭКОМ() Экспорт
	ВнешняяФорма = Справочники.ВнешниеОбработки.НайтиПоНаименованию("Docrobot: Интеграция EDI", Истина); 
	
	Если ЗначениеЗаполнено(ВнешняяФорма) Тогда
		ИмяФайла = ПолучитьИмяВременногоФайла(); 
		ДвоичныеДанные = ВнешняяФорма.ХранилищеВнешнейОбработки.Получить(); 
		ДвоичныеДанные.Записать(ИмяФайла); 
		
		Форма = ВнешниеОбработки.ПолучитьФорму(ИмяФайла); 
		Форма.Открыть();	
	Иначе
		Сообщить("Внешняя обработка - 'Docrobot: Интеграция EDI' не найдена!");
	КонецЕсли;
	
КонецПроцедуры