
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МакетКодовСтрок = ПолучитьОбщийМакет("КодыСтрокНалоговыхДеклараций");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег("ОбщаяФорма.ФормаВыбораИзКлассификатора") Тогда
		
		Если ТипЗнч(ВыбранноеЗначение) <> Тип("Структура") Тогда 
			Запись.КодСтроки = ВыбранноеЗначение;
		Иначе
			Если СтрНайти(ВыбранноеЗначение.КодСтроки, ".") = 0 Тогда
				Запись.КодСтроки = Запись.КодСтроки + "." + СтрЗаменить(ВыбранноеЗначение.КодСтроки,"-",".");
				Запись.НаименованиеКодаСтроки = Запись.НаименованиеКодаСтроки + ". " + ВыбранноеЗначение.Наименование;
			Иначе
				Запись.КодСтроки = ВыбранноеЗначение.КодСтроки;
				Запись.НаименованиеКодаСтроки = ВыбранноеЗначение.Наименование;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КодСтрокиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяМакета"			  , "КодыСтрокНалоговыхДеклараций");
	ПараметрыФормы.Вставить("ИмяСекции"			  ,	"НДС_Реализация");
	ПараметрыФормы.Вставить("ПолучатьПолныеДанные", Истина);
	ТекущийКодСтроки = ?(НЕ ЗначениеЗаполнено(Запись.КодСтроки), Неопределено, СокрЛП(Запись.КодСтроки));
	ПараметрыФормы.Вставить("ТекущийКодСтроки"	  , ТекущийКодСтроки);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораИзКлассификатора", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КодСтрокиПриИзменении(Элемент)
	
	Запись.КодСтроки = РегламентированнаяОтчетностьКлиентСервер.ОбрезатьКодСтроки(Запись.КодСтроки);
	ОбновитьПредставлениеЭлемента("КодСтрокиДекларации");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	 Запись.Период = НачалоКвартала(Запись.Период);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьПредставлениеЭлемента(ИмяОбновляемогоЭлемента)
	
	Если ИмяОбновляемогоЭлемента = "КодСтрокиДекларации" Тогда
		
		Если ПустаяСтрока(СтрЗаменить(Запись.КодСтроки, ".", "")) Тогда
			Запись.НаименованиеКодаСтроки = НСтр("ru ='<не указано>'");
		Иначе
			
			Если НЕ МакетКодовСтрок.ВысотаТаблицы = 0 Тогда
				
				ОбластьСтрок = МакетКодовСтрок.Области.Найти("НДС_Реализация");
				
				НаименованиеСтроки = РегламентированнаяОтчетностьКлиентСервер.ПолучитьНаименованиеСтрокиКлассификатораПоКоду(МакетКодовСтрок, ОбластьСтрок, Запись.КодСтроки);
				Если ПустаяСтрока(НаименованиеСтроки) Тогда
					Запись.НаименованиеКодаСтроки =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'строка с кодом  %1 не найдена.''"), СокрЛП(Запись.КодСтроки));
				Иначе
					Запись.НаименованиеКодаСтроки = НаименованиеСтроки;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
