
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ДанныеДокумента") Тогда
		ДанныеДокумента = Новый Структура();
		ДанныеДокумента = Параметры.ДанныеДокумента;
	Иначе
		ВызватьИсключение НСтр("ru = 'Обработка не предназначена для интерактивного использования!'");
	КонецЕсли;
	
	Объект.Кодировка = Элементы.Кодировка.СписокВыбора[0].Значение;
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Объект.КаталогВыгрузки) Тогда
		Объект.КаталогВыгрузки = РаботаСФайламиСлужебныйКлиент.РабочийКаталогПользователя();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения   = Новый ОписаниеОповещения("КаталогВыгрузкиПослеПодключенияРасширенияРаботыСФайлами", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(ОписаниеОповещения, , Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиПослеПодключенияРасширенияРаботыСФайлами(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ДиалогВыбораКаталогВыгрузки = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталогВыгрузки.Заголовок = НСтр("ru='Открытие каталога для передачи файлов в банк'");
	ДиалогВыбораКаталогВыгрузки.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораКаталогВыгрузки.Каталог = Объект.КаталогВыгрузки;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("КаталогВыгрузкиЗавершениеВыбора", ЭтотОбъект);
	ДиалогВыбораКаталогВыгрузки.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиЗавершениеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СдачаОтчетностиЧерезТакскомСпринтерКлиентСервер.НормализоватьКаталог(Результат[0]);
	
	Объект.КаталогВыгрузки = Результат[0];
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.КаталогВыгрузки) Тогда
		СдачаОтчетностиЧерезТакскомСпринтерКлиентСервер.НормализоватьКаталог(Объект.КаталогВыгрузки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения   = Новый ОписаниеОповещения("КаталогВыгрузкиОткрытиеПослеПодключенияРасширенияРаботыСФайлами", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(ОписаниеОповещения, , Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиОткрытиеПослеПодключенияРасширенияРаботыСФайлами(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	НачатьЗапускПриложения(Новый ОписаниеОповещения("КаталогВыгрузкиПослеЗапускаПриложения", ЭтотОбъект), Объект.КаталогВыгрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиПослеЗапускаПриложения(Результат, ДополнительныеПараметры) Экспорт
	// Обработка не требуется.
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВыгрузитьПослеПодключенияРасширенияРаботыСФайлами", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(ОписаниеОповещения, , Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПослеПодключенияРасширенияРаботыСФайлами(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	АдресСтруктурыФайловВоВременномХранилище = ВыгрузитьНаСервере();
	
	ДанныеХранилищаФайлов = ПолучитьИзВременногоХранилища(АдресСтруктурыФайловВоВременномХранилище);
	
	ПолучаемыеФайлы = Новый Массив;
	МассивВызовов   = Новый Массив;
	
	Для Каждого ДанныеФайла Из ДанныеХранилищаФайлов Цикл
		
		АдресФайлаВоВременномХранилище = ДанныеФайла.Значение;
		ПолноеИмяФайла = ДанныеФайла.Ключ;
		
		ПозицияНачалоИмяФайла = СтроковыеФункцииКлиентСервер.НайтиСимволСКонца(ПолноеИмяФайла, "\");
		ПолныйКаталогВыгрузки = Лев(ПолноеИмяФайла, ПозицияНачалоИмяФайла);
		
		ОписаниеФайла = Новый ОписаниеПередаваемогоФайла(ПолноеИмяФайла, АдресФайлаВоВременномХранилище);
		
		ПолучаемыеФайлы.Добавить(ОписаниеФайла);
		
	КонецЦикла;
	
	Если ПолучаемыеФайлы.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Произошли ошибки при выгрузке. Выгрузка не выполнена.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	МассивВызовов.Добавить(Новый Массив);
	
	МассивВызовов[0].Добавить("НачатьПолучениеФайлов");
	МассивВызовов[0].Добавить(ПолучаемыеФайлы);
	МассивВызовов[0].Добавить("");
	МассивВызовов[0].Добавить(Ложь);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПолучаемыеФайлы", ПолучаемыеФайлы);
	ДополнительныеПараметры.Вставить("ПолныйКаталогВыгрузки", ПолныйКаталогВыгрузки);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьПослеЗапросаРазрешенияПользователя", ЭтотОбъект, ДополнительныеПараметры);
	НачатьЗапросРазрешенияПользователя(ОписаниеОповещения, МассивВызовов);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПослеЗапросаРазрешенияПользователя(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось сохранить файлы в указанный каталог'"));
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьПослеПолученияФайлов", ЭтотОбъект, ДополнительныеПараметры);
	НачатьПолучениеФайлов(ОписаниеОповещения, ДополнительныеПараметры.ПолучаемыеФайлы, , НЕ ПодключитьРасширениеРаботыСФайлами());//Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПослеПолученияФайлов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось сохранить файлы в указанный каталог'"));
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = 'Данные успешно выгружены в'");
	
	#Если НЕ ВебКлиент Тогда
		ПоказатьОповещениеПользователя(
			ТекстСообщения, "file:///" + СтрЗаменить(СокрЛП(ДополнительныеПараметры.ПолныйКаталогВыгрузки), "\", "/"),
			ДополнительныеПараметры.ПолныйКаталогВыгрузки);
	#Иначе
		ПоказатьОповещениеПользователя(
			ТекстСообщения,,
			ДополнительныеПараметры.ПолныйКаталогВыгрузки);
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	Если Форма.ДанныеДокумента.ВидОперации = "ВыплатаЗарплатыПоЗарплатномуПроекту"
        ИЛИ Форма.ДанныеДокумента.ВидОперации = "ВыплатаЗарплатыПеречислением" Тогда
		Элементы.ВключатьПолеPRT.Доступность = Ложь;
		Элементы.ВключатьПолеPSO.Доступность = Ложь;
	Иначе
		Элементы.ВключатьПолеPRT.Доступность = Истина;
		Элементы.ВключатьПолеPSO.Доступность = Истина;
	КонецЕсли;
	
	Элементы.ГруппаНастройкиФорматаДляПеречисленийПравая.Видимость = Ложь;

	Ведомости = Форма.ДанныеДокумента.Ведомости;
	Если Ведомости.Количество() > 0 И Форма.ДанныеДокумента.ВидОперации = "ПеречислениеВзносов" Тогда
		ВидНалогаВзносаОтчисления = ПолучитьВидВедомости(Ведомости[0]);
	КонецЕсли;
	
	Если ВидНалогаВзносаОтчисления <> Неопределено И (ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.СО")
									ИЛИ ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС")
									ИЛИ ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ООСМС")) Тогда
		Элементы.ГруппаНастройкиФорматаДляПеречисленийПравая.Видимость = Истина;
	КонецЕсли;
	
	Если ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.СО") Тогда
		Форма.ДанныеДокумента.Вставить("ВидНалогаВзносаОтчисления", "СО");
	ИначеЕсли ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОПВ") Тогда
		Форма.ДанныеДокумента.Вставить("ВидНалогаВзносаОтчисления", "ОПВ");
	ИначеЕсли ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС") Тогда
		Форма.ДанныеДокумента.Вставить("ВидНалогаВзносаОтчисления", "ВОСМС");
	ИначеЕсли ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ООСМС") Тогда
		Форма.ДанныеДокумента.Вставить("ВидНалогаВзносаОтчисления", "ООСМС");
	Иначе
		Форма.ДанныеДокумента.Вставить("ВидНалогаВзносаОтчисления", "ОППВ");
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидВедомости(Ведомость)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ведомость, "ВидНалогаВзносаОтчисления");	
	
КонецФункции

&НаСервере
Функция ВыгрузитьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	НастройкиВыгрузки = Новый Структура(
		"ДанныеДокумента, ФормироватьОтдельныеФайлы, ВключатьПолеFT, ВключатьПолеPRT, ВключатьПолеPSO, ПолеPERIODВЗаголовке, ПриоритетСообщения",
		ДанныеДокумента, ФормироватьОтдельныеФайлы, ВключатьПолеFT, ВключатьПолеPRT, ВключатьПолеPSO, ПолеPERIODВЗаголовке, ПриоритетСообщения);
		
	Возврат ОбработкаОбъект.СоздатьФайлВФорматеМТ(НастройкиВыгрузки, УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти
