
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Ключ = РегистрыСведений.НалогообложениеНачислений.ПустойКлюч() Тогда
		ПолучитьПризнакиУчета(Запись.ВидДохода);		
	КонецЕсли;
	
	УправлениеФормой(ЭтаФорма);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоходаПриИзменении(Элемент)

	ПолучитьПризнакиУчета(Запись.ВидДохода);
	
	Запись.СпособОбложенияИПН 	= ?(УчитыватьИПН, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Запись.СпособОбложенияОПВ	= ?(УчитыватьОПВ, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Запись.СпособОбложенияСН 	= ?(УчитыватьСН, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Запись.СпособОбложенияСО 	= ?(УчитыватьСО, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Запись.СпособОбложенияОППВ  = ?(УчитыватьОППВ, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Запись.СпособОбложенияВОСМС = ?(УчитыватьВОСМС, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Запись.СпособОбложенияООСМС = ?(УчитыватьООСМС, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);

	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособОбложенияПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Запись   = Форма.Запись;
	
	НеОблагаетсяЧастично = ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично"); 
	
	Элементы.ДоходНеПодлежащийНалогообложениюИПН.Видимость	= Запись.СпособОбложенияИПН  = НеОблагаетсяЧастично;
	Элементы.ДоходНеПодлежащийНалогообложениюОПВ.Видимость 	= Запись.СпособОбложенияОПВ  = НеОблагаетсяЧастично;
	Элементы.ДоходНеПодлежащийНалогообложениюСН.Видимость 	= Запись.СпособОбложенияСН 	 = НеОблагаетсяЧастично;
	Элементы.ДоходНеПодлежащийНалогообложениюСО.Видимость 	= Запись.СпособОбложенияСО 	 = НеОблагаетсяЧастично;
	Элементы.ДоходНеПодлежащийНалогообложениюОППВ.Видимость = Запись.СпособОбложенияОППВ = НеОблагаетсяЧастично;
	Элементы.ДоходНеПодлежащийНалогообложениюВОСМС.Видимость = Запись.СпособОбложенияВОСМС 	 = НеОблагаетсяЧастично;
	Элементы.ДоходНеПодлежащийНалогообложениюООСМС.Видимость = Запись.СпособОбложенияООСМС = НеОблагаетсяЧастично;
	
	Элементы.ДекорацияИПН.Видимость	 = НЕ Элементы.ДоходНеПодлежащийНалогообложениюИПН.Видимость; 
	Элементы.ДекорацияОПВ.Видимость  = НЕ Элементы.ДоходНеПодлежащийНалогообложениюОПВ.Видимость; 
	Элементы.ДекорацияСН.Видимость 	 = НЕ Элементы.ДоходНеПодлежащийНалогообложениюСН.Видимость; 
	Элементы.ДекорацияСО.Видимость	 = НЕ Элементы.ДоходНеПодлежащийНалогообложениюСО.Видимость; 
	Элементы.ДекорацияОППВ.Видимость = НЕ Элементы.ДоходНеПодлежащийНалогообложениюОППВ.Видимость;
	Элементы.ДекорацияВОСМС.Видимость = НЕ Элементы.ДоходНеПодлежащийНалогообложениюВОСМС.Видимость; 
	Элементы.ДекорацияООСМС.Видимость = НЕ Элементы.ДоходНеПодлежащийНалогообложениюООСМС.Видимость;
	
	Элементы.СпособОбложенияИПН.Доступность  =  Форма.УчитыватьИПН;
	Элементы.СпособОбложенияОПВ.Доступность  =  Форма.УчитыватьОПВ;
	Элементы.СпособОбложенияСН.Доступность	 =  Форма.УчитыватьСН;
	Элементы.СпособОбложенияСО.Доступность 	 =  Форма.УчитыватьСО;
	Элементы.СпособОбложенияОППВ.Доступность =  Форма.УчитыватьОППВ;
	Элементы.СпособОбложенияВОСМС.Доступность =  Форма.УчитыватьВОСМС;
	Элементы.СпособОбложенияООСМС.Доступность =  Форма.УчитыватьООСМС;

КонецПроцедуры

&НаСервере
Процедура ПолучитьПризнакиУчета(ВидДохода)

	УчитыватьИПН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ВидДохода, "УчитыватьИПН");
	УчитыватьОПВ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ВидДохода, "УчитыватьОПВ");
	УчитыватьСН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ВидДохода, "УчитыватьСН");
	УчитыватьСО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ВидДохода, "УчитыватьСО");
	УчитыватьОППВ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ВидДохода, "УчитыватьОППВ");
	УчитыватьВОСМС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ВидДохода, "УчитыватьВОСМС");
	УчитыватьООСМС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ВидДохода, "УчитыватьООСМС");

КонецПроцедуры

#КонецОбласти