
#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации	= ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	
	ПараметрыРегистрации.Вид	= ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Версия			= "1.0";
	ПараметрыРегистрации.Наименование	= "Анализ ценовых сегментов А.Калмыкова";
	ПараметрыРегистрации.Информация		= "(с) Разработка отчета Башмаков Артем. https://t.me/bashmakov_artem";
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

#КонецОбласти

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Настройки	= КомпоновщикНастроек.ПолучитьНастройки();
	
	ТаблицаДанных	= ПолучитьТаблицуДанных(Настройки);
	
	ИспользоватьГраницыЦС	= КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(Настройки, "ИспользоватьГраницыЦС");
	УстанавливатьГраницы	= (НЕ ЗначениеЗаполнено(ИспользоватьГраницыЦС.Значение) ИЛИ НЕ (ИспользоватьГраницыЦС.Значение));
	
	Если УстанавливатьГраницы И ТаблицаДанных.Количество() > 0 Тогда
		
		МинимальнаяЦена		= ТаблицаДанных[0].Цена;
		МаксимальнаяЦена	= ТаблицаДанных[ТаблицаДанных.Количество() - 1].Цена;
		
		Шаг	= ОКР((МаксимальнаяЦена - МинимальнаяЦена) / 4, 0);
		
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Настройки, "ЦенаНЦ", МинимальнаяЦена + Шаг);
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Настройки, "ЦенаСЦ", МинимальнаяЦена + 2 * Шаг);
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Настройки, "ЦенаВЦ", МинимальнаяЦена + 3 * Шаг);
		
	КонецЕсли;
	
	
	ТаблицаДляОтчета	= ПолучитьСтруктуруТаблицыДляОтчета();
	
	ВариантФормирования	= КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(Настройки, "ВариантФормирования");
	
	ЗаполнитьТаблицуДляОтчета(ТаблицаДляОтчета, ТаблицаДанных, ПолеОбъектаАнализа(ВариантФормирования.Значение));
	
//	МенеджерВременныхТаблиц	= ПолучитьМенеджерПоТаблице(ТаблицаДляОтчета);
	
	КорректироватьОтборы(Настройки, Ложь);
	
	КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки		= КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ВнешниеНаборы	= Новый Структура;
	ВнешниеНаборы.Вставить("ТаблицаДляОтчета", ТаблицаДляОтчета);
	
	ПроцессорКомпоновки	= Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборы, ДанныеРасшифровки);
	
	ВременныйДокумент	= Новый ТабличныйДокумент;
	
	ПроцессорВывода	= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ВременныйДокумент);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Макет	= ПолучитьМакет("МакетШапки");
	Область	= Макет.ПолучитьОбласть("Шапка");
	ДокументРезультат.Вывести(Область);
	ДокументРезультат.Вывести(ВременныйДокумент);
	
КонецПроцедуры

Процедура КорректироватьОтборы(Настройки, Использование) 
	
	Для Каждого Элемент Из Настройки.Отбор.Элементы Цикл
		Если Строка(Элемент.ЛевоеЗначение) = "Номенклатура"
			ИЛИ Строка(Элемент.ЛевоеЗначение) = "Подразделение" Тогда
			Элемент.Использование	= Использование;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТаблицуДанных(ОсновныеНастройки)
	
	СхемаДанныеТоваров	= ПолучитьМакет("ДанныеТоваров");
	
	Настройки	= СхемаДанныеТоваров.НастройкиПоУмолчанию;
	
	ПериодАнализ		= КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(ОсновныеНастройки, "ПериодАнализ").Значение;
	ВидЦены				= КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(ОсновныеНастройки, "РозничныйВидЦены").Значение;
	
	КомпоновкаДанныхКлиентСервер.СкопироватьОтборКомпоновкиДанных(СхемаДанныеТоваров, Настройки, ОсновныеНастройки);
	
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Настройки, "НачалоПериодаАнализ", ПериодАнализ.ДатаНачала);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Настройки, "ОкончаниеПериодаАнализ", ПериодАнализ.ДатаОкончания);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Настройки, "СвойствоПоставщик", ПолучитьСвойство("ОсновнойПоставщик_Номенклатура"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Настройки, "ВидЦены", ВидЦены);
	
	КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки		= КомпоновщикМакета.Выполнить(СхемаДанныеТоваров, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки	= Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	Результат	= Новый ТаблицаЗначений;
	
	ПроцессорВывода	= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат Результат;
		
КонецФункции

Функция ПолучитьСтруктуруТаблицыДляОтчета()
	
	Результат	= Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("ОбъектАнализа", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Результат.Колонки.Добавить("ОборотАнализ", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	Результат.Колонки.Добавить("ОборотАнализКоличество", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));
	Результат.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Результат.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	Результат.Колонки.Добавить("Цена", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМенеджерПоТаблице(ТаблицаДляОтчета)
	
	МенеджерВременныхТаблиц	= Новый МенеджерВременныхТаблиц;
	
	Запрос	= Новый Запрос;
	Запрос.МенеджерВременныхТаблиц	= МенеджерВременныхТаблиц;
	
	ТекстЗапроса	= "ВЫБРАТЬ ";
	
	Для Каждого Колонка Из ТаблицаДляОтчета.Колонки Цикл
		ТекстЗапроса = ТекстЗапроса + СтрШаблон("Т.%1 КАК %1, ", Колонка.Имя);
	КонецЦикла;
		
	ТекстЗапроса = ТекстЗапроса + "0 КАК _Дополнительно ПОМЕСТИТЬ ВТ_ТаблицаДляОтчета ИЗ &ТаблицаДляОтчета КАК Т";
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ТаблицаДляОтчета", ТаблицаДляОтчета);
	
	Запрос.Выполнить();
	
	Возврат МенеджерВременныхТаблиц;
	
КонецФункции

Функция ПолеОбъектаАнализа(Вариант) 
	
	Если Вариант = 1 Тогда
		Возврат "Группа";
	ИначеЕсли Вариант = 2 Тогда
		Возврат "Склад";
	ИначеЕсли Вариант = 3 Тогда
		Возврат "Бренд";
	ИначеЕсли Вариант = 4 Тогда
		Возврат "Покупатель";
	ИначеЕсли Вариант = 5 Тогда
		Возврат "Подразделение";
	ИначеЕсли Вариант = 6 Тогда
		Возврат "Поставщик";
	Иначе
		Возврат "Номенклатура";
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьТаблицуДляОтчета(ТаблицаДляОтчета, ТаблицаДанных, ПолеОбъектаАнализа)
	
	Для Каждого ТекСтрока Из ТаблицаДанных Цикл
		
		НоваяСтрока	= ТаблицаДляОтчета.Добавить();
		
		НоваяСтрока.ОбъектАнализа	= ТекСтрока[ПолеОбъектаАнализа];
		НоваяСтрока.ОборотАнализ	= ТекСтрока.ОборотАнализ;
		НоваяСтрока.ОборотАнализКоличество		= ТекСтрока.КоличествоАнализ;
		НоваяСтрока.Цена			= ТекСтрока.Цена;
		
	КонецЦикла;
	
	ТаблицаДляОтчета.Свернуть("ОбъектАнализа, Номенклатура, Подразделение, Цена", 
		"ОборотАнализ, ОборотАнализКоличество");
	ТаблицаДляОтчета.Колонки.Добавить("ГруппаАнализаРодитель", ОбщегоНазначения.ОписаниеТипаСтрока(25));
	ТаблицаДляОтчета.Колонки.Добавить("ГруппаАнализа", ОбщегоНазначения.ОписаниеТипаСтрока(25));
	ТаблицаДляОтчета.Колонки.Добавить("Рейтинг1", ОбщегоНазначения.ОписаниеТипаСтрока(25));
	ТаблицаДляОтчета.Колонки.Добавить("Рейтинг1Количество", ОбщегоНазначения.ОписаниеТипаСтрока(25));
	ТаблицаДляОтчета.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	
	ТаблицаДляОтчета.ЗаполнитьЗначения(0, "Количество");
	
	Для Каждого ТекСтрока Из ТаблицаДляОтчета Цикл
		Если ТекСтрока.ОборотАнализ > 0 Тогда
			ТекСтрока.Количество = 1;
		КонецЕсли;
	КонецЦикла;
	
	
	ЗаполнитьРейтинги(ТаблицаДляОтчета, "ОборотАнализКоличество", "Рейтинг1Количество");
	
	ЗаполнитьРейтинги(ТаблицаДляОтчета, "ОборотАнализ", "Рейтинг1");
	
		
КонецПроцедуры

Процедура ЗаполнитьРейтинги(ТаблицаДляОтчета, ПолеРасчета, ПолеРейтинга)
	
	ПроцентАВС	= 0.8;
	ПроцентХ	= 0.2;
	ПроцентЗ	= 0.01;
	
	ПроцентА	= 0.4;
	ПроцентВ	= ПроцентА + 0.24;
	ПроцентС	= ПроцентВ + 0.16;
	
	Оборот_Сум	= ТаблицаДляОтчета.Итог(ПолеРасчета);
		
	ТаблицаДляОтчета.Сортировать(ПолеРасчета + " Убыв");
	НакопленнаяСумма 	= 0;
	СчетчикРейтингов	= Новый Соответствие;
	СчетчикРейтингов.Вставить("A", 0);
	СчетчикРейтингов.Вставить("B", 0);
	СчетчикРейтингов.Вставить("C", 0);
	СчетчикРейтингов.Вставить("X", 0);
	СчетчикРейтингов.Вставить("Z", 0);
	Для Каждого ТекСтрока Из ТаблицаДляОтчета Цикл
		
		Если НакопленнаяСумма < Оборот_Сум * ПроцентАВС Тогда
			Если НакопленнаяСумма < Оборот_Сум * ПроцентА Тогда 
				ТекСтрока.ГруппаАнализа = "A";
			ИначеЕсли НакопленнаяСумма < Оборот_Сум * ПроцентВ Тогда 
				ТекСтрока.ГруппаАнализа = "B";
			Иначе
				ТекСтрока.ГруппаАнализа = "C";
			КонецЕсли;
			ТекСтрока.ГруппаАнализаРодитель = "ABC";
		ИначеЕсли НакопленнаяСумма < Оборот_Сум * (ПроцентАВС + ПроцентХ - ПроцентЗ) Тогда
			ТекСтрока.ГруппаАнализа = "X";
			ТекСтрока.ГруппаАнализаРодитель = "XZ";
		Иначе
			ТекСтрока.ГруппаАнализа = "Z";
			ТекСтрока.ГруппаАнализаРодитель = "XZ";
		КонецЕсли;
		
		СчетчикРейтингов[ТекСтрока.ГруппаАнализа] = СчетчикРейтингов[ТекСтрока.ГруппаАнализа] + 1;
		ТекСтрока[ПолеРейтинга] = СтрШаблон("%1%2", ТекСтрока.ГруппаАнализа, Формат(СчетчикРейтингов[ТекСтрока.ГруппаАнализа], "ЧЦ=5; ЧВН=; ЧГ="));
		
		НакопленнаяСумма = НакопленнаяСумма + ТекСтрока[ПолеРасчета];
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСвойство(Имя)
	
	Результат	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка();
	
	Запрос	= Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Т.Ссылка КАК Ссылка ИЗ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК Т ГДЕ Т.Имя = &Имя";
	Запрос.УстановитьПараметр("Имя", Имя);
	
	Выборка	= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат	= Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции