////////////////////////////////////////////////////////////////////////////////
// Отражение зарплаты в финансовом учете.
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс
	
// Процедура предназначена для формирования движений по финансовому учету.
//
// Параметры:
//	Движения - коллекция движений документа, 
//	Отказ - булево, признак отказа от проведения документа.
//	ПериодРегистрации - дата, месяц, зарплата которого отражается в учете.
//	ДанныеДляОтражения - структура. Таблицы значений с данными, которые 
//						могут использоваться для формирования движений по финансовому учету.
//						При вызове процедуры ДанныеДляОтражения может содержать 
//						одно или несколько полей с приведенными ниже именами, т.е.
//						Необходимо проверять наличие того или иного элемента структуры.
//	Организация
//                             
Процедура ЗарегистрироватьЗарплатуВФинансовомУчете(Движения, Отказ, ПериодРегистрации, ДанныеДляОтражения, Организация) Экспорт
	
КонецПроцедуры

// Функция определяет возможность выполнения операции отражения зарплаты в финансовом учете, 
// осуществляемой документом «Отражение зарплаты в финансовом учете», 
// одним экземпляром документа по всем организациям.
//
// Возвращаемое значение - булево, 
//	Истина, если операция одним документом по всем организациям доступна, 
//	Ложь - в противном случае.
//
Функция ОтражениеЗарплатыВФинансовомУчетеОднимДокументомПоВсемОрганизациямДоступно() Экспорт

	Возврат Ложь;
	
КонецФункции

// УПК
Процедура ЗаполнитьПодразделениеПредприятияПоДоговорникамНА(ДанныеДляОтражения, СтруктураПараметров) Экспорт
	
	СтрокиДоходыКонтрагентов = ДанныеДляОтражения.НачисленнаяЗарплатаИВзносы.НайтиСтроки(Новый Структура("ВидОперации", Перечисления.ВидыОперацийПоЗарплате.ДоходыКонтрагентов));
	
	Если СтрокиДоходыКонтрагентов.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	СписокФизическихЛиц = Новый Массив;
	
	Для Каждого СтрокаНачисленнаяЗарплатаИВзносы Из СтрокиДоходыКонтрагентов Цикл
		СписокФизическихЛиц.Добавить(СтрокаНачисленнаяЗарплатаИВзносы.ФизическоеЛицо);	
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоответствияФизЛицКонтрагентамПоДоговорамГПХСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДоговорыКонтрагентов.Подразделение КАК ПодразделениеПредприятия
	|ИЗ
	|	РегистрСведений.СоответствияФизЛицКонтрагентамПоДоговорамГПХ.СрезПоследних(&ПериодРегистрации, ) КАК СоответствияФизЛицКонтрагентамПоДоговорамГПХСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО СоответствияФизЛицКонтрагентамПоДоговорамГПХСрезПоследних.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	СоответствияФизЛицКонтрагентамПоДоговорамГПХСрезПоследних.Организация = &Организация
	|	И СоответствияФизЛицКонтрагентамПоДоговорамГПХСрезПоследних.ФизическоеЛицо В(&СписокФизическихЛиц)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПодразделениеПредприятия";
	
	Запрос.УстановитьПараметр("СписокФизическихЛиц", СписокФизическихЛиц);
	Запрос.УстановитьПараметр("Организация",		 СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации",   СтруктураПараметров.ПериодРегистрации);
	
	ПодразделенияДоговорниковНА = Запрос.Выполнить().Выбрать();
	
	СтруктураПоиска = Новый Структура;

	СтруктураТабличныхЧастей = Новый Структура;
	
	ВидыОперацийРегламентированныеУдержанияНА = Новый Массив;
	ВидыОперацийРегламентированныеУдержанияНА.Добавить(Перечисления.ВидыОперацийПоЗарплате.ОПВДоходыКонтрагентов);
	ВидыОперацийРегламентированныеУдержанияНА.Добавить(Перечисления.ВидыОперацийПоЗарплате.ИПНДоходыКонтрагентов);
	ВидыОперацийРегламентированныеУдержанияНА.Добавить(Перечисления.ВидыОперацийПоЗарплате.ВОСМСДоходыКонтрагентов);
	
	СтруктураТабличныхЧастей.Вставить("РегламентированныеУдержания", ВидыОперацийРегламентированныеУдержанияНА);
	
	ВидыОперациУдержанияНА = Новый Массив;
	ВидыОперациУдержанияНА.Добавить(Перечисления.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты);
	ВидыОперациУдержанияНА.Добавить(Перечисления.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты);
	
	СтруктураТабличныхЧастей.Вставить("УдержаннаяЗарплата", ВидыОперациУдержанияНА);
	
	Для Каждого Строка Из СтрокиДоходыКонтрагентов Цикл
		
		ПодразделенияДоговорниковНА.Сбросить();
		
		Если ПодразделенияДоговорниковНА.НайтиСледующий(Строка.ФизическоеЛицо, "ФизическоеЛицо") Тогда
			
			Строка.ПодразделениеПредприятия = ПодразделенияДоговорниковНА.ПодразделениеПредприятия;
			
			СтруктураПоиска.Вставить("ФизическоеЛицо", Строка.ФизическоеЛицо);
			
			Для Каждого СтрокаТабличнаяЧасть Из СтруктураТабличныхЧастей Цикл
				
				НаименованиеТабличнойЧасти = СтрокаТабличнаяЧасть.Ключ;
				ВидыОпераций = СтрокаТабличнаяЧасть.Значение;
				
				Если НаименованиеТабличнойЧасти = "РегламентированныеУдержания" Тогда
					
					Если НЕ СтруктураПоиска.Свойство("ВидОперации") = Неопределено Тогда
						СтруктураПоиска.Удалить("ВидОперации");
					КонецЕсли;
					
					ИмяВидОперации = "ВидОперацииНалогиВзносы";
					
				Иначе 
					
					Если НЕ СтруктураПоиска.Свойство("ВидОперацииНалогиВзносы") = Неопределено Тогда
						СтруктураПоиска.Удалить("ВидОперацииНалогиВзносы");
					КонецЕсли;
					
					ИмяВидОперации = "ВидОперации";
					
				КонецЕсли;
				
				Для Каждого СтрокаВидаОперации Из ВидыОпераций Цикл
					
					СтруктураПоиска.Вставить(ИмяВидОперации, СтрокаВидаОперации);
					
					СтрокиПоКонтрагенту = ДанныеДляОтражения[НаименованиеТабличнойЧасти].НайтиСтроки(СтруктураПоиска);
					
					Если СтрокиПоКонтрагенту.Количество() > 0 Тогда
						
						Для Каждого СтрокаПоКонтрагенту Из СтрокиПоКонтрагенту Цикл
							СтрокаПоКонтрагенту.ПодразделениеПредприятия = ПодразделенияДоговорниковНА.ПодразделениеПредприятия;	
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;		
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПодразделениеПредприятияПени(ДанныеДляОтражения, СтруктураПараметров) Экспорт
	
	ПеняПоВзносамИОтчислениям = ДанныеДляОтражения.ПеняПоВзносамИОтчислениям;
	
	Если ПеняПоВзносамИОтчислениям.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПеняПоВзносамИОтчислениям", ПеняПоВзносамИОтчислениям);
	Запрос.УстановитьПараметр("ПериодРегистрации", СтруктураПараметров.ПериодРегистрации);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПеняПериоды.ФизическоеЛицо КАК ФизическоеЛицо,
		|	&ПериодРегистрации КАК Период
		|ПОМЕСТИТЬ ВТФизическиеЛицаПериоды
		|ИЗ
		|	&ПеняПоВзносамИОтчислениям КАК ПеняПериоды";
	
	Запрос.Выполнить();
	
	КадровыйУчет.СоздатьВТОсновныеСотрудникиФизическихЛицВПериодах(
		МенеджерВременныхТаблиц, Истина, СтруктураПараметров.Организация, "ВТФизическиеЛицаПериоды", "ВТСотрудникиПериоды");
		
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиПериоды");

	КадровыеДанные = "МестоВСтруктуреПредприятия, ДатаПриема";
	
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, КадровыеДанные);
	Запрос.Текст = "ВЫБРАТЬ
	               |	КадровыеДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	ВЫБОР
	               |		КОГДА КадровыеДанныеСотрудников.Период = КадровыеДанныеСотрудников.ДатаПриема
	               |			ТОГДА НАЧАЛОПЕРИОДА(КадровыеДанныеСотрудников.ДатаПриема, МЕСЯЦ)
	               |		ИНАЧЕ КадровыеДанныеСотрудников.Период
	               |	КОНЕЦ КАК Период,
	               |	МАКСИМУМ(КадровыеДанныеСотрудников.МестоВСтруктуреПредприятия) КАК МестоВСтруктуреПредприятия
	               |ИЗ
	               |	ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КадровыеДанныеСотрудников.ФизическоеЛицо,
	               |	ВЫБОР
	               |		КОГДА КадровыеДанныеСотрудников.Период = КадровыеДанныеСотрудников.ДатаПриема
	               |			ТОГДА НАЧАЛОПЕРИОДА(КадровыеДанныеСотрудников.ДатаПриема, МЕСЯЦ)
	               |		ИНАЧЕ КадровыеДанныеСотрудников.Период
	               |	КОНЕЦ
				   |
				   |ОБЪЕДИНИТЬ ВСЕ
				   |
				   // для начисление приема отдельно добавим таблицу с датами приема
				   |ВЫБРАТЬ
	               |	КадровыеДанныеСотрудников.ФизическоеЛицо,
	               |	НАЧАЛОПЕРИОДА(КадровыеДанныеСотрудников.ДатаПриема, ДЕНЬ),
	               |	КадровыеДанныеСотрудников.МестоВСтруктуреПредприятия
	               |ИЗ
	               |	ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
	               |
				   |ГДЕ
				   |	КадровыеДанныеСотрудников.Период = КадровыеДанныеСотрудников.ДатаПриема";
				   
	МестоВСтруктуреПредприятияСотрудников = Запрос.Выполнить().Выгрузить();
	МестоВСтруктуреПредприятияСотрудников.Индексы.Добавить("ФизическоеЛицо,Период");
	
	ТипСтруктураПредприятия = Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия");

	Для Каждого СтрокаТаблицы Из ПеняПоВзносамИОтчислениям Цикл 
		
		Отбор = Новый Структура("ФизическоеЛицо,Период", СтрокаТаблицы.ФизическоеЛицо, СтрокаТаблицы.ДатаНачала);
		НайденныеСтроки = МестоВСтруктуреПредприятияСотрудников.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда 
			СтрокаТаблицы.ПодразделениеПредприятия = НайденныеСтроки[0].МестоВСтруктуреПредприятия;
		КонецЕсли;
		
		// в УПК в налоговых регистрах отсутствует ДатаНачала в связи с чем возникают проблемы заполнения подразделения,
		// если сотрудник принят не с первого числа, получим МестоВСтруктуреПредприятия на начало 01.01.0001 - актуальное место
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ПодразделениеПредприятия) Тогда
			Отбор = Новый Структура("ФизическоеЛицо,Период", СтрокаТаблицы.ФизическоеЛицо, Дата(1,1,1));
			НайденныеСтроки = МестоВСтруктуреПредприятияСотрудников.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда 
				СтрокаТаблицы.ПодразделениеПредприятия = НайденныеСтроки[0].МестоВСтруктуреПредприятия;
			КонецЕсли;
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

// УПК

#КонецОбласти
