#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ВидыНалоговыхПлатежей() Экспорт
	
	ВидыПлатежей = Новый Массив;
	ВидыПлатежей.Добавить(Перечисления.ВидыПлатежейВГосБюджет.Налог);
	ВидыПлатежей.Добавить(Перечисления.ВидыПлатежейВГосБюджет.НалогАкт);
	ВидыПлатежей.Добавить(Перечисления.ВидыПлатежейВГосБюджет.НалогСам);
	
	Возврат ВидыПлатежей;
	
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МассивИсключаемыхЗначений = Новый Массив;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ОтключенныйФункционал") Тогда
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПлатежейВГосБюджет.РасходыПоСтрахованию"));
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПлатежейВГосБюджет.ПолученоИзФонда"));
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПлатежейВГосБюджет.НеПринято"));
		МассивИсключаемыхЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПлатежейВГосБюджет.ВзносыБезСпецоценки"));
	КонецЕсли;
	
	ОбщегоНазначенияУТВызовСервера.ДоступныеДляВыбораЗначенияПеречисления(
		"ВидыПлатежейВГосБюджет",
		ДанныеВыбора,
		Параметры,
		МассивИсключаемыхЗначений);
	
КонецПроцедуры

#КонецЕсли