
#Область ОбработчикиКоманд

&НаКлиенте
Процедура ПоказатьДанные(Команда)
	
	ПоказатьДанныеНаСервере();
	Элементы.ТекстДанных.Видимость = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоказатьДанныеНаСервере()
	
	Запрос	= Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Т.Данные КАК Данные ИЗ РегистрСведений.игр_ЖурналВходящихДанныхМобильноеПриложение КАК Т ГДЕ Т.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("Идентификатор", Запись.Идентификатор);
	
	Выборка	= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ТекстДанных = Выборка.Данные.Получить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти