
Функция DataPOST(Запрос)
	
	Возврат ПолучитьОтчетСервисаДата(Запрос);
	
КонецФункции


#Область СлужебныеПроцедурыИФункции

Функция ПолучитьОтчетСервисаДата(Запрос) 
	
	Ответ	= Новый HTTPСервисОтвет(400);
	Ответ.УстановитьТелоИзСтроки("Bad data");
	
	СтруктураЗапроса	= КоннекторHTTP.JsonВОбъект(Запрос.ПолучитьТелоКакСтроку());
	Если ТипЗнч(СтруктураЗапроса) = Тип("Соответствие") Тогда
		
		Попытка
			Результат	= ПолучитьОтветМетода(СтруктураЗапроса);
			Если ЗначениеЗаполнено(Результат) Тогда
				
				Ответ	= Новый HTTPСервисОтвет(200);
				
				Ответ.Заголовки	= Результат["Заголовки"];
				Если ТипЗнч(Результат["ТелоОтвета"]) = Тип("ДвоичныеДанные") Тогда
					Ответ.УстановитьТелоИзДвоичныхДанных(Результат["ТелоОтвета"]);
				Иначе
					Ответ.УстановитьТелоИзСтроки(КоннекторHTTP.ОбъектВJson(Результат["ТелоОтвета"]));
				КонецЕсли;
				
			КонецЕсли;
		Исключение
			Ответ	= Новый HTTPСервисОтвет(400);
			Ответ.УстановитьТелоИзСтроки(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьОтветМетода(СтруктураЗапроса)
	
	Результат	= Неопределено;
	Метод		= СтруктураЗапроса["method"];
	
	Если Метод = "getItemsByBarcode" Тогда
		Возврат игр_ОбработчикиMobileAPI.ПолучитьНоменклатуруПоШтрихкоду(СтруктураЗапроса);
	ИначеЕсли Метод = "getImage" Тогда
		Возврат игр_ОбработчикиMobileAPI.ПолучитьИзображениеНоменклатуры(СтруктураЗапроса);
	ИначеЕсли Метод = "getStoreList" Тогда
		Возврат игр_ОбработчикиMobileAPI.ПолучитьСписокСкладов(СтруктураЗапроса);
	ИначеЕсли Метод = "saveCountingItems" Тогда
		Возврат игр_ОбработчикиMobileAPI.СохранитьПересчетТоваров(СтруктураЗапроса);
	ИначеЕсли Метод = "getAllItems" Тогда
		Возврат игр_ОбработчикиMobileAPI.ПолучитьНоменклатуру(СтруктураЗапроса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти