
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
		"Организация", Организация,,, ЗначениеЗаполнено(Организация));
КонецПроцедуры

&НаКлиенте
Процедура БанковскийСчетПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
		"БанковскийСчет", БанковскийСчет,,, ЗначениеЗаполнено(БанковскийСчет));  
	
	ОбновитьИнформацию();
КонецПроцедуры

&НаКлиенте
Процедура ПриоритетПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
		"ПриоритетОплаты", Приоритет,,, ЗначениеЗаполнено(Приоритет));
	ОбновитьИнформацию(); 
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
		"Статус", Статус,,, ЗначениеЗаполнено(Статус));
КонецПроцедуры

&НаКлиенте
Процедура ФондПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
		"Фонд", Фонд,,, ЗначениеЗаполнено(Фонд));
	ОбновитьИнформацию(); 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Список.Параметры.УстановитьЗначениеПараметра("СтрокаФормаОплаты", НСтр("ru = 'Наличная или безналичная'")); 
	
	Элементы.ГруппаУстановить.Видимость = Пользователи.ЭтоПолноправныйПользователь(Неопределено);   
	
	ОбновитьСуммы();

КонецПроцедуры

&НаКлиенте
Процедура ОтборСостоянийПриИзменении(Элемент)

	ОтборЗначение	= Неопределено;
	Если ОтборСостояний = 1 Тогда
		ОтборЗначение	= ПредопределенноеЗначение("Перечисление.ФП_СостоянияЗаявокНаРасходДС.Подготовлена");
	ИначеЕсли ОтборСостояний = 2 Тогда
		ОтборЗначение	= ПредопределенноеЗначение("Перечисление.ФП_СостоянияЗаявокНаРасходДС.Согласована");
	ИначеЕсли ОтборСостояний = 3 Тогда
		ОтборЗначение	= ПредопределенноеЗначение("Перечисление.ФП_СостоянияЗаявокНаРасходДС.КОплате");
	ИначеЕсли ОтборСостояний = 4 Тогда
		ОтборЗначение	= ПредопределенноеЗначение("Перечисление.ФП_СостоянияЗаявокНаРасходДС.Оплачена");
	ИначеЕсли ОтборСостояний = 5 Тогда
		ОтборЗначение	= ПредопределенноеЗначение("Перечисление.ФП_СостоянияЗаявокНаРасходДС.Отменена");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
		"СостояниеФП", ОтборЗначение,,, ЗначениеЗаполнено(ОтборЗначение));
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
		"ДатаОплаты", ДатаНачала, ВидСравненияКомпоновкиДанных.БольшеИлиРавно,, ЗначениеЗаполнено(ДатаНачала));  
	
	ОбновитьСуммы();
	ОбновитьИнформацию(); 
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
		"ДатаОплаты", ДатаОкончания, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,, ЗначениеЗаполнено(ДатаОкончания));

	ОбновитьСуммы();
	ОбновитьИнформацию(); 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояние(Команда)   
	
	Значение	= Неопределено;    
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗаявок = Новый Массив;
	
	Для Каждого Элемент Из Элементы.Список.ВыделенныеСтроки Цикл 
		МассивЗаявок.Добавить(Элемент);
	КонецЦикла;
	
	Если Команда.Имя = "Подготовлена" Тогда
		Значение	= ПредопределенноеЗначение("Перечисление.ФП_СостоянияЗаявокНаРасходДС.Подготовлена");
	ИначеЕсли Команда.Имя = "Согласована" Тогда
		Значение	= ПредопределенноеЗначение("Перечисление.ФП_СостоянияЗаявокНаРасходДС.Согласована");
	ИначеЕсли Команда.Имя = "КОплате" Тогда
		Значение	= ПредопределенноеЗначение("Перечисление.ФП_СостоянияЗаявокНаРасходДС.КОплате");
	ИначеЕсли Команда.Имя = "Оплачено" Тогда
		Значение	= ПредопределенноеЗначение("Перечисление.ФП_СостоянияЗаявокНаРасходДС.Оплачена");
	ИначеЕсли Команда.Имя = "Отменено" Тогда
		Значение	= ПредопределенноеЗначение("Перечисление.ФП_СостоянияЗаявокНаРасходДС.Отменена");
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(Значение) Тогда
		УстановитьСостояниеНаСервере(МассивЗаявок, Значение);
	КонецЕсли;
	
	Элементы.Список.Обновить();
	ОбновитьСуммы();
	
КонецПроцедуры 

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьИнформацию();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеНаСервере(Заявки, Состояние)

	РегистрыСведений.ФП_СостоянияЗаявокНаРасходДС.УстановитьСостояние(Заявки, Состояние);
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьСуммы()
	
	Запрос	= Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ДенежныеСредстваКВыплатеОстаткиИОбороты.СуммаНачальныйОстаток) КАК СуммаНачальныйОстаток,
	|	СУММА(ДенежныеСредстваКВыплатеОстаткиИОбороты.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток,
	|	ФП_СостоянияЗаявокНаРасходДС.Состояние КАК Состояние,
	|	ДенежныеСредстваКВыплатеОстаткиИОбороты.ЗаявкаНаРасходованиеДенежныхСредств.ФормаОплатыНаличная КАК Наличная,
	|	ДенежныеСредстваКВыплатеОстаткиИОбороты.ЗаявкаНаРасходованиеДенежныхСредств.ФормаОплатыБезналичная КАК Безналичная
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваКВыплате.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, Период, , ) КАК ДенежныеСредстваКВыплатеОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФП_СостоянияЗаявокНаРасходДС КАК ФП_СостоянияЗаявокНаРасходДС
	|		ПО ДенежныеСредстваКВыплатеОстаткиИОбороты.ЗаявкаНаРасходованиеДенежныхСредств = ФП_СостоянияЗаявокНаРасходДС.Заявка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтборОплата
	|				ТОГДА ДенежныеСредстваКВыплатеОстаткиИОбороты.ЗаявкаНаРасходованиеДенежныхСредств.ФормаОплатыЗаявки = &ФормаОплаты
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ФП_СостоянияЗаявокНаРасходДС.Состояние,
	|	ДенежныеСредстваКВыплатеОстаткиИОбороты.ЗаявкаНаРасходованиеДенежныхСредств.ФормаОплатыНаличная,
	|	ДенежныеСредстваКВыплатеОстаткиИОбороты.ЗаявкаНаРасходованиеДенежныхСредств.ФормаОплатыБезналичная"
	;
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ФормаОплаты", ФормаОплаты);
	Запрос.УстановитьПараметр("ОтборОплата", ЗначениеЗаполнено(ФормаОплаты));
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	Иначе
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата(2050,1,1)));
	КонецЕсли;
	
	НеСогласовано = 0;
	НеСогласованоДо = 0;
	
	КОплате = 0;
	КОплатеДо = 0;
	
	Согласовано = 0;
	СогласованоДо = 0;
	
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Состояние = Перечисления.ФП_СостоянияЗаявокНаРасходДС.Подготовлена Тогда
			НеСогласовано = НеСогласовано + Выборка.СуммаКонечныйОстаток;
			НеСогласованоДо = НеСогласованоДо + Выборка.СуммаНачальныйОстаток;
		ИначеЕсли Выборка.Состояние = Перечисления.ФП_СостоянияЗаявокНаРасходДС.Согласована Тогда
			Согласовано = Согласовано + Выборка.СуммаКонечныйОстаток;
			СогласованоДо = СогласованоДо + Выборка.СуммаНачальныйОстаток;
		ИначеЕсли Выборка.Состояние = Перечисления.ФП_СостоянияЗаявокНаРасходДС.КОплате Тогда
			КОплате = КОплате + Выборка.СуммаКонечныйОстаток;
			КОплатеДо = КОплатеДо + Выборка.СуммаНачальныйОстаток;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	ОбновитьСуммы();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаОплатыПриИзменении(Элемент)

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
		"ФормаОплаты", ФормаОплаты, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ФормаОплаты));

	ОбновитьСуммы();  
	ОбновитьИнформацию(); 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформацию()

	Схема		= Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки	= Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	Состояния	= Новый Массив;
	Состояния.Добавить(Перечисления.ФП_СостоянияЗаявокНаРасходДС.Подготовлена);
	Состояния.Добавить(Перечисления.ФП_СостоянияЗаявокНаРасходДС.КОплате);
	Состояния.Добавить(Перечисления.ФП_СостоянияЗаявокНаРасходДС.Согласована);
	
	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Настройки, "СостояниеФП", Состояния, 
		ВидСравненияКомпоновкиДанных.ВСписке);
	
	КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки		= КомпоновщикМакета.Выполнить(Схема, Настройки,,,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода		= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаРезультата = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Запрос	= Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.Валюта КАК Валюта,
	|	Т.СуммаДокумента КАК СуммаДокумента,
	|	Т.СостояниеФП КАК СостояниеФП
	|ПОМЕСТИТЬ ВТ_ДанныеСписка
	|ИЗ
	|	&Т КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеСписка.Валюта КАК Валюта,
	|	СУММА(ВТ_ДанныеСписка.СуммаДокумента) КАК СуммаДокумента,
	|	ВТ_ДанныеСписка.СостояниеФП КАК СостояниеФП
	|ИЗ
	|	ВТ_ДанныеСписка КАК ВТ_ДанныеСписка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеСписка.Валюта,
	|	ВТ_ДанныеСписка.СостояниеФП
	|ИТОГИ
	|	СУММА(СуммаДокумента)
	|ПО
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДенежныеСредстваБезналичныеОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные.Остатки(, БанковскийСчет = &БанковскийСчет) КАК ДенежныеСредстваБезналичныеОстатки"
	;
	
	Запрос.УстановитьПараметр("Т", ТаблицаРезультата);  
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);  
	
	Результаты	= Запрос.ВыполнитьПакет();
	
	ВыборкаОстатки	= Результаты[2].Выбрать();
	Если ВыборкаОстатки.Следующий() Тогда
		Остаток	= ВыборкаОстатки.СуммаОстаток;
	Иначе     
		Остаток	= 0;
	КонецЕсли;  
	
	СуммаРасхода	= 0;

	Информация	= СтрШаблон("Остаток до: %1", Формат(Остаток, "ЧЦ=15; ЧДЦ=2")) 
		+ Символы.ПС + Символы.ПС;
	
	ВыборкаВалюта	= Результаты[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаВалюта.Следующий() Цикл
		Информация	= Информация + СтрШаблон("%1:", ВыборкаВалюта.Валюта) + Символы.ПС;
		ВыборкаСостояние	= ВыборкаВалюта.Выбрать();
		Пока ВыборкаСостояние.Следующий() Цикл
			Информация	= Информация + СтрШаблон("%1: %2", ВыборкаСостояние.СостояниеФП, 
				Формат(ВыборкаСостояние.СуммаДокумента, "ЧЦ=15; ЧДЦ=2")) + Символы.ПС;
				
			СуммаРасхода	= СуммаРасхода + ВыборкаСостояние.СуммаДокумента;
		КонецЦикла;
	КонецЦикла;

	Информация	= Информация + Символы.ПС + 
		СтрШаблон("Остаток после: %1", Формат(Остаток - СуммаРасхода, "ЧЦ=15; ЧДЦ=2"));
	
КонецПроцедуры

&НаСервере
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ОбновитьИнформацию();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаЗапросаОбновления()
	
	ОбновитьИнформацию(); 
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскийСчетОчистка(Элемент, СтандартнаяОбработка)

	ОбновитьИнформацию(); 
	
КонецПроцедуры
