
&ИзменениеИКонтроль("СформироватьВременныеТаблицыПоДокументам")
Функция игр_СформироватьВременныеТаблицыПоДокументам(ПараметрыОбмена, МассивДанных)

	ОбщийЗапрос = Новый Запрос;

	ОбщийЗапрос.УстановитьПараметр("МассивДанных"			, МассивДанных);
	ОбщийЗапрос.УстановитьПараметр("СвойствоИдМетодаОплаты"	, ПараметрыОбмена.СвойствоИдМетодаОплаты);
	ОбщийЗапрос.УстановитьПараметр("СвойствоИдентификаторОтправления", ПараметрыОбмена.СвойствоИдентификаторОтправления);

	лИспользуетсяСтатусЗаказаСостояние 	= Ложь;
	лИспользуетсяСтатусЗаказаСвойство 	= Ложь;
	лСтатусЗаказаСвойство 				= Ложь;

	лНастройкиСтатусовЗаказа = ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(ПараметрыОбмена, "НастройкиСтатусовЗаказа");
	Если лНастройкиСтатусовЗаказа <> Неопределено тогда

		Если лНастройкиСтатусовЗаказа.ИсточникСтатусов1С = "СостоянияЗаказов" тогда
			лИспользуетсяСтатусЗаказаСостояние = Истина;
		ИначеЕсли лНастройкиСтатусовЗаказа.ИсточникСтатусов1С = "СвойствоЗаказов" тогда
			лИспользуетсяСтатусЗаказаСвойство = Истина;
			лСтатусЗаказаСвойство = ПараметрыОбмена.НастройкиСтатусовЗаказа.СвойствоЗаказа;
		КонецЕсли;

	КонецЕсли;

	ОбщийЗапрос.УстановитьПараметр("ИспользуетсяСтатусЗаказаСостояние"	, лИспользуетсяСтатусЗаказаСостояние);
	ОбщийЗапрос.УстановитьПараметр("ИспользуетсяСтатусЗаказаСвойство"	, лИспользуетсяСтатусЗаказаСвойство);
	ОбщийЗапрос.УстановитьПараметр("СтатусЗаказаСвойство"				, лСтатусЗаказаСвойство);


	лИспользуетсяСлужбыДоставкиЗаказаСвойство 	= Ложь;
	лИспользуетсяСлужбыДоставкиОтгрузкиСвойство = Ложь;
	лСлужбаДоставкиЗаказСвойство 	= Ложь;
	лСлужбаДоставкиОтгрузкиСвойство = Ложь;

	лНастройкиСлужбДоставкиДокументов = ПланыОбмена.Б_ОбменССайтом.ПолучитьЗначениеКлючаСтруктурыНастроек(ПараметрыОбмена, "НастройкиСлужбДоставкиДокументов");
	Если лНастройкиСлужбДоставкиДокументов <> Неопределено тогда

		лСлужбаДоставкиЗаказСвойство 	= ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СвойствоЗаказа;
		лСлужбаДоставкиОтгрузкиСвойство = ПараметрыОбмена.НастройкиСлужбДоставкиДокументов.СвойствоОтгрузки;

		Если лНастройкиСлужбДоставкиДокументов.ИсточникСлужбДоставкиЗаказа = "СвойствоЗаказов" И ЗначениеЗаполнено(лСлужбаДоставкиЗаказСвойство) тогда
			лИспользуетсяСлужбыДоставкиЗаказаСвойство = Истина;
		КонецЕсли;

		Если ПараметрыОбмена.ВыгрузкаОтгрузок  И ЗначениеЗаполнено(лСлужбаДоставкиОтгрузкиСвойство)  тогда
			лИспользуетсяСлужбыДоставкиОтгрузкиСвойство = Истина;
		КонецЕсли;

	КонецЕсли;

	ОбщийЗапрос.УстановитьПараметр("ИспользуетсяСлужбыДоставкиЗаказаСвойство"	, лИспользуетсяСлужбыДоставкиЗаказаСвойство);
	ОбщийЗапрос.УстановитьПараметр("ИспользуетсяСлужбыДоставкиОтгрузкиСвойство"	, лИспользуетсяСлужбыДоставкиОтгрузкиСвойство);
	ОбщийЗапрос.УстановитьПараметр("СлужбаДоставкиЗаказСвойство"				, лСлужбаДоставкиЗаказСвойство);
	ОбщийЗапрос.УстановитьПараметр("СлужбаДоставкиОтгрузкиСвойство"				, лСлужбаДоставкиОтгрузкиСвойство);


	ОбщийЗапрос.УстановитьПараметр("ВыгружаемыеОплатыПоОтборам"		, ПараметрыОбмена.ВыгружаемыеОплатыПоОтборам);
	ОбщийЗапрос.УстановитьПараметр("ВыгружаемыеОтгрузкиПоОтборам"	, ПараметрыОбмена.ВыгружаемыеОтгрузкиПоОтборам);

	ОбщийЗапрос.УстановитьПараметр("ИспользоватьОтборПоОплатам"		, ?(ПараметрыОбмена.ВыгружаемыеОплатыПоОтборам = Неопределено, Ложь, Истина));
	ОбщийЗапрос.УстановитьПараметр("ИспользоватьОтборПоОтгрузкам"	, ?(ПараметрыОбмена.ВыгружаемыеОтгрузкиПоОтборам = Неопределено, Ложь, Истина));

	МенеджерВременныхТаблицДокументов 	= Новый МенеджерВременныхТаблиц;
	ОбщийЗапрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблицДокументов;

	ЗапросПоЗаказам = "ВЫБРАТЬ
	|	МассивДанных.Объект КАК Объект
	|ПОМЕСТИТЬ ВремМассивДанных
	|ИЗ
	|	&МассивДанных КАК МассивДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиента.Ссылка КАК Документ,
	|	""Заказ"" КАК ТипДокумента
	|ПОМЕСТИТЬ ВремЗаказы
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка В
	|			(ВЫБРАТЬ
	|				ВремМассивДанных.Объект
	|			ИЗ
	|				ВремМассивДанных)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Заказ,
	|	ЗаказКлиента.Валюта КАК Валюта,
	|	ЗаказКлиента.СуммаДокумента КАК СуммаДокумента,
	|	ЗаказКлиента.Б_Идентификатор КАК Б_Идентификатор,
	|	ЗаказКлиента.Б_НомерВерсии КАК Б_НомерВерсии
	|ПОМЕСТИТЬ ВремВыгружаемыеЗаказы
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка В
	|			(ВЫБРАТЬ
	|				ВремЗаказы.Документ
	|			ИЗ
	|				ВремЗаказы)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремВыгружаемыеЗаказы.Заказ КАК Заказ,
	|	ВремВыгружаемыеЗаказы.Валюта КАК Валюта,
	|	ВремВыгружаемыеЗаказы.СуммаДокумента - ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаОплаты, 0) КАК ЗаказКОплатеОстаток,
	|	ВремВыгружаемыеЗаказы.СуммаДокумента - ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаОтгрузки, 0) КАК ЗаказКОтгрузкеОстаток,
	|	ВремВыгружаемыеЗаказы.Б_Идентификатор КАК Б_Идентификатор,
	|	ВремВыгружаемыеЗаказы.Б_НомерВерсии КАК Б_НомерВерсии,
	#удаление
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов
	#КонецУдаления
	#Вставка
	|	ВремВыгружаемыеЗаказы.Заказ КАК ОбъектРасчетов
	#КонецВставки
	|ПОМЕСТИТЬ ВремЗаказыСВалютой
	|ИЗ
	|	ВремВыгружаемыеЗаказы КАК ВремВыгружаемыеЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|		ПО (СостоянияЗаказовКлиентов.Заказ = ВремВыгружаемыеЗаказы.Заказ)
	#Удаление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО ВремВыгружаемыеЗаказы.Заказ = ОбъектыРасчетов.Объект
	#КонецУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремВыгружаемыеЗаказы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Регистратор КАК Отгрузка,
	|	ВложенныйЗапрос.Заказ КАК Заказ,
	|	ВложенныйЗапрос.Регистратор.Дата КАК Дата,
	|	ВложенныйЗапрос.Регистратор.Номер КАК Номер
	|ПОМЕСТИТЬ ВремОтгрузкиЗаказов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВремЗаказыСВалютой.Валюта КАК Валюта,
	|		ВремЗаказыСВалютой.Заказ КАК Заказ,
	|		МАКСИМУМ(Оформлено.Регистратор) КАК Регистратор
	|	ИЗ
	|		ВремЗаказыСВалютой КАК ВремЗаказыСВалютой
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыКлиентов КАК Оформлено
	|			ПО ВремЗаказыСВалютой.Заказ = Оформлено.ЗаказКлиента
	|				И (Оформлено.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВремЗаказыСВалютой.Валюта,
	|		ВремЗаказыСВалютой.Заказ) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////

	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Заказ КАК Заказ,
	|	ВложенныйЗапрос.Регистратор.Дата КАК Дата,
	|	ВложенныйЗапрос.Регистратор.Номер КАК Номер
	|ПОМЕСТИТЬ ВремОплатыЗаказов
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(РасчетыСКлиентами.Регистратор) КАК Регистратор,
	|		ВремЗаказыСВалютой.Заказ КАК Заказ
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремЗаказыСВалютой КАК ВремЗаказыСВалютой
	#Удаление
	|			ПО (ВремЗаказыСВалютой.ОбъектРасчетов = РасчетыСКлиентами.ОбъектРасчетов)
	#КонецУдаления
	#Вставка
	|			ПО (ВремЗаказыСВалютой.ОбъектРасчетов = РасчетыСКлиентами.ЗаказКлиента)
	#КонецВставки
	|				И (РасчетыСКлиентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|				И (РасчетыСКлиентами.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|					ИЛИ РасчетыСКлиентами.Регистратор ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	|					ИЛИ РасчетыСКлиентами.Регистратор ССЫЛКА Документ.ОперацияПоПлатежнойКарте)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВремЗаказыСВалютой.Заказ) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремЗаказыСВалютой.Заказ КАК Заказ,
	|	ВЫБОР
	|		КОГДА ВремЗаказыСВалютой.Б_Идентификатор = """"
	|			ТОГДА ВремЗаказыСВалютой.Заказ
	|		ИНАЧЕ ВремЗаказыСВалютой.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторЗаказа,
	|	ЕСТЬNULL(ВремОплатыЗаказов.Номер, """") КАК ЗаказНомерОплаты,
	|	ЕСТЬNULL(ВремОплатыЗаказов.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ЗаказДатаОплаты,
	|	ЕСТЬNULL(ВремОтгрузкиЗаказов.Номер, """") КАК ЗаказНомерОтгрузки,
	|	ЕСТЬNULL(ВремОтгрузкиЗаказов.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ЗаказДатаОтгрузки,
	|	Валюты.Ссылка КАК Валюта,
	|	ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) КАК Курс,
	|	ВремЗаказыСВалютой.ЗаказКОплатеОстаток КАК ЗаказКОплатеОстаток,
	|	ВремЗаказыСВалютой.ЗаказКОтгрузкеОстаток КАК ЗаказКОтгрузкеОстаток
	|ПОМЕСТИТЬ ВремСсылкиДокументов
	|ИЗ
	|	ВремЗаказыСВалютой КАК ВремЗаказыСВалютой
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремОплатыЗаказов КАК ВремОплатыЗаказов
	|		ПО ВремЗаказыСВалютой.Заказ = ВремОплатыЗаказов.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремОтгрузкиЗаказов КАК ВремОтгрузкиЗаказов
	|		ПО ВремЗаказыСВалютой.Заказ = ВремОтгрузкиЗаказов.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ВремЗаказыСВалютой.Валюта = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				,
	|				Валюта В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВремЗаказыСВалютой.Валюта
	|					ИЗ
	|						ВремЗаказыСВалютой КАК ВремЗаказыСВалютой)) КАК КурсыВалютСрезПоследних
	|		ПО ВремЗаказыСВалютой.Валюта = КурсыВалютСрезПоследних.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Отменено КАК Отменено,
	|	ЗаказКлиентаТовары.Ссылка КАК Заказ
	|ПОМЕСТИТЬ ВремНеОтмененныеСтрокиЗаказов
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Отменено = ЛОЖЬ
	|	И ЗаказКлиентаТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ВремЗаказы.Документ
	|			ИЗ
	|				ВремЗаказы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремЗаказыСВалютой
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремОтгрузкиЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремОплатыЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремСсылкиДокументов.Заказ КАК Объект,
	|	ЗаказКлиента.Ссылка КАК Заказ,
	|	ВремСсылкиДокументов.ИдентификаторЗаказа КАК ИдентификаторДокумента,
	|	ЗаказКлиента.ВерсияДанных КАК ВерсияДанных,
	|	ЗаказКлиента.ПометкаУдаления КАК ПометкаУдаления,
	|	ЗаказКлиента.Номер КАК Номер,
	|	ЗаказКлиента.Дата КАК Дата,
	|	ЗаказКлиента.Проведен КАК Проведен,
	|	ЗаказКлиента.АдресДоставки КАК АдресДоставки,
	|	ВремСсылкиДокументов.Валюта КАК Валюта,
	|	ВремСсылкиДокументов.Курс КАК Курс,
	|	ЗаказКлиента.Контрагент КАК Контрагент,
	|	ЗаказКлиента.Партнер КАК Партнер,
	|	ЗаказКлиента.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА ЗаказКлиента.Склад.Б_Идентификатор = """"
	|			ТОГДА ЗаказКлиента.Склад
	|		ИНАЧЕ ЗаказКлиента.Склад.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторСклада,
	|	ЗаказКлиента.Склад.Наименование КАК НаименованиеСклада,
	|	ЗаказКлиента.Комментарий КАК Комментарий,
	|	ЗаказКлиента.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ЗаказКлиента.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ЗаказКлиента.Статус КАК Статус,
	|	""Заказ"" КАК ТипДокумента,
	|	ЗаказКлиента.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	ЗаказКлиента.Б_Идентификатор КАК НомерССайта,
	|	ЗаказКлиента.Б_ДатаДокумента КАК ДатаССайта,
	|	ЗаказКлиента.ПеревозчикПартнер КАК Перевозчик,
	|	ВремСсылкиДокументов.ЗаказНомерОтгрузки КАК НомерДокументаОтгрузки,
	|	ВремСсылкиДокументов.ЗаказДатаОтгрузки КАК ДатаДокументаОтгрузки,
	|	ВремСсылкиДокументов.ЗаказНомерОплаты КАК НомерДокументаОплаты,
	|	ВремСсылкиДокументов.ЗаказДатаОплаты КАК ДатаДокументаОплаты,
	|	ВремСсылкиДокументов.ЗаказКОплатеОстаток КАК КОплатеОстаток,
	|	ВремСсылкиДокументов.ЗаказКОтгрузкеОстаток КАК КОтгрузкеОстаток,
	|	"""" КАК ИдентификаторОснования,
	|	ЗаказКлиента.Валюта.Наименование КАК ВалютаКод,
	|	ЗаказКлиента.СуммаДокумента КАК СуммаДокумента,
	|	ВЫБОР
	|		КОГДА ВремСсылкиДокументов.ЗаказКОплатеОстаток <= 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Оплачен,
	|	ВЫБОР
	|		КОГДА ВремСсылкиДокументов.ЗаказКОтгрузкеОстаток <= 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Отгружен,
	|	ВЫБОР
	|		КОГДА НЕ ВремСсылкиДокументов.Заказ В
	|					(ВЫБРАТЬ
	|						ВремНеОтмененныеСтрокиЗаказов.Заказ
	|					ИЗ
	|						ВремНеОтмененныеСтрокиЗаказов)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЗаказКлиента.ПометкаУдаления
	|	КОНЕЦ КАК Отменен,
	|	ЗаказКлиента.СпособДоставки КАК СпособДоставки
	|ПОМЕСТИТЬ ВремИнформацияОЗаказахПромежуточная
	|ИЗ
	|	ВремСсылкиДокументов КАК ВремСсылкиДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО ВремСсылкиДокументов.Заказ = ЗаказКлиента.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремНеОтмененныеСтрокиЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремСсылкиДокументов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиентаДополнительныеРеквизиты.Свойство КАК Свойство,
	|	ЗаказКлиентаДополнительныеРеквизиты.Значение КАК Значение,
	|	ЗаказКлиентаДополнительныеРеквизиты.Ссылка КАК Объект
	|ПОМЕСТИТЬ ВремСтатусСвойствоЗаказов
	|ИЗ
	|	Документ.ЗаказКлиента.ДополнительныеРеквизиты КАК ЗаказКлиентаДополнительныеРеквизиты
	|ГДЕ
	|	ЗаказКлиентаДополнительныеРеквизиты.Ссылка В
	|			(ВЫБРАТЬ
	|				ВремЗаказы.Документ
	|			ИЗ
	|				ВремЗаказы)
	|	И &ИспользуетсяСтатусЗаказаСвойство
	|	И ЗаказКлиентаДополнительныеРеквизиты.Свойство = &СтатусЗаказаСвойство
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Свойство,
	|	ДополнительныеСведения.Значение,
	|	ДополнительныеСведения.Объект
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект В
	|			(ВЫБРАТЬ
	|				ВремЗаказы.Документ
	|			ИЗ
	|				ВремЗаказы)
	|	И &ИспользуетсяСтатусЗаказаСвойство
	|	И ДополнительныеСведения.Свойство = &СтатусЗаказаСвойство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиентаДополнительныеРеквизиты.Свойство КАК Свойство,
	|	ЗаказКлиентаДополнительныеРеквизиты.Значение КАК Значение,
	|	ЗаказКлиентаДополнительныеРеквизиты.Ссылка КАК Объект
	|ПОМЕСТИТЬ ВремСлужбаДоставкиСвойствоЗаказов
	|ИЗ
	|	Документ.ЗаказКлиента.ДополнительныеРеквизиты КАК ЗаказКлиентаДополнительныеРеквизиты
	|ГДЕ
	|	ЗаказКлиентаДополнительныеРеквизиты.Ссылка В
	|			(ВЫБРАТЬ
	|				ВремЗаказы.Документ
	|			ИЗ
	|				ВремЗаказы)
	|	И &ИспользуетсяСлужбыДоставкиЗаказаСвойство
	|	И ЗаказКлиентаДополнительныеРеквизиты.Свойство = &СлужбаДоставкиЗаказСвойство
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Свойство,
	|	ДополнительныеСведения.Значение,
	|	ДополнительныеСведения.Объект
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект В
	|			(ВЫБРАТЬ
	|				ВремЗаказы.Документ
	|			ИЗ
	|				ВремЗаказы)
	|	И &ИспользуетсяСлужбыДоставкиЗаказаСвойство
	|	И ДополнительныеСведения.Свойство = &СлужбаДоставкиЗаказСвойство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостоянияЗаказовКлиентов.Заказ КАК Объект,
	|	СостоянияЗаказовКлиентов.Состояние КАК Состояние
	|ПОМЕСТИТЬ ВремСостоянияЗаказов
	|ИЗ
	|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|ГДЕ
	|	&ИспользуетсяСтатусЗаказаСостояние
	|	И СостоянияЗаказовКлиентов.Заказ В
	|			(ВЫБРАТЬ
	|				ВремЗаказы.Документ
	|			ИЗ
	|				ВремЗаказы)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремЗаказы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремИнформацияОЗаказахПромежуточная.Объект КАК Объект,
	|	ВремИнформацияОЗаказахПромежуточная.Заказ КАК Заказ,
	|	ВремИнформацияОЗаказахПромежуточная.ИдентификаторДокумента КАК ИдентификаторДокумента,
	|	ВремИнформацияОЗаказахПромежуточная.ВерсияДанных КАК ВерсияДанных,
	|	ВремИнформацияОЗаказахПромежуточная.ПометкаУдаления КАК ПометкаУдаления,
	|	ВремИнформацияОЗаказахПромежуточная.Номер КАК Номер,
	|	ВремИнформацияОЗаказахПромежуточная.Дата КАК Дата,
	|	ВремИнформацияОЗаказахПромежуточная.Проведен КАК Проведен,
	|	ВремИнформацияОЗаказахПромежуточная.АдресДоставки КАК АдресДоставки,
	|	ВремИнформацияОЗаказахПромежуточная.Валюта КАК Валюта,
	|	ВремИнформацияОЗаказахПромежуточная.Курс КАК Курс,
	|	ВремИнформацияОЗаказахПромежуточная.Контрагент КАК Контрагент,
	|	ВремИнформацияОЗаказахПромежуточная.Партнер КАК Партнер,
	|	ВремИнформацияОЗаказахПромежуточная.Склад КАК Склад,
	|	ВремИнформацияОЗаказахПромежуточная.ИдентификаторСклада КАК ИдентификаторСклада,
	|	ВремИнформацияОЗаказахПромежуточная.НаименованиеСклада КАК НаименованиеСклада,
	|	ВремИнформацияОЗаказахПромежуточная.Комментарий КАК Комментарий,
	|	ВремИнформацияОЗаказахПромежуточная.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ВремИнформацияОЗаказахПромежуточная.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ВремИнформацияОЗаказахПромежуточная.Статус КАК Статус,
	|	ВремИнформацияОЗаказахПромежуточная.ТипДокумента КАК ТипДокумента,
	|	ВремИнформацияОЗаказахПромежуточная.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	ВремИнформацияОЗаказахПромежуточная.НомерССайта КАК НомерССайта,
	|	ВремИнформацияОЗаказахПромежуточная.ДатаССайта КАК ДатаССайта,
	|	ВремИнформацияОЗаказахПромежуточная.НомерДокументаОтгрузки КАК НомерДокументаОтгрузки,
	|	ВремИнформацияОЗаказахПромежуточная.ДатаДокументаОтгрузки КАК ДатаДокументаОтгрузки,
	|	ВремИнформацияОЗаказахПромежуточная.НомерДокументаОплаты КАК НомерДокументаОплаты,
	|	ВремИнформацияОЗаказахПромежуточная.ДатаДокументаОплаты КАК ДатаДокументаОплаты,
	|	ВремИнформацияОЗаказахПромежуточная.КОплатеОстаток КАК КОплатеОстаток,
	|	ВремИнформацияОЗаказахПромежуточная.КОтгрузкеОстаток КАК КОтгрузкеОстаток,
	|	ВремИнформацияОЗаказахПромежуточная.ИдентификаторОснования КАК ИдентификаторОснования,
	|	ВремИнформацияОЗаказахПромежуточная.ВалютаКод КАК ВалютаКод,
	|	ВремИнформацияОЗаказахПромежуточная.СуммаДокумента КАК СуммаДокумента,
	|	ВремИнформацияОЗаказахПромежуточная.Оплачен КАК Оплачен,
	|	ВремИнформацияОЗаказахПромежуточная.Отгружен КАК Отгружен,
	|	ВремИнформацияОЗаказахПромежуточная.Отменен КАК Отменен,
	|	ВремИнформацияОЗаказахПромежуточная.Перевозчик КАК Перевозчик,
	|	ВремСостоянияЗаказов.Состояние КАК СостояниеЗаказа,
	|	ВремСтатусСвойствоЗаказов.Значение КАК СвойствоСтатусЗаказа,
	|	ВремСлужбаДоставкиСвойствоЗаказов.Значение КАК СвойствоСлужбаДоставкиЗаказа,
	|	ВремИнформацияОЗаказахПромежуточная.СпособДоставки КАК СпособДоставки
	|ПОМЕСТИТЬ ВремИнформацияОЗаказах
	|ИЗ
	|	ВремИнформацияОЗаказахПромежуточная КАК ВремИнформацияОЗаказахПромежуточная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремСостоянияЗаказов КАК ВремСостоянияЗаказов
	|		ПО ВремИнформацияОЗаказахПромежуточная.Объект = ВремСостоянияЗаказов.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремСтатусСвойствоЗаказов КАК ВремСтатусСвойствоЗаказов
	|		ПО ВремИнформацияОЗаказахПромежуточная.Объект = ВремСтатусСвойствоЗаказов.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремСлужбаДоставкиСвойствоЗаказов КАК ВремСлужбаДоставкиСвойствоЗаказов
	|		ПО ВремИнформацияОЗаказахПромежуточная.Объект = ВремСлужбаДоставкиСвойствоЗаказов.Объект
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремИнформацияОЗаказахПромежуточная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремСлужбаДоставкиСвойствоЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремСостоянияЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремСтатусСвойствоЗаказов";

	ЗапросПоОтгрузкам = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.Ссылка КАК Документ,
	|	""Отгрузка"" КАК ТипДокумента
	|ПОМЕСТИТЬ ВремОтгрузки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ИспользоватьОтборПоОтгрузкам 
	|				ТОГДА РеализацияТоваровУслуг.Ссылка В (&ВыгружаемыеОтгрузкиПоОтборам)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|И (ЗаказКлиента В (ВЫБРАТЬ Объект ИЗ ВремМассивДанных) 
	|	ИЛИ Ссылка В (ВЫБРАТЬ Объект ИЗ ВремМассивДанных))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугДополнительныеРеквизиты.Ссылка КАК Документ,
	|	РеализацияТоваровУслугДополнительныеРеквизиты.Значение,
	|	РеализацияТоваровУслугДополнительныеРеквизиты.Свойство
	|ПОМЕСТИТЬ ВремСуммаДоставкиДокументов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ДополнительныеРеквизиты КАК РеализацияТоваровУслугДополнительныеРеквизиты
	|ГДЕ
	|	РеализацияТоваровУслугДополнительныеРеквизиты.Свойство.Наименование = ""Сумма доставки""
	|	И РеализацияТоваровУслугДополнительныеРеквизиты.Ссылка В
	|			(ВЫБРАТЬ
	|				ВремОтгрузки.Документ
	|			ИЗ
	|				ВремОтгрузки)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.Ссылка КАК Отгрузка,
	|	РеализацияТоваровУслуг.Ссылка КАК Объект,
	|	РеализацияТоваровУслуг.Валюта,
	|	РеализацияТоваровУслуг.Б_Идентификатор КАК Б_Идентификатор,
	|	РеализацияТоваровУслуг.ВерсияДанных КАК ВерсияДанных,
	|	РеализацияТоваровУслуг.ПометкаУдаления КАК ПометкаУдаления,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Проведен КАК Проведен,
	|	РеализацияТоваровУслуг.АдресДоставки КАК АдресДоставки,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Партнер КАК Партнер,
	|	РеализацияТоваровУслуг.Склад КАК Склад,
	|	РеализацияТоваровУслуг.Комментарий КАК Комментарий,
	|	РеализацияТоваровУслуг.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	РеализацияТоваровУслуг.НалогообложениеНДС КАК НалогообложениеНДС,
	|	РеализацияТоваровУслуг.Статус КАК Статус,
	|	РеализацияТоваровУслуг.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	РеализацияТоваровУслуг.Б_ДатаДокумента КАК Б_ДатаДокумента,
	|	РеализацияТоваровУслуг.ЗаказКлиента КАК ЗаказКлиента,
	|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ ВремВыгружаемыеОтгрузки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В
	|			(ВЫБРАТЬ
	|				ВремОтгрузки.Документ
	|			ИЗ
	|				ВремОтгрузки)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Отгрузка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугДополнительныеРеквизиты.Свойство,
	|	РеализацияТоваровУслугДополнительныеРеквизиты.Значение,
	|	РеализацияТоваровУслугДополнительныеРеквизиты.Ссылка КАК Объект
	|ПОМЕСТИТЬ ВремСлужбаДоставкиСвойствоОтгрузок
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ДополнительныеРеквизиты КАК РеализацияТоваровУслугДополнительныеРеквизиты
	|ГДЕ
	|	РеализацияТоваровУслугДополнительныеРеквизиты.Ссылка В
	|			(ВЫБРАТЬ
	|				ВремОтгрузки.Документ
	|			ИЗ
	|				ВремОтгрузки)
	|	И &ИспользуетсяСлужбыДоставкиОтгрузкиСвойство
	|	И РеализацияТоваровУслугДополнительныеРеквизиты.Свойство = &СлужбаДоставкиОтгрузкиСвойство
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Свойство,
	|	ДополнительныеСведения.Значение,
	|	ДополнительныеСведения.Объект
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект В
	|			(ВЫБРАТЬ
	|				ВремОтгрузки.Документ
	|			ИЗ
	|				ВремОтгрузки)
	|	И &ИспользуетсяСлужбыДоставкиОтгрузкиСвойство
	|	И ДополнительныеСведения.Свойство = &СлужбаДоставкиОтгрузкиСвойство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Объект КАК Объект,
	|	ДополнительныеСведения.Значение
	|ПОМЕСТИТЬ ВремИдентификаторыОтправленияОтгрузки
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Свойство = &СвойствоИдентификаторОтправления
	|	И ДополнительныеСведения.Объект В
	|			(ВЫБРАТЬ
	|				ВремОтгрузки.Документ
	|			ИЗ
	|				ВремОтгрузки)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремВыгружаемыеОтгрузки.Отгрузка КАК Объект,
	|	ВремВыгружаемыеОтгрузки.ЗаказКлиента КАК Заказ,
	|	ВЫБОР
	|		КОГДА ВремВыгружаемыеОтгрузки.Б_Идентификатор = """"
	|			ТОГДА ВремВыгружаемыеОтгрузки.Отгрузка
	|		ИНАЧЕ ВремВыгружаемыеОтгрузки.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторДокумента,
	|	ВремВыгружаемыеОтгрузки.ВерсияДанных,
	|	ВремВыгружаемыеОтгрузки.ПометкаУдаления,
	|	ВремВыгружаемыеОтгрузки.Номер,
	|	ВремВыгружаемыеОтгрузки.Дата,
	|	ВремВыгружаемыеОтгрузки.Проведен,
	|	ВремВыгружаемыеОтгрузки.АдресДоставки,
	|	ВремВыгружаемыеОтгрузки.Валюта,
	|	ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) КАК Курс,
	|	ВремВыгружаемыеОтгрузки.Контрагент,
	|	ВремВыгружаемыеОтгрузки.Партнер,
	|	ВремВыгружаемыеОтгрузки.Склад,
	|	ВЫБОР
	|		КОГДА ВремВыгружаемыеОтгрузки.Склад.Б_Идентификатор = """"
	|			ТОГДА ВремВыгружаемыеОтгрузки.Склад
	|		ИНАЧЕ ВремВыгружаемыеОтгрузки.Склад.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторСклада,
	|	ВремВыгружаемыеОтгрузки.Склад.Наименование КАК НаименованиеСклада,
	|	ВремВыгружаемыеОтгрузки.Комментарий,
	|	ВремВыгружаемыеОтгрузки.ЦенаВключаетНДС,
	|	ВремВыгружаемыеОтгрузки.НалогообложениеНДС,
	|	ВремВыгружаемыеОтгрузки.Статус,
	|	ВремВыгружаемыеОтгрузки.БанковскийСчетКонтрагента,
	|	ВремВыгружаемыеОтгрузки.Б_Идентификатор КАК НомерССайта,
	|	ВремВыгружаемыеОтгрузки.Б_ДатаДокумента КАК ДатаССайта,
	|	ВЫБОР
	|		КОГДА ВремВыгружаемыеОтгрузки.ЗаказКлиента.Б_Идентификатор = """"
	|			ТОГДА ВремВыгружаемыеОтгрузки.ЗаказКлиента
	|		ИНАЧЕ ВремВыгружаемыеОтгрузки.ЗаказКлиента.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторОснования,
	|	ВремВыгружаемыеОтгрузки.Валюта.Наименование КАК ВалютаКод,
	|	ВремВыгружаемыеОтгрузки.СуммаДокумента,
	|	ВремВыгружаемыеОтгрузки.ПометкаУдаления КАК Отменен,
	|	ВЫБОР
	|		КОГДА ВремВыгружаемыеОтгрузки.Проведен
	|				И ВремВыгружаемыеОтгрузки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРеализацийТоваровУслуг.Отгружено)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Отгружен,
	|	ВЫБОР
	|		КОГДА ВремСуммаДоставкиДокументов.Значение ЕСТЬ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ ВремСуммаДоставкиДокументов.Значение
	|	КОНЕЦ КАК СуммаДоставки,
	|	ВремСлужбаДоставкиСвойствоОтгрузок.Значение КАК СвойствоСлужбаДоставкиОтгрузки,
	|	ВремИдентификаторыОтправленияОтгрузки.Значение КАК ИдентификаторОтправления,
	|	""Отгрузка"" КАК ТипДокумента
	|ПОМЕСТИТЬ ВремИнформацияООтгрузках
	|ИЗ
	|	ВремВыгружаемыеОтгрузки КАК ВремВыгружаемыеОтгрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
	|		ПО ВремВыгружаемыеОтгрузки.Валюта = КурсыВалютСрезПоследних.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремСуммаДоставкиДокументов КАК ВремСуммаДоставкиДокументов
	|		ПО ВремВыгружаемыеОтгрузки.Отгрузка = ВремСуммаДоставкиДокументов.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремСлужбаДоставкиСвойствоОтгрузок КАК ВремСлужбаДоставкиСвойствоОтгрузок
	|		ПО ВремВыгружаемыеОтгрузки.Отгрузка = ВремСлужбаДоставкиСвойствоОтгрузок.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремИдентификаторыОтправленияОтгрузки КАК ВремИдентификаторыОтправленияОтгрузки
	|		ПО ВремВыгружаемыеОтгрузки.Отгрузка = ВремИдентификаторыОтправленияОтгрузки.Объект
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ,
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремВыгружаемыеОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремСлужбаДоставкиСвойствоОтгрузок
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремИдентификаторыОтправленияОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремСуммаДоставкиДокументов";

	ЗапросПоТоварамЗаказов = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Документ,
	|	Товары.Ссылка КАК Заказ,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Упаковка КАК Упаковка,
	|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.Сумма КАК Сумма,
	|	Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.СуммаСНДС КАК СуммаСНДС,
	|	Товары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	Товары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	Товары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|	Товары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	Товары.Склад КАК Склад,
	|	Товары.Содержание КАК Содержание,
	|	Товары.Отменено КАК Отменено,
	|	Товары.КодСтроки КАК КодСтроки,
	|	ВидыНоменклатуры.ОсобенностьУчета КАК ОсобенностьУчета
	|ПОМЕСТИТЬ ВремТабТоваровПром
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураПозиции
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО НоменклатураПозиции.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
	|		ПО Товары.Номенклатура = НоменклатураПозиции.Ссылка
	|ГДЕ
	|	Товары.Ссылка В
	|			(ВЫБРАТЬ
	|				ВремИнформацияОЗаказах.Объект
	|			ИЗ
	|				ВремИнформацияОЗаказах)";

	ЗапросПоТоварамОтгрузок = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.Ссылка.ЗаказКлиента КАК ЗаказКлиента,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Упаковка КАК Упаковка,
	|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.Сумма КАК Сумма,
	|	Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	Товары.СуммаНДС КАК СуммаНДС,
	|	Товары.СуммаСНДС КАК СуммаСНДС,
	|	Товары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	Товары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	Товары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|	Товары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	Товары.Склад КАК Склад,
	|	NULL КАК Поле1,
	|	ЛОЖЬ КАК Поле2,
	|	Товары.КодСтроки КАК КодСтроки,
	|	ВидыНоменклатуры.ОсобенностьУчета КАК ОсобенностьУчета
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураПозиции
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО НоменклатураПозиции.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
	|		ПО Товары.Номенклатура = НоменклатураПозиции.Ссылка
	|ГДЕ
	|	Товары.Ссылка В
	|			(ВЫБРАТЬ
	|				ВремИнформацияООтгрузках.Объект
	|			ИЗ
	|				ВремИнформацияООтгрузках)";

	ЗапросПоТоварамКонец = "	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТабТоваровПром.Документ КАК Документ,
	|	ВремТабТоваровПром.Заказ КАК Заказ,
	|	ВремТабТоваровПром.НомерСтроки КАК НомерСтроки,
	|	ВремТабТоваровПром.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА НоменклатураСправочник.Б_Идентификатор = """"
	|			ТОГДА НоменклатураСправочник.Ссылка
	|		ИНАЧЕ НоменклатураСправочник.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторНоменклатуры,
	|	ВремТабТоваровПром.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ХарактеристикиНоменклатуры.Б_Идентификатор = """"
	|			ТОГДА ХарактеристикиНоменклатуры.Ссылка
	|		ИНАЧЕ ХарактеристикиНоменклатуры.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторХарактеристики,
	|	ВремТабТоваровПром.Упаковка КАК Упаковка,
	|	ВЫБОР
	|		КОГДА УпаковкиЕдиницыИзмерения.Б_Идентификатор = """"
	|			ТОГДА УпаковкиЕдиницыИзмерения.Ссылка
	|		ИНАЧЕ УпаковкиЕдиницыИзмерения.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторУпаковки,
	|	ВремТабТоваровПром.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВремТабТоваровПром.Количество КАК Количество,
	|	ВремТабТоваровПром.Цена КАК Цена,
	|	ВремТабТоваровПром.Сумма КАК Сумма,
	|	ВремТабТоваровПром.СтавкаНДС КАК СтавкаНДС,
	|	ВремТабТоваровПром.СуммаНДС КАК СуммаНДС,
	|	ВремТабТоваровПром.СуммаСНДС КАК СуммаСНДС,
	|	ВремТабТоваровПром.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ВремТабТоваровПром.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ВремТабТоваровПром.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|	ВремТабТоваровПром.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	ВремТабТоваровПром.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА Склады.Б_Идентификатор = """"
	|			ТОГДА Склады.Ссылка
	|		ИНАЧЕ Склады.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторСклада,
	|	ВремТабТоваровПром.Содержание КАК Содержание,
	|	УпаковкиЕдиницыИзмерения.Числитель КАК УпаковкаЧислитель,
	|	НоменклатураСправочник.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	|	ВремТабТоваровПром.Отменено КАК Отменено,
	|	НоменклатураСправочник.Наименование КАК НоменклатураНаименование,
	|	ХарактеристикиНоменклатуры.Наименование КАК ХарактеристикаНаименование,
	|	ВидыНоменклатуры.Наименование КАК ВидНоменклатуры,
	|	ВЫБОР
	|		КОГДА ВидыНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ТОГДА 1
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВидыНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|					ТОГДА 2
	|				ИНАЧЕ 3
	|			КОНЕЦ
	|	КОНЕЦ КАК ТипТовара,
	|	НоменклатураСправочник.СтавкаНДС КАК НоменклатураСтавкаНДС,
	|	ВЫБОР
	|		КОГДА УпаковкиЕдиницыИзмеренияНоменклатуры.Б_Идентификатор = """"
	|			ТОГДА УпаковкиЕдиницыИзмеренияНоменклатуры.Код
	|		ИНАЧЕ УпаковкиЕдиницыИзмеренияНоменклатуры.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторБазовойЕдиницыИзмерения,
	|	УпаковкиЕдиницыИзмеренияНоменклатуры.Наименование КАК НаименованиеБазовойЕдиницыИзмерения,
	|	УпаковкиЕдиницыИзмеренияНоменклатуры.НаименованиеПолное КАК НаименованиеПолноеБазовойЕдиницыИзмерения,
	|	УпаковкиЕдиницыИзмеренияНоменклатуры.Код КАК КодБазовойЕдиницыИзмерения,
	|	ВремТабТоваровПром.ОсобенностьУчета КАК ОсобенностьУчета,
	|	ВремТабТоваровПром.КодСтроки КАК КодСтроки
	|ПОМЕСТИТЬ ВремТабТоваров
	|ИЗ
	|	ВремТабТоваровПром КАК ВремТабТоваровПром
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО НоменклатураСправочник.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
	|		ПО ВремТабТоваровПром.Номенклатура = НоменклатураСправочник.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО ВремТабТоваровПром.Характеристика = ХарактеристикиНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|		ПО ВремТабТоваровПром.Упаковка = УпаковкиЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	|		ПО ВремТабТоваровПром.Склад = Склады.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмеренияНоменклатуры
	|		ПО НоменклатураСправочник.ЕдиницаИзмерения = УпаковкиЕдиницыИзмеренияНоменклатуры.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТабТоваровПром";

	#Удаление
	ЗапросПоМаркировкамОтгрузок = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка КАК Документ,
	|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
	|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика,
	|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеШтрихкода
	|ПОМЕСТИТЬ ВремМаркировкиОтгрузок
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК РеализацияТоваровУслугШтрихкодыУпаковок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|		ПО РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваров.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка В
	|			(ВЫБРАТЬ
	|				ВремОтгрузки.Документ
	|			ИЗ
	|				ВремОтгрузки)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремОтгрузки
	|";
	#КонецУдаления
	#Вставка
	ЗапросПоМаркировкамОтгрузок = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремОтгрузки.Документ КАК Документ,
	|	"" КАК ШтрихкодУпаковки,
	|	Значение(Справочники.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	"" ЗначениеШтрихкода
	|ПОМЕСТИТЬ ВремМаркировкиОтгрузок
	|ИЗ
	|	ВремОтгрузки КАК ВремОтгрузки
	|ГДЕ
	|	ЛОЖЬ
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремОтгрузки
	|";
	#КонецВставки


	ЗапросПоСвойствамТоваров = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТабТоваров.Документ КАК Документ,
	|	ВремТабТоваров.Заказ КАК Заказ,
	|	ВремТабТоваров.Номенклатура КАК Номенклатура,
	|	ВремТабТоваров.Характеристика КАК Характеристика,
	|	Б_СвойстваТоваровДокументов.НаименованиеСвойства,
	|	Б_СвойстваТоваровДокументов.Значение,
	|	Б_СвойстваТоваровДокументов.КодСтроки КАК КодСтроки
	|ПОМЕСТИТЬ ВремСвойстваТоваровДокументов
	|ИЗ
	|	ВремТабТоваров КАК ВремТабТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Б_СвойстваТоваровДокументов КАК Б_СвойстваТоваровДокументов
	|		ПО (Б_СвойстваТоваровДокументов.Документ = ВремТабТоваров.Заказ)
	|			И (Б_СвойстваТоваровДокументов.Номенклатура = ВремТабТоваров.Номенклатура)
	|			И (Б_СвойстваТоваровДокументов.Характеристика = ВремТабТоваров.Характеристика)
	|			И (Б_СвойстваТоваровДокументов.КодСтроки = ВремТабТоваров.КодСтроки)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ,
	|	Заказ,
	|	Номенклатура,
	|	Характеристика
	|";

	ЗапросПоОплатам = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка КАК Документ,
	|	""Оплата наличными"" КАК ТипДокумента,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.ОснованиеПлатежа КАК Заказ
	|ПОМЕСТИТЬ ВремОплатыНаличные
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ИспользоватьОтборПоОплатам 
	|				ТОГДА ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка В (&ВыгружаемыеОплатыПоОтборам)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|И ПриходныйКассовыйОрдерРасшифровкаПлатежа.ОснованиеПлатежа В (ВЫБРАТЬ Объект ИЗ ВремМассивДанных) 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка КАК Документ,
	|	""Эквайринг"" КАК ТипДокумента,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.ОснованиеПлатежа КАК Заказ
	|ПОМЕСТИТЬ ВремОплатыЭквайринг
	|ИЗ
	|	Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ИспользоватьОтборПоОплатам 
	|				ТОГДА ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка В (&ВыгружаемыеОплатыПоОтборам)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|И ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.ОснованиеПлатежа В (ВЫБРАТЬ Объект ИЗ ВремМассивДанных) 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка КАК Документ,
	|	""Оплата безналичными"" КАК ТипДокумента,
	|	ПлатежноеПоручениеВходящееРасшифровкаПлатежа.ОснованиеПлатежа КАК Заказ
	|ПОМЕСТИТЬ ВремОплатыБезнал
	|ИЗ
	|	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПлатежноеПоручениеВходящееРасшифровкаПлатежа
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ИспользоватьОтборПоОплатам 
	|				ТОГДА ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка В (&ВыгружаемыеОплатыПоОтборам)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|И ПлатежноеПоручениеВходящееРасшифровкаПлатежа.ОснованиеПлатежа В (ВЫБРАТЬ Объект ИЗ ВремМассивДанных) 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс
	|ПОМЕСТИТЬ ВремКурсыВалют
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремОплатыНаличные.Документ КАК Объект,
	|	ПриходныйКассовыйОрдер.Ссылка КАК Документ,
	|	ВЫБОР
	|		КОГДА ПриходныйКассовыйОрдер.Б_Идентификатор = """"
	|			ТОГДА ПриходныйКассовыйОрдер.Ссылка
	|		ИНАЧЕ ПриходныйКассовыйОрдер.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторДокумента,
	|	ПриходныйКассовыйОрдер.ВерсияДанных КАК ВерсияДанных,
	|	ПриходныйКассовыйОрдер.ПометкаУдаления КАК ПометкаУдаления,
	|	ПриходныйКассовыйОрдер.Номер КАК Номер,
	|	ПриходныйКассовыйОрдер.Дата КАК Дата,
	|	ПриходныйКассовыйОрдер.Проведен КАК Проведен,
	|	""Оплата наличными"" КАК ТипДокумента,
	|	ПриходныйКассовыйОрдер.Комментарий КАК Комментарий,
	|	ПриходныйКассовыйОрдер.Контрагент КАК Контрагент,
	|	ПриходныйКассовыйОрдер.Б_Идентификатор КАК НомерССайта,
	|	ПриходныйКассовыйОрдер.Б_ДатаДокумента КАК ДатаССайта,
	|	ЕСТЬNULL(ВремКурсыВалют.Курс, 1) КАК Курс,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаДокумент.Б_Идентификатор = """"
	|			ТОГДА ЗаказКлиентаДокумент.Ссылка
	|		ИНАЧЕ ЗаказКлиентаДокумент.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторОснования,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.ВалютаВзаиморасчетов КАК Валюта,
	|	ВалютыСсылка.Наименование КАК ВалютаКод,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ПриходныйКассовыйОрдер.Касса КАК КассаТерминал,
	|	Контрагенты.Партнер КАК Партнер,
	|	ПриходныйКассовыйОрдер.ПометкаУдаления КАК Отменен,
	|	ПриходныйКассовыйОрдер.Проведен КАК Оплачен,
	|	ВремОплатыНаличные.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВремОплатыВсе
	|ИЗ
	|	ВремОплатыНаличные КАК ВремОплатыНаличные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВремКурсыВалют КАК ВремКурсыВалют
	|			ПО ПриходныйКассовыйОрдерРасшифровкаПлатежа.ВалютаВзаиморасчетов = ВремКурсыВалют.Валюта
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|				ПО ПриходныйКассовыйОрдер.Контрагент = Контрагенты.Ссылка
	|			ПО ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка = ПриходныйКассовыйОрдер.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК ВалютыСсылка
	|			ПО ПриходныйКассовыйОрдерРасшифровкаПлатежа.ВалютаВзаиморасчетов = ВалютыСсылка.Ссылка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиентаДокумент
	|			ПО ПриходныйКассовыйОрдерРасшифровкаПлатежа.ОснованиеПлатежа = ЗаказКлиентаДокумент.Ссылка
	|		ПО (ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка = ВремОплатыНаличные.Документ)
	|			И ВремОплатыНаличные.Заказ = ПриходныйКассовыйОрдерРасшифровкаПлатежа.ОснованиеПлатежа
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ПриходныйКассовыйОрдерРасшифровкаПлатежа.ОснованиеПлатежа ССЫЛКА Документ.ЗаказКлиента
	|				ТОГДА ВЫБОР
	|						КОГДА ПриходныйКассовыйОрдерРасшифровкаПлатежа.ОснованиеПлатежа <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВремОплатыЭквайринг.Документ,
	|	ОперацияПоПлатежнойКарте.Ссылка,
	|	ВЫБОР
	|		КОГДА ОперацияПоПлатежнойКарте.Б_Идентификатор = """"
	|			ТОГДА ОперацияПоПлатежнойКарте.Ссылка
	|		ИНАЧЕ ОперацияПоПлатежнойКарте.Б_Идентификатор
	|	КОНЕЦ,
	|	ОперацияПоПлатежнойКарте.ВерсияДанных,
	|	ОперацияПоПлатежнойКарте.ПометкаУдаления,
	|	ОперацияПоПлатежнойКарте.Номер,
	|	ОперацияПоПлатежнойКарте.Дата,
	|	ОперацияПоПлатежнойКарте.Проведен,
	|	""Эквайринг"",
	|	ОперацияПоПлатежнойКарте.Комментарий,
	|	ОперацияПоПлатежнойКарте.Контрагент,
	|	ОперацияПоПлатежнойКарте.Б_Идентификатор,
	|	ОперацияПоПлатежнойКарте.Б_ДатаДокумента,
	|	ЕСТЬNULL(ВремКурсыВалют.Курс, 1),
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаДокумент.Б_Идентификатор = """"
	|			ТОГДА ЗаказКлиентаДокумент.Ссылка
	|		ИНАЧЕ ЗаказКлиентаДокумент.Б_Идентификатор
	|	КОНЕЦ,
	|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.ВалютаВзаиморасчетов,
	|	ВалютыСсылка.Наименование,
	|	ОперацияПоПлатежнойКартеРасшифровкаПлатежа.СуммаВзаиморасчетов,
	|	ОперацияПоПлатежнойКарте.ЭквайринговыйТерминал,
	|	Контрагенты.Партнер,
	|	ОперацияПоПлатежнойКарте.ПометкаУдаления,
	|	ОперацияПоПлатежнойКарте.Проведен,
	|	ВремОплатыЭквайринг.Заказ
	|ИЗ
	|	ВремОплатыЭквайринг КАК ВремОплатыЭквайринг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОперацияПоПлатежнойКарте.РасшифровкаПлатежа КАК ОперацияПоПлатежнойКартеРасшифровкаПлатежа
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВремКурсыВалют КАК ВремКурсыВалют
	|			ПО ОперацияПоПлатежнойКартеРасшифровкаПлатежа.ВалютаВзаиморасчетов = ВремКурсыВалют.Валюта
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОперацияПоПлатежнойКарте КАК ОперацияПоПлатежнойКарте
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|				ПО ОперацияПоПлатежнойКарте.Контрагент = Контрагенты.Ссылка
	|			ПО ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка = ОперацияПоПлатежнойКарте.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК ВалютыСсылка
	|			ПО ОперацияПоПлатежнойКартеРасшифровкаПлатежа.ВалютаВзаиморасчетов = ВалютыСсылка.Ссылка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиентаДокумент
	|			ПО ОперацияПоПлатежнойКартеРасшифровкаПлатежа.ОснованиеПлатежа = ЗаказКлиентаДокумент.Ссылка
	|		ПО (ОперацияПоПлатежнойКартеРасшифровкаПлатежа.Ссылка = ВремОплатыЭквайринг.Документ)
	|			И ВремОплатыЭквайринг.Заказ = ОперацияПоПлатежнойКартеРасшифровкаПлатежа.ОснованиеПлатежа
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ОперацияПоПлатежнойКартеРасшифровкаПлатежа.ОснованиеПлатежа ССЫЛКА Документ.ЗаказКлиента
	|				ТОГДА ВЫБОР
	|						КОГДА ОперацияПоПлатежнойКартеРасшифровкаПлатежа.ОснованиеПлатежа <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВремОплатыБезнал.Документ,
	|	ПоступлениеБезналичныхДенежныхСредств.Ссылка,
	|	ВЫБОР
	|		КОГДА ПоступлениеБезналичныхДенежныхСредств.Б_Идентификатор = """"
	|			ТОГДА ПоступлениеБезналичныхДенежныхСредств.Ссылка
	|		ИНАЧЕ ПоступлениеБезналичныхДенежныхСредств.Б_Идентификатор
	|	КОНЕЦ,
	|	ПоступлениеБезналичныхДенежныхСредств.ВерсияДанных,
	|	ПоступлениеБезналичныхДенежныхСредств.ПометкаУдаления,
	|	ПоступлениеБезналичныхДенежныхСредств.Номер,
	|	ПоступлениеБезналичныхДенежныхСредств.Дата,
	|	ПоступлениеБезналичныхДенежныхСредств.Проведен,
	|	""Оплата безналичными"",
	|	ПоступлениеБезналичныхДенежныхСредств.Комментарий,
	|	ПоступлениеБезналичныхДенежныхСредств.Контрагент,
	|	ПоступлениеБезналичныхДенежныхСредств.Б_Идентификатор,
	|	ПоступлениеБезналичныхДенежныхСредств.Б_ДатаДокумента,
	|	ЕСТЬNULL(ВремКурсыВалют.Курс, 1),
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаДокумент.Б_Идентификатор = """"
	|			ТОГДА ЗаказКлиентаДокумент.Ссылка
	|		ИНАЧЕ ЗаказКлиентаДокумент.Б_Идентификатор
	|	КОНЕЦ,
	|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ВалютаВзаиморасчетов,
	|	ВалютыСсылка.Наименование,
	|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.СуммаВзаиморасчетов,
	|	"""",
	|	Контрагенты.Партнер,
	|	ПоступлениеБезналичныхДенежныхСредств.ПометкаУдаления,
	|	ПоступлениеБезналичныхДенежныхСредств.Проведен,
	|	ВремОплатыБезнал.Заказ
	|ИЗ
	|	ВремОплатыБезнал КАК ВремОплатыБезнал
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВремКурсыВалют КАК ВремКурсыВалют
	|			ПО ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ВалютаВзаиморасчетов = ВремКурсыВалют.Валюта
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеБезналичныхДенежныхСредств
	|			ПО ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка = ПоступлениеБезналичныхДенежныхСредств.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК ВалютыСсылка
	|			ПО ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ВалютаВзаиморасчетов = ВалютыСсылка.Ссылка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиентаДокумент
	|			ПО ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ОснованиеПлатежа = ЗаказКлиентаДокумент.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ПО (ПоступлениеБезналичныхДенежныхСредств.Контрагент = Контрагенты.Ссылка)
	|		ПО (ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка = ВремОплатыБезнал.Документ)
	|			И ВремОплатыБезнал.Заказ = ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ОснованиеПлатежа
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ОснованиеПлатежа ССЫЛКА Документ.ЗаказКлиента
	|				ТОГДА ВЫБОР
	|						КОГДА ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ОснованиеПлатежа <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремОплатыНаличные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремОплатыЭквайринг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремОплатыБезнал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Объект КАК Объект,
	|	ДополнительныеСведения.Значение КАК Значение
	|ПОМЕСТИТЬ ВремСведенияОМетодеОплатыПришедшемССайта
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Свойство = &СвойствоИдМетодаОплаты
	|	И ДополнительныеСведения.Объект В
	|			(ВЫБРАТЬ
	|				ВремОплатыВсе.Объект
	|			ИЗ
	|				ВремОплатыВсе)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВремОплатыВсе.Объект КАК Объект,
	|	ВремОплатыВсе.Документ КАК Документ,
	|	ВремОплатыВсе.ИдентификаторДокумента КАК ИдентификаторДокумента,
	|	ВремОплатыВсе.ВерсияДанных КАК ВерсияДанных,
	|	ВремОплатыВсе.ПометкаУдаления КАК ПометкаУдаления,
	|	ВремОплатыВсе.Номер КАК Номер,
	|	ВремОплатыВсе.Дата КАК Дата,
	|	ВремОплатыВсе.Проведен КАК Проведен,
	|	ВремОплатыВсе.ТипДокумента КАК ТипДокумента,
	|	ВЫРАЗИТЬ(ВремОплатыВсе.Комментарий КАК СТРОКА(100)) КАК Комментарий,
	|	ВремОплатыВсе.Контрагент КАК Контрагент,
	|	ВремОплатыВсе.НомерССайта КАК НомерССайта,
	|	ВремОплатыВсе.ДатаССайта КАК ДатаССайта,
	|	ВремОплатыВсе.Курс КАК Курс,
	|	ВремОплатыВсе.ИдентификаторОснования КАК ИдентификаторОснования,
	|	ВремОплатыВсе.Валюта КАК Валюта,
	|	ВремОплатыВсе.ВалютаКод КАК ВалютаКод,
	|	ВремОплатыВсе.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ВремОплатыВсе.Партнер КАК Партнер,
	|	ВремОплатыВсе.Отменен КАК Отменен,
	|	ВремОплатыВсе.Оплачен КАК Оплачен,
	|	ВремОплатыВсе.Заказ КАК Заказ,
	|	ВремСведенияОМетодеОплаты.Значение КАК ИдМетодаОплатыССайта,
	|	ВремОплатыВсе.КассаТерминал КАК КассаТерминал
	|ПОМЕСТИТЬ ВремИнформацияООплатах
	|ИЗ
	|	ВремОплатыВсе КАК ВремОплатыВсе
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремСведенияОМетодеОплатыПришедшемССайта КАК ВремСведенияОМетодеОплаты
	|		ПО ВремОплатыВсе.Объект = ВремСведенияОМетодеОплаты.Объект
	|ГДЕ
	|	ВремОплатыВсе.Номер <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	#Удаление
	|ВЫБРАТЬ
	|	ФискальныеОперации.ДокументОснование КАК Документ,
	|	ФискальныеОперации.Дата КАК Дата,
	|	Б_ОчередьПечати.ИдЧекаНаСайте КАК ИдЧекаНаСайте
	|ПОМЕСТИТЬ ВремСведенияОЧеках
	|ИЗ
	|	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Б_ОчередьПечати КАК Б_ОчередьПечати
	|		ПО ФискальныеОперации.ДокументОснование = Б_ОчередьПечати.Документ
	|ГДЕ
	|	ФискальныеОперации.ДокументОснование В
	|			(ВЫБРАТЬ
	|				ВремОплатыВсе.Объект
	|			ИЗ
	|				ВремОплатыВсе)
	|;
	|
	#КонецУдаления
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремСведенияОМетодеОплатыПришедшемССайта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремОплатыВсе";

	КонецЗапроса = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремМассивДанных";


	ТекстЗапроса = ЗапросПоЗаказам;	

	Если ПараметрыОбмена.ВыгрузкаОтгрузок тогда

		ТекстЗапроса = ТекстЗапроса + ЗапросПоОтгрузкам;

	КонецЕсли;

	ТекстЗапроса = ТекстЗапроса + ЗапросПоТоварамЗаказов;

	Если ПараметрыОбмена.ВыгрузкаОтгрузок тогда

		ТекстЗапроса = ТекстЗапроса + ЗапросПоТоварамОтгрузок + ЗапросПоМаркировкамОтгрузок;

	КонецЕсли;

	ТекстЗапроса = ТекстЗапроса + ЗапросПоТоварамКонец;
	ТекстЗапроса = ТекстЗапроса + ЗапросПоСвойствамТоваров;

	Если ПараметрыОбмена.ВыгрузкаОплат тогда

		ТекстЗапроса = ТекстЗапроса + ЗапросПоОплатам;

	КонецЕсли;

	ТекстЗапроса = ТекстЗапроса + КонецЗапроса;

	//ЗапросПоЗаказам
	//ЗапросПоОтгрузкам
	//ЗапросПоТоварамЗаказов
	//ЗапросПоТоварамОтгрузок
	//ЗапросПоТоварамКонец
	//ЗапросПоСвойствамТоваров
	//ЗапросПоОплатам
	//КонецЗапроса


	ОбщийЗапрос.Текст = ТекстЗапроса;  	

	ОбщийЗапрос.Выполнить();	

	Возврат МенеджерВременныхТаблицДокументов;

КонецФункции


&Вместо("ЗаполнениеТабличнойЧастиДокумента")
Процедура игр_ЗаполнениеТабличнойЧастиДокумента(ПараметрыОбмена, МенеджерВременныхТаблиц, Владелец, ВладелецТип, Документ, МассивНоменклатуры, СоздаватьДоставкуАвтоматически)
	
	XDTOТоварТип		= Б_ОбменССайтомСервер.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Товар"		, Истина, ВладелецТип);
	XDTOНалогиТип 		= Б_ОбменССайтомСервер.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Налоги"		, Истина, XDTOТоварТип);	
	XDTOНалогТип   		= Б_ОбменССайтомСервер.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Налог"		, Истина, XDTOНалогиТип);
	
	XDTOСтавкиНалоговТип= Б_ОбменССайтомСервер.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "СтавкиНалогов", Истина, XDTOТоварТип);	
	XDTOСтавкаНалогаТип = Б_ОбменССайтомСервер.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "СтавкаНалога"	, Истина, XDTOСтавкиНалоговТип);
	
	XDTOСкидкиТип 		= Б_ОбменССайтомСервер.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Скидки"		, Истина, XDTOТоварТип);	
	XDTOСкидкаТип   	= Б_ОбменССайтомСервер.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Скидка"		, Истина, XDTOСкидкиТип);
	
	XDTOЕдиницаИзмеренияТип		= Б_ОбменССайтомСервер.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ЕдиницаИзмерения");
	
	XDTOЗначенияРеквизитовТип 	= Б_ОбменССайтомСервер.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ЗначенияРеквизитов", Истина, XDTOТоварТип);
	XDTOЗначениеРеквизитаТип 	= Б_ОбменССайтомСервер.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ЗначениеРеквизита");
	
	XDTOМаркировкиТип 	= Б_ОбменССайтомСервер.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Маркировки", Истина, XDTOТоварТип);
	XDTOМаркировкаТип 	= Б_ОбменССайтомСервер.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "Маркировка", Истина, XDTOМаркировкиТип);
	
	XDTOГруппаМаркировкиТип	= Б_ОбменССайтомСервер.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ГруппаМаркировки", Истина, XDTOТоварТип);	
					
	Для каждого ТекНоменклатура из МассивНоменклатуры Цикл 	
		
		Если ТекНоменклатура.Отменено Тогда
			Продолжить;
		КонецЕсли;
		
		XDTOТовар	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOТоварТип);
		
		Если ЗначениеЗаполнено(ТекНоменклатура.Характеристика)  тогда
			лИд = XMLСтрока(ТекНоменклатура.ИдентификаторНоменклатуры) + "#" + XMLСтрока(ТекНоменклатура.ИдентификаторХарактеристики); 
			лНаименование   	= ТекНоменклатура.НоменклатураНаименование + " (" + ТекНоменклатура.ХарактеристикаНаименование + ")";
		Иначе
			лИд = XMLСтрока(ТекНоменклатура.ИдентификаторНоменклатуры); 
			лНаименование   	= ТекНоменклатура.НоменклатураНаименование;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(лНаименование) тогда
			Продолжить;
		КонецЕсли;
		
		XDTOТовар.Ид 			= лИд;
		XDTOТовар.Наименование 	= лНаименование;
		
		//комплекты не выгружаем, т.к выгружать и комплектующие нереально. Счиатем, что это товар.
		//Если ТекНоменклатура.ТипТовара = 1 тогда
//			лТипНоменклатуры = "Товар";
		//ИначеЕсли ТекНоменклатура.ТипТовара = 2 тогда
		//	лТипНоменклатуры = "Услуга";
		//КонецЕсли;
		
		Если НЕ ТекНоменклатура.ИдентификаторНоменклатуры = "ORDER_DELIVERY" тогда
			лТипНоменклатуры = "Товар";
		Иначе
			лТипНоменклатуры = "Услуга";
		КонецЕсли;
		
		XDTOЗначенияРеквизитов 		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOЗначенияРеквизитовТип); 
			
		Б_ОбменССайтомСервер.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "ВидНоменклатуры", ТекНоменклатура.ВидНоменклатуры);
		Б_ОбменССайтомСервер.ДобавитьЗначениеРеквизитаXDTO(ПараметрыОбмена, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, "ТипНоменклатуры", лТипНоменклатуры);
		
		ДобавитьСвойстваПозицийТовараДокумента(ПараметрыОбмена, Документ, МенеджерВременныхТаблиц, XDTOЗначенияРеквизитов, XDTOЗначениеРеквизитаТип, ТекНоменклатура);
		
		XDTOТовар.ЗначенияРеквизитов = XDTOЗначенияРеквизитов;
		
		Если ЗначениеЗаполнено(ТекНоменклатура.НоменклатураСтавкаНДС) Тогда
			
			XDTOСтавкиНалогов	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСтавкиНалоговТип);
			
				XDTOСтавкаНалога	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСтавкаНалогаТип);
				
				XDTOСтавкаНалога.Наименование 	= ПараметрыОбмена.НаименованиеНалога;
				XDTOСтавкаНалога.Ставка 		= Б_ОбменССайтомСервер.ПолучитьПоСтавкеНДСЗначениеДляВыгрузки(ТекНоменклатура.СтавкаНДС);
			
			XDTOСтавкиНалогов.СтавкаНалога.Добавить(XDTOСтавкаНалога);
			
			XDTOТовар.СтавкиНалогов = XDTOСтавкиНалогов;
			
		КонецЕсли;
		
		//Если ТекНоменклатура.СуммаНДС > 0 Тогда
			
			XDTOНалоги	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOНалогиТип);
			
				XDTOНалог	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOНалогТип);
				
				XDTOНалог.Наименование 	= ПараметрыОбмена.НаименованиеНалога;
				XDTOНалог.УчтеноВСумме 	= Документ.ЦенаВключаетНДС;
				XDTOНалог.Сумма 		= Формат(ТекНоменклатура.СуммаНДС , ПараметрыОбмена.ФорматСуммы);
				XDTOНалог.Ставка 		= Б_ОбменССайтомСервер.ПолучитьПоСтавкеНДСЗначениеДляВыгрузки(ТекНоменклатура.СтавкаНДС);
			
			XDTOНалоги.Налог.Добавить(XDTOНалог);
			
			XDTOТовар.Налоги = XDTOНалоги;
			
		//КонецЕсли;
		
		XDTOТовар.Цена			= Формат(ТекНоменклатура.Цена		, ПараметрыОбмена.ФорматСуммы);   
		XDTOТовар.Количество	= Формат(ТекНоменклатура.Количество	, ПараметрыОбмена.ФорматКоличества);
		XDTOТовар.Сумма			= Формат(ТекНоменклатура.Сумма		, ПараметрыОбмена.ФорматСуммы);
		
		XDTOТовар.Коэффициент 	= "1";
		
		Если ЗначениеЗаполнено(ТекНоменклатура.ИдентификаторБазовойЕдиницыИзмерения) Тогда
			XDTOЕдиницаИзмерения	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOЕдиницаИзмеренияТип);
				XDTOЕдиницаИзмерения.Ид 				= XMLСтрока(ТекНоменклатура.ИдентификаторБазовойЕдиницыИзмерения);
				XDTOЕдиницаИзмерения.Код				= Лев(ТекНоменклатура.КодБазовойЕдиницыИзмерения, 4);
				XDTOЕдиницаИзмерения.НаименованиеКраткое= Лев(ТекНоменклатура.НаименованиеБазовойЕдиницыИзмерения, 3);
				XDTOЕдиницаИзмерения.НаименованиеПолное	= ТекНоменклатура.НаименованиеПолноеБазовойЕдиницыИзмерения;
			XDTOТовар.Единица 		= XDTOЕдиницаИзмерения;
		КонецЕсли;
		
		ПроцентРучнойСкидки = 0;
		СуммаРучнойСкидки   = 0;
		Если ПараметрыОбмена.ИспользоватьРучныеСкидкиВПродажах Тогда
			ПроцентРучнойСкидки = ТекНоменклатура.ПроцентРучнойСкидки;
			СуммаРучнойСкидки   = ТекНоменклатура.СуммаРучнойСкидки;
		КонецЕсли;
		
		ПроцентАвтоматическойСкидки = 0;
		СуммаАвтоматическойСкидки   = 0;
		Если ПараметрыОбмена.ИспользоватьАвтоматическиеСкидкиВПродажах Тогда
			ПроцентАвтоматическойСкидки = ТекНоменклатура.ПроцентАвтоматическойСкидки;
			СуммаАвтоматическойСкидки   = ТекНоменклатура.СуммаАвтоматическойСкидки;
		КонецЕсли;
		
		Скидка = ПроцентРучнойСкидки + ПроцентАвтоматическойСкидки;
		СуммаСкидки = СуммаРучнойСкидки + СуммаАвтоматическойСкидки;
		
		Если Скидка <> 0 И СуммаСкидки <> 0 Тогда
			
			XDTOСкидки	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСкидкиТип);
				
				XDTOСкидка	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOСкидкаТип);
				
				XDTOСкидка.Наименование = "Скидка";
				
				XDTOСкидка.Сумма 		= Формат(СуммаСкидки, ПараметрыОбмена.ФорматСуммы);	
				XDTOСкидка.Процент 		= Формат(Скидка, ПараметрыОбмена.ФорматСуммы);	
				XDTOСкидка.УчтеноВСумме = XMLСтрока(истина);
				
			XDTOСкидки.Скидка.Добавить(XDTOСкидка);
			
			XDTOТовар.Скидки = XDTOСкидки;
			
		КонецЕсли;
		
		Если ТекНоменклатура.ИдентификаторНоменклатуры = "ORDER_DELIVERY" тогда
			СоздаватьДоставкуАвтоматически = Ложь;
		Иначе
			
			Если ТипЗнч(Документ.Объект) = Тип("ДокументСсылка.ЗаказКлиента") Тогда 
				
				Если ТекНоменклатура.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция Тогда
					XDTOГруппаМаркировки		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOГруппаМаркировкиТип);
					XDTOГруппаМаркировки.Код 	= "5408";
					XDTOТовар.ГруппаМаркировки 	= XDTOГруппаМаркировки;	
				ИначеЕсли ТекНоменклатура.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция Тогда
					XDTOГруппаМаркировки		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOГруппаМаркировкиТип);
					XDTOГруппаМаркировки.Код 	= "05";
					XDTOТовар.ГруппаМаркировки 	= XDTOГруппаМаркировки;	
				ИначеЕсли ТекНоменклатура.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция Тогда
					XDTOГруппаМаркировки		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOГруппаМаркировкиТип);
					XDTOГруппаМаркировки.Код 	= "06";
					XDTOТовар.ГруппаМаркировки 	= XDTOГруппаМаркировки;	
				ИначеЕсли ТекНоменклатура.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность Тогда
					XDTOГруппаМаркировки		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOГруппаМаркировкиТип);
					XDTOГруппаМаркировки.Код 	= "5140";
					XDTOТовар.ГруппаМаркировки 	= XDTOГруппаМаркировки;	
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(Документ.Объект) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
				
				//ЗапросПоМаркировкам = Новый Запрос;
				//ЗапросПоМаркировкам.УстановитьПараметр("Документ"		, Документ.Объект);
				//ЗапросПоМаркировкам.УстановитьПараметр("Номенклатура"	, ТекНоменклатура.Номенклатура);
				//ЗапросПоМаркировкам.УстановитьПараметр("Характеристика"	, ТекНоменклатура.Характеристика);
				//
				//ЗапросПоМаркировкам.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
				//ЗапросПоМаркировкам.Текст = "ВЫБРАТЬ *
				//|ИЗ
				//|	ВремМаркировкиОтгрузок КАК ВремМаркировкиОтгрузок
				//|ГДЕ
				//|	ВремМаркировкиОтгрузок.Документ = &Документ
				//|	И ВремМаркировкиОтгрузок.Номенклатура = &Номенклатура
				//|	И ВремМаркировкиОтгрузок.Характеристика = &Характеристика";
				//ВыполненныйЗапрос = ЗапросПоМаркировкам.Выполнить();
				//
				//Если НЕ ВыполненныйЗапрос.Пустой() Тогда
				//	
				//	XDTOМаркировки	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOМаркировкиТип);
				//	
				//	ВыборкаМаркировок = ВыполненныйЗапрос.Выбрать();
				//	
				//	Пока ВыборкаМаркировок.Следующий() Цикл
				//		
				//		XDTOМаркировка	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOМаркировкаТип);
				//			
				//			XDTOМаркировка.Штрихкод = ВыборкаМаркировок.ЗначениеШтрихкода;
				//			
				//		XDTOМаркировки.Маркировка.Добавить(XDTOМаркировка);
				//		
				//	КонецЦикла;
				//	
				//	XDTOТовар.Маркировки = XDTOМаркировки;
				//			
				//КонецЕсли;
								  
			КонецЕсли;
			
		КонецЕсли;
		
		Владелец.Товар.Добавить(XDTOТовар);	
		
	КонецЦикла;
	
КонецПроцедуры


&Вместо("ЗаполнитьИнформациюОЧеке")
Процедура игр_ЗаполнитьИнформациюОЧеке(ПараметрыОбмена, МенеджерВременныхТаблиц, XDTOДокумент, Документ, XDTOДокументТип)
	
	XDTOИнформацияОЧекахТип = Б_ОбменССайтомСервер.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ИнформацияОЧеках", Истина, XDTOДокументТип);
	XDTOИнформацияОЧекеТип 	= Б_ОбменССайтомСервер.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ИнформацияОЧеке");
	
	XDTOЗначенияСвойствТип 	= Б_ОбменССайтомСервер.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ЗначенияСвойств", Истина, XDTOИнформацияОЧекеТип);
	XDTOЗначениеСвойстваТип = Б_ОбменССайтомСервер.ПолучениеТипОбъектаXDTO(ПараметрыОбмена,  "ЗначенияСвойства");
	
	XDTOИнформацияОЧеках 		= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOИнформацияОЧекахТип); 
	
	XDTOИнформацияОЧеке 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOИнформацияОЧекеТип);
	
	лИдЧека = "";
	
	//Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	//Запрос.УстановитьПараметр("Документ", Документ.Объект);
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 *
	//|ИЗ
	//|	ВремСведенияОЧеках КАК ВремСведенияОЧеках
	//|ГДЕ
	//|	ВремСведенияОЧеках.Документ = &Документ";
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	
	XDTOЗначенияСвойств 	= ПараметрыОбмена.МояФабрикаXDTO.Создать(XDTOЗначенияСвойствТип);
	
	//Пока Выборка.Следующий() Цикл;
	//	
	//	XDTOИнформацияОЧеке.Ид = XMLСтрока(Выборка.ИдЧекаНаСайте);
	//	
	//	Б_ОбменССайтомСервер.ДобавитьЗначениеСвойстваXDTO(ПараметрыОбмена, XDTOЗначенияСвойств, XDTOЗначениеСвойстваТип, "PRINT_CHECK", "Печать чека", Ложь);
	//	Б_ОбменССайтомСервер.ДобавитьЗначениеСвойстваXDTO(ПараметрыОбмена, XDTOЗначенияСвойств, XDTOЗначениеСвойстваТип, "FISCAL_SIGN", "Фискальный признак", 999);
	//	Б_ОбменССайтомСервер.ДобавитьЗначениеСвойстваXDTO(ПараметрыОбмена, XDTOЗначенияСвойств, XDTOЗначениеСвойстваТип, "URL", "Ссылка на чек", "WWW");
	//	Б_ОбменССайтомСервер.ДобавитьЗначениеСвойстваXDTO(ПараметрыОбмена, XDTOЗначенияСвойств, XDTOЗначениеСвойстваТип, "REG_NUMBER_KKT", "Рг. Номер ККТ", 999);
	//КонецЦикла;
	
	XDTOИнформацияОЧеке.ЗначенияСвойств = XDTOЗначенияСвойств;
	XDTOИнформацияОЧеках.ИнформацияОЧеке.Добавить(XDTOИнформацияОЧеке);
	XDTOДокумент.ИнформацияОЧеках = XDTOИнформацияОЧеках;
	
КонецПроцедуры


&ИзменениеИКонтроль("СформироватьВременныеТаблицыПоИнформацииОТоварахПакета")
Функция игр_СформироватьВременныеТаблицыПоИнформацииОТоварахПакета(ПараметрыОбмена, ИдентификаторКаталога, СписокТоваров, СписокСвойств)


	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Узел"	, ПараметрыОбмена.Ссылка);
	Запрос.УстановитьПараметр("ТекДата"	, ТекущаяДатаСеанса());

	Запрос.УстановитьПараметр("СписокТоваров"	, СписокТоваров);
	Запрос.УстановитьПараметр("СписокСвойств"	, СписокСвойств);


	НайданнаяСтрока = ПараметрыОбмена.КэшДанных.Найти(ИдентификаторКаталога, "ИдентификаторКаталога");
	Если НайданнаяСтрока <> Неопределено тогда

		Запрос.УстановитьПараметр("СписокСкладов"	, НайданнаяСтрока.ОбщийСписокСкладов);
		Запрос.УстановитьПараметр("СписокСоглашений", НайданнаяСтрока.ОбщийСписокСоглашений);
		Запрос.УстановитьПараметр("СписокЕдиниц" 	, НайданнаяСтрока.ОбщийСписокЕдиницИзмерений);

	Иначе

		Б_ОбменССайтомСервер.СообщитьПодробно("Произошла ошибка в модуле. Информация по складам и остаткам может быть некорректной.", ПараметрыОбмена, Истина);

		Запрос.УстановитьПараметр("СписокСкладов"	, "");
		Запрос.УстановитьПараметр("СписокСоглашений", "");
		Запрос.УстановитьПараметр("СписокЕдиниц" 	, "");
	КонецЕсли;



	Запрос.УстановитьПараметр("ВыгружатьВсеКартинки"				, ПараметрыОбмена.ПринудительнаяПолноеОбновлениеДанныхТовара ИЛИ ПараметрыОбмена.ВыполнятьПолнуюВыгрузкуПринудительно);
	Запрос.УстановитьПараметр("ВыгружатьВсеХарактеристики"			, НЕ ПараметрыОбмена.ВыгружатьХарактеристикиТолькоСОстатками);
	Запрос.УстановитьПараметр("ВыгружатьОстаткиСУчетомРезерва"		, ПараметрыОбмена.ВыгружатьОстаткиСУчетомРезерва);

	Запрос.УстановитьПараметр("СписокРасширенийКартинок"			, ПараметрыОбмена.РасширенияКартинок);

	Запрос.УстановитьПараметр("ВыгружатьТолькоСЦеной"				, ПараметрыОбмена.ВыгружатьПредложенияТолькоСЦеной);
	Запрос.УстановитьПараметр("ВыгружатьНоменклатуруКакПредложение"	, ПараметрыОбмена.ВыгружатьНоменклатуруКакПредложение);
	Запрос.УстановитьПараметр("ИспользоватьУпаковкиНоменклатуры"	, ПараметрыОбмена.ИспользоватьУпаковкиНоменклатуры);
	Запрос.УстановитьПараметр("ВыгружатьКомплектующие"				, ПараметрыОбмена.ВыгружатьКомплектующие);
	Запрос.УстановитьПараметр("НастройкиСвойств"					, ПараметрыОбмена.НастройкаСвойствТоваровИХарактеристик);

	Запрос.УстановитьПараметр("Справочник_Номенклатура"						, Б_ОбменССайтомСерверПовтИсп.ПолучитьНаборСвойств("Справочник_Номенклатура"));
	Запрос.УстановитьПараметр("Справочник_Номенклатура_Общие"				, Б_ОбменССайтомСерверПовтИсп.ПолучитьНаборСвойств("Справочник_Номенклатура_Общие"));
	Запрос.УстановитьПараметр("Справочник_ХарактеристикиНоменклатуры"		, Б_ОбменССайтомСерверПовтИсп.ПолучитьНаборСвойств("Справочник_ХарактеристикиНоменклатуры"));
	Запрос.УстановитьПараметр("Справочник_ХарактеристикиНоменклатуры_Общие"	, Б_ОбменССайтомСерверПовтИсп.ПолучитьНаборСвойств("Справочник_ХарактеристикиНоменклатуры_Общие"));

	Запрос.УстановитьПараметр("ИспользуетсяЦенообразование25"		, ПараметрыОбмена.ИспользуетсяЦенообразование25);



	////////////////////////////////////////////////////////////////////////////////////////////////////////
	//	                                                                                                ///
	//             ПАКЕТ ЗАПРОСОВ ДЛЯ ПОЛУЧЕНИЯ НОМЕНКЛАТУРЫ С ХАРАКТЕРИСТИКОЙ                         ///
	//                                                                                                ///
	////////////////////////////////////////////////////////////////////////////////////////////////////


	ТекстЗапроса = "ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВремНоменклатураОтбор
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&СписокТоваров)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатуры.Владелец КАК Комплект,
	|	ВЫБОР
	|		КОГДА ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		ИНАЧЕ ХарактеристикиНоменклатуры.Ссылка
	|	КОНЕЦ КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ХарактеристикиНоменклатуры.Б_Идентификатор = """"
	|					ТОГДА ХарактеристикиНоменклатуры.Ссылка
	|				ИНАЧЕ ХарактеристикиНоменклатуры.Б_Идентификатор
	|			КОНЕЦ
	|	КОНЕЦ КАК ИдентификаторХарактеристики,
	|	ВЫБОР
	|		КОГДА ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ХарактеристикиНоменклатуры.ВерсияДанных
	|	КОНЕЦ КАК ВерсияДанныхХарактеристики,
	|	ХарактеристикиНоменклатуры.Наименование КАК НаименованиеХарактеристики,
	|	ВЫБОР
	|		КОГДА ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	|	КОНЕЦ КАК ПометкаУдаленияХарактеристики,
	|	ХарактеристикиНоменклатуры.Ссылка КАК ХарактеристикаНоменклатурыДляЦенообразования
	|ПОМЕСТИТЬ ВремНоменклатураКомплектующиеОтбор
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	|		ПО ВариантыКомплектацииНоменклатурыТовары.Ссылка = ВариантыКомплектацииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО ВариантыКомплектацииНоменклатурыТовары.Характеристика = ХарактеристикиНоменклатуры.Ссылка
	|ГДЕ
	|	&ВыгружатьКомплектующие
	|	И ВариантыКомплектацииНоменклатуры.Владелец В(&СписокТоваров)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Комплект,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремНоменклатураОтбор.Ссылка КАК Номенклатура,
	|	НоменклатураСправочник.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	НоменклатураСправочник.НаборУпаковок КАК НаборУпаковок
	|ПОМЕСТИТЬ ВремНоменклатураОтбораИКомплектующих
	|ИЗ
	|	ВремНоменклатураОтбор КАК ВремНоменклатураОтбор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
	|		ПО ВремНоменклатураОтбор.Ссылка = НоменклатураСправочник.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВремНоменклатураКомплектующие.Номенклатура,
	|	НоменклатураСправочник.ЕдиницаИзмерения,
	|	НоменклатураСправочник.НаборУпаковок
	|ИЗ
	|	ВремНоменклатураКомплектующиеОтбор КАК ВремНоменклатураКомплектующие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
	|		ПО ВремНоменклатураКомплектующие.Номенклатура = НоменклатураСправочник.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремНоменклатураОтбор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремНоменклатураОтбораИКомплектующих.Номенклатура КАК Товар,
	|	УпаковкиНоменклатуры.Вес КАК Вес,
	|	УпаковкиНоменклатуры.Высота КАК Высота,
	|	УпаковкиНоменклатуры.Глубина КАК Глубина,
	|	УпаковкиНоменклатуры.Ширина КАК Ширина,
	|	УпаковкиНоменклатуры.Объем КАК Объем,
	|	УпаковкиНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	УпаковкиНоменклатуры.Б_Идентификатор КАК Б_Идентификатор,
	|	УпаковкиНоменклатуры.Б_НомерВерсии КАК Б_НомерВерсии
	|ПОМЕСТИТЬ ВремИнформацияОБазовойУпаковке
	|ИЗ
	|	ВремНоменклатураОтбораИКомплектующих КАК ВремНоменклатураОтбораИКомплектующих
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
	|		ПО ВремНоменклатураОтбораИКомплектующих.Номенклатура = УпаковкиНоменклатуры.Владелец
	|			И ВремНоменклатураОтбораИКомплектующих.ЕдиницаИзмерения = УпаковкиНоменклатуры.ЕдиницаИзмерения
	|			И (ВремНоменклатураОтбораИКомплектующих.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры))
	|ГДЕ
	|	УпаковкиНоменклатуры.Числитель = 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВремНоменклатураОтбораИКомплектующих.Номенклатура,
	|	УпаковкиНоменклатуры.Вес,
	|	УпаковкиНоменклатуры.Высота,
	|	УпаковкиНоменклатуры.Глубина,
	|	УпаковкиНоменклатуры.Ширина,
	|	УпаковкиНоменклатуры.Объем,
	|	УпаковкиНоменклатуры.ЕдиницаИзмерения,
	|	УпаковкиНоменклатуры.Б_Идентификатор,
	|	УпаковкиНоменклатуры.Б_НомерВерсии
	|ИЗ
	|	ВремНоменклатураОтбораИКомплектующих КАК ВремНоменклатураОтбораИКомплектующих
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
	|		ПО ВремНоменклатураОтбораИКомплектующих.ЕдиницаИзмерения = УпаковкиНоменклатуры.ЕдиницаИзмерения
	|			И ВремНоменклатураОтбораИКомплектующих.НаборУпаковок = УпаковкиНоменклатуры.Владелец
	|			И (ВремНоменклатураОтбораИКомплектующих.НаборУпаковок <> ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры))
	|ГДЕ
	|	УпаковкиНоменклатуры.Числитель = 1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Товар
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Б_Идентификатор КАК Б_Идентификатор,
	|	Номенклатура.ПометкаУдаления КАК ПометкаУдаления,
	|	Номенклатура.ВерсияДанных КАК ВерсияДанных,
	|	Номенклатура.Родитель КАК Родитель,
	|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
	|	Номенклатура.Код КАК Код,
	|	Номенклатура.Наименование КАК Наименование,
	|	Номенклатура.Артикул КАК Артикул,
	|	Номенклатура.Производитель КАК Производитель,
	|	Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Номенклатура.НаборУпаковок КАК НаборУпаковок,
	|	Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	Номенклатура.ФайлКартинки КАК ФайлКартинки,
	|	Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	Номенклатура.ФайлОписанияДляСайта КАК ФайлОписанияДляСайта,
	|	Номенклатура.Марка КАК Марка,
	|	Номенклатура.ВесЗнаменатель КАК ВесЗнаменатель,
	|	Номенклатура.ВесЧислитель КАК ВесЧислитель,
	|	Номенклатура.ОбъемЗнаменатель КАК ОбъемЗнаменатель,
	|	Номенклатура.ОбъемЧислитель КАК ОбъемЧислитель,
	|	Номенклатура.ИспользоватьУпаковки КАК ИспользоватьУпаковки
	|ПОМЕСТИТЬ ВремДанныеНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В
	|			(ВЫБРАТЬ
	|				ВремНоменклатураОтбораИКомплектующих.Номенклатура
	|			ИЗ
	|				ВремНоменклатураОтбораИКомплектующих КАК ВремНоменклатураОтбораИКомплектующих)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремНоменклатураОтбораИКомплектующих
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВремДанныеНоменклатуры.Ссылка КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ВремДанныеНоменклатуры.Б_Идентификатор = """"
	|			ТОГДА ВремДанныеНоменклатуры.Ссылка
	|		ИНАЧЕ ВремДанныеНоменклатуры.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторНоменклатуры,
	|	ВремДанныеНоменклатуры.ПометкаУдаления КАК ПометкаУдаленияНоменклатуры,
	|	ВремДанныеНоменклатуры.ВерсияДанных КАК ВерсияДанныхНоменклатуры,
	|	ВремДанныеНоменклатуры.Родитель КАК Родитель,
	|	ВЫБОР
	|		КОГДА РодительСправочник.Б_Идентификатор = """"
	|			ТОГДА РодительСправочник.Ссылка
	|		ИНАЧЕ РодительСправочник.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторРодителя,
	|	ВремДанныеНоменклатуры.ЭтоГруппа КАК ЭтоГруппа,
	|	ВремДанныеНоменклатуры.Код КАК КодНоменклатуры,
	|	ВремДанныеНоменклатуры.Наименование КАК НаименованиеНоменклатуры,
	|	ВремДанныеНоменклатуры.Артикул КАК Артикул,
	|	Производители.Ссылка КАК Производитель,
	|	Производители.Наименование КАК ПроизводительНаименование,
	|	ВремДанныеНоменклатуры.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	ВидыНоменклатуры.Ссылка КАК ВидНоменклатуры,
	|	ВидыНоменклатуры.НаборСвойств КАК НаборСвойствТоваров,
	|	ВидыНоменклатуры.НаборСвойствХарактеристик КАК НаборСвойствХарактеристик,
	|	ВидыНоменклатурыВладельца.НаборСвойствХарактеристик КАК НаборСвойствХарактеристикВладельца,
	|	ВЫБОР
	|		КОГДА ВидыНоменклатуры.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИспользоватьХарактеристики,
	|	ВремДанныеНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ВремДанныеНоменклатуры.ЕдиницаИзмерения.Б_Идентификатор = """"
	|			ТОГДА ВремДанныеНоменклатуры.ЕдиницаИзмерения.Код
	|		ИНАЧЕ ВремДанныеНоменклатуры.ЕдиницаИзмерения.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторЕдиницыИзмерения,
	|	ВремДанныеНоменклатуры.НаборУпаковок КАК НаборУпаковок,
	|	ВремДанныеНоменклатуры.СтавкаНДС КАК СтавкаНДС,
	|	ВремДанныеНоменклатуры.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ВремДанныеНоменклатуры.ФайлКартинки КАК ФайлКартинки,
	|	ВЫБОР
	|		КОГДА ВидыНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|			ТОГДА ВЫБОР
	|					КОГДА ВремДанныеНоменклатуры.Ссылка В
	|							(ВЫБРАТЬ
	|								ВремНоменклатураКомплектующиеОтбор.Комплект
	|							ИЗ
	|								ВремНоменклатураКомплектующиеОтбор КАК ВремНоменклатураКомплектующиеОтбор)
	|						ТОГДА 2
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК ТипТовара,
	|	ВремДанныеНоменклатуры.НаименованиеПолное КАК НаименованиеПолноеНоменклатуры,
	|	ВремДанныеНоменклатуры.ФайлОписанияДляСайта КАК ФайлОписанияДляСайта,
	|	Марки.Наименование КАК МаркаНаименование,
	|	ВЫБОР
	|		КОГДА ВремДанныеНоменклатуры.ВесЗнаменатель = 0
	|			ТОГДА ВремДанныеНоменклатуры.ВесЧислитель
	|		ИНАЧЕ ВремДанныеНоменклатуры.ВесЧислитель / ВремДанныеНоменклатуры.ВесЗнаменатель
	|	КОНЕЦ КАК ВесНетто,
	|	ВЫБОР
	|		КОГДА ВремИнформацияОБазовойУпаковке.Вес ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ВремИнформацияОБазовойУпаковке.Вес
	|	КОНЕЦ КАК ВесБрутто,
	|	ВЫБОР
	|		КОГДА ВремИнформацияОБазовойУпаковке.Высота ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ВремИнформацияОБазовойУпаковке.Высота
	|	КОНЕЦ КАК ВысотаБ,
	|	ВЫБОР
	|		КОГДА ВремИнформацияОБазовойУпаковке.Глубина ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ВремИнформацияОБазовойУпаковке.Глубина
	|	КОНЕЦ КАК ГлубинаБ,
	|	ВЫБОР
	|		КОГДА ВремИнформацияОБазовойУпаковке.Ширина ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ВремИнформацияОБазовойУпаковке.Ширина
	|	КОНЕЦ КАК ШиринаБ,
	|	ВЫБОР
	|		КОГДА ВремДанныеНоменклатуры.ОбъемЗнаменатель = 0
	|			ТОГДА ВремДанныеНоменклатуры.ОбъемЧислитель
	|		ИНАЧЕ ВремДанныеНоменклатуры.ОбъемЧислитель / ВремДанныеНоменклатуры.ОбъемЗнаменатель
	|	КОНЕЦ КАК ОбъемН,
	|	ВЫБОР
	|		КОГДА ВремИнформацияОБазовойУпаковке.Объем ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ВремИнформацияОБазовойУпаковке.Объем
	|	КОНЕЦ КАК ОбъемБ,
	|	ВремДанныеНоменклатуры.ИспользоватьУпаковки КАК ИспользоватьУпаковки,
	|	ВидыНоменклатуры.ИспользованиеХарактеристик КАК ИспользованиеХарактеристик,
	|	ВидыНоменклатуры.ОсобенностьУчета КАК ОсобенностьУчета,
	|	ВидыНоменклатуры.ВладелецХарактеристик КАК ВладелецХарактеристик,
	|	ВремДанныеНоменклатуры.Марка КАК Марка
	|ПОМЕСТИТЬ ВремНоменклатура
	|ИЗ
	|	ВремДанныеНоменклатуры КАК ВремДанныеНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремИнформацияОБазовойУпаковке КАК ВремИнформацияОБазовойУпаковке
	|		ПО ВремДанныеНоменклатуры.Ссылка = ВремИнформацияОБазовойУпаковке.Товар
	|			И ВремДанныеНоменклатуры.ЕдиницаИзмерения = ВремИнформацияОБазовойУпаковке.ЕдиницаИзмерения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ПО ВремДанныеНоменклатуры.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Производители КАК Производители
	|		ПО ВремДанныеНоменклатуры.Производитель = Производители.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК РодительСправочник
	|		ПО ВремДанныеНоменклатуры.Родитель = РодительСправочник.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Марки КАК Марки
	|		ПО ВремДанныеНоменклатуры.Марка = Марки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатурыВладельца
	|		ПО (ВидыНоменклатуры.ВладелецХарактеристик = ВидыНоменклатурыВладельца.Ссылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремДанныеНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремИнформацияОБазовойУпаковке
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Склады.Ссылка КАК Склад,
	|	ВЫБОР
	|		КОГДА Склады.Б_Идентификатор = """"
	|			ТОГДА Склады.Ссылка
	|		ИНАЧЕ Склады.Б_Идентификатор
	|	КОНЕЦ КАК Идентификатор
	|ПОМЕСТИТЬ ВремСклады
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	НЕ Склады.ЭтоГруппа
	|	И Склады.Ссылка В(&СписокСкладов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоглашенияСКлиентами.Ссылка КАК Ссылка,
	|	СоглашенияСКлиентами.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	СоглашенияСКлиентами.ВидЦен КАК ВидЦен,
	|	СоглашенияСКлиентами.Валюта КАК Валюта,
	|	ВалютыСсылка.Наименование КАК ВалютаКод,
	|	ВЫБОР
	|		КОГДА СоглашенияСКлиентами.Б_Идентификатор = """"
	|			ТОГДА СоглашенияСКлиентами.Ссылка
	|		ИНАЧЕ СоглашенияСКлиентами.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторСоглашения,
	|	ВЫБОР
	|		КОГДА ВидыЦен.Б_Идентификатор = """"
	|			ТОГДА ВидыЦен.Ссылка
	|		ИНАЧЕ ВидыЦен.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторВидаЦены
	|ПОМЕСТИТЬ ВремСоглашения
	|ИЗ
	|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК ВалютыСсылка
	|		ПО СоглашенияСКлиентами.Валюта = ВалютыСсылка.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
	|		ПО СоглашенияСКлиентами.ВидЦен = ВидыЦен.Ссылка
	|ГДЕ
	|	СоглашенияСКлиентами.Ссылка В(&СписокСоглашений)
	|{ГДЕ
	|	СоглашенияСКлиентами.Ссылка.* КАК Соглашение}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕдиницыИзмерения.Ссылка КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ЕдиницыИзмерения.Б_Идентификатор = """"
	|			ТОГДА ЕдиницыИзмерения.Ссылка
	|		ИНАЧЕ ЕдиницыИзмерения.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторЕдиницыИзмерения
	|ПОМЕСТИТЬ ВремЕдиницыИзмерения
	|ИЗ
	|	Справочник.УпаковкиЕдиницыИзмерения КАК ЕдиницыИзмерения
	|ГДЕ
	|	ЕдиницыИзмерения.Ссылка В(&СписокЕдиниц)
	|	И ЕдиницыИзмерения.Ссылка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураСХарактеристиками.Номенклатура КАК Номенклатура,
	|	НоменклатураСХарактеристиками.ИдентификаторНоменклатуры КАК ИдентификаторНоменклатуры,
	|	НоменклатураСХарактеристиками.Характеристика КАК Характеристика,
	|	НоменклатураСХарактеристиками.ИдентификаторХарактеристики КАК ИдентификаторХарактеристики,
	|	НоменклатураСХарактеристиками.ВерсияДанныхНоменклатуры КАК ВерсияДанныхНоменклатуры,
	|	НоменклатураСХарактеристиками.ВерсияДанныхХарактеристики КАК ВерсияДанныхХарактеристики,
	|	НоменклатураСХарактеристиками.НаименованиеНоменклатуры КАК НаименованиеНоменклатуры,
	|	НоменклатураСХарактеристиками.НаименованиеХарактеристики КАК НаименованиеХарактеристики,
	|	НоменклатураСХарактеристиками.ПометкаУдаленияНоменклатуры КАК ПометкаУдаленияНоменклатуры,
	|	НоменклатураСХарактеристиками.ПометкаУдаленияХарактеристики КАК ПометкаУдаленияХарактеристики,
	|	НоменклатураСХарактеристиками.Родитель КАК Родитель,
	|	НоменклатураСХарактеристиками.ИдентификаторРодителя КАК ИдентификаторРодителя,
	|	НоменклатураСХарактеристиками.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	НоменклатураСХарактеристиками.ИдентификаторЕдиницыИзмерения КАК ИдентификаторЕдиницыИзмерения,
	|	НоменклатураСХарактеристиками.Артикул КАК Артикул,
	|	НоменклатураСХарактеристиками.Производитель КАК Производитель,
	|	НоменклатураСХарактеристиками.ПроизводительНаименование КАК ПроизводительНаименование,
	|	НоменклатураСХарактеристиками.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	НоменклатураСХарактеристиками.ВидНоменклатуры КАК ВидНоменклатуры,
	|	НоменклатураСХарактеристиками.НаборУпаковок КАК НаборУпаковок,
	|	НоменклатураСХарактеристиками.СтавкаНДС КАК СтавкаНДС,
	|	НоменклатураСХарактеристиками.ТипНоменклатуры КАК ТипНоменклатуры,
	|	НоменклатураСХарактеристиками.ФайлКартинки КАК ФайлКартинки,
	|	НоменклатураСХарактеристиками.ЭтоГруппа КАК ЭтоГруппа,
	|	НоменклатураСХарактеристиками.КодНоменклатуры КАК КодНоменклатуры,
	|	НоменклатураСХарактеристиками.ИспользоватьХарактеристики КАК ИспользоватьХарактеристики,
	|	НоменклатураСХарактеристиками.НаборСвойствТоваров КАК НаборСвойствТоваров,
	|	НоменклатураСХарактеристиками.НаборСвойствХарактеристик КАК НаборСвойствХарактеристик,
	|	НоменклатураСХарактеристиками.НаборСвойствХарактеристикВладельца КАК НаборСвойствХарактеристикВладельца,
	|	НоменклатураСХарактеристиками.ТипТовара КАК ТипТовара,
	|	НоменклатураСХарактеристиками.Комплектующая КАК Комплектующая,
	|	НоменклатураСХарактеристиками.ИспользоватьУпаковки КАК ИспользоватьУпаковки,
	|	НоменклатураСХарактеристиками.ОсобенностьУчета КАК ОсобенностьУчета,
	|	НоменклатураСХарактеристиками.ВысотаБ КАК ВысотаБ,
	|	НоменклатураСХарактеристиками.ГлубинаБ КАК ГлубинаБ,
	|	НоменклатураСХарактеристиками.ШиринаБ КАК ШиринаБ,
	|	НоменклатураСХарактеристиками.ХарактеристикаНоменклатурыДляЦенообразования КАК ХарактеристикаЦО
	|ПОМЕСТИТЬ ВремНоменклатураСХарактеристикамиВся
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВремНоменклатура.Номенклатура КАК Номенклатура,
	|		ВремНоменклатура.ИдентификаторНоменклатуры КАК ИдентификаторНоменклатуры,
	|		ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	|		ВЫБОР
	|			КОГДА ХарактеристикиНоменклатуры.Б_Идентификатор = """"
	|				ТОГДА ХарактеристикиНоменклатуры.Ссылка
	|			ИНАЧЕ ХарактеристикиНоменклатуры.Б_Идентификатор
	|		КОНЕЦ КАК ИдентификаторХарактеристики,
	|		ВремНоменклатура.ВерсияДанныхНоменклатуры КАК ВерсияДанныхНоменклатуры,
	|		ХарактеристикиНоменклатуры.ВерсияДанных КАК ВерсияДанныхХарактеристики,
	|		ВремНоменклатура.НаименованиеНоменклатуры КАК НаименованиеНоменклатуры,
	|		ХарактеристикиНоменклатуры.Наименование КАК НаименованиеХарактеристики,
	|		ВремНоменклатура.ПометкаУдаленияНоменклатуры КАК ПометкаУдаленияНоменклатуры,
	|		ХарактеристикиНоменклатуры.ПометкаУдаления КАК ПометкаУдаленияХарактеристики,
	|		ВремНоменклатура.Родитель КАК Родитель,
	|		ВремНоменклатура.ИдентификаторРодителя КАК ИдентификаторРодителя,
	|		ВремНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ВремНоменклатура.ИдентификаторЕдиницыИзмерения КАК ИдентификаторЕдиницыИзмерения,
	|		ВремНоменклатура.Артикул КАК Артикул,
	|		ВремНоменклатура.Производитель КАК Производитель,
	|		ВремНоменклатура.ПроизводительНаименование КАК ПроизводительНаименование,
	|		ВремНоменклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|		ВремНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|		ВремНоменклатура.НаборУпаковок КАК НаборУпаковок,
	|		ВремНоменклатура.СтавкаНДС КАК СтавкаНДС,
	|		ВремНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|		ВремНоменклатура.ФайлКартинки КАК ФайлКартинки,
	|		ВремНоменклатура.ЭтоГруппа КАК ЭтоГруппа,
	|		ВремНоменклатура.КодНоменклатуры КАК КодНоменклатуры,
	|		ВремНоменклатура.ИспользоватьХарактеристики КАК ИспользоватьХарактеристики,
	|		ВремНоменклатура.НаборСвойствТоваров КАК НаборСвойствТоваров,
	|		ВремНоменклатура.НаборСвойствХарактеристик КАК НаборСвойствХарактеристик,
	|		ВремНоменклатура.НаборСвойствХарактеристикВладельца КАК НаборСвойствХарактеристикВладельца,
	|		ВремНоменклатура.ТипТовара КАК ТипТовара,
	|		ЛОЖЬ КАК Комплектующая,
	|		ВремНоменклатура.ИспользоватьУпаковки КАК ИспользоватьУпаковки,
	|		ВремНоменклатура.ОсобенностьУчета КАК ОсобенностьУчета,
	|		ВремНоменклатура.ВысотаБ КАК ВысотаБ,
	|		ВремНоменклатура.ГлубинаБ КАК ГлубинаБ,
	|		ВремНоменклатура.ШиринаБ КАК ШиринаБ,
	|		ХарактеристикиНоменклатуры.Ссылка КАК ХарактеристикаНоменклатурыДляЦенообразования
	|	ИЗ
	|		Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремНоменклатура КАК ВремНоменклатура
	|			ПО ХарактеристикиНоменклатуры.Владелец = ВремНоменклатура.Номенклатура
	|				И (ВремНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры))
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ВремНоменклатура.Номенклатура,
	|		ВремНоменклатура.ИдентификаторНоменклатуры,
	|		ХарактеристикиНоменклатуры.Ссылка,
	|		ВЫБОР
	|			КОГДА ХарактеристикиНоменклатуры.Б_Идентификатор = """"
	|				ТОГДА ХарактеристикиНоменклатуры.Ссылка
	|			ИНАЧЕ ХарактеристикиНоменклатуры.Б_Идентификатор
	|		КОНЕЦ,
	|		ВремНоменклатура.ВерсияДанныхНоменклатуры,
	|		ХарактеристикиНоменклатуры.ВерсияДанных,
	|		ВремНоменклатура.НаименованиеНоменклатуры,
	|		ХарактеристикиНоменклатуры.Наименование,
	|		ВремНоменклатура.ПометкаУдаленияНоменклатуры,
	|		ХарактеристикиНоменклатуры.ПометкаУдаления,
	|		ВремНоменклатура.Родитель,
	|		ВремНоменклатура.ИдентификаторРодителя,
	|		ВремНоменклатура.ЕдиницаИзмерения,
	|		ВремНоменклатура.ИдентификаторЕдиницыИзмерения,
	|		ВремНоменклатура.Артикул,
	|		ВремНоменклатура.Производитель,
	|		ВремНоменклатура.ПроизводительНаименование,
	|		ВремНоменклатура.ЦеноваяГруппа,
	|		ВремНоменклатура.ВидНоменклатуры,
	|		ВремНоменклатура.НаборУпаковок,
	|		ВремНоменклатура.СтавкаНДС,
	|		ВремНоменклатура.ТипНоменклатуры,
	|		ВремНоменклатура.ФайлКартинки,
	|		ВремНоменклатура.ЭтоГруппа,
	|		ВремНоменклатура.КодНоменклатуры,
	|		ВремНоменклатура.ИспользоватьХарактеристики,
	|		ВремНоменклатура.НаборСвойствТоваров,
	|		ВремНоменклатура.НаборСвойствХарактеристик,
	|		ВремНоменклатура.НаборСвойствХарактеристикВладельца,
	|		ВремНоменклатура.ТипТовара,
	|		ЛОЖЬ,
	|		ВремНоменклатура.ИспользоватьУпаковки,
	|		ВремНоменклатура.ОсобенностьУчета,
	|		ВремНоменклатура.ВысотаБ,
	|		ВремНоменклатура.ГлубинаБ,
	|		ВремНоменклатура.ШиринаБ,
	|		ХарактеристикиНоменклатуры.Ссылка
	|	ИЗ
	|		Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремНоменклатура КАК ВремНоменклатура
	|			ПО (ВремНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры))
	|				И ХарактеристикиНоменклатуры.Владелец = ВремНоменклатура.ВидНоменклатуры
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВремНоменклатура.Номенклатура,
	|		ВремНоменклатура.ИдентификаторНоменклатуры,
	|		ХарактеристикиНоменклатуры.Ссылка,
	|		ВЫБОР
	|			КОГДА ХарактеристикиНоменклатуры.Б_Идентификатор = """"
	|				ТОГДА ХарактеристикиНоменклатуры.Ссылка
	|			ИНАЧЕ ХарактеристикиНоменклатуры.Б_Идентификатор
	|		КОНЕЦ,
	|		ВремНоменклатура.ВерсияДанныхНоменклатуры,
	|		ХарактеристикиНоменклатуры.ВерсияДанных,
	|		ВремНоменклатура.НаименованиеНоменклатуры,
	|		ХарактеристикиНоменклатуры.Наименование,
	|		ВремНоменклатура.ПометкаУдаленияНоменклатуры,
	|		ХарактеристикиНоменклатуры.ПометкаУдаления,
	|		ВремНоменклатура.Родитель,
	|		ВремНоменклатура.ИдентификаторРодителя,
	|		ВремНоменклатура.ЕдиницаИзмерения,
	|		ВремНоменклатура.ИдентификаторЕдиницыИзмерения,
	|		ВремНоменклатура.Артикул,
	|		ВремНоменклатура.Производитель,
	|		ВремНоменклатура.ПроизводительНаименование,
	|		ВремНоменклатура.ЦеноваяГруппа,
	|		ВремНоменклатура.ВидНоменклатуры,
	|		ВремНоменклатура.НаборУпаковок,
	|		ВремНоменклатура.СтавкаНДС,
	|		ВремНоменклатура.ТипНоменклатуры,
	|		ВремНоменклатура.ФайлКартинки,
	|		ВремНоменклатура.ЭтоГруппа,
	|		ВремНоменклатура.КодНоменклатуры,
	|		ВремНоменклатура.ИспользоватьХарактеристики,
	|		ВремНоменклатура.НаборСвойствТоваров,
	|		ВремНоменклатура.НаборСвойствХарактеристик,
	|		ВремНоменклатура.НаборСвойствХарактеристикВладельца,
	|		ВремНоменклатура.ТипТовара,
	|		ЛОЖЬ,
	|		ВремНоменклатура.ИспользоватьУпаковки,
	|		ВремНоменклатура.ОсобенностьУчета,
	|		ВремНоменклатура.ВысотаБ,
	|		ВремНоменклатура.ГлубинаБ,
	|		ВремНоменклатура.ШиринаБ,
	|		ХарактеристикиНоменклатуры.Ссылка
	|	ИЗ
	|		Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремНоменклатура КАК ВремНоменклатура
	|			ПО (ВремНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры))
	|				И ХарактеристикиНоменклатуры.Владелец = ВремНоменклатура.ВладелецХарактеристик
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ВремНоменклатура.Номенклатура,
	|		ВремНоменклатура.ИдентификаторНоменклатуры,
	|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|		ВремНоменклатура.ВерсияДанныхНоменклатуры,
	|		"""",
	|		ВремНоменклатура.НаименованиеНоменклатуры,
	|		"""",
	|		ВремНоменклатура.ПометкаУдаленияНоменклатуры,
	|		ЛОЖЬ,
	|		ВремНоменклатура.Родитель,
	|		ВремНоменклатура.ИдентификаторРодителя,
	|		ВремНоменклатура.ЕдиницаИзмерения,
	|		ВремНоменклатура.ИдентификаторЕдиницыИзмерения,
	|		ВремНоменклатура.Артикул,
	|		ВремНоменклатура.Производитель,
	|		ВремНоменклатура.ПроизводительНаименование,
	|		ВремНоменклатура.ЦеноваяГруппа,
	|		ВремНоменклатура.ВидНоменклатуры,
	|		ВремНоменклатура.НаборУпаковок,
	|		ВремНоменклатура.СтавкаНДС,
	|		ВремНоменклатура.ТипНоменклатуры,
	|		ВремНоменклатура.ФайлКартинки,
	|		ВремНоменклатура.ЭтоГруппа,
	|		ВремНоменклатура.КодНоменклатуры,
	|		ВремНоменклатура.ИспользоватьХарактеристики,
	|		ВремНоменклатура.НаборСвойствТоваров,
	|		ВремНоменклатура.НаборСвойствХарактеристик,
	|		ВремНоменклатура.НаборСвойствХарактеристикВладельца,
	|		ВремНоменклатура.ТипТовара,
	|		ЛОЖЬ,
	|		ВремНоменклатура.ИспользоватьУпаковки,
	|		ВремНоменклатура.ОсобенностьУчета,
	|		ВремНоменклатура.ВысотаБ,
	|		ВремНоменклатура.ГлубинаБ,
	|		ВремНоменклатура.ШиринаБ,
	|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	ИЗ
	|		ВремНоменклатура КАК ВремНоменклатура
	|	ГДЕ
	|		(НЕ ВремНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
	|					И &ВыгружатьНоменклатуруКакПредложение
	|				ИЛИ ВремНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВремНоменклатура.Номенклатура,
	|		ВремНоменклатура.ИдентификаторНоменклатуры,
	|		ВремНоменклатураКомплектующиеОтбор.Характеристика,
	|		ВЫБОР
	|			КОГДА ВремНоменклатураКомплектующиеОтбор.Характеристика ЕСТЬ NULL
	|					ИЛИ ВремНоменклатураКомплектующиеОтбор.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|			ИНАЧЕ ВремНоменклатураКомплектующиеОтбор.ИдентификаторХарактеристики
	|		КОНЕЦ,
	|		ВремНоменклатура.ВерсияДанныхНоменклатуры,
	|		ВЫБОР
	|			КОГДА ВремНоменклатураКомплектующиеОтбор.Характеристика ЕСТЬ NULL
	|					ИЛИ ВремНоменклатураКомплектующиеОтбор.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				ТОГДА """"
	|			ИНАЧЕ ВремНоменклатураКомплектующиеОтбор.ВерсияДанныхХарактеристики
	|		КОНЕЦ,
	|		ВремНоменклатура.НаименованиеНоменклатуры,
	|		ВЫБОР
	|			КОГДА ВремНоменклатураКомплектующиеОтбор.Характеристика ЕСТЬ NULL
	|					ИЛИ ВремНоменклатураКомплектующиеОтбор.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				ТОГДА """"
	|			ИНАЧЕ ВремНоменклатураКомплектующиеОтбор.НаименованиеХарактеристики
	|		КОНЕЦ,
	|		ВремНоменклатура.ПометкаУдаленияНоменклатуры,
	|		ВЫБОР
	|			КОГДА ВремНоменклатураКомплектующиеОтбор.Характеристика ЕСТЬ NULL
	|					ИЛИ ВремНоменклатураКомплектующиеОтбор.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ВремНоменклатураКомплектующиеОтбор.ПометкаУдаленияХарактеристики
	|		КОНЕЦ,
	|		ВремНоменклатура.Родитель,
	|		ВремНоменклатура.ИдентификаторРодителя,
	|		ВремНоменклатура.ЕдиницаИзмерения,
	|		ВремНоменклатура.ИдентификаторЕдиницыИзмерения,
	|		ВремНоменклатура.Артикул,
	|		ВремНоменклатура.Производитель,
	|		ВремНоменклатура.ПроизводительНаименование,
	|		ВремНоменклатура.ЦеноваяГруппа,
	|		ВремНоменклатура.ВидНоменклатуры,
	|		ВремНоменклатура.НаборУпаковок,
	|		ВремНоменклатура.СтавкаНДС,
	|		ВремНоменклатура.ТипНоменклатуры,
	|		ВремНоменклатура.ФайлКартинки,
	|		ВремНоменклатура.ЭтоГруппа,
	|		ВремНоменклатура.КодНоменклатуры,
	|		ВремНоменклатура.ИспользоватьХарактеристики,
	|		ВремНоменклатура.НаборСвойствТоваров,
	|		ВремНоменклатура.НаборСвойствХарактеристик,
	|		ВремНоменклатура.НаборСвойствХарактеристикВладельца,
	|		ВремНоменклатура.ТипТовара,
	|		ИСТИНА,
	|		ВремНоменклатура.ИспользоватьУпаковки,
	|		ВремНоменклатура.ОсобенностьУчета,
	|		ВремНоменклатура.ВысотаБ,
	|		ВремНоменклатура.ГлубинаБ,
	|		ВремНоменклатура.ШиринаБ,
	|		ВремНоменклатураКомплектующиеОтбор.ХарактеристикаНоменклатурыДляЦенообразования
	|	ИЗ
	|		ВремНоменклатураКомплектующиеОтбор КАК ВремНоменклатураКомплектующиеОтбор
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВремНоменклатура КАК ВремНоменклатура
	|			ПО ВремНоменклатураКомплектующиеОтбор.Номенклатура = ВремНоменклатура.Номенклатура) КАК НоменклатураСХарактеристиками
	|{ГДЕ
	|	НоменклатураСХарактеристиками.Номенклатура.* КАК Номенклатура}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоглашениеШапка.Ссылка КАК Соглашение,
	|	СоглашениеТовары.Упаковка КАК Упаковка,
	|	СоглашениеТовары.Упаковка.Числитель КАК КоэффициентУпаковкиСоглашения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СоглашениеТовары.Цена, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|		КОГДА СоглашениеТовары.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				И СоглашениеТовары.ВидЦены ЕСТЬ НЕ NULL 
	|			ТОГДА СоглашениеТовары.ВидЦены
	|		КОГДА (СоглашениеТовары.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				ИЛИ СоглашениеТовары.ВидЦены ЕСТЬ NULL)
	|				И СоглашениеЦеновыеГруппы.ВидЦен ЕСТЬ НЕ NULL 
	|				И СоглашениеЦеновыеГруппы.ВидЦен <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА СоглашениеЦеновыеГруппы.ВидЦен
	|		КОГДА (СоглашениеТовары.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				ИЛИ СоглашениеТовары.ВидЦены ЕСТЬ NULL)
	|				И (СоглашениеЦеновыеГруппы.ВидЦен ЕСТЬ NULL
	|					ИЛИ СоглашениеЦеновыеГруппы.ВидЦен = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка))
	|				И СоглашениеШапка.ВидЦен <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА СоглашениеШапка.ВидЦен
	|	КОНЕЦ КАК ВидЦены,
	|	ЕСТЬNULL(СоглашениеТовары.Цена, 0) КАК Цена,
	|	ВремНоменклатураСХарактеристикамиВся.Номенклатура КАК Номенклатура,
	|	ВремНоменклатураСХарактеристикамиВся.Характеристика КАК Характеристика,
	|	ВремНоменклатураСХарактеристикамиВся.ХарактеристикаЦО КАК ХарактеристикаЦО
	|ПОМЕСТИТЬ ВремЦеныПоСоглашениям
	|ИЗ
	|	ВремНоменклатураСХарактеристикамиВся КАК ВремНоменклатураСХарактеристикамиВся
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремСоглашения КАК СоглашениеШапка
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.Товары КАК СоглашениеТовары
	|		ПО (СоглашениеШапка.Ссылка = СоглашениеТовары.Ссылка)
	|			И ВремНоменклатураСХарактеристикамиВся.Номенклатура = СоглашениеТовары.Номенклатура
	|			И ВремНоменклатураСХарактеристикамиВся.Характеристика = СоглашениеТовары.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК СоглашениеЦеновыеГруппы
	|		ПО ВремНоменклатураСХарактеристикамиВся.ЦеноваяГруппа = СоглашениеЦеновыеГруппы.ЦеноваяГруппа
	|			И (СоглашениеШапка.Ссылка = СоглашениеЦеновыеГруппы.Ссылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныСрезПоследних.ВидЦены КАК ВидЦены,
	|	ЦеныСрезПоследних.Характеристика КАК Характеристика,
	|	ЦеныСрезПоследних.Цена КАК Цена,
	|	ЦеныСрезПоследних.Упаковка КАК Упаковка,
	|	ЦеныСрезПоследних.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВремЦеныСрезПоследних20
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ТекДата,
	|			НЕ &ИспользуетсяЦенообразование25
	|				И ВидЦены В
	|					(ВЫБРАТЬ
	|						ВремСоглашения.ВидЦен
	|					ИЗ
	|						ВремСоглашения КАК ВремСоглашения)
	|				И (Номенклатура, Характеристика) В
	|					(ВЫБРАТЬ
	|						ВремНоменклатураСХарактеристикамиВся.Номенклатура,
	|						ВремНоменклатураСХарактеристикамиВся.Характеристика
	|					ИЗ
	|						ВремНоменклатураСХарактеристикамиВся КАК ВремНоменклатураСХарактеристикамиВся)) КАК ЦеныСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦеныСрезПоследних.Номенклатура,
	|	ЦеныСрезПоследних.Характеристика,
	|	ЦеныСрезПоследних.ВидЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныСрезПоследних.ВидЦены КАК ВидЦены,
	|	ЦеныСрезПоследних.Характеристика КАК ХарактеристикаЦО,
	|	ЦеныСрезПоследних.Цена КАК Цена,
	|	ЦеныСрезПоследних.Упаковка КАК Упаковка,
	|	ЦеныСрезПоследних.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВремЦеныСрезПоследних25
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ТекДата,
	|			&ИспользуетсяЦенообразование25
	|				И ВидЦены В
	|					(ВЫБРАТЬ
	|						ВремСоглашения.ВидЦен
	|					ИЗ
	|						ВремСоглашения КАК ВремСоглашения)
	|				И (Номенклатура, Характеристика) В
	|					(ВЫБРАТЬ
	|						ВремНоменклатураСХарактеристикамиВся.Номенклатура,
	|						ВремНоменклатураСХарактеристикамиВся.ХарактеристикаЦО
	|					ИЗ
	|						ВремНоменклатураСХарактеристикамиВся КАК ВремНоменклатураСХарактеристикамиВся)) КАК ЦеныСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦеныСрезПоследних.Номенклатура,
	|	ЦеныСрезПоследних.Характеристика,
	|	ЦеныСрезПоследних.ВидЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремЦеныПоСоглашениям.Соглашение КАК Соглашение,
	|	ВремЦеныПоСоглашениям.ВидЦены КАК ВидЦены,
	|	ВЫБОР
	|		КОГДА ВремЦеныПоСоглашениям.Цена > 0
	|			ТОГДА ВремЦеныПоСоглашениям.Цена
	|		КОГДА ВремЦеныПоСоглашениям.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				И ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) > 0
	|			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена,
	|	ВремЦеныПоСоглашениям.Номенклатура КАК Номенклатура,
	|	ВремЦеныПоСоглашениям.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВремЦены
	|ИЗ
	|	ВремЦеныПоСоглашениям КАК ВремЦеныПоСоглашениям
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремЦеныСрезПоследних20 КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ВремЦеныПоСоглашениям.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
	|			И ВремЦеныПоСоглашениям.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ВремЦеныПоСоглашениям.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВремЦеныПоСоглашениям.Цена > 0
	|				ТОГДА ВремЦеныПоСоглашениям.Цена
	|			КОГДА ВремЦеныПоСоглашениям.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|					И ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) > 0
	|				ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
	|			ИНАЧЕ 0
	|		КОНЕЦ > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВремЦеныПоСоглашениям.Соглашение,
	|	ВремЦеныПоСоглашениям.ВидЦены,
	|	ВЫБОР
	|		КОГДА ВремЦеныПоСоглашениям.Цена > 0
	|			ТОГДА ВремЦеныПоСоглашениям.Цена
	|		КОГДА ВремЦеныПоСоглашениям.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				И ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) > 0
	|			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВремЦеныПоСоглашениям.Номенклатура,
	|	ВремЦеныПоСоглашениям.Характеристика
	|ИЗ
	|	ВремЦеныПоСоглашениям КАК ВремЦеныПоСоглашениям
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремЦеныСрезПоследних25 КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ВремЦеныПоСоглашениям.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
	|			И ВремЦеныПоСоглашениям.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ВремЦеныПоСоглашениям.ХарактеристикаЦО = ЦеныНоменклатурыСрезПоследних.ХарактеристикаЦО
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВремЦеныПоСоглашениям.Цена > 0
	|				ТОГДА ВремЦеныПоСоглашениям.Цена
	|			КОГДА ВремЦеныПоСоглашениям.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|					И ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) > 0
	|				ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
	|			ИНАЧЕ 0
	|		КОНЕЦ > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремЦеныПоСоглашениям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремЦеныСрезПоследних20
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремЦеныСрезПоследних25
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладах.Характеристика КАК Характеристика,
	|	ТоварыНаСкладах.Склад КАК Склад,
	|	ТоварыНаСкладах.ВНаличииОстаток КАК ВНаличииОстаток
	|ПОМЕСТИТЬ ВремТоварыНаСкладах
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			(Номенклатура, Характеристика) В
	|					(ВЫБРАТЬ
	|						ВремНоменклатураСХарактеристикамиВся.Номенклатура,
	|						ВремНоменклатураСХарактеристикамиВся.Характеристика
	|					ИЗ
	|						ВремНоменклатураСХарактеристикамиВся КАК ВремНоменклатураСХарактеристикамиВся)
	|				И Склад В
	|					(ВЫБРАТЬ
	|						ВремСклады.Склад
	|					ИЗ
	|						ВремСклады КАК ВремСклады)) КАК ТоварыНаСкладах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыКОтгрузке.Номенклатура,
	|	ТоварыКОтгрузке.Характеристика,
	|	ТоварыКОтгрузке.Склад,
	|	ТоварыКОтгрузке.КОтгрузкеОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(
	|			,
	|			(Номенклатура, Характеристика) В
	|					(ВЫБРАТЬ
	|						ВремНоменклатураСХарактеристикамиВся.Номенклатура,
	|						ВремНоменклатураСХарактеристикамиВся.Характеристика
	|					ИЗ
	|						ВремНоменклатураСХарактеристикамиВся КАК ВремНоменклатураСХарактеристикамиВся)
	|				И Склад В
	|					(ВЫБРАТЬ
	|						ВремСклады.Склад
	|					ИЗ
	|						ВремСклады КАК ВремСклады)) КАК ТоварыКОтгрузке
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВремНоменклатураСХарактеристикамиВся.Номенклатура КАК Номенклатура,
	|	ВремНоменклатураСХарактеристикамиВся.ИдентификаторНоменклатуры КАК ИдентификаторНоменклатуры,
	|	ВремНоменклатураСХарактеристикамиВся.Характеристика КАК Характеристика,
	|	ВремНоменклатураСХарактеристикамиВся.ИдентификаторХарактеристики КАК ИдентификаторХарактеристики,
	|	ВремНоменклатураСХарактеристикамиВся.ВерсияДанныхНоменклатуры КАК ВерсияДанныхНоменклатуры,
	|	ВремНоменклатураСХарактеристикамиВся.ВерсияДанныхХарактеристики КАК ВерсияДанныхХарактеристики,
	|	ВремНоменклатураСХарактеристикамиВся.НаименованиеНоменклатуры КАК НаименованиеНоменклатуры,
	|	ВремНоменклатураСХарактеристикамиВся.НаименованиеХарактеристики КАК НаименованиеХарактеристики,
	|	ВремНоменклатураСХарактеристикамиВся.ПометкаУдаленияНоменклатуры КАК ПометкаУдаленияНоменклатуры,
	|	ВремНоменклатураСХарактеристикамиВся.ПометкаУдаленияХарактеристики КАК ПометкаУдаленияХарактеристики,
	|	ВремНоменклатураСХарактеристикамиВся.Родитель КАК Родитель,
	|	ВремНоменклатураСХарактеристикамиВся.ИдентификаторРодителя КАК ИдентификаторРодителя,
	|	ВремНоменклатураСХарактеристикамиВся.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВремНоменклатураСХарактеристикамиВся.ИдентификаторЕдиницыИзмерения КАК ИдентификаторЕдиницыИзмерения,
	|	ВремНоменклатураСХарактеристикамиВся.Артикул КАК Артикул,
	|	ВремНоменклатураСХарактеристикамиВся.Производитель КАК Производитель,
	|	ВремНоменклатураСХарактеристикамиВся.ПроизводительНаименование КАК ПроизводительНаименование,
	|	ВремНоменклатураСХарактеристикамиВся.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	ВремНоменклатураСХарактеристикамиВся.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ВремНоменклатураСХарактеристикамиВся.НаборУпаковок КАК НаборУпаковок,
	|	ВремНоменклатураСХарактеристикамиВся.СтавкаНДС КАК СтавкаНДС,
	|	ВремНоменклатураСХарактеристикамиВся.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ВремНоменклатураСХарактеристикамиВся.ФайлКартинки КАК ФайлКартинки,
	|	ВремНоменклатураСХарактеристикамиВся.ЭтоГруппа КАК ЭтоГруппа,
	|	ВремНоменклатураСХарактеристикамиВся.КодНоменклатуры КАК КодНоменклатуры,
	|	ВремНоменклатураСХарактеристикамиВся.ИспользоватьХарактеристики КАК ИспользоватьХарактеристики,
	|	ВремНоменклатураСХарактеристикамиВся.НаборСвойствТоваров КАК НаборСвойствТоваров,
	|	ВремНоменклатураСХарактеристикамиВся.НаборСвойствХарактеристик КАК НаборСвойствХарактеристик,
	|	ВремНоменклатураСХарактеристикамиВся.НаборСвойствХарактеристикВладельца КАК НаборСвойствХарактеристикВладельца,
	|	ВремНоменклатураСХарактеристикамиВся.ТипТовара КАК ТипТовара,
	|	ВремНоменклатураСХарактеристикамиВся.ИспользоватьУпаковки КАК ИспользоватьУпаковки,
	|	ВремНоменклатураСХарактеристикамиВся.ОсобенностьУчета КАК ОсобенностьУчета,
	|	ВремНоменклатураСХарактеристикамиВся.ВысотаБ КАК ВысотаБ,
	|	ВремНоменклатураСХарактеристикамиВся.ГлубинаБ КАК ГлубинаБ,
	|	ВремНоменклатураСХарактеристикамиВся.ШиринаБ КАК ШиринаБ,
	|	ВремНоменклатураСХарактеристикамиВся.ХарактеристикаЦО КАК ХарактеристикаЦО
	|ПОМЕСТИТЬ ВремНоменклатураСХарактеристиками
	|ИЗ
	|	ВремНоменклатураСХарактеристикамиВся КАК ВремНоменклатураСХарактеристикамиВся
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремТоварыНаСкладах КАК Остатки
	|		ПО ВремНоменклатураСХарактеристикамиВся.Номенклатура = Остатки.Номенклатура
	|			И ВремНоменклатураСХарактеристикамиВся.Характеристика = Остатки.Характеристика
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ВыгружатьВсеХарактеристики
	|					ИЛИ ВремНоменклатураСХарактеристикамиВся.Комплектующая = ИСТИНА
	|					ИЛИ ВремНоменклатураСХарактеристикамиВся.Номенклатура.ВидНоменклатуры.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВЫБОР
	|					КОГДА Остатки.ВНаличииОстаток > 0
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ВыгружатьТолькоСЦеной
	|				ТОГДА (ВремНоменклатураСХарактеристикамиВся.Номенклатура, ВремНоменклатураСХарактеристикамиВся.Характеристика) В
	|						(ВЫБРАТЬ
	|							ВремЦены.Номенклатура,
	|							ВремЦены.Характеристика
	|						ИЗ
	|							ВремЦены КАК ВремЦены)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Номенклатура,
	|	НоменклатураДополнительныеРеквизиты.Свойство КАК Свойство,
	|	НоменклатураДополнительныеРеквизиты.Значение КАК Значение,
	|	НоменклатураДополнительныеРеквизиты.ТекстоваяСтрока КАК ТекстоваяСтрока
	|ПОМЕСТИТЬ ВремЗначенияСвойствТоваровДляВыгрузкиРеквизитовПоПользовательсокмуАлгоритму
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|ГДЕ
	|	НоменклатураДополнительныеРеквизиты.Ссылка В
	|			(ВЫБРАТЬ
	|				ВремНоменклатура.Номенклатура
	|			ИЗ
	|				ВремНоменклатура)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Объект,
	|	ДополнительныеСведения.Свойство,
	|	ДополнительныеСведения.Значение,
	|	""""
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект В
	|			(ВЫБРАТЬ
	|				ВремНоменклатура.Номенклатура
	|			ИЗ
	|				ВремНоменклатура)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремНоменклатураСХарактеристикамиВся
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТоварыНаСкладах";


	Если ПараметрыОбмена.ВыгружатьКомплектующие тогда

		ТекстЗапроса = ТекстЗапроса + "
		|; 
		|       
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВремНоменклатура.Номенклатура КАК Номенклатура,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Комплектующее,
		|	ВЫБОР
		|		КОГДА НоменклатураСправочник.Б_Идентификатор = """"
		|			ТОГДА НоменклатураСправочник.Ссылка
		|		ИНАЧЕ НоменклатураСправочник.Б_Идентификатор
		|	КОНЕЦ КАК ИдентификаторКомплектующего,
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ХарактеристикиНоменклатуры.Б_Идентификатор = """"
		|			ТОГДА ХарактеристикиНоменклатуры.Ссылка
		|		ИНАЧЕ ХарактеристикиНоменклатуры.Б_Идентификатор
		|	КОНЕЦ КАК ИдентификаторХарактеристики,
		|	ВариантыКомплектацииНоменклатурыТовары.Упаковка КАК Упаковка,
		|	ВЫБОР
		|		КОГДА УпаковкиЕдиницыИзмерения.Б_Идентификатор = """"
		|			ТОГДА УпаковкиЕдиницыИзмерения.Ссылка
		|		ИНАЧЕ УпаковкиЕдиницыИзмерения.Б_Идентификатор
		|	КОНЕЦ КАК ИдентификаторУпаковки,
		|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВариантыКомплектацииНоменклатурыТовары.Количество КАК Количество,
		|	НоменклатураСправочник.Наименование КАК КомплектующаяНаименование,
		|	ХарактеристикиНоменклатуры.Наименование КАК ХарактеристикаКомплектующейНаименование
		|ПОМЕСТИТЬ ВремКомплектующиеНоменклатуры
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВремНоменклатура КАК ВремНоменклатура
		|		ПО (ВремНоменклатура.Номенклатура = ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
		|		ПО ВариантыКомплектацииНоменклатурыТовары.Номенклатура = НоменклатураСправочник.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ПО ВариантыКомплектацииНоменклатурыТовары.Характеристика = ХарактеристикиНоменклатуры.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ПО ВариантыКомплектацииНоменклатурыТовары.Упаковка = УпаковкиЕдиницыИзмерения.Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура";       
	КонецЕсли;

	ТекстЗапроса = ТекстЗапроса + "
	|; 
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремНоменклатураКомплектующиеОтбор";


	ЗапросПоСвойствам = "ВЫБРАТЬ
	|	НастройкиСвойств.Свойство КАК Свойство,
	|	НастройкиСвойств.НеВыгружатьВСвойстваПредложений КАК НеВыгружатьВСвойстваПредложений,
	|	НастройкиСвойств.НеВыгружатьВСвойстваТоваров КАК НеВыгружатьВСвойстваТоваров,
	|	НастройкиСвойств.ВлияетНаЦену КАК ВлияетНаЦену,
	|	НастройкиСвойств.ВыгружатьВХИ КАК ВыгружатьВХИ
	|ПОМЕСТИТЬ НастройкиСвойств
	|ИЗ
	|	&НастройкиСвойств КАК НастройкиСвойств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК СвойствоНоменклатуры,
	|	ВЫБОР
	|		КОГДА ДополнительныеРеквизитыИСведения.Б_Идентификатор = """"
	|			ТОГДА ДополнительныеРеквизитыИСведения.Ссылка
	|		ИНАЧЕ ДополнительныеРеквизитыИСведения.Б_Идентификатор
	|	КОНЕЦ КАК Идентификатор,
	|	ВЫБОР
	|		КОГДА ДополнительныеРеквизитыИСведения.Заголовок = """"
	|			ТОГДА ДополнительныеРеквизитыИСведения.Наименование
	|		ИНАЧЕ ДополнительныеРеквизитыИСведения.Заголовок
	|	КОНЕЦ КАК Наименование
	|ПОМЕСТИТЬ ВремСвойства
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Ссылка В(&СписокСвойств)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СвойствоНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДопРеквизиты.Номенклатура КАК Номенклатура,
	|	ДопРеквизиты.Свойство КАК Свойство,
	|	ЗначенияДопРеквизитов.Значение КАК Значение,
	|	ВЫБОР
	|		КОГДА ДопРеквизиты.Свойство.Б_Идентификатор = """"
	|			ТОГДА ДопРеквизиты.Свойство.Ссылка
	|		ИНАЧЕ ДопРеквизиты.Свойство.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторСвойства,
	|	ВЫБОР
	|		КОГДА ЗначенияДопРеквизитов.Значение.Б_Идентификатор = """"
	|				ИЛИ ЗначенияДопРеквизитов.Значение.Б_Идентификатор ЕСТЬ NULL
	|			ТОГДА ЗначенияДопРеквизитов.Значение
	|		ИНАЧЕ ЗначенияДопРеквизитов.Значение.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторЗначения,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗначенияДопРеквизитов.Значение) = ТИП(БУЛЕВО)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК БулевоЗначение,
	|	НастройкиСвойств.НеВыгружатьВСвойстваТоваров КАК НеВыгружатьВСвойстваТоваров
	|ПОМЕСТИТЬ ВремЗначенияСвойствТовара
	|ИЗ
	|	НастройкиСвойств КАК НастройкиСвойств
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВремНоменклатура.Номенклатура КАК Номенклатура,
	|			НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство КАК Свойство
	|		ИЗ
	|			Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремНоменклатура КАК ВремНоменклатура
	|				ПО НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка = ВремНоменклатура.НаборСвойствТоваров
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ВремНоменклатура.Номенклатура,
	|			НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство
	|		ИЗ
	|			Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремНоменклатура КАК ВремНоменклатура
	|				ПО (НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка = &Справочник_Номенклатура_Общие)) КАК ДопРеквизиты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ЗначенияДопРеквизитов
	|			ПО ДопРеквизиты.Свойство = ЗначенияДопРеквизитов.Свойство
	|				И ДопРеквизиты.Номенклатура = ЗначенияДопРеквизитов.Ссылка
	|		ПО (ДопРеквизиты.Свойство = НастройкиСвойств.Свойство)
	|ГДЕ
	|	ДопРеквизиты.Свойство В
	|			(ВЫБРАТЬ
	|				ВремСвойства.СвойствоНоменклатуры
	|			ИЗ
	|				ВремСвойства)
	|	И НЕ ДопРеквизиты.Свойство ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДопСведения.Номенклатура,
	|	ДопСведения.Свойство,
	|	ЗначенияДопСведений.Значение,
	|	ВЫБОР
	|		КОГДА ДопСведения.Свойство.Б_Идентификатор = """"
	|			ТОГДА ДопСведения.Свойство.Ссылка
	|		ИНАЧЕ ДопСведения.Свойство.Б_Идентификатор
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗначенияДопСведений.Значение.Б_Идентификатор = """"
	|				ИЛИ ЗначенияДопСведений.Значение.Б_Идентификатор ЕСТЬ NULL
	|			ТОГДА ЗначенияДопСведений.Значение
	|		ИНАЧЕ ЗначенияДопСведений.Значение.Б_Идентификатор
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗначенияДопСведений.Значение) = ТИП(БУЛЕВО)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	НастройкиСвойств.НеВыгружатьВСвойстваТоваров
	|ИЗ
	|	НастройкиСвойств КАК НастройкиСвойств
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВремНоменклатура.Номенклатура КАК Номенклатура,
	|			НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Свойство КАК Свойство
	|		ИЗ
	|			Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремНоменклатура КАК ВремНоменклатура
	|				ПО НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Ссылка = ВремНоменклатура.НаборСвойствТоваров
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ВремНоменклатура.Номенклатура,
	|			НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Свойство
	|		ИЗ
	|			Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремНоменклатура КАК ВремНоменклатура
	|				ПО (НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Ссылка = &Справочник_Номенклатура_Общие)) КАК ДопСведения
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ЗначенияДопСведений
	|			ПО ДопСведения.Свойство = ЗначенияДопСведений.Свойство
	|				И ДопСведения.Номенклатура = ЗначенияДопСведений.Объект
	|		ПО (ДопСведения.Свойство = НастройкиСвойств.Свойство)
	|ГДЕ
	|	ДопСведения.Свойство В
	|			(ВЫБРАТЬ
	|				ВремСвойства.СвойствоНоменклатуры
	|			ИЗ
	|				ВремСвойства)
	|	И НЕ ДопСведения.Свойство ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДопРеквизиты.Номенклатура КАК Номенклатура,
	|	ДопРеквизиты.Свойство КАК Свойство,
	|	ЗначенияДопРеквизитов.Значение КАК Значение,
	|	ВЫБОР
	|		КОГДА ДопРеквизиты.Свойство.Б_Идентификатор = """"
	|			ТОГДА ДопРеквизиты.Свойство.Ссылка
	|		ИНАЧЕ ДопРеквизиты.Свойство.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторСвойства,
	|	ВЫБОР
	|		КОГДА ЗначенияДопРеквизитов.Значение.Б_Идентификатор = """"
	|				ИЛИ ЗначенияДопРеквизитов.Значение.Б_Идентификатор ЕСТЬ NULL
	|			ТОГДА ЗначенияДопРеквизитов.Значение
	|		ИНАЧЕ ЗначенияДопРеквизитов.Значение.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторЗначения,
	|	ДопРеквизиты.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗначенияДопРеквизитов.Значение) = ТИП(БУЛЕВО)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК БулевоЗначение,
	|	ДопРеквизиты.Свойство.Заголовок КАК СвойствоНаименование,
	|	НастройкиСвойств.НеВыгружатьВСвойстваПредложений КАК НеВыгружатьВСвойстваПредложений,
	|	ВЫБОР
	|		КОГДА ЗначенияДопРеквизитов.Значение ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ЗначенияДопРеквизитов.Значение)
	|	КОНЕЦ КАК ПредставлениеЗначения
	|ПОМЕСТИТЬ ВремЗначенияСвойствХарактеристик
	|ИЗ
	|	НастройкиСвойств КАК НастройкиСвойств
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство КАК Свойство,
	|			ВремНоменклатураСХарактеристиками.Номенклатура КАК Номенклатура,
	|			ВремНоменклатураСХарактеристиками.Характеристика КАК Характеристика
	|		ИЗ
	|			Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками
	|				ПО НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка = ВремНоменклатураСХарактеристиками.НаборСвойствХарактеристик
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство,
	|			ВремНоменклатураСХарактеристиками.Номенклатура,
	|			ВремНоменклатураСХарактеристиками.Характеристика
	|		ИЗ
	|			Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками
	|				ПО НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка = ВремНоменклатураСХарактеристиками.НаборСвойствХарактеристикВладельца
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство,
	|			ВремНоменклатураСХарактеристиками.Номенклатура,
	|			ВремНоменклатураСХарактеристиками.Характеристика
	|		ИЗ
	|			Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками
	|				ПО (НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка = &Справочник_ХарактеристикиНоменклатуры_Общие)) КАК ДопРеквизиты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ЗначенияДопРеквизитов
	|			ПО ДопРеквизиты.Свойство = ЗначенияДопРеквизитов.Свойство
	|				И ДопРеквизиты.Характеристика = ЗначенияДопРеквизитов.Ссылка
	|		ПО (ДопРеквизиты.Свойство = НастройкиСвойств.Свойство)
	|ГДЕ
	|	ДопРеквизиты.Свойство В
	|			(ВЫБРАТЬ
	|				ВремСвойства.СвойствоНоменклатуры
	|			ИЗ
	|				ВремСвойства)
	|	И НЕ ДопРеквизиты.Свойство ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДопСведения.Номенклатура,
	|	ДопСведения.Свойство,
	|	ЗначенияДопСведений.Значение,
	|	ВЫБОР
	|		КОГДА ДопСведения.Свойство.Б_Идентификатор = """"
	|			ТОГДА ДопСведения.Свойство.Ссылка
	|		ИНАЧЕ ДопСведения.Свойство.Б_Идентификатор
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗначенияДопСведений.Значение.Б_Идентификатор = """"
	|				ИЛИ ЗначенияДопСведений.Значение.Б_Идентификатор ЕСТЬ NULL
	|			ТОГДА ЗначенияДопСведений.Значение
	|		ИНАЧЕ ЗначенияДопСведений.Значение.Б_Идентификатор
	|	КОНЕЦ,
	|	ДопСведения.Характеристика,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЗначенияДопСведений.Значение) = ТИП(БУЛЕВО)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ДопСведения.Свойство.Заголовок,
	|	НастройкиСвойств.НеВыгружатьВСвойстваПредложений,
	|	ВЫБОР
	|		КОГДА ЗначенияДопСведений.Значение ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ЗначенияДопСведений.Значение)
	|	КОНЕЦ
	|ИЗ
	|	НастройкиСвойств КАК НастройкиСвойств
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Свойство КАК Свойство,
	|			ВремНоменклатураСХарактеристиками.Номенклатура КАК Номенклатура,
	|			ВремНоменклатураСХарактеристиками.Характеристика КАК Характеристика
	|		ИЗ
	|			Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками
	|				ПО НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Ссылка = ВремНоменклатураСХарактеристиками.НаборСвойствХарактеристик
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Свойство,
	|			ВремНоменклатураСХарактеристиками.Номенклатура,
	|			ВремНоменклатураСХарактеристиками.Характеристика
	|		ИЗ
	|			Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками
	|				ПО НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Ссылка = ВремНоменклатураСХарактеристиками.НаборСвойствХарактеристикВладельца
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Свойство,
	|			ВремНоменклатураСХарактеристиками.Номенклатура,
	|			ВремНоменклатураСХарактеристиками.Характеристика
	|		ИЗ
	|			Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками
	|				ПО (НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Ссылка = &Справочник_ХарактеристикиНоменклатуры_Общие)) КАК ДопСведения
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ЗначенияДопСведений
	|			ПО ДопСведения.Свойство = ЗначенияДопСведений.Свойство
	|				И ДопСведения.Характеристика = ЗначенияДопСведений.Объект
	|		ПО (ДопСведения.Свойство = НастройкиСвойств.Свойство)
	|ГДЕ
	|	ДопСведения.Свойство В
	|			(ВЫБРАТЬ
	|				ВремСвойства.СвойствоНоменклатуры
	|			ИЗ
	|				ВремСвойства)
	|	И НЕ ДопСведения.Свойство ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Характеристика,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НастройкиСвойств";

	ЗапросОстатков = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СвободныеОстатки.Номенклатура КАК Номенклатура,
	|	СвободныеОстатки.Характеристика КАК Характеристика,
	|	СУММА(СвободныеОстатки.ВНаличииОстаток) КАК ВНаличииОстаток,
	|	СУММА(СвободныеОстатки.ВНаличииОстаток - СвободныеОстатки.ВРезервеСоСкладаОстаток - СвободныеОстатки.ВРезервеПодЗаказОстаток) КАК СвободноОстаток,
	|	СвободныеОстатки.Склад КАК Склад
	|ПОМЕСТИТЬ ВремДанныеПоОстаткам
	|ИЗ
	|	РегистрНакопления.СвободныеОстатки.Остатки(,) КАК СвободныеОстатки
	|{ГДЕ
	|	СвободныеОстатки.Склад КАК Склад,
	|	СвободныеОстатки.Номенклатура.* КАК Номенклатура}
	|
	|СГРУППИРОВАТЬ ПО
	|	СвободныеОстатки.Номенклатура,
	|	СвободныеОстатки.Характеристика,
	|	СвободныеОстатки.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремДанныеПоОстаткам.Номенклатура КАК Номенклатура,
	|	ВремДанныеПоОстаткам.Характеристика КАК Характеристика,
	|	ВремДанныеПоОстаткам.Склад КАК Склад,
	|	ВремДанныеПоОстаткам.ВНаличииОстаток КАК ВНаличииОстаток,
	|	ВремДанныеПоОстаткам.СвободноОстаток КАК СвободноОстаток,
	|	ВЫБОР
	|		КОГДА НоменклатураСсылка.Б_Идентификатор = """"""""
	|			ТОГДА НоменклатураСсылка.Ссылка
	|		ИНАЧЕ НоменклатураСсылка.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторНоменклатуры,
	|	ВЫБОР
	|		КОГДА СкладыСсылка.Б_Идентификатор = """"""""
	|			ТОГДА СкладыСсылка.Ссылка
	|		ИНАЧЕ СкладыСсылка.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторСклада,
	|	ВЫБОР
	|		КОГДА ХарактеристикиНоменклатурыСсылка.Б_Идентификатор = """"""""
	|			ТОГДА ХарактеристикиНоменклатурыСсылка.Ссылка
	|		ИНАЧЕ ХарактеристикиНоменклатурыСсылка.Б_Идентификатор
	|	КОНЕЦ КАК ИдентификаторХарактеристики
	|ПОМЕСТИТЬ ВремОстаткиПоСкладам
	|ИЗ
	|	ВремДанныеПоОстаткам КАК ВремДанныеПоОстаткам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСсылка
	|		ПО ВремДанныеПоОстаткам.Номенклатура = НоменклатураСсылка.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатурыСсылка
	|		ПО ВремДанныеПоОстаткам.Характеристика = ХарактеристикиНоменклатурыСсылка.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СкладыСсылка
	|		ПО ВремДанныеПоОстаткам.Склад = СкладыСсылка.Ссылка";	
	
	#Удаление
	ЗапросПоШтрихКодам = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВремНоменклатураСХарактеристиками.Номенклатура КАК Номенклатура,
	|	ВремНоменклатураСХарактеристиками.Характеристика КАК Характеристика,
	|	ШтрихкодыНоменклатуры.Штрихкод
	|ПОМЕСТИТЬ ВремШтрихКоды
	|ИЗ
	|	ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО ВремНоменклатураСХарактеристиками.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
	|			И ВремНоменклатураСХарактеристиками.Характеристика = ШтрихкодыНоменклатуры.Характеристика 
	//{
	//|			И (НЕ &ИспользоватьУпаковкиНоменклатуры
	//|ИЛИ НЕ ВремНоменклатураСХарактеристиками.ИспользоватьУпаковки 
	//|				ИЛИ ВремНоменклатураСХарактеристиками.ЕдиницаИзмерения = ШтрихкодыНоменклатуры.Упаковка.ЕдиницаИзмерения)
	//|
	//}
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика";
	#КонецУдаления
	#Вставка
	ЗапросПоШтрихКодам = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                     |	ВремНоменклатураСХарактеристиками.Номенклатура КАК Номенклатура,
	                     |	ВремНоменклатураСХарактеристиками.Характеристика КАК Характеристика,
	                     |	ЕСТЬNULL(игр_ИдентификаторыСинхронизирумыхОбъектов.Идентификатор, ШтрихкодыНоменклатуры.Штрихкод) КАК Штрихкод
	                     |ПОМЕСТИТЬ ВремШтрихКоды
	                     |ИЗ
	                     |	ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками
	                     |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                     |		ПО ВремНоменклатураСХарактеристиками.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
	                     |			И ВремНоменклатураСХарактеристиками.Характеристика = ШтрихкодыНоменклатуры.Характеристика
	                     |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.игр_ИдентификаторыСинхронизирумыхОбъектов КАК игр_ИдентификаторыСинхронизирумыхОбъектов
	                     |		ПО ВремНоменклатураСХарактеристиками.Номенклатура = игр_ИдентификаторыСинхронизирумыхОбъектов.Объект
	                     |			И ВремНоменклатураСХарактеристиками.Характеристика = игр_ИдентификаторыСинхронизирумыхОбъектов.Характеристика
	                     |
	                     |ИНДЕКСИРОВАТЬ ПО
	                     |	Номенклатура,
	                     |	Характеристика";
	#КонецВставки


	ЗапросПоПланируемойДатеПоступления = "ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.Характеристика КАК Характеристика,
	|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ЗаказыПоставщикамОстатки.ЗаказаноОстаток КАК ЗаказаноОстаток
	|ПОМЕСТИТЬ ВремЗаказыПоставщикамОстатки
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки КАК ЗаказыПоставщикамОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказПоставщику,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщикамОстатки.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщикуДокумент.ПоступлениеОднойДатой
	|			ТОГДА ЗаказПоставщикуДокумент.ДатаПоступления
	|		ИНАЧЕ ЗаказПоставщикуТовары.ДатаПоступления
	|	КОНЕЦ КАК ДатаПоступления,
	|	ЗаказыПоставщикамОстатки.ЗаказаноОстаток КАК Количество
	|ПОМЕСТИТЬ ВремПланируемыеДатыПоступления
	|ИЗ
	|	ВремЗаказыПоставщикамОстатки КАК ЗаказыПоставщикамОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ПО ЗаказыПоставщикамОстатки.ЗаказПоставщику = ЗаказПоставщикуТовары.Ссылка
	|			И ЗаказыПоставщикамОстатки.Номенклатура = ЗаказПоставщикуТовары.Номенклатура
	|			И ЗаказыПоставщикамОстатки.Характеристика = ЗаказПоставщикуТовары.Характеристика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщикуДокумент
	|		ПО ЗаказыПоставщикамОстатки.ЗаказПоставщику = ЗаказПоставщикуДокумент.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЗаказПоставщикуДокумент.ПоступлениеОднойДатой
	|				ТОГДА ЗаказПоставщикуДокумент.ДатаПоступления
	|			ИНАЧЕ ЗаказПоставщикуТовары.ДатаПоступления
	|		КОНЕЦ >= &ТекДата
	|	И ЗаказПоставщикуТовары.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремЗаказыПоставщикамОстатки";

	ЗапросПоЦенам20 = "ВЫБРАТЬ
	|	СоглашениеШапка.Ссылка КАК Соглашение,
	|	СоглашениеШапка.ИдентификаторСоглашения КАК ИдентификаторСоглашения,
	|	СоглашениеТовары.Упаковка КАК Упаковка,
	|	СоглашениеТовары.Упаковка.Числитель КАК КоэффициентУпаковкиСоглашения,
	|	СоглашениеШапка.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	СоглашениеШапка.Валюта КАК ВалютаСоглашения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СоглашениеТовары.Цена, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|		КОГДА СоглашениеТовары.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				И СоглашениеТовары.ВидЦены ЕСТЬ НЕ NULL 
	|			ТОГДА СоглашениеТовары.ВидЦены
	|		КОГДА (СоглашениеТовары.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				ИЛИ СоглашениеТовары.ВидЦены ЕСТЬ NULL)
	|				И СоглашениеЦеновыеГруппы.ВидЦен ЕСТЬ НЕ NULL 
	|				И СоглашениеЦеновыеГруппы.ВидЦен <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА СоглашениеЦеновыеГруппы.ВидЦен
	|		КОГДА (СоглашениеТовары.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				ИЛИ СоглашениеТовары.ВидЦены ЕСТЬ NULL)
	|				И (СоглашениеЦеновыеГруппы.ВидЦен ЕСТЬ NULL
	|					ИЛИ СоглашениеЦеновыеГруппы.ВидЦен = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка))
	|				И СоглашениеШапка.ВидЦен <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА СоглашениеШапка.ВидЦен
	|	КОНЕЦ КАК ВидЦены,
	|	СоглашениеШапка.ИдентификаторВидаЦены КАК ИдентификаторВидаЦены,
	|	ЕСТЬNULL(СоглашениеТовары.Цена, 0) КАК Цена,
	|	ВремНоменклатураСХарактеристиками.Номенклатура КАК Номенклатура,
	|	ВремНоменклатураСХарактеристиками.ИдентификаторНоменклатуры КАК ИдентификаторНоменклатуры,
	|	ВремНоменклатураСХарактеристиками.Характеристика КАК Характеристика,
	|	ВремНоменклатураСХарактеристиками.ИдентификаторХарактеристики КАК ИдентификаторХарактеристики,
	|	ВремНоменклатураСХарактеристиками.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВремНоменклатураСХарактеристиками.ИспользоватьУпаковки КАК ИспользоватьУпаковки
	|ПОМЕСТИТЬ ВремЦеныПоСоглашениям
	|ИЗ
	|	ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремСоглашения КАК СоглашениеШапка
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.Товары КАК СоглашениеТовары
	|		ПО (СоглашениеШапка.Ссылка = СоглашениеТовары.Ссылка)
	|			И ВремНоменклатураСХарактеристиками.Номенклатура = СоглашениеТовары.Номенклатура
	|			И ВремНоменклатураСХарактеристиками.Характеристика = СоглашениеТовары.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК СоглашениеЦеновыеГруппы
	|		ПО ВремНоменклатураСХарактеристиками.ЦеноваяГруппа = СоглашениеЦеновыеГруппы.ЦеноваяГруппа
	|			И (СоглашениеШапка.Ссылка = СоглашениеЦеновыеГруппы.Ссылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныСрезПоследних.ВидЦены КАК ВидЦены,
	|	ЦеныСрезПоследних.Характеристика КАК Характеристика,
	|	ЦеныСрезПоследних.Цена КАК Цена,
	|	ЦеныСрезПоследних.Упаковка КАК Упаковка,
	|	ЦеныСрезПоследних.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВремЦеныСрезПоследних
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ТекДата,
	|			(Номенклатура, Характеристика) В
	|				(ВЫБРАТЬ
	|					ВремНоменклатураСХарактеристиками.Номенклатура,
	|					ВремНоменклатураСХарактеристиками.Характеристика
	|				ИЗ
	|					ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками)) КАК ЦеныСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦеныСрезПоследних.Номенклатура,
	|	ЦеныСрезПоследних.Характеристика,
	|	ЦеныСрезПоследних.ВидЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВремЦеныПоСоглашениям.Соглашение КАК Соглашение,
	|	ВремЦеныПоСоглашениям.ИдентификаторСоглашения КАК ИдентификаторСоглашения,
	|	ВремЦеныПоСоглашениям.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ВремЦеныПоСоглашениям.ВидЦены КАК ВидЦены,
	|	ВремЦеныПоСоглашениям.ИдентификаторВидаЦены КАК ИдентификаторВидаЦены,
	|	ВремЦеныПоСоглашениям.ВалютаСоглашения КАК ВалютаСоглашения,
	|	ВЫБОР
	|		КОГДА ВремЦеныПоСоглашениям.Цена > 0
	|			ТОГДА ВремЦеныПоСоглашениям.Упаковка
	|		КОГДА ВремЦеныПоСоглашениям.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				И ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) > 0
	|			ТОГДА ЦеныНоменклатурыСрезПоследних.Упаковка
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|	КОНЕЦ КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ВремЦеныПоСоглашениям.Цена > 0
	|			ТОГДА ВремЦеныПоСоглашениям.ВалютаСоглашения
	|		КОГДА ВремЦеныПоСоглашениям.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				И ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) > 0
	|			ТОГДА ЦеныНоменклатурыСрезПоследних.Валюта
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|	КОНЕЦ КАК ВалютаЦены,
	|	ВЫБОР
	|		КОГДА ВремЦеныПоСоглашениям.Цена > 0
	|			ТОГДА ВремЦеныПоСоглашениям.Цена
	|		КОГДА ВремЦеныПоСоглашениям.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				И ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) > 0
	|			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена,
	|	ВремЦеныПоСоглашениям.Номенклатура КАК Номенклатура,
	|	ВремЦеныПоСоглашениям.ИдентификаторНоменклатуры КАК ИдентификаторНоменклатуры,
	|	ВремЦеныПоСоглашениям.Характеристика КАК Характеристика,
	|	ВремЦеныПоСоглашениям.ИдентификаторХарактеристики КАК ИдентификаторХарактеристики,
	|	ВЫБОР
	|		КОГДА ВремЦеныПоСоглашениям.ИспользоватьУпаковки = ЛОЖЬ
	|			ТОГДА 1
	|		КОГДА ВремЦеныПоСоглашениям.Цена > 0
	|			ТОГДА ВремЦеныПоСоглашениям.Упаковка.Числитель
	|		КОГДА ВремЦеныПоСоглашениям.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				И ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) > 0
	|			ТОГДА ВЫБОР
	|					КОГДА ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель = 0
	|						ТОГДА 1
	|					ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК УпаковкаКоэффициент,
	|	ВремЦеныПоСоглашениям.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ВремЦены
	|ИЗ
	|	ВремЦеныПоСоглашениям КАК ВремЦеныПоСоглашениям
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремЦеныСрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ВремЦеныПоСоглашениям.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
	|			И ВремЦеныПоСоглашениям.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ВремЦеныПоСоглашениям.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВремЦеныПоСоглашениям.Цена > 0
	|				ТОГДА ВремЦеныПоСоглашениям.Цена
	|			КОГДА ВремЦеныПоСоглашениям.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|					И ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) > 0
	|				ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
	|			ИНАЧЕ 0
	|		КОНЕЦ > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремЦеныПоСоглашениям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремЦеныСрезПоследних";


	ЗапросПоЦенам25 = "ВЫБРАТЬ
	|	СоглашениеШапка.Ссылка КАК Соглашение,
	|	СоглашениеШапка.ИдентификаторСоглашения КАК ИдентификаторСоглашения,
	|	СоглашениеТовары.Упаковка КАК Упаковка,
	|	СоглашениеТовары.Упаковка.Числитель КАК КоэффициентУпаковкиСоглашения,
	|	СоглашениеШапка.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	СоглашениеШапка.Валюта КАК ВалютаСоглашения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СоглашениеТовары.Цена, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|		КОГДА СоглашениеТовары.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				И СоглашениеТовары.ВидЦены ЕСТЬ НЕ NULL 
	|			ТОГДА СоглашениеТовары.ВидЦены
	|		КОГДА (СоглашениеТовары.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				ИЛИ СоглашениеТовары.ВидЦены ЕСТЬ NULL)
	|				И СоглашениеЦеновыеГруппы.ВидЦен ЕСТЬ НЕ NULL 
	|				И СоглашениеЦеновыеГруппы.ВидЦен <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА СоглашениеЦеновыеГруппы.ВидЦен
	|		КОГДА (СоглашениеТовары.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				ИЛИ СоглашениеТовары.ВидЦены ЕСТЬ NULL)
	|				И (СоглашениеЦеновыеГруппы.ВидЦен ЕСТЬ NULL
	|					ИЛИ СоглашениеЦеновыеГруппы.ВидЦен = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка))
	|				И СоглашениеШапка.ВидЦен <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА СоглашениеШапка.ВидЦен
	|	КОНЕЦ КАК ВидЦены,
	|	СоглашениеШапка.ИдентификаторВидаЦены КАК ИдентификаторВидаЦены,
	|	ЕСТЬNULL(СоглашениеТовары.Цена, 0) КАК Цена,
	|	ВремНоменклатураСХарактеристиками.Номенклатура КАК Номенклатура,
	|	ВремНоменклатураСХарактеристиками.ИдентификаторНоменклатуры КАК ИдентификаторНоменклатуры,
	|	ВремНоменклатураСХарактеристиками.Характеристика КАК Характеристика,
	|	ВремНоменклатураСХарактеристиками.ИдентификаторХарактеристики КАК ИдентификаторХарактеристики,
	|	ВремНоменклатураСХарактеристиками.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВремНоменклатураСХарактеристиками.ИспользоватьУпаковки КАК ИспользоватьУпаковки,
	|	ВремНоменклатураСХарактеристиками.ХарактеристикаЦО КАК ХарактеристикаЦО
	|ПОМЕСТИТЬ ВремЦеныПоСоглашениям
	|ИЗ
	|	ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремСоглашения КАК СоглашениеШапка
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.Товары КАК СоглашениеТовары
	|		ПО (СоглашениеШапка.Ссылка = СоглашениеТовары.Ссылка)
	|			И ВремНоменклатураСХарактеристиками.Номенклатура = СоглашениеТовары.Номенклатура
	|			И ВремНоменклатураСХарактеристиками.Характеристика = СоглашениеТовары.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами.ЦеновыеГруппы КАК СоглашениеЦеновыеГруппы
	|		ПО ВремНоменклатураСХарактеристиками.ЦеноваяГруппа = СоглашениеЦеновыеГруппы.ЦеноваяГруппа
	|			И (СоглашениеШапка.Ссылка = СоглашениеЦеновыеГруппы.Ссылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныСрезПоследних.ВидЦены КАК ВидЦены,
	|	ЦеныСрезПоследних.ХарактеристикаЦО КАК ХарактеристикаЦО,
	|	ЦеныСрезПоследних.Цена КАК Цена,
	|	ЦеныСрезПоследних.Упаковка КАК Упаковка,
	|	ЦеныСрезПоследних.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВремЦеныСрезПоследних
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
	|			&ТекДата,
	|			(Номенклатура, ХарактеристикаЦО) В
	|				(ВЫБРАТЬ
	|					ВремНоменклатураСХарактеристиками.Номенклатура,
	|					ВремНоменклатураСХарактеристиками.ХарактеристикаЦО
	|				ИЗ
	|					ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками)) КАК ЦеныСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦеныСрезПоследних.Номенклатура,
	|	ЦеныСрезПоследних.ХарактеристикаЦО,
	|	ЦеныСрезПоследних.ВидЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВремЦеныПоСоглашениям.Соглашение КАК Соглашение,
	|	ВремЦеныПоСоглашениям.ИдентификаторСоглашения КАК ИдентификаторСоглашения,
	|	ВремЦеныПоСоглашениям.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ВремЦеныПоСоглашениям.ВидЦены КАК ВидЦены,
	|	ВремЦеныПоСоглашениям.ИдентификаторВидаЦены КАК ИдентификаторВидаЦены,
	|	ВремЦеныПоСоглашениям.ВалютаСоглашения КАК ВалютаСоглашения,
	|	ВЫБОР
	|		КОГДА ВремЦеныПоСоглашениям.Цена > 0
	|			ТОГДА ВремЦеныПоСоглашениям.Упаковка
	|		КОГДА ВремЦеныПоСоглашениям.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				И ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) > 0
	|			ТОГДА ЦеныНоменклатурыСрезПоследних.Упаковка
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|	КОНЕЦ КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ВремЦеныПоСоглашениям.Цена > 0
	|			ТОГДА ВремЦеныПоСоглашениям.ВалютаСоглашения
	|		КОГДА ВремЦеныПоСоглашениям.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				И ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) > 0
	|			ТОГДА ЦеныНоменклатурыСрезПоследних.Валюта
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|	КОНЕЦ КАК ВалютаЦены,
	|	ВЫБОР
	|		КОГДА ВремЦеныПоСоглашениям.Цена > 0
	|			ТОГДА ВремЦеныПоСоглашениям.Цена
	|		КОГДА ВремЦеныПоСоглашениям.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				И ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) > 0
	|			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена,
	|	ВремЦеныПоСоглашениям.Номенклатура КАК Номенклатура,
	|	ВремЦеныПоСоглашениям.ИдентификаторНоменклатуры КАК ИдентификаторНоменклатуры,
	|	ВремЦеныПоСоглашениям.Характеристика КАК Характеристика,
	|	ВремЦеныПоСоглашениям.ИдентификаторХарактеристики КАК ИдентификаторХарактеристики,
	|	ВЫБОР
	|		КОГДА ВремЦеныПоСоглашениям.ИспользоватьУпаковки = ЛОЖЬ
	|			ТОГДА 1
	|		КОГДА ВремЦеныПоСоглашениям.Цена > 0
	|			ТОГДА ВремЦеныПоСоглашениям.Упаковка.Числитель
	|		КОГДА ВремЦеныПоСоглашениям.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|				И ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) > 0
	|			ТОГДА ВЫБОР
	|					КОГДА ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель = 0
	|						ТОГДА 1
	|					ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК УпаковкаКоэффициент,
	|	ВремЦеныПоСоглашениям.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ВремЦены
	|ИЗ
	|	ВремЦеныПоСоглашениям КАК ВремЦеныПоСоглашениям
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремЦеныСрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ВремЦеныПоСоглашениям.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
	|			И ВремЦеныПоСоглашениям.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ВремЦеныПоСоглашениям.ХарактеристикаЦО = ЦеныНоменклатурыСрезПоследних.ХарактеристикаЦО
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВремЦеныПоСоглашениям.Цена > 0
	|				ТОГДА ВремЦеныПоСоглашениям.Цена
	|			КОГДА ВремЦеныПоСоглашениям.ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|					И ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) > 0
	|				ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
	|			ИНАЧЕ 0
	|		КОНЕЦ > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремЦеныПоСоглашениям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремЦеныСрезПоследних";

	ЗапросПоКартинкамИФайлам = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремНоменклатура.Номенклатура КАК Номенклатура,
	|	НоменклатураПрисоединенныеФайлы.Ссылка КАК Файл,
	|	НоменклатураПрисоединенныеФайлы.Наименование КАК Наименование,
	|	НоменклатураПрисоединенныеФайлы.Описание КАК Описание,
	|	НоменклатураПрисоединенныеФайлы.ТипХраненияФайла КАК ТипХраненияФайла,
	|	НоменклатураПрисоединенныеФайлы.Расширение КАК Расширение,
	|	ВЫБОР
	|		КОГДА ВремНоменклатура.ФайлКартинки = НоменклатураПрисоединенныеФайлы.Ссылка
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Основная,
	|	НоменклатураПрисоединенныеФайлы.ДатаСоздания КАК ДатаСоздания,
	|	НоменклатураПрисоединенныеФайлы.Том.ПолныйПутьWindows КАК ТомПолныйПутьWindows,
	|	НоменклатураПрисоединенныеФайлы.Том.ПолныйПутьLinux КАК ТомПолныйПутьLinux,
	|	НоменклатураПрисоединенныеФайлы.ПутьКФайлу КАК ПутьКФайлу
	|ПОМЕСТИТЬ ВремНоменклатураСВсемиПрисоединеннымиФайлами
	|ИЗ
	|	ВремНоменклатура КАК ВремНоменклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
	|		ПО (НоменклатураПрисоединенныеФайлы.ВладелецФайла = ВремНоменклатура.Номенклатура)
	|			И (НЕ НоменклатураПрисоединенныеФайлы.ПометкаУдаления)
	|ГДЕ
	|	НоменклатураПрисоединенныеФайлы.ЭтоГруппа = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремНоменклатураСВсемиПрисоединеннымиФайлами.Файл КАК Файл
	|ПОМЕСТИТЬ ВремНоменклатураСНужнымиПрисоединеннымиФайлами
	|ИЗ
	|	ВремНоменклатураСВсемиПрисоединеннымиФайлами КАК ВремНоменклатураСВсемиПрисоединеннымиФайлами
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ВыгружатьВсеКартинки
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВремНоменклатураСВсемиПрисоединеннымиФайлами.Файл В
	|					(ВЫБРАТЬ
	|						НоменклатураПрисоединенныеФайлыИзменения.Ссылка
	|					ИЗ
	|						Справочник.НоменклатураПрисоединенныеФайлы.Изменения КАК НоменклатураПрисоединенныеФайлыИзменения
	|					ГДЕ
	|						НоменклатураПрисоединенныеФайлыИзменения.Узел = &Узел)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВремНоменклатураСВсемиПрисоединеннымиФайлами.Файл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремНоменклатураСНужнымиПрисоединеннымиФайлами.Файл КАК Файл,
	|	ДвоичныеДанныеФайлов.Файл КАК ХранимыйФайл,
	|	ДвоичныеДанныеФайлов.ДвоичныеДанныеФайла КАК ДвоичныеДанныеФайла
	|ПОМЕСТИТЬ ВремНужныеФайлыНоменклатуры
	|ИЗ
	|	ВремНоменклатураСНужнымиПрисоединеннымиФайлами КАК ВремНоменклатураСНужнымиПрисоединеннымиФайлами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДвоичныеДанныеФайлов КАК ДвоичныеДанныеФайлов
	|		ПО ВремНоменклатураСНужнымиПрисоединеннымиФайлами.Файл = ДвоичныеДанныеФайлов.Файл
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Файл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремНоменклатураСНужнымиПрисоединеннымиФайлами
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремНоменклатураСВсемиПрисоединеннымиФайлами.Номенклатура КАК Номенклатура,
	|	ВремНоменклатураСВсемиПрисоединеннымиФайлами.Файл КАК Файл,
	|	ВремНоменклатураСВсемиПрисоединеннымиФайлами.Наименование КАК Наименование,
	|	ВремНоменклатураСВсемиПрисоединеннымиФайлами.Описание КАК Описание,
	|	ВремНоменклатураСВсемиПрисоединеннымиФайлами.ТипХраненияФайла КАК ТипХраненияФайла,
	|	ВремНоменклатураСВсемиПрисоединеннымиФайлами.Расширение КАК Расширение,
	|	ВремНоменклатураСВсемиПрисоединеннымиФайлами.Основная КАК Основная,
	|	ВремНужныеФайлыНоменклатуры.ХранимыйФайл КАК ХранимыйФайл,
	|	ВремНоменклатураСВсемиПрисоединеннымиФайлами.ДатаСоздания КАК ДатаСоздания,
	|	ВЫБОР
	|		КОГДА ВремНужныеФайлыНоменклатуры.Файл ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НадоВыгружать,
	|	ВЫБОР
	|		КОГДА ВремНоменклатураСВсемиПрисоединеннымиФайлами.Расширение В (&СписокРасширенийКартинок)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоКартинка,
	|	ВремНоменклатураСВсемиПрисоединеннымиФайлами.ТомПолныйПутьWindows КАК ТомПолныйПутьWindows,
	|	ВремНоменклатураСВсемиПрисоединеннымиФайлами.ТомПолныйПутьLinux КАК ТомПолныйПутьLinux,
	|	ВремНоменклатураСВсемиПрисоединеннымиФайлами.ПутьКФайлу КАК ПутьКФайлу,
	|	ВремНужныеФайлыНоменклатуры.ДвоичныеДанныеФайла КАК ДвоичныеДанныеФайла
	|ПОМЕСТИТЬ ВремФайлыНоменклатуры
	|ИЗ
	|	ВремНоменклатураСВсемиПрисоединеннымиФайлами КАК ВремНоменклатураСВсемиПрисоединеннымиФайлами
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремНужныеФайлыНоменклатуры КАК ВремНужныеФайлыНоменклатуры
	|		ПО ВремНоменклатураСВсемиПрисоединеннымиФайлами.Файл = ВремНужныеФайлыНоменклатуры.Файл
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремНоменклатураСВсемиПрисоединеннымиФайлами
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремНужныеФайлыНоменклатуры";


	ЗапросПоКартинкамИФайламПредложений ="ВЫБРАТЬ
	|	Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.Ссылка КАК Файл,
	|	ВремНоменклатураСХарактеристиками.Номенклатура,
	|	ВремНоменклатураСХарактеристиками.Характеристика,
	|	Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.Расширение,
	|	Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.Описание,
	|	Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.Наименование,
	|	Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.Основная КАК Основная,
	|	Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.ДатаСоздания
	|ПОМЕСТИТЬ ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами
	|ИЗ
	|	ВремНоменклатураСХарактеристиками КАК ВремНоменклатураСХарактеристиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы КАК Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы
	|		ПО ВремНоменклатураСХарактеристиками.Номенклатура = Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.Номенклатура
	|			И ВремНоменклатураСХарактеристиками.Характеристика = Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.ХарактеристикаНоменклатуры
	|			И (НЕ Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.ПометкаУдаления)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Файл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Файл
	|ПОМЕСТИТЬ ВремХарактеристикаНоменклатурыСНужнымиПрисоединеннымиФайлами
	|ИЗ
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами КАК ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ВыгружатьВсеКартинки
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Файл В
	|					(ВЫБРАТЬ
	|						Б_ХарактеристикиНоменклатурыПрисоединенныеФайлыИзменения.Ссылка
	|					ИЗ
	|						Справочник.Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.Изменения КАК Б_ХарактеристикиНоменклатурыПрисоединенныеФайлыИзменения
	|					ГДЕ
	|						Б_ХарактеристикиНоменклатурыПрисоединенныеФайлыИзменения.Узел = &Узел)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Файл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремХарактеристикаНоменклатурыСНужнымиПрисоединеннымиФайлами.Файл КАК Файл,
	|	Б_ПрисоединенныеФайлыХарактеристикНоменклатуры.ХранимыйФайл КАК ХранимыйФайл
	|ПОМЕСТИТЬ ВремНужныеФайлыХарактеристикНоменклатуры
	|ИЗ
	|	ВремХарактеристикаНоменклатурыСНужнымиПрисоединеннымиФайлами КАК ВремХарактеристикаНоменклатурыСНужнымиПрисоединеннымиФайлами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Б_ПрисоединенныеФайлыХарактеристикНоменклатуры КАК Б_ПрисоединенныеФайлыХарактеристикНоменклатуры
	|		ПО ВремХарактеристикаНоменклатурыСНужнымиПрисоединеннымиФайлами.Файл = Б_ПрисоединенныеФайлыХарактеристикНоменклатуры.ПрисоединенныйФайл
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Файл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремХарактеристикаНоменклатурыСНужнымиПрисоединеннымиФайлами
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Номенклатура КАК Номенклатура,
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Файл,
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Наименование,
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Описание,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыХраненияФайлов.ВИнформационнойБазе) КАК ТипХраненияФайла,
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Расширение,
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Основная,
	|	ВремНужныеФайлыХарактеристикНоменклатуры.ХранимыйФайл,
	|	ВремНужныеФайлыХарактеристикНоменклатуры.ХранимыйФайл КАК ДвоичныеДанныеФайла,
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.ДатаСоздания,
	|	ВЫБОР
	|		КОГДА ВремНужныеФайлыХарактеристикНоменклатуры.ХранимыйФайл ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НадоВыгружать,
	|	ВЫБОР
	|		КОГДА ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Расширение В (&СписокРасширенийКартинок)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоКартинка,
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВремФайлыХарактеристикНоменклатуры
	|ИЗ
	|	ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами КАК ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремНужныеФайлыХарактеристикНоменклатуры КАК ВремНужныеФайлыХарактеристикНоменклатуры
	|		ПО ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами.Файл = ВремНужныеФайлыХарактеристикНоменклатуры.Файл
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремХарактеристикаНоменклатурыСВсемиПрисоединеннымиФайлами
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремНужныеФайлыХарактеристикНоменклатуры";


	Если ПараметрыОбмена.КлассифицироватьПоВидамНоменклатуры Тогда

		ТекстЗапросаГруппы =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВремНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры
		|ИЗ
		|	ВремНоменклатура КАК ВремНоменклатура
		|ГДЕ
		|	(НЕ ВремНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка))
		|ИТОГИ ПО
		|	ВидНоменклатуры ИЕРАРХИЯ
		|АВТОУПОРЯДОЧИВАНИЕ";

	Иначе

		ТекстЗапросаГруппы =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВремНоменклатура.Номенклатура КАК Номенклатура,
		|	ВремНоменклатура.ЭтоГруппа КАК ЭтоГруппа
		|ИЗ
		|	ВремНоменклатура КАК ВремНоменклатура
		|ИТОГИ ПО
		|	Номенклатура ТОЛЬКО ИЕРАРХИЯ
		|АВТОУПОРЯДОЧИВАНИЕ";

	КонецЕсли;

	Если ПараметрыОбмена.ВыгружатьСвойства ИЛИ ПараметрыОбмена.ВыгружатьЗначенияСвойствВТовары ИЛИ ПараметрыОбмена.ВыгружатьХарактеристикиПредложений ИЛИ ПараметрыОбмена.ВыгружатьЗначенияСвойствВПредложения Тогда

		ТекстЗапроса = ТекстЗапроса + Символы.ПС + ";" + Символы.ПС + ЗапросПоСвойствам;

	КонецЕсли;


	Если ПараметрыОбмена.ВыгружатьКартинкиИФайлы Тогда

		ТекстЗапроса = ТекстЗапроса + Символы.ПС + ";" + Символы.ПС	+ ЗапросПоКартинкамИФайлам;

	КонецЕсли;

	Если ПараметрыОбмена.ВыгружатьКартинкиИФайлыПредложений Тогда

		ТекстЗапроса = ТекстЗапроса + Символы.ПС + ";" + Символы.ПС	+ ЗапросПоКартинкамИФайламПредложений;

	КонецЕсли;


	Если ПараметрыОбмена.ВыгружатьЦены И (ПараметрыОбмена.ИспользуетсяЦенообразование25 = ЛОЖЬ) Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + ";" + Символы.ПС	+ ЗапросПоЦенам20;
	КонецЕсли;

	Если ПараметрыОбмена.ВыгружатьЦены И (ПараметрыОбмена.ИспользуетсяЦенообразование25 = ИСТИНА) Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + ";" + Символы.ПС	+ ЗапросПоЦенам25;
	КонецЕсли;



	Если ПараметрыОбмена.ВыгружатьОстатки Тогда

		ТекстЗапроса = ТекстЗапроса + Символы.ПС + ";" + Символы.ПС	+ ЗапросОстатков;

	КонецЕсли;

	Если ПараметрыОбмена.ВыгружатьШтрихкоды Тогда

		ТекстЗапроса = ТекстЗапроса + Символы.ПС + ";" + Символы.ПС	+ ЗапросПоШтрихКодам;

	КонецЕсли;

	Если ПараметрыОбмена.ВыгружатьПланируемуюДатуПоступленияПредложения Тогда

		ТекстЗапроса = ТекстЗапроса + Символы.ПС + ";" + Символы.ПС	+ ЗапросПоПланируемойДатеПоступления;

	КонецЕсли;

	ТекстЗапроса = ТекстЗапроса + Символы.ПС + ";" + Символы.ПС
	+ ТекстЗапросаГруппы;


	лМенеджерВременныхТаблиц 		= Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц 	= лМенеджерВременныхТаблиц; 
	Запрос.Текст = ТекстЗапроса;
	запрос.Выполнить();	

	Возврат лМенеджерВременныхТаблиц;

КонецФункции

