// Запускает обновление элементов справочника ЭКОМ_ТипыНеструктДокументов из GIT
//
Процедура ОбновитьСправочникТиповНеструктурированныхДокументов() Экспорт

	МассивЛогаСобытий = Новый Массив;
	КомандаЗапроса    = "/repos/1cdevelopexite/UpdateService/contents/condra";
	ОтветСервера = ЭКОМ_ОбщегоНазначения.ПолучениеДанныхGITНаСервере(КомандаЗапроса, МассивЛогаСобытий);
	Если ОтветСервера.Количество() > 0 Тогда
		ОбновитьСправочник(ОтветСервера, МассивЛогаСобытий);
	КонецЕсли;

	Если МассивЛогаСобытий.Количество() > 0 Тогда
		ЭКОМ_ОбщегоНазначения.ЗаписатьЛогСобытийвРегистрЛогирование(МассивЛогаСобытий);
	КонецЕсли;
	
КонецПроцедуры // ОбновитьСправочникТиповНеструктурированныхДокументов()

// Обновляет элементы справочника ЭКОМ_ТипыНеструктДокументов полученными из GIT данными
//
// Параметры:
//  ОтветСервера  - Структура - ответ сервера с данными для обновления
//
Процедура ОбновитьСправочник(ОтветСервера, МассивЛогаСобытий)

	Если ОтветСервера = Неопределено Тогда
		ТекстЛогаСобытий = "Ошибка обновления справочников <<<Docrobot Типы неструктурированных документов>>>!";
		ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий,
			Перечисления.ЭКОМ_УровниЛогирования.Ошибка, "Обновить справочник CONDRA через GIT");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
	Иначе
		ВременныйКаталог = КаталогВременныхФайлов() + "TempECOM" + ПолучитьРазделительПути();
		
		Для каждого СтрФайл Из ОтветСервера Цикл
			Если СтрФайл.Получить("name") = "condraTypes.xml"  Тогда
				
				КомандаЗапроса    = "/repos/1cdevelopexite/UpdateService/contents/" + СтрФайл.Получить("path");          
				ОтветСервераПоФайлу = ЭКОМ_ОбщегоНазначения.ПолучениеДанныхGITНаСервере(КомандаЗапроса, МассивЛогаСобытий);
				
				Если НЕ ОтветСервераПоФайлу = Неопределено Тогда
					
					СтрокаBase64   = ОтветСервераПоФайлу.Получить("content");	
					СтрокаBase64   = СтрЗаменить(СтрокаBase64,"\/","/");  
					
					ПолноеИмяФайлаXML = ВременныйКаталог + ОтветСервераПоФайлу.Получить("name");
					ДвоичныеДанные = Base64Значение(СтрокаBase64);
					
					ДвоичныеДанные.Записать(ПолноеИмяФайлаXML);
					
					ФайлXMLДляОбработки = Новый Файл(ПолноеИмяФайлаXML);
					ЧтениеXMLДляТекущегоФайла = Новый ЧтениеXML();					
					Если ФайлXMLДляОбработки.Расширение = ".xml" 
						ИЛИ ФайлXMLДляОбработки.Расширение = "xml" Тогда  
						Попытка
							ЧтениеXMLДляТекущегоФайла.ОткрытьФайл(ФайлXMLДляОбработки.ПолноеИмя,,,"utf-8");							
							ЧтениеXMLДляТекущегоФайла.Прочитать();
						Исключение
							ЧтениеXMLДляТекущегоФайла.Закрыть();
							
							ТекстЛогаСобытий = "Документ XML поврежден (243): " + ФайлXMLДляОбработки.ПолноеИмя;
							ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий,
								Перечисления.ЭКОМ_УровниЛогирования.Ошибка, "Обновить справочник CONDRA через GIT");
							МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
							
							ЧтениеXMLДляТекущегоФайла = Неопределено;
						КонецПопытки;
					КонецЕсли;

					Попытка
						ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXMLДляТекущегоФайла);
					Исключение
						ТекстЛогаСобытий = "Ошибка при обновлении элемента - " + ОписаниеОшибки();
						ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий,
							Перечисления.ЭКОМ_УровниЛогирования.Ошибка, "Обновить справочник CONDRA через GIT");
						МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
						Продолжить;
					КонецПопытки;
					
					Если НЕ ОбъектXDTO.Свойства().Получить("type") = Неопределено Тогда
						
						КлассификаторТаблица = Новый ТаблицаЗначений;
						КлассификаторТаблица.Колонки.Добавить("ID", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(4)));
						КлассификаторТаблица.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100)));
						КлассификаторТаблица.Колонки.Добавить("Страна", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100)));
						
						Для Каждого ЭлементСписка Из ОбъектXDTO.type Цикл
							НовыйЭлемент = КлассификаторТаблица.Добавить();
							НовыйЭлемент.ID = ЭлементСписка.id;
							НовыйЭлемент.Имя = ЭлементСписка.name;
							НовыйЭлемент.Страна = ЭлементСписка.country;
						КонецЦикла;
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	ДоступныеТипы.ID,
							|	ДоступныеТипы.Имя КАК Наименование,
							|	ДоступныеТипы.Страна КАК Страна
							|ПОМЕСТИТЬ вт
							|ИЗ
							|	&ДоступныеТипы КАК ДоступныеТипы
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ
							|	вт.ID КАК Идентификатор,
							|	вт.Страна КАК Страна,							
							|	вт.Наименование
							|ИЗ
							|	вт КАК вт
							|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭКОМ_ТипыНеструктДокументов КАК ЭКОМ_ТипыНеструктДокументов
							|		ПО вт.ID = ЭКОМ_ТипыНеструктДокументов.Идентификатор
							|ГДЕ
							|	ЭКОМ_ТипыНеструктДокументов.Ссылка ЕСТЬ NULL";
						
						Запрос.УстановитьПараметр("ДоступныеТипы", КлассификаторТаблица);
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							
							СправочникОбъект = Справочники.ЭКОМ_ТипыНеструктДокументов.СоздатьЭлемент();
							СправочникОбъект.Идентификатор = ВыборкаДетальныеЗаписи.Идентификатор;
							СправочникОбъект.Наименование = ВыборкаДетальныеЗаписи.Наименование; 
							СправочникОбъект.Страна = ВыборкаДетальныеЗаписи.Страна;
							СправочникОбъект.Записать();
							
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		ТекстЛогаСобытий = "Элементы справочника <<<Docrobot Типы неструктурированных документов>>> успешно обновлены!";
		ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий,
			Перечисления.ЭКОМ_УровниЛогирования.Информация, "Обновить справочник CONDRA через GIT");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		
	КонецЕсли;
	
КонецПроцедуры // ОбновитьСправочники()
