#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение сведений 
// о нормах амортизации групп ФА
//
Процедура НачальноеЗаполнение() Экспорт
	
	СоответствиеГруппФАИСтавок = Новый Соответствие;
		
	// Первая группа со ставкой 10%
	СоответствиеГруппФАИСтавок.Вставить(Перечисления.АмортизационныеГруппы.ПерваяГруппа, 10);
	// Вторая группа со ставкой 25%
	СоответствиеГруппФАИСтавок.Вставить(Перечисления.АмортизационныеГруппы.ВтораяГруппа, 25);
	// Третья группа со ставкой 40%
	СоответствиеГруппФАИСтавок.Вставить(Перечисления.АмортизационныеГруппы.ТретьяГруппа, 40);
	// Четвертая группа со ставкой 15%
	СоответствиеГруппФАИСтавок.Вставить(Перечисления.АмортизационныеГруппы.ЧетвертаяГруппа, 15);
	
	НаборЗаписей = РегистрыСведений.СведенияОГруппахФиксированныхАктивов.СоздатьНаборЗаписей();	
	
	ОтборПериод 			   = НаборЗаписей.Отбор.Период;
	ОтборАмортизационнаяГруппа = НаборЗаписей.Отбор.АмортизационнаяГруппа;
	
	Для Каждого ДанныеГруппФАИСтавок Из СоответствиеГруппФАИСтавок Цикл
		ОтборПериод.Установить('20150101');
		ОтборАмортизационнаяГруппа.Установить(ДанныеГруппФАИСтавок.Ключ);
		НаборЗаписей.Очистить();
		
		Запись = НаборЗаписей.Добавить();
		Запись.Период = '20150101';
		Запись.АмортизационнаяГруппа = ДанныеГруппФАИСтавок.Ключ;
		Запись.ПредельнаяНормаАмортизации  = ДанныеГруппФАИСтавок.Значение;
		Запись.ПрименяемаяНормаАмортизации = ДанныеГруппФАИСтавок.Значение;
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЦикла;                             		
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
