#Область ПрограммныйИнтерфейс

Функция ПолучитьНастройки() Экспорт
	
	Результат	= ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		ВладелецНастроек(), "Настройки");
		
	Возврат Результат;
	
КонецФункции

Процедура СохранитьНастройки(ПроцентОплаты, Скидка, ТаблицаНачисления) Экспорт
	
	Результат	= Новый Соответствие;
	Результат.Вставить(Скидка, Новый Структура("ПроцентОплаты, ТаблицаНачисления", 
		ПроцентОплаты, ТаблицаНачисления));
		
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ВладелецНастроек(), 
		Результат, "Настройки");
	
КонецПроцедуры

Процедура РассчитатьСкидкиОптовыхБонусов(Объект, ПримененныеСкидкиНаценки) Экспорт
	
	Настройки	= ПолучитьНастройки();
	Если НЕ ЗначениеЗаполнено(Настройки) Тогда
		Возврат;
	КонецЕсли;
	
	МассивКоэффициентов = Новый Массив;
	Для Каждого Строка Из ПримененныеСкидкиНаценки.ТаблицаСкидкиНаценки Цикл
		Если Настройки[Строка.СкидкаНаценка] <> Неопределено Тогда
			МассивКоэффициентов.Добавить(Строка.Сумма);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивКоэффициентов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	СуммаНачисленнойСкидки	= ПолучитьСуммуНачисленнойСкидки(Объект, Настройки);	
	
КонецПроцедуры

Функция ПолучитьСуммуНачисленнойСкидки(Объект, Настройки)
	
	Запрос	= Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыСКлиентамиОбороты.СуммаРасход КАК СуммаОплаты
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Обороты(&НачалоПредМесяца, &КонецПредМесяца, Регистратор, АналитикаУчетаПоПартнерам.Партнер = &Партнер) КАК РасчетыСКлиентамиОбороты
	|ГДЕ
	|	(РасчетыСКлиентамиОбороты.Регистратор ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств
	|			ИЛИ РасчетыСКлиентамиОбороты.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыручкаИСебестоимостьПродажОбороты.СуммаАвтоматическойСкидкиОборот КАК СуммаСкидки
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&НачалоТекМесяца, &КонецТекМесяца, Период, АналитикаУчетаПоПартнерам.Партнер = &Партнер) КАК ВыручкаИСебестоимостьПродажОбороты"
	;
	
	
	
КонецФункции

Функция ВладелецНастроек() Экспорт
	
	Возврат "Настройки оптовых бонусов";
	
КонецФункции

#КонецОбласти
