#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует набор параметров, задающих флаги выполнения дополнительных действий над сущностями, обрабатываемыми
// в процессе формирования отчета.
//
// Возвращаемое значение:
//   Структура   - флаги, задающие необходимость дополнительных действий.
//
Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	
	Структура = Новый Структура;
	Структура.Вставить("ИспользоватьПередКомпоновкойМакета", Истина);
	Структура.Вставить("ИспользоватьПриВыводеЗаголовка",     Истина);
	Структура.Вставить("ИспользоватьДанныеРасшифровки",      Истина);
	Структура.Вставить("ИспользоватьПослеВыводаРезультата",  Истина);
	Возврат Структура;
	
КонецФункции

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут.
//
Процедура ПередКомпоновкойМакета(ПараметрыОтчета, Схема, КомпоновщикНастроек) Экспорт
	
	БухгалтерскиеОтчетыВызовСервера.УстановитьПараметрОрганизация(КомпоновщикНастроек, ПараметрыОтчета.ОрганизацияРасшифровки);
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", НачалоДня(ПараметрыОтчета.НачалоПериода));
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода",  КонецДня(ПараметрыОтчета.КонецПериода));
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачалоГода",    ПараметрыОтчета.НачалоГода);
	
	// Схемы расшифровок содержат запасную строку с обозначением периода
	ПредставлениеПериода = ПараметрыОтчета.ПредставлениеПериода;
	СправкиРасчеты.ДополнитьПериодОтчетаПримечанием(ПредставлениеПериода, ПараметрыОтчета);
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ПредставлениеПериода", ПредставлениеПериода);
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек,
		"Период",
		Новый Граница(КонецДня(ПараметрыОтчета.КонецПериода), 
		ВидГраницы.Включая));
		
	Если ПараметрыОтчета.ТолькоОшибки Тогда	
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(КомпоновщикНастроек, "Контроль", , ВидСравненияКомпоновкиДанных.Заполнено);
	КонецЕсли;
	
КонецПроцедуры

// В процедуре выводится информация о расширенном налоговом периоде
//
Процедура ПослеВыводаРезультата(ПараметрыОтчета, Результат) Экспорт
	
	Если СправкиРасчеты.ТребуетсяДополнитьПериодОтчетаПримечанием(ПараметрыОтчета) Тогда
		
		СправкиРасчеты.ДобавитьПримечание(Результат, ПараметрыОтчета.ИнформацияНалоговыйПериод);
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует текст заголовка отчета, включающий контекст его формирования.
//
Функция ПолучитьТекстЗаголовка(ПараметрыОтчета, ОрганизацияВНачале = Истина) Экспорт 
	
	Возврат ЗаголовокОтчета(ПараметрыОтчета, Истина);
	
КонецФункции	

// Выводит макет заголовка расшифровки.
//
Процедура ПриВыводеЗаголовка(ПараметрыОтчета, КомпоновщикНастроек, Результат) Экспорт 
	
	Макет = Отчеты.АнализСостоянияНалоговогоУчетаПоНалогуНаПрибыль.ПолучитьМакет("МакетЗаголовкаРасшифровки");
	
	ОбластьОтчета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьОтчета.Параметры.ТекстЗаголовка = ПолучитьТекстЗаголовка(ПараметрыОтчета);
	
	Результат.Вывести(ОбластьОтчета);
	
КонецПроцедуры

// Для формирования отчета в фоновом задании.
//
// Параметры:
//  ПараметрыОтчета - Структура - см. ПодготовитьПараметрыОтчета() в ФормаОтчета.
//  АдресХранилища - Строка - адрес временного хранилища, куда будет помещен результат формирования отчета.
//
Процедура СформироватьОтчет(Знач ПараметрыОтчета, АдресХранилища) Экспорт
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументСхемы = ПолучитьМакет(ПараметрыОтчета.ИмяСхемы);
	
	Расшифровка = ПараметрыОтчета.Расшифровка;
	
	КэшПараметровОтчета = ПараметрыОтчета.КэшПараметровОтчета;
	НомерТекущейСхемы = ПараметрыОтчета.НомерТекущейСхемы;
	
	Если НЕ КэшПараметровОтчета.Свойство("КэшМакетов") Тогда	
		КэшПараметровОтчета.Вставить("КэшМакетов"     , Новый Структура);
		КэшПараметровОтчета.Вставить("ИсторияОткрытий", Новый СписокЗначений);		
	КонецЕсли;
	
	Если ТипЗнч(Расшифровка) = Тип("Соответствие") Тогда
		ПараметрыОтчета.ОрганизацияРасшифровки = Расшифровка.Получить("Организация");
		
		СтруктураВП = Новый Структура;
		СтруктураВП.Вставить("НомерТекущейСхемы", НомерТекущейСхемы);
		СтруктураВП = ПолучитьСтруктуруВременныхПараметров(ПараметрыОтчета, НомерТекущейСхемы, СтруктураВП);
	Иначе		
		СтруктураВП = ПолучитьСтруктуруВременныхПараметров(ПараметрыОтчета, НомерТекущейСхемы);
	КонецЕсли;
	
	СтруктураВП.Вставить("НомерТекущейСхемы",	НомерТекущейСхемы);
	КэшПараметровОтчета.Вставить("СтруктураВП",	СтруктураВП);
	
	// установим формируемую схему
	Если НомерТекущейСхемы = 0 ИЛИ НомерТекущейСхемы = 20 Тогда		
		СформироватьРасчетНалогаНаПрибыль(ПараметрыОтчета, ДокументСхемы, КэшПараметровОтчета);		
	ИначеЕсли НомерТекущейСхемы = 1 ИЛИ НомерТекущейСхемы = 21 Тогда		
		СформироватьДоходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета);		                                             
	ИначеЕсли НомерТекущейСхемы = 2 ИЛИ НомерТекущейСхемы = 22 Тогда		
		СформироватьРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета);		
	ИначеЕсли НомерТекущейСхемы = 3 ИЛИ НомерТекущейСхемы = 23 Тогда		
		СформироватьРасходыПоТоварам(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета);		
	ИначеЕсли НомерТекущейСхемы = 4 ИЛИ НомерТекущейСхемы = 24 Тогда			
		СформироватьРасходыПроизводства(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета);		
	ИначеЕсли НомерТекущейСхемы = 5 ИЛИ НомерТекущейСхемы = 25 Тогда		
		СформироватьТранспортныеРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета);		
	ИначеЕсли НомерТекущейСхемы = 6 ИЛИ НомерТекущейСхемы = 26 Тогда		
		СформироватьКосвенныеРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета);		
	ИначеЕсли НомерТекущейСхемы = 7 ИЛИ НомерТекущейСхемы = 27 Тогда		
		СформироватьПрочиеРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета);		
	ИначеЕсли НомерТекущейСхемы = 8 ИЛИ НомерТекущейСхемы = 28 Тогда		
		СформироватьРаспределяемыеРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета);		
	ИначеЕсли НомерТекущейСхемы = 9 ИЛИ НомерТекущейСхемы = 29 Тогда		
		СформироватьСтоимостьЗапасов(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета);		
	ИначеЕсли НомерТекущейСхемы = 10 ИЛИ НомерТекущейСхемы = 30 Тогда		
		СформироватьОбычныеРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета);		
	КонецЕсли;

	Если Не ПустаяСтрока(ПараметрыОтчета.ИнформацияНалоговыйПериод) Тогда
		ЭлементНазваниеОрганизации = ДокументСхемы.ЭлементыГрафическойСхемы.Найти("НазваниеОрганизации");
		Если ЭлементНазваниеОрганизации <> Неопределено Тогда
			ЭлементНазваниеОрганизации.Подсказка = ПараметрыОтчета.ИнформацияНалоговыйПериод;
		КонецЕсли;
	КонецЕсли;
	
	КэшПараметровОтчета.ИсторияОткрытий.Добавить(НомерТекущейСхемы);
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("КэшПараметровОтчета", КэшПараметровОтчета);
	РезультатВыполнения.Вставить("РезультатСхемы"     , ДокументСхемы);
	РезультатВыполнения.Вставить("Результат"          , ДокументРезультат);
	
	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
	
КонецПроцедуры

// Для формирования расшифровки в фоновом задании.
//
// Параметры:
//  ПараметрыОтчета - Структура - см. ПодготовитьПараметрыОтчета() в ФормаОтчета.
//  АдресХранилища - Строка - адрес временного хранилища, куда будет помещен результат формирования отчета.
//
Процедура СформироватьРасшифровку(Знач ПараметрыОтчета, АдресХранилища) Экспорт
	
	КэшПараметровОтчета = ПараметрыОтчета.КэшПараметровОтчета;
	
	ПараметрыОтчета.ОрганизацияРасшифровки = КэшПараметровОтчета.ТекущаяРасшифровка["Организация"];
	
	СхемаКомпоновкиДанных = ПолучитьМакет(КэшПараметровОтчета.ТекущаяРасшифровка["НомерТекущейСхемы"]);
	
	НеРазворачиватьПоРегистраторам = КэшПараметровОтчета.ТекущаяРасшифровка["НеРазворачиватьПоРегистраторам"];
	Если НеРазворачиватьПоРегистраторам = Истина Тогда
		ВариантыНастроек = СхемаКомпоновкиДанных.ВариантыНастроек.Найти("БезРегистратора");
	Иначе
		ВариантыНастроек = СхемаКомпоновкиДанных.ВариантыНастроек.Найти("Основной");
	КонецЕсли;
	
	Если ВариантыНастроек = Неопределено Тогда
		ВариантНастройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	Иначе
		ВариантНастройки = ВариантыНастроек.Настройки;
	КонецЕсли;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(ВариантНастройки);
	
	КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ВыводитьПодвал");
	КомпоновщикНастроек.Настройки.ДополнительныеСвойства.ВыводитьПодвал = Ложь;
	
	ПараметрыОтчета.Вставить("СхемаКомпоновкиДанных",     СхемаКомпоновкиДанных);
	ПараметрыОтчета.Вставить("НастройкиКомпоновкиДанных", КомпоновщикНастроек.ПолучитьНастройки());

	ВременныйАдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	БухгалтерскиеОтчетыВызовСервера.СформироватьОтчет(ПараметрыОтчета, ВременныйАдресХранилища);
	РезультатВыполнения = ПолучитьИзВременногоХранилища(ВременныйАдресХранилища);
	ДокументРезультат   = РезультатВыполнения.Результат;
	
	ДанныеРасшифровки   = "";
	Если РезультатВыполнения.Свойство("ДанныеРасшифровки") Тогда
		ДанныеРасшифровки = РезультатВыполнения.ДанныеРасшифровки;
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
	
КонецПроцедуры

// Устанавливает оформление элемента схемы при невыполнении правила БУ = НУ + ПР + ВР.
//
// Параметры:
//  ЭлементыСхемы - ЭлементыГрафическойСхемы декорации формы отчета.
//
Процедура ВывестиЛегенду(ЭлементыСхемы) Экспорт 
	
	ЭлементыСхемы.Легенда1.ЦветРамки 	= WebЦвета.Красный;
	ЭлементыСхемы.Легенда1.Фигура		= ФигурыГрафическойСхемы.Блок;
	ЭлементыСхемы.Легенда2.Наименование	= НСтр("ru = 'Не выполняется правило БУ = НУ + ПР + ВР'");
	
КонецПроцедуры

// Для определения статуса выполенния регламентных операций в фоновом задании.
//
// Параметры:
//  ПараметрыОтчета - Структура - см. ПодготовитьПараметрыОтчета() в ФормаОтчета.
//  АдресХранилища - Строка - адрес временного хранилища, куда будет помещен результат определения состояний.
//
Процедура ОпределитьСтатусРегламентныхЗаданийФоновоеЗадание(Параметры, АдресХранилища) Экспорт
	
	НезакрытыйПериодФинансовыйРезультат = Неопределено;

	СписокОрганизаций = Новый Массив;
	СписокОрганизаций.Добавить(Параметры[0].Организация);
	
	Результат = Новый Структура;
	Результат.Вставить("Период", КонецМесяца(Параметры[0].КонецПериода)); 
	Результат.Вставить("СостояниеФинансовыйРезультат", Перечисления.СостоянияОперацийЗакрытияМесяца.НеТребуется); 
	
		
	Пока Результат.Период > НачалоМесяца(Параметры[0].НачалоПериода) Цикл
			
		Результат.СостояниеФинансовыйРезультат = ЗакрытиеМесяцаСервер.ОпределитьСостояниеЭтаповРасчета(
			Перечисления.ОперацииЗакрытияМесяца.ФормированиеФинансовогоРезультата,
			Результат.Период,
			СписокОрганизаций);
		
		Если Результат.СостояниеФинансовыйРезультат = Перечисления.СостоянияОперацийЗакрытияМесяца.ВыполненоСОшибками
			Или Результат.СостояниеФинансовыйРезультат = Перечисления.СостоянияОперацийЗакрытияМесяца.НеВыполнено
			Или Результат.СостояниеФинансовыйРезультат = Перечисления.СостоянияОперацийЗакрытияМесяца.ОжидаетВыполненияПредыдущихОпераций Тогда
			
			Прервать;
			
		КонецЕсли;
		
		Результат.Период = ДобавитьМесяц(Результат.Период, -1);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСтруктуруВременныхПараметров(ПараметрыОтчета, НомерТекущейСхемы, СтруктураВП = Неопределено)
	
	Если СтруктураВП = Неопределено Тогда
		СтруктураВП = Новый Структура;
		
		Если НомерТекущейСхемы > 20 И ЗначениеЗаполнено(ПараметрыОтчета.Организация.ГоловнаяОрганизация) Тогда
			ПараметрыОтчета.ОрганизацияРасшифровки = ПараметрыОтчета.Организация.ГоловнаяОрганизация;	
		Иначе
			ПараметрыОтчета.ОрганизацияРасшифровки = ПараметрыОтчета.Организация;
		КонецЕсли;	
	КонецЕсли;
	
	СтруктураВП.Вставить("ГоловнаяОрганизация", ПараметрыОтчета.ОрганизацияРасшифровки.ГоловнаяОрганизация);
	СтруктураВП.Вставить("ПоказыватьЛегенду",   Ложь);	
	
	Возврат СтруктураВП;  
	
КонецФункции

Процедура СформироватьРасчетНалогаНаПрибыль(ПараметрыОтчета, Документ, КэшПараметровОтчета)
	
	СтруктураВП = КэшПараметровОтчета.СтруктураВП;
	
	Документ 		  = ПолучитьМакет("РасчетНалогаНаПрибыль");
	ЭлементыСхемы 	  = Документ.ЭлементыГрафическойСхемы;
	РасшифровкаМакета = Новый Структура;
	НастройкаРамок    = Новый Структура;
	
	ПоддержкаБУ18  = УчетнаяПолитика.ПоддержкаПБУ18(ПараметрыОтчета.ОрганизацияРасшифровки, КонецДня(ПараметрыОтчета.КонецПериода));
	НалогНаПрибыль = ?(ПоддержкаБУ18, ПланыСчетов.Хозрасчетный.РасчетНалогаНаПрибыль, 
		ПланыСчетов.Хозрасчетный.РасчетыСБюджетом);
		
		
	РасчетСтавкиНалогаНаПрибыль = НалоговыйУчетОбособленныхПодразделений.ВыполнитьЗапросРасчетСтавкиНалогаНаПрибыльЗаМесяц(ПараметрыОтчета.ОрганизацияРасшифровки, КонецДня(ПараметрыОтчета.КонецПериода));
	
	СтрокаСтавки = Неопределено;
	Если РасчетСтавкиНалогаНаПрибыль <> Неопределено Тогда	
		ТаблицаСтавок = РасчетСтавкиНалогаНаПрибыль.Выгрузить();
		СтрокаСтавки = ТаблицаСтавок.Найти(ПараметрыОтчета.ОрганизацияРасшифровки,"Организация");
	КонецЕсли;
	
	Если СтрокаСтавки = Неопределено Тогда
		СтавкаНалогаФБ = НалоговыйУчет.НалоговаяСтавкаФедеральныйБюджет(КонецДня(ПараметрыОтчета.КонецПериода),ПараметрыОтчета.ОрганизацияРасшифровки);
		СтавкаНалогаРБ = НалоговыйУчет.НалоговаяСтавкаРегиональныйБюджет(КонецДня(ПараметрыОтчета.КонецПериода), ПараметрыОтчета.ОрганизацияРасшифровки);
		СтавкаНалогаНаПрибыль = Окр((СтавкаНалогаФБ + СтавкаНалогаРБ) * 100, 2);
	Иначе
		СтавкаНалогаНаПрибыль = Окр(СтрокаСтавки.Ставка,6);
	КонецЕсли;
	
	СписокОП = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки);
	
	Счет99_2Хозрасчетный = ?(ПоддержкаБУ18, ПланыСчетов.Хозрасчетный.ПрибылиИУбытки_НалогНаПрибыль, 
		ПланыСчетов.Хозрасчетный.ПрибылиИУбыткиНеЕНВД);
		
	ОрганизацияГоловная = ?(ПараметрыОтчета.ВключатьОбособленныеПодразделения, СтруктураВП.ГоловнаяОрганизация,
		ПараметрыОтчета.ОрганизацияРасшифровки);
		
	Запрос = Новый Запрос;	// Запрос переиспользуется. Для одного из выполнений запроса ниже устанавливается МенеджерВременныхТаблиц
	Запрос.УстановитьПараметр("Счет99_2Хозрасчетный",	   Счет99_2Хозрасчетный);
	Запрос.УстановитьПараметр("ОрганизацияГоловная",  	   ОрганизацияГоловная);
	Запрос.УстановитьПараметр("НачалоПериода",     	       ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",     	       КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Организация",         	   СписокОП);
	Запрос.УстановитьПараметр("НалогНаПрибыль",			   НалогНаПрибыль);
	Запрос.УстановитьПараметр("СтавкаНалогаНаПрибыль",	   СтавкаНалогаНаПрибыль);
	
	// Доходы
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт КАК СуммаБУ,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт - ХозрасчетныйОбороты.СуммаНУОборотДт КАК СуммаНУ,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт - ХозрасчетныйОбороты.СуммаПРОборотДт КАК СуммаПР,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт - ХозрасчетныйОбороты.СуммаВРОборотДт КАК СуммаВР,
	|	ХозрасчетныйОбороты.Организация КАК Организация
	|ПОМЕСТИТЬ ВТДоходы9091
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Доходы)), , Организация В (&Организация), , ) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт КАК СуммаБУ,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт - ХозрасчетныйОбороты.СуммаНУОборотДт КАК СуммаНУ,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт - ХозрасчетныйОбороты.СуммаПРОборотДт КАК СуммаПР,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт - ХозрасчетныйОбороты.СуммаВРОборотДт КАК СуммаВР,
	|	ХозрасчетныйОбороты.Организация КАК Организация
	|ПОМЕСТИТЬ ВТДоходы9091_Итог
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходОтРеализацииПродукцииИОказанияУслуг_)), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы), Организация В (&Организация), НЕ КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИтоговаяПрибыльИтоговыйУбыток), ) КАК ХозрасчетныйОбороты
	|ГДЕ
	|	(ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт <> 0
	|			ИЛИ ХозрасчетныйОбороты.СуммаНУОборот <> 0
	|			ИЛИ ХозрасчетныйОбороты.СуммаПРОборот <> 0
	|			ИЛИ ХозрасчетныйОбороты.СуммаВРОборот <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТДоходы9091.СуммаБУ,
	|	ВТДоходы9091.СуммаНУ,
	|	ВТДоходы9091.СуммаПР,
	|	ВТДоходы9091.СуммаВР,
	|	ВТДоходы9091.Организация
	|ИЗ
	|	ВТДоходы9091 КАК ВТДоходы9091
	|ГДЕ
	|	(ВТДоходы9091.СуммаБУ <> 0
	|			ИЛИ ВТДоходы9091.СуммаНУ <> 0
	|			ИЛИ ВТДоходы9091.СуммаПР <> 0
	|			ИЛИ ВТДоходы9091.СуммаВР <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт КАК ДоходыБУ,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт - ХозрасчетныйОбороты.СуммаНУОборотДт КАК ДоходыНУ,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт - ХозрасчетныйОбороты.СуммаПРОборотДт КАК ДоходыПР,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт - ХозрасчетныйОбороты.СуммаВРОборотДт КАК ДоходыВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходОтРеализацииПродукцииИОказанияУслуг_)), , Организация В (&Организация), НЕ КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИтоговаяПрибыльИтоговыйУбыток), ) КАК ХозрасчетныйОбороты
	|ГДЕ
	|	(ХозрасчетныйОбороты.СуммаОборот <> 0
	|			ИЛИ ХозрасчетныйОбороты.СуммаНУОборот <> 0
	|			ИЛИ ХозрасчетныйОбороты.СуммаПРОборот <> 0
	|			ИЛИ ХозрасчетныйОбороты.СуммаВРОборот <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Доходы))
	|				И НЕ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходОтРеализацииПродукцииИОказанияУслуг_)),
	|			,
	|			Организация В (&Организация),
	|			,
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, НЕ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Доходы)), , Организация В (&Организация), , ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТДоходы9091_Итог.Организация,
	|	ВТДоходы9091_Итог.СуммаБУ,
	|	ВТДоходы9091_Итог.СуммаНУ,
	|	ВТДоходы9091_Итог.СуммаПР,
	|	ВТДоходы9091_Итог.СуммаВР
	|ИЗ
	|	ВТДоходы9091_Итог КАК ВТДоходы9091_Итог
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Доходы))
	|				И НЕ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходОтРеализацииПродукцииИОказанияУслуг_)),
	|			,
	|			Организация В (&Организация),
	|			,
	|			) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТХозрасчетный.Организация КАК Организация,
	|	СУММА(ЕСТЬNULL(ВТХозрасчетный.ДоходыБУ, 0)) КАК ДоходыБУ,
	|	СУММА(ЕСТЬNULL(ВТХозрасчетный.ДоходыНУ, 0)) КАК ДоходыНУ,
	|	СУММА(ЕСТЬNULL(ВТХозрасчетный.ДоходыПР, 0)) КАК ДоходыПР,
	|	СУММА(ЕСТЬNULL(ВТХозрасчетный.ДоходыВР, 0)) КАК ДоходыВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТХозрасчетный.Организация
	|ИТОГИ ПО
	|	ОБЩИЕ";
	
	Результат 	  = Запрос.Выполнить();
	ВыборкаДоходы = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ОБЩИЕ");
	ЕстьДоходы 	  = ВыборкаДоходы.Следующий();
	
	Если ЕстьДоходы Тогда
		
		ЭлементыСхемы.ДоходыБУ.Наименование = Формат(ВыборкаДоходы.ДоходыБУ, "ЧЦ=20; ЧДЦ=0; ЧРГ=' '");
		ЭлементыСхемы.ДоходыНУ.Наименование = Формат(ВыборкаДоходы.ДоходыНУ, "ЧЦ=20; ЧДЦ=0; ЧРГ=' '");
		ЭлементыСхемы.ДоходыПР.Наименование = Формат(ВыборкаДоходы.ДоходыПР, "ЧЦ=20; ЧДЦ=0; ЧРГ=' '");
		ЭлементыСхемы.ДоходыВР.Наименование = Формат(ВыборкаДоходы.ДоходыВР, "ЧЦ=20; ЧДЦ=0; ЧРГ=' '");
		РасшифровкаМакета.Вставить("РасшифровкаДоходы",  ПереходКСхеме(ПараметрыОтчета, 1, СтруктураВП, Истина));
		
	КонецЕсли;
	
	// Расходы
	МенеджерВременныхТаблицДолиЕНВД = Новый МенеджерВременныхТаблиц;
	Налоговыйучет.СоздатьДолиЕНВД(
		МенеджерВременныхТаблицДолиЕНВД,
		Запрос.Параметры.НачалоПериода,
		Запрос.Параметры.КонецПериода,
		Запрос.Параметры.Организация); 
		
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблицДолиЕНВД; // Очищается после выполнения запроса
		
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ХозрасчетныйОбороты.СуммаОборотКт КАК СуммаБУ,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт КАК СуммаНУ,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт КАК СуммаПР,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт КАК СуммаВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СырьеИМатериалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Товары), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеПроизводство_Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПереданныеВПереработку), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПереданная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СпецоснасткаИСпецодеждаВЭксплуатации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗаготовлениеИПриобретениеМЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиПрошлыхЛет), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОтложенныеНалоговыеАктивыПоКорпоративномуПодоходномуНалогу), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МонтажОборудования), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты)), , Организация В (&Организация), КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованнойПродукцииИОказанныхУслуг), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВыбытиюАктивов)), ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованнойПродукцииИОказанныхУслуг_)), , Организация В (&Организация), КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства_)), ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	ХозрасчетныйОбороты.СуммаОборотДт - ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт - ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт - ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт - ХозрасчетныйОбороты.СуммаВРОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Расходы))
	|				И НЕ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованнойПродукцииИОказанныхУслуг)),
	|			,
	|			Организация В (&Организация),
	|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИтоговаяПрибыльИтоговыйУбыток)),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	ХозрасчетныйОбороты.СуммаОборотДт - ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт - ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт - ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт - ХозрасчетныйОбороты.СуммаВРОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Расходы))
	|				И НЕ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованнойПродукцииИОказанныхУслуг)),
	|			,
	|			Организация В (&Организация),
	|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИтоговаяПрибыльИтоговыйУбыток)),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВыбытиюАктивов)), , Организация В (&Организация), КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СырьеИМатериалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеПроизводство_Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПереданныеВПереработку), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПереданная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СпецоснасткаИСпецодеждаВЭксплуатации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗаготовлениеИПриобретениеМЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГруппаНаВыбытиеДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРастения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеЖивотные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиПрошлыхЛет), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованноеИмущество_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Растения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Животные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РазведочныеИОценочныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Гудвилл), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбесценениеГудвилла), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивыОрганизации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованныеНематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОтложенныеНалоговыеАктивыПоКорпоративномуПодоходномуНалогу), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеСтроительство), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МонтажОборудования), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КапитальныйРемонтОС), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты)), ) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТХозрасчетный.Организация КАК Организация,
	|	СУММА(ВТХозрасчетный.СуммаБУ) КАК РасходыБУ,
	|	СУММА(ВТХозрасчетный.СуммаНУ) КАК РасходыНУ,
	|	СУММА(ВТХозрасчетный.СуммаПР) КАК РасходыПР,
	|	СУММА(ВТХозрасчетный.СуммаВР) КАК РасходыВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТХозрасчетный.Организация
	|ИТОГИ ПО
	|	ОБЩИЕ";
	
	Результат 		= Запрос.Выполнить();
	МенеджерВременныхТаблицДолиЕНВД.Закрыть();
	Запрос.МенеджерВременныхТаблиц = Неопределено;
	
	ВыборкаРасходы 	= Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ОБЩИЕ");
	
	ЕстьРасходы = ВыборкаРасходы.Следующий();
	
	Если ЕстьРасходы Тогда
		
		ЗаполнитьСхему(ЭлементыСхемы, ВыборкаРасходы, Результат.Колонки);
		РасшифровкаМакета.Вставить("РасшифровкаРасходы", ПереходКСхеме(ПараметрыОтчета, 2, СтруктураВП, Истина));
		
	КонецЕсли;
	
	// Прибыль
	ПараметрыДляРамки = Новый Соответствие;
	ПараметрыДляРамки.Вставить("БазаБУ", ?(ЕстьДоходы,ВыборкаДоходы.ДоходыБУ,0) - ?(ЕстьРасходы,ВыборкаРасходы.РасходыБУ,0));
	ЭлементыСхемы.БазаБУ.Наименование = Формат(ПараметрыДляРамки["БазаБУ"], "ЧЦ=20; ЧДЦ=0; ЧРГ=' '");
	ПараметрыДляРамки.Вставить("БазаНУ", ?(ЕстьДоходы,ВыборкаДоходы.ДоходыНУ,0) - ?(ЕстьРасходы,ВыборкаРасходы.РасходыНУ,0));
	ЭлементыСхемы.БазаНУ.Наименование = Формат(ПараметрыДляРамки["БазаНУ"], "ЧЦ=20; ЧДЦ=0; ЧРГ=' '");
	ПараметрыДляРамки.Вставить("БазаПР", ?(ЕстьДоходы,ВыборкаДоходы.ДоходыПР,0) - ?(ЕстьРасходы,ВыборкаРасходы.РасходыПР,0));
	ЭлементыСхемы.БазаПР.Наименование = Формат(ПараметрыДляРамки["БазаПР"], "ЧЦ=20; ЧДЦ=0; ЧРГ=' '");
	ПараметрыДляРамки.Вставить("БазаВР", ?(ЕстьДоходы,ВыборкаДоходы.ДоходыВР,0) - ?(ЕстьРасходы,ВыборкаРасходы.РасходыВР,0));
	ЭлементыСхемы.БазаВР.Наименование = Формат(ПараметрыДляРамки["БазаВР"], "ЧЦ=20; ЧДЦ=0; ЧРГ=' '");
	
	НастроитьРамку(ПараметрыДляРамки, "База", ЭлементыСхемы.БазаРасшифровка, СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	
	// Ставка налога
	ЗапросСтавка = Новый Запрос;
	ЗапросСтавка.Текст = "ВЫБРАТЬ
	|	СтавкиНалогаНаПрибыльДляВсехОрганизацийСрезПоследних.СтавкаФБ КАК Ставка
	|ИЗ
	|	РегистрСведений.СтавкиНалогаНаПрибыльДляВсехОрганизаций.СрезПоследних(&Дата, ) КАК СтавкиНалогаНаПрибыльДляВсехОрганизацийСрезПоследних";
	
	ЗапросСтавка.УстановитьПараметр("Дата", КонецДня(ПараметрыОтчета.КонецПериода));
	
	Выборка = ЗапросСтавка.Выполнить().Выбрать();
	
	СтавкаНалога = 0;
	Пока Выборка.Следующий() Цикл
		СтавкаНалога = Выборка.Ставка;
	КонецЦикла;
	
	ПрибыльБУ = ?(ЕстьДоходы,ВыборкаДоходы.ДоходыБУ,0) - ?(ЕстьРасходы,ВыборкаРасходы.РасходыБУ,0);
	НалогНаПрибыльПоБУ = ПрибыльБУ * СтавкаНалога / 100;
	
	ПрибыльНУ = ?(ЕстьДоходы,ВыборкаДоходы.ДоходыНУ,0) - ?(ЕстьРасходы,ВыборкаРасходы.РасходыНУ,0);
	НалогНаПрибыльПоНУ = ПрибыльНУ * СтавкаНалога / 100;
	
	ЗапросКорректировка = Новый Запрос;
	
	ЗапросКорректировка.Текст = "ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт КАК Дт2810ПР,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт КАК Дт2810ВР,
	|	0 КАК Кт4310ПР,
	|	0 КАК Кт4310ВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОтложенныеНалоговыеАктивыПоКорпоративномуПодоходномуНалогу)), , Организация = &ОрганизацияГоловная, , ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОтложенныеНалоговыеОбязательстваПоКорпоративномуПодоходномуНалогу)), , Организация = &ОрганизацияГоловная, , ) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТХозрасчетный.Дт2810ПР - ВТХозрасчетный.Кт4310ПР) КАК СуммаПР,
	|	СУММА(ВТХозрасчетный.Дт2810ВР - ВТХозрасчетный.Кт4310ВР) КАК СуммаВР,
	|	ВТХозрасчетный.Организация КАК Организация
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТХозрасчетный.Организация";
	
	ЗапросКорректировка.УстановитьПараметр("ОрганизацияГоловная",  	   ОрганизацияГоловная);
	ЗапросКорректировка.УстановитьПараметр("НачалоПериода",     	   ПараметрыОтчета.НачалоПериода);
	ЗапросКорректировка.УстановитьПараметр("КонецПериода",     	       КонецДня(ПараметрыОтчета.КонецПериода));
	
	ВыборкаКорректировка = ЗапросКорректировка.Выполнить().Выбрать();
	
	КорректировкаСуммаПР = 0;
	КорректировкаСуммаВР = 0;
	
	Пока ВыборкаКорректировка.Следующий() Цикл
		КорректировкаСуммаПР = - ВыборкаКорректировка.СуммаПР;
		КорректировкаСуммаВР = - ВыборкаКорректировка.СуммаВР;
	КонецЦикла;

	НалогБУСКорректировкой = НалогНаПрибыльПоБУ + КорректировкаСуммаПР + КорректировкаСуммаВР;
		
	ЭлементыСхемы.НалогБУ.Наименование    = Формат(НалогНаПрибыльПоБУ,    "ЧЦ=20; ЧДЦ=0; ЧРГ=' '");
	ЭлементыСхемы.НалогНУ.Наименование    = Формат(НалогНаПрибыльПоНУ,    "ЧЦ=20; ЧДЦ=0; ЧРГ=' '");
	ЭлементыСхемы.НалогПР.Наименование    = Формат(КорректировкаСуммаПР,    "ЧЦ=20; ЧДЦ=0; ЧРГ=' '");
	ЭлементыСхемы.НалогВР.Наименование    = Формат(КорректировкаСуммаВР,    "ЧЦ=20; ЧДЦ=0; ЧРГ=' '");
	ЭлементыСхемы.НалогБУКор.Наименование = Формат(НалогБУСКорректировкой, "ЧЦ=20; ЧДЦ=0; ЧРГ=' '");
	ЭлементыСхемы.СтавкаНалогаНаПрибыль.Наименование = Строка(СтавкаНалога) + "%";
	
	НастроитьРамку(ВыборкаДоходы,  "Доходы",  ЭлементыСхемы.РасшифровкаДоходы,  СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);		
	НастроитьРамку(ВыборкаРасходы, "Расходы", ЭлементыСхемы.РасшифровкаРасходы, СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	
	Если СтруктураВП.ПоказыватьЛегенду Тогда
		ВывестиЛегенду(ЭлементыСхемы);		
	КонецЕсли;
	
	ЭлементыСхемы.НазваниеОрганизации.Наименование = ЗаголовокОтчета(ПараметрыОтчета);
	
	// Сохраняем историю
	СохранитьИсториюСхемы(КэшПараметровОтчета, "РасчетНалогаНаПрибыль", РасшифровкаМакета, НастройкаРамок, ЭлементыСхемы);	
	
КонецПроцедуры

Процедура СформироватьДоходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета)
	
	СтруктураВП = КэшПараметровОтчета.СтруктураВП;
	
	РасшифровкаМакета = Новый Структура;
	НастройкаРамок    = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Организация",   ПараметрыОтчета.ОрганизацияРасшифровки);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт КАК СуммаБУ,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт - ХозрасчетныйОбороты.СуммаНУОборотДт КАК СуммаНУ,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт - ХозрасчетныйОбороты.СуммаПРОборотДт КАК СуммаПР,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт - ХозрасчетныйОбороты.СуммаВРОборотДт КАК СуммаВР,
	|	ХозрасчетныйОбороты.Организация КАК Организация
	|ПОМЕСТИТЬ ВТДоходы9091
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Доходы)), , Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт КАК СуммаБУ,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт - ХозрасчетныйОбороты.СуммаНУОборотДт КАК СуммаНУ,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт - ХозрасчетныйОбороты.СуммаПРОборотДт КАК СуммаПР,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт - ХозрасчетныйОбороты.СуммаВРОборотДт КАК СуммаВР,
	|	ХозрасчетныйОбороты.Организация КАК Организация
	|ПОМЕСТИТЬ ВТДоходы9091_Итог
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходОтРеализацииПродукцииИОказанияУслуг_)), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы), Организация = &Организация, НЕ КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИтоговаяПрибыльИтоговыйУбыток), ) КАК ХозрасчетныйОбороты
	|ГДЕ
	|	(ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт <> 0
	|			ИЛИ ХозрасчетныйОбороты.СуммаНУОборот <> 0
	|			ИЛИ ХозрасчетныйОбороты.СуммаПРОборот <> 0
	|			ИЛИ ХозрасчетныйОбороты.СуммаВРОборот <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТДоходы9091.СуммаБУ,
	|	ВТДоходы9091.СуммаНУ,
	|	ВТДоходы9091.СуммаПР,
	|	ВТДоходы9091.СуммаВР,
	|	ВТДоходы9091.Организация
	|ИЗ
	|	ВТДоходы9091 КАК ВТДоходы9091
	|ГДЕ
	|	(ВТДоходы9091.СуммаБУ <> 0
	|			ИЛИ ВТДоходы9091.СуммаНУ <> 0
	|			ИЛИ ВТДоходы9091.СуммаПР <> 0
	|			ИЛИ ВТДоходы9091.СуммаВР <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт КАК Доходы90БУ,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт - ХозрасчетныйОбороты.СуммаНУОборотДт КАК Доходы90НУ,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт - ХозрасчетныйОбороты.СуммаПРОборотДт КАК Доходы90ПР,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт - ХозрасчетныйОбороты.СуммаВРОборотДт КАК Доходы90ВР,
	|	0 КАК Доходы91УчБУ,
	|	0 КАК Доходы91УчНУ,
	|	0 КАК Доходы91УчПР,
	|	0 КАК Доходы91УчВР,
	|	0 КАК Доходы91НЕБУ,
	|	0 КАК Доходы91НЕНУ,
	|	0 КАК Доходы91НЕПР,
	|	0 КАК Доходы91НЕВР,
	|	0 КАК Доходы9091БУ,
	|	0 КАК Доходы9091НУ,
	|	0 КАК Доходы9091ПР,
	|	0 КАК Доходы9091ВР,
	|	0 КАК Доходы91БУ,
	|	0 КАК Доходы91НУ,
	|	0 КАК Доходы91ПР,
	|	0 КАК Доходы91ВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходОтРеализацииПродукцииИОказанияУслуг_)), , Организация = &Организация, НЕ КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИтоговаяПрибыльИтоговыйУбыток), ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Доходы))
	|				И НЕ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходОтРеализацииПродукцииИОказанияУслуг_)),
	|			,
	|			Организация = &Организация,
	|			,
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, НЕ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Доходы)), , Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТДоходы9091_Итог.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВТДоходы9091_Итог.СуммаБУ,
	|	ВТДоходы9091_Итог.СуммаНУ,
	|	ВТДоходы9091_Итог.СуммаПР,
	|	ВТДоходы9091_Итог.СуммаВР,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	ВТДоходы9091_Итог КАК ВТДоходы9091_Итог
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Доходы))
	|				И НЕ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходОтРеализацииПродукцииИОказанияУслуг_)),
	|			,
	|			Организация = &Организация,
	|			,
	|			) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТХозрасчетный.Организация КАК Организация,
	|	СУММА(ВТХозрасчетный.Доходы90БУ) КАК Доходы90БУ,
	|	СУММА(ВТХозрасчетный.Доходы90НУ) КАК Доходы90НУ,
	|	СУММА(ВТХозрасчетный.Доходы90ПР) КАК Доходы90ПР,
	|	СУММА(ВТХозрасчетный.Доходы90ВР) КАК Доходы90ВР,
	|	СУММА(ВТХозрасчетный.Доходы91УчБУ) КАК Доходы91УчБУ,
	|	СУММА(ВТХозрасчетный.Доходы91УчНУ) КАК Доходы91УчНУ,
	|	СУММА(ВТХозрасчетный.Доходы91УчПР) КАК Доходы91УчПР,
	|	СУММА(ВТХозрасчетный.Доходы91УчВР) КАК Доходы91УчВР,
	|	СУММА(ВТХозрасчетный.Доходы91НЕБУ) КАК Доходы91НЕБУ,
	|	СУММА(ВТХозрасчетный.Доходы91НЕНУ) КАК Доходы91НЕНУ,
	|	СУММА(ВТХозрасчетный.Доходы91НЕПР) КАК Доходы91НЕПР,
	|	СУММА(ВТХозрасчетный.Доходы91НЕВР) КАК Доходы91НЕВР,
	|	СУММА(ВТХозрасчетный.Доходы91БУ) КАК Доходы91БУ,
	|	СУММА(ВТХозрасчетный.Доходы91НУ) КАК Доходы91НУ,
	|	СУММА(ВТХозрасчетный.Доходы91ПР) КАК Доходы91ПР,
	|	СУММА(ВТХозрасчетный.Доходы91ВР) КАК Доходы91ВР,
	|	СУММА(ВТХозрасчетный.Доходы9091БУ) КАК Доходы9091БУ,
	|	СУММА(ВТХозрасчетный.Доходы9091НУ) КАК Доходы9091НУ,
	|	СУММА(ВТХозрасчетный.Доходы9091ПР) КАК Доходы9091ПР,
	|	СУММА(ВТХозрасчетный.Доходы9091ВР) КАК Доходы9091ВР,
	|	СУММА(ВТХозрасчетный.Доходы9091БУ + ВТХозрасчетный.Доходы91НЕБУ) КАК ДоходыБУ,
	|	СУММА(ВТХозрасчетный.Доходы9091НУ + ВТХозрасчетный.Доходы91НЕНУ) КАК ДоходыНУ,
	|	СУММА(ВТХозрасчетный.Доходы9091ПР + ВТХозрасчетный.Доходы91НЕПР) КАК ДоходыПР,
	|	СУММА(ВТХозрасчетный.Доходы9091ВР + ВТХозрасчетный.Доходы91НЕВР) КАК ДоходыВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТХозрасчетный.Организация";
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		Запрос.УстановитьПараметр("Организация", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки));
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СформироватьТаблицуОрганизаций(ПараметрыОтчета, ДокументРезультат, Результат.Выгрузить(), 
			"Доходы", 1, "Доходы", КэшПараметровОтчета);
		Возврат;
		
	Иначе
		
		ИмяМакета     = "Доходы" + ПараметрыОтчета.СуффиксСхемы;
		ДокументСхемы = ПолучитьМакет(ИмяМакета);
		ЭлементыСхемы = ДокументСхемы.ЭлементыГрафическойСхемы;
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьСхему(ЭлементыСхемы, Выборка, Результат.Колонки);
		
	НастроитьРамку(Выборка, "Доходы", 	  ЭлементыСхемы.РасшифровкаНалог, СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);	
	НастроитьРамку(Выборка, "Доходы9091", ЭлементыСхемы.Расшифровка9091,  СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);	
	НастроитьРамку(Выборка, "Доходы91НЕ", ЭлементыСхемы.Расшифровка91Не,  СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "Доходы91Уч", ЭлементыСхемы.Расшифровка91Уч,  СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "Доходы90",   ЭлементыСхемы.Расшифровка90, 	  СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "Доходы91",   ЭлементыСхемы.Расшифровка91, 	  СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	
	Если НЕ ПараметрыОтчета.ВключатьОбособленныеПодразделения Тогда
		
		РасшифровкаМакета.Вставить("РасшифровкаНалог", ПереходКСхеме(ПараметрыОтчета, 0, СтруктураВП));
		ЭлементыСхемы.РасшифровкаНалог.Гиперссылка = Истина;
		
	КонецЕсли;	
	
	РасшифровкаМакета.Вставить("Расшифровка9091", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаДоходыУчитываемыеПриОпределенииНалоговойБазы"));
	РасшифровкаМакета.Вставить("Расшифровка91НЕ", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаДоходыНеУчитываемыеВНалоговойБазе"));
	РасшифровкаМакета.Вставить("Расшифровка91Уч", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаПрочиеДоходыУчитываемыеВНУ"));
	РасшифровкаМакета.Вставить("Расшифровка90",   ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаВыручкаПоОбычнымВидамДеятельности"));
	РасшифровкаМакета.Вставить("Расшифровка91",   ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаПрочиеДоходы"));
		
	Если СтруктураВП.ПоказыватьЛегенду Тогда
		
		ВывестиЛегенду(ЭлементыСхемы);
		
	КонецЕсли;
	
	ЭлементыСхемы.НазваниеОрганизации.Наименование = ЗаголовокОтчета(ПараметрыОтчета);
	
	// Сохраняем историю
	СохранитьИсториюСхемы(КэшПараметровОтчета, ИмяМакета, РасшифровкаМакета, НастройкаРамок, ЭлементыСхемы);
	
КонецПроцедуры

Процедура СформироватьРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета)
	
	СтруктураВП = КэшПараметровОтчета.СтруктураВП;
	
	РасшифровкаМакета = Новый Структура;
	НастройкаРамок    = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; // Для СоздатьДолиЕНВД().
	
	СписокОП = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки);
	
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Организация",   ПараметрыОтчета.ОрганизацияРасшифровки);
	Запрос.УстановитьПараметр("СписокОП", 	   СписокОП);
	
	Налоговыйучет.СоздатьДолиЕНВД(
		Запрос.МенеджерВременныхТаблиц,
		Запрос.Параметры.НачалоПериода,
		Запрос.Параметры.КонецПериода,
		Запрос.Параметры.СписокОП); 
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ХозрасчетныйОбороты.СуммаОборотКт КАК ПрямыеРасходыТоварыУчБУ,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт КАК ПрямыеРасходыТоварыУчНУ,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт КАК ПрямыеРасходыТоварыУчПР,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт КАК ПрямыеРасходыТоварыУчВР,
	|	0 КАК ПрямыеРасходыУслугиБУ,
	|	0 КАК ПрямыеРасходыУслугиНУ,
	|	0 КАК ПрямыеРасходыУслугиПР,
	|	0 КАК ПрямыеРасходыУслугиВР,
	|	0 КАК ПрочиеРасходыУчБУ,
	|	0 КАК ПрочиеРасходыУчНУ,
	|	0 КАК ПрочиеРасходыУчПР,
	|	0 КАК ПрочиеРасходыУчВР,
	|	0 КАК ПрочиеРасходыНеБУ,
	|	0 КАК ПрочиеРасходыНеНУ,
	|	0 КАК ПрочиеРасходыНеПР,
	|	0 КАК ПрочиеРасходыНеВР,
	|	0 КАК ПрямыеРасходыТоварыНеБУ,
	|	0 КАК ПрямыеРасходыТоварыНеНУ,
	|	0 КАК ПрямыеРасходыТоварыНеПР,
	|	0 КАК ПрямыеРасходыТоварыНеВр
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СырьеИМатериалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Товары), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеПроизводство_Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПереданныеВПереработку), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПереданная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СпецоснасткаИСпецодеждаВЭксплуатации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗаготовлениеИПриобретениеМЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиПрошлыхЛет), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОтложенныеНалоговыеАктивыПоКорпоративномуПодоходномуНалогу), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МонтажОборудования), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты)), , Организация = &Организация, КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованнойПродукцииИОказанныхУслуг), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВыбытиюАктивов)), ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованнойПродукцииИОказанныхУслуг_)), , Организация = &Организация, КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства_)), ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт - ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт - ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт - ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт - ХозрасчетныйОбороты.СуммаВРОборотКт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Расходы))
	|				И НЕ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованнойПродукцииИОказанныхУслуг)),
	|			,
	|			Организация = &Организация,
	|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИтоговаяПрибыльИтоговыйУбыток)),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт - ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт - ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт - ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт - ХозрасчетныйОбороты.СуммаВРОборотКт,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Расходы))
	|				И НЕ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованнойПродукцииИОказанныхУслуг)),
	|			,
	|			Организация = &Организация,
	|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИтоговаяПрибыльИтоговыйУбыток)),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВыбытиюАктивов)), , Организация = &Организация, КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СырьеИМатериалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеПроизводство_Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПереданныеВПереработку), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПереданная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СпецоснасткаИСпецодеждаВЭксплуатации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗаготовлениеИПриобретениеМЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГруппаНаВыбытиеДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРастения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеЖивотные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиПрошлыхЛет), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованноеИмущество_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Растения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Животные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РазведочныеИОценочныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Гудвилл), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбесценениеГудвилла), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивыОрганизации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованныеНематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОтложенныеНалоговыеАктивыПоКорпоративномуПодоходномуНалогу), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеСтроительство), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МонтажОборудования), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КапитальныйРемонтОС), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты)), ) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТХозрасчетный.Организация КАК Организация,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыУчБУ) КАК ПрямыеРасходыТоварыУчБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыУчНУ) КАК ПрямыеРасходыТоварыУчНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыУчПР) КАК ПрямыеРасходыТоварыУчПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыУчВР) КАК ПрямыеРасходыТоварыУчВР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыУслугиБУ) КАК ПрямыеРасходыУслугиБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыУслугиНУ) КАК ПрямыеРасходыУслугиНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыУслугиПР) КАК ПрямыеРасходыУслугиПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыУслугиВР) КАК ПрямыеРасходыУслугиВР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыУчБУ) КАК ПрочиеРасходыУчБУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыУчНУ) КАК ПрочиеРасходыУчНУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыУчПР) КАК ПрочиеРасходыУчПР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыУчВР) КАК ПрочиеРасходыУчВР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеБУ) КАК ПрочиеРасходыНеБУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеНУ) КАК ПрочиеРасходыНеНУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеПР) КАК ПрочиеРасходыНеПР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеВР) КАК ПрочиеРасходыНеВР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыНеБУ) КАК ПрямыеРасходыТоварыНеБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыНеНУ) КАК ПрямыеРасходыТоварыНеНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыНеПР) КАК ПрямыеРасходыТоварыНеПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыНеВр) КАК ПрямыеРасходыТоварыНеВр,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыУчБУ + ВТХозрасчетный.ПрямыеРасходыУслугиБУ + ВТХозрасчетный.ПрочиеРасходыУчБУ + ВТХозрасчетный.ПрочиеРасходыНеБУ + ВТХозрасчетный.ПрямыеРасходыТоварыНеБУ) КАК РасходыБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыУчНУ + ВТХозрасчетный.ПрямыеРасходыУслугиНУ + ВТХозрасчетный.ПрочиеРасходыУчНУ + ВТХозрасчетный.ПрочиеРасходыНеНУ + ВТХозрасчетный.ПрямыеРасходыТоварыНеНУ) КАК РасходыНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыУчПР + ВТХозрасчетный.ПрямыеРасходыУслугиПР + ВТХозрасчетный.ПрочиеРасходыУчПР + ВТХозрасчетный.ПрочиеРасходыНеПР + ВТХозрасчетный.ПрямыеРасходыТоварыНеПР) КАК РасходыПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыУчВР + ВТХозрасчетный.ПрямыеРасходыУслугиВР + ВТХозрасчетный.ПрочиеРасходыУчВР + ВТХозрасчетный.ПрочиеРасходыНеВР + ВТХозрасчетный.ПрямыеРасходыТоварыНеВр) КАК РасходыВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТХозрасчетный.Организация";
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СписокОП = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки);
		Запрос.УстановитьПараметр("Организация", СписокОП);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СформироватьТаблицуОрганизаций(ПараметрыОтчета, ДокументРезультат, Результат.Выгрузить(), 
			"Расходы", 2, "Расходы", КэшПараметровОтчета);
		Возврат;
		
	Иначе
		
		ЭтоЕНВД       = УчетнаяПолитика.ПлательщикЕНВД(ПараметрыОтчета.ОрганизацияРасшифровки, ПараметрыОтчета.КонецПериода);
		ИмяМакета	  = ?(ЭтоЕНВД, "РасходыЕНВД", "Расходы") + ПараметрыОтчета.СуффиксСхемы;
		ДокументСхемы = ПолучитьМакет(ИмяМакета);
		ЭлементыСхемы = ДокументСхемы.ЭлементыГрафическойСхемы;
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	НастроитьРамку(Выборка, "ПрямыеРасходыТоварыУч", ЭлементыСхемы.РасшифровкаРасходыТовары,       СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "Расходы",               ЭлементыСхемы.РасшифровкаНалог,               СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);	
	НастроитьРамку(Выборка, "ПрочиеРасходыУч",       ЭлементыСхемы.РасшифровкаПрочиеРасходы,       СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "ПрямыеРасходыУслуги",   ЭлементыСхемы.РасшифровкаРасходыПроизводства, СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "ПрочиеРасходыНе",   	 ЭлементыСхемы.РасшифровкаПрочиеРасходы, 	   СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "ПрямыеРасходыТоварыНе", ЭлементыСхемы.РасшифровкаРасходыТовары,       СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	
	ЗаполнитьСхему(ЭлементыСхемы, Выборка, Результат.Колонки);
			
	Если НЕ ПараметрыОтчета.ВключатьОбособленныеПодразделения Тогда
		
		РасшифровкаМакета.Вставить("РасшифровкаНалог", ПереходКСхеме(ПараметрыОтчета, 0, СтруктураВП));
		
	КонецЕсли;
	
	РасшифровкаМакета.Вставить("РасшифровкаРасходыТовары",         ПереходКСхеме(ПараметрыОтчета, 3,  СтруктураВП));
	РасшифровкаМакета.Вставить("РасшифровкаПрочиеРасходы",         ПереходКСхеме(ПараметрыОтчета, 7,  СтруктураВП));
	РасшифровкаМакета.Вставить("РасшифровкаРасходыПроизводства",   ПереходКСхеме(ПараметрыОтчета, 4,  СтруктураВП));
	
	Если СтруктураВП.ПоказыватьЛегенду Тогда
		
		ВывестиЛегенду(ЭлементыСхемы);
		
	КонецЕсли;
	
	ЭлементыСхемы.НазваниеОрганизации.Наименование = ЗаголовокОтчета(ПараметрыОтчета);
	
	// Сохраняем историю
	СохранитьИсториюСхемы(КэшПараметровОтчета, ИмяМакета, РасшифровкаМакета, НастройкаРамок, ЭлементыСхемы);
	
КонецПроцедуры

Процедура СформироватьОбычныеРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета)
	
	СтруктураВП	= КэшПараметровОтчета.СтруктураВП;
	
	РасшифровкаМакета = Новый Структура;
	НастройкаРамок    = Новый Структура;
	
	МассивСтатьиЗатратНомГруппы = Новый Массив;
	МассивСтатьиЗатратНомГруппы.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
	МассивСтатьиЗатратНомГруппы.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериодаПрошлого", '20000101');
	Запрос.УстановитьПараметр("КонецПериодаПрошлого",  НачалоДня(ПараметрыОтчета.НачалоПериода) - 1);
	Запрос.УстановитьПараметр("НачалоПериода",		   ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",		   КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Организация", 		   ПараметрыОтчета.ОрганизацияРасшифровки);
	Запрос.УстановитьПараметр("СтатьиЗатратНомГруппы", МассивСтатьиЗатратНомГруппы);
	                                                                                    
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Организация КАК Организация,
	|	ХозрасчетныйОстатки.СуммаОстаток КАК РасходыПрямыеБУ,
	|	ХозрасчетныйОстатки.СуммаНУОстаток КАК РасходыПрямыеНУ,
	|	ХозрасчетныйОстатки.СуммаПРОстаток КАК РасходыПрямыеПР,
	|	ХозрасчетныйОстатки.СуммаВРОстаток КАК РасходыПрямыеВР
	|ПОМЕСТИТЬ ВТРасходыПрямые
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки({(&НачалоПериода)}, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы_)), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы), Организация = &Организация) КАК ХозрасчетныйОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы)), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат), Организация = &Организация, НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СчетаПроизводственногоУчета)), ) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРасходыПрямые.Организация КАК Организация,
	|	ВТРасходыПрямые.РасходыПрямыеБУ КАК РасходыПрямыеБУ,
	|	ВТРасходыПрямые.РасходыПрямыеНУ КАК РасходыПрямыеНУ,
	|	ВТРасходыПрямые.РасходыПрямыеПР КАК РасходыПрямыеПР,
	|	ВТРасходыПрямые.РасходыПрямыеВР КАК РасходыПрямыеВР,
	|	0 КАК Расходы1БУ,
	|	0 КАК Расходы1НУ,
	|	0 КАК Расходы1ПР,
	|	0 КАК Расходы1ВР,
	|	0 КАК Расходы2БУ,
	|	0 КАК Расходы2НУ,
	|	0 КАК Расходы2ПР,
	|	0 КАК Расходы2ВР,
	|	0 КАК АмортизацияБУ,
	|	0 КАК АмортизацияНУ,
	|	0 КАК АмортизацияПР,
	|	0 КАК АмортизацияВР,
	|	0 КАК НЗПБУ,
	|	0 КАК НЗПНУ,
	|	0 КАК НЗППР,
	|	0 КАК НЗПВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	ВТРасходыПрямые КАК ВТРасходыПрямые
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы_)), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат), Организация = &Организация, КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СырьеИМатериалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Товары), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеПроизводство_Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПереданныеВПереработку), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СпецоснасткаИСпецодеждаВЭксплуатации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗаготовлениеИПриобретениеМЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты)), ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы_)), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат), Организация = &Организация, НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СырьеИМатериалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Товары), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеПроизводство_ОсновноеПроизводство), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеПроизводство_Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеПроизводство_ВспомогательныеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПереданныеВПереработку), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СпецоснасткаИСпецодеждаВЭксплуатации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗаготовлениеИПриобретениеМЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияИнвестицийВНедвижимость_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияАрендованногоИмущества_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияБиологическихАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияРазведочныхИОценочныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияАрендованныхНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы)), ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы_)), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат), Организация = &Организация, КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияИнвестицийВНедвижимость_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияАрендованногоИмущества_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияБиологическихАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияРазведочныхИОценочныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияАрендованныхНематериальныхАктивов)), ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОстатки.СуммаОстаток,
	|	ХозрасчетныйОстатки.СуммаНУОстаток,
	|	ХозрасчетныйОстатки.СуммаПРОстаток,
	|	ХозрасчетныйОстатки.СуммаВРОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки({(&НачалоПериода)}, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеПроизводство_ОсновноеПроизводство), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеПроизводство_ВспомогательныеПроизводства)), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы), Организация = &Организация) КАК ХозрасчетныйОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТХозрасчетный.Организация КАК Организация,
	|	СУММА(ВТХозрасчетный.РасходыПрямыеБУ) КАК РасходыПрямыеБУ,
	|	СУММА(ВТХозрасчетный.РасходыПрямыеНУ) КАК РасходыПрямыеНУ,
	|	СУММА(ВТХозрасчетный.РасходыПрямыеПР) КАК РасходыПрямыеПР,
	|	СУММА(ВТХозрасчетный.РасходыПрямыеВР) КАК РасходыПрямыеВР,
	|	СУММА(ВТХозрасчетный.Расходы1БУ) КАК Расходы1БУ,
	|	СУММА(ВТХозрасчетный.Расходы1НУ) КАК Расходы1НУ,
	|	СУММА(ВТХозрасчетный.Расходы1ПР) КАК Расходы1ПР,
	|	СУММА(ВТХозрасчетный.Расходы1ВР) КАК Расходы1ВР,
	|	СУММА(ВТХозрасчетный.Расходы2БУ) КАК Расходы2БУ,
	|	СУММА(ВТХозрасчетный.Расходы2НУ) КАК Расходы2НУ,
	|	СУММА(ВТХозрасчетный.Расходы2ПР) КАК Расходы2ПР,
	|	СУММА(ВТХозрасчетный.Расходы2ВР) КАК Расходы2ВР,
	|	СУММА(ВТХозрасчетный.АмортизацияБУ) КАК АмортизацияБУ,
	|	СУММА(ВТХозрасчетный.АмортизацияНУ) КАК АмортизацияНУ,
	|	СУММА(ВТХозрасчетный.АмортизацияПР) КАК АмортизацияПР,
	|	СУММА(ВТХозрасчетный.АмортизацияВР) КАК АмортизацияВР,
	|	СУММА(ВТХозрасчетный.НЗПБУ) КАК НЗПБУ,
	|	СУММА(ВТХозрасчетный.НЗПНУ) КАК НЗПНУ,
	|	СУММА(ВТХозрасчетный.НЗППР) КАК НЗППР,
	|	СУММА(ВТХозрасчетный.НЗПВР) КАК НЗПВР,
	|	СУММА(ВТХозрасчетный.РасходыПрямыеБУ) КАК РасходыБУ,
	|	СУММА(ВТХозрасчетный.РасходыПрямыеНУ) КАК РасходыНУ,
	|	СУММА(ВТХозрасчетный.РасходыПрямыеПР) КАК РасходыПР,
	|	СУММА(ВТХозрасчетный.РасходыПрямыеВР) КАК РасходыВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТХозрасчетный.Организация";
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		Запрос.УстановитьПараметр("Организация", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки));
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СформироватьТаблицуОрганизаций(ПараметрыОтчета, ДокументРезультат, Результат.Выгрузить(), "Расходы", 10, 
			"Расходы по обычным видам деятельности", КэшПараметровОтчета);
		Возврат;
		
	Иначе
		
		ИмяМакета     = "РасходыОбычные" + ПараметрыОтчета.СуффиксСхемы;
		ДокументСхемы = ПолучитьМакет(ИмяМакета);
		ЭлементыСхемы = ДокументСхемы.ЭлементыГрафическойСхемы;
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьСхему(ЭлементыСхемы, Выборка, Результат.Колонки);
	
	НастроитьРамку(Выборка, "Расходы1",               ЭлементыСхемы.РасшифровкаРасходы1,               СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "РасходыПрямые",          ЭлементыСхемы.РасшифровкаРасходыПрямые,          СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "Расходы2",       		  ЭлементыСхемы.РасшифровкаРасходыПрочие,          СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "Амортизация",            ЭлементыСхемы.РасшифровкаАмортизация,            СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "НЗП",                    ЭлементыСхемы.РасшифровкаНЗП,                    СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "Расходы",                ЭлементыСхемы.Расходы,                           СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);	
		
	РасшифровкаМакета.Вставить("РасшифровкаРасходы1",               ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаСтоимостьТоваровРБП"));
	РасшифровкаМакета.Вставить("РасшифровкаРасходыПрямые",          ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаПрямыеПроизводственныеРасходы"));
	РасшифровкаМакета.Вставить("РасшифровкаРасходыПрочие",       	ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаУслугиСтороннихОрганизаций"));
	РасшифровкаМакета.Вставить("РасшифровкаАмортизация",       		ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаАмортизация"));
	РасшифровкаМакета.Вставить("РасшифровкаНЗП",       				ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаНезавершенноеПроизводствоПрошлыхЛет"));
	
	
	Если СтруктураВП.ПоказыватьЛегенду Тогда
		
		ВывестиЛегенду(ЭлементыСхемы);
		
	КонецЕсли;
	
	ЭлементыСхемы.НазваниеОрганизации.Наименование 	= ЗаголовокОтчета(ПараметрыОтчета);
	
	// Сохраняем историю
	СохранитьИсториюСхемы(КэшПараметровОтчета, ИмяМакета, РасшифровкаМакета, НастройкаРамок, ЭлементыСхемы);

КонецПроцедуры

Процедура СформироватьПрочиеРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета)
	
	СтруктураВП = КэшПараметровОтчета.СтруктураВП;
	
	РасшифровкаМакета = Новый Структура;
	НастройкаРамок    = Новый Структура;
	
	СписокОП = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; // Для СоздатьДолиЕНВД()
	
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Организация",   ПараметрыОтчета.ОрганизацияРасшифровки);
	Запрос.УстановитьПараметр("СписокОП",      СписокОП);
	
	Налоговыйучет.СоздатьДолиЕНВД(
		Запрос.МенеджерВременныхТаблиц,
		Запрос.Параметры.НачалоПериода,
		Запрос.Параметры.КонецПериода,
		Запрос.Параметры.СписокОП); 
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ХозрасчетныйОбороты.СуммаОборотДт - ХозрасчетныйОбороты.СуммаОборотКт КАК ПрочиеРасходыНеБУ,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт - ХозрасчетныйОбороты.СуммаНУОборотКт КАК ПрочиеРасходыНеНУ,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт - ХозрасчетныйОбороты.СуммаПРОборотКт КАК ПрочиеРасходыНеПР,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт - ХозрасчетныйОбороты.СуммаВРОборотКт КАК ПрочиеРасходыНеВР,
	|	0 КАК ПрочиеРасходыБУ,
	|	0 КАК ПрочиеРасходыНУ,
	|	0 КАК ПрочиеРасходыПР,
	|	0 КАК ПрочиеРасходыВР,
	|	0 КАК ПрочиеРасходыУчБУ,
	|	0 КАК ПрочиеРасходыУчНУ,
	|	0 КАК ПрочиеРасходыУчПР,
	|	0 КАК ПрочиеРасходыУчВР,
	|	0 КАК ПрочиеРасходыОСБУ,
	|	0 КАК ПрочиеРасходыОСНУ,
	|	0 КАК ПрочиеРасходыОСПР,
	|	0 КАК ПрочиеРасходыОСВР,
	|	0 КАК ПрочиеРасходыПоННБУ,
	|	0 КАК ПрочиеРасходыПоНННУ,
	|	0 КАК ПрочиеРасходыПоННПР,
	|	0 КАК ПрочиеРасходыПоННВР,
	|	0 КАК ПрочиеРасходыДрБУ,
	|	0 КАК ПрочиеРасходыДрНУ,
	|	0 КАК ПрочиеРасходыДрПР,
	|	0 КАК ПрочиеРасходыДрВР,
	|	0 КАК ПрочиеРасходыПоВознБУ,
	|	0 КАК ПрочиеРасходыПоВознНУ,
	|	0 КАК ПрочиеРасходыПоВознПР,
	|	0 КАК ПрочиеРасходыПоВознВР,
	|	0 КАК ПрочиеРасходыПРБУ,
	|	0 КАК ПрочиеРасходыПРНУ,
	|	0 КАК ПрочиеРасходыПРПР,
	|	0 КАК ПрочиеРасходыПРВР,
	|	0 КАК ПрочиеРасходыКомБУ,
	|	0 КАК ПрочиеРасходыКомНУ,
	|	0 КАК ПрочиеРасходыКомПР,
	|	0 КАК ПрочиеРасходыКомВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Расходы))
	|				И НЕ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованнойПродукцииИОказанныхУслуг)),
	|			,
	|			Организация = &Организация,
	|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИтоговаяПрибыльИтоговыйУбыток)),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт - ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт - ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт - ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт - ХозрасчетныйОбороты.СуммаВРОборотКт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Расходы))
	|				И НЕ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованнойПродукцииИОказанныхУслуг)),
	|			,
	|			Организация = &Организация,
	|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИтоговаяПрибыльИтоговыйУбыток)),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт - ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт - ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт - ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт - ХозрасчетныйОбороты.СуммаВРОборотКт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Расходы))
	|				И НЕ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованнойПродукцииИОказанныхУслуг)),
	|			,
	|			Организация = &Организация,
	|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИтоговаяПрибыльИтоговыйУбыток)),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВыбытиюАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованнойПродукцииИОказанныхУслуг)), , Организация = &Организация, КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГруппаНаВыбытиеДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРастения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеЖивотные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованноеИмущество_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Растения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Животные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РазведочныеИОценочныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Гудвилл), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбесценениеГудвилла), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивыОрганизации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованныеНематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеСтроительство), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КапитальныйРемонтОС)), ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Расходы))
	|				И НЕ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованнойПродукцииИОказанныхУслуг), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВознаграждениям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВыбытиюАктивов)),
	|			,
	|			Организация = &Организация,
	|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбязательстваПоНалогам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбязательстваПоДругимОбязательнымИДобровольнымПлатежам)),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Расходы))
	|				И НЕ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованнойПродукцииИОказанныхУслуг), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВознаграждениям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВыбытиюАктивов)),
	|			,
	|			Организация = &Организация,
	|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбязательстваПоНалогам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбязательстваПоДругимОбязательнымИДобровольнымПлатежам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИтоговаяПрибыльИтоговыйУбыток)),
	|			) КАК ХозрасчетныйОбороты
	|ГДЕ
	|	НЕ ХозрасчетныйОбороты.Субконто1.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КомандировочныеРасходы)
	|	И НЕ ХозрасчетныйОбороты.Субконто1.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ПредставительскиеРасходы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт - ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт - ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт - ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт - ХозрасчетныйОбороты.СуммаВРОборотКт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВознаграждениям)), , Организация = &Организация, НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИтоговаяПрибыльИтоговыйУбыток)), ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт - ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт - ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт - ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт - ХозрасчетныйОбороты.СуммаВРОборотКт,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Расходы))
	|				И НЕ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованнойПродукцииИОказанныхУслуг), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВознаграждениям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВыбытиюАктивов)),
	|			,
	|			Организация = &Организация,
	|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИтоговаяПрибыльИтоговыйУбыток)),
	|			) КАК ХозрасчетныйОбороты
	|ГДЕ
	|	ХозрасчетныйОбороты.Субконто1.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ПредставительскиеРасходы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт - ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт - ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт - ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт - ХозрасчетныйОбороты.СуммаВРОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Расходы))
	|				И НЕ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованнойПродукцииИОказанныхУслуг), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВознаграждениям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВыбытиюАктивов)),
	|			,
	|			Организация = &Организация,
	|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИтоговаяПрибыльИтоговыйУбыток)),
	|			) КАК ХозрасчетныйОбороты
	|ГДЕ
	|	ХозрасчетныйОбороты.Субконто1.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.КомандировочныеРасходы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТХозрасчетный.Организация КАК Организация,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеБУ) КАК ПрочиеРасходыНеБУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеНУ) КАК ПрочиеРасходыНеНУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеПР) КАК ПрочиеРасходыНеПР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеВР) КАК ПрочиеРасходыНеВР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыБУ) КАК ПрочиеРасходыБУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНУ) КАК ПрочиеРасходыНУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыПР) КАК ПрочиеРасходыПР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыВР) КАК ПрочиеРасходыВР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыУчБУ) КАК ПрочиеРасходыУчБУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыУчНУ) КАК ПрочиеРасходыУчНУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыУчПР) КАК ПрочиеРасходыУчПР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыУчВР) КАК ПрочиеРасходыУчВР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыОСБУ) КАК ПрочиеРасходыОСБУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыОСНУ) КАК ПрочиеРасходыОСНУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыОСПР) КАК ПрочиеРасходыОСПР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыОСВР) КАК ПрочиеРасходыОСВР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыПоННБУ) КАК ПрочиеРасходыПоННБУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыПоНННУ) КАК ПрочиеРасходыПоНННУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыПоННПР) КАК ПрочиеРасходыПоННПР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыПоННВР) КАК ПрочиеРасходыПоННВР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыДрБУ) КАК ПрочиеРасходыДрБУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыДрНУ) КАК ПрочиеРасходыДрНУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыДрПР) КАК ПрочиеРасходыДрПР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыДрВР) КАК ПрочиеРасходыДрВР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыПоВознБУ) КАК ПрочиеРасходыПоВознБУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыПоВознНУ) КАК ПрочиеРасходыПоВознНУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыПоВознПР) КАК ПрочиеРасходыПоВознПР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыПоВознВР) КАК ПрочиеРасходыПоВознВР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыПРБУ) КАК ПрочиеРасходыПРБУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыПРНУ) КАК ПрочиеРасходыПРНУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыПРПР) КАК ПрочиеРасходыПРПР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыПРВР) КАК ПрочиеРасходыПРВР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыКомБУ) КАК ПрочиеРасходыКомБУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыКомНУ) КАК ПрочиеРасходыКомНУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыКомПР) КАК ПрочиеРасходыКомПР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыКомВР) КАК ПрочиеРасходыКомВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТХозрасчетный.Организация";
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		Запрос.УстановитьПараметр("Организация", СписокОП);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СформироватьТаблицуОрганизаций(ПараметрыОтчета, ДокументРезультат, Результат.Выгрузить(),
			"ПрочиеРасходы", 7, "Прочие расходы", КэшПараметровОтчета);
		Возврат;
		
	Иначе
		
		ЭтоЕНВД       = УчетнаяПолитика.ПлательщикЕНВД(ПараметрыОтчета.ОрганизацияРасшифровки, ПараметрыОтчета.КонецПериода);
		ИмяМакета     = ?(ЭтоЕНВД, "РасходыПрочиеЕНВД", "РасходыПрочие") + ПараметрыОтчета.СуффиксСхемы;
		ДокументСхемы = ПолучитьМакет(ИмяМакета);
		ЭлементыСхемы = ДокументСхемы.ЭлементыГрафическойСхемы;
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	// заполняем схему
	ЗаполнитьСхему(ЭлементыСхемы, Выборка, Результат.Колонки);
	
	НастроитьРамку(Выборка, "ПрочиеРасходыНе", 	   ЭлементыСхемы.РасшифровкаПрочиеРасходыНе,  СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "ПрочиеРасходыУч", 	   ЭлементыСхемы.РасшифровкаПрочиеРасходыУч,  СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "ПрочиеРасходыОС", 	   ЭлементыСхемы.РасшифровкаРасходыОтносящиесяКСтоимостиРеализованногоИмущества, СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "ПрочиеРасходыКом",    ЭлементыСхемы.КомандировочныеРасходы, 	  СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "ПрочиеРасходыПоНН",   ЭлементыСхемы.РасходыПоНачисленнымНалогам, СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "ПрочиеРасходыПР", 	   ЭлементыСхемы.ПредставительскиеРасходы, 	  СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "ПрочиеРасходыДр", 	   ЭлементыСхемы.ДругиеПрочиеРасходы, 		  СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "ПрочиеРасходыПоВозн", ЭлементыСхемы.РасходыПоВознаграждениям, 	  СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "ПрочиеРасходы", 	   ЭлементыСхемы.РасшифровкаПрочиеРасходы, 	  СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	
	
	РасшифровкаМакета.Вставить("РасшифровкаПрочиеРасходыНе", 	ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаПрочиеРасходыНеУчитываемыеВНУ"));
	РасшифровкаМакета.Вставить("РасшифровкаПрочиеРасходыУч", 	ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаПрочиеРасходыУчитываемыеВНУ"));
	РасшифровкаМакета.Вставить("РасшифровкаРасходыОтносящиесяКСтоимостиРеализованногоИмущества", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаРасходыОтносящиесяКСтоимостиРеализованногоИмущества"));
	РасшифровкаМакета.Вставить("КомандировочныеРасходы", 		ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаКомандировочныеРасходы"));
	РасшифровкаМакета.Вставить("РасходыПоНачисленнымНалогам", 	ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаРасходыПоНачисленнымНалогам"));
	РасшифровкаМакета.Вставить("ПредставительскиеРасходы", 		ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаПредставительскиеРасходы"));
	РасшифровкаМакета.Вставить("ДругиеПрочиеРасходы", 			ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаДругиеПрочиеРасходы"));
	РасшифровкаМакета.Вставить("РасходыПоВознаграждениям", 		ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаРасходыПоВознаграждениям"));
	РасшифровкаМакета.Вставить("РасшифровкаПрочиеРасходы",   	ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаПрочиеРасходы"));
	
	Если СтруктураВП.ПоказыватьЛегенду Тогда
		
		ВывестиЛегенду(ЭлементыСхемы);
		
	КонецЕсли;
	
	ЭлементыСхемы.НазваниеОрганизации.Наименование = ЗаголовокОтчета(ПараметрыОтчета);
	
	// Сохраняем историю
	СохранитьИсториюСхемы(КэшПараметровОтчета, ИмяМакета, РасшифровкаМакета, НастройкаРамок, ЭлементыСхемы);

КонецПроцедуры

Процедура СформироватьСтоимостьЗапасов(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета)
	
	СтруктураВП	= КэшПараметровОтчета.СтруктураВП;
	
	РасшифровкаМакета = Новый Структура;
	НастройкаРамок    = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Организация",   ПараметрыОтчета.ОрганизацияРасшифровки);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Организация КАК Организация,
	|	ХозрасчетныйОстатки.СуммаОстаток КАК СтоимостьНачБУ,
	|	ХозрасчетныйОстатки.СуммаНУОстаток КАК СтоимостьНачНУ,
	|	ХозрасчетныйОстатки.СуммаПРОстаток КАК СтоимостьНачПР,
	|	ХозрасчетныйОстатки.СуммаВРОстаток КАК СтоимостьНачВР,
	|	0 КАК СтоимостьДтБУ,
	|	0 КАК СтоимостьДтНУ,
	|	0 КАК СтоимостьДтПР,
	|	0 КАК СтоимостьДтВР,
	|	0 КАК СтоимостьВыпускаБУ,
	|	0 КАК СтоимостьВыпускаНУ,
	|	0 КАК СтоимостьВыпускаПР,
	|	0 КАК СтоимостьВыпускаВР,
	|	0 КАК СтоимостьИзлишковБУ,
	|	0 КАК СтоимостьИзлишковНУ,
	|	0 КАК СтоимостьИзлишковПР,
	|	0 КАК СтоимостьИзлишковВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&НачалоПериода, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СырьеИМатериалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Товары), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеПроизводство_Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПереданныеВПереработку), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПереданная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СпецоснасткаИСпецодеждаВЭксплуатации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗаготовлениеИПриобретениеМЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГруппаНаВыбытиеДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРастения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеЖивотные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиПрошлыхЛет), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованноеИмущество_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Растения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Животные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РазведочныеИОценочныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Гудвилл), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбесценениеГудвилла), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивыОрганизации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованныеНематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОтложенныеНалоговыеАктивыПоКорпоративномуПодоходномуНалогу), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеСтроительство), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МонтажОборудования), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КапитальныйРемонтОС), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты)), , Организация = &Организация) КАК ХозрасчетныйОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СырьеИМатериалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Товары), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеПроизводство_Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПереданныеВПереработку), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПереданная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СпецоснасткаИСпецодеждаВЭксплуатации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗаготовлениеИПриобретениеМЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГруппаНаВыбытиеДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРастения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеЖивотные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиПрошлыхЛет), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованноеИмущество_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Растения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Животные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РазведочныеИОценочныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Гудвилл), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбесценениеГудвилла), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивыОрганизации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованныеНематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОтложенныеНалоговыеАктивыПоКорпоративномуПодоходномуНалогу), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеСтроительство), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МонтажОборудования), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КапитальныйРемонтОС), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты)), , Организация = &Организация, КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочнаяЗадолженностьПоставщикамИПодрядчикам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочнаяКредиторскаяЗадолженностьДочернимОрганизациям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочнаяКредиторскаяЗадолженностьАссоциированнымИСовместнымОрганизациям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТекущаяЧастьДолгосрочнойКредиторскойЗадолженности), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочаяКраткосрочнаяКредиторскаяЗадолженность_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочнаяЗадолженностьПоставщикамИПодрядчикам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочнаяКредиторскаяЗадолженностьДочернимОрганизациям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочнаяКредиторскаяЗадолженностьАссоциированнымИСовместнымОрганизациям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочнаяКредиторскаяЗадолженностьФилиаламИСтруктурнымПодразделениям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочаяДолгосрочнаяКредиторскаяЗадолженность_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДолгосрочныеОбязательства_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочнаяДебиторскаяЗадолженностьРаботников)), ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СырьеИМатериалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Товары), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеПроизводство_Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПереданныеВПереработку), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПереданная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СпецоснасткаИСпецодеждаВЭксплуатации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗаготовлениеИПриобретениеМЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГруппаНаВыбытиеДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРастения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеЖивотные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиПрошлыхЛет), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованноеИмущество_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Растения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Животные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РазведочныеИОценочныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Гудвилл), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбесценениеГудвилла), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивыОрганизации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованныеНематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОтложенныеНалоговыеАктивыПоКорпоративномуПодоходномуНалогу), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеСтроительство), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МонтажОборудования), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КапитальныйРемонтОС), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты)), , Организация = &Организация, КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства_)), ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СырьеИМатериалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Товары), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеПроизводство_Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПереданныеВПереработку), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПереданная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СпецоснасткаИСпецодеждаВЭксплуатации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗаготовлениеИПриобретениеМЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГруппаНаВыбытиеДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРастения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеЖивотные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиПрошлыхЛет), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованноеИмущество_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Растения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Животные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РазведочныеИОценочныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Гудвилл), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбесценениеГудвилла), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивыОрганизации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованныеНематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОтложенныеНалоговыеАктивыПоКорпоративномуПодоходномуНалогу), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеСтроительство), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МонтажОборудования), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КапитальныйРемонтОС), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты)), , Организация = &Организация, НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочнаяЗадолженностьПоставщикамИПодрядчикам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочнаяКредиторскаяЗадолженностьДочернимОрганизациям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочнаяКредиторскаяЗадолженностьАссоциированнымИСовместнымОрганизациям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТекущаяЧастьДолгосрочнойКредиторскойЗадолженности), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочаяКраткосрочнаяКредиторскаяЗадолженность_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочнаяЗадолженностьПоставщикамИПодрядчикам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочнаяКредиторскаяЗадолженностьДочернимОрганизациям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочнаяКредиторскаяЗадолженностьАссоциированнымИСовместнымОрганизациям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочнаяКредиторскаяЗадолженностьФилиаламИСтруктурнымПодразделениям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочаяДолгосрочнаяКредиторскаяЗадолженность_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДолгосрочныеОбязательства_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочнаяДебиторскаяЗадолженностьРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства)), ) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТХозрасчетный.Организация КАК Организация,
	|	СУММА(ВТХозрасчетный.СтоимостьНачБУ) КАК СтоимостьНачБУ,
	|	СУММА(ВТХозрасчетный.СтоимостьНачНУ) КАК СтоимостьНачНУ,
	|	СУММА(ВТХозрасчетный.СтоимостьНачПР) КАК СтоимостьНачПР,
	|	СУММА(ВТХозрасчетный.СтоимостьНачВР) КАК СтоимостьНачВР,
	|	СУММА(ВТХозрасчетный.СтоимостьДтБУ) КАК СтоимостьДтБУ,
	|	СУММА(ВТХозрасчетный.СтоимостьДтНУ) КАК СтоимостьДтНУ,
	|	СУММА(ВТХозрасчетный.СтоимостьДтПР) КАК СтоимостьДтПР,
	|	СУММА(ВТХозрасчетный.СтоимостьДтВР) КАК СтоимостьДтВР,
	|	СУММА(ВТХозрасчетный.СтоимостьВыпускаБУ) КАК СтоимостьВыпускаБУ,
	|	СУММА(ВТХозрасчетный.СтоимостьВыпускаНУ) КАК СтоимостьВыпускаНУ,
	|	СУММА(ВТХозрасчетный.СтоимостьВыпускаПР) КАК СтоимостьВыпускаПР,
	|	СУММА(ВТХозрасчетный.СтоимостьВыпускаВР) КАК СтоимостьВыпускаВР,
	|	СУММА(ВТХозрасчетный.СтоимостьИзлишковБУ) КАК СтоимостьИзлишковБУ,
	|	СУММА(ВТХозрасчетный.СтоимостьИзлишковНУ) КАК СтоимостьИзлишковНУ,
	|	СУММА(ВТХозрасчетный.СтоимостьИзлишковПР) КАК СтоимостьИзлишковПР,
	|	СУММА(ВТХозрасчетный.СтоимостьИзлишковВР) КАК СтоимостьИзлишковВР,
	|	СУММА(ВТХозрасчетный.СтоимостьНачБУ + ВТХозрасчетный.СтоимостьДтБУ + ВТХозрасчетный.СтоимостьВыпускаБУ + ВТХозрасчетный.СтоимостьИзлишковБУ) КАК СтоимостьБУ,
	|	СУММА(ВТХозрасчетный.СтоимостьНачНУ + ВТХозрасчетный.СтоимостьДтНУ + ВТХозрасчетный.СтоимостьВыпускаНУ + ВТХозрасчетный.СтоимостьИзлишковНУ) КАК СтоимостьНУ,
	|	СУММА(ВТХозрасчетный.СтоимостьНачПР + ВТХозрасчетный.СтоимостьДтПР + ВТХозрасчетный.СтоимостьВыпускаПР + ВТХозрасчетный.СтоимостьИзлишковПР) КАК СтоимостьПР,
	|	СУММА(ВТХозрасчетный.СтоимостьНачВР + ВТХозрасчетный.СтоимостьДтВР + ВТХозрасчетный.СтоимостьВыпускаВР + ВТХозрасчетный.СтоимостьИзлишковВР) КАК СтоимостьВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТХозрасчетный.Организация";
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СписокОП = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки);
		
		Запрос.УстановитьПараметр("Организация", СписокОП);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СформироватьТаблицуОрганизаций(ПараметрыОтчета, ДокументРезультат, Результат.Выгрузить(),
			"Стоимость", 9, "Активы", КэшПараметровОтчета);
		Возврат;
		
	Иначе	
		
		ИмяМакета     = "СтоимостьТоваров" + ПараметрыОтчета.СуффиксСхемы;
		ДокументСхемы = ПолучитьМакет(ИмяМакета);
		ЭлементыСхемы = ДокументСхемы.ЭлементыГрафическойСхемы;
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	// заполняем схему
	ЗаполнитьСхему(ЭлементыСхемы, Выборка, Результат.Колонки);
	
	НастроитьРамку(Выборка, "СтоимостьДт",       ЭлементыСхемы.РасшифровкаСтоимостьДт, 		 СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "СтоимостьНач",      ЭлементыСхемы.РасшифровкаСтоимостьНач,      СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "СтоимостьВыпуска",  ЭлементыСхемы.РасшифровкаСтоимостьВыпуска,  СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "СтоимостьИзлишков", ЭлементыСхемы.РасшифровкаСтоимостьИзлишков, СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "Стоимость",         ЭлементыСхемы.РасшифровкаРасходыТовары, 	 СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	
	РасшифровкаМакета.Вставить("РасшифровкаСтоимостьДт",       ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаРасходыНаПриобретениеТоваровАмортизируемогоИмуществаРБП"));
	РасшифровкаМакета.Вставить("РасшифровкаСтоимостьНач",      ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаСтоимостьТоваровИАмортизацияНеСписаннаяВПрошлыхПериодах"));
	РасшифровкаМакета.Вставить("РасшифровкаСтоимостьВыпуска",  ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаСтоимостьВыпущеннойПродукции"));
	РасшифровкаМакета.Вставить("РасшифровкаСтоимостьИзлишков", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаОприходованиеИзлишков"));
	РасшифровкаМакета.Вставить("РасшифровкаРасходыТовары", 	   ПереходКСхеме(ПараметрыОтчета, 3, СтруктураВП));	
	
	Если СтруктураВП.ПоказыватьЛегенду Тогда
		
		ВывестиЛегенду(ЭлементыСхемы);
		
	КонецЕсли;
	
	ЭлементыСхемы.НазваниеОрганизации.Наименование 	= ЗаголовокОтчета(ПараметрыОтчета);
	
	// Сохраняем историю
	СохранитьИсториюСхемы(КэшПараметровОтчета, ИмяМакета, РасшифровкаМакета, НастройкаРамок, ЭлементыСхемы);

КонецПроцедуры

Процедура СформироватьРаспределяемыеРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета)
	
	СтруктураВП	= КэшПараметровОтчета.СтруктураВП;
	
	РасшифровкаМакета = Новый Структура;
	НастройкаРамок    = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Организация",   ПараметрыОтчета.ОрганизацияРасшифровки);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ГруппыФинансовогоУчетаНоменклатуры) КАК Субконто1
	|ПОМЕСТИТЬ ВТНоменклатурныеГруппыЕНВД
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, 
	|											&КонецПериода,
	|											,
	|											Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыручкаЕНВД)),
	|											ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы),
	|											Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Субконто1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Субконто1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА (НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ГруппыФинансовогоУчетаНоменклатуры) В
	|					(ВЫБРАТЬ
	|						ВТНоменклатурныеГруппыЕНВД.Субконто1
	|					ИЗ
	|						ВТНоменклатурныеГруппыЕНВД КАК ВТНоменклатурныеГруппыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РаспределяемыеРасходы20БУ,
	|	ВЫБОР
	|		КОГДА (НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ГруппыФинансовогоУчетаНоменклатуры) В
	|					(ВЫБРАТЬ
	|						ВТНоменклатурныеГруппыЕНВД.Субконто1
	|					ИЗ
	|						ВТНоменклатурныеГруппыЕНВД КАК ВТНоменклатурныеГруппыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт - ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РаспределяемыеРасходы20НУ,
	|	ВЫБОР
	|		КОГДА (НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ГруппыФинансовогоУчетаНоменклатуры) В
	|					(ВЫБРАТЬ
	|						ВТНоменклатурныеГруппыЕНВД.Субконто1
	|					ИЗ
	|						ВТНоменклатурныеГруппыЕНВД КАК ВТНоменклатурныеГруппыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт - ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РаспределяемыеРасходы20ПР,
	|	ВЫБОР
	|		КОГДА (НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ГруппыФинансовогоУчетаНоменклатуры) В
	|					(ВЫБРАТЬ
	|						ВТНоменклатурныеГруппыЕНВД.Субконто1
	|					ИЗ
	|						ВТНоменклатурныеГруппыЕНВД КАК ВТНоменклатурныеГруппыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт - ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РаспределяемыеРасходы20ВР,
	|	0 КАК РаспределяемыеРасходы90БУ,
	|	0 КАК РаспределяемыеРасходы90НУ,
	|	0 КАК РаспределяемыеРасходы90ПР,
	|	0 КАК РаспределяемыеРасходы90ВР,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ГруппыФинансовогоУчетаНоменклатуры) В
	|				(ВЫБРАТЬ
	|					ВТНоменклатурныеГруппыЕНВД.Субконто1
	|				ИЗ
	|					ВТНоменклатурныеГруппыЕНВД КАК ВТНоменклатурныеГруппыЕНВД)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РаспределяемыеРасходыЕНВДБУ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ГруппыФинансовогоУчетаНоменклатуры) В
	|				(ВЫБРАТЬ
	|					ВТНоменклатурныеГруппыЕНВД.Субконто1
	|				ИЗ
	|					ВТНоменклатурныеГруппыЕНВД КАК ВТНоменклатурныеГруппыЕНВД)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РаспределяемыеРасходыЕНВДНУ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ГруппыФинансовогоУчетаНоменклатуры) В
	|				(ВЫБРАТЬ
	|					ВТНоменклатурныеГруппыЕНВД.Субконто1
	|				ИЗ
	|					ВТНоменклатурныеГруппыЕНВД КАК ВТНоменклатурныеГруппыЕНВД)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РаспределяемыеРасходыЕНВДПР,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ГруппыФинансовогоУчетаНоменклатуры) В
	|				(ВЫБРАТЬ
	|					ВТНоменклатурныеГруппыЕНВД.Субконто1
	|				ИЗ
	|					ВТНоменклатурныеГруппыЕНВД КАК ВТНоменклатурныеГруппыЕНВД)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РаспределяемыеРасходыЕНВДВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), 
	|							 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы),
	|							 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве),
	|							 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат),
	|			Организация = &Организация
	|				И ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(ПланВидовХарактеристик.СтатьиДоходов)
	|						ТОГДА ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиДоходов).ВидДеятельностиДляНалоговогоУчетаЗатрат
	|					КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|						ТОГДА ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ВидДеятельностиДляНалоговогоУчетаЗатрат
	|					КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты)
	|				И (НЕ ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)),
	|			КорСЧет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы)) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ

	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство), 
	|							 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства), 
	|							 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), 
	|							 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы), 
	|							 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), 
	|							 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства), 
	|							 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат),
	|			Организация = &Организация
	|				И ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(ПланВидовХарактеристик.СтатьиДоходов)
	|						ТОГДА ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиДоходов).ВидДеятельностиДляНалоговогоУчетаЗатрат
	|					КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|						ТОГДА ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ВидДеятельностиДляНалоговогоУчетаЗатрат
	|					КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты)
	|				И (НЕ ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)),
	|			КорСЧет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажу), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходы)),
	|			) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТХозрасчетный.Организация,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20БУ + ВТХозрасчетный.РаспределяемыеРасходы90БУ + ВТХозрасчетный.РаспределяемыеРасходыЕНВДБУ) КАК РаспределяемыеРасходыБУ,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20НУ + ВТХозрасчетный.РаспределяемыеРасходы90НУ + ВТХозрасчетный.РаспределяемыеРасходыЕНВДНУ) КАК РаспределяемыеРасходыНУ,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20ПР + ВТХозрасчетный.РаспределяемыеРасходы90ПР + ВТХозрасчетный.РаспределяемыеРасходыЕНВДПР) КАК РаспределяемыеРасходыПР,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20ВР + ВТХозрасчетный.РаспределяемыеРасходы90ВР + ВТХозрасчетный.РаспределяемыеРасходыЕНВДВР) КАК РаспределяемыеРасходыВР,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20БУ) КАК РаспределяемыеРасходы20БУ,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20НУ) КАК РаспределяемыеРасходы20НУ,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20ПР) КАК РаспределяемыеРасходы20ПР,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20ВР) КАК РаспределяемыеРасходы20ВР,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы90БУ) КАК РаспределяемыеРасходы90БУ,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы90НУ) КАК РаспределяемыеРасходы90НУ,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы90ПР) КАК РаспределяемыеРасходы90ПР,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы90ВР) КАК РаспределяемыеРасходы90ВР,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходыЕНВДБУ) КАК РаспределяемыеРасходыЕНВДБУ,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходыЕНВДНУ) КАК РаспределяемыеРасходыЕНВДНУ,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходыЕНВДПР) КАК РаспределяемыеРасходыЕНВДПР,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходыЕНВДВР) КАК РаспределяемыеРасходыЕНВДВР,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20БУ + ВТХозрасчетный.РаспределяемыеРасходы90БУ) КАК РаспределяемыеРасходыНеЕНВДБУ,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20НУ + ВТХозрасчетный.РаспределяемыеРасходы90НУ) КАК РаспределяемыеРасходыНеЕНВДНУ,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20ПР + ВТХозрасчетный.РаспределяемыеРасходы90ПР) КАК РаспределяемыеРасходыНеЕНВДПР,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20ВР + ВТХозрасчетный.РаспределяемыеРасходы90ВР) КАК РаспределяемыеРасходыНеЕНВДВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТХозрасчетный.Организация";
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СписокОП = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки);
		Запрос.УстановитьПараметр("Организация", СписокОП);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СформироватьТаблицуОрганизаций(ПараметрыОтчета, ДокументРезультат, Результат.Выгрузить(), 
			"РаспределяемыеРасходы", 8, "Распределяемые расходы", КэшПараметровОтчета);
		Возврат;
		
	Иначе	
		
		ИмяМакета     = "РасходыРаспределяемые" + ПараметрыОтчета.СуффиксСхемы;
		ДокументСхемы = ПолучитьМакет(ИмяМакета);
		ЭлементыСхемы = ДокументСхемы.ЭлементыГрафическойСхемы;
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	// заполняем схему
	ЗаполнитьСхему(ЭлементыСхемы, Выборка, Результат.Колонки);
	
	НастроитьРамку(Выборка, "РаспределяемыеРасходы20", 	   ЭлементыСхемы.РасшифровкаРаспределяемыеРасходы20, 	 СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);	
	НастроитьРамку(Выборка, "РаспределяемыеРасходы90", 	   ЭлементыСхемы.РасшифровкаРаспределяемыеРасходы90, 	 СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);	
	НастроитьРамку(Выборка, "РаспределяемыеРасходыНеЕНВД", ЭлементыСхемы.РасшифровкаРаспределяемыеРасходыНеЕНВД, СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);	
	НастроитьРамку(Выборка, "РаспределяемыеРасходыЕНВД",   ЭлементыСхемы.РасшифровкаРаспределяемыеРасходыЕНВД, 	 СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "РаспределяемыеРасходы",	   ЭлементыСхемы.РасшифровкаРаспределяемыеРасходы, 		 СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	
	РасшифровкаМакета.Вставить("РасшифровкаРаспределяемыеРасходы20",     ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаОПРиОХРСписанныеНаПрямыеРаспределяемые"));
	РасшифровкаМакета.Вставить("РасшифровкаРаспределяемыеРасходы90",     ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаКосвенныеРаспределяемыеРасходыУчитываемыеВНУ"));
	РасшифровкаМакета.Вставить("РасшифровкаРаспределяемыеРасходыНеЕНВД", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаКосвенныеРасходыНеЕНВД"));
	РасшифровкаМакета.Вставить("РасшифровкаРаспределяемыеРасходыЕНВД",   ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаКосвенныеРасходыЕНВД"));
	РасшифровкаМакета.Вставить("РасшифровкаРаспределяемыеРасходы",       ПереходКСхеме(ПараметрыОтчета, 10, СтруктураВП));
	
	Если СтруктураВП.ПоказыватьЛегенду Тогда
		
		ВывестиЛегенду(ЭлементыСхемы);
		
	КонецЕсли;
	
	ЭлементыСхемы.НазваниеОрганизации.Наименование = ЗаголовокОтчета(ПараметрыОтчета);
	
	// Сохраняем историю
	СохранитьИсториюСхемы(КэшПараметровОтчета, ИмяМакета, РасшифровкаМакета, НастройкаРамок, ЭлементыСхемы);
	
КонецПроцедуры

Процедура СформироватьРасходыПроизводства(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета)
	
	СтруктураВП = КэшПараметровОтчета.СтруктураВП;
	
	РасшифровкаМакета = Новый Структура;
	НастройкаРамок    = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Организация",   ПараметрыОтчета.ОрганизацияРасшифровки);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ХозрасчетныйОбороты.СуммаОборотДт КАК ПрочийВыпускБУ,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт КАК ПрочийВыпускНУ,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт КАК ПрочийВыпускПР,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт КАК ПрочийВыпускВР,
	|	0 КАК ПрямыеРасходыУслугиБУ,
	|	0 КАК ПрямыеРасходыУслугиНУ,
	|	0 КАК ПрямыеРасходыУслугиПР,
	|	0 КАК ПрямыеРасходыУслугиВР,
	|	0 КАК НЗПБУ,
	|	0 КАК НЗПНУ,
	|	0 КАК НЗППР,
	|	0 КАК НЗПВР,
	|	0 КАК ОХРБУ,
	|	0 КАК ОХРНУ,
	|	0 КАК ОХРПР,
	|	0 КАК ОХРВР,
	|	0 КАК ПрямыеРасходыБУ,
	|	0 КАК ПрямыеРасходыНУ,
	|	0 КАК ПрямыеРасходыПР,
	|	0 КАК ПрямыеРасходыВР,
	|	0 КАК ПрямыеРасходыВыпускБУ,
	|	0 КАК ПрямыеРасходыВыпускНУ,
	|	0 КАК ПрямыеРасходыВыпускПР,
	|	0 КАК ПрямыеРасходыВыпускВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , НЕ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СырьеИМатериалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Товары), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеПроизводство_Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПереданныеВПереработку), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПереданная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СпецоснасткаИСпецодеждаВЭксплуатации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗаготовлениеИПриобретениеМЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеБиологическиеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиПрошлыхЛет), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованноеИмущество_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Растения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Животные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РазведочныеИОценочныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Гудвилл), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбесценениеГудвилла), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивыОрганизации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованныеНематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОтложенныеНалоговыеАктивыПоКорпоративномуПодоходномуНалогу), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеСтроительство), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МонтажОборудования), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КапитальныйРемонтОС), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованнойПродукцииИОказанныхУслуг_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы)), , Организация = &Организация, КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства_)), ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованнойПродукцииИОказанныхУслуг_)), , Организация = &Организация, КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства_)), ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОстатки.СуммаОстаток,
	|	ХозрасчетныйОстатки.СуммаНУОстаток,
	|	ХозрасчетныйОстатки.СуммаПРОстаток,
	|	ХозрасчетныйОстатки.СуммаВРОстаток,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеПроизводство_ОсновноеПроизводство), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеПроизводство_ВспомогательныеПроизводства)), , Организация = &Организация) КАК ХозрасчетныйОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства_)), , Организация = &Организация, КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы_)), ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства_)), , Организация = &Организация, НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СчетаПроизводственногоУчета)), ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СырьеИМатериалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Товары), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеПроизводство_Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПереданныеВПереработку), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПереданная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СпецоснасткаИСпецодеждаВЭксплуатации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗаготовлениеИПриобретениеМЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеБиологическиеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиПрошлыхЛет), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованноеИмущество_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Растения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Животные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РазведочныеИОценочныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Гудвилл), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбесценениеГудвилла), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивыОрганизации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованныеНематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОтложенныеНалоговыеАктивыПоКорпоративномуПодоходномуНалогу), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеСтроительство), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МонтажОборудования), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КапитальныйРемонтОС), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты)), , Организация = &Организация, КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства)), ) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТХозрасчетный.Организация КАК Организация,
	|	СУММА(ВТХозрасчетный.ПрочийВыпускБУ) КАК ПрочийВыпускБУ,
	|	СУММА(ВТХозрасчетный.ПрочийВыпускНУ) КАК ПрочийВыпускНУ,
	|	СУММА(ВТХозрасчетный.ПрочийВыпускПР) КАК ПрочийВыпускПР,
	|	СУММА(ВТХозрасчетный.ПрочийВыпускВР) КАК ПрочийВыпускВР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыУслугиБУ) КАК ПрямыеРасходыУслугиБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыУслугиНУ) КАК ПрямыеРасходыУслугиНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыУслугиПР) КАК ПрямыеРасходыУслугиПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыУслугиВР) КАК ПрямыеРасходыУслугиВР,
	|	СУММА(ВТХозрасчетный.НЗПБУ) КАК НЗПБУ,
	|	СУММА(ВТХозрасчетный.НЗПНУ) КАК НЗПНУ,
	|	СУММА(ВТХозрасчетный.НЗППР) КАК НЗППР,
	|	СУММА(ВТХозрасчетный.НЗПВР) КАК НЗПВР,
	|	СУММА(ВТХозрасчетный.ОХРБУ) КАК ОХРБУ,
	|	СУММА(ВТХозрасчетный.ОХРНУ) КАК ОХРНУ,
	|	СУММА(ВТХозрасчетный.ОХРПР) КАК ОХРПР,
	|	СУММА(ВТХозрасчетный.ОХРВР) КАК ОХРВР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыБУ) КАК ПрямыеРасходыБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыНУ) КАК ПрямыеРасходыНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыПР) КАК ПрямыеРасходыПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыВР) КАК ПрямыеРасходыВР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыВыпускБУ) КАК ПрямыеРасходыВыпускБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыВыпускНУ) КАК ПрямыеРасходыВыпускНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыВыпускПР) КАК ПрямыеРасходыВыпускПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыВыпускВР) КАК ПрямыеРасходыВыпускВР,
	|	СУММА(ВТХозрасчетный.ПрочийВыпускБУ + ВТХозрасчетный.ПрямыеРасходыУслугиБУ + ВТХозрасчетный.НЗПБУ + ВТХозрасчетный.ПрямыеРасходыВыпускБУ) КАК ПроизводствоБУ,
	|	СУММА(ВТХозрасчетный.ПрочийВыпускНУ + ВТХозрасчетный.ПрямыеРасходыУслугиНУ + ВТХозрасчетный.НЗПНУ + ВТХозрасчетный.ПрямыеРасходыВыпускНУ) КАК ПроизводствоНУ,
	|	СУММА(ВТХозрасчетный.ПрочийВыпускПР + ВТХозрасчетный.ПрямыеРасходыУслугиПР + ВТХозрасчетный.НЗППР + ВТХозрасчетный.ПрямыеРасходыВыпускПР) КАК ПроизводствоПР,
	|	СУММА(ВТХозрасчетный.ПрочийВыпускВР + ВТХозрасчетный.ПрямыеРасходыУслугиВР + ВТХозрасчетный.НЗПВР + ВТХозрасчетный.ПрямыеРасходыВыпускВР) КАК ПроизводствоВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТХозрасчетный.Организация";
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СписокОП = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки);
		Запрос.УстановитьПараметр("Организация", СписокОП);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СформироватьТаблицуОрганизаций(ПараметрыОтчета, ДокументРезультат, Результат.Выгрузить(),
			"ПрямыеРасходы", 4, "Расходы производства", КэшПараметровОтчета);
		Возврат;
		
	Иначе
		
		ЭтоЕНВД       = УчетнаяПолитика.ПлательщикЕНВД(ПараметрыОтчета.ОрганизацияРасшифровки, ПараметрыОтчета.КонецПериода);
		ИмяМакета     = ?(ЭтоЕНВД, "РасходыПроизводстваЕНВД", "РасходыПроизводства") + ПараметрыОтчета.СуффиксСхемы;
		ДокументСхемы = ПолучитьМакет(ИмяМакета);
		ЭлементыСхемы = ДокументСхемы.ЭлементыГрафическойСхемы;
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	// заполняем схему
	ЗаполнитьСхему(ЭлементыСхемы, Выборка, Результат.Колонки);
	
	НастроитьРамку(Выборка, "ПрочийВыпуск", 	   	ЭлементыСхемы.РасшифровкаСтоимостьПрочегоВыпуска,   СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);	
	НастроитьРамку(Выборка, "ПрямыеРасходыУслуги", 	ЭлементыСхемы.ПрямыеРасходыУслуги,         			СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);	
	НастроитьРамку(Выборка, "ПрямыеРасходыВыпуск", 	ЭлементыСхемы.РасшифровкаАктивы,           			СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "НЗП",                 	ЭлементыСхемы.РасшифровкаНЗП,             			СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "ПрямыеРасходы",        ЭлементыСхемы.РасшифровкаРасходыОбычные,   			СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "ОХР",                  ЭлементыСхемы.РасшифровкаКосвенныеРасходы, 			СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "Производство",       	ЭлементыСхемы.Расходы,                     			СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);	
	
	РасшифровкаМакета.Вставить("РасшифровкаСтоимостьПрочегоВыпуска", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаСтоимостьПрочегоВыпуска"));
	РасшифровкаМакета.Вставить("ПрямыеРасходыУслуги", 	     		 ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаПрямыеРасходыПоРеализованнымУслугам"));	
	РасшифровкаМакета.Вставить("РасшифровкаАктивы",           		 ПереходКСхеме(ПараметрыОтчета, 9,  СтруктураВП));
	РасшифровкаМакета.Вставить("РасшифровкаНЗП",              		 ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаНезавершенноеПроизводство"));	
	РасшифровкаМакета.Вставить("РасшифровкаРасходыОбычные",   		 ПереходКСхеме(ПараметрыОтчета, 10, СтруктураВП));
	РасшифровкаМакета.Вставить("РасшифровкаКосвенныеРасходы", 		 ПереходКСхеме(ПараметрыОтчета, 10, СтруктураВП));
	
	Если СтруктураВП.ПоказыватьЛегенду Тогда
		
		ВывестиЛегенду(ЭлементыСхемы);
		
	КонецЕсли;
	
	ЭлементыСхемы.НазваниеОрганизации.Наименование = ЗаголовокОтчета(ПараметрыОтчета);
	
	// Сохраняем историю
	СохранитьИсториюСхемы(КэшПараметровОтчета, ИмяМакета, РасшифровкаМакета, НастройкаРамок, ЭлементыСхемы);
	
КонецПроцедуры

Процедура СформироватьРасходыПоТоварам(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета)
	
	СтруктураВП = КэшПараметровОтчета.СтруктураВП;
	
	РасшифровкаМакета = Новый Структура;
	НастройкаРамок    = Новый Структура;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Организация",   ПараметрыОтчета.ОрганизацияРасшифровки);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ХозрасчетныйОбороты.СуммаОборотКт КАК ПрямыеРасходыТоварыБУ,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт КАК ПрямыеРасходыТоварыНУ,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт КАК ПрямыеРасходыТоварыПР,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт КАК ПрямыеРасходыТоварыВР,
	|	0 КАК ПрямыеРасходыОСБУ,
	|	0 КАК ПрямыеРасходыОСНУ,
	|	0 КАК ПрямыеРасходыОСПР,
	|	0 КАК ПрямыеРасходыОСВР,
	|	0 КАК ПрямыеРасходыДтБУ,
	|	0 КАК ПрямыеРасходыДтНУ,
	|	0 КАК ПрямыеРасходыДтПР,
	|	0 КАК ПрямыеРасходыДтВР,
	|	0 КАК ПрямыеРасходыТоварыНЕБУ,
	|	0 КАК ПрямыеРасходыТоварыНЕНУ,
	|	0 КАК ПрямыеРасходыТоварыНЕПР,
	|	0 КАК ПрямыеРасходыТоварыНЕВР,
	|	0 КАК АктивыКонБУ,
	|	0 КАК АктивыКонНУ,
	|	0 КАК АктивыКонПР,
	|	0 КАК АктивыКонВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СырьеИМатериалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Товары), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеПроизводство_Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПереданныеВПереработку), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПереданная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СпецоснасткаИСпецодеждаВЭксплуатации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗаготовлениеИПриобретениеМЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиПрошлыхЛет), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОтложенныеНалоговыеАктивыПоКорпоративномуПодоходномуНалогу), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МонтажОборудования), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты)),
	|			,
	|			Организация = &Организация
	|				И ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(ПланВидовХарактеристик.СтатьиДоходов)
	|						ТОГДА ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиДоходов).ПринятиеКНалоговомуУчету
	|					КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|						ТОГДА ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ПринятиеКНалоговомуУчету
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ,
	|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованнойПродукцииИОказанныхУслуг), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВыбытиюАктивов)),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВыбытиюАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованнойПродукцииИОказанныхУслуг)),
	|			,
	|			Организация = &Организация
	|				И ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(ПланВидовХарактеристик.СтатьиДоходов)
	|						ТОГДА ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиДоходов).ПринятиеКНалоговомуУчету
	|					КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|						ТОГДА ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ПринятиеКНалоговомуУчету
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ,
	|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГруппаНаВыбытиеДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРастения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеЖивотные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованноеИмущество_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Растения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Животные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РазведочныеИОценочныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Гудвилл), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбесценениеГудвилла), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивыОрганизации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованныеНематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеСтроительство), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КапитальныйРемонтОС)),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СырьеИМатериалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеПроизводство_Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПереданныеВПереработку), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПереданная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СпецоснасткаИСпецодеждаВЭксплуатации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗаготовлениеИПриобретениеМЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГруппаНаВыбытиеДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРастения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеЖивотные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиПрошлыхЛет), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованноеИмущество_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Растения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Животные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РазведочныеИОценочныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Гудвилл), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбесценениеГудвилла), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивыОрганизации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованныеНематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОтложенныеНалоговыеАктивыПоКорпоративномуПодоходномуНалогу), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеСтроительство), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МонтажОборудования), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КапитальныйРемонтОС), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты)), , Организация = &Организация, КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоРеализацииПродукцииИОказаниюУслуг_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АдминистративныеРасходы_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаФинансирование), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыОтОбесцененияАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоКурсовойРазнице), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоСозданиюРезерваИСписаниюБезнадежныхТребований), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоОперационнойАренде), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыОтИзмененияСправедливойСтоимостиБиологическихАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыОтОбесцененияФинансовыхИнструментов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходыВНалоговомУчете), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыСвязанныеСПрекращаемойДеятельностью_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоляВУбыткеОрганизацийУчитываемыхМетодомДолевогоУчастия)), ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыПоВыбытиюАктивов)),
	|			,
	|			Организация = &Организация
	|				И НЕ ВЫБОР
	|						КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(ПланВидовХарактеристик.СтатьиДоходов)
	|							ТОГДА ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиДоходов).ПринятиеКНалоговомуУчету
	|						КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|							ТОГДА ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ПринятиеКНалоговомуУчету
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ,
	|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СырьеИМатериалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеПроизводство_Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПереданныеВПереработку), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПереданная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СпецоснасткаИСпецодеждаВЭксплуатации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗаготовлениеИПриобретениеМЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГруппаНаВыбытиеДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРастения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеЖивотные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиПрошлыхЛет), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованноеИмущество_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Растения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Животные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РазведочныеИОценочныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Гудвилл), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбесценениеГудвилла), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивыОрганизации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованныеНематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОтложенныеНалоговыеАктивыПоКорпоративномуПодоходномуНалогу), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеСтроительство), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МонтажОборудования), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КапитальныйРемонтОС), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты)),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОстатки.СуммаОстаток,
	|	ХозрасчетныйОстатки.СуммаНУОстаток,
	|	ХозрасчетныйОстатки.СуммаПРОстаток,
	|	ХозрасчетныйОстатки.СуммаВРОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СырьеИМатериалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеПроизводство_Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МатериалыПереданныеВПереработку), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПереданная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СпецоснасткаИСпецодеждаВЭксплуатации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗаготовлениеИПриобретениеМЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГруппаНаВыбытиеДляПродажи), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРастения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеЖивотные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиПрошлыхЛет), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованноеИмущество_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Растения), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Животные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РазведочныеИОценочныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Гудвилл), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбесценениеГудвилла), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивыОрганизации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованныеНематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОтложенныеНалоговыеАктивыПоКорпоративномуПодоходномуНалогу), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеСтроительство), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МонтажОборудования), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КапитальныйРемонтОС), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Товары), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НезавершенноеСтроительство_)), , Организация = &Организация) КАК ХозрасчетныйОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТХозрасчетный.Организация КАК Организация,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыБУ) КАК ПрямыеРасходыТоварыБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыНУ) КАК ПрямыеРасходыТоварыНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыПР) КАК ПрямыеРасходыТоварыПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыВР) КАК ПрямыеРасходыТоварыВР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыОСБУ) КАК ПрямыеРасходыОСБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыОСНУ) КАК ПрямыеРасходыОСНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыОСПР) КАК ПрямыеРасходыОСПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыОСВР) КАК ПрямыеРасходыОСВР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыДтБУ) КАК ПрямыеРасходыДтБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыДтНУ) КАК ПрямыеРасходыДтНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыДтПР) КАК ПрямыеРасходыДтПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыДтВР) КАК ПрямыеРасходыДтВР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыНЕБУ) КАК ПрямыеРасходыТоварыНЕБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыНЕНУ) КАК ПрямыеРасходыТоварыНЕНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыНЕПР) КАК ПрямыеРасходыТоварыНЕПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыНЕВР) КАК ПрямыеРасходыТоварыНЕВР,
	|	СУММА(ВТХозрасчетный.АктивыКонБУ) КАК АктивыКонБУ,
	|	СУММА(ВТХозрасчетный.АктивыКонНУ) КАК АктивыКонНУ,
	|	СУММА(ВТХозрасчетный.АктивыКонПР) КАК АктивыКонПР,
	|	СУММА(ВТХозрасчетный.АктивыКонВР) КАК АктивыКонВР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыБУ + ВТХозрасчетный.ПрямыеРасходыОСБУ + ВТХозрасчетный.ПрямыеРасходыДтБУ + ВТХозрасчетный.ПрямыеРасходыТоварыНЕБУ + ВТХозрасчетный.АктивыКонБУ) КАК АктивыБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыНУ + ВТХозрасчетный.ПрямыеРасходыОСНУ + ВТХозрасчетный.ПрямыеРасходыДтНУ + ВТХозрасчетный.ПрямыеРасходыТоварыНЕНУ + ВТХозрасчетный.АктивыКонНУ) КАК АктивыНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыПР + ВТХозрасчетный.ПрямыеРасходыОСПР + ВТХозрасчетный.ПрямыеРасходыДтПР + ВТХозрасчетный.ПрямыеРасходыТоварыНЕПР + ВТХозрасчетный.АктивыКонПР) КАК АктивыПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыВР + ВТХозрасчетный.ПрямыеРасходыОСВР + ВТХозрасчетный.ПрямыеРасходыДтВР + ВТХозрасчетный.ПрямыеРасходыТоварыНЕВР + ВТХозрасчетный.АктивыКонВР) КАК АктивыВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТХозрасчетный.Организация";
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СписокОП = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки);
		Запрос.УстановитьПараметр("Организация", СписокОП);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СформироватьТаблицуОрганизаций(ПараметрыОтчета, ДокументРезультат, Результат.Выгрузить(),
			"Активы", 3, "Стоимость активов", КэшПараметровОтчета);
		Возврат;
		
	Иначе
		
		ЭтоЕНВД       = УчетнаяПолитика.ПлательщикЕНВД(ПараметрыОтчета.ОрганизацияРасшифровки, ПараметрыОтчета.КонецПериода);
		ИмяМакета     = ?(ЭтоЕНВД, "СтоимостьСписанияТоваровЕНВД", "СтоимостьСписанияТоваров") + ПараметрыОтчета.СуффиксСхемы;
		ДокументСхемы = ПолучитьМакет(ИмяМакета);
		ЭлементыСхемы = ДокументСхемы.ЭлементыГрафическойСхемы;

	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	// заполняем схему
	ЗаполнитьСхему(ЭлементыСхемы, Выборка, Результат.Колонки);
	
	НастроитьРамку(Выборка, "ПрямыеРасходыТовары",   ЭлементыСхемы.РасшифровкаПрямыеРасходыТовары,   СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "ПрямыеРасходыОС",       ЭлементыСхемы.РасшифровкаПрямыеРасходыОС,       СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "ПрямыеРасходыДт",       ЭлементыСхемы.РасшифровкаПрямыеРасходыДт,       СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "ПрямыеРасходыТоварыНЕ", ЭлементыСхемы.РасшифровкаПрямыеРасходыТоварыНЕ, СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "АктивыКон",             ЭлементыСхемы.РасшифровкаАктивыКон,             СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "Активы",                ЭлементыСхемы.РасшифровкаАктивы,                СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	
	РасшифровкаМакета.Вставить("РасшифровкаПрямыеРасходыТовары",   ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаПрямыеРасходыПоРеализованнымТоварамУчНУ"));
	РасшифровкаМакета.Вставить("РасшифровкаПрямыеРасходыОС",       ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаРасходыОтносящиесяКСтоимостиРеализованногоИмущества"));
	РасшифровкаМакета.Вставить("РасшифровкаПрямыеРасходыДт",       ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаАмортизацияРБПТоварыНеРеализация"));
	РасшифровкаМакета.Вставить("РасшифровкаПрямыеРасходыТоварыНЕ", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаПрямыеРасходыПоРеализованнымТоварамНеУчНУ"));
	РасшифровкаМакета.Вставить("РасшифровкаАктивыКон",             ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаСтоимостьНеСписанныхТоваровРБПАмортизируемогоИмущества"));
	РасшифровкаМакета.Вставить("РасшифровкаАктивы", 			   ПереходКСхеме(ПараметрыОтчета, 9, СтруктураВП));
	
	Если СтруктураВП.ПоказыватьЛегенду Тогда
		
		ВывестиЛегенду(ЭлементыСхемы);
		                                      
	КонецЕсли;
	
	ЭлементыСхемы.НазваниеОрганизации.Наименование = ЗаголовокОтчета(ПараметрыОтчета);
	
	// Сохраняем историю
	СохранитьИсториюСхемы(КэшПараметровОтчета, ИмяМакета, РасшифровкаМакета, НастройкаРамок, ЭлементыСхемы);
	
КонецПроцедуры

Процедура СформироватьТранспортныеРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета)
	
	СтруктураВП	= КэшПараметровОтчета.СтруктураВП;
	
	РасшифровкаМакета = Новый Структура;
	НастройкаРамок    = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Организация",   ПараметрыОтчета.ОрганизацияРасшифровки);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Организация КАК Организация,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт + ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокДт КАК ТранспортныеРасходыБУ,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНУОборотДт + ХозрасчетныйОстаткиИОбороты.СуммаНУНачальныйОстатокДт КАК ТранспортныеРасходыНУ,
	|	ХозрасчетныйОстаткиИОбороты.СуммаПРОборотДт + ХозрасчетныйОстаткиИОбороты.СуммаПРНачальныйОстатокДт КАК ТранспортныеРасходыПР,
	|	ХозрасчетныйОстаткиИОбороты.СуммаВРОборотДт + ХозрасчетныйОстаткиИОбороты.СуммаВРНачальныйОстатокДт КАК ТранспортныеРасходыВР,
	|	0 КАК ТранспортныеРасходыСписБУ,
	|	0 КАК ТранспортныеРасходыСписНУ,
	|	0 КАК ТранспортныеРасходыСписПР,
	|	0 КАК ТранспортныеРасходыСписВР,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК ТранспортныеРасходыОстБУ,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНУКонечныйОстатокДт КАК ТранспортныеРасходыОстНУ,
	|	ХозрасчетныйОстаткиИОбороты.СуммаПРКонечныйОстатокДт КАК ТранспортныеРасходыОстПР,
	|	ХозрасчетныйОстаткиИОбороты.СуммаВРКонечныйОстатокДт КАК ТранспортныеРасходыОстВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИздержкиОбращения)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат),
	|			Организация = &Организация
	|				И ВЫБОР 
	|				КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(ПланВидовХарактеристик.СтатьиДоходов)
	|					ТОГДА ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиДоходов).ВидДеятельностиДляНалоговогоУчетаЗатрат
	|				КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|					ТОГДА ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ВидДеятельностиДляНалоговогоУчетаЗатрат
	|				КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|				И ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)) КАК ХозрасчетныйОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИздержкиОбращения)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат),
	|			Организация = &Организация
	|				И ВЫБОР 
	|				КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(ПланВидовХарактеристик.СтатьиДоходов)
	|					ТОГДА ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиДоходов).ВидДеятельностиДляНалоговогоУчетаЗатрат
	|				КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|					ТОГДА ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ВидДеятельностиДляНалоговогоУчетаЗатрат
	|				КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|				И ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы),
	|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД)),
	|			) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТХозрасчетный.Организация,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыБУ) КАК ТранспортныеРасходыБУ,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыНУ) КАК ТранспортныеРасходыНУ,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыПР) КАК ТранспортныеРасходыПР,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыВР) КАК ТранспортныеРасходыВР,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыСписБУ) КАК ТранспортныеРасходыСписБУ,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыСписНУ) КАК ТранспортныеРасходыСписНУ,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыСписПР) КАК ТранспортныеРасходыСписПР,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыСписВР) КАК ТранспортныеРасходыСписВР,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыОстБУ) КАК ТранспортныеРасходыОстБУ,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыОстНУ) КАК ТранспортныеРасходыОстНУ,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыОстПР) КАК ТранспортныеРасходыОстПР,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыОстВР) КАК ТранспортныеРасходыОстВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТХозрасчетный.Организация";
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СписокОП = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки);
		Запрос.УстановитьПараметр("Организация", СписокОП);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СформироватьТаблицуОрганизаций(ПараметрыОтчета, ДокументРезультат, Результат.Выгрузить(),
			"ТранспортныеРасходы", 5, "Транспортные расходы", КэшПараметровОтчета);
		Возврат;
		
	Иначе	
		
		ИмяМакета     = "ТранспортныеРасходы" + ПараметрыОтчета.СуффиксСхемы;
		ДокументСхемы = ПолучитьМакет(ИмяМакета);
		ЭлементыСхемы = ДокументСхемы.ЭлементыГрафическойСхемы;
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	// заполняем схему
	ЗаполнитьСхему(ЭлементыСхемы, Выборка, Результат.Колонки);
	
	НастроитьРамку(Выборка, "ТранспортныеРасходыСпис", ЭлементыСхемы.РасшифровкаТранспортныеРасходыСпис, СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "ТранспортныеРасходы", 	   ЭлементыСхемы.РасшифровкаРасходыОбычные,			 СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	НастроитьРамку(Выборка, "ТранспортныеРасходыОст",  ЭлементыСхемы.РасшифровкаТранспортныеРасходыОст,	 СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	
	РасшифровкаМакета.Вставить("РасшифровкаТранспортныеРасходыСпис", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаТранспортныхРасходовУчитываемыхВНУ"));
	РасшифровкаМакета.Вставить("РасшифровкаТранспортныеРасходыОст",  ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаТранспортныхРасходовОтнесенныхНаОстаток"));
	РасшифровкаМакета.Вставить("РасшифровкаРасходыОбычные",          ПереходКСхеме(ПараметрыОтчета, 10, СтруктураВП));
	
	Если СтруктураВП.ПоказыватьЛегенду Тогда
		
		ВывестиЛегенду(ЭлементыСхемы);
		
	КонецЕсли;
	
	ЭлементыСхемы.НазваниеОрганизации.Наименование = ЗаголовокОтчета(ПараметрыОтчета);
	
	// Сохраняем историю
	СохранитьИсториюСхемы(КэшПараметровОтчета, ИмяМакета, РасшифровкаМакета, НастройкаРамок, ЭлементыСхемы);
	
КонецПроцедуры

Процедура СформироватьКосвенныеРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета)
	
	СтруктураВП	= КэшПараметровОтчета.СтруктураВП;
	
	РасшифровкаМакета = Новый Структура;
	НастройкаРамок    = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода",       ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",        КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("НачалоГода",          ПараметрыОтчета.НачалоГода);
	Запрос.УстановитьПараметр("Организация",         ПараметрыОтчета.ОрганизацияРасшифровки);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД), 
	|													  ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД))
	|				И НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ВидРасходов = 
	|													  ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыУчБУ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД),
	|													  ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД))
	|				И НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ВидРасходов =
	|													  ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыУчНУ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД),
	|													  ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД))
	|				И НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ВидРасходов =
	|													  ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыУчПР,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД),
	|													  ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД))
	|				И НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ВидРасходов =
	|													  ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыУчВР,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД),
	|													  ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ВидРасходов =
	|													  ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыНеБУ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД),
	|													  ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ВидРасходов =
	|													  ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыНеНУ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД),
	|													  ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ВидРасходов =
	|													  ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыНеПР,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД),
	|													  ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ВидРасходов =
	|													  ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыНеВР,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство),
	|													  ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|				И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы),
	|													   ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы),
	|													   ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве),
	|													   ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства),
	|													   ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу))
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыСписБУ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство),
	|													  ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|				И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы),
	|													   ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы),
	|													   ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве),
	|													   ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства),
	|													   ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу))
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт - ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыСписНУ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство),
	|													  ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|				И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы),
	|													   ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы),
	|													   ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве),
	|													   ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства),
	|													   ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу))
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт - ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыСписПР,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство),
	|													  ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|				И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы),
	|													   ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы),
	|													   ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве),
	|													   ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства),
	|													   ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу))
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт - ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыСписВР,
	|	0 КАК КосвенныеРасходыОстБУ,
	|	0 КАК КосвенныеРасходыОстНУ,
	|	0 КАК КосвенныеРасходыОстПР,
	|	0 КАК КосвенныеРасходыОстВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство),
	|							 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства),
	|							 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы),
	|							 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы),
	|							 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве),
	|							 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства),
	|							 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат),
	|			Организация = &Организация
	|				И ВЫБОР 
	|				КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(ПланВидовХарактеристик.СтатьиДоходов)
	|					ТОГДА ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиДоходов).ВидДеятельностиДляНалоговогоУчетаЗатрат
	|				КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|					ТОГДА ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ВидДеятельностиДляНалоговогоУчетаЗатрат
	|				КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|				И НЕ ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы),
	|			,
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт - ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт - ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт - ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт - ХозрасчетныйОбороты.СуммаВРОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоГода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы),
	|							 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы),
	|							 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат),
	|			Организация = &Организация
	|				И ВЫБОР 
	|				КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(ПланВидовХарактеристик.СтатьиДоходов)
	|					ТОГДА ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиДоходов).ВидДеятельностиДляНалоговогоУчетаЗатрат
	|				КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|					ТОГДА ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ВидДеятельностиДляНалоговогоУчетаЗатрат
	|				КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|				И НЕ ВЫРАЗИТЬ(Субконто1 КАК ПланВидовХарактеристик.СтатьиРасходов).ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы),
	|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НераспределеннаяПрибыль)),
	|			) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТХозрасчетный.Организация КАК Организация,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыУчБУ) КАК КосвенныеРасходыУчБУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыУчНУ) КАК КосвенныеРасходыУчНУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыУчПР) КАК КосвенныеРасходыУчПР,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыУчВР) КАК КосвенныеРасходыУчВР,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыНеБУ) КАК КосвенныеРасходыНеБУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыНеНУ) КАК КосвенныеРасходыНеНУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыНеПР) КАК КосвенныеРасходыНеПР,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыНеВР) КАК КосвенныеРасходыНеВР,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыСписБУ) КАК КосвенныеРасходыСписБУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыСписНУ) КАК КосвенныеРасходыСписНУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыСписПР) КАК КосвенныеРасходыСписПР,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыСписВР) КАК КосвенныеРасходыСписВР,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыОстБУ) КАК КосвенныеРасходыОстБУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыОстНУ) КАК КосвенныеРасходыОстНУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыОстПР) КАК КосвенныеРасходыОстПР,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыОстВР) КАК КосвенныеРасходыОстВР,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыУчБУ + ВТХозрасчетный.КосвенныеРасходыНеБУ + ВТХозрасчетный.КосвенныеРасходыСписБУ + ВТХозрасчетный.КосвенныеРасходыОстБУ) КАК КосвенныеРасходыБУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыУчНУ + ВТХозрасчетный.КосвенныеРасходыНеНУ + ВТХозрасчетный.КосвенныеРасходыСписНУ + ВТХозрасчетный.КосвенныеРасходыОстНУ) КАК КосвенныеРасходыНУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыУчПР + ВТХозрасчетный.КосвенныеРасходыНеПР + ВТХозрасчетный.КосвенныеРасходыСписПР + ВТХозрасчетный.КосвенныеРасходыОстПР) КАК КосвенныеРасходыПР,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыУчВР + ВТХозрасчетный.КосвенныеРасходыНеВР + ВТХозрасчетный.КосвенныеРасходыСписВР + ВТХозрасчетный.КосвенныеРасходыОстВР) КАК КосвенныеРасходыВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТХозрасчетный.Организация";
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СписокОП = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки);
		Запрос.УстановитьПараметр("Организация", СписокОП);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СформироватьТаблицуОрганизаций(ПараметрыОтчета, ДокументРезультат, Результат.Выгрузить(),
			"КосвенныеРасходы", 6, "Косвенные расходы", КэшПараметровОтчета);
		Возврат;
		
	Иначе
		
		ИмяМакета     = "КосвенныеРасходы" + ПараметрыОтчета.СуффиксСхемы;
		ДокументСхемы = ПолучитьМакет(ИмяМакета);
		ЭлементыСхемы = ДокументСхемы.ЭлементыГрафическойСхемы;
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	// заполняем схему
	ЗаполнитьСхему(ЭлементыСхемы, Выборка, Результат.Колонки);
	
	НастроитьРамку(Выборка, "КосвенныеРасходыУч",	ЭлементыСхемы.РасшифровкаКосвенныеРасходыУч,   СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);	
	НастроитьРамку(Выборка, "КосвенныеРасходыНе",	ЭлементыСхемы.РасшифровкаКосвенныеРасходыНЕ,   СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);	
	НастроитьРамку(Выборка, "КосвенныеРасходыСпис",	ЭлементыСхемы.РасшифровкаКосвенныеРасходыСпис, СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);	
	НастроитьРамку(Выборка, "КосвенныеРасходыОст",	ЭлементыСхемы.РасшифровкаКосвенныеРасходыОст,  СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);	
	НастроитьРамку(Выборка, "КосвенныеРасходы",		ЭлементыСхемы.РасшифровкаРасходыОбычные,  	   СтруктураВП.ПоказыватьЛегенду, НастройкаРамок);
	
	РасшифровкаМакета.Вставить("РасшифровкаРасходыОбычные",       ПереходКСхеме(ПараметрыОтчета, 10, СтруктураВП));
	РасшифровкаМакета.Вставить("РасшифровкаКосвенныеРасходыУч",   ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаКосвенныеРасходыУчитываемыеВНУ"));
	РасшифровкаМакета.Вставить("РасшифровкаКосвенныеРасходыНе",   ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаКосвенныеРасходыНеУчитываемыеВНУ"));
	РасшифровкаМакета.Вставить("РасшифровкаКосвенныеРасходыСпис", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаОПРиОХРСписанныеНаПрямые"));
	РасшифровкаМакета.Вставить("РасшифровкаКосвенныеРасходыОст",  ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаКосвенныеРасходыНеВкл"));
	
	Если СтруктураВП.ПоказыватьЛегенду Тогда
		
		ВывестиЛегенду(ЭлементыСхемы);
		
	КонецЕсли;
	
	ЭлементыСхемы.НазваниеОрганизации.Наименование = ЗаголовокОтчета(ПараметрыОтчета);
	
	// Сохраняем историю
	СохранитьИсториюСхемы(КэшПараметровОтчета, ИмяМакета, РасшифровкаМакета, НастройкаРамок, ЭлементыСхемы);
	
КонецПроцедуры

Процедура СформироватьТаблицуОрганизаций(ПараметрыОтчета, ДокументРезультат, Результат, НазваниеПараметра, НомерСхемы, НазваниеОтчета, КэшПараметровОтчета)
	
	СтруктураВП = КэшПараметровОтчета.СтруктураВП;
	
	ДокументРезультат.Очистить();
	
	Макет      		 = ПолучитьМакет("СписокОрганизаций");
	ОбластьОтчета    = Макет.ПолучитьОбласть("Область");
	ЗаголовокОтчета  = Макет.ПолучитьОбласть("Заголовок");
	ПодвалОтчета     = Макет.ПолучитьОбласть("Подвал");
	
	
	ЗаголовокОтчета.Параметры.НазваниеОрганизации = ЗаголовокОтчета(ПараметрыОтчета);
	ЗаголовокОтчета.Параметры.НазваниеОтчета 	  = НазваниеОтчета;
	
	ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
	ДокументРезультат.Вывести(ЗаголовокОтчета);
	
	
	Для Каждого Выборка Из Результат Цикл
		
		ОбластьОтчета.Параметры.Текст 	= Выборка.Организация;
		ОбластьОтчета.Параметры.СуммаБУ = Выборка[НазваниеПараметра + "БУ"];
		ОбластьОтчета.Параметры.СуммаНУ = Выборка[НазваниеПараметра + "НУ"];
		ОбластьОтчета.Параметры.СуммаПР = Выборка[НазваниеПараметра + "ПР"];
		ОбластьОтчета.Параметры.СуммаВР = Выборка[НазваниеПараметра + "ВР"];
		
		ОбластьОтчета.Параметры.Контроль 		 = ОбластьОтчета.Параметры.СуммаБУ - ОбластьОтчета.Параметры.СуммаНУ 
			- ОбластьОтчета.Параметры.СуммаПР - ОбластьОтчета.Параметры.СуммаВР;
		ОбластьОтчета.Параметры.СхемаРасшифровки = ПереходКСхеме(ПараметрыОтчета, НомерСхемы, СтруктураВП, Ложь, Выборка.Организация);
		
		ДокументРезультат.Вывести(ОбластьОтчета);
		
	КонецЦикла;
	
	ПодвалОтчета.Параметры.СуммаБУ = Результат.Итог(НазваниеПараметра + "БУ");
	ПодвалОтчета.Параметры.СуммаНУ = Результат.Итог(НазваниеПараметра + "НУ");
	ПодвалОтчета.Параметры.СуммаПР = Результат.Итог(НазваниеПараметра + "ПР");
	ПодвалОтчета.Параметры.СуммаВР = Результат.Итог(НазваниеПараметра + "ВР");
	
	ДокументРезультат.Вывести(ПодвалОтчета);
	ДокументРезультат.ИмяПараметровПечати = "Анализ состояния налогового учета - " + НазваниеОтчета;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Вывести(ДокументРезультат);
	
	КэшМакета 	= Новый Структура;
	КэшМакета.Вставить("РасшифровкаМакета", Неопределено);
	КэшМакета.Вставить("ЭтоСхема",          Ложь);
	КэшМакета.Вставить("Макет",	            ТабличныйДокумент);
	КэшМакетов 	= КэшПараметровОтчета.КэшМакетов;
	
	КэшМакетов.Вставить("Макет_" + СтруктураВП.НомерТекущейСхемы, КэшМакета);
	КэшПараметровОтчета.Вставить("КэшМакетов", КэшМакетов);
	
КонецПроцедуры

Функция ПереходКСхеме(ПараметрыОтчета, НомерСхемы, СтруктураВП, УчитыватьОП = Ложь, ОрганизацияОП = Неопределено)

	РасшифровкаТек = Новый Соответствие;
	РасшифровкаТек.Вставить("Организация", 		 ?(ОрганизацияОП = Неопределено, ПараметрыОтчета.ОрганизацияРасшифровки, ОрганизацияОП));
	РасшифровкаТек.Вставить("НомерТекущейСхемы", НомерСхемы + ?(ПараметрыОтчета.ВключатьОбособленныеПодразделения И УчитыватьОП, 20,0));
	РасшифровкаТек.Вставить("ВидРасшифровки", 	 "Схема");
	
	Возврат РасшифровкаТек;

КонецФункции

Функция ПереходКРасшифровкеСхемы(ПараметрыОтчета, ИдентификаторРасшифровки)
	
	РасшифровкаСхемы = Новый Соответствие;
 	РасшифровкаСхемы.Вставить("ВидРасшифровки",    "Расшифровка");
	РасшифровкаСхемы.Вставить("Организация", 	   ПараметрыОтчета.ОрганизацияРасшифровки);
	РасшифровкаСхемы.Вставить("НомерТекущейСхемы", ИдентификаторРасшифровки);
	
	Возврат РасшифровкаСхемы;
	
КонецФункции
	
Процедура СохранитьИсториюСхемы(КэшПараметровОтчета, ИмяМакета, РасшифровкаМакета, НастройкаРамок, ЭлементыСхемы)
	
	КэшМакета 	= Новый Структура;
	КэшМакета.Вставить("РасшифровкаМакета", РасшифровкаМакета);
	КэшМакета.Вставить("Макет",             ИмяМакета);
	КэшМакета.Вставить("ЭтоСхема",          Истина);
	КэшМакета.Вставить("НастройкаРамок",    НастройкаРамок);
	КэшМакета.Вставить("ОписаниеЗначений",  ОписатьЗначенияСхемы(ЭлементыСхемы));
	
	КэшПараметровОтчета.КэшМакетов.Вставить("Макет_" + КэшПараметровОтчета.СтруктураВП.НомерТекущейСхемы, КэшМакета);
	
КонецПроцедуры

Функция ЗаголовокОтчета(ПараметрыОтчета, Сноска = Ложь)
	
	ПредставлениеПериода = ПараметрыОтчета.ПредставлениеПериода;
	Если Сноска Тогда
		// Не все макеты поддерживают вывод сносок
		СправкиРасчеты.ДополнитьПериодОтчетаПримечанием(ПредставлениеПериода, ПараметрыОтчета);
	КонецЕсли;
	
	Возврат СправкиРасчетыКлиентСервер.ТекстЗаголовка(
		"",
		ПредставлениеПериода,
		ПараметрыОтчета.ПредставлениеОрганизации);
	
КонецФункции

Функция НастроитьРамку(Выборка, Сумма, РамкаЭлемент, ПоказыватьЛегенду, НастройкаРамок, ПоказыватьЗеленый = Ложь)
	
	СуммаБУ = ?(Выборка[Сумма + "БУ"] = Неопределено, 0, Окр(Выборка[Сумма + "БУ"], 2));
	СуммаНУ = ?(Выборка[Сумма + "НУ"] = Неопределено, 0, Окр(Выборка[Сумма + "НУ"], 2));
	СуммаПР = ?(Выборка[Сумма + "ПР"] = Неопределено, 0, Окр(Выборка[Сумма + "ПР"], 2));
	СуммаВР = ?(Выборка[Сумма + "ВР"] = Неопределено, 0, Окр(Выборка[Сумма + "ВР"], 2));
	
	СтроимПрямоугольник = Истина;
	Если (СуммаБУ - СуммаНУ - СуммаПР - СуммаВР < 10 И СуммаБУ - СуммаНУ - СуммаПР - СуммаВР > -10) 
		ИЛИ (Сумма = "Налог" И Выборка.НалогБУКор = 0 И СуммаНУ < 0) Тогда
		
		Если НЕ ПоказыватьЗеленый Тогда			
			СтроимПрямоугольник = Ложь;			
		Иначе			
			ЦветЛинии = WebЦвета.Зеленый;			
		КонецЕсли;		
	Иначе		
		ПоказыватьЛегенду = Истина;
		ЦветЛинии = WebЦвета.Красный;		
	КонецЕсли;
	
	Если СтроимПрямоугольник Тогда		
		РамкаЭлемент.ЦветРамки 	= ЦветЛинии;
		РамкаЭлемент.Фигура		= ФигурыГрафическойСхемы.Блок;
		НастройкаРамок.Вставить(РамкаЭлемент.Имя, ?(ЦветЛинии = WebЦвета.Красный, 1, 0));	
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьСхему(ЭлементыСхемы, Выборка, Колонки)
	                                                            
	Для Каждого ЭлементВыборки Из Колонки Цикл		
		Для НомерЭлемента = 0 По ЭлементыСхемы.Количество() - 1 Цикл			
			Если ВРег(ЭлементыСхемы.Получить(НомерЭлемента).Имя) = ВРег(ЭлементВыборки.Имя) Тогда			
				ПоказательОтчета = Выборка[ЭлементВыборки.Имя];
				ЗначениеПоказателяОтчета = ?(ПоказательОтчета = Неопределено 
					ИЛИ Выборка[ЭлементВыборки.Имя] = 0, "",
					?(ТипЗнч(ПоказательОтчета) = Тип("Число"),
					Формат(ПоказательОтчета, "ЧЦ=20; ЧДЦ=0; ЧРГ=' '"), ПоказательОтчета));
				
				ЭлементыСхемы[ЭлементВыборки.Имя].Наименование = ЗначениеПоказателяОтчета;				
			КонецЕсли;			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ОписатьЗначенияСхемы(ЭлементыСхемы)
	
	СтруктураОписания = Новый Структура;
	
	Для НомерЭлемента = 0 По ЭлементыСхемы.Количество() - 1 Цикл		
		Если ЭлементыСхемы.Получить(НомерЭлемента).Наименование <> "" Тогда			
			ЗначениеПоказателяОтчета = ЭлементыСхемы.Получить(НомерЭлемента).Наименование;
			СтруктураОписания.Вставить(ЭлементыСхемы.Получить(НомерЭлемента).Имя,
				?(ЗначениеПоказателяОтчета = "0", "", ЗначениеПоказателяОтчета));			
		КонецЕсли;	
	КонецЦикла;
	
	Возврат СтруктураОписания;
	
КонецФункции

#КонецОбласти

#КонецЕсли