#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		Или ОбменДанными.Загрузка
		ИЛИ ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВыборкиНачальныхДанных = "
	|ВЫБРАТЬ
	|	НДСКВозмещению.Период,
	|	НДСКВозмещению.Регистратор,
	|	НДСКВозмещению.Организация,
	|	НДСКВозмещению.ВидОперацииПоступления,
	|	НДСКВозмещению.СтавкаНДС,
	|	НДСКВозмещению.Контрагент,
	|	НДСКВозмещению.ВидОборота,
	|	НДСКВозмещению.КорректируемыйПериод,
	|	НДСКВозмещению.СчетФактура,
	|	НДСКВозмещению.ДоговорКонтрагента,
	|	НДСКВозмещению.ЗаписьДополнительнойДекларации,
	|	НДСКВозмещению.НалоговыйПериод,
	|
	|	НДСКВозмещению.СуммаБезНДС,
	|	НДСКВозмещению.УплаченныйНДС,
	|	НДСКВозмещению.СуммаНДС,
	|
	|	НДСКВозмещению.ЗакупкаПодДеятельность
	|
	|ПОМЕСТИТЬ НДСКВозмещениюПередЗаписью
	|ИЗ
	|	РегистрНакопления.НДСКВозмещению КАК НДСКВозмещению
	|ГДЕ
	|	НДСКВозмещению.Регистратор = &Регистратор
	|";
	
	Запрос = Новый Запрос;
	Если ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.Свойство("МенеджерВременныхТаблицНДС") Тогда
		Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблицНДС;
	Иначе
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	Если НЕ Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("НДСКВозмещениюПередЗаписью") = Неопределено Тогда
		ТекстУничтожитьВТ = "
		|УНИЧТОЖИТЬ НДСКВозмещениюПередЗаписью
		|;";
	Иначе
		ТекстУничтожитьВТ = "";
	КонецЕсли;
	
	Запрос.Текст = ТекстУничтожитьВТ + ТекстВыборкиНачальныхДанных;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	
	Запрос.Выполнить();
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.Вставить("МенеджерВременныхТаблицНДС", Запрос.МенеджерВременныхТаблиц);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		Или НЕ ДополнительныеСвойства.Свойство("РежимЗаписи")	
		Или ОбменДанными.Загрузка
		ИЛИ ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Возврат;
	КонецЕсли;
		
	Если НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") 
		И НЕ ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.Свойство("МенеджерВременныхТаблицНДС") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КОНЕЦПЕРИОДА(Таблица.Период, КВАРТАЛ) КАК Месяц,
	|	ЗНАЧЕНИЕ(Перечисление.ОперацииЗакрытияМесяца.РаспределениеНДС) КАК Операция,
	|	Таблица.Организация КАК Организация,
	|	Таблица.Регистратор КАК Документ
	|ИЗ
	|	(ВЫБРАТЬ
	|		НДС.Период КАК Период,
	|		НДС.Регистратор КАК Регистратор,
	|		НДС.Организация КАК Организация,
	|		НДС.ВидОперацииПоступления КАК ВидОперацииПоступления,
	|		НДС.СтавкаНДС КАК СтавкаНДС,
	|		НДС.Контрагент КАК Контрагент,
	|		НДС.ВидОборота КАК ВидОборота,
	|		НДС.КорректируемыйПериод КАК КорректируемыйПериод,
	|		НДС.СчетФактура КАК СчетФактура,
	|		НДС.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|		НДС.ЗаписьДополнительнойДекларации КАК ЗаписьДополнительнойДекларации,
	|		НДС.НалоговыйПериод КАК НалоговыйПериод,
	|		НДС.СуммаБезНДС КАК СуммаБезНДС,
	|		НДС.УплаченныйНДС КАК УплаченныйНДС,
	|		НДС.СуммаНДС КАК СуммаНДС,
	|		НДС.ЗакупкаПодДеятельность КАК ЗакупкаПодДеятельность
	|	ИЗ
	|		НДСКВозмещениюПередЗаписью КАК НДС
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДС.Период,
	|		НДС.Регистратор,
	|		НДС.Организация,
	|		НДС.ВидОперацииПоступления,
	|		НДС.СтавкаНДС,
	|		НДС.Контрагент,
	|		НДС.ВидОборота,
	|		НДС.КорректируемыйПериод,
	|		НДС.СчетФактура,
	|		НДС.ДоговорКонтрагента,
	|		НДС.ЗаписьДополнительнойДекларации,
	|		НДС.НалоговыйПериод,
	|		-НДС.СуммаБезНДС,
	|		-НДС.УплаченныйНДС,
	|		-НДС.СуммаНДС,
	|		НДС.ЗакупкаПодДеятельность
	|	ИЗ
	|		РегистрНакопления.НДСКВозмещению КАК НДС
	|	ГДЕ
	|		НДС.Регистратор = &Регистратор) КАК Таблица
	|
	|СГРУППИРОВАТЬ ПО
	|	КОНЕЦПЕРИОДА(Таблица.Период, КВАРТАЛ),
	|	Таблица.Период,
	|	Таблица.Регистратор,
	|	Таблица.Организация,
	|	Таблица.ВидОперацииПоступления,
	|	Таблица.СтавкаНДС,
	|	Таблица.Контрагент,
	|	Таблица.ВидОборота,
	|	Таблица.КорректируемыйПериод,
	|	Таблица.СчетФактура,
	|	Таблица.ДоговорКонтрагента,
	|	Таблица.ЗаписьДополнительнойДекларации,
	|	Таблица.НалоговыйПериод,
	|	Таблица.ЗакупкаПодДеятельность
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Таблица.СуммаБезНДС) <> 0
	|		ИЛИ СУММА(Таблица.УплаченныйНДС) <> 0
	|		ИЛИ СУММА(Таблица.СуммаНДС) <> 0)");
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблицНДС;
	
	Если Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("НДСКВозмещениюПередЗаписью") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	
	ТаблицаЗаданий = Запрос.Выполнить().Выгрузить();
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаЗаданий", ТаблицаЗаданий);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.Месяц 		КАК Месяц,
	|	Таблица.Операция 	КАК Операция,
	|	Таблица.Организация КАК Организация,
	|	Таблица.Документ    КАК Документ
	|ПОМЕСТИТЬ НДСКВозмещениюЗаданияКЗакрытиюМесяца
	|ИЗ
	|	&ТаблицаЗаданий КАК Таблица";
	
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
