#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение () Экспорт
	
	ЗаполнитьПрименениеВычетовПоВидамДохода();
	
КонецПроцедуры

Процедура ЗаполнитьПрименениеВычетовПоВидамДохода() Экспорт
	
	НаборЗаписей = РегистрыСведений.ПрименениеВычетовПоВидамДохода.СоздатьНаборЗаписей();

	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20190101', Справочники.ВидыВычетовИПН.Стандартный75МЗПИнвалиды, Справочники.ВидыДоходов.ДоходыОтРаботодателя, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20190101', Справочники.ВидыВычетовИПН.Стандартный75МЗПИнвалиды, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20190101', Справочники.ВидыВычетовИПН.Стандартный75МЗПРодители, Справочники.ВидыДоходов.ДоходыОтРаботодателя, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20190101', Справочники.ВидыВычетовИПН.Стандартный75МЗПРодители, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, Истина);
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ДобавитьРазмерЛьготИПН(НаборЗаписей, Период, ВидВычетаИПН, ВидДохода, Используется)
	
   	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;  
	НоваяЗапись.ВидВычетаИПН = ВидВычетаИПН;
	НоваяЗапись.ВидДохода = ВидДохода;
	НоваяЗапись.Используется = Используется;
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли