#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		
		Если СтрокаНабора.Период < Дата('20190101') Тогда
			
			ВызватьИсключение НСтр("ru = 'Применение вычетов по разным видам дохода поддерживается с 2019 года'");	
			
		КонецЕсли;
		
		РеквизитыВычета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаНабора.ВидВычетаИПН, "ПредоставлениеВычета, Предопределенный"); 
		
		Если РеквизитыВычета.Предопределенный И НЕ (СтрокаНабора.ВидВычетаИПН = Справочники.ВидыВычетовИПН.Стандартный75МЗПИнвалиды
			ИЛИ СтрокаНабора.ВидВычетаИПН = Справочники.ВидыВычетовИПН.Стандартный75МЗПРодители) Тогда
			
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Применение суммы вычета по разным видам дохода допускается использовать для видов вычета: %1, %2'"), Справочники.ВидыВычетовИПН.Стандартный75МЗПИнвалиды, Справочники.ВидыВычетовИПН.Стандартный75МЗПРодители)
			
		КонецЕсли;
		
		Если РеквизитыВычета.ПредоставлениеВычета = Перечисления.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов Тогда
			
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Применение суммы вычета по разным видам дохода не допускается для вычета с предоставлением ""По исчисленной сумме взносов"": %1'"), СтрокаНабора.ВидВычетаИПН);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
