#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура игр_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	игр_ДобавитьИзменитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура игр_КатегорияТовараПриИзменении(Элемент)
	
	Если Объект.ХарактеристикиТовараКаспи.Количество() = 0 Тогда
		
		игр_ПолучитьХарактеристикиКаспи(Объект.КатегорияТовара);
		
	КонецЕсли; 
КонецПроцедуры   

&НаКлиенте
Процедура игр_ХарактеристикиТовараКаспиЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные	= Элементы.игр_ХарактеристикиТовараКаспи.ТекущиеДанные;

	Элементы.игр_ХарактеристикиТовараКаспи.ТекущийЭлемент.РежимВыбораИзСписка	= Ложь;   
	Элементы.игр_ХарактеристикиТовараКаспи.ТекущийЭлемент.СписокВыбора.Очистить();
	
	Если ТекущиеДанные.Тип = "enum" Тогда
		
		Элементы.игр_ХарактеристикиТовараКаспи.ТекущийЭлемент.РежимВыбораИзСписка	= Истина;   
		ЗначениеПеречисления	= игр_ПолучитьЗначениеЕнум(Объект.КатегорияТовара, ТекущиеДанные.Характеристика);
		Элементы.игр_ХарактеристикиТовараКаспи.ТекущийЭлемент.СписокВыбора.ЗагрузитьЗначения(ЗначениеПеречисления);  
		
	ИначеЕсли ТекущиеДанные.Тип = "boolean" тогда  
		
		Элементы.игр_ХарактеристикиТовараКаспи.ТекущийЭлемент.РежимВыбораИзСписка	= Истина;   
		МассивЗначений	= Новый Массив;
		МассивЗначений.Добавить("да");
		МассивЗначений.Добавить("нет");
		Элементы.игр_ХарактеристикиТовараКаспи.ТекущийЭлемент.СписокВыбора.ЗагрузитьЗначения(МассивЗначений);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура игр_ХарактеристикиТовараКаспиПриИзменении(Элемент)
	
	Если Объект.ВыгруженНаКаспи Тогда
		
		Объект.ВыгруженНаКаспи	= Ложь;     
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция игр_ПолучитьХарактеристикиКаспи(Категория)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДопСвойстваТоваровКаспи.Свойство КАК Характеристика,
		|	ДопСвойстваТоваровКаспи.Значение КАК Значение,
		|	ДопСвойстваТоваровКаспи.Обязательный КАК Обязательный,
		|	ДопСвойстваТоваровКаспи.Тип КАК Тип,
		|	ДопСвойстваТоваровКаспи.СвойствоКаспи КАК ХарактеристикаКаспи
		|ИЗ
		|	РегистрСведений.ДопСвойстваТоваровКаспи КАК ДопСвойстваТоваровКаспи
		|ГДЕ
		|	ДопСвойстваТоваровКаспи.Категория = &Категория";
	
	Запрос.УстановитьПараметр("Категория", Категория);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить(); 
	
	ТаблицаСвойства	= ТаблицаРезультата.Скопировать();
	
	ТаблицаСвойства.Свернуть("Характеристика, Обязательный, Тип, ХарактеристикаКаспи","");
	
	РеквизитОбъект	= РеквизитФормыВЗначение("Объект");
	
	РеквизитОбъект.ХарактеристикиТовараКаспи.Загрузить(ТаблицаСвойства);
	
	ЗначениеВРеквизитФормы(РеквизитОбъект,"Объект");
	
КонецФункции

&НаСервере
Функция игр_ПолучитьЗначениеЕнум(Категория, Характеристика)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДопСвойстваТоваровКаспи.Свойство КАК Характеристика,
		|	ДопСвойстваТоваровКаспи.Значение КАК Значение,
		|	ДопСвойстваТоваровКаспи.Обязательный КАК Обязательный
		|ИЗ
		|	РегистрСведений.ДопСвойстваТоваровКаспи КАК ДопСвойстваТоваровКаспи
		|ГДЕ
		|	ДопСвойстваТоваровКаспи.Категория = &Категория
		|	И ДопСвойстваТоваровКаспи.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.УстановитьПараметр("Свойство", Характеристика);
	
	Результат = Запрос.Выполнить().Выгрузить(); 
	
	Возврат Результат.ВыгрузитьКолонку("Значение");
	
КонецФункции

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьПоПараметрам")
Процедура игр_ЗаполнитьПоПараметрам()

	Если Параметры.Свойство("ВидАлкогольнойПродукцииЕГАИС")
		Или Параметры.Свойство("Параметры.ИмпортерЕГАИС")
		Или Параметры.Свойство("Параметры.ОбъемЕГАИС")
		Или Параметры.Свойство("Параметры.ПроизводительЕГАИС")
		Или Параметры.Свойство("Параметры.КрепостьЕГАИС") Тогда

		РеквизитыЕГАИССтруктура = Новый Структура();
		РеквизитыЕГАИССтруктура.Вставить("ВидАлкогольнойПродукцииЕГАИС");
		РеквизитыЕГАИССтруктура.Вставить("ИмпортерЕГАИС");
		РеквизитыЕГАИССтруктура.Вставить("ПроизводительЕГАИС");
		РеквизитыЕГАИССтруктура.Вставить("ОбъемЕГАИС", 0);
		РеквизитыЕГАИССтруктура.Вставить("КрепостьЕГАИС", 0);

		ЗаполнитьЗначенияСвойств(РеквизитыЕГАИССтруктура, Параметры);

		РеквизитыЕГАИС = Новый ФиксированнаяСтруктура(РеквизитыЕГАИССтруктура);

		Запрос = Новый Запрос();
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВидыНоменклатуры.Ссылка) КАК Количество
		|ПОМЕСТИТЬ ВТКоличествоВидовНоменклатурыСАлкогольнойПродукциейИВидом
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|ГДЕ
		|	ВидыНоменклатуры.АлкогольнаяПродукция = ИСТИНА
		|	И ВидыНоменклатуры.ВидАлкогольнойПродукции = &ВидАлкогольнойПродукции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВидыНоменклатуры.Ссылка) КАК Количество
		|ПОМЕСТИТЬ ВТКоличествоВидовНоменклатурыСАлкогольнойПродукцией
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|ГДЕ
		|	ВидыНоменклатуры.АлкогольнаяПродукция = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыНоменклатуры.Ссылка КАК Ссылка,
		|	ТаблицаКоличество.Количество КАК Количество
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличествоВидовНоменклатурыСАлкогольнойПродукциейИВидом КАК ТаблицаКоличество
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВидыНоменклатуры.АлкогольнаяПродукция = ИСТИНА
		|	И ВидыНоменклатуры.ВидАлкогольнойПродукции = &ВидАлкогольнойПродукции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыНоменклатуры.Ссылка КАК Ссылка,
		|	ТаблицаКоличество.Количество КАК Количество
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличествоВидовНоменклатурыСАлкогольнойПродукцией КАК ТаблицаКоличество
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВидыНоменклатуры.АлкогольнаяПродукция = ИСТИНА";
		Запрос.УстановитьПараметр("ВидАлкогольнойПродукции", РеквизитыЕГАИССтруктура.ВидАлкогольнойПродукцииЕГАИС);
		Результат = Запрос.ВыполнитьПакет();
		ВыборкаПоВидуАлкогольнойПродукции = Результат[2].Выбрать();
		ВыборкаПоАлкогольнойПродукции = Результат[3].Выбрать();

		Если ВыборкаПоВидуАлкогольнойПродукции.Следующий() Тогда
			Если ВыборкаПоВидуАлкогольнойПродукции.Количество = 1 Тогда
				Объект.ВидНоменклатуры = ВыборкаПоВидуАлкогольнойПродукции.Ссылка;
			КонецЕсли;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Объект.ВидНоменклатуры)
			И ВыборкаПоАлкогольнойПродукции.Следующий() Тогда
			Если ВыборкаПоАлкогольнойПродукции.Количество = 1 Тогда
				Объект.ВидНоменклатуры = ВыборкаПоАлкогольнойПродукции.Ссылка;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда

		СправочникОбъект = РеквизитФормыВЗначение("Объект");
		СправочникОбъект.Заполнить(Неопределено);
		ЗначениеВРеквизитФормы(СправочникОбъект, "Объект");

		ЕстьПравоРедактирования = Истина;

		// Новый элемент номенклатуры создан копированием, реквизиты формы заполняются
		// значениями реквизитов параметра копирования.
		ИсточникКопирования = Параметры.ЗначениеКопирования;
		#Удаление
		ЗаполнитьЗначенияСвойств(Объект, ИсточникКопирования, , "ГруппаДоступа, ФайлКартинки, ФайлОписанияДляСайта, 
		|ДополнительныеРеквизиты, ДрагоценныеМатериалы, Код, ПометкаУдаления");
		#КонецУдаления
		#Вставка
		ЗаполнитьЗначенияСвойств(Объект, ИсточникКопирования, , "ГруппаДоступа, ФайлКартинки, ФайлОписанияДляСайта, 
		|ДополнительныеРеквизиты, ДрагоценныеМатериалы, Код, ПометкаУдаления, ХарактеристикиТовараКаспи");
		#КонецВставки

		Объект.ДополнительныеРеквизиты.Загрузить(ИсточникКопирования.ДополнительныеРеквизиты.Выгрузить());
		//++ НЕ УТ
		Объект.ДрагоценныеМатериалы.Загрузить(ИсточникКопирования.ДрагоценныеМатериалы.Выгрузить());
		//-- НЕ УТ

		СтруктураРеквизитовОбъектаКопирования = Новый Структура;
		СтруктураРеквизитовОбъектаКопирования.Вставить("ОбъектКопирования",          ИсточникКопирования);
		СтруктураРеквизитовОбъектаКопирования.Вставить("Наименование",               Объект.Наименование);
		СтруктураРеквизитовОбъектаКопирования.Вставить("ВидНоменклатуры",            Объект.ВидНоменклатуры);
		СтруктураРеквизитовОбъектаКопирования.Вставить("ИспользоватьУпаковки",       Объект.ИспользоватьУпаковки);
		СтруктураРеквизитовОбъектаКопирования.Вставить("НаборУпаковок",              Объект.НаборУпаковок);
		СтруктураРеквизитовОбъектаКопирования.Вставить("ИспользованиеХарактеристик", Объект.ИспользованиеХарактеристик);
		СтруктураРеквизитовОбъектаКопирования.Вставить("ТипНоменклатуры",            Объект.ТипНоменклатуры);

		РеквизитыОбъектаКопирования = Новый ФиксированнаяСтруктура(СтруктураРеквизитовОбъектаКопирования);

		НаименованиеЗаполнение       = Объект.Наименование;
		НаименованиеПолноеЗаполнение = Объект.НаименованиеПолное;
		ВидНоменклатуры              = Объект.ВидНоменклатуры;
		ГруппаНоменклатуры           = Объект.Родитель;

		Если Параметры.Свойство("СозданиеНекачественногоТовара") Тогда

			СозданиеНекачественногоТовара = Истина;
			Автозаголовок = Ложь;

			ТекстЗаголовка = НСтр("ru='Создание номенклатуры для испорченного товара ""%НаименованиеТовара%"".'");
			Заголовок = СтрЗаменить(ТекстЗаголовка, "%НаименованиеТовара%", Строка(Объект.Наименование));

			Объект.Качество        = Параметры.СозданиеНекачественногоТовара;
			Объект.СкладскаяГруппа = Справочники.СкладскиеГруппыНоменклатуры.ПустаяСсылка();
			Объект.ЦеноваяГруппа   = Справочники.ЦеновыеГруппы.ПустаяСсылка();
			Объект.ФайлКартинки    = Справочники.НоменклатураПрисоединенныеФайлы.ПустаяСсылка();

			НаименованиеЗаполнение       = Объект.Наименование + ", " + Строка(Объект.Качество);
			НаименованиеПолноеЗаполнение = Объект.НаименованиеПолное + ", " + Строка(Объект.Качество);

		ИначеЕсли  Параметры.Свойство("НаименованиеНоменклатурыПоставщика") 
			И ЗначениеЗаполнено(Параметры.НаименованиеНоменклатурыПоставщика) Тогда

			НаименованиеЗаполнение = Параметры.НаименованиеНоменклатурыПоставщика;

		ИначеЕсли Параметры.Свойство("НаименованиеНоменклатурыЕГАИС")
			Или Параметры.Свойство("ПолноеНаименованиеНоменклатурыЕГАИС") Тогда 

			Если Параметры.Свойство("НаименованиеНоменклатурыЕГАИС") 
				И ЗначениеЗаполнено(Параметры.НаименованиеНоменклатурыЕГАИС) Тогда
				НаименованиеЗаполнение = Параметры.НаименованиеНоменклатурыЕГАИС;
			КонецЕсли;


			Если Параметры.Свойство("ПолноеНаименованиеНоменклатурыЕГАИС") 
				И ЗначениеЗаполнено(Параметры.ПолноеНаименованиеНоменклатурыЕГАИС) Тогда
				НаименованиеПолноеЗаполнение = Параметры.ПолноеНаименованиеНоменклатурыЕГАИС;
			КонецЕсли;

		КонецЕсли;

		Если Параметры.Свойство("АртикулНоменклатурыПоставщика") 
			И ЗначениеЗаполнено(Параметры.АртикулНоменклатурыПоставщика) Тогда

			Объект.Артикул = Параметры.АртикулНоменклатурыПоставщика;

		КонецЕсли;

		Если ЗначениеЗаполнено(ИсточникКопирования.ФайлКартинки)
			Или ЗначениеЗаполнено(ИсточникКопирования.ФайлОписанияДляСайта) Тогда

			СкопироватьПрисоединенныеФайлы(ИсточникКопирования.ФайлКартинки, ИсточникКопирования.ФайлОписанияДляСайта);

		КонецЕсли;

		ЕстьИндивидуальныеХарактеристикиВОбъектеКопирования = 
		(РеквизитыОбъектаКопирования.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры);

		Объект.Наименование       = НаименованиеЗаполнение;
		Объект.НаименованиеПолное = НаименованиеПолноеЗаполнение;

		ЕстьИндивидуальныеУпаковкиВОбъектеКопирования = РеквизитыОбъектаКопирования.ИспользоватьУпаковки 
		И (РеквизитыОбъектаКопирования.НаборУпаковок = Справочники.НаборыУпаковок.ИндивидуальныйДляНоменклатуры);

		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция
		|ИЗ
		|	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
		|ГДЕ
		|	СоответствиеНоменклатурыЕГАИС.Номенклатура = &Номенклатура";
		Запрос.УстановитьПараметр("Номенклатура", ИсточникКопирования);

		ЕстьСвязьСКлассификаторомАлкогольнойПродукцииЕГАИСВОбъектеКопирования = Не Запрос.Выполнить().Пустой();

		КопироватьИндивидуальныеУпаковки       = ЕстьИндивидуальныеУпаковкиВОбъектеКопирования;
		КопироватьИндивидуальныеХарактеристики = ЕстьИндивидуальныеХарактеристикиВОбъектеКопирования;
		КопироватьСвязьСКлассификаторомАлкогольнойПродукцииЕГАИС = ЕстьСвязьСКлассификаторомАлкогольнойПродукцииЕГАИСВОбъектеКопирования;

		ВидНоменклатурыПриИзмененииНаСервере(Истина);

	ИначеЕсли Не ЗначениеЗаполнено(Объект.Ссылка) Тогда

		СправочникОбъект = РеквизитФормыВЗначение("Объект");
		СправочникОбъект.Заполнить(Неопределено);
		ЗначениеВРеквизитФормы(СправочникОбъект, "Объект");

		ЕстьПравоРедактирования = Истина;

		// Создается новый элемент номенклатуры.
		Параметры.Свойство("ВидНоменклатуры", ВидНоменклатуры);
		Параметры.Свойство("Родитель", ГруппаНоменклатуры);
		Если ВидНоменклатуры = Неопределено
			И ЗначениеЗаполнено(Объект.ВидНоменклатуры) Тогда
			ВидНоменклатуры = Объект.ВидНоменклатуры;
		ИначеЕсли ВидНоменклатуры = Неопределено
			И Не ЗначениеЗаполнено(Объект.ВидНоменклатуры) Тогда
			ВидНоменклатуры = Справочники.ВидыНоменклатуры.ПустаяСсылка();
		КонецЕсли;
		Если ГруппаНоменклатуры = Неопределено Тогда
			ГруппаНоменклатуры = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;

		Если Параметры.Свойство("ТекстЗаполнения")
			И ЗначениеЗаполнено(Параметры.ТекстЗаполнения) Тогда
			НаименованиеЗаполнение = Параметры.ТекстЗаполнения;
		КонецЕсли;

		Если Параметры.Свойство("НаименованиеНоменклатурыПоставщика")
			И ЗначениеЗаполнено(Параметры.НаименованиеНоменклатурыПоставщика) Тогда
			НаименованиеЗаполнение = Параметры.НаименованиеНоменклатурыПоставщика;
		КонецЕсли;


		Если Параметры.Свойство("АртикулНоменклатурыПоставщика")
			И ЗначениеЗаполнено(Параметры.АртикулНоменклатурыПоставщика) Тогда
			Объект.Артикул = Параметры.АртикулНоменклатурыПоставщика;
		КонецЕсли;

		Если Параметры.Свойство("НаименованиеНоменклатурыЕГАИС")
			Или Параметры.Свойство("ПолноеНаименованиеНоменклатурыЕГАИС") Тогда 

			Если Параметры.Свойство("НаименованиеНоменклатурыЕГАИС") 
				И ЗначениеЗаполнено(Параметры.НаименованиеНоменклатурыЕГАИС) Тогда
				НаименованиеЗаполнение = Параметры.НаименованиеНоменклатурыЕГАИС;
			КонецЕсли;


			Если Параметры.Свойство("ПолноеНаименованиеНоменклатурыЕГАИС") 
				И ЗначениеЗаполнено(Параметры.ПолноеНаименованиеНоменклатурыЕГАИС) Тогда
				НаименованиеПолноеЗаполнение = Параметры.ПолноеНаименованиеНоменклатурыЕГАИС;
			КонецЕсли;

		КонецЕсли;

		Объект.Наименование       = НаименованиеЗаполнение;
		Объект.НаименованиеПолное = НаименованиеПолноеЗаполнение;

		Если Параметры.Свойство("АртикулНоменклатурыПоставщика") 
			И ЗначениеЗаполнено(Параметры.АртикулНоменклатурыПоставщика) Тогда

			Объект.Артикул = Параметры.АртикулНоменклатурыПоставщика;

		КонецЕсли;

		РеквизитыОбъектаКопирования = Неопределено;

		Объект.Качество  = Перечисления.ГрадацииКачества.Новый;
		Объект.СтавкаНДС = Перечисления.СтавкиНДС.НДС18;

		ВидНоменклатурыГруппа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ЭтоГруппа");

		Если ВидНоменклатуры.Пустая()
			Или ВидНоменклатурыГруппа Тогда
			ВидНоменклатуры = Справочники.ВидыНоменклатуры.ВидНоменклатурыПоУмолчанию();
		КонецЕсли;

		Объект.Родитель        = ГруппаНоменклатуры;
		Объект.ВидНоменклатуры = ВидНоменклатуры;

		Если ЗначениеЗаполнено(ВидНоменклатуры) Тогда

			Если Параметры.Свойство("АдресТаблицыПараметров") Тогда

				СтруктураПарметровДереваОтборов = Новый Структура("ВидНоменклатуры, АдресТаблицыСопоставления");
				СтруктураПарметровДереваОтборов.ВидНоменклатуры           = ВидНоменклатуры;
				СтруктураПарметровДереваОтборов.АдресТаблицыСопоставления = Параметры.АдресТаблицыСопоставления;

				АдресТаблицы = Параметры.АдресТаблицыПараметров;

			КонецЕсли;

			ТаблицаДопРеквизитов = Новый ТаблицаЗначений;
			ТаблицаДопРеквизитов.Колонки.Добавить("ИмяРеквизита", Новый ОписаниеТипов("Строка",,,Новый КвалификаторыСтроки(255)));

			ВидНоменклатурыПриИзмененииНаСервере();

			Если ЗначениеЗаполнено(АдресТаблицы) Тогда

				ЕстьЗначенияБыстрогоОтбора = Истина;

				ТаблицаЗначенийРеквизитов = ПолучитьИзВременногоХранилища(АдресТаблицы);
				МассивРеквизитов = ТаблицаЗначенийРеквизитов.НайтиСтроки(Новый Структура("ЭтоДопРеквизит", Ложь));

				Для Каждого ЭлементМассива Из МассивРеквизитов Цикл
					Объект[ЭлементМассива.ИмяРеквизита] = ЭлементМассива.ЗначениеОтбора;
				КонецЦикла;

				МассивДопРеквизитов = ТаблицаЗначенийРеквизитов.НайтиСтроки(Новый Структура("ЭтоДопРеквизит", Истина));

				Если ИспользоватьДополнительныеРеквизитыИСведения И МассивДопРеквизитов.Количество() > 0 Тогда

					Для Каждого ЭлементМассива Из МассивДопРеквизитов Цикл

						НоваяСтрока = ТаблицаДопРеквизитов.Добавить();
						НоваяСтрока.ИмяРеквизита = ЭлементМассива.ИмяРеквизита;

					КонецЦикла;

					Запрос = Новый Запрос;
					Запрос.Текст =
					"ВЫБРАТЬ
					|	ТаблицаДопРеквизитов.ИмяРеквизита
					|ПОМЕСТИТЬ ТаблицаИменСвойств
					|ИЗ
					|	&ТаблицаДопРеквизитов КАК ТаблицаДопРеквизитов
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ТаблицаИменСвойств.ИмяРеквизита КАК ИмяРеквизита,
					|	НаборыДополнительныхРеквизитов.Свойство КАК Свойство
					|ИЗ
					|	ТаблицаИменСвойств КАК ТаблицаИменСвойств
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитов
					|		ПО ТаблицаИменСвойств.ИмяРеквизита = НаборыДополнительныхРеквизитов.Свойство.Наименование
					|ГДЕ
					|	НаборыДополнительныхРеквизитов.Ссылка = &НаборРеквизитов";

					Запрос.УстановитьПараметр("ТаблицаДопРеквизитов", ТаблицаДопРеквизитов);
					Запрос.УстановитьПараметр("НаборРеквизитов",      РеквизитыВидаНоменклатуры.НаборСвойств);

					ТаблицаСвойств = Запрос.Выполнить().Выгрузить();
					СтруктураПоиска = Новый Структура("ИмяРеквизита");

					Для Каждого СтрокаТаблицы Из ТаблицаСвойств Цикл

						СтруктураПоискаЗначения = Новый Структура("Свойство", СтрокаТаблицы.Свойство);
						МассивСтрок = ЭтаФорма.Свойства_ОписаниеДополнительныхРеквизитов.НайтиСтроки(СтруктураПоискаЗначения);
						ОписаниеСвойства = МассивСтрок[0];
						ПутьКДанным = ОписаниеСвойства.ИмяРеквизитаЗначение;

						СтруктураПоиска.ИмяРеквизита = СтрокаТаблицы.ИмяРеквизита;
						МассивСтрокЗначение = ТаблицаЗначенийРеквизитов.НайтиСтроки(СтруктураПоиска);
						ЗначениеРеквизита = МассивСтрокЗначение[0].ЗначениеОтбора;
						ЭтаФорма[ПутьКДанным] = ЗначениеРеквизита;

					КонецЦикла;

				КонецЕсли;
			КонецЕсли;

		Иначе
			ОбновитьКешРеквизитовВидаНоменклатуры();
		КонецЕсли;

		// ЭлектронноеВзаимодействие.РаботаСНоменклатурой
		Если Параметры.Свойство("АдресДанныхЗаполнения") и ЭтоАдресВременногоХранилища(Параметры.АдресДанныхЗаполнения) Тогда

			ТаблицаСНоменклатурой = ПолучитьИзВременногоХранилища(Параметры.АдресДанныхЗаполнения);
			ЕстьДопРеквизиты = ТаблицаСНоменклатурой.Колонки.Найти("ДополнительныеРеквизиты") <> Неопределено;
			ЕстьКлассификаторы  = ТаблицаСНоменклатурой.Колонки.Найти("Классификаторы") <> Неопределено;

			Для каждого ДанныеЗаполнения Из ТаблицаСНоменклатурой Цикл

				СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка();
				РаботаСНоменклатуройУТ.ПреобразоватьСтавкуНДССервиса(ДанныеЗаполнения.СтавкаНДС, СтавкаНДС);

				СсылкаНаЕдиницуИзмерения = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
				РаботаСНоменклатуройУТ.ЕдиницаИзмеренияПоДаннымСервиса(ДанныеЗаполнения.ЕдиницаИзмерения, СсылкаНаЕдиницуИзмерения);

				НаименованиеПолное = ?(ЗначениеЗаполнено(ДанныеЗаполнения.НаименованиеДляПечати), ДанныеЗаполнения.НаименованиеДляПечати, 
				ДанныеЗаполнения.Наименование);
				Объект.Наименование = ДанныеЗаполнения.Наименование;
				Объект.Артикул = ДанныеЗаполнения.Артикул;
				Объект.НаименованиеПолное = НаименованиеПолное;
				Объект.ЕдиницаИзмерения = СсылкаНаЕдиницуИзмерения;
				Объект.СтавкаНДС = СтавкаНДС;
				Объект.Описание = ДанныеЗаполнения.Описание;
				Если ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВидовНоменклатуры") Тогда
					Объект.ВидНоменклатуры = ДанныеЗаполнения.ВидНоменклатурыПоУмолчанию.ВидНоменклатуры;
				Иначе
					МассивВидов = Справочники.ВидыНоменклатуры.ПолучитьПредустановленныеВидыНоменклатуры();
					Для каждого ТекВид Из МассивВидов Цикл
						Если ТекВид.Наименование = ДанныеЗаполнения.Тип Тогда
							Объект.ВидНоменклатуры = ТекВид;
						КонецЕсли;
					КонецЦикла; 
				КонецЕсли;;
				Объект.ГруппаДоступа = Константы.ГруппаДоступаНоменклатурыИзСервиса.Получить();

				Если ЗначениеЗаполнено(Объект.ВидНоменклатуры) Тогда
					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидНоменклатуры, "ИспользованиеХарактеристик");
					Объект.ИспользованиеХарактеристик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидНоменклатуры, "ИспользованиеХарактеристик");
				КонецЕсли;

				Если ЕстьДопРеквизиты Тогда
					Для каждого ЭлементКоллекции Из ДанныеЗаполнения.ДополнительныеРеквизиты Цикл
						НоваяСтрока = Объект.ДополнительныеРеквизиты.Добавить();
						НоваяСтрока.Свойство = ЭлементКоллекции.РеквизитИнформационнойБазы;
						НоваяСтрока.Значение = РаботаСНоменклатурой.ЗначениеДополнительногоРеквизита(ЭлементКоллекции);
					КонецЦикла; 
					УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтаФорма, Объект);
				КонецЕсли;

				Если ЗначениеЗаполнено(ДанныеЗаполнения.Изображения) Тогда
					ИзображенияИзСервиса.ЗагрузитьЗначения(ДанныеЗаполнения.Изображения.ВыгрузитьКолонку("ИзображениеURL"));
				КонецЕсли;
				Если ДанныеЗаполнения.ШтрихКоды.Количество() > 0
					или ДанныеЗаполнения.Характеристики.Количество() > 0 Тогда
					Штрихкоды = Новый ТаблицаЗначений;
					Штрихкоды.Колонки.Добавить("Номенклатура");
					Штрихкоды.Колонки.Добавить("Характеристика");
					Штрихкоды.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка"));
				КонецЕсли;
				Если ДанныеЗаполнения.ШтрихКоды.Количество() > 0 Тогда
					Для каждого Штрихкод Из ДанныеЗаполнения.Штрихкоды Цикл
						НоваяСтрока = Штрихкоды.Добавить();
						НоваяСтрока.ШтрихКод = Штрихкод;
					КонецЦикла;
					ШтрихкодыСервис = ПоместитьВоВременноеХранилище(Штрихкоды, УникальныйИдентификатор);
				ИначеЕсли ДанныеЗаполнения.Характеристики.Количество() > 0 Тогда
					Для каждого Характеристика Из ДанныеЗаполнения.Характеристики Цикл
						Для каждого Штрихкод Из Характеристика.ШтрихКоды Цикл
							Если НЕ ЗначениеЗаполнено(Характеристика.ХарактеристикаИнформационнойБазы) Тогда
								Продолжить;
							КонецЕсли;
							Для каждого Штрихкод Из ДанныеЗаполнения.Штрихкоды Цикл
								НоваяСтрока = Штрихкоды.Добавить();
								НоваяСтрока.Характеристика = Характеристика.ХарактеристикаИнформационнойБазы;
								НоваяСтрока.ШтрихКод = Штрихкод;
							КонецЦикла;
							ШтрихкодыСервис = ПоместитьВоВременноеХранилище(Штрихкоды, УникальныйИдентификатор);
						КонецЦикла;
					КонецЦикла;
				КонецЕсли;

			КонецЦикла;

		КонецЕсли;
		// Конец ЭлектронноеВзаимодействие.РаботаСНоменклатурой

	КонецЕсли;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПроверитьЗаполнениеОбязательныхРеквизитов")
Процедура игр_ПроверитьЗаполнениеОбязательныхРеквизитов(Отказ)

	ТекстОшибки = НСтр("ru='Поле ""%ИмяРеквизита%"" не заполнено'");

	Если Не ЗначениеЗаполнено(Объект.ВидНоменклатуры) Тогда

		Отказ = Истина; 

		Возврат;

	КонецЕсли;

	НепроверяемыеРеквизиты = Справочники.Номенклатура.НепроверяемыеРеквизиты(Объект, РеквизитыВидаНоменклатуры);

	Для Каждого СтрокаТаблицы Из ТаблицаНастроекРеквизитов Цикл
		
		#Вставка     
		Если СтрокаТаблицы.ЭтоДопРеквизит Тогда 
			Продолжить;
		КонецЕсли;
		#КонецВставки
		Если Не СтрокаТаблицы.ОбязателенДляЗаполнения
			Или СтрокаТаблицы.ИмяРеквизита = "ВидНоменклатуры"
			Или (СтрокаТаблицы.ОбязателенДляЗаполнения
			И СтрокаТаблицы.Уникален)
			Или (Не СтрокаТаблицы.ЭтоДопРеквизит
			И НепроверяемыеРеквизиты.Найти(СтрокаТаблицы.ИмяРеквизита) <> Неопределено) Тогда

			Продолжить;

		КонецЕсли;

		ЗначениеРеквизита = ?(СтрокаТаблицы.ЭтоДопРеквизит, ЭтаФорма[СтрокаТаблицы.ПутьКДанным], Объект[СтрокаТаблицы.ИмяРеквизита]);
		ПутьКРеквизиту = СтрокаТаблицы.ПутьКДанным;

		Если Не ЗначениеЗаполнено(ЗначениеРеквизита) Тогда

			ТекстСообщения = СтрЗаменить(ТекстОшибки, "%ИмяРеквизита%", СтрокаТаблицы.Представление);

			Если СтрокаТаблицы.ИмяРеквизита = "ФайлКартинки" Тогда

				Если Не ЗначениеЗаполнено(Объект.Ссылка)
					И Не ЗначениеЗаполнено(АдресКартинки)
					Или ЗначениеЗаполнено(Объект.Ссылка) Тогда

					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ПутьКРеквизиту, , Отказ);

				КонецЕсли;

				Продолжить;

			КонецЕсли;

			Если СтрокаТаблицы.ИмяРеквизита = "ФайлОписанияДляСайта" Тогда

				Если Не ЗначениеЗаполнено(Объект.Ссылка)
					И Не ЗначениеЗаполнено(ПутьКФайлуОписанию)
					Или ЗначениеЗаполнено(Объект.Ссылка) Тогда

					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ПутьКРеквизиту, , Отказ);

				КонецЕсли;

				Продолжить;

			КонецЕсли;

			Если СтрокаТаблицы.ЭтоДопРеквизит Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,ПутьКРеквизиту,,Отказ);
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект." + СтрокаТаблицы.ИмяРеквизита,,Отказ);
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	Если Отказ И Не РежимВидимостиПоказатьТолькоВажные Тогда
		НастройкаВидимостиФормы = "ПоказатьВсе";
		РежимВидимостиПоказатьТолькоВажные = Ложь;
		НастроитьФорму();
		СкрытьРаскрытьВсеГруппы(Ложь);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура игр_ДобавитьИзменитьЭлементыФормы()
	
	ИмяДопЦвета	= "ДополнительныйРеквизитЗначение_AE3F8A8Fx5779x11EDx816Bx40F2E92EC9F5_12582CAEx7913x11F0xB76Bx00155D659100";
	Если Элементы.Найти(ИмяДопЦвета) <> Неопределено Тогда
		Элементы.Переместить(Элементы[ИмяДопЦвета], Элементы.ГруппаШапка);
		Реквизиты	= ЭтотОбъект.ПолучитьРеквизиты();
		Для Каждого Элемент Из Реквизиты Цикл
			Если Элемент.Имя = ИмяДопЦвета Тогда
				КарточкаНоменклатуры.Область("R6C2:R6C11").Объединить();	
				КарточкаНоменклатуры.Область("R6C12:R6C22").Объединить();	

				КарточкаНоменклатуры.Область("R6C2:R6C11").Текст = Элемент.Заголовок;	
				КарточкаНоменклатуры.Область("R6C12:R6C22").Текст = ЭтотОбъект[ИмяДопЦвета];	
				КарточкаНоменклатуры.Область("R6C12:R6C22").Расшифровка = ИмяДопЦвета;	
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	НовыйЭлемент = Элементы.Добавить("игр_КодНацКаталога", Тип("ПолеФормы"), Элементы.СворачиваемаяГруппаКлассификаторы);
	НовыйЭлемент.Вид	= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным	= "Объект.КодНацКаталога";

	КарточкаНоменклатуры.Область("R37C23:R37C30").Объединить();	
	КарточкаНоменклатуры.Область("R37C31:R37C42").Объединить();	

	КарточкаНоменклатуры.Область("R37C23:R37C30").Текст = "Код НКТ";	
	КарточкаНоменклатуры.Область("R37C31:R37C42").Текст = Объект.КодНацКаталога;	
	КарточкаНоменклатуры.Область("R37C31:R37C42").Расшифровка = "игр_КодНацКаталога";	

	НовыйЭлемент = Элементы.Добавить("игр_НаименованиеНацКаталог", Тип("ПолеФормы"), Элементы.СворачиваемаяГруппаКлассификаторы);
	НовыйЭлемент.Вид	= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным	= "Объект.НаименованиеНацКаталог";

	КарточкаНоменклатуры.Область("R38C23:R38C30").Объединить();	
	КарточкаНоменклатуры.Область("R38C31:R38C42").Объединить();	

	КарточкаНоменклатуры.Область("R38C23:R38C30").Текст = "Наименование НКТ";	
	КарточкаНоменклатуры.Область("R38C31:R38C42").Текст = Объект.НаименованиеНацКаталог;	
	КарточкаНоменклатуры.Область("R38C31:R38C42").Расшифровка = "игр_НаименованиеНацКаталог";	

	
КонецПроцедуры

#КонецОбласти