#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
// Возвращает массив видов расходов, которые в налоговом учете нормируются,
// потому что для них главой 25 НК РФ предусмотрены ограничения сумм.
//
// Возвращаемое значение:
//	Массив - Содержит статьи, которые относятся к нормируемым расходам.
//
Функция НормируемыеРасходы() Экспорт
	
	НормируемыеРасходы = Новый Массив;
	НормируемыеРасходы.Добавить(Перечисления.ВидыРасходовНУ.ДобровольноеЛичноеСтрахование);
	НормируемыеРасходы.Добавить(Перечисления.ВидыРасходовНУ.ДобровольноеСтрахованиеПоДоговорамДолгосрочногоСтрахованияЖизниРаботников);
	НормируемыеРасходы.Добавить(Перечисления.ВидыРасходовНУ.РасходыНаВозмещениеЗатратРаботниковПоУплатеПроцентов);
	НормируемыеРасходы.Добавить(Перечисления.ВидыРасходовНУ.ДобровольноеЛичноеСтрахованиеНаСлучайСмертиИлиУтратыРаботоспособности);
	НормируемыеРасходы.Добавить(Перечисления.ВидыРасходовНУ.ПредставительскиеРасходы);
	НормируемыеРасходы.Добавить(Перечисления.ВидыРасходовНУ.РасходыНаРекламуНормируемые);
	
	Возврат НормируемыеРасходы;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	//ограничим выбор значений только используемыми
	ДанныеВыбора.Добавить(Перечисления.ВидыРасходовНУ.Амортизация);
	ДанныеВыбора.Добавить(Перечисления.ВидыРасходовНУ.ДобровольноеЛичноеСтрахование);
	ДанныеВыбора.Добавить(Перечисления.ВидыРасходовНУ.ДобровольноеЛичноеСтрахованиеНаСлучайСмертиИлиУтратыРаботоспособности);
	ДанныеВыбора.Добавить(Перечисления.ВидыРасходовНУ.ДобровольноеСтрахованиеПоДоговорамДолгосрочногоСтрахованияЖизниРаботников);
	ДанныеВыбора.Добавить(Перечисления.ВидыРасходовНУ.КомандировочныеРасходы);
	ДанныеВыбора.Добавить(Перечисления.ВидыРасходовНУ.МатериальныеРасходы);
	ДанныеВыбора.Добавить(Перечисления.ВидыРасходовНУ.НалогиИСборы);
	ДанныеВыбора.Добавить(Перечисления.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения);
	ДанныеВыбора.Добавить(Перечисления.ВидыРасходовНУ.ОбязательноеИДобровольноеСтрахованиеИмущества);
	ДанныеВыбора.Добавить(Перечисления.ВидыРасходовНУ.ОплатаТруда);
	ДанныеВыбора.Добавить(Перечисления.ВидыРасходовНУ.ОсвоениеПриродныхРесурсов);
	ДанныеВыбора.Добавить(Перечисления.ВидыРасходовНУ.ПредставительскиеРасходы);
	ДанныеВыбора.Добавить(Перечисления.ВидыРасходовНУ.ПрочиеРасходы);
	ДанныеВыбора.Добавить(Перечисления.ВидыРасходовНУ.РасходыНаВозмещениеЗатратРаботниковПоУплатеПроцентов);
	ДанныеВыбора.Добавить(Перечисления.ВидыРасходовНУ.РасходыНаРекламуНормируемые);
	ДанныеВыбора.Добавить(Перечисления.ВидыРасходовНУ.РемонтОсновныхСредств);
	ДанныеВыбора.Добавить(Перечисления.ВидыРасходовНУ.СтраховыеВзносы);
	ДанныеВыбора.Добавить(Перечисления.ВидыРасходовНУ.ТранспортныеРасходы);
	ДанныеВыбора.Добавить(Перечисления.ВидыРасходовНУ.Преференции);
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
