
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьРеквизиты();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.СтатьиДвиженияДенежныхСредств.Очистить();
	Для Каждого СтрокаФонд Из ТаблицаФонды Цикл
		НайденныеСтроки	= ТаблицаСтатьи.НайтиСтроки(Новый Структура("Статья", СтрокаФонд.Статья));
		Для Каждого СтрокаСтатья Из НайденныеСтроки Цикл
			ЗаполнитьЗначенияСвойств(ТекущийОбъект.СтатьиДвиженияДенежныхСредств.Добавить(), СтрокаСтатья);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытиЭлементовйФормы

&НаКлиенте
Процедура ТаблицаФондыПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборСтатей();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФондыПриИзменении(Элемент)
	
	УстановитьОтборСтатей();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСтатьиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные		= Элементы.ТаблицаФонды.ТекущиеДанные;
		ТекущиеДанныеСтатьи	= Элементы.ТаблицаСтатьи.ТекущиеДанные;
		ТекущиеДанныеСтатьи.Статья	= ТекущиеДанные.Статья;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСтатьиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТекущиеДанные	= Элементы.ТаблицаФонды.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(,"Не выбрана статья");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьРеквизиты()
	
	Таблица	= Объект.СтатьиДвиженияДенежныхСредств.Выгрузить();
	
	ТаблицаСтатьи.Загрузить(Таблица);
	
	Таблица.Свернуть("Статья");
	
	ТаблицаФонды.Загрузить(Таблица);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСтатей()
	
	ТекущиеДанные	= Элементы.ТаблицаФонды.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда               
		Элементы.ТаблицаСтатьи.ОтборСтрок	= Новый ФиксированнаяСтруктура("Статья", ТекущиеДанные.Статья);
	Иначе
		Элементы.ТаблицаСтатьи.ОтборСтрок	= Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти