
#Область ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура игр_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	игр_ДобавитьИзменитьРеквизитыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура игр_ДобавитьИзменитьРеквизитыФормы()
	
	НовыйЭлемент = Элементы.Добавить("игр_КодНацКаталога", Тип("ПолеФормы"), ЭтотОбъект);
	НовыйЭлемент.Вид	= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным	= "Запись.КодНацКаталога";

	НовыйЭлемент = Элементы.Добавить("игр_НаименованиеНацКаталог", Тип("ПолеФормы"), ЭтотОбъект);
	НовыйЭлемент.Вид	= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным	= "Запись.НаименованиеНацКаталог";
	
КонецПроцедуры

#КонецОбласти