
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос	= Новый Запрос;
	Запрос.Текст	= ТекстЗапросаЦеныНоменклатуры();
	Запрос.УстановитьПараметр("ВидыЦен", ВидыЦен.ВыгрузитьКолонку("ВидЦены"));
	Запрос.УстановитьПараметр("Номенклатура", Товары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ПериодДо", ДатаНачала - 1);
	
	Движения.ЦеныНоменклатуры.Записывать	= Истина;
	
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НовоеДвижение	= Движения.ЦеныНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(НовоеДвижение, Выборка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЦеныНоменклатуры()
	
	ТекстЗапроса	= 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_ЦеныНоменклатурыТовары
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ПериодДо,
	|			ВидЦены В (&ВидыЦен)
	|				И Номенклатура В (&Номенклатура)) КАК ЦеныНоменклатурыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	игр_НоменклатураМаркетинговыхАкцийВидыЦен.ВидЦены КАК ВидЦены,
	|	ВТ_ЦеныНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	ВТ_ЦеныНоменклатурыТовары.Характеристика КАК Характеристика,
	|	игр_НоменклатураМаркетинговыхАкцийТовары.ПредыдущаяЦена КАК ПредыдущаяЦена,
	|	игр_НоменклатураМаркетинговыхАкцийТовары.ЦенаПослеАкции КАК ЦенаПослеАкции,
	|	ВидыЦен.ВалютаЦены КАК Валюта
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	ВТ_ЦеныНоменклатурыТовары КАК ВТ_ЦеныНоменклатурыТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.игр_НоменклатураМаркетинговыхАкций.Товары КАК игр_НоменклатураМаркетинговыхАкцийТовары
	|		ПО ВТ_ЦеныНоменклатурыТовары.Номенклатура = игр_НоменклатураМаркетинговыхАкцийТовары.Номенклатура,
	|	Документ.игр_НоменклатураМаркетинговыхАкций.ВидыЦен КАК игр_НоменклатураМаркетинговыхАкцийВидыЦен
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
	|		ПО игр_НоменклатураМаркетинговыхАкцийВидыЦен.ВидЦены = ВидыЦен.Ссылка
	|ГДЕ
	|	игр_НоменклатураМаркетинговыхАкцийВидыЦен.Ссылка = &Ссылка
	|	И игр_НоменклатураМаркетинговыхАкцийТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДокумента.ВидЦены КАК ВидЦены,
	|	ВТ_ДанныеДокумента.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныеДокумента.Характеристика КАК Характеристика,
	|	ВТ_ДанныеДокумента.ПредыдущаяЦена КАК Цена,
	|	&ДатаНачала КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ВТ_ДанныеДокумента.Валюта КАК Валюта
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДанныеДокумента.ВидЦены,
	|	ВТ_ДанныеДокумента.Номенклатура,
	|	ВТ_ДанныеДокумента.Характеристика,
	|	ВТ_ДанныеДокумента.ЦенаПослеАкции,
	|	КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ),
	|	&Ссылка,
	|	ВТ_ДанныеДокумента.Валюта
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента"
	;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти