#Если Не ТолстыйКлиентУправляемоеПриложение Или Сервер Тогда

#Область ОписаниеПеременных

Перем ОтчетИнициализирован;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ИнициализироватьОтчет();
	
	Если Не СтандартнаяОбработка Тогда
		Возврат
	КонецЕсли;
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ТекстЗапроса = ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.Данные.Запрос;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.РегистрацияПрочихДоходов КАК ДивидендыФизическимЛицам", "Документ.НачислениеДивидендов КАК ДивидендыФизическимЛицам");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И (НЕ ДивидендыФизическимЛицам.РегистрироватьВыплатуВедомостью)", "И ИСТИНА");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НАЧАЛОПЕРИОДА(ДивидендыФизическимЛицам.ПланируемаяДатаВыплаты, МЕСЯЦ)", "НАЧАЛОПЕРИОДА(ДивидендыФизическимЛицам.ДатаВыплаты, МЕСЯЦ)");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ССЫЛКА Документ.ДивидендыФизическимЛицам", "ССЫЛКА Документ.НачислениеДивидендов");
		
		ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.Данные.Запрос = ТекстЗапроса;
	Иначе
		ТекстЗапроса = ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.Данные.Запрос;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.РегистрацияПрочихДоходов КАК ДивидендыФизическимЛицам", "Документ.ДивидендыФизическимЛицам КАК ДивидендыФизическимЛицам");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НАЧАЛОПЕРИОДА(ДивидендыФизическимЛицам.ПланируемаяДатаВыплаты, МЕСЯЦ)", "НАЧАЛОПЕРИОДА(ДивидендыФизическимЛицам.ДатаВыплаты, МЕСЯЦ)");
		// депонирование
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РегистрНакопления.ВзаиморасчетыССотрудниками.ОстаткиИОбороты(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), МЕСЯЦ, , ЛОЖЬ) КАК ВзаиморасчетыСДепонентамиОстаткиИОбороты", "РегистрНакопления.ВзаиморасчетыСДепонентами.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, МЕСЯЦ) КАК ВзаиморасчетыСДепонентамиОстаткиИОбороты");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РегистрНакопления.ВзаиморасчетыССотрудниками.ОстаткиИОбороты(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), МЕСЯЦ, , ЛОЖЬ) КАК ВзаиморасчетыСДепонентамиОстаткиИОбороты", "РегистрНакопления.ВзаиморасчетыСДепонентами.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, МЕСЯЦ) КАК ВзаиморасчетыСДепонентамиОстаткиИОбороты");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "-ВзаиморасчетыСДепонентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход", "-ВзаиморасчетыСДепонентамиОстаткиИОбороты.СуммаПриход");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВзаиморасчетыСДепонентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход", "ВзаиморасчетыСДепонентамиОстаткиИОбороты.СуммаРасход");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентамиОстаткиИОбороты.Период, МЕСЯЦ)", "НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентамиОстаткиИОбороты.Ведомость.ПериодРегистрации, МЕСЯЦ)");
		
		ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.Данные.Запрос = ТекстЗапроса;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.НалогиВзносыОтчисленияВХО") Тогда
		
		ТекстЗапроса = ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.Данные.Запрос;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка) КАК БанковскийСчет", 
												"ВЫБОР
												|	КОГДА ТИПЗНАЧЕНИЯ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор) = ТИП(Документ.ПеречислениеВзносовИОтчислений)
												|		ТОГДА ВЫРАЗИТЬ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор КАК Документ.ПеречислениеВзносовИОтчислений).БанковскийСчет 
												|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
												|	КОНЕЦ КАК БанковскийСчет");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент", 
												"ВЫБОР
												|	КОГДА ТИПЗНАЧЕНИЯ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор) = ТИП(Документ.ПеречислениеВзносовИОтчислений)
												|		ТОГДА ВЫРАЗИТЬ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор КАК Документ.ПеречислениеВзносовИОтчислений).Контрагент
												|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
												|	КОНЕЦ КАК Контрагент");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаКонтрагентов.ПустаяСсылка) КАК БанковскийСчетКонтрагента", 
												"ВЫБОР
												|	КОГДА ТИПЗНАЧЕНИЯ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор) = ТИП(Документ.ПеречислениеВзносовИОтчислений)
												|		ТОГДА ВЫРАЗИТЬ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор КАК Документ.ПеречислениеВзносовИОтчислений).БанковскийСчетКонтрагента
												|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаКонтрагентов.ПустаяСсылка)
												|	КОНЕЦ КАК БанковскийСчетКонтрагента");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаДокумента", 
												"ВЫБОР
												|	КОГДА ТИПЗНАЧЕНИЯ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор) = ТИП(Документ.ПеречислениеВзносовИОтчислений)
												|		ТОГДА ВЫРАЗИТЬ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор КАК Документ.ПеречислениеВзносовИОтчислений).Сумма
												|			ИНАЧЕ ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2))
												|	КОНЕЦ КАК СуммаДокумента");
		ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.Данные.Запрос = ТекстЗапроса;

	Иначе
		
		ТекстЗапроса = ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.Данные.Запрос;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка) КАК БанковскийСчет", 
												"ВЫБОР
												|	КОГДА ТИПЗНАЧЕНИЯ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор) = ТИП(Документ.СписаниеБезналичныхДенежныхСредств)
												|		ТОГДА ВЫРАЗИТЬ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор КАК Документ.СписаниеБезналичныхДенежныхСредств).БанковскийСчет 
												|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
												|	КОНЕЦ КАК БанковскийСчет");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент", 
												"ВЫБОР
												|	КОГДА ТИПЗНАЧЕНИЯ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор) = ТИП(Документ.СписаниеБезналичныхДенежныхСредств)
												|		ТОГДА ВЫРАЗИТЬ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор КАК Документ.СписаниеБезналичныхДенежныхСредств).Контрагент
												|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
												|	КОНЕЦ КАК Контрагент");	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаКонтрагентов.ПустаяСсылка) КАК БанковскийСчетКонтрагента", 
												"ВЫБОР
												|	КОГДА ТИПЗНАЧЕНИЯ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор) = ТИП(Документ.СписаниеБезналичныхДенежныхСредств)
												|		ТОГДА ВЫРАЗИТЬ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор КАК Документ.СписаниеБезналичныхДенежныхСредств).БанковскийСчетКонтрагента
												|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаКонтрагентов.ПустаяСсылка)
												|	КОНЕЦ КАК БанковскийСчетКонтрагента");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаДокумента", 
												"ВЫБОР
												|	КОГДА ТИПЗНАЧЕНИЯ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор) = ТИП(Документ.СписаниеБезналичныхДенежныхСредств)
												|		ТОГДА ВЫРАЗИТЬ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор КАК Документ.СписаниеБезналичныхДенежныхСредств).СуммаДокумента
												|			ИНАЧЕ ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2))
												|	КОНЕЦ КАК СуммаДокумента");
		ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.Данные.Запрос = ТекстЗапроса;
		
	КонецЕсли;

	КлючВарианта = ЗарплатаКадрыОтчеты.КлючВарианта(КомпоновщикНастроек);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов") 
		ИЛИ НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ИспользоватьВедомостиДляВыплатыПрочихДоходов", Истина);
	КонецЕсли;
	
	Если КлючВарианта = "СправкаОЗаработнойПлате"
		ИЛИ КлючВарианта = "СправкаСМестаРаботыПередНаступлениемСоциальногоРиска" 
		ИЛИ КлючВарианта = "СправкаОСуммахДоходаОПВ"
		ИЛИ КлючВарианта = "СправкаПодтверждениеОПеречисленииОПВ" Тогда
		
		ПриКомпоновкеРезультатаСправки(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, КлючВарианта);
	
	Иначе
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		
		МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
			КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки, , Тип("ГенераторМакетаКомпоновкиДанных"));
		
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,, ДанныеРасшифровки, Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

// Для общей формы "Форма отчета" подсистемы "Варианты отчетов".
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПриСозданииНаСервере = Истина;
	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   Отказ - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//
// См. также:
//   "УправляемаяФорма.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ЗначениеВДанныеФормы(ЭтотОбъект, Форма.Отчет);
	
КонецПроцедуры

// Вызывается перед загрузкой новых настроек. Используется для изменения схемы компоновки.
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	
	Если КлючСхемы <> "СхемаИнициализирована" Тогда
		
		ИнициализироватьОтчет();
		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКомпоновкиДанных, КлючСхемы);
		
		КлючСхемы = "СхемаИнициализирована";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьОтчетРасшифровку(Параметры, ДокументРезультат) Экспорт
	
	СхемаКомпоновки = Отчеты.РегистрНалоговогоУчетаПоИПНиСН.ПолучитьМакет(Параметры.ИмяСКД);
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ТекстЗапроса = СхемаКомпоновки.НаборыДанных.Данные.Запрос;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.РегистрацияПрочихДоходов КАК ДивидендыФизическимЛицам", "Документ.НачислениеДивидендов КАК ДивидендыФизическимЛицам");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И (НЕ ДивидендыФизическимЛицам.РегистрироватьВыплатуВедомостью)", "И ИСТИНА");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НАЧАЛОПЕРИОДА(ДивидендыФизическимЛицам.ПланируемаяДатаВыплаты, МЕСЯЦ)", "НАЧАЛОПЕРИОДА(ДивидендыФизическимЛицам.ДатаВыплаты, МЕСЯЦ)");
		СхемаКомпоновки.НаборыДанных.Данные.Запрос = ТекстЗапроса;
	Иначе
		ТекстЗапроса = СхемаКомпоновки.НаборыДанных.Данные.Запрос;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.РегистрацияПрочихДоходов КАК ДивидендыФизическимЛицам", "Документ.ДивидендыФизическимЛицам КАК ДивидендыФизическимЛицам");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НАЧАЛОПЕРИОДА(ДивидендыФизическимЛицам.ПланируемаяДатаВыплаты, МЕСЯЦ)", "НАЧАЛОПЕРИОДА(ДивидендыФизическимЛицам.ДатаВыплаты, МЕСЯЦ)");
		// депонирование
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РегистрНакопления.ВзаиморасчетыССотрудниками.ОстаткиИОбороты(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), МЕСЯЦ, , ЛОЖЬ) КАК ВзаиморасчетыСДепонентамиОстаткиИОбороты", "РегистрНакопления.ВзаиморасчетыСДепонентами.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, МЕСЯЦ) КАК ВзаиморасчетыСДепонентамиОстаткиИОбороты");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РегистрНакопления.ВзаиморасчетыССотрудниками.ОстаткиИОбороты(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), МЕСЯЦ, , ЛОЖЬ) КАК ВзаиморасчетыСДепонентамиОстаткиИОбороты", "РегистрНакопления.ВзаиморасчетыСДепонентами.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, МЕСЯЦ) КАК ВзаиморасчетыСДепонентамиОстаткиИОбороты");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "-ВзаиморасчетыСДепонентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход", "-ВзаиморасчетыСДепонентамиОстаткиИОбороты.СуммаПриход");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВзаиморасчетыСДепонентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход", "ВзаиморасчетыСДепонентамиОстаткиИОбороты.СуммаРасход");
		СхемаКомпоновки.НаборыДанных.Данные.Запрос = ТекстЗапроса;
	КонецЕсли;

	ЗарплатаКадрыОбщиеНаборыДанных.ЗаполнитьОбщиеИсточникиДанныхОтчета(Новый Структура("СхемаКомпоновкиДанных", СхемаКомпоновки));
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	НастройкиОтчета = ЗаполнитьКомпоновщикНастроек("РегистрНалоговогоУчетаПоИПНиСНОбщий", Параметры, СхемаКомпоновки);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов") 
		ИЛИ НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ИспользоватьВедомостиДляВыплатыПрочихДоходов", Истина);
	КонецЕсли;
	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновки, НастройкиОтчета);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , , Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
КонецПроцедуры

Функция ЗаполнитьКомпоновщикНастроек(КлючВарианта, ПараметрыОтчета, СхемаКД)
	
	Организация = ПараметрыОтчета.Организация;
	ДатаНачалаПериодаОтчета = ПараметрыОтчета.ДатаНачалаПериодаОтчета;
	ДатаКонцаПериодаОтчета = ПараметрыОтчета.ДатаКонцаПериодаОтчета;
	
	КомпНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКД));
	КомпНастроек.ЗагрузитьНастройки(СхемаКД.ВариантыНастроек[КлючВарианта].Настройки);
	КомпНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("КлючВарианта", КлючВарианта);
	
	ПараметрПериод = ОтчетыКлиентСервер.ПолучитьПараметр(КомпНастроек, "Период");
	Если ПараметрПериод <> Неопределено Тогда
		ПараметрПериод.Значение.ДатаНачала = ДатаНачалаПериодаОтчета;
		ПараметрПериод.Значение.ДатаОкончания = ДатаКонцаПериодаОтчета;
	КонецЕсли;
	
	
	Настройки = КомпНастроек.Настройки;
	
	Отбор = Настройки.Отбор;
	Отбор.Элементы.Очистить();
	
	ОтборСтруктурныхЕдиниц = ПолучитьСписокСтруктурныхЕдиниц(ПараметрыОтчета);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Организация", ВидСравненияКомпоновкиДанных.Равно, Организация);	
	
	Если ПараметрыОтчета.ИндивидуальныйПредприниматель Тогда
		УстановитьОтборИП(ПараметрыОтчета, Отбор);
	КонецЕсли;
	
	Если ПараметрыОтчета.Форма = "0" ИЛИ ПараметрыОтчета.Форма = "910.00" Тогда
		
		Если ПараметрыОтчета.Свойство("РегистрацияВНО") Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "РегистрацияВНалоговомОргане", ВидСравненияКомпоновкиДанных.Равно, ПараметрыОтчета.РегистрацияВНО);	
        КонецЕсли;
        
        Если ПараметрыОтчета.Свойство("Строка") Тогда
            Если Найти(ПараметрыОтчета.Строка, "18") > 0 Тогда
                ОтборФизЛиц = ПолучитьСписокПоГражданству(ПараметрыОтчета, Ложь);
                Если ОтборФизЛиц <> Неопределено
                    И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда 
                    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ОтборФизЛиц, ВидСравненияКомпоновкиДанных.ВСписке);
                ИначеЕсли Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
                    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", "", ВидСравненияКомпоновкиДанных.Равно);						
                КонецЕсли;
                
            ИначеЕсли Найти(ПараметрыОтчета.Строка, "19") > 0 Тогда
                ОтборФизЛиц = ПолучитьСписокПоГражданству(ПараметрыОтчета);
                Если ОтборФизЛиц <> Неопределено
                    И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда 
                    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ОтборФизЛиц, ВидСравненияКомпоновкиДанных.ВСписке);
                ИначеЕсли Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
                    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", "", ВидСравненияКомпоновкиДанных.Равно);						
                КонецЕсли;
            КонецЕсли; 
        КонецЕсли; 
		
	ИначеЕсли ПараметрыОтчета.Форма = "1" Тогда
		
		Если ПараметрыОтчета.Свойство("СписокСтруктурныхЕдиниц") Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "РегистрацияВНалоговомОргане", ВидСравненияКомпоновкиДанных.ВСписке, ПараметрыОтчета.СписокСтруктурныхЕдиниц);	
		КонецЕсли;
		
	ИначеЕсли ПараметрыОтчета.Форма = "2" ИЛИ ПараметрыОтчета.Форма = "910.02" Тогда
		
		Если ПараметрыОтчета.Свойство("ФизическоеЛицо")
			И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ПараметрыОтчета.ФизическоеЛицо, ВидСравненияКомпоновкиДанных.Равно)
			
		Иначе
			
			ОтборФизЛиц = ПолучитьСписокПоГражданству(ПараметрыОтчета);
			Если ОтборФизЛиц <> Неопределено
				И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда 
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ОтборФизЛиц, ВидСравненияКомпоновкиДанных.ВСписке);
			ИначеЕсли Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", "", ВидСравненияКомпоновкиДанных.Равно);						
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ПараметрыОтчета.Форма = "3" Тогда
		
		// отбираем по РегистрацияВНО, тк 200.03 может быть собрана по справочнику Подразделения 
		Если ПараметрыОтчета.Свойство("РегистрацияВНО") Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "РегистрацияВНалоговомОргане", ВидСравненияКомпоновкиДанных.Равно, ПараметрыОтчета.РегистрацияВНО);	
		Иначе
			// поддержим работу ранее сохраненых отчетов без РегистрацияВНО
			ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(Отбор, "Организация", , ОтборСтруктурныхЕдиниц, ВидСравненияКомпоновкиДанных.ВСписке);
		КонецЕсли;
		
	ИначеЕсли ПараметрыОтчета.Форма = "5" ИЛИ ПараметрыОтчета.Форма = "910.01" Тогда
		
		Если ПараметрыОтчета.Свойство("ФизическоеЛицо")
			И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ПараметрыОтчета.ФизическоеЛицо, ВидСравненияКомпоновкиДанных.Равно)
			
		Иначе
			
			ОтборФизЛиц = ПолучитьСписокПоГражданству(ПараметрыОтчета, Ложь);
			Если ОтборФизЛиц <> Неопределено
				И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда 
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ОтборФизЛиц, ВидСравненияКомпоновкиДанных.ВСписке);
			ИначеЕсли Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", "", ВидСравненияКомпоновкиДанных.Равно);						
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыОтчета.Форма <> "3" И ПараметрыОтчета.Форма <> "0" Тогда
		
		Если ОтборСтруктурныхЕдиниц <> Неопределено Тогда
			ОтборСтруктурныхЕдиниц.Добавить(Организация);
			ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(Отбор, "Организация", , ОтборСтруктурныхЕдиниц, ВидСравненияКомпоновкиДанных.ВСписке);
		КонецЕсли;
		
	КонецЕсли;

	Если ПараметрыОтчета.Свойство("ТолькоГражданеРК") И ПараметрыОтчета.ТолькоГражданеРК Тогда 
		
		ОтборФизЛиц = ПолучитьСписокПоГражданству(ПараметрыОтчета, Ложь);
		Если ОтборФизЛиц <> Неопределено
			И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда 
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ОтборФизЛиц, ВидСравненияКомпоновкиДанных.ВСписке);
		ИначеЕсли Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", "", ВидСравненияКомпоновкиДанных.Равно);						
		КонецЕсли;
			
	КонецЕсли;
	
	ДобавитьПолеЗадолженностьПоДоходам(Настройки, ПараметрыОтчета);
	
	Возврат КомпНастроек.ПолучитьНастройки();
	
КонецФункции

Функция ПолучитьСписокПоГражданству(ПараметрыОтчета, БезГражданства = Истина)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("парамПериодС",ПараметрыОтчета.ДатаНачалаПериодаОтчета);
	Запрос.УстановитьПараметр("парамПериодПо",ПараметрыОтчета.ДатаКонцаПериодаОтчета);
	
	ИсключаемыеФизическиеЛица = Новый Массив;
	
	Если ПараметрыОтчета.Свойство("ИндивидуальныйПредприниматель")
		И ПараметрыОтчета.ИндивидуальныйПредприниматель Тогда
		
		ИндивидуальныйПредприниматель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОтчета.Организация, "ИндивидуальныйПредприниматель");
		
		ИсключаемыеФизическиеЛица.Добавить(ИндивидуальныйПредприниматель);
			
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("ИсключаемыеФизическиеЛица", ИсключаемыеФизическиеЛица);

	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(ДанныеПроизводственногоКалендаря.Дата, МЕСЯЦ) КАК Период
	|ПОМЕСТИТЬ ВТ_ДатыПериодовГода
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &парамПериодС И &парамПериодПо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Период КАК Период,
	|	ФизическиеЛица.Ссылка КАК ФизЛицо
	|ПОМЕСТИТЬ ВТ_Периоды
	|ИЗ
	|	ВТ_ДатыПериодовГода КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ФизическиеЛица.ЭтоГруппа = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Период КАК Период,
	|	Периоды.ФизЛицо КАК ФизЛицо,
	|	МАКСИМУМ(ГражданствоФизЛиц.Период) КАК ПериодСреза
	|ПОМЕСТИТЬ ВТ_ГражданствоФизЛицСрезПоследних
	|ИЗ
	|	ВТ_Периоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизическихЛиц КАК ГражданствоФизЛиц
	|		ПО (Периоды.Период >= НАЧАЛОПЕРИОДА(ГражданствоФизЛиц.Период, МЕСЯЦ))
	|			И Периоды.ФизЛицо = ГражданствоФизЛиц.ФизическоеЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	Периоды.Период,
	|	Периоды.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПериодСреза,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГражданствоФизЛицСрезПоследних.ФизЛицо КАК ФизЛицо
	|ИЗ
	|	ВТ_ГражданствоФизЛицСрезПоследних КАК ГражданствоФизЛицСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизическихЛиц КАК ГражданствоФизЛиц
	|		ПО ГражданствоФизЛицСрезПоследних.ПериодСреза = ГражданствоФизЛиц.Период
	|			И ГражданствоФизЛицСрезПоследних.ФизЛицо = ГражданствоФизЛиц.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизическихЛицКакНалогоплательщиков.СрезПоследних(&парамПериодПо, ) КАК СтатусФизическихЛицКакНалогоплательщиковСрезПоследних
	|		ПО ГражданствоФизЛицСрезПоследних.ФизЛицо = СтатусФизическихЛицКакНалогоплательщиковСрезПоследних.ФизическоеЛицо
	|ГДЕ
	|	" + ?(БезГражданства, "НЕ", "") + " ВЫБОР
	|		КОГДА ГражданствоФизЛиц.Страна ЕСТЬ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтраныМира.Казахстан)
	|		ИНАЧЕ ГражданствоФизЛиц.Страна
	|	КОНЕЦ = ЗНАЧЕНИЕ(Справочник.СтраныМира.Казахстан)
	|	И НЕ ГражданствоФизЛицСрезПоследних.ФизЛицо В (&ИсключаемыеФизическиеЛица)";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизЛицо");
	
	Если Результат.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСписокГражданствоКазахстан(ПараметрыОтчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("парамПериодС",ПараметрыОтчета.ДатаНачалаПериодаОтчета);
	Запрос.УстановитьПараметр("парамПериодПо",ПараметрыОтчета.ДатаКонцаПериодаОтчета);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(ДанныеПроизводственногоКалендаря.Дата, МЕСЯЦ) КАК Период
	|ПОМЕСТИТЬ ВТ_ДатыПериодовГода
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &парамПериодС И &парамПериодПо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Период КАК Период,
	|	ФизическиеЛица.Ссылка КАК ФИО
	|ПОМЕСТИТЬ ВТ_Периоды
	|ИЗ
	|	ВТ_ДатыПериодовГода КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ФизическиеЛица.ЭтоГруппа = ЛОЖЬ
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	ФИО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Период КАК Период,
	|	Периоды.ФИО КАК ФИО,
	|	МАКСИМУМ(ГражданствоФизЛиц.Период) КАК ПериодСреза
	|ПОМЕСТИТЬ ВТ_ГражданствоФизЛицСрезПоследних
	|ИЗ
	|	ВТ_Периоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизическихЛиц КАК ГражданствоФизЛиц
	|		ПО (Периоды.Период >= НАЧАЛОПЕРИОДА(ГражданствоФизЛиц.Период, МЕСЯЦ))
	|			И Периоды.ФИО = ГражданствоФизЛиц.ФизическоеЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	Периоды.Период,
	|	Периоды.ФИО
	|ИНДЕКСИРОВАТЬ ПО
	|	ПериодСреза,
	|	ФИО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГражданствоФизЛицСрезПоследних.ФИО КАК ФИО
	|ИЗ
	|	ВТ_ГражданствоФизЛицСрезПоследних КАК ГражданствоФизЛицСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизическихЛиц КАК ГражданствоФизЛиц
	|		ПО ГражданствоФизЛицСрезПоследних.ПериодСреза = ГражданствоФизЛиц.Период
	|			И ГражданствоФизЛицСрезПоследних.ФИО = ГражданствоФизЛиц.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизическихЛицКакНалогоплательщиков.СрезПоследних(&парамПериодПо, ) КАК СтатусФизическихЛицКакНалогоплательщиковСрезПоследних
	|		ПО ГражданствоФизЛицСрезПоследних.ФИО = СтатусФизическихЛицКакНалогоплательщиковСрезПоследних.ФизическоеЛицо
	|ГДЕ
	|	ВЫБОР
	|				КОГДА ГражданствоФизЛиц.Страна ЕСТЬ NULL 
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.СтраныМира.Казахстан)
	|				ИНАЧЕ ГражданствоФизЛиц.Страна
	|			КОНЕЦ = ЗНАЧЕНИЕ(Справочник.СтраныМира.Казахстан)";
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФИО");
	Если Результат.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСписокСтруктурныхЕдиниц(ПараметрыОтчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокСтруктурныхЕдиниц",ПараметрыОтчета.СписокСтруктурныхЕдиниц);
	Запрос.УстановитьПараметр("Организация",ПараметрыОтчета.Организация);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.РегистрацияВНалоговомОргане В(&СписокСтруктурныхЕдиниц)
	|	И Организации.Ссылка <> &Организация";
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Если Результат.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

Процедура УстановитьОтборИП(ПараметрыОтчета, Отбор)
	
	ИндивидуальныйПредприниматель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОтчета.Организация, "ИндивидуальныйПредприниматель");
	
	Если ПараметрыОтчета.Свойство("ИДИменПоказателей") = Неопределено
		ИЛИ ПараметрыОтчета.ИДИменПоказателей.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ИндивидуальныйПредприниматель, ВидСравненияКомпоновкиДанных.НеРавно);
		Возврат;
		
	КонецЕсли;
	
	ИмяЯчейки = ПараметрыОтчета.ИДИменПоказателей[0];
	
	// ячейки расшиврофки определяются в отчете формы
	Если ПараметрыОтчета.ДатаНачалаПериодаОтчета >= Дата('20210101')
		И НЕ ПараметрыОтчета.Свойство("ЭтоРасшиврофкаИП") = Неопределено Тогда
		
		// данные по ИП + сотрудники - параметр ЭтоРасшиврофкаИП пустой
		Если ЗначениеЗаполнено(ПараметрыОтчета.ЭтоРасшиврофкаИП) Тогда
			
			Если ПараметрыОтчета.ЭтоРасшиврофкаИП = Истина Тогда
				
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ИндивидуальныйПредприниматель, ВидСравненияКомпоновкиДанных.Равно);
				
			Иначе
				
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ИндивидуальныйПредприниматель, ВидСравненияКомпоновкиДанных.НеРавно);
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Если Лев(ИмяЯчейки,10) = "П000020005"
				ИЛИ Лев(ИмяЯчейки,10) = "П000030010"
				ИЛИ Лев(ИмяЯчейки,10) = "П000120012"
				ИЛИ Лев(ИмяЯчейки,10) = "П000120018" Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ИндивидуальныйПредприниматель, ВидСравненияКомпоновкиДанных.Равно);
			
		ИначеЕсли Лев(ИмяЯчейки,10) <> "П000020008" 
					И Лев(ИмяЯчейки,10) <> "П000030012" 
					И Лев(ИмяЯчейки,10) <> "П000120020" Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ИндивидуальныйПредприниматель, ВидСравненияКомпоновкиДанных.НеРавно);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПолеЗадолженностьПоДоходам(Настройки, ПараметрыОтчета)
	
	Если ПараметрыОтчета.Свойство("ИДИменПоказателей") = Неопределено
		ИЛИ ПараметрыОтчета.ИДИменПоказателей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяЯчейки = ПараметрыОтчета.ИДИменПоказателей[0];
	
	Если ИмяЯчейки = "П000110003001" Тогда
		Если Настройки.Структура.Количество() <> 0
			 И Настройки.Структура[0].Структура.Количество() <> 0
			 И Настройки.Структура[0].Структура[0].Структура.Количество() <> 0
			 И Настройки.Структура[0].Структура[0].Структура[0].Колонки.Количество() <> 0 Тогда
			ОтчетыКлиентСервер.ДобавитьВыбранноеПоле(Настройки.Структура[0].Структура[0].Структура[0].Колонки[0].Выбор, "ЗадолженностьПоДоходамНаКонец","Задолженность по невыплаченным доходам");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьОтчет() Экспорт
	
	Если Не ОтчетИнициализирован Тогда
		
		//СоответсвиеДополнительныхПолейПредставлениям = КадровыйУчетРасширенный.ДополнительныеПоляОтчетаКадроваяИсторияСотрудников();
		ЗарплатаКадрыОбщиеНаборыДанных.ЗаполнитьОбщиеИсточникиДанныхОтчета(ЭтотОбъект);
		
		ОтчетИнициализирован = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультатаСправки(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, КлючВарианта)
	
	СтандартнаяОбработка = Ложь;
	СправкаОЗаработнойПлате = (КлючВарианта = "СправкаОЗаработнойПлате");
	СправкаПодтверждениеОПеречисленииОПВ = (КлючВарианта = "СправкаПодтверждениеОПеречисленииОПВ");
	СправкаОСуммахДоходаОПВ = (КлючВарианта = "СправкаОСуммахДоходаОПВ");
	
	Попытка
		
		// Параметры документа
		ДокументРезультат.ТолькоПросмотр = Истина;
		ДокументРезультат.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Справка";
		ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ДокументРезультат.АвтоМасштаб = Истина;
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		
		НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
		
		Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("МакетКомпоновкиДанных")
			И КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.МакетКомпоновкиДанных <> Неопределено Тогда
			
			МакетКомпоновкиДанных = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.МакетКомпоновкиДанных;
			КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Удалить("МакетКомпоновкиДанных");
			
		Иначе
			
			МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
				НастройкиОтчета, ДанныеРасшифровки, , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
			
			Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("ФормированиеМакетаКомпоновкиДанных") Тогда
				
				КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СкомпонованныйМакетКомпоновкиДанных", МакетКомпоновкиДанных);
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , , Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ДанныеОтчета = Новый ДеревоЗначений;
		ПроцессорВывода.УстановитьОбъект(ДанныеОтчета);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
		Если СправкаОСуммахДоходаОПВ Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.РегистрНалоговогоУчетаПоИПНиСН.ПФ_MXL_СправкаОСуммахДохода");
		Иначе	
			Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.РегистрНалоговогоУчетаПоИПНиСН.ПФ_MXL_Справка");
		КонецЕсли;	
			
		Если СправкаОЗаработнойПлате Тогда
			
			Макеты = Новый Структура("Шапка,Подвал,ШапкаТЧ,СтрокаТЧ,ПодвалТЧ,Группировка");
			
			Макеты.Шапка = Макет.ПолучитьОбласть("ШапкаСправкаОЗаработнойПлате");
			Макеты.Подвал = Макет.ПолучитьОбласть("ПодвалСправкаОЗаработнойПлате");
			Макеты.ШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТЧСправкаОЗаработнойПлате");
			Макеты.СтрокаТЧ = Макет.ПолучитьОбласть("СтрокаТЧСправкаОЗаработнойПлате");
			Макеты.ПодвалТЧ = Макет.ПолучитьОбласть("ПодвалТЧСправкаОЗаработнойПлате");
			Макеты.Группировка = Макет.ПолучитьОбласть("Группировка");
			
		ИначеЕсли СправкаПодтверждениеОПеречисленииОПВ Тогда
			
			Макеты = Новый Структура("Шапка,Подвал,ШапкаТЧ,СтрокаТЧ,Группировка");
			
			Макеты.Шапка = Макет.ПолучитьОбласть("ШапкаСправкаПодтверждениеОПеречисленииОПВ");
			Макеты.Подвал = Макет.ПолучитьОбласть("ПодвалСправкаПодтверждениеОПеречисленииОПВ");
			Макеты.ШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТЧСправкаПодтверждениеОПеречисленииОПВ");
			Макеты.СтрокаТЧ = Макет.ПолучитьОбласть("СтрокаТЧСправкаПодтверждениеОПеречисленииОПВ");
			Макеты.Группировка = Макет.ПолучитьОбласть("Группировка");
			
		ИначеЕсли СправкаОСуммахДоходаОПВ Тогда
			
			Макеты = Новый Структура("Шапка,Подвал,ШапкаТЧ,СтрокаТЧ,ПодвалТЧ,Группировка");
			
			Макеты.Шапка = Макет.ПолучитьОбласть("ШапкаСправкаОСуммахДоходаОПВ");
			Макеты.Подвал = Макет.ПолучитьОбласть("ПодвалСправкаОСуммахДоходаОПВ");
			Макеты.ШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТЧСправкаОСуммахДоходаОПВ");
			Макеты.СтрокаТЧ = Макет.ПолучитьОбласть("СтрокаТЧСправкаОСуммахДоходаОПВ");
			Макеты.ПодвалТЧ = Макет.ПолучитьОбласть("ПодвалТЧСправкаОСуммахДоходаОПВ");
			Макеты.Группировка = Макет.ПолучитьОбласть("Группировка");
			
		Иначе
			
			Макеты = Новый Структура("Шапка,Подвал,ШапкаТЧ,СтрокаТЧ,ПодвалТЧ,Группировка");
			
			Макеты.Шапка = Макет.ПолучитьОбласть("ШапкаСправкаСМестаРаботыПередНаступлениемСоциальногоРиска");
			Макеты.Подвал = Макет.ПолучитьОбласть("ПодвалСправкаСМестаРаботыПередНаступлениемСоциальногоРиска");
			Макеты.ШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТЧСправкаСМестаРаботыПередНаступлениемСоциальногоРиска");
			Макеты.СтрокаТЧ = Макет.ПолучитьОбласть("СтрокаТЧСправкаСМестаРаботыПередНаступлениемСоциальногоРиска");
			Макеты.ПодвалТЧ = Макет.ПолучитьОбласть("ПодвалТЧСправкаСМестаРаботыПередНаступлениемСоциальногоРиска");
			Макеты.Группировка = Макет.ПолучитьОбласть("Группировка");
			
		КонецЕсли;
		
		
		ЕстьГруппировкаПоОрганизации = ДанныеОтчета.Строки.Количество() > 1;
		
		Организация = Неопределено;
		Подразделение = Неопределено;
		
		ДокументРезультатСтраница = Новый ТабличныйДокумент;
		
		Если СправкаОЗаработнойПлате Тогда
		
			Для Каждого СтрокаОрганизации Из ДанныеОтчета.Строки Цикл
				
				Если ЕстьГруппировкаПоОрганизации Тогда
					
					Макеты.Группировка.Параметры.НазваниеПараметра = НСтр("ru='Организация'");
					Макеты.Группировка.Параметры.Значение = СтрокаОрганизации.Организация;
					
					ДокументРезультат.Вывести(Макеты.Группировка);
					Организация = СтрокаОрганизации.Организация;
					
				КонецЕсли;
				
				ОрганизацияНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаОрганизации.Организация, "НаименованиеПолное");
				ОрганизацияБИН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаОрганизации.Организация, "ИНН");
				
				ЗаполняемыеЗначения = Новый Структура("Организация,Руководитель,ГлавныйБухгалтер,ДолжностьРуководителя, Ответственный", СтрокаОрганизации.Организация);
				ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения);
				
				СписокФизлицРуководства = Новый Массив;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Руководитель) Тогда
					СписокФизлицРуководства.Добавить(ЗаполняемыеЗначения.Руководитель);
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.ГлавныйБухгалтер) Тогда
					СписокФизлицРуководства.Добавить(ЗаполняемыеЗначения.ГлавныйБухгалтер);
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Ответственный) Тогда
					ЗаполняемыеЗначения.Ответственный = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаполняемыеЗначения.Ответственный, "ФизическоеЛицо");
					Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Ответственный) Тогда
						СписокФизлицРуководства.Добавить(ЗаполняемыеЗначения.Ответственный);
					КонецЕсли;
				КонецЕсли;
				
				КадровыеДанныеФизическихЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, СписокФизлицРуководства, "ФамилияИО");
				
				ПараметрыОтветственныхЛиц = Новый Структура ("Руководитель, ФИОРуководитель, ГлавныйБухгалтер, ФИОГлавныйБухгалтер, Исполнитель, ФИОИсполнитель");
				
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Руководитель) Тогда
					ФИО = КадровыеДанныеФизическихЛиц.Найти(ЗаполняемыеЗначения.Руководитель, "ФизическоеЛицо");
					ПараметрыОтветственныхЛиц.ФИОРуководитель = ?(ФИО <> Неопределено, ФИО.ФамилияИО,"");
					ПараметрыОтветственныхЛиц.Руководитель = ЗаполняемыеЗначения.ДолжностьРуководителя;
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.ГлавныйБухгалтер) Тогда
					ФИО = КадровыеДанныеФизическихЛиц.Найти(ЗаполняемыеЗначения.ГлавныйБухгалтер, "ФизическоеЛицо");
					ПараметрыОтветственныхЛиц.ФИОГлавныйБухгалтер = ?(ФИО <> Неопределено, ФИО.ФамилияИО,"");
					ПараметрыОтветственныхЛиц.ГлавныйБухгалтер = ЗаполняемыеЗначения.ГлавныйБухгалтер;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Ответственный) Тогда
					ФИО = КадровыеДанныеФизическихЛиц.Найти(ЗаполняемыеЗначения.Ответственный, "ФизическоеЛицо");
					ПараметрыОтветственныхЛиц.ФИОИсполнитель = ?(ФИО <> Неопределено, ФИО.ФамилияИО,"");
				КонецЕсли;
				
				ДолжностьОтветственного = "";
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Ответственный) Тогда
					СписокФизЛиц = Новый Массив;
					СписокФизЛиц.Добавить(ЗаполняемыеЗначения.Ответственный);
					ОсновныеСотрудникиФизическихЛиц = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(СписокФизЛиц, Истина, Организация, ТекущаяДатаСеанса());
					
					Если ОсновныеСотрудникиФизическихЛиц.Количество() > 0  Тогда
						СписокСотрудников = Новый Массив;
						СписокСотрудников.Добавить(ОсновныеСотрудникиФизическихЛиц[0].Сотрудник);
						
						КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, СписокСотрудников, "Должность");
						
						Если КадровыеДанные.Количество() > 0 Тогда
							ДолжностьОтветственного = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КадровыеДанные[0].Должность, "Наименование");
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				ПараметрыОтветственныхЛиц.Исполнитель = ДолжностьОтветственного;
				
				Для Каждого СтрокаФизЛица Из СтрокаОрганизации.Строки Цикл
					
					ЗаполнитьЗначенияСвойств(Макеты.Шапка.Параметры,СтрокаФизЛица);
					Макеты.Шапка.Параметры.ТабельныйНомер = ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(СтрокаФизЛица.ТабельныйНомер, Истина, Истина);
					Макеты.Шапка.Параметры.ИИН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "ИНН");
					Макеты.Шапка.Параметры.НачалоПериода = МакетКомпоновкиДанных.ЗначенияПараметров.НачалоПериода.Значение;
					Макеты.Шапка.Параметры.КонецПериода =  МакетКомпоновкиДанных.ЗначенияПараметров.КонецПериода.Значение;
					Макеты.Шапка.Параметры.Организация = ОрганизацияНаименование;
					Макеты.Шапка.Параметры.БИННалогоплательщика = ОрганизацияБИН;
					Макеты.Шапка.Параметры.ТекущаяДата = ТекущаяДатаСеанса();
					СведенияОСотруднике = "";
					Если ЗначениеЗаполнено(СтрокаФизЛица.ПодразделениеОсновногоСотрудника) Тогда
						СведенияОСотруднике = Строка(СтрокаФизЛица.ПодразделениеОсновногоСотрудника);
					КонецЕсли;
					Если ЗначениеЗаполнено(СтрокаФизЛица.Должность) Тогда
						СведенияОСотруднике = СведенияОСотруднике + ", " + Строка(СтрокаФизЛица.Должность);
					КонецЕсли;
					Макеты.Шапка.Параметры.СведенияОСотруднике = СведенияОСотруднике;
					
					ДокументРезультат.Вывести(Макеты.Шапка);
					ДокументРезультат.Вывести(Макеты.ШапкаТЧ);
					
					Для Каждого СтрокаМесяцев Из СтрокаФизЛица.Строки Цикл
						
						Если СтрокаМесяцев.СуммаДохода = 0
							И СтрокаМесяцев.СуммаОПВ = 0
							И СтрокаМесяцев.СуммаИПН = 0
							И СтрокаМесяцев.СуммаВОСМС = 0
							И СтрокаМесяцев.ИтогоКВыплатеРаботнику = 0 Тогда
								Продолжить;
						КонецЕсли;
						                                                                                               
						ЗаполнитьЗначенияСвойств(Макеты.СтрокаТЧ.Параметры,СтрокаМесяцев);
						Макеты.СтрокаТЧ.Параметры.Месяц = СтрокаМесяцев.МесяцНалоговогоПериода;
						
						Если НЕ ДокументРезультат.ПроверитьВывод(Макеты.СтрокаТЧ) Тогда
							ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
							ДокументРезультат.Вывести(Макеты.ШапкаТЧ);
						КонецЕсли;
						
						ДокументРезультат.Вывести(Макеты.СтрокаТЧ);
						
					КонецЦикла;
					
					Если НЕ ДокументРезультат.ПроверитьВывод(Макеты.ПодвалТЧ) Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
						ДокументРезультат.Вывести(Макеты.ШапкаТЧ);
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(Макеты.ПодвалТЧ.Параметры,СтрокаФизЛица);
					ДокументРезультат.Вывести(Макеты.ПодвалТЧ);
					
					Если НЕ ДокументРезультат.ПроверитьВывод(Макеты.Подвал) Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(Макеты.Подвал.Параметры, ПараметрыОтветственныхЛиц);
					ДокументРезультат.Вывести(Макеты.Подвал);
					
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					
				КонецЦикла;
				
				
			КонецЦикла;
			
		ИначеЕсли  СправкаПодтверждениеОПеречисленииОПВ Тогда
			
			Для Каждого СтрокаОрганизации Из ДанныеОтчета.Строки Цикл
				
				Если ЕстьГруппировкаПоОрганизации Тогда
					
					Макеты.Группировка.Параметры.НазваниеПараметра = НСтр("ru='Организация'");
					Макеты.Группировка.Параметры.Значение = СтрокаОрганизации.Организация;
					
					ДокументРезультат.Вывести(Макеты.Группировка);
					Организация = СтрокаОрганизации.Организация;
					
				КонецЕсли;
				
				СтрокаСведений = "ИННЮЛ, НаимЮЛПол, ПолныйАдрЮР";
				СведенияОбОрганизации = РегламентированнаяОтчетностьРК.ПолучитьСведенияОбОрганизации(СтрокаОрганизации.Организация,ТекущаяДатаСеанса(),СтрокаСведений);
				ПолныйАдрЮР = "";
				ИННЮЛ = "";
				НаимЮЛПол = "";
				
				Если СведенияОбОрганизации.Количество() > 0 Тогда
					Если ЗначениеЗаполнено(СведенияОбОрганизации.ПолныйАдрЮР) Тогда
						ПолныйАдрЮР = СокрЛП(СведенияОбОрганизации.ПолныйАдрЮР);
					КонецЕсли;
					Если ЗначениеЗаполнено(СведенияОбОрганизации.ИННЮЛ) Тогда
						ИННЮЛ = СокрЛП(СведенияОбОрганизации.ИННЮЛ);
					КонецЕсли;
					Если ЗначениеЗаполнено(СведенияОбОрганизации.НаимЮЛПол) Тогда
						НаимЮЛПол = СокрЛП(СведенияОбОрганизации.НаимЮЛПол);
					КонецЕсли;
				КонецЕсли;
				
				ЗаполняемыеЗначения = Новый Структура("Организация,Руководитель,ГлавныйБухгалтер ", СтрокаОрганизации.Организация);
				ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения);
				
				СписокФизлицРуководства = Новый Массив;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Руководитель) Тогда
					СписокФизлицРуководства.Добавить(ЗаполняемыеЗначения.Руководитель);
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.ГлавныйБухгалтер) Тогда
					СписокФизлицРуководства.Добавить(ЗаполняемыеЗначения.ГлавныйБухгалтер);
				КонецЕсли;
				
				КадровыеДанныеФизическихЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, СписокФизлицРуководства, "ФИОПолные");
				
				ПараметрыОтветственныхЛиц = Новый Структура ("Руководитель, ФИОРуководитель, ГлавныйБухгалтер, ФИОГлавныйБухгалтер, Исполнитель, ФИОИсполнитель");
				
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Руководитель) Тогда
					ФИО = КадровыеДанныеФизическихЛиц.Найти(ЗаполняемыеЗначения.Руководитель, "ФизическоеЛицо");
					ПараметрыОтветственныхЛиц.ФИОРуководитель = ?(ФИО <> Неопределено, ФИО.ФИОПолные,"");
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.ГлавныйБухгалтер) Тогда
					ФИО = КадровыеДанныеФизическихЛиц.Найти(ЗаполняемыеЗначения.ГлавныйБухгалтер, "ФизическоеЛицо");
					ПараметрыОтветственныхЛиц.ФИОГлавныйБухгалтер = ?(ФИО <> Неопределено, ФИО.ФИОПолные,"");
				КонецЕсли;
				
				Для Каждого СтрокаФизЛица Из СтрокаОрганизации.Строки Цикл
					
					ЗаполнитьЗначенияСвойств(Макеты.Шапка.Параметры,СтрокаФизЛица);
					Макеты.Шапка.Параметры.ФизическоеЛицо 	= СтрокаФизЛица.ФизическоеЛицо;
					Макеты.Шапка.Параметры.Фамилия			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "Фамилия");
					Макеты.Шапка.Параметры.Имя 				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "Имя");
					Макеты.Шапка.Параметры.Отчество 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "Отчество");
					Макеты.Шапка.Параметры.ИИН 				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "ИНН");
					Макеты.Шапка.Параметры.ДатаРождения 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "ДатаРождения");
					Макеты.Шапка.Параметры.НачалоПериода 	= МакетКомпоновкиДанных.ЗначенияПараметров.НачалоПериода.Значение;
					Макеты.Шапка.Параметры.КонецПериода 	= МакетКомпоновкиДанных.ЗначенияПараметров.КонецПериода.Значение;
					Макеты.Шапка.Параметры.ДокументВид		= СтрокаФизЛица.ДокументВид;
					Макеты.Шапка.Параметры.ДокументНомер	= СтрокаФизЛица.ДокументНомер;
					Макеты.Шапка.Параметры.ДокументаВыдан	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru ='%1 %2'"), СтрокаФизЛица.ДокументКемВыдан, Формат(СтрокаФизЛица.ДокументДатаВыдачи, "ДЛФ=Д"));

					Макеты.Шапка.Параметры.Организация = НаимЮЛПол;
					Макеты.Шапка.Параметры.БИННалогоплательщика = ИННЮЛ;
					Макеты.Шапка.Параметры.АдресОрганизации = ПолныйАдрЮР;
					ДокументРезультат.Вывести(Макеты.Шапка);
					ДокументРезультат.Вывести(Макеты.ШапкаТЧ);
					
					КоличествоМесяцев = 0;
					
					Для Каждого СтрокаМесяцев Из СтрокаФизЛица.Строки Цикл
						
						Если СтрокаМесяцев.СуммаОПВПеречисленный = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						ЗаполнитьЗначенияСвойств(Макеты.СтрокаТЧ.Параметры,СтрокаМесяцев);
						Макеты.СтрокаТЧ.Параметры.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаМесяцев.Контрагент, "НаименованиеПолное");
						Макеты.СтрокаТЧ.Параметры.БанковскийСчетКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаМесяцев.БанковскийСчетКонтрагента, "НомерСчета");
						Макеты.СтрокаТЧ.Параметры.БИКБанка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаМесяцев.Банк, "Код");
					
						Если НЕ ДокументРезультат.ПроверитьВывод(Макеты.СтрокаТЧ) Тогда
							ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
							ДокументРезультат.Вывести(Макеты.ШапкаТЧ);
						КонецЕсли;
						
						ДокументРезультат.Вывести(Макеты.СтрокаТЧ);
						КоличествоМесяцев = КоличествоМесяцев + 1;
						
					КонецЦикла;
												
					Если НЕ ДокументРезультат.ПроверитьВывод(Макеты.Подвал) Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(Макеты.Подвал.Параметры, ПараметрыОтветственныхЛиц);
							
					ДокументРезультат.Вывести(Макеты.Подвал);
					
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					
				КонецЦикла;
				
			КонецЦикла;
			
		ИначеЕсли СправкаОСуммахДоходаОПВ Тогда
			
			Для Каждого СтрокаОрганизации Из ДанныеОтчета.Строки Цикл
				
				Если ЕстьГруппировкаПоОрганизации Тогда
					
					Макеты.Группировка.Параметры.НазваниеПараметра = НСтр("ru='Организация'");
					Макеты.Группировка.Параметры.Значение = СтрокаОрганизации.Организация;
					
					ДокументРезультат.Вывести(Макеты.Группировка);
					Организация = СтрокаОрганизации.Организация;
					
				КонецЕсли;
				
				СтрокаСведений = "ИННЮЛ, НаимЮЛПол, ПолныйАдрЮР";
				СведенияОбОрганизации = РегламентированнаяОтчетностьРК.ПолучитьСведенияОбОрганизации(СтрокаОрганизации.Организация,ТекущаяДатаСеанса(),СтрокаСведений);
				ПолныйАдрЮР = "";
				ИННЮЛ = "";
				НаимЮЛПол = "";
				
				Если СведенияОбОрганизации.Количество() > 0 Тогда
					Если ЗначениеЗаполнено(СведенияОбОрганизации.ПолныйАдрЮР) Тогда
						ПолныйАдрЮР = СокрЛП(СведенияОбОрганизации.ПолныйАдрЮР);
					КонецЕсли;
					Если ЗначениеЗаполнено(СведенияОбОрганизации.ИННЮЛ) Тогда
						ИННЮЛ = СокрЛП(СведенияОбОрганизации.ИННЮЛ);
					КонецЕсли;
					Если ЗначениеЗаполнено(СведенияОбОрганизации.НаимЮЛПол) Тогда
						НаимЮЛПол = СокрЛП(СведенияОбОрганизации.НаимЮЛПол);
					КонецЕсли;
				КонецЕсли;
				
				ЗаполняемыеЗначения = Новый Структура("Организация,Руководитель,ГлавныйБухгалтер ", СтрокаОрганизации.Организация);
				ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения);
				
				СписокФизлицРуководства = Новый Массив;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Руководитель) Тогда
					СписокФизлицРуководства.Добавить(ЗаполняемыеЗначения.Руководитель);
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.ГлавныйБухгалтер) Тогда
					СписокФизлицРуководства.Добавить(ЗаполняемыеЗначения.ГлавныйБухгалтер);
				КонецЕсли;
				
				КадровыеДанныеФизическихЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, СписокФизлицРуководства, "ФИОПолные");
				
				ПараметрыОтветственныхЛиц = Новый Структура ("Руководитель, ФИОРуководитель, ГлавныйБухгалтер, ФИОГлавныйБухгалтер, Исполнитель, ФИОИсполнитель");
				
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Руководитель) Тогда
					ФИО = КадровыеДанныеФизическихЛиц.Найти(ЗаполняемыеЗначения.Руководитель, "ФизическоеЛицо");
					ПараметрыОтветственныхЛиц.ФИОРуководитель = ?(ФИО <> Неопределено, ФИО.ФИОПолные,"");
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.ГлавныйБухгалтер) Тогда
					ФИО = КадровыеДанныеФизическихЛиц.Найти(ЗаполняемыеЗначения.ГлавныйБухгалтер, "ФизическоеЛицо");
					ПараметрыОтветственныхЛиц.ФИОГлавныйБухгалтер = ?(ФИО <> Неопределено, ФИО.ФИОПолные,"");
				КонецЕсли;
				
				Для Каждого СтрокаФизЛица Из СтрокаОрганизации.Строки Цикл
					
					Если СтрокаФизЛица.СуммаДохода = 0
						И СтрокаФизЛица.СуммаОПВ = 0
						И СтрокаФизЛица.СуммаПениОПВ = 0
						И СтрокаФизЛица.СуммаОПВПеречисленный = 0 Тогда
						
						Продолжить;
						
					КонецЕсли;
						                                                                                               
					ЗаполнитьЗначенияСвойств(Макеты.Шапка.Параметры, СтрокаФизЛица);
					Макеты.Шапка.Параметры.ДатаПодписи		= ТекущаяДатаСеанса();
					Макеты.Шапка.Параметры.Фамилия			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "Фамилия");
					Макеты.Шапка.Параметры.Имя 				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "Имя");
					Макеты.Шапка.Параметры.Отчество 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "Отчество");
					Макеты.Шапка.Параметры.ИИН 				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "ИНН");
					Макеты.Шапка.Параметры.ТабельныйНомер	= ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(СтрокаФизЛица.ТабельныйНомер, Истина, Истина);
					Макеты.Шапка.Параметры.НачалоПериода 	= МакетКомпоновкиДанных.ЗначенияПараметров.НачалоПериода.Значение;
					Макеты.Шапка.Параметры.КонецПериода 	= МакетКомпоновкиДанных.ЗначенияПараметров.КонецПериода.Значение;

					Макеты.Шапка.Параметры.Организация = НаимЮЛПол;
					Макеты.Шапка.Параметры.БИННалогоплательщика = ИННЮЛ;
					Макеты.Шапка.Параметры.АдресОрганизации = ПолныйАдрЮР;
					ДокументРезультат.Вывести(Макеты.Шапка);
					ДокументРезультат.Вывести(Макеты.ШапкаТЧ);
					
					КоличествоМесяцев = 0;
					
					ВыводимыйГод = Дата(1, 1, 1);
					
					ИтогоСуммаДохода = 0;
					ИтогоСуммаОПВ = 0;
					ИтогоСуммаОПВПеречисленный = 0;
					ИтогоСуммаПениОПВ = 0;
					
					Для Каждого СтрокаМесяцев Из СтрокаФизЛица.Строки Цикл
						
						Если НЕ Год(СтрокаМесяцев.МесяцНалоговогоПериода) = Год(ВыводимыйГод) Тогда
							
							// выведем итог по году
							Если НЕ ВыводимыйГод = Дата(1, 1, 1) Тогда
								
								Макеты.ПодвалТЧ.Параметры.Год = Год(ВыводимыйГод);
								Макеты.ПодвалТЧ.Параметры.СуммаДохода = ИтогоСуммаДохода;
								Макеты.ПодвалТЧ.Параметры.СуммаОПВ	  = ИтогоСуммаОПВ + ИтогоСуммаПениОПВ;
								Макеты.ПодвалТЧ.Параметры.СуммаОПВПеречисленный = ИтогоСуммаОПВПеречисленный;
								Макеты.ПодвалТЧ.Параметры.СуммаПениОПВ = ИтогоСуммаПениОПВ;
								
								Если НЕ ДокументРезультат.ПроверитьВывод(Макеты.ПодвалТЧ) Тогда
									ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
								КонецЕсли;
								
								ДокументРезультат.Вывести(Макеты.ПодвалТЧ);
								
								ВыводимыйГод = СтрокаМесяцев.МесяцНалоговогоПериода;
								
							Иначе
								
								ВыводимыйГод = СтрокаМесяцев.МесяцНалоговогоПериода;
								
							КонецЕсли;
							
							ИтогоСуммаДохода = СтрокаМесяцев.СуммаДохода;
							ИтогоСуммаОПВПеречисленный = СтрокаМесяцев.СуммаОПВПеречисленный;
							ИтогоСуммаПениОПВ = СтрокаМесяцев.СуммаПениОПВ;
							ИтогоСуммаОПВ = СтрокаМесяцев.СуммаОПВ + СтрокаМесяцев.СуммаПениОПВ;
							
						Иначе
						
							ИтогоСуммаДохода = ИтогоСуммаДохода + СтрокаМесяцев.СуммаДохода;
							ИтогоСуммаОПВ = ИтогоСуммаОПВ + СтрокаМесяцев.СуммаОПВ;
							ИтогоСуммаОПВПеречисленный = ИтогоСуммаОПВПеречисленный + СтрокаМесяцев.СуммаОПВПеречисленный;
							ИтогоСуммаПениОПВ = ИтогоСуммаПениОПВ + СтрокаМесяцев.СуммаПениОПВ;
						
						КонецЕсли;
						
						ЗаполнитьЗначенияСвойств(Макеты.СтрокаТЧ.Параметры, СтрокаМесяцев);
						
						// учтем ситуации, когда вся сумма была сторнирована (возврат)
						Если НЕ СтрокаМесяцев.СуммаОПВПеречисленный = 0
							И (ЗначениеЗаполнено(СтрокаМесяцев.ДатаПлатежногоДокумента)
							ИЛИ ЗначениеЗаполнено(СтрокаМесяцев.НомерПлатежногоДокумента)
							ИЛИ ЗначениеЗаполнено(СтрокаМесяцев.ПеречисленоЗаПериод)) Тогда
							
							Макеты.СтрокаТЧ.Параметры.РеквизитыПлатежногоДокумента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, %2, %3'"),
														Формат(СтрокаМесяцев.ДатаПлатежногоДокумента, "ДФ=dd.MM.yyyy"), СтрокаМесяцев.НомерПлатежногоДокумента, Формат(СтрокаМесяцев.ПеречисленоЗаПериод, "ДФ='ММММ гггг'"));
														
						Иначе
							Макеты.СтрокаТЧ.Параметры.РеквизитыПлатежногоДокумента = "";
						КонецЕсли;								
						
						Макеты.СтрокаТЧ.Параметры.СуммаОПВ = СтрокаМесяцев.СуммаОПВ + СтрокаМесяцев.СуммаПениОПВ;
						
						Если НЕ ДокументРезультат.ПроверитьВывод(Макеты.СтрокаТЧ) Тогда
							ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
							ДокументРезультат.Вывести(Макеты.ШапкаТЧ);
						КонецЕсли;
						
						ДокументРезультат.Вывести(Макеты.СтрокаТЧ);
						КоличествоМесяцев = КоличествоМесяцев + 1;
						
					КонецЦикла;
												
					Макеты.ПодвалТЧ.Параметры.Год = Год(ВыводимыйГод);
					Макеты.ПодвалТЧ.Параметры.СуммаДохода = ИтогоСуммаДохода;
					Макеты.ПодвалТЧ.Параметры.СуммаОПВ	  = ИтогоСуммаОПВ + ИтогоСуммаПениОПВ;
					Макеты.ПодвалТЧ.Параметры.СуммаОПВПеречисленный = ИтогоСуммаОПВПеречисленный;
					Макеты.ПодвалТЧ.Параметры.СуммаПениОПВ = ИтогоСуммаПениОПВ;
					
					Если НЕ ДокументРезультат.ПроверитьВывод(Макеты.ПодвалТЧ) Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					
					ДокументРезультат.Вывести(Макеты.ПодвалТЧ);
					
					ЗаполнитьЗначенияСвойств(Макеты.Подвал.Параметры, ПараметрыОтветственныхЛиц);
					Макеты.Подвал.Параметры.КоличествоМесяцев = КоличествоМесяцев;
					Макеты.Подвал.Параметры.ИтогоСумма = Строка(СтрокаФизЛица.СуммаДохода) + " (" + СокрЛП(РаботаСКурсамиВалют.СформироватьСуммуПрописью(
						СтрокаФизЛица.СуммаДохода, ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты())) + ")";
					
					ДокументРезультат.Вывести(Макеты.Подвал);
					
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					
				КонецЦикла;
				
			КонецЦикла;
			
		Иначе
			
			Для Каждого СтрокаОрганизации Из ДанныеОтчета.Строки Цикл
				
				Если ЕстьГруппировкаПоОрганизации Тогда
					
					Макеты.Группировка.Параметры.НазваниеПараметра = НСтр("ru='Организация'");
					Макеты.Группировка.Параметры.Значение = СтрокаОрганизации.Организация;
					
					ДокументРезультат.Вывести(Макеты.Группировка);
					Организация = СтрокаОрганизации.Организация;
					
				КонецЕсли;
				
				//ОрганизацияНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаОрганизации.Организация, "НаименованиеПолное");
				//ОрганизацияБИН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаОрганизации.Организация, "ИНН");
				СтрокаСведений = "ИННЮЛ, НаимЮЛПол, ПолныйАдрЮР";
				СведенияОбОрганизации = РегламентированнаяОтчетностьРК.ПолучитьСведенияОбОрганизации(СтрокаОрганизации.Организация,ТекущаяДатаСеанса(),СтрокаСведений);
				РеквизитыОрганизации = "";
				
				Если ЗначениеЗаполнено(СведенияОбОрганизации.ПолныйАдрЮР) Тогда
					РеквизитыОрганизации = РеквизитыОрганизации 
						+ ?(ЗначениеЗаполнено(РеквизитыОрганизации), "; ", "") + СокрЛП(СведенияОбОрганизации.ПолныйАдрЮР);
				КонецЕсли;
				Если ЗначениеЗаполнено(СведенияОбОрганизации.ИННЮЛ) Тогда
					РеквизитыОрганизации = РеквизитыОрганизации 
						+ ?(ЗначениеЗаполнено(РеквизитыОрганизации), "; ", "") + НСтр("ru = 'БИН: '") + СокрЛП(СведенияОбОрганизации.ИННЮЛ);
				КонецЕсли;
				
				ЗаполняемыеЗначения = Новый Структура("Организация,Руководитель,ГлавныйБухгалтер,ДолжностьРуководителя ", СтрокаОрганизации.Организация);
				ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения);
				
				СписокФизлицРуководства = Новый Массив;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Руководитель) Тогда
					СписокФизлицРуководства.Добавить(ЗаполняемыеЗначения.Руководитель);
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.ГлавныйБухгалтер) Тогда
					СписокФизлицРуководства.Добавить(ЗаполняемыеЗначения.ГлавныйБухгалтер);
				КонецЕсли;
				
				КадровыеДанныеФизическихЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, СписокФизлицРуководства, "ФамилияИО");
				
				ПараметрыОтветственныхЛиц = Новый Структура ("Руководитель, ФИОРуководитель, ГлавныйБухгалтер, ФИОГлавныйБухгалтер, Исполнитель, ФИОИсполнитель");
				
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Руководитель) Тогда
					ФИО = КадровыеДанныеФизическихЛиц.Найти(ЗаполняемыеЗначения.Руководитель, "ФизическоеЛицо");
					ПараметрыОтветственныхЛиц.ФИОРуководитель = ?(ФИО <> Неопределено, ФИО.ФамилияИО,"");
					ПараметрыОтветственныхЛиц.Руководитель = ЗаполняемыеЗначения.ДолжностьРуководителя;
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.ГлавныйБухгалтер) Тогда
					ФИО = КадровыеДанныеФизическихЛиц.Найти(ЗаполняемыеЗначения.ГлавныйБухгалтер, "ФизическоеЛицо");
					ПараметрыОтветственныхЛиц.ФИОГлавныйБухгалтер = ?(ФИО <> Неопределено, ФИО.ФамилияИО,"");
					ПараметрыОтветственныхЛиц.ГлавныйБухгалтер = ЗаполняемыеЗначения.ГлавныйБухгалтер;
				КонецЕсли;
				
				Для Каждого СтрокаФизЛица Из СтрокаОрганизации.Строки Цикл
					
					ЗаполнитьЗначенияСвойств(Макеты.Шапка.Параметры,СтрокаФизЛица);
					Макеты.Шапка.Параметры.ИИН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "ИНН");
					Макеты.Шапка.Параметры.Организация = СведенияОбОрганизации.НаимЮЛПол;
					Макеты.Шапка.Параметры.РеквизитыОрганизации = РеквизитыОрганизации;
					ДокументРезультат.Вывести(Макеты.Шапка);
					ДокументРезультат.Вывести(Макеты.ШапкаТЧ);
					
					КоличествоМесяцев = 0;
					
					Для Каждого СтрокаМесяцев Из СтрокаФизЛица.Строки Цикл
						
						Если СтрокаМесяцев.ОбъектИсчисленияСО = 0
							И СтрокаМесяцев.СуммаСО = 0
							И СтрокаМесяцев.СуммаСОУплаченная = 0 Тогда
								Продолжить;
						КонецЕсли;
						
						ЗаполнитьЗначенияСвойств(Макеты.СтрокаТЧ.Параметры,СтрокаМесяцев);
						Макеты.СтрокаТЧ.Параметры.Период = СтрокаМесяцев.МесяцНалоговогоПериода;
						
						Если НЕ ДокументРезультат.ПроверитьВывод(Макеты.СтрокаТЧ) Тогда
							ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
							ДокументРезультат.Вывести(Макеты.ШапкаТЧ);
						КонецЕсли;
						
						ДокументРезультат.Вывести(Макеты.СтрокаТЧ);
						КоличествоМесяцев = КоличествоМесяцев + 1;
						
					КонецЦикла;
					
					Если НЕ ДокументРезультат.ПроверитьВывод(Макеты.ПодвалТЧ) Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
						ДокументРезультат.Вывести(Макеты.ШапкаТЧ);
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(Макеты.ПодвалТЧ.Параметры,СтрокаФизЛица);
					ДокументРезультат.Вывести(Макеты.ПодвалТЧ);
					
					Если НЕ ДокументРезультат.ПроверитьВывод(Макеты.Подвал) Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(Макеты.Подвал.Параметры, ПараметрыОтветственныхЛиц);
					Макеты.Подвал.Параметры.ТекущаяДата = ТекущаяДатаСеанса();
					Макеты.Подвал.Параметры.СуммаДохода = СтрокаФизЛица.ОбъектИсчисленияСО;
					Макеты.Подвал.Параметры.СуммаДоходаПрописью = СокрЛП(РаботаСКурсамиВалют.СформироватьСуммуПрописью(
						СтрокаФизЛица.ОбъектИсчисленияСО,ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты(),Истина));
					Макеты.Подвал.Параметры.КоличествоМесяцев = КоличествоМесяцев;
					
					ДокументРезультат.Вывести(Макеты.Подвал);
					
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
			
		
		ДопСвойства = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;
		ДопСвойства.Вставить("ОтчетПустой", ДанныеОтчета.Строки.Количество() = 0);
		
	Исключение
		
		Инфо = ИнформацияОбОшибке();
		ВызватьИсключение НСтр("ru = 'В настройку отчета "+
			?(СправкаОЗаработнойПлате,"""Справка о заработной плате""","""Справка с места работы перед наступлением социального риска""")
			+" внесены критичные изменения. Отчет не будет сформирован.'")
			+ ""
			+ КраткоеПредставлениеОшибки(Инфо);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

ОтчетИнициализирован = Ложь;

#КонецОбласти

#КонецЕсли