
// Функция возвращает значение используемой версии конфигурации Docrobot (совпадает с актуальной версией модуля)
//
// Возвращаемое значение:
//   Строка   - значение версии конфигурации
//
Функция ПолучитьВерсиюКонфигурации() Экспорт

	Возврат "1.21.0";

КонецФункции // ПолучитьВерсиюКонфигурации()

////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЕРЕВО ЗНАЧЕНИЙ

// Функция преобразует иерархический XML в объект типа ДеревоЗначений
//
// Параметры
//  ИмяФайла  - Строка - путь к файлу XML
//  Колонки  - Массив - коллекция колонок создаваемого дерева значений. Может быть не заполнен
//	ДеревоЗначений - ДеревоЗначений - объект, в который будет добавлена структура файла XML.
//		Если не передается, то создается новый объект
//
// Возвращаемое значение:
//   ДеревоЗначений   - объект, созданный в результате работы функции.
//		При создании объекта на него накладывается ограничение: на одном уровне иерархии все
//		элементы будут иметь уникальное имя. Дубли элементов будут удалены из дерева значений.
//
Функция ДеревоЗначенийИзФайлаXML(ИмяФайла, Колонки = Неопределено, ДеревоЗначений = Неопределено) Экспорт

	Если ДеревоЗначений = Неопределено Тогда
    	ДеревоЗначений = Новый ДеревоЗначений();
	КонецЕсли;
	
    Если Колонки = Неопределено Тогда
        
        Колонки = Новый Массив;
        Колонки.Добавить("Тег");
        Колонки.Добавить("Атрибуты");
		Колонки.Добавить("Формула");
        Колонки.Добавить("Служебные");
		Колонки.Добавить("Использовать");
		
	КонецЕсли;
    
    Для каждого Элемент Из Колонки Цикл
		
		Если ДеревоЗначений.Колонки.Найти(Элемент) = Неопределено Тогда
        	ДеревоЗначений.Колонки.Добавить(Элемент);	
		КонецЕсли;
        
    КонецЦикла;    
        
    ЧтениеXML = Новый ЧтениеXML();

    Попытка
		ЧтениеXML.ОткрытьФайл(ИмяФайла);
		ЧтениеXML.Прочитать();
	Исключение
		ЧтениеXML.Закрыть();
		Возврат ДеревоЗначений;
	КонецПопытки;
    
    Корень         = ДеревоЗначений.Строки.Добавить();
	Если ДеревоЗначений.Колонки.Найти("Приемник") = Неопределено Тогда
    	Корень.Тег = ЧтениеXML.Имя; // Старый вариант. Предполагается в итоге отказаться от него, когда будут ликвидированы вкадки Входящие, Исходящие.
		ИмяКолонкиСТегом = "Тег";
	Иначе
		Корень.Приемник = ЧтениеXML.Имя;
		ИмяКолонкиСТегом = "Приемник";
	КонецЕсли;
	
	Корень.Служебные = ЗаполнитьСлужебныеНастройки();
    Рекурсия(Корень, ЧтениеXML, ИмяКолонкиСТегом);
	УбратьДублиСтрокНаОдномУровне(ДеревоЗначений, ИмяКолонкиСТегом);
    Дерево = ДеревоЗначений;
    
    Возврат Дерево;
    
КонецФункции // ДеревоЗначенийИзФайлаXML(ИмяФайла)

Процедура Рекурсия(СтрокаДерева, Чтение, ИмяКолонкиСТегом = "Тег") Экспорт
    
    АтрибутыСоответствие = Новый СписокЗначений;
    Пока Чтение.ПрочитатьАтрибут() Цикл
        АтрибутыСоответствие.Добавить(Чтение.Имя, "");
    КонецЦикла;
    
    Если АтрибутыСоответствие.Количество() > 0 Тогда
       	СтрокаДерева.Атрибуты = АтрибутыСоответствие;
    Иначе
        АтрибутыСоответствие = 0;
    КонецЕсли;
	
    Пока Чтение.Прочитать() Цикл
		Если Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
            Прервать;
        ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.Текст Тогда
            // СтрокаДерева.Текст = Чтение.Значение;
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Дочерний		= СтрокаДерева.Строки.Добавить();
            Дочерний[ИмяКолонкиСТегом]	= Чтение.Имя; // Временное решение. Предполагается в итоге отказаться от него, когда будут ликвидированы вкадки Входящие, Исходящие.
            Рекурсия(Дочерний, Чтение, ИмяКолонкиСТегом);
        КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры

// Процедура заполняет ключи для структуры служебных настроек
//
// Параметры:
//  Служебные  - Структура - коллекция служебных настроек
//
Функция ЗаполнитьСлужебныеНастройки() Экспорт

	Служебные = Новый Структура;
	
	Служебные.Вставить("ВидДокумента", 		Неопределено);
	Служебные.Вставить("ЗаказДата", 		Неопределено);
	Служебные.Вставить("ЗаказНомер", 		Неопределено);  
	Служебные.Вставить("Идентификатор", 	Неопределено);
	Служебные.Вставить("ИдентификаторИспр", Неопределено);
	Служебные.Вставить("Контрагент", 		Неопределено);
	Служебные.Вставить("Номер", 			Неопределено);
	Служебные.Вставить("Организация", 		Неопределено);
	Служебные.Вставить("Ссылка", 			Неопределено);
	Служебные.Вставить("Статус", 			Неопределено);
	Служебные.Вставить("ФайлИмя", 			Неопределено);
	Служебные.Вставить("ЭлектронныйДокумент", Неопределено);

	Возврат Служебные;
	
КонецФункции // ЗаполнитьСлужебныеНастройки()

// Процедура удаляет дубли строк дерева значений на одном уровне иерархии
//
// Параметры:
//  Дерево  - ДеревоЗначений - объект для работы
//
Процедура УбратьДублиСтрокНаОдномУровне(Дерево, ИмяКолонкиСТегом = "Тег")

	Для Каждого Строка Из Дерево.Строки Цикл
		
		Строки = Дерево.Строки.НайтиСтроки(Новый Структура(ИмяКолонкиСТегом, Строка[ИмяКолонкиСТегом])); // Временное решение. Предполагается в итоге отказаться от него, когда будут ликвидированы вкадки Входящие, Исходящие.
		
		Если Строки.Количество() > 1
			И НЕ Строка.Уровень() = 0 Тогда // Можно добавлять несколько одинаковых файлов
			
			Для Индекс = 1 По Строки.Количество() - 1 Цикл
				Дерево.Строки.Удалить(Строки[Индекс]);
			КонецЦикла;
			
		КонецЕсли;
		
		// Рекурсия.
		УбратьДублиСтрокНаОдномУровне(Строка, ИмяКолонкиСТегом);
		
	КонецЦикла;

КонецПроцедуры // УбратьДублиСтрокНаОдномУровне()

Функция ПолучитьТипыОпераций(ТипСписка) Экспорт
	
	СоответствиеТипуОперации = Новый Соответствие;
	Если ТипСписка = "ТипТразакций" Тогда		
		СоответствиеТипуОперации.Вставить("Исходящий RETORD (обратный заказ)"                           , "Поставщик");
		СоответствиеТипуОперации.Вставить("Исходящий ORDRSP (подтверждение заказа)"                     , "Поставщик");
		СоответствиеТипуОперации.Вставить("Исходящий DESADV (подтверждение отгрузки)"                   , "Поставщик");
		СоответствиеТипуОперации.Вставить("Исходящий DESSCC (уведомление об отгрузке)"                  , "Поставщик");
		СоответствиеТипуОперации.Вставить("Исходящий INVOICE (счёт)"                                    , "Поставщик");
		СоответствиеТипуОперации.Вставить("Исходящий RETINS (инструкция о возврате)"                    , "Поставщик");
		СоответствиеТипуОперации.Вставить("Исходящий PRICAT"                                            , "Поставщик"); // Прайс-лист
		СоответствиеТипуОперации.Вставить("Исходящий ЮЗД - универсальный передаточный документ"         , "Поставщик");
		СоответствиеТипуОперации.Вставить("Исходящий DP_REZRUISP (Акт выполненных работ)"               , "Поставщик");
		
		СоответствиеТипуОперации.Вставить("Исходящий ORDER (заказ поставщику)"       , "Покупатель");
		СоответствиеТипуОперации.Вставить("Исходящий RECADV (уведомление о приеме)"  , "Покупатель");
		СоответствиеТипуОперации.Вставить("Исходящий RETANN (уведомление о возврате)", "Покупатель");
		СоответствиеТипуОперации.Вставить("Исходящий STATUS (Служебный документ)"    , "Покупатель");
		
		СоответствиеТипуОперации.Вставить("Исходящий DP_PRANNUL_22 (поставщик - аннулирование)" , "Поставщик");
		СоответствиеТипуОперации.Вставить("Исходящий DP_PRANNUL_22 (покупатель - аннулирование)", "Покупатель");
		СоответствиеТипуОперации.Вставить("Исходящий DP_IZVPOL_23 (подтверждение аннулирования)", "Общий");
		СоответствиеТипуОперации.Вставить("Исходящий DP_UVUTOCH_24 (отклонение аннулирования)"  , "Общий");
		
		СоответствиеТипуОперации.Вставить("Исходящий WHGOV_01 (Отгрузка - сообщение ГО) - ПЭП Кладовщика" , "ЭТРН_Отправитель");
		СоответствиеТипуОперации.Вставить("Исходящий WHGOU_04 (Отгрузка - титул ГО) - КЭП ГО"             , "ЭТРН_Отправитель");
		СоответствиеТипуОперации.Вставить("Исходящий WHGPV_05 (Приемка - сообщение ГП) - ПЭП"             , "ЭТРН_Получатель");
		СоответствиеТипуОперации.Вставить("Исходящий WHGPU_08 (Приемка - титул ГП) - Титул ГП"            , "ЭТРН_Получатель");
		
		СоответствиеТипуОперации.Вставить("Исходящий CONDRA (Принятие)"  , "CONDRA");
		СоответствиеТипуОперации.Вставить("Исходящий CONDRA (Отклонение)", "CONDRA");
		
		СоответствиеТипуОперации.Вставить("Исходящий DP_REZRUISP (Акт выполненных работ)", "Общий");
		
	ИначеЕсли ТипСписка = "ТипТразакцийВходящий" Тогда	
		СоответствиеТипуОперации.Вставить("Входящий ORDER"                           , "Поставщик");
		СоответствиеТипуОперации.Вставить("Входящий RECADV"                          , "Поставщик");
		СоответствиеТипуОперации.Вставить("Входящий RETANN (уведомление о возврате)" , "Поставщик");
		СоответствиеТипуОперации.Вставить("Входящий DPOTORG1 (акт о приемке товаров)", "Поставщик");
		СоответствиеТипуОперации.Вставить("Входящий DPOTORG2 (акт о расхождении)"    , "Поставщик");
		СоответствиеТипуОперации.Вставить("Входящий INSDES"                          , "Поставщик"); // Инструкция по отгрузке
				
		СоответствиеТипуОперации.Вставить("Входящий DESADV"                                            , "Покупатель");
		СоответствиеТипуОперации.Вставить("Входящий ORDRSP"                                            , "Покупатель");
		СоответствиеТипуОперации.Вставить("Входящий INVOICE"                                           , "Покупатель");
		СоответствиеТипуОперации.Вставить("Входящий DESSCC"                                            , "Покупатель");
		СоответствиеТипуОперации.Вставить("Входящий RETINS (инструкция о возврате)"                    , "Покупатель");
		СоответствиеТипуОперации.Вставить("Входящий PRICAT"                                            , "Покупатель"); // Прайс-лист
		СоответствиеТипуОперации.Вставить("Входящий ЮЗД - универсальный передаточный документ", "Покупатель");

		СоответствиеТипуОперации.Вставить("Входящий WHGOV_01 (Отгрузка - сообщение ГО) - ПЭП Кладовщика", "ЭТРН_Перевозчик");
		СоответствиеТипуОперации.Вставить("Входящий WHGPV_05 (Приемка - сообщение ГП) - ПЭП"            , "ЭТРН_Перевозчик");
		СоответствиеТипуОперации.Вставить("Входящий WHGOU_04 (Отгрузка - титул ГО) - КЭП ГО"            , "ЭТРН_Получатель");
		СоответствиеТипуОперации.Вставить("Входящий WHGPU_08 (Приемка - титул ГП) - Титул ГП"           , "ЭТРН_Отправитель");
						
		СоответствиеТипуОперации.Вставить("Входящий CONDRA (Неструктурированный документ)", "CONDRA");

		СоответствиеТипуОперации.Вставить("Входящий DP_PRANNUL_22 (аннулирование)"                , "Общий");
		СоответствиеТипуОперации.Вставить("Входящий DP_IZVPOL_23 (подтверждение аннулирования)", "Общий");
		СоответствиеТипуОперации.Вставить("Входящий DP_UVUTOCH_24 (отклонение аннулирования)"  , "Общий");
		
	ИначеЕсли ТипСписка = "Документы" Тогда		
		СоответствиеТипуОперации.Вставить("Создать заказ"                                              , "Поставщик");
		СоответствиеТипуОперации.Вставить("Создать реализацию"                                         , "Поставщик");
		СоответствиеТипуОперации.Вставить("Создать корректировку реализации"                           , "Поставщик"); 
		СоответствиеТипуОперации.Вставить("Создать счет-фактуру выданный"                              , "Поставщик");
		СоответствиеТипуОперации.Вставить("Создать возврат от покупателя"                              , "Поставщик");
		СоответствиеТипуОперации.Вставить("Создать корректировочную/исправленную счет-фактуру выданный", "Поставщик");
		
		СоответствиеТипуОперации.Вставить("Создать поступление"                                          , "Покупатель");
		СоответствиеТипуОперации.Вставить("Создать счет-фактуру полученный"                              , "Покупатель");
		СоответствиеТипуОперации.Вставить("Создать корректировку поступление"                            , "Покупатель");
		СоответствиеТипуОперации.Вставить("Создать корректировочную/исправленную счет-фактуру полученный", "Покупатель");
		
	ИначеЕсли ТипСписка = "Прочие настройки" Тогда	
		
		СоответствиеТипуОперации.Вставить("СлужебныйЗапросДляПодпискиДокументовПоставщик", "Поставщик");
		СоответствиеТипуОперации.Вставить("СлужебныйЗапросДляФормыПоставщика"			 , "Поставщик");
		СоответствиеТипуОперации.Вставить("СлужебныйЗапросДляПодпискиДокументовСеть"	 , "Покупатель");
		СоответствиеТипуОперации.Вставить("СлужебныйЗапросДляФормыПокупателя"			 , "Покупатель");   		

	КонецЕсли;
	
	Возврат СоответствиеТипуОперации;
	
КонецФункции

Функция ПолучитьСоответствиеИменНастроек() Экспорт
	ИмяКСинониму = Новый Соответствие;
	ИмяКСинониму.Вставить("СтруктураФайлаXMLВходящие", "Входящие");
	ИмяКСинониму.Вставить("СтруктураФайлаXMLИсходящие", "Исходящие");
	ИмяКСинониму.Вставить("СтруктураФайлаXMLДокументы", "Документы");
	ИмяКСинониму.Вставить("СлужебныйЗапросДляПодпискиДокументовПоставщик", "Поставщик. Запрос для подписки на документы");
	ИмяКСинониму.Вставить("СлужебныйЗапросДляПодпискиПрайсЛист", "ПрайсЛист. Запрос для подписки на документы");
	ИмяКСинониму.Вставить("СлужебныйЗапросДляПодпискиДокументовCondra", "Condra. Запрос для подписки на документы");
	ИмяКСинониму.Вставить("СлужебныйЗапросДляПодпискиДокументовСеть", "Покупатель. Запрос для подписки на документы");
	ИмяКСинониму.Вставить("СлужебныйЗапросДляПодпискиДокументовЭТРН", "ЭТРН. Запрос для подписки на документы");
	ИмяКСинониму.Вставить("СлужебныйЗапросДляФормыПоставщика", "Поставщик. Запрос для формы");
	ИмяКСинониму.Вставить("СлужебныйЗапросДляФормыПокупателя", "Покупатель. Запрос для формы");
	ИмяКСинониму.Вставить("СлужебныйЗапросДляФормыПрайсЛист", "ПрайсЛист. Запрос для формы");
	ИмяКСинониму.Вставить("СлужебныйЗапросДляФормыCondra", "Condra. Запрос для формы");
	ИмяКСинониму.Вставить("СлужебныйЗапросДляФормыЭТРН", "ЭТРН. Запрос для формы");
	
	СинонимКИмени = Новый Соответствие;
	СинонимКИмени.Вставить("Входящие", "СтруктураФайлаXMLВходящие");
	СинонимКИмени.Вставить("Исходящие", "СтруктураФайлаXMLИсходящие");
	СинонимКИмени.Вставить("Документы","СтруктураФайлаXMLДокументы");
	СинонимКИмени.Вставить("Поставщик. Запрос для подписки на документы", "СлужебныйЗапросДляПодпискиДокументовПоставщик");
	СинонимКИмени.Вставить("ПрайсЛист. Запрос для подписки на документы", "СлужебныйЗапросДляПодпискиПрайсЛист");
	СинонимКИмени.Вставить("Condra. Запрос для подписки на документы", "СлужебныйЗапросДляПодпискиДокументовCondra");
	СинонимКИмени.Вставить("Покупатель. Запрос для подписки на документы", "СлужебныйЗапросДляПодпискиДокументовСеть");
	СинонимКИмени.Вставить("ЭТРН. Запрос для подписки на документы", "СлужебныйЗапросДляПодпискиДокументовЭТРН");
	СинонимКИмени.Вставить("Поставщик. Запрос для формы", "СлужебныйЗапросДляФормыПоставщика");
	СинонимКИмени.Вставить("Покупатель. Запрос для формы", "СлужебныйЗапросДляФормыПокупателя");
	СинонимКИмени.Вставить("ПрайсЛист. Запрос для формы", "СлужебныйЗапросДляФормыПрайсЛист");
	СинонимКИмени.Вставить("Condra. Запрос для формы", "СлужебныйЗапросДляФормыCondra");
	СинонимКИмени.Вставить("ЭТРН. Запрос для формы", "СлужебныйЗапросДляФормыЭТРН");
	
	Результат = Новый Структура("ИмяКСинониму, СинонимКИмени", ИмяКСинониму, СинонимКИмени);	
	Возврат Результат;
КонецФункции

Функция ДокументыСписокВыбораПолучить(ТипСписка = "", МассивИменДокументов = Неопределено, Значение = Неопределено) Экспорт

	// Используется для формирования имени файла гибких настроек
	СоответствиеТипуОперации = ПолучитьТипыОпераций(ТипСписка);
    Результат = Новый Массив;
	Для каждого СтрСоответствия Из СоответствиеТипуОперации Цикл
		Результат.Добавить(СтрСоответствия.Ключ);
	КонецЦикла;

    Если ТипСписка = "ТабличныеЧасти" Тогда
        
        Результат.Добавить("");
        Результат.Добавить("Товары");
        Результат.Добавить("Сырье");    
        
    ИначеЕсли ТипСписка = "СвойАлгоритм" Тогда
        
        Результат.Добавить("");
        Результат.Добавить("<Свой алгоритм>");
        
    ИначеЕсли ТипСписка = "ТабличныеЧастиАлгоритм" Тогда
        
        Результат.Добавить("");
        Результат.Добавить("<Свой алгоритм>");
        
    ИначеЕсли ТипСписка = "ОсновнойАлгоритм" Тогда
		
		Если ТипЗнч(МассивИменДокументов) = Тип("Массив") Тогда
			
			Если МассивИменДокументов.Количество() = 1 Тогда
				
				Для Каждого Реквизит Из Метаданные.Документы.Найти(МассивИменДокументов[0]).Реквизиты Цикл
					Результат.Добавить(Реквизит.Синоним + " (" + Реквизит.Имя + ")");
				КонецЦикла;
				
				// Добавим стандартные реквизиты.
				Результат.Добавить("Ссылка (Ссылка)");
				Результат.Добавить("Номер (Номер)");
				Результат.Добавить("Дата (Дата)");
				Результат.Добавить("Проведен (Проведен)");
				Результат.Добавить("Пометка удаления (ПометкаУдаления)");
				
			ИначеЕсли МассивИменДокументов.Количество() = 2 Тогда
				
				Для Каждого Реквизит Из Метаданные.Документы.Найти(МассивИменДокументов[1]).ТабличныеЧасти.Найти(МассивИменДокументов[0]).Реквизиты Цикл
					Результат.Добавить(Реквизит.Синоним + " (" + Реквизит.Имя + ")");
				КонецЦикла;
				                                 
				// Добавим стандартные реквизиты.
				Результат.Добавить("Ссылка (Ссылка)");
				Результат.Добавить("Номер строки (НомерСтроки)");
				
			КонецЕсли;
			
		КонецЕсли;
		
		Результат = СортировкаМассива(Результат);
		//Результат.Вставить(0, "<Свой алгоритм>"); // Открытие будет происходить по нажатию кнопки Открыть
		//Результат.Вставить(1, "_______________");
		
		Если ЗначениеЗаполнено(Значение) Тогда
			Результат.Добавить("_______________");
			Результат.Добавить(Значение);
		КонецЕсли;
		
    ИначеЕсли ТипСписка = "Документы" ИЛИ ТипСписка = "Справочники" Тогда
        
        Результат = ПолучитьСписокВыбораИзИменМетаданных(ТипСписка);
        
    ИначеЕсли ТипСписка = "РеквизитыДокументов" И ТипЗнч(МассивИменДокументов) = Тип("Массив") Тогда
        
        НовыйМассив = Новый Массив;
        Для каждого ИмяДокумента Из МассивИменДокументов Цикл
        
        	 СтандартныеРеквизитыДокумента = Метаданные.Документы[ИмяДокумента].СтандартныеРеквизиты;
             РеквизитыДокумента            = Метаданные.Документы[ИмяДокумента].Реквизиты;
                          
             Для каждого СРД Из СтандартныеРеквизитыДокумента Цикл
                 Если НовыйМассив.Найти(СРД.Имя) <> Неопределено Тогда
                     Продолжить; 
                 КонецЕсли;
                 НовыйМассив.Добавить(СРД.Имя);
             КонецЦикла;             
             
             Для каждого РД Из РеквизитыДокумента Цикл
                 Если НовыйМассив.Найти(РД.Имя) <> Неопределено Тогда
                     Продолжить; 
                 КонецЕсли;
                 НовыйМассив.Добавить(РД.Имя);
             КонецЦикла;
             
        КонецЦикла;
        Результат = НовыйМассив;
        
    КонецЕсли;
    
    Возврат Результат;
    
КонецФункции // ДокументыСписокВыбораПолучить()

Функция ПолучитьСписокВыбораИзИменМетаданных(ТипМД) Экспорт
	
	Результат = Новый Массив;
	
	Если ТипМД = "Документы" Тогда
	   МД_Данные = Метаданные.Документы;
	Иначе
	   МД_Данные = Метаданные.Справочники;
	КонецЕсли;
	
	Для каждого СтрМД Из МД_Данные Цикл
		Результат.Добавить(СтрМД.Имя);	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ПолучитьСписокВыбораИзИменМетаданных()

//Преобразует таблицу значений в дерево 
Процедура ВТЗНаСервере()
 //  тДерево  = РеквизитФормыВЗначение("Дерево");
 //  тТаблица = РеквизитФормыВЗначение("Таблица");
 //
 //  ПреобразоватьВТЗРекурсия(тДерево, тТаблица, Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
 //  тДерево.Строки.Очистить();
 //
 //  ЗначениеВРеквизитФормы(тТаблица, "Таблица");
 //  ЗначениеВРеквизитФормы(тДерево , "Дерево");
КонецПроцедуры

//Преобразует дерево в таблицу значений
Процедура ПреобразоватьВТЗРекурсия(тДерево, тТаблица, ГУИД)
 //  Для Каждого тСтр Из тДерево.Строки Цикл
 //     нСтр = тТаблица.Добавить();
 //     нСтр.Колонка1 = тСтр.Колонка1;
 //     нСтр.Колонка2 = тСтр.Колонка2;
 //     нСтр.Родитель = ГУИД;
 //     нСтр.ГУИД = Новый УникальныйИдентификатор();
 //
 //     Если тСтр.Строки.Количество()>0 Тогда
 //        ПреобразоватьВТЗРекурсия(тСтр, тТаблица, нСтр.ГУИД);
 //     КонецЕсли;
 //  КонецЦикла;
КонецПроцедуры

Функция СортировкаМассива(Знач Массив)
    
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(Массив);
	Список.СортироватьПоЗначению(НаправлениеСортировки.Возр);    
	
	Возврат Список.ВыгрузитьЗначения();
	
КонецФункции // СортировкаМассива()

Функция РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено) Экспорт
 
    Результат = Новый Массив;
 
    // для обеспечения обратной совместимости
    Если ПропускатьПустыеСтроки = Неопределено Тогда
        ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
        Если ПустаяСтрока(Строка) Тогда 
            Если Разделитель = " " Тогда
                Результат.Добавить("");
            КонецЕсли;
            Возврат Результат;
        КонецЕсли;
    КонецЕсли;
 
    Позиция = Найти(Строка, Разделитель);
    Пока Позиция > 0 Цикл
        Подстрока = Лев(Строка, Позиция - 1);
        Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
            Результат.Добавить(Подстрока);
        КонецЕсли;
        Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
        Позиция = Найти(Строка, Разделитель);
    КонецЦикла;
 
    Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
        Результат.Добавить(Строка);
    КонецЕсли;
 
    Возврат Результат;
 
КонецФункции

Функция ОбъектВнешнейКомпонентыXMLDSig(МассивЛогаСобытий) Экспорт
	
	ИмяСобытия = "Объект внешней компоненты";
	ОбъектКомпоненты = Неопределено;
	Если ПодключитьВнешнююКомпоненту("Справочник.ЭКОМ_Сертификаты.Макет.КомпонентаXMLDSIG", "XMLDSignAddInSymbolicName", ТипВнешнейКомпоненты.Native) Тогда
        Попытка
            ОбъектКомпоненты = Новый("AddIn.XMLDSignAddInSymbolicName.XMLDSignAddIn");
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
            ТекстЛогаСобытий = "Не удалось подключить внешнюю компоненту XMLDSig.";
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
        КонецПопытки;        
    КонецЕсли;
	
	Если ОбъектКомпоненты = Неопределено Тогда ;
		ТекстЛогаСобытий = "Оператор Новый вернул Неопределено";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
	Иначе
		ОбъектКомпоненты.ПутьККриптопровайдеру = "";
	КонецЕсли;
	    
    Возврат ОбъектКомпоненты;
КонецФункции 

Функция РезультатCMSSign(ОбъектКомпоненты, ДанныеДляПодписания, ПараметрыКомпоненты, СертификатКриптографии, ПарольДоступаКЗакрытомуКлючу, МассивЛогаСобытий) Экспорт
	
	ИмяСобытия = "Объект внешней компоненты CMSSign";

	АтрибутSignatureValue = Неопределено;
	Попытка
		АтрибутSignatureValue = ОбъектКомпоненты.CMSSign(
			ДанныеДляПодписания,
			СертификатКриптографииBase64(СертификатКриптографии.Выгрузить()),
			ПарольДоступаКЗакрытомуКлючу,
			ПараметрыКомпоненты.ТипПодписи,
			ПараметрыКомпоненты.Открепленная,
			ПараметрыКомпоненты.ВключениеСертификатовВПодпись);
	Исключение
		ТекстЛогаСобытий = "Ошибка вызова метода CMSSign компоненты XMLDSig." + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(АтрибутSignatureValue) Тогда
		ТекстЛогаСобытий = "Ошибка вызова метода CMSSign компоненты XMLDSig." + Символы.ПС + ОбъектКомпоненты.GetLastError();
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

	КонецЕсли;
	
	Возврат АтрибутSignatureValue;
	
КонецФункции

Функция РезультатGetSignOIDFromCert(ОбъектКомпоненты, СертификатКриптографии, МассивЛогаСобытий)
	
	ИмяСобытия = "Объект внешней компоненты GetSignOIDFromCert";

	Попытка
		OIDАлгоритмаПодписи = ОбъектКомпоненты.GetSignOIDFromCert(СертификатКриптографииBase64(СертификатКриптографии.Выгрузить()));
	Исключение
		ТекстЛогаСобытий = "Ошибка вызова метода GetSignOIDFromCert компоненты XMLDSIG." + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

	КонецПопытки;
	
	Если OIDАлгоритмаПодписи = Неопределено Тогда
		ТекстЛогаСобытий = "Ошибка вызова метода GetSignOIDFromCert компоненты XMLDSIG." + Символы.ПС + ОбъектКомпоненты.GetLastError();
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

	КонецЕсли;
	
	Возврат OIDАлгоритмаПодписи;
	
КонецФункции

Функция СертификатКриптографииBase64(ДвоичныеДанныеСертификата)
	
	СтрокаBase64 = Base64Строка(ДвоичныеДанныеСертификата);
	
	Значение = СтрЗаменить(СтрокаBase64, Символы.ВК, "");
	Значение = СтрЗаменить(Значение, Символы.ПС, "");
	
	Возврат Значение;
	
КонецФункции

Функция ЭЦП_ПолучитьСертификатыКриптографии(Знач АлгоритмПодписи, Знач ТолькоЛичные, Знач ТолькоДействующиеСертификаты = Истина, МассивЛогаСобытий) Экспорт
	
	СписокСертификатовВсего = Новый Массив;
	МассивСтрокОтпечатков   = Новый Массив;
    
    ОписаниеУказанногоАлгоритмаПодписи = ?(ЗначениеЗаполнено(АлгоритмПодписи), АлгоритмПодписи, "алгоритм подписи не заполнен");
     
    ОписаниеОперации = "Получение [МенеджерКриптографии] для чтения всех сертификатов НаКлиенте с алгоритмом подписи [" + ОписаниеУказанногоАлгоритмаПодписи + "]";
    
    Если ЗначениеЗаполнено(АлгоритмПодписи) Тогда
        ТекущийАлгоритмПодписи = АлгоритмПодписи;
    Иначе
        ВсеПоддерживаемыеАлгоритмыПодписей = ВсеАлгоритмыПодписей();
        ТекущийАлгоритмПодписи = ВсеПоддерживаемыеАлгоритмыПодписей[0]; //алгоритм можно брать любой 1с возвращает все равно все сертификаты вне зависимости от алгоритма создания МенеджерКриптографии
    КонецЕсли;
    
    МенеджерКриптографии = ЭЦП_ПолучитьМенеджерКриптографии(ТекущийАлгоритмПодписи, МассивЛогаСобытий);
	                                           
	Если НЕ МенеджерКриптографии = Неопределено Тогда
			
		СписокСертификатов = ЭЦП_ПолучитьВсеСертификатыСтруктурами(МенеджерКриптографии, АлгоритмПодписи, ТолькоЛичные, МассивСтрокОтпечатков, МассивЛогаСобытий);	
        Для каждого ТекущийСертификатИзВсехСертификатов  Из СписокСертификатов Цикл	
            Если НЕ ПодходитАлгоритмСрокДействияСертификата(ТекущийСертификатИзВсехСертификатов, ТолькоДействующиеСертификаты) Тогда
                Продолжить;
            КонецЕсли;
			СписокСертификатовВсего.Добавить(ТекущийСертификатИзВсехСертификатов);	
		КонецЦикла;
    Иначе
        Возврат Новый Массив;
	КонецЕсли;
	
	Возврат СписокСертификатовВсего;		

КонецФункции	

// Возвращает созданный МенеджерКриптографии
//
// Параметры:
//  Параметры   - Структура - Создается функцией ПараметрыМенеджераКриптографииПоАлгоритмуПодписи() на основе переданного параметра АлгоритмПодписи
//  МассивЛогаСобытий  - Строка - Сюда будет дописано описание в случае ошибки
// 
// Возвращаемое значение:
// Неопределено, МенеджерКриптографии - если МенеджерКриптографии не создан возвращается Неопределено
//
Функция СоздатьМенеджерКриптографии(Параметры, МассивЛогаСобытий) Экспорт
    Результат = Неопределено;
    Попытка
    	Результат = Новый МенеджерКриптографии(Параметры.ИмяМодуляКриптографии, Параметры.ПутьМодуляКриптографии, Параметры.ТипМодуляКриптографии);
    Исключение
        Ошибка = ОписаниеОшибки();
		ТекстЛогаСобытий = "Проверьте установлена ли программа криптопровайдера [" + Параметры.ИмяМодуляКриптографии + "] на компьютер
		| с алгоритмом подписи [" + Параметры.АлгоритмПодписи + "]" + Символы.ПС + Символы.ПС + Ошибка;
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, "Создать менеджер криптографии");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		
    КонецПопытки;
    
    Возврат Результат;
КонецФункции 

Функция ЭЦП_ПолучитьМенеджерКриптографии(АлгоритмПодписи, МассивЛогаСобытий) Экспорт
	
    ЭКОМ_МенеджерКриптографии  = Неопределено;
	
    Параметры = ЭЦП_ПараметрыМенеджераКриптографииПоАлгоритмуПодписи(АлгоритмПодписи);    
	Если Параметры.АлгоритмПодписи = "" Тогда
		ТекстЛогаСобытий = "Менеджер криптографии не создан, проверьте поддержку алгоритма подписи [" + АлгоритмПодписи + "] в программе
		| криптопровайдера [" + Параметры.ИмяМодуляКриптографии + "]";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, "Создать менеджер криптографии");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

	Иначе
		 ЭКОМ_МенеджерКриптографии = СоздатьМенеджерКриптографии(Параметры, МассивЛогаСобытий);
	КонецЕсли;

    Возврат ЭКОМ_МенеджерКриптографии;
	
КонецФункции

Функция ПодходитАлгоритмСрокДействияСертификата(Знач Сертификат, Знач ТолькоДействующиеСертификаты = Истина)
    Перем ДатаОкончания;
    
    Если Сертификат.Свойство("ДействителенДо", ДатаОкончания) = Неопределено Тогда //нет поля ДействителенДо
        Возврат Истина;
    КонецЕсли;
    
    Если ТолькоДействующиеСертификаты = Истина И ДатаОкончания < ТекущаяДата() Тогда // отфильтровываем истекшие сертификаты. Сертификат уже не подходит дальше продолжать нет смысла
        Возврат Ложь;
    Иначе
        Результат = Истина;
    КонецЕсли;
    
    Результат = ЭКОМ_ОбщегоНазначения.ЭтоПоддерживаемыйАлгоритмПодписи(Сертификат.АлгоритмПодписи);
    
    Возврат Результат;
КонецФункции

Функция ЭЦП_ПолучитьВсеСертификатыСтруктурами(МенеджерКриптографии, АлгоритмПодписи, ТолькоЛичные, МассивСтрокОтпечатков, МассивЛогаСобытий)
	
	Сертификаты = Новый Массив;
   
	ЭЦП_ЗаполнитьМассивСертификатовПоТипуХранилищаСертификатов(АлгоритмПодписи, МассивЛогаСобытий, МенеджерКриптографии, ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты , Сертификаты);
	
    Если НЕ ТолькоЛичные Тогда
        ЭЦП_ЗаполнитьМассивСертификатовПоТипуХранилищаСертификатов(АлгоритмПодписи, МассивЛогаСобытий, МенеджерКриптографии, ТипХранилищаСертификатовКриптографии.КорневыеСертификаты, Сертификаты);
	КонецЕсли;
	
	Возврат Сертификаты;		

КонецФункции

Процедура ЭЦП_ЗаполнитьМассивСертификатовПоТипуХранилищаСертификатов(Знач АлгоритмПодписи, МассивЛогаСобытий, Знач МенеджерКриптографии, ТипХранилища, Сертификаты)
       
    Хранилище = МенеджерКриптографии.ПолучитьХранилищеСертификатов(ТипХранилища);
    СертификатыХранилища = Хранилище.ПолучитьВсе(); 
	СписокСертификатов   = ПолучитьДанныеОСертификатах();
	
	АлгоритмыПодписиСертификата    = ИдентификаторыАлгоритмовПодписи(Истина);
	АлгоритмыСформированнойПодписи = ИдентификаторыАлгоритмовПодписи(Ложь);

	ОбъектКомпоненты = ОбъектВнешнейКомпонентыXMLDSig(МассивЛогаСобытий);
	
	Для Каждого Сертификат Из СертификатыХранилища Цикл
		
		Если НЕ ОбъектКомпоненты = Неопределено Тогда
			OIDАлгоритмаПодписи         = РезультатGetSignOIDFromCert(ОбъектКомпоненты, Сертификат, МассивЛогаСобытий);  
			МассивАлгоритмовСертификата = АлгоритмыСформированнойПодписи.Получить(OIDАлгоритмаПодписи);
			
			Если МассивАлгоритмовСертификата = Неопределено Тогда
				Продолжить;
				
			КонецЕсли;
			
			// Меняем алгоритм подписи на корректный
			Индекс = МассивАлгоритмовСертификата.Найти(АлгоритмПодписи);
			Если Индекс = Неопределено Тогда
				 АлгоритмПодписи = МассивАлгоритмовСертификата[0];
				
			КонецЕсли;
		КонецЕсли;
		
		ДвоичныйОтпечатокСертификата = Строка(Сертификат.Отпечаток);
		ДвоичныйОтпечатокСертификата = СтрЗаменить(ДвоичныйОтпечатокСертификата, " ", "");
        АлгоритмаПодписиСертификата = СписокСертификатов.Получить(ДвоичныйОтпечатокСертификата);
		МассивАлгоритмовСертификата = АлгоритмыПодписиСертификата.Получить(АлгоритмаПодписиСертификата);
		Если НЕ МассивАлгоритмовСертификата = Неопределено Тогда
			// Меняем алгоритм подписи на корректный
			Индекс = МассивАлгоритмовСертификата.Найти(АлгоритмПодписи);
			Если Индекс = Неопределено Тогда
				АлгоритмПодписи = МассивАлгоритмовСертификата[0];
				
			КонецЕсли;	
		КонецЕсли;
		
		СтруктураСертификата = ЭЦП_ЗаполнитьСтруктуруСертификата(Сертификат, АлгоритмПодписи, МассивЛогаСобытий); //есть реквизиты дата окончания, кому выдан и т.п.
        Если СтруктураСертификата = Неопределено Тогда
            Продолжить;
        КонецЕсли;
					 
        Сертификаты.Добавить(СтруктураСертификата);
	   
    КонецЦикла;
      
КонецПроцедуры	

Процедура ПолучитьМассивСертификатов(ОсновнойАлгоритмПодписи, Сертификаты, СертификатыХранилища, СписокСертификатов, МассивЛогаСобытий) Экспорт
	
	
КонецПроцедуры

Функция ПолучитьДанныеОСертификатах()
	
	СписокСертификатов = Новый Соответствие;
	
	Попытка
		OSertificats = Новый COMОбъект("CAdESCOM.Store");
	Исключение
		Сообщить("Объект CAdESCOM.Store не создан: " + ОписаниеОшибки());
		Возврат СписокСертификатов;
	КонецПопытки;
	
	CURRENT_USER_STORE = 2;
	MY_STORE = "My";
	STORE_OPEN_READ_ONLY = 0;
		
	OSertificats.Open(CURRENT_USER_STORE, MY_STORE, STORE_OPEN_READ_ONLY);
	
	Для каждого ТекущийСертификат Из OSertificats.Certificates Цикл
		АлгоритмПодписиСертификата = "";
		ОтпечатокСертификата       = ТекущийСертификат.Thumbprint;
		Попытка
			ОткрытыйКлюч = ТекущийСертификат.PublicKey();
			АлгоритмПодписиСертификата = ОткрытыйКлюч.Algorithm.Value;
		Исключение  // Если что-то не так возвращет
			АлгоритмПодписиСертификата = "ГОСТ Р 34.10-2012 256 бит";          
		КонецПопытки; 
		
		СписокСертификатов.Вставить(ОтпечатокСертификата, АлгоритмПодписиСертификата);
	КонецЦикла;
	
	Возврат СписокСертификатов;
	
КонецФункции 

Функция АлгоритмПодписи(Данные, ЭтоДанныеСертификата, ВключаяOID = Ложь)
	
	ДвоичныеДанные = ""; //ДвоичныеДанныеИзДанных(Данные,
		//"ЭлектроннаяПодписьСлужебныйКлиентСервер.АлгоритмПодписи");
	
	АнализДанных = НовыйАнализДанных(ДвоичныеДанные);
	
	Если ЭтоДанныеСертификата Тогда
		// SEQUENCE (Certificate).
		ПропуститьНачалоБлока(АнализДанных, 0, 16);
			// SEQUENCE (tbsCertificate).
			ПропуститьНачалоБлока(АнализДанных, 0, 16);
				//          (version              [0]  EXPLICIT Version DEFAULT v1).
				ПропуститьБлок(АнализДанных, 2, 0);
				// INTEGER  (serialNumber         CertificateSerialNumber).
				ПропуститьБлок(АнализДанных, 0, 2);
				// SEQUENCE (signature            AlgorithmIdentifier).
				ПропуститьБлок(АнализДанных, 0, 16);
				// SEQUENCE (issuer               Name).
				ПропуститьБлок(АнализДанных, 0, 16);
				// SEQUENCE (validity             Validity).
				ПропуститьБлок(АнализДанных, 0, 16);
				// SEQUENCE (subject              Name).
				ПропуститьБлок(АнализДанных, 0, 16);
				// SEQUENCE (subjectPublicKeyInfo SubjectPublicKeyInfo).
				ПропуститьНачалоБлока(АнализДанных, 0, 16);
					// SEQUENCE (algorithm  AlgorithmIdentifier).
					ПропуститьНачалоБлока(АнализДанных, 0, 16);
						// OBJECT IDENTIFIER (algorithm).
						ПропуститьНачалоБлока(АнализДанных, 0, 6);
	Иначе
		// SEQUENCE (PKCS #7 ContentInfo).
		ПропуститьНачалоБлока(АнализДанных, 0, 16);
			// OBJECT IDENTIFIER (contentType).
			ПропуститьНачалоБлока(АнализДанных, 0, 6);
				// 1.2.840.113549.1.7.2 signedData (PKCS #7).
				ПроверитьДанныеБлока(АнализДанных, "2A864886F70D010702");
				ПропуститьРодительскийБлок(АнализДанных);
			// [0]CS             (content [0] EXPLICIT ANY DEFINED BY contentType OPTIONAL).
			ПропуститьНачалоБлока(АнализДанных, 2, 0);
				// SEQUENCE (content SignedData).
				ПропуститьНачалоБлока(АнализДанных, 0, 16);
					// INTEGER  (version          Version).
					ПропуститьБлок(АнализДанных, 0, 2);
					// SET      (digestAlgorithms DigestAlgorithmIdentifiers).
					ПропуститьБлок(АнализДанных, 0, 17);
					// SEQUENCE (contentInfo      ContentInfo).
					ПропуститьБлок(АнализДанных, 0, 16);
					// [0]CS    (certificates     [0] IMPLICIT ExtendedCertificatesAndCertificates OPTIONAL).
					ПропуститьБлок(АнализДанных, 2, 0, Ложь);
					// [1]CS    (crls             [1] IMPLICIT CertificateRevocationLists OPTIONAL).
					ПропуститьБлок(АнализДанных, 2, 1, Ложь);
					// SET      (signerInfos      SET OF SignerInfo).
					ПропуститьНачалоБлока(АнализДанных, 0, 17);
						// SEQUENCE (signerInfo SignerInfo).
						ПропуститьНачалоБлока(АнализДанных, 0, 16);
							// INTEGER  (version                   Version).
							ПропуститьБлок(АнализДанных, 0, 2);
							// SEQUENCE (issuerAndSerialNumber     IssuerAndSerialNumber).
							ПропуститьБлок(АнализДанных, 0, 16);
							// SEQUENCE (digestAlgorithm           DigestAlgorithmIdentifier).
							ПропуститьБлок(АнализДанных, 0, 16);
							// [0]CS    (authenticatedAttributes   [0] IMPLICIT Attributes OPTIONAL).
							ПропуститьБлок(АнализДанных, 2, 0, Ложь);
							// SEQUENCE (digestEncryptionAlgorithm AlgorithmIdentifier).
							ПропуститьНачалоБлока(АнализДанных, 0, 16);
								// OBJECT IDENTIFIER (algorithm).
								ПропуститьНачалоБлока(АнализДанных, 0, 6);
	КонецЕсли;
	
	OIDАлгоритмаПодписи = ПрочитанныйOID(АнализДанных);
	Если АнализДанных.ЕстьОшибка Тогда
		Возврат "";
	КонецЕсли;
	
	ИдентификаторыАлгоритмов = ИдентификаторыАлгоритмовПодписи(ЭтоДанныеСертификата);
	Алгоритм = АлгоритмПоOID(OIDАлгоритмаПодписи, ИдентификаторыАлгоритмов, ВключаяOID);
	
	Возврат Алгоритм;
	
КонецФункции

Функция АлгоритмПоOID(OIDАлгоритма, ИдентификаторыАлгоритмов, ВключаяOID)
	
	ИмяАлгоритма = ИдентификаторыАлгоритмов.Получить(OIDАлгоритма);
	
	Если ИмяАлгоритма = Неопределено Тогда
		Если ВключаяOID Тогда
			Возврат НСтр("ru = 'Неизвестный'") + " (OID " + OIDАлгоритма + ")";
		КонецЕсли;
		Возврат "";
	ИначеЕсли ВключаяOID Тогда	
		
		Возврат РазложитьСтрокуВМассивПодстрок(ИмяАлгоритма, ",", Ложь)[0] + " (OID " + OIDАлгоритма + ")";
	Иначе
		Возврат ИмяАлгоритма;
	КонецЕсли;
	
КонецФункции

Функция ПрочитанныйOID(АнализДанных)
	
	Если АнализДанных.ЕстьОшибка Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если АнализДанных.Родители.Количество() = 0 Тогда
		ПриОшибкеСтруктурыДанных(АнализДанных);
		Возврат Неопределено;
	КонецЕсли;
	
	ЦелыеЧисла = Новый Массив;
	РазмерДанных = АнализДанных.Родители[0].РазмерДанных;
	Если РазмерДанных = 0 Тогда
		ПриОшибкеСтруктурыДанных(АнализДанных);
		Возврат Неопределено;
	КонецЕсли;
	ГраницаСмещения = АнализДанных.Смещение + РазмерДанных;
	
	Пока АнализДанных.Смещение < ГраницаСмещения Цикл
		ЦелоеЧисло = ПрочитатьПотоковоеЦелое(АнализДанных);
		Если АнализДанных.ЕстьОшибка Тогда
			Возврат Неопределено;
		КонецЕсли;
		ЦелыеЧисла.Добавить(ЦелоеЧисло);
	КонецЦикла;
	
	Если АнализДанных.Смещение <> ГраницаСмещения
	 Или ЦелыеЧисла.Количество() = 0 Тогда
		
		ПриОшибкеКодированияASN1(АнализДанных);
		Возврат Неопределено;
	КонецЕсли;
	
	ЧислоSID2 = ЦелыеЧисла[0];
	Если ЧислоSID2 < 40 Тогда
		SID1 = 0;
	ИначеЕсли ЧислоSID2 < 80 Тогда
		SID1 = 1;
	Иначе
		SID1 = 2;
	КонецЕсли;
	ЦелыеЧисла[0] = ЧислоSID2 - SID1*40;
	ЦелыеЧисла.Вставить(0, SID1);
	
	СтрокиЧисел = Новый Массив;
	Для Каждого ЦелоеЧисло Из ЦелыеЧисла Цикл
		СтрокиЧисел.Добавить(Формат(ЦелоеЧисло, "ЧН=0; ЧГ="));
	КонецЦикла;
	
	ПолноеИмя = "";
	Для Каждого Стр Из СтрокиЧисел Цикл
		ПолноеИмя = ?(ПолноеИмя="", "", ПолноеИмя + ".")  + Стр;
	КонецЦикла;
	
	Возврат ПолноеИмя;
	
КонецФункции

Функция ДвоичныеДанныеИзДанных(Данные, ИмяФункции)
	
	ОжидаемыеТипы = Новый Массив;
	ОжидаемыеТипы.Добавить(Тип("ДвоичныеДанные"));
	ОжидаемыеТипы.Добавить(Тип("Строка"));
		
	//Если ТипЗнч(Данные) = Тип("Строка") Тогда
	//	Если ЭтоАдресВременногоХранилища(Данные) Тогда
	//		ДвоичныеДанные = ПолучитьИзВременногоХранилища(Данные);
	//	Иначе
	//		ОбщегоНазначенияКлиентСервер.Проверить(Ложь,
	//			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	//				НСтр("ru = 'Недопустимый адрес временного хранилища в параметре Данные:
	//				           |%1'") + Символы.ПС, Данные),
	//			"ЭлектроннаяПодписьСлужебныйКлиентСервер.АлгоритмПодписи");
	//	КонецЕсли;
	//	Если ТипЗнч(ДвоичныеДанные) <> Тип("ДвоичныеДанные") Тогда
	//		ОбщегоНазначенияКлиентСервер.Проверить(Ложь,
	//			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	//				НСтр("ru = 'Недопустимый тип значения ""%1""
	//				           |по адресу временного хранилища, указанному в параметре Данные'") + Символы.ПС,
	//				Строка(ТипЗнч(ДвоичныеДанные))),
	//			"ЭлектроннаяПодписьСлужебныйКлиентСервер.АлгоритмПодписи");
	//	КонецЕсли;
	//Иначе
	//	ДвоичныеДанные = Данные;
	//КонецЕсли;
	//
	//Возврат ДвоичныеДанные;
	
	
КонецФункции

Функция ПрочитатьПотоковоеЦелое(АнализДанных)
	
	Целое = 0;
	Для Счетчик = 1 По 9 Цикл
		Байт = Неопределено; //ПрочитатьБайт(АнализДанных);
		Если АнализДанных.ЕстьОшибка Тогда
			Возврат Неопределено;
		КонецЕсли;
		Если Байт < 128 Тогда
			Целое = Целое * 128 + Байт;
			Прервать;
		Иначе
			Целое = Целое * 128 + (Байт - 128);
		КонецЕсли;
	КонецЦикла;
	
	Если Счетчик > 8 Тогда
		ПриОшибкеКодированияASN1(АнализДанных);
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Целое;
	
КонецФункции

Процедура ПриОшибкеКодированияASN1(АнализДанных)
	
	АнализДанных.ЭтоОшибкаКодированияASN1 = Истина;
	АнализДанных.ЕстьОшибка = Истина;
	
КонецПроцедуры

// Возвращаемое значение:
//  Структура:
//   * ЕстьОшибка - Булево
//   * ЭтоОшибкаКодированияASN1 - Булево
//   * ЭтоОшибкаСтруктурыДанных - Булево
//   * Смещение - Число
//   * Родители - Массив Из Структура
//   * Буфер - БуферДвоичныхДанных
// 
Функция НовыйАнализДанных(ДвоичныеДанные)
	
	АнализДанных = Новый Структура;
	АнализДанных.Вставить("ЕстьОшибка", Ложь);
	АнализДанных.Вставить("ЭтоОшибкаКодированияASN1", Ложь); // Возможно данные повреждены.
	АнализДанных.Вставить("ЭтоОшибкаСтруктурыДанных", Ложь); // Не найден ожидаемый элемент данных.
	АнализДанных.Вставить("Смещение", 0);
	АнализДанных.Вставить("Родители", Новый Массив);
	АнализДанных.Вставить("Буфер", ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ДвоичныеДанные));
	
	Возврат АнализДанных;
	
КонецФункции

Процедура ПропуститьНачалоБлока(АнализДанных, КлассДанных = Неопределено, ТипДанных = Неопределено)
	
	ПропуститьНачалоБлокаИлиБлок(АнализДанных, Истина, КлассДанных, ТипДанных, Истина)
	
КонецПроцедуры

Процедура ПропуститьНачалоБлокаИлиБлок(АнализДанных, НачалоБлока,
			ТребуемыйКлассДанных, ТребуемыйТипДанных, ОбязательныйБлок)
	
	Если АнализДанных.Родители.Количество() > 0
	   И АнализДанных.Смещение >= АнализДанных.Родители[0].СмещениеСледующего Тогда
	
		ПриОшибкеСтруктурыДанных(АнализДанных);
		Возврат;
	КонецЕсли;
	
	СмещениеБлока = АнализДанных.Смещение;
	Байт = 0; //ПрочитатьБайт(АнализДанных);
	Если АнализДанных.ЕстьОшибка Тогда
		Возврат;
	КонецЕсли;
	
	КлассДанных = 0;//ПобитовыйСдвигВправо(Байт, 6);
	ТипДанных = Байт - КлассДанных * 64;
	ЕстьВложения = Ложь;
	
	Если ТипДанных > 31 Тогда
		ЕстьВложения = Истина;
		ТипДанных = ТипДанных - 32;
	КонецЕсли;
	
	Если ТипДанных > 30 Тогда
		ТипДанных = ПрочитатьПотоковоеЦелое(АнализДанных);
		Если АнализДанных.ЕстьОшибка Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТребуемыйКлассДанных <> Неопределено
	   И ТребуемыйКлассДанных <> КлассДанных
	 Или ТребуемыйТипДанных <> Неопределено
	   И ТребуемыйТипДанных <> ТипДанных Тогда
	
		Если ОбязательныйБлок Тогда
			ПриОшибкеСтруктурыДанных(АнализДанных);
		Иначе
			АнализДанных.Смещение = СмещениеБлока;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	РазмерДанных = ПрочитатьРазмерДанных(АнализДанных);
	Если АнализДанных.ЕстьОшибка Тогда
		Возврат;
	КонецЕсли;
	
	Если НачалоБлока Или ЕстьВложения И РазмерДанных = 0 Тогда
		Если РазмерДанных = 0 Тогда
			Если АнализДанных.Родители.Количество() = 0 Тогда
				Если Не КонецБлокаНеопределеннойДлины(АнализДанных, Истина) Тогда
					ПриОшибкеКодированияASN1(АнализДанных);
					Возврат;
				КонецЕсли;
				СмещениеСледующего = АнализДанных.Буфер.Размер - 2;
				РазмерДанных = СмещениеСледующего - АнализДанных.Смещение;
			Иначе
				// Для блока неопределенной длины СмещениеСледующего - это только граница.
				СмещениеСледующего = АнализДанных.Родители[0].СмещениеСледующего;
			КонецЕсли;
		Иначе
			СмещениеСледующего = АнализДанных.Смещение + РазмерДанных;
			Если АнализДанных.Родители.Количество() = 0
			   И СмещениеСледующего <> АнализДанных.Буфер.Размер Тогда
				
				ПриОшибкеКодированияASN1(АнализДанных);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		ТекущийБлок = Новый Структура("ЕстьВложения, СмещениеСледующего, РазмерДанных",
			ЕстьВложения, СмещениеСледующего, РазмерДанных);
		АнализДанных.Родители.Вставить(0, ТекущийБлок);
		Если Не НачалоБлока Тогда
			ПропуститьРодительскийБлок(АнализДанных);
		КонецЕсли;
	Иначе
		Если РазмерДанных = 0 Тогда
			ПрочитатьКонецБлокаБезВложенийНеопределеннойДлины(АнализДанных);
		Иначе
			//ПрочитатьБайт(АнализДанных, РазмерДанных);
		КонецЕсли;
		Если АнализДанных.ЕстьОшибка Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция КонецБлокаНеопределеннойДлины(АнализДанных, ОбщийБлок = Ложь)
	
	Буфер = АнализДанных.Буфер;
	
	Если ОбщийБлок Тогда
		Смещение = Буфер.Размер - 2;
		Если Смещение < 2 Тогда
			ПриОшибкеКодированияASN1(АнализДанных);
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Смещение = АнализДанных.Смещение;
		Если Смещение + 2 > АнализДанных.Родители[0].СмещениеСледующего Тогда
			ПриОшибкеКодированияASN1(АнализДанных);
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Буфер[Смещение] = 0 И Буфер[Смещение + 1] = 0;
	
КонецФункции

Функция ПрочитатьРазмерДанных(АнализДанных)
	
	Байт = Неопределено;//ПрочитатьБайт(АнализДанных);
	Если АнализДанных.ЕстьОшибка Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Байт < 128 Тогда
		Возврат Байт;
	КонецЕсли;
	
	КоличествоБайт = Байт - 128;
	Если КоличествоБайт = 0 Или КоличествоБайт > 8 Тогда
		Если Байт = 128 Тогда
			Возврат 0; // Блок неопределенной длины.
		КонецЕсли;
		ПриОшибкеКодированияASN1(АнализДанных);
		Возврат Неопределено;
	КонецЕсли;
	
	Целое = 0;
	Для Счетчик = 1 По КоличествоБайт Цикл
		Байт = Неопределено; //ПрочитатьБайт(АнализДанных);
		Если АнализДанных.ЕстьОшибка Тогда
			Возврат Неопределено;
		КонецЕсли;
		Целое = Целое * 256 + Байт;
	КонецЦикла;
	
	Возврат Целое;
	
КонецФункции

Процедура ПропуститьБлок(АнализДанных, КлассДанных = Неопределено, ТипДанных = Неопределено, ОбязательныйБлок = Истина)
	
	Если АнализДанных.ЕстьОшибка Тогда
		Возврат;
	КонецЕсли;
	
	Если АнализДанных.Родители.Количество() = 0
	 Или Не АнализДанных.Родители[0].ЕстьВложения Тогда
		
		ПриОшибкеСтруктурыДанных(АнализДанных);
		Возврат;
	КонецЕсли;
	
	ПропуститьНачалоБлокаИлиБлок(АнализДанных, Ложь, КлассДанных, ТипДанных, ОбязательныйБлок)
	
КонецПроцедуры

Процедура ПроверитьДанныеБлока(АнализДанных, СтрокаДанных)
	
	Если АнализДанных.ЕстьОшибка Тогда
		Возврат;
	КонецЕсли;
	
	Если АнализДанных.Родители.Количество() = 0 Тогда
		ПриОшибкеСтруктурыДанных(АнализДанных);
		Возврат;
	КонецЕсли;
	
	РазмерДанных = АнализДанных.Родители[0].РазмерДанных;
	Если РазмерДанных = 0 Тогда
		ПриОшибкеСтруктурыДанных(АнализДанных);
		Возврат;
	КонецЕсли;
	Буфер = АнализДанных.Буфер.Прочитать(АнализДанных.Смещение, РазмерДанных); // БуферДвоичныхДанных
	
	Если Буфер.Размер <> РазмерДанных Тогда
		ПриОшибкеКодированияASN1(АнализДанных);
		Возврат;
	КонецЕсли;
	АнализДанных.Смещение = АнализДанных.Смещение + РазмерДанных;
	
	СтрокаБуфера = ПолучитьHexСтрокуИзБуфераДвоичныхДанных(Буфер);
	Если СтрокаДанных <> СтрокаБуфера Тогда
		ПриОшибкеСтруктурыДанных(АнализДанных);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПропуститьРодительскийБлок(АнализДанных)
	
	Если АнализДанных.ЕстьОшибка Тогда
		Возврат;
	КонецЕсли;
	
	Если АнализДанных.Родители.Количество() < 2
	 Или Не АнализДанных.Родители[1].ЕстьВложения Тогда
		
		ПриОшибкеСтруктурыДанных(АнализДанных);
		Возврат;
	КонецЕсли;
	
	Если АнализДанных.Родители[0].РазмерДанных > 0 Тогда
		ОсталосьБайт = АнализДанных.Родители[0].СмещениеСледующего - АнализДанных.Смещение;
		
		Если ОсталосьБайт > 0 Тогда
			//ПрочитатьБайт(АнализДанных, ОсталосьБайт);
			Если АнализДанных.ЕстьОшибка Тогда
				Возврат;
			КонецЕсли;
		ИначеЕсли ОсталосьБайт < 0 Тогда
			ПриОшибкеКодированияASN1(АнализДанных);
			Возврат;
		КонецЕсли;
	Иначе
		Пока Истина Цикл
			Если КонецБлокаНеопределеннойДлины(АнализДанных) Тогда
				Если АнализДанных.ЕстьОшибка Тогда
					Возврат;
				КонецЕсли;
				АнализДанных.Смещение = АнализДанных.Смещение + 2;
				Прервать;
			КонецЕсли;
			ПропуститьБлок(АнализДанных);
		КонецЦикла;
	КонецЕсли;
	
	АнализДанных.Родители.Удалить(0);
	
КонецПроцедуры

Процедура ПриОшибкеСтруктурыДанных(АнализДанных)
	
	АнализДанных.ЭтоОшибкаСтруктурыДанных = Истина;
	АнализДанных.ЕстьОшибка = Истина;
	
КонецПроцедуры

Процедура ПрочитатьКонецБлокаБезВложенийНеопределеннойДлины(АнализДанных)
	
	ПредыдущийБайт = -1;
	Байт = -1;
	
	Пока Истина Цикл
		ПредыдущийБайт = Байт;
		Байт = Неопределено; // ПрочитатьБайт(АнализДанных);
		Если АнализДанных.ЕстьОшибка Тогда
			Возврат;
		КонецЕсли;
		Если Байт = 0 И ПредыдущийБайт = 0 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ИдентификаторыАлгоритмовПодписи(ТолькоАлгоритмыОткрытогоКлюча)
	
	ИдентификаторыАлгоритмов = Новый Соответствие;
	
	ИдентификаторыАлгоритмов.Вставить("1.2.643.2.2.20",    ИменаАлгоритмовПодписиГОСТ_34_10_94());
	ИдентификаторыАлгоритмов.Вставить("1.2.643.2.2.19",    ИменаАлгоритмовПодписиГОСТ_34_10_2001());
	ИдентификаторыАлгоритмов.Вставить("1.2.643.7.1.1.1.1", ИменаАлгоритмовПодписиГОСТ_34_10_2012_256());
	ИдентификаторыАлгоритмов.Вставить("1.2.643.7.1.1.1.2", ИменаАлгоритмовПодписиГОСТ_34_10_2012_512());
	ИдентификаторыАлгоритмов.Вставить("1.2.840.113549.1.1.1", ИменаАлгоритмовПодписиRSA_SIGN()); // RSAEncryption.
	
	Если Не ТолькоАлгоритмыОткрытогоКлюча Тогда
		ИдентификаторыАлгоритмов.Вставить("1.2.643.2.2.4",     ИменаАлгоритмовПодписиГОСТ_34_10_94());
		ИдентификаторыАлгоритмов.Вставить("1.2.643.2.2.3",     ИменаАлгоритмовПодписиГОСТ_34_10_2001());
		ИдентификаторыАлгоритмов.Вставить("1.2.643.7.1.1.3.2", ИменаАлгоритмовПодписиГОСТ_34_10_2012_256());
		ИдентификаторыАлгоритмов.Вставить("1.2.643.7.1.1.3.3", ИменаАлгоритмовПодписиГОСТ_34_10_2012_512());
		ИдентификаторыАлгоритмов.Вставить("1.2.840.113549.1.1.2", ИменаАлгоритмовПодписиRSA_SIGN()); // md2WithRSAEncryption.
		ИдентификаторыАлгоритмов.Вставить("1.2.840.113549.1.1.3", ИменаАлгоритмовПодписиRSA_SIGN()); // md4withRSAEncryption.
		ИдентификаторыАлгоритмов.Вставить("1.2.840.113549.1.1.4", ИменаАлгоритмовПодписиRSA_SIGN()); // md5WithRSAEncryption.
		ИдентификаторыАлгоритмов.Вставить("1.2.840.113549.1.1.5", ИменаАлгоритмовПодписиRSA_SIGN()); // sha1WithRSAEncryption.
	КонецЕсли;
	
	Возврат ИдентификаторыАлгоритмов;
	
КонецФункции

Функция ИменаАлгоритмовПодписиRSA_SIGN()
	
	Имена = Новый Массив;
	Имена.Добавить("RSA_SIGN"); 
		
	Возврат Имена;
	
КонецФункции

Функция ИменаАлгоритмовПодписиГОСТ_34_10_94()
	
	Имена = Новый Массив;
	Имена.Добавить("ГОСТ 34.10-94"); // Представление.
	Имена.Добавить("GOST R 34.10-94");
		
	Возврат Имена;
	
КонецФункции

Функция ИменаАлгоритмовПодписиГОСТ_34_10_2001()
	
	Имена = Новый Массив;
	Имена.Добавить("ГОСТ Р 34.10-2001"); // Представление.
	Имена.Добавить("ГОСТ 34.10-2001"); 
	Имена.Добавить("GOST R 34.10-2001");
	Имена.Добавить("ECR3410-CP");
	
	Возврат Имена;
	
КонецФункции

Функция ИменаАлгоритмовПодписиГОСТ_34_10_2012_256()
	
	Имена = Новый Массив;
	Имена.Добавить("ГОСТ Р 34.10-2012 256 бит"); // Представление.
	Имена.Добавить("ГОСТ 34.10-2012 256 бит");    
	Имена.Добавить("GR 34.10-2012 256");
	Имена.Добавить("GOST 34.10-2012 256");
	Имена.Добавить("GOST R 34.10-12 256");
	Имена.Добавить("GOST3410-12-256");
		
	Возврат Имена;
	
КонецФункции

Функция ИменаАлгоритмовПодписиГОСТ_34_10_2012_512()
	
	Имена = Новый Массив;
	Имена.Добавить("ГОСТ Р 34.10-2012 512 бит"); // Представление.
	Имена.Добавить("ГОСТ 34.10-2012 512 бит"); 
	Имена.Добавить("GR 34.10-2012 512");
	Имена.Добавить("GOST 34.10-2012 512");
		
	Возврат Имена;
	
КонецФункции

Функция ЭЦП_ЗаполнитьСтруктуруСертификата(Сертификат, АлгоритмПодписи, МассивЛогаСобытий, ПустойАлгоритмПодписиЕслиНетБиблиотеки = Истина) Экспорт
	
    КомуВыдан = ЭЦП_ПолучитьПредставлениеПользователя(Сертификат.Субъект);
    КемВыдан  = ЭЦП_ПолучитьПредставлениеПользователя(Сертификат.Издатель);
    ДействителенДо = Сертификат.ДатаОкончания;
     
    ОтпечатокСертификата = Base64Строка(Сертификат.Отпечаток);
	
	ЭЦП_ЗаменитьНедопустимыеСимволы(КомуВыдан);
    ЭЦП_ЗаменитьНедопустимыеСимволы(КемВыдан);

    ИНН = "";
	Сертификат.Субъект.Свойство("OID1_2_643_100_4", ИНН);
	Если ИНН = Неопределено Тогда
		Сертификат.Субъект.Свойство("OID1_2_643_3_131_1_1", ИНН);
	КонецЕсли;
	ИНН_Число = ЭКОМ_ПреобразоватьВЧислоОбщегоНазначения(ИНН); 
	
	ДолжностьПодписанта = "";
	Сертификат.Субъект.Свойство("T", ДолжностьПодписанта);
	
	ФамилияПодписанта = "";
	Сертификат.Субъект.Свойство("SN", ФамилияПодписанта);
	
	ИмяОтчествоПодписанта = "";
	Сертификат.Субъект.Свойство("OID2_5_4_42", ИмяОтчествоПодписанта);
	ПерваяПозиция      = Найти(ИмяОтчествоПодписанта, " "); 
    ИмяПодписанта      = Лев(ИмяОтчествоПодписанта, ПерваяПозиция - 1);
	ОтчествоПодписанта = Прав(ИмяОтчествоПодписанта, СтрДлина(ИмяОтчествоПодписанта) - ПерваяПозиция);
	
	ИмяСертификата = Формат(ДействителенДо,"ДФ=dd.MM.yyyy") + " " + КомуВыдан;
	
	ИНН_Строка = Формат(ИНН_Число, "ЧГ=0");
	ЭЦП_ЗаменитьНедопустимыеСимволы(ИНН_Строка);
	ЭЦП_ЗаменитьНедопустимыеСимволы(ДолжностьПодписанта);
	ЭЦП_ЗаменитьНедопустимыеСимволы(ФамилияПодписанта);
	ЭЦП_ЗаменитьНедопустимыеСимволы(ИмяПодписанта);
	ЭЦП_ЗаменитьНедопустимыеСимволы(ОтчествоПодписанта);
	ЭЦП_ЗаменитьНедопустимыеСимволы(ОтпечатокСертификата);
	ЭЦП_ЗаменитьНедопустимыеСимволы(ИмяСертификата);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("КомуВыдан"              , КомуВыдан);
	СтруктураДанных.Вставить("КемВыдан"               , КемВыдан);
	СтруктураДанных.Вставить("ДействителенДо"         , ДействителенДо);
	СтруктураДанных.Вставить("ИНН"                    , ИНН_Строка);	
	СтруктураДанных.Вставить("ДолжностьПодписанта"     , ДолжностьПодписанта);
	СтруктураДанных.Вставить("ФамилияПодписанта"       , ФамилияПодписанта);
	СтруктураДанных.Вставить("ИмяПодписанта"           , ИмяПодписанта);
	СтруктураДанных.Вставить("ОтчествоПодписанта"      , ОтчествоПодписанта);   
	СтруктураДанных.Вставить("ОтпечатокСертификата"    , ОтпечатокСертификата);    
	СтруктураДанных.Вставить("ИмяСертификата"          , ИмяСертификата);
    
    ИздательСертификата = "";
    Если Сертификат.Издатель.Свойство("O", ИздательСертификата) = Ложь Тогда
        Сертификат.Издатель.Свойство("CN", ИздательСертификата);
    КонецЕсли;
    
    СтруктураДанных.Вставить("ИздательСертификата", ИздательСертификата);	
    СтруктураДанных.Вставить("АлгоритмПодписи"    , АлгоритмПодписи);
    СтруктураДанных.Вставить("СертификатОтпечаток", Сертификат.Отпечаток);
    
	Возврат СтруктураДанных;
КонецФункции

Функция ЭЦП_ПолучитьПредставлениеПользователя(СтруктураПользователя) Экспорт
    
    Представление = "";
    CN = "";
    Если СтруктураПользователя.Свойство("CN", CN) Тогда
        Представление = Представление + CN;
    КонецЕсли;	
    O = "";
    Если СтруктураПользователя.Свойство("O", O) Тогда
        Представление = Представление + ", " + O;
    КонецЕсли;	
    OU = "";
    Если СтруктураПользователя.Свойство("OU", OU) Тогда
        Представление = Представление + ", " + OU;
    КонецЕсли;	
    
    Возврат Представление;
    
КонецФункции

Функция СоздатьТестовыйФайл() Экспорт
    ВременныйКаталог = ПолучитьКаталогВременныхФайлов();
    
    // Создаем файл
    ФайлXMLПолноеИмя = ВременныйКаталог + "test.xml";
    Файл = Новый ЗаписьТекста(ФайлXMLПолноеИмя, КодировкаТекста.ANSI);		
    Файл.ЗаписатьСтроку("Это тестовый файл");
    Файл.Закрыть();
    
    Возврат ФайлXMLПолноеИмя;
КонецФункции //ФайлXMLПолноеИмя() 

//Выдает строкой полный путь до каталога временных файлов типа ("C:\temp\") на сервере т.к. это серверый общий модуль
Функция ПолучитьКаталогВременныхФайлов() Экспорт
	
	РазделительПути = ЭКОМ_Общее_ПолучитьРазделительПутиНаСервере();
	
	Результат = "";
    Результат = КаталогВременныхФайлов();
    Если НЕ Прав(Результат, 1) = РазделительПути Тогда
    	Результат = Результат + РазделительПути;
    КонецЕсли;
    
    Возврат Результат;
	
КонецФункции // КаталогВременныхФайлов()

Функция ЭКОМ_Общее_ПолучитьРазделительПутиНаСервере() Экспорт
		
	РазделительПути = "";

	Если ВерсияПлатформыНаСервере() >= 8330 Тогда
		Выполнить("РазделительПути = ПолучитьРазделительПутиСервера()");
	Иначе
		
		СистемнаяИнформация = Новый СистемнаяИнформация;	
		ЭтоLinuxКлиент = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 
		ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;
		
		Если ЭтоLinuxКлиент Тогда 
			РазделительПути = "/"; // Linux
		Иначе
			РазделительПути = "\";  // Windows
		КонецЕсли;
		
	КонецЕсли;
			
    Возврат РазделительПути;

КонецФункции

Функция ВерсияПлатформыНаСервере() Экспорт
	
	// # Пример: 8.3.11.3034 - 83110 (версия по трем позициям) и до 4 знаков 
    // # Пример: 8.3.5.6565  - 8350 (версия по трем позициям) и до 4 знаков 	
	// # Пример: 8.2.19.4342 - 8219 (версия по трем позициям) и до 4 знаков 
    // # Пример: 8.3.10.4342 - 83100(версия по трем позициям) и до 4 знаков
	// # Пример: 8.3.9.4342  - 8390 (версия по трем позициям) и до 4 знаков
	// # Пример: 8.3.12.4342 - 83120(версия по трем позициям) и до 4 знаков
	// # Пример: 8.3.1.00    - 8310(версия по трем позициям) и до 4 знаков
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ТекущаяВерсия = СистемнаяИнформация.ВерсияПриложения;
	
	Версия  = "";
	Для н = 1  По 3 Цикл
		ПозицияТочки  = Найти(ТекущаяВерсия, ".");
		Символ        = Лев(ТекущаяВерсия , ПозицияТочки - 1);
		ТекущаяВерсия = Сред(ТекущаяВерсия, ПозицияТочки + 1);
		Версия        = Версия + Символ;
	КонецЦикла;
	
	Если СтрДлина(Версия) < 4 
		 ИЛИ (Сред(Версия, 2, 1) = "3" И СтрДлина(Версия) = 4) Тогда
	    Версия = Версия + "0";	
	КонецЕсли;
	
	ВерсияЧисло = ЭКОМ_ПреобразоватьВЧислоОбщегоНазначения(Версия);
	
	Возврат ВерсияЧисло;
	
КонецФункции

Функция ПроверитьСертификат(Знач ЭКОМ_СправочникСертификат, МассивЛогаСобытий) Экспорт
	
	СертификатПроверен = Ложь;
    
    ФайлXMLПолноеИмя       = СоздатьТестовыйФайл();
    ДвоичныеДанныеФайлаXML = Новый ДвоичныеДанные(ФайлXMLПолноеИмя);
	
    НоваяПодписьДвоичныеДанные = ЭЦП_СформироватьПодписьФайлаОбщегоНазначения(ДвоичныеДанныеФайлаXML, ЭКОМ_СправочникСертификат, МассивЛогаСобытий);
	Если НоваяПодписьДвоичныеДанные = Неопределено Тогда
		ТекстЛогаСобытий = "Подпись не сформирована - проверьте пароль, алгоритм подписи, срок действия сертификата.";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, "Проверка сертификата");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		
	Иначе
		СертификатПроверен = Истина;
	КонецЕсли;

    УдалитьФайлы(ФайлXMLПолноеИмя);
    
    Возврат СертификатПроверен;
	
КонецФункции  

Процедура ЭЦП_ЗаменитьНедопустимыеСимволы(Текст) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Текст) Тогда
		Текст = "";
		Возврат;
	КонецЕсли;
	
	#Если НЕ ВебКлиент Тогда	
        Позиция = 1;
        Пока Позиция <> 0 Цикл
            
            Позиция = НайтиНедопустимыеСимволыXML(Текст, Позиция);
            
            Если Позиция <> 0 Тогда
                НоваяСтрока = Лев(Текст, Позиция - 1) + " " + Сред(Текст, Позиция + 1);
                Текст = НоваяСтрока;
            КонецЕсли;	
            
        КонецЦикла;	
    #КонецЕсли
КонецПроцедуры

Функция ЭЦП_СформироватьПодписьФайлаОбщегоНазначения(ДвоичныеДанныеФайлаXML, СертификатЭКОМ, МассивЛогаСобытий) Экспорт
	
	ИмяСобытия = "Формирование подписи";
	МенеджерКриптографии  = ЭЦП_ПолучитьМенеджерКриптографии(СертификатЭКОМ.АлгоритмПодписи, МассивЛогаСобытий);	
	Если МенеджерКриптографии = Неопределено Тогда
        Возврат Неопределено;
    КонецЕсли;
    
	// Получаем сертификат
	Сертификат = ЭЦП_ПолучитьСертификатПоОтпечатку(МенеджерКриптографии, СертификатЭКОМ);	
	Если Сертификат = Неопределено Тогда
		ТекстЛогаСобытий = ЭКОМ_ОбщегоНазначения.ОписаниеСертификата(СертификатЭКОМ) + " не найден в настройках [ЭКОМ_Сертификаты] в указанном хранилище сертификатов." + Символы.ПС + "Сертификат не определен (На сервере)."; 
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

		Возврат Неопределено;
	//Docrobot 1.19.1 MOD-1637	
	ИначеЕсли Сертификат.ДатаОкончания < ТекущаяДата() Тогда 
		ТекстЛогаСобытий = "У сертификата " + ЭКОМ_ОбщегоНазначения.ОписаниеСертификата(СертификатЭКОМ) + " истек срок действия.";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		Возврат Неопределено;
		
	КонецЕсли;
	
	СертификатПодходит = СертификатПодходит(Сертификат, СертификатЭКОМ, МассивЛогаСобытий);	
	Если НЕ СертификатПодходит Тогда
        Возврат Неопределено;
    КонецЕсли;
			
	МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = СертификатЭКОМ.ПарольСертификата;
	ДатаПодписи = ТекущаяДата();
	
	Попытка
		ДвоичныеДанныеПодписи = МенеджерКриптографии.Подписать(ДвоичныеДанныеФайлаXML, Сертификат);
				
	Исключение
		ТекстЛогаСобытий = "";
		Если ПустаяСтрока(СертификатЭКОМ.ПарольСертификата) Тогда
			ТекстЛогаСобытий = "Обратите внимание, у Вас в справочнике ЭКОМ_Сертификаты не указан пароль. Неправильный/пустой пароль может быть причиной ошибки подписания."; 
		КонецЕсли;
		ТекстЛогаСобытий    = ТекстЛогаСобытий + ?(ЗначениеЗаполнено(ТекстЛогаСобытий), Символы.ПС, "") + ОписаниеОшибки();
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

		Возврат Неопределено;
	КонецПопытки;
    				  	
	Возврат ДвоичныеДанныеПодписи;
	
КонецФункции

Функция СертификатПодходит(СертификатМенеджераКриптографии, ДанныеСертификатаЭКОМ, МассивЛогаСобытий) Экспорт
	
	ЭтотСертификатПодходит = Ложь;
    
    Организация        = ДанныеСертификатаЭКОМ.Организация;
    СубъектСертификата = СертификатМенеджераКриптографии.Субъект;
    
    ИНН_Юл_ИзСертификата = "";
	СубъектСертификата.Свойство("OID1_2_643_100_4", ИНН_Юл_ИзСертификата);
	Если ИНН_Юл_ИзСертификата = Неопределено Тогда
		СубъектСертификата.Свойство("OID1_2_643_3_131_1_1", ИНН_Юл_ИзСертификата);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИНН_Юл_ИзСертификата) Тогда
		
		ИННОрганизации = ОпределитьИННОрганизации(Организация); 
		
		ИННСертификатаПодписи = ЭКОМ_ПреобразоватьВЧислоОбщегоНазначения(ИНН_Юл_ИзСертификата);
		ИННОрганизации        = ЭКОМ_ПреобразоватьВЧислоОбщегоНазначения(ИННОрганизации);
		
		ЭтотСертификатПодходит = (ИННОрганизации = ИННСертификатаПодписи);
		
		Если ЭтотСертификатПодходит = Ложь Тогда
			ОрганизацияСертификата = ?(ЗначениеЗаполнено(Организация)
			, "организации [" + Строка(Организация) + "]"
			, "в справочнике ЭКОМ_Сертификаты, не заполнена организация. ИНН по пустой организации"
			);
			
			ТекстЛогаСобытий = "ИНН [" + Формат(ИННОрганизации, "ЧГ=0") + "] " + ОрганизацияСертификата + " отличается от ИНН [" 
			+ Формат(ИННСертификатаПодписи, "ЧГ=0") + "] сертификата, указанного для этой организации.";
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, "Проверка сертификата");
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

		КонецЕсли;
			
	Иначе
		
		ЭтотСертификатПодходит = Истина;
		
	КонецЕсли;
        
    Возврат ЭтотСертификатПодходит;
	
КонецФункции 

Функция ЭЦП_ПолучитьСертификатПоОтпечатку(МенеджерКриптографии, СертификатЭКОМ) Экспорт
	
	ЗначениеХранилищеСертификатов = Неопределено;
	Если СертификатЭКОМ.УстановленВЛичномХранилище Тогда
		ЗначениеХранилищеСертификатов = МенеджерКриптографии.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
	Иначе	
		ЗначениеХранилищеСертификатов = МенеджерКриптографии.ПолучитьХранилищеСертификатов();
	КонецЕсли;
	
	ДвоичныеДанныеОтпечатка = Base64Значение(СертификатЭКОМ.ОтпечатокСертификата);
	Сертификат = ЗначениеХранилищеСертификатов.НайтиПоОтпечатку(ДвоичныеДанныеОтпечатка);
	
	Возврат Сертификат;
    
КонецФункции

Функция ВсеАлгоритмыПодписей() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ГОСТ Р 34.10-2001");
	Результат.Добавить("ГОСТ Р 34.10-2012 256 бит");
	Результат.Добавить("ГОСТ Р 34.10-2012 512 бит");
	
	Результат.Добавить("ГОСТ Р 34.10-2012/256"); //в некоторых сертах пишется от так
	Результат.Добавить("ГОСТ Р 34.10-2012/512");
	
	Результат.Добавить("ГОСТ Р 34.10-2001 ViPNet CSP");
    Результат.Добавить("ГОСТ Р 34.10-2012/512 ViPNet CSP");
    Результат.Добавить("ГОСТ Р 34.10-2012/1024 ViPNet CSP");

	Результат.Добавить("GOST R 34.10-2001");
	Результат.Добавить("GOST R 34.10-2012 256 бит");
	Результат.Добавить("GOST R 34.10-2012 512 бит");
	
	Результат.Добавить("GOST R 34.10-2012/256"); //в некоторых сертах пишется от так
	Результат.Добавить("GOST R 34.10-2012/512");
	
	Результат.Добавить("GOST R 34.10-2001 ViPNet CSP");
    Результат.Добавить("GOST R 34.10-2012/512 ViPNet CSP");
    Результат.Добавить("GOST R 34.10-2012/1024 ViPNet CSP");
	
	Результат.Добавить("GOST R 34.10-2012 256 bit");
 	Результат.Добавить("GOST R 34.10-2012 512 bit");
    
	Возврат Результат;
	
КонецФункции //ВсеАлгоритмыПодписей() 

Функция ЭтоПоддерживаемыйАлгоритмПодписи(Алгоритм) Экспорт
    Если ЗначениеЗаполнено(Алгоритм) = Ложь Тогда //при не заполненном алгоритме считаю что он поддерживается (это бывает в случае не выбранного алгоритма на форме ВсеСертификаты)
        Возврат Истина;
    КонецЕсли;
    ВсеАлгоритмы = ВсеАлгоритмыПодписей();
    Результат = ?(ВсеАлгоритмы.Найти(Алгоритм) = Неопределено, Ложь, Истина);
    
    Возврат Результат;
КонецФункции //ЭтоПоддерживаемыйАлгоритмПодписи()

Функция ЭЦП_ПараметрыМенеджераКриптографииПоАлгоритмуПодписи(АлгоритмПодписи) Экспорт
    
	Результат = Новый Структура;
	Результат.Вставить("АлгоритмПодписи"       , "");
	Результат.Вставить("ИмяМодуляКриптографии" , "");
	Результат.Вставить("ПутьМодуляКриптографии", "");
	Результат.Вставить("ТипМодуляКриптографии" , "");
	
	СистемнаяИнформация = Новый СистемнаяИнформация;	
	ЭтоLinuxКлиент = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 
	ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;
	
	Если ЭтоLinuxКлиент Тогда 		
		ПутьМодуляКриптографии = "/opt/cprocsp/lib/amd64/libcapilite.so:/opt/cprocsp/lib/amd64/libcapi10.so:/opt/cprocsp/lib/amd64/libcapi20.so"; // Linux		
	    ИмяМодуляКриптографии2001 = "";
		ИмяМодуляКриптографии2012 = "";	
	Иначе
		ПутьМодуляКриптографии = "";  // Windows
		ИмяМодуляКриптографии2001 = "Crypto-Pro GOST R 34.10-2001 Cryptographic Service Provider";
		ИмяМодуляКриптографии2012 = "Crypto-Pro GOST R 34.10-2012 Cryptographic Service Provider";
	КонецЕсли;

	Если АлгоритмПодписи = "ГОСТ Р 34.10-2001" 
		ИЛИ АлгоритмПодписи = "GOST R 34.10-2001" Тогда
		
		Результат.Вставить("АлгоритмПодписи"       , "ГОСТ Р 34.10-2001");
		Результат.Вставить("ИмяМодуляКриптографии" , ИмяМодуляКриптографии2001);
		Результат.Вставить("ПутьМодуляКриптографии", ПутьМодуляКриптографии);
		Результат.Вставить("ТипМодуляКриптографии" , 75);
		
	ИначеЕсли АлгоритмПодписи = "ГОСТ Р 34.10-2012 256 бит" 
		ИЛИ АлгоритмПодписи = "ГОСТ Р 34.10-2012/256" 
		ИЛИ АлгоритмПодписи = "GOST R 34.10-2012 256 bit" 
		ИЛИ АлгоритмПодписи = "GOST R 34.10-2012/256" Тогда
		
		Результат.Вставить("АлгоритмПодписи"       , "ГОСТ Р 34.10-2012 256 бит");
		Результат.Вставить("ИмяМодуляКриптографии" , ИмяМодуляКриптографии2012);
		Результат.Вставить("ПутьМодуляКриптографии", ПутьМодуляКриптографии);
		Результат.Вставить("ТипМодуляКриптографии" , 80);

	ИначеЕсли АлгоритмПодписи = "ГОСТ Р 34.10-2012 512 бит" 
		ИЛИ АлгоритмПодписи = "ГОСТ Р 34.10-2012/512" 
		ИЛИ АлгоритмПодписи = "GOST R 34.10-2012 512 bit" 
		ИЛИ АлгоритмПодписи = "GOST R 34.10-2012/512" Тогда
		
		Результат.Вставить("АлгоритмПодписи"       , "ГОСТ Р 34.10-2012 512 бит");
		Результат.Вставить("ИмяМодуляКриптографии" , "Crypto-Pro GOST R 34.10-2012 Strong Cryptographic Service Provider");
		Результат.Вставить("ПутьМодуляКриптографии", ПутьМодуляКриптографии);
		Результат.Вставить("ТипМодуляКриптографии" , 81);

	ИначеЕсли АлгоритмПодписи = "ГОСТ Р 34.10-2001 ViPNet CSP" Тогда
		
		Результат.Вставить("АлгоритмПодписи"       , АлгоритмПодписи);
		Результат.Вставить("ИмяМодуляКриптографии" , "Infotecs Cryptographic Service Provider");
		Результат.Вставить("ПутьМодуляКриптографии", ПутьМодуляКриптографии);
		Результат.Вставить("ТипМодуляКриптографии" , 2);

	ИначеЕсли АлгоритмПодписи = "ГОСТ Р 34.10-2012/512 ViPNet CSP" Тогда
		
		Результат.Вставить("АлгоритмПодписи"       , АлгоритмПодписи);
		Результат.Вставить("ИмяМодуляКриптографии" , "Infotecs GOST 2012/512 Cryptographic Service Provider");
		Результат.Вставить("ПутьМодуляКриптографии", ПутьМодуляКриптографии);
		Результат.Вставить("ТипМодуляКриптографии" , 77);

	ИначеЕсли АлгоритмПодписи = "ГОСТ Р 34.10-2012/1024 ViPNet CSP" Тогда
		
		Результат.Вставить("АлгоритмПодписи"       , АлгоритмПодписи);
		Результат.Вставить("ИмяМодуляКриптографии" , "Infotecs GOST 2012/1024 Cryptographic Service Provider");
		Результат.Вставить("ПутьМодуляКриптографии", ПутьМодуляКриптографии);
		Результат.Вставить("ТипМодуляКриптографии" , 78);
		
    КонецЕсли;		
    
    Возврат Результат;
	
КонецФункции //ПараметрыМенеджераКриптографииПоАлгоритмуПодписи 

Функция ОписаниеСертификата(СертификатЭКОМ) Экспорт
    Результат = "В справочнике [ЭКОМ_Сертификаты] элемент [" + Строка(СертификатЭКОМ) + "] по алгоритму подписи [" + СертификатЭКОМ.АлгоритмПодписи + "]  с отпечатком [" + СертификатЭКОМ.ОтпечатокСертификата + "]";
    Возврат Результат;
КонецФункции //ОписаниеСертификата() 

Функция ПолучитьВерсиюVipNet(МассивЛогаСобытий) Экспорт
    Перем Результат;
    
    //Сертификаты = Новый COMОбъект("System.Security.Cryptography.X509Certificates.X509Certificate");
    //Все = Сертификаты.Import;
    Попытка
	    Криптопровайдер = Новый COMОбъект("ITCSCOM.Cryptography");
    Исключение
        Криптопровайдер = "VipNet не обнаружен на сервере"
    КонецПопытки;
    Возврат Криптопровайдер;
КонецФункции

Функция СтрокаВСтруктуру(Источник, РазделительВнутриЭлементаКлючЗначение, РазделительМеждуПарамиКлючЗначение) Экспорт
    Результат = Новый Структура;
    МассивПарКлючЗначениеСтрокой = РазложитьСтрокуВМассивПодстрок(Источник, РазделительМеждуПарамиКлючЗначение, Истина);
    Для каждого ТекКлючЗначениеСтрокой Из МассивПарКлючЗначениеСтрокой Цикл
        МассивКлючЗначение = РазложитьСтрокуВМассивПодстрок(ТекКлючЗначениеСтрокой, РазделительВнутриЭлементаКлючЗначение, Ложь);
        Если МассивКлючЗначение.Количество() = 2 Тогда
            Результат.Вставить(МассивКлючЗначение[0], МассивКлючЗначение[1]);
        ИначеЕсли МассивКлючЗначение.Количество() = 1 Тогда
            Результат.Вставить(МассивКлючЗначение[0], "");
        КонецЕсли;
    КонецЦикла;
    Возврат Результат;
КонецФункции //СтрокаВСтруктуру()

Функция ОписатьСертификатПоВладельцИздательИзСтрок(Владелец, Издатель) Экспорт
    ВладелецСертификата = СтрокаВСтруктуру(Владелец, "=", ",");
    ИздательСертификата = СтрокаВСтруктуру(Издатель, "=", ",");
    
    //ВладелецСертификата = СтрокаВСтруктуру(CurrentCert.SubjectName, "=", ",");
    //ИздательСертификата = СтрокаВСтруктуру(CurrentCert.IssuerName,  "=", ",");
    
    Результат = "Владелец сертификата: " + ЭЦП_ПолучитьПредставлениеПользователя(ВладелецСертификата)
              + Символы.ПС
              + "Издатель сертификата: " + ЭЦП_ПолучитьПредставлениеПользователя(ИздательСертификата)   
               ;
    Возврат Результат;
КонецФункции // 

Функция СтрокуКакДвоичныеДанные(Параметр) Экспорт
	
	Перем Результат;
    
    ТипДвоичныеДанные = ФабрикаXDTO.Тип("http://www.w3.org/2001/XMLSchema", "hexBinary");
    Результат = ФабрикаXDTO.Создать(ТипДвоичныеДанные,Параметр);
    
    Возврат Результат.Значение;
	
КонецФункции 

Функция ДвоичныеДанныеКакСтроку(Параметр) Экспорт
    Перем Результат;
    
    ТипДвоичныеДанные = ФабрикаXDTO.Тип("http://www.w3.org/2001/XMLSchema", "hexBinary");
    Результат = ФабрикаXDTO.Создать(ТипДвоичныеДанные,Параметр);
    
    Возврат Результат.ЛексическоеЗначение;
КонецФункции 

// Настройки хранятся в ЭКОМ_ЗначениеДополнительныхКонстант
// Имя - имя настройки
// опрЗначение - значение по умолчанию
// Измерение - может хранится в разрезе (организаций, пользователей)
Функция НастройкиПрочитатьНаСервере(Имя, ЗначениеПоУмолчанию = Неопределено, Измерение = Неопределено, Обязательно = Ложь) Экспорт	
        
    МЗ = РегистрыСведений.ЭКОМ_ЗначениеДополнительныхКонстант.СоздатьМенеджерЗаписи();
	МЗ.ДополнительнаяКонстанта  = Имя;
	МЗ.Измерение                = Измерение;         
	
	УстановитьПривилегированныйРежим(Истина);
	МЗ.Прочитать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если МЗ.Выбран() Тогда
		
		Если ТипЗнч(МЗ.ЗначениеДополнительнойКонстанты) = Тип("Неопределено") Тогда
			ЗначениеПоУмолчанию = МЗ.ЗначениеДополнительногоХранилища.Получить();
		Иначе	
			ЗначениеПоУмолчанию = МЗ.ЗначениеДополнительнойКонстанты;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Обязательно 
		 И НЕ ЗначениеЗаполнено(ЗначениеПоУмолчанию) Тогда		
		 ТекстЛогаСобытий = "Значение не заполнено для настройки - <<< " + Имя + ">>>";
		 ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, "Чтение настроек из регистра");
		 ЗаписатьСтрокуЛогаСобытийвРегистрЛогирование(ЗаписьСтруктурыЛога);
		 
		 Возврат Неопределено;
		 
	КонецЕсли;
	
	Возврат ЗначениеПоУмолчанию;
    
КонецФункции

// Процедура добавляет или изменяе запись в регистре сведений ЭКОМ_ЗначениеДополнительныхКонстант
//
// Параметры:
//  пИмя  				- Строка - значение реквизита ДополнительнаяКонстанта
//  пЗначение  			- ЛюбаяСсылка, Булево, Строка, Дата, Число; ХранилищеЗначения - значение реквизитов ЗначениеДополнительнойКонстанты
//		либо ЗначениеДополнительногоХранилища, если первый символ строки в параметре пИмя равен "_"
//  пИзмерение  		- ДокументСсылка, Строка, СправочникСсылка - значение реквизита Измерение
//  пНовоеИзмерение  	- ДокументСсылка, Строка, СправочникСсылка - значение реквизита Измерение для замены. Если оставить значение
//		по умолчанию - Неопределено - замены не произойдет
//
Функция НастройкаПараметрЗаписать(Имя, Значение, Измерение, МассивЛогаСобытий) Экспорт
	
	МЗ = РегистрыСведений.ЭКОМ_ЗначениеДополнительныхКонстант.СоздатьМенеджерЗаписи();
	
	Если Лев(Имя , 1) = "_" Тогда
		ПоместитьВХранилище = Истина;
	Иначе
		ПоместитьВХранилище = Ложь;
	КонецЕсли;
	
	МЗ.ДополнительнаяКонстанта  = ?(ПоместитьВХранилище, Сред(Имя, 2), Имя);
	МЗ.Измерение                = Измерение;
	МЗ.Прочитать();
	
	Если НЕ МЗ.Выбран() Тогда
		МЗ.ДополнительнаяКонстанта  = ?(ПоместитьВХранилище, Сред(Имя, 2), Имя);
		МЗ.Измерение                = Измерение;
	КонецЕсли;
	
	Если ПоместитьВХранилище Тогда
		МЗ.ЗначениеДополнительногоХранилища = Новый ХранилищеЗначения(Значение);
		МЗ.ЗначениеДополнительнойКонстанты  = Неопределено; // Очищаем данные
	Иначе
		МЗ.ЗначениеДополнительнойКонстанты 	= Значение;
	КонецЕсли;
	
	НастройкаЗаписана = Ложь;
	Попытка
		МЗ.Записать();
		НастройкаЗаписана = Истина;
	Исключение
		ТекстЛогаСобытий = "Ошибка записи настройки в [РегистрСведений.ЭКОМ_ЗначениеДополнительныхКонстант] - <<< " + Имя + ">>>";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, "Записать настройку в регистр");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

	КонецПопытки;
	
	Возврат НастройкаЗаписана;
	
КонецФункции

//Docrobot 1.20.0 MOD-1573[Вызывает функцию НастройкиПрочитатьНаСервере. Используется при вызове из гибких настроек]
Функция Настройка_Параметр_Прочитать(Имя, ЗначениеПоУмолчанию = Неопределено, Измерение = Неопределено, Обязательно = Ложь) Экспорт 

	Возврат НастройкиПрочитатьНаСервере(Имя, ЗначениеПоУмолчанию, Измерение, Обязательно);

КонецФункции

// Записывает лог событий 
Процедура ЗаписатьЛогСобытий(ТекстСообщения, Знач ТекстЛогаСобытий)
    
	Если НЕ ЗначениеЗаполнено(ТекстЛогаСобытий) Тогда
		Возврат;
	Иначе
		ТекстЛогаСобытий = Строка(ТекущаяДата()) + ": " + ТекстЛогаСобытий;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС + ТекстЛогаСобытий;
	Иначе
		ТекстСообщения = ТекстЛогаСобытий;
	КонецЕсли;
	
КонецПроцедуры

// Преобразует массив лога в строковое значение 
// МассивЛогаСобытий - Массив
// ТекстСообщения - Текущий текстовый лог 
Функция ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий, ТекстСообщения = "") Экспорт
     	
  	Для каждого Запись Из МассивЛогаСобытий Цикл
		Если ЗначениеЗаполнено(Запись.Комментарий) Тогда
			ТекстСообщения = ТекстСообщения + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "") + Запись.Комментарий;
		КонецЕсли;		
	КонецЦикла;

	Возврат ТекстСообщения;
	
КонецФункции

// В регистре сведений изменяет статус цепочки документов
// Используется в ЭКОМ_Объекты_События 
Процедура ЗаписатьСтатусДокумента(ИмяРегистра, ИмяДокумента, ДокументОснование, ДанныеРесурсов, ДанныеОтбора) Экспорт
			
	НаборЗаписейЦепочкаДокументов = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	НаборЗаписейЦепочкаДокументов.Отбор[ИмяДокумента].Установить(ДокументОснование);
	
	Для каждого Стр Из ДанныеОтбора Цикл
	    Если ЗначениеЗаполнено(Стр.Значение) Тогда
		     НаборЗаписейЦепочкаДокументов.Отбор[Стр.Ключ].Установить(Стр.Значение);
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписейЦепочкаДокументов.Прочитать();
	
	Если НаборЗаписейЦепочкаДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЗаписьНабора Из НаборЗаписейЦепочкаДокументов Цикл
		
		Если НЕ ЗначениеЗаполнено(ЗаписьНабора[ИмяДокумента]) Тогда
			Продолжить;
		КонецЕсли;
		
		// Статус ЮЗД
		Если ДанныеРесурсов.Свойство("СтатусЮЗД") Тогда
			ТекущийСтатусЮЗД = ЗаписьНабора.СтатусЮЗД; 
			СтатусЮЗД = ДанныеРесурсов.СтатусЮЗД;		 
			Если СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ПустаяСсылка() 
				ИЛИ  СтатусЮЗД = Перечисления.ЭКОМ_Статусы.Отправлен Тогда 
				ЗаписьНабора.КоличествоКвитанций = 0;			
			КонецЕсли;
			
			Если ДанныеРесурсов.Свойство("СчитатьКоличествоКвитанций")  Тогда
				Если ДанныеРесурсов.СчитатьКоличествоКвитанций = Истина Тогда
					ЗаписьНабора.КоличествоКвитанций = ЗаписьНабора.КоличествоКвитанций + 1;			  
				КонецЕсли;
				ДанныеРесурсов.Удалить("СчитатьКоличествоКвитанций");  
			КонецЕсли;		 		 
			
			Если СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ОтправленоАннулирование
					ИЛИ СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ПредложеноАннулирование
					ИЛИ СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ПринятоАннулирование
					ИЛИ СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ОтклоненоАннулирование Тогда
					// Для аннулирования оставляем как есть независимо от имени регистра.
				
			ИначеЕсли ИмяРегистра = "ЭКОМ_ЦепочкиДокументовПоставщика" Тогда			 
				
				Если (ТекущийСтатусЮЗД = Перечисления.ЭКОМ_Статусы.ПодписаноПокупателем
					ИЛИ СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ПодписаноПокупателем)
					И ЗаписьНабора.КоличествоКвитанций >= 4 Тогда // квитанции 2, 4, 6, 11 // Новая схема 2, 3, 6, 8, 11
					СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ДокументооборотЗавершен;
					
				ИначеЕсли (ТекущийСтатусЮЗД = Перечисления.ЭКОМ_Статусы.Уточнение_Получено
					ИЛИ СтатусЮЗД = Перечисления.ЭКОМ_Статусы.Уточнение_Получено)
					И ЗаписьНабора.КоличествоКвитанций >= 5 Тогда // квитанции 2, 4, 6, 9, 10 // Новая схема 2, 3, 6, 8, 9, 13
					СтатусЮЗД = Перечисления.ЭКОМ_Статусы.Подтвержден_с_отклонением;
					
				ИначеЕсли ТекущийСтатусЮЗД = Перечисления.ЭКОМ_Статусы.ПодписаноПокупателем  // квитанция 11
					И НЕ ЗаписьНабора.КоличествоКвитанций = 0 Тогда                          
					СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ПодписаноПокупателем;
					
				ИначеЕсли ТекущийСтатусЮЗД = Перечисления.ЭКОМ_Статусы.Уточнение_Получено   // квитанция 9
					И НЕ ЗаписьНабора.КоличествоКвитанций = 0 Тогда 
					СтатусЮЗД = Перечисления.ЭКОМ_Статусы.Уточнение_Получено;
					
				ИначеЕсли ТекущийСтатусЮЗД = Перечисления.ЭКОМ_Статусы.ДокументооборотЗавершен Тогда 					 
					СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ДокументооборотЗавершен;
					
				ИначеЕсли ТекущийСтатусЮЗД = Перечисления.ЭКОМ_Статусы.Подтвержден_с_отклонением Тогда 					 
					СтатусЮЗД = Перечисления.ЭКОМ_Статусы.Подтвержден_с_отклонением;
					
				КонецЕсли;
			ИначеЕсли ИмяРегистра = "ЭКОМ_ЦепочкиДокументовПокупателя" Тогда	
				 //Docrobot 29.11.21 MOD-1451 [получение статуса ЮЗД по приоритету]
				 //Закомментирован так как последний статус мы получаем в модуле набора записей РС ЭКОМ ОбъектыСобытия 
				//Если (ТекущийСтатусЮЗД = Перечисления.ЭКОМ_Статусы.ПодписаноПокупателем
				//	ИЛИ СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ПодписаноПокупателем)
				//	И ЗаписьНабора.КоличествоКвитанций >= 5 Тогда // квитанции 3, 5, 6, 7, 8, 11  // Новая схема 3, 6, 7, 8, 11
				//	СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ДокументооборотЗавершен;
				//	
				//ИначеЕсли (ТекущийСтатусЮЗД = Перечисления.ЭКОМ_Статусы.ОтправленоУточнение
				//	ИЛИ СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ОтправленоУточнение)
				//	И ЗаписьНабора.КоличествоКвитанций >= 7 Тогда // квитанции 3, 5, 6, 7, 8, 9, 10  // Новая схема 3, 6, 7, 8, 9, 12, 13
				//	СтатусЮЗД = Перечисления.ЭКОМ_Статусы.Подтвержден_с_отклонением;
				//	
				//ИначеЕсли ТекущийСтатусЮЗД = Перечисления.ЭКОМ_Статусы.ПодписаноПокупателем Тогда  // квитанция 11
				//	СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ПодписаноПокупателем;
				//	
				//ИначеЕсли ТекущийСтатусЮЗД = Перечисления.ЭКОМ_Статусы.ОтправленоУточнение Тогда  // квитанция 9
				//	СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ОтправленоУточнение;
				//	
				//ИначеЕсли ЗаписьНабора.ЮЗД.ТипДокумента = "ДОП"  
				//	И (ТекущийСтатусЮЗД = Перечисления.ЭКОМ_Статусы.ПодписаноПокупателем
				//	ИЛИ СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ПодписаноПокупателем) Тогда 
				//	
				//	СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ДокументооборотЗавершен;
				//	
				//ИначеЕсли ЗаписьНабора.ЮЗД.ТипДокумента = "СЧФ"
				//	И ЗаписьНабора.КоличествоКвитанций >= 4 Тогда // квитанции 3, 5, 6, 7, 8  // Новая схема 3, 6, 7, 8
				//	
				//	СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ДокументооборотЗавершен;
				//	
				//ИначеЕсли ТекущийСтатусЮЗД = Перечисления.ЭКОМ_Статусы.ДокументооборотЗавершен Тогда 					 
				//	СтатусЮЗД = Перечисления.ЭКОМ_Статусы.ДокументооборотЗавершен;
				//	
				//ИначеЕсли ТекущийСтатусЮЗД = Перечисления.ЭКОМ_Статусы.Подтвержден_с_отклонением Тогда 					 
				//	СтатусЮЗД = Перечисления.ЭКОМ_Статусы.Подтвержден_с_отклонением;
				//	
				//КонецЕсли;
				 //Закомментирован так как последний статус мы получаем в модуле набора записей РС ЭКОМ ОбъектыСобытия
			КонецЕсли;			 
			
			ДанныеРесурсов.Вставить("СтатусЮЗД", СтатусЮЗД);
			
		КонецЕсли;
		
		// Структура
		Для каждого Эл Из ДанныеРесурсов Цикл
			ЗаписьНабора[Эл.Ключ] = Эл.Значение;
		КонецЦикла;	
		
	КонецЦикла;	
	
	НаборЗаписейЦепочкаДокументов.Записать();
	
КонецПроцедуры	

Функция ЭКОМ_ПреобразоватьВЧислоОбщегоНазначения(ЧислоСтрока) Экспорт
	
	Если ТипЗнч(ЧислоСтрока) = Тип("Число") Тогда
		Возврат ЧислоСтрока;
	КонецЕсли;
	
	ЧислоСтрокаПреобразование = СокрЛП(Строка(ЧислоСтрока));
	ЧислоСтрокаПреобразование = СтрЗаменить(ЧислоСтрокаПреобразование, " ", "");
	ЧислоСтрокаПреобразование = СтрЗаменить(ЧислоСтрокаПреобразование, Символы.НПП, "");
	
	НомерРазделителяДробнойЧасти = 0;    
	ЧислоСтрокаРезультат         = "";
	КоличествоСимволов           = СтрДлина(ЧислоСтрокаПреобразование);
	Для НомерСимвола = 1 По КоличествоСимволов Цикл
		
		// 0 в кодировке Unicode это 48
		// 9 в кодировке Unicode это 57
		СимволЧисла = Сред(ЧислоСтрокаПреобразование, НомерСимвола, 1);
		Если (КодСимвола(СимволЧисла) >= 48) 
			И (КодСимвола(СимволЧисла) <= 57) Тогда
			ЧислоСтрокаРезультат = ЧислоСтрокаРезультат + СимволЧисла;
			
		ИначеЕсли (НомерСимвола = 1) 
			И ((СимволЧисла = "-") 
			ИЛИ (СимволЧисла = "+" )) Тогда
			ЧислоСтрокаРезультат = ЧислоСтрокаРезультат + СимволЧисла;
			
		ИначеЕсли (СимволЧисла = ",") 
			ИЛИ (СимволЧисла = ".") Тогда
			НомерРазделителяДробнойЧасти = НомерРазделителяДробнойЧасти + 1;
			
			Если НомерРазделителяДробнойЧасти > 1 Тогда
				Прервать;
			КонецЕсли;
			ЧислоСтрокаРезультат = ЧислоСтрокаРезультат + ".";
			
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	ЧислоРезультат = 0;
	
	Если НЕ ЧислоСтрокаРезультат = "" Тогда	
		ЧислоРезультат = Число(ЧислоСтрокаРезультат);
	КонецЕсли;
	
	Возврат ЧислоРезультат;
	
КонецФункции

Функция ЭЦП_ОперацииПроверкиПодписиНаСервере(ДвоичныеДанныеBIN, ДанныеСертификатаЭКОМ, МассивЛогаСобытий) Экспорт
		
	МенеджерКриптографии = ЭЦП_ПолучитьМенеджерКриптографии(ДанныеСертификатаЭКОМ.АлгоритмПодписи, МассивЛогаСобытий);
	Если МенеджерКриптографии = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяФайлаBIN = ПолучитьИмяВременногоФайла("bin");
	ДвоичныеДанныеBIN.Записать(ИмяФайлаBIN);
	
	ПодписьBIN = Новый ТекстовыйДокумент;
	ПодписьBIN.Прочитать(ИмяФайлаBIN);
    СтрокаBase64 = ПодписьBIN.ПолучитьТекст();
	СтрокаBase64 = СтрЗаменить(СтрокаBase64, Символы.ПС, "");
	СтрокаBase64 = СтрЗаменить(СтрокаBase64, Символы.ВК, "");
	
	ИмяФайлаSGN = ПолучитьИмяВременногоФайла("sgn");
	ДвоичныеДанныеSGN = Base64Значение(СтрокаBase64);
	Если ДвоичныеДанныеSGN = Неопределено Тогда
	     ДвоичныеДанныеBIN.Записать(ИмяФайлаSGN);
	Иначе	
	     ДвоичныеДанныеSGN.Записать(ИмяФайлаSGN);
	КонецЕсли;
	
	СертификатСовпадает = Ложь;
	
	МассивДанных = МенеджерКриптографии.ПолучитьСертификатыИзПодписи(ИмяФайлаSGN);		
	Для каждого Эл Из МассивДанных Цикл
		Если Base64Строка(Эл.Отпечаток) = ДанныеСертификатаЭКОМ.ОтпечатокСертификата Тогда
			СертификатСовпадает = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат СертификатСовпадает;
	
КонецФункции

// /! Процедура из БСП !/ Формирует и выводит сообщение, которое может быть связано с элементом управления формы.
//
// Параметры:
//  ТекстСообщенияПользователю - Строка - текст сообщения.
//  КлючДанных - ЛюбаяСсылка - объект или ключ записи информационной базы, к которому это сообщение относится.
//  Поле - Строка - наименование реквизита формы.
//  ПутьКДанным - Строка - путь к данным (путь к реквизиту формы).
//  Отказ - Булево - выходной параметр, всегда устанавливается в значение Истина.
//
// Пример:
//
//  1. Для вывода сообщения у поля управляемой формы, связанного с реквизитом объекта:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "ПолеВРеквизитеФормыОбъект",
//   "Объект");
//
//  Альтернативный вариант использования в форме объекта:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "Объект.ПолеВРеквизитеФормыОбъект");
//
//  2. Для вывода сообщения рядом с полем управляемой формы, связанным с реквизитом формы:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "ИмяРеквизитаФормы");
//
//  3. Для вывода сообщения связанного с объектом информационной базы:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ОбъектИнформационнойБазы, "Ответственный",,Отказ);
//
//  4. Для вывода сообщения по ссылке на объект информационной базы:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), Ссылка, , , Отказ);
//
//  Случаи некорректного использования:
//   1. Передача одновременно параметров КлючДанных и ПутьКДанным.
//   2. Передача в параметре КлючДанных значения типа отличного от допустимого.
//   3. Установка ссылки без установки поля (и/или пути к данным).
//
Процедура СообщитьПользователю( 
	Знач ТекстСообщенияПользователю,
	Знач КлючДанных = Неопределено,
	Знач Поле = "",
	Знач ПутьКДанным = "",
	Отказ = Ложь) Экспорт
	
	ЭтоОбъект = Ложь;
	
	Если КлючДанных <> Неопределено
		И XMLТипЗнч(КлючДанных) <> Неопределено Тогда
		
		ТипЗначенияСтрокой = XMLТипЗнч(КлючДанных).ИмяТипа;
		ЭтоОбъект = ЭКОМ_ОбщегоНазначения.ПоискВСтроке(ТипЗначенияСтрокой, "Object.") > 0;
	КонецЕсли;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Поле = Поле;
	
	Если ЭтоОбъект Тогда
		Сообщение.УстановитьДанные(КлючДанных);
	Иначе
		Сообщение.КлючДанных = КлючДанных;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
	
	Сообщение.Сообщить();
	
	Отказ = Истина;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПОДКЛЮЧЕНИЕ К GIT

// GET запрос - Получаем данные с HTTP-сервера
Функция ПолучениеДанныхGITНаСервере(КомандаЗапроса, МассивЛогаСобытий) Экспорт
			
	Ответ = ВыполнитьЗапросGIT(КомандаЗапроса, Неопределено, "GET", МассивЛогаСобытий);   
	Если НЕ Ответ = Неопределено Тогда
	     Результат = ОбработатьОтвет(Ответ.Текст)
	Иначе
		 Результат = Неопределено;
	КонецЕсли;
	 
	Возврат Результат;

КонецФункции

// ДанныеЗапроса - Структура
// ДанныеЗапроса.Текст - текст запроса
// ДанныеЗапроса.Заголовки
Функция ВыполнитьЗапросGIT(КомандаЗапроса, ДанныеЗапроса, HTTPМетод, МассивЛогаСобытий) Экспорт
		
	СтруктураОшибки = Новый Структура;
	СтруктураОшибки.Вставить("ЕстьОшибка" , Ложь);
	СтруктураОшибки.Вставить("КодОшибки"  , "");
	СтруктураОшибки.Вставить("ТекстОшибки", "");
	
	ТокенGIT = "84cabc6dac4746014ed2157563537b4c530a4d64";
	АдресСервера = "api.github.com";
		
	Если НЕ ЗначениеЗаполнено(АдресСервера) Тогда
		
		СтруктураОшибки.Вставить("ЕстьОшибка" , Истина); 
		СтруктураОшибки.Вставить("КодОшибки"  , "");
		СтруктураОшибки.Вставить("ТекстОшибки", "В настройках программы не заполнен адрес сервера");
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ЭКОМ_ИспользуетсяПрокси = НастройкиПрочитатьНаСервере("ЭКОМ_ИспользуетсяПрокси", Ложь);	
	Если ЭКОМ_ИспользуетсяПрокси Тогда
		ЭКОМ_ИмяСервераПрокси         = НастройкиПрочитатьНаСервере("ЭКОМ_ИмяСервераПрокси"        , "");
		ЭКОМ_ИмяПользователяПрокси    = НастройкиПрочитатьНаСервере("ЭКОМ_ИмяПользователяПрокси"   , "");
		ЭКОМ_ПарольПользователяПрокси = НастройкиПрочитатьНаСервере("ЭКОМ_ПарольПользователяПрокси", "");
		
	Иначе
		ЭКОМ_ИмяСервераПрокси         = "";
		ЭКОМ_ИмяПользователяПрокси    = "";
		ЭКОМ_ПарольПользователяПрокси = "";
	КонецЕсли;
	
	ПроксиСервер = Новый ИнтернетПрокси;
	ПроксиСервер.Пользователь = ЭКОМ_ИмяПользователяПрокси;
	ПроксиСервер.Пароль       = ЭКОМ_ПарольПользователяПрокси;
	ПроксиСервер.Сервер(ЭКОМ_ИмяСервераПрокси);	
	
	// Хост и порт
	Хост = АдресСервера;
	Порт = 443;
	Позиция = Найти(АдресСервера, ":");
	Если Позиция > 0 Тогда
		Хост = Лев(АдресСервера, Позиция - 1);
		Порт = ЭКОМ_ПреобразоватьВЧислоОбщегоНазначения(Сред(АдресСервера, Позиция + 1));
	КонецЕсли;
	
	ОтветСтрока = "";
	
	ТекстJSON = "";
	Если HTTPМетод = "POST" 
		ИЛИ HTTPМетод = "PUT" Тогда
		
		ТекстJSON = API_СформироватьЗапрос(ДанныеЗапроса);

	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие;
	ЗаголовокHTTP.Вставить("Content-Type" , "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept"       , "application/vnd.github.v3+json");
	ЗаголовокHTTP.Вставить("cache-control", "no-cache");
	ЗаголовокHTTP.Вставить("Origin"       , "*");	
	ЗаголовокHTTP.Вставить("Authorization", "token " + ТокенGIT);
			
	Ответ = Новый Структура;
	Ответ.Вставить("Текст", "");
	
	Если ВерсияПлатформыНаСервере() >= 8340  Тогда
					
		HTTPЗапрос = Неопределено;		
		Выполнить("HTTPЗапрос = Новый HTTPЗапрос(КомандаЗапроса, ЗаголовокHTTP);");
		Если HTTPМетод = "POST" 
		     ИЛИ HTTPМетод = "PUT" Тогда
			HTTPЗапрос.УстановитьТелоИзСтроки(ТекстJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		КонецЕсли;
		
		Попытка
			СоединениеHTTP = "";
			Выполнить("СоединениеHTTP = Новый HTTPСоединение(Хост, Порт,,, ПроксиСервер,, Новый ЗащищенноеСоединениеOpenSSL());");			
			
		Исключение
			ТекстОшибки = "Не удалось установить соединение с сервером:" + Символы.ПС + ИнформацияОбОшибке().Описание;
			
			СтруктураОшибки.Вставить("ЕстьОшибка" , Истина); 
			СтруктураОшибки.Вставить("КодОшибки"  , "");
			СтруктураОшибки.Вставить("ТекстОшибки", ТекстОшибки);
			
			Возврат Неопределено;
			
		КонецПопытки;
		
		ИмяВыходногоФайла = "";
		Попытка
			
			Если HTTPМетод = "PUT" Тогда
				HTTPОтвет = СоединениеHTTP.Записать(HTTPЗапрос);			
				
			ИначеЕсли HTTPМетод = "POST" Тогда	
				HTTPОтвет = СоединениеHTTP.ОтправитьДляОбработки(HTTPЗапрос, ИмяВыходногоФайла);
				
			Иначе
				HTTPОтвет = СоединениеHTTP.Получить(HTTPЗапрос, ИмяВыходногоФайла);
			КонецЕсли;
			
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки();
			Сообщение.Сообщить();
			Возврат Неопределено;
		КонецПопытки;
		
		ОтветСтрока = ПреобразоватьЮникод(HTTPОтвет.ПолучитьТелоКакСтроку(), МассивЛогаСобытий);
		 
		 Если HTTPОтвет.КодСостояния > 299 Тогда
			 
			 ТекстОшибки = "Код состояния " + HTTPОтвет.КодСостояния + ". Запрос не отправлен. " + ОтветСтрока;
			 
			 СтруктураОшибки.Вставить("ЕстьОшибка" , Истина); 
			 СтруктураОшибки.Вставить("КодОшибки"  , "");
			 СтруктураОшибки.Вставить("ТекстОшибки", ТекстОшибки);
			 
			 Возврат Неопределено;
			 
		 ИначеЕсли НЕ ЗначениеЗаполнено(ОтветСтрока) Тогда
			 
			 ТекстОшибки = "Ошибка, результат пустой, " + HTTPОтвет.КодСостояния;
			 
			 СтруктураОшибки.Вставить("ЕстьОшибка" , Истина); 
			 СтруктураОшибки.Вставить("КодОшибки"  , "");
			 СтруктураОшибки.Вставить("ТекстОшибки", ТекстОшибки);
			 
			 Возврат Неопределено;
			 
		 Иначе
			 
			 Ответ = Новый Структура;
			 Ответ.Вставить("КодОтвета" , HTTPОтвет.КодСостояния);
			 Ответ.Вставить("exchangeid", "");
			 Ответ.Вставить("Текст"     , ОтветСтрока);			
			 Ответ.Вставить("XML"       , "");
			 Ответ.Вставить("XML_Текст" , ОтветСтрока);	
			 
		 КонецЕсли;
		
	Иначе
		
		АдресСервера = "https://" + АдресСервера;
		API = Новый COMОбъект("MSXML2.XMLHTTP");
		API.Open(HTTPМетод, АдресСервера + КомандаЗапроса, 0);
		Для Каждого Заголовок Из ЗаголовокHTTP Цикл
			API.setRequestHeader(Заголовок.Ключ, Заголовок.Значение);
		КонецЦикла;
				
		// Отправляем
		API.send(ТекстJSON);
		
		// Результат
		Ответ = Новый Структура;
		Ответ.Вставить("КодОтвета"        , API.Status);
		Ответ.Вставить("Текст"            , API.responseText);
		Ответ.Вставить("XML"              , API.responseXml);
		Ответ.Вставить("XML_Текст"        , API.responseXml.text);
		Ответ.Вставить("exchangeid"       , "");
		
		Если НЕ ЗначениеЗаполнено(Ответ.Текст) Тогда
			
			ТекстОшибки = "Ошибка, результат пустой, " + Ответ.КодОтвета;
			
			СтруктураОшибки.Вставить("ЕстьОшибка" , Истина); 
			СтруктураОшибки.Вставить("КодОшибки"  , "");
			СтруктураОшибки.Вставить("ТекстОшибки", ТекстОшибки);
			
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураОшибки.ЕстьОшибка = Истина Тогда
		МассивЛогаСобытий.Добавить(СтруктураОшибки.КодОшибки + " - " + СтруктураОшибки.ТекстОшибки);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтруктураОшибки.ТекстОшибки + " " + СтруктураОшибки.ТекстОшибки;
		Сообщение.Сообщить();
		
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ОбработатьОтвет(Ответ)
		
	Если ЭКОМ_ОбщегоНазначения.ВерсияПлатформыНаСервере() >= 8360  Тогда
		Соответствие = JSONПрочитать(Ответ);
	Иначе
		Соответствие = UnJSON(Ответ);
	КонецЕсли;
	
	Возврат	Соответствие;
	
КонецФункции

Функция ПреобразоватьЮникод(Строка, МассивЛогаСобытий)
	
	МасКир = Новый Массив(67);
	МасКод = Новый Массив(67);
	
	МасКир[0]="А";    МасКод[0]="0410";
	МасКир[1]="а";    МасКод[1]="0430";
	МасКир[2]="Б";    МасКод[2]="0411";
	МасКир[3]="б";    МасКод[3]="0431";
	МасКир[4]="В";    МасКод[4]="0412";
	МасКир[5]="в";    МасКод[5]="0432";
	МасКир[6]="Г";    МасКод[6]="0413";
	МасКир[7]="г";    МасКод[7]="0433";
	МасКир[8]="Д";    МасКод[8]="0414";
	МасКир[9]="д";    МасКод[9]="0434";
	МасКир[10]="Е";    МасКод[10]="0415";
	МасКир[11]="е";    МасКод[11]="0435";
	МасКир[12]="Ё";    МасКод[12]="0401";
	МасКир[13]="ё";    МасКод[13]="0451";
	МасКир[14]="Ж";    МасКод[14]="0416";
	МасКир[15]="ж";    МасКод[15]="0436";
	МасКир[16]="З";    МасКод[16]="0417";
	МасКир[17]="з";    МасКод[17]="0437";
	МасКир[18]="И";    МасКод[18]="0418";
	МасКир[19]="и";    МасКод[19]="0438";
	МасКир[20]="Й";    МасКод[20]="0419";
	МасКир[21]="й";    МасКод[21]="0439";
	МасКир[22]="К";    МасКод[22]="041a";
	МасКир[23]="к";    МасКод[23]="043a";
	МасКир[24]="Л";    МасКод[24]="041b";
	МасКир[25]="л";    МасКод[25]="043b";
	МасКир[26]="М";    МасКод[26]="041c";
	МасКир[27]="м";    МасКод[27]="043c";
	МасКир[28]="Н";    МасКод[28]="041d";
	МасКир[29]="н";    МасКод[29]="043d";
	МасКир[30]="О";    МасКод[30]="041e";
	МасКир[31]="о";    МасКод[31]="043e";
	МасКир[32]="П";    МасКод[32]="041f";
	МасКир[33]="п";    МасКод[33]="043f";
	МасКир[34]="Р";    МасКод[34]="0420";
	МасКир[35]="р";    МасКод[35]="0440";
	МасКир[36]="С";    МасКод[36]="0421";
	МасКир[37]="с";    МасКод[37]="0441";
	МасКир[38]="Т";    МасКод[38]="0422";
	МасКир[39]="т";    МасКод[39]="0442";
	МасКир[40]="У";    МасКод[40]="0423";
	МасКир[41]="у";    МасКод[41]="0443";
	МасКир[42]="Ф";    МасКод[42]="0424";
	МасКир[43]="ф";    МасКод[43]="0444";
	МасКир[44]="Х";    МасКод[44]="0425";
	МасКир[45]="х";    МасКод[45]="0445";
	МасКир[46]="Ц";    МасКод[46]="0426";
	МасКир[47]="ц";    МасКод[47]="0446";
	МасКир[48]="Ч";    МасКод[48]="0427";
	МасКир[49]="ч";    МасКод[49]="0447";
	МасКир[50]="Ш";    МасКод[50]="0428";
	МасКир[51]="ш";    МасКод[51]="0448";
	МасКир[52]="Щ";    МасКод[52]="0429";
	МасКир[53]="щ";    МасКод[53]="0449";
	МасКир[54]="Ъ";    МасКод[54]="042a";
	МасКир[55]="ъ";    МасКод[55]="044a";
	МасКир[56]="Ы";    МасКод[56]="042b";
	МасКир[57]="ы";    МасКод[57]="044b";
	МасКир[58]="Ь";    МасКод[58]="042c";
	МасКир[59]="ь";    МасКод[59]="044c";
	МасКир[60]="Э";    МасКод[60]="042d";
	МасКир[61]="э";    МасКод[61]="044d";
	МасКир[62]="Ю";    МасКод[62]="042e";
	МасКир[63]="ю";    МасКод[63]="044e";
	МасКир[64]="Я";    МасКод[64]="042f";
	МасКир[65]="я";    МасКод[65]="044f";
	МасКир[65]="№";    МасКод[65]="2116";
	МасКир[66]=Символы.НПП; МасКод[66]="00a0";
	
	ParsedString = Строка;
	Flag = 1;
	
	Пока (Flag = 1) Цикл
		
		PositionOfUnicodeStart = Найти(ParsedString, "\u");
				
		Если PositionOfUnicodeStart > 0 тогда
			UnicodeSymbol = Сред(ParsedString, PositionOfUnicodeStart +2, 4);    
			
			FullUnicodeSymbol = "\u" + UnicodeSymbol;
			
			Index = МасКод.Найти(UnicodeSymbol);
			Если Index = Неопределено тогда
				
				ПерекодированныйСимвол = Символ(Hex2Число(UnicodeSymbol));
				
				Если ЗначениеЗаполнено(ПерекодированныйСимвол) Тогда
					ParsedString = СтрЗаменить(ParsedString, FullUnicodeSymbol, ПерекодированныйСимвол);
				Иначе
					ParsedString = СтрЗаменить(ParsedString, FullUnicodeSymbol, "?UNICODE?");
					ТекстЛогаСобытий = "Найден неизвестный символ - " + FullUnicodeSymbol;
					ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, "Преобразование символа UNICODE");
					МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
				КонецЕсли;
				
			Иначе
				ParsedString = СтрЗаменить(ParsedString, FullUnicodeSymbol, МасКир[Index]);
			КонецЕсли;
			
		Иначе 
			Flag = 0;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ParsedString;    
КонецФункции

Функция JSONПрочитать(Значение)
	
	ЧтениеJSON = "";
	Выполнить("ЧтениеJSON = Новый ЧтениеJSON;");
	ЧтениеJSON.УстановитьСтроку(Значение);
	
	Результат = Неопределено;
	СформироватьДерево(ЧтениеJSON, Результат);
	
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

Функция UnJSON(СтрJSON)
	Перем Значение;
	Если ПолучитьЗначениеJSON(СтрJSON,Значение)=0 Тогда
		Возврат Значение
	КонецЕсли;
	Возврат Неопределено
КонецФункции

Функция Hex2Число(Hex) 
	
	Стр=ВРег(СокрЛП(Hex));
	Dec=0;
	Для Х=1 По СтрДлина(Стр) Цикл
		Dec=Dec+Найти("123456789ABCDEF",Сред(Стр,Х,1))*Pow(16,СтрДлина(Стр)-Х)
	КонецЦикла;
	
	Возврат Dec;
	
КонецФункции

Процедура СформироватьДерево(ЧтениеJSON, Дерево)
	
	Выполнить("ИмяСвойства = Неопределено;
	
	| Пока ЧтениеJSON.Прочитать() Цикл
	|     TипJSON = ЧтениеJSON.ТипТекущегоЗначения;
	|     
	|     Если TипJSON = ТипЗначенияJSON.НачалоОбъекта 
	|     ИЛИ TипJSON = ТипЗначенияJSON.НачалоМассива Тогда
	|         НовыйОбъект = ?(TипJSON = ТипЗначенияJSON.НачалоОбъекта, Новый Соответствие, Новый Массив);
	|         
	|         Если ТипЗнч(Дерево) = Тип(""Массив"") Тогда
	|             Дерево.Добавить(НовыйОбъект);
	|         ИначеЕсли ТипЗнч(Дерево) = Тип(""Соответствие"") И ЗначениеЗаполнено(ИмяСвойства) Тогда
	|             Дерево.Вставить(ИмяСвойства, НовыйОбъект);
	|         КонецЕсли;
	|         
	|         СформироватьДерево(ЧтениеJSON, НовыйОбъект);
	|         
	|         Если Дерево = Неопределено Тогда
	|             Дерево = НовыйОбъект;
	|         КонецЕсли;
	|     ИначеЕсли TипJSON = ТипЗначенияJSON.ИмяСвойства Тогда
	|         ИмяСвойства = ЧтениеJSON.ТекущееЗначение;
	|     ИначеЕсли TипJSON = ТипЗначенияJSON.Число 
	|     ИЛИ TипJSON = ТипЗначенияJSON.Строка 
	|     ИЛИ TипJSON = ТипЗначенияJSON.Булево 
	|     ИЛИ TипJSON = ТипЗначенияJSON.Null Тогда
	|         Если ТипЗнч(Дерево) = Тип(""Массив"") Тогда
	|             Дерево.Добавить(ЧтениеJSON.ТекущееЗначение);
	|         ИначеЕсли ТипЗнч(Дерево) = Тип(""Соответствие"") Тогда
	|             Дерево.Вставить(ИмяСвойства, ЧтениеJSON.ТекущееЗначение);
	|         КонецЕсли;
	|     Иначе
	|         Прервать;
	|     КонецЕсли;
	| КонецЦикла;");
	
КонецПроцедуры

Функция ПолучитьЗначениеJSON(СтрJSON,Значение,Позиция=1,Ключ="")
	Кавычка = "";
	
	ЗначениеВСтроке="";
	Кавычек=0;
	Комментарий=Ложь;
	Строка=Ложь;
	
	Пока Позиция<=СтрДлина(СтрJSON) Цикл
		ХХ=Сред(СтрJSON,Позиция,2);
		Х=Лев(ХХ,1);
		Позиция=Позиция+1;
		
		Если Х>" " ИЛИ Строка Тогда //Отсекаем всякий хлам
			
			Если Комментарий Тогда
				//Это комментарий. Крутимся в цикле пока не встретится конец комментария
				Если ХХ="*/" Тогда
					//Комментарий закончился
					Комментарий=Ложь;
					Позиция=Позиция+1;
				КонецЕсли;
				
			ИначеЕсли Х="\" Тогда
				Позиция=Позиция+1;
				ХХ=ВРег(ХХ);
				Если ХХ="\""" Тогда ЗначениеВСтроке=ЗначениеВСтроке+""""
				ИначеЕсли ХХ="\\" Тогда ЗначениеВСтроке=ЗначениеВСтроке+"\"
				ИначеЕсли ХХ="\/" Тогда ЗначениеВСтроке=ЗначениеВСтроке+"/"
				ИначеЕсли ХХ="\B" Тогда ЗначениеВСтроке=ЗначениеВСтроке+Символ(8)
				ИначеЕсли ХХ="\F" Тогда ЗначениеВСтроке=ЗначениеВСтроке+Символы.ПФ //перевод формы (страницы)
				ИначеЕсли ХХ="\N" Тогда ЗначениеВСтроке=ЗначениеВСтроке+Символы.ПС //перевод строки
				ИначеЕсли ХХ="\R" Тогда ЗначениеВСтроке=ЗначениеВСтроке+Символы.ВК //возврат каретки
				ИначеЕсли ХХ="\T" Тогда ЗначениеВСтроке=ЗначениеВСтроке+Символы.ВТаб //символ вертикальной табуляции
				ИначеЕсли ХХ="\U" Тогда
					ЗначениеВСтроке=ЗначениеВСтроке+Символ(Hex2Число(Сред(СтрJSON,Позиция,4))); //шестнадцатиричное число
					Позиция=Позиция+4
				КонецЕсли;
				
			ИначеЕсли Строка Тогда
				//Если строка не закончилась - то пропускаем управляющие символы
				Если Х=Кавычка Тогда
					//Закончилась строка
					Строка=Ложь;
					Кавычек=Кавычек+1;
				Иначе
					ЗначениеВСтроке=ЗначениеВСтроке+Х;
				КонецЕсли;
				
			ИначеЕсли ХХ="/*" Тогда
				//Начался комментарий
				Комментарий=Истина;
				Позиция=Позиция+1;
				
			ИначеЕсли Найти("""'{}[]:,",Х)>0 Тогда
				Если Х="""" ИЛИ Х="'" Тогда
					//Началась строка
					//Строка - коллекция нуля или больше символов Unicode, заключенная в
					//двойные кавычки, используя "\" в качестве символа экранирования.
					//Символ представляется как односимвольная строка.
					//Похожий синтаксис используется в C и Java.
					Строка=Истина;
					Кавычка=Х;
					Кавычек=Кавычек+1;
					
				ИначеЕсли Х="{" Тогда
					//Начался объект
					//Объект - неупорядоченный набор пар ключ/значение.
					//Объект начинается с "{" и заканчивается "}".
					//Каждое имя сопровождается ":", пары ключ/значение разделяются ",".
					Объект=Новый Соответствие;
					//Объект=Новый Структура;
					Пока Истина Цикл
						//Получим ключ и значение
						Ключ="";
						Режим=ПолучитьЗначениеJSON(СтрJSON,Значение,Позиция,Ключ);
						//0 - есть значение и не конец объекта (запятая)
						//1 - есть значение и конец объекта
						//2 - нет значения и не конец объекта (запятая)
						//3 - нет значения и конец объекта
						Если Режим=0 Тогда
							Объект.Вставить(Ключ,Значение);
						ИначеЕсли Режим=1 Тогда
							Объект.Вставить(Ключ,Значение);
							Прервать
						ИначеЕсли Режим=3 Тогда
							Прервать
						КонецЕсли;
					КонецЦикла;
					Значение=Объект;
					Возврат 0
					
				ИначеЕсли Х="[" Тогда
					//Начался массив
					//Массив - упорядоченная коллекция значений.
					//Массив начинается с "[" и заканчивается "]".
					//Значения разделены ",".
					Массив=Новый Массив;
					Пока Истина Цикл
						Режим=ПолучитьЗначениеJSON(СтрJSON,Значение,Позиция);
						//0 - есть значение и не конец массива (запятая)
						//1 - есть значение и конец массива
						//2 - нет значения и не конец массива (запятая)
						//3 - нет значения и конец массива
						Если Режим=0 Тогда
							Массив.Добавить(Значение);
						ИначеЕсли Режим=1 Тогда
							Массив.Добавить(Значение);
							Прервать
						ИначеЕсли Режим=3 Тогда
							Прервать
						КонецЕсли;
					КонецЦикла;
					Значение=Массив;
					Возврат 0
					
				ИначеЕсли Х="]" ИЛИ Х="}" Тогда
					//Закончился массив/объект
					Если ЗначениеВСтроке="" И Кавычек=0 Тогда
						Возврат 3 //нет значения и конец массива/объекта
					Иначе
						Значение=ПолучитьЗначениеИзСтроки(ЗначениеВСтроке,Кавычек);
						Возврат 1 //есть значение и конец массива/объекта
					КонецЕсли;
					
				ИначеЕсли Х=":" Тогда
					Ключ=ЗначениеВСтроке;
					Возврат ПолучитьЗначениеJSON(СтрJSON,Значение,Позиция);
					
				Иначе
					// запятая
					Прервать
				КонецЕсли;
				
			Иначе
				ЗначениеВСтроке=ЗначениеВСтроке+Х;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Кавычек>0 Тогда
		Значение=ЗначениеВКавычках(ЗначениеВСтроке);
	Иначе
		Если ЗначениеВСтроке="" Тогда
			Возврат 2
		Иначе
			Значение=ЗначениеБезКавычек(ЗначениеВСтроке)
		КонецЕсли;
	КонецЕсли;
	Возврат 0
КонецФункции

Функция ПолучитьЗначениеИзСтроки(ЗначениеВСтроке,Кавычек)
	Если Кавычек>0 Тогда
		Возврат ЗначениеВКавычках(ЗначениеВСтроке)
	ИначеЕсли ЗначениеВСтроке="" Тогда
		Возврат Неопределено
	КонецЕсли;
	Возврат ЗначениеБезКавычек(ЗначениеВСтроке)
КонецФункции

Функция ЗначениеВКавычках(ЗначениеВСтроке)
	//Это или строка или дата.
	//Дата пока не обрабатывается (потом надо дописать)
	//Пока всегда возвращаем просто строку
	Возврат ЗначениеВСтроке
КонецФункции

Функция ЗначениеБезКавычек(ЗначениеВСтроке)
	//Это число, булево или null.
	//Хотя здесь могут быть и строки. Например: {Code:123}
	Стр=ВРег(ЗначениеВСтроке);
	Если Стр="TRUE" Тогда Возврат Истина
	ИначеЕсли Стр="FALSE" Тогда Возврат Ложь
	ИначеЕсли Стр="NULL" Тогда Возврат Неопределено
	КонецЕсли;
	
	//Пробежимся по предполагаемому "числу"
	Экспонента=Ложь;
	ХХ=" ";
	Для Индекс=1 По СтрДлина(Стр) Цикл
		Х=Сред(Стр,Индекс,1);
		Если Найти("0123456789.+-",Х) Тогда
			ХХ=ХХ+Х
		ИначеЕсли Х="E" Тогда
			Экспонента=Истина;
			УУ=XMLЗначение(Тип("Число"),ХХ);
			ХХ=" ";
		Иначе
			Возврат ЗначениеВСтроке //Это точно не число, а строка
		КонецЕсли;
	КонецЦикла;
	
	ХХ=XMLЗначение(Тип("Число"),ХХ);
	Если Экспонента Тогда
		ХХ=УУ*Pow(10,ХХ)
	КонецЕсли;
	
	Возврат ХХ
КонецФункции

Функция ПолучитьКраткуюИнформацияОКонфигурации() Экспорт
	
	СокращеннаяВерсия = "";
	Версия = Эком_РазложитьСтрокуВМассивПодстрок(СокрЛП(Метаданные.Версия), ".");
	Если Версия.Количество() > 1 Тогда
	     СокращеннаяВерсия = СокрЛП(Версия[0]) + "." + СокрЛП(Версия[1]);		
	КонецЕсли;
	ИмяКонфигурацииСлитно = СокрЛП(Метаданные.Имя);
	
	СоответствиеКонфигурации = Новый Соответствие;
	СоответствиеКонфигурации.Вставить("УправлениеТорговлей"     , "УТ");
	СоответствиеКонфигурации.Вставить("БухгалтерияПредприятия"  , "БП");
	СоответствиеКонфигурации.Вставить("КомплекснаяАвтоматизация", "КА");
	СоответствиеКонфигурации.Вставить("УправлениеПроизводственнымПредприятием", "УПП");
	СоответствиеКонфигурации.Вставить("УправлениеПредприятием"                , "ERP");
	
	ТипКонфигурации = СокрЛП(СоответствиеКонфигурации.Получить(ИмяКонфигурацииСлитно)) + " " + СокращеннаяВерсия;
		 
	Возврат ТипКонфигурации;
	
КонецФункции

// Функция "расщепляет" строку на подстроки, используя заданный 
//		разделитель. Разделитель может иметь любую длину. 
//		Если в качестве разделителя задан пробел, рядом стоящие пробелы 
//		считаются одним разделителем, а ведущие и хвостовые пробелы параметра Стр
//		игнорируются.
//		Например, 
//		Эком_РазложитьСтрокуВМассивПодстрок(",строка 1,,,строка 2", ",") возвратит массив значений из пяти элементов, 
//		три из которых - пустые строки, а 
//		Эком_РазложитьСтрокуВМассивПодстрок(" строка1   строка 2", " ") возвратит массив значений из двух элементов
//
//	Параметры: 
//		Стр - 			строка, которую необходимо разложить на подстроки. 
//						Параметр передается по значению.
//		Разделитель - 	строка-разделитель, по умолчанию - запятая.
//
//
//	Возвращаемое значение:
//		массив значений, элементы которого - подстроки
//
Функция Эком_РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",", ДелатьСокрЛП = Истина, ПропускатьПустыеЗначения = Истина) Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока Истина Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				ТекущееЗначение = ?(ДелатьСокрЛП = Истина, СокрЛП(Стр), Стр);
				Если ЗначениеЗаполнено(ТекущееЗначение) ИЛИ ПропускатьПустыеЗначения = Ложь Тогда 
					МассивСтрок.Добавить(ТекущееЗначение);
				КонецЕсли;
				Возврат МассивСтрок;
			КонецЕсли;
			ТекущееЗначение = Лев(Стр,Поз-1);
			ТекущееЗначение = ?(ДелатьСокрЛП = Истина, СокрЛП(ТекущееЗначение), ТекущееЗначение);
			Если ЗначениеЗаполнено(ТекущееЗначение) ИЛИ ПропускатьПустыеЗначения = Ложь Тогда 
				МассивСтрок.Добавить(ТекущееЗначение);
			КонецЕсли;
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	ИначеЕсли Разделитель = "" Тогда
		Для Поз = 1 По СтрДлина(Стр) Цикл
			Если ЗначениеЗаполнено(ТекущееЗначение) ИЛИ ПропускатьПустыеЗначения = Ложь Тогда 
				МассивСтрок.Добавить(Сред(Стр, Поз, 1));
			КонецЕсли;
		КонецЦикла;
		Возврат МассивСтрок;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока Истина Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				ТекущееЗначение = ?(ДелатьСокрЛП = Истина, СокрЛП(Стр), Стр);
				Если ЗначениеЗаполнено(ТекущееЗначение) ИЛИ ПропускатьПустыеЗначения = Ложь Тогда 
					МассивСтрок.Добавить(ТекущееЗначение);
				КонецЕсли;
				Возврат МассивСтрок;
			КонецЕсли;
			ТекущееЗначение = Лев(Стр,Поз-1);
			ТекущееЗначение = ?(ДелатьСокрЛП = Истина, СокрЛП(ТекущееЗначение), ТекущееЗначение);
			Если ЗначениеЗаполнено(ТекущееЗначение) ИЛИ ПропускатьПустыеЗначения = Ложь Тогда 
				МассивСтрок.Добавить(ТекущееЗначение);
			КонецЕсли;
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	Результат = МассивСтрок;
КонецФункции

Функция ЭКОМ_ЕстьРоль(ИмяРоли, Пользователь) Экспорт

	ЭКОМ_РольУстановлена = Ложь;
	Если НЕ Метаданные.Справочники.Найти("ГруппыДоступа") = Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	1 
		|ИЗ
		|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
		|		ПО ГруппыДоступаПользователи.Ссылка.Профиль = ПрофилиГруппДоступаРоли.Ссылка
		|ГДЕ
		|	ПрофилиГруппДоступаРоли.Роль.Имя = &Роль
		|	И ГруппыДоступаПользователи.Пользователь = &Пользователь";
		
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		Запрос.УстановитьПараметр("Роль", ИмяРоли);
		
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		
		Если НЕ РезультатЗапроса.Пустой() Тогда		
			ЭКОМ_РольУстановлена = Истина;
		Иначе
			ЭКОМ_РольУстановлена = РольДоступна(ИмяРоли) ИЛИ РольДоступна("ПолныеПрава");
		КонецЕсли;
	Иначе	
		
		ЭКОМ_РольУстановлена = РольДоступна(ИмяРоли) ИЛИ РольДоступна("ПолныеПрава");  
		
	КонецЕсли;
	
	Возврат ЭКОМ_РольУстановлена;
	
КонецФункции

// Функция предназначена для преобразования номера документа.
//
// Параметры:
//  Документ - ДокументСсылка или Номер документа строкой.
//
// Возвращаемое значение.
//  Строка - номер документа для печати
//
Функция ЭКОМ_ПолучитьНомерНаПечать(Документ, Латинские=Ложь) Экспорт 
	
	Если Документ = Неопределено Тогда 
		Возврат "0";
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("Строка") Тогда
		
		НомерБезПрефиксовИНулей = Врег(СокрЛП(Документ)); 
		
		Буквы = Врег("абвгдеёжзийклмнопрстуфхцчшщъыьэюя-0");
		Пока Найти(Буквы, Лев(НомерБезПрефиксовИНулей, 1)) > 0 Цикл
			НомерБезПрефиксовИНулей = Сред(НомерБезПрефиксовИНулей, 2);	
		КонецЦикла;
		
		Если Латинские Тогда
			Буквы = Врег("qwertyuiopasdfghjklzxcvbnm-0");
			Пока Найти(Буквы, Лев(НомерБезПрефиксовИНулей, 1)) > 0 Цикл
				НомерБезПрефиксовИНулей = Сред(НомерБезПрефиксовИНулей, 2);	
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		
		Номер   = СокрЛП(Документ.Номер);
		Длина 	= СтрДлина(Номер);
		Цифры	= "0123456789";
		Результат = "";
		
		Для Индекс = 0 По Длина - 1 Цикл
			
			НомерСимвола 	= Длина - Индекс;
			Символ 			= Сред(Номер, НомерСимвола, 1);
			
			Если Найти(Цифры, Символ) = 0 Тогда
				Прервать;
			Иначе
				Результат = Символ + Результат;
			КонецЕсли;
			
		КонецЦикла;
		
		НомерБезПрефиксовИНулей  = Формат(Число(Результат), "ЧГ=0");
		
	КонецЕсли;
	
	Возврат НомерБезПрефиксовИНулей;
	
КонецФункции

// Функция преобразования телефона без знаков.
//
// Параметры:
//  Телефон - строка.
//
// Возвращаемое значение.
//  Строка - телефон
//
Функция ЭКОМ_ПолучитьТелефонНаПечать(Телефон) Экспорт 
	
	Если Телефон = Неопределено Тогда 
		Возврат "0";
	КонецЕсли;
	
	Телефон = СтрЗаменить(Телефон,"+","");
	Телефон = СтрЗаменить(Телефон,"-","");
	Телефон = СтрЗаменить(Телефон,"(","");
	Телефон = СтрЗаменить(Телефон,")","");
	Телефон = СтрЗаменить(Телефон,Символы.НПП,"");
	Если Лев(Телефон, 1) = "7" Тогда
		Телефон = Сред(Телефон, 2);	
	КонецЕсли;
	
	Возврат Телефон
	
КонецФункции

Функция ОпределитьИННОрганизации(Организация) Экспорт 
	
	ИмяТипаОрганизации  = Организация.Метаданные().Имя;
	Если НЕ ЗначениеЗаполнено(ИмяТипаОрганизации) Тогда
		ИмяТипаОрганизации = "Организации";
	КонецЕсли;
	МетаданныеОрганизацииИНН = Метаданные.Справочники[ИмяТипаОрганизации].Реквизиты.Найти("ИНН");
	
	ИННОрганизации = "";
	Если НЕ МетаданныеОрганизацииИНН = Неопределено Тогда
		ИННОрганизации = Организация.ИНН; 
	Иначе
		ИННОрганизации = НастройкиПрочитатьНаСервере("ЭКОМ_ИНН_Организации", "", "РеквизитДляОрганизации");
	КонецЕсли;
		
	Возврат ИННОрганизации;
	
КонецФункции

// Так как на клиенте ссылки не читаются передаем реквизиты в структуру
Функция ПолучитьДанныеСертификатаЭКОМ(СертификатЭКОМ) Экспорт
	
	ИННОрганизации = ОпределитьИННОрганизации(СертификатЭКОМ.Организация);
	
	Результат = Новый Структура;
	Результат.Вставить("Организация"               , СертификатЭКОМ.Организация);
	Результат.Вставить("ИНН"                       , ИННОрганизации);
	Результат.Вставить("СертификатЭКОМ"            , СертификатЭКОМ);
	Результат.Вставить("ДолжностьПодписанта"       , СертификатЭКОМ.ДолжностьПодписанта);
	Результат.Вставить("ФамилияПодписанта"         , СертификатЭКОМ.ФамилияПодписанта);
	Результат.Вставить("ИмяПодписанта"             , СертификатЭКОМ.ИмяПодписанта);
	Результат.Вставить("ОтчествоПодписанта"        , СертификатЭКОМ.ОтчествоПодписанта);
	Результат.Вставить("ОтпечатокСертификата"      , СертификатЭКОМ.ОтпечатокСертификата);
	Результат.Вставить("ИмяСертификата"            , СертификатЭКОМ.ИмяСертификата);
	Результат.Вставить("ПарольСертификата"         , СертификатЭКОМ.ПарольСертификата);
	Результат.Вставить("ОбластьПолномочий"         , СертификатЭКОМ.ОбластьПолномочий);
	Результат.Вставить("СтатусПодписанта"          , СертификатЭКОМ.СтатусПодписанта);
	Результат.Вставить("ОснованиеПолномочий"       , СертификатЭКОМ.ОснованиеПолномочий);
	Результат.Вставить("АлгоритмПодписи"           , СертификатЭКОМ.АлгоритмПодписи);
	Результат.Вставить("СведенияЕсть"              , Истина);
	Результат.Вставить("СертификатНаСервере"       , СертификатЭКОМ.СертификатНаСервере);
	Результат.Вставить("УстановленВЛичномХранилище", СертификатЭКОМ.УстановленВЛичномХранилище);
	
    Возврат Результат;
	
КонецФункции 

// Настройки хранятся в ЭКОМ_ЗначениеДополнительныхКонстант - функция получает соответствие настроек
// Имя - имя настройки
// опрЗначение - значение по умолчанию
// Измерение - может хранится в разрезе (организаций, пользователей)
Функция ПолучитьСписокНастроекНаСервере() Экспорт	
	
	Настройки 	= Новый Соответствие;
	Запрос 		= Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭКОМ_ЗначениеДополнительныхКонстант.ДополнительнаяКонстанта КАК ДополнительнаяКонстанта,
		|	ЭКОМ_ЗначениеДополнительныхКонстант.Измерение КАК Измерение,
		|	ЭКОМ_ЗначениеДополнительныхКонстант.ЗначениеДополнительногоХранилища,
		|	ЭКОМ_ЗначениеДополнительныхКонстант.ЗначениеДополнительнойКонстанты
		|ИЗ
		|	РегистрСведений.ЭКОМ_ЗначениеДополнительныхКонстант КАК ЭКОМ_ЗначениеДополнительныхКонстант
		|ГДЕ
		|	НЕ ЭКОМ_ЗначениеДополнительныхКонстант.Измерение = ""Номенклатура_""
		|	И НЕ ЭКОМ_ЗначениеДополнительныхКонстант.Измерение = ""Контрагент_""
		|	И НЕ ЭКОМ_ЗначениеДополнительныхКонстант.Измерение = ""ТочкаДоставки_""
		|	И НЕ ЭКОМ_ЗначениеДополнительныхКонстант.Измерение = ""Организация_""";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(Выборка.ЗначениеДополнительнойКонстанты) = Тип("Неопределено") Тогда
			Значение = Выборка.ЗначениеДополнительногоХранилища.Получить();
		Иначе	
			Значение = Выборка.ЗначениеДополнительнойКонстанты;
		КонецЕсли;

		Настройки.Вставить(Выборка.ДополнительнаяКонстанта + СокрЛП(Выборка.Измерение), Значение);
	КонецЦикла;

	Возврат Настройки;
	
КонецФункции

Функция ПолучитьЗначениеНастройкиНаСервере(Настройка, Имя, Измерение, ЗначениеПоУмолчанию) Экспорт	
	
	ЗначениеНастройки = Настройка.Получить(Имя + СокрЛП(Измерение));
	Если ЗначениеНастройки = Неопределено Тогда
	     ЗначениеНастройки = ЗначениеПоУмолчанию
	 КонецЕсли;
	 
	Возврат ЗначениеНастройки;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОТПРАВКА ДОКУМЕНТОВ

// Процедура вызывает отправку входящих документов
//
// Параметры:
//  Адрес  - Строка - адрес параметров во временном хранилище
//	АдресНаСервере - Строка - адрес недоступных на клиенте параметров во временном хранилище
//
Процедура ОтправкаДокументовПотоком(Обработка, СписокДляОтправки, ТипДокумента, МассивЛогаСобытий, ЭтоРегламентноеЗадание, СтруктураЛога) Экспорт
	
	КоличествоВПакете		       = 200;
	ЧислоПараллельныхПотоков       = 5;
	
	// Разбивка коллекции для отправки на пакеты по n документов.
	ПакетыФайлов = Новый Массив;
	Пакет        = Новый Массив;		
	Для каждого ЭлементСписка Из СписокДляОтправки Цикл
		
		// Больше в пакет не помещается
		Если Пакет.Количество() >= КоличествоВПакете Тогда 
			
			ПакетыФайлов.Добавить(Пакет);
			Пакет = Новый Массив;
		КонецЕсли;
		
		Пакет.Добавить(ЭлементСписка);
		
	КонецЦикла;
	
	// Если не добираем пакет 
	Если ПакетыФайлов.Найти(Пакет) = Неопределено Тогда
		ПакетыФайлов.Добавить(Пакет);
	КонецЕсли;
	
	// Отправка файлов (запуск фоновых заданий).
		
	// Массив, где будут храниться фоновые задания
	МассивФоновыхЗаданий = Новый Массив;
	
	Для каждого СтрокаПакет Из ПакетыФайлов Цикл
		
		УникальныйИдентификатор = Новый УникальныйИдентификатор;
		
		// Определяем массив параметров для процедуры		
		ПараметрыПотока = Новый Массив;
		ПараметрыПотока.Добавить(Обработка);
		ПараметрыПотока.Добавить(СтрокаПакет);
		ПараметрыПотока.Добавить(ТипДокумента);
		ПараметрыПотока.Добавить(МассивЛогаСобытий);
		ПараметрыПотока.Добавить(ЭтоРегламентноеЗадание);
		ПараметрыПотока.Добавить(СтруктураЛога);
		
		// Запуск фонового задания
		Задание = ФоновыеЗадания.Выполнить("ЭКОМ_ОбщегоНазначения.ВыполнитьПотокОтправкиДокументов", ПараметрыПотока, УникальныйИдентификатор, "Docrobot: Отправка документов");
		
		// Добавляем задание в массив, чтобы потом отследить выполнение
		МассивФоновыхЗаданий.Добавить(Задание);

		Если МассивФоновыхЗаданий.Количество() >= ЧислоПараллельныхПотоков Тогда
            Попытка
                ФоновыеЗадания.ОжидатьЗавершенияВыполнения(МассивФоновыхЗаданий);
			Исключение
				ЗаписьЖурналаРегистрации("Отправка документов потоком", УровеньЖурналаРегистрации.Ошибка, , , КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				
            КонецПопытки;
            МассивФоновыхЗаданий.Очистить();
		КонецЕсли;
			
	КонецЦикла;
	
	// Проверим результат выполнения фоновых заданий
	Если МассивФоновыхЗаданий.Количество() > 0 Тогда
		Попытка
			ФоновыеЗадания.ОжидатьЗавершенияВыполнения(МассивФоновыхЗаданий);
		Исключение
			ЗаписьЖурналаРегистрации("Отправка документов потоком", УровеньЖурналаРегистрации.Ошибка, , , КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));

		КонецПопытки;
		МассивФоновыхЗаданий.Очистить();
		 
	КонецЕсли;
	
КонецПроцедуры // ЗагрузитьВходящиеДокументы()

// Процедура запускает один поток для отправки файлов по заранее заданным именам
//
// Параметры:
//  ИменаФайлов  - Массив - коллекция имен файлов для загрузки
//  Логин  - Строка - имя пользователя для подключения по SOAP API
//  Пароль  - Строка - пароль пользователя для подключения по SOAP API
//
Процедура ВыполнитьПотокОтправкиДокументов(Обработка, Пакет, ТипДокумента, МассивЛогаСобытий, ЭтоРегламентноеЗадание, СтруктураЛога) Экспорт

	Обработка.ОтправитьФайлы(Пакет, ТипДокумента, МассивЛогаСобытий, ЭтоРегламентноеЗадание, СтруктураЛога);
	
КонецПроцедуры

Функция ОпределитьТипРаботыБазы() Экспорт
	СтрокаСоединенияСБД = СтрокаСоединенияИнформационнойБазы();
	// в зависимости от того файловый это вариант БД или нет,  по-разному отображается путь в БД 
	ПозицияПоиска = Найти(Врег(СтрокаСоединенияСБД), "FILE=");
	Если ПозицияПоиска = 1 тогда
		Возврат "Файловая";	
	Иначе 
		Возврат "Серверная";
	КонецЕсли; 
	
КонецФункции    

// Функция определяет версию режима совместимости конфигурации 
Функция ПолучитьРежимСовместимости() Экспорт
	
	ТекущаяВерсия = Строка(Метаданные.РежимСовместимости);
	ТекущаяВерсия = СтрЗаменить(ТекущаяВерсия, "Версия", "");
	ТекущаяВерсия = СтрЗаменить(ТекущаяВерсия, "_", ".");
	
	Версия  = "";
	Для н = 1  По 3 Цикл
		ПозицияТочки  = Найти(ТекущаяВерсия, ".");
		Символ        = Лев(ТекущаяВерсия , ПозицияТочки - 1);
		ТекущаяВерсия = Сред(ТекущаяВерсия, ПозицияТочки + 1);
		Версия        = Версия + Символ;
	КонецЦикла;
	
	Если СтрДлина(Версия) < 4 
		ИЛИ (Сред(Версия, 2, 1) = "3" И СтрДлина(Версия) = 4) Тогда
		Версия = Версия + "0";	
	КонецЕсли;
	
	Попытка
		ВерсияЧисло = ЭКОМ_ПреобразоватьВЧислоОбщегоНазначения(Версия);
	Исключение
		ВерсияЧисло  = 0;
	КонецПопытки;
	
	Возврат ВерсияЧисло;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПОДКЛЮЧЕНИЕ ПО API

Функция ПолучитьТокенАвторизации(ПрофильОбмена, Ошибка, МассивЛогаСобытий) Экспорт

	ИмяСобытия = "Получить токен авторизации";
	ТокенАвторизации = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(ПрофильОбмена) Тогда
		Возврат Неопределено; 
	КонецЕсли;
	
	Ошибка.Вставить("ЕстьОшибка" , Ложь); 
	Ошибка.Вставить("ТекстОшибки", "");
		
	// Токен не действителен. Получаем новый.
	Если ПустаяСтрока(СокрЛП(ПрофильОбмена.ИмяПользователяFTP)) Тогда
		ТекстЛогаСобытий = "В настройках программы не заполнен логин";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		
		Ошибка.ЕстьОшибка = Истина;
		Ошибка.ТекстОшибки = "Не заполнен логин";
		
	КонецЕсли;
	
	//Docrobot 29.11.2021 MOD-1361
	Если ПроверитьСтрануВПрофилеОбмена() Тогда
		Если ПустаяСтрока(СокрЛП(ПрофильОбмена.ПарольПользователяAPI)) Тогда
			ТекстЛогаСобытий = "В настройках программы не заполнен пароль";
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);	
		
			Ошибка.ЕстьОшибка = Истина;
			Ошибка.ТекстОшибки = ?(ПустаяСтрока(Ошибка.ТекстОшибки), "Не заполнен пароль", Ошибка.ТекстОшибки + "/пароль");
		
		КонецЕсли;
	КонецЕсли;
	//Docrobot 29.11.2021 MOD-1361
	
	Если Ошибка.ЕстьОшибка = Ложь Тогда
		ДанныеЗапроса = Новый Структура;
		ДанныеЗапроса.Вставить("varLogin"   , ПрофильОбмена.ИмяПользователяFTP);
		ДанныеЗапроса.Вставить("varPassword", ПрофильОбмена.ПарольПользователяAPI);
		
		ЗаголовокHTTP = Новый Соответствие;
		ЗаголовокHTTP.Вставить("Content-type", "application/json");
		ЗаголовокHTTP.Вставить("Accept"      , "application/json");	
		
		ПараметрыЗапроса = Новый Структура;
		ПараметрыЗапроса.Вставить("МетодHTTP"    , "POST");
		ПараметрыЗапроса.Вставить("ЗаголовокHTTP", ЗаголовокHTTP);
		
		//Выполняем запрос.
		Ответ = ВыполнитьЗапрос("/Api/V1/Edo/Index/Authorize", ПрофильОбмена, ДанныеЗапроса, ПараметрыЗапроса, Ошибка, МассивЛогаСобытий);		
		
		Если Ошибка.ЕстьОшибка Тогда
			ТекстЛогаСобытий = "Код: " + Ошибка.КодОшибки + " - " + Ошибка.ТекстОшибки;
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
					
		Иначе
			// Проверяем ответ.
			ТокенАвторизации = Сред(Ответ.Текст, 14, 26);
			
		КонецЕсли;
	
	КонецЕсли;
	   
	Возврат ТокенАвторизации;
	
КонецФункции // ПолучитьТокенАвторизации()

Функция ВыполнитьЗапрос(Команда, ПрофильОбмена, ДанныеЗапроса, ПараметрыЗапроса, Ошибка, МассивЛогаСобытий) Экспорт
	
	Если ЗначениеЗаполнено(ПрофильОбмена.СерверAPI) Тогда
		знСерверОбменаAPI = ПрофильОбмена.СерверAPI;
		
	Иначе	
		знСерверОбменаAPI = "api-service.e-vo.ru";	
	
	КонецЕсли;
	
	Если Найти(знСерверОбменаAPI, "." + ПрофильОбмена.Страна) = 0 Тогда
		
		Ошибка.Вставить("ЕстьОшибка" , Истина); 
		Ошибка.Вставить("КодОшибки"  , "");
		Ошибка.Вставить("ТекстОшибки", "В настройках профиля не верно выбрана страна.");
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	знСерверОбменаAPI = СтрЗаменить(знСерверОбменаAPI, "https://", "");
	знСерверОбменаAPI = СтрЗаменить(знСерверОбменаAPI, "http://" , "");
	
	Если НЕ ЗначениеЗаполнено(знСерверОбменаAPI) Тогда
		
		Ошибка.Вставить("ЕстьОшибка" , Истина); 
		Ошибка.Вставить("КодОшибки"  , "");
		Ошибка.Вставить("ТекстОшибки", "В настройках программы не заполнен адрес сервера");
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ЭКОМ_ИспользуетсяПрокси = НастройкиПрочитатьНаСервере("ЭКОМ_ИспользуетсяПрокси"      , Ложь);
	Если ЭКОМ_ИспользуетсяПрокси Тогда
		ЭКОМ_ИмяСервераПрокси         = НастройкиПрочитатьНаСервере("ЭКОМ_ИмяСервераПрокси"        , "");
		ЭКОМ_ИмяПользователяПрокси    = НастройкиПрочитатьНаСервере("ЭКОМ_ИмяПользователяПрокси"   , "");
		ЭКОМ_ПарольПользователяПрокси = НастройкиПрочитатьНаСервере("ЭКОМ_ПарольПользователяПрокси", "");
		
	Иначе
		ЭКОМ_ИмяСервераПрокси         = "";
		ЭКОМ_ИмяПользователяПрокси    = "";
		ЭКОМ_ПарольПользователяПрокси = "";
	КонецЕсли;
	
	ПроксиСервер = Новый ИнтернетПрокси;
	ПроксиСервер.Пользователь = ЭКОМ_ИмяПользователяПрокси;
	ПроксиСервер.Пароль       = ЭКОМ_ПарольПользователяПрокси;
	ПроксиСервер.Сервер(ЭКОМ_ИмяСервераПрокси);	
	
	ОтветСтрока = "";
	
	ТелоЗапроса	= API_СформироватьЗапрос(ДанныеЗапроса);
		
	Ответ = Новый Структура;	
	Если ВерсияПлатформыНаСервере() >= 8340  Тогда
		
		знИмяПользователяFTP    = ПрофильОбмена.ИмяПользователяFTP;
		знПарольПользователяFTP = ПрофильОбмена.ПарольПользователяFTP;
		
		Попытка
			Соединение = "";
			Выполнить("Соединение = Новый HTTPСоединение(знСерверОбменаAPI,443,знИмяПользователяFTP,знПарольПользователяFTP, ПроксиСервер, 0 ,Новый ЗащищенноеСоединениеOpenSSL(),Ложь);");
		Исключение
			ТекстОшибки = "Не удалось установить соединение с сервером:" + Символы.ПС + ИнформацияОбОшибке().Описание;
			
			Ошибка.Вставить("ЕстьОшибка" , Истина); 
			Ошибка.Вставить("КодОшибки"  , "");
			Ошибка.Вставить("ТекстОшибки", ТекстОшибки);
			
			Возврат Неопределено;
			
		КонецПопытки;
		
		Попытка
			
			// Заголовки
			ЗаголовокHTTP = ПараметрыЗапроса.ЗаголовокHTTP;
						
			HTTPЗапрос = "";
			Выполнить("HTTPЗапрос = Новый HTTPЗапрос(Команда, ЗаголовокHTTP);");
			Выполнить("HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);");
			
			Попытка
				ИмяВыходногоФайла = "";
				Результат   = Соединение.ОтправитьДляОбработки(HTTPЗапрос, ИмяВыходногоФайла);
				Соединение  = Неопределено;
				ОтветСтрока = ПреобразоватьЮникод(Результат.ПолучитьТелоКакСтроку("UTF-8"), МассивЛогаСобытий);
			Исключение
				
				ТекстОшибки = "Ошибка при отправке запроса: " + ОписаниеОшибки() + ИмяВыходногоФайла;
				
				Ошибка.Вставить("ЕстьОшибка" , Истина); 
				Ошибка.Вставить("КодОшибки"  , "");
				Ошибка.Вставить("ТекстОшибки", ТекстОшибки);
				
				Возврат Неопределено;
				
			КонецПопытки;
			
			Если Результат.КодСостояния > 299 Тогда
				
				ТекстОшибки = "Код состояния " + Результат.КодСостояния + ". Запрос не отправлен. " + ОтветСтрока;
				
				Ошибка.Вставить("ЕстьОшибка" , Истина); 
				Ошибка.Вставить("КодОшибки"  , "");
				Ошибка.Вставить("ТекстОшибки", ТекстОшибки);
				
				Возврат Неопределено;
				
			ИначеЕсли НЕ ЗначениеЗаполнено(ОтветСтрока) Тогда
				
				ТекстОшибки = "Ошибка, результат пустой, " + Результат.КодСостояния;
				
				Ошибка.Вставить("ЕстьОшибка" , Истина); 
				Ошибка.Вставить("КодОшибки"  , "");
				Ошибка.Вставить("ТекстОшибки", ТекстОшибки);
				
				Возврат Неопределено;
				
			Иначе
				
				Ответ = Новый Структура;
				Ответ.Вставить("КодОтвета" , Результат.КодСостояния);
				Ответ.Вставить("exchangeid", "");
				Ответ.Вставить("Текст"     , ОтветСтрока);			
				Ответ.Вставить("XML"       , "");
				Ответ.Вставить("XML_Текст" , ОтветСтрока);	
				
			КонецЕсли;
		Исключение
			
			ТекстОшибки = ИнформацияОбОшибке().Описание;
			
			Ошибка.Вставить("ЕстьОшибка" , Истина); 
			Ошибка.Вставить("КодОшибки"  , "");
			Ошибка.Вставить("ТекстОшибки", ТекстОшибки);
			
			Возврат Неопределено;
			
		КонецПопытки;
		
	Иначе
		
		знСерверОбменаAPI = "https://" + знСерверОбменаAPI;
		API = Новый COMОбъект("MSXML2.XMLHTTP");
		API.Open(ПараметрыЗапроса.МетодHTTP, знСерверОбменаAPI + Команда, 0);
		// Заголовки
		Для Каждого Заголовок Из ПараметрыЗапроса.ЗаголовокHTTP Цикл
			API.setRequestHeader(Заголовок.Ключ, Заголовок.Значение);
		КонецЦикла;
							
		// Отправляем
		API.send(ТелоЗапроса);
		
		// Результат
		Ответ = Новый Структура;
		Ответ.Вставить("КодОтвета"        , API.Status);
		Ответ.Вставить("Текст"            , API.responseText);
		Ответ.Вставить("XML"              , API.responseXml);
		Ответ.Вставить("XML_Текст"        , API.responseXml.text);
		Ответ.Вставить("exchangeid"       , "");
		
		Если НЕ ЗначениеЗаполнено(Ответ.Текст) Тогда
			
			ТекстОшибки = "Ошибка, результат пустой, " + Ответ.КодОтвета;
			
			Ошибка.Вставить("ЕстьОшибка" , Истина); 
			Ошибка.Вставить("КодОшибки"  , "");
			Ошибка.Вставить("ТекстОшибки", ТекстОшибки);
			
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
		
	СообщениеОбОшибке = ПроверкаРезультатовВыполнения(Ответ, МассивЛогаСобытий);
	
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		
		Ошибка.Вставить("ЕстьОшибка" , Истина); 
		Ошибка.Вставить("КодОшибки"  , Ответ.КодОтвета);
		Ошибка.Вставить("ТекстОшибки", СообщениеОбОшибке);
		
		Возврат Неопределено;
		
	КонецЕсли;
		
	Возврат Ответ;
	
КонецФункции

// Функция формирует запрос в формате JSON.
//
// Параметры:
//  ДанныеЗапроса  - Структура - данные для формирования запроса
//
// Возвращаемое значение:
//   Строка   - итоговый текст запроса
//
Функция API_СформироватьЗапрос(ДанныеЗапроса) Экспорт
	
	ТекстЗапроса = "";
	
	Для Каждого Данные Из ДанныеЗапроса Цикл
		
		ТекстЗапроса = ТекстЗапроса + ?(ПустаяСтрока(ТекстЗапроса), "{""", ", """) + Данные.Ключ + """: ";
		
		Если ТипЗнч(Данные.Значение) = Тип("Структура") Тогда
			ТекстЗапроса = ТекстЗапроса + "[" + API_СформироватьЗапрос(Данные.Значение) + "]";
		ИначеЕсли ТипЗнч(Данные.Значение) = Тип("Массив") Тогда
			Значение = "";
			н = 0;
			Для каждого ЭлМассива Из Данные.Значение Цикл
			    Значение = ?(Значение = "", "", Значение) + """" + ЭлМассива + ?(Данные.Значение[н] = Данные.Значение[Данные.Значение.Количество()-1], """", """, ");
				н = н + 1;
			КонецЦикла;
			ТекстЗапроса = ТекстЗапроса + "[" + Значение + "]";
		Иначе
			ТекстЗапроса = ТекстЗапроса + """" + Данные.Значение + """";
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "}";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Символы.ПС, "");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Символы.ВК, "");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ЭКОМ_ПреобразоватьВJSON(ДанныеЗапроса) Экспорт
	
	ТекстЗапроса = "";
	
	Для Каждого Данные Из ДанныеЗапроса Цикл
		
		ТекстЗапроса = ТекстЗапроса + ?(ПустаяСтрока(ТекстЗапроса), "{" + Символы.ПС + "  """, ", " + Символы.ПС + "  """) + Данные.Ключ + """: ";
		
		Если ТипЗнч(Данные.Значение) = Тип("Структура") Тогда
			ТекстЗапроса = ТекстЗапроса + "[" + API_СформироватьЗапрос(Данные.Значение) + "]";
		ИначеЕсли ТипЗнч(Данные.Значение) = Тип("Массив") Тогда
			Значение = "";
			н = 0;
			Для каждого ЭлМассива Из Данные.Значение Цикл
			    Значение = ?(Значение = "", "", Значение) + """" + ЭлМассива + ?(Данные.Значение[н] = Данные.Значение[Данные.Значение.Количество()-1], """", """, ");
				н = н + 1;
			КонецЦикла;
			ТекстЗапроса = ТекстЗапроса + "[" + Значение + "]";
		Иначе
			ТекстЗапроса = ТекстЗапроса + """" + Данные.Значение + """";
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + "}";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПроверкаРезультатовВыполнения(РезультатЗапроса, МассивЛогаСобытий)
	
	СообщениеОбОшибке     = "";
	ОбработанныйРезультат = Новый Структура;
	ЧтениеJSON            = "";	
	
	Если ВерсияПлатформыНаСервере() >= 8360 Тогда
		Выполнить("ЧтениеJSON = Новый ЧтениеJSON;");		
		ЧтениеJSON.УстановитьСтроку(РезультатЗапроса.Текст);
		Выполнить("ОбработанныйРезультат = ПрочитатьJSON(ЧтениеJSON);");
	Иначе 
		ОбработанныйРезультат = ЗаполнитьСтруктуруИзОтветаJSON(РезультатЗапроса.Текст, МассивЛогаСобытий);
	КонецЕсли; 
	
	Если РезультатЗапроса.КодОтвета = 200 
		ИЛИ РезультатЗапроса.КодОтвета = 201 Тогда
		
		РезультатЗапроса.exchangeid = ?(ОбработанныйРезультат.Свойство("exchangeid"), 	ОбработанныйРезультат.exchangeid,	РезультатЗапроса.exchangeid);
		
		Если ОбработанныйРезультат.Свойство("timeline") Тогда
			РезультатЗапроса.Вставить("timeline", ОбработанныйРезультат.timeline);
		КонецЕсли;
		
		Если ОбработанныйРезультат.Свойство("document") Тогда
			РезультатЗапроса.Вставить("document", ОбработанныйРезультат.document);
		КонецЕсли;
		
		Если ОбработанныйРезультат.Свойство("body") Тогда
			РезультатЗапроса.Вставить("body", Base64Значение(ОбработанныйРезультат.body));
		КонецЕсли;
		
		Если ОбработанныйРезультат.Свойство("sign")
			И НЕ ОбработанныйРезультат.sign.Количество() = 0 Тогда
			
			РезультатЗапроса.Вставить("sign", ОбработанныйРезультат.sign);
			
		КонецЕсли;
		
		Если ОбработанныйРезультат.Свойство("content") Тогда
			РезультатЗапроса.Вставить("content", Base64Значение(ОбработанныйРезультат.content));
		КонецЕсли;
		
		Если ОбработанныйРезультат.Свойство("intCode") Тогда
			РезультатЗапроса.Вставить("intCode", Base64Значение(ОбработанныйРезультат.intCode));
		КонецЕсли;
		
		Если ОбработанныйРезультат.Свойство("varMessage") Тогда
			РезультатЗапроса.Вставить("varMessage", Base64Значение(ОбработанныйРезультат.varMessage));
		КонецЕсли;
		
	ИначеЕсли РезультатЗапроса.КодОтвета = 400 Тогда
		
		СообщениеОбОшибке = "Ошибка в запросе";
		
	ИначеЕсли РезультатЗапроса.КодОтвета = 401 Тогда	
		
		СообщениеОбОшибке = "Не достаточно прав!";
		
	ИначеЕсли РезультатЗапроса.КодОтвета = 404 Тогда	
		
		СообщениеОбОшибке ="Объект не найден";
		
	ИначеЕсли РезультатЗапроса.КодОтвета = 503 Тогда	
		
		СообщениеОбОшибке = "Сервер не доступен";	
		
	Иначе
		
		СообщениеОбОшибке = "Ошибка API!";
		
	КонецЕсли;
	
	Возврат СообщениеОбОшибке;
	
КонецФункции

Функция ЗаполнитьСтруктуруИзОтветаJSON(Знач ТекстJSON, МассивЛогаСобытий) Экспорт
	
	Возврат ОбработатьОтвет(ТекстJSON);
	
КонецФункции

Функция ДатьОписаниеОшибкиПоТекстуОшибки(ТекстОшибки) Экспорт
	Если Найти(ТекстОшибки, "is not retailer gln") > 0 Тогда
		Результат = "Этот GLN не принадлежит розничной сети (ретейлеру)";
	ИначеЕсли Найти(ТекстОшибки, "error during archiving - File not found or can't be archived") > 0 Тогда
		Результат = "Ошибка помещения в архив: Файл не найден на сервере в Inbox (возможно он уже был помещен в архив ранее)";
	ИначеЕсли Найти(ТекстОшибки, "{(1)}: Ошибка при вызове конструктора (FTPСоединение): ") > 0 Тогда
		Результат = "Проблема с подключением к FTP: " + СтрЗаменить(ТекстОшибки, "{(1)}: Ошибка при вызове конструктора (FTPСоединение): ", "");
	Иначе
		Результат = ТекстОшибки;
	КонецЕсли;
	Возврат Результат;
КонецФункции 

////////////////////////////////////////////////////////////////////////////////
// ПОДКЛЮЧЕНИЕ ПО SOAP
 
Функция НовыйSOAPОбращение(ПрофильОбмена, ИмяМетода, ИменаФайлов = Неопределено, ДанныеФайла = Неопределено, МассивЛогаСобытий) Экспорт
		
	НастройкиSOAP = Новый Структура;
	НастройкиSOAP.Вставить("ПространствоИменSOAP", "http://schemas.xmlsoap.org/soap/envelope/");
	
	// Определяем страну для подключения
	Если ПрофильОбмена.Страна = "kz" Тогда		
		ХостWebСервиса      = "soap.e-vo.kz/soap";
		URIПространстваИмен = "http://soap.edi.exite.org/";
		
		Если ИмяМетода = "getListRequest" Тогда
			ИмяМетода = "getList";
			
		ИначеЕсли ИмяМетода = "getDocumentsRequest" Тогда
			ИмяМетода = "getDoc";
			
	    ИначеЕсли ИмяМетода = "sendDocumentsRequest" Тогда		
			ИмяМетода = "sendDoc";
			
		ИначеЕсли ИмяМетода = "archiveDocumentsRequest" Тогда		
			ИмяМетода = "archiveDoc";

		КонецЕсли; 
			
	Иначе
		ХостWebСервиса      = "soap-api.e-vo.ru";
		URIПространстваИмен = "http://soap.edi.exite.org";
		
	КонецЕсли;
	
	НастройкиSOAP.Вставить("ХостWebСервиса"     , ХостWebСервиса);
	НастройкиSOAP.Вставить("ПространствоИменEDI", URIПространстваИмен);
		
	XML       = СформироватьЗапросSOAP(НастройкиSOAP, ПрофильОбмена, ИмяМетода, ИменаФайлов, ДанныеФайла);
	HTTPОтвет = ОтправитьЗапросSOAP(НастройкиSOAP, ПрофильОбмена, ИмяМетода, XML, МассивЛогаСобытий);
	Результат = ОбработатьРезультатЗапросаSOAP(ИмяМетода, HTTPОтвет);
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьЗапросSOAP(НастройкиSOAP, ПрофильОбмена, ИмяМетода, ИменаФайлов = Неопределено, ДанныеФайла = Неопределено)
	
	ЗаписьXML = Новый ЗаписьXML;
	
	ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("UTF-8");
	ЗаписьXML.УстановитьСтроку(ПараметрыЗаписиXML);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("soapenv:Envelope");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("soapenv", НастройкиSOAP.ПространствоИменSOAP);
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("soap"   , НастройкиSOAP.ПространствоИменEDI);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("soapenv:Header");
	ЗаписьXML.ЗаписатьКонецЭлемента(); // soapenv:Header
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("soapenv:Body");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("soap:" + ИмяМетода); // + "Request");
	ЗаписьXML.ЗаписатьНачалоЭлемента("user");
	ЗаписатьXML(ЗаписьXML, ПрофильОбмена.ИмяПользователяFTP, "login");
	
	Если ВерсияПлатформыНаСервере() < 8310 Тогда 
		
		ПарольХеш 		= MD5(ПрофильОбмена.ПарольПользователяFTP);
		ПарольХешMD5 	= СтрЗаменить(НРег(ПарольХеш), " ", "");
		
	Иначе // ХешированиеДанных доступна с версии платформы 8.3.1
		
		ПарольХеш		= Неопределено;
		Выполнить("ПарольХеш = Новый ХешированиеДанных(ХешФункция.MD5)");
		ПарольХеш.Добавить(ПрофильОбмена.ПарольПользователяFTP);
		ПарольХешMD5 	= СтрЗаменить(НРег(ПарольХеш.ХешСумма), " ", "");
		
	КонецЕсли;
	
	ЗаписатьXML(ЗаписьXML, ПарольХешMD5, "pass");
	ЗаписьXML.ЗаписатьКонецЭлемента(); // user
	
	Если НЕ ИменаФайлов = Неопределено Тогда
		
		Для Каждого ЭлИмяФайла Из ИменаФайлов Цикл
			Если ЗначениеЗаполнено(ЭлИмяФайла) Тогда
			     ЗаписатьXML(ЗаписьXML, ЭлИмяФайла, "fileName");
			КонецЕсли;		
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ ДанныеФайла = Неопределено Тогда
		ЗаписатьXML(ЗаписьXML, Base64Строка(ДанныеФайла), "content");
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // soap:_Request
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // soapenv:Body
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // soapenv:Envelope
	
	XML = ЗаписьXML.Закрыть();
	
	Возврат XML;
	
КонецФункции 

Функция ОтправитьЗапросSOAP(НастройкиSOAP, ПрофильОбмена, ИмяМетода, XML, МассивЛогаСобытий)
	
	ИмяСобытия = "Отправка по SOAP";
	Ответ      = Неопределено;
	
	ЭКОМ_ИспользуетсяПрокси = НастройкиПрочитатьНаСервере("ЭКОМ_ИспользуетсяПрокси"      , Ложь);
	Если ЭКОМ_ИспользуетсяПрокси Тогда
		ЭКОМ_ИмяСервераПрокси         = НастройкиПрочитатьНаСервере("ЭКОМ_ИмяСервераПрокси"        , "");
		ЭКОМ_ИмяПользователяПрокси    = НастройкиПрочитатьНаСервере("ЭКОМ_ИмяПользователяПрокси"   , "");
		ЭКОМ_ПарольПользователяПрокси = НастройкиПрочитатьНаСервере("ЭКОМ_ПарольПользователяПрокси", "");
		
	Иначе
		ЭКОМ_ИмяСервераПрокси         = "";
		ЭКОМ_ИмяПользователяПрокси    = "";
		ЭКОМ_ПарольПользователяПрокси = "";
	КонецЕсли;
	
	ПроксиСервер = Новый ИнтернетПрокси;
	ПроксиСервер.Пользователь = ЭКОМ_ИмяПользователяПрокси;
	ПроксиСервер.Пароль       = ЭКОМ_ПарольПользователяПрокси;
	ПроксиСервер.Сервер(ЭКОМ_ИмяСервераПрокси);	
	
	Если ВерсияПлатформыНаСервере() >= 8340  Тогда
		
		знИмяПользователяFTP    = ПрофильОбмена.ИмяПользователяFTP;
		знПарольПользователяFTP = ПрофильОбмена.ПарольПользователяFTP;
		
		Соединение = Неопределено;
		Попытка
			Выполнить("Соединение = Новый HTTPСоединение(НастройкиSOAP.ХостWebСервиса,443,знИмяПользователяFTP,знПарольПользователяFTP, ПроксиСервер, 0, Новый ЗащищенноеСоединениеOpenSSL(),Ложь);");
		Исключение
			ТекстЛогаСобытий = "Не удалось установить соединение с сервером:" 
			+ Символы.ПС + ИнформацияОбОшибке().Описание;
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
			
			Возврат Неопределено;
		КонецПопытки;
		
		Попытка
			
			ЗаголовокHTTP = Новый Соответствие;
			ЗаголовокHTTP.Вставить("Content-type", "text/xml; charset=UTF-8");
			ЗаголовокHTTP.Вставить("SOAPAction", НастройкиSOAP.ПространствоИменEDI + "/" + ИмяМетода + "/Request");
			
			HTTPЗапрос = "";
			Выполнить("HTTPЗапрос = Новый HTTPЗапрос(""/soap"", ЗаголовокHTTP);");
			Выполнить("HTTPЗапрос.УстановитьТелоИзСтроки(XML, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);");
			
			ИмяВыходногоФайла = "";
			Попытка		
				Результат  = Соединение.ОтправитьДляОбработки(HTTPЗапрос, ИмяВыходногоФайла);
				Соединение = Неопределено;
				Ответ      = Результат.ПолучитьТелоКакСтроку("UTF-8");
			Исключение
				ТекстЛогаСобытий = XML + Символы.ПС + "Ошибка при отправке запроса: " + ОписаниеОшибки() + ИмяВыходногоФайла;
				ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
				МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
				
				Возврат Неопределено;
			КонецПопытки;
			
			Если Результат.КодСостояния > 299 Тогда
				ТекстЛогаСобытий = "Код состояния " + Результат.КодСостояния + ". Запрос не отправлен.";
				ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
				МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

				Возврат Неопределено;
			Иначе
				ОтветСтруктура = Новый Структура;
				ОтветСтруктура.Вставить("status", Результат.КодСостояния);
				ОтветСтруктура.Вставить("responseText", Ответ);
				Возврат ОтветСтруктура;			
			КонецЕсли;
		Исключение
			ТекстЛогаСобытий = ОписаниеОшибки();
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
					
			Возврат Ответ;
		КонецПопытки;
		
	Иначе
		
		Ответ = Новый COMОбъект("MSXML2.ServerXMLHTTP.6.0"); 	//MSXML2.xmlHttp
		Ответ.setTimeouts(10*1000, 10*1000, 20*1000, 180*1000); //resolveTimeout, connectTimeout, sendTimeout, receiveTimeout
		
		Ответ.setOption(2, 13056);
		
		Ответ.OPEN("POST", НастройкиSOAP.ХостWebСервиса, 0);
		
		Ответ.setRequestHeader("Content-type", "text/xml");
		Ответ.setRequestHeader("SOAPAction",   НастройкиSOAP.ПространствоИменEDI + "/" + ИмяМетода + "/" + "Request");
		Ответ.setRequestHeader("Host",         НастройкиSOAP.ХостWebСервиса);
		
		Попытка
			Ответ.SEND(XML);
		Исключение
			ТекстЛогаСобытий = ОписаниеОшибки();
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
			
			Возврат Неопределено;
		КонецПопытки;
		
		Возврат Ответ;
		
	КонецЕсли;
	
КонецФункции // ОтправитьЗапросSOAP()

// Функция разбирает ответ от web-сервиса после выполнения запроса
//
// Параметры
//  ИмяМетода	- Строка - метод web-сервиса, который будет исполнен в текущем запросе
//  Ответ		- экземпляр объекта, сформированный в результате выполнения запроса
//
// Возвращаемое значение:
//   Строка   	- ответ по результатам выполнения заполса к web-сервису.
//					При ошибке выполнения возвращает значение Неопределено
//
Функция ОбработатьРезультатЗапросаSOAP(ИмяМетода, Ответ)
	
	Результат 	= Новый Структура("errorCode, errorMessage, list, content", "", "", Новый Массив, Новый Массив);
	
	Если Ответ = Неопределено Тогда
		Результат.errorCode = "";
		Возврат Результат;
	КонецЕсли;
	
	ОтветXML 	= ?(Ответ.status = 200, Ответ.responseText, Неопределено);
	
	Если ОтветXML <> Неопределено Тогда
		
		ОтветДерево = СтрокаXMLВДеревоЗначений(ОтветXML);
		Result 		= Неопределено;
		
		ПолучитьЗначениеСтрокиДерева(ОтветДерево, "result", Result);
		
		Если НЕ Result = Неопределено 
			И НЕ Result.строки.Количество() = 0 Тогда
			
			Для Каждого Строка Из Result.строки Цикл
				
				Если ТипЗнч(Результат[Строка.Имя]) = Тип("Строка") Тогда
					Результат[Строка.Имя] = Строка.Значение;
				ИначеЕсли ТипЗнч(Результат[Строка.Имя]) = Тип("Массив") Тогда
					Результат[Строка.Имя].Добавить(Строка.Значение);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ОбработатьРезультатЗапросаSOAP()

Функция MD5(Знач Строка) Экспорт

	Попытка
		
		// Вычисление хэш-суммы.
		UTF8Encoding = Новый COMОбъект("System.Text.UTF8Encoding");
		MD5CryptoServiceProvider = Новый COMОбъект("System.Security.Cryptography.MD5CryptoServiceProvider");
		МассивБайтов = MD5CryptoServiceProvider.ComputeHash_2(UTF8Encoding.GetBytes_4(Строка));
		
		// Преобразование хэш-суммы в строку.
		StringBuilder = Новый COMОбъект("System.Text.StringBuilder");
		Для Каждого Элемент Из МассивБайтов Цикл
			StringBuilder.AppendFormat("{0:x2}", Элемент);
		КонецЦикла;
		
		Возврат StringBuilder.ToString();
		
	Исключение
	КонецПопытки;

КонецФункции // ВычислитьХешСтрокиПоАлгоритмуMD5()

Функция СтрокаXMLВДеревоЗначений(XMLСтрока)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(XMLСтрока);
	ЧтениеXML.Прочитать();
	РезультатДерево = Новый ДеревоЗначений;
	РезультатДерево.Колонки.Добавить("Имя");
	РезультатДерево.Колонки.Добавить("Значение");
	МассивОткрытыхСтрок = Новый Массив;
	ПоследняяОткрытаяСтрока = Неопределено;
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Если МассивОткрытыхСтрок.Количество() Тогда
				_Родитель = МассивОткрытыхСтрок[МассивОткрытыхСтрок.Количество()-1];
			Иначе
				_Родитель = РезультатДерево;
			КонецЕсли;
			
			ПоследняяОткрытаяСтрока = _Родитель.Строки.Добавить();
			ПоследняяОткрытаяСтрока.Имя = ЧтениеXML.Имя;
			МассивОткрытыхСтрок.Добавить(ПоследняяОткрытаяСтрока);
			
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			
			ПоследняяОткрытаяСтрока.Значение = ЧтениеXML.Значение;
			
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
			Если МассивОткрытыхСтрок.Количество() Тогда
				
				МассивОткрытыхСтрок.Удалить(МассивОткрытыхСтрок.Количество()-1);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатДерево;
	
КонецФункции // СтрокаXMLВДеревоЗначений()

Процедура ПолучитьЗначениеСтрокиДерева(ДеревоЗначений, ИмяСтроки, Результат)
	
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		
		Если Строка.Имя = ИмяСтроки Тогда
			Результат = Строка;
		Иначе
			ПолучитьЗначениеСтрокиДерева(Строка, ИмяСтроки, Результат);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
// ПОДКЛЮЧЕНИЕ ПО WS

Функция WS_ПодключениеПоСсылкиWS(ПрофильОбмена)
	
	СтруктураДанных = Новый Структура;
	
	Если ЗначениеЗаполнено(ПрофильОбмена.СерверAPI) Тогда
		ЭКОМ_СерверОбменаAPI = ПрофильОбмена.СерверAPI;
		
	Иначе	
		ЭКОМ_СерверОбменаAPI = "api-service.e-vo.ru";	
	
	КонецЕсли;

	// Определяем страну для подключения
	Если ПрофильОбмена.Страна = "kz" Тогда
		
		URIПространстваИмен = "http://soap.edi.exite.org/";
		Если НЕ Метаданные.WSСсылки.Найти("ExiteWsServiceKZ") = Неопределено Тогда
			ПроксиWS = WSСсылки.ExiteWsServiceKZ.СоздатьWSПрокси(URIПространстваИмен, "EdiServerImplService", "EdiServerImplPort");
		Иначе
			ОпределениеWS = Новый WSОпределения("https://soap.e-vo.kz/soap/?wsdl", "", "");
			ПроксиWS = Новый WSПрокси(ОпределениеWS, URIПространстваИмен, "EdiServerImplService", "EdiServerImplPort");		
		КонецЕсли;
		
	Иначе
		
		URIПространстваИмен = "http://soap.edi.exite.org";
		Если НЕ Метаданные.WSСсылки.Найти("ExiteWsServiceRU") = Неопределено Тогда
			ПроксиWS = WSСсылки.ExiteWsServiceRU.СоздатьWSПрокси(URIПространстваИмен, "ExiteWsService", "ExiteWsSoap11");
		Иначе
			ОпределениеWS = Новый WSОпределения("https://soap-api.e-vo.ru/soap/exite.wsdl", "", "");
			ПроксиWS = Новый WSПрокси(ОпределениеWS, URIПространстваИмен, "ExiteWsService", "ExiteWsSoap11");		
		КонецЕсли;
		
	КонецЕсли;
	
	// Авторизация
	Если ВерсияПлатформыНаСервере() < 8310 Тогда 
		
		ПарольХеш 		= MD5(ПрофильОбмена.ПарольПользователяFTP);
		ПарольХешMD5 	= СтрЗаменить(НРег(ПарольХеш), " ", "");
		
	Иначе // ХешированиеДанных доступна с версии платформы 8.3.1
		
		ПарольХеш		= Неопределено;
		Выполнить("ПарольХеш = Новый ХешированиеДанных(ХешФункция.MD5)");
		ПарольХеш.Добавить(ПрофильОбмена.ПарольПользователяFTP);
		ПарольХешMD5 	= СтрЗаменить(НРег(ПарольХеш.ХешСумма), " ", "");
		
	КонецЕсли;
	
	ТипПользователя    = ПроксиWS.ФабрикаXDTO.Тип(URIПространстваИмен, "ediLogin"); 
	Пользователь	   = ПроксиWS.ФабрикаXDTO.Создать(ТипПользователя);
	Пользователь.login = ПрофильОбмена.ИмяПользователяFTP;
	Пользователь.pass  = ПарольХешMD5;	
	
	СтруктураДанных.Вставить("СсылкаWS"    , ПроксиWS);
	СтруктураДанных.Вставить("Пользователь", Пользователь);
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция WS_ПолучитьСписокДокументов_getList(ПрофильОбмена) Экспорт
	
	СтруктураДанных = WS_ПодключениеПоСсылкиWS(ПрофильОбмена);
	Если СтруктураДанных.Свойство("СсылкаWS") = Истина Тогда
		ПроксиWS = СтруктураДанных.ПроксиWS;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	//Вызываем метод веб-сервиса, записываем результат в переменную .
	СписокДокументов = ПроксиWS.getList(СтруктураДанных.Пользователь);
	
	Возврат СписокДокументов;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПОДКЛЮЧЕНИЕ ПО FTP

Функция ПолучитьFTPСоединение(ПараметрыОбъекта, ТипОбменаЭТРН, МассивЛогаСобытий) Экспорт
	
	знИспользуетсяПрокси       = НастройкиПрочитатьНаСервере("ЭКОМ_ИспользуетсяПрокси", Ложь);
	знИмяПользователяПрокси    = НастройкиПрочитатьНаСервере("ЭКОМ_ИмяПользователяПрокси", "");
	знПарольПользователяПрокси = НастройкиПрочитатьНаСервере("ЭКОМ_ПарольПользователяПрокси", "");
	знПорт                     = ПараметрыОбъекта.Порт;
	
	Если ТипОбменаЭТРН Тогда
		знИмяПользователяFTP       = ПараметрыОбъекта.ЭТРН_ИмяПользователя;
		знПарольПользователяFTP    = ПараметрыОбъекта.ЭТРН_ПарольПользователя;
		знСерверОбмена             = ПараметрыОбъекта.ЭТРН_Сервер;

	Иначе	
		знИмяПользователяFTP       = ПараметрыОбъекта.ИмяПользователяFTP;
		знПарольПользователяFTP    = ПараметрыОбъекта.ПарольПользователяFTP;
		знСерверОбмена             = ПараметрыОбъекта.СерверFTP;
		
	КонецЕсли;
	   		
	ПараметрыFTP = Новый Структура;
	ПараметрыFTP.Вставить("Сервер"                       , знСерверОбмена);
	ПараметрыFTP.Вставить("Порт"                         , знПорт);
	ПараметрыFTP.Вставить("ИмяПользователя"              , знИмяПользователяFTP);
	ПараметрыFTP.Вставить("ПарольПользователя"           , знПарольПользователяFTP);
	ПараметрыFTP.Вставить("ПассивноеСоединение"          , Истина);
	ПараметрыFTP.Вставить("Таймаут"                      , 0);
	ПараметрыFTP.Вставить("ЗащищенноеСоединение"         , Неопределено);
	ПараметрыFTP.Вставить("УровеньИспользованияЗащитыFTP", УровеньИспользованияЗащищенногоСоединенияFTP.Авто);
	ПараметрыFTP.Вставить("ИспользуетсяПрокси"           , знИспользуетсяПрокси);
	ПараметрыFTP.Вставить("ИмяПользователяПрокси"        , знИмяПользователяПрокси);
	ПараметрыFTP.Вставить("ПарольПользователяПрокси"     , знПарольПользователяПрокси);
	
	СерверFTP = ПолучитьСерверFTPОбщийМодуль(ПараметрыFTP, МассивЛогаСобытий);
	
	Возврат СерверFTP;
	
КонецФункции

Функция ПолучитьСерверFTPОбщийМодуль(ПараметрыFTP, МассивЛогаСобытий) Экспорт
	
	ИмяСобытия = "Получение сервера FTP, модуль общего назначения";
	СерверFTP    = Неопределено;
	ПроксиСервер = Новый ИнтернетПрокси();	     			
	Если ПараметрыFTP.ИспользуетсяПрокси = Истина Тогда	
		ПроксиСервер.Пользователь = СокрЛП(ПараметрыFTP.ИмяПользователяПрокси);
		ПроксиСервер.Пароль       = СокрЛП(ПараметрыFTP.ПарольПользователяПрокси);
		ПараметрыFTP.Вставить("Прокси", ПроксиСервер);
	КонецЕсли;
	
	знПорт = ?(ТипЗнч(ПараметрыFTP.Порт) = Тип("Число"), ПараметрыFTP.Порт, ЭКОМ_ПреобразоватьВЧислоОбщегоНазначения(ПараметрыFTP.Порт));
	ПараметрыFTP.Вставить("Порт"  , знПорт);
	ПараметрыFTP.Вставить("Прокси", ПроксиСервер);
		
	Если ВерсияПлатформыНаСервере() >= 8309 Тогда
		Попытка
			Выполнить("СерверFTP = Новый FTPСоединение(
			|ПараметрыFTP.Сервер, 
			|ПараметрыFTP.Порт, 
			|ПараметрыFTP.ИмяПользователя, 
			|ПараметрыFTP.ПарольПользователя,
			|ПараметрыFTP.Прокси,
			|ПараметрыFTP.ПассивноеСоединение,
			|ПараметрыFTP.Таймаут,
			|ПараметрыFTP.ЗащищенноеСоединение,
			|ПараметрыFTP.УровеньИспользованияЗащитыFTP);");					
		Исключение
			
			ОписаниеОшибкиТекст = ОписаниеОшибки();
			Ошибка = ДатьОписаниеОшибкиПоТекстуОшибкиОбщийМодуль(ОписаниеОшибкиТекст);
			ТекстЛогаСобытий = "Не удается подключиться к серверу: " + ПараметрыFTP.Сервер + Символы.ПС + Ошибка;
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
			
		КонецПопытки;	
	Иначе
		Попытка
			СерверFTP = Новый FTPСоединение(
			ПараметрыFTP.Сервер, 
			ПараметрыFTP.Порт, 
			ПараметрыFTP.ИмяПользователя, 
			ПараметрыFTP.ПарольПользователя,
			ПараметрыFTP.Прокси,
			ПараметрыFTP.ПассивноеСоединение,
			ПараметрыFTP.Таймаут);			
		Исключение
			ТекстЛогаСобытий = "Не удается подключиться к серверу: " + ПараметрыFTP.Сервер;
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
			
		КонецПопытки;
	КонецЕсли;
	
	Если СерверFTP = Неопределено Тогда
		ТекстЛогаСобытий = "Отсутствует подключение к FTP (Неопределено)!";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		
	КонецЕсли;

	Возврат СерверFTP;
	
КонецФункции

Функция ПроверкаПодключенияПоFTP(ПараметрыОбъекта, ТипОбменаЭТРН) Экспорт
	
	МассивЛогаСобытий = Новый Массив;
    СерверFTP = ЭКОМ_ОбщегоНазначения.ПолучитьFTPСоединение(ПараметрыОбъекта, ТипОбменаЭТРН, МассивЛогаСобытий);
	Если СерверFTP = Неопределено Тогда
	     ТекстСообщения = "Ошибка подключения по FTP";
	Иначе
		 ТекстСообщения = "Подключение по FTP успешно";  
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция ДатьОписаниеОшибкиПоТекстуОшибкиОбщийМодуль(ТекстОшибки) Экспорт
	Если Найти(ТекстОшибки, "is not retailer gln") > 0 Тогда
		Результат = "Этот GLN не принадлежит розничной сети (ретейлеру)";
	ИначеЕсли Найти(ТекстОшибки, "error during archiving - File not found or can't be archived") > 0 Тогда
		Результат = "Ошибка помещения в архив: Файл не найден на сервере в Inbox (возможно он уже был помещен в архив ранее)";
	ИначеЕсли Найти(ТекстОшибки, "{(1)}: Ошибка при вызове конструктора (FTPСоединение): ") > 0 Тогда
		Результат = "Проблема с подключением к FTP: " + СтрЗаменить(ТекстОшибки, "{(1)}: Ошибка при вызове конструктора (FTPСоединение): ", "");
	Иначе
		Результат = ТекстОшибки;
	КонецЕсли;
	Возврат Результат;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция преобразовывает имя реквизита (колонки табличной части) в его представление (текст шапки табличной части)
//
// Параметры:
//  ИмяРеквизита  - Строка - имя реквизита, используемое в коде
//
// Возможные проблемы:
//	Функция не понимает аббревиатуры, состоящие из нескольких заглавных букв. Для нее это будут отдельные слова.
//	По условиям функция возвращает строку с первой заглавной буквой, остальные прописные.
//
// Возвращаемое значение:
//   Строка   - представление реквизита для пользователя (с пробелами)
//
Функция ТекстШапкиИзДанных(Знач ИмяРеквизита) Экспорт

	ИмяРеквизита 			= СтрЗаменить(ИмяРеквизита, "_", " ");
	
	Если Найти(ИмяРеквизита, " ") = 0 Тогда
		
		ПозицииБудущихПробелов 	= Новый Массив;
		
		// Поиск позиции для вставки пробелов.
		Для Позиция = 1 По СтрДлина(ИмяРеквизита) Цикл
			Символ 	= Сред(ИмяРеквизита, Позиция, 1);
			Если НЕ Позиция = 1 И ВРег(Символ) = Символ Тогда
				ПозицииБудущихПробелов.Добавить(Позиция);
			КонецЕсли;
		КонецЦикла;
		
		// Вставка пробелов.
		Для Вычитаемое = 0 По ПозицииБудущихПробелов.ВГраница() Цикл
			Индекс 	= ПозицииБудущихПробелов.ВГраница() - Вычитаемое;
			Позиция = ПозицииБудущихПробелов.Получить(Индекс);
			
			ИмяРеквизита = Лев(ИмяРеквизита, Позиция - 1) + " " + Прав(ИмяРеквизита, СтрДлина(ИмяРеквизита) - Позиция + 1); 
		КонецЦикла;
		
		ИмяРеквизита = СокрЛП(ИмяРеквизита);
		ИмяРеквизита = Лев(ИмяРеквизита, 1) + НРег(Прав(ИмяРеквизита, СтрДлина(ИмяРеквизита) - 1));
		
	КонецЕсли;
	
	Возврат ИмяРеквизита;
	
КонецФункции // ТекстШапкиИзДанных()

Процедура СобратьДанныеДляСтатистики(ВерсияОбработки, АвтообновлениеВключено, МассивЛогаСобытий) Экспорт

	МЗ = РегистрыСведений.ЭКОМ_ЗначениеДополнительныхКонстант.СоздатьМенеджерЗаписи();
	МЗ.ДополнительнаяКонстанта = "СлужебныйДатаОбновленияСтатистикиПоМодулю";
	МЗ.Измерение = "Служебный";
	МЗ.Прочитать();
	
	Если НЕ МЗ.Выбран() Тогда
		МЗ.ДополнительнаяКонстанта = "СлужебныйДатаОбновленияСтатистикиПоМодулю";
		МЗ.Измерение = "Служебный";
	КонецЕсли;
	
	ВремяПоследнегоОбновления = ?(НЕ ЗначениеЗаполнено(МЗ.ЗначениеДополнительнойКонстанты), Дата(0001, 01, 01), МЗ.ЗначениеДополнительнойКонстанты);
	ВремяОбновления = (ТекущаяДата() - ВремяПоследнегоОбновления)/(60*60);
	Если ВремяОбновления >= 24 Тогда // если больше 24 часов то обновляем 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭКОМ_GLN.ПрофильОбмена КАК ПрофильОбмена,
		|	ЭКОМ_GLN.Объект КАК Организация,
		|	ЭКОМ_GLN.ПрофильОбмена.ИмяПользователяFTP КАК ИмяПользователяFTP,
		|	ЭКОМ_GLN.ПрофильОбмена.ОбменПоSOAP КАК ОбменПоSOAP
		|ИЗ
		|	РегистрСведений.ЭКОМ_GLN КАК ЭКОМ_GLN
		|ГДЕ
		|	НЕ ЭКОМ_GLN.ПрофильОбмена = ЗНАЧЕНИЕ(Справочник.ЭКОМ_ПрофилиОбмена.ПустаяСсылка)
		|	И НЕ ЭКОМ_GLN.ПрофильОбмена.ПометкаУдаления
		|	И ЭКОМ_GLN.ПрофильОбмена.Активный = ИСТИНА
		|ИТОГИ ПО
		|	ПрофильОбмена";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			СистемнаяИнформация = Новый СистемнаяИнформация;
			ТекущаяВерсия = СистемнаяИнформация.ВерсияПриложения;
			
			ВыборкаПрофильОбмена = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПрофильОбмена.Следующий() Цикл
				ИмяФайла = СокрЛП(ВыборкаПрофильОбмена.ИмяПользователяFTP);
				КомандаЗапроса    = "/repos/1cdevelopexite/OrganizationsData/contents/" + ИмяФайла + ".json";          
				ОтветСервераПоФайлу = ПолучениеДанныхGITНаСервере(КомандаЗапроса, МассивЛогаСобытий);
				
				МассивНаименованийОрганизаций = Новый Массив;
				Выборка = ВыборкаПрофильОбмена.Выбрать();		
				Пока Выборка.Следующий() Цикл
					МассивНаименованийОрганизаций.Добавить(СокрЛП(Выборка.Организация.Наименование));
				КонецЦикла;
				
				ДанныйФайла = Новый Структура;
				ДанныйФайла.Вставить("Организация", МассивНаименованийОрганизаций);
				ДанныйФайла.Вставить("Платформа", ТекущаяВерсия);
				ДанныйФайла.Вставить("Конфигурация", Метаданные.КраткаяИнформация);
				ДанныйФайла.Вставить("ВерсияОбработки", ВерсияОбработки);
				ДанныйФайла.Вставить("АвтообновлениеВключено", Формат(АвтообновлениеВключено, "БЛ=Нет; БИ=Да"));
				ДанныйФайла.Вставить("ТипПодключенияКвеб", Формат(ВыборкаПрофильОбмена.ОбменПоSOAP, "БЛ=FTP; БИ=SOAP"));
				ДанныйФайла.Вставить("РасположениеБазыДанных", СтрокаСоединенияИнформационнойБазы());
				ДанныйФайла.Вставить("ТипПодключенияКплатформе", ТипПодключенияКплатформе());
				
				ТекстJSON = ЭКОМ_ПреобразоватьВJSON(ДанныйФайла);
				
				ДанныеЗапроса = Новый Структура;
				Если Не ОтветСервераПоФайлу = Неопределено Тогда
					ДанныеЗапроса.Вставить("sha", ОтветСервераПоФайлу.Получить("sha"));
					ДанныеЗапроса.Вставить("message", "файл обновлен");
				Иначе
					ДанныеЗапроса.Вставить("message", "файл создан");
				КонецЕсли;			
				ДанныеЗапроса.Вставить("content", Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(ТекстJSON)));
				
				// Создаем или обновляем файл
				Ответ = ВыполнитьЗапросGIT(КомандаЗапроса, ДанныеЗапроса, "PUT", МассивЛогаСобытий);
				Если НЕ Ответ = Неопределено Тогда
					МЗ.ЗначениеДополнительнойКонстанты = ТекущаяДата();
					МЗ.Записать();	
				КонецЕсли;
				
			КонецЦикла;			
		КонецЕсли;		
	КонецЕсли;  
	
КонецПроцедуры

Функция ТипПодключенияКплатформе()
	
	СтрокаСоединенияСБД = СтрокаСоединенияИнформационнойБазы();
	ПозицияПоиска = Найти(Врег(СтрокаСоединенияСБД), "FILE=");
	Если ПозицияПоиска = 1 тогда
		Тип = "Файловая";	
	Иначе 
		Тип = "Серверная";
	КонецЕсли; 
	
	Возврат Тип;

КонецФункции   

Функция ИзвлечьPDF_ЭКОМ(ПрофильОбмена, ИД_Документа, Ошибка, МассивЛогаСобытий) Экспорт
	
	ТокенАвторизации = ПолучитьТокенАвторизации(ПрофильОбмена, Ошибка, МассивЛогаСобытий);	
	Если Ошибка.ЕстьОшибка Тогда
		ТекстЛогаСобытий = Ошибка.ТекстОшибки;
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, "Получение печатной формы для ЮЗД");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстКоманды =  "/Api/V1/Edo/PrintForm/Generate";
	
	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("identifier", ИД_Документа);
	ДанныеЗапроса.Вставить("varToken"  , ТокенАвторизации);
	
	ЗаголовокHTTP = Новый Соответствие;
	ЗаголовокHTTP.Вставить("Content-type", "application/json");
	ЗаголовокHTTP.Вставить("Accept"      , "application/json");	
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("МетодHTTP"    , "POST");
	ПараметрыЗапроса.Вставить("ЗаголовокHTTP", ЗаголовокHTTP);

	Результат = ВыполнитьЗапрос(ТекстКоманды, ПрофильОбмена, ДанныеЗапроса, ПараметрыЗапроса, Ошибка, МассивЛогаСобытий);
	
	Если Ошибка.ЕстьОшибка Тогда						
		Возврат Неопределено;		
	КонецЕсли;
	
	Текст = Результат.Текст;
	
	Информация = Сред(Текст, 10, Найти(Текст, ",""varMessage""") - 10);
	Информация = СтрЗаменить(Информация,"\/","/");  
	
	СтрокаBase64PDF_Документа = Информация;
	Если Base64Значение(Информация) = Неопределено Тогда
		
		Ошибка.Вставить("ЕстьОшибка" , Истина); 
		Ошибка.Вставить("КодОшибки"  , "");
		Ошибка.Вставить("ТекстОшибки", Текст);
		
	КонецЕсли;
	
	///////////////////////////////
	
	Возврат СтрокаBase64PDF_Документа; // СтрокаBase64 файла PDF
	
КонецФункции

Функция ПутьВременногоКаталогаЭКОМ(ТипФайла = "") Экспорт  
	
	РазделительПути = ЭКОМ_ПолучитьРазделительПути();
	Если ТипФайла = "" Тогда
		 Результат = КаталогВременныхФайлов() + "TempECOM" + РазделительПути;
	Иначе
	     Результат = КаталогВременныхФайлов() + "TempECOM" + РазделительПути + ТипФайла + РазделительПути;
	КонецЕсли;
	   
	Возврат Результат;
	
КонецФункции

Функция ЭКОМ_ПолучитьРазделительПути()
		
	РазделительПути = "";
	
	Если ВерсияПлатформыНаСервере() >= 8330 Тогда
		РазделительПути = ПолучитьРазделительПути();
	Иначе
		
		СистемнаяИнформация = Новый СистемнаяИнформация;	
		ЭтоLinuxКлиент = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 
		ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;
		
		Если ЭтоLinuxКлиент Тогда 
			РазделительПути = "/"; // Linux
		
		Иначе
			РазделительПути = "\";  // Windows
			
		КонецЕсли;
	КонецЕсли;
				
    Возврат РазделительПути;

КонецФункции

Функция ЭКОМ_СоздатьКаталогПроверитьНаЗапись(ПолныйПутьКаталога, МассивЛогаСобытий) Экспорт
	
	ИмяСобытия = "Проверка каталога на запись файлов";
	КаталогСоздан = Ложь;
	Если ЗначениеЗаполнено(ПолныйПутьКаталога) 
		 И ТипЗнч(ПолныйПутьКаталога) = Тип("Строка") Тогда

		 // Создаем каталог 
		 Каталог = Новый Файл(ПолныйПутьКаталога);
		 Если НЕ Каталог.Существует() Тогда
			 Попытка
				 СоздатьКаталог(ПолныйПутьКаталога);
				 Каталог = Новый Файл(ПолныйПутьКаталога);
			 Исключение
				 ТекстЛогаСобытий = "Каталог, указанный в настройках модуля отсутствует. 
				 |Ошибка создания каталога по настройке [" + ПолныйПутьКаталога + "] Текст ошибки платформы: " + ОписаниеОшибки();
				 ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
				 МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

				 Возврат Ложь;
				 
			 КонецПопытки;
			 
		 КонецЕсли;
		 
		 // Проверяем на запись
		 Попытка
			 Текст = Новый ЗаписьТекста(ПолныйПутьКаталога + "ТестНаЗапись.txt", КодировкаТекста.ANSI);    
			 Текст.ЗаписатьСтроку("Проверка на запись файлов!");
			 Текст.Закрыть();
			 
			 Попытка
				 ФайлПроверкиЗаписи = Новый Файл(ПолныйПутьКаталога + "ТестНаЗапись.txt");
				 Если ФайлПроверкиЗаписи.Существует() Тогда
					 УдалитьФайлы(ФайлПроверкиЗаписи.ПолноеИмя);
				 КонецЕсли;
			 Исключение
			 КонецПопытки; 			 
			 			 
		 Исключение
			 ТекстЛогаСобытий = "Нет прав на запись файлов. Текст ошибки платформы: " + ОписаниеОшибки();
			 ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
			 МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
			 
			 Возврат Ложь;
			 
		 КонецПопытки;
		 
		 КаталогСоздан = Истина;

	КонецЕсли;

    Возврат КаталогСоздан;

КонецФункции

// Функция имитирует метод платформы СтрНайти
//	Параметры:
//	Строка - строка
//  ПодстрокаПоиска - строка
//  НаправлениеПоиска - число - 0 (значение по умолчанию) - поиск СНачала, любое другое значение - СКонца
//  НачальнаяПозиция - число
//  НомерВхождения  - число
Функция ПоискВСтроке(Знач Строка, ПодстрокаПоиска, НаправлениеПоиска = 0 , НачальнаяПозиция = -1, НомерВхождения = 1) Экспорт
	Если НаправлениеПоиска = 0 И НачальнаяПозиция = -1 Тогда
		НачальнаяПозиция = 1;
	ИначеЕсли НаправлениеПоиска <> 0 И НачальнаяПозиция = -1 Тогда
		НачальнаяПозиция = СтрДлина(Строка);
	КонецЕсли;
	
	ДлинаСтроки = СтрДлина(Строка);
	СтрокаПоиска = Прав(Строка, ДлинаСтроки - НачальнаяПозиция + 1); 
	УбраноСимволов = ДлинаСтроки - СтрДлина(СтрокаПоиска);
	
	Если НаправлениеПоиска <> 0 Тогда
		СтрокаПоиска = Лев(Строка, НачальнаяПозиция - 1); 
		УбраноСимволов = ДлинаСтроки - СтрДлина(СтрокаПоиска);
		
		ДлинаСтрокиПоиска = СтрДлина(СтрокаПоиска);
		Счетчик = 0;
		НоваяСтрока = "";
		Пока Счетчик < ДлинаСтрокиПоиска Цикл
			ТекСимвол = Сред(СтрокаПоиска, ДлинаСтрокиПоиска - Счетчик, 1);
			НоваяСтрока = НоваяСтрока + ТекСимвол;
			Счетчик = Счетчик + 1;
		КонецЦикла;
		
		ДлинаПодстрокиПоиска = СтрДлина(ПодстрокаПоиска);
		Счетчик = 0;
		НоваяПодстрока = "";
		Пока Счетчик < ДлинаПодстрокиПоиска Цикл
			ТекСимвол = Сред(ПодстрокаПоиска, ДлинаПодстрокиПоиска - Счетчик, 1);
			НоваяПодстрока = НоваяПодстрока + ТекСимвол;
			Счетчик = Счетчик + 1;
		КонецЦикла;
		ПодстрокаПоиска = НоваяПодстрока;
		
		СтрокаПоиска = НоваяСтрока;
	КонецЕсли;
	
	Счетчик      = 0;
	НомерСимвола = 0;
	СчетчикДлины = УбраноСимволов;
	Пока Счетчик < НомерВхождения Цикл
		НомерСимвола = Найти(СтрокаПоиска, ПодстрокаПоиска);
		
		ДлинаДо      = СтрДлина(СтрокаПоиска);
		СтрокаПоиска = Прав(СтрокаПоиска, ДлинаДо - НомерСимвола);
		
		Счетчик 		= Счетчик + 1;
		НомерСледующего = Найти(СтрокаПоиска, ПодстрокаПоиска);
		Если НомерСледующего = 0 Или Счетчик = НомерВхождения Тогда
			Прервать;
		КонецЕсли;
		
		ДлинаСтрокиПоиска = СтрДлина(СтрокаПоиска);
		СчетчикДлины 	  = СчетчикДлины + ДлинаДо - СтрДлина(СтрокаПоиска);
	КонецЦикла;
	
	Если НомерСимвола = 0 Тогда
		Возврат 0;
	КонецЕсли;
	Если НаправлениеПоиска = 0 Тогда
		Результат = СчетчикДлины + НомерСимвола;
	Иначе
		Результат = СтрДлина(Строка) - СчетчикДлины - НомерСимвола  + 1 - СтрДлина(ПодстрокаПоиска) + 1;
	КонецЕсли;
	Если Счетчик < НомерВхождения Тогда
		Результат = 0;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОТПРАВКА

Функция СформироватьДокументыXML(МассивСтрок, МассивЛогаСобытий, ЭтоРегламентноеЗадание, ТипДокумента, ПодписатьФайл, НомерИсправления = "") Экспорт 
	
	МассивСтруктур = Новый Массив;
	
	ДанныеПоКолонкам            = ПолучитьДанныеПоКолонкамИсточника(); 
	ДанныеПоИсходящимНастройкам = ПолучитьДанныеПоИсходящимНастройкам(ДанныеПоКолонкам, ТипДокумента, МассивЛогаСобытий);
	
	ИсходящееДерево       = ДанныеПоИсходящимНастройкам["ИсходящееДерево"].Получить();	
	ИмяДокументаИсточника = ДанныеПоИсходящимНастройкам["ИмяДокументаИсточника"];

	МассивДок = ПолучитьДокументыДляСозданияШаблона(МассивСтрок, ИмяДокументаИсточника, ТипДокумента, МассивЛогаСобытий);
	
	Если Не МассивДок.Количество()=0 Тогда	
		Ошибка     = ПолучитьСтруктуруОшибки();
		ПолучитьДанныеДокументов(ИсходящееДерево, МассивДок, НомерИсправления, МассивЛогаСобытий, Ошибка);
		
		Если Ошибка.ЕстьОшибка Тогда
		    МассивЛогаСобытий.Добавить(Ошибка.ТекстОшибки);
			Возврат МассивСтруктур;
		КонецЕсли;
			
		МассивСтруктур = СозданиеДокументаПоШаблонуXML(ИсходящееДерево, ТипДокумента, МассивЛогаСобытий, ЭтоРегламентноеЗадание, ПодписатьФайл);
		
	КонецЕсли;
	
	Возврат МассивСтруктур; 
	
КонецФункции

Функция ПолучитьДокументыДляСозданияШаблона(МассивСтрок, ИмяДокументаИсточника, ТипДокумента, МассивЛогаСобытий) Экспорт
	
	ИмяСобытия = "Получение документов для создания шаблона";
	ЭКОМ_ОтправлятьНепроведенные = НастройкиПрочитатьНаСервере("ЭКОМ_ОтправлятьНепроведенные", Ложь);

	// Получение значений "через точку".
	ДокументыДляОтправки = Новый ТаблицаЗначений;
	
	СоответствиеТиповДокументов = Новый Соответствие;
	ИмяДокумента = Неопределено;
	Для Каждого ЭлементМассива Из МассивСтрок Цикл		
		СтрокаМассива = ЭлементМассива.Строка;
		Если СтрокаМассива.Свойство(ИмяДокументаИсточника) = Истина Тогда
			ДокументДляОтправки = СтрокаМассива[ИмяДокументаИсточника];
			Если ЗначениеЗаполнено(ДокументДляОтправки) Тогда
				ТекущийТипДокумента = ТипЗнч(ДокументДляОтправки);
				ИмяДокумента = СоответствиеТиповДокументов.Получить(ТекущийТипДокумента);			
				Если ИмяДокумента = Неопределено Тогда
					ИмяДокумента = ДокументДляОтправки.Метаданные().Имя;
					Если ДокументыДляОтправки.Колонки.Найти(ИмяДокумента) = Неопределено Тогда
						ДокументыДляОтправки.Колонки.Добавить(ИмяДокумента, Новый ОписаниеТипов("ДокументСсылка." + ИмяДокумента));
					КонецЕсли;
				КонецЕсли;
				
				НоваяСтрока = ДокументыДляОтправки.Добавить();
				НоваяСтрока[ИмяДокумента] = ДокументДляОтправки;
				
				СоответствиеТиповДокументов.Вставить(ТекущийТипДокумента, ИмяДокумента);
			Иначе
				ТекстЛогаСобытий = "Ошибка отправки документа. Отсутствует значение колонки документа для отправки - " + ИмяДокументаИсточника;
				ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
				МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
			КонецЕсли;
		Иначе
			ТекстЛогаСобытий = "Ошибка отправки документа. Отсутствует значение колонки документа для отправки - " + ИмяДокументаИсточника;
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
			
		КонецЕсли;								
	КонецЦикла;
	
	ТекстУсловия = "";
	Для каждого СтрТипа Из СоответствиеТиповДокументов Цикл	
		ИмяДокумента = СтрТипа.Значение;
		Если НЕ ЗначениеЗаполнено(ТекстУсловия) Тогда
			ТекстУсловия = "КОГДА НЕ Входящая." + ИмяДокумента + " = НЕОПРЕДЕЛЕНО
			|			И НЕ Входящая." + ИмяДокумента + " = ЗНАЧЕНИЕ(Документ." + ИмяДокумента + ".ПустаяСсылка)
			|			И НЕ Входящая." + ИмяДокумента + " ЕСТЬ NULL
			|			И НЕ Входящая." + ИмяДокумента + " = """"
			|		ТОГДА ВЫРАЗИТЬ(Входящая." + ИмяДокумента + " КАК Документ." + ИмяДокумента + ")";
		Иначе	
			ТекстУсловия = ТекстУсловия + Символы.ПС + "|КОГДА НЕ Входящая." + ИмяДокумента + " = НЕОПРЕДЕЛЕНО
			|			И НЕ Входящая." + ИмяДокумента + " = ЗНАЧЕНИЕ(Документ." + ИмяДокумента + ".ПустаяСсылка)
			|			И НЕ Входящая." + ИмяДокумента + " ЕСТЬ NULL
			|			И НЕ Входящая." + ИмяДокумента + " = """"
			|		ТОГДА ВЫРАЗИТЬ(Входящая." + ИмяДокумента + " КАК Документ." + ИмяДокумента + ")";
		КонецЕсли;		
	КонецЦикла;
	
	МассивДок = Новый Массив;
	МассивОтправленныхДок = Новый Массив;
	
	Если НЕ ДокументыДляОтправки.Количество() = 0 Тогда 		
		Запрос = Новый Запрос;			
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Входящая.Документ = ""ТекстУсловия"" ТОГДА ИСТИНА
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ДокументДляОтправки
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ДокументыДляОтправки КАК Входящая
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ДокументДляОтправки КАК ДокументДляОтправки,
		|	ВТ.ДокументДляОтправки.Проведен КАК Проведен,
		|	"""" КАК Комментарий,
		|	ВТ.ДокументДляОтправки.Представление КАК Представление,
		|	ВТ.ДокументДляОтправки.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	ВТ КАК ВТ";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КОГДА Входящая.Документ = ""ТекстУсловия"" ТОГДА ИСТИНА", ТекстУсловия);
		
		// Изменяем комментарий
		Если ТипДокумента = "DP_UVUTOCH" Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """"" КАК Комментарий", "ВТ.ДокументДляОтправки.Комментарий КАК Комментарий");
		КонецЕсли;
			
		Запрос.УстановитьПараметр("ДокументыДляОтправки", ДокументыДляОтправки);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(Выборка.ДокументДляОтправки) Тогда
				ТекстЛогаСобытий = "Ошибка отправки документа. Отсутствует значение колонки документа для отправки - " + ИмяДокументаИсточника;
				ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
				МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
				
				Продолжить;
			КонецЕсли; 	
			
			ТекстОшибки = "";
			СтрокаМассива.Свойство("ТекстОшибки", ТекстОшибки);
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				ТекстЛогаСобытий = "Ошибка отправки документа - " + Выборка.Представление + ". Есть ошибки(поле текст ошибки): " + ТекстОшибки;
				ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
				МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

				Продолжить;
			КонецЕсли;
			
			Если ТипДокумента = "CONDRA_ОТКЛОНИТЬ" Тогда
				ПричинаОтклонения = "";
				СтрокаМассива.Свойство("Информация", ПричинаОтклонения);
				Если НЕ ЗначениеЗаполнено(ПричинаОтклонения) Тогда
					ТекстЛогаСобытий = "Ошибка отправки документа - " + Выборка.Представление + ". Отсутствует значение колонки <<<Причина отклонения>>>";
					ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
					МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если ТипДокумента = "DP_UVUTOCH" Тогда
				Если НЕ ЗначениеЗаполнено(Выборка.Комментарий) Тогда
					ТекстЛогаСобытий = "Ошибка отправки документа - " + Выборка.Представление + ". Не заполнен текс комментария (уточнения).";
					ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
					МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

					Продолжить;	 
				КонецЕсли;	
			КонецЕсли;
			
			Если Найти(ТипДокумента, "DP_PRANNUL") > 0 Тогда
				ТекстПричиныАннулирования = "";
				СтрокаМассива.Свойство("ТекстПричиныАннулирования", ТекстПричиныАннулирования);
				Если НЕ ЗначениеЗаполнено(ТекстПричиныАннулирования) Тогда
					ТекстЛогаСобытий = "Ошибка отправки документа - " + Выборка.Представление + ". Не заполнен текст причины аннулирования!";
					ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
					МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

					Продолжить;	 
				КонецЕсли;	
			КонецЕсли;
			
			Если ТипДокумента = "DP_UVUTOCH_24" Тогда
				ТекстОтклоненияАннулирования = "";
				СтрокаМассива.Свойство("ТекстОтклоненияАннулирования", ТекстОтклоненияАннулирования);
				Если НЕ ЗначениеЗаполнено(ТекстОтклоненияАннулирования) Тогда
					ТекстЛогаСобытий = "Ошибка отправки документа - " + Выборка.Представление + ". Не заполнен текст отклонения аннулирования!";
					ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
					МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

					Продолжить;	 
				КонецЕсли;	
			КонецЕсли;
			
			Если Выборка.ПометкаУдаления Тогда
				ТекстЛогаСобытий = "Документ помечен на удаление - " + Выборка.Представление;
				ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Предупреждение, ИмяСобытия);
				МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(Выборка.ДокументДляОтправки) = Тип("ДокументСсылка.ЭКОМ_Документы") Тогда
				Если Выборка.ДокументДляОтправки.СтатусОбработкиДокумента = Перечисления.ЭКОМ_Статусы.Обработан Тогда 
					МассивДок.Добавить(Выборка.ДокументДляОтправки); 
				Иначе
					ТекстЛогаСобытий = "Документ " + Выборка.ДокументДляОтправки.ВидДокумента + " не обработан - " + Выборка.Представление;
					ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Предупреждение, ИмяСобытия);
					МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

				КонецЕсли;
				
			Иначе
				Если ЭКОМ_ОтправлятьНепроведенные = Истина Тогда			
					МассивДок.Добавить(Выборка.ДокументДляОтправки);
					
				Иначе				
					Если Выборка.Проведен Тогда 
						МассивДок.Добавить(Выборка.ДокументДляОтправки); 
					Иначе
						ТекстЛогаСобытий = "Документ 1С не проведен - " + Выборка.Представление;
						ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Предупреждение, ИмяСобытия);
						МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

					КонецЕсли;
					
				КонецЕсли;		
			КонецЕсли;
			
			ОтправитьПовторно = Неопределено;
			ЭлементМассива.Свойство("ОтправитьПовторно", ОтправитьПовторно); 
			Если ОтправитьПовторно = Истина Тогда			
				МассивОтправленныхДок.Добавить(Выборка.ДокументДляОтправки);		
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Очищаем ранее отправленные квитанции
	Если МассивОтправленныхДок.Количество() > 0 Тогда
		ОчиститьИсториюПоОтпрДокументам(ТипДокумента, МассивОтправленныхДок);	
	КонецЕсли;

	Возврат МассивДок;
	
КонецФункции

Функция ПолучитьДанныеПоИсходящимНастройкам(ДанныеПоКолонкам, ТипДокумента, МассивЛогаСобытий) Экспорт
	
	ИмяСобытия = "Получение данных по исходящим документам";
	ДанныеПоНастройкам = Новый Соответствие;
	ДанныеПоНастройкам.Вставить("ИсходящееДерево", Неопределено);
	ДанныеПоНастройкам.Вставить("ИмяДокументаИсточника", "");
	
    Дерево = Новый ДеревоЗначений;
	Если ТипДокумента = "WHGOV_01_Исходящий" Тогда		
		Дерево = ПолучитьСтруктуруФайлаДанных("Исходящий WHGOV_01 (Отгрузка - сообщение ГО) - ПЭП Кладовщика");
		
	ИначеЕсли ТипДокумента = "WHGOU_04_Исходящий" Тогда		
		Дерево = ПолучитьСтруктуруФайлаДанных("Исходящий WHGOU_04 (Отгрузка - титул ГО) - КЭП ГО");
		
	ИначеЕсли ТипДокумента = "WHGPV_05_Исходящий" Тогда			
		Дерево = ПолучитьСтруктуруФайлаДанных("Исходящий WHGPV_05 (Приемка - сообщение ГП) - ПЭП");
		
	ИначеЕсли ТипДокумента = "WHGPU_08_Исходящий" Тогда			
		Дерево = ПолучитьСтруктуруФайлаДанных("Исходящий WHGPU_08 (Приемка - титул ГП) - Титул ГП");	 
		
	ИначеЕсли ТипДокумента = "ORDRSP" Тогда			
		Дерево = ПолучитьСтруктуруФайлаДанных("Исходящий ORDRSP (подтверждение заказа)");
		
	ИначеЕсли ТипДокумента = "DESADV" Тогда		
		Дерево = ПолучитьСтруктуруФайлаДанных("Исходящий DESADV (подтверждение отгрузки)");
		
	ИначеЕсли ТипДокумента = "INVOICE" Тогда			
		Дерево = ПолучитьСтруктуруФайлаДанных("Исходящий INVOICE (счёт)");
		
	ИначеЕсли ТипДокумента = "DESSCC" Тогда	
		Дерево = ПолучитьСтруктуруФайлаДанных("Исходящий DESSCC (уведомление об отгрузке)");
		
	ИначеЕсли ТипДокумента = "RETINS" Тогда	
		Дерево = ПолучитьСтруктуруФайлаДанных("Исходящий RETINS (инструкция о возврате)");
		
	ИначеЕсли ТипДокумента = "RETANN" Тогда	
		Дерево = ПолучитьСтруктуруФайлаДанных("Исходящий RETANN (уведомление о возврате)");
		
	ИначеЕсли ТипДокумента = "ORDER" ИЛИ ТипДокумента = "ORDERS" Тогда	
		Дерево = ПолучитьСтруктуруФайлаДанных("Исходящий ORDER (заказ поставщику)");
		
	ИначеЕсли ТипДокумента = "RETORD" Тогда	
		Дерево = ПолучитьСтруктуруФайлаДанных("Исходящий RETORD (обратный заказ)");
		
	ИначеЕсли ТипДокумента = "RECADV" Тогда	
		Дерево = ПолучитьСтруктуруФайлаДанных("Исходящий RECADV (уведомление о приеме)");
		
	ИначеЕсли ТипДокумента = "ЮЗД" Тогда 		
		Дерево = ПолучитьСтруктуруФайлаДанных("Исходящий ЮЗД - универсальный передаточный документ");
		
	ИначеЕсли ТипДокумента = "STATUS" Тогда
		Дерево = ПолучитьСтруктуруФайлаДанных("Исходящий STATUS (Служебный документ)");
		
	ИначеЕсли ТипДокумента = "CONDRA_ПРИНЯТЬ" Тогда
		Дерево = ПолучитьСтруктуруФайлаДанных("Исходящий CONDRA (Принятие)");
		
	ИначеЕсли ТипДокумента = "CONDRA_ОТКЛОНИТЬ" Тогда
		Дерево = ПолучитьСтруктуруФайлаДанных("Исходящий CONDRA (Отклонение)");
		
	ИначеЕсли ТипДокумента = "DP_PRANNUL_22_Сеть" Тогда
		Дерево = ПолучитьСтруктуруФайлаДанных("Исходящий DP_PRANNUL_22 (покупатель - аннулирование)");
		
	ИначеЕсли ТипДокумента = "DP_PRANNUL_22_Поставщик" Тогда
		Дерево = ПолучитьСтруктуруФайлаДанных("Исходящий DP_PRANNUL_22 (поставщик - аннулирование)");
		
	ИначеЕсли ТипДокумента = "DP_IZVPOL_23" Тогда
		Дерево = ПолучитьСтруктуруФайлаДанных("Исходящий DP_IZVPOL_23 (подтверждение аннулирования)");
		
	ИначеЕсли ТипДокумента = "DP_UVUTOCH_24" Тогда
		Дерево = ПолучитьСтруктуруФайлаДанных("Исходящий DP_UVUTOCH_24 (отклонение аннулирования)");

	ИначеЕсли ТипДокумента = "DP_REZRUISP" Тогда
		Дерево = ПолучитьСтруктуруФайлаДанных("Исходящий DP_REZRUISP (Акт выполненных работ)");
		
	ИначеЕсли ТипДокумента = "PRICAT" Тогда
		Дерево = ПолучитьСтруктуруФайлаДанных("Исходящий PRICAT");
		
	КонецЕсли;	
	
	СтруктураФайлаДанных = Дерево;
	
	ИмяДокументаИсточника = ПолучитьСинонимИсточника(СтруктураФайлаДанных, "Источник", МассивЛогаСобытий);	
	Если ИмяДокументаИсточника = Неопределено Тогда
		ТекстЛогаСобытий = "Не заполнен документ-источник! Смотрите гибкие настройки.";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		
		Возврат ДанныеПоНастройкам;
	КонецЕсли;
			
	// Преобразуем старый алгоритм к новому
	Если ДанныеПоКолонкам.Получить(ИмяДокументаИсточника) = Неопределено Тогда
		
		ЭКОМ_ДеревоКонфигурации = НастройкиПрочитатьНаСервере("СлужебныйДеревоКонфигурации", Новый ДеревоЗначений, "Служебный", Истина);
		Если ЭКОМ_ДеревоКонфигурации.Строки.Найти(ИмяДокументаИсточника, "Синоним") = Неопределено Тогда 
			СтрокиДерева	= ЭКОМ_ДеревоКонфигурации.Строки.Найти(ИмяДокументаИсточника, "Имя");
		Иначе
			СтрокиДерева	= ЭКОМ_ДеревоКонфигурации.Строки.Найти(ИмяДокументаИсточника, "Синоним");
		КонецЕсли;
		
		СоответсвиеПоДокументам = Новый Соответствие;
		Если ТипДокумента = "ORDRSP" 
			ИЛИ ТипДокумента = "DESADV"
			ИЛИ ТипДокумента = "INVOICE" Тогда		 
			
			СоответсвиеПоДокументам.Вставить(ПолучитьТипДокументаЗаказаПокупателя(МассивЛогаСобытий), "ДокументЗаказа");
			СоответсвиеПоДокументам.Вставить(ПолучитьТипДокументаРеализации(МассивЛогаСобытий)      , "ДокументРеализации");
			СоответсвиеПоДокументам.Вставить("ЭКОМ_Документы"                                , "ЭКОМ_Документ_ORDER");
			
		ИначеЕсли ТипДокумента = "DESSCC" Тогда			 
			СоответсвиеПоДокументам.Вставить(ПолучитьТипДокументаЗаказаПокупателя(МассивЛогаСобытий)       , "ДокументЗаказа");
			СоответсвиеПоДокументам.Вставить(ПолучитьТипДокументаРеализации(МассивЛогаСобытий)             , "ДокументРеализации");
			СоответсвиеПоДокументам.Вставить(ПолучитьТипДокументаКорректировкаРеализации(МассивЛогаСобытий), "КорректировкаРеализации");
			СоответсвиеПоДокументам.Вставить("ЭКОМ_Документы"                                       , "ЭКОМ_Документ_ORDER");
			
		ИначеЕсли ТипДокумента = "RETINS" Тогда		 
			СоответсвиеПоДокументам.Вставить(ПолучитьТипДокументаЗаказаПокупателя(МассивЛогаСобытий)       , "ДокументЗаказа");
			СоответсвиеПоДокументам.Вставить(ПолучитьТипДокументаРеализации(МассивЛогаСобытий)             , "ДокументРеализации");
			СоответсвиеПоДокументам.Вставить(ПолучитьТипДокументаКорректировкаРеализации(МассивЛогаСобытий), "КорректировкаРеализации");
			СоответсвиеПоДокументам.Вставить(ПолучитьТипДокументаВозвратОтПокупателя(МассивЛогаСобытий)    , "ВозвратТоваровОтПокупателя");
			СоответсвиеПоДокументам.Вставить("ЭКОМ_Документы"                                       , "ЭКОМ_Документ_RETANN");
			
		ИначеЕсли ТипДокумента = "RETANN" Тогда		 
			СоответсвиеПоДокументам.Вставить(ПолучитьТипДокументаЗаказаПоставщика(МассивЛогаСобытий)        , "ДокументЗаказа");
			СоответсвиеПоДокументам.Вставить(ПолучитьТипДокументаПоступления(МассивЛогаСобытий)             , "ДокументПоступления");
			СоответсвиеПоДокументам.Вставить(ПолучитьТипДокументаКорректировкаПоступления(МассивЛогаСобытий), "КорректировкаПоступления");
			СоответсвиеПоДокументам.Вставить(ПолучитьТипДокументаВозвратТоваровПоставщику(МассивЛогаСобытий), "ВозвратТоваровПоставщику");
			СоответсвиеПоДокументам.Вставить("ЭКОМ_Документы"                                        , "ЭКОМ_Документ_DESADV");
			
		ИначеЕсли ТипДокумента = "ORDER" ИЛИ ТипДокумента = "ORDERS" Тогда	 
			СоответсвиеПоДокументам.Вставить(ПолучитьТипДокументаЗаказаПоставщика(МассивЛогаСобытий)        , "ДокументЗаказа");
			СоответсвиеПоДокументам.Вставить(ПолучитьТипДокументаПоступления(МассивЛогаСобытий)             , "ДокументПоступления");
						
		ИначеЕсли ТипДокумента = "RETORD" Тогда			 
			СоответсвиеПоДокументам.Вставить(ПолучитьТипДокументаЗаказаПокупателя(МассивЛогаСобытий), "ДокументЗаказа");
			СоответсвиеПоДокументам.Вставить(ПолучитьТипДокументаРеализации(МассивЛогаСобытий)      , "ДокументРеализации");
			
		ИначеЕсли ТипДокумента = "RECADV" Тогда	 
			
			СоответсвиеПоДокументам.Вставить(ПолучитьТипДокументаЗаказаПоставщика(МассивЛогаСобытий), "ДокументЗаказа");
			СоответсвиеПоДокументам.Вставить(ПолучитьТипДокументаПоступления(МассивЛогаСобытий)     , "ДокументПоступления");
			СоответсвиеПоДокументам.Вставить("ЭКОМ_Документы"                                       , "ЭКОМ_Документ_DESADV");
					
		ИначеЕсли ТипДокумента = "ON_SCHFDOPPR" 
			ИЛИ ТипДокумента = "ON_NSCHFDOPPR" Тогда // Подходит для типа ON_NSCHFDOPPRMARK, ON_NSCHFDOPPRPROS (определяется в гибких настройках)
			
			СоответсвиеПоДокументам.Вставить(ПолучитьТипДокументаСчетФактураВыданный(МассивЛогаСобытий), "ДокументСЧФ");
			
		КонецЕсли;
				
		ИмяДокументаИсточника = СоответсвиеПоДокументам.Получить(СтрокиДерева.Имя);
		
	КонецЕсли;

	ДанныеПоНастройкам.Вставить("ИсходящееДерево"      , Новый ХранилищеЗначения(Дерево, Новый СжатиеДанных(9)));
	ДанныеПоНастройкам.Вставить("ИмяДокументаИсточника", ИмяДокументаИсточника);
	
	Возврат ДанныеПоНастройкам;
	
КонецФункции

Функция ПолучитьИмяДокументаИсточника(ДанныеПоКолонкам, ТипДокумента, МассивЛогаСобытий) Экспорт
	
	ДанныеПоНастройкам = ПолучитьДанныеПоИсходящимНастройкам(ДанныеПоКолонкам, ТипДокумента, МассивЛогаСобытий);	
	Возврат ДанныеПоНастройкам["ИмяДокументаИсточника"];
	
КонецФункции

Функция ПолучитьСтруктуруОшибки()
	
	Структура = Новый Структура;
	Структура.Вставить("ЕстьОшибка" , Ложь);
	Структура.Вставить("КодОшибки"  , "");
	Структура.Вставить("ТекстОшибки", "");
	Возврат Структура;
	
КонецФункции

// Функция выполняет код, указанный в колонке Данные и заполняет результатом колонку ДанныеЗначения
//
// Параметры:
//  xstocuav9a  - ДеревоЗначений - шаблон документа (Дерево)
//  МассивДокументов  - Массив - коллекция отправляемых документов (Документ)
//  xjq6vt118r  - Строка - номер исправления УПД с формы (НомерИсправления)
//
// sksa17twrs = Строка
// x9b4sfry2s = Результат
// kpbnmbyjuh = Код
//
Процедура ПолучитьДанныеДокументов(Шаблон_xstocuav9a, Источник, НомерИсправления_xjq6vt118r, МассивЛогаСобытий, Ошибка)
	
	ИмяСобытия = "Получение данных по гибким настройкам";
	Если Ошибка = Неопределено Тогда
		Ошибка = ПолучитьСтруктуруОшибки();
	КонецЕсли;
		
	Для Каждого Строка_sksa17twrs Из Шаблон_xstocuav9a.Строки Цикл
		
		Если Строка_sksa17twrs.Использовать = Истина И НЕ Строка_sksa17twrs.Строки.Количество() = 0 Тогда // Может быть код для выполнения
			
			Если ЗначениеЗаполнено(Строка_sksa17twrs.Данные) Тогда // Есть код для выполнения
				
				x9b4sfry2s = Неопределено;
				kpbnmbyjuh = ?(ЗначениеЗаполнено(НомерИсправления_xjq6vt118r), 
				"НомерИсправления = " + НомерИсправления_xjq6vt118r + ";" + Символы.ПС + Строка_sksa17twrs.Данные,
				"НомерИсправления = """";" + Символы.ПС + Строка_sksa17twrs.Данные);  ;
				kpbnmbyjuh = СтрЗаменить(kpbnmbyjuh, "¶" 			          , Символы.ПС);
				kpbnmbyjuh = СтрЗаменить(kpbnmbyjuh, "Возврат "               , "x9b4sfry2s = ");
				
				ЛогСобытий = ""; // Используется в гибких настройках
				Отказ = Ложь;
				Попытка				
					Выполнить(kpbnmbyjuh);
					
					Если НЕ ТипЗнч(x9b4sfry2s) = Тип("ТаблицаЗначений") 
						ИЛИ Отказ = Истина Тогда 						
						ТекстЛогаСобытий 	= "Критическая ошибка. Обработка документов остановлена";
						ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
						МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
						
						Возврат;
						
					КонецЕсли;
					Строка_sksa17twrs.ДанныеЗначения = x9b4sfry2s.Скопировать();
					Если ЗначениеЗаполнено(ЛогСобытий) Тогда
						ТекстЛогаСобытий = ЛогСобытий; 
						ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Информация, ИмяСобытия);
						МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
					КонецЕсли;
					 
				Исключение
					ОшибкаТекст     	= ОписаниеОшибки();
					ТекстЛогаСобытий    = "Критическая ошибка. Обработка документов остановлена. Ошибка выполнения кода из шаблона документа.";
					ТекстЛогаСобытий 	= ТекстЛогаСобытий + Символы.ПС + ОшибкаТекст + Символы.ПС + ОписаниеСтрокиГибкихНастроек(Строка_sksa17twrs);
					ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
					МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
					
					Ошибка.ТекстОшибки 	= ОшибкаТекст;
					Ошибка.ЕстьОшибка = Истина;
					
					Возврат;
					
				КонецПопытки;
				
			КонецЕсли;
			
			ПолучитьДанныеДокументов(Строка_sksa17twrs, Источник, НомерИсправления_xjq6vt118r, МассивЛогаСобытий, Ошибка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПолучитьДанныеДокуменов()

Процедура ОчиститьИсториюПоОтпрДокументам(ТипДокумента, МассивОтправленныхДок)

	Если ТипДокумента = "WHGOV_01_Исходящий" Тогда		
		
		МассивВидовДокументов = Новый Массив;
		МассивВидовДокументов.Добавить(Перечисления.ЭКОМ_ВидыДокументов.WHGOV_01_Исходящий);
		МассивВидовДокументов.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DRVGOV_02_Входящий);
		МассивВидовДокументов.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DRVGOU_03_Входящий);
		МассивВидовДокументов.Добавить(Перечисления.ЭКОМ_ВидыДокументов.WHGOU_04_Исходящий);
		МассивВидовДокументов.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DRVGPU_07_Входящий);
		МассивВидовДокументов.Добавить(Перечисления.ЭКОМ_ВидыДокументов.WHGPU_08_Входящий);

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭКОМ_Объекты_События.ВидДокумента,
		|	ЭКОМ_Объекты_События.Документ_Основание,
		|	ЭКОМ_Объекты_События.НаправлениеОбмена
		|ИЗ
		|	РегистрСведений.ЭКОМ_Объекты_События КАК ЭКОМ_Объекты_События
		|ГДЕ
		|	ЭКОМ_Объекты_События.Документ_Основание В(&МассивОтправленныхДок)
		|	И ЭКОМ_Объекты_События.ВидДокумента В(&МассивВидовДокументов)";
		
		Запрос.УстановитьПараметр("МассивВидовДокументов", МассивВидовДокументов);
		Запрос.УстановитьПараметр("МассивОтправленныхДок", МассивОтправленныхДок);
		
		РезультатЗапроса = Запрос.Выполнить();			
		Если НЕ РезультатЗапроса.Пустой() Тогда
		     Выборка = РезультатЗапроса.Выбрать();
			 Пока Выборка.Следующий() Цикл
				 
				 МЗ_События = РегистрыСведений.ЭКОМ_Объекты_События.СоздатьМенеджерЗаписи();
				 МЗ_События.Документ_Основание  = Выборка.Документ_Основание;
				 МЗ_События.ВидДокумента        = Выборка.ВидДокумента;
				 МЗ_События.Прочитать();
				 МЗ_События.Удалить();
				 
				 НЗ_ЦепочкаДокументов = РегистрыСведений.ЭКОМ_ЦепочкиДокументовЭТРН.СоздатьНаборЗаписей();
				 НЗ_ЦепочкаДокументов.Отбор.Накладная.Установить(Выборка.Документ_Основание);
				 НЗ_ЦепочкаДокументов.Прочитать();
				 
				 Если НЕ НЗ_ЦепочкаДокументов.Количество() = 0 Тогда
					 Для Каждого ЗаписьНабора Из НЗ_ЦепочкаДокументов Цикл
						 ЗаписьНабора.Статус_DRVGOV_02 = Ложь; 
						 ЗаписьНабора.Статус_DRVGOU_03 = Ложь;
						 ЗаписьНабора.Статус_WHGOU_04  = Ложь;
						 ЗаписьНабора.Статус_DRVGPU_07 = Ложь;
						 ЗаписьНабора.Статус_WHGPU_08  = Ложь;
						 ЗаписьНабора.СостояниеОбмена  = Перечисления.ЭКОМ_Статусы.ПустаяСсылка();
					 КонецЦикла;	
					 
					 НЗ_ЦепочкаДокументов.Записать();
				 КонецЕсли;				
			 КонецЦикла;			 
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

// Процедура формирует и отправляет XML документы по данным дерева значений
//
// Параметры:
//  Дерево  - ДеревоЗначений - макет документа XML, сожержащий в себе все формулы и значения для выгрузки
//  Сервер  - FTPСоединение - содинение с сервером по FTP
//	Тип	- Строка - тип отправляемого документа
//
Функция СозданиеДокументаПоШаблонуXML(Дерево, ТипДокумента, МассивЛогаСобытий, ЭтоРегламентноеЗадание, ПодписатьФайл)
	
	ИмяСобытия = "Создание XML документов по шаблону, модуль общего назначения";
	МассивСтруктур = Новый Массив;
	
	ВременныйКаталог = ПутьВременногоКаталогаЭКОМ("Send_xml");	
	
	КаталогВременный = ЭКОМ_СоздатьКаталогПроверитьНаЗапись(ВременныйКаталог, МассивЛогаСобытий);	
	Если КаталогВременный = Неопределено Тогда		
		Возврат МассивСтруктур;		
	КонецЕсли;
	
	Если Дерево.Строки.Количество() = 1 Тогда // По определению у нас должен быть только один макет для указанного типа документа
		ДокументыКоллекция = Дерево.Строки.Получить(0).ДанныеЗначения;
		Если НЕ ТипЗнч(ДокументыКоллекция) = Тип("ТаблицаЗначений") Тогда // И в корневой строке в столбце ДанныеЗначения должна быть таблица значений с документами
			Возврат МассивСтруктур;
		КонецЕсли;
	Иначе
		Возврат МассивСтруктур;
	КонецЕсли;
	
	Для Каждого Документ Из ДокументыКоллекция Цикл
		
		XMLДокумент        	= Новый ЗаписьXML;
		
		КодировкаXML = "UTF-8";
		Если Найти(ТипДокумента, "CONDRA") = 0  // Все подписанные файлы, кроме CONDRA
			И ПодписатьФайл = Истина Тогда
		    КодировкаXML = "WINDOWS-1251";
		КонецЕсли;
		
		ПараметрыЗаписиXML 	= Новый ПараметрыЗаписиXML(КодировкаXML, "1.0", Истина, Ложь, Символы.Таб); 
		XMLДокумент.УстановитьСтроку(КодировкаXML);
		XMLДокумент.ЗаписатьОбъявлениеXML();
		
		Служебные = СтрокаДереваВXML(Новый Структура("Документ", Документ), XMLДокумент, Дерево,,, Документ, МассивЛогаСобытий); // Создание файла XML					
		Если Служебные = Неопределено Тогда
			Возврат МассивСтруктур;
		ИначеЕсли ТипЗнч(Служебные) = Тип("Структура") 
			И Служебные.Отказ = Истина Тогда					
			Продолжить;
		КонецЕсли;
		
		ФайлИмя = Неопределено;
		Служебные.Свойство("ФайлИмя", ФайлИмя);
		Если НЕ ЗначениеЗаполнено(ФайлИмя) Тогда
			ТекстЛогаСобытий = "В гибких настройках не заполнены служебные поля!";
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

		     Возврат МассивСтруктур;
		КонецЕсли;
		
		СтруктураEDI = Новый Структура;
		СтруктураEDI.Вставить("СтрокаXML"     , Служебные.СтрокаXML);
		СтруктураEDI.Вставить("КодировкаФайла", КодировкаXML);
		
		Если НЕ ЗначениеЗаполнено(Служебные.СтрокаXML) Тогда	
			ТекстЛогаСобытий = "Файл не сформирован - " + ФайлИмя;
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

			Продолжить;
		ИначеЕсли Найти(ТипДокумента, "CONDRA") > 0 Тогда
			СтруктураEDI.Вставить("Идентификатор", Служебные.Идентификатор);
			СтруктураEDI.Вставить("Организация"  , Служебные.Организация);
			СтруктураEDI.Вставить("Статус"       , Служебные.Статус);
			
			ТипФайла = "CONDRA";
			СтруктураEDI.Вставить("ИмяФайлаXML", ФайлИмя);
			СтруктураEDI.Вставить("Сообщение"  , "");
			СтруктураEDI.Вставить("Отправлен"  , "");
			
		Иначе
			
			Статус = Перечисления.ЭКОМ_Статусы.Отправлен;
			
			Если Служебные.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_PRANNUL_22 Тогда	
				ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_PRANNUL_22;
				ТипФайла     = "DP_PRANNUL";
				
			ИначеЕсли Служебные.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_IZVPOL_23 Тогда	
				ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_IZVPOL_23;
				ТипФайла     = "DP_IZVPOL_23";
				
			ИначеЕсли Служебные.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_UVUTOCH_24 Тогда	
				ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_UVUTOCH_24;
				ТипФайла     = "DP_UVUTOCH_24";

			ИначеЕсли Найти(Служебные.Идентификатор, "ORDER") = 1 Тогда
				ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ORDER_Исходящий;
				ТипФайла     = "ORDER";
				
			ИначеЕсли Найти(Служебные.Идентификатор, "ORDRSP") = 1 Тогда	
				ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ORDRSP_Исходящий;
				ТипФайла     = "ORDRSP";
				
			ИначеЕсли Найти(Служебные.Идентификатор, "DESADV") = 1 Тогда	
				ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DESADV_Исходящий;
				ТипФайла     = "DESADV";
				
				// Записываем в цепочку поставщика номер и дату
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("Накладная", Служебные.Ссылка);
				
				ПараметрыЗаписи = Новый Структура;
				ПараметрыЗаписи.Вставить("DESADVNUMBER", Документ.NUMBER);
				ПараметрыЗаписи.Вставить("DESADVDATE"  , ДатаИзXML_в_1С(Документ.DATE));
				
				ЭКОМ_ЦепочкиДокументовПоставщикаЗаписать(ПараметрыОтбора, ПараметрыЗаписи);
							
			ИначеЕсли Найти(Служебные.Идентификатор, "RECADV") = 1 Тогда	
				ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.RECADV_Исходящий;
				ТипФайла     = "RECADV";
			ИначеЕсли Найти(Служебные.Идентификатор, "RETANN") = 1 Тогда	
				ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.RETANN_Исходящий;
				ТипФайла     = "RETANN";
			ИначеЕсли Найти(Служебные.Идентификатор, "RETINS") = 1 Тогда	
				ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.RETINS_Исходящий;
				ТипФайла     = "RETINS";	
			ИначеЕсли Найти(Служебные.Идентификатор, "DESSCC") = 1 Тогда	
				ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DESSCC_Исходящий;
				ТипФайла     = "DESSCC";
			ИначеЕсли Найти(Служебные.Идентификатор, "INVOICE") = 1 Тогда	
				ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.INVOICE;
				ТипФайла     = "INVOICE";
			ИначеЕсли Найти(Служебные.Идентификатор, "DP_UVUTOCH") = 1 Тогда	
				ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_UVUTOCH_09;
				Статус       = Перечисления.ЭКОМ_Статусы.Отправлен;
				ТипФайла     = "DP_UVUTOCH";
			ИначеЕсли Найти(Служебные.Идентификатор, "ON_SCHFDOPPR") = 1  Тогда	
				ВидДокумента = Служебные.ВидДокумента;
				ТипФайла     = "ON_SCHFDOPPR";
			ИначеЕсли Найти(Служебные.Идентификатор, "ON_KORSCHFDOPPR") = 1 Тогда	
				ВидДокумента = Служебные.ВидДокумента;
				ТипФайла     = "ON_KORSCHFDOPPR";
			ИначеЕсли Найти(Служебные.Идентификатор, "ON_NSCHFDOPPRMARK") = 1  Тогда	
				ВидДокумента = Служебные.ВидДокумента;
				ТипФайла     = "ON_NSCHFDOPPRMARK";
				
			ИначеЕсли Найти(Служебные.Идентификатор, "ON_NSCHFDOPPRPROS") = 1  Тогда	
				ВидДокумента = Служебные.ВидДокумента;
				ТипФайла     = "ON_NSCHFDOPPRPROS";
			ИначеЕсли Найти(Служебные.Идентификатор, "ON_NSCHFDOPPR") = 1  Тогда	
				ВидДокумента = Служебные.ВидДокумента;
				ТипФайла     = "ON_NSCHFDOPPR";
				
			ИначеЕсли Служебные.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.WHGOV_01_Исходящий  Тогда	
				ВидДокумента = Служебные.ВидДокумента;
				ТипФайла     = "WHGOV_01_Исходящий";
				
			ИначеЕсли Служебные.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.WHGOU_04_Исходящий  Тогда	
				ВидДокумента = Служебные.ВидДокумента;
				ТипФайла     = "WHGOU_04_Исходящий";
				
			ИначеЕсли Служебные.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.WHGPV_05_Исходящий Тогда	
				ВидДокумента = Служебные.ВидДокумента;
				ТипФайла     = "WHGPV_05_Исходящий";
				
			ИначеЕсли Служебные.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.WHGPU_08_Исходящий Тогда	
				ВидДокумента = Служебные.ВидДокумента;
				ТипФайла     = "WHGPU_08_Исходящий";
				
			ИначеЕсли Служебные.ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.WHGPU_08_Исходящий Тогда	
				ВидДокумента = Служебные.ВидДокумента;
				ТипФайла     = "WHGPU_08_Исходящий";
				
			ИначеЕсли Найти(Служебные.Идентификатор, "STATUS") = 1 Тогда	
				ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.STATUS;
				ТипФайла     = "STATUS";
				
			ИначеЕсли Найти(Служебные.Идентификатор, "DP_REZRUISP") = 1 Тогда	
				ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_REZRUISP_Исходящий;
				ТипФайла     = "DP_REZRUISP";
				
			ИначеЕсли Найти(Служебные.Идентификатор, "PRICAT") = 1 Тогда	
				ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.PRICAT_Исходящий;
				ТипФайла     = "PRICAT";
	
			КонецЕсли;
			
			СтруктураEDI.Вставить("Документ"              , Служебные.Ссылка);
			СтруктураEDI.Вставить("СтруктураДокумента"    , Служебные);
			СтруктураEDI.Вставить("Отправлен"             , Ложь);
			СтруктураEDI.Вставить("Сообщение"             , "");
			СтруктураEDI.Вставить("ЗаказДата"             , Служебные.ЗаказДата);					
			СтруктураEDI.Вставить("ЗаказНомер"            , Служебные.ЗаказНомер);
			СтруктураEDI.Вставить("Контрагент"            , Служебные.Контрагент);
			СтруктураEDI.Вставить("Организация"           , Служебные.Организация);
			СтруктураEDI.Вставить("ВидДокумента"          , ВидДокумента);
			СтруктураEDI.Вставить("ИмяФайлаXML"           , ФайлИмя);
			СтруктураEDI.Вставить("Статус"                , Статус);
			СтруктураEDI.Вставить("ТипФайла"              , ТипФайла);
			СтруктураEDI.Вставить("ИдентификаторИспр"     , ?(Служебные.Свойство("ИдентификаторИспр"), Служебные.ИдентификаторИспр, ""));							
			
		КонецЕсли;
		
		Если ПодписатьФайл = Истина Тогда 																				
			ДанныеПоОрганизации = ЭКОМ_GLN_Прочитать(Служебные.Организация);
			Если ДанныеПоОрганизации.СведенияЕсть = Ложь Тогда
				ТекстЛогаСобытий = "Нет данных о сертификате электронной подписи.";
				ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
				МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

				Продолжить;
			КонецЕсли;
			СтруктураEDI.Вставить("ДанныеСертификатаЭКОМ", ДанныеПоОрганизации.Сертификат);
			СтруктураEDI.Вставить("СертификатНаСервере"  , ДанныеПоОрганизации.Сертификат.СертификатНаСервере);
			
		КонецЕсли;
		
		МассивСтруктур.Добавить(СтруктураEDI);
		
	КонецЦикла;
		
	Возврат МассивСтруктур;
	
КонецФункции // СформироватьОтправитьXML()

// Функция получает настройки для выгрузки данных из документа 1С в файл XML
//
// Параметры
//  ТипТранзакции  	- Строка - тип исходящего документа
//
// Возвращаемое значение:
//   ДеревоЗначений	- содержит макет структуры исходящего документа с пользовательскими настройками
//
Функция ПолучитьСтруктуруФайлаДанных(ТипТранзакции) 
	
	ЭКОМ_СтруктураФайлаXMLВходящие 	= НастройкиПрочитатьНаСервере("СтруктураФайлаXMLВходящие", 	Новый ДеревоЗначений);
	ЭКОМ_СтруктураФайлаXMLИсходящие	= НастройкиПрочитатьНаСервере("СтруктураФайлаXMLИсходящие", Новый ДеревоЗначений);
	ЭКОМ_СтруктураФайлаXMLДокументы = НастройкиПрочитатьНаСервере("СтруктураФайлаXMLДокументы", Новый ДеревоЗначений);
	
	// Поиск по вкладке Исходящие.
	Результат	= ЭКОМ_СтруктураФайлаXMLИсходящие.Скопировать();
	Если НЕ Результат.Колонки.Найти("ТипТранзакции") = Неопределено Тогда
		Индекс 	= Результат.Строки.Количество() - 1;
		Пока НЕ Индекс < 0 Цикл
			Строка = Результат.Строки.Получить(Индекс);
			Если НЕ Строка.ТипТранзакции = ТипТранзакции Тогда
				Результат.Строки.Удалить(Строка);
			КонецЕсли;
			Индекс = Индекс - 1;
		КонецЦикла;
	КонецЕсли;
	
	// Поиск по вкладке Входящие.
	Если Результат.Строки.Количество() = 0 Тогда
		Результат	= ЭКОМ_СтруктураФайлаXMLВходящие.Скопировать();
		Если НЕ Результат.Колонки.Найти("ТипТранзакции") = Неопределено Тогда
			Индекс 		= Результат.Строки.Количество() - 1;
			Пока НЕ Индекс < 0 Цикл
				Строка = Результат.Строки.Получить(Индекс);
				Если НЕ Строка.ТипТранзакции = ТипТранзакции Тогда
					Результат.Строки.Удалить(Строка);
				КонецЕсли;
				Индекс = Индекс - 1;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	//Поиск по вкладке Документы.
	Если Результат.Строки.Количество() = 0 Тогда		
		Результат	= ЭКОМ_СтруктураФайлаXMLДокументы.Скопировать();
		Если НЕ Результат.Колонки.Найти("Кнопка") = Неопределено Тогда
			Индекс 		= Результат.Строки.Количество() - 1;
			Пока НЕ Индекс < 0 Цикл
				Строка = Результат.Строки.Получить(Индекс);
				Если НЕ Строка.Кнопка = ТипТранзакции Тогда
					Результат.Строки.Удалить(Строка);
				КонецЕсли;
				Индекс = Индекс - 1;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Индекс = Результат.Строки.Количество() - 1;
	Пока Индекс >= 0 Цикл
		Строка = Результат.Строки.Получить(Индекс);
		Если Не Строка.Использовать Тогда
			Результат.Строки.Удалить(Строка);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
	Возврат ?(Результат.Строки.Количество() = 0, Новый ДеревоЗначений, Результат);
	
КонецФункции // ПолучитьСтруктуруФайлаДанных()

// Функция возвращает строковое представление пути к указанному объекту конфигурации
//
// Параметры:
//  Дерево  	- ДеревоЗначений, СтрокаДереваЗначений - объект, хранящий структуру документа
//  ВидОбъекта  - Число - признак пути к объекту. Возможные значения: 1 - путь к документу, 2 - путь к табличной части документа
//  Колонка  	- Строка - имя колонки дерева значений, которая содержит синоним объекта конфигурации
//
// Возвращаемое значение:
//   Строка   - строковое представление пути к объекту дерева конфигурации
//
Функция ПолучитьСинонимИсточника(Дерево, Колонка, МассивЛогаСобытий)  // Приемник

	Если ТипЗнч(Дерево) = Тип("ДеревоЗначений") Тогда
		Если Дерево.Строки.Количество() = 0 Тогда
			Возврат Неопределено;
		Иначе
			Дерево = Дерево.Строки.Получить(0);
		КонецЕсли;
	ИначеЕсли НЕ ТипЗнч(Дерево) = Тип("СтрокаДереваЗначений") Тогда
		ТекстЛогаСобытий = "Ошибка в параметре функции.";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, "Получение синонима источника");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат Дерево[Колонка];
	
КонецФункции

Функция ОписаниеСтрокиГибкихНастроек(СтрокаНастроек, ВыполняемыйКод = Неопределено, Результат = "", ИмяНастройки = "ТипТранзакции") 
	
	Если ТипЗнч(СтрокаНастроек) <> Тип("СтрокаДереваЗначений") Тогда
		Возврат Результат;
	КонецЕсли;
	
	Владелец = СтрокаНастроек.Владелец();
	
	ИмяИсточника = "";
	ЗначениеИсточникаЗаполнено = Ложь;
	КолонкаИсточника = Владелец.Колонки.Найти("Источник");
	Если НЕ КолонкаИсточника = Неопределено Тогда
	    ИмяИсточника = СтрокаНастроек.Источник;
		Если ЗначениеЗаполнено(СтрокаНастроек.Источник) Тогда
		     ЗначениеИсточникаЗаполнено = Истина;
		КонецЕсли;
	КонецЕсли;
		
	ИмяПриемника = "";
	ЗначениеПриемникаЗаполнено = Ложь;
	КолонкаПриемник = Владелец.Колонки.Найти("Приемник");
	Если НЕ КолонкаПриемник = Неопределено Тогда
	    ИмяПриемника = СтрокаНастроек.Приемник;
		Если ЗначениеЗаполнено(СтрокаНастроек.Приемник) Тогда
		     ЗначениеПриемникаЗаполнено = Истина;
		КонецЕсли;
	КонецЕсли;

	Попытка
		ИмяНастройкиИзСтроки = СтрокаНастроек[ИмяНастройки];
	Исключение
		ИмяНастройки = ?(ИмяНастройки = "ТипТранзакции", "Кнопка", "ТипТранзакции");
	КонецПопытки;
	Если ЗначениеЗаполнено(СтрокаНастроек[ИмяНастройки]) = Ложь Тогда
		Если ТипЗнч(СтрокаНастроек.Родитель) = Тип("СтрокаДереваЗначений") Тогда
			Если ЗначениеИсточникаЗаполнено = Истина
				ИЛИ ЗначениеПриемникаЗаполнено = Истина
				И ЗначениеЗаполнено(Результат) = Ложь Тогда
				Результат = Результат + Символы.ПС + "Ошибка в коде настроек в строке вложенность: " + Строка(СтрокаНастроек.Уровень()) + Символы.ПС + 
				"Источник [" + ИмяИсточника + "], " + 
				"Приемник [" + ИмяПриемника + "]" + Символы.ПС
				;
			КонецЕсли;
			Результат = ОписаниеСтрокиГибкихНастроек(СтрокаНастроек.Родитель, "", Результат);
		Иначе
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаНастроек[ИмяНастройки]) = Истина Тогда
		Результат = Результат + "Место в гибких настройках: " + Символы.ПС + 
		"Действие [" + СтрокаНастроек[ИмяНастройки] + "], " + 
		"Источник [" + ИмяИсточника + "], " + 
		"Приемник [" + ИмяПриемника + "]";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция обходит дерево значений и заполняет XMLДокумент данными документа. Данные шапки и товаров получаем ранее. Здесь выполняется код обращения к данным из СтрокаТаблицыЗначений шапки и строк товаров.
//
// Параметры:
//  Документ  	 - СтрокаТаблицыЗначений - данные документа для записи в XML
//  XMLДокумент  - ЗаписьXML - запись XML, в которую будут записаны все данные
//  Дерево       - ДеревоЗначений - макет документа XML, сожержащий в себе все формулы и значения для выгрузки
//  ДанныеСтроки - СтрокаТаблицыЗначений, Неопределено - переменная используется внутри текущего метода для передачи строки товара для записи в XML. Не передается извне.
//  ПропуститьСтроку - Булево - флаг, определяющий пропуск следующей строки дерева. Используется для работы с товарами. Не передается извне.
Функция СтрокаДереваВXML(НаборДанных, XMLДокумент, Дерево, ДанныеСтроки = Неопределено, ПропуститьСтроку = Ложь, Документ, МассивЛогаСобытий, ТребуютЗаполнения = "")
	
	ИмяСобытия = "Формирование строки XML для документа";
	Если ПропуститьСтроку Тогда // Пропускаем строку товаров, так как ее уже отработали
		ПропуститьСтроку = Ложь;
	Иначе
		
		Для каждого СтрокаДЗ из Дерево.Строки Цикл
			
			СтрокаРодитель	= СтрокаДЗ;
			Использовать	= Истина;
			
			Пока НЕ СтрокаРодитель = Неопределено Цикл
				Использовать 	= ?(СтрокаРодитель.Использовать = Истина, Использовать, Ложь);
				СтрокаРодитель 	= СтрокаРодитель.Родитель;
			КонецЦикла;
			
			Если Использовать Тогда
				
				ВыводитьСтроку = Истина;
				
				// Проверка наличия условий для вывода ветки.
				Если НЕ СтрокаДЗ.Уровень() = 0 И ЗначениеЗаполнено(СтрокаДЗ.Служебные) Тогда
					Попытка
						УсловиеВыводитьСтроку = СтрЗаменить(СтрокаДЗ.Служебные, "Возврат ", "ВыводитьСтроку = ");
						Для Каждого Данные Из НаборДанных Цикл
							ПозицияКлюча = Найти(УсловиеВыводитьСтроку, Данные.Ключ);
							Если НЕ ПозицияКлюча = 0 Тогда
								УсловиеВыводитьСтроку = Лев(УсловиеВыводитьСтроку, ПозицияКлюча - 1)  + "НаборДанных." 
								+ Прав(УсловиеВыводитьСтроку, СтрДлина(УсловиеВыводитьСтроку) - ПозицияКлюча + 1);
							КонецЕсли;
						КонецЦикла;
						
						Выполнить(УсловиеВыводитьСтроку);
					Исключение
						Описание  = ОписаниеСтрокиГибкихНастроек(СтрокаДЗ);
						ТекстЛогаСобытий    = "Критическая ошибка. Обработка документов остановлена" + Символы.ПС + ОписаниеОшибки() + Символы.ПС + Описание;
						ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
						МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
				
						Возврат Неопределено;
						
					КонецПопытки;
				КонецЕсли;
				
				Если ВыводитьСтроку Тогда
					
					Если НЕ СтрокаДЗ.Строки.Количество() = 0 ИЛИ (ТипЗнч(СтрокаДЗ.Атрибуты) = Тип("СписокЗначений") И НЕ СтрокаДЗ.Атрибуты.Количество() = 0) Тогда
						XMLДокумент.ЗаписатьНачалоЭлемента(СтрокаДЗ.Приемник); // Первый раз тег записывается без значения (как будто  него есть подчиненные строки)
					КонецЕсли;
					
					Если СтрокаДЗ.Строки.Количество() = 0 Тогда // Сначала записываем атрибуты, а после данные (только для подчиненных строк)
						ЗаписатьАтрибутыXML(XMLДокумент, СтрокаДЗ, Документ, ДанныеСтроки, МассивЛогаСобытий, ТребуютЗаполнения);
					КонецЕсли;
					
					// Запись значений.
					Если НЕ СтрокаДЗ.Уровень() = 0 И ТипЗнч(СтрокаДЗ.Данные) = Тип("Строка") Тогда 
						
						Если (ТипЗнч(СтрокаДЗ.Связи) = Тип("СписокЗначений") ИЛИ ТипЗнч(СтрокаДЗ.Связи) = Тип("Соответствие"))
							И СтрокаДЗ.Связи.Количество() > 0 Тогда // Имеем дело с списком значений
							
							// Формируем структуру отбора строк товаров для текущего документа.
							Отборы = Новый Структура;
							Для Каждого Связь Из СтрокаДЗ.Связи Цикл
								Попытка
									Ключ = СтрЗаменить(Связь.Представление, СтрокаДЗ.Приемник + "." , "");
									Значение = Неопределено;
									Выполнить("Значение = НаборДанных." + Связь.Значение);
									Отборы.Вставить(Ключ, Значение);
								Исключение
									Описание = ОписаниеСтрокиГибкихНастроек(Связь);
									ТекстЛогаСобытий = "Ошибка установки связи. Обработка документов остановлена" + Символы.ПС + ОписаниеОшибки() + Символы.ПС + Описание;									
									ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
									МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

									Возврат Неопределено;
									
								КонецПопытки;
							КонецЦикла;
							
							// Обходим строки текущего документа.
							СтрокиТовары = СтрокаДЗ.ДанныеЗначения.НайтиСтроки(Отборы);
							Счетчик = 0;
							Для Каждого ДанныеСтроки Из СтрокиТовары Цикл
								
								Счетчик = Счетчик + 1;
								
								ЗаписатьАтрибутыXML(XMLДокумент, СтрокаДЗ, Документ, ДанныеСтроки, МассивЛогаСобытий, ТребуютЗаполнения);
								
								// Новый Функционал с сохранением текущей строки в структуру (для иерархии более 2-х таблиц)
								Если НЕ НаборДанных.Свойство(СтрокаДЗ.Приемник) Тогда
									НаборДанных.Вставить(СтрокаДЗ.Приемник, Неопределено);
								КонецЕсли;
								НаборДанных[СтрокаДЗ.Приемник] = ДанныеСтроки;
								// Конец нового функционала
								
								СтрокаДереваВXML(НаборДанных, XMLДокумент, СтрокаДЗ, ДанныеСтроки, ПропуститьСтроку, Документ, МассивЛогаСобытий, ТребуютЗаполнения); // Далее проверяем, если заполнена перем ДанныеСтроки, работаем как со строкой
								// Закрываем/открываем теги для каждой строки, кроме последней (она закроется ниже, а открывать более ничего не нужно).
								Если НЕ Счетчик = СтрокиТовары.Количество() Тогда
									XMLДокумент.ЗаписатьКонецЭлемента();
									XMLДокумент.ЗаписатьНачалоЭлемента(СтрокаДЗ.Приемник);
								КонецЕсли;
								
							КонецЦикла;
							
							ДанныеСтроки 		= Неопределено; // Очищаем данные строки, чтобы процедура не пыталась обработать последующий код как строку
							ПропуститьСтроку 	= Истина;
							
						ИначеЕсли НЕ ПустаяСтрока(СтрокаДЗ.Данные) Тогда
							Значение = "";
							Попытка
								Выполнить("Значение = НаборДанных." + СтрокаДЗ.Данные + ";");
							Исключение
								Описание            = ОписаниеСтрокиГибкихНастроек(СтрокаДЗ);
								ТекстЛогаСобытий    = "Критическая ошибка. Обработка документов остановлена." + Символы.ПС + ОписаниеОшибки() + Символы.ПС + Описание;					
								ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
								МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
								
								Возврат Неопределено;
								
							КонецПопытки;
							
							Если ТипЗнч(Значение) = Тип("Структура") 
								ИЛИ ТипЗнч(Значение) = Тип("Соответствие") Тогда // Структура(в старых настройках) или Соответствие(в новых) предназначена для инфополей
								
								// Удаление пустых значений.
								МассивУдаляемых = Новый Массив;
								Для Каждого ИнфоПоле Из Значение Цикл
									Если НЕ ЗначениеЗаполнено(ИнфоПоле.Значение) Тогда
										МассивУдаляемых.Добавить(ИнфоПоле.Ключ);
									КонецЕсли;
								КонецЦикла;
								
								Для Каждого Удаляемый Из МассивУдаляемых Цикл
									Значение.Удалить(Удаляемый);
								КонецЦикла;
								
								Счетчик = Значение.Количество();
								Для Каждого ИнфоПоле Из Значение Цикл
									XMLДокумент.ЗаписатьАтрибут("Идентиф", 	Строка(ИнфоПоле.Ключ));
									XMLДокумент.ЗаписатьАтрибут("Значен", 	Строка(ИнфоПоле.Значение)); // Проверить заполненность
									Если Счетчик > 1 Тогда
										XMLДокумент.ЗаписатьКонецЭлемента();
										XMLДокумент.ЗаписатьНачалоЭлемента(СтрокаДЗ.Приемник);
									КонецЕсли;
									Счетчик = Счетчик - 1;
								КонецЦикла;
														
							ИначеЕсли ТипЗнч(Значение) = Тип("Массив") Тогда // Массив предназначен для маркировки
								
								// Маркировка
								Счетчик = Значение.Количество();
								Для Каждого СтрокаМаркировки Из Значение Цикл
									ИдентТрансУпак = "";
									СтрокаМаркировки.Свойство("ИдентТрансУпак", ИдентТрансУпак);
									ИдентТрансУпак = ?(ЗначениеЗаполнено(ИдентТрансУпак), Строка(ИдентТрансУпак), "");
									Если ЗначениеЗаполнено(ИдентТрансУпак)  Тогда
									     XMLДокумент.ЗаписатьАтрибут("ИдентТрансУпак", 	Строка(ИдентТрансУпак));										 
									КонецЕсли;
									
									ЗаполненКИЗ     = Ложь;
									ЗаполненНомУпак = Ложь;
									ЗначенияКодов = "";
                                    СтрокаМаркировки.Свойство("ЗначенияКодов", ЗначенияКодов);
                                    ЗначенияКодов = ?(ЗначениеЗаполнено(ЗначенияКодов), ЗначенияКодов, Новый Массив);
									Для каждого СтрокаКодов Из СтрокаМаркировки.ЗначенияКодов Цикл
										КИЗ = "";
										СтрокаКодов.Свойство("КИЗ", КИЗ);
										КИЗ = ?(ЗначениеЗаполнено(КИЗ), Строка(КИЗ), "");
										Если ЗначениеЗаполнено(КИЗ) Тогда
											XMLДокумент.ЗаписатьНачалоЭлемента("КИЗ");
											XMLДокумент.ЗаписатьТекст(КИЗ);
											XMLДокумент.ЗаписатьКонецЭлемента();
											ЗаполненКИЗ = Истина;
										КонецЕсли;
										
										НомУпак = "";
										СтрокаКодов.Свойство("НомУпак", НомУпак);
										НомУпак = ?(ЗначениеЗаполнено(НомУпак), Строка(НомУпак), "");
										Если ЗначениеЗаполнено(НомУпак) Тогда
											XMLДокумент.ЗаписатьНачалоЭлемента("НомУпак");
											XMLДокумент.ЗаписатьТекст(НомУпак);
											XMLДокумент.ЗаписатьКонецЭлемента();
											ЗаполненНомУпак = Истина;
										КонецЕсли;						
									КонецЦикла;
									
									Если ЗаполненКИЗ = Истина 
										И ЗаполненНомУпак = Истина Тогда
										ТребуютЗаполнения = ТребуютЗаполнения + ?(ПустаяСтрока(ТребуютЗаполнения), "", Символы.ПС) 
										                    + "- " + Строка(СтрокаДЗ.Приемник) + " должен быть заполнен КИЗ или НомУпак (два тега одновременно не могут быть заполнены)!";
									КонецЕсли;
									
									Если Счетчик > 1 Тогда
										XMLДокумент.ЗаписатьКонецЭлемента();
										XMLДокумент.ЗаписатьНачалоЭлемента(СтрокаДЗ.Приемник);
									КонецЕсли;
									Счетчик = Счетчик - 1;
														
								КонецЦикла;
															
							ИначеЕсли ТипЗнч(Значение) = Тип("СписокЗначений") Тогда // Для всех
																						
								Для Каждого СтрокаМассива Из Значение Цикл
									
									// Теги <КолНеттоВс>10</КолНеттоВс>
									Если ТипЗнч(СтрокаМассива.Значение) = Тип("Строка") Тогда
										
										XMLДокумент.ЗаписатьНачалоЭлемента(СтрокаДЗ.Приемник);
										XMLДокумент.ЗаписатьТекст(СокрЛП(СтрокаМассива.Значение));
										XMLДокумент.ЗаписатьКонецЭлемента();
										
								    // Атрибуты <АдрРФ Индекс="117630" КодРегион="77" Город="г Москва" Улица="Профсоюзная"/> 
									ИначеЕсли  ТипЗнч(СтрокаМассива.Значение) = Тип("Структура") Тогда
										XMLДокумент.ЗаписатьНачалоЭлемента(СтрокаДЗ.Приемник);
										Для каждого ЭлСтруктуры Из СтрокаМассива.Значение Цикл
											
											Если ЗначениеЗаполнено(ЭлСтруктуры.Значение) Тогда
												XMLДокумент.ЗаписатьАтрибут(ЭлСтруктуры.Ключ, 	СокрЛП(ЭлСтруктуры.Значение));
											КонецЕсли;	
										КонецЦикла;
										XMLДокумент.ЗаписатьКонецЭлемента();
										
									// Теги и атрибуты <НомСредИдентТов ИдентТрансУпак="011">010460043993</НомСредИдентТов>
									ИначеЕсли  ТипЗнч(СтрокаМассива.Значение) = Тип("Соответствие") Тогда
										XMLДокумент.ЗаписатьНачалоЭлемента(СтрокаДЗ.Приемник);
										Для каждого ЭлСоответствия Из СтрокаМассива.Значение Цикл
											
											СтруктураАтрибутов = ЭлСоответствия.Ключ;	
											Для каждого ЭлСтруктуры Из СтруктураАтрибутов Цикл
												
												Если ЗначениеЗаполнено(ЭлСтруктуры.Значение) Тогда
													XMLДокумент.ЗаписатьАтрибут(ЭлСтруктуры.Ключ, 	СокрЛП(ЭлСтруктуры.Значение));
												КонецЕсли;	
											КонецЦикла;
											
											XMLДокумент.ЗаписатьТекст(СокрЛП(ЭлСоответствия.Значение));
								
										КонецЦикла;
										XMLДокумент.ЗаписатьКонецЭлемента();

									КонецЕсли;
								КонецЦикла;
								
							Иначе // Остальное обычные значения
								Значение = ?(ЗначениеЗаполнено(Значение), Строка(Значение), "");
								Если СтрокаДЗ.Обязательный = Истина И НЕ ЗначениеЗаполнено(Значение) Тогда
									ТребуютЗаполнения = ТребуютЗаполнения + ?(ПустаяСтрока(ТребуютЗаполнения), "", Символы.ПС) + "- " + Строка(СтрокаДЗ.Приемник) + ",данные " + СтрокаДЗ.Данные;
								КонецЕсли;
								Если НЕ ПустаяСтрока(Значение) Тогда
									ЗаписатьXML(XMLДокумент, Значение, СтрокаДЗ.Приемник); // Проверить заполненность
								КонецЕсли;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
					// Запись атрибутов.
					Если НЕ ПропуститьСтроку И НЕ СтрокаДЗ.Строки.Количество() = 0 Тогда // Сначала получаем данные, а после записываем атрибуты (только для корневых строк)
						ЗаписатьАтрибутыXML(XMLДокумент, СтрокаДЗ, Документ, ДанныеСтроки, МассивЛогаСобытий, ТребуютЗаполнения);
					КонецЕсли;
					
					СтрокаДереваВXML(НаборДанных, XMLДокумент, СтрокаДЗ, ДанныеСтроки, ПропуститьСтроку, Документ, МассивЛогаСобытий, ТребуютЗаполнения);
					
					Если НЕ СтрокаДЗ.Строки.Количество() = 0 ИЛИ (ТипЗнч(СтрокаДЗ.Атрибуты) = Тип("СписокЗначений") И НЕ СтрокаДЗ.Атрибуты.Количество() = 0) Тогда
						XMLДокумент.ЗаписатьКонецЭлемента();
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если СтрокаДЗ.Уровень() = 0 Тогда
				СтрокаXML = XMLДокумент.Закрыть();
				// Выполнение служебных настроек.
				СтруктураСлужебные = Новый Структура;
				СтруктураСлужебные.Вставить("СтрокаXML", СтрокаXML);
				СтруктураСлужебные.Вставить("Отказ"    , НЕ ПустаяСтрока(ТребуютЗаполнения));
				Если НЕ ПустаяСтрока(ТребуютЗаполнения) Тогда
					ТекстЛогаСобытий = "Ошибка отправки " + Документ.ВидДокумента + " на основании документа "
					+ Строка(Документ.Ссылка) + ". Необходимо проверить заполнение следующих реквизитов:"
					+ Символы.ПС + ТребуютЗаполнения;
					ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
					МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
				КонецЕсли;
				
				Для Каждого Служебные Из СтрокаДЗ.Служебные Цикл
					Если ЗначениеЗаполнено(Служебные.Значение) Тогда
						Значение = "";
						Попытка
							Выполнить("Значение = НаборДанных." + Служебные.Значение + ";");
						Исключение
							ТекстЛогаСобытий = "Критическая ошибка. Обработка документов остановлена" + Символы.ПС 
							+ ОписаниеОшибки() + Символы.ПС + ОписаниеСтрокиГибкихНастроек(Служебные);			
							ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
							МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
							
							Возврат Неопределено;
							
						КонецПопытки;
						СтруктураСлужебные.Вставить(Служебные.Ключ, Значение);
					КонецЕсли;
				КонецЦикла;
				
				Возврат СтруктураСлужебные;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции // СтрокаДереваВXML()

Функция ДатаИзXML_в_1С(Знач ДатаXML) 
	
	Если НЕ (ТипЗнч(ДатаXML) = Тип("Строка")
		ИЛИ ТипЗнч(ДатаXML) = Тип("Число")) Тогда	
	      Возврат Дата(0001, 01, 1);
	КонецЕсли;
	
	ЦифровойРяд = "0123456789";
	
	Год 	= "0001";
	Месяц 	= "01";
	День 	= "01";
	Час		= "00";
	Минута	= "00";
	Секунда	= "00";
	
	Дата 	= СокрЛП(Лев (ДатаXML, 10));
	Время 	= СокрЛП(Прав(ДатаXML, СтрДлина(ДатаXML) - 10));
	
	Если 		Найти(ЦифровойРяд, Сред(Дата, 3, 1)) = 0 Тогда // Сред(Дата, 3, 1) - 
		// "28х03х2019", где х - любой символ разделителя
		Год 	= Прав(СокрЛП(Дата), 4);
		Месяц 	= Сред(СокрЛП(Дата), 4, 2);
		День  	= Лев (СокрЛП(Дата), 2);
	ИначеЕсли 	Найти(ЦифровойРяд, Сред(Дата, 5, 1)) = 0 Тогда
		// "2019х03х28", где х - любой символ разделителя
		Год   = Лев (СокрЛП(Дата), 4);
		Месяц = Сред(СокрЛП(Дата), 6, 2);
		День  = Прав(СокрЛП(Дата), 2);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Время) И СтрДлина(Время) = 8 Тогда
		// "10х05х30", где х - любой символ разделителя
		Час		= Лев (СокрЛП(Время), 2);
		Минута	= Сред(СокрЛП(Время), 4, 2);
		Секунда	= Прав(СокрЛП(Время), 2);
	КонецЕсли;
	
	Попытка
		Результат  	= Дата(Год + Месяц + День + Час + Минута + Секунда);
	Исключение
		Результат 	= Дата(0001, 01, 1);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Пример структуры
//
//ПараметрыОтбора = Новый Структура;
//ПараметрыОтбора.Вставить("ORDERDATE"  , Служебные.ЗаказДата);
//ПараметрыОтбора.Вставить("ORDERNUMBER", Служебные.ЗаказНомер);
//ПараметрыОтбора.Вставить("Организация", Служебные.Организация);
//ПараметрыОтбора.Вставить("Контрагент", Служебные.Контрагент);
//ПараметрыОтбора.Вставить("Накладная", Служебные.Ссылка);
//ПараметрыЗаписи = Новый Структура;
//ПараметрыЗаписи.Вставить("DESADVNUMBER", Документ.NUMBER);
//ПараметрыЗаписи.Вставить("DESADVDATE"  , ДатаИзXML_в_1С(Документ.DATE);
//ПараметрыЗаписиДоп = Новый Структура;
Процедура ЭКОМ_ЦепочкиДокументовПоставщикаЗаписать(ПараметрыОтбора, ПараметрыЗаписи)
	
	НачатьТранзакцию();
	Попытка
		
		НаборЗаписей = РегистрыСведений.ЭКОМ_ЦепочкиДокументовПоставщика.СоздатьНаборЗаписей();
		Для каждого СтрОтбора Из ПараметрыОтбора Цикл
			Если ЗначениеЗаполнено(СтрОтбора.Значение) Тогда
			    НаборЗаписей.Отбор[СтрОтбора.Ключ].Установить(СтрОтбора.Значение);
			КонецЕсли;
			
		КонецЦикла;	
		
		//Выполним блокировку данных
		Выполнить("ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, ""ЭКОМ_ЦепочкиДокументовПоставщика"")");

		НаборЗаписей.Прочитать();
		
		/// Если существует документ в регистре
		Для Каждого НоваяЗапись Из НаборЗаписей Цикл
			Для каждого СтрЗаписи Из ПараметрыЗаписи Цикл
				НоваяЗапись[СтрЗаписи.Ключ] = СтрЗаписи.Значение;
			КонецЦикла;
			Если НЕ ЗначениеЗаполнено(НоваяЗапись.ДатаЗаписи) Тогда
				НоваяЗапись.ДатаЗаписи = ТекущаяДата();
			КонецЕсли;
		КонецЦикла;	
		
		// Записываем документ в первый раз
		Если НаборЗаписей.Количество() = 0 Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ДатаЗаписи = ТекущаяДата();
			
			Для каждого СтрОтбора Из ПараметрыОтбора Цикл
				НоваяЗапись[СтрОтбора.Ключ] = СтрОтбора.Значение;
			КонецЦикла;
			
			Для каждого СтрЗаписи Из ПараметрыЗаписи Цикл
				НоваяЗапись[СтрЗаписи.Ключ] = СтрЗаписи.Значение;
			КонецЦикла;			
		КонецЕсли;
		
		НаборЗаписей.Записать();	
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();		
	КонецПопытки;

КонецПроцедуры

Функция ЭКОМ_GLN_Прочитать(п_Объект)  
	Структура = Новый Структура;
	МенеджерЗаписи        = РегистрыСведений.ЭКОМ_GLN.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = п_Объект;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда	
		Структура.Вставить("СведенияЕсть", Истина);
		Для каждого Данные Из Метаданные.РегистрыСведений.ЭКОМ_GLN.Ресурсы  Цикл
			Структура.Вставить(Данные.Имя, МенеджерЗаписи[Данные.Имя]);		
		КонецЦикла;
		Структура.Вставить("Комментарий"                 , МенеджерЗаписи.Комментарий);		
	Иначе
		Структура.Вставить("СведенияЕсть"                , Ложь);
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции

// Процедура заполняет атрибуты XML документа из текущей строки
//
// Параметры:
//  XMLДокумент  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  СтрокаДЗ  - СтрокаДереваЗначений - строка дерева с атрибутами (или без)
//
Процедура ЗаписатьАтрибутыXML(XMLДокумент, СтрокаДЗ, Документ, ДанныеСтроки, МассивЛогаСобытий, ТребуютЗаполнения)
	
	Если ТипЗнч(СтрокаДЗ.Атрибуты) = Тип("СписокЗначений") Тогда
		
		Для Каждого Атрибут Из СтрокаДЗ.Атрибуты Цикл
			// Проверка незаполненной формулы при обязательном выводе значения.
			Если Атрибут.Пометка = Истина И НЕ ЗначениеЗаполнено(Атрибут.Представление) Тогда
				ТребуютЗаполнения = ТребуютЗаполнения + ?(ПустаяСтрока(ТребуютЗаполнения), "", Символы.ПС) + "- " + Строка(Атрибут.Значение);
				Продолжить;
			ИначеЕсли НЕ ЗначениеЗаполнено(Атрибут.Представление) Тогда
				Продолжить;
			КонецЕсли;
			
			ЗначениеАтрибута = "";
			
			Попытка
				Выполнить("ЗначениеАтрибута = " + Атрибут.Представление + ";");
			Исключение
				Если ЗначениеЗаполнено(ДанныеСтроки) И Найти(Атрибут.Представление, СтрокаДЗ.Приемник) = 1 Тогда
					Значение = СтрЗаменить(Атрибут.Представление, СтрокаДЗ.Приемник, "ДанныеСтроки");
					Попытка
						Выполнить("ЗначениеАтрибута = " + Значение + ";");
					Исключение
						// Ошибка при обязательном выводе значения.
						Если Атрибут.Пометка = Истина Тогда
							ТребуютЗаполнения = ТребуютЗаполнения + ?(ПустаяСтрока(ТребуютЗаполнения), "", Символы.ПС) + "- " + Строка(Атрибут.Значение);
						КонецЕсли;
						Продолжить;
					КонецПопытки;
				Иначе
					Попытка
						Выполнить("ЗначениеАтрибута = " + "ДанныеСтроки" + Прав(Атрибут.Представление, СтрДлина(Атрибут.Представление) - Найти(Атрибут.Представление, ".") + 1) + ";");
					Исключение
						// Ошибка при обязательном выводе значения.
						Если Атрибут.Пометка = Истина Тогда
							ТребуютЗаполнения = ТребуютЗаполнения + ?(ПустаяСтрока(ТребуютЗаполнения), "", Символы.ПС) + "- " + Строка(Атрибут.Значение);
						КонецЕсли;
						Продолжить;
					КонецПопытки;
				КонецЕсли;
			КонецПопытки;
			
			Попытка
				Если ЗначениеЗаполнено(ЗначениеАтрибута) Тогда
					XMLДокумент.ЗаписатьАтрибут(Атрибут.Значение, ЗначениеАтрибута);
				ИначеЕсли Атрибут.Пометка = Истина Тогда // Ошибка при обязательном выводе значения
					ТребуютЗаполнения = ТребуютЗаполнения + ?(ПустаяСтрока(ТребуютЗаполнения), "", Символы.ПС) + "- " + Строка(Атрибут.Значение);
				КонецЕсли;
			Исключение
				
				// Ошибка при обязательном выводе значения.
				Если Атрибут.Пометка = Истина Тогда
					ТребуютЗаполнения = ТребуютЗаполнения + ?(ПустаяСтрока(ТребуютЗаполнения), "", Символы.ПС) + "- " + Строка(Атрибут.Значение);
				КонецЕсли;
				
				ТекстЛогаСобытий = "Ошибка записи атрибута в XML файл. Ключ атрибута [" + Атрибут.Значение + "], значение атрибута [" 
				+ Строка(ЗначениеАтрибута) + "] тип значения [" + ТипЗнч(ЗначениеАтрибута) + "]" + Символы.ПС + ОписаниеОшибки();
				
				ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, "Заполнение атрибута XML документа");
				МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
				
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаписатьАтрибутыXML()

// Возвращает стандартную структуру сообщения об ошибке
Функция ПолучитьСтруктуруЛогаНаСервере() Экспорт
	Структура = Новый Структура;
	// Флаг ставиться в значение "Истина" если в ходе выполнения операции произошла ошибка. 
	//Если после выполнения команды в флаг сброшен, операция считается успешно выполненой
	Структура.Вставить("БлокировкаОперации" , Ложь);
	Структура.Вставить("ЕстьОшибка"         , Ложь); 
	Структура.Вставить("ТекстОшибки"        , "");
	Возврат Структура;
КонецФункции

// Возвращает структуру регистра ЭКОМ Логирование для заполнения
Функция ЗаписьСтруктурыЛогаНаСервере()
	Структура = Новый Структура;	
	Структура.Вставить("УровеньЛогирования" , "");
	Структура.Вставить("ИмяСобытия"         , "");
	Структура.Вставить("Комментарий"        , "");
	Структура.Вставить("НачалоВыполнения"   , Дата(0001, 01, 01));

	Возврат Структура;
КонецФункции

Функция ОтправитьВсеФайлы(МассивСтрок, ТипДокумента, МассивЛогаСобытий, НомерИсправления, ЭтоРегламентноеЗадание, ПодписатьФайл, СтруктураЛога) Экспорт 
	
	ИмяСобытия = "Формирование списка для отправки";
	МассивСтруктур = Новый Массив;
	ПродолжитьОбмен = ПроверитьУстановитьБлокировкуОперации(ТипДокумента, "Исходящий", МассивЛогаСобытий);

	Если ПродолжитьОбмен = Ложь Тогда
		Возврат Новый Массив;	
	КонецЕсли;
		
	Если ТипДокумента = "ORDRSP"
		ИЛИ ТипДокумента = "DESADV" 
		ИЛИ ТипДокумента = "INVOICE" 
		ИЛИ ТипДокумента = "DESSCC"
		ИЛИ ТипДокумента = "RETINS"
		ИЛИ ТипДокумента = "ORDER"
		ИЛИ ТипДокумента = "ORDERS"
		ИЛИ	ТипДокумента = "RETORD"
		ИЛИ	ТипДокумента = "RECADV"
		ИЛИ ТипДокумента = "WHGOV_01_Исходящий" 
		ИЛИ ТипДокумента = "WHGPV_05_Исходящий" 
		ИЛИ ТипДокумента = "STATUS" 
		ИЛИ ТипДокумента = "ON_SCHFDOPPR" 
		ИЛИ ТипДокумента = "ON_NSCHFDOPPR"
		ИЛИ ТипДокумента = "ON_SCHFDOPPR_01"    //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _01. 2 этап]
		ИЛИ ТипДокумента = "ON_NSCHFDOPPR_01"   //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _01. 2 этап]
		ИЛИ ТипДокумента = "WHGOU_04_Исходящий"
		ИЛИ ТипДокумента = "WHGPU_08_Исходящий"
		ИЛИ Найти(ТипДокумента, "CONDRA") > 0
		ИЛИ Найти(ТипДокумента, "DP_PRANNUL") > 0 
		ИЛИ ТипДокумента = "DP_IZVPOL_23"
		ИЛИ ТипДокумента = "DP_UVUTOCH_24"
		ИЛИ ТипДокумента = "DP_REZRUISP" 
		ИЛИ ТипДокумента = "PRICAT" Тогда
		
		МассивСтруктур = СформироватьДокументыXML(МассивСтрок, МассивЛогаСобытий, ЭтоРегламентноеЗадание, ТипДокумента, ПодписатьФайл, НомерИсправления);
		
    Иначе	
		ТекстЛогаСобытий = "!!! Данный тип файла не поддерживается для отправки.";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

    КонецЕсли;
		
	Если МассивСтруктур.Количество() = 0 Тогда
		ЭКОМ_ОбщегоНазначения.СнятьБлокировкуОперации(ТипДокумента, "Исходящий", МассивЛогаСобытий);	
	КонецЕсли;
	
	Возврат МассивСтруктур;
	
КонецФункции

// Функция проверяет возможность заблокировать указанную операцию и в случае такой возможности блокирует ее
//
// Параметры:
//  ИмяОперации  - Строка - наименование операции для блокировки
//
// Возвращаемое значение:
//   Структура   - информация о блокировке операции
//
Функция ПроверитьУстановитьБлокировкуОперации(ТипДокумента, НаправлениеОбмена, МассивЛогаСобытий) 
	
	// В случае ошибки добавим в массив текст лога 
	ТекстЛогаСобытий = "Процесс " + НаправлениеОбмена + " - " + ТипДокумента + " уже запущен другим пользователем(%время%). 
				|Для ручной разблокировки (в случае неудачного завершения работы) перейдите в Настройки - Хранение данных и нажмите кнопку <<<Разблокировать обмен>>>";

	ПродолжитьОбмен = Ложь;
	ИмяОперации = "Блокировка" + НаправлениеОбмена + "_" + ТипДокумента;
	Блокировать = ПолучитьРежимУправленияБлокировкойДанныхПоУмолчанию(); 	
	// Установка блокировки
	НачатьТранзакцию();
	Попытка
		
		Если Блокировать = Истина Тогда
			БлокировкаДанных 		= Новый БлокировкаДанных;
			ЭлементБлокировки 		= БлокировкаДанных.Добавить("РегистрСведений.ЭКОМ_ЗначениеДополнительныхКонстант");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("ДополнительнаяКонстанта", ИмяОперации);
			ЭлементБлокировки.УстановитьЗначение("Измерение", "Блокировка");
			БлокировкаДанных.Заблокировать();	
		КонецЕсли;

		// Читаем настройки и записываем если процесс еще не запущен. 
		МенеджерЗаписи = РегистрыСведений.ЭКОМ_ЗначениеДополнительныхКонстант.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ДополнительнаяКонстанта = ИмяОперации;
		МенеджерЗаписи.Измерение               = "Блокировка";
		МенеджерЗаписи.Прочитать();	
		Если МенеджерЗаписи.Выбран() Тогда			
			ВремяНачалаБлокировки = ?(ТипЗнч(МенеджерЗаписи.ЗначениеДополнительнойКонстанты) = Тип("Булево"), Дата(0001, 01, 01), МенеджерЗаписи.ЗначениеДополнительнойКонстанты);
			ВремяБлокировки = (ТекущаяДата() - ВремяНачалаБлокировки)/(60*60);
			Если ВремяБлокировки <= 3 Тогда // если меньше 3 часов 
				
				МассивЛогаСобытий.Добавить(СтрЗаменить(ТекстЛогаСобытий, "%время%", ВремяНачалаБлокировки));
				
			Иначе
				МенеджерЗаписи.ЗначениеДополнительнойКонстанты = ТекущаяДата();
				МенеджерЗаписи.Записать();
				
				ПродолжитьОбмен = Истина;
				
			КонецЕсли;
		Иначе
			МенеджерЗаписи.ДополнительнаяКонстанта         = ИмяОперации;
			МенеджерЗаписи.Измерение                       = "Блокировка";
			МенеджерЗаписи.ЗначениеДополнительнойКонстанты = ТекущаяДата();
			МенеджерЗаписи.Записать();
			
			ПродолжитьОбмен = Истина;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();	
		МассивЛогаСобытий.Добавить(ОписаниеОшибки() + " - " + ТекстЛогаСобытий);
	КонецПопытки;
	
	Возврат ПродолжитьОбмен;
	
КонецФункции // ПроверитьУстановитьБлокировкуОперации()

Функция ПолучитьРежимУправленияБлокировкойДанныхПоУмолчанию() 
	
	// Автоматический - все транзакции, будут выполняться в автоматическом режиме.
	// АвтоматическийИУправляемый  - транзакции, будут выполняться в режиме, определяемом установкой соответствующего свойства объекта метаданных.
	// Управляемый - все транзакции, будут выполняться в управляемом режиме. 
	Блокировать = Ложь;
	Если Метаданные.РежимУправленияБлокировкойДанных = Метаданные.Свойстваобъектов.РежимУправленияБлокировкойДанныхПоУмолчанию.Управляемый Тогда
		Блокировать = Истина;
	КонецЕсли;
	
	Возврат Блокировать;
	
КонецФункции // ПолучитьРежимУправленияБлокировкойДанныхПоУмолчанию()

// Функция возвращает уникальный номер транзакции 
//
// Параметры:
//  ПредыдущийНомер  - Число - номер предыдущей транзакции при обработке массива документов в цикле.
//
// Возвращаемое значение:
//   Число   - номер текущей транзакции
//
Функция НовыйНомерТранзакции(ПредыдущийНомер) Экспорт
	
	Если НЕ ТипЗнч(ПредыдущийНомер) = Тип("Число") Тогда		
		ТекстЛогаСобытий = "Критическая ошибка. Обработка документов остановлена. Параметр процедуры не является числом";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, "Получение нового номера транзакции");
		ЗаписатьСтрокуЛогаСобытийвРегистрЛогирование(ЗаписьСтруктурыЛога);
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ТекущийНомер = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Если ТекущийНомер <= ПредыдущийНомер Тогда
		ТекущийНомер = ПредыдущийНомер + 1;
	КонецЕсли;
	
	Возврат ТекущийНомер;
	
КонецФункции 

Процедура ОтправитьФайлы(ОбщийМассивФайлов, ТипДокумента, МассивЛогаСобытий, ЭтоРегламентноеЗадание, СтруктураЛога) Экспорт
	
	ИмяСобытия = "Отправить файлы, модуль общего назначения";
	КоличествоФайлов = ОбщийМассивФайлов.Количество();
	Если КоличествоФайлов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВременныйКаталог = ПутьВременногоКаталогаЭКОМ("Send_file");	
	КаталогВременный = ЭКОМ_СоздатьКаталогПроверитьНаЗапись(ВременныйКаталог, МассивЛогаСобытий);	
	Если КаталогВременный = Неопределено Тогда		
		Возврат;		
	КонецЕсли;
	
	ТипОбменаЭТРН = Ложь;
	Если ТипДокумента = "WHGOV_01_Исходящий"  
		ИЛИ ТипДокумента = "WHGOU_04_Исходящий" 
		ИЛИ ТипДокумента = "WHGPV_05_Исходящий"  
		ИЛИ ТипДокумента = "WHGPU_08_Исходящий" Тогда	
		ТипОбменаЭТРН = Истина;
	КонецЕсли;
	
	// Разделим файлы для отправки
	СоответствиеПрофилей = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭКОМ_GLN.ПрофильОбмена КАК ПрофильОбмена,
	|	ЭКОМ_GLN.Объект КАК Организация
	|ИЗ
	|	РегистрСведений.ЭКОМ_GLN КАК ЭКОМ_GLN
	|ГДЕ
	|	НЕ ЭКОМ_GLN.ПрофильОбмена = ЗНАЧЕНИЕ(Справочник.ЭКОМ_ПрофилиОбмена.ПустаяСсылка)
	|	И НЕ ЭКОМ_GLN.ПрофильОбмена.ПометкаУдаления
	|	И ЭКОМ_GLN.ПрофильОбмена.Активный = ИСТИНА
	|ИТОГИ ПО
	|	ПрофильОбмена";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаПрофильОбмена = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПрофильОбмена.Следующий() Цикл
			ПрофильОбмена = ВыборкаПрофильОбмена.ПрофильОбмена;
			МассивПоПрофилям = Новый Массив;
			Выборка = ВыборкаПрофильОбмена.Выбрать();
			Пока Выборка.Следующий() Цикл				
				Для каждого СтрокаМассива Из ОбщийМассивФайлов Цикл	
					Если СтрокаМассива.Организация = Выборка.Организация Тогда
						МассивПоПрофилям.Добавить(СтрокаМассива);
					КонецЕсли;
				КонецЦикла;		
			КонецЦикла;	
			СоответствиеПрофилей.Вставить(ПрофильОбмена, МассивПоПрофилям);
		КонецЦикла;	 
	Иначе
		ТекстЛогаСобытий = "Выберите в настройках профиль обмена по организации." + Символы.ПС + "Не заполнен профиль обмена в справочнике <<<ЭКОМ Профили обмена>>>!";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

	КонецЕсли;
	
	Для каждого КлючЗначение Из СоответствиеПрофилей Цикл
		ПрофильОбмена = КлючЗначение.Ключ; 
		МассивФайловВсего = КлючЗначение.Значение;
		
		Если МассивФайловВсего.Количество() = 0 Тогда
		     Продолжить;
		КонецЕсли;
		
		Если ТипОбменаЭТРН = Истина Тогда
			знИспользоватьАПИ = ПрофильОбмена.ЭТРН_ОбменПоSOAP;
		Иначе
			знИспользоватьАПИ = ПрофильОбмена.ОбменПоSOAP;
		КонецЕсли;
				
		Если ПрофильОбмена.ПроверятьФайлыЛокально = Ложь Тогда
			Если знИспользоватьАПИ Тогда
				
				ЭтоКазахстан = ПрофильОбмена.Страна = "kz";
				
				// Делим файлы на пакеты для отправки по SOAP - ограничение веб сервиса
				ПакетФайлов = Новый Структура;
				
				НомерПоПорядку	= 0;
				Соответствие   	= Новый Соответствие;
				КоличествоФайловВПакете = ?(ПрофильОбмена.КоличествоФайловВПакете = 0, 500, ПрофильОбмена.КоличествоФайловВПакете);
				
				Для Каждого Элемент Из МассивФайловВсего Цикл
					
					НомерПоПорядку = НомерПоПорядку + 1;
					Соответствие.Вставить(Элемент, НомерПоПорядку);
					
					Если Соответствие.Количество() = КоличествоФайловВПакете Тогда
						ПакетФайлов.Вставить("Часть" + Формат(ПакетФайлов.Количество() + 1, "ЧГ=0"), Соответствие);
						Соответствие = Новый Соответствие;
					КонецЕсли;
					
				КонецЦикла;
				
				// Добавляем последний пакет, если он не был добавлен в цикле (неполный пакет).
				Если НЕ Соответствие.Количество() = КоличествоФайловВПакете
					И НЕ Соответствие.Количество() = 0 Тогда
					ПакетФайлов.Вставить("Часть" + Формат(ПакетФайлов.Количество() + 1, "ЧГ=0"), Соответствие);
				КонецЕсли;
				
				Для каждого ЭлементПакета Из ПакетФайлов Цикл
					
					МассивФайлов = Новый Массив;
					Для каждого ЭлИменаФайлов Из ЭлементПакета.Значение Цикл
						МассивФайлов.Добавить(ЭлИменаФайлов.Ключ);
					КонецЦикла;
					
					Если ЭтоКазахстан Тогда
						
						Для Каждого СтруктураEDI Из МассивФайлов Цикл					
							
							ФайлXML = ПолучитьФайлДокумента(СтруктураEDI, ВременныйКаталог);						
							Если ФайлXML = Неопределено Тогда
								Продолжить;
							КонецЕсли;
							ДвоичныеДанныеФайлаXML = Новый ДвоичныеДанные(ФайлXML.ПолноеИмя);
							
							ОдноИмяФайла = Новый Массив;
							ОдноИмяФайла.Добавить(ФайлXML.Имя);
														
							Рез	= Вычислить("ЭКОМ_ОбщегоНазначения.НовыйSOAPОбращение(ПрофильОбмена, ""sendDoc"", ОдноИмяФайла, ДвоичныеДанныеФайлаXML, МассивЛогаСобытий)");
														
							Если Рез.errorCode = "" Тогда								
								ТекстЛогаСобытий    = "Нет данных об ответе или ответ сформирован не верно";		
								ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
								МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
								
								Возврат;
								
							ИначеЕсли Рез.errorCode = "0" Тогда			
								
								СтруктураEDI.Сообщение = " успешно отправлен через интерфейс API на платформу Exite Evolution";
								СтруктураEDI.Отправлен = Истина;
								
							Иначе								
								// Все документы не отправлены. Сообщаем об этом.			
								ТекстЛогаСобытий = "Ошибка отправки файла " + СтруктураEDI.ИмяФайлаXML;
								ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
								МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
								
							КонецЕсли;
							
						КонецЦикла;	
						
					Иначе
						// Создаем архив с файлами для отправки по SOAP
						ИмяZipФайла =  ВременныйКаталог + ТипДокумента + "_" + ЭлементПакета.Ключ + "_" + Формат(ТекущаяДата(), "ДФ=ddMMyyhhmmss" ) + ".zip";
						ЗаписьZIP   = Новый ЗаписьZipФайла(
						ИмяZipФайла,
						"", // пароль на архив (оставим пустой)
						"Этот архив создан из 1с", // комментарий к архиву
						МетодСжатияZIP.Сжатие, // сжатие или копирование
						УровеньСжатияZIP.Оптимальный,
						МетодШифрованияZIP.Zip20
						);
						
						Если ТипДокумента = "ON_SCHFDOPPR_01"          //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _01. 2 этап]
							ИЛИ ТипДокумента = "ON_NSCHFDOPPR_01"      //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _01. 2 этап]
							ИЛИ ТипДокумента = "ON_NSCHFDOPPRPROS_01"  //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _01. 2 этап]
							ИЛИ ТипДокумента = "ON_NSCHFDOPPRMARK_01"  //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _01. 2 этап]
							ИЛИ ТипДокумента = "ON_KORSCHFDOPPR_01"    //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _01. 2 этап]
							ИЛИ ТипДокумента = "DP_REZRUISP"
							ИЛИ Найти(ТипДокумента, "CONDRA") > 0 Тогда  
							
							Для Каждого СтруктураEDI Из МассивФайлов Цикл					
								
								НеобходимаПодпись = Ложь;
								ФайлBIN = ПолучитьФайлПодписи(СтруктураEDI, НеобходимаПодпись, ВременныйКаталог);						
								Если НеобходимаПодпись = Истина 
									И ФайлBIN = Неопределено Тогда
									Продолжить;
								КонецЕсли;
								
								ФайлДанных = Неопределено;
								Если СтруктураEDI.Свойство("ИмяФайлаДанных") Тогда
									ПолноеИмяФайлаДанных = ВременныйКаталог + СтруктураEDI.ИмяФайлаДанных;
									СтруктураEDI.ДвоичныеДанныеФайлаДанных.Записать(ПолноеИмяФайлаДанных);
									
									ФайлДанных = Новый Файл(ПолноеИмяФайлаДанных);
									Если НЕ ФайлДанных.Существует() Тогда
										ФайлДанных = Неопределено;
									КонецЕсли;
									СтруктураEDI.Вставить("ПолноеИмяФайлаДанных", ПолноеИмяФайлаДанных);
								КонецЕсли;
								
								ФайлXML = ПолучитьФайлДокумента(СтруктураEDI, ВременныйКаталог);						
								Если ФайлXML = Неопределено Тогда
									Продолжить;
								КонецЕсли;
								
								// Создаем архив с файлами ЮЗД
								ИмяZipФайлаЮЗД = ВременныйКаталог + ФайлXML.ИмяБезРасширения + ".zip";
								ЗаписьZIP_ЮЗД  = Новый ЗаписьZipФайла(
								ИмяZipФайлаЮЗД,
								"", // пароль на архив (оставим пустой)
								"Этот архив создан из 1с", // комментарий к архиву
								МетодСжатияZIP.Сжатие, // сжатие или копирование
								УровеньСжатияZIP.Оптимальный,
								МетодШифрованияZIP.Zip20
								);
								
								Если Найти(ТипДокумента, "CONDRA") > 0 Тогда
									// Переименовываем xml файл в condra.xml
									ПереместитьФайл(ФайлXML.ПолноеИмя, ФайлXML.Путь + "condra.xml");
									ЗаписьZIP_ЮЗД.Добавить(ФайлXML.Путь + "condra.xml");
								Иначе
									ЗаписьZIP_ЮЗД.Добавить(ФайлXML.ПолноеИмя);
								КонецЕсли;
								
								Если НЕ ФайлBIN = Неопределено Тогда
									ЗаписьZIP_ЮЗД.Добавить(ФайлBIN.ПолноеИмя);
								КонецЕсли;
								
								Если НЕ ФайлДанных = Неопределено Тогда
									ЗаписьZIP_ЮЗД.Добавить(ФайлДанных.ПолноеИмя);
								КонецЕсли;
								
								ЗаписьZIP_ЮЗД.Записать();
								
								Если Найти(ТипДокумента, "CONDRA") > 0 Тогда
									// Возвращаем старое название файлу xml.
									ПереместитьФайл(ФайлXML.Путь + "condra.xml", ФайлXML.ПолноеИмя);
								КонецЕсли;
								
								ЗаписьZIP.Добавить(ИмяZipФайлаЮЗД);
								СтруктураEDI.Вставить("ИмяАрхива", ИмяZipФайлаЮЗД);
								
							КонецЦикла;
							
						Иначе	
							
							Для Каждого СтруктураEDI Из МассивФайлов Цикл					
								
								НеобходимаПодпись = Ложь;
								ФайлBIN = ПолучитьФайлПодписи(СтруктураEDI, НеобходимаПодпись, ВременныйКаталог);						
								Если НеобходимаПодпись = Истина 
									И ФайлBIN = Неопределено Тогда
									Продолжить;
								КонецЕсли;
								
								ФайлXML = ПолучитьФайлДокумента(СтруктураEDI, ВременныйКаталог);						
								Если ФайлXML = Неопределено Тогда
									Продолжить;
								КонецЕсли;
								
								ЗаписьZIP.Добавить(ФайлXML.ПолноеИмя);
								Если НеобходимаПодпись = Истина Тогда
									ЗаписьZIP.Добавить(ФайлBIN.ПолноеИмя);				
								КонецЕсли;
							КонецЦикла;	
							
						КонецЕсли;
						
						ЗаписьZIP.Записать();
						
						Рез	= Вычислить("ЭКОМ_ОбщегоНазначения.НовыйSOAPОбращение(ПрофильОбмена, ""sendDocumentsRequest"", , Новый ДвоичныеДанные(ИмяZipФайла), МассивЛогаСобытий)");
												
						// Удалим файлы
						Попытка
							УдалитьФайлы(ИмяZipФайла);		
						Исключение
							ТекстЛогаСобытий = ОписаниеОшибки();
							ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
							МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

						КонецПопытки;
						
						Если Рез.errorCode = "" Тогда						
							ТекстЛогаСобытий = "Нет данных об ответе или ответ сформирован не верно";		
							ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
							МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
							
							Возврат;
							
						ИначеЕсли Рез.errorCode = "0" Тогда			
							Для Каждого СтруктураEDI Из МассивФайлов Цикл
								СтруктураEDI.Сообщение = " успешно отправлен через интерфейс API на платформу Exite Evolution";
								СтруктураEDI.Отправлен = Истина;				
							КонецЦикла;
						Иначе
							// Все документы не отправлены. Сообщаем об этом.
							Для Каждого СтруктураEDI Из МассивФайлов Цикл					
								ТекстЛогаСобытий = "Ошибка отправки файла " + СтруктураEDI.ИмяФайлаXML;
								ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
								МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

							КонецЦикла;	
						КонецЕсли;
						
					КонецЕсли;	
				КонецЦикла;
				
			Иначе
				// Отправим на сервер по FTP
				Сервер = ПолучитьFTPСоединение(ПрофильОбмена, ТипОбменаЭТРН, МассивЛогаСобытий);	
				Если Сервер = Неопределено Тогда
					ТекстЛогаСобытий = "Отсутствует подключение к FTP!";
					ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
					МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

					Возврат;
				КонецЕсли;
				
				Для Каждого СтруктураEDI Из МассивФайловВсего Цикл
					
					НеобходимаПодпись = Ложь;
					ФайлBIN = ПолучитьФайлПодписи(СтруктураEDI, НеобходимаПодпись, ВременныйКаталог);						
					Если НеобходимаПодпись = Истина 
						И ФайлBIN = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					ФайлXML = ПолучитьФайлДокумента(СтруктураEDI, ВременныйКаталог);						
					Если ФайлXML = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					ФайлОтправлен = ОтправитьФайлыВНужномФорматеПоТипуДокументаПоFTP(ФайлXML, ФайлBIN, ТипДокумента, Сервер, ВременныйКаталог, МассивЛогаСобытий, ПрофильОбмена, ТипОбменаЭТРН);
					
					Если ФайлОтправлен = Истина Тогда
						СтруктураEDI.Сообщение = " успешно отправлен по FTP в каталог outbox платформы Exite Evolution";
						СтруктураEDI.Отправлен = Истина;						
					КонецЕсли;
					
				КонецЦикла; 
				
			КонецЕсли;		
			
			// Локально
		Иначе
			Для Каждого СтруктураEDI Из МассивФайловВсего Цикл
				
				НеобходимаПодпись = Ложь;
				ФайлBIN = ПолучитьФайлПодписи(СтруктураEDI, НеобходимаПодпись, ВременныйКаталог);						
				Если НеобходимаПодпись = Истина 
					И ФайлBIN = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ФайлXML = ПолучитьФайлДокумента(СтруктураEDI, ВременныйКаталог);						
				Если ФайлXML = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				СтруктураEDI.Сообщение = " записан в локальный каталог outbox.";
				СтруктураEDI.Отправлен = Истина;
				
			КонецЦикла;	
		КонецЕсли;
		
		НомПП = 0;
		Для Каждого СтруктураEDI Из МассивФайловВсего Цикл			
			
			Если СтруктураEDI.Отправлен Тогда
				
				НомПП = НомПП + 1;
				
				Если Найти(ТипДокумента, "CONDRA") > 0 Тогда // Для кондры используем другой регистр.
					
					Если ПустаяСтрока(СтруктураEDI.Идентификатор) Тогда
						ТекстЛогаСобытий = "Ошибка отправки файла " + СтруктураEDI.ИмяФайлаXML + ". Не указан идентификатор цепочки (TRANSGUID).";
						ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
						МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

					Иначе
						
						МенеджерЗаписи = РегистрыСведений.ЭКОМ_ЦепочкиНеструктурированныхДокументов.СоздатьМенеджерЗаписи();
						МенеджерЗаписи.TRANSGUID 			= СтруктураEDI.Идентификатор;
						//МенеджерЗаписи.НаправлениеОбмена 	= ПредопределенноеЗначение("Перечисление.ЭКОМ_НаправлениеОбмена.Исходящий");
						МенеджерЗаписи.Прочитать();
						
						Если МенеджерЗаписи.Выбран() Тогда
							МенеджерЗаписи.Статус = СтруктураEDI.Статус;
							МенеджерЗаписи.Действие = Перечисления.ЭКОМ_ТребуемоеДействиеCONDRA[Строка(СтруктураEDI.Статус)];
							МенеджерЗаписи.ДатаПоследнейТранзакции = ТекущаяДатаСеанса();
							МенеджерЗаписи.Записать();
							СтруктураEDI.Вставить("Документ", МенеджерЗаписи.ДокументОригинала);
							// Удаление записи с данными после первой отправки.
							МенеджерЗаписи = РегистрыСведений.ЭКОМ_НеструктурированныеДокументы.СоздатьМенеджерЗаписи();
							МенеджерЗаписи.TRANSGUID = СтруктураEDI.Идентификатор;
							МенеджерЗаписи.Прочитать();
							Если МенеджерЗаписи.Выбран() Тогда
								МенеджерЗаписи.Удалить();
							КонецЕсли;
						КонецЕсли;
							
					КонецЕсли;
					
				Иначе
					
					Структура = Новый Структура; 
					Структура.Вставить("ДатаЗаписи"                  , ТекущаяДата());
					Структура.Вставить("Контрагент"                  , СтруктураEDI.Контрагент);
					Структура.Вставить("Организация"                 , СтруктураEDI.Организация);
					Структура.Вставить("ЗаказДата"                   , СтруктураEDI.ЗаказДата);					
					Структура.Вставить("ЗаказНомер"                  , СтруктураEDI.ЗаказНомер);
					Структура.Вставить("НаправлениеОбмена"           , Перечисления.ЭКОМ_НаправлениеОбмена.Исходящий);
					Структура.Вставить("ФайлИмя"                     , СтруктураEDI.ИмяФайлаXML);
					Структура.Вставить("Статус"                      , СтруктураEDI.Статус);
					Структура.Вставить("ИдентификаторИспр"           , ?(СтруктураEDI.Свойство("ИдентификаторИспр"), СтруктураEDI.ИдентификаторИспр, ""));
					Структура.Вставить("Идентификатор"               , СтрЗаменить(СтруктураEDI.ИмяФайлаXML, ".xml", ""));
					Структура.Вставить("СтруктураФайла"              , Новый ХранилищеЗначения(СтруктураEDI.СтруктураДокумента,  Новый СжатиеДанных(9)));		
					
					Если СтруктураEDI.Свойство("ДвоичныеДанныеФайлаBIN") Тогда
						ЭЦПотКвитанции = СтруктураEDI.ДвоичныеДанныеФайлаBIN;
						Структура.Вставить("ЭЦП", Новый ХранилищеЗначения(ЭЦПотКвитанции, Новый СжатиеДанных(9)));
					КонецЕсли;
					
					ЭКОМ_Объекты_События_Записать(СтруктураEDI.Документ, СтруктураEDI.ВидДокумента, Структура);	
					
				КонецЕсли;
				
				ПредставлениеДокумента = Строка(СтруктураEDI.Документ);
								
				ТекстЛогаСобытий = "Отправка № " + Строка(НомПП) + " из " + Строка(КоличествоФайлов) + " " + ПредставлениеДокумента + " - тип [" + ТипДокумента  + "]"
				+ " файл [" + СтруктураEDI.ИмяФайлаXML + "] " + СтруктураEDI.Сообщение;
				ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Успешно, ИмяСобытия);
				МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

			КонецЕсли;
			
			// Удалим файл
			Попытка
				
				Если СтруктураEDI.Свойство("ПолноеИмяФайлаXML") Тогда
					ФайлXML = Новый Файл(СтруктураEDI.ПолноеИмяФайлаXML);			
					Если ФайлXML.Существует() Тогда
						УдалитьФайлы(ФайлXML.ПолноеИмя);
					КонецЕсли;
				КонецЕсли;
				
				Если СтруктураEDI.Свойство("ПолноеИмяФайлаBIN") Тогда
					ФайлBIN = Новый Файл(СтруктураEDI.ПолноеИмяФайлаBIN);
					Если ФайлBIN.Существует() Тогда
						УдалитьФайлы(ФайлBIN.ПолноеИмя);
					КонецЕсли;
				КонецЕсли;
				
				Если СтруктураEDI.Свойство("ПолноеИмяФайлаДанных") Тогда
					ФайлДанных = Новый Файл(СтруктураEDI.ПолноеИмяФайлаДанных);
					Если ФайлДанных.Существует() Тогда
						УдалитьФайлы(ФайлДанных.ПолноеИмя);
					КонецЕсли;
				КонецЕсли;
				
			Исключение
			КонецПопытки;		
		КонецЦикла;
		
	КонецЦикла;	
	
	СнятьБлокировкуОперации(ТипДокумента, "Исходящий", МассивЛогаСобытий);
	
КонецПроцедуры

// Процедура снимает блокировку указанной операции
//
// Параметры:
//  ИмяОперации  - Строка - имя операции
//
Процедура СнятьБлокировкуОперации(ТипДокумента, НаправлениеОбмена, МассивЛогаСобытий) Экспорт
	
	ИмяОперации = "Блокировка" + НаправлениеОбмена + "_" + ТипДокумента;
	Блокировать = ПолучитьРежимУправленияБлокировкойДанныхПоУмолчанию(); 	
	НачатьТранзакцию();
	Попытка
		
		Если Блокировать = Истина Тогда
			БлокировкаДанных 		= Новый БлокировкаДанных;
			ЭлементБлокировки 		= БлокировкаДанных.Добавить("РегистрСведений.ЭКОМ_ЗначениеДополнительныхКонстант");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("ДополнительнаяКонстанта", ИмяОперации);
			ЭлементБлокировки.УстановитьЗначение("Измерение", "Блокировка");
			БлокировкаДанных.Заблокировать();	
		КонецЕсли;

		// Читаем настройки и записываем если процесс еще не запущен. 
		МенеджерЗаписи = РегистрыСведений.ЭКОМ_ЗначениеДополнительныхКонстант.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ДополнительнаяКонстанта = ИмяОперации;
		МенеджерЗаписи.Измерение               = "Блокировка";
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.ЗначениеДополнительнойКонстанты = Дата(0001, 01, 01);
			МенеджерЗаписи.Записать();
		Иначе
			МенеджерЗаписи.ДополнительнаяКонстанта         = ИмяОперации;
			МенеджерЗаписи.Измерение                       = "Блокировка";
			МенеджерЗаписи.ЗначениеДополнительнойКонстанты = Дата(0001, 01, 01);
			МенеджерЗаписи.Записать();
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();		
		ТекстЛогаСобытий = "Регистр заблокирован - " + ТипДокумента + "! - " + ОписаниеОшибки();
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, "Снять блокировку " + ТипДокумента);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
	КонецПопытки;
	
КонецПроцедуры // СнятьБлокировкуОперации()

Функция ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, УровеньЛогирования, ИмяСобытия) Экспорт		
	ЗаписьСтруктурыЛога = ЗаписьСтруктурыЛогаНаСервере();
	ЗаписьСтруктурыЛога.Комментарий        = ТекстЛогаСобытий;
	ЗаписьСтруктурыЛога.УровеньЛогирования = УровеньЛогирования;
	ЗаписьСтруктурыЛога.ИмяСобытия         = ИмяСобытия;
	ЗаписьСтруктурыЛога.НачалоВыполнения   = ТекущаяДата();
	
	Возврат ЗаписьСтруктурыЛога;
	
КонецФункции

Функция НайтиТекущегоПользователя() Экспорт
	
	ТекущийПользователь = Неопределено;
	Если НЕ Метаданные.ПараметрыСеанса.Найти("ТекущийПользователь") = Неопределено Тогда
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	ИначеЕсли НЕ Метаданные.ПараметрыСеанса.Найти("ТекущийВнешнийПользователь") = Неопределено Тогда
		ТекущийПользователь = ПараметрыСеанса.ТекущийВнешнийПользователь;	 
	Иначе	
		Попытка
			ТекущийПользователь = Вычислить("глЗначениеПеременной(""глТекущийПользователь"")")
		Исключение
			Ошибка = ОписаниеОшибки();
			ТекущийПользователь = "ТекущийПользователь";
		КонецПопытки;
	КонецЕсли;
	
	Возврат ТекущийПользователь;
	
КонецФункции 

Функция ПолучитьФайлДокумента(СтруктураEDI, ВременныйКаталог)
	     
	ПолноеИмяФайлаXML = ВременныйКаталог + СтруктураEDI.ИмяФайлаXML;
	Текст = Новый ТекстовыйДокумент; 
	Текст.УстановитьТекст(СтруктураEDI.СтрокаXML); 
	Текст.Записать(ПолноеИмяФайлаXML, СтруктураEDI.КодировкаФайла); 
	
	ФайлXML = Новый Файл(ПолноеИмяФайлаXML);
	Если НЕ ФайлXML.Существует() Тогда
	     ФайлXML = Неопределено;
	КонецЕсли;
	СтруктураEDI.Вставить("ПолноеИмяФайлаXML", ПолноеИмяФайлаXML);
	
	Возврат ФайлXML;			
		
КонецФункции

Функция ПолучитьФайлПодписи(СтруктураEDI, НеобходимаПодпись, ВременныйКаталог) 
	
	ФайлBIN = Неопределено;
	НеобходимаПодпись = Ложь;
	Если СтруктураEDI.Свойство("ИмяФайлаBIN") Тогда
		НеобходимаПодпись = Истина;
		ПолноеИмяФайлаBIN = ВременныйКаталог + СтруктураEDI.ИмяФайлаBIN;
		
		// Файл подписи необходимо закодировать в Base64
		ФайлПодписи = Новый ЗаписьТекста(ПолноеИмяФайлаBIN, КодировкаТекста.ANSI);		
		ФайлПодписи.Записать(Base64Строка(СтруктураEDI.ДвоичныеДанныеФайлаBIN));
		ФайлПодписи.Закрыть();
		
		ФайлBIN = Новый Файл(ПолноеИмяФайлаBIN);
		Если НЕ ФайлBIN.Существует() Тогда
			ФайлBIN = Неопределено;
		КонецЕсли;
		СтруктураEDI.Вставить("ПолноеИмяФайлаBIN", ПолноеИмяФайлаBIN);
	КонецЕсли;
	
	Возврат ФайлBIN;
	
КонецФункции 

Функция ОтправитьФайлыВНужномФорматеПоТипуДокументаПоFTP(ФайлXML, ФайлBIN, ТипДокумента, Сервер, ВременныйКаталог, МассивЛогаСобытий, ПрофильОбмена, ТипОбменаЭТРН)
	
	ФайлОтправлен = Ложь;
	
	Если ТипДокумента = "ON_SCHFDOPPR_01"           //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _01. 2 этап]
		ИЛИ ТипДокумента = "ON_NSCHFDOPPR_01"       //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _01. 2 этап]
		ИЛИ ТипДокумента = "ON_NSCHFDOPPRPROS_01"   //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _01. 2 этап]
		ИЛИ ТипДокумента = "ON_NSCHFDOPPRMARK_01"   //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _01. 2 этап]
		ИЛИ ТипДокумента = "ON_KORSCHFDOPPR_01"     //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _01. 2 этап]
		ИЛИ ТипДокумента = "WHGOV_01_Исходящий" 
		ИЛИ ТипДокумента = "WHGOU_04_Исходящий"
		ИЛИ ТипДокумента = "WHGPV_05_Исходящий" 
		ИЛИ ТипДокумента = "WHGPU_08_Исходящий"
		ИЛИ ТипДокумента = "DP_REZRUISP"
		ИЛИ Найти(ТипДокумента, "CONDRA") > 0 Тогда
		
		// Создаем архив с файлами ЮЗД
		ИмяФайлаДляОтправки = ВременныйКаталог + ФайлXML.ИмяБезРасширения + ".zip";
		
		ЗаписьZIP_ЮЗД  = Новый ЗаписьZipФайла(
						ИмяФайлаДляОтправки,
						"", // пароль на архив (оставим пустой)
						"Этот архив создан из 1с", // комментарий к архиву
						МетодСжатияZIP.Сжатие, // сжатие или копирование
						УровеньСжатияZIP.Оптимальный,
						МетодШифрованияZIP.Zip20
						);
		
		ЗаписьZIP_ЮЗД.Добавить(ФайлXML.ПолноеИмя);
		Если НЕ ФайлBIN = Неопределено Тогда
			ЗаписьZIP_ЮЗД.Добавить(ФайлBIN.ПолноеИмя);
		КонецЕсли;
		ЗаписьZIP_ЮЗД.Записать();					
		ФайлОтправлен = ОтправитьФайлПоFTP(Сервер, ИмяФайлаДляОтправки, ФайлXML.ИмяБезРасширения + ".zip", МассивЛогаСобытий , ПрофильОбмена, ТипОбменаЭТРН);
		
		// Удаление архива
		УдалитьФайлы(ИмяФайлаДляОтправки);
		
	Иначе
		ФайлОтправлен = ОтправитьФайлПоFTP(Сервер, ФайлXML.ПолноеИмя, ФайлXML.Имя, МассивЛогаСобытий , ПрофильОбмена, ТипОбменаЭТРН);
		Если ФайлBIN = Неопределено Тогда
			РезультатОтправкиBIN = Истина;	
		Иначе
			РезультатОтправкиBIN = ОтправитьФайлПоFTP(Сервер, ФайлBIN.ПолноеИмя, ФайлBIN.Имя, МассивЛогаСобытий , ПрофильОбмена, ТипОбменаЭТРН);
			Если ФайлBIN.Существует() Тогда
				УдалитьФайлы(ФайлBIN.ПолноеИмя);
			КонецЕсли;
		КонецЕсли;
		
		Если РезультатОтправкиBIN = Ложь 
			ИЛИ ФайлОтправлен = Ложь Тогда
			ФайлОтправлен = Ложь;
		КонецЕсли;
			 
	КонецЕсли;            
	
	// Удаление файлов
	Если ФайлXML.Существует() Тогда
		УдалитьФайлы(ФайлXML.ПолноеИмя);
	КонецЕсли;
	Если НЕ ФайлBIN = Неопределено Тогда
		Если ФайлBIN.Существует() Тогда
			УдалитьФайлы(ФайлBIN.ПолноеИмя);
		КонецЕсли;
	КонецЕсли;
		
	Возврат ФайлОтправлен;
	
КонецФункции

Процедура ЭКОМ_Объекты_События_Записать(п_Регистратор, п_ВидДокумента, п_Структура, ЗаписыватьПустыеЗначения = Ложь) Экспорт
	
	Блокировать = ПолучитьРежимУправленияБлокировкойДанныхПоУмолчанию(); 	
	// Установка блокировки
	НачатьТранзакцию();
	Попытка
		
		Если Блокировать = Истина Тогда
			БлокировкаДанных 		= Новый БлокировкаДанных;
			ЭлементБлокировки 		= БлокировкаДанных.Добавить("РегистрСведений.ЭКОМ_Объекты_События");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("Документ_Основание", п_Регистратор);
			ЭлементБлокировки.УстановитьЗначение("ВидДокумента", п_ВидДокумента);
			БлокировкаДанных.Заблокировать();	
		КонецЕсли;
		
		НЗ = РегистрыСведений.ЭКОМ_Объекты_События.СоздатьНаборЗаписей();
		НЗ.Отбор.Документ_Основание.Установить(п_Регистратор);
		НЗ.Отбор.ВидДокумента.Установить(п_ВидДокумента);
		НЗ.Прочитать();
		
		Если НЗ.Количество() = 0 Тогда
			НоваяЗапись = НЗ.Добавить();
			НоваяЗапись.Документ_Основание = п_Регистратор;
			НоваяЗапись.ВидДокумента       = п_ВидДокумента;
			НоваяЗапись.ДатаЗаписи         = ТекущаяДата();	
		Иначе
			НоваяЗапись = НЗ[0];
		КонецЕсли;
		
		Для Каждого Элемент Из п_Структура Цикл			
			Если ЗаписыватьПустыеЗначения Тогда
				НоваяЗапись[Элемент.Ключ] = Элемент.Значение; 	
			Иначе
				Если ЗначениеЗаполнено(Элемент.Значение) Тогда
					НоваяЗапись[Элемент.Ключ] = Элемент.Значение; 	
				КонецЕсли;
			КонецЕсли;			
		КонецЦикла;

		НЗ.ДополнительныеСвойства.Вставить("ПерваяЗапись", Истина);
		НЗ.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();	
		ЗаписьЖурналаРегистрации("Обработка ""Интеграция Docrobot""", УровеньЖурналаРегистрации.Ошибка, , , "Конфликт записи в регистр - " + ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры // ЭКОМ_Объекты_События_Записать()

Функция ОтправитьФайлПоFTP(Сервер, ПолноеИмяФайла, КраткоеИмяФайла, МассивЛогаСобытий, ПрофильОбмена, ТипОбменаЭТРН)
	
	ИмяСобытия = "Отправка файлов по FTP";
	Результат = Ложь;
	Попытка
		Сервер.Записать(ПолноеИмяФайла, ПрофильОбмена.ИсходящийПутьFTP + КраткоеИмяФайла);
		Результат = Истина;
	Исключение
		Сервер = ПолучитьFTPСоединение(ПрофильОбмена, ТипОбменаЭТРН, МассивЛогаСобытий);
		Если НЕ Сервер = Неопределено тогда
			Сервер.Записать(ПолноеИмяФайла, ПрофильОбмена.ИсходящийПутьFTP + КраткоеИмяФайла);
			Результат = Истина;
		Иначе
			ТекстЛогаСобытий = "Ошибка отправки файла - " + КраткоеИмяФайла;
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
			
		КонецЕсли;
	КонецПопытки;
	
	Возврат Результат;    
КонецФункции

Функция СтавкаНДСЧислом(знач СтавкаНДС) Экспорт	
	
	ОбъектПеречисления  = Метаданные.Перечисления.Найти("СтавкиНДС");
	ОбъектСправочники   = Метаданные.Справочники.Найти("СтавкиНДС");
	ОбъектВидыСтавокНДС = Метаданные.Перечисления.Найти("ВидыСтавокНДС");
	
	//ТМ{   
	ЗначениеНалога = Неопределено; //инициализируем возвращаемое значение
	
	//Добавим вариант для конфигураций, в которых (на уровне метаданных) есть и перечисление СтавкиНДС, и справочник СтавкиНДС. Это, например, ERP 2.5 для РФ
	Если НЕ ОбъектПеречисления = Неопределено И НЕ ОбъектСправочники = Неопределено Тогда
		РеквизитСтавка = Метаданные.Справочники.СтавкиНДС.Реквизиты.Найти("Ставка");
		Если НЕ РеквизитСтавка = Неопределено И РеквизитСтавка.Тип.СодержитТип(Тип("Число")) Тогда
			ЗначениеНалога = СтавкаНДС.Ставка;
			
			Возврат ЗначениеНалога; 
		КонецЕсли;	
	КонецЕсли;	
	//}ТМ
	
	Если НЕ ОбъектВидыСтавокНДС = Неопределено 
		И ТипЗнч(СтавкаНДС) = Тип("ПеречислениеСсылка.ВидыСтавокНДС") Тогда
		СтавкаНДС = Перечисления.СтавкиНДС.СтавкаНДС(СтавкаНДС, ТекущаяДата());				
	КонецЕсли;	

	Если НЕ ОбъектПеречисления = Неопределено Тогда		
		Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
			ЗначениеНалога = 0;
		ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 
			ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
			ЗначениеНалога = 10;
		ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 
			ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
			ЗначениеНалога = 18;
		ИначеЕсли НЕ Найти(Строка(СтавкаНДС), "20%") = 0 Тогда // Исключаем УТ 3.1 для Казахстана
			ЗначениеНалога = 20;
		Иначе		
			ЗначениеНалога = 0;
		КонецЕсли;
		
	ИначеЕсли НЕ ОбъектСправочники = Неопределено Тогда 
		
		РеквизитСтавка = Метаданные.Справочники.СтавкиНДС.Реквизиты.Найти("Ставка");
		Если НЕ РеквизитСтавка = Неопределено И РеквизитСтавка.Тип.СодержитТип(Тип("Число")) Тогда
			ЗначениеНалога = СтавкаНДС.Ставка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЗначениеНалога;
	
КонецФункции

Функция ПолучитьФункциюЮЗД(ФорматЮЗД = Неопределено, Контрагент = Неопределено) Экспорт 
	
	Если ЗначениеЗаполнено(Контрагент) и ФорматЮЗД = Неопределено Тогда
		
		ОтборКонтрагент = Новый Структура;
		ОтборКонтрагент.Вставить("Объект", Контрагент);
		ВыборкаGLN = РегистрыСведений.ЭКОМ_GLN.Выбрать(ОтборКонтрагент);
		Пока ВыборкаGLN.Следующий() Цикл
			ФорматЮЗД = ВыборкаGLN.Контрагент_ФорматЭСФ; 
		КонецЦикла;
		
	КонецЕсли;
		
	ДокФункция = "СЧФДОП";
	
	Если ФорматЮЗД = "УПД Лента СЧФ" 
		ИЛИ ФорматЮЗД = "УПД Метро" 
		ИЛИ ФорматЮЗД = "УПД Зельгрос"
		ИЛИ ФорматЮЗД = "УПД Магнолия"
		ИЛИ ФорматЮЗД = "УПД ОКЕЙ"
		ИЛИ ФорматЮЗД = "УПД Спар"
		ИЛИ ФорматЮЗД = "УПД Дикси юг"
		ИЛИ ФорматЮЗД = "УПД Виктория" Тогда	
		ДокФункция = "СЧФ";
	КонецЕсли;
	
	Возврат ДокФункция;
	
КонецФункции

// Функция формирует структуру инфополей для переданного формата УПД
//
// Параметры:
//  Формат  - Строка - формат УПД
//  Данные  - Структура - используемые данные для заполнения инфополей:. Список ожидаемых ключей структуры:
//		RECADV_EDIINTERCHANGEID
//		ГЛНКонтрагент
//		ГЛНОрганизации
//		ГЛНТочкиДоставки
//		ГУИДДокОснованиеДляКУПД
//		ДатаАкта
//		ДатаЗаказа
//		ДатаНакладной
//		ДатаПоставки
//		КодПоставщика
//		НомерАкта
//		НомерЗаказа
//		НомерНакладной
//
//  ЭСФБезИнфПоля  - Булево - признак отсутствия инфополей в электронной УПД
//  Отказ  - Булево - признак ошибки
//
// Возвращаемое значение:
//   Структура   - полученная коллекция инфополей
//
Функция ПолучитьСтруктуруИнфоПолейИзСправочника(ТипИнфополя, ЭКОМ_ИнфоПоле, ДанныеИнфополя, ЭтоЮЗДБезИнфПоля, ТекстСообщения = "") Экспорт
	
	Отказ = Ложь;
	МассивЛогаСобытий = Новый Массив;
	ИмяСобытия = "Получить данные ИнфоПолей - " + ТипИнфополя;
	
	// Все возможные данные по инфо полям для примера
	ПолныеДанныеИнфоПолей = Новый Массив; 
	ПолныеДанныеИнфоПолей.Добавить("номер_накладной");      // НомерНакладной - номер накладной
	ПолныеДанныеИнфоПолей.Добавить("НомНакл");              // НомерНакладной - номер накладной
	ПолныеДанныеИнфоПолей.Добавить("Номер_накладной");      // НомерНакладной - номер накладной
	ПолныеДанныеИнфоПолей.Добавить("номер_отгрузки");       // НомерНакладной - номер накладной
    ПолныеДанныеИнфоПолей.Добавить("дата_накладной");       // ДокументОснованиеДата - дата накладной
	ПолныеДанныеИнфоПолей.Добавить("ДтНакл");               // ДокументОснованиеДата - дата накладной
	ПолныеДанныеИнфоПолей.Добавить("дата_отгрузки");        // ДокументОснованиеДата - дата накладной
	ПолныеДанныеИнфоПолей.Добавить("дата_поставки");        // ДокументОснованиеДата - дата накладной 
	ПолныеДанныеИнфоПолей.Добавить("номер_заказа");         // ЗаказНомер
	ПолныеДанныеИнфоПолей.Добавить("Заказ_на_поставку");    // ЗаказНомер	
	ПолныеДанныеИнфоПолей.Добавить("дата_заказа");          // ДатаЗаказа - дата заказа	
	ПолныеДанныеИнфоПолей.Добавить("номер_акта");           // RECADV_Номер - номер акта
	ПолныеДанныеИнфоПолей.Добавить("номер_апп");            // RECADV_Номер - номер акта	
	ПолныеДанныеИнфоПолей.Добавить("дата_акта");            // RECADV_Дата - дата акта
	ПолныеДанныеИнфоПолей.Добавить("дата_апп");             // RECADV_Дата - дата акта
    ПолныеДанныеИнфоПолей.Добавить("код_поставщика");       // CAMPAIGNNUMBER - номер договора 	
	ПолныеДанныеИнфоПолей.Добавить("GLN_грузополучателя");  // ГЛНТочкиДоставки - GLN точки доставки
	ПолныеДанныеИнфоПолей.Добавить("грузополучатель");      // ГЛНТочкиДоставки - GLN точки доставки 	
    ПолныеДанныеИнфоПолей.Добавить("документ_основание");   // ГУИДДокОснованиеДляКУПД 	
	ПолныеДанныеИнфоПолей.Добавить("отправитель");          // ГЛНОрганизации - GLN организации
	ПолныеДанныеИнфоПолей.Добавить("грузоотправитель");     // ГЛНОрганизации - GLN организации
	ПолныеДанныеИнфоПолей.Добавить("поставщик");            // ГЛНОрганизации - GLN организации
	ПолныеДанныеИнфоПолей.Добавить("GLN_грузоотправителя"); // ГЛНОрганизации - GLN организации	  
	ПолныеДанныеИнфоПолей.Добавить("VID");                  // RECADV_EDIINTERCHANGEID 		
	ПолныеДанныеИнфоПолей.Добавить("получатель");           // ГЛНКонтрагент - GLN контрагента
	ПолныеДанныеИнфоПолей.Добавить("покупатель");           // ГЛНКонтрагент - GLN контрагента
	ПолныеДанныеИнфоПолей.Добавить("ORDERVID");             // ORDERVID
		 	
	// ИнфПолФХЖ2		
	ПолныеДанныеИнфоПолей.Добавить("CAMPAIGNNUMBER");                // CAMPAIGNNUMBER - номер договора
	ПолныеДанныеИнфоПолей.Добавить("номер_уведомления_об_отгрузке"); // НомерНакладной - номер накладной
	ПолныеДанныеИнфоПолей.Добавить("код_материала");                 // КодТовараПокупателя
	ПолныеДанныеИнфоПолей.Добавить("КдВЕРНЫЙ");	                     // КодТовараПокупателя
	ПолныеДанныеИнфоПолей.Добавить("SKU");                           // КодТовараПокупателя
	ПолныеДанныеИнфоПолей.Добавить("штрихкод");                      // Штрихкод
	ПолныеДанныеИнфоПолей.Добавить("Штрих-код");                     // Штрихкод
	ПолныеДанныеИнфоПолей.Добавить("артикул_поставщика");            // КодТовараПоставщика
	ПолныеДанныеИнфоПолей.Добавить("код_продавца");                  // КодТовараПоставщика
	ПолныеДанныеИнфоПолей.Добавить("вложенность_кол");               // КоличествоМест
	ПолныеДанныеИнфоПолей.Добавить("вложенность_океи");              // НаименованиеЕдиницыИзмерения
	ПолныеДанныеИнфоПолей.Добавить("позиция_заказа");                // НомерСтроки
			
	ТекстОшибки = Новый Массив;
	Результат   = Новый Соответствие;
	
	Если НЕ ЗначениеЗаполнено(ЭКОМ_ИнфоПоле) 
		 ИЛИ ЭтоЮЗДБезИнфПоля = Истина Тогда
		ЭКОМ_ИнфоПоле = Справочники.ЭКОМ_ИнфоПоля.УПД_по_умолчанию;	
	КонецЕсли;
	
	// Заполняем формат по умолчанию
	Если (ЭКОМ_ИнфоПоле.ФорматУПД = "УПД по умолчанию"
		 ИЛИ ЭКОМ_ИнфоПоле.Наименование = "УПД по умолчанию") Тогда
	     Если ЭКОМ_ИнфоПоле.ТабличнаяЧасть.Количество() = 0 Тогда
			 
			 НовыйОбъект    = Справочники.ЭКОМ_ИнфоПоля.СоздатьЭлемент();	
	         НовыйОбъект.ЗаполнитьУПД_поУмолчанию(ЭКОМ_ИнфоПоле);
			  
		 КонецЕсли;			
	КонецЕсли;
	
	// Проверка параметров.
	Если НЕ ТипЗнч(ТипИнфополя) = Тип("Строка") Тогда
		ТекстОшибки.Добавить("<<<ТипИнфополя>>> - ошибка передачи значения в параметре, тип значения должно быть строка");
	КонецЕсли;

	Если НЕ ТипЗнч(ДанныеИнфополя) = Тип("Соответствие") Тогда
		ТекстОшибки.Добавить("<<<ДанныеИнфополя>>> - ошибка при передачи значения в параметре, тип значения должно быть соответствие");
	КонецЕсли;
		
	Если НЕ ТекстОшибки.Количество() = 0 Тогда		
		ТекстЛогаСобытий = СокрЛП(ТипИнфополя) + "Ошибка (" +  СокрЛП(ТипИнфополя) + ") при заполнении процедуры для формата УПД = <<<" + ЭКОМ_ИнфоПоле.Наименование + ">>>:";
		Для Каждого Ошибка Из ТекстОшибки Цикл
			ТекстЛогаСобытий =  ТекстЛогаСобытий + Символы.ПС + "	- " + Ошибка;
		КонецЦикла;
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		
		Отказ     = Истина;
		Результат = Неопределено;	
	КонецЕсли;
	
	Если Отказ = Ложь Тогда
		// Добавляем обязательные поля
		Если ТипИнфополя = "ИнфПолФХЖ1" Тогда
			
			ИмяИдентификатора = "отправитель"; 
			Значение = ДанныеИнфополя.Получить(ИмяИдентификатора);
			Если НЕ ЗначениеЗаполнено(Значение) Тогда
				ТекстОшибки.Добавить("<<<" + ИмяИдентификатора + ">>> (GLN организации) - отсутствует обязательное значение");
			КонецЕсли;
			Результат.Вставить(ИмяИдентификатора, СокрЛП(Значение));
			
			ИмяИдентификатора = "получатель";
			Значение = ДанныеИнфополя.Получить(ИмяИдентификатора);
			Если НЕ ЗначениеЗаполнено(Значение) Тогда
				ТекстОшибки.Добавить("<<<" + ИмяИдентификатора + ">>> (GLN контрагента) - отсутствует обязательное значение");
			КонецЕсли;
			Результат.Вставить(ИмяИдентификатора, СокрЛП(Значение));
			
		КонецЕсли;
		
		// Собираем нужные нам данные по формату УПД
		Для каждого Стр Из ЭКОМ_ИнфоПоле.ТабличнаяЧасть Цикл
			
			Если ТипИнфополя = Стр.ТипПоля Тогда
				
				Значение = ДанныеИнфополя.Получить(Стр.Идентификатор);
				Если ЗначениеЗаполнено(Значение) Тогда
					
					Если ТипЗнч(Значение) = Тип("Дата") Тогда
						Значение = Формат(Значение, "ДФ=dd.MM.yyyy");
					Иначе
						Значение = СокрЛП(Значение);
					КонецЕсли;
					
					Результат.Вставить(Стр.Идентификатор, Значение);
				ИначеЕсли Стр.Обязательное = Истина Тогда
					ТекстОшибки.Добавить("<<<" + Стр.Идентификатор + ">>> - отсутствует обязательное значение");
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЦикла;
		
		
		Если НЕ ТекстОшибки.Количество() = 0 Тогда		
			ТекстЛогаСобытий = "Ошибка (" +  СокрЛП(ТипИнфополя) + ") при заполнении инфополей для формата УПД = <<<" + Строка(ЭКОМ_ИнфоПоле) + ">>>:";
			Для Каждого Ошибка Из ТекстОшибки Цикл
				ТекстЛогаСобытий =  ТекстЛогаСобытий + Символы.ПС + "	- " + Ошибка;
			КонецЦикла;
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
			
			Отказ     = Истина;
			Результат = Неопределено;			
		КонецЕсли;	
	КонецЕсли;
	
	Если МассивЛогаСобытий.Количество() > 0 Тогда
		 ЗаписатьЛогСобытийвРегистрЛогирование(МассивЛогаСобытий);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

// Функция возвращает строку на валюту документа
Функция ПолучитьСтрокуВалютыДокумента(знач НаименованиеВалюты) Экспорт
	
	xmlВалюта = "RUB";
	НаименованиеВалюты = НРег(НаименованиеВалюты);
	
	Если Найти(НаименованиеВалюты, "бел") > 0
		ИЛИ НаименованиеВалюты = "BYR" Тогда
		xmlВалюта = "BYR";

	ИначеЕсли Найти(НаименованиеВалюты, "руб") > 0
		ИЛИ НаименованиеВалюты = "RUB" Тогда
		xmlВалюта = "RUB";
		
	ИначеЕсли Найти(НаименованиеВалюты, "тен") > 0
		ИЛИ НаименованиеВалюты = "KZT" Тогда
		xmlВалюта = "KZT";	
		
	ИначеЕсли Найти(НаименованиеВалюты, "грив") > 0
		ИЛИ НаименованиеВалюты = "UAH" Тогда
		xmlВалюта = "UAH";
		
	ИначеЕсли Найти(НаименованиеВалюты, "долл") > 0
		ИЛИ НаименованиеВалюты = "USD" Тогда
		xmlВалюта = "USD";
		
	ИначеЕсли Найти(НаименованиеВалюты, "евр") > 0
		ИЛИ НаименованиеВалюты = "EUR" Тогда
		xmlВалюта = "EUR";
		
	ИначеЕсли Найти(НаименованиеВалюты, "лей") > 0
		ИЛИ НаименованиеВалюты = "MDL" Тогда
		xmlВалюта = "MDL";
						
	КонецЕсли;		
	
	Возврат xmlВалюта; 
	
КонецФункции

// Здесь можно вставлять код из гибких настроек для отладки
// Параметры: 
// Приемник - документ создания
// Источник - документ из которого создается 
// СтруктураДокумента - представление XML файла
// ЛогСобытий - все сообщения по операциям 
// ТекстОшибки - ошибки из - за которых документ не загрузился
Функция ВыполнитьГибкиеНастройки(Приемник = Неопределено, Источник = Неопределено, СтруктураДокумента = Неопределено, ЛогСобытий = Неопределено, ТекстОшибки = Неопределено,
	СоответствиеПоОрганизации = Неопределено,
	СоответствиеПоКонтрагенту = Неопределено,
	СоответствиеПоТочкамДоставки = Неопределено,
	СоответствиеПоНоменклатуре = Неопределено) Экспорт
	
	//// Ваш код ///
	
	Возврат 0;
	
КонецФункции

Функция ПолучитьДанныеПоКолонкамИсточника() Экспорт
	
	ЭКОМ_ОбменСеть      = НастройкиПрочитатьНаСервере("ЭКОМ_ОбменСеть"     , Истина);
	ЭКОМ_ОбменПоставщик = НастройкиПрочитатьНаСервере("ЭКОМ_ОбменПоставщик", Истина);
	ЭКОМ_ОбменЭТРН      = НастройкиПрочитатьНаСервере("ЭКОМ_ОбменЭТРН"     , Истина);
	ЭКОМ_ОбменCondra    = НастройкиПрочитатьНаСервере("ЭКОМ_ОбменCondra"   , Истина);
	ЭКОМ_ОбменПрайсЛист = НастройкиПрочитатьНаСервере("ЭКОМ_ОбменПрайсЛист", Истина);
	
	СтруктураДанных = Новый Структура;
	Если ЭКОМ_ОбменСеть = Истина Тогда
		АлгоритмЗаполненияСписка = НастройкиПрочитатьНаСервере("СлужебныйЗапросДляФормыПокупателя", , "Служебный");		
		СтруктураДанных.Вставить("Сеть", АлгоритмЗаполненияСписка);
		
	КонецЕсли;
	
	Если ЭКОМ_ОбменПоставщик = Истина Тогда
		АлгоритмЗаполненияСписка = НастройкиПрочитатьНаСервере("СлужебныйЗапросДляФормыПоставщика", , "Служебный");
		СтруктураДанных.Вставить("Поставщик", АлгоритмЗаполненияСписка);
		
	КонецЕсли;		
	
	Если ЭКОМ_ОбменЭТРН = Истина Тогда
		АлгоритмЗаполненияСписка = НастройкиПрочитатьНаСервере("СлужебныйЗапросДляФормыЭТРН", , "Служебный");
		СтруктураДанных.Вставить("ЭТРН", АлгоритмЗаполненияСписка);
		
	КонецЕсли;
	
	Если ЭКОМ_ОбменCondra = Истина Тогда
		АлгоритмЗаполненияСписка = НастройкиПрочитатьНаСервере("СлужебныйЗапросДляФормыCondra", , "Служебный");
		СтруктураДанных.Вставить("CONDRA", АлгоритмЗаполненияСписка);
		
	КонецЕсли;
	
	Если ЭКОМ_ОбменПрайсЛист = Истина Тогда
		АлгоритмЗаполненияСписка = НастройкиПрочитатьНаСервере("СлужебныйЗапросДляФормыПрайсЛист", ,"Служебный");
		СтруктураДанных.Вставить("ПрайсЛист", АлгоритмЗаполненияСписка);
		
	КонецЕсли;
	
	СписокКолонок = Новый Соответствие;
	Для каждого Данные Из СтруктураДанных Цикл
		
		ТекстЗапроса = "";
		
		Попытка
			
			Выполнить(Данные.Значение);
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ", "ВЫБРАТЬ ПЕРВЫЕ 3");
			Запрос = Новый Запрос;
			Запрос.Текст = ТекстЗапроса;			
			Запрос.УстановитьПараметр("ДатаНач", ТекущаяДата());
			Запрос.УстановитьПараметр("ДатаКон", ТекущаяДата());	
			Запрос.УстановитьПараметр("масПомеченныхДоков", Новый Массив);
			Запрос.УстановитьПараметр("НаправлениеОбмена" , Перечисления.ЭКОМ_НаправлениеОбмена.ПустаяСсылка());

			РезультатЗапроса = Запрос.Выполнить();
			КолонкиЗапроса = РезультатЗапроса.Колонки;				
			Для каждого ТекКолонка Из КолонкиЗапроса Цикл
				СписокКолонок.Вставить(ТекКолонка.Имя, ТекКолонка.ТипЗначения);			
			КонецЦикла;
			
		Исключение				
		КонецПопытки;
		
	КонецЦикла;		     
	
	Возврат СписокКолонок;
	
КонецФункции

// Для Поставщика
Функция ПолучитьТипДокументаЗаказаПокупателя(МассивЛогаСобытий) Экспорт
	Возврат ПолучитьТипДокументаИБ("ЭКОМ_ВидЗаказаПоставщик", МассивЛогаСобытий);
КонецФункции

//Для покупателя
Функция ПолучитьТипДокументаПоступления(МассивЛогаСобытий) Экспорт
	Возврат ПолучитьТипДокументаИБ("ЭКОМ_ВидПоступлениеПокупатель", МассивЛогаСобытий);
КонецФункции

// Для покупателя
Функция ПолучитьТипДокументаЗаказаПоставщика(МассивЛогаСобытий) Экспорт
	Возврат ПолучитьТипДокументаИБ("ЭКОМ_ВидЗаказаПокупатель", МассивЛогаСобытий);
КонецФункции

// Для поставщика
Функция ПолучитьТипДокументаРеализации(МассивЛогаСобытий) Экспорт
	Возврат ПолучитьТипДокументаИБ("ЭКОМ_ВидРеализацииПоставщик", МассивЛогаСобытий);
КонецФункции

// Для поставщика
Функция ПолучитьТипДокументаКорректировкаРеализации(МассивЛогаСобытий) Экспорт
	Возврат ПолучитьТипДокументаИБ("ЭКОМ_ВидКорректировкиРеализацииПоставщик", МассивЛогаСобытий);
КонецФункции

Функция ПолучитьТипДокументаВозвратОтПокупателя(МассивЛогаСобытий) Экспорт
	Возврат ПолучитьТипДокументаИБ("ЭКОМ_ВидВозвратОтПокупателя", МассивЛогаСобытий);
КонецФункции

// Для покупателя
Функция ПолучитьТипДокументаКорректировкаПоступления(МассивЛогаСобытий) Экспорт
	Возврат ПолучитьТипДокументаИБ("ЭКОМ_ВидКорректировкиПоступленияПокупатель", МассивЛогаСобытий);
КонецФункции

//Функции определяют тип документа используемого в базе 1С. Получение соответствий видов документов из доп. констант
Функция ПолучитьТипДокументаИБ(Вид = "ЭКОМ_ВидЗаказаПоставщик", МассивЛогаСобытий) Экспорт
	
	ИмяСобытия = "Получение типа документа " + Вид;
	Результат = НастройкиПрочитатьНаСервере(Вид, "");
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		ТекстЛогаСобытий=  "Необходимо заполнить типы документов: [" + Вид + "]";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

		Результат = "";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

// Для покупателя
Функция ПолучитьТипДокументаВозвратТоваровПоставщику(МассивЛогаСобытий) Экспорт
	Возврат ПолучитьТипДокументаИБ("ЭКОМ_ВидВозвратТоваровПоставщику", МассивЛогаСобытий);
КонецФункции

// Для Поставщика
Функция ПолучитьТипДокументаСчетФактураВыданный(МассивЛогаСобытий) Экспорт
	Возврат ПолучитьТипДокументаИБ("ЭКОМ_ВидСчетаФактурыПоставщик", МассивЛогаСобытий);
КонецФункции

// Функция проверяет по типу документа нужна ли подпись
//
// Параметры:
//  ТипДокумента  - строка - тип документа
//
// Возвращаемое значение:
//   Булево   - истина - подпись нужна, ложь - нет
//
Функция ПроверитьНеобходимостьПодписи(ТипДокумента) Экспорт
	
	ПодписьНеобходима = Ложь;
	Если ТипДокумента = "DP_PDPOL" 
		ИЛИ ТипДокумента = "DP_PDOTPR" 
		ИЛИ ТипДокумента = "DP_IZVPOL_06"
		ИЛИ ТипДокумента = "DP_IZVPOL_10"
		ИЛИ ТипДокумента = "DP_UVUTOCH"		
		ИЛИ ТипДокумента = "ON_NSCHFDOPPOK"
		ИЛИ ТипДокумента = "ON_NSCHFDOPPOKMARK"
		ИЛИ ТипДокумента = "ON_NSCHFDOPPOKPROS"	
		ИЛИ ТипДокумента = "ON_NSCHFDOPPR"
		ИЛИ ТипДокумента = "ON_NSCHFDOPPRMARK"
		ИЛИ ТипДокумента = "ON_NSCHFDOPPRPROS"
		ИЛИ ТипДокумента = "ON_NSCHFDOPPR_01"       //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _01. 2 этап]
		ИЛИ ТипДокумента = "ON_NSCHFDOPPRMARK_01"   //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _01. 2 этап]
		ИЛИ ТипДокумента = "ON_NSCHFDOPPRPROS_01"   //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _01. 2 этап]
		ИЛИ ТипДокумента = "ON_NSCHFDOPPOK_11"      
		ИЛИ ТипДокумента = "ON_NSCHFDOPPOKMARK_11"  
		ИЛИ ТипДокумента = "ON_NSCHFDOPPOKPROS_11"  
		ИЛИ ТипДокумента = "ON_SCHFDOPPOK_11"       
		ИЛИ ТипДокумента = "ON_KORSCHFDOPPOK_11"    
		ИЛИ ТипДокумента = "ON_SCHFDOPPR" 
		ИЛИ ТипДокумента = "ON_SCHFDOPPOK"
		ИЛИ ТипДокумента = "ON_KORSCHFDOPPR"
		ИЛИ ТипДокумента = "ON_KORSCHFDOPPOK" 
		ИЛИ ТипДокумента = "ON_SCHFDOPPR_01"        //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _01. 2 этап]
		ИЛИ ТипДокумента = "ON_KORSCHFDOPPR_01"     //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _01. 2 этап]
		ИЛИ ТипДокумента = "DP_OTORG1"
		ИЛИ ТипДокумента = "DP_OTORG2" 
		ИЛИ ТипДокумента = "CONDRA" 
		ИЛИ ТипДокумента = "DP_PRANNUL"
		ИЛИ ТипДокумента = "DP_PRANNUL_22"
		ИЛИ ТипДокумента = "DP_IZVPOL_23"
		ИЛИ ТипДокумента = "DP_UVUTOCH_09" 
		ИЛИ ТипДокумента = "DP_UVUTOCH_24" 
		ИЛИ ТипДокумента = "DP_REZRUZAK"
		ИЛИ ТипДокумента = "ON_NKORSCHFDOPPR"
		ИЛИ ТипДокумента = "ON_NKORSCHFDOPPRMARK" 
		ИЛИ ТипДокумента = "ON_NKORSCHFDOPPRPROS"
		ИЛИ ТипДокумента = "ON_NKORSCHFDOPPR_01"    //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _01. 2 этап]
		ИЛИ ТипДокумента = "ON_NKORSCHFDOPPRMARK_01"//Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _01. 2 этап]
		ИЛИ ТипДокумента = "ON_NKORSCHFDOPPRPROS_01"//Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _01. 2 этап]
		ИЛИ ТипДокумента = "ON_NKORSCHFDOPPOK"
		ИЛИ ТипДокумента = "ON_NKORSCHFDOPPOKMARK"
		ИЛИ ТипДокумента = "ON_NKORSCHFDOPPOKPROS"
		ИЛИ ТипДокумента = "ON_NKORSCHFDOPPOK_11"     
		ИЛИ ТипДокумента = "ON_NKORSCHFDOPPOKMARK_11" 
		ИЛИ ТипДокумента = "ON_NKORSCHFDOPPOKPROS_11" Тогда
		
		ПодписьНеобходима = Истина;
	КонецЕсли;
	
	Возврат ПодписьНеобходима; 

КонецФункции

// Получаем первичные виды документов ЮЗД
//
// Параметры:
//  ВидыДокументовЮЗД  - Массив - массив первичных видов документов
//         
Процедура ПолучитьПервичныеВидыДокументовЮЗД(ВидыДокументовЮЗД) Экспорт
	ВидыДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPR_01);
	ВидыДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPRMARK_01);
	ВидыДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPRPROS_01);
КонецПроцедуры 

// Получаем исправительные виды документов ЮЗД
//
// Параметры:
//  ВидыДокументовЮЗД  - Массив - массив исправительных видов документов
//         
Процедура ПолучитьИсправительныеВидыДокументовЮЗД(ВидыДокументовЮЗД) Экспорт
	ВидыДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPR_01_Испр);
	ВидыДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPRMARK_01_Испр);
	ВидыДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPRPROS_01_Испр);
КонецПроцедуры 

// Получаем корректировочные виды документов ЮЗД
//
// Параметры:
//  ВидыДокументовЮЗД  - Массив - массив корректировочных видов документов
//         
Процедура ПолучитьКорректировочныеВидыДокументовЮЗД(ВидыДокументовЮЗД) Экспорт
	ВидыДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.ON_KORSCHFDOPPR_01);
	ВидыДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.ON_KORSCHFDOPPR_01_Испр);
	ВидыДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPR_01);
    ВидыДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPR_01_Испр);
    ВидыДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPRMARK_01);
    ВидыДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPRMARK_01_Испр);
	ВидыДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPRPROS_01);
	ВидыДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPRPROS_01_Испр);
КонецПроцедуры

// Получаем подпись/титул видов документов ЮЗД
//
// Параметры:
//  ВидыДокументовЮЗД  - Массив - массив подписей/титулов видов документов ЮЗД
//         
Процедура ПолучитьПодписьВидовДокументовЮЗД(ВидыДокументовЮЗД) Экспорт
	ВидыДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.ON_KORSCHFDOPPOK_11);
	ВидыДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPOKMARK_11);
	ВидыДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPOKPROS_11);
    ВидыДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPOK_11);
    ВидыДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPOK_11);
    ВидыДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPOKMARK_11);
	ВидыДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.ON_NKORSCHFDOPPOKPROS_11);
КонецПроцедуры

Функция ОтноситсяКЮЗД(ВидДокумента) Экспорт
	
	МассивВидовДокументовЮЗД = Новый Массив;
	ПолучитьПервичныеВидыДокументовЮЗД(МассивВидовДокументовЮЗД);
	ПолучитьИсправительныеВидыДокументовЮЗД(МассивВидовДокументовЮЗД);
	ПолучитьКорректировочныеВидыДокументовЮЗД(МассивВидовДокументовЮЗД);
	Если МассивВидовДокументовЮЗД.Найти(ВидДокумента) = Неопределено Тогда
		ЭтоВидДокументаЮЗД = Ложь;
	Иначе
		ЭтоВидДокументаЮЗД = Истина;
	КонецЕсли;
	
	Возврат ЭтоВидДокументаЮЗД; 
	
КонецФункции

Функция ЯвляетсяПодписьюЮЗД(ВидДокумента) Экспорт
	
	МассивВидовДокументовЮЗД = Новый Массив;
	ПолучитьПодписьВидовДокументовЮЗД(МассивВидовДокументовЮЗД);
	Если МассивВидовДокументовЮЗД.Найти(ВидДокумента) = Неопределено Тогда
		ЭтоВидДокументаЮЗД = Ложь;
	Иначе
		ЭтоВидДокументаЮЗД = Истина;
	КонецЕсли;
	
	Возврат ЭтоВидДокументаЮЗД; 
	
КонецФункции

Процедура ЗаписатьЛогСобытийвРегистрЛогирование(МассивЛогаСобытий) Экспорт	
	ТекущийПользователь     = НайтиТекущегоПользователя();
	ИдентификаторТранзакции = СокрЛП(Новый УникальныйИдентификатор);
	
	НаборЗаписей = РегистрыСведений.ЭКОМ_Логирование.СоздатьНаборЗаписей();		
	НаборЗаписей.Отбор.ИдентификаторТранзакции.Установить(ИдентификаторТранзакции);
	НаборЗаписей.Отбор.Пользователь.Установить(ТекущийПользователь);	
	Н = 1;
	Для Каждого ЗаписьСтроки Из МассивЛогаСобытий Цикл 
		НоваяЗапись = НаборЗаписей.Добавить(); 	
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ЗаписьСтроки);
		
		НоваяЗапись.ИдентификаторТранзакции = ИдентификаторТранзакции; 
		НоваяЗапись.Пользователь            = ТекущийПользователь;
		НоваяЗапись.Период                  = ТекущаяДата();		
		НоваяЗапись.КоличествоСообщений     = Н;
		
		Н = Н + 1;
	КонецЦикла; 
	
	НаборЗаписей.Записать(); 		
	
КонецПроцедуры

Процедура ЗаписатьСтрокуЛогаСобытийвРегистрЛогирование(ЗаписьСтроки) Экспорт	
	
	ТекущийПользователь     = НайтиТекущегоПользователя();
	ИдентификаторТранзакции = СокрЛП(Новый УникальныйИдентификатор);
	
	НаборЗаписей = РегистрыСведений.ЭКОМ_Логирование.СоздатьНаборЗаписей();		
	НаборЗаписей.Отбор.ИдентификаторТранзакции.Установить(ИдентификаторТранзакции);
	НаборЗаписей.Отбор.Пользователь.Установить(ТекущийПользователь);	
	
	НоваяЗапись = НаборЗаписей.Добавить(); 	
	ЗаполнитьЗначенияСвойств(НоваяЗапись, ЗаписьСтроки);
	
	НоваяЗапись.ИдентификаторТранзакции = ИдентификаторТранзакции; 
	НоваяЗапись.Пользователь            = ТекущийПользователь;
	НоваяЗапись.Период                  = ТекущаяДата();		
	НоваяЗапись.КоличествоСообщений     = 1;
	
	НаборЗаписей.Записать(); 
	
КонецПроцедуры

// Возвращает структуру, содержащую значения полей РС Цепочки документов поставщика\покупателя, полученные в результате выполнения запроса.
// Запрос выполняется с использованием переданных в качестве параметров функции отборов. 
// Функция возвращает только запрошенные поля (указываются в одноименном параметре функции).
//
// Параметры:
//	ИмяРегистра - Строка, имя регистра сведений, в котором осуществляется проверка
//
//  Поля   - Строка, имена полей через запятую, значения которых необходимо получить.
//
//  Отборы - Структура
//		     Ключи элементов структуры содержат имена полей отбора РС ЦепочкиДокументовПоставщиков;
//			 Значения элементов структуры содержат значения параметров для отбора к соответствующему ключу.
//
// Возвращаемое значение:
//  Структура - содержит ключ "Успешно" с типом булево, который фиксирует результат выполнения функции;
//			  - в случае, если "Успешно" - Истина, содержит имена (ключи) и значения затребованных полей.
Функция ПолучитьПоляЦепочкиДокументов(ИмяРегистра, Поля, Отборы) Экспорт 
	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	
	Если ИмяРегистра = Метаданные.РегистрыСведений.ЭКОМ_ЦепочкиДокументовПокупателя.Имя 
		ИЛИ ИмяРегистра = Метаданные.РегистрыСведений.ЭКОМ_ЦепочкиДокументовПоставщика.Имя Тогда
		
		МассивПолей = Эком_РазложитьСтрокуВМассивПодстрок(Поля, ",", Истина, Истина);
		
		ПроверкаПройдена = ЕстьПоляВРегистреСведенийЭКОМ(ИмяРегистра, МассивПолей, Отборы);
		Если ПроверкаПройдена Тогда
			
			Запрос = ЗапросКРегиструЭКОМ(ИмяРегистра, МассивПолей, Отборы);	
			
			Попытка
				РезультатЗапроса = Запрос.Выполнить();
				Если Не РезультатЗапроса.Пустой() Тогда   	
					Выборка = РезультатЗапроса.Выбрать();
					Выборка.Следующий();
					Для Каждого Элемент Из МассивПолей Цикл
						Результат.Вставить(Элемент, Выборка[Элемент]);
					КонецЦикла;
					Результат.Успешно = Истина; 					
				КонецЕсли; // результат запроса
			Исключение
				ТекстОшибки = ОписаниеОшибки();	
			КонецПопытки;
			
		КонецЕсли; // наличие полей метаданных
	КонецЕсли; // соответствие имени регистра
	
	Возврат Результат;		
КонецФункции

// Возвращает булево значение по результатам проверки наличия полей в метаданных регистра сведений.
// Параметры:
//	ИмяРегистра - Строка, имя регистра сведений, к которому осуществляется запрос
//
//  Поля     	- Массив строковых значений;
//				элементы массива "Измерения" - имена измерений, значения которых необходимо получить. 
//
//  Отборы - Структура
//		     Ключи элементов структуры содержат имена полей отбора РС ЦепочкиДокументовПоставщиков;
//			 Значения элементов структуры содержат значения параметров для отбора к соответствующему ключу.
//
// Возвращаемое значение:
//  Булево		 - Истина, если все измерения найдены в метаданных регистра сведений;
//				   Ложь, если хотя бы одно измерение не найдено.
Функция ЕстьПоляВРегистреСведенийЭКОМ(ИмяРегистра, Поля, Отборы)
	Для Каждого Элемент Из Поля Цикл
		НайденноеИзмерение = Метаданные.РегистрыСведений[ИмяРегистра].Измерения.Найти(Элемент);
		НайденныеРесурс    = Метаданные.РегистрыСведений[ИмяРегистра].Ресурсы.Найти(Элемент);
		Если НайденноеИзмерение = Неопределено И НайденныеРесурс = Неопределено Тогда
			Возврат Ложь;	
		КонецЕсли;
	КонецЦикла;  
	
	Для Каждого Элемент Из Отборы Цикл
		НайденноеИзмерение = Метаданные.РегистрыСведений[ИмяРегистра].Измерения.Найти(Элемент.Ключ);
		НайденныеРесурс    = Метаданные.РегистрыСведений[ИмяРегистра].Ресурсы.Найти(Элемент.Ключ);
		Если НайденноеИзмерение = Неопределено И НайденныеРесурс = Неопределено Тогда
			Возврат Ложь;	
		КонецЕсли;
	КонецЦикла; 
	
	Возврат Истина;
КонецФункции

// Возвращает объект запрос со сформированным текстом на основании полученных параметров.
// Параметры:
//	ИмяРегистра - Строка, имя регистра сведений, в котором осуществляется проверка
//
//  Поля     	- Массив строковых значений;
//				элементы массива - имена измерений, ресурсов, значения которых необходимо получить. 
//
//  Отборы 	    - Структура
//		     	Ключи элементов структуры содержат имена полей отбора РС ЦепочкиДокументовПоставщиков;
//			 	Значения элементов структуры содержат значения параметров для отбора к соответствующему ключу.
//
//  ТипСравнения - Строка
//		     	Доступны значения "=" и "В", по умолчанию "=". При значении "В" в условии формируемого запроса используется
//			 	проверка на вхождение поля регистра в список элементов.
//
//  ТипУсловия  - Строка
//		     	Доступны значения "И" и "ИЛИ", по умолчанию "И". При значении "ИЛИ" в блоке запроса "ГДЕ"
//			 	условия перечисляются через "ИЛИ".
//
// Возвращаемое значение:
//  Запрос		- объект запрос со сформированным текстом.
Функция ЗапросКРегиструЭКОМ(ИмяРегистра, Поля, Отборы, ТипСравнения = "=", ТипУсловия = "И") Экспорт
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	*
	|ИЗ
	|	&ИмяРегистра КАК РегистрСведенийЭКОМ
	|ГДЕ
	|	&Отборы";
	ТекстПоля = "";
	Для Каждого Элемент Из Поля Цикл
		ТекстПоля = ТекстПоля + "РегистрСведенийЭКОМ." + Элемент +  "," + Символы.ПС + Символы.Таб; 
	КонецЦикла;
	Если СтрДлина(ТекстПоля) >= 3 Тогда
		ТекстПоля    = Лев(ТекстПоля, СтрДлина(ТекстПоля) - 3); 
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "*", ТекстПоля);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяРегистра", "РегистрСведений." + ИмяРегистра);
	
	РазделительСравнения = ?(ТипСравнения = "В", ")", ",");
	ТипСравнения 		 = ?(ТипСравнения = "В", " В(&", " = &");
	
	ТекстОтборов = "";
	Для Каждого Элемент Из Отборы Цикл
		ТекстОтборов = ТекстОтборов + "РегистрСведенийЭКОМ." + Элемент.Ключ + ТипСравнения + Элемент.Ключ + РазделительСравнения + Символы.ПС + Символы.Таб + ТипУсловия + " ";
		Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Если СтрДлина(ТекстОтборов) >= 5 Тогда
	ТекстОтборов = Лев(ТекстОтборов, СтрДлина(ТекстОтборов) - 5);
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Отборы", ТекстОтборов); 
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос;
КонецФункции
// Преобразовывает числовое значение в секундах во время в часах, минутах, секундах
//
// Параметры:
//  Значение  - Число - значение в секундах
//
// Возвращаемое значение:
//   Структура   - преобразованное значение (часы, минуты, секунды, строковое представление)
//
Функция СекундыВоВремяНаСервере(Значение) Экспорт

	Результат = Новый Структура("Часы, Минуты, Секунды, Строка", 0, 0, 0, "");

	Если Значение = 0 Тогда
		Результат.Строка	= "менее одной секунды";
	Иначе
	
		Результат.Секунды	= Значение % 60;
		Результат.Минуты 	= (Значение - Результат.Секунды)/60;
		Результат.Минуты 	= Результат.Минуты % 60;
		Результат.Часы 		= (Значение - Результат.Секунды - Результат.Минуты * 60) / 3600;
		Результат.Строка	= ?(Результат.Часы = 0, "", Формат(Результат.Часы, "ЧГ=0") + " ч. ")
			+ ?(Результат.Минуты = 0, "", Формат(Результат.Минуты, "ЧГ=0") + " мин. ")
			+ ?(Результат.Секунды = 0, "", Формат(Результат.Секунды, "ЧГ=0") + " сек.");
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции // СекундыВВремя()

Функция ИспользуетсяОтправкаВMarking() Экспорт
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭКОМ_ПрофилиОбмена.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЭКОМ_ПрофилиОбмена КАК ЭКОМ_ПрофилиОбмена
	               |ГДЕ
	               |	ЭКОМ_ПрофилиОбмена.ОтправлятьУПДВMarking";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьНастройкиПрофилейОбмена() Экспорт
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЭКОМ_GLN.Объект КАК Организация,
	|	ЕСТЬNULL(ЭКОМ_GLN.ПрофильОбмена.ПроверятьФайлыЛокально, ЛОЖЬ) КАК ПроверятьФайлыЛокально
	|ИЗ
	|	РегистрСведений.ЭКОМ_GLN КАК ЭКОМ_GLN
	|ГДЕ
	|	ЭКОМ_GLN.Объект ССЫЛКА Справочник.Организации";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат.Вставить(Выборка.Организация, Выборка.ПроверятьФайлыЛокально);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

// Выполнение кода подписки на сервере в привелигированном режиме
//
// Параметры:
//  Источник  - ДокументСсылка - ссылка на документ источника для подписки
//  Алгоритм  - Строка - текст подписки
//
Процедура ВыполнитьПодпискуВПривелигированномРежиме(Источник, Алгоритм) Экспорт

	Алгоритм = СтрЗаменить(Алгоритм, "КонтрагентУчаствуетВЭДО(", "ЭКОМ_ПодпискаСобытий.КонтрагентУчаствуетВЭДО(");
	Алгоритм = СтрЗаменить(Алгоритм, "ПолучитьИсправляемыйДокументРеализации(", "ЭКОМ_ПодпискаСобытий.ПолучитьИсправляемыйДокументРеализации(");
	
	УстановитьПривилегированныйРежим(Истина);
	Выполнить(Алгоритм);
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры // ВыполнитьВПривелигированномРежиме()

// Вызывается кодом подписки (процедура ВыполнитьПодпискуВПривелигированномРежиме())
//
Функция ПолучитьИсправляемыйДокументРеализации(Док, Исходный = Ложь, ИмяРеквизита = "ДокументРеализации")
   
    Если  Док.Метаданные().Имя = "КорректировкаРеализации"	Тогда       
        Возврат ПолучитьИсправляемыйДокументРеализации(Док[ИмяРеквизита], Исходный);       
    Иначе
        Возврат Док;
    КонецЕсли;   
КонецФункции

// Вызывается кодом подписки (процедура ВыполнитьПодпискуВПривелигированномРежиме())
//
Функция КонтрагентУчаствуетВЭДО(Организация, Контрагент, ТочкаДоставки = Неопределено)
	
	ЗапроcПроверкаКлиента = Новый Запрос;
	ЗапроcПроверкаКлиента.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                              |	ЭКОМ_Организации.GLN КАК GLN_Организация,
	                              |	ЭКОМ_Контрагенты.GLN КАК GLN_Контрагент,
	                              |	ЭКОМ_ТочкиДоставки.GLN КАК GLN_ТочкаДоставки,
	                              |	ЭКОМ_Контрагенты.Ид_ОЭД КАК ИдентификаторКонтрагент,
	                              |	ЭКОМ_Организации.Ид_ОЭД КАК ИдентификаторОрганизация,
	                              |	ЭКОМ_ТочкиДоставки.Ид_ОЭД КАК ИдентификаторТочкаДоставки
	                              |ИЗ
	                              |	РегистрСведений.ЭКОМ_GLN КАК ЭКОМ_Организации
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭКОМ_GLN КАК ЭКОМ_Контрагенты
	                              |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭКОМ_ТочкиДоставки КАК ЭКОМ_ТочкиДоставки
	                              |			ПО (ИСТИНА)
	                              |		ПО (ИСТИНА)
	                              |ГДЕ
	                              |	ЭКОМ_Организации.Объект = &Организация
	                              |	И ЭКОМ_Контрагенты.Объект = &Контрагент
	                              |	И ВЫБОР
	                              |			КОГДА &ТочкаДоставки = НЕОПРЕДЕЛЕНО
	                              |				ТОГДА ИСТИНА
	                              |			ИНАЧЕ ЭКОМ_ТочкиДоставки.Объект = &ТочкаДоставки
	                              |		КОНЕЦ";
	ЗапроcПроверкаКлиента.УстановитьПараметр("ТочкаДоставки", ТочкаДоставки);
	ЗапроcПроверкаКлиента.УстановитьПараметр("Организация", Организация);
	ЗапроcПроверкаКлиента.УстановитьПараметр("Контрагент", Контрагент);
	РезультатЗапроса = ЗапроcПроверкаКлиента.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка;

КонецФункции


// Функционал работы с информационными сообщениями компании.

// Загружает в базу данных информационные сообщения компании.
//
Процедура ОбработатьНовости() Экспорт
	
	// Если обработка только установлена и дата загрузки новостей еще не заполнена, тогда качаем новости за последний месяц.
	ДатаПоследнейЗагрузки 	= НастройкиПрочитатьНаСервере("СлужебныйДатаЗагрузкиНовостей", НачалоДня(ДобавитьМесяц(ТекущаяДата(), -1)));
	МассивЛогаСобытий 		= Новый Массив;
	ИмяКаталога				= "news";
	ДопустимыеРасширения 	= Новый Массив;
	ДопустимыеРасширения.Добавить("html");
	ДопустимыеРасширения.Добавить("txt");                                                                                              
	// Здесь не анализируется ответ сервера. Возможно мы получим ошибку, но посчитаем, что за эту дату не было новостей!!!
	ФайлыКЗагрузке	 		= ПолучитьИменаФайловНовостей(ДатаПоследнейЗагрузки, ДопустимыеРасширения, ИмяКаталога, МассивЛогаСобытий);
	
	КоллекцияНовостей 	= ПолучитьДанныеНовостей(ФайлыКЗагрузке.ИменаФайлов, ДопустимыеРасширения, ИмяКаталога, МассивЛогаСобытий);
	Если ЗначениеЗаполнено(ФайлыКЗагрузке.ДатаВремяЗагрузки)
		И СохранитьНовости(КоллекцияНовостей, МассивЛогаСобытий) Тогда
		
		НастройкаПараметрЗаписать("СлужебныйДатаЗагрузкиНовостей", ФайлыКЗагрузке.ДатаВремяЗагрузки, , МассивЛогаСобытий);
	КонецЕсли;
	
	ЗаписатьЛогСобытийвРегистрЛогирование(МассивЛогаСобытий);
	
	Отбор = Новый Структура("Пользователь, Прочитано",
		ПолучитьЭкомПользователяПоПользователю(НайтиТекущегоПользователя()), Истина);
	ИзменитьНовость(Отбор, , Истина);
	
КонецПроцедуры // ПолучитьНовости()

// Загружает имена доступных новостей из GIT репозитория
//
// Параметры:
//  ДатаПоследнейЗагрузки  	- ДатаВремя - дата последнего обновления новостей
//  ДопустимыеРасширения  	- Массив - коллекция разрешенных к загрузке расширений файлов
//  ИмяКаталога  			- Строка - наименование каталога для загрузки в GIT репозитории
//  МассивЛогаСобытий  		- Массив - коллекция записей лога событий
//
// Возвращаемое значение:
//   Массив   - коллекция имен файлов на GIT, доступных для загрузки
//
Функция ПолучитьИменаФайловНовостей(Знач ДатаПоследнейЗагрузки, Знач ДопустимыеРасширения, Знач ИмяКаталога, МассивЛогаСобытий)
	
	ИмяСобытия			= "Загрузка новостей";
    ОписаниеТиповОтвета = Новый ОписаниеТипов("Массив, Соответствие");
	Результат = Новый Структура("ИменаФайлов, ДатаВремяЗагрузки", Новый Массив, '0001-01-01');
	КомандаЗапроса    	= "/repos/1cdevelopexite/" + ИмяКаталога + "/contents";
	ОтветСервера 		= ПолучениеДанныхGITНаСервере(КомандаЗапроса, МассивЛогаСобытий);
	
	Если ОтветСервера <> Неопределено И ОписаниеТиповОтвета.СодержитТип(ТипЗнч(ОтветСервера)) Тогда
		
		Результат.ДатаВремяЗагрузки = ТекущаяДата();
		
		Если ОтветСервера.Количество() = 0 Тогда
			Возврат Результат;
		КонецЕсли;
		
		Для Каждого ФайлЗапись Из ОтветСервера Цикл
			Результат.ИменаФайлов.Добавить(ФайлЗапись.Получить("name"));
		КонецЦикла;
		
	Иначе
		
		ТекстЛогаСобытий 	=  "Ответ сервера содержит недопустимый тип данных - " + ТипЗнч(ОтветСервера);
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		
		Возврат Результат;
	КонецЕсли; 
	
	МаксИндекс = Результат.ИменаФайлов.ВГраница();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЭКОМ_Новости.ДатаФайла КАК ДатаФайла,
		|	ЭКОМ_Новости.ИмяФайла
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	РегистрСведений.ЭКОМ_Новости КАК ЭКОМ_Новости
		|ГДЕ
		|	ЭКОМ_Новости.ДатаФайла > &ДатаПоследнейЗагрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт.ИмяФайла
		|ИЗ
		|	вт КАК вт";
	
	Запрос.УстановитьПараметр("ДатаПоследнейЗагрузки", ДатаПоследнейЗагрузки);
	РанееЗагруженные = Запрос.Выполнить().Выгрузить();
	РанееЗагруженные.Индексы.Добавить("ИмяФайла");
	
	Для Счетчик = 0 По МаксИндекс Цикл
		
		Индекс 		= МаксИндекс - Счетчик;
		ИмяФайла 	= Результат.ИменаФайлов.Получить(Индекс);
		ДатаФайла	= '0001-01-01';
		
		Если РанееЗагруженные.Найти(ИмяФайла, "ИмяФайла") <> Неопределено
			ИЛИ НЕ РазобратьПроверитьИмяФайлаНовости(ИмяФайла, ДопустимыеРасширения, МассивЛогаСобытий, ДатаФайла)
			ИЛИ (ЗначениеЗаполнено(ДатаФайла) И ДатаФайла <= ДатаПоследнейЗагрузки) Тогда

			Результат.ИменаФайлов.Удалить(Индекс);
			Продолжить;
		КонецЕсли;     
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ЗагрузитьНовостиGIT()

// Проверяет допустимость имени файла новости, получает дату и заглавие новости, возвращает признак корректности имени файла
//
// Параметры:
//  Имя  					- Строка 	- имя файла для проверки. Пример: "2021-01-01-01-01-01_Заглавие новости.txt"
//  ДопустимыеРасширения 	- Массив 	- коллекция допустимых для загрузки расширений
//	МассивЛогаСобытий		- Массив 	- коллекция записей лога событий
//	Дата 					- ДатаВремя - дата последней загрузки новостей 
//	Заглавие 				- Строка 	- полученная из имени файла строка заглавия новости
//
// Возвращаемое значение:
//   Булево   - возвращает Истина, если имя файла корректно
//
Функция РазобратьПроверитьИмяФайлаНовости(Знач Имя, Знач ДопустимыеРасширения, МассивЛогаСобытий, Дата = '0001-01-01', Заглавие = "")
	
	ИмяСобытия		= "Проверка имени файла новости";
	ИмяКорректно 	= Истина;
	
	// Проверка расширения.
	ПоискРасширения = СтрЗаменить(Имя, ".", Символы.ПС);
	Если СтрЧислоСтрок(ПоискРасширения) = 0 Тогда
		ИмяКорректно = Ложь;     
		ТекстЛогаСобытий 	=  "Не найдено расширение в имени файла - " + Имя;
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
	КонецЕсли;
	
	Если ИмяКорректно Тогда
		Расширение 		= СтрПолучитьСтроку(ПоискРасширения, СтрЧислоСтрок(ПоискРасширения)); 
		ПоискРасширения = Неопределено;
		Если ДопустимыеРасширения.Найти(Расширение) = Неопределено Тогда 
			ИмяКорректно = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// Проверка даты новости.
	Если ИмяКорректно Тогда
		ПоискДаты = СтрЗаменить(Имя, "_", Символы.ПС);
		Если СтрЧислоСтрок(ПоискДаты) = 0 Тогда
			ИмяКорректно = Ложь;     
			ТекстЛогаСобытий 	=  "Не правильный формат даты или неправильный разделитель между датой и заглавием новости в имени файла - " + Имя;
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяКорректно Тогда
		ДатаСтрокой = СтрПолучитьСтроку(ПоискДаты, 1);
		Попытка
			Дата = Вычислить("'" + ДатаСтрокой + "'");
		Исключение
			ИмяКорректно = Ложь;     
			ТекстЛогаСобытий 	=  "Не правильный формат даты или неправильный разделитель между датой и заглавием новости в имени файла - " + Имя;
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		КонецПопытки;
	КонецЕсли;
	
	Если ИмяКорректно Тогда
		времЗаглавие 	= Лев(Имя, СтрДлина(Имя) - (СтрДлина(Расширение) + 1));
		Заглавие 		= Прав(времЗаглавие, СтрДлина(времЗаглавие) - (СтрДлина(ДатаСтрокой) + 1));
	КонецЕсли;
	
	Возврат ИмяКорректно;

КонецФункции // РазобратьПроверитьИмяФайлаНовости()

// Получает информацию из файлов новостей на основании входящих имен файлов
//
// Параметры:
//  Имена  					- Массив - коллекция имен файлов на GIT
//  ДопустимыеРасширения  	- Массив - коллекция допустимых для загрузки расширений
//	ИмяКаталога				- Строка - наименование каталога для загрузки в GIT репозитории
//	МассивЛогаСобытий		- Массив - коллекция записей лога событий
//
// Возвращаемое значение:
//   ТаблицаЗначений   		- информация из файлов новостей. Колонки: Заглавие (Строка, 300), ДатаФайла (ДатаВремя), Содержание(Строка, неогр.)
//
Функция ПолучитьДанныеНовостей(Имена, Знач ДопустимыеРасширения, Знач ИмяКаталога, МассивЛогаСобытий)
	
	ИмяСобытия		= "Загрузка новости";
	КомандаЗапроса	= "/repos/1cdevelopexite/" + ИмяКаталога + "/contents/";
	Ответ			= Новый ТаблицаЗначений;
	Ответ.Колонки.Добавить("ИмяФайла", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(300)));
	Ответ.Колонки.Добавить("Заглавие", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(300)));
	Ответ.Колонки.Добавить("ДатаФайла",Новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	Ответ.Колонки.Добавить("Содержание", Новый ОписаниеТипов("Строка"));
	
	Если ТипЗнч(Имена) <> Тип("Массив") Тогда
		ТекстЛогаСобытий 	=  "Ошибка типа параметра функции - " + ТипЗнч(Имена);
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		Возврат Ответ;
	ИначеЕсли Имена.Количество() > 0 Тогда
		ВерсияПлатформы = ВерсияПлатформыНаСервере();
		Если ВерсияПлатформы < 83100 Тогда
			КаталогВременныхФайлов = КаталогВременныхФайлов() + "TempECOM" + ПолучитьРазделительПути();
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого ИмяФайла Из Имена Цикл
		
		ОтветСервера 		= ПолучениеДанныхGITНаСервере(КомандаЗапроса + ИмяФайла, МассивЛогаСобытий);
		
		Если ОтветСервера 	= Неопределено Тогда
			ТекстЛогаСобытий 	=  "Данные файла " + ИмяФайла + " не получены";
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Предупреждение, ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
			Продолжить;
		КонецЕсли;
		
		СтрокаBase64   	= СтрЗаменить(ОтветСервера.Получить("content"), "\/", "/");
		ДвоичныеДанные 	= Base64Значение(СтрокаBase64);
		Чтение			= Неопределено;
		Если ВерсияПлатформы >= 83100 Тогда
			Чтение = Вычислить("Новый ЧтениеДанных(ДвоичныеДанные)"); 
			Файл = Вычислить("Новый ПотокВПамяти(Чтение.ПрочитатьВБуферДвоичныхДанных())");
			Чтение.Закрыть();
		Иначе
			Файл = КаталогВременныхФайлов + ИмяФайла;
			ДвоичныеДанные.Записать(Файл);
		КонецЕсли;
		
		ЧтениеФайла = Новый ЧтениеТекста(Файл, КодировкаТекста.UTF8);
		Содержание 	= ЧтениеФайла.Прочитать();
		ЧтениеФайла.Закрыть();     
		
		Если ВерсияПлатформы >= 83100 Тогда
			Выполнить("Файл.Закрыть()");
		Иначе
			УдалитьФайлы(Файл.ПолноеИмя);
		КонецЕсли;
		
		СтрокаОтвета 			= Ответ.Добавить();
		СтрокаОтвета.ИмяФайла	= ИмяФайла;
		СтрокаОтвета.Содержание = Содержание;
		РазобратьПроверитьИмяФайлаНовости(ИмяФайла, ДопустимыеРасширения, МассивЛогаСобытий, СтрокаОтвета.ДатаФайла, СтрокаОтвета.Заглавие)
		
	КонецЦикла;	
	
	Возврат Ответ;
	
КонецФункции // ПолучитьДанныеНовостей()

// Сохраняет полученные новости в регистр сведений
//
// Параметры:
//  КоллекцияНовостей	 - ТаблицаЗначений	 - информация из файлов новостей. Колонки: Заглавие (Строка, 300), ДатаФайла (ДатаВремя), Содержание(Строка, неогр.)
//  МассивЛогаСобытий	 - Массив			 - коллекция записей лога событий
// 
// Возвращаемое значение:
//  Булево - признак успешности записи новостей
//
Функция СохранитьНовости(КоллекцияНовостей, МассивЛогаСобытий)
	
	ИмяСобытия = "Сохранение новости";
	
	// Валидация входных данных.
	Если НЕ ТипЗнч(КоллекцияНовостей) = Тип("ТаблицаЗначений") Тогда
		ТекстЛогаСобытий 	=  "Неправильный тип коллекции новостей. Текущий тип " + ТипЗнч(КоллекцияНовостей)
			+ ". Ожидается ТаблицаЗначений";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		Возврат Ложь;
	ИначеЕсли КоллекцияНовостей.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	КоллекцияНовостей.Колонки.Добавить("Пользователь", Новый ОписаниеТипов("СправочникСсылка.ЭКОМ_Пользователи"));
	
	Колонки = Новый Структура;
	Колонки.Вставить("ИмяФайла",	Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(300)));
	Колонки.Вставить("Заглавие", 	Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(300)));
	Колонки.Вставить("ДатаФайла",	Новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	Колонки.Вставить("Содержание",	Новый ОписаниеТипов("Строка"));
	
	Для Каждого Колонка Из Колонки Цикл
		КолонкаТЗ = КоллекцияНовостей.Колонки.Найти(Колонка.Ключ);
		ТекстЛогаСобытий = "";
		Если КолонкаТЗ = Неопределено Тогда
			ТекстЛогаСобытий =  "Не корректный список колонок в коллекции новостей. Ожидается колонка с именем " + Колонка.Ключ;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(КолонкаТЗ) И КолонкаТЗ.ТипЗначения <> Колонка.Значение Тогда
			ТекстЛогаСобытий =  "Не корректный тип значений колонок в коллекции новостей. Для колонки " + КолонкаТЗ.Имя
				+ " ожидается тип " + Строка(Колонка.Значение) + ". Текущий тип " + Строка(КолонкаТЗ.ТипЗначения);
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ТекстЛогаСобытий) Тогда
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Ошибка, ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	// Запись новостей в регистр.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭКОМ_Пользователи.Ссылка
		|ИЗ
		|	Справочник.ЭКОМ_Пользователи КАК ЭКОМ_Пользователи
		|ГДЕ
		|	ЭКОМ_Пользователи.ПометкаУдаления = ЛОЖЬ";
	
	КоллекцияПользователей = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
	НаборЗаписей = РегистрыСведений.ЭКОМ_Новости.СоздатьНаборЗаписей();
	Для Каждого Новость Из КоллекцияНовостей Цикл
		Если КоллекцияПользователей.Количество() = 0 Тогда 
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Новость);
		Иначе
			Для Каждого Пользователь Из КоллекцияПользователей Цикл
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Пользователь = Пользователь;
				ЗаполнитьЗначенияСвойств(НоваяЗапись, Новость, , "Пользователь");
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;  
	
	Если НаборЗаписей.Модифицированность() Тогда
		НаборЗаписей.Записать();
		ТекстЛогаСобытий 	=  "Загружено " + КоллекцияНовостей.Количество() + ?(КоллекцияНовостей.Количество() = 1, " новостное сообщение.", " новостных сообщений.");
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, Перечисления.ЭКОМ_УровниЛогирования.Успешно, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // СохранитьНовости()

// Меняет записи РС ЭКОМ_Новости
//
// Параметры:
//  Отбор  - Структура - параметры отбора для поиска записей в регистре
//  Значения  - Структура - значения для замены в записях. Может быть не заполненно
//  Удалить  - Булево - пометка удаления записей по отбору
//
Процедура ИзменитьНовость(Отбор, Значения = Неопределено, Удалить = Ложь) Экспорт
	
	Если ТипЗнч(Отбор) <> Тип("Структура") Тогда 
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ЭКОМ_Новости.СоздатьНаборЗаписей();
	
	Для Каждого ЭлементОтбора Из Отбор Цикл
		
		ОтборНабора 		= НаборЗаписей.Отбор.Найти(ЭлементОтбора.Ключ);
		Если ОтборНабора 	= Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ОтборНабора.Установить(ЭлементОтбора.Значение);
		
	КонецЦикла;
	
	НачатьТранзакцию(); 
	
	ЭКОМ_ПодпискаСобытий.ВыполнитьБлокировкуНабораЗаписей(НаборЗаписей.Отбор, "ЭКОМ_Новости");
	НаборЗаписей.Прочитать();
	
	Если Удалить = Истина Тогда 
		НаборЗаписей.Очистить();
	ИначеЕсли ТипЗнч(Значения) = Тип("Структура") Тогда
		Для Каждого Запись Из НаборЗаписей Цикл
			Для Каждого ЭлементЗначения Из Значения Цикл
				Попытка
					Запись[ЭлементЗначения.Ключ] = ЭлементЗначения.Значение;
				Исключение   
					ОтменитьТранзакцию();
					Возврат;
				КонецПопытки;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Если НаборЗаписей.Модифицированность() = Истина Тогда 
		НаборЗаписей.Записать();
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры // ИзменитьНовость()

// Возвращает ссылку на элемент справочника ЭКОМ_Пользователи, к которому привязан переданный пользователь
//
// Параметры:
//  Пользователь  - СправочникСсылка.Пользователи - польозватель, для которого нужно найти соответствия
//
// Возвращаемое значение:
//   СправочникСсылка.ЭКОМ_Пользователи   - элемент, связанный с переданным пользователем. Если не найден, возвращается пустая ссылка
//
Функция ПолучитьЭкомПользователяПоПользователю(Пользователь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЭКОМ_Пользователи.Ссылка
		|ПОМЕСТИТЬ втПользователи
		|ИЗ
		|	Справочник.ЭКОМ_Пользователи КАК ЭКОМ_Пользователи
		|ГДЕ
		|	ЭКОМ_Пользователи.Пользователь = &Пользователь
		|	И ЭКОМ_Пользователи.ПометкаУдаления = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.ЭКОМ_Пользователи.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	втПользователи.Ссылка
		|ИЗ
		|	втПользователи КАК втПользователи";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка").Получить(0);
	
КонецФункции // ПолучитьЭкомПользователяПоПользователю()

// Получает непрочитанные новости для текущего пользователя с сортировкой по убыванию даты
//
// Возвращаемое значение:
//   ТаблицаЗначений   - коллекция новостей пользователя
//
Функция ПолучитьНовостиПользователя() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЭКОМ_Новости.ДатаФайла,
		|	ЭКОМ_Новости.Заглавие,
		|	ЭКОМ_Новости.ИмяФайла,
		|	ЭКОМ_Новости.Прочитано,
		|	ЭКОМ_Новости.Содержание
		|ИЗ
		|	РегистрСведений.ЭКОМ_Новости КАК ЭКОМ_Новости
		|ГДЕ
		|	ЭКОМ_Новости.Пользователь = &Пользователь
		|	И ЭКОМ_Новости.Прочитано = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаФайла УБЫВ";
	
	Запрос.УстановитьПараметр("Пользователь", ПолучитьЭкомПользователяПоПользователю(НайтиТекущегоПользователя()));
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ПолучитьНовостиПользователя()

//Docrobot 29.11.2021 MOD-1361
Функция ПроверитьСтрануВПрофилеОбмена()
	ПроверятьНаЗаполненностьПароля = Истина;
	Запрос = Новый("Запрос");
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭКОМ_GLN.Объект КАК Организация,
	               |	ЭКОМ_GLN.ПрофильОбмена КАК ПрофильОбмена,
	               |	ЭКОМ_GLN.ПрофильОбмена.Страна КАК Страна
	               |ИЗ
	               |	РегистрСведений.ЭКОМ_GLN КАК ЭКОМ_GLN
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(ЭКОМ_GLN.Объект) = ТИП(Справочник.Организации)
	               |	И ЭКОМ_GLN.ПрофильОбмена.Страна = ""kz""";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПроверятьНаЗаполненностьПароля = Ложь;
	конецЕсли;
	
	Возврат ПроверятьНаЗаполненностьПароля;
	
КонецФункции
//Docrobot 29.11.2021 MOD-1361

//Docrobot 1.19.1 MOD-1637[вызывается из модуля обработки для проверки срока действия сертификата]
Функция ПроверитьСертификатДействителен(СертификатЭКОМ) Экспорт 

	МенеджерКриптографии  = ЭЦП_ПолучитьМенеджерКриптографии(СертификатЭКОМ.АлгоритмПодписи, Новый Массив);	
	Если МенеджерКриптографии = Неопределено Тогда
		Возврат "Не удалось создать менеджер криптографии.";
	Иначе 	
		// Получаем сертификат
		Сертификат = ЭЦП_ПолучитьСертификатПоОтпечатку(МенеджерКриптографии, СертификатЭКОМ);
		Если Сертификат = Неопределено Тогда 
			Возврат "Не удалось получить сертификат."
		КонецЕсли;
		Если Сертификат.ДатаОкончания < ТекущаяДата() Тогда 
			Возврат "У сертификата " + ОписаниеСертификата(СертификатЭКОМ) + " истек срок действия.";
		КонецЕсли;
	КонецЕсли;
	//Все хорошо, сертификат не просрочен
	Возврат 0;
	
КонецФункции

Функция УдалитьПовторяющиесяЭлементыМассива(Массив, НеИспользоватьНеопределено = Ложь) Экспорт
	
	ОписаниеТиповСправочники  = Справочники.ТипВсеСсылки(); 
	ОписаниеТиповДокументы    = Документы.ТипВсеСсылки(); 
	ОписаниеТиповПВХ          = ПланыВидовХарактеристик.ТипВсеСсылки(); 
	ОписаниеТиповПланыСчетов  = ПланыСчетов.ТипВсеСсылки(); 
	ОписаниеТиповПланыРасчета = ПланыВидовРасчета.ТипВсеСсылки(); 
	
	Если ТипЗнч(Массив) = Тип("Массив") Тогда 
		
		УжеВМассиве 		   = Новый Соответствие; 
		БылоНеопределено 	   = Ложь;
		КоличествоЭлементовВМассиве = Массив.Количество(); 
		
		Для ОбратныйИндекс = 1 По КоличествоЭлементовВМассиве Цикл 
			
			ЭлементМассива = Массив[КоличествоЭлементовВМассиве - ОбратныйИндекс]; 
			ТипЭлемента    = ТипЗнч(ЭлементМассива); 
			
			Если ЭлементМассива = Неопределено Тогда
				
				Если БылоНеопределено ИЛИ НеИспользоватьНеопределено Тогда
					Массив.Удалить(КоличествоЭлементовВМассиве - ОбратныйИндекс); 
				Иначе
					БылоНеопределено = Истина;
				КонецЕсли;
				
				Продолжить;
				
			ИначеЕсли ОписаниеТиповСправочники.СодержитТип(ТипЭлемента) 
			 ИЛИ ОписаниеТиповДокументы.СодержитТип(ТипЭлемента) 
			 ИЛИ ОписаниеТиповПВХ.СодержитТип(ТипЭлемента) 
			 ИЛИ ОписаниеТиповПланыСчетов.СодержитТип(ТипЭлемента) 
			 ИЛИ ОписаниеТиповПланыРасчета.СодержитТип(ТипЭлемента) Тогда 
				
				ИДЭлемента = Строка(ЭлементМассива.УникальныйИдентификатор()); 
				
			Иначе 
				
				ИДЭлемента = ЭлементМассива; 
				
			КонецЕсли; 
			
			Если УжеВМассиве[ИДЭлемента] = Истина Тогда 
				Массив.Удалить(КоличествоЭлементовВМассиве - ОбратныйИндекс); 
			Иначе 
				УжеВМассиве[ИДЭлемента] = Истина; 
			КонецЕсли; 
			
		КонецЦикла;      
		
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

Процедура ОчиститьСтрокуXMLОтПустыхТегов(СтрокаXML, МассивТегов) Экспорт
	
	МассивТегов = ЭКОМ_ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(МассивТегов);
	Для Каждого Тег Из МассивТегов Цикл
		
		ИскомыйТег = "<" + Тег + "/>";
		ПозицияТега = ЭКОМ_ОбщегоНазначения.ПоискВСтроке(СтрокаXML, ИскомыйТег);
		
		Пока НЕ ПозицияТега = 0 Цикл
			
			ПозицияПСПередТегом = ЭКОМ_ОбщегоНазначения.ПоискВСтроке(СтрокаXML, "" + Символы.ПС, -1, ПозицияТега, 1);
			ДлинаТега = СтрДлина(ИскомыйТег);
			
			Если ПозицияПСПередТегом > 0 И ПозицияПСПередТегом < ПозицияТега Тогда
				Подстрока = Сред(СтрокаXML, ПозицияПСПередТегом + 1, ПозицияТега - ПозицияПСПередТегом + ДлинаТега - 1);
			Иначе
				Подстрока = ИскомыйТег;
			КонецЕсли;
			Если Сред(СтрокаXML, ПозицияТега + ДлинаТега, 1) = Символы.ПС Тогда
				Подстрока = Подстрока + Символы.ПС;
			КонецЕсли;
			
			СтрокаXML = СтрЗаменить(СтрокаXML, Подстрока, "");
			ПозицияТега = ЭКОМ_ОбщегоНазначения.ПоискВСтроке(СтрокаXML, ИскомыйТег);
			
		КонецЦикла;		
	КонецЦикла;
	
КонецПроцедуры
