#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Подсистема "Управление доступом".

// Процедура ЗаполнитьНаборыЗначенийДоступа по свойствам объекта заполняет наборы значений доступа
// в таблице с полями:
//    НомерНабора     - Число                                     (необязательно, если набор один),
//    ВидДоступа      - ПланВидовХарактеристикСсылка.ВидыДоступа, (обязательно),
//    ЗначениеДоступа - Неопределено, СправочникСсылка или др.    (обязательно),
//    Чтение          - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Добавление      - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Изменение       - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Удаление        - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//
//  Вызывается из процедуры УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа(),
// если объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьНаборыЗначенийДоступа" и
// из таких же процедур объектов, у которых наборы значений доступа зависят от наборов этого
// объекта (в этом случае объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьЗависимыеНаборыЗначенийДоступа").
//
// Параметры:
//  Таблица      - ТабличнаяЧасть,
//                 РегистрСведенийНаборЗаписей.НаборыЗначенийДоступа,
//                 ТаблицаЗначений, возвращаемая УправлениеДоступом.ТаблицаНаборыЗначенийДоступа().
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	ЗарплатаКадры.ЗаполнитьНаборыПоОрганизацииИФизическимЛицам(ЭтотОбъект, Таблица, "Организация", "Сотрудники.ФизическоеЛицо");
	
КонецПроцедуры

// Подсистема "Управление доступом".

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДанныеВедомости = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ведомость, "Проведен, Организация");
	
	Если НЕ Ведомость.Проведен Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Документ %1 не проведен.'"), Ведомость);
		ВызватьИсключение ТекстОшибки;	
	КонецЕсли;	
	Если ДанныеВедомости.Организация <> Организация Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Документ %1 относится к другой организации.'"), Ведомость);
		ВызватьИсключение ТекстОшибки;	
	КонецЕсли;	
	
	//Если в документе выбран сотрудник, которого нет в указанной ведомости, необходимо выдавать предупреждение
	РезультатПроверки = ПроверитьСоответствиеСотрудниковВедомости();
	Если Не РезультатПроверки Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В таблице есть сотрудники, отсутствующие в документе %1.'"), Ведомость);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	СведенияОНезачисленныхВзносахОтчисленияхПоВедомости = НезачисленияПоВедомости();
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	Физлица = Сотрудники.ВыгрузитьКолонку("ФизическоеЛицо");
	
	Если Не Отказ И Физлица.Количество() > 0 Тогда
		
		ЗарегистрироватьНевыплатуДокументом(Движения, Отказ, СведенияОНезачисленныхВзносахОтчисленияхПоВедомости);
		
	КонецЕсли;

КонецПроцедуры

Функция НезачисленияПоВедомости() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ведомость", Ведомость);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВедомостьНаПеречислениеВзносовОтчислений.Ссылка,
	|	ВедомостьНаПеречислениеВзносовОтчислений.ВидНалогаВзносаОтчисления,
	|	ВедомостьНаПеречислениеВзносовОтчислений.ВидПлатежа
	|ПОМЕСТИТЬ ВТ_Ведомость
	|ИЗ
	|	Документ.ВедомостьНаПеречислениеВзносовОтчислений КАК ВедомостьНаПеречислениеВзносовОтчислений
	|ГДЕ
	|	ВедомостьНаПеречислениеВзносовОтчислений.Ссылка = &Ведомость
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка КАК Ссылка,
	|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.НалогВзнос КАК НалогВзнос,
	|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ВТ_Ведомость.ВидНалогаВзносаОтчисления,
	|	ВТ_Ведомость.ВидПлатежа
	|ПОМЕСТИТЬ ВТ_НалогиВзносыОтчисления
	|ИЗ
	|	ВТ_Ведомость КАК ВТ_Ведомость
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьНаПеречислениеВзносовОтчислений.НалогиВзносыОтчисления КАК ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления
	|		ПО ВТ_Ведомость.Ссылка = ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СведенияОНезачисленныхВзносахОтчисленияхСотрудники.Ссылка КАК Ссылка,
	|	СведенияОНезачисленныхВзносахОтчисленияхСотрудники.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_СотрудникиПоВедомости
	|ИЗ
	|	Документ.СведенияОНезачисленныхВзносахОтчислениях.Сотрудники КАК СведенияОНезачисленныхВзносахОтчисленияхСотрудники
	|ГДЕ
	|	СведенияОНезачисленныхВзносахОтчисленияхСотрудники.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОНезачисленныхВзносахОтчисленияхСотрудники.ФизическоеЛицо,
	|	СведенияОНезачисленныхВзносахОтчисленияхСотрудники.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СотрудникиПоВедомости.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_НалогиВзносыОтчисления.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	СУММА(ВТ_НалогиВзносыОтчисления.НалогВзнос) КАК НалогВзнос,
	|	ВТ_НалогиВзносыОтчисления.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ВТ_НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления,
	|	ВТ_НалогиВзносыОтчисления.ВидПлатежа
	|ИЗ
	|	ВТ_СотрудникиПоВедомости КАК ВТ_СотрудникиПоВедомости
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НалогиВзносыОтчисления КАК ВТ_НалогиВзносыОтчисления
	|		ПО ВТ_СотрудникиПоВедомости.ФизическоеЛицо = ВТ_НалогиВзносыОтчисления.ФизическоеЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СотрудникиПоВедомости.ФизическоеЛицо,
	|	ВТ_НалогиВзносыОтчисления.МесяцНалоговогоПериода,
	|	ВТ_НалогиВзносыОтчисления.РегистрацияВНалоговомОргане,
	|	ВТ_НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления,
	|	ВТ_НалогиВзносыОтчисления.ВидПлатежа";

	НезачисленияПоВедомости = Запрос.Выполнить().Выгрузить();
	
	Возврат НезачисленияПоВедомости;
	
КонецФункции

// Процедура регистрирует факт неудачи при попытке выплаты зарплаты документом.
// При этом ранее удержанные при выплате налоги "сторнируются".
//
// Параметры:
//		Движения 		- КоллекцияДвижений, коллекция наборов записей движений ведомости.
//		Отказ			- признак отказа выполнения операции.
//		Документ		- ссылка на документ, которым ранее была зарегистрирована выплата зарплаты.
//		ФизическиеЛица	- массив ссылок на физические лица.
//
// Обработка ошибочных ситуаций
//	выдается сообщение, признак «Отказ» выставляется в Истина.
//
Процедура ЗарегистрироватьНевыплатуДокументом(Движения, Отказ, СведенияОНезачисленныхВзносахОтчисленияхПоВедомости) Экспорт
	
	Для Каждого СтрокаСотрудники ИЗ СведенияОНезачисленныхВзносахОтчисленияхПоВедомости Цикл
		
	    НоваяЗапись = Движения.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаСотрудники);

		НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
		НоваяЗапись.НалогВзнос 	= - СтрокаСотрудники.НалогВзнос;
		НоваяЗапись.Организация = Организация;
		НоваяЗапись.Период 		= Дата;
		
	КонецЦикла;
	
	Движения.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Записывать = Истина;
	
КонецПроцедуры

Функция ПроверитьСоответствиеСотрудниковВедомости()
	
	//Получаем список сотрудников в первоначальном документе
	СотрудникиПоВедомости = Новый Массив();
	Для Каждого ДанныеСтроки Из Ведомость.НалогиВзносыОтчисления Цикл
		СотрудникиПоВедомости.Добавить(ДанныеСтроки.ФизическоеЛицо);
	КонецЦикла;
	
	//Проверяем наличие каждого сотрудника из текущего документа в ведомости
	ВсеСотрудникиСоответствуют = Истина;
	Для Каждого Сотрудник Из ЭтотОбъект.Сотрудники Цикл
		Если СотрудникиПоВедомости.Найти(Сотрудник.ФизическоеЛицо) = Неопределено Тогда
			ВсеСотрудникиСоответствуют = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВсеСотрудникиСоответствуют;
	
КонецФункции

#КонецОбласти

#КонецЕсли
