#Область Обработчики_событий_Формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Восстановление пользовательских настроек.
	Настройка = ХранилищеНастроекДанныхФорм.Загрузить("ФормаНовыйCONDRA", "НомерДатаПоУмолчанию",, ПараметрыСеанса.ТекущийПользователь.Наименование);    
	Если НЕ Настройка = Неопределено Тогда
		НомерДатаПоУмолчанию = Настройка;
	КонецЕсли;
	
	// Получение имени текущей обработки.
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    СлужебныйПолноеИмяФормы = ОбработкаОбъект.Метаданные().ПолноеИмя();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	//Docrobot 1.20.0 MOD-1638 [Перенесено в НомерДатаПоУмолчаниюПриИзменении]
	//СохранитьПользовательскиеНастройки("НомерДатаПоУмолчанию", НомерДатаПоУмолчанию, "Пользовательская настройка ""Номер и дата по умолчанию""");
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_событий_элементов_формы

&НаКлиенте
Процедура ТабличноеПолеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	ДобавитьСкопироватьСтроки(Копирование);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерДатаПоУмолчаниюПриИзменении(Элемент)
	
	Если НомерДатаПоУмолчанию Тогда
		Для Каждого СтрокаТабличногоПоля Из ТабличноеПоле Цикл
			СтрокаТабличногоПоля.Номер = "";
			СтрокаТабличногоПоля.Дата = '0001-01-01';
		КонецЦикла;
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
	
	//Docrobot 1.20.0 MOD-1638 [Производим запись непосредственно при изменении настройки, данных не много]
	СохранитьПользовательскиеНастройки("НомерДатаПоУмолчанию", НомерДатаПоУмолчанию, "Пользовательская настройка ""Номер и дата по умолчанию""");
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ТабличноеПолеИмяФайла" Тогда 
		ЗапуститьПриложение(Элемент.ТекущиеДанные.Путь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранить(Команда, Отправить = Ложь)
	
	ПустыеЗначенияКолонок = ПолучитьПустыеЗначенияКолонок();
	Отказ = Ложь;
	ТекстОшибки = "";
	Для Каждого Колонка Из Элементы.ТабличноеПоле.ПодчиненныеЭлементы Цикл
		НомераСтрок = "";
		Если Колонка.АвтоОтметкаНезаполненного = Истина Тогда
			
			ПустоеЗначение = Неопределено;
			ПустыеЗначенияКолонок.Свойство(СтрЗаменить(Колонка.Имя, "ТабличноеПоле", ""), ПустоеЗначение);
			КоличествоОшибок = 0;
			Для Каждого Строка Из ТабличноеПоле.НайтиСтроки(Новый Структура(СтрЗаменить(Колонка.Имя, "ТабличноеПоле", ""), ПустоеЗначение)) Цикл
				НомераСтрок = НомераСтрок + ?(ПустаяСтрока(НомераСтрок), "", ", ") + (ТабличноеПоле.Индекс(Строка) + 1);
				КоличествоОшибок = КоличествоОшибок + 1;
				Отказ = Истина;
			КонецЦикла;
			Если НЕ ПустаяСтрока(НомераСтрок) Тогда
				ТекстОшибки = ТекстОшибки + ?(ПустаяСтрока(ТекстОшибки), "", Символы.ПС)
					+ "По " + ?(КоличествоОшибок = 1, "строке", "строкам") + " № " + НомераСтрок + " не заполнена колонка " + Колонка.Заголовок;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Сообщить(ТекстОшибки);
	Иначе
		Файлы = Новый Массив;
		Для Каждого Строка Из ТабличноеПоле Цикл
			Файл = Новый Файл(Строка.Путь);
			Если файл.Существует()
				И Файл.ЭтоФайл()
				И НЕ Строка.Записан Тогда
				Файлы.Добавить(Новый ОписаниеПередаваемогоФайла(Строка.Путь));
			КонецЕсли;
		КонецЦикла;
		
		ДополнительныеПараметры = Новый Структура("Отправить", Отправить);
		ОписаниеОповещенияОЗаверщении = Новый ОписаниеОповещения("НачатьПомещениеФайловНаСерверЗавершение", ЭтаФорма, ДополнительныеПараметры);
		ПомещенныеФайлы = Новый Массив;
		
		Если ВерсияПлатформыНаКлиенте() >= 83150 Тогда
			ОписаниеОповещенияОХодеВыполнения = Новый ОписаниеОповещения("НачатьПомещениеФайловНаСерверПрогресс", ЭтаФорма);
			Выполнить("НачатьПомещениеФайловНаСервер(ОписаниеОповещенияОЗаверщении, ОписаниеОповещенияОХодеВыполнения,, Файлы, ЭтаФорма.УникальныйИдентификатор)");
		ИначеЕсли ВерсияПлатформыНаКлиенте() >= 831315 Тогда // 8.3.13.1513
			НачатьПомещениеФайлов(ОписаниеОповещенияОЗаверщении, Файлы, Ложь, ЭтаФорма.УникальныйИдентификатор);
		ИначеЕсли ПоместитьФайлы(Файлы, ПомещенныеФайлы,, Ложь) Тогда 
			НачатьПомещениеФайловНаСерверЗавершение(ПомещенныеФайлы, ДополнительныеПараметры);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьИЗакрыть(Команда)
	
	КомандаСохранить(Команда);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодписатьОтправить(Команда)
	
	КомандаСохранить(Команда, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область Вспомогательные_методы

&НаКлиенте
Процедура НачатьПомещениеФайловНаСерверЗавершение(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт

	ПомещенныеФайлыСоответствие = Новый Соответствие;
	Для Каждого Элемент Из ПомещенныеФайлы Цикл
		Попытка
			ПомещенныеФайлыСоответствие.Вставить(Элемент.СсылкаНаФайл.Файл.ПолноеИмя, Элемент.Адрес);
		Исключение
			ПомещенныеФайлыСоответствие.Вставить(Элемент.ПолноеИмя, Элемент.Хранение);
		КонецПопытки;
	КонецЦикла;
	
	Сохраненные = КомандаСохранитьНаСервере(ПомещенныеФайлыСоответствие);
	Если ДополнительныеПараметры.Отправить Тогда
		ВладелецФормы.ИсходящийCondra_Отправить(Неопределено, Сохраненные);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НачатьПомещениеФайловНаСерверПрогресс(
	ПомещаемыйФайл,
	Помещено,
	ОтказОтПомещенияФайла,
	ПомещеноВсего,
	ОтказОтПомещенияВсехФайлов,
	ДополнительныеПараметры) Экспорт

	Состояние(?(ПомещеноВсего = 100, "Запись исходящих файлов", "Передача " + ПомещаемыйФайл.Имя), ПомещеноВсего);

КонецПроцедуры

// Выполняет обновление свойств элеметов формы
//
&НаКлиенте
Процедура УправлениеЭлементамиФормы()

	// Действия при изменении флажка Номер и дата по умолчанию.
	Элементы.ТабличноеПолеНомер.АвтоОтметкаНезаполненного	= НЕ НомерДатаПоУмолчанию;
	Элементы.ТабличноеПолеДата.АвтоОтметкаНезаполненного 	= НЕ НомерДатаПоУмолчанию;
	
	Элементы.ТабличноеПолеНомер.ТолькоПросмотр	= НомерДатаПоУмолчанию;
	Элементы.ТабличноеПолеДата.ТолькоПросмотр	= НомерДатаПоУмолчанию;

КонецПроцедуры // УправлениеЭлементамиФормы()

// Добавляет строку в документ копированием текущих настроек либо установкой значений вручную
//
// Параметры:
//  Копирование  - Булево - признак копирования строки
//
&НаКлиенте
Процедура ДобавитьСкопироватьСтроки(Копирование)

	ПараметрыКопирования = Новый Массив;
	
	Если Копирование Тогда
		
		ПараметрыФормы = Новый Массив;
		ПараметрыФормы.Добавить("ЭтаФорма.Заголовок = ""Параметры копирования""");
		ПараметрыФормы.Добавить("ЭтаФорма.Редактирование = Ложь");
		ПараметрыФормы.Добавить("ЭтаФорма.НеПроверятьКорректностьИмениКлюча = Истина");
		ПараметрыФормы.Добавить("ЭтаФорма.Элементы.ТабличноеПолеРеквизит.Заголовок = """"");
		ПараметрыФормы.Добавить("ЭтаФорма.Элементы.ТабличноеПолеОбязательный.Заголовок = """"");
		ПараметрыФормы.Добавить("ЭтаФорма.Элементы.ТабличноеПолеФормула.Видимость = Ложь");
		ПараметрыФормы.Добавить("ЭтаФорма.Элементы.Записать.Заголовок = ""Применить""");
		
		Настройка = ПолучитьПользовательскиеНастройки("ПараметрыКопирования");
		Если Настройка = Неопределено Тогда // Установка новых параметров копирования
			
			Для Каждого Колонка ИЗ Элементы.ТабличноеПоле.ПодчиненныеЭлементы Цикл
				Если НЕ Колонка.Видимость
					ИЛИ Колонка.Имя = "ТабличноеПолеИмяФайла" Тогда
					Продолжить;
				КонецЕсли;
				
				Параметр = Новый Массив;
				Параметр.Добавить(Колонка.Заголовок);
				Параметр.Добавить(Истина);
				
				ПараметрыКопирования.Добавить(Параметр);
			КонецЦикла;
		Иначе // Получение ранее установленных параметров копирования
			ПараметрыКопирования = Настройка;
		КонецЕсли;
		// Перенос параметров на открываемую форму.
		ТабличноеПолеДляКнопки = Новый Массив;
		Для Каждого Строка Из ПараметрыКопирования Цикл
			ТабличноеПолеДляКнопки.Добавить(Новый Структура("Реквизит, Формула, Использовать", Строка[0], "", Строка[1]));
		КонецЦикла;
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("УФ_ФормаНастройкиСлужебные_Закрытие", ЭтаФорма, Новый Структура("ЭлементТекущиеДанные", ПараметрыКопирования));
		
		ОткрытьФорму(
			ЭтаФорма.СлужебныйПолноеИмяФормы + ".Форма.УФ_ФормаНастройкиСлужебные",
			Новый Структура("Выполнить, ТабличноеПолеДляКнопки", ПараметрыФормы, ТабличноеПолеДляКнопки),
			ЭтаФорма,
			,
			,
			,
			ОповещениеОЗакрытии,
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	Иначе
		
		ОбработкаОкончанияПомещения = Новый ОписаниеОповещения("ОповещениеДобавитьСкопироватьСтроки", ЭтаФорма, ПараметрыКопирования);
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогОткрытияФайла.МножественныйВыбор = Истина;
		ДиалогОткрытияФайла.Показать(ОбработкаОкончанияПомещения);
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСкопироватьСтроки()

&НаКлиенте
Процедура УФ_ФормаНастройкиСлужебные_Закрытие(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат; // Отказ от копирования
	КонецЕсли;
	
	ПараметрыКопирования = Новый Массив;
	
	Для Каждого Элемент ИЗ Результат.ТабличноеПоле Цикл
		
		Параметр = Новый Массив;
		Параметр.Добавить(Элемент.Реквизит);
		
		Параметр.Добавить(?(НомерДатаПоУмолчанию И (Элемент.Реквизит = "Номер *" ИЛИ Элемент.Реквизит = "Дата *"), Ложь, Элемент.Обязательный));
		
		ПараметрыКопирования.Добавить(Параметр);
	КонецЦикла;
	
	СохранитьПользовательскиеНастройки("ПараметрыКопирования", ПараметрыКопирования, "Пользовательская настройка ""ПараметрыКопирования""");

	ОбработкаОкончанияПомещения = Новый ОписаниеОповещения("ОповещениеДобавитьСкопироватьСтроки", ЭтаФорма, ПараметрыКопирования);
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.МножественныйВыбор = Истина;
	ДиалогОткрытияФайла.Показать(ОбработкаОкончанияПомещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеДобавитьСкопироватьСтроки(ВыбранныеФайлы, ПараметрыКопирования) Экспорт
	
	Если ВыбранныеФайлы = Неопределено
		ИЛИ ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;    
	
	// Получение данных выделенной строки, чтобы заполнить данные при ее копировании.
	ТекущаяСтрока = Элементы.ТабличноеПоле.ТекущиеДанные;
	
	ИсключенныеИзОтправки = Новый Массив;
	ИсключенныеИзОтправки.Добавить(".bin");
	ИсключенныеИзОтправки.Добавить(".xml");
	
	Сообщения = "";
	
	Для Каждого Путь Из ВыбранныеФайлы Цикл
		Файл = Новый Файл(Путь);
		
		Если НЕ ИсключенныеИзОтправки.Найти(НРег(Файл.Расширение)) = Неопределено Тогда
			Сообщения = Сообщения + ?(ПустаяСтрока(Сообщения), "", Символы.ПС) + "Нельзя отправлять файлы с расширением " + НРег(Файл.Расширение);
			Продолжить;
		КонецЕсли;
		
		Если Файл.Существует() И Файл.ЭтоФайл()
			И ТабличноеПоле.НайтиСтроки(Новый Структура("Путь", Файл.ПолноеИмя)).Количество() = 0 Тогда
			
			НоваяСтрока = ТабличноеПоле.Добавить();
			НоваяСтрока.Путь = Файл.ПолноеИмя;
			НоваяСтрока.ИмяФайла = Файл.Имя;
			
			Если НЕ ТекущаяСтрока = Неопределено Тогда
				Для Каждого Строка Из ПараметрыКопирования Цикл
					Если Строка[1] = Истина Тогда
						Для Каждого Колонка Из Элементы.ТабличноеПоле.ПодчиненныеЭлементы Цикл
							Если Колонка.Заголовок = Строка[0] Тогда
								ПутьКДанным = СтрЗаменить(Колонка.Имя, Элементы.ТабличноеПоле.Имя, "");
								НоваяСтрока[ПутьКДанным] = ТекущаяСтрока[ПутьКДанным];
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(Сообщения) Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = Сообщения;
		СообщениеПользователю.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВерсияПлатформыНаКлиенте()
	
	// # Пример: 8.3.11.3034 - 83110 (версия по трем позициям) и до 4 знаков 
    // # Пример: 8.3.5.6565  - 8350 (версия по трем позициям) и до 4 знаков 	
	// # Пример: 8.2.19.4342 - 8219 (версия по трем позициям) и до 4 знаков 
    // # Пример: 8.3.10.4342 - 83100(версия по трем позициям) и до 4 знаков
	// # Пример: 8.3.9.4342  - 8390 (версия по трем позициям) и до 4 знаков
	// # Пример: 8.3.12.4342 - 83120(версия по трем позициям) и до 4 знаков
	// # Пример: 8.3.1.00    - 8310(версия по трем позициям) и до 4 знаков
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ТекущаяВерсия = СистемнаяИнформация.ВерсияПриложения;
	
	Версия  = "";
	Для н = 1  По 3 Цикл
		ПозицияТочки  = Найти(ТекущаяВерсия, ".");
		Символ        = Лев(ТекущаяВерсия , ПозицияТочки - 1);
		ТекущаяВерсия = Сред(ТекущаяВерсия, ПозицияТочки + 1);
		Версия        = Версия + Символ;
	КонецЦикла;
	
	Если СтрДлина(Версия) < 4 
		 ИЛИ (Сред(Версия, 2, 1) = "3" И СтрДлина(Версия) = 4) Тогда
	    Версия = Версия + "0";	
	КонецЕсли;
	
	Попытка
		ВерсияЧисло = Число(Версия);
	Исключение
	   ВерсияЧисло  = 0;
	КонецПопытки;

	Возврат ВерсияЧисло;
	
КонецФункции

// Получает пользовательские настройки с ключом объекта = "ФормаНовыйCONDRA"
//
// Параметры:
//  КлючНастроек  - Строка - ключ получаемых настроек
//
// Возвращаемое значение:
//   Произвольный   - значение полученной настройки
//
&НаСервереБезКонтекста
Функция ПолучитьПользовательскиеНастройки(КлючНастроек)

	Настройки = ХранилищеНастроекДанныхФорм.Загрузить("ФормаНовыйCONDRA", КлючНастроек,, ПараметрыСеанса.ТекущийПользователь.Наименование);
	Возврат ?(ТипЗнч(Настройки) = Тип("Массив"), Настройки, Неопределено);

КонецФункции // ПолучитьПользовательскиеНастройки()

// Сохраняет пользовательские настройки с ключом объекта = "ФормаНовыйCONDRA"
//
// Параметры:
//  КлючНастроек  - Строка - ключ сохраняемых настроек
//  Настройки  - Произвольный - содержит настройки, которые нужно сохранить в хранилище
//  ОписаниеНастроек  - Строка - текст описания настроек
//
&НаСервереБезКонтекста
Процедура СохранитьПользовательскиеНастройки(КлючНастроек, Настройки, ОписаниеНастроек = "")

	// Сохранение пользовательских настроек формы.
	ЗначениеОписаниеНастроек = Новый ОписаниеНастроек;
	ЗначениеОписаниеНастроек.Представление = ОписаниеНастроек;
	ХранилищеНастроекДанныхФорм.Сохранить("ФормаНовыйCONDRA", КлючНастроек, Настройки, ЗначениеОписаниеНастроек, ПараметрыСеанса.ТекущийПользователь.Наименование);

КонецПроцедуры // СохранитьПользовательскиеНастройки()

&НаСервере
Функция КомандаСохранитьНаСервере(ПомещенныеФайлы)
	
	ТабличноеПолеТЗ = ТабличноеПоле.Выгрузить();
	
	Данные = ТабличноеПолеТЗ.СкопироватьКолонки();
	Для Каждого Строка Из ТабличноеПолеТЗ.НайтиСтроки(Новый Структура("Записан", Ложь)) Цикл
		ЗаполнитьЗначенияСвойств(Данные.Добавить(), Строка);
	КонецЦикла;
	ТабличноеПолеТЗ = Неопределено;
	
	Данные.Колонки.Добавить("Адрес", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
	
	Для Каждого Элемент Из ПомещенныеФайлы Цикл
		Строка = Данные.Найти(Элемент.Ключ, "Путь");
		Если НЕ Строка = Неопределено Тогда
			Строка.Адрес = Элемент.Значение;
		КонецЕсли;
	КонецЦикла;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СоздатьЗаписи_ЭКОМ_ЦепочкиНеструктурированныхДокументов(Данные, НомерДатаПоУмолчанию);
	
	Записаны = Новый СписокЗначений;
	СОшибкой = Новый СписокЗначений;
	Результат = Новый Массив;
	
	Для Каждого Строка Из Данные Цикл
		Если Строка.Записан Тогда
			Результат.Добавить(Строка.TRANSGUID);
			СтрокиПоПути = ТабличноеПоле.НайтиСтроки(Новый Структура("Путь", Строка.FILENAME));
			Если НЕ СтрокиПоПути.Количество() = 0 Тогда
				СтрокиПоПути.Получить(0).Записан = Истина;
				СтрокиПоПути.Получить(0).Номер = Строка.NUMBER;
				СтрокиПоПути.Получить(0).Дата = Строка.DATE;
			КонецЕсли;
			Записаны.Добавить(Строка.FILENAME);
		Иначе
			СОшибкой.Добавить(Строка.FILENAME);
		КонецЕсли;
	КонецЦикла;
	
	// Подсветка строк.
	Для Счетчик = 1 По 2 Цикл
		
		ПравоеЗначение = ?(Счетчик = 1, СОшибкой, Записаны);
		Если ПравоеЗначение.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйЭлементУсловногоОформления	= УсловноеОформление.Элементы.Добавить();
	    ЭлементыПолейНовогоЭлемента		= НовыйЭлементУсловногоОформления.Поля.Элементы;
	    ЭлементыОтбораНовогоЭлемента	= НовыйЭлементУсловногоОформления.Отбор.Элементы;
		
		Для Каждого Колонка Из Элементы.ТабличноеПоле.ПодчиненныеЭлементы Цикл
		    НовоеПолеОформления = ЭлементыПолейНовогоЭлемента.Добавить();
		    НовоеПолеОформления.Использование	= Истина;
		    НовоеПолеОформления.Поле            = Новый ПолеКомпоновкиДанных(Колонка.Имя);
		КонецЦикла;
	    
	    ЭлементОтбора = ЭлементыОтбораНовогоЭлемента.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
	    ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ТабличноеПоле.Путь");
	    ЭлементОтбора.ПравоеЗначение	= ПравоеЗначение;
	    ЭлементОтбора.Использование		= Истина;
	    
	    НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ?(Счетчик = 1, WebЦвета.Красный, WebЦвета.Серый));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ВыполнитьУсловноеОформлениеФормы()  
    
    
        
    // Оформление ТЧ ТаблицаПланов <<<
    
КонецПроцедуры // ВыполнитьУсловноеОформлениеФормы

// Возвращает структуру с именами колонок табличного поля и пустыми значениями согласно основному типу колонки
//
// Возвращаемое значение:
//   Структура   - коллекция имен и пустых значений типов всех колонок табличного поля
//
&НаСервере
Функция ПолучитьПустыеЗначенияКолонок()

	ТипыКолонок = Новый Структура;
	Таблица = ДанныеФормыВЗначение(ТабличноеПоле, Тип("ТаблицаЗначений"));
	Для Каждого Колонка Из Таблица.Колонки Цикл
		ТипыКолонок.Вставить(Колонка.Имя, Колонка.ТипЗначения.ПривестиЗначение());
	КонецЦикла;
	
	Возврат ТипыКолонок;

КонецФункции // ПолучитьПустыеЗначенияКолонок()

&НаКлиенте
Процедура ТабличноеПолеКонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ссылка", ТабличноеПолеКонтрагентНачалоВыбораНаСервере());

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	 
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаСервере
Функция ТабличноеПолеКонтрагентНачалоВыбораНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    Возврат ОбработкаОбъект.ПолучитьСписокКонтрагентовGLN();
	
КонецФункции

&НаСервере
Функция ТабличноеПолеОрганизацияНачалоВыбораНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    Возврат ОбработкаОбъект.ПолучитьСписокОрганизацийGLN();
	
КонецФункции  

&НаСервере
Функция ТабличноеПолеТипДокументаНачалоВыбораНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    Возврат ОбработкаОбъект.ПолучитьСписокСтран();
	
КонецФункции	


&НаКлиенте
Процедура ТабличноеПолеОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ссылка", ТабличноеПолеОрганизацияНачалоВыбораНаСервере());

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	 
	ОткрытьФорму("Справочник.Организации.ФормаВыбора", ПараметрыФормы, Элемент); // Надо переписать с учетом типа организации (организация, фирма)
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеТипДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Страна", ТабличноеПолеТипДокументаНачалоВыбораНаСервере());

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	 
	ОткрытьФорму("Справочник.ЭКОМ_ТипыНеструктДокументов.ФормаВыбора", ПараметрыФормы, Элемент); 

КонецПроцедуры

&НаСервере
Функция ТабличноеПолеТипДокументаПриИзмененииНаСервере(ТекущиеДанные)

	Возврат ТекущиеДанные.ТипДокумента.СрокПодписания;
	
КонецФункции

&НаКлиенте
Процедура ТабличноеПолеТипДокументаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТабличноеПоле.ТекущиеДанные;
	СтруктураДанных = новый("Структура");
	СтруктураДанных.Вставить("ТипДокумента", ТекДанные.ТипДокумента);
	ТекДанные.СрокПодписания = ТабличноеПолеТипДокументаПриИзмененииНаСервере(СтруктураДанных);
	
КонецПроцедуры


#КонецОбласти
