#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьРазмерыДоходовНеПодлежащихНалогообложениюЧастично();
	
КонецПроцедуры

Процедура ЗаполнитьРазмерыДоходовНеПодлежащихНалогообложениюЧастично()
	
	НаборЗаписей = РегистрыСведений.РазмерыДоходовНеПодлежащихНалогообложениюЧастично.СоздатьНаборЗаписей();

	ВыигрышиПоЛотерее = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию("Пп. 11 п. 1 ст. 341 (выигрыши по лотере)");
	
	Если НЕ ВыигрышиПоЛотерее = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка() Тогда
		
		ДобавитьРазмерДоходаНеПодлежащегоНалогообложениюЧастично(НаборЗаписей, '20190101', ВыигрышиПоЛотерее, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 6);
	
	КонецЕсли;
	
	ОбщественныеРаботы = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию("Пп. 12 п. 1 ст. 341 (выплаты в связи с выполнением общественных работ и профессиональным обучением)");
	
	Если НЕ ОбщественныеРаботы = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка() Тогда
		
		ДобавитьРазмерДоходаНеПодлежащегоНалогообложениюЧастично(НаборЗаписей, '20190101', ОбщественныеРаботы, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 12);
		
	КонецЕсли;
	
	МедУслугиРождениеПогребение = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию("Пп. 18 п. 1 ст. 341 (выплаты для оплаты медицинских услуг, при рождении ребенка, на погребение)");
	
	Если НЕ МедУслугиРождениеПогребение = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка() Тогда
		
		ДобавитьРазмерДоходаНеПодлежащегоНалогообложениюЧастично(НаборЗаписей, '20190101', МедУслугиРождениеПогребение, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 94);
		
	КонецЕсли;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ДобавитьРазмерДоходаНеПодлежащегоНалогообложениюЧастично(НаборЗаписей, Период, ВидДохода, ВидПредела, Размер) Экспорт
	
   	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;  
	НоваяЗапись.ВидДоходаНеПодлежащегоНалогообложениюЧастично = ВидДохода;
	НоваяЗапись.ВидПредела = ВидПредела;
	НоваяЗапись.Размер = Размер;
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли