#Область ПрограммныйИнтерфейс

Процедура ПередЗаписьюНачисления(Объект) Экспорт
	
	ЗаполнитьОбязательныеПоказателиПрочихУдержаний(Объект, РасчетЗарплатыРасширенный.ЕстьПоказательВКоллекции(Объект.Показатели, "РасчетнаяБаза"));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьОбязательныеПоказателиПрочихУдержаний(Объект, ЕстьПоказательРасчетнаяБаза) Экспорт
    
    Если ЕстьПоказательРасчетнаяБаза Тогда
        Если Объект.ВычитатьИзРасчетнойБазыНалогиВзносы Тогда
            НоваяСтрока = Объект.Показатели.Добавить();
		    НоваяСтрока.ИспользоватьПриРасчете = Истина;
            НоваяСтрока.Показатель = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ИсчисленныйПоУдержаниюИПН");
            
            НоваяСтрока = Объект.Показатели.Добавить();
		    НоваяСтрока.ИспользоватьПриРасчете = Истина;
            НоваяСтрока.Показатель = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ИсчисленныйПоУдержаниюОПВ");
            
            НоваяСтрока = Объект.Показатели.Добавить();
		    НоваяСтрока.ИспользоватьПриРасчете = Истина;
            НоваяСтрока.Показатель = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ИсчисленныйПоУдержаниюВОСМС");
        КонецЕсли; 
    Иначе
        Объект.ВычитатьИзРасчетнойБазыНалогиВзносы = Ложь;
        МассивУдаляемыхСтрок = Новый Массив;
        Для Каждого СтрокаПоказателя Из Объект.Показатели Цикл
            Если СтрокаПоказателя.Показатель = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ИсчисленныйПоУдержаниюВОСМС")
                ИЛИ СтрокаПоказателя.Показатель = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ИсчисленныйПоУдержаниюИПН")
                ИЛИ СтрокаПоказателя.Показатель = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ИсчисленныйПоУдержаниюОПВ") Тогда
                МассивУдаляемыхСтрок.Добавить(СтрокаПоказателя);
            КонецЕсли;
        КонецЦикла;
        
        Для Каждого СтрокаПоказателя Из МассивУдаляемыхСтрок Цикл
            Объект.Показатели.Удалить(СтрокаПоказателя);
        КонецЦикла;
    КонецЕсли; 
    
КонецПроцедуры

Функция ИсчисленныеНалогиВзносы(МенеджерВременныхТаблиц, ОписаниеВТ, МесяцНачисления, ЗарплатаЗаМесяц, ИсключаемыйРегистратор, НастройкиУдержаний, ОчередностьРасчета = Неопределено, ЭтоИсправлениеТекущимПериодом = Ложь, ИсправленныйДокумент = Неопределено) Экспорт 
	
	НалогиВзносы = РегистрыНакопления.СведенияОДоходахФизическихЛиц.СоздатьНаборЗаписей().Выгрузить(, "Период,ФизическоеЛицо,Начисление");
	НалогиВзносы.Колонки.Период.Имя = "Месяц";
	НалогиВзносы.Колонки.Добавить("ОПВ", Новый ОписаниеТипов("Число"));
	НалогиВзносы.Колонки.Добавить("ВОСМС", Новый ОписаниеТипов("Число"));
	НалогиВзносы.Колонки.Добавить("ИПН", Новый ОписаниеТипов("Число"));
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(Удержания.НачалоПериода) КАК НачалоПериода,
		|	МАКСИМУМ(Удержания.ОкончаниеПериода) КАК ОкончаниеПериода
		|ИЗ
		|	ВТУдержания КАК Удержания";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТУдержания", ОписаниеВТ.ИмяВТ);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Удержания.НачалоПериода", "Удержания." + ОписаниеВТ.ИмяПоляНачалоПериода);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Удержания.ОкончаниеПериода", "Удержания." + ОписаниеВТ.ИмяПоляОкончаниеПериода);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ИменаВТ = Новый Массив;
	
	Если НЕ ЗарплатаКадры.ВТСуществует(МенеджерВременныхТаблиц, "ВТДатыПоМесяцам") Тогда 
		
		// Таблица ВТДатыПоМесяцам: список налоговых периодов, в которых выполняется расчет.
		ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТПериоды(МенеджерВременныхТаблиц, НачалоГода(Выборка.НачалоПериода), НачалоМесяца(Выборка.ОкончаниеПериода),,,"ВТДатыПоМесяцам");
		ИменаВТ.Добавить("ВТДатыПоМесяцам");
		
	КонецЕсли;
	
	Если НЕ ЗарплатаКадры.ВТСуществует(МенеджерВременныхТаблиц, "ВТНалогообложениеНачислений") Тогда 
		
		УчетНалоговВзносовОтчислений.СоздатьВТНалогообложениеНачисленийПоПериодам(МенеджерВременныхТаблиц);
		ИменаВТ.Добавить("ВТНалогообложениеНачислений");
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Выборка.НачалоПериода));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(Выборка.ОкончаниеПериода));
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ИсключаемыйРегистратор);
	Запрос.УстановитьПараметр("ВидыУдержанийНалоговВзносов", Обработки.МенеджерРасчетаЗарплаты.ВидыНалоговВзносовДополненияРасчетнойБазыУдержаний());
	ВидыНалоговВзносов = Новый Массив;
	ВидыНалоговВзносов.Добавить(Перечисления.ВидыНалоговВзносовОтчислений.ИПН);
	ВидыНалоговВзносов.Добавить(Перечисления.ВидыНалоговВзносовОтчислений.ОПВ);
	ВидыНалоговВзносов.Добавить(Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС);
	Запрос.УстановитьПараметр("ВидыНалоговВзносов", ВидыНалоговВзносов);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеУдержаний.НомерСтроки КАК НомерСтроки,
	               |	ДанныеУдержаний.Организация КАК Организация,
	               |	ДанныеУдержаний.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	               |	ДанныеУдержаний.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	ДанныеУдержаний.ВидРасчета КАК ВидРасчета,
	               |	ДанныеУдержаний.ДокументОснование КАК ИсполнительныйДокумент
	               |ПОМЕСТИТЬ ВТУдержанияПоПрочимУдержаниям
	               |ИЗ
	               |	ВТРегистрРасчета_Удержания КАК ДанныеУдержаний
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.Удержания КАК Удержания
	               |		ПО ДанныеУдержаний.ВидРасчета = Удержания.Ссылка
	               |			И (Удержания.КатегорияУдержания = ЗНАЧЕНИЕ(Перечисление.КатегорииУдержаний.ИсполнительныйЛист)
  	               |			    ИЛИ Удержания.ВычитатьИзРасчетнойБазыНалогиВзносы)
	               |			И (&УсловиеОчередностьРасчета)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ИСТИНА КАК ЗначениеИстина
	               |ИЗ
	               |	ВТУдержанияПоПрочимУдержаниям КАК УдержанияПоПрочимУдержаниям";
	
	Если ОчередностьРасчета = Неопределено Тогда
		ТекстУсловияОчередность = "ИСТИНА";
	Иначе
		ТекстУсловияОчередность = "Удержания.ОчередностьРасчета = &ОчередностьРасчета";
		Запрос.УстановитьПараметр("ОчередностьРасчета", ОчередностьРасчета);
	КонецЕсли;	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОчередностьРасчета", ТекстУсловияОчередность);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ИменаВТ.Добавить("ВТУдержанияПоПрочимУдержаниям");
	
	Если РезультатЗапроса.Пустой() Тогда
		ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, ИменаВТ);
		Возврат НалогиВзносы;
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	УдержанияПоПрочимУдержаниям.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	               |	УдержанияПоПрочимУдержаниям.ФизическоеЛицо КАК ФизическоеЛицо
	               |ПОМЕСТИТЬ ВТФизическиеЛицаПрочиеУдержания
	               |ИЗ
	               |	ВТУдержанияПоПрочимУдержаниям КАК УдержанияПоПрочимУдержаниям
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо
	               |ИЗ
	               |	ВТФизическиеЛицаПрочиеУдержания КАК ФизическиеЛица";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ИменаВТ.Добавить("ВТФизическиеЛицаПрочиеУдержания");
	
	МассивСтрок = ЗарплатаЗаМесяц.НалогиВзносыОтчисления.НайтиСтроки(Новый Структура("ВидНалогаВзносаОтчисления",Перечисления.ВидыНалоговВзносовОтчислений.ИПН));
	НалогиВзносыПоВидамДоходов = ЗарплатаЗаМесяц.НалогиВзносыОтчисления.Скопировать(МассивСтрок,"ФизическоеЛицо,МесяцНалоговогоПериода,ВидДохода,ВидНалогаВзносаОтчисления,НалогВзнос");
	
	МассивСтрок = ЗарплатаЗаМесяц.НалогиВзносыОтчисления.НайтиСтроки(Новый Структура("ВидНалогаВзносаОтчисления",Перечисления.ВидыНалоговВзносовОтчислений.ОПВ));
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ЗарплатаЗаМесяц.НалогиВзносыОтчисления.Скопировать(МассивСтрок,"ФизическоеЛицо,МесяцНалоговогоПериода,ВидДохода,ВидНалогаВзносаОтчисления,НалогВзнос"), НалогиВзносыПоВидамДоходов);
	
	МассивСтрок = ЗарплатаЗаМесяц.НалогиВзносыОтчисления.НайтиСтроки(Новый Структура("ВидНалогаВзносаОтчисления",Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС));
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ЗарплатаЗаМесяц.НалогиВзносыОтчисления.Скопировать(МассивСтрок,"ФизическоеЛицо,МесяцНалоговогоПериода,ВидДохода,ВидНалогаВзносаОтчисления,НалогВзнос"), НалогиВзносыПоВидамДоходов);
	
	НалогиВзносыПоВидамДоходов.Колонки.МесяцНалоговогоПериода.Имя = "Месяц";
	
	Если Не НастройкиУдержаний.РассчитыватьТолькоПоТекущемуДокументу Тогда 
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	НАЧАЛОПЕРИОДА(СведенияОбИсчисленииНалоговВзносовОтчислений.Период, МЕСЯЦ) КАК Месяц,
		               |	СведенияОбИсчисленииНалоговВзносовОтчислений.ФизическоеЛицо КАК ФизическоеЛицо,
		               |	СведенияОбИсчисленииНалоговВзносовОтчислений.НалогВзнос КАК НалогВзнос,
		               |	СведенияОбИсчисленииНалоговВзносовОтчислений.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
		               |	СведенияОбИсчисленииНалоговВзносовОтчислений.ВидДохода КАК ВидДохода
		               |ИЗ
		               |	РегистрНакопления.СведенияОбИсчисленииНалоговВзносовОтчислений КАК СведенияОбИсчисленииНалоговВзносовОтчислений
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизическиеЛицаПрочиеУдержания КАК ФизическиеЛица
		               |		ПО СведенияОбИсчисленииНалоговВзносовОтчислений.Организация.ГоловнаяОрганизация = ФизическиеЛица.ГоловнаяОрганизация
		               |			И СведенияОбИсчисленииНалоговВзносовОтчислений.ФизическоеЛицо = ФизическиеЛица.ФизическоеЛицо
		               |			И (СведенияОбИсчисленииНалоговВзносовОтчислений.ВидНалогаВзносаОтчисления В (&ВидыНалоговВзносов))
		               |			И (СведенияОбИсчисленииНалоговВзносовОтчислений.Регистратор <> &ИсключаемыйРегистратор)
		               |			И (СведенияОбИсчисленииНалоговВзносовОтчислений.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода)";
		
		РанееИсчисленныйНалог = Запрос.Выполнить().Выгрузить();
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РанееИсчисленныйНалог, НалогиВзносыПоВидамДоходов);
		
	КонецЕсли;
	
	ФизическиеЛица = Новый Соответствие;
	Выборка = РезультатыЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл 
		ФизическиеЛица.Вставить(Выборка.ФизическоеЛицо, Истина);
	КонецЦикла;
	
	НалогиВзносыПоВидамДоходов.Свернуть("Месяц,ФизическоеЛицо,ВидДохода,ВидНалогаВзносаОтчисления", "НалогВзнос");
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) КАК Месяц,
        |   СведенияОДоходах.ПериодРегистрации КАК ПериодРегистрации, 
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		// ЗУПК для договорников базу не используем, собираем базу по виду операци по зарплате ДоговорРаботыУслуги (подразумеваем, что сюда входит и ДоговорАвторскогоЗаказа)
		|	ВЫБОР
		|		КОГДА НалогообложениеНачислений.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
		|			И НЕ (ТИПЗНАЧЕНИЯ(СведенияОДоходах.Начисление) = ТИП(Справочник.ВидыВыплатБывшимСотрудникам)
		|				ИЛИ ТИПЗНАЧЕНИЯ(СведенияОДоходах.Начисление) = ТИП(Справочник.ВидыПрочихДоходовФизическихЛиц))
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорРаботыУслуги)
		|		ИНАЧЕ СведенияОДоходах.Начисление
		|	КОНЕЦ КАК Начисление,
		// ЗУПК для договорников базу не используем, собираем базу по виду операци по зарплате ДоговорРаботыУслуги (подразумеваем, что сюда входит и ДоговорАвторскогоЗаказа)
		|	СведенияОДоходах.СуммаДохода КАК Результат,
		|	НалогообложениеНачислений.ВидДохода КАК ВидДохода,
		|	НалогообложениеНачислений.СпособОбложенияОПВ КАК СпособОбложенияОПВ,
		|	НалогообложениеНачислений.СпособОбложенияИПН КАК СпособОбложенияИПН,
		|	НалогообложениеНачислений.СпособОбложенияВОСМС КАК СпособОбложенияВОСМС
		|ПОМЕСТИТЬ ВТСведенияОДоходах_ПрочиеУдержания
		|ИЗ
		|	ВТРегистрНакопления_СведенияОДоходахФизическихЛиц КАК СведенияОДоходах
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизическиеЛицаПрочиеУдержания КАК ФизическиеЛица
		|		ПО (СведенияОДоходах.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			И СведенияОДоходах.Организация.ГоловнаяОрганизация = ФизическиеЛица.ГоловнаяОрганизация
		|			И СведенияОДоходах.ФизическоеЛицо = ФизическиеЛица.ФизическоеЛицо
		|			И (&УсловиеСторно)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогообложениеНачислений КАК НалогообложениеНачислений
		|		ПО СведенияОДоходах.Начисление = НалогообложениеНачислений.Начисление
		|			И (НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) = НалогообложениеНачислений.МесяцНалоговогоПериода)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(СведенияОНеоблагаемыхДоходах.МесяцНалоговогоПериода, МЕСЯЦ) КАК Месяц,
		|	СведенияОНеоблагаемыхДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		// ЗУПК для договорников базу не используем, собираем базу по виду операци по зарплате ДоговорРаботыУслуги (подразумеваем, что сюда входит и ДоговорАвторскогоЗаказа)
		|	ВЫБОР
		|		КОГДА НалогообложениеНачислений.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
		|			И НЕ (ТИПЗНАЧЕНИЯ(СведенияОНеоблагаемыхДоходах.Начисление) = ТИП(Справочник.ВидыВыплатБывшимСотрудникам)
		|				ИЛИ ТИПЗНАЧЕНИЯ(СведенияОНеоблагаемыхДоходах.Начисление) = ТИП(Справочник.ВидыПрочихДоходовФизическихЛиц))
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорРаботыУслуги)
		|		ИНАЧЕ СведенияОНеоблагаемыхДоходах.Начисление
		|	КОНЕЦ КАК Начисление,
		// ЗУПК для договорников базу не используем, собираем базу по виду операци по зарплате ДоговорРаботыУслуги (подразумеваем, что сюда входит и ДоговорАвторскогоЗаказа)
		|	СведенияОНеоблагаемыхДоходах.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	НалогообложениеНачислений.ВидДохода КАК ВидДохода,
		|	СведенияОНеоблагаемыхДоходах.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления
		|ПОМЕСТИТЬ ВТСведенияОНеоблагаемыхДоходах_ПрочиеУдержания
		|ИЗ
		|	ВТСведенияОНеоблагаемыхДоходах КАК СведенияОНеоблагаемыхДоходах
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизическиеЛицаПрочиеУдержания КАК ФизическиеЛица
		|		ПО (СведенияОНеоблагаемыхДоходах.МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
		|			И СведенияОНеоблагаемыхДоходах.ФизическоеЛицо = ФизическиеЛица.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогообложениеНачислений КАК НалогообложениеНачислений
		|		ПО СведенияОНеоблагаемыхДоходах.Начисление = НалогообложениеНачислений.Начисление
		|			И (НАЧАЛОПЕРИОДА(СведенияОНеоблагаемыхДоходах.МесяцНалоговогоПериода, МЕСЯЦ) = НалогообложениеНачислений.МесяцНалоговогоПериода)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСведенияОДоходах_ПрочиеУдержания.Месяц КАК Месяц,
        |   ВТСведенияОДоходах_ПрочиеУдержания.ПериодРегистрации КАК ПериодРегистрации, 
		|	ВТСведенияОДоходах_ПрочиеУдержания.Начисление КАК Начисление,
		|	ВТСведенияОДоходах_ПрочиеУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТСведенияОДоходах_ПрочиеУдержания.Результат КАК ОблагаемыйДоход,
		|	ВТСведенияОДоходах_ПрочиеУдержания.ВидДохода КАК ВидДохода,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОПВ) КАК ВидНалогаВзносаОтчисления
		|ИЗ
		|	ВТСведенияОДоходах_ПрочиеУдержания КАК ВТСведенияОДоходах_ПрочиеУдержания
		|ГДЕ
		|	ВТСведенияОДоходах_ПрочиеУдержания.СпособОбложенияОПВ <> ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТСведенияОДоходах_ПрочиеУдержания.Месяц,
        |   ВТСведенияОДоходах_ПрочиеУдержания.ПериодРегистрации, 
		|	ВТСведенияОДоходах_ПрочиеУдержания.Начисление,
		|	ВТСведенияОДоходах_ПрочиеУдержания.ФизическоеЛицо,
		|	ВТСведенияОДоходах_ПрочиеУдержания.Результат,
		|	ВТСведенияОДоходах_ПрочиеУдержания.ВидДохода,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН)
		|ИЗ
		|	ВТСведенияОДоходах_ПрочиеУдержания КАК ВТСведенияОДоходах_ПрочиеУдержания
		|ГДЕ
		|	ВТСведенияОДоходах_ПрочиеУдержания.СпособОбложенияИПН <> ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТСведенияОДоходах_ПрочиеУдержания.Месяц,
        |   ВТСведенияОДоходах_ПрочиеУдержания.ПериодРегистрации, 
		|	ВТСведенияОДоходах_ПрочиеУдержания.Начисление,
		|	ВТСведенияОДоходах_ПрочиеУдержания.ФизическоеЛицо,
		|	ВТСведенияОДоходах_ПрочиеУдержания.Результат,
		|	ВТСведенияОДоходах_ПрочиеУдержания.ВидДохода,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС)
		|ИЗ
		|	ВТСведенияОДоходах_ПрочиеУдержания КАК ВТСведенияОДоходах_ПрочиеУдержания
		|ГДЕ
		|	ВТСведенияОДоходах_ПрочиеУдержания.СпособОбложенияВОСМС <> ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТСведенияОНеоблагаемыхДоходах_ПрочиеУдержания.Месяц,
  		|	ВТСведенияОНеоблагаемыхДоходах_ПрочиеУдержания.Месяц,
		|	ВТСведенияОНеоблагаемыхДоходах_ПрочиеУдержания.Начисление,
		|	ВТСведенияОНеоблагаемыхДоходах_ПрочиеУдержания.ФизическоеЛицо,
		|	-ВТСведенияОНеоблагаемыхДоходах_ПрочиеУдержания.НеоблагаемыйДоход,
		|	ВТСведенияОНеоблагаемыхДоходах_ПрочиеУдержания.ВидДохода,
		|	ВТСведенияОНеоблагаемыхДоходах_ПрочиеУдержания.ВидНалогаВзносаОтчисления
		|ИЗ
		|	ВТСведенияОНеоблагаемыхДоходах_ПрочиеУдержания КАК ВТСведенияОНеоблагаемыхДоходах_ПрочиеУдержания";
	
	Если ЭтоИсправлениеТекущимПериодом Тогда
		ТекстУсловияСторно = "НЕ СведенияОДоходах.Сторно";
	Иначе
		ТекстУсловияСторно = "ИСТИНА";
	КонецЕсли;	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСторно", ТекстУсловияСторно);
    
    //ЗУПК В случае, если исправительный документ вводится другим периодом регистрации, меняем условие на период
    Если ИсправленныйДокумент <> Неопределено
        И ЗначениеЗаполнено(ИсправленныйДокумент) Тогда
        ТекстУсловияИсправительныйДокумент = "СведенияОДоходах.ПериодРегистрации МЕЖДУ &НачалоПериода И &ОкончаниеПериода";
        Запрос.Текст = СтрЗаменить(Запрос.Текст, "СведенияОДоходах.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода", ТекстУсловияИсправительныйДокумент);
    КонецЕсли; 
    //ЗУПК В случае, если исправительный документ вводится другим периодом регистрации, меняем условие на период
	
	Если ЗарплатаКадры.ВТСуществует(МенеджерВременныхТаблиц, "ВТРегистрНакопления_СведенияОДоходахФизическихЛиц") Тогда 
		ОблагаемыеДоходы = Запрос.Выполнить().Выгрузить();
   		ИменаВТ.Добавить("ВТСведенияОДоходах_ПрочиеУдержания");
   		ИменаВТ.Добавить("ВТСведенияОНеоблагаемыхДоходах_ПрочиеУдержания");
	Иначе 
		ОблагаемыеДоходы = РегистрыНакопления.СведенияОДоходахФизическихЛиц.СоздатьНаборЗаписей().Выгрузить(, "Период,ПериодРегистрации,ФизическоеЛицо,Начисление,СуммаДохода");
		ОблагаемыеДоходы.Колонки.СуммаДохода.Имя = "ОблагаемыйДоход";
		ОблагаемыеДоходы.Колонки.Период.Имя = "Месяц";
        ОблагаемыеДоходы.Колонки.ПериодРегистрации.Имя = "ПериодРегистрации";
		ОблагаемыеДоходы.Колонки.Добавить("ВидДохода", Новый ОписаниеТипов("СправочникСсылка.ВидыДоходов"));
		ОблагаемыеДоходы.Колонки.Добавить("ВидНалогаВзносаОтчисления", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалоговВзносовОтчислений"));
	КонецЕсли;
	
	Если Не НастройкиУдержаний.РассчитыватьТолькоПоТекущемуДокументу Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НАЧАЛОПЕРИОДА(СведенияОДоходахФизическихЛиц.Период, МЕСЯЦ) КАК Месяц,
            |   СведенияОДоходахФизическихЛиц.ПериодРегистрации КАК ПериодРегистрации, 
			|	СведенияОДоходахФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
			// ЗУПК для договорников базу не используем, собираем базу по виду операци по зарплате ДоговорРаботыУслуги (подразумеваем, что сюда входит и ДоговорАвторскогоЗаказа)
			|	ВЫБОР
			|		КОГДА НалогообложениеНачислений.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
			|			И НЕ (ТИПЗНАЧЕНИЯ(СведенияОДоходахФизическихЛиц.Начисление) = ТИП(Справочник.ВидыВыплатБывшимСотрудникам)
			|				ИЛИ ТИПЗНАЧЕНИЯ(СведенияОДоходахФизическихЛиц.Начисление) = ТИП(Справочник.ВидыПрочихДоходовФизическихЛиц))
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорРаботыУслуги)
			|		ИНАЧЕ СведенияОДоходахФизическихЛиц.Начисление
			|	КОНЕЦ КАК Начисление,
			// ЗУПК для договорников базу не используем, собираем базу по виду операци по зарплате ДоговорРаботыУслуги (подразумеваем, что сюда входит и ДоговорАвторскогоЗаказа)
			|	СведенияОДоходахФизическихЛиц.СуммаДохода КАК Результат,
			|	НалогообложениеНачислений.ВидДохода КАК ВидДохода,
			|	НалогообложениеНачислений.СпособОбложенияОПВ КАК СпособОбложенияОПВ,
			|	НалогообложениеНачислений.СпособОбложенияИПН КАК СпособОбложенияИПН,
			|	НалогообложениеНачислений.СпособОбложенияВОСМС КАК СпособОбложенияВОСМС
			|ПОМЕСТИТЬ ВТСведенияОПрочихДоходах_ПрочиеУдержания
			|ИЗ
			|	РегистрНакопления.СведенияОДоходахФизическихЛиц КАК СведенияОДоходахФизическихЛиц
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизическиеЛицаПрочиеУдержания КАК ФизическиеЛица
			|		ПО (СведенияОДоходахФизическихЛиц.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
			|			И (СведенияОДоходахФизическихЛиц.Регистратор <> &ИсключаемыйРегистратор)
			|			И СведенияОДоходахФизическихЛиц.Организация.ГоловнаяОрганизация = ФизическиеЛица.ГоловнаяОрганизация
			|			И СведенияОДоходахФизическихЛиц.ФизическоеЛицо = ФизическиеЛица.ФизическоеЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогообложениеНачислений КАК НалогообложениеНачислений
			|		ПО СведенияОДоходахФизическихЛиц.Начисление = НалогообложениеНачислений.Начисление
			|			И (НАЧАЛОПЕРИОДА(СведенияОДоходахФизическихЛиц.Период, МЕСЯЦ) = НалогообложениеНачислений.МесяцНалоговогоПериода)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТСведенияОДоходах_ПрочиеУдержания.Месяц КАК Месяц,
			|	ВТСведенияОДоходах_ПрочиеУдержания.ПериодРегистрации КАК ПериодРегистрации,
			|	ВТСведенияОДоходах_ПрочиеУдержания.Начисление КАК Начисление,
			|	ВТСведенияОДоходах_ПрочиеУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВТСведенияОДоходах_ПрочиеУдержания.Результат КАК ОблагаемыйДоход,
			|	ВТСведенияОДоходах_ПрочиеУдержания.ВидДохода КАК ВидДохода,
			|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОПВ) КАК ВидНалогаВзносаОтчисления
			|ИЗ
			|	ВТСведенияОПрочихДоходах_ПрочиеУдержания КАК ВТСведенияОДоходах_ПрочиеУдержания
			|ГДЕ
			|	ВТСведенияОДоходах_ПрочиеУдержания.СпособОбложенияОПВ <> ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВТСведенияОДоходах_ПрочиеУдержания.Месяц,
			|	ВТСведенияОДоходах_ПрочиеУдержания.ПериодРегистрации,
			|	ВТСведенияОДоходах_ПрочиеУдержания.Начисление,
			|	ВТСведенияОДоходах_ПрочиеУдержания.ФизическоеЛицо,
			|	ВТСведенияОДоходах_ПрочиеУдержания.Результат,
			|	ВТСведенияОДоходах_ПрочиеУдержания.ВидДохода,
			|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН)
			|ИЗ
			|	ВТСведенияОПрочихДоходах_ПрочиеУдержания КАК ВТСведенияОДоходах_ПрочиеУдержания
			|ГДЕ
			|	ВТСведенияОДоходах_ПрочиеУдержания.СпособОбложенияИПН <> ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВТСведенияОДоходах_ПрочиеУдержания.Месяц,
			|	ВТСведенияОДоходах_ПрочиеУдержания.ПериодРегистрации,
			|	ВТСведенияОДоходах_ПрочиеУдержания.Начисление,
			|	ВТСведенияОДоходах_ПрочиеУдержания.ФизическоеЛицо,
			|	ВТСведенияОДоходах_ПрочиеУдержания.Результат,
			|	ВТСведенияОДоходах_ПрочиеУдержания.ВидДохода,
			|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС)
			|ИЗ
			|	ВТСведенияОПрочихДоходах_ПрочиеУдержания КАК ВТСведенияОДоходах_ПрочиеУдержания
			|ГДЕ
			|	ВТСведенияОДоходах_ПрочиеУдержания.СпособОбложенияВОСМС <> ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)";
            
        //ЗУПК В случае, если исправительный документ вводится другим периодом регистрации, меняем условие на период
        Если ИсправленныйДокумент <> Неопределено
            И ЗначениеЗаполнено(ИсправленныйДокумент) Тогда
            ТекстУсловияИсправительныйДокумент = "СведенияОДоходахФизическихЛиц.ПериодРегистрации МЕЖДУ &НачалоПериода И &ОкончаниеПериода";
            Запрос.Текст = СтрЗаменить(Запрос.Текст, "СведенияОДоходахФизическихЛиц.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода", ТекстУсловияИсправительныйДокумент);
        КонецЕсли; 
        //ЗУПК В случае, если исправительный документ вводится другим периодом регистрации, меняем условие на период

		СведенияОДоходахФизическихЛиц = Запрос.Выполнить().Выгрузить();
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СведенияОДоходахФизическихЛиц, ОблагаемыеДоходы);
		ИменаВТ.Добавить("ВТСведенияОПрочихДоходах_ПрочиеУдержания");

	КонецЕсли;	
	
	ОблагаемыеДоходы.Свернуть("Месяц,ПериодРегистрации,ФизическоеЛицо,Начисление,ВидДохода,ВидНалогаВзносаОтчисления", "ОблагаемыйДоход");
	ОблагаемыеДоходы.Индексы.Добавить("Месяц,ФизическоеЛицо");
	
	Для Каждого СтрокаНалога Из НалогиВзносыПоВидамДоходов Цикл 
		КоэффициентыРаспределения = Новый Массив;
		Отбор = Новый Структура("Месяц,ФизическоеЛицо,ВидДохода,ВидНалогаВзносаОтчисления", СтрокаНалога.Месяц, СтрокаНалога.ФизическоеЛицо, СтрокаНалога.ВидДохода, СтрокаНалога.ВидНалогаВзносаОтчисления);
	    ДоходыФизическогоЛица = ОблагаемыеДоходы.НайтиСтроки(Отбор);
		Для Каждого СтрокаДохода Из ДоходыФизическогоЛица Цикл 
			КоэффициентыРаспределения.Добавить(СтрокаДохода.ОблагаемыйДоход);
		КонецЦикла;
		РезультатРаспределения = ЗарплатаКадрыКлиентСервер.РаспределитьПропорциональноКоэффициентам(СтрокаНалога.НалогВзнос, КоэффициентыРаспределения);
		Если РезультатРаспределения <> Неопределено Тогда 
			Индекс = 0;
			Для Каждого СтрокаДохода Из ДоходыФизическогоЛица Цикл 
				НоваяСтрока = НалогиВзносы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДохода);
                Если ИсправленныйДокумент <> Неопределено
                    И ЗначениеЗаполнено(ИсправленныйДокумент) Тогда
                    НоваяСтрока.Месяц = СтрокаДохода.ПериодРегистрации;
                КонецЕсли; 
				Если СтрокаНалога.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ОПВ Тогда
					НоваяСтрока.ОПВ = РезультатРаспределения[Индекс];
				ИначеЕсли СтрокаНалога.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС Тогда
					НоваяСтрока.ВОСМС = РезультатРаспределения[Индекс];
				ИначеЕсли СтрокаНалога.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ИПН Тогда
					НоваяСтрока.ИПН = РезультатРаспределения[Индекс];
				КонецЕсли;
				Индекс = Индекс + 1;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	НалогиВзносы.Свернуть("Месяц,ФизическоеЛицо,Начисление", "ОПВ,ВОСМС,ИПН");
	НалогиВзносы.Индексы.Добавить("Месяц,ФизическоеЛицо,Начисление");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, ИменаВТ);
	
	Возврат НалогиВзносы;
	
КонецФункции

Процедура ЗаполнитьПоказателиПрочихУдержаний(ОчередностьРасчета, СтрокиПоИдентификатору, МенеджерВременныхТаблиц, МесяцНачисления) Экспорт
	
	УдалитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
    	Запрос.УстановитьПараметр("ОчередностьРасчета", ОчередностьРасчета);

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Удержания.ИдентификаторСтроки,
		|	Удержания.ДокументОснование КАК ИсполнительныйДокумент,
		|	Удержания.БазовыйПериодНачало КАК Период,
		|	НАЧАЛОПЕРИОДА(Удержания.БазовыйПериодНачало, МЕСЯЦ) КАК Месяц,
		|	Удержания.ФизическоеЛицо,
		|	Удержания.Организация,
		|	ВидыРасчета.ФормулаРасчетаДляВыполнения КАК ФормулаДляВыполнения,
		|	ВидыРасчета.ФормулаРасчета КАК ФормулаДляПредставления,
        |	ВидыРасчета.ВычитатьИзРасчетнойБазыНалогиВзносы КАК ВычитатьИзРасчетнойБазыНалогиВзносы
        |ИЗ
		|	ВТРегистрРасчета_Удержания КАК Удержания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.Удержания КАК ВидыРасчета
		|		ПО (ВидыРасчета.Ссылка = Удержания.ВидРасчета)
		|			И (ВидыРасчета.ОчередностьРасчета = &ОчередностьРасчета)
		|			И (ВидыРасчета.ИспользуетФормулу = ИСТИНА)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Удержания.ИдентификаторСтроки";

    Выборка = Запрос.Выполнить().Выбрать();
    
    ПоказательРасчетнаяБаза = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.РасчетнаяБаза");
    ПоказательИсчисленныйПоУдержаниюОПВ = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ИсчисленныйПоУдержаниюОПВ");
    ПоказательИсчисленныйПоУдержаниюВОСМС = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ИсчисленныйПоУдержаниюВОСМС");
    ПоказательИсчисленныйПоУдержаниюИПН = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ИсчисленныйПоУдержаниюИПН");
    Пока Выборка.СледующийПоЗначениюПоля("ИдентификаторСтроки") Цикл
        Строка = СтрокиПоИдентификатору[Выборка.ИдентификаторСтроки];
        Если Строка.ФиксЗаполнение Тогда 
            Строка.Результат = Строка.ЗаписьРасчета.Результат;
            Продолжить;
        КонецЕсли;
        Если НЕ Выборка.ВычитатьИзРасчетнойБазыНалогиВзносы Тогда
            Продолжить;
        КонецЕсли; 
        ИсходныеДанные = Новый Структура;
        Пока Выборка.Следующий() Цикл
            РасчетнаяБаза = Строка.Дополнительно.СуммаДополнения;
            ИсчисленныйПоУдержаниюОПВ = Строка.Дополнительно.СуммаОПВ;
            ИсчисленныйПоУдержаниюВОСМС = Строка.Дополнительно.СуммаВОСМС;
            ИсчисленныйПоУдержаниюИПН = Строка.Дополнительно.СуммаИПН;
            Для Каждого СтрокаРасшифровки Из Строка.Дополнительно.РасшифровкаРасчетнойБазы Цикл
                РасчетнаяБаза = РасчетнаяБаза + СтрокаРасшифровки.Сумма + СтрокаРасшифровки.СуммаДополнения;
                Если Выборка.ВычитатьИзРасчетнойБазыНалогиВзносы Тогда
                    ИсчисленныйПоУдержаниюИПН = ИсчисленныйПоУдержаниюИПН + СтрокаРасшифровки.СуммаИПН;                  
                    ИсчисленныйПоУдержаниюОПВ = ИсчисленныйПоУдержаниюОПВ + СтрокаРасшифровки.СуммаОПВ;
                    ИсчисленныйПоУдержаниюВОСМС = ИсчисленныйПоУдержаниюВОСМС + СтрокаРасшифровки.СуммаВОСМС;
                КонецЕсли;
            КонецЦикла;
            
            СтрокаПоказателя = РасчетЗарплатыРасширенный.СтрокаЗначенияПоказателяПоИдентификатору(Строка.Показатели, "РасчетнаяБаза");
            Если СтрокаПоказателя = Неопределено Тогда 
                СтрокаПоказателя = Строка.Показатели.Добавить();
                СтрокаПоказателя.Показатель = ПоказательРасчетнаяБаза;
            КонецЕсли;
            СтрокаПоказателя.Значение = РасчетнаяБаза;
            
            Если Выборка.ВычитатьИзРасчетнойБазыНалогиВзносы Тогда
                //ОПВ
                СтрокаПоказателя = РасчетЗарплатыРасширенный.СтрокаЗначенияПоказателяПоИдентификатору(Строка.Показатели, "ИсчисленныйПоУдержаниюОПВ");
                Если СтрокаПоказателя = Неопределено Тогда 
                    СтрокаПоказателя = Строка.Показатели.Добавить();
                    СтрокаПоказателя.Показатель = ПоказательИсчисленныйПоУдержаниюОПВ;
                КонецЕсли;
                СтрокаПоказателя.Значение = ИсчисленныйПоУдержаниюОПВ;
                
                // ВОСМС
                СтрокаПоказателя = РасчетЗарплатыРасширенный.СтрокаЗначенияПоказателяПоИдентификатору(Строка.Показатели, "ИсчисленныйПоУдержаниюВОСМС");
                Если СтрокаПоказателя = Неопределено Тогда 
                    СтрокаПоказателя = Строка.Показатели.Добавить();
                    СтрокаПоказателя.Показатель = ПоказательИсчисленныйПоУдержаниюВОСМС;
                КонецЕсли;
                СтрокаПоказателя.Значение = ИсчисленныйПоУдержаниюВОСМС;
                
                // ИПН
                СтрокаПоказателя = РасчетЗарплатыРасширенный.СтрокаЗначенияПоказателяПоИдентификатору(Строка.Показатели, "ИсчисленныйПоУдержаниюИПН");
                Если СтрокаПоказателя = Неопределено Тогда 
                    СтрокаПоказателя = Строка.Показатели.Добавить();
                    СтрокаПоказателя.Показатель = ПоказательИсчисленныйПоУдержаниюИПН;
                КонецЕсли;
                СтрокаПоказателя.Значение = ИсчисленныйПоУдержаниюИПН;
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;
    
КонецПроцедуры

Функция ЗначениеПоказателяПоСсылке(Показатели, Показатель)
	
	Возврат РасчетЗарплатыРасширенный.ЗначениеПоказателяПоСсылке(Показатели, Показатель);

КонецФункции

#КонецОбласти
