
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ПараметрыПодключения	= игр_ИнтеграцияКаспи.ПолучитьНастройкиПодключения();
	АдресAPI	= ПараметрыПодключения.АдресAPI;
	Токен		= ?(ЗначениеЗаполнено(ПараметрыПодключения.Токен), УникальныйИдентификатор, "");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТокенПриИзменении(Элемент)
	
	ТокенИзменен = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаСервере
Процедура ЗаписатьИЗакрытьНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
		
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(игр_ИнтеграцияКаспи.КлючНастроекПодключения(), АдресAPI, "АдресAPI");
	Если ТокенИзменен Тогда
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(игр_ИнтеграцияКаспи.КлючНастроекПодключения(), Токен, "Токен");
	КонецЕсли;
		
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьИЗакрытьНаСервере();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
