
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Метаданные.Справочники.Найти("КлассификаторЕдиницИзмерения") = Неопределено
		И НЕ Метаданные.Справочники.Найти("ЕдиницыИзмерения") = Неопределено Тогда // УТ 10.3
		// Форма выбора ЕдиницыИзмерения для текущей номенклатуры.
		РежимВыбораЕдиниц = 1;
	ИначеЕсли НЕ Метаданные.Справочники.Найти("УпаковкиЕдиницыИзмерения") = Неопределено Тогда // УТ 11.4, ERP и подобные
		// Выпадающий список УпаковкиЕдиницыИзмерения для текущей номенклатуры (форма не подходит, так как там либо форма с базовыми единицами, либо с упаковками)
		РежимВыбораЕдиниц = 2;
	ИначеЕсли НЕ Метаданные.Справочники.Найти("КлассификаторЕдиницИзмерения") = Неопределено Тогда // Вся бухгалтерия
		// Подставляем номенклатуру из КлассификаторЕдиницИзмерения, которая принадлежит данному товару (без возможности ее редактирования)
		РежимВыбораЕдиниц = 3;
	Иначе // Как было раньше
		РежимВыбораЕдиниц = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьЕдиницуИзмерения();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	Запись.ЕдиницаНоменклатурыКонтрагента = Неопределено;
	ЗаполнитьЕдиницуИзмерения();
	
КонецПроцедуры

// В зависимости от значения РежимВыбораЕдиниц заполняет единицу измерения и инициализирует список выбора
//
&НаКлиенте
Процедура ЗаполнитьЕдиницуИзмерения()

	Если РежимВыбораЕдиниц = 0 Тогда
		Элементы.ЕдиницаНоменклатурыКонтрагента.ВыбиратьТип = Истина;
	ИначеЕсли РежимВыбораЕдиниц = 1 Тогда
		Если НЕ ЗначениеЗаполнено(Запись.ЕдиницаНоменклатурыКонтрагента) Тогда
			Запись.ЕдиницаНоменклатурыКонтрагента = ПредопределенноеЗначение("Справочник.ЕдиницыИзмерения.ПустаяСсылка");
		КонецЕсли;
	ИначеЕсли РежимВыбораЕдиниц = 2 Тогда
		Если НЕ ЗначениеЗаполнено(Запись.ЕдиницаНоменклатурыКонтрагента) Тогда
			Запись.ЕдиницаНоменклатурыКонтрагента = ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка");
		КонецЕсли;
		Элементы.ЕдиницаНоменклатурыКонтрагента.РежимВыбораИзСписка = Истина;
		Элементы.ЕдиницаНоменклатурыКонтрагента.СписокВыбора.ЗагрузитьЗначения(ПолучитьКоллекциюЕдиницНоменклатурыНаСервере(Запись.Номенклатура, РежимВыбораЕдиниц));
	ИначеЕсли РежимВыбораЕдиниц = 3 Тогда
		Если НЕ ЗначениеЗаполнено(Запись.ЕдиницаНоменклатурыКонтрагента)
			ИЛИ НЕ ЗначениеЗаполнено(Запись.Номенклатура) Тогда
			Запись.ЕдиницаНоменклатурыКонтрагента = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка");
		КонецЕсли;
		Единицы = ПолучитьКоллекциюЕдиницНоменклатурыНаСервере(Запись.Номенклатура, РежимВыбораЕдиниц);
		Если НЕ Единицы.Количество() = 0 Тогда
			Запись.ЕдиницаНоменклатурыКонтрагента = Единицы.Получить(0);
		КонецЕсли;
		Элементы.ЕдиницаНоменклатурыКонтрагента.ТолькоПросмотр = Истина;
	КонецЕсли;

	ОбновитьОтображениеДанных(Элементы.ЕдиницаНоменклатурыКонтрагента);
	
КонецПроцедуры // ЗаполнитьЕдиницуИзмерения()

&НаСервереБезКонтекста
Функция ПолучитьКоллекциюЕдиницНоменклатурыНаСервере(Номенклатура, РежимВыбораЕдиниц)

	Возврат РегистрыСведений.ЭКОМ_НоменклатураКонтрагентов.ПолучитьКоллекциюЕдиницНоменклатуры(Номенклатура, РежимВыбораЕдиниц);

КонецФункции // ПолучитьКоллекциюЕдиницНоменклатурыНаСервере()
