#Область ПрограммныйИнтерфейс

Функция ЕстьПроведенныйРасходныйОрдерНаТовары(ДокументСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос	= Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|ГДЕ
	|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = &Распоряжение
	|	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен"
	;
	
	Запрос.УстановитьПараметр("Распоряжение", ДокументСсылка);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура УстановкаПараметровСеанса(ИмяПараметра, УстановленныеПараметры) Экспорт
	
	Если ИмяПараметра = "игр_ДоступныеКассы" Тогда
		
		СписокДоступныхКасс	= ПолучитьСписокДоступныхКасс();
		
		ПараметрыСеанса.игр_ДоступныеКассы = Новый ФиксированныйМассив(СписокДоступныхКасс);
		УстановленныеПараметры.Добавить("игр_ДоступныеКассы");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСписокДоступныхКасс()
	
	Запрос	= Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	игр_КонтрольДоступаККассам.Касса КАК Касса
	|ИЗ
	|	РегистрСведений.игр_КонтрольДоступаККассам КАК игр_КонтрольДоступаККассам
	|ГДЕ
	|	игр_КонтрольДоступаККассам.Пользователь = &Пользователь"
	;
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	
	Результат	= Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Новый Массив;
	Иначе
		Возврат Результат.Выгрузить().ВыгрузитьКолонку("Касса");
	КонецЕсли;
	
КонецФункции

#КонецОбласти