
&НаКлиенте
Процедура игр_игр_ЗагрузитьИзФайлаВместо(Команда)
	
	ОписаниеОповещения	= Новый ОписаниеОповещения("игр_ЗагрузкаЦенЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.Форма.игр_ЗагрузкаЦен",, ЭтотОбъект,,,, ОписаниеОповещения);
	
КонецПроцедуры
	
&НаКлиенте
Процедура игр_ЗагрузкаЦенЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		
		игр_ЗагрузитьЦеныВОбъект(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура игр_ЗагрузитьЦеныВОбъект(АдресТаблицы)
	
	ТаблицаДанных	= ПолучитьИзВременногоХранилища(АдресТаблицы);
	
	РеквизитОбъект	= РеквизитФормыВЗначение("ДеревоЦен");
	РеквизитЦены	= РеквизитФормыВЗначение("ВыбранныеЦены");
	
	Для Каждого ТекСтрока Из ТаблицаДанных Цикл
		
		СтрокаЦены	= РеквизитЦены.Найти(ТекСтрока.ВидЦены, "Ссылка");
		Если СтрокаЦены = Неопределено ИЛИ НЕ СтрокаЦены.Выбрана Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска	= Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура");
		СтруктураПоиска.Вставить("Характеристика");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекСтрока);
		
		НайденнаяСтрока	= РеквизитОбъект.Строки.НайтиСтроки(СтруктураПоиска);
		Если НайденнаяСтрока.Количество() = 0 Тогда
			
			НоваяСтрока	= РеквизитОбъект.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока, "Номенклатура, Характеристика");
			
		Иначе
			
			НоваяСтрока = НайденнаяСтрока[0];
			
		КонецЕсли;
		
		НоваяСтрока[СтрокаЦены.ИмяКолонки]				= ТекСтрока.Цена;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(РеквизитОбъект, "ДеревоЦен");
	
	ПереформироватьТаблицуЦен(Ложь);
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ДатаПриИзменении")
Процедура игр_ДатаПриИзменении(Элемент)
	#Вставка     
	Возврат;
	#КонецВставки

	НомерВПределахДня = УстановкаЦенВызовСервера.РассчитатьНомерВПределахДня(Объект.Дата, Объект.Ссылка);
	Объект.Дата = УстановкаЦенКлиентСервер.РассчитатьДатуДокумента(Объект.Дата, НомерВПределахДня);

	Элементы.НомерВПределахДня.Видимость = НомерВПределахДня <> 1;

	ОбновитьСтарыеЦеныНоменклатурыНаСервере();

	Если ДеревоЦен.ПолучитьЭлементы().Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	НужноПересчитывать = Ложь;

	// Чтобы узнать необходимость пересчета - проверим, что у выбранных цен
	// есть влияющие цены с валютой, отличной от валюты выбранной цены.

	Для Каждого ТекСтрока Из ВыбранныеЦены Цикл

		Если ТекСтрока.Выбрана И
			ТекСтрока.СпособЗаданияЦены <> ПредопределенноеЗначение("Перечисление.СпособыЗаданияЦен.Вручную") Тогда

			Для Каждого ВлияющаяЦена Из ТекСтрока.ВлияющиеЦены Цикл

				НайденнаяСтрока = Неопределено;
				Для Каждого ВыбраннаяЦена Из ВыбранныеЦены Цикл
					Если ВыбраннаяЦена.Ссылка = ВлияющаяЦена.Значение Тогда
						НайденнаяСтрока = ВыбраннаяЦена;
					КонецЕсли;
				КонецЦикла;

				Если НайденнаяСтрока = Неопределено Тогда
					Продолжить;
				КонецЕсли;

				Если ТекСтрока.Валюта <> НайденнаяСтрока.Валюта Тогда
					НужноПересчитывать = Истина;
					Прервать;
				КонецЕсли;

			КонецЦикла;

			Если НужноПересчитывать Тогда
				Прервать;
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	Если Не НужноПересчитывать Тогда
		Возврат;
	КонецЕсли;

	ОтветНаВопрос = Неопределено;


	ПоказатьВопрос(Новый ОписаниеОповещения("ДатаПриИзмененииЗавершение", ЭтотОбъект), 
	НСтр("ru = 'В документе выбраны виды цены с валютой, отличной от влияющих видов цен. Пересчитать цены?'"),
	РежимДиалогаВопрос.ДаНет);

КонецПроцедуры
