
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ПараметрыПодключения		= игр_ИнтеграцияКаспи.ПолучитьНастройкиВыгрузкиНоменклатуры();
	ВидЦеныПродажа				= ПараметрыПодключения.ВидЦеныПродажа;
	ВидЦеныСебестоимость		= ПараметрыПодключения.ВидЦеныСебестоимость;
	Адрес						= ПараметрыПодключения.Адрес;
	Папка						= ПараметрыПодключения.Папка;
	ИмяПользователя				= ПараметрыПодключения.ИмяПользователя;
	Пароль						= ПараметрыПодключения.Пароль;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКоманд

&НаСервере
Процедура ЗаписатьИЗакрытьНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
		
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(игр_ИнтеграцияКаспи.КлючНастроекВыгрузкиНоменклатуры(), ВидЦеныПродажа, "ВидЦеныПродажа");
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(игр_ИнтеграцияКаспи.КлючНастроекВыгрузкиНоменклатуры(), ВидЦеныСебестоимость, "ВидЦеныСебестоимость");
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(игр_ИнтеграцияКаспи.КлючНастроекВыгрузкиНоменклатуры(), Адрес, "Адрес");
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(игр_ИнтеграцияКаспи.КлючНастроекВыгрузкиНоменклатуры(), Папка, "Папка");
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(игр_ИнтеграцияКаспи.КлючНастроекВыгрузкиНоменклатуры(), ИмяПользователя, "ИмяПользователя");
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(игр_ИнтеграцияКаспи.КлючНастроекВыгрузкиНоменклатуры(), Пароль, "Пароль");
		
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьИЗакрытьНаСервере();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
