//В общем случае работа с КМ происходит в нормализованном формате, т.е. в преобразованном виде без спецсимволов GS29,
//однако в некоторых механизмах используется полный КМ. 
//Полный КМ передается в формате закодированной  строки Base64, чтобы не возникало проблем при передаче спецсимволов с клиента на сервер.
//Есть функции и процедуры, использующиеся в разных местах и принимающие входные параметры c КМ как в полном виде, так и в закодированной строке Base64
//в зависимости от места вызова.
//Поэтому важно четко определять - КМ уже закодирован или требуется кодировка, чтобы не возникало двойного преобразования.
//В типовых механизмах используется проверка типа "Если Base64Значение(СтрокаДляПроверки) = Неопределено Тогда *преобразование в Base64".
//Однако на практике выяснили, что некоторые потребительские КМ табачной продукции в полном виде в этой конструкции могут возвращать двоичные данные,
//как будто строка закодирована в Base64, хотя это не так. В результате преобразование не происходит и в дальнейшем возникают ошибочные ситуации.
//Пример такого кода: 00000046199928fZ?vCTNSVVsWCt4
//В качестве возможного и относительно простого способа проверки на формат используем двойное преобразование строки.
//
Функция ЭтоСтрокаФорматаBase64(Штрихкод) Экспорт
	
	КонтрольныйШтрихкод = Штрихкод;
	//По умолчанию считаем, что Штрихкод это строка формата Base64. Преобразуем в двоичные данные.
	СтрокаДвоичныеДанные = Base64Значение(Штрихкод);
	Если СтрокаДвоичныеДанные = Неопределено Тогда
		//Сразу можно сказать, что штрихкод не в формате Base64
		Возврат Ложь;
	КонецЕсли;
	//Кодируем обратно
	ШтрихкодДляПроверки = Base64Строка(СтрокаДвоичныеДанные);
	ШтрихкодДляПроверки = СтрЗаменить(ШтрихкодДляПроверки, Символы.ПС, "");
	ШтрихкодДляПроверки = СтрЗаменить(ШтрихкодДляПроверки, Символы.ВК, "");
		
	Если ШтрихкодДляПроверки = КонтрольныйШтрихкод Тогда 
		//Значит исходный штрихкод это корректная строка формата Base64
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
