#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("Организация", Параметры.Организация);
	Список.Параметры.УстановитьЗначениеПараметра("ИсточникОтчета", Параметры.ИсточникОтчета);
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовШапкиФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПредставлениеОтчета = Элемент.ТекущиеДанные.ФинансовыйПериод
	                    + " (" + Элемент.ТекущиеДанные.ВариантОтчета + ")";
	
	РезультатВыбора = Новый Структура;
	РезультатВыбора.Вставить("РегламентированныйОтчет", Элемент.ТекущиеДанные.РегламентированныйОтчет);
	РезультатВыбора.Вставить("ПредставлениеОтчета", ПредставлениеОтчета);
	
	ЭтаФорма.Закрыть(РезультатВыбора);
	
КонецПроцедуры

#КонецОбласти

//Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
//Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти