
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьРеквизиты();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ГруппаЗагрузка Тогда
		
		ОбновитьДанныеЗагрузки();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Закрыть(СохранитьТаблицуДляЗагрузки(ЭтотОбъект.ВладелецФормы.УникальныйИдентификатор));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьРеквизиты()
	
	ДанныеДляЗагрузки.Область("R1C1").Текст 		= "Штрихкод";
	ДанныеДляЗагрузки.Область("R1C1").ШиринаКолонки = 13;
	
	ДанныеДляЗагрузки.Область("R1C2").Текст 		= "Количество";
	ДанныеДляЗагрузки.Область("R1C2").ШиринаКолонки = 10;
	
КонецПроцедуры

&НаСервере
Функция СохранитьТаблицуДляЗагрузки(УникальныйИдентификатор)
	
	Таблица	= РеквизитФормыВЗначение("ТаблицаДляЗагрузки");
	
	Возврат ПоместитьВоВременноеХранилище(Таблица, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ЗагрузитьДанныеИзТаблицы()
	
	ТаблицаДляЗагрузки.Очистить();
	
	ТипЧисло	= ОбщегоНазначения.ОписаниеТипаЧисло(15, 3);
	
	НПП = 1;
	Пока НПП < ДанныеДляЗагрузки.ВысотаТаблицы Цикл
		
		НПП 	= НПП + 1;
		НППСтр	= Формат(НПП, "ЧГ=");
		
		ШК			= ДанныеДляЗагрузки.Область("R"+ НППСтр +"C1").Текст;
		Количество 	= ТипЧисло.ПривестиЗначение(СтрЗаменить(ДанныеДляЗагрузки.Область("R"+ НППСтр + "C2").Текст," ",""));
			
		НоваяСтрока	= ТаблицаДляЗагрузки.Добавить();
				
		НоваяСтрока.Штрихкод	= ШК;
		НоваяСтрока.Количество	= Количество;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСсылки()
	
	Таблица	= РеквизитФормыВЗначение("ТаблицаДляЗагрузки");
	
	Запрос	= Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ ВТ_ПервичныеДанные
	|ИЗ
	|	&Таблица КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	Штрихкод В
	|			(ВЫБРАТЬ
	|				ВТ.Штрихкод
	|			ИЗ
	|				ВТ_ПервичныеДанные КАК ВТ)"
	;
	
	Запрос.УстановитьПараметр("Таблица", Таблица);
	
	ВыборкаНоменклатура	= Запрос.Выполнить().Выгрузить();
	
	
	Для Каждого ТекСтрока ИЗ ТаблицаДляЗагрузки Цикл
		
		НайденныеСтроки	= ВыборкаНоменклатура.Найти(ТекСтрока.Штрихкод, "Штрихкод");
		Если НайденныеСтроки = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		ТекСтрока.Номенклатура		= НайденныеСтроки.Номенклатура;
		ТекСтрока.Характеристика	= НайденныеСтроки.Характеристика;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеЗагрузки()
	
	ЗагрузитьДанныеИзТаблицы();
	ЗаполнитьСсылки();
	
КонецПроцедуры

#КонецОбласти