#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьНастройкиПереносаСальдоНаПроизводственныхСчетах() Экспорт
	
	НаборЗаписей = РегистрыСведений.НастройкиПереносаСальдоНаСчетахБухгалтерскогоУчета.СоздатьНаборЗаписей();
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период        = Дата(1980, 1, 1);
	НоваяСтрока.Счет          = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
	НоваяСтрока.КорСчет       = ПланыСчетов.Хозрасчетный.НезавершенноеПроизводство_ОсновноеПроизводство;
	НоваяСтрока.ВозвратСальдо = Истина;
	НоваяСтрока.Используется  = Истина;
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период        = Дата(1980, 1, 1);
	НоваяСтрока.Счет          = ПланыСчетов.Хозрасчетный.Полуфабрикаты;
	НоваяСтрока.КорСчет       = ПланыСчетов.Хозрасчетный.НезавершенноеПроизводство_Полуфабрикаты;
	НоваяСтрока.ВозвратСальдо = Истина;
	НоваяСтрока.Используется  = Истина;
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период        = Дата(1980, 1, 1);
	НоваяСтрока.Счет          = ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводства;
	НоваяСтрока.КорСчет       = ПланыСчетов.Хозрасчетный.НезавершенноеПроизводство_ВспомогательныеПроизводства;
	НоваяСтрока.ВозвратСальдо = Истина;
	НоваяСтрока.Используется  = Истина;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
