#Область ПрограммныйИнтерфейс

Функция ПолучитьТаблицуДанных(ОсновныеНастройки) Экспорт
	
	СхемаДанныеТоваров	= ПолучитьМакет("ДанныеТоваров");
	
	Настройки	= СхемаДанныеТоваров.НастройкиПоУмолчанию;
	
	ПериодАнализ		= КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(ОсновныеНастройки, "ПериодАнализ").Значение;
	ПериодСравнение		= КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(ОсновныеНастройки, "ПериодСравнение").Значение;
	
	КомпоновкаДанныхКлиентСервер.СкопироватьОтборКомпоновкиДанных(СхемаДанныеТоваров, Настройки, ОсновныеНастройки);
	
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Настройки, "НачалоПериодаАнализ", ПериодАнализ.ДатаНачала);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Настройки, "ОкончаниеПериодаАнализ", ПериодАнализ.ДатаОкончания);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Настройки, "НачалоПериодаСравнение", ПериодСравнение.ДатаНачала);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Настройки, "ОкончаниеПериодаСравнение", ПериодСравнение.ДатаОкончания);
	
	КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки		= КомпоновщикМакета.Выполнить(СхемаДанныеТоваров, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки	= Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	Результат	= Новый ТаблицаЗначений;
	
	ПроцессорВывода	= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат Результат;
		
КонецФункции

Функция ПолучитьСтруктуруТаблицыДляОтчета() Экспорт
	
	Результат	= Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("ОбъектАнализа");
	Результат.Колонки.Добавить("ОборотАнализ");
	Результат.Колонки.Добавить("ОборотСравнение");
	Результат.Колонки.Добавить("ОборотАнализКоличество");
	Результат.Колонки.Добавить("ОборотСравнениеКоличество");
	Результат.Колонки.Добавить("Номенклатура");
	Результат.Колонки.Добавить("Подразделение");
	
	Возврат Результат;
	
КонецФункции

Функция ПолеОбъектаАнализа(Вариант) Экспорт 
	
	Если Вариант = 1 Тогда
		Возврат "Группа";
	ИначеЕсли Вариант = 2 Тогда
		Возврат "Склад";
	ИначеЕсли Вариант = 3 Тогда
		Возврат "Бренд";
	ИначеЕсли Вариант = 4 Тогда
		Возврат "Покупатель";
	ИначеЕсли Вариант = 5 Тогда
		Возврат "Подразделение";
	Иначе
		Возврат "Номенклатура";
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьРейтинги(ТаблицаДляОтчета, ПолеРасчета, ПолеРейтинга) Экспорт
	
	ПроцентАВС	= 0.8;
	ПроцентХ	= 0.2;
	ПроцентЗ	= 0.01;
	
	ПроцентА	= 0.4;
	ПроцентВ	= ПроцентА + 0.24;
	ПроцентС	= ПроцентВ + 0.16;
	
	Оборот_Сум	= ТаблицаДляОтчета.Итог(ПолеРасчета);
		
	ТаблицаДляОтчета.Сортировать(ПолеРасчета + " Убыв");
	НакопленнаяСумма 	= 0;
	СчетчикРейтингов	= Новый Соответствие;
	СчетчикРейтингов.Вставить("A", 0);
	СчетчикРейтингов.Вставить("B", 0);
	СчетчикРейтингов.Вставить("C", 0);
	СчетчикРейтингов.Вставить("X", 0);
	СчетчикРейтингов.Вставить("Z", 0);
	Для Каждого ТекСтрока Из ТаблицаДляОтчета Цикл
		
		Если НакопленнаяСумма < Оборот_Сум * ПроцентАВС Тогда
			Если НакопленнаяСумма < Оборот_Сум * ПроцентА Тогда 
				ТекСтрока.ГруппаАнализа = "A";
			ИначеЕсли НакопленнаяСумма < Оборот_Сум * ПроцентВ Тогда 
				ТекСтрока.ГруппаАнализа = "B";
			Иначе
				ТекСтрока.ГруппаАнализа = "C";
			КонецЕсли;
			ТекСтрока.ГруппаАнализаРодитель = "ABC";
		ИначеЕсли НакопленнаяСумма < Оборот_Сум * (ПроцентАВС + ПроцентХ - ПроцентЗ) Тогда
			ТекСтрока.ГруппаАнализа = "X";
			ТекСтрока.ГруппаАнализаРодитель = "XZ";
		Иначе
			ТекСтрока.ГруппаАнализа = "Z";
			ТекСтрока.ГруппаАнализаРодитель = "XZ";
		КонецЕсли;
		
		СчетчикРейтингов[ТекСтрока.ГруппаАнализа] = СчетчикРейтингов[ТекСтрока.ГруппаАнализа] + 1;
		ТекСтрока[ПолеРейтинга] = СтрШаблон("%1%2", ТекСтрока.ГруппаАнализа, Формат(СчетчикРейтингов[ТекСтрока.ГруппаАнализа], "ЧЦ=5; ЧВН=; ЧГ="));
		
		НакопленнаяСумма = НакопленнаяСумма + ТекСтрока[ПолеРасчета];
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти