
&НаСервере
&ИзменениеИКонтроль("УстановитьУсловноеОформление")
Процедура игр_УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	#Вставка
	Если Элементы.Найти("РаспоряженияНаПоступлениеДатаПлатежа") <> Неопределено Тогда 
	#КонецВставки
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаспоряженияНаПоступлениеДатаПлатежа.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РаспоряженияНаПоступление.ДатаПлатежа");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = НачалоДня(ТекущаяДатаСеанса());

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныеДанныеЦвет);
	#Вставка
	КонецЕсли;
	#КонецВставки

КонецПроцедуры
