////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ЭтаФорма.Параметры.Свойство("Значение", ЭтаФорма.ЗначениеОбъекта);
	ЭтаФорма.Параметры.Свойство("Реквизит", ЭтаФорма.РеквизитОбъекта);
	ЭтаФорма.Параметры.Свойство("Тип"     , ЭтаФорма.Тип);
	ЭтаФорма.Параметры.Свойство("Объект1С", ЭтаФорма.Объект1С);
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Если Найти(ЭтаФорма.Тип, "Организация_") = 1 Тогда
		
		ЭтаФорма.Объект1С  = Справочники.Организации.ПустаяСсылка();
		НовСтр = ЭтаФорма.ТаблицаЗначений.Добавить();
	    НовСтр.Реквизит = "GLN";
        НовСтр.Значение = ЭтаФорма.ЗначениеОбъекта;
		Если НЕ ОбработкаОбъект.ПолучитьДоступностьApiПоСтране() Тогда 
			Элементы.КомандаДанныеКонтрагентаПоAPI.Видимость = Ложь;
		Иначе 
			КомандаДанныеКонтрагентаПоAPIНаСервере();
		КонецЕсли;
		
	ИначеЕсли Найти(ЭтаФорма.Тип, "Контрагент_") = 1 Тогда
		
		ЭтаФорма.Объект1С  = Справочники.Контрагенты.ПустаяСсылка();
		НовСтр = ЭтаФорма.ТаблицаЗначений.Добавить();
	    НовСтр.Реквизит = "GLN";
        НовСтр.Значение = ЭтаФорма.ЗначениеОбъекта;
		Если НЕ ОбработкаОбъект.ПолучитьДоступностьApiПоСтране() Тогда 
			Элементы.КомандаДанныеКонтрагентаПоAPI.Видимость = Ложь;
		Иначе 
			КомандаДанныеКонтрагентаПоAPIНаСервере();
		КонецЕсли;
		
	ИначеЕсли Найти(ЭтаФорма.Тип, "ТочкаДоставки_") = 1 Тогда
		
		Элементы.Объект1С.ВыбиратьТип = Истина;
		НовСтр = ЭтаФорма.ТаблицаЗначений.Добавить();
	    НовСтр.Реквизит = "GLN";
        НовСтр.Значение = ЭтаФорма.ЗначениеОбъекта;
		Если НЕ ОбработкаОбъект.ПолучитьДоступностьApiПоСтране() Тогда 
			Элементы.КомандаДанныеКонтрагентаПоAPI.Видимость = Ложь;
		Иначе 
			КомандаДанныеКонтрагентаПоAPIНаСервере();
		КонецЕсли;
				
	ИначеЕсли Найти(ЭтаФорма.Тип, "Настройка_") = 1 Тогда
		
		Элементы.КомандаДанныеКонтрагентаПоAPI.Видимость = Ложь;

		Если Найти(ЭтаФорма.Тип, "Настройка_") = 1 И НЕ ЗначениеЗаполнено(ЭтаФорма.Объект1С) Тогда
			ЭтаФорма.Объект1С  = Справочники.Пользователи.ПустаяСсылка();
		КонецЕсли;
		Элементы.НадписьТип.Видимость             = Ложь;
		Элементы.Тип.Видимость                    = Ложь;
		Элементы.НадписьОбъект1С.Заголовок        = "Пользователь:";
		Элементы.ДанныеКонтрагентаПоAPI.Видимость = Ложь;
		Элементы.Надпись.Видимость                = Ложь;
		Запрос = Новый Запрос;
	    Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭКОМ_ЗначениеДополнительныхКонстант.ЗначениеДополнительнойКонстанты КАК Значение,
		|	ЭКОМ_ЗначениеДополнительныхКонстант.ДополнительнаяКонстанта КАК Реквизит
		|ИЗ
		|	РегистрСведений.ЭКОМ_ЗначениеДополнительныхКонстант КАК ЭКОМ_ЗначениеДополнительныхКонстант
		|ГДЕ
		|	ПОДСТРОКА(ВЫРАЗИТЬ(ЭКОМ_ЗначениеДополнительныхКонстант.ДополнительнаяКонстанта КАК СТРОКА(100)), 0, 10) = ""Настройка_""
		|	И ЭКОМ_ЗначениеДополнительныхКонстант.Измерение = &Измерение
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭКОМ_ЗначениеДополнительныхКонстант.Измерение";
		Запрос.УстановитьПараметр("Измерение", ЭтаФорма.Объект1С);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			НовСтр = ЭтаФорма.ТаблицаЗначений.Добавить();
			НовСтр.Реквизит = "Сертификат";
			НовСтр.Значение = Справочники.ЭКОМ_Сертификаты.ПустаяСсылка();
			НовСтр = ЭтаФорма.ТаблицаЗначений.Добавить();
			НовСтр.Реквизит = "Роль";
			НовСтр.Значение = "";
		Иначе
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				НовСтр = ЭтаФорма.ТаблицаЗначений.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
				НовСтр.Реквизит = СтрЗаменить(НовСтр.Реквизит ,"Настройка_", "");
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли Найти(ЭтаФорма.Тип, "Номенклатура_") = 1 Тогда 
		
		ЭтаФорма.Объект1С  = Справочники.Номенклатура.ПустаяСсылка();
		УникальныйКлюч = СтрЗаменить(ЭтаФорма.РеквизитОбъекта, "НаименованиеНоменклатурыКонтрагента_", "");
	    Элементы.КомандаДанныеКонтрагентаПоAPI.Видимость = Ложь;

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭКОМ_ЗначениеДополнительныхКонстант.Измерение КАК Тип,
		|	ЭКОМ_ЗначениеДополнительныхКонстант.ДополнительнаяКонстанта КАК Реквизит,
		|	ЭКОМ_ЗначениеДополнительныхКонстант.ЗначениеДополнительнойКонстанты КАК Значение
		|ИЗ
		|	РегистрСведений.ЭКОМ_ЗначениеДополнительныхКонстант КАК ЭКОМ_ЗначениеДополнительныхКонстант
		|ГДЕ
		|	ЭКОМ_ЗначениеДополнительныхКонстант.Измерение <> НЕОПРЕДЕЛЕНО
		|	И ТИПЗНАЧЕНИЯ(ЭКОМ_ЗначениеДополнительныхКонстант.Измерение) = ТИП(СТРОКА)
		|	И ЭКОМ_ЗначениеДополнительныхКонстант.Измерение = &Тип
		|	И ЭКОМ_ЗначениеДополнительныхКонстант.ДополнительнаяКонстанта ПОДОБНО ""%"" + &УникальныйКлюч
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭКОМ_ЗначениеДополнительныхКонстант.Измерение";
		Запрос.УстановитьПараметр("Тип"           , ЭтаФорма.Тип);  
		Запрос.УстановитьПараметр("УникальныйКлюч", УникальныйКлюч); 
		РезультатЗапроса = Запрос.Выполнить();			
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				НовСтр = ЭтаФорма.ТаблицаЗначений.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
			КонецЦикла;	
			
			ТЗ = ЭтаФорма.ТаблицаЗначений.Выгрузить();
			
			НайденнаяСтрокаЕд = ТЗ.Найти("ЕдиницаНоменклатурыКонтрагента_" + УникальныйКлюч, "Реквизит");
			Если НЕ НайденнаяСтрокаЕд = Неопределено Тогда
				Инд = ТЗ.Индекс(НайденнаяСтрокаЕд);
				ТЗ.Сдвинуть(НайденнаяСтрокаЕд, -Инд);
				ЭтаФорма.ТаблицаЗначений.Загрузить(ТЗ);
			КонецЕсли;
			
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНД ВКЛАДКИ НАСТРОЙКИ

#Область ОбработчикиКомандФормы

&НаСервере
Процедура КомандаДанныеКонтрагентаПоAPIНаСервере()
	
	МассивЛогаСобытий = Новый Массив;
	
	знСтруктура = Новый Структура;
	Для каждого Стр Из ЭтаФорма.ТаблицаЗначений Цикл
		знСтруктура.Вставить(Стр.Реквизит, Стр.Значение);	
	КонецЦикла;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");

	GLN = "";
	Если знСтруктура.Свойство("GLN", GLN) Тогда
		Данные = ОбработкаОбъект.ДанныеКонтрагентаПоAPI(GLN, МассивЛогаСобытий);
		Если ТипЗнч(Данные) = Тип("Массив") Тогда
			ЭтаФорма.ТаблицаЗначений.Очистить();
			Для Каждого ЭлМассив Из Данные Цикл
				Для Каждого Эл Из ЭлМассив Цикл
					НовСтр = ЭтаФорма.ТаблицаЗначений.Добавить();
					НовСтр.Реквизит = Эл.Ключ;
					НовСтр.Значение = Эл.Значение;
				КонецЦикла;	
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;

	Если МассивЛогаСобытий.Количество() > 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ЭКОМ_ОбщегоНазначения.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий);
		Сообщение.Сообщить();		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаДанныеКонтрагентаПоAPI(Команда)	
	КомандаДанныеКонтрагентаПоAPIНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаСопоставить(Команда)
	
	СоответствиеДанных = Новый Соответствие;
	Для каждого Стр Из ЭтаФорма.ТаблицаЗначений Цикл
		Если Найти(Стр.Реквизит, "ЕдиницаНоменклатурыКонтрагента_") = 1  Тогда
			Если ЗначениеЗаполнено(Стр.Значение) Тогда
				СоответствиеДанных.Вставить("ЕдиницаИзмеренияЗаполнена", Истина);	
			КонецЕсли;		
		КонецЕсли;
		СоответствиеДанных.Вставить(Стр.Реквизит, Стр.Значение);	
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Объект1С) Тогда
		Возврат;
	КонецЕсли;
	
	Если Найти(ЭтаФорма.Тип, "Номенклатура_") = 1 Тогда
		
		Если НЕ СоответствиеДанных.Получить("ЕдиницаИзмеренияЗаполнена") = Истина Тогда
			Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтаФорма, СоответствиеДанных); 		
			ПоказатьВопрос(Оповещение, "По номенклатуре не заполнена единица измерения. Указать единицу измерения?", РежимДиалогаВопрос.ДаНет, 0);
		Иначе
			Результат = КомандаСопоставитьНаСервере(СоответствиеДанных);
			Если НЕ Результат = Истина Тогда
				Информация(Результат);
				Возврат;
			КонецЕсли;
						
			Закрыть();
			
		КонецЕсли;
	Иначе
		
		Результат = КомандаСопоставитьНаСервере(СоответствиеДанных);
		Если НЕ Результат = Истина Тогда
			Информация(Результат);
			Возврат;
		КонецЕсли;
		
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, СоответствиеДанных) Экспорт
    
    Если Результат = КодВозвратаДиалога.Да Тогда
		
		Реквизит = "ЕдиницаНоменклатурыКонтрагента_" + СтрЗаменить(ЭтаФорма.РеквизитОбъекта, "НаименованиеНоменклатурыКонтрагента_", "");
		
		Если ЭтаФорма.ТаблицаЗначений.НайтиСтроки(Новый Структура("Реквизит", Реквизит)).Количество() = 0 Тогда
			НовСтр = ЭтаФорма.ТаблицаЗначений.Добавить();
			НовСтр.Реквизит = Реквизит;
		КонецЕсли;
		
   	Иначе
		
		Результат = КомандаСопоставитьНаСервере(СоответствиеДанных);
		Если НЕ Результат = Истина Тогда
			Информация(Результат);
			Возврат;
		КонецЕсли;
		
		Закрыть();
		
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Функция КомандаСопоставитьНаСервере(СоответствиеДанных)
    
    Результат = Неопределено;
    
	Если Найти(ЭтаФорма.Тип, "Настройка_") = 1 Тогда
		Результат = СоздатьОбновитьНастройки(СоответствиеДанных, ЭтаФорма.Объект1С);	
	Иначе		
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		
		Если Найти(ЭтаФорма.Тип, "Номенклатура_") = 1 Тогда
			Результат = ОбработкаОбъект.СоздатьОбновитьНоменклатуру(СоответствиеДанных, ЭтаФорма.РеквизитОбъекта, ЭтаФорма.Объект1С);
		ИначеЕсли Найти(ЭтаФорма.Тип, "Организация_") = 1 Тогда
			Результат = ОбработкаОбъект.СоздатьОбновитьОрганизацию(СоответствиеДанных, ЭтаФорма.Объект1С);
		ИначеЕсли Найти(ЭтаФорма.Тип, "Контрагент_") = 1 
			  ИЛИ Найти(ЭтаФорма.Тип, "ТочкаДоставки_") = 1 Тогда
			Результат = ОбработкаОбъект.СоздатьОбновитьКонтрагента(СоответствиеДанных, ЭтаФорма.Тип, ЭтаФорма.Объект1С);
		КонецЕсли;
		
	КонецЕсли;

    Если Результат = Истина Тогда
       Если Найти(ЭтаФорма.Тип, "Организация_") = 1 
            ИЛИ Найти(ЭтаФорма.Тип, "Контрагент_") = 1  
            ИЛИ Найти(ЭтаФорма.Тип, "ТочкаДоставки_") = 1 Тогда
			
            МЗ = РегистрыСведений.ЭКОМ_ЗначениеДополнительныхКонстант.СоздатьМенеджерЗаписи();
            МЗ.ДополнительнаяКонстанта = ЭтаФорма.РеквизитОбъекта;
            МЗ.Измерение               = ЭтаФорма.Тип;
            МЗ.Прочитать();
            Если МЗ.Выбран() Тогда	
                МЗ.Удалить();
            КонецЕсли;
        КонецЕсли;	
	КонецЕсли;
    
    Возврат Результат;	
КонецФункции

#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ ФУНКЦИИ

#Область ПрочиеФункции

&НаСервере
Функция СоздатьОбновитьНастройки(СоответствиеДанных, пОбъект1С)	
       
    Результат = Неопределено;
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Сертификат = СоответствиеДанных.Получить("Сертификат"); 
	Если ЗначениеЗаполнено(Сертификат) Тогда
		Результат = ОбработкаОбъект.Настройка_Параметр_Записать("Настройка_Сертификат", Сертификат, пОбъект1С);
	КонецЕсли;
	Роль = СоответствиеДанных.Получить("Роль");
	Если ЗначениеЗаполнено(Роль) Тогда
		Результат = ОбработкаОбъект.Настройка_Параметр_Записать("Настройка_Роль", Роль, пОбъект1С);
	КонецЕсли;
    
    Возврат Результат;

КонецФункции

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Информация(ТекстСообщения, Знач ОписаниеОперации = "Запись соответствия", ВидСообщения = "Предупреждение")
    Если ТекстСообщения = Истина Тогда
    	Возврат;
    КонецЕсли;
    ОписаниеОперации = ОписаниеОперации + " [" + СтрЗаменить(Тип, "_", "") + "]";
    
    Если ВидСообщения = "Предупреждение" Тогда
        ПоказатьПредупреждение(Новый ОписаниеОповещения, ТекстСообщения, , ОписаниеОперации);
    КонецЕсли;
    
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпределитьТипЕденицИзмерения()	
	
	Возврат Метаданные.Документы.ЭКОМ_Документы.ТабличныеЧасти.ТЧ_Товары.Реквизиты.ЕдиницаИзмерения.Тип;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКоллекциюЕдиницНоменклатуры(Объект1С, РежимВыбораЕдиниц)

	Возврат РегистрыСведений.ЭКОМ_НоменклатураКонтрагентов.ПолучитьКоллекциюЕдиницНоменклатуры(Объект1С, РежимВыбораЕдиниц);

КонецФункции // ПолучитьКоллекциюЕдиницНоменклатуры()

&НаКлиенте
Процедура ТаблицаЗначенийПриАктивизацииЯчейки(Элемент)
	
	ТаблицаЗначенийЗначение = Элементы.Найти("ТаблицаЗначенийЗначение");
	Если ТаблицаЗначенийЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Найти(Элементы.ТаблицаЗначений.ТекущиеДанные.Реквизит, "ЕдиницаНоменклатурыКонтрагента_") = 1 Тогда
		ТипыЕдиниц = ОпределитьТипЕденицИзмерения();
		МассивТипов = Новый Массив;
		Для Каждого ТипЕдиницы Из ТипыЕдиниц.Типы() Цикл
			МассивТипов.Добавить(Строка(ТипЕдиницы));
		КонецЦикла;
		
		Если НЕ МассивТипов.Найти("Классификатор единиц измерения") = Неопределено
			И НЕ МассивТипов.Найти("Единицы измерения") = Неопределено Тогда // УТ 10.3
			// Форма выбора ЕдиницыИзмерения для текущей номенклатуры.
			РежимВыбораЕдиниц = 1;
		ИначеЕсли НЕ МассивТипов.Найти("Упаковка") = Неопределено Тогда // УТ 11.4, ERP и подобные
			// Выпадающий список УпаковкиЕдиницыИзмерения для текущей номенклатуры (форма не подходит, так как там либо форма с базовыми единицами, либо с упаковками)
			РежимВыбораЕдиниц = 2;
		ИначеЕсли НЕ МассивТипов.Найти("Классификатор единиц измерения") = Неопределено Тогда // Вся бухгалтерия
			// Подставляем номенклатуру из КлассификаторЕдиницИзмерения, которая принадлежит данному товару (без возможности ее редактирования)
			РежимВыбораЕдиниц = 3;
		Иначе // Как было раньше
			РежимВыбораЕдиниц = 0;
		КонецЕсли;
		ЗаполнитьЕдиницуИзмерения(ТаблицаЗначенийЗначение, ТипыЕдиниц);
		
		//ТаблицаЗначенийЗначение.ОграничениеТипа = ТипыЕдиниц;
	ИначеЕсли Найти(Элементы.ТаблицаЗначений.ТекущиеДанные.Реквизит, "xmlЕдиницаИзмерения_") = 1
		ИЛИ Найти(Элементы.ТаблицаЗначений.ТекущиеДанные.Реквизит, "АртикулНоменклатурыКонтрагента_") = 1 
		ИЛИ Найти(Элементы.ТаблицаЗначений.ТекущиеДанные.Реквизит, "КодНоменклатурыКонтрагента_") = 1 
		ИЛИ Найти(Элементы.ТаблицаЗначений.ТекущиеДанные.Реквизит, "НаименованиеНоменклатурыКонтрагента_") = 1 
		ИЛИ Найти(Элементы.ТаблицаЗначений.ТекущиеДанные.Реквизит, "ШтрихКодНоменклатурыКонтрагента_") = 1 Тогда
		ТаблицаЗначенийЗначение.ОграничениеТипа = Новый ОписаниеТипов("Строка");
		Если ТаблицаЗначенийЗначение.РежимВыбораИзСписка = Истина Тогда
			ТаблицаЗначенийЗначение.РежимВыбораИзСписка = Ложь;
			ТаблицаЗначенийЗначение.СписокВыбора.Очистить();
		КонецЕсли;
	ИначеЕсли Найти(Элементы.ТаблицаЗначений.ТекущиеДанные.Реквизит, "Контрагент_") = 1 Тогда
		ТаблицаЗначенийЗначение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
		Если ТаблицаЗначенийЗначение.РежимВыбораИзСписка = Истина Тогда
			ТаблицаЗначенийЗначение.РежимВыбораИзСписка = Ложь;
			ТаблицаЗначенийЗначение.СписокВыбора.Очистить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЕдиницуИзмерения(ЭлементУправления = Неопределено, ТипыЕдиниц = Неопределено)

	ТекущиеДанные = Элементы.ТаблицаЗначений.ТекущиеДанные;
	
	Если ЭлементУправления = Неопределено Тогда
		ЭлементУправления = Элементы.Найти("ТаблицаЗначенийЗначение");
	КонецЕсли;
	
	Если ТипыЕдиниц = Неопределено Тогда
		ТипыЕдиниц = ОпределитьТипЕденицИзмерения();
	КонецЕсли;
	
	Если РежимВыбораЕдиниц = 1 Тогда
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Значение) Тогда
			ТекущиеДанные.Значение = ПредопределенноеЗначение("Справочник.ЕдиницыИзмерения.ПустаяСсылка");
		КонецЕсли;
		ЭлементУправления.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения");
	ИначеЕсли РежимВыбораЕдиниц = 2 Тогда
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Значение) Тогда
			ТекущиеДанные.Значение = ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка");
		КонецЕсли;
		ЭлементУправления.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения");
		ЭлементУправления.РежимВыбораИзСписка = Истина;
		ЭлементУправления.СписокВыбора.ЗагрузитьЗначения(ПолучитьКоллекциюЕдиницНоменклатуры(Объект1С, РежимВыбораЕдиниц));
	ИначеЕсли РежимВыбораЕдиниц = 3 Тогда
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Значение)
			ИЛИ НЕ ЗначениеЗаполнено(Объект1С) Тогда
			ТекущиеДанные.Значение = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка");
		КонецЕсли;
		ЭлементУправления.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения");
		Единицы = ПолучитьКоллекциюЕдиницНоменклатуры(Объект1С, РежимВыбораЕдиниц);
		Если НЕ Единицы.Количество() = 0 Тогда
			ТекущиеДанные.Значение = Единицы.Получить(0);
		КонецЕсли;
		ЭлементУправления.ТолькоПросмотр = Истина;
	ИначеЕсли РежимВыбораЕдиниц = 0 Тогда
		ЭлементУправления.ОграничениеТипа = ТипыЕдиниц;
	КонецЕсли;

КонецПроцедуры // ЗаполнитьЕдиницуИзмерения()


&НаКлиенте
Процедура Объект1СПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаЗначений.ТекущаяСтрока;
	Для Каждого Строка Из ТаблицаЗначений Цикл
		Если Найти(Строка.Реквизит, "ЕдиницаНоменклатурыКонтрагента_") = 1 Тогда
			Строка.Значение = Неопределено;
			Элементы.ТаблицаЗначений.ТекущаяСтрока = Строка.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьЕдиницуИзмерения();
	Элементы.ТаблицаЗначений.ТекущаяСтрока = ТекущаяСтрока;
	
КонецПроцедуры

