
Функция ЭтоКонфигурацияЗарплатногоУчета() Экспорт 
	
	Возврат (Метаданные.Имя = "ЗарплатаИУправлениеПерсоналомДляКазахстана");
	
КонецФункции

Функция РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок(Организация, Период) Экспорт

	Возврат УчетСреднегоЗаработкаРК.РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок(Организация, Период);
	
КонецФункции

Функция ВариантУчетаКадровыхПерестановок(Организация, Период) Экспорт

	Возврат УчетСреднегоЗаработкаРК.ВариантУчетаКадровыхПерестановок(Организация, Период);

КонецФункции

Функция МаксимальныйПриоритетВычетаИПН() Экспорт 
	
	Возврат Справочники.ВидыВычетовИПН.МаксимальныйПриоритет();
	
КонецФункции

Функция ПрименятьКорректировкуПрочихНалоговВзносовОтчислений(Организация, Период) Экспорт
	
	Если Период >= Дата(2021, 1, 1) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(Период, Новый Структура("Организация", Организация));
	НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений = Ложь;
	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений = УчетнаяПолитикаНУ[0].НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений;
	КонецЕсли;
	
	Возврат НЕ НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений;
	
КонецФункции

Функция ПрименятьВычетВОСМСДляФизическихЛицИГПХ(Организация, Период) Экспорт
	
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(Период, Новый Структура("Организация", Организация));
	ПрименятьВычетВОСМСДляФизическихЛицИГПХ = Ложь;
	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		ПрименятьВычетВОСМСДляФизическихЛицИГПХ = УчетнаяПолитикаНУ[0].ПрименятьВычетВОСМСДляФизическихЛицИГПХ;
	КонецЕсли;
	
	Возврат ПрименятьВычетВОСМСДляФизическихЛицИГПХ;
	
КонецФункции

Функция ПрименятьВычетОПВиВОСМСДляГПХ(Организация, Период) Экспорт
	
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(Период, Новый Структура("Организация", Организация));
	ПрименятьВычетОПВиВОСМСДляГПХ = Ложь;
	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		ПрименятьВычетОПВиВОСМСДляГПХ = УчетнаяПолитикаНУ[0].ПрименятьВычетОПВиВОСМСДляГПХ;
	КонецЕсли;
	
	Возврат ПрименятьВычетОПВиВОСМСДляГПХ;
	
КонецФункции

Функция ДеньУвольненияЯвляетсяРабочимДнем(Организация, Период) Экспорт
	
	УчетнаяПолитикаЗарплатаКадры = РегистрыСведений.УчетнаяПолитикаЗарплатаКадры.СрезПоследних(Период, Новый Структура("Организация", Организация));
	ДеньУвольненияЯвляетсяРабочимДнем = Ложь;
	Если УчетнаяПолитикаЗарплатаКадры.Количество() > 0 Тогда
		ДеньУвольненияЯвляетсяРабочимДнем = УчетнаяПолитикаЗарплатаКадры[0].ДеньУвольненияЯвляетсяРабочимДнем;
	КонецЕсли;
	
	Возврат ДеньУвольненияЯвляетсяРабочимДнем;
	
КонецФункции
