
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавитьИзменитьЭлементыФормы();
	
КонецПроцедуры


&НаСервере
Процедура ДобавитьИзменитьЭлементыФормы()
	
	ТабДокумент.Область("R1C1").Текст = "Код";
	ТабДокумент.Область("R1C1").ШиринаКолонки = 20;
	
	ТабДокумент.Область("R1C2").Текст = "Наименование (на казахском)";
	ТабДокумент.Область("R1C2").ШиринаКолонки = 30;
	
	ТабДокумент.Область("R1C3").Текст = "Описание";
	ТабДокумент.Область("R1C3").ШиринаКолонки = 30;

	ТабДокумент.Область("R1C4").Текст = "Описание (на казахском)";
	ТабДокумент.Область("R1C4").ШиринаКолонки = 30;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере()
	
	ТаблицаЗагрузки	= ПолучитьТаблицуЗагрузки();
	ЗаполнитьСсылкуНоменклатуры(ТаблицаЗагрузки);
	ЗаполнитьНоменклатуру(ТаблицаЗагрузки);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНоменклатуру(ТаблицаЗагрузки) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос	= Новый Запрос("ВЫБРАТЬ ПВХ.Ссылка КАК Ссылка ИЗ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ПВХ ГДЕ ПВХ.Имя = &Имя");
	Запрос.УстановитьПараметр("Имя", "НаименованиеДляПечатиКазахский");
	Выборка	= Запрос.Выполнить().Выбрать();	
	Выборка.Следующий();
	СвойствоНаименование	= Выборка.Ссылка;
	
	Запрос.УстановитьПараметр("Имя", "ОписаниеКазахский");
	Выборка	= Запрос.Выполнить().Выбрать();	
	Выборка.Следующий();
	СвойствоОписание	= Выборка.Ссылка;
	
	Для Каждого СтрокаТаблицы Из ТаблицаЗагрузки Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Ссылка) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не найдена номенклатура с кодом: %1", СтрокаТаблицы.Код));
			Продолжить;
		КонецЕсли;
		
		СпрОбъект	= СтрокаТаблицы.Ссылка.ПолучитьОбъект();
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Описание) Тогда
			СпрОбъект.Описание	= СтрокаТаблицы.Описание;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.НаименованиеКЗ) Тогда
			НайденноеСвойство	= СпрОбъект.ДополнительныеРеквизиты.Найти(СвойствоНаименование, "Свойство");
			Если НайденноеСвойство = Неопределено Тогда
				НайденноеСвойство	= СпрОбъект.ДополнительныеРеквизиты.Добавить();
				НайденноеСвойство.Свойство	= СвойствоНаименование;
			КонецЕсли;
			НайденноеСвойство.Значение	= СтрокаТаблицы.НаименованиеКЗ;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ОписаниеКЗ) Тогда
			НайденноеСвойство	= СпрОбъект.ДополнительныеРеквизиты.Найти(СвойствоОписание, "Свойство");
			Если НайденноеСвойство = Неопределено Тогда
				НайденноеСвойство	= СпрОбъект.ДополнительныеРеквизиты.Добавить();
				НайденноеСвойство.Свойство	= СвойствоОписание;
			КонецЕсли;
			НайденноеСвойство.Значение	= СтрокаТаблицы.ОписаниеКЗ;
		КонецЕсли;
		
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		СпрОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
		СпрОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСсылкуНоменклатуры(ТаблицаЗагрузки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаЗагрузки.Колонки.Добавить("Ссылка");
	
	Запрос	= Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Код КАК Код
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Код В(&Коды)"
	;
	
	Запрос.УстановитьПараметр("Коды", ТаблицаЗагрузки.ВыгрузитьКолонку("Код"));
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныеСтроки	= ТаблицаЗагрузки.НайтиСтроки(Новый Структура("Код", Выборка.Код));
		Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
			СтрокаТаблицы.Ссылка = Выборка.Ссылка;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуЗагрузки()
	
	ТаблицаЗагрузки	= Новый ТаблицаЗначений;
	ТаблицаЗагрузки.Колонки.Добавить("Код");
	ТаблицаЗагрузки.Колонки.Добавить("НаименованиеКЗ");
	ТаблицаЗагрузки.Колонки.Добавить("Описание");
	ТаблицаЗагрузки.Колонки.Добавить("ОписаниеКЗ");
	
	НПП = 1;
	Пока НПП < ТабДокумент.ВысотаТаблицы Цикл
		
		НПП = НПП + 1;
		НППСтр = Формат(НПП, "ЧГ=");
		
		Данные	= Новый Структура;
		
		Данные.Вставить("Код", СокрЛП(ТабДокумент.Область("R"+НППСтр+"C1").Текст));
		Данные.Вставить("НаименованиеКЗ", СокрЛП(ТабДокумент.Область("R"+НППСтр+"C2").Текст));
		Данные.Вставить("Описание", СокрЛП(ТабДокумент.Область("R"+НППСтр+"C3").Текст));
		Данные.Вставить("ОписаниеКЗ", СокрЛП(ТабДокумент.Область("R"+НППСтр+"C4").Текст));
		
		ЗаполнитьЗначенияСвойств(ТаблицаЗагрузки.Добавить(), Данные);
		
	КонецЦикла;
	
	Возврат ТаблицаЗагрузки;
	
КонецФункции

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры
