#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	//ограничим выбор значений только используемыми
	ДанныеВыбора.Добавить(Перечисления.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации);
	ДанныеВыбора.Добавить(Перечисления.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизацииПоДвойнойНорме);
	ДанныеВыбора.Добавить(Перечисления.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.ВключениеВРасходыПриПринятииКУчету);
	ДанныеВыбора.Добавить(Перечисления.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.ОтнесениеНаВычетыРавнымиДолями);
	ДанныеВыбора.Добавить(Перечисления.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.СтоимостьНеВключаетсяВРасходы);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли