#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// Обработчик обновления КА 2.4.1.11
// Очищает поле ВидЗапасов для типов запасов соответствующим услугам.
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоДвижения = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = "РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства";
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|");
	
	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Регистраторы, ДополнительныеПараметры);
	
КонецПроцедуры

// Обработчик обновления КА 2.4.1.12
// Очищает поле ВидЗапасов для типов запасов соответствующим услугам.
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт

	ПолноеИмяРегистра = "РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства";
	МетаданныеРегистра = Метаданные.РегистрыНакопления.ПрочиеРасходыНезавершенногоПроизводства;
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоДвижения = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = ПолноеИмяРегистра;
	
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьРегистраторыРегистраДляОбработки(Параметры.Очередь, Неопределено, ПолноеИмяРегистра);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Движения.Период             КАК Период,
	|	Движения.ВидДвижения        КАК ВидДвижения,
	|	Движения.Организация                 КАК Организация,
	|	Движения.Подразделение               КАК Подразделение,
	|	Движения.ПартияПроизводства          КАК ПартияПроизводства,
	|	Движения.ЗаказНаПроизводство         КАК ЗаказНаПроизводство,
	|	Движения.КодСтрокиПродукция          КАК КодСтрокиПродукция,
	|	Движения.Этап                        КАК Этап,
	|	Движения.СтатьяКалькуляции           КАК СтатьяКалькуляции,
	|	Движения.СтатьяРасходов              КАК СтатьяРасходов,
	|	Движения.АналитикаРасходов           КАК АналитикаРасходов,
	|	Движения.ГруппаПродукции             КАК ГруппаПродукции,
	|	Движения.ПравилоОтнесенияНаВыпуск    КАК ПравилоОтнесенияНаВыпуск,
	|	Движения.Стоимость           КАК Стоимость,
	|	Движения.СтоимостьБезНДС     КАК СтоимостьБезНДС,
	|	Движения.СтоимостьРегл       КАК СтоимостьРегл,
	|	Движения.ПостояннаяРазница   КАК ПостояннаяРазница,
	|	Движения.ВременнаяРазница    КАК ВременнаяРазница,
	|	Движения.ДоляСтоимости       КАК ДоляСтоимости,
	|	Движения.СтоимостьУпр        КАК СтоимостьУпр,
	|	Движения.Продукция                   КАК Продукция,
	|	Движения.ХарактеристикаПродукции     КАК ХарактеристикаПродукции,
	|	Движения.КоличествоПродукции         КАК КоличествоПродукции,
	|	Движения.АналитикаУчетаПродукции     КАК АналитикаУчетаПродукции,
	|	Движения.РазделУчета                 КАК РазделУчета,
	|	ВЫБОР КОГДА Движения.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга)
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|		ИНАЧЕ Движения.ВидЗапасов
	|	КОНЕЦ                                КАК ВидЗапасов,
	|	Движения.ДокументДвижения            КАК ДокументДвижения,
	|	Движения.ДокументИсточник            КАК ДокументИсточник,
	|	Движения.ДокументВыпуска             КАК ДокументВыпуска,
	|	Движения.РасчетСебестоимости         КАК РасчетСебестоимости,
	|	Движения.РасчетПартий                КАК РасчетПартий,
	|	Движения.ПоказательОтнесенияНаПартию КАК ПоказательОтнесенияНаПартию,
	|	Движения.АналитикаУчетаПартийПроизводства КАК АналитикаУчетаПартийПроизводства,
	|	Движения.КорАналитикаУчетаПартий     КАК КорАналитикаУчетаПартий
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК Движения
	|ГДЕ
	|	Движения.Регистратор = &Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Движения.НомерСтроки";
	
	Пока Выборка.Следующий() Цикл
		
		Регистратор = Выборка.Регистратор;
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра + ".НаборЗаписей");
			ЭлементБлокировки.УстановитьЗначение("Регистратор", Регистратор);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("Регистратор", Регистратор);
			
			Набор = РегистрыНакопления.ПрочиеРасходыНезавершенногоПроизводства.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(Регистратор);
			
			Результат = Запрос.Выполнить().Выгрузить();
			
			Набор.Загрузить(Результат);
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(Набор);
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru = 'Не удалось обработать документ: %Регистратор% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Регистратор%", Регистратор);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,
				Регистратор.Метаданные(), ТекстСообщения);
				
		КонецПопытки;
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли