////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ЭтаФорма.Параметры.Свойство("ТипМакета", ЭтаФорма.ТипМакета);
	Если ЭтаФорма.ТипМакета = "ОтчетПоНезавершеннымДокументамЮЗД" Тогда
	     ЭтаФорма.ЗаголовокОтчета = "УПД/УКД по которым документооборот не завершен" ;
		 Элементы.ПериодНачало.Заголовок = "Дата счет-фактуры с";
		 Элементы.ПериодКонец.Заголовок = "Дата счет-фактуры по";
	ИначеЕсли ЭтаФорма.ТипМакета = "ОтчетПоставщик" Тогда
	     ЭтаФорма.ЗаголовокОтчета = "Количество по номенклатуре";
		 Элементы.ПериодНачало.Заголовок = "Дата заказа с";
		 Элементы.ПериодКонец.Заголовок = "Дата заказа по";	
	ИначеЕсли ЭтаФорма.ТипМакета = "ОтчетПоСетям" Тогда
	     ЭтаФорма.ЗаголовокОтчета = "Количество заказов по сетям";
		 Элементы.ПериодНачало.Заголовок = "Дата заказа с";
		 Элементы.ПериодКонец.Заголовок = "Дата заказа по";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.ПериодКонец) Тогда
	     ЭтаФорма.ПериодКонец = КонецДня(ТекущаяДата());	
	КонецЕсли;
	 
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.ПериодНачало) Тогда
	     ЭтаФорма.ПериодНачало = НачалоДня(ТекущаяДата()) - (24*7*60*60);	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура КомандаСформировать(Команда)
	СформироватьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)	
    Диалог = Новый ДиалогРедактированияСтандартногоПериода();                                 
    Диалог.Период = Новый СтандартныйПериод(ЭтаФорма.ПериодНачало, ЭтаФорма.ПериодКонец);
    ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("УстановитьПериодЗавершение", ЭтаФорма, Новый Структура("Диалог", Диалог));
    Диалог.Показать(ОписаниеОповещенияОЗакрытии); 	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодЗавершение(Период, ДополнительныеПараметры) Экспорт	
	
	Диалог = ДополнительныеПараметры.Диалог; 	
    Если НЕ Период = Неопределено Тогда		
        ЭтаФорма.ПериодНачало = Диалог.Период.ДатаНачала;
        ЭтаФорма.ПериодКонец  = Диалог.Период.ДатаОкончания;		
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет()
	
	ОбработкаОбъект 	= РеквизитФормыВЗначение("Объект");
	
	ТабДок = ПолеТабДокумента;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;

	//Получаем схему из макета
	СхемаКомпоновкиДанных = ОбработкаОбъект.ПолучитьМакет(ЭтаФорма.ТипМакета); 
	
	//создадим компоновщик настроек и загрузим настройки по умолчанию, вместо настроек по умолчанию можно использовать восстановленные настройки
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Настройки = КомпоновщикНастроек.Настройки;
	
	//установка параметров отчета, без КомпоновщикНастроекКомпоновкиДанных делать это гораздо сложнее
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", НачалоДня(ЭтаФорма.ПериодНачало));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода" , КонецДня(ЭтаФорма.ПериодКонец));
	Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок"    , ЭтаФорма.ЗаголовокОтчета);
	
	//Помещаем в переменную данные о расшифровке данных - здесь ненужный пункт, но пусть будет.
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки,,);
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	////Очищаем поле табличного документа
	ТабДок.Очистить();
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабДок);	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры
