&НаКлиенте
Перем СтарыйКодSSCC;


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Параметры.Свойство("ДокументСсылка", ДокументСсылка);
	
	ЭКОМ_Документ_ORDER = Неопределено;
	Параметры.Свойство("ЭКОМ_Документ_ORDER", ЭКОМ_Документ_ORDER);
	Если ЗначениеЗаполнено(ЭКОМ_Документ_ORDER) Тогда
	     ЭтаФорма.МестоДоставкиУпаковки = ЭКОМ_Документ_ORDER.xmlТочкаДоставки; // По умолчанию точка доставки GLN
	КонецЕсли;
	
	// Паллеты по номенклатуре (POSITION)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТЧТоварыНаПалетах = ОбработкаОбъект.ПолучитьДанныеПаллетах(ЭтаФорма.ДокументСсылка);	
	Для каждого СтрТЧ Из ТЧТоварыНаПалетах Цикл
		
		НоваяСтрока = ТоварыНаПалетах.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТЧ);
	    НоваяСтрока.ВесНеттоШтуки  = ?(СтрТЧ.Количество = 0, 0, СтрТЧ.ВесНетто  / СтрТЧ.Количество);
	    НоваяСтрока.ВесБруттоШтуки = ?(СтрТЧ.Количество = 0, 0, СтрТЧ.ВесБрутто / СтрТЧ.Количество);
		
	КонецЦикла;

    Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		
		ЭтаФорма.Заголовок = "Разбивка по паллетам для: " + Строка(ДокументСсылка);
		ЭтаФорма.Контрагент = ДокументСсылка.Контрагент; 
		
		// Номенклатура из документа
		//Docrobot 1.19.0 MOD-1357
		МетаданныеДокумент = ДокументСсылка.Метаданные();
		
		Если Не МетаданныеДокумент.ТабличныеЧасти.Найти("Товары") = Неопределено Тогда
			ИмяТЧ = "Товары";
		ИначеЕсли Не МетаданныеДокумент.ТабличныеЧасти.Найти("Запасы") = Неопределено Тогда //Для УНФ
			ИмяТЧ = "Запасы";
		Иначе
			ИмяТЧ = "";	
		КонецЕсли;
		//КОНЕЦ Docrobot 1.19.0 MOD-1357
		МД_ДокументСсылка = ДокументСсылка.Метаданные();
		МД_Товары         = МД_ДокументСсылка.ТабличныеЧасти.Найти(ИмяТЧ);
		ДокументСсылкаИмя = МД_ДокументСсылка.Имя;
		
		Если МД_Товары = Неопределено Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		РеквизитыТЧ = МД_Товары.Реквизиты;		
		
		КолонкиТЧ = Новый Соответствие;
		//Docrobot 1.20.0 MOD-1481 [Добавлены Характеристика и Серия]
		КолонкиТЧ.Вставить("Характеристика"  , "Характеристика");
		КолонкиТЧ.Вставить("Серия"     		 , "Серия");
		КолонкиТЧ.Вставить("НомерСтроки"     , "НомерСтроки");
		КолонкиТЧ.Вставить("Количество"      , "Количество");
		КолонкиТЧ.Вставить("КоличествоМест"  , "КоличествоМест");
		КолонкиТЧ.Вставить("Коэффициент"     , "Коэффициент");
		КолонкиТЧ.Вставить("Цена"            , "Цена");
		КолонкиТЧ.Вставить("Сумма"           , "Сумма");
		КолонкиТЧ.Вставить("СтавкаНДС"       , "СтавкаНДС");
		КолонкиТЧ.Вставить("СуммаНДС"        , "СуммаНДС");
		КолонкиТЧ.Вставить("СуммаСНДС"       , "СуммаСНДС");
		
		Если НЕ РеквизитыТЧ.Найти("ЕдиницаИзмерения") = Неопределено Тогда
			КолонкиТЧ.Вставить("ЕдиницаИзмерения", "Единица_Измерения");
		ИначеЕсли НЕ РеквизитыТЧ.Найти("Упаковка") = Неопределено Тогда
			КолонкиТЧ.Вставить("Упаковка", "Единица_Измерения");
		КонецЕсли;
				
		ИмяДинамическогоСписка = "СписокТовары";
		ТекстЗапросаРеквизитов = "";
		НовыеКолонкиТЧ = Новый Соответствие; 
		Для каждого ЭлементКолонкиТЧ Из КолонкиТЧ Цикл
			
			ИмяКолонки = ЭлементКолонкиТЧ.Ключ;
			Если НЕ РеквизитыТЧ.Найти(ИмяКолонки) = Неопределено Тогда
								
				ИмяПредставлениеКолонки = ЭлементКолонкиТЧ.Значение;	
				НайденнаяКолонкаДинамическогоСписка = Элементы.Найти(ИмяДинамическогоСписка + ИмяПредставлениеКолонки); 				
				Если НайденнаяКолонкаДинамическогоСписка = Неопределено	 Тогда
					 НовыеКолонкиТЧ.Вставить(ИмяКолонки, ИмяПредставлениеКолонки);               				
				КонецЕсли;

			    ТекстЗапросаРеквизитов = ТекстЗапросаРеквизитов + ?(ТекстЗапросаРеквизитов = "", "", ",")  + "
				                     |	РеализацияТЧ." + ИмяКолонки + " КАК " + ИмяПредставлениеКолонки;		 
			КонецЕсли;
			
        КонецЦикла;
						
		ТекстЗапроса = "ВЫБРАТЬ
		               |	РеализацияТЧ.НомерСтроки КАК Ключ_Строки,
		               |	РеализацияТЧ.Номенклатура КАК Номенклатура,
					   |    ЛОЖЬ как Отметка, 
		               |	0 КАК ДругиеРеквизиты
		               |ИЗ
		               |	&ДокументРеализацииТЧ КАК РеализацияТЧ
		               |ГДЕ
		               |	РеализацияТЧ.Ссылка = &ДокументСсылка";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "0 КАК ДругиеРеквизиты", ТекстЗапросаРеквизитов);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДокументРеализацииТЧ", "Документ." + ДокументСсылкаИмя + "." + ИмяТЧ);

		// Товары из документа
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = СписокТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			СтруктураОтбор = Новый Структура;
			СтруктураОтбор.Вставить("Номенклатура"     , НоваяСтрока.Номенклатура);
			СтруктураОтбор.Вставить("Ключ_Строки"      , НоваяСтрока.Ключ_Строки);
			СтруктураОтбор.Вставить("Единица_Измерения", НоваяСтрока.Единица_Измерения);
			//Docrobot 1.20.0 MOD-1481 [Добавлены Характеристика и Серия]
			СтруктураОтбор.Вставить("Характеристика"	, НоваяСтрока.Характеристика); 
			СтруктураОтбор.Вставить("Серия"				, НоваяСтрока.Серия);
			
			НайденныеСтроки_НаПалетах = ЭтаФорма.ТоварыНаПалетах.НайтиСтроки(СтруктураОтбор);	
			КоличествоРазмещено = 0;
			Для каждого стр_НаПалетах из НайденныеСтроки_НаПалетах Цикл
				КоличествоРазмещено = КоличествоРазмещено + стр_НаПалетах.Количество;
			КонецЦикла;	
			
			НоваяСтрока.КоличествоОстаток = НоваяСтрока.Количество - КоличествоРазмещено;

		КонецЦикла;

		ДанныеФормированияМиксПалеты = ОбработкаОбъект.ФормированиеМикспалетыЗапрещено(ДокументСсылка.Контрагент, ЭКОМ_Документ_ORDER);
		Если ДанныеФормированияМиксПалеты.Тандер И ДанныеФормированияМиксПалеты.ФормированиеЗапрещено Тогда
			ФормированиеМикспалетыЗапрещено = Истина;
		КонецЕсли;
		Элементы.ГруппаПредупреждение.Видимость = ФормированиеМикспалетыЗапрещено;
		Элементы.ТоварыНаПалетахНомерПалета.ТолькоПросмотр = ФормированиеМикспалетыЗапрещено;
		
	КонецЕсли;
				
	ДанныеПоТранспорту = ОбработкаОбъект.ЭКОМ_ТранспортнаяИнформация_РегСв_Прочитать(ЭтаФорма.ДокументСсылка);
	Если ДанныеПоТранспорту.СведенияЕсть = Истина Тогда
		ЭтаФорма.НомерТТН = ДанныеПоТранспорту.НомерТТН;
	КонецЕсли;	
		 
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.НомерТТН) Тогда		
		ЭтаФорма.НомерТТН = СокрЛП(ДокументСсылка.Номер);		
	КонецЕсли;
	
	// Итоговая таблица (PACKINGSEQUENCE)
	ТЗ_Палеты = ТЧТоварыНаПалетах.Скопировать();
	ТЗ_Палеты.Свернуть("НомерПалета,SSCC,Объем,Европаллета,Высота,МестоДоставкиУпаковки", "Количество,ВесНетто,ВесБрутто");
	ТЗ_Палеты.Колонки.Добавить("НомерПалетаЧисло");
	Для каждого Стр из ТЗ_Палеты цикл
		Стр.НомерПалетаЧисло = ОбработкаОбъект.ЭКОМ_ПреобразоватьВЧисло(Стр.НомерПалета); // переписываем информацию из расчетной колонки во временную таблицу
	КонецЦикла;
	ТЗ_Палеты.Сортировать("НомерПалетаЧисло");
	ЗначениеВРеквизитФормы(ТЗ_Палеты, "ТаблицаПалеты");
	
	Если НЕ ОбработкаОбъект.ПолучитьДоступностьApiПоСтране() Тогда 
		Элементы.SSCC_ПолучатьОнлайн.Видимость = Ложь;	
	Иначе	
		SSCC_ПолучатьОнлайн = Истина; 
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура КомандаСгенерироватьНомераПалетНаСервере(ТекстПредупреждения)

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    Если ЗначениеЗаполнено(ДокументСсылка) Тогда
   
        Если ЗначениеЗаполнено(ДокументСсылка.Организация) = Ложь Тогда
        	ТекстПредупреждения = "Не заполнен Организация в документе";
            Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДокументСсылка.Контрагент) = Ложь Тогда
        	ТекстПредупреждения = "Не заполнен Контрагент в документе";
            Возврат;
		КонецЕсли;
		
    Иначе
        ТекстПредупреждения = "Не заполнен документ";
        Возврат;
    КонецЕсли;
	
	СведенияОбОрганизации = ОбработкаОбъект.ЭКОМ_GLN_Прочитать(ДокументСсылка.Организация);	
	Если СведенияОбОрганизации.СведенияЕсть Тогда
	    GLN_Организации = СведенияОбОрганизации.GLN;
	Иначе
        ТекстПредупреждения = "Не заполнен GLN для организации: " + Строка(ДокументСсылка.Организация) + ". Он требуется для генерации SSCC кодов";
        Возврат;
	КонецЕсли;
	
	СведенияОКонтрагенте = ОбработкаОбъект.ЭКОМ_GLN_Прочитать(ДокументСсылка.Контрагент);	
	Если СведенияОКонтрагенте.СведенияЕсть Тогда
	    GLN_Контрагента = СведенияОКонтрагенте.GLN;
	Иначе
        ТекстПредупреждения = "Не заполнен GLN для контрагента: " + Строка(ДокументСсылка.Контрагент) + ". Он требуется для генерации SSCC кодов";
        Возврат;
	КонецЕсли;
	
	ТЧПалеты     = ЭтаФорма.ТаблицаПалеты; 
    Если ТЧПалеты.Количество() = 0 Тогда
        ОбновитьТЧПалеты();
	КонецЕсли;
	
	Если ПустаяСтрока(GLN_Организации) Тогда
        ТекстПредупреждения = "Не заполнен GLN для организации: " + Строка(ДокументСсылка.Организация) + ". Он требуется для генерации SSCC кодов";
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(GLN_Контрагента) Тогда
        ТекстПредупреждения = "Не заполнен GLN для контрагента: " + Строка(ДокументСсылка.Контрагент) + ". Он требуется для генерации SSCC кодов";
		Возврат;
	КонецЕсли;
	
	Если ФормированиеМикспалетыЗапрещено Тогда // Тандер
		Для Каждого Палета Из ТаблицаПалеты Цикл
			СтруктураПоиска = Новый Структура("НомерПалета", Палета.НомерПалета);
			СтрокиПоНомеруПалеты = ТоварыНаПалетах.НайтиСтроки(СтруктураПоиска);
			Если СтрокиПоНомеруПалеты.Количество() > 1 Тогда
				ТекстПредупреждения = "Формирование микспалеты запрещено. Распределите товар по одному на палете.";
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТЧПалетыПром = ЭтаФорма.ТаблицаПалеты.Выгрузить();	
	ОбработкаОбъект.ЗаполнитьТалицуНовымиSSCC(ДокументСсылка, GLN_Организации, GLN_Контрагента, ТЧПалетыПром, SSCC_ПолучатьОнлайн, ДокументСсылка.Организация);
    ЭтаФорма.ТаблицаПалеты.Загрузить(ТЧПалетыПром);
			
	Для Каждого стрТекПалет Из ЭтаФорма.ТоварыНаПалетах Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("НомерПалета",стрТекПалет.НомерПалета);
		
		НайденныеСуществующиеНомера = ТЧПалеты.НайтиСтроки(Отбор);
		Для Каждого найденная из НайденныеСуществующиеНомера Цикл
			стрТекПалет.SSCC = найденная.SSCC;
		КонецЦикла;
		
	КонецЦикла;	
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСгенерироватьКодыПаллет(Команда)
	
	ТекстПредупреждения = "";
	КомандаСгенерироватьНомераПалетНаСервере(ТекстПредупреждения);
    Если НЕ ПустаяСтрока(ТекстПредупреждения) Тогда
        Сообщить(ТекстПредупреждения);
    КонецЕсли;
	ЗаписатьПалеттыНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНовыйSSCC_Сервер(Организация, ДатаДок, GLN_SUPPLIER, МассивПалеты)
	
	ТЧПалеты = Новый ТаблицаЗначений;
	
	Для каждого СтрМ Из МассивПалеты Цикл
		
		ТЧПалеты.Колонки.Добавить(СтрМ.Ключ);
		
		ТЧПалеты[СтрМ.Ключ] = СтрМ.Значение;
	
	КонецЦикла;

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Результат = ОбработкаОбъект.НовыйSSCC(ДокументСсылка.Организация, Год(ДокументСсылка.Дата), GLN_SUPPLIER, ТЧПалеты);

    ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");	

	Возврат Результат;
	
КонецФункции 

&НаКлиенте
Процедура ТоварыНаПалетахПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
		
	Если Копирование Тогда
		ТекСтрока = Элементы.ТоварыНаПалетах.ТекущиеДанные;
		Если ТекСтрока = Неопределено Тогда
			Сообщить("Не выбрана строка копирования");
		КонецЕсли;
	Иначе	
		ТекСтрока = Элементы.СписокТовары.ТекущиеДанные;
		Если ТекСтрока = Неопределено Тогда
			Сообщить("Выберите номенклатуру, которою необходимо закрепить за палетом");
		КонецЕсли;	
	КонецЕсли;
		
	КоличествоОстаток = ПолучитьСвободноеКоличествоПоПаллетам(ТекСтрока);
	Если КоличествоОстаток <= 0 Тогда
		Отказ = Истина;
		Сообщить("Номенклатура " + СокрЛП(ТекСтрока.Номенклатура) + " по ключевой строке " + СокрЛП(ТекСтрока.Ключ_Строки) + " полностью размещена на палетах");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыНаПалетахПослеУдаления(Элемент)
	
	ОбновитьТЧПалеты();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТЧПалеты()
		
	//ТекущиеНомераПалет = ЭтаФорма.ТоварыНаПалетах.Выгрузить();
	//ТекущиеНомераПалет.Свернуть("НомерПалета,SSCC", "Количество, ВесНеттоШтуки, ВесБруттоШтуки");	
	//	
	//НаборПаллет = РегистрыСведений.ЭКОМ_Палеты.СоздатьНаборЗаписей();
	//НаборПаллет.Отбор.Документ.Установить(ЭтаФорма.ДокументСсылка);
	//НаборПаллет.Прочитать();
	//НаборПаллетТЗ = НаборПаллет.Выгрузить();
	//
	//ТаблицаПалеты.Очистить();
	//Для каждого стр из ТекущиеНомераПалет Цикл
	//	
	//	НоваяСтрока = ТаблицаПалеты.Добавить();
	//	НоваяСтрока.НомерПалета = стр.НомерПалета;
	//	НоваяСтрока.SSCC        = стр.SSCC;
	//	НоваяСтрока.ВесНетто    = стр.ВесНеттоШтуки*стр.Количество;
	//	НоваяСтрока.ВесБрутто   = стр.ВесБруттоШтуки*стр.Количество;
	//	НоваяСтрока.Количество  = стр.Количество;
	//	НоваяСтрока.МестоДоставкиУпаковки = ЭтаФорма.МестоДоставкиУпаковки; // По умолчанию точка доставки GLN
	//	
	//	Если НаборПаллетТЗ.Количество() > 0 Тогда
	//		Строка = НаборПаллетТЗ.Найти(стр.НомерПалета, "НомерПалета");
	//		Если НЕ Строка = Неопределено  Тогда
	//			НоваяСтрока.Европаллета           = Строка.Европаллета;
	//			НоваяСтрока.Объем                 = Строка.Объем;
	//			НоваяСтрока.Высота                = Строка.Высота;
	//			Если ЗначениеЗаполнено(Строка.МестоДоставкиУпаковки) Тогда
	//			     НоваяСтрока.МестоДоставкиУпаковки = Строка.МестоДоставкиУпаковки;
	//			КонецЕсли;
	//		КонецЕсли;
	//	
	//	КонецЕсли;
	//КонецЦикла;	
	
	//Docrobot 1.20.0 MOD-1293 [Перенос целиком процедуры из внешней обработки (закреплена в задаче)]

	//---	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	#Область ТекстЗапроса
		"ВЫБРАТЬ
		|	ТоварыНаПалетах.Номенклатура КАК Номенклатура,
		|	ТоварыНаПалетах.ВесНеттоШтуки КАК ВесНеттоШтуки,
		|	ТоварыНаПалетах.ВесБруттоШтуки КАК ВесБруттоШтуки,
		|	ТоварыНаПалетах.Количество КАК Количество,
		|	ТоварыНаПалетах.Единица_Измерения КАК Единица_Измерения,
		|	ТоварыНаПалетах.Ключ_Строки КАК Ключ_Строки,
		|	ТоварыНаПалетах.НомерПалета КАК НомерПалета,
		|	ТоварыНаПалетах.SSCC КАК SSCC,
		|	ТоварыНаПалетах.ТемператураХранения КАК ТемператураХранения,
		|	ТоварыНаПалетах.СрокХраненияВДнях КАК СрокХраненияВДнях,
		|	ТоварыНаПалетах.ЗаводПроизводитель КАК ЗаводПроизводитель,
		|	ТоварыНаПалетах.ДатаПроизводства КАК ДатаПроизводства,
		|	ТоварыНаПалетах.ДатаОкончанияСрокаГодности КАК ДатаОкончанияСрокаГодности
		|ПОМЕСТИТЬ ВТ_ТоварыНаПалетах
		|ИЗ
		|	&тзТоварыНаПалетах КАК ТоварыНаПалетах
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭКОМ_Палеты.Документ КАК Документ,
		|	ЭКОМ_Палеты.Номенклатура КАК Номенклатура,
		|	ЭКОМ_Палеты.НомерПалета КАК НомерПалета,
		|	ЭКОМ_Палеты.SSCC КАК SSCC,
		|	ЭКОМ_Палеты.ВесБрутто КАК ВесБрутто,
		|	ЭКОМ_Палеты.ВесНетто КАК ВесНетто,
		|	ЭКОМ_Палеты.Высота КАК Высота,
		|	ЭКОМ_Палеты.Европаллета КАК Европаллета,
		|	ЭКОМ_Палеты.Единица_Измерения КАК Единица_Измерения,
		|	ЭКОМ_Палеты.Ключ_Строки КАК Ключ_Строки,
		|	ЭКОМ_Палеты.Количество КАК Количество,
		|	ЭКОМ_Палеты.МестоДоставкиУпаковки КАК МестоДоставкиУпаковки,
		|	ЭКОМ_Палеты.Объем КАК Объем,
		|	ЭКОМ_Палеты.ТемператураХранения КАК ТемператураХранения,
		|	ЭКОМ_Палеты.СрокХраненияВДнях КАК СрокХраненияВДнях,
		|	ЭКОМ_Палеты.ЗаводПроизводитель КАК ЗаводПроизводитель,
		|	ЭКОМ_Палеты.ДатаПроизводства КАК ДатаПроизводства,
		|	ЭКОМ_Палеты.ДатаОкончанияСрокаГодности КАК ДатаОкончанияСрокаГодности
		|ПОМЕСТИТЬ ВТ_НаборПалет
		|ИЗ
		|	РегистрСведений.ЭКОМ_Палеты КАК ЭКОМ_Палеты
		|ГДЕ
		|	ЭКОМ_Палеты.Документ = &Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_ТоварыНаПалетах.Количество) КАК Количество,
		|	ВТ_ТоварыНаПалетах.НомерПалета КАК НомерПалета,
		|	ВТ_ТоварыНаПалетах.SSCC КАК SSCC
		|ПОМЕСТИТЬ ВТ_ОбщееКоличество
		|ИЗ
		|	ВТ_ТоварыНаПалетах КАК ВТ_ТоварыНаПалетах
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТоварыНаПалетах.НомерПалета,
		|	ВТ_ТоварыНаПалетах.SSCC
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_ТоварыНаПалетах.ВесНеттоШтуки * ВТ_ТоварыНаПалетах.Количество) КАК ВесНетто,
		|	СУММА(ВТ_ТоварыНаПалетах.ВесБруттоШтуки * ВТ_ТоварыНаПалетах.Количество) КАК ВесБрутто,
		|	ВТ_ТоварыНаПалетах.НомерПалета КАК НомерПалета,
		|	ВТ_ТоварыНаПалетах.SSCC КАК SSCC
		|ПОМЕСТИТЬ ВТ_ВесБруттоНетто
		|ИЗ
		|	ВТ_ТоварыНаПалетах КАК ВТ_ТоварыНаПалетах
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТоварыНаПалетах.SSCC,
		|	ВТ_ТоварыНаПалетах.НомерПалета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		|	ВТ_ОбщееКоличество.НомерПалета КАК НомерПалета,
		|	ВТ_ОбщееКоличество.SSCC КАК SSCC,
		|	ВТ_ОбщееКоличество.Количество КАК Количество,
		|	ВТ_ВесБруттоНетто.ВесНетто КАК ВесНетто,
		|	ВТ_ВесБруттоНетто.ВесБрутто КАК ВесБрутто
		|ПОМЕСТИТЬ ВТ_ВсеПоТЗ
		|ИЗ
		|	ВТ_ОбщееКоличество КАК ВТ_ОбщееКоличество
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВесБруттоНетто КАК ВТ_ВесБруттоНетто
		|		ПО ВТ_ОбщееКоличество.НомерПалета = ВТ_ВесБруттоНетто.НомерПалета
		|			И ВТ_ОбщееКоличество.SSCC = ВТ_ВесБруттоНетто.SSCC
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ВсеПоТЗ.НомерПалета КАК НомерПалета,
		|	ВТ_ВсеПоТЗ.SSCC КАК SSCC,
		|	ВТ_ВсеПоТЗ.Количество КАК Количество,
		|	ВТ_ВсеПоТЗ.ВесНетто КАК ВесНетто,
		|	ВТ_ВсеПоТЗ.ВесБрутто КАК ВесБрутто,
		|	ВТ_НаборПалет.Европаллета КАК Европаллета,
		|	ВТ_НаборПалет.Объем КАК Объем,
		|	ВТ_НаборПалет.Высота КАК Высота,
		|	ВТ_НаборПалет.МестоДоставкиУпаковки КАК МестоДоставкиУпаковки
		|ИЗ
		|	ВТ_ВсеПоТЗ КАК ВТ_ВсеПоТЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НаборПалет КАК ВТ_НаборПалет
		|		ПО ВТ_ВсеПоТЗ.НомерПалета = ВТ_НаборПалет.НомерПалета";
	#КонецОбласти
	
	ТаблицаПалеты.Очистить();	
	
	Запрос.УстановитьПараметр("тзТоварыНаПалетах", ЭтаФорма.ТоварыНаПалетах.Выгрузить());		
	Запрос.УстановитьПараметр("Документ", ЭтаФорма.ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаПалеты.Добавить();
		НоваяСтрока.НомерПалета = Выборка.НомерПалета;
		НоваяСтрока.SSCC        = Выборка.SSCC; 		
		НоваяСтрока.ВесНетто    = Выборка.ВесНетто;
		НоваяСтрока.ВесБрутто   = Выборка.ВесБрутто;		
		НоваяСтрока.Количество  = Выборка.Количество;
		НоваяСтрока.Европаллета = Выборка.Европаллета;
		НоваяСтрока.Объем       = Выборка.Объем;
		НоваяСтрока.Высота      = Выборка.Высота;
		Если ЗначениеЗаполнено(Выборка.МестоДоставкиУпаковки) Тогда
			НоваяСтрока.МестоДоставкиУпаковки = Выборка.МестоДоставкиУпаковки;
		Иначе
			НоваяСтрока.МестоДоставкиУпаковки = ЭтаФорма.МестоДоставкиУпаковки; // По умолчанию точка доставки GLN			
		КонецЕсли;
	КонецЦикла;
	
	//Docrobot 1.20.0 MOD-1293


	
	СортироватьТаблицаПалеты();
    
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНаПалетахПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Если ЗначениеЗаполнено(Элементы.ТоварыНаПалетах.ТекущиеДанные.НомерПалета) Тогда
			НомерПаллеты = ЭКОМ_ОбщегоНазначенияКлиент.ЭКОМ_ПреобразоватьВЧислоОбщегоНазначения(Элементы.ТоварыНаПалетах.ТекущиеДанные.НомерПалета) + 1;
			Количество = ПолучитьСвободноеКоличествоПоПаллетам(Элементы.ТоварыНаПалетах.ТекущиеДанные, НоваяСтрока);
			ДобавитьСтрокуВТоварыНаПалетах(Элемент.ТекущиеДанные, Элементы.ТоварыНаПалетах.ТекущиеДанные, Количество, НомерПаллеты);
		КонецЕсли;
	КонецЕсли;

	ОбновитьОтображениеДанных(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНаПалетахПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если Элемент.ТекущиеДанные = Неопределено 
		ИЛИ Элемент.ТекущаяСтрока = Неопределено Тогда
    	Возврат;
	КонецЕсли;

	ТекСтрокаНоменклатура = Элемент.ТекущиеДанные;
	
	КоличествоОстаток = ПолучитьСвободноеКоличествоПоПаллетам(ТекСтрокаНоменклатура);
	Если КоличествоОстаток <= 0 Тогда
		ТекСтрокаНоменклатура.Количество = ТекСтрокаНоменклатура.Количество + КоличествоОстаток;
	КонецЕсли;
	
	ТекСтрокаНоменклатура.SSCC = ПолучитьТекСтрокаНоменклатура_SSCC(ТекСтрокаНоменклатура.НомерПалета);
	
	ОбновитьТЧПалеты();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекСтрокаНоменклатура_SSCC(НомерПалета)

	ТЧПалеты = ЭтаФорма.ТаблицаПалеты.Выгрузить();
	НайденнаяСтрока_НомераПалет = ТЧПалеты.Найти(НомерПалета, "НомерПалета");
	
	Если НайденнаяСтрока_НомераПалет <> Неопределено Тогда
		Результат = НайденнаяСтрока_НомераПалет.SSCC;
	Иначе
		Результат = "";
	КонецЕсли;	

	Возврат Результат;
	
КонецФункции 

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы = Ложь 
		ИЛИ ЗавершениеРаботы = Неопределено Тогда
	     ЗаписатьПалеттыНаСервере();
		 
		 ПараметрыОповещения = Новый Структура;
		 ПараметрыОповещения.Вставить("ФормаДляОповещения", "Обработка.УФ_Форма");
		 Оповестить("ОбновитьСписокЭТРН", ПараметрыОповещения);
		 
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПалеттыНаСервере()
	
	ОбщаяТаблицаПаллет = ЭтаФорма.ТаблицаПалеты.Выгрузить();
	ПаллетыПоТоварам   = ЭтаФорма.ТоварыНаПалетах.Выгрузить();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаписатьПалетты(ОбщаяТаблицаПаллет, ПаллетыПоТоварам, ЭтаФорма.ДокументСсылка);	
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("НомерТТН", ЭтаФорма.НомерТТН);
    ОбработкаОбъект.ЭКОМ_ТранспортнаяИнформация_РегСв_Записать(ЭтаФорма.ДокументСсылка, СтруктураДанных);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьSSCCНаСервере()
    тзПаллеты = ТаблицаПалеты.Выгрузить();
    тзПаллеты.ЗаполнитьЗначения("", "SSCC");
    ТаблицаПалеты.Загрузить(тзПаллеты);
    
    тзПаллеты = ТоварыНаПалетах.Выгрузить();
    тзПаллеты.ЗаполнитьЗначения("", "SSCC");
    ТоварыНаПалетах.Загрузить(тзПаллеты);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьSSCC(Команда)
    ОчиститьSSCCНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНаПалетахПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено 
		ИЛИ Элемент.ТекущаяСтрока = Неопределено Тогда
    	Возврат;
	КонецЕсли;
	
	//// В ТЧ Документа
	//НайденнаяСтрока = ЭтаФорма.СписокТовары.Найти(Элемент.ТекущиеДанные.Номенклатура, "Номенклатура");
	//Если НЕ НайденнаяСтрока = Неопределено Тогда
	//     Элементы.СписокТовары.ТекущаяСтрока = НайденнаяСтрока;	
	//КонецЕсли;
	// 
	//// В паллетах 
	//НайденнаяСтрока = ЭтаФорма.ТаблицаПалеты.Найти(Элемент.ТекущиеДанные.НомерПалета, "НомерПалета");
	//Если НЕ НайденнаяСтрока = Неопределено Тогда
	//     Элементы.ТаблицаПалеты.ТекущаяСтрока = НайденнаяСтрока;	
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПаллеты(Команда)
	
	СписокДокументов = ПолучитьВыбранныеСтроки();
	
	СписокНомеровПаллет = Новый СписокЗначений;
	Для каждого Стр Из ЭтаФорма.ТоварыНаПалетах Цикл
		СписокНомеровПаллет.Добавить(ЭКОМ_ОбщегоНазначенияКлиент.ЭКОМ_ПреобразоватьВЧислоОбщегоНазначения(Стр.НомерПалета), Стр.НомерПалета);	
	КонецЦикла;
	
	Если СписокНомеровПаллет.Количество() = 0 Тогда
	     НомерПаллета = 1;
		
	Иначе	
	     СписокНомеровПаллет.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
		 ТекущийНомерПаллета = СписокНомеровПаллет.Получить(0).Значение;
		 НомерПаллета        = ТекущийНомерПаллета + 1;

	КонецЕсли;
	
	Для Каждого СтрТЧ Из СписокДокументов Цикл 		
	
			Количество = ПолучитьСвободноеКоличествоПоПаллетам(СтрТЧ);
			Если Количество > 0 Тогда
							 
			     ДобавитьСтрокуВТоварыНаПалетах(ЭтаФорма.ТоварыНаПалетах.Добавить(), СтрТЧ, Количество, НомерПаллета);
                 НомерПаллета = НомерПаллета + 1;
				 
			КонецЕсли;
			СтрТЧ.КоличествоОстаток = СтрТЧ.КоличествоОстаток - Количество;
			
	КонецЦикла;
	
	ОбновитьТЧПалеты();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеСнятьВсе(Команда)
	
	Если Элементы.СписокТовары.ВыделенныеСтроки.Количество() > 1 Тогда
		Для Каждого СтрТЧ Из Элементы.СписокТовары.ВыделенныеСтроки Цикл 		
			
			СтрТЧ.Отметка = Команда.Имя = "УстановитьВсе";	
			
		КонецЦикла;	
	Иначе	
		Для Каждого СтрТЧ Из СписокТовары Цикл 		
			
			СтрТЧ.Отметка = Команда.Имя = "УстановитьВсе";	
			
		КонецЦикла;
	КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСвободноеКоличествоПоПаллетам(ТекущаяСтрока, НоваяСтрока = Ложь)
	
	СтруктураОтбор = Новый Структура;
	СтруктураОтбор.Вставить("Номенклатура"     , ТекущаяСтрока.Номенклатура);
	//Docrobot 1.20.0 MOD-1481 [Добавлены Характеристика и Серия]
	СтруктураОтбор.Вставить("Характеристика"     , ТекущаяСтрока.Характеристика);
	СтруктураОтбор.Вставить("Серия"     , ТекущаяСтрока.Серия);
	СтруктураОтбор.Вставить("Ключ_Строки"      , ТекущаяСтрока.Ключ_Строки);
	СтруктураОтбор.Вставить("Единица_Измерения", ТекущаяСтрока.Единица_Измерения);
	
	ТекущаяСтрокаНоменклатуры = Неопределено;
	КоличествоНоменклатурыВсего = 0;
	Для каждого Строка Из ЭтаФорма.СписокТовары Цикл
	            Если Строка.Ключ_Строки = ТекущаяСтрока.Ключ_Строки Тогда
				     КоличествоНоменклатурыВсего = КоличествоНоменклатурыВсего + Строка.Количество;
					 ТекущаяСтрокаНоменклатуры   = Строка;
		        КонецЕсли;
	КонецЦикла;
	
	КоличествоОстатокДляРазмещения = 0;
	Если НоваяСтрока Тогда	
		Если НЕ ТекущаяСтрокаНоменклатуры = Неопределено Тогда
			КоличествоОстатокДляРазмещения = ТекущаяСтрокаНоменклатуры.КоличествоОстаток;
		КонецЕсли;
		
	Иначе
		НайденныеСтроки_НаПалетах = ЭтаФорма.ТоварыНаПалетах.НайтиСтроки(СтруктураОтбор);	
		КоличествоРазмещено = 0;
		Для каждого стр_НаПалетах из НайденныеСтроки_НаПалетах Цикл
			КоличествоРазмещено = КоличествоРазмещено + стр_НаПалетах.Количество;
		КонецЦикла;	
		
		// Количество остаток которое можно разместить
		КоличествоОстатокДляРазмещения = КоличествоНоменклатурыВсего - КоличествоРазмещено;
		//ИзменитьСтрокуСпискаТоваров();
		Если НЕ ТекущаяСтрокаНоменклатуры = Неопределено Тогда
			// Если разместить то останется
			ТекущаяСтрокаНоменклатуры.КоличествоОстаток = КоличествоОстатокДляРазмещения;	
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат КоличествоОстатокДляРазмещения;
	
КонецФункции	

&НаКлиенте
Процедура ДобавитьСтрокуВТоварыНаПалетах(НоваяСтрока, ТекущаяСтрока, Количество, НомерПаллета = Неопределено)
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	НоваяСтрока.Количество = Макс(Количество, 0);
	
	Если НЕ НомерПаллета = Неопределено Тогда
	     НоваяСтрока.НомерПалета = Строка(НомерПаллета);
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает выбранные пользователем строки табличной части. В качестве метода выбора 
// приоритетом является установка флажков в необходимых строках. Если флажки не установлены,
// функция возвращает выделенные строки.
//
// Параметры:
//  ИмяТабличнойЧасти  - Строка - имя таблицы, с которой работает пользователь
//
// Возвращаемое значение:
//   Массив, ВыделенныеСтрокиТабличногоПоля   - коллекция выбранных пользователем строк табличной части
//
&НаКлиенте
Функция ПолучитьВыбранныеСтроки()
	
	ВыгружаемыеДанныеВыделения = Новый Массив;
	ВыбранныеСтроки = ЭтаФорма.СписокТовары.НайтиСтроки(Новый Структура("Отметка", Истина));
	
	Если ВыбранныеСтроки.Количество() = 0 Тогда
		
		Для каждого текВыделеннаяСтрока Из Элементы.СписокТовары.ВыделенныеСтроки Цикл
			ВыбраннаяСтрока = Элементы.СписокТовары.ДанныеСтроки(текВыделеннаяСтрока);
			ВыгружаемыеДанныеВыделения.Добавить(ВыбраннаяСтрока);
		КонецЦикла;
		
	Иначе
		ВыгружаемыеДанныеВыделения = ВыбранныеСтроки;
	КонецЕсли;
	
	Возврат ВыгружаемыеДанныеВыделения;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы = Истина Тогда
		ТекстПредупреждения = "Необходимо закрыть форму паллет";
		Отказ = Истина;
	Иначе
		
		Если ЭтаФорма.ЗакрытьФормуПринудительно = Ложь Тогда
			
			ПустойКодПаллета = Ложь;
			Для каждого Стр Из ЭтаФорма.ТаблицаПалеты Цикл
				Если НЕ ЗначениеЗаполнено(Стр.SSCC) Тогда
					ПустойКодПаллета = Истина;
				КонецЕсли;
			КонецЦикла;
			
			Если ПустойКодПаллета = Истина Тогда
				
				Данные     = Новый Структура;
				Данные.Вставить("Отказ", Отказ);
				Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтаФорма, Данные); 		
				ПоказатьВопрос(Оповещение, "Не сформирован код для паллет. Закрыть форму?", РежимДиалогаВопрос.ДаНетОтмена, 0);
				Отказ = Истина;
				
			КонецЕсли;		
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, Данные) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да  Тогда
		ЭтаФорма.ЗакрытьФормуПринудительно = Истина;
		ЭтаФорма.Закрыть();	   
	ИначеЕсли  Результат = КодВозвратаДиалога.Нет Тогда
		Данные.Отказ = Истина;
		Возврат;
	Иначе
		Данные.Отказ = Истина;
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьНаОднуПаллету(Команда)
	
	СписокДокументов = ПолучитьВыбранныеСтроки();
	
	Если ФормированиеМикспалетыЗапрещено И СписокДокументов.Количество() > 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Формирование микспаллеты запрещено!");
		Возврат;
	КонецЕсли;
	
	СписокНомеровПаллет = Новый СписокЗначений;
	Для каждого Стр Из ЭтаФорма.ТоварыНаПалетах Цикл
		СписокНомеровПаллет.Добавить(ЭКОМ_ОбщегоНазначенияКлиент.ЭКОМ_ПреобразоватьВЧислоОбщегоНазначения(Стр.НомерПалета), Стр.НомерПалета);	
	КонецЦикла;
	
	Если СписокНомеровПаллет.Количество() = 0 Тогда
		НомерПаллета = 1;
	Иначе	
		СписокНомеровПаллет.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
		ТекущийНомерПаллета = СписокНомеровПаллет.Получить(0).Значение;
		НомерПаллета        = ТекущийНомерПаллета + 1;
	КонецЕсли;
	
	Для Каждого СтрТЧ Из СписокДокументов Цикл 		
		
		Количество = ПолучитьСвободноеКоличествоПоПаллетам(СтрТЧ);
		Если Количество > 0 Тогда
			
			ДобавитьСтрокуВТоварыНаПалетах(ЭтаФорма.ТоварыНаПалетах.Добавить(), СтрТЧ, Количество, НомерПаллета);
			
		КонецЕсли;
		СтрТЧ.КоличествоОстаток = СтрТЧ.КоличествоОстаток - Количество;
		
	КонецЦикла;
	
	ОбновитьТЧПалеты();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНаПалетахПередУдалением(Элемент, Отказ)
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
		
		ТекСтрПаллеты = Элемент.ТекущиеДанные;
		
		//СтруктураОтбор = Новый Структура;
		//СтруктураОтбор.Вставить("Номенклатура"     , ТекСтрПаллеты.Номенклатура);
		//СтруктураОтбор.Вставить("Ключ_Строки"      , ТекСтрПаллеты.Ключ_Строки);
		//СтруктураОтбор.Вставить("Единица_Измерения", ТекСтрПаллеты.Единица_Измерения);
		//
		//НайденныеСтроки_НаПалетах = ЭтаФорма.ТоварыНаПалетах.НайтиСтроки(СтруктураОтбор);	
		//КоличествоРазмещеноОсвободившееся = 0;
		//Для каждого стр_НаПалетах из НайденныеСтроки_НаПалетах Цикл
		//	КоличествоРазмещеноОсвободившееся = КоличествоРазмещеноОсвободившееся + стр_НаПалетах.Количество;
		//КонецЦикла;
		
		ТекСтрНоменклатурыСписка = Неопределено;
		Для каждого СтрокаСписка Из ЭтаФорма.СписокТовары Цикл
			Если СтрокаСписка.Ключ_Строки = ТекСтрПаллеты.Ключ_Строки Тогда
				ТекСтрНоменклатурыСписка = СтрокаСписка;
			КонецЕсли;
		КонецЦикла;

		Если НЕ ТекСтрНоменклатурыСписка = Неопределено Тогда
			ТекСтрНоменклатурыСписка.КоличествоОстаток = ТекСтрНоменклатурыСписка.КоличествоОстаток + ТекСтрПаллеты.Количество;	
		КонецЕсли;
				
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПалетыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
	     СтарыйКодSSCC = Элемент.ТекущиеДанные.SSCC;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПалетыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
	 
	     НовыйКодSSCC = Элемент.ТекущиеДанные.SSCC;	
		 
		 ПараметрыОтбора = Новый Структура;
		 ПараметрыОтбора.Вставить("SSCC", СтарыйКодSSCC);
		 
		 НайденныеСтроки_НаПалетах = ЭтаФорма.ТоварыНаПалетах.НайтиСтроки(ПараметрыОтбора);	
		 Для каждого Стр Из НайденныеСтроки_НаПалетах Цикл
		      Стр.SSCC = НовыйКодSSCC;
		 КонецЦикла;
		 		 
	 КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоКоличеству(Команда)
	
	ТекСтрокаПаллеты = Элементы.ТоварыНаПалетах.ТекущиеДанные;
	Если ТекСтрокаПаллеты = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрана строка для распределения";
		Сообщение.Сообщить();
	Иначе
		КоличествоОстаток = ПолучитьСвободноеКоличествоПоПаллетам(ТекСтрокаПаллеты);
		КоличествоРаспределений = Цел(КоличествоОстаток/ТекСтрокаПаллеты.Количество); 
		Пакеты = Новый Массив;
		Для н=1 По КоличествоРаспределений Цикл
			Пакеты.Добавить(ТекСтрокаПаллеты.Количество);
		КонецЦикла;	
		ОстатокОтЧасти = КоличествоОстаток%ТекСтрокаПаллеты.Количество;
		Если НЕ ОстатокОтЧасти = 0 Тогда
			Пакеты.Добавить(ОстатокОтЧасти);
		КонецЕсли;
		
		НомерПалета = ЭКОМ_ОбщегоНазначенияКлиент.ЭКОМ_ПреобразоватьВЧислоОбщегоНазначения(ТекСтрокаПаллеты.НомерПалета);
		Для каждого СтрПакета Из Пакеты Цикл
			НомерПалета = НомерПалета + 1;
			ПакетРаспределен = Ложь;
			Пока Не ПакетРаспределен Цикл
				Если ФормированиеМикспалетыЗапрещено Тогда
					СтрокиПалета = ТоварыНаПалетах.НайтиСтроки(Новый Структура("НомерПалета", Строка(НомерПалета)));
					Если СтрокиПалета.Количество() > 0 Тогда
						НомерПалета = НомерПалета + 1;
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
				Элементы.ТоварыНаПалетах.ДобавитьСтроку();
				ДобавитьСтрокуВТоварыНаПалетах(Элементы.ТоварыНаПалетах.ТекущиеДанные, ТекСтрокаПаллеты, СтрПакета, НомерПалета);
				ПакетРаспределен = Истина;
			КонецЦикла;	
		КонецЦикла;
		
		ОбновитьОтображениеДанных();
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура СортироватьТаблицаПалеты()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ТабЧасть = ТаблицаПалеты.Выгрузить(); // создаем временную таблицу
	ТабЧасть.Колонки.Добавить("НомерПалетаЧисло"); // добавляем в нее нужную колонку
	
	Для каждого Стр из ТабЧасть цикл
		Стр.НомерПалетаЧисло = ОбработкаОбъект.ЭКОМ_ПреобразоватьВЧисло(Стр.НомерПалета); // переписываем информацию из расчетной колонки во временную таблицу
	КонецЦикла;
	
	ТабЧасть.Сортировать("НомерПалетаЧисло"); // Сортируем временную таблицу по нужной колонке
	ТаблицаПалеты.Загрузить(ТабЧасть); // Загружаем временную таблицу в табличную часть

КонецПроцедуры

&НаСервере
Функция ЗаполнитьМакетШК_ПаллетыНаСервере(МассивЛогаСобытий)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ЗаполнитьМакетШК_Паллеты(ДокументСсылка, ТаблицаПалеты, МассивЛогаСобытий);
	
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	
	Если Модифицированность Тогда
		ЗаписатьПалеттыНаСервере();
		Модифицированность = Ложь;
	КонецЕсли;
	
	МассивЛогаСобытий = Новый Массив;
	
	ТабДок = ЗаполнитьМакетШК_ПаллетыНаСервере(МассивЛогаСобытий);
	Если НЕ ТабДок = Неопределено Тогда
		ТабДок.Показать("Этикетка палет");
	КонецЕсли;
	
	Если НЕ ЭтаФорма.ВладелецФормы = Неопределено Тогда
		ЭтаФорма.ВладелецФормы.ОтобразитьЛогСобытий(МассивЛогаСобытий);
	КонецЕсли;
	
КонецПроцедуры