#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение () Экспорт
	
	ЗаполнитьСправочникДоходыНеПодлежащиеНалогообложениюЧастично();
	
	РегистрыСведений.РазмерыДоходовНеПодлежащихНалогообложениюЧастично.НачальноеЗаполнение();
	
КонецПроцедуры

Процедура ЗаполнитьСправочникДоходыНеПодлежащиеНалогообложениюЧастично() Экспорт
	
   	ОписаниеЭлемента = ОписаниеЭлементаДоходаНеПодлежащегоНалогообложениюЧастично();
	ОписаниеЭлемента.Наименование = "Пп. 11 п. 1 ст. 341 (выигрыши по лотере)";
	ОписаниеЭлемента.РазмерНеоблагаемогоДохода = 0.5; //...50 процентов от минимального размера заработной платы
	ОписаниеЭлемента.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца;
	ОписаниеЭлемента.НеИспользуется = Ложь;
	СоздатьЭлементДоходаНеПодлежащегоНалогообложениюЧастично(ОписаниеЭлемента);
	
   	ОписаниеЭлемента = ОписаниеЭлементаДоходаНеПодлежащегоНалогообложениюЧастично();
	ОписаниеЭлемента.Наименование = "Пп. 12 п. 1 ст. 341 (выплаты в связи с выполнением общественных работ и профессиональным обучением)";
	ОписаниеЭлемента.РазмерНеоблагаемогоДохода = 1;  //...в минимальном размере заработной платы
	ОписаниеЭлемента.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца;
	ОписаниеЭлемента.НеИспользуется = Ложь;
	СоздатьЭлементДоходаНеПодлежащегоНалогообложениюЧастично(ОписаниеЭлемента);
	
   	ОписаниеЭлемента = ОписаниеЭлементаДоходаНеПодлежащегоНалогообложениюЧастично();
	ОписаниеЭлемента.Наименование = "Пп. 18 п. 1 ст. 341 (выплаты для оплаты медицинских услуг, при рождении ребенка, на погребение)";
	ОписаниеЭлемента.РазмерНеоблагаемогоДохода = 8; //...в пределах 8-кратного минимального размера заработной платы
	ОписаниеЭлемента.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода;
	ОписаниеЭлемента.НеИспользуется = Ложь;
	СоздатьЭлементДоходаНеПодлежащегоНалогообложениюЧастично(ОписаниеЭлемента);
		
КонецПроцедуры

Функция ОписаниеЭлементаДоходаНеПодлежащегоНалогообложениюЧастично()
	Возврат Новый Структура("Наименование, РазмерНеоблагаемогоДохода, ПериодПредоставления, НеИспользуется");	
КонецФункции	

Процедура СоздатьЭлементДоходаНеПодлежащегоНалогообложениюЧастично(ОписаниеЭлемента)
	
	Если ЗначениеЗаполнено(ОписаниеЭлемента.Наименование) Тогда
		
		СсылкаНаОбъект =  Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию(ОписаниеЭлемента.Наименование); 
		Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
			Элемент = СсылкаНаОбъект.ПолучитьОбъект();
		Иначе
			Элемент = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.СоздатьЭлемент();
		КонецЕсли;
		
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(Элемент, ОписаниеЭлемента);
	Элемент.Записать();
	
КонецПроцедуры	

Процедура ОбновитьСправочникДоходыНеПодлежащиеНалогообложениюЧастично2018() Экспорт 
	
	Выборка = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если СтрНайти(Выборка.Наименование, "Пп. 9 п. 1) ст. 156") <> 0 Тогда
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СправочникОбъект.Наименование = "Пп. 11 п. 1 ст. 341 (выигрыши по лотере)";
			СправочникОбъект.Записать();
		КонецЕсли;
		Если СтрНайти(Выборка.Наименование, "Пп. 10 п. 1) ст. 156") <> 0 Тогда
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СправочникОбъект.Наименование = "Пп. 12 п. 1 ст. 341 (выплаты в связи с выполнением общественных работ и профессиональным обучением)";
			СправочникОбъект.Записать();
		КонецЕсли;
		Если СтрНайти(Выборка.Наименование, "Пп. 18 п. 1) ст. 156") <> 0 Тогда
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СправочникОбъект.Наименование = "Пп. 23 п. 1 ст. 341 (выплаты для оплаты медицинских услуг, при рождении ребенка, на погребение)";
			СправочникОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьСправочникДоходыНеПодлежащиеНалогообложениюЧастично2019() Экспорт 
	
	Выборка = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если СтрНайти(Выборка.Наименование, "Пп. 23 п. 1 ст. 341 (выплаты для оплаты медицинских услуг, при рождении ребенка, на погребение)") <> 0 Тогда
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СправочникОбъект.Наименование = "Пп. 18 п. 1 ст. 341 (выплаты для оплаты медицинских услуг, при рождении ребенка, на погребение)";
			СправочникОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
	РегистрыСведений.РазмерыДоходовНеПодлежащихНалогообложениюЧастично.НачальноеЗаполнение();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли