#Область ПрограммныйИнтерфейс

Функция ПолучитьНоменклатуруПоШтрихкоду(ПараметрыЗапроса) Экспорт
	
	Результат	= Новый Соответствие;
	Результат.Вставить("Заголовки", Новый Соответствие);
	Результат.Вставить("ТелоОтвета", Новый Соответствие);
	
	МассивШтрихкодов	= Новый Массив;
	МассивНоменклатуры	= Новый Массив;
	МассивПараметров	= ПолучитьМассивИзПараметра(ПараметрыЗапроса, "params");
	Если ЗначениеЗаполнено(ПараметрыЗапроса["param"]) И ЗначениеЗаполнено(ПараметрыЗапроса["param"]["store"]) Тогда
		ПараметрСклад		= Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыЗапроса["param"]["store"]));
	Иначе
		ПараметрСклад	= Неопределено;
	КонецЕсли;
	
	Для Каждого Элемент Из МассивПараметров Цикл
		Если ЗначениеЗаполнено(Элемент["barcode"]) Тогда
			Штрихкод = СокрЛП(Элемент["barcode"]);
			ЗаписьЖурналаРегистрации("МП.Отладка", УровеньЖурналаРегистрации.Информация,,, СтрШаблон("ШК: %1", Штрихкод));
			Если СтрДлина(Штрихкод) = 12 Тогда
				Штрихкод = "0" + Штрихкод;
			КонецЕсли;
			ЗаписьЖурналаРегистрации("МП.Отладка", УровеньЖурналаРегистрации.Информация,,, СтрШаблон("ШК поиск: %1", Штрихкод));
			МассивШтрихкодов.Добавить(Штрихкод);
		КонецЕсли;
	КонецЦикла;
	
	Запрос	= Новый Запрос;
	Запрос.Текст = ТекстЗапросаНоменклатураПоШтрихкодам();
	Запрос.УстановитьПараметр("МассивШтрихкодов", МассивШтрихкодов);
	Запрос.УстановитьПараметр("Склад", ПараметрСклад);   
	
	Выборка	= Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МассивНоменклатуры.Добавить(ПредставлениеНоменклатуры(Выборка));	
		
	КонецЦикла;
	
	Результат["ТелоОтвета"]	= Новый Структура("response", МассивНоменклатуры);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИзображениеНоменклатуры(ПараметрыЗапроса) Экспорт
	
	Результат	= Новый Соответствие;
	Результат.Вставить("Заголовки", Новый Соответствие);
	Результат.Вставить("ТелоОтвета", Новый Соответствие);
	
	Если ЗначениеЗаполнено(ПараметрыЗапроса["param"]) Тогда
		Идентификатор	= ПараметрыЗапроса["param"]["id"];
	КонецЕсли;
	
	Попытка	
		УИД_Изображения	= Новый УникальныйИдентификатор(Идентификатор);
	Исключение
		Результат["ТелоОтвета"] = Новый Структура("error", "Bad id");
		Возврат Результат;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СсылкаФайл	= Справочники.НоменклатураПрисоединенныеФайлы.ПолучитьСсылку(УИД_Изображения);
	
	ДвоичныеДанные	= РаботаСФайлами.ХранилищеФайлаИзИнформационнойБазы(СсылкаФайл);
	
	Если ДвоичныеДанные = Неопределено Тогда
		Результат["ТелоОтвета"] = Новый Структура("error", "File not found");
		Возврат Результат;
	КонецЕсли;
	
	Результат["Заголовки"].Вставить("Content-Type", "image/jpg");
	Результат["ТелоОтвета"] = ДвоичныеДанные.Получить();
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСписокСкладов(ПараметрыЗапроса) Экспорт
	
	Результат	= Новый Соответствие;
	Результат.Вставить("Заголовки", Новый Соответствие);
	Результат.Вставить("ТелоОтвета", Новый Соответствие);
	
	МассивСкладов	= Новый Массив;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос	= Новый Запрос;
	Запрос.Текст = ТекстЗапросаСписокСкладов();
	
	Выборка	= Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МассивСкладов.Добавить(ПредставлениеСклада(Выборка));	
		
	КонецЦикла;
	
	Результат["ТелоОтвета"]	= Новый Структура("response", МассивСкладов);
	
	Возврат Результат;
	
КонецФункции

Функция СохранитьПересчетТоваров(ПараметрыЗапроса) Экспорт
	
	Результат	= Новый Соответствие;
	Результат.Вставить("Заголовки", Новый Соответствие);
	Результат.Вставить("ТелоОтвета", Новый Соответствие);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(ПараметрыЗапроса["param"]) Тогда
		
		Идентификатор	= ПараметрыЗапроса["param"]["id"];
		Описание		= ПараметрыЗапроса["param"]["desc"];
		Отправитель		= ПараметрыЗапроса["param"]["sender"];
		Данные			= ПараметрыЗапроса["param"]["data"];
		
		Попытка
			
			РегистрыСведений.игр_ЖурналВходящихДанныхМобильноеПриложение.ЗаписатьДанныеВЖурнал(
				Идентификатор, Описание, Данные, Отправитель);
			
		Исключение
			
			ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			
		КонецПопытки;
		
	Иначе	
		
		ВызватьИсключение "Bad data";
		
	КонецЕсли;
	
	Результат["ТелоОтвета"]	= Новый Структура("response", "ОК");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНоменклатуру(ПараметрыЗапроса) Экспорт
	
	Результат	= Новый Соответствие;
	Результат.Вставить("Заголовки", Новый Соответствие);
	Результат.Вставить("ТелоОтвета", Новый Соответствие);
	
	МассивШтрихкодов	= Новый Массив;
	МассивНоменклатуры	= Новый Массив;
	МассивПараметров	= ПолучитьМассивИзПараметра(ПараметрыЗапроса, "params");
	Если ЗначениеЗаполнено(ПараметрыЗапроса["param"]) И ЗначениеЗаполнено(ПараметрыЗапроса["param"]["store"]) Тогда
		ПараметрСклад		= Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыЗапроса["param"]["store"]));
	Иначе
		ПараметрСклад	= Неопределено;
	КонецЕсли;
	
	Запрос	= Новый Запрос;
	Запрос.Текст = ТекстЗапросаСохраненнаяНоменклатура();  
	Запрос.УстановитьПараметр("Идентификатор", ПараметрСклад.УникальныйИдентификатор());
	
	Выборка	= Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Данные	= Выборка.Данные.Получить();
	Иначе
		Данные	= "";
	КонецЕсли;
	
	Результат["ТелоОтвета"]	= Новый Структура("response", Данные);
	
	Возврат Результат;
	
КонецФункции

Процедура СохранитьНоменклатуруДляСклада(ПараметрСклад) Экспорт
	
	Запрос	= Новый Запрос;
	Запрос.Текст = ТекстЗапросаНоменклатура();
	Запрос.УстановитьПараметр("Склад", ПараметрСклад);
	
	Выборка	= Запрос.Выполнить().Выбрать();
	
	МассивНоменклатуры	= Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		МассивНоменклатуры.Добавить(ПредставлениеНоменклатуры(Выборка));	
		
	КонецЦикла;
	
	СтрокаМассива	= КоннекторHTTP.ОбъектВJson(МассивНоменклатуры);
	СжатиеДанных	= Новый СжатиеДанных(9);
	Значение		= Новый ХранилищеЗначения(СтрокаМассива, СжатиеДанных); 
	Данные			= XMLСтрока(Значение);

	РегистрыСведений.игр_ЖурналВходящихДанныхМобильноеПриложение.ЗаписатьДанныеВЖурнал(
		ПараметрСклад.УникальныйИдентификатор(), СтрШаблон("Данные для склада %1 от %2", ПараметрСклад, ТекущаяДатаСеанса()), 
		Данные, Строка(Пользователи.ТекущийПользователь()));
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьМассивИзПараметра(Источник, Имя)
	
	Результат	= Новый Массив;
	
	Если Источник[Имя] <> Неопределено
		И ТипЗнч(Источник[Имя]) = Тип("Массив") Тогда
		
		Результат = Источник[Имя];
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаНоменклатураПоШтрихкодам() 
	
	ТекстЗапроса	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Склады.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.ОптовыйСклад)
	|			ТОГДА Склады.УчетныйВидЦены
	|		ИНАЧЕ Склады.РозничныйВидЦены
	|	КОНЕЦ КАК РозничныйВидЦены
	|ПОМЕСТИТЬ ВТ_ВидЦены
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Ссылка = &Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	|	ДанныеНоменклатура.Артикул КАК Артикул,
	|	ДанныеНоменклатура.Наименование КАК Наименование,
	|	ДанныеНоменклатура.ФайлКартинки КАК ФайлКартинки,
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Характеристика) КАК Характеристика,
	|	ЕСТЬNULL(ВТ_ВидЦены.РозничныйВидЦены, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) КАК ВидЦены,
	|	ШтрихкодыНоменклатуры.Характеристика КАК ХарактеристикаСсылка
	|ПОМЕСТИТЬ ВТ_ДанныеНоменклатуры
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ДанныеНоменклатура
	|		ПО ШтрихкодыНоменклатуры.Номенклатура = ДанныеНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВидЦены КАК ВТ_ВидЦены
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод В(&МассивШтрихкодов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеНоменклатуры.Штрихкод КАК Штрихкод,
	|	ВТ_ДанныеНоменклатуры.Артикул КАК Артикул,
	|	ВТ_ДанныеНоменклатуры.Наименование КАК Наименование,
	|	ВТ_ДанныеНоменклатуры.ФайлКартинки КАК ФайлКартинки,
	|	ВТ_ДанныеНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныеНоменклатуры.Характеристика КАК Характеристика,
	|	ВТ_ДанныеНоменклатуры.ВидЦены КАК ВидЦены,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
	|ИЗ
	|	ВТ_ДанныеНоменклатуры КАК ВТ_ДанныеНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ВТ_ДанныеНоменклатуры.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ВТ_ДанныеНоменклатуры.ХарактеристикаСсылка = ЦеныНоменклатурыСрезПоследних.Характеристика
	|			И ВТ_ДанныеНоменклатуры.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены"
	;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаНоменклатура() 
	
	ТекстЗапроса	= 
	"ВЫБРАТЬ
	|	Склады.РозничныйВидЦены КАК РозничныйВидЦены
	|ПОМЕСТИТЬ ВТ_ВидЦены
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Ссылка = &Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	|	ДанныеНоменклатура.Артикул КАК Артикул,
	|	ДанныеНоменклатура.Наименование КАК Наименование,
	|	ДанныеНоменклатура.ФайлКартинки КАК ФайлКартинки,
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Характеристика) КАК Характеристика,
	|	ЕСТЬNULL(ВТ_ВидЦены.РозничныйВидЦены, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) КАК ВидЦены,
	|	ШтрихкодыНоменклатуры.Характеристика КАК ХарактеристикаСсылка
	|ПОМЕСТИТЬ ВТ_ДанныеНоменклатуры
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ДанныеНоменклатура
	|		ПО ШтрихкодыНоменклатуры.Номенклатура = ДанныеНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВидЦены КАК ВТ_ВидЦены
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеНоменклатуры.Штрихкод КАК Штрихкод,
	|	ВТ_ДанныеНоменклатуры.Артикул КАК Артикул,
	|	ВТ_ДанныеНоменклатуры.Наименование КАК Наименование,
	|	ВТ_ДанныеНоменклатуры.ФайлКартинки КАК ФайлКартинки,
	|	ВТ_ДанныеНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныеНоменклатуры.Характеристика КАК Характеристика,
	|	ВТ_ДанныеНоменклатуры.ВидЦены КАК ВидЦены,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
	|ИЗ
	|	ВТ_ДанныеНоменклатуры КАК ВТ_ДанныеНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ВТ_ДанныеНоменклатуры.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ВТ_ДанныеНоменклатуры.ХарактеристикаСсылка = ЦеныНоменклатурыСрезПоследних.Характеристика
	|			И ВТ_ДанныеНоменклатуры.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены"
	;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаСохраненнаяНоменклатура() 
	
	ТекстЗапроса	= 
	"ВЫБРАТЬ
	|	игр_ЖурналВходящихДанныхМобильноеПриложение.Данные КАК Данные
	|ИЗ
	|	РегистрСведений.игр_ЖурналВходящихДанныхМобильноеПриложение КАК игр_ЖурналВходящихДанныхМобильноеПриложение
	|ГДЕ
	|	игр_ЖурналВходящихДанныхМобильноеПриложение.Идентификатор = &Идентификатор"
	;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПредставлениеНоменклатуры(Источник)
	
	Результат	= Новый Соответствие;
	Результат.Вставить("Штрихкод", Источник.Штрихкод);
	Результат.Вставить("Артикул", Источник.Артикул);
	Результат.Вставить("Наименование", Источник.Наименование);
	Результат.Вставить("Характеристика", Источник.Характеристика);
	Результат.Вставить("Изображение", XMLСтрока(Источник.ФайлКартинки));
	Результат.Вставить("Идентификатор", XMLСтрока(Источник.Номенклатура));
	Результат.Вставить("Цена", Источник.Цена);
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаСписокСкладов()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Ссылка,
	|	Склады.Родитель КАК Родитель,
	|	Склады.ЭтоГруппа КАК ЭтоГруппа,
	|	Склады.Наименование КАК Наименование,
	|	Склады.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Справочник.Склады КАК Склады"	
	;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПредставлениеСклада(Источник)
	
	Результат	= Новый Соответствие;
	Результат.Вставить("Наименование", Источник.Наименование);
	Результат.Вставить("Идентификатор", XMLСтрока(Источник.Ссылка));
	Результат.Вставить("ЭтоГруппа", Источник.ЭтоГруппа);
	Результат.Вставить("Родитель", XMLСтрока(Источник.Родитель));
	Результат.Вставить("ПометкаУдаления", Источник.ПометкаУдаления);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти