
Процедура игр_ПередЗаписьюДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения 
		ИЛИ (РежимЗаписи = РежимЗаписиДокумента.Проведение И Источник.Проведен) Тогда
		КонтрольОтменыПроведения(Источник);
	КонецЕсли;
	
КонецПроцедуры

Процедура КонтрольОтменыПроведения(Источник)
	
	МетаданныеДокумента	= Источник.Метаданные();
	
	МассивДокументовДляКонтроля	= МассивДокументовДляКонтроля();
	
	Если МассивДокументовДляКонтроля.Найти(МетаданныеДокумента) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Пользователи.ЭтоПолноправныйПользователь() 
		ИЛИ РольДоступна("игр_РазрешитьИзменениеПроведенных") Тогда
		Возврат;
	КонецЕсли;
	
	ВызватьИсключение "Запрещено изменение проведенных документов";
	
КонецПроцедуры
	
Функция МассивДокументовДляКонтроля()
	
	Результат	= Новый Массив;
	
	Результат.Добавить(Метаданные.Документы.ОтчетОРозничныхПродажах);
	Результат.Добавить(Метаданные.Документы.ПриходныйКассовыйОрдер);
	Результат.Добавить(Метаданные.Документы.РасходныйКассовыйОрдер);
	Результат.Добавить(Метаданные.Документы.ПриобретениеТоваровУслуг);
	Результат.Добавить(Метаданные.Документы.ПриобретениеУслугПрочихАктивов);
	Результат.Добавить(Метаданные.Документы.ПриходныйОрдерНаТовары);
	Результат.Добавить(Метаданные.Документы.ПеремещениеТоваров);
	Результат.Добавить(Метаданные.Документы.РеализацияТоваровУслуг);
	Результат.Добавить(Метаданные.Документы.ОприходованиеИзлишковТоваров);
	Результат.Добавить(Метаданные.Документы.СписаниеНедостачТоваров);
	Результат.Добавить(Метаданные.Документы.ПоручениеЭкспедитору);
	Результат.Добавить(Метаданные.Документы.СписаниеЗадолженности);
	
	Возврат Результат;
	
КонецФункции
