
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ГруппаОпераций") Тогда
		
		// Передача Параметры с типом ДанныеФормыСтруктура в модуль объекта некорректно отрабатывает выбор, например при установке
		// вида операции документа Отражение зарплаты в фин. учете (кнопка Подробно сотрудники)
		СтруктураОтбора = Новый Структура("Отбор, СтрокаПоиска", ?(Параметры.Свойство("ГруппаОпераций"), Новый Структура("ГруппаОпераций", Параметры.ГруппаОпераций), Новый Структура()), "");
		
		СписокОпераций = Перечисления.ВидыОперацийПоЗарплате.ПолучитьДанныеВыбора(СтруктураОтбора);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, 
			"Ссылка", 
			СписокОпераций, 
			ВидСравненияКомпоновкиДанных.ВСписке,
			, // Представление - автоматически
			СписокОпераций.Количество() > 0);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти