
&ИзменениеИКонтроль("ОбработкаПолученияФормы")
Процедура игр_ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	Если ВидФормы = "ФормаОбъекта" Тогда
		#Вставка
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "ФормаДокумента";
		Возврат;
		#КонецВставки

		Если (Параметры.Свойство("Основание")
			И ЗначениеЗаполнено(Параметры.Основание))
			ИЛИ (Параметры.Свойство("Ключ") И Не ЗначениеЗаполнено(Параметры.Ключ)) Тогда

			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ФормаДокументаРМК";

		ИначеЕсли Параметры.Свойство("Ключ") И ЗначениеЗаполнено(Параметры.Ключ) Тогда

			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ФормаДокумента";

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
