
&Вместо("ОбработкаПроверкиЗаполнения")
Процедура игр_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Индекс	= ПроверяемыеРеквизиты.Найти("КассоваяСмена");
	Если Индекс <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(Индекс);
	КонецЕсли;
	
КонецПроцедуры

&После("ПриЗаписи")
Процедура игр_ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ДатаНачалаСписания	= ПланыВидовХарактеристик.игр_ПроизвольныеПредопределенныеОбъекты.ПолучитьЗначение(
		"ДатаНачалаСписанияПодарочных");
	
	Если ЗначениеЗаполнено(ДатаНачалаСписания) И ДатаНачалаСписания <= Дата Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос	= Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеНедостачТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СписаниеНедостачТоваров КАК СписаниеНедостачТоваров
		|ГДЕ
		|	СписаниеНедостачТоваров.ПометкаУдаления = ЛОЖЬ
		|	И СписаниеНедостачТоваров.Основание = &Основание" 
		;
		
		Запрос.УстановитьПараметр("Основание", Ссылка);
		Выборка	= Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДокументОбъект	= Выборка.Ссылка.ПолучитьОбъект();
		Иначе
			ДокументОбъект	= Документы.СписаниеНедостачТоваров.СоздатьДокумент();
		КонецЕсли;
		
		ДокументОбъект.Заполнить(Ссылка);
		
		ДокументОбъект.Записать(ДополнительныеСвойства.РежимЗаписи);
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры
