#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	
	
КонецПроцедуры

// Добавляет команду создания документа "Переоценка НМА".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.ПереоценкаНМА) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ПереоценкаНМА.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.ПереоценкаНМА);
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ОтображатьВнеоборотныеАктивы2_2";
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";

		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

Функция АдаптированныйТекстЗапросаДвиженийПоРегистру(ИмяРегистра) Экспорт

	ТекстыЗапроса = Новый СписокЗначений;
	
	ПолноеИмяДокумента = "Документ.ПереоценкаНМА";
	
	ЗначенияПараметров = ЗначенияПараметровПроведения();
	ПереопределениеРасчетаПараметров = Новый Структура;
	ПереопределениеРасчетаПараметров.Вставить("НомерНаПечать", """""");
	
	ВЗапросеЕстьИсточник = Истина;
	
	Если ИмяРегистра = "РеестрДокументов" Тогда
		
		ТекстЗапроса = ТекстЗапросаТаблицаРеестрДокументов(ТекстыЗапроса, ИмяРегистра);
		СинонимТаблицыДокумента = "";
		ВЗапросеЕстьИсточник = Ложь;
		
	ИначеЕсли ИмяРегистра = "ДокументыПоНМА" Тогда
		
		ТекстЗапроса = ТекстЗапросаТаблицаДокументыПоНМА(ТекстыЗапроса, ИмяРегистра);
		СинонимТаблицыДокумента = "ДанныеДокумента";
		ВЗапросеЕстьИсточник = Ложь;
		
	Иначе
		ТекстИсключения = НСтр("ru = 'В документе %ПолноеИмяДокумента% не реализована адаптация текста запроса формирования движений по регистру %ИмяРегистра%.'");
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ПолноеИмяДокумента%", ПолноеИмяДокумента);
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ИмяРегистра%", ИмяРегистра);
		
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Если ИмяРегистра = "РеестрДокументов"
		ИЛИ ИмяРегистра = "ДокументыПоНМА" Тогда
		
		ТекстЗапроса = ОбновлениеИнформационнойБазыУТ.АдаптироватьЗапросПроведенияПоНезависимомуРегистру(
										ТекстЗапроса,
										ПолноеИмяДокумента,
										СинонимТаблицыДокумента,
										ВЗапросеЕстьИсточник,
										ПереопределениеРасчетаПараметров);
	Иначе	
		
		ТекстЗапроса = ОбновлениеИнформационнойБазыУТ.АдаптироватьЗапросМеханизмаПроведения(
										ТекстЗапроса,
										ПолноеИмяДокумента,
										СинонимТаблицыДокумента,
										ПереопределениеРасчетаПараметров);
	КонецЕсли; 

	Результат = ОбновлениеИнформационнойБазыУТ.РезультатАдаптацииЗапроса();
	Результат.ЗначенияПараметров = ЗначенияПараметров;
	Результат.ТекстЗапроса = ТекстЗапроса;
	
	Возврат Результат;
	
КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	Если Регистры = Неопределено Тогда
		ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(НСтр("ru = 'Переоценка НМА'"));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДополнительныеСвойства);
	
	ТекстыЗапроса = Новый СписокЗначений;
	УчетОСВызовСервера.ПрочиеРасходы(ТекстыЗапроса, Регистры, ПрочиеРасходы(ТекстыЗапроса, Регистры));
	УчетОСВызовСервера.ПартииПрочихРасходов(ТекстыЗапроса, Регистры, ПартииПрочихРасходов(ТекстыЗапроса, Регистры));
	УчетОСВызовСервера.ПрочиеДоходы(ТекстыЗапроса, Регистры);
	УчетОСВызовСервера.ПрочиеАктивыПассивы(ТекстыЗапроса, Регистры);
	УчетОСВызовСервера.ПорядокОтраженияПрочихОпераций(ТекстыЗапроса, Регистры);
	УчетОСВызовСервера.ОтражениеДокументовВРеглУчете(ТекстыЗапроса, Регистры);
	ПервоначальныеСведенияНМАБухгалтерскийУчет(ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаРеестрДокументов(ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаДокументыПоНМА(ТекстыЗапроса, Регистры);
	
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДополнительныеСвойства)
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Дата КАК Дата,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ДанныеДокумента.НематериальныйАктив КАК НематериальныйАктив,
	|	ДанныеДокумента.СтатьяРасходов КАК СтатьяРасходов,
	|	ДанныеДокумента.АналитикаРасходов КАК АналитикаРасходов,
	|	ЕСТЬNULL(ДанныеДокумента.СтатьяРасходов.ПринятиеКналоговомуУчету, ИСТИНА) КАК ПринятиеКНалоговомуУчету,
	|	ДанныеДокумента.Ответственный КАК Ответственный,
	|	ДанныеДокумента.Комментарий КАК Комментарий,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	ДанныеДокумента.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Документ.ПереоценкаНМА КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка";
	
	Результат = Запрос.Выполнить();
	Реквизиты = Результат.Выбрать();
	Реквизиты.Следующий();
	
	УчетОСВызовСервера.ИнициализироватьПараметрыЗапросаПриОтраженииАмортизации(Запрос, ДополнительныеСвойства);
	
	Для Каждого Колонка Из Результат.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[Колонка.Имя]);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Граница", Новый Граница(НачалоМесяца(Реквизиты.Период), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("КонецМесяца", Новый Граница(КонецМесяца(Реквизиты.Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ГраницаМесяцОкончание", Новый Граница(КонецМесяца(Реквизиты.Период), ВидГраницы.Включая));
	
	ЗначенияПараметровПроведения = ЗначенияПараметровПроведения(Реквизиты);
	Для каждого КлючИЗначение Из ЗначенияПараметровПроведения Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла; 
	
	УниверсальныеМеханизмыПартийИСебестоимости.ЗаполнитьПараметрыИнициализации(Запрос, Реквизиты);
	
КонецПроцедуры

Функция ЗначенияПараметровПроведения(Реквизиты = Неопределено)

	ЗначенияПараметровПроведения = Новый Структура;
	ЗначенияПараметровПроведения.Вставить("ИдентификаторМетаданных", ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.ПереоценкаНМА"));
	ЗначенияПараметровПроведения.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ПереоценкаНМА);

	Если Реквизиты <> Неопределено Тогда
		ЗначенияПараметровПроведения.Вставить("НомерНаПечать", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер));
	КонецЕсли; 
	
	Возврат ЗначенияПараметровПроведения;
	
КонецФункции

Процедура ВременнаяТаблицаПоДокументу(ТекстыЗапроса)
	
	ИмяТаблицы = "втТаблицаПоДокументу";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втТаблицаПоДокументу
	|"+
	"ВЫБРАТЬ
	|	втТаблицаПоДокументу.Ссылка КАК Ссылка,
	|	втТаблицаПоДокументу.НематериальныйАктив КАК ОбъектУчета,
	|	втТаблицаПоДокументу.Организация КАК Организация,
	|	втТаблицаПоДокументу.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(втТаблицаПоДокументу.НематериальныйАктив.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	втТаблицаПоДокументу.Стоимость КАК Стоимость
	|,	втТаблицаПоДокументу.Ссылка.МетодПереоценки КАК МетодПереоценки
	|ПОМЕСТИТЬ втТаблицаПоДокументу
	|ИЗ
	|	Документ.ПереоценкаНМА КАК втТаблицаПоДокументу
	|ГДЕ
	|	втТаблицаПоДокументу.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	втТаблицаПоДокументу.НематериальныйАктив,
	|	Организация,
	|	Подразделение";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы);
	
КонецПроцедуры

Процедура ВременнаяТаблицаАмортизацияПоДокументу(ТекстыЗапроса)
	
	ИмяТаблицы = "втАмортизацияПоДокументу";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	УчетОСВызовСервера.ВременнаяТаблицаНачисленнаяАмортизация(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втАмортизацияПоДокументу
	|"+
	"ВЫБРАТЬ
	|	втНачисленнаяАмортизация.ОбъектУчета КАК ОбъектУчета,
	|	СУММА(втНачисленнаяАмортизация.СуммаБУ) КАК Сумма
	|ПОМЕСТИТЬ втАмортизацияПоДокументу
	|ИЗ
	|	втНачисленнаяАмортизация КАК втНачисленнаяАмортизация
	|
	|СГРУППИРОВАТЬ ПО
	|	втНачисленнаяАмортизация.ОбъектУчета";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы);
	
КонецПроцедуры

Процедура ВременнаяТаблицаСчетаУчета(ТекстыЗапроса)
	
	ИмяТаблицы = "втСчетаУчета";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаПоДокументу(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втСчетаУчета
	|"+
	"ВЫБРАТЬ
	|	втТаблицаПоДокументу.ОбъектУчета КАК ОбъектУчета,
	|	СчетаБухгалтерскогоУчета.СчетУчета,
	|	СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации КАК СчетАмортизации,
	|	ПараметрыЦелевогоФинансирования.СчетУчета КАК СчетУчетаЦФ,
	|	ПараметрыЦелевогоФинансирования.СчетАмортизации КАК СчетАмортизацииЦФ,
	|	ЕСТЬNULL(ПараметрыЦелевогоФинансирования.ПрименениеЦелевогоФинансирования, ЛОЖЬ) КАК ПрименениеЦелевогоФинансирования
	|ПОМЕСТИТЬ втСчетаУчета
	|ИЗ
	|	втТаблицаПоДокументу КАК втТаблицаПоДокументу
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаНМА.СрезПоследних(
	|				&Период,
	|				(Организация, НематериальныйАктив) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втТаблицаПоДокументу КАК Т)) КАК СчетаБухгалтерскогоУчета
	|		ПО втТаблицаПоДокументу.ОбъектУчета = СчетаБухгалтерскогоУчета.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЦелевогоФинансированияНМА.СрезПоследних(
	|				&Период,
	|				Регистратор <> &Ссылка
	|					И НематериальныйАктив В
	|						(ВЫБРАТЬ
	|							Т.ОбъектУчета
	|						ИЗ
	|							втТаблицаПоДокументу КАК Т)) КАК ПараметрыЦелевогоФинансирования
	|		ПО втТаблицаПоДокументу.ОбъектУчета = ПараметрыЦелевогоФинансирования.НематериальныйАктив
	|			И (ПараметрыЦелевогоФинансирования.ПрименениеЦелевогоФинансирования)";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы);
	
КонецПроцедуры

Процедура ВременнаяТаблицаСчетаУчетаСгруппированные(ТекстыЗапроса)
	
	ИмяТаблицы = "втСчетаУчетаСгруппированные";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаСчетаУчета(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втСчетаУчетаСгруппированные
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСчетаУчета.ОбъектУчета КАК ОбъектУчета,
	|	втСчетаУчета.СчетУчета КАК Счет
	|ПОМЕСТИТЬ втСчетаУчетаСгруппированные
	|ИЗ
	|	втСчетаУчета КАК втСчетаУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСчетаУчета.ОбъектУчета,
	|	втСчетаУчета.СчетУчетаЦФ
	|ИЗ
	|	втСчетаУчета КАК втСчетаУчета
	|ГДЕ
	|	втСчетаУчета.ПрименениеЦелевогоФинансирования";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы);
	
КонецПроцедуры

Процедура ВременнаяТаблицаСчетаАмортизацииСгруппированные(ТекстыЗапроса)
	
	ИмяТаблицы = "втСчетаАмортизацииСгруппированные";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаСчетаУчета(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втСчетаАмортизацииСгруппированные
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСчетаУчета.ОбъектУчета КАК ОбъектУчета,
	|	втСчетаУчета.СчетАмортизации КАК Счет
	|ПОМЕСТИТЬ втСчетаАмортизацииСгруппированные
	|ИЗ
	|	втСчетаУчета КАК втСчетаУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСчетаУчета.ОбъектУчета,
	|	втСчетаУчета.СчетАмортизацииЦФ
	|ИЗ
	|	втСчетаУчета КАК втСчетаУчета
	|ГДЕ
	|	втСчетаУчета.ПрименениеЦелевогоФинансирования";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы);
	
КонецПроцедуры

Процедура ВременнаяТаблицаСчетаСгруппированные(ТекстыЗапроса)
	
	ИмяТаблицы = "втСчетаСгруппированные";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаСчетаУчетаСгруппированные(ТекстыЗапроса);
	ВременнаяТаблицаСчетаАмортизацииСгруппированные(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втСчетаСгруппированные
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСчетаУчетаСгруппированные.Счет КАК Счет
	|ПОМЕСТИТЬ втСчетаСгруппированные
	|ИЗ
	|	втСчетаУчетаСгруппированные КАК втСчетаУчетаСгруппированные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСчетаАмортизацииСгруппированные.Счет
	|ИЗ
	|	втСчетаАмортизацииСгруппированные КАК втСчетаАмортизацииСгруппированные";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы);
	
КонецПроцедуры

Процедура ВременнаяТаблицаОстаткиПоСчетам(ТекстыЗапроса)
	
	ИмяТаблицы = "втОстаткиПоСчетам";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаПоДокументу(ТекстыЗапроса);
	ВременнаяТаблицаСчетаСгруппированные(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втОстаткиПоСчетам
	|"+
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто1 КАК ОбъектУчета,
	|	ХозрасчетныйОстатки.Счет КАК Счет,
	|	СУММА(ХозрасчетныйОстатки.СуммаОстаток) КАК Сумма
	|ПОМЕСТИТЬ втОстаткиПоСчетам
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&Период,
	|			Счет В
	|				(ВЫБРАТЬ
	|					Т.Счет
	|				ИЗ
	|					втСчетаСгруппированные КАК Т),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НематериальныеАктивы),
	|			(Организация, Подразделение, Субконто1, НаправлениеДеятельности) В
	|				(ВЫБРАТЬ
	|					Т.Организация,
	|					Т.Подразделение,
	|					Т.ОбъектУчета,
	|					Т.НаправлениеДеятельности
	|				ИЗ
	|					втТаблицаПоДокументу КАК Т)) КАК ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстатки.Субконто1,
	|	ХозрасчетныйОстатки.Счет";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы);
	
КонецПроцедуры

Процедура ВременнаяТаблицаОстаткиСтоимости(ТекстыЗапроса)
	
	ИмяТаблицы = "втОстаткиСтоимости";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаПоДокументу(ТекстыЗапроса);
	ВременнаяТаблицаСчетаУчетаСгруппированные(ТекстыЗапроса);
	ВременнаяТаблицаСчетаАмортизацииСгруппированные(ТекстыЗапроса);
	ВременнаяТаблицаОстаткиПоСчетам(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втОстаткиСтоимости
	|"+
	"ВЫБРАТЬ
	|	втТаблицаПоДокументу.ОбъектУчета,
	|	СУММА(ЕСТЬNULL(ВосстановительнаяСтоимость.Сумма, 0) + ЕСТЬNULL(ВосстановительнаяСтоимостьЦФ.Сумма, 0)) КАК ВосстановительнаяСтоимость,
	|	СУММА(ЕСТЬNULL(-НакопленнаяАмортизация.Сумма, 0) + ЕСТЬNULL(-НакопленнаяАмортизацияЦФ.Сумма, 0)) КАК НакопленнаяАмортизация
	|ПОМЕСТИТЬ втОстаткиСтоимости
	|ИЗ
	|	втТаблицаПоДокументу КАК втТаблицаПоДокументу
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСчетаУчета КАК втСчетаУчета
	|		ПО втТаблицаПоДокументу.ОбъектУчета = втСчетаУчета.ОбъектУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиПоСчетам КАК ВосстановительнаяСтоимость
	|		ПО втТаблицаПоДокументу.ОбъектУчета = ВосстановительнаяСтоимость.ОбъектУчета
	|			И (втСчетаУчета.СчетУчета = ВосстановительнаяСтоимость.Счет)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиПоСчетам КАК НакопленнаяАмортизация
	|		ПО втТаблицаПоДокументу.ОбъектУчета = НакопленнаяАмортизация.ОбъектУчета
	|			И (втСчетаУчета.СчетАмортизации = НакопленнаяАмортизация.Счет)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиПоСчетам КАК ВосстановительнаяСтоимостьЦФ
	|		ПО втТаблицаПоДокументу.ОбъектУчета = ВосстановительнаяСтоимостьЦФ.ОбъектУчета
	|			И (втСчетаУчета.СчетУчетаЦФ = ВосстановительнаяСтоимостьЦФ.Счет)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиПоСчетам КАК НакопленнаяАмортизацияЦФ
	|		ПО втТаблицаПоДокументу.ОбъектУчета = НакопленнаяАмортизацияЦФ.ОбъектУчета
	|			И (втСчетаУчета.СчетАмортизацииЦФ = НакопленнаяАмортизацияЦФ.Счет)
	|
	|СГРУППИРОВАТЬ ПО
	|	втТаблицаПоДокументу.ОбъектУчета";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы);
	
КонецПроцедуры

Процедура ВременнаяТаблицаПредыдущаяПереоценкаОбъектовСгруппированная(ТекстыЗапроса)
	
	ИмяТаблицы = "втПредыдущаяПереоценкаОбъектовСгруппированная";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаПоДокументу(ТекстыЗапроса);
	
	Текст =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|//Временная таблица втПредыдущаяПереоценкаОбъектовСгруппированная
	|"+
	"ВЫБРАТЬ
	|	втТаблицаПоДокументу.ОбъектУчета КАК ОбъектУчета,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0)) КАК СуммаДооценки,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0)) КАК СуммаУценки
	|ПОМЕСТИТЬ втПредыдущаяПереоценкаОбъектовСгруппированная
	|ИЗ
	|	втТаблицаПоДокументу КАК втТаблицаПоДокументу
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				,
	|				&ГраницаМесяцОкончание,
	|				Регистратор,
	|				Счет В
	|					(ВЫБРАТЬ
	|						Т.СчетУчета
	|					ИЗ
	|						РегистрСведений.СчетаБухгалтерскогоУчетаНМА КАК Т),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НематериальныеАктивы),
	|				(Организация, Субконто1) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втТаблицаПоДокументу КАК Т),
	|				,
	|				) КАК ХозрасчетныйОбороты
	|		ПО втТаблицаПоДокументу.ОбъектУчета = ХозрасчетныйОбороты.Субконто1
	|			И втТаблицаПоДокументу.Организация = ХозрасчетныйОбороты.Организация
	|			И (ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПереоценкаНМА)
	|			И (ХозрасчетныйОбороты.Регистратор <> &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	втТаблицаПоДокументу.ОбъектУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы);
	
КонецПроцедуры

Процедура ВременнаяТаблицаПредыдущаяПереоценкаОбъектов(ТекстыЗапроса)
	
	ИмяТаблицы = "втПредыдущаяПереоценкаОбъектов";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаПредыдущаяПереоценкаОбъектовДанные(ТекстыЗапроса);
	
	Текст =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|//Временная таблица втПредыдущаяПереоценкаОбъектов
	|"+
	"ВЫБРАТЬ
	|	втПредыдущаяПереоценкаОбъектовДанные.ОбъектУчета КАК ОбъектУчета,
	|	СУММА(втПредыдущаяПереоценкаОбъектовДанные.СуммаДооценки) КАК СуммаДооценки,
	|	СУММА(втПредыдущаяПереоценкаОбъектовДанные.СуммаУценки) КАК СуммаУценки
	|ПОМЕСТИТЬ втПредыдущаяПереоценкаОбъектов
	|ИЗ
	|	втПредыдущаяПереоценкаОбъектовДанные КАК втПредыдущаяПереоценкаОбъектовДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	втПредыдущаяПереоценкаОбъектовДанные.ОбъектУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы);
	
КонецПроцедуры

Процедура ВременнаяТаблицаДанныеДляПроведения(ТекстыЗапроса)
	
	ИмяТаблицы = "втДанныеДляПроведения";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаПоДокументу(ТекстыЗапроса);
	ВременнаяТаблицаОстаткиСтоимости(ТекстыЗапроса);
	ВременнаяТаблицаАмортизацияПоДокументу(ТекстыЗапроса);
	ВременнаяТаблицаПредыдущаяПереоценкаОбъектов(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица втДанныеДляПроведения
	|"+
	"ВЫБРАТЬ
	|	втТаблицаПоДокументу.Ссылка,
	|	втТаблицаПоДокументу.ОбъектУчета,
	|	втТаблицаПоДокументу.Организация КАК Организация,
	|	втТаблицаПоДокументу.Подразделение КАК Подразделение,
	|	втТаблицаПоДокументу.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЕСТЬNULL(втОстаткиСтоимости.ВосстановительнаяСтоимость, 0) КАК ВосстановительнаяСтоимость,
	|	ЕСТЬNULL(втОстаткиСтоимости.НакопленнаяАмортизация, 0) + ЕСТЬNULL(втАмортизацияПоДокументу.Сумма, 0) КАК НакопленнаяАмортизация,
	|	втТаблицаПоДокументу.Стоимость КАК НоваяСтоимость,
	|	ВЫБОР
	|		КОГДА втОстаткиСтоимости.ОбъектУчета ЕСТЬ NULL 
	|				ИЛИ втТаблицаПоДокументу.Стоимость < (втОстаткиСтоимости.ВосстановительнаяСтоимость - ЕСТЬNULL(втОстаткиСтоимости.НакопленнаяАмортизация, 0) - ЕСТЬNULL(втАмортизацияПоДокументу.Сумма, 0))
	|			ТОГДА 0
	|		ИНАЧЕ втТаблицаПоДокументу.Стоимость - (втОстаткиСтоимости.ВосстановительнаяСтоимость - ЕСТЬNULL(втОстаткиСтоимости.НакопленнаяАмортизация, 0) - ЕСТЬNULL(втАмортизацияПоДокументу.Сумма, 0))
	|	КОНЕЦ КАК СуммаДооценки,
	|	ВЫБОР
	|		КОГДА втОстаткиСтоимости.ОбъектУчета ЕСТЬ NULL 
	|				ИЛИ втОстаткиСтоимости.ВосстановительнаяСтоимость - ЕСТЬNULL(втОстаткиСтоимости.НакопленнаяАмортизация, 0) - ЕСТЬNULL(втАмортизацияПоДокументу.Сумма, 0) < втТаблицаПоДокументу.Стоимость
	|			ТОГДА 0
	|		ИНАЧЕ втОстаткиСтоимости.ВосстановительнаяСтоимость - ЕСТЬNULL(втОстаткиСтоимости.НакопленнаяАмортизация, 0) - ЕСТЬNULL(втАмортизацияПоДокументу.Сумма, 0) - втТаблицаПоДокументу.Стоимость
	|	КОНЕЦ КАК СуммаУценки,
	|	ВЫБОР
	|		КОГДА втОстаткиСтоимости.ОбъектУчета ЕСТЬ NULL 
	|				ИЛИ (втОстаткиСтоимости.ВосстановительнаяСтоимость - втОстаткиСтоимости.НакопленнаяАмортизация - втАмортизацияПоДокументу.Сумма) < втТаблицаПоДокументу.Стоимость
	|				ИЛИ (втОстаткиСтоимости.ВосстановительнаяСтоимость - втОстаткиСтоимости.НакопленнаяАмортизация - втАмортизацияПоДокументу.Сумма) = 0
	|			ТОГДА 0
	|		КОГДА втТаблицаПоДокументу.МетодПереоценки = ЗНАЧЕНИЕ(Перечисление.МетодыПереоценкиВнеоборотныхАктивов.СписаниеАмортизацииПриПереоценке)
	|			ТОГДА - втТаблицаПоДокументу.Стоимость + (ВосстановительнаяСтоимость - втОстаткиСтоимости.НакопленнаяАмортизация - втАмортизацияПоДокументу.Сумма)
	|		ИНАЧЕ - втОстаткиСтоимости.ВосстановительнаяСтоимость *(втТаблицаПоДокументу.Стоимость / (втОстаткиСтоимости.ВосстановительнаяСтоимость - втОстаткиСтоимости.НакопленнаяАмортизация - втАмортизацияПоДокументу.Сумма) - 1)
	|	КОНЕЦ КАК СуммаУценкиСтоимости,
	|	ВЫБОР
	|		КОГДА втОстаткиСтоимости.ОбъектУчета ЕСТЬ NULL 
	|				ИЛИ втТаблицаПоДокументу.Стоимость < (втОстаткиСтоимости.ВосстановительнаяСтоимость - втОстаткиСтоимости.НакопленнаяАмортизация - втАмортизацияПоДокументу.Сумма)
	|				ИЛИ (втОстаткиСтоимости.ВосстановительнаяСтоимость - втОстаткиСтоимости.НакопленнаяАмортизация - втАмортизацияПоДокументу.Сумма) = 0
	|			ТОГДА 0
	|		КОГДА втТаблицаПоДокументу.МетодПереоценки = ЗНАЧЕНИЕ(Перечисление.МетодыПереоценкиВнеоборотныхАктивов.СписаниеАмортизацииПриПереоценке)
	|			ТОГДА втТаблицаПоДокументу.Стоимость - (втОстаткиСтоимости.ВосстановительнаяСтоимость - втОстаткиСтоимости.НакопленнаяАмортизация - втАмортизацияПоДокументу.Сумма)  
	|		ИНАЧЕ втОстаткиСтоимости.ВосстановительнаяСтоимость*(втТаблицаПоДокументу.Стоимость / (втОстаткиСтоимости.ВосстановительнаяСтоимость - втОстаткиСтоимости.НакопленнаяАмортизация - втАмортизацияПоДокументу.Сумма) - 1)
	|	КОНЕЦ КАК СуммаДооценкиСтоимости,
	|	ЕСТЬNULL(втПредыдущаяПереоценкаОбъектов.СуммаДооценки, 0) КАК СуммаПрошлойДооценки,
	|	ЕСТЬNULL(втПредыдущаяПереоценкаОбъектов.СуммаУценки, 0) КАК СуммаПрошлойУценки
	|ПОМЕСТИТЬ втДанныеДляПроведения
	|ИЗ
	|	втТаблицаПоДокументу КАК втТаблицаПоДокументу
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиСтоимости КАК втОстаткиСтоимости
	|		ПО втТаблицаПоДокументу.ОбъектУчета = втОстаткиСтоимости.ОбъектУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ втАмортизацияПоДокументу КАК втАмортизацияПоДокументу
	|		ПО втТаблицаПоДокументу.ОбъектУчета = втАмортизацияПоДокументу.ОбъектУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПредыдущаяПереоценкаОбъектов КАК втПредыдущаяПереоценкаОбъектов
	|		ПО втТаблицаПоДокументу.ОбъектУчета = втПредыдущаяПереоценкаОбъектов.ОбъектУчета";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы);
	
КонецПроцедуры

Процедура ПервоначальныеСведенияНМАБухгалтерскийУчет(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ПервоначальныеСведенияНМАБухгалтерскийУчет";
	
	Если Не ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаДанныеДляПроведения(ТекстыЗапроса);
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Таблица ПервоначальныеСведенияНМАБухгалтерскийУчет
	|"+
	"ВЫБРАТЬ
	|	&Ссылка КАК Регистратор,
	|	&Период КАК Период,
	|	
	|	втДанныеДляПроведения.ОбъектУчета КАК НематериальныйАктив,
	|	
	|	&Организация КАК Организация,
	|	втДанныеДляПроведения.НоваяСтоимость КАК ПервоначальнаяСтоимость,
	|	ПервоначальныеСведенияНМАБухгалтерскийУчет.СпособПоступления КАК СпособПоступления,
	|	ПервоначальныеСведенияНМАБухгалтерскийУчет.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|	ПервоначальныеСведенияНМАБухгалтерскийУчет.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	ПервоначальныеСведенияНМАБухгалтерскийУчет.СрокПолезногоИспользования
	|	- РАЗНОСТЬДАТ(ЕСТЬNULL(ПервоначальныеСведенияНМАБухгалтерскийУчет.Период, &Период), &Период, МЕСЯЦ) КАК СрокПолезногоИспользования,
	|	ПервоначальныеСведенияНМАБухгалтерскийУчет.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПервоначальныеСведенияНМАБухгалтерскийУчет.Коэффициент КАК Коэффициент
	|,	ПервоначальныеСведенияНМАБухгалтерскийУчет.КодПоОКОФ КАК КодПоОКОФ
	|	
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.СрезПоследних(
	|		&Период,
	|		Организация = &Организация
	|		И Регистратор<>&Ссылка
	|		И НематериальныйАктив = &НематериальныйАктив
	|	) КАК ПервоначальныеСведенияНМАБухгалтерскийУчет
	|	ПО втДанныеДляПроведения.ОбъектУчета = ПервоначальныеСведенияНМАБухгалтерскийУчет.НематериальныйАктив";
	
	ТекстыЗапроса.Добавить(Текст, ИмяРегистра);
	
КонецПроцедуры

Функция ПрочиеРасходы(ТекстыЗапроса, Регистры)
	
	Если Не ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений("ПрочиеРасходы", Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ВременнаяТаблицаДанныеДляПроведения(ТекстыЗапроса);
	
	Возврат
	"ВЫБРАТЬ // Уценка восстановительной стоимости
	|	&Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК ВидДеятельностиНДС,
	|	
	|	0 КАК СуммаСНДС,
	|	0 КАК СуммаБезНДС,
	|	0 КАК СуммаБезНДСУпр,
	|	втДанныеДляПроведения.СуммаУценкиСтоимости - втДанныеДляПроведения.СуммаПрошлойДооценки КАК СуммаСНДСРегл,
	|	втДанныеДляПроведения.СуммаУценкиСтоимости - втДанныеДляПроведения.СуммаПрошлойДооценки КАК СуммаБезНДСРегл,
	|	втДанныеДляПроведения.СуммаУценкиСтоимости - втДанныеДляПроведения.СуммаПрошлойДооценки КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиСтоимости > 0
	|	И втДанныеДляПроведения.ВосстановительнаяСтоимость > 0
	|	И втДанныеДляПроведения.СуммаУценкиСтоимости > втДанныеДляПроведения.СуммаПрошлойДооценки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Дооценка накопленной амортизации из доли уценки
	|	&Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК ВидДеятельностиНДС,
	|	
	|	0 КАК СуммаСНДС,
	|	0 КАК СуммаБезНДС,
	|	0 КАК СуммаБезНДСУпр,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ втДанныеДляПроведения.НакопленнаяАмортизация * (втДанныеДляПроведения.СуммаДооценки/втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК СуммаСНДСРегл,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ втДанныеДляПроведения.НакопленнаяАмортизация * (втДанныеДляПроведения.СуммаДооценки/втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК СуммаБезНДСРегл,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ втДанныеДляПроведения.НакопленнаяАмортизация * (втДанныеДляПроведения.СуммаДооценки/втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценки > 0
	|	И втДанныеДляПроведения.ВосстановительнаяСтоимость > 0
	|	И втДанныеДляПроведения.СуммаПрошлойУценки > 0
	|	И втДанныеДляПроведения.СуммаДооценки < втДанныеДляПроведения.СуммаПрошлойУценки
	|	И ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Дооценка накопленной амортизации из уценки
	|	&Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК ВидДеятельностиНДС,
	|	
	|	0 КАК СуммаСНДС,
	|	0 КАК СуммаБезНДС,
	|	0 КАК СуммаБезНДСУпр,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ (втДанныеДляПроведения.НакопленнаяАмортизация) * (втДанныеДляПроведения.СуммаПрошлойУценки/втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК СуммаСНДСРегл,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ (втДанныеДляПроведения.НакопленнаяАмортизация) * (втДанныеДляПроведения.СуммаПрошлойУценки/втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК СуммаБезНДСРегл,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ (втДанныеДляПроведения.НакопленнаяАмортизация) * (втДанныеДляПроведения.СуммаПрошлойУценки/втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценки > 0
	|	И втДанныеДляПроведения.ВосстановительнаяСтоимость > 0
	|	И втДанныеДляПроведения.СуммаПрошлойУценки > 0
	|	И втДанныеДляПроведения.СуммаДооценки >= втДанныеДляПроведения.СуммаПрошлойУценки
	|	И ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Реверс убытка от переоценки стоимости
	|	&Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК ВидДеятельностиНДС,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	0 КАК СуммаБезНДСУпр,
	|	ВЫБОР 
	|		КОГДА втДанныеДляПроведения.СуммаДооценкиСтоимости >= втДанныеДляПроведения.СуммаПрошлойУценки
	|			ТОГДА втДанныеДляПроведения.СуммаПрошлойУценки
	|		ИНАЧЕ втДанныеДляПроведения.СуммаДооценкиСтоимости
	|	КОНЕЦ КАК СуммаСНДСРегл,
	|	ВЫБОР 
	|		КОГДА втДанныеДляПроведения.СуммаДооценкиСтоимости >= втДанныеДляПроведения.СуммаПрошлойУценки
	|			ТОГДА втДанныеДляПроведения.СуммаПрошлойУценки
	|		ИНАЧЕ втДанныеДляПроведения.СуммаДооценкиСтоимости
	|	КОНЕЦ КАК СуммаБезНДСРегл,
	|	ВЫБОР 
	|		КОГДА втДанныеДляПроведения.СуммаДооценкиСтоимости >= втДанныеДляПроведения.СуммаПрошлойУценки
	|			ТОГДА втДанныеДляПроведения.СуммаПрошлойУценки
	|		ИНАЧЕ втДанныеДляПроведения.СуммаДооценкиСтоимости
	|	КОНЕЦ КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК ПВХСтатьиРасходов
	|	ПО &СтатьяРасходов = ПВХСтатьиРасходов.Ссылка
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаПрошлойУценки > 0
	|	И втДанныеДляПроведения.СуммаДооценкиСтоимости > 0
	|";
	
КонецФункции

Функция ПартииПрочихРасходов(ТекстыЗапроса, Регистры)
	
	Если Не ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений("ПартииПрочихРасходов", Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ВременнаяТаблицаДанныеДляПроведения(ТекстыЗапроса);
	
	Возврат
	"ВЫБРАТЬ // Уценка восстановительной стоимости
	|	&Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	&Ссылка КАК ДокументПоступленияРасходов,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ВидДеятельностиНДС,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	0 КАК НДСУпр,
	|	втДанныеДляПроведения.СуммаУценкиСтоимости - втДанныеДляПроведения.СуммаПрошлойДооценки КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	втДанныеДляПроведения.СуммаУценкиСтоимости - втДанныеДляПроведения.СуммаПрошлойДооценки КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиСтоимости > 0
	|	И втДанныеДляПроведения.ВосстановительнаяСтоимость > 0
	|	И втДанныеДляПроведения.СуммаУценкиСтоимости > втДанныеДляПроведения.СуммаПрошлойДооценки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Дооценка накопленной амортизации из доли уценки
	|	&Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	&Ссылка КАК ДокументПоступленияРасходов,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ВидДеятельностиНДС,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	0 КАК НДСУпр,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ (втДанныеДляПроведения.НакопленнаяАмортизация) * (втДанныеДляПроведения.СуммаДооценки/втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ (втДанныеДляПроведения.НакопленнаяАмортизация) * (втДанныеДляПроведения.СуммаДооценки/втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценки > 0
	|	И втДанныеДляПроведения.ВосстановительнаяСтоимость > 0
	|	И втДанныеДляПроведения.СуммаПрошлойУценки > 0
	|	И втДанныеДляПроведения.СуммаДооценки < втДанныеДляПроведения.СуммаПрошлойУценки
	|   И ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Дооценка накопленной амортизации из уценки
	|	&Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	&Ссылка КАК ДокументПоступленияРасходов,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ВидДеятельностиНДС,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	0 КАК НДСУпр,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ (втДанныеДляПроведения.НакопленнаяАмортизация) * ((втДанныеДляПроведения.СуммаПрошлойУценки)/втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	ВЫБОР КОГДА втДанныеДляПроведения.ВосстановительнаяСтоимость = 0
	|		ТОГДА 0
	|		ИНАЧЕ (втДанныеДляПроведения.НакопленнаяАмортизация) * ((втДанныеДляПроведения.СуммаПрошлойУценки)/втДанныеДляПроведения.ВосстановительнаяСтоимость)
	|	КОНЕЦ КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценки > 0
	|	И втДанныеДляПроведения.ВосстановительнаяСтоимость > 0
	|	И втДанныеДляПроведения.СуммаПрошлойУценки > 0
	|	И втДанныеДляПроведения.СуммаДооценки >= втДанныеДляПроведения.СуммаПрошлойУценки
	|   И ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Реверс убытка от переоценки стоимости
	|	&Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	&Ссылка КАК ДокументПоступленияРасходов,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ВидДеятельностиНДС,
	|	
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	0 КАК НДСУпр,
	|	ВЫБОР 
	|		КОГДА втДанныеДляПроведения.СуммаДооценкиСтоимости >= втДанныеДляПроведения.СуммаПрошлойУценки
	|			ТОГДА втДанныеДляПроведения.СуммаПрошлойУценки
	|		ИНАЧЕ втДанныеДляПроведения.СуммаДооценкиСтоимости
	|	КОНЕЦ КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	ВЫБОР 
	|		КОГДА втДанныеДляПроведения.СуммаДооценкиСтоимости >= втДанныеДляПроведения.СуммаПрошлойУценки
	|			ТОГДА втДанныеДляПроведения.СуммаПрошлойУценки
	|		ИНАЧЕ втДанныеДляПроведения.СуммаДооценкиСтоимости
	|	КОНЕЦ КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК ПВХСтатьиРасходов
	|	ПО &СтатьяРасходов = ПВХСтатьиРасходов.Ссылка
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаПрошлойУценки > 0
	|	И втДанныеДляПроведения.СуммаДооценкиСтоимости > 0
	|";
	
КонецФункции

Функция ТекстЗапросаТаблицаРеестрДокументов(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "РеестрДокументов";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Ссылка                                 КАК Ссылка,
	|	&Период                                 КАК ДатаДокументаИБ,
	|	&Номер                                  КАК НомерДокументаИБ,
	|	&ИдентификаторМетаданных                КАК ТипСсылки,
	|	&Организация                            КАК Организация,
	|	&ХозяйственнаяОперация                  КАК ХозяйственнаяОперация,
	|	&Подразделение                          КАК Подразделение,
	|	&Ответственный                          КАК Ответственный,
	|	&Комментарий                            КАК Комментарий,
	|	&Проведен                               КАК Проведен,
	|	&ПометкаУдаления                        КАК ПометкаУдаления,
	|	ЛОЖЬ                                    КАК ДополнительнаяЗапись,
	|	&Период                                 КАК ДатаПервичногоДокумента,
	|	&НомерНаПечать                          КАК НомерПервичногоДокумента,
	|	&Период   КАК ДатаОтраженияВУчете";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаДокументыПоНМА(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ДокументыПоНМА";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	0                                       КАК НомерЗаписи,
	|	&Ссылка                                 КАК Ссылка,
	|	&Период                                 КАК Дата,
	|	&Организация                            КАК Организация,
	|	&Подразделение                          КАК Подразделение,
	|	&ХозяйственнаяОперация                  КАК ХозяйственнаяОперация,
	|	&ИдентификаторМетаданных                КАК ТипСсылки,
	|	&Проведен                               КАК Проведен,
	|	&Проведен                               КАК ОтражатьВРеглУчете,
	|	ЛОЖЬ                                    КАК ОтражатьВУпрУчете,
	|	&НематериальныйАктив                    КАК НематериальныйАктив";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ПроведениеРегламентированныйУчет

Функция ТекстЗапросаВТОтраженияВРеглУчете() Экспорт
	
	ТекстыСозданияВременныхТаблиц = Новый Массив;
	ТекстыСозданияВременныхТаблиц.Добавить(УчетНМА.ТекстЗапросаВТОтраженияВРеглУчетеНачисленнойАмортизации("ПереоценкаНМА"));
	ТекстыСозданияВременныхТаблиц.Добавить(УчетНМА.ТекстЗапросаВТОтраженияВРеглУчетеОстаткиПоСчетам());
	ТекстыСозданияВременныхТаблиц.Добавить(ВТДанныеДокумента());
	ТекстыСозданияВременныхТаблиц.Добавить(ВТПредыдущаяПереоценкаОбъектов());
	ТекстыСозданияВременныхТаблиц.Добавить(ВТДанныеДляПроведения());
	УчетФиксированныхАктивов.ТекстЗапросаВТОтраженияВНалУчетеНМА("ПереоценкаНМА", "Переоценка",ТекстыСозданияВременныхТаблиц);
	ТекстыСозданияВременныхТаблиц.Добавить(УчетФиксированныхАктивов.ТекстЗапросаВТАналитикаУчетаВАНМА("СписаниеНакопленнойАмортизации"));
	ТекстыСозданияВременныхТаблиц.Добавить(Символы.ПС);
	
	Возврат СтрСоединить(ТекстыСозданияВременныхТаблиц, ОбщегоНазначения.РазделительПакетаЗапросов());
	
КонецФункции

Функция ВТДанныеДокумента()
	
	Возврат
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|//Временная таблица втТаблицаОбъектов
	|"+
	"ВЫБРАТЬ
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата КАК Дата,
	|	Операция.Организация КАК Организация,
	|	Операция.Подразделение КАК Подразделение,
	|	Операция.НематериальныйАктив КАК ОбъектУчета,
	|	ЕСТЬNULL(Операция.НематериальныйАктив.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	Операция.Стоимость КАК Стоимость,
	|	Операция.СчетДооценки,
	|	Операция.СтатьяДоходов,
	|	Операция.АналитикаДоходов,
	|	Операция.СтатьяРасходов,
	|	Операция.АналитикаРасходов
	|,	Операция.МетодПереоценки
	|ПОМЕСТИТЬ втДанныеДокумента
	|ИЗ
	|	Документ.ПереоценкаНМА КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета";
	
КонецФункции

Функция ВТПредыдущаяПереоценкаОбъектов()
	
	Возврат
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|//Временная таблица втПредыдущаяПереоценкаОбъектов
	|"+
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетаБухгалтерскогоУчета.СчетУчета КАК Счет
	|ПОМЕСТИТЬ втВсеСчетаУчетаСтоимости
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаНМА КАК СчетаБухгалтерскогоУчета
	|		ПО втОбъектыДокумента.ОбъектУчета = СчетаБухгалтерскогоУчета.НематериальныйАктив
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПараметрыЦелевогоФинансирования.СчетУчета
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЦелевогоФинансированияНМА КАК ПараметрыЦелевогоФинансирования
	|		ПО втОбъектыДокумента.ОбъектУчета = ПараметрыЦелевогоФинансирования.НематериальныйАктив
	|			И (ПараметрыЦелевогоФинансирования.ПрименениеЦелевогоФинансирования)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОбъектыДокумента.ОбъектУчета КАК ОбъектУчета,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0)) КАК СуммаДооценки,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0)) КАК СуммаУценки
	|ПОМЕСТИТЬ втПредыдущаяПереоценкаСтоимостиДанныеРФ
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				,
	|				&ГраницаМесяцОкончание,
	|				Регистратор,
	|				Счет В
	|					(ВЫБРАТЬ
	|						Т.Счет
	|					ИЗ
	|						втВсеСчетаУчетаСтоимости КАК Т),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НематериальныеАктивы),
	|				(Организация, Субконто1) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втОбъектыДокумента КАК Т),
	|				,
	|				) КАК ХозрасчетныйОбороты
	|		ПО втОбъектыДокумента.ОбъектУчета = ХозрасчетныйОбороты.Субконто1
	|			И втОбъектыДокумента.Организация = ХозрасчетныйОбороты.Организация
	|			И (ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПереоценкаНМА)
	|			И (ХозрасчетныйОбороты.Регистратор <> &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	втОбъектыДокумента.ОбъектУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втОбъектыДокумента.ОбъектУчета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиСтоимости, 0) > 0
	|			ТОГДА ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиСтоимости, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиСтоимости, 0) < 0
	|			ТОГДА -ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиСтоимости, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.СрезПоследних(
	|				&ГраницаМесяцНачало,
	|				(Организация, НематериальныйАктив) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втОбъектыДокумента КАК Т)) КАК ПервоначальныеСведения
	|		ПО втОбъектыДокумента.ОбъектУчета = ПервоначальныеСведения.НематериальныйАктив
	|ГДЕ
	|	ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиСтоимости, 0) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОбъектыДокумента.ОбъектУчета КАК ОбъектУчета,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт - ХозрасчетныйОбороты.СуммаОборотКт, 0)) КАК СуммаДооценки,
	|	0 КАК СуммаУценки
	|ПОМЕСТИТЬ втПредыдущаяПереоценкаСтоимостиДанные
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				,
	|				&ГраницаМесяцОкончание,
	|				Регистратор,
	|				Счет В
	|					(ВЫБРАТЬ
	|						Т.Счет
	|					ИЗ
	|						втВсеСчетаУчетаСтоимости КАК Т),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НематериальныеАктивы),
	|				(Организация, Субконто1) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втОбъектыДокумента КАК Т),
	|				КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РезервНаПереоценкуНематериальныхАктивов))
	|				,
	|				) КАК ХозрасчетныйОбороты
	|		ПО втОбъектыДокумента.ОбъектУчета = ХозрасчетныйОбороты.Субконто1
	|			И втОбъектыДокумента.Организация = ХозрасчетныйОбороты.Организация
	|			И (ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПереоценкаНМА)
	|			И (ХозрасчетныйОбороты.Регистратор <> &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	втОбъектыДокумента.ОбъектУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втОбъектыДокумента.ОбъектУчета КАК ОбъектУчета,
	|	0 КАК СуммаДооценки,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт, 0)) КАК СуммаУценки
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				,
	|				&ГраницаМесяцОкончание,
	|				Регистратор,
	|				Счет В
	|					(ВЫБРАТЬ
	|						Т.Счет
	|					ИЗ
	|						втВсеСчетаУчетаСтоимости КАК Т),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НематериальныеАктивы),
	|				(Организация, Субконто1) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втОбъектыДокумента КАК Т),
	|				КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Расходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СчетаПроизводственногоУчета))
	|				,
	|				) КАК ХозрасчетныйОбороты
	|		ПО втОбъектыДокумента.ОбъектУчета = ХозрасчетныйОбороты.Субконто1
	|			И втОбъектыДокумента.Организация = ХозрасчетныйОбороты.Организация
	|			И (ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПереоценкаНМА)
	|			И (ХозрасчетныйОбороты.Регистратор <> &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	втОбъектыДокумента.ОбъектУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втОбъектыДокумента.ОбъектУчета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиСтоимости, 0) > 0
	|			ТОГДА ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиСтоимости, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиСтоимости, 0) < 0
	|			ТОГДА -ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиСтоимости, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.СрезПоследних(
	|				&ГраницаМесяцНачало,
	|				(Организация, НематериальныйАктив) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втОбъектыДокумента КАК Т)) КАК ПервоначальныеСведения
	|		ПО втОбъектыДокумента.ОбъектУчета = ПервоначальныеСведения.НематериальныйАктив
	|ГДЕ
	|	ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиСтоимости, 0) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПредыдущаяПереоценкаСтоимостиДанные.ОбъектУчета КАК ОбъектУчета,
	|	СУММА(втПредыдущаяПереоценкаСтоимостиДанные.СуммаДооценки) КАК СуммаДооценки,
	|	СУММА(втПредыдущаяПереоценкаСтоимостиДанные.СуммаУценки) КАК СуммаУценки
	|ПОМЕСТИТЬ втПредыдущаяПереоценкаСтоимости
	|ИЗ
	|	втПредыдущаяПереоценкаСтоимостиДанные КАК втПредыдущаяПереоценкаСтоимостиДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	втПредыдущаяПереоценкаСтоимостиДанные.ОбъектУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетаБухгалтерскогоУчетаНМА.СчетНачисленияАмортизации КАК Счет
	|ПОМЕСТИТЬ втВсеСчетаУчетаАмортизации
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаНМА КАК СчетаБухгалтерскогоУчетаНМА
	|		ПО втОбъектыДокумента.ОбъектУчета = СчетаБухгалтерскогоУчетаНМА.НематериальныйАктив
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПараметрыЦелевогоФинансированияНМА.СчетАмортизации
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЦелевогоФинансированияНМА КАК ПараметрыЦелевогоФинансированияНМА
	|		ПО втОбъектыДокумента.ОбъектУчета = ПараметрыЦелевогоФинансированияНМА.НематериальныйАктив
	|			И (ПараметрыЦелевогоФинансированияНМА.ПрименениеЦелевогоФинансирования)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втОбъектыДокумента.ОбъектУчета КАК ОбъектУчета,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт, 0)) КАК СуммаДооценки,
	|	0 КАК СуммаУценки
	|ПОМЕСТИТЬ втПредыдущаяПереоценкаАмортизацииДанные
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				,
	|				&ГраницаМесяцОкончание,
	|				Регистратор,
	|				Счет В
	|					(ВЫБРАТЬ
	|						Т.Счет
	|					ИЗ
	|						втВсеСчетаУчетаАмортизации КАК Т),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НематериальныеАктивы),
	|				(Организация, Субконто1) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втОбъектыДокумента КАК Т),
	|				КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РезервНаПереоценкуНематериальныхАктивов)),
	|				) КАК ХозрасчетныйОбороты
	|		ПО втОбъектыДокумента.ОбъектУчета = ХозрасчетныйОбороты.Субконто1
	|			И втОбъектыДокумента.Организация = ХозрасчетныйОбороты.Организация
	|			И (ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПереоценкаНМА)
	|			И (ХозрасчетныйОбороты.Регистратор <> &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	втОбъектыДокумента.ОбъектУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втОбъектыДокумента.ОбъектУчета,
	|	0,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт - ХозрасчетныйОбороты.СуммаОборотКт, 0))
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				,
	|				&ГраницаМесяцОкончание,
	|				Регистратор,
	|				Счет В
	|					(ВЫБРАТЬ
	|						Т.Счет
	|					ИЗ
	|						втВсеСчетаУчетаАмортизации КАК Т),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НематериальныеАктивы),
	|				(Организация, Субконто1) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втОбъектыДокумента КАК Т),
	|				КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Доходы))
	|				,
	|				) КАК ХозрасчетныйОбороты
	|		ПО втОбъектыДокумента.ОбъектУчета = ХозрасчетныйОбороты.Субконто1
	|			И втОбъектыДокумента.Организация = ХозрасчетныйОбороты.Организация
	|			И (ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПереоценкаНМА)
	|			И (ХозрасчетныйОбороты.Регистратор <> &Ссылка)
	|			И (ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0) > 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	втОбъектыДокумента.ОбъектУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втОбъектыДокумента.ОбъектУчета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиАмортизации, 0) > 0
	|			ТОГДА ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиАмортизации, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиАмортизации, 0) < 0
	|			ТОГДА -ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиАмортизации, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	втОбъектыДокумента КАК втОбъектыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.СрезПоследних(
	|				&ГраницаМесяцНачало,
	|				(Организация, НематериальныйАктив) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втОбъектыДокумента КАК Т)) КАК ПервоначальныеСведения
	|		ПО втОбъектыДокумента.ОбъектУчета = ПервоначальныеСведения.НематериальныйАктив
	|ГДЕ
	|	ЕСТЬNULL(ПервоначальныеСведения.РезервПереоценкиАмортизации, 0) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПредыдущаяПереоценкаАмортизацииДанные.ОбъектУчета КАК ОбъектУчета,
	|	СУММА(втПредыдущаяПереоценкаАмортизацииДанные.СуммаДооценки) КАК СуммаДооценки,
	|	СУММА(втПредыдущаяПереоценкаАмортизацииДанные.СуммаУценки) КАК СуммаУценки
	|ПОМЕСТИТЬ втПредыдущаяПереоценкаАмортизации
	|ИЗ
	|	втПредыдущаяПереоценкаАмортизацииДанные КАК втПредыдущаяПереоценкаАмортизацииДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	втПредыдущаяПереоценкаАмортизацииДанные.ОбъектУчета
	|";
	
КонецФункции

Функция ВТДанныеДляПроведения()
	
	Возврат
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|//Временная таблица втДанныеДляПроведения
	|"+
	"ВЫБРАТЬ
	|	втДанныеДокумента.Ссылка КАК Ссылка,
	|	втДанныеДокумента.Дата КАК Дата,
	|	втДанныеДокумента.ОбъектУчета,
	|	втДанныеДокумента.Организация КАК Организация,
	|	втДанныеДокумента.Подразделение КАК Подразделение,
	|	втДанныеДокумента.СчетДооценки КАК СчетДооценки,
	|	втДанныеДокумента.СтатьяДоходов КАК СтатьяДоходов,
	|	втДанныеДокумента.АналитикаДоходов КАК АналитикаДоходов,
	|	втДанныеДокумента.СтатьяРасходов КАК СтатьяРасходов,
	|	втДанныеДокумента.АналитикаРасходов КАК АналитикаРасходов,
	|	втСчетаОтражения.СчетУчета КАК СчетУчета,
	|	втСчетаОтражения.СчетНачисленияАмортизации КАК СчетАмортизации,
	|	втСчетаОтражения.СчетУчетаЦФ КАК СчетУчетаЦФ,
	|	втСчетаОтражения.СчетНачисленияАмортизацииЦФ КАК СчетАмортизацииЦФ,
	|	втСчетаОтражения.ПрименениеЦелевогоФинансирования КАК ПрименениеЦелевогоФинансирования,
	|	втСчетаОтражения.СтатьяДоходов КАК СтатьяДоходовЦФ,
	|	втСчетаОтражения.АналитикаДоходов КАК АналитикаДоходовЦФ,
	|	втДанныеДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) КАК ВосстановительнаяСтоимость,
	|	ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ, 0) КАК ВосстановительнаяСтоимостьСобственныхСредств,
	|	ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) КАК ВосстановительнаяСтоимостьЦелевыхСредств,
	|	ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0) КАК НакопленнаяАмортизация,
	|	ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ, 0) КАК НакопленнаяАмортизацияСобственныхСредств,
	|	ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0) КАК НакопленнаяАмортизацияЦелевыхСредств,
	|	втДанныеДокумента.Стоимость КАК НоваяСтоимость,
	|	ВЫБОР
	|		КОГДА втОстаткиПоСчетам.ОбъектУчета ЕСТЬ NULL 
	|				ИЛИ втДанныеДокумента.Стоимость < (ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) - ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0))
	|				ИЛИ (ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) - ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0)) <= 0
	|			ТОГДА 0
	|		КОГДА втДанныеДокумента.МетодПереоценки = ЗНАЧЕНИЕ(Перечисление.МетодыПереоценкиВнеоборотныхАктивов.СписаниеАмортизацииПриПереоценке)
	|			ТОГДА втДанныеДокумента.Стоимость - (ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) - ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0))  
	|		ИНАЧЕ ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0)*(втДанныеДокумента.Стоимость / (ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) - ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0)) - 1)
	|	КОНЕЦ КАК СуммаДооценкиСтоимости,
	|	ВЫБОР
	|		КОГДА втОстаткиПоСчетам.ОбъектУчета ЕСТЬ NULL 
	|				ИЛИ (ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) - ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0)) < втДанныеДокумента.Стоимость
	|				ИЛИ (ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) - ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0)) <= 0
	|			ТОГДА 0
	|		КОГДА втДанныеДокумента.МетодПереоценки = ЗНАЧЕНИЕ(Перечисление.МетодыПереоценкиВнеоборотныхАктивов.СписаниеАмортизацииПриПереоценке)
	|			ТОГДА - втДанныеДокумента.Стоимость + (ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) - ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0))
	|		ИНАЧЕ - ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0)*(втДанныеДокумента.Стоимость / (ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) - ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0)) - 1)
	|	КОНЕЦ КАК СуммаУценкиСтоимости,
	|	ВЫБОР
	|		КОГДА втОстаткиПоСчетам.ОбъектУчета ЕСТЬ NULL 
	|               ИЛИ втДанныеДокумента.МетодПереоценки = ЗНАЧЕНИЕ(Перечисление.МетодыПереоценкиВнеоборотныхАктивов.СписаниеАмортизацииПриПереоценке)
	|				ИЛИ втДанныеДокумента.Стоимость < (ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) - ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0))
	|				ИЛИ (ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) - ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0)) <= 0
	|			ТОГДА 0
	|       ИНАЧЕ (втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ) * (втДанныеДокумента.Стоимость / (ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) - ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0)) - 1)
	|	КОНЕЦ КАК СуммаДооценкиАмортизации,
	|	ВЫБОР
	|		КОГДА втОстаткиПоСчетам.ОбъектУчета ЕСТЬ NULL 
	|               ИЛИ втДанныеДокумента.МетодПереоценки = ЗНАЧЕНИЕ(Перечисление.МетодыПереоценкиВнеоборотныхАктивов.СписаниеАмортизацииПриПереоценке)
	|				ИЛИ (ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) - ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0)) < втДанныеДокумента.Стоимость
	|				ИЛИ (ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) - ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0)) <= 0
	|			ТОГДА 0
	|       ИНАЧЕ -(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ) * (втДанныеДокумента.Стоимость / (ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) - ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0)) - 1)
	|	КОНЕЦ КАК СуммаУценкиАмортизации,
	|	ВЫБОР
	|		КОГДА втОстаткиПоСчетам.ОбъектУчета ЕСТЬ NULL 
	|				ИЛИ (ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) - ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0)) <= 0
	|				ИЛИ втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ > (- ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0)*(втДанныеДокумента.Стоимость / (ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) - ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0)) - 1) - втПредыдущаяПереоценкаСтоимости.СуммаДооценки)
	|			ТОГДА 0
	|		ИНАЧЕ	
	|			- ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0)*(втДанныеДокумента.Стоимость / (ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) - ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0)) - 1)
	|			- втПредыдущаяПереоценкаСтоимости.СуммаДооценки
	|			- втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ
	|	КОНЕЦ КАК СуммаУценкиСтоимостиЦелевыхСредств,
	|	ВЫБОР
	|		КОГДА (втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ) = 0
	|			ТОГДА 0
	|		КОГДА втОстаткиПоСчетам.ОбъектУчета ЕСТЬ NULL 
	|				ИЛИ (ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) - ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0)) <= 0
	|				ИЛИ втОстаткиПоСчетам.НакопленнаяАмортизацияБУ > (-(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ) * (втДанныеДокумента.Стоимость / (ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) - ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0)) - 1) - втПредыдущаяПереоценкаАмортизации.СуммаДооценки)
	|			ТОГДА 0
	|		ИНАЧЕ
	|			-(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ) * (втДанныеДокумента.Стоимость / (ЕСТЬNULL(втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУ + втОстаткиПоСчетам.ВосстановительнаяСтоимостьБУЦФ, 0) - ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияБУ + втОстаткиПоСчетам.НакопленнаяАмортизацияБУЦФ, 0)) - 1)
	|			- втПредыдущаяПереоценкаАмортизации.СуммаДооценки
	|			- втОстаткиПоСчетам.НакопленнаяАмортизацияБУ
	|	КОНЕЦ КАК СуммаУценкиАмортизацииЦелевыхСредств,
	|	ЕСТЬNULL(втПредыдущаяПереоценкаСтоимости.СуммаДооценки, 0) КАК СуммаПрошлойДооценкиСтоимости,
	|	ЕСТЬNULL(втПредыдущаяПереоценкаСтоимости.СуммаУценки, 0) КАК СуммаПрошлойУценкиСтоимости,
	|	ЕСТЬNULL(втПредыдущаяПереоценкаАмортизации.СуммаДооценки, 0) КАК СуммаПрошлойДооценкиАмортизации,
	|	ЕСТЬNULL(втПредыдущаяПереоценкаАмортизации.СуммаУценки, 0) КАК СуммаПрошлойУценкиАмортизации
	|,
	|	ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияНУ, 0) КАК НакопленнаяАмортизацияСобственныхСредствНУ,
	|	ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияВР, 0) КАК НакопленнаяАмортизацияСобственныхСредствВР,
	|	ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияПР, 0) КАК НакопленнаяАмортизацияСобственныхСредствПР,
	|	ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияНУЦФ, 0) КАК НакопленнаяАмортизацияЦелевыхСредствНУ,
	|	ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияВРЦФ, 0) КАК НакопленнаяАмортизацияЦелевыхСредствВР,
	|	ЕСТЬNULL(втОстаткиПоСчетам.НакопленнаяАмортизацияПРЦФ, 0) КАК НакопленнаяАмортизацияЦелевыхСредствПР,
	|   втДанныеДокумента.МетодПереоценки КАК МетодПереоценки
	|ПОМЕСТИТЬ втДанныеДляПроведения
	|ИЗ
	|	втДанныеДокумента КАК втДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСчетаОтражения КАК втСчетаОтражения
	|		ПО втДанныеДокумента.ОбъектУчета = втСчетаОтражения.ОбъектУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиПоСчетам КАК втОстаткиПоСчетам
	|		ПО втДанныеДокумента.ОбъектУчета = втОстаткиПоСчетам.ОбъектУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПредыдущаяПереоценкаСтоимости КАК втПредыдущаяПереоценкаСтоимости
	|		ПО втДанныеДокумента.ОбъектУчета = втПредыдущаяПереоценкаСтоимости.ОбъектУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПредыдущаяПереоценкаАмортизации КАК втПредыдущаяПереоценкаАмортизации
	|		ПО втДанныеДокумента.ОбъектУчета = втПредыдущаяПереоценкаАмортизации.ОбъектУчета";
	
КонецФункции

Функция ТекстОтраженияВРеглУчете() Экспорт
	
	ТекстыОтражения = Новый Массив;
	ТекстыОтражения.Добавить(УчетНМА.ТекстОтраженияВРеглУчетеНачисленнойАмортизации());
	ТекстыОтражения.Добавить(ДооценкаВосстановительнойСтоимости());
	ТекстыОтражения.Добавить(ДооценкаВосстановительнойСтоимостиИзДолиУценки());
	ТекстыОтражения.Добавить(ДооценкаВосстановительнойСтоимостиИзУценки());
	ТекстыОтражения.Добавить(ДооценкаНакопленнойАмортизации());
	ТекстыОтражения.Добавить(ДооценкаНакопленнойАмортизацииИзДолиУценки());
	ТекстыОтражения.Добавить(ДооценкаНакопленнойАмортизацииИзУценки());
	ТекстыОтражения.Добавить(УценкаВосстановительнойСтоимости());
	ТекстыОтражения.Добавить(УценкаВосстановительнойСтоимостиЦФ());
	ТекстыОтражения.Добавить(УценкаВосстановительнойСтоимостиИзДолиДооценки());
	ТекстыОтражения.Добавить(УценкаВосстановительнойСтоимостиИзДооценки());
	ТекстыОтражения.Добавить(УценкаНакопленнойАмортизации());
	ТекстыОтражения.Добавить(УценкаНакопленнойАмортизацииЦФ());
	ТекстыОтражения.Добавить(УценкаНакопленнойАмортизацииИзДолиДооценки());
	ТекстыОтражения.Добавить(УценкаНакопленнойАмортизацииИзДооценки());
	ТекстыОтражения.Добавить(СписаниеНакопленнойАмортизацииПриПереоценке());
	ТекстыОтражения.Добавить(СписаниеНакопленнойАмортизацииПриПереоценкеЦФ());
	ТекстыОтражения.Добавить(ПризнаниеДоходовОтЦелевогоФинансирования());
	
	Возврат СтрСоединить(ТекстыОтражения, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
КонецФункции

Функция ДооценкаВосстановительнойСтоимости()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Дооценка восстановительной стоимости (Дт СчетУчета :: Кт СчетДооценки)
	|ВЫБРАТЬ 
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаДооценкиСтоимости - втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	втДанныеДляПроведения.СчетУчета КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	АналитикаУчетаВА.КлючАналитики КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаДооценкиСтоимости - втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	втДанныеДляПроведения.СчетДооценки КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаДооценкиСтоимости - втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Дооценка стоимости"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикаУчетаВАПереоценка КАК АналитикаУчетаВА
	|		ПО втДанныеДляПроведения.ОбъектУчета = АналитикаУчетаВА.ОбъектУчета
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаДооценкиСтоимости > втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости
	|";
КонецФункции

Функция ДооценкаВосстановительнойСтоимостиИзДолиУценки()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Дооценка восстановительной стоимости из уценки (Дт СчетУчета :: Кт 91.01)
	|ВЫБРАТЬ 
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаДооценкиСтоимости КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	втДанныеДляПроведения.СчетУчета КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	АналитикаУчетаВА.КлючАналитики КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаДооценкиСтоимости КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ВЫБОР КОГДА СтатьиСтроительства.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	КОНЕЦ КАК ВидСчетаКт,
	|	втДанныеДляПроведения.СтатьяРасходов КАК АналитикаУчетаКт,
	|	втДанныеДляПроведения.Подразделение КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		втДанныеДляПроведения.АналитикаРасходов // Объект строительства
	|	ИНАЧЕ
	|		втДанныеДляПроведения.СтатьяРасходов
	|	КОНЕЦ КАК СубконтоКт1,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		втДанныеДляПроведения.СтатьяРасходов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоКт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный)
	|	ИНАЧЕ
	|		втДанныеДляПроведения.ОбъектУчета
	|	КОНЕЦ КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаДооценкиСтоимости КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Реверс убытка от переоценки стоимости"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО втДанныеДляПроведения.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикаУчетаВАПереоценка КАК АналитикаУчетаВА
	|		ПО втДанныеДляПроведения.ОбъектУчета = АналитикаУчетаВА.ОбъектУчета
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаДооценкиСтоимости < втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости
	|";
КонецФункции

Функция ДооценкаВосстановительнойСтоимостиИзУценки()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Дооценка восстановительной стоимости из предыдущей уценки (Дт СчетУчета :: Кт 91.01)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	втДанныеДляПроведения.СчетУчета КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	АналитикаУчетаВА.КлючАналитики КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ВЫБОР КОГДА СтатьиСтроительства.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	КОНЕЦ КАК ВидСчетаКт,
	|	втДанныеДляПроведения.СтатьяРасходов КАК АналитикаУчетаКт,
	|	втДанныеДляПроведения.Подразделение КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		втДанныеДляПроведения.АналитикаРасходов // Объект строительства
	|	ИНАЧЕ
	|		втДанныеДляПроведения.СтатьяРасходов
	|	КОНЕЦ КАК СубконтоКт1,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		втДанныеДляПроведения.СтатьяРасходов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоКт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный)
	|	ИНАЧЕ
	|		втДанныеДляПроведения.ОбъектУчета
	|	КОНЕЦ КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Реверс убытка от переоценки стоимости"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО втДанныеДляПроведения.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикаУчетаВАПереоценка КАК АналитикаУчетаВА
	|		ПО втДанныеДляПроведения.ОбъектУчета = АналитикаУчетаВА.ОбъектУчета
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаДооценкиСтоимости >= втДанныеДляПроведения.СуммаПрошлойУценкиСтоимости
	|";
КонецФункции

Функция ДооценкаНакопленнойАмортизации()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Дооценка накопленной амортизации (Дт СчетДооценки :: Кт СчетАмортизации)
	|ВЫБРАТЬ 
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаДооценкиАмортизации - втДанныеДляПроведения.СуммаПрошлойУценкиАмортизации КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	втДанныеДляПроведения.СчетДооценки КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаДооценкиАмортизации - втДанныеДляПроведения.СуммаПрошлойУценкиАмортизации КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	втДанныеДляПроведения.СчетАмортизации КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	АналитикаУчетаВА.КлючАналитики КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаДооценкиАмортизации - втДанныеДляПроведения.СуммаПрошлойУценкиАмортизации КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Дооценка накопленной амортизации"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикаУчетаВАПереоценка КАК АналитикаУчетаВА
	|		ПО втДанныеДляПроведения.ОбъектУчета = АналитикаУчетаВА.ОбъектУчета
	|
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценкиАмортизации > 0
	|	И втДанныеДляПроведения.СуммаДооценкиАмортизации > втДанныеДляПроведения.СуммаПрошлойУценкиАмортизации
	|";
КонецФункции

Функция ДооценкаНакопленнойАмортизацииИзДолиУценки()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Дооценка накопленной амортизации из уценки (Дт 91.02 :: Кт СчетАмортизации)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаДооценкиАмортизации КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаДт,
	|	втДанныеДляПроведения.СтатьяДоходов КАК АналитикаУчетаДт,
	|	втДанныеДляПроведения.Подразделение КАК МестоУчетаДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК СчетДт,
	|	втДанныеДляПроведения.СтатьяДоходов КАК СубконтоДт1,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт2,
	|	втДанныеДляПроведения.АналитикаДоходов КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаДооценкиАмортизации КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	втДанныеДляПроведения.СчетАмортизации КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	АналитикаУчетаВА.КлючАналитики КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаДооценкиАмортизации КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Реверс дохода от переоценки амортизации"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО втДанныеДляПроведения.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикаУчетаВАПереоценка КАК АналитикаУчетаВА
	|		ПО втДанныеДляПроведения.ОбъектУчета = АналитикаУчетаВА.ОбъектУчета
	|
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценкиАмортизации > 0
	|	И втДанныеДляПроведения.СуммаДооценкиАмортизации < втДанныеДляПроведения.СуммаПрошлойУценкиАмортизации
	|";
КонецФункции

Функция ДооценкаНакопленнойАмортизацииИзУценки()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Дооценка накопленной амортизации из уценки (Дт 91.02 :: Кт СчетАмортизации)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаПрошлойУценкиАмортизации КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаДт,
	|	втДанныеДляПроведения.СтатьяДоходов КАК АналитикаУчетаДт,
	|	втДанныеДляПроведения.Подразделение КАК МестоУчетаДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК СчетДт,
	|	втДанныеДляПроведения.СтатьяДоходов КАК СубконтоДт1,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт2,
	|	втДанныеДляПроведения.АналитикаДоходов КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаПрошлойУценкиАмортизации КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	втДанныеДляПроведения.СчетАмортизации КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	АналитикаУчетаВА.КлючАналитики КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаПрошлойУценкиАмортизации КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Реверс дохода от переоценки амортизации"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО втДанныеДляПроведения.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикаУчетаВАПереоценка КАК АналитикаУчетаВА
	|		ПО втДанныеДляПроведения.ОбъектУчета = АналитикаУчетаВА.ОбъектУчета
	|
	|ГДЕ
	|	втДанныеДляПроведения.СуммаДооценкиАмортизации > 0
	|	И втДанныеДляПроведения.СуммаПрошлойУценкиАмортизации > 0
	|	И втДанныеДляПроведения.СуммаДооценкиАмортизации >= втДанныеДляПроведения.СуммаПрошлойУценкиАмортизации
	|";
КонецФункции

Функция УценкаВосстановительнойСтоимости()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уценка восстановительной стоимости (Дт 91.02 :: Кт СчетУчета)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаУценкиСтоимости - втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости - втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ВЫБОР КОГДА СтатьиСтроительства.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	КОНЕЦ КАК ВидСчетаДт,
	|	втДанныеДляПроведения.СтатьяРасходов КАК АналитикаУчетаДт,
	|	втДанныеДляПроведения.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		втДанныеДляПроведения.АналитикаРасходов // Объект строительства
	|	ИНАЧЕ
	|		втДанныеДляПроведения.СтатьяРасходов
	|	КОНЕЦ КАК СубконтоДт1,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		втДанныеДляПроведения.СтатьяРасходов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный)
	|	ИНАЧЕ
	|		втДанныеДляПроведения.ОбъектУчета
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаУценкиСтоимости - втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости - втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	втДанныеДляПроведения.СчетУчета КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	АналитикаУчетаВА.КлючАналитики КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаУценкиСтоимости - втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости - втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Уценка стоимости"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО втДанныеДляПроведения.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикаУчетаВАПереоценка КАК АналитикаУчетаВА
	|		ПО втДанныеДляПроведения.ОбъектУчета = АналитикаУчетаВА.ОбъектУчета
	|
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаУценкиСтоимости > втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости + втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств
	|";
КонецФункции

Функция УценкаВосстановительнойСтоимостиЦФ()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уценка целевых средств в восстановительной стоимости (Дт 91.02 :: Кт СчетУчетаЦФ)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ВЫБОР КОГДА СтатьиСтроительства.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	КОНЕЦ КАК ВидСчетаДт,
	|	втДанныеДляПроведения.СтатьяРасходов КАК АналитикаУчетаДт,
	|	втДанныеДляПроведения.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		втДанныеДляПроведения.АналитикаРасходов // Объект строительства
	|	ИНАЧЕ
	|		втДанныеДляПроведения.СтатьяРасходов
	|	КОНЕЦ КАК СубконтоДт1,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		втДанныеДляПроведения.СтатьяРасходов
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее)
	|	КОНЕЦ КАК СубконтоДт2,
	|	ВЫБОР КОГДА СтатьиСтроительства.Ссылка ЕСТЬ НЕ NULL ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.СпособыСтроительства.Подрядный)
	|	ИНАЧЕ
	|		втДанныеДляПроведения.ОбъектУчета
	|	КОНЕЦ КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	втДанныеДляПроведения.СчетУчетаЦФ КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	АналитикаУчетаВА.КлючАналитики КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Уценка целевых средств в стоимости"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО втДанныеДляПроведения.СтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикаУчетаВАПереоценка КАК АналитикаУчетаВА
	|		ПО втДанныеДляПроведения.ОбъектУчета = АналитикаУчетаВА.ОбъектУчета
	|
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств > 0
	|";
КонецФункции

Функция УценкаВосстановительнойСтоимостиИзДолиДооценки()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уценка восстановительной стоимости из дооценки (Дт СчетДооценки :: Кт СчетУчета)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаУценкиСтоимости КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	втДанныеДляПроведения.СчетДооценки КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаУценкиСтоимости КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	втДанныеДляПроведения.СчетУчета КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	АналитикаУчетаВА.КлючАналитики КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаУценкиСтоимости КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Погашение резерва переоценки стоимости"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикаУчетаВАПереоценка КАК АналитикаУчетаВА
	|		ПО втДанныеДляПроведения.ОбъектУчета = АналитикаУчетаВА.ОбъектУчета
	|
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаУценкиСтоимости < втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости
	|";
КонецФункции

Функция УценкаВосстановительнойСтоимостиИзДооценки()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уценка восстановительной стоимости из предыдущей дооценки (Дт СчетДооценки :: Кт СчетУчета)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	втДанныеДляПроведения.СчетДооценки КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	втДанныеДляПроведения.СчетУчета КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	АналитикаУчетаВА.КлючАналитики КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Погашение резерва переоценки стоимости"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикаУчетаВАПереоценка КАК АналитикаУчетаВА
	|		ПО втДанныеДляПроведения.ОбъектУчета = АналитикаУчетаВА.ОбъектУчета
	|
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости > 0
	|	И втДанныеДляПроведения.СуммаУценкиСтоимости >= втДанныеДляПроведения.СуммаПрошлойДооценкиСтоимости
	|";
КонецФункции

Функция УценкаНакопленнойАмортизации()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уценка накопленной амортизации (Дт СчетАмортизации :: Кт 91.01)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаУценкиАмортизации - втДанныеДляПроведения.СуммаПрошлойДооценкиАмортизации - втДанныеДляПроведения.СуммаУценкиАмортизацииЦелевыхСредств КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	втДанныеДляПроведения.СчетАмортизации КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	АналитикаУчетаВА.КлючАналитики КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаУценкиАмортизации - втДанныеДляПроведения.СуммаПрошлойДооценкиАмортизации - втДанныеДляПроведения.СуммаУценкиАмортизацииЦелевыхСредств КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	втДанныеДляПроведения.СтатьяДоходов КАК АналитикаУчетаКт,
	|	втДанныеДляПроведения.Подразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|	втДанныеДляПроведения.СтатьяДоходов КАК СубконтоКт1,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт2,
	|	втДанныеДляПроведения.АналитикаДоходов КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаУценкиАмортизации - втДанныеДляПроведения.СуммаПрошлойДооценкиАмортизации - втДанныеДляПроведения.СуммаУценкиАмортизацииЦелевыхСредств КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Уценка накопленной амортизации"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикаУчетаВАПереоценка КАК АналитикаУчетаВА
	|		ПО втДанныеДляПроведения.ОбъектУчета = АналитикаУчетаВА.ОбъектУчета
	|
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиАмортизации > 0
	|	И втДанныеДляПроведения.СуммаУценкиАмортизации > втДанныеДляПроведения.СуммаПрошлойДооценкиАмортизации + втДанныеДляПроведения.СуммаУценкиАмортизацииЦелевыхСредств
	|";
КонецФункции

Функция УценкаНакопленнойАмортизацииЦФ()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уценка целевых средств в накопленной амортизации (Дт СчетАмортизации :: Кт 91.01)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаУценкиАмортизацииЦелевыхСредств КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	втДанныеДляПроведения.СчетАмортизацииЦФ КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	АналитикаУчетаВА.КлючАналитики КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаУценкиАмортизацииЦелевыхСредств КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	втДанныеДляПроведения.СтатьяДоходов КАК АналитикаУчетаКт,
	|	втДанныеДляПроведения.Подразделение КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|	втДанныеДляПроведения.СтатьяДоходов КАК СубконтоКт1,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт2,
	|	втДанныеДляПроведения.АналитикаДоходов КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаУценкиАмортизацииЦелевыхСредств КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Уценка целевых средств в накопленной амортизации"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикаУчетаВАПереоценка КАК АналитикаУчетаВА
	|		ПО втДанныеДляПроведения.ОбъектУчета = АналитикаУчетаВА.ОбъектУчета
	|
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиАмортизацииЦелевыхСредств > 0
	|";
КонецФункции

Функция УценкаНакопленнойАмортизацииИзДолиДооценки()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уценка накопленной амортизации из дооценки (Дт СчетАмортизации :: Кт СчетДооценки)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаУценкиАмортизации КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	втДанныеДляПроведения.СчетАмортизации КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	АналитикаУчетаВА.КлючАналитики КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаУценкиАмортизации КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	втДанныеДляПроведения.СчетДооценки КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаУценкиАмортизации КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Погашение резерва переоценки амортизаци"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикаУчетаВАПереоценка КАК АналитикаУчетаВА
	|		ПО втДанныеДляПроведения.ОбъектУчета = АналитикаУчетаВА.ОбъектУчета
	|
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиАмортизации > 0
	|	И втДанныеДляПроведения.СуммаУценкиАмортизации < втДанныеДляПроведения.СуммаПрошлойДооценкиАмортизации
	|";
КонецФункции

Функция УценкаНакопленнойАмортизацииИзДооценки()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Уценка накопленной амортизации из дооценки (Дт СчетАмортизации :: Кт СчетДооценки)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаПрошлойДооценкиАмортизации КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	втДанныеДляПроведения.СчетАмортизации КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	АналитикаУчетаВА.КлючАналитики КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	втДанныеДляПроведения.СуммаПрошлойДооценкиАмортизации КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	втДанныеДляПроведения.СчетДооценки КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	втДанныеДляПроведения.СуммаПрошлойДооценкиАмортизации КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Погашение резерва переоценки амортизациии"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикаУчетаВАПереоценка КАК АналитикаУчетаВА
	|		ПО втДанныеДляПроведения.ОбъектУчета = АналитикаУчетаВА.ОбъектУчета
	|
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиАмортизации > 0
	|	И втДанныеДляПроведения.СуммаПрошлойДооценкиАмортизации > 0
	|	И втДанныеДляПроведения.СуммаУценкиАмортизации >= втДанныеДляПроведения.СуммаПрошлойДооценкиАмортизации
	|";
КонецФункции

Функция ПризнаниеДоходовОтЦелевогоФинансирования()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Признание доходов от целевого финансирования (Дт 98 :: Кт 91)
	|ВЫБРАТЬ
	|	
	|	&Ссылка КАК Ссылка,
	|	&Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств - втДанныеДляПроведения.СуммаУценкиАмортизацииЦелевыхСредств КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолгосрочныеДоходыБудущихПериодов) КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств - втДанныеДляПроведения.СуммаУценкиАмортизацииЦелевыхСредств КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	втДанныеДляПроведения.СтатьяДоходовЦФ КАК АналитикаУчетаКт,
	|	втДанныеДляПроведения.Подразделение КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	втДанныеДляПроведения.СтатьяДоходовЦФ КАК СубконтоКт1,
	|	втДанныеДляПроведения.АналитикаДоходовЦФ КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств - втДанныеДляПроведения.СуммаУценкиАмортизацииЦелевыхСредств КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Признание доходов от целевого финансирования при уценке остаточной стоимости"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|	
	|ГДЕ
	|	втДанныеДляПроведения.СуммаУценкиСтоимостиЦелевыхСредств > 0
	|	И втДанныеДляПроведения.ПрименениеЦелевогоФинансирования
	|";
	
КонецФункции

Процедура ВременнаяТаблицаПредыдущаяПереоценкаОбъектовДанные(ТекстыЗапроса)
	
	ИмяТаблицы = "втПредыдущаяПереоценкаОбъектовДанные";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяТаблицаПоДокументу(ТекстыЗапроса);
	
	Текст =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|//Временная таблица втПредыдущаяПереоценкаОбъектовДанные
	|"+
	"ВЫБРАТЬ
	|	втТаблицаПоДокументу.ОбъектУчета КАК ОбъектУчета,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт - ХозрасчетныйОбороты.СуммаОборотКт, 0)) КАК СуммаДооценки,
	|	0 КАК СуммаУценки
	|ПОМЕСТИТЬ втПредыдущаяПереоценкаОбъектовДанные
	|ИЗ
	|	втТаблицаПоДокументу КАК втТаблицаПоДокументу
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				,
	|				&ГраницаМесяцОкончание,
	|				Регистратор,
	|				Счет В
	|					(ВЫБРАТЬ
	|						Т.СчетУчета
	|					ИЗ
	|						РегистрСведений.СчетаБухгалтерскогоУчетаНМА КАК Т),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НематериальныеАктивы),
	|				(Организация, Субконто1) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втТаблицаПоДокументу КАК Т),
	|				КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РезервНаПереоценкуНематериальныхАктивов))
	|				,
	|				) КАК ХозрасчетныйОбороты
	|		ПО втТаблицаПоДокументу.ОбъектУчета = ХозрасчетныйОбороты.Субконто1
	|			И втТаблицаПоДокументу.Организация = ХозрасчетныйОбороты.Организация
	|			И (ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПереоценкаНМА)
	|			И (ХозрасчетныйОбороты.Регистратор <> &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	втТаблицаПоДокументу.ОбъектУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втТаблицаПоДокументу.ОбъектУчета КАК ОбъектУчета,
	|	0 КАК СуммаДооценки,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт, 0)) КАК СуммаУценки
	|ИЗ
	|	втТаблицаПоДокументу КАК втТаблицаПоДокументу
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(
	|				,
	|				&ГраницаМесяцОкончание,
	|				Регистратор,
	|				Счет В
	|					(ВЫБРАТЬ
	|						Т.СчетУчета
	|					ИЗ
	|						РегистрСведений.СчетаБухгалтерскогоУчетаНМА КАК Т),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НематериальныеАктивы),
	|				(Организация, Субконто1) В
	|					(ВЫБРАТЬ
	|						Т.Организация,
	|						Т.ОбъектУчета
	|					ИЗ
	|						втТаблицаПоДокументу КАК Т),
	|				КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Расходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СчетаПроизводственногоУчета))
	|				,
	|				) КАК ХозрасчетныйОбороты
	|		ПО втТаблицаПоДокументу.ОбъектУчета = ХозрасчетныйОбороты.Субконто1
	|			И втТаблицаПоДокументу.Организация = ХозрасчетныйОбороты.Организация
	|			И (ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПереоценкаНМА)
	|			И (ХозрасчетныйОбороты.Регистратор <> &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	втТаблицаПоДокументу.ОбъектУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектУчета";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
		
КонецПроцедуры

Функция СписаниеНакопленнойАмортизацииПриПереоценке()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Списание накопленной амортизации при переоценке (Дт СчетАмортизации :: Кт СчетУчета)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.НакопленнаяАмортизацияСобственныхСредств КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	втДанныеДляПроведения.СчетАмортизации КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	АналитикаУчетаВА.КлючАналитики КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	втДанныеДляПроведения.НакопленнаяАмортизацияСобственныхСредствНУ КАК СуммаНУДт,
	|	втДанныеДляПроведения.НакопленнаяАмортизацияСобственныхСредствПР КАК СуммаПРДт,
	|	втДанныеДляПроведения.НакопленнаяАмортизацияСобственныхСредствВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	втДанныеДляПроведения.СчетУчета КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	АналитикаУчетаВА.КлючАналитики КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	втДанныеДляПроведения.НакопленнаяАмортизацияСобственныхСредствНУ КАК СуммаНУКт,
	|	втДанныеДляПроведения.НакопленнаяАмортизацияСобственныхСредствПР КАК СуммаПРКт,
	|	втДанныеДляПроведения.НакопленнаяАмортизацияСобственныхСредствВР КАК СуммаВРКт,
	|	
	|	""Списана амортизация при переоценке"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикаУчетаВАСписаниеНакопленнойАмортизации КАК АналитикаУчетаВА
	|		ПО втДанныеДляПроведения.ОбъектУчета = АналитикаУчетаВА.ОбъектУчета
	|
	|ГДЕ
	|	втДанныеДляПроведения.МетодПереоценки = ЗНАЧЕНИЕ(Перечисление.МетодыПереоценкиВнеоборотныхАктивов.СписаниеАмортизацииПриПереоценке)
	|	И втДанныеДляПроведения.НакопленнаяАмортизацияСобственныхСредств > 0
	|";

КонецФункции

Функция СписаниеНакопленнойАмортизацииПриПереоценкеЦФ()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Списание накопленной амортизации при переоценке (Дт СчетАмортизации :: Кт СчетУчета)
	|ВЫБРАТЬ
	|	
	|	втДанныеДляПроведения.Ссылка КАК Ссылка,
	|	втДанныеДляПроведения.Дата КАК Период,
	|	втДанныеДляПроведения.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	втДанныеДляПроведения.НакопленнаяАмортизацияЦелевыхСредств КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеДт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	втДанныеДляПроведения.СчетАмортизации КАК СчетДт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоДт1,
	|	АналитикаУчетаВА.КлючАналитики КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	втДанныеДляПроведения.НакопленнаяАмортизацияЦелевыхСредствНУ КАК СуммаНУДт,
	|	втДанныеДляПроведения.НакопленнаяАмортизацияЦелевыхСредствПР КАК СуммаПРДт,
	|	втДанныеДляПроведения.НакопленнаяАмортизацияЦелевыхСредствВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	втДанныеДляПроведения.Подразделение КАК ПодразделениеКт,
	|	втДанныеДляПроведения.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	втДанныеДляПроведения.СчетУчета КАК СчетКт,
	|	втДанныеДляПроведения.ОбъектУчета КАК СубконтоКт1,
	|	АналитикаУчетаВА.КлючАналитики КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	втДанныеДляПроведения.НакопленнаяАмортизацияЦелевыхСредствНУ КАК СуммаНУКт,
	|	втДанныеДляПроведения.НакопленнаяАмортизацияЦелевыхСредствПР КАК СуммаПРКт,
	|	втДанныеДляПроведения.НакопленнаяАмортизацияЦелевыхСредствВР КАК СуммаВРКт,
	|	
	|	""Списана амортизация при переоценке"" КАК Содержание
	|ИЗ
	|	втДанныеДляПроведения КАК втДанныеДляПроведения
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикаУчетаВАСписаниеНакопленнойАмортизации КАК АналитикаУчетаВА
	|		ПО втДанныеДляПроведения.ОбъектУчета = АналитикаУчетаВА.ОбъектУчета
	|
	|ГДЕ
	|	втДанныеДляПроведения.МетодПереоценки = ЗНАЧЕНИЕ(Перечисление.МетодыПереоценкиВнеоборотныхАктивов.СписаниеАмортизацииПриПереоценке)
	|	И втДанныеДляПроведения.НакопленнаяАмортизацияЦелевыхСредств > 0
	|";

КонецФункции

Процедура СоздатьКлючиАналитикиУчетаВА() Экспорт
	
	//создадим ключи в видом движения стоимости "Переоценка", "СписаниеНакопленнойАмортизации" для каждого вида актива
	ВидыАктива = Новый Массив;
	
	ВидыАктива.Добавить(Перечисления.ВидАктиваНУ.ФиксированныйАктив);
	ВидыАктива.Добавить(Перечисления.ВидАктиваНУ.НеФиксированныйАктив);
	ВидыАктива.Добавить(Перечисления.ВидАктиваНУ.ФиксированныйАктивУчитываемыйОтдельно);
	
	ВидыДвижений = Новый Массив;
	ВидыДвижений.Добавить(Перечисления.ВидыДвиженияСтоимостиФА.Переоценка);
	ВидыДвижений.Добавить(Перечисления.ВидыДвиженияСтоимостиФА.СписаниеНакопленнойАмортизации);
	
	УчетФиксированныхАктивов.СоздатьКлючиАналитикиУчетаВА(ВидыАктива, ВидыДвижений);
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область БлокировкаПриОбновленииИБ

Процедура ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(ПредставлениеОперации)
	
	ВходящиеДанные = Новый Соответствие;
	
	УчетНМА.ЗаполнитьВходящиеДанныеАмортизации(ВходящиеДанные);
	
	ЗакрытиеМесяцаСервер.ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(ВходящиеДанные, ПредставлениеОперации);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
