
&НаКлиенте
Процедура КомандаВыбратьПериодЛога(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();                                 
	Диалог.Период = Новый СтандартныйПериод(ЭтаФорма.ПериодНачалоЛога, ЭтаФорма.ПериодКонецЛога);
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("УстановитьПериодЗавершениеЛога", ЭтаФорма, Новый Структура("Диалог", Диалог));
	Диалог.Показать(ОписаниеОповещенияОЗакрытии); 	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодЗавершениеЛога(Период, ДополнительныеПараметры) Экспорт	
	
	Диалог = ДополнительныеПараметры.Диалог; 	
    Если НЕ Период = Неопределено Тогда		
        ЭтаФорма.ПериодНачалоЛога = Диалог.Период.ДатаНачала;
        ЭтаФорма.ПериодКонецЛога  = Диалог.Период.ДатаОкончания;		
    КонецЕсли;
    
КонецПроцедуры

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяСобытия = "Запуск обработки";
	МассивЛогаСобытий = Новый Массив;
	
	ОбработкаОбъект 	   = РеквизитФормыВЗначение("Объект");
    ПолноеИмяОбработки	   = ОбработкаОбъект.Метаданные().ПолноеИмя();
	ВерсияОбработки        = ОбработкаОбъект.ПолучитьВерсиюОбработки();
    ЭтаФорма.ОбработкаТип  = ЗначениеВСтрокуВнутр(ТипЗнч(ОбработкаОбъект)); // Установим внутреннее строковое представление типа значения объекта обработки
	
	ЭтаФорма.ОбъектСсылка = Параметры.ДополнительнаяОбработкаСсылка;
	
	МетаОбработкаИмя = ОбработкаОбъект.Метаданные().Имя;
	Если НЕ Метаданные.Обработки.Найти(МетаОбработкаИмя) = Неопределено
		И ТипЗнч(ОбработкаОбъект) = Тип("ОбработкаОбъект." + МетаОбработкаИмя) Тогда
		ЭтаФорма.ЭтоВнешняяОбработка = Ложь;
		ЭтаФорма.ИспользуемоеИмяФайла = МетаОбработкаИмя;
	Иначе
		ЭтаФорма.ЭтоВнешняяОбработка = Истина;
		ЭтаФорма.ИспользуемоеИмяФайла = ОбработкаОбъект.ИспользуемоеИмяФайла;
	КонецЕсли;
	
	РежимИспользования = "файл внешней обработки";
	Если Найти(ЭтаФорма.ИспользуемоеИмяФайла, "e1cib") = 1 Тогда 		
		РежимИспользования = "обработка в справочнике внешних обработок";  
		ЭтаФорма.ИспользуемоеИмяФайла = ПолучитьНавигационнуюСсылку(ЭтаФорма.ОбъектСсылка, "ХранилищеОбработки");
		
	ИначеЕсли ЭтаФорма.ЭтоВнешняяОбработка = Ложь 
		ИЛИ ЭтаФорма.ИспользуемоеИмяФайла = Неопределено Тогда
		РежимИспользования = "обработка в составе конфигурации"; 
		
	КонецЕсли;
	
	Попытка
		ТекущийПользователь = ОбработкаОбъект.НайтиТекущегоПользователя();
		ЭКОМ_РольУстановлена = Вычислить("ЭКОМ_ОбщегоНазначения.ЭКОМ_ЕстьРоль(""ЭКОМ_Роль"", ТекущийПользователь)");
		Если ЭКОМ_РольУстановлена = Ложь Тогда		 
			ЭтаФорма.СообщениеТекст = "Установите для пользователя <<<" + Строка(ТекущийПользователь) + ">>> роль - Docrobot Роль!!!";
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = ЭтаФорма.СообщениеТекст;
			СообщениеПользователю.Сообщить();
			ЭтаФорма.ОбработкаДоступна = Ложь;
			Возврат;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	ТекстСообщения = "";
	ЭтаФорма.ЭКОМОбъектыАктуальны  = ОбработкаОбъект.АктуальныОбъектыЭКОМ(ТекстСообщения, МассивЛогаСобытий);  	
	Если ЭтаФорма.ЭКОМОбъектыАктуальны = Ложь Тогда 	
		ЭтаФорма.НеобходимоУстановитьОбновление = Истина;
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Конфигурация Docrobot требует обновления" + Символы.ПС + ТекстСообщения;
		Сообщение.Сообщить();

	Иначе
		Если НЕ Метаданные.Документы.ЭКОМ_Документы.РасширениеКонфигурации() = Неопределено Тогда
			РежимИспользования = "обработка в составе расширения";
		КонецЕсли;

		ЭтаФорма.ОбработкаДоступна = Истина;
				
		// Для выполнения длительных операций в фоне
		Если Метаданные.ОбщиеМодули.Найти("СтандартныеПодсистемыСервер") = Неопределено Тогда
			ЭтаФорма.ДоступноВыполнениеВФоне = Ложь;
		Иначе		
			
			ВерсияБСП = Вычислить("СтандартныеПодсистемыСервер.ВерсияБиблиотеки()");
			ЭтаФорма.ДоступноВыполнениеВФоне = ВерсияБСП >= "2.2.2.1";
			
		КонецЕсли;
		ЭтаФорма.ДоступноВыполнениеВФоне = НастройкаПрочитатьОбщийМодуль("ДоступноВыполнениеВФоне", ЭтаФорма.ДоступноВыполнениеВФоне, Неопределено, Ложь);
				
		ЗначениеПоУмолчанию = Ложь;
		Измерение           = Неопределено; 
		Обязательно         = Ложь;
		ЭКОМ_Автообновление = НастройкаПрочитатьОбщийМодуль("ЭКОМ_Автообновление", ЗначениеПоУмолчанию, Измерение, Обязательно);
		
		// Статистика для улучшения модуля 1С
		Выполнить("ЭКОМ_ОбщегоНазначения.СобратьДанныеДляСтатистики(ВерсияОбработки, ЭКОМ_Автообновление, МассивЛогаСобытий);");
		
		// Запрос для таблицы паллет	
		ТекстЗапросаПаллет = "ВЫБРАТЬ
		|	ЭКОМ_Палеты.Номенклатура КАК Номенклатура,
		|	ЭКОМ_Палеты.НомерПалета КАК НомерПалета,
		|	ЭКОМ_Палеты.SSCC КАК SSCC,
		|	ЭКОМ_Палеты.ВесБрутто КАК ВесБрутто,
		|	ЭКОМ_Палеты.ВесНетто КАК ВесНетто,
		|	ЭКОМ_Палеты.Высота КАК Высота,
		|	ЭКОМ_Палеты.Европаллета КАК Европаллета,
		|	ЭКОМ_Палеты.Единица_Измерения КАК Единица_Измерения,
		|	ЭКОМ_Палеты.Количество КАК Количество,
		|	ЭКОМ_Палеты.МестоДоставкиУпаковки КАК МестоДоставкиУпаковки,
		|	ЭКОМ_Палеты.Объем КАК Объем
		|ИЗ
		|	РегистрСведений.ЭКОМ_Палеты КАК ЭКОМ_Палеты
		|ГДЕ
		|	ЭКОМ_Палеты.Документ В(&масПомеченныхДоков)";
		
		ЭтаФорма.ТаблицаПалет.ТекстЗапроса = ТекстЗапросаПаллет;
		
		ЭтаФорма.ПанельСвернута = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""СлужебныйПанельЦепочкиСвернута"", Истина, ""Служебный"")");
		
		// Получаем дерево как програмный объект
		ЗначениеПоУмолчанию = Неопределено;
		Измерение           = "Служебный"; 
		Обязательно         = Ложь;
		СлужебныйДеревоКонфигурации = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""СлужебныйДеревоКонфигурации"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
		
		Если НЕ ЗначениеЗаполнено(СлужебныйДеревоКонфигурации) Тогда
			ОбработкаОбъект.ЗаполнитьДеревоКонфигурации();
		КонецЕсли;
		
		Настройка_Параметр_Записать("СлужебныйТипФормы", "УправляемаяФорма", "Служебный");
		
		ПроверитьЗаполнитьЗначенияДопКонстант();
		
		АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = ОбработкаОбъект.Метаданные().Синоним + " версия: " + ВерсияОбработки + ", " + РежимИспользования;
		
		ПараметрыФункции = Новый Массив;
		ПараметрыФункции.Добавить(Ложь);
		ПараметрыФункции.Добавить(МассивЛогаСобытий);	
		БекапНастроек = ВернутьРезультатИзМодуляОбъекта("ИзменитьФорматПользовательскихНастроек", ПараметрыФункции);
		Если БекапНастроек.ЕстьИзменения Тогда
			БекапАдресНастроек = БекапНастроек.ФайлНастроек;
			БекапИмяФайлаНастроек = БекапНастроек.ИмяФайлаНастроек;
		КонецЕсли;
		
		ПолучатьИдентификаторыЦепочек = Вычислить("ЭКОМ_ОбщегоНазначения.Настройка_Параметр_Прочитать(""ЭКОМ_ПолучатьИдентификаторыЦепочек"", Ложь)");
		Элементы.ЗаполнитьИдентификаторыЦепочек.Видимость = ПолучатьИдентификаторыЦепочек;
		
		// Поставщик
		ЗначениеПоУмолчанию = Ложь;
		Измерение           = Неопределено; 
		Обязательно         = Ложь;
		ЭКОМ_ОбменПоставщик = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_ОбменПоставщик"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
		Элементы.Группа_Поставщик.Видимость            = ЭКОМ_ОбменПоставщик;
		
		// Покупатель
		ЗначениеПоУмолчанию = Ложь;
		Измерение           = Неопределено; 
		Обязательно         = Ложь;
		ЭКОМ_ОбменСеть = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_ОбменСеть"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
		Элементы.Группа_Покупатель.Видимость       = ЭКОМ_ОбменСеть;
		
		// ЭТРН
		ЗначениеПоУмолчанию = Ложь;
		Измерение           = Неопределено; 
		Обязательно         = Ложь;
		ЭКОМ_ОбменЭТРН = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_ОбменЭТРН"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
		Элементы.Группа_ЭТРН.Видимость                  = ЭКОМ_ОбменЭТРН;
		
		// Condra
		ЗначениеПоУмолчанию = Ложь;
		Измерение           = Неопределено; 
		Обязательно         = Ложь;
		ЭКОМ_ОбменCondra = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_ОбменCondra"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
		Элементы.Группа_Condra.Видимость                  = ЭКОМ_ОбменCondra;
		
		// Прайс-лист
		ЗначениеПоУмолчанию = Ложь;
		Измерение           = Неопределено; 
		Обязательно         = Ложь;
		ЭКОМ_ОбменПрайсЛист = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_ОбменПрайсЛист"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
		Элементы.ГруппаПрайсЛист.Видимость = ЭКОМ_ОбменПрайсЛист;
		
		// Заполнение текстов запросов для динамических списков.
		Вкладки = Новый Соответствие;
		Если ЭКОМ_ОбменПоставщик Тогда
			Вкладки.Вставить("СлужебныйЗапросДляФормыПоставщика", СписокДляПоставщика);
		КонецЕсли;
		Если ЭКОМ_ОбменСеть Тогда
			Вкладки.Вставить("СлужебныйЗапросДляФормыПокупателя", СписокДляПокупателя);
		КонецЕсли;
		Если ЭКОМ_ОбменЭТРН Тогда
			Вкладки.Вставить("СлужебныйЗапросДляФормыЭТРН", СписокДляЭТРН);
		КонецЕсли;
		Если ЭКОМ_ОбменCondra Тогда
			Вкладки.Вставить("СлужебныйЗапросДляФормыCondra", СписокДляCondra);
		КонецЕсли;
		Если ЭКОМ_ОбменПрайсЛист Тогда
			Вкладки.Вставить("СлужебныйЗапросДляФормыПрайсЛист", СписокДляПрайсЛиста);
		КонецЕсли;
	
		Для Каждого Вкладка Из Вкладки Цикл
			КодПолученияТекстаЗапроса = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(Вкладка.Ключ, Неопределено, ""Служебный"", Ложь)");
			Если НЕ ЗначениеЗаполнено(КодПолученияТекстаЗапроса) Тогда   
				Продолжить;
			КонецЕсли;
			
			Попытка
				
				ТекстЗапроса = "";
				Выполнить(КодПолученияТекстаЗапроса);
				
				Запрос = Новый Запрос;		               
				Запрос.Текст = ТекстЗапроса;
				Запрос.УстановитьПараметр("ДатаНач", ТекущаяДата());
				Запрос.УстановитьПараметр("ДатаКон", ТекущаяДата());			
				Запрос.УстановитьПараметр("масПомеченныхДоков", Новый Массив);
				Запрос.УстановитьПараметр("НаправлениеОбмена" , Перечисления.ЭКОМ_НаправлениеОбмена.ПустаяСсылка());
				
				Попытка
					РезультатЗапроса = Запрос.Выполнить();
				Исключение					
					ТекстЛогаСобытий = ОписаниеОшибки();
					ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛогаОбщийМодуль(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
					МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

					Продолжить;
				КонецПопытки;
				
				Вкладка.Значение.ТекстЗапроса = ТекстЗапроса;
				
			Исключение
				ТекстЛогаСобытий = ОписаниеОшибки();
				ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛогаОбщийМодуль(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
				МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

			КонецПопытки;
		КонецЦикла;
		
		счВидимыхСтраниц = 0;
		Для Каждого СтраницаГруппы Из Элементы.ОсновнаяПанель.ПодчиненныеЭлементы Цикл
			счВидимыхСтраниц = ?(СтраницаГруппы.Видимость = Ложь, счВидимыхСтраниц, счВидимыхСтраниц + 1);
		КонецЦикла;
		
		Если счВидимыхСтраниц = 1 Тогда
			Элементы.ОсновнаяПанель.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;    
		КонецЕсли;
		
		ИнфоДатаЗагруженоЗа = НачалоДня(ТекущаяДата());
		
		ВсегоЭлементов = Новый Массив;
		
		ДанныеОформления = Новый Структура;
		ДанныеОформления.Вставить("ЭлементОтбора" , "ДеревоФильтров.Пометка");
		ДанныеОформления.Вставить("Оформление"    , "ЦветТекста");
		ДанныеОформления.Вставить("Значение"      , WebЦвета.Серый);
		ДанныеОформления.Вставить("ПолеОформления", "ДеревоФильтровЗначение");
		ДанныеОформления.Вставить("ВидСравнения"  , ВидСравненияКомпоновкиДанных.Равно);
		ДанныеОформления.Вставить("ПравоеЗначение", Ложь);
		ВсегоЭлементов.Добавить(ДанныеОформления);
		
		ДанныеОформления = Новый Структура;
		ДанныеОформления.Вставить("ЭлементОтбора" , "ДеревоФильтров.ГруппаНастроек");
		ДанныеОформления.Вставить("Оформление"    , "Шрифт");
		ДанныеОформления.Вставить("Значение"      , Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, "ЭКОМ_ШрифтФильтра", 10, Истина, Ложь));  
		ДанныеОформления.Вставить("ПолеОформления", "ДеревоФильтровЗначение");
		ДанныеОформления.Вставить("ВидСравнения"  , ВидСравненияКомпоновкиДанных.Заполнено);
		ДанныеОформления.Вставить("ПравоеЗначение", "");
		ВсегоЭлементов.Добавить(ДанныеОформления);	
		
		ДанныеОформления = Новый Структура;
		ДанныеОформления.Вставить("ЭлементОтбора" , "ДеревоФильтров.Значение");
		ДанныеОформления.Вставить("Оформление"    , "ЦветТекста");
		ДанныеОформления.Вставить("Значение"      , WebЦвета.Синий);
		ДанныеОформления.Вставить("ПолеОформления", "ДеревоФильтровЗначение");
		ДанныеОформления.Вставить("ВидСравнения"  , ВидСравненияКомпоновкиДанных.Равно);
		ДанныеОформления.Вставить("ПравоеЗначение", "Добавить отбор");	
		ВсегоЭлементов.Добавить(ДанныеОформления);	
		
		Для каждого ЭлементМассива Из ВсегоЭлементов Цикл
			
			НовыйЭлементУсловногоОформления                  = УсловноеОформление.Элементы.Добавить();
			НовыйЭлементУсловногоОформления.Использование    = Истина;
			НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра(ЭлементМассива.Оформление, ЭлементМассива.Значение);
			
			ЭлементОтбора                                    = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение                      = Новый ПолеКомпоновкиДанных(ЭлементМассива.ЭлементОтбора);
			ЭлементОтбора.ПравоеЗначение                     = ЭлементМассива.ПравоеЗначение;;
			ЭлементОтбора.ВидСравнения                       = ЭлементМассива.ВидСравнения;
			ЭлементОтбора.Использование                      = Истина;                                                       
			
			ПолеОформления = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(ЭлементМассива.ПолеОформления);
			ПолеОформления.Использование = Истина; 	
			
		КонецЦикла;	
		
		// Добавляем профили обмена при первом запуске
		ОбработкаОбъект.ДобавитьПрофилиОбменаДляСовместимости();
		
	КонецЕсли;
	
	ЭтаФорма.ПериодНачалоЛога = ТекущаяДата();
	ЭтаФорма.ПериодКонецЛога  = ТекущаяДата();
	
	ЭКОМ_ОбщегоНазначения.ОбработатьНовости();
				
	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Вычислить("ЭКОМ_ОбщегоНазначения.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий)");
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если Не ОбработкаОбъект.ПолучитьДоступностьApiПоСтране() Тогда
		Элементы.ГруппаПодменюПечать.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполненнаяЗаписьЛогаОбщийМодуль(ТекстЛогаСобытий, УровеньЛогирования, ИмяСобытия)	
	ЗаписьСтруктурыЛога = Вычислить("ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, УровеньЛогирования, ИмяСобытия)");
	Возврат ЗаписьСтруктурыЛога;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Не открываем обработку
	Если ЭтаФорма.ОбработкаДоступна = Ложь Тогда
		
		Если ЗначениеЗаполнено(ЭтаФорма.СообщениеТекст)  Тогда
		     ПоказатьПредупреждение(, ЭтаФорма.СообщениеТекст);
		КонецЕсли;
		
		Закрыть();
		Возврат;
	КонецЕсли;

	МассивЛогаСобытий = Новый Массив;
	УстановленыВсеОбъектыЭКОМ = УстановкаОбъектовКонфигурацииЭКОМ(МассивЛогаСобытий);
	Если УстановленыВсеОбъектыЭКОМ = Ложь Тогда
		ТекстСообщения = "";
		
		Для каждого Запись Из МассивЛогаСобытий Цикл
			Если ЗначениеЗаполнено(Запись.Комментарий) Тогда
				ТекстСообщения = ТекстСообщения + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "") + Запись.Комментарий;
			КонецЕсли;		
		КонецЦикла;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();

	КонецЕсли;
	
	УстановитьАктивныеПрофили();
	
	УстановитьВсеПараметрыДинамическогоСписка("СписокДляПоставщика");
    УстановитьВсеПараметрыДинамическогоСписка("СписокДляПокупателя");
    УстановитьВсеПараметрыДинамическогоСписка("СписокДляЭТРН");
	УстановитьВсеПараметрыДинамическогоСписка("СписокДляCondra");
	УстановитьВсеПараметрыДинамическогоСписка("СписокДляПрайсЛиста");
    УстановитьВсеПараметрыДинамическогоСписка("ТаблицаПалет");

	// Открываем настройки для заполнения если открываем впервые
	Если Элементы.Группа_Поставщик.Видимость = Ложь
		И Элементы.Группа_Покупатель.Видимость = Ложь
		//Docrobot 1.20.0 MOD-1559 [добавлена проверка на прайс]
		//И Элементы.ГруппаВходящийПрайсЛист.Видимость = Ложь
		//И Элементы.ГруппаИсходящийПрайсЛист.Видимость = Ложь
		//+Лысковец 20220201 MOD-1559
		И Элементы.ГруппаПрайсЛист.Видимость = Ложь
		//-
		И Элементы.Группа_ЭТРН.Видимость = Ложь
		И Элементы.Группа_Condra.Видимость = Ложь Тогда
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("ЭКОМОбъектыАктуальны", 					ЭтаФорма.ЭКОМОбъектыАктуальны);
		ПараметрыФормы.Вставить("ДополнительнаяОбработкаСсылка",			ЭтаФорма.ОбъектСсылка);
		ПараметрыФормы.Вставить("РежимИспользования", 						РежимИспользования);
		ПараметрыФормы.Вставить("ИспользуемоеИмяФайла", 	ЭтаФорма.ИспользуемоеИмяФайла);

		
		ОткрытьФорму(ПолноеИмяОбработки + ".Форма.УФ_ФормаНастройкиОсновные",ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		ПоказатьПредупреждение(, "Заполните настройки!");
		
	КонецЕсли;
   
    СоздатьЛокальныеКаталогиНаКлиенте(МассивЛогаСобытий);
	    
    Если НЕ ПустаяСтрока(БекапАдресНастроек) Тогда
        ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(БекапАдресНастроек);
        ДвоичныеДанныеФайла.Записать(БекапИмяФайлаНастроек);
		
		ТекстЛогаСобытий = "Выполнено обновление шаблонов настроек. Копия настроек до изменений сохранена в " + БекапИмяФайлаНастроек;
		ЗаписьСтруктурыЛога = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение(""Перечисление.ЭКОМ_УровниЛогирования.Предупреждение""), ""Открытие формы"")");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

    КонецЕсли;
	
	// По умолчанию при открытии скрыто
	Элементы.ГруппаДинамическийФильтр.Видимость = Ложь;
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	УстановитьВидимостьПоТекущейСтранице(ДанныеСписка.ИмяРеквизитаТаблицы);
    ВыбраннаяСтрока = Элементы[ДанныеСписка.ИмяСписка].ТекущиеДанные;
	
	ОбновитьТаблицуПалетНаКлиенте(ДанныеСписка.ИмяСписка);
    
    Если ПустаяСтрока(СообщениеТекст) = Ложь Тогда
        Сообщение 		= Новый СообщениеПользователю;
        Сообщение.Текст = СообщениеТекст;
        Сообщение.Сообщить();
    КонецЕсли;
      	
	Оповещение = Новый ОписаниеОповещения;
    ОткрытьФорму(ПолноеИмяОбработки + ".Форма.УФ_Приветствие",,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

    Если ВыбраннаяСтрока <> Неопределено Тогда
        ОбновитьКвитанцииНаКлиенте(ДанныеСписка.ИмяСписка);
    КонецЕсли;
	
	// Для периода заказа
	
	ДанныеСпискаКлюч = "Используется, ТекущаяСтраницаИмя";
	
	АктивныеОбмены = Новый Соответствие;
	АктивныеОбмены.Вставить("СписокДляПоставщика", Новый Структура(ДанныеСпискаКлюч, Элементы.Группа_Поставщик.Видимость , "Группа_Поставщик"));
	АктивныеОбмены.Вставить("СписокДляПокупателя", Новый Структура(ДанныеСпискаКлюч, Элементы.Группа_Покупатель.Видимость, "Группа_Покупатель"));
	АктивныеОбмены.Вставить("СписокДляЭТРН"      , Новый Структура(ДанныеСпискаКлюч, Элементы.Группа_ЭТРН.Видимость      , "Группа_ЭТРН")); 
	АктивныеОбмены.Вставить("СписокДляCondra"    , Новый Структура(ДанныеСпискаКлюч, Элементы.Группа_Condra.Видимость    , "Группа_Condra"));	
	АктивныеОбмены.Вставить("СписокДляПрайсЛиста", Новый Структура(ДанныеСпискаКлюч, Элементы.ГруппаПрайсЛист.Видимость  , "ГруппаПрайсЛист"));
	
	УстановитьПериоды(АктивныеОбмены);
	
	Если УстановленыВсеОбъектыЭКОМ = Истина Тогда
		СоздатьДинамическийСписокДобавитьДинамическиеКнопки(МассивЛогаСобытий);
	КонецЕсли;
	ОтобразитьЛогСобытий(МассивЛогаСобытий);
	
	Если ЭтаФорма.ПанельСвернута = Истина Тогда 
		Элементы.ГруппаПодвал.Скрыть();		
	Иначе	
	    Элементы.ГруппаПодвал.Показать();
	КонецЕсли;
	
	// Сортировка
	ОтобразитьСортировку(ДанныеСписка);
	
	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.ИдентификаторНазначения = ЭтаФорма.УникальныйИдентификатор;
		Сообщение.Текст = Вычислить("ЭКОМ_ОбщегоНазначения.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий)");
		Сообщение.Сообщить();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ПоказатьНовости", 3, Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьАктивныеПрофили()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭКОМ_GLN.Объект,
		|	ЭКОМ_GLN.ПрофильОбмена
		|ИЗ
		|	РегистрСведений.ЭКОМ_GLN КАК ЭКОМ_GLN
		|ГДЕ
		|	ЭКОМ_GLN.Объект.ПометкаУдаления = ЛОЖЬ
		|	И ЭКОМ_GLN.ПрофильОбмена.ПометкаУдаления = ЛОЖЬ
		|	И ЭКОМ_GLN.ПрофильОбмена.Активный = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыбЗап = РезультатЗапроса.Выбрать();
	
	Пока ВыбЗап.Следующий() Цикл
		Проф = ВыбЗап.ПрофильОбмена.ПолучитьОбъект();
		Проф.Активный = Истина;
		Проф.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Открывает форму новостей. Запускается из обработчика ПриОткрытии()
//
&НаКлиенте
Процедура ПоказатьНовости()
	
	ОткрытьФорму(ПолноеИмяОбработки + ".Форма.УФ_Новости", , ЭтаФорма, "ФормаНовостей");

КонецПроцедуры // ПоказатьНовости()

&НаКлиенте
Процедура ОтобразитьСортировку(ДанныеСписка)
	ИдентификаторПорядок = ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.Настройки.Порядок.ИдентификаторПользовательскойНастройки;
	Если НЕ ЗначениеЗаполнено(ИдентификаторПорядок) Тогда
		ИдентификаторПорядок = СокрЛП(Новый УникальныйИдентификатор);
		ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.Настройки.Порядок.ИдентификаторПользовательскойНастройки = ИдентификаторПорядок;
	КонецЕсли;
	ПользовательскийПорядок  = ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторПорядок);
	ЭлементЗначениеПараметра = ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(ПользовательскийПорядок);
	
	ИмяНастроекПорядка = СокрЛП(ДанныеСписка.ИмяРеквизитаТаблицы) + "КомпоновщикНастроекПользовательскиеНастройки";
	Элементы[ИмяНастроекПорядка].ТекущаяСтрока = ЭлементЗначениеПараметра;
	Элементы[ИмяНастроекПорядка].ДанныеСтроки(ЭлементЗначениеПараметра);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериоды(АктивныеОбмены)
	
	Настройки = ПолучитьПользовательскиеНастройки(ТекущийПользователь);
	
	Для каждого Стр Из АктивныеОбмены Цикл
		
		Используется        = Стр.Значение.Используется;
		ИмяРеквизитаТаблицы = Стр.Ключ;
		ТекущаяСтраницаИмя  = Стр.Значение.ТекущаяСтраницаИмя;
		Если Используется = Истина Тогда
			
			ИдентификаторПользовательскойНастройки = ЭтаФорма[ИмяРеквизитаТаблицы].КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки;
			Если НЕ ЗначениеЗаполнено(ИдентификаторПользовательскойНастройки) Тогда
				ИдентификаторПользовательскойНастройки = СокрЛП(Новый УникальныйИдентификатор);
				ЭтаФорма[ИмяРеквизитаТаблицы].КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскойНастройки;
			КонецЕсли;
	 
			ПользовательскийОтбор = ЭтаФорма[ИмяРеквизитаТаблицы].КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторПользовательскойНастройки);
			Если НЕ ПользовательскийОтбор = Неопределено Тогда
				
				ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте(ТекущаяСтраницаИмя);
				
				ОбязательныеОтборы = Новый Массив;
				ОбязательныеОтборы.Добавить("Организация");
				ОбязательныеОтборы.Добавить("Контрагент");
				ОбязательныеОтборы.Добавить("ТочкаДоставки");
				ОбязательныеОтборы.Добавить("ДатаЗаказа");
				ОбязательныеОтборы.Добавить("ДатаЭТРН");
				ОбязательныеОтборы.Добавить("Дата");
				СоздатьПользовательскиеНастройки(ДанныеСписка, ОбязательныеОтборы);
				
				Для каждого Отбор ИЗ ПользовательскийОтбор.Элементы Цикл
					
					// Для периода 
					Если Найти(Отбор.Представление, "Программный отбор") > 0 Тогда			
						
						Если ТипЗнч(Отбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда		
							
							// Поиск именно для периода
							Если Отбор.ПредставлениеПользовательскойНастройки = "ДатаЗаказа"
								ИЛИ (ИмяРеквизитаТаблицы = "СписокДляЭТРН" И Отбор.ПредставлениеПользовательскойНастройки = "ДатаЭТРН")
								ИЛИ (ИмяРеквизитаТаблицы = "СписокДляCondra" И Отбор.ПредставлениеПользовательскойНастройки = "Дата")
								ИЛИ (ИмяРеквизитаТаблицы = "СписокДляПрайсЛиста" И Отбор.ПредставлениеПользовательскойНастройки = "Дата") Тогда
								
								Для каждого Эл Из Отбор.Элементы Цикл
									Если Эл.ВидСравнения 		= ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
										
										ДатаНачалаОтбора 		= Неопределено;
										Если НЕ Настройки.Свойство(ИмяРеквизитаТаблицы + "ДатаНачалаОтбора", ДатаНачалаОтбора) Тогда
											ДатаНачалаОтбора    = НачалоДня(ТекущаяДата() - 7*60*60*24);  // 7 дней от текущей даты
										КонецЕсли;
										
										Эл.ПравоеЗначение 		= ДатаНачалаОтбора;
										
									ИначеЕсли Эл.ВидСравнения 	= ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
										
										ДатаОкончанияОтбора 	= Неопределено;
										Если НЕ Настройки.Свойство(ИмяРеквизитаТаблицы + "ДатаОкончанияОтбора", ДатаОкончанияОтбора) Тогда
											ДатаОкончанияОтбора	= КонецДня(ТекущаяДата());
										КонецЕсли;
										
										Эл.ПравоеЗначение		= ДатаОкончанияОтбора;
										
									КонецЕсли;
								КонецЦикла;
								
								Использование 		= Неопределено;
								Если НЕ Настройки.Свойство(ИмяРеквизитаТаблицы + "Использование", Использование) Тогда
									Использование	= Истина;
								КонецЕсли;
								
								Отбор.Использование = Использование;
								
								Прервать;
								
							КонецЕсли;		
							
						КонецЕсли;
						
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;    
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДляПоставщикаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    Если Элемент = Неопределено 
		Или Элемент.ТекущиеДанные = Неопределено 
		Или ВыбраннаяСтрока = Неопределено Тогда
        Возврат;
    КонецЕсли;
    СтандартнаяОбработка = Ложь;
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	Если Поле.Имя = ДанныеСписка.ИмяСписка + "Пометка" Тогда
		
		Если Не Элемент.ТекущиеДанные = Неопределено Тогда
			ДокументыЦепочки = МассивИменДокументовЦепочкиПоставщика();
			Если Элемент.ТекущиеДанные.Пометка Тогда
				СнятьПометку(Элемент.ТекущиеДанные.ДокументыВсе);
				Для Каждого ИмяДокумента Из ДокументыЦепочки Цикл
					Если Элемент.ТекущиеДанные.Свойство(ИмяДокумента) Тогда 
						СнятьПометку(Элемент.ТекущиеДанные[ИмяДокумента]);
					КонецЕсли;
				КонецЦикла;
			Иначе
				ПоставитьПометку(Элемент.ТекущиеДанные.ДокументыВсе);
			КонецЕсли;
		КонецЕсли;
		
		//Параметр в динамическом списке нужно обновить
		УстановитьПараметрДинамическогоСписка(ДанныеСписка.ИмяРеквизитаТаблицы, "масПомеченныхДоков", СписокВыбранныхСтрок.ВыгрузитьЗначения());
    
   ИначеЕсли Поле.Имя = "СписокДляПоставщикаСтатус" ИЛИ
        Поле.Имя = "СписокДляПоставщикаСтатус_ORDER" ИЛИ
        Поле.Имя = "СписокДляПоставщикаСтатус_ORDRSP" ИЛИ
        Поле.Имя = "СписокДляПоставщикаСтатус_DESADV" ИЛИ 
        Поле.Имя = "СписокДляПоставщикаСтатус_RECADV" ИЛИ 
        Поле.Имя = "СписокДляПоставщикаСтатус_DESSCC" ИЛИ
		Поле.Имя = "СписокДляПоставщикаСтатус_RETANN" ИЛИ 
        Поле.Имя = "СписокДляПоставщикаСтатус_RETINS" ИЛИ
		Поле.Имя = "СписокДляПоставщикаСтатус_INVOICE" ИЛИ
        Поле.Имя = "СписокДляПоставщикаСтатус_УПД" Тогда
                
        ВыбраннаяСтрока = Элемент.ТекущиеДанные;
        СписокДокументов = ПолучитьСписокДокументов(ВыбраннаяСтрока, ДанныеСписка.ИмяСписка);
        
        Форма = ОткрытьФорму("РегистрСведений.ЭКОМ_Объекты_События.Форма.УФ_ФормаСписка");
        ОтборВладелец = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); //Добавлям отбор
        ОтборВладелец.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке; //Как будем сравнивать
        ОтборВладелец.Использование  = Истина; // Устанавливаем галку использованияНовый ПолеКомпоновкиДанных("Номенклатура")
        ОтборВладелец.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Документ_Основание"); //По какому реквизиту будем делать отбор
        ОтборВладелец.ПравоеЗначение = СписокДокументов; // И само значение отбора
        
        УсловиеСортировки = Форма.Список.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
        УсловиеСортировки.Поле = Новый ПолеКомпоновкиДанных("ДатаЗаписи");
        УсловиеСортировки.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
        УсловиеСортировки.Использование = Истина;
        
    ИначеЕсли Поле.Имя = "СписокДляПоставщикаПалеты" Тогда
        
        // ---> Chernyatin Andrey  10 октября 2019 г.
        ВыбраннаяСтрока    = Элемент.ТекущиеДанные;
        ДокументРеализации = ВыбраннаяСтрока.ДокументРеализации;
        
        Если ЗначениеЗаполнено(ДокументРеализации) Тогда
            
			ЗначениеПоУмолчанию = Неопределено;
			Измерение           = Неопределено; 
			Обязательно         = Ложь;
			ДокументСсылкаИмя = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_ВидРеализацииПоставщик"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
			
			ПараметрыФормыDesscc = Новый Структура;
			ПараметрыФормыDesscc.Вставить("ДокументСсылкаИмя", ДокументСсылкаИмя);
			ПараметрыФормыDesscc.Вставить("ДокументСсылка"   , ДокументРеализации);	
			ЭКОМ_Документ_ORDER = Неопределено;
			Если ЗначениеЗаполнено(ВыбраннаяСтрока.ЭКОМ_Документ_ORDER) Тогда
			     ЭКОМ_Документ_ORDER = ВыбраннаяСтрока.ЭКОМ_Документ_ORDER;
			КонецЕсли;
			ПараметрыФормыDesscc.Вставить("ЭКОМ_Документ_ORDER", ЭКОМ_Документ_ORDER);
           
            Оповещение = Новый ОписаниеОповещения("ОбработатьВыборПалеты", ЭтаФорма);
            ОткрытьФорму(ПолноеИмяОбработки + ".Форма.УФ_ФормаDesscc", ПараметрыФормыDesscc, ЭтаФорма,,,, Оповещение);
            
        КонецЕсли;
        // <--- Chernyatin Andrey  10 октября 2019 г.
		
	ИначеЕсли Поле.Имя = "СписокДляПоставщикаТекстОшибки" Тогда
        
        Подсказка = "Текст ошибки";
        Оповещение = Новый ОписаниеОповещения("ЗавершениеПросмотраТекстОшибки", ЭтаФорма);
        ПоказатьВводСтроки(Оповещение, Элемент.ТекущиеДанные.ТекстОшибки, Подсказка, 0, Истина);
		
	ИначеЕсли Поле.Имя = "СписокДляПоставщикаТекстУточнения" Тогда
        
        Подсказка = "Текст уточнения";
        Оповещение = Новый ОписаниеОповещения("ЗавершениеПросмотраТекстОшибки", ЭтаФорма);
        ПоказатьВводСтроки(Оповещение, Элемент.ТекущиеДанные.ТекстУточнения, Подсказка, 0, Истина);
		
	ИначеЕсли Поле.Имя = "СписокДляПоставщикаТекстОтклоненияАннулирования" Тогда
		
		Подсказка = "Текст отклонения аннулирования";
		Оповещение = Новый ОписаниеОповещения("ЗавершениеПросмотраТекстОшибки", ЭтаФорма);
		ПоказатьВводСтроки(Оповещение, Элемент.ТекущиеДанные.ТекстОтклоненияАннулирования, Подсказка, 0, Истина);
		
		
	ИначеЕсли Поле.Имя = "СписокДляПоставщикаТекстПричиныАннулирования" Тогда
		
		Подсказка = "Текст причины аннулирования";
		Оповещение = Новый ОписаниеОповещения("ЗавершениеПросмотраТекстОшибки", ЭтаФорма);
		ПоказатьВводСтроки(Оповещение, Элемент.ТекущиеДанные.ТекстПричиныАннулирования, Подсказка, 0, Истина);
		
	ИначеЕсли Поле.Имя = "СписокДляПоставщикаТранспорт" Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Документ", Элемент.ТекущиеДанные.ДокументРеализации);
		
		КлючЗаписи = ПолучитьКлючЭКОМ_ТранспортнаяИнформация(Отбор); 
		Структура = Новый Структура("Ключ", КлючЗаписи);		
		Если КлючЗаписи = Неопределено Тогда	
			ОткрытьФорму("РегистрСведений.ЭКОМ_ТранспортнаяИнформация.ФормаЗаписи", Отбор,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		Иначе			
			ОткрытьФорму("РегистрСведений.ЭКОМ_ТранспортнаяИнформация.ФормаЗаписи", Структура,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
    КонецЕсли;
	
	ЭлементОбъект = ОпределитьТипОбъекта(Элемент, Поле.Имя);
    Если ЗначениеЗаполнено(ЭлементОбъект) Тогда
        ПоказатьЗначение( , ЭлементОбъект);
    КонецЕсли;             
    
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборПалеты(Результат, Данные) Экспорт
    
    Элементы.СписокДляПоставщика.Обновить();
    Элементы.СписокДляПокупателя.Обновить();
    
КонецПроцедуры

&НаКлиенте
Процедура СписокДляПоставщикаПриАктивизацииСтроки(Элемент)
	Если НЕ Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.Группа_Поставщик Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТекущийЭлемент.Имя = "КомандаФильтрыИМеню" Тогда
		ОбновитьЦепочкуДокументовИКвитанцииНаКлиенте("СписокДляПоставщика");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокДляПокупателяПриАктивизацииСтроки(Элемент)
	Если НЕ Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.Группа_Покупатель Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТекущийЭлемент.Имя = "КомандаФильтрыИМеню" Тогда
		ОбновитьЦепочкуДокументовИКвитанцииНаКлиенте("СписокДляПокупателя");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокДляЭТРНПриАктивизацииСтроки(Элемент)
	Если НЕ Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.Группа_ЭТРН Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТекущийЭлемент.Имя = "КомандаФильтрыИМеню" Тогда
		ОбновитьЦепочкуДокументовИКвитанцииНаКлиенте("СписокДляЭТРН");
		ОбновитьТаблицуПалетНаКлиенте("СписокДляЭТРН");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокДляCondraПриАктивизацииСтроки(Элемент)
	
	Если НЕ Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.Группа_Condra Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ТаблицаЦепочкаДокументов.Видимость = Истина;
	Элементы.ТаблицаКвитанций.Видимость         = Ложь;
	Элементы.ТаблицаПалет.Видимость             = Ложь;
	
	Если НЕ ТекущийЭлемент.Имя = "КомандаФильтрыИМеню" Тогда
    	ОбновитьЦепочкуДокументовИКвитанцииНаКлиенте("СписокДляCondra");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриАктивизацииСтрокиСписка(Элемент)

    Если Элемент.ТекущиеДанные = Неопределено Или Элемент.ТекущаяСтрока = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ОбновитьЦепочкуДокументовИКвитанцииНаКлиенте(Элемент.Имя);
    
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяПанельПриСменеСтраницы(НоваяАктивнаяСтраница)
	
	// Очищаем пометки при смене страницы
	СписокВыбранныхСтрок.Очистить();
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	
	МассивЛогаСобытий = Новый Массив;
	УстановитьВидимостьПоТекущейСтранице(ДанныеСписка.ИмяРеквизитаТаблицы);
	СоздатьДинамическийСписокДобавитьДинамическиеКнопки(МассивЛогаСобытий);
    ОбновитьДинамическийСписок(ДанныеСписка);
	
	//ЭтаФорма.ДеревоФильтров.ПолучитьЭлементы().Очистить();
	//СоздатьСоставПользовательскихНастроекНаСервере(ДанныеСписка);
	//СоздатьДеревоПользовательскихНастроекНаСервере(ДанныеСписка, Новый Массив);
	
	ОбновитьЦепочкуДокументовНаКлиенте(ДанныеСписка.ИмяСписка);
    ОбновитьКвитанцииНаКлиенте(ДанныеСписка.ИмяСписка);		
	
	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий)");
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЦепочкаДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    
    Док = Неопределено; 	
    Если Поле.Имя = "ТаблицаЦепочкаДокументовДокумент" Тогда	
        
        Док = Элемент.ТекущиеДанные.Документ;	
        
    КонецЕсли;
    
    Если ЗначениеЗаполнено(Док) Тогда
        ПоказатьЗначение( , Док);
    КонецЕсли; 
    
КонецПроцедуры

&НаКлиенте
Функция ПолучитьФормуОбработки(ИмяФормы, ПараметрыФормы = Неопределено , ВладелецФормы  = Неопределено, КлючУникальности = Истина, ЗакрыватьПризакрытииВладельца = Ложь)
    
    ПолучаемаяФорма=	ПолучитьФорму(ПолноеИмяОбработки + ".Форма." + ИмяФормы
    , ПараметрыФормы
    , 
    , КлючУникальности);
    
    Возврат ПолучаемаяФорма;
    
КонецФункции

#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНД ВКЛАДКИ НАСТРОЙКИ

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаНастройки(Команда)
    
    КлючУникальностиФормы = "ЭКОМ_НастройкиОсновные";
	
	ПараметрыНастроек = Новый Структура;
	
	ПараметрыНастроек.Вставить("ЭКОМОбъектыАктуальны", 			ЭтаФорма.ЭКОМОбъектыАктуальны);
	ПараметрыНастроек.Вставить("ДополнительнаяОбработкаСсылка", ЭтаФорма.ОбъектСсылка);
    
    ФормаНастроек = ОткрытьФорму(ПолноеИмяОбработки + ".Форма.УФ_ФормаНастройкиОсновные", ПараметрыНастроек, ЭтаФорма, КлючУникальностиФормы);
    ФормаНастроек.Активизировать();
КонецПроцедуры

&НаСервере
Процедура ОбменУведомлениямиОПриемкеНаСервереИсходящий(МассивСтрок)
    
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    
    Если МассивСтрок.Количество()=0 Тогда 
        Сообщить("Не выбраны документы для отправки заказов! Возможно заказ(ы) не подтвержден (проведен)", СтатусСообщения.Важное);
    Иначе 
        ОбработкаОбъект.ОтправитьRECADV(МассивСтрок);
    КонецЕсли;	
    
    Элементы.СписокДляПокупателя.Обновить();
    
КонецПроцедуры

&НаКлиенте
Процедура ОбменКвитанциямиНаКлиенте(ДанныеСписка, МассивЛогаСобытий) Экспорт 	
	
	ПараметрыСтруктуры = "Тип, ИспользоватьДерево";
	ИспользуемыеДеревья = Новый Соответствие;
	ИспользуемыеДеревья.Вставить("Входящий DP_PRANNUL_22 (аннулирование)"                , Новый Структура(ПараметрыСтруктуры, "DP_PRANNUL_22", Ложь)); //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _22]
	ИспользуемыеДеревья.Вставить("Входящий DP_IZVPOL_23 (подтверждение аннулирования)", Новый Структура(ПараметрыСтруктуры, "DP_IZVPOL_23" , Ложь));
	ИспользуемыеДеревья.Вставить("Входящий DP_UVUTOCH_24 (отклонение аннулирования)"  , Новый Структура(ПараметрыСтруктуры, "DP_UVUTOCH_24", Ложь));

	КоличествоОпераций = 0;
	ПроверитьНаличиеВеткиДерева(ИспользуемыеДеревья);
	Для каждого Стр Из ИспользуемыеДеревья Цикл		
		Если Стр.Значение.ИспользоватьДерево = Истина Тогда
			КоличествоОпераций = КоличествоОпераций + 1;
		КонецЕсли;	
	КонецЦикла;
	
	НужнаПодпись = Истина;
	ЭтоНовыеДокументы = Истина;
	Если ДанныеСписка.ИмяСписка = "СписокДляПокупателя" Тогда
			
		ЗначениеПоУмолчанию = Ложь;
		Измерение           = Неопределено; 
		Обязательно         = Ложь;
		знОтправлятьУточнения = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_АвтоотправкаУточнений"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
		
		Если знОтправлятьУточнения = Истина Тогда
		     КоличествоОпераций = 4;
		Иначе	
		     КоличествоОпераций = 3;
		КонецЕсли;
			
		ЭтаФорма.Индикатор = 1;
		Элементы.ПолеИндикатор.Видимость = Истина;
		Элементы.КомандаЗакрытьИндикатор.Видимость = Истина;
		
		СписокДляОбработки   = Элементы[ДанныеСписка.ИмяСписка];
		ПозицияТекущейСтроки = СписокДляОбработки.ТекущаяСтрока;
		ВыделенныеСтроки = Новый Массив;
		Для Каждого Идентификатор Из СписокДляОбработки.ВыделенныеСтроки Цикл
			ВыделенныеСтроки.Добавить(Новый Структура("ИдентификаторВыделенныхСтрок", Идентификатор));
		КонецЦикла;
		
		//ОтправитьФайлыНаКлиенте(Новый Массив, "DP_IZVPOL_05", ДанныеСписка, 100/КоличествоОпераций, ПозицияТекущейСтроки, ВыделенныеСтроки, Ложь, Новый Массив, НужнаПодпись, ЭтоНовыеДокументы);	
		ОтправитьФайлыНаКлиенте(Новый Массив, "DP_IZVPOL_06", ДанныеСписка, 100/КоличествоОпераций, ПозицияТекущейСтроки, ВыделенныеСтроки, Ложь, Новый Массив, НужнаПодпись, ЭтоНовыеДокументы);
		
		//Если знОтправлятьУточнения Тогда // отправка DP_UVUTOCH_09 только регламентным заданием или по отдельной кнопке 
		//	ОтправитьФайлыНаКлиенте(Новый Массив, "DP_UVUTOCH_09", ДанныеСписка, 100/КоличествоОпераций, ПозицияТекущейСтроки, ВыделенныеСтроки, Ложь, Новый Массив, НужнаПодпись, ЭтоНовыеДокументы); //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _09]
		//КонецЕсли;
		
		ПроверитьНаличиеФайловНаКлиенте("DP_PDPOL", 100/КоличествоОпераций, ДанныеСписка, МассивлогаСобытий);
		ПроверитьНаличиеФайловНаКлиенте("DP_PDOTPR", 100/КоличествоОпераций, ДанныеСписка, МассивлогаСобытий);
		
		//ОтправитьФайлыНаКлиенте(Новый Массив, "DP_IZVPOL_08", ДанныеСписка, 100/КоличествоОпераций, 0, Новый Массив, Ложь, Новый Массив, НужнаПодпись, ЭтоНовыеДокументы);
		
		// Покупатель - (DP_IZVPOL - 10) вх. - Извещение получения уточнения	
		//ПроверитьНаличиеФайловНаКлиенте("DP_IZVPOL_10", 100/КоличествоОпераций, ДанныеСписка, МассивлогаСобытий);
             
		Для каждого Стр Из ИспользуемыеДеревья Цикл		
			Если Стр.Значение.ИспользоватьДерево = Истина Тогда
				ПроверитьНаличиеФайловНаКлиенте(Стр.Значение.Тип, 100/КоличествоОпераций, ДанныеСписка, МассивлогаСобытий);
			КонецЕсли;
			
		КонецЦикла;
		
    КонецЕсли;
    
    Если ДанныеСписка.ИмяСписка = "СписокДляПоставщика" Тогда
		
		КоличествоОпераций = 10;
		ЭтаФорма.Индикатор = 1;
		Элементы.ПолеИндикатор.Видимость = Истина;
		Элементы.КомандаЗакрытьИндикатор.Видимость = Истина;
		
		//ЭтоНовыеДокументы = Истина;
		//ОтправитьФайлыНаКлиенте(Новый Массив, "DP_IZVPOL_04", ДанныеСписка, 100/КоличествоОпераций, 0, Новый Массив, Ложь, Новый Массив, НужнаПодпись, ЭтоНовыеДокументы);
		
		 // Поставщик  - (DP_IZVPOL - 06) вх. - Извещение получения УПД
		ПроверитьНаличиеФайловНаКлиенте("DP_IZVPOL_06", 100/КоличествоОпераций, ДанныеСписка, МассивлогаСобытий);	
		ПроверитьНаличиеФайловНаКлиенте("DP_UVUTOCH_09", 100/КоличествоОпераций, ДанныеСписка, МассивлогаСобытий); //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _09]
		ПроверитьНаличиеФайловНаКлиенте("DP_PDPOL", 100/КоличествоОпераций, ДанныеСписка, МассивлогаСобытий);
		ПроверитьНаличиеФайловНаКлиенте("DP_PDOTPR", 100/КоличествоОпераций, ДанныеСписка, МассивлогаСобытий);
		
		//ЭтоНовыеДокументы = Истина;
		//ОтправитьФайлыНаКлиенте(Новый Массив, "DP_IZVPOL_10", ДанныеСписка, 100/КоличествоОпераций, 0, Новый Массив, Ложь, Новый Массив, НужнаПодпись, ЭтоНовыеДокументы);
		
		ПроверитьНаличиеФайловНаКлиенте("ON_NSCHFDOPPOK_11", 100/КоличествоОпераций, ДанныеСписка, МассивлогаСобытий);        //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _11]
		ПроверитьНаличиеФайловНаКлиенте("ON_NSCHFDOPPOKMARK_11", 100/КоличествоОпераций, ДанныеСписка, МассивлогаСобытий);    //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _11]
		ПроверитьНаличиеФайловНаКлиенте("ON_NSCHFDOPPOKPROS_11", 100/КоличествоОпераций, ДанныеСписка, МассивлогаСобытий);    //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _11]
		ПроверитьНаличиеФайловНаКлиенте("ON_NKORSCHFDOPPOK_11", 100/КоличествоОпераций, ДанныеСписка, МассивлогаСобытий);     //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _11]
		ПроверитьНаличиеФайловНаКлиенте("ON_NKORSCHFDOPPOKMARK_11", 100/КоличествоОпераций, ДанныеСписка, МассивлогаСобытий); //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _11]
		ПроверитьНаличиеФайловНаКлиенте("ON_NKORSCHFDOPPOKPROS_11", 100/КоличествоОпераций, ДанныеСписка, МассивлогаСобытий); //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _11]

		// Проверить
		ПараметрыСтруктуры = "Тип, ИспользоватьДерево";
		ИспользуемDP_REZRUISP = Новый Соответствие;
		ИспользуемDP_REZRUISP.Вставить("Исходящий DP_REZRUISP (Акт выполненных работ)" , Новый Структура(ПараметрыСтруктуры, "DP_REZRUISP"   , Ложь));
		ПроверитьНаличиеВеткиДерева(ИспользуемDP_REZRUISP);
		Если ИспользуемDP_REZRUISP.Получить("Исходящий DP_REZRUISP (Акт выполненных работ)").ИспользоватьДерево = Истина Тогда
			ПроверитьНаличиеФайловНаКлиенте("DP_REZRUZAK", 100/КоличествоОпераций, ДанныеСписка, МассивлогаСобытий);
		КонецЕсли;
		
		Для каждого Стр Из ИспользуемыеДеревья Цикл		
			Если Стр.Значение.ИспользоватьДерево = Истина Тогда
				ПроверитьНаличиеФайловНаКлиенте(Стр.Значение.Тип, 100/КоличествоОпераций, ДанныеСписка, МассивлогаСобытий);
			КонецЕсли;
			
		КонецЦикла;
		
    КонецЕсли;
        
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьКвитанции(Команда)
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
    ОбновитьКвитанцииНаКлиенте(ДанныеСписка.ИмяСписка);
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаличиеВеткиДерева(ИспользуемыеДеревья)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");;

	// Пример
	//ПараметрыСтруктуры = "Тип, ИспользоватьДерево";
	//ИспользуемыеДеревья = Новый Соответствие;
	//ИспользуемыеДеревья.Вставить("Входящий DP_PRANNUL (аннулирование)"                , Новый Структура(ПараметрыСтруктуры, "DP_PRANNUL"   , Ложь));
	//ИспользуемыеДеревья.Вставить("Входящий DP_IZVPOL_23 (подтверждение аннулирования)", Новый Структура(ПараметрыСтруктуры, "DP_IZVPOL_23" , Ложь));
	//ИспользуемыеДеревья.Вставить("Входящий DP_UVUTOCH_24 (отклонение аннулирования)"  , Новый Структура(ПараметрыСтруктуры, "DP_UVUTOCH_24", Ложь));
	
	Для каждого Стр Из ИспользуемыеДеревья Цикл
	    СтрокаДерева = ОбработкаОбъект.ПолучитьСтруктуруФайлаДанных(Стр.Ключ);
		ИспользоватьСтрокуДерева = Ложь;	
		Если НЕ СтрокаДерева.Строки.Количество() = 0 Тогда	
			Стр.Значение.ИспользоватьДерево = СтрокаДерева.Строки[0].Использовать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ПолучитьОбработку(РежимИспользования, ИспользуемоеИмяФайла)
//		
//	Если РежимИспользования = "обработка в справочнике внешних обработок" Тогда
//		ОбработкаОбъект = ВнешниеОбработки.Создать(ВнешниеОбработки.Подключить(ИспользуемоеИмяФайла,,Ложь), Ложь);
//		
//	ИначеЕсли РежимИспользования = "обработка в составе конфигурации" 
//		ИЛИ РежимИспользования = "обработка в составе расширения" Тогда
//		ОбработкаОбъект = Обработки.ЭКОМ_Интеграция_EDI_ЮЗД.Создать();	
//		
//	Иначе	
//	    ОбработкаОбъект = ВнешниеОбработки.Создать(ИспользуемоеИмяФайла, Ложь);
//	КонецЕсли;
//	
//	Возврат ОбработкаОбъект;
//	
//КонецФункции

#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
// ОТПРАВКА ФАЙЛОВ

&НаКлиенте
Функция ОтправитьФайлыНаКлиенте(МассивСтрок, ТипДокумента, ДанныеСписка, ОбщийПроцентПрогресса, ПозицияТекущейСтроки, ВыделенныеСтроки, ЭтоПовторнаяОтправка, МассивЛогаСобытий, ПодписатьФайл, ЭтоНовыеДокументы) Экспорт
	
	ИмяСобытия = "Отправить документы - " + ТипДокумента;
    НачалоВыполнения = ТекущаяДата();
	
	ОбработатьФайлыНаКлиенте = Истина;
	ЭтоРегламентноеЗадание   = Ложь;
    СтруктураЛога            = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьСтруктуруЛогаНаКлиенте()");
	
	ТекстСообщения = "";
	Если ЭтоПовторнаяОтправка = Истина Тогда
		ТекстСообщения = "Повторная отправка. ";
	КонецЕсли;

	КлючЗаписиЦепочкиДокументов = Элементы[ДанныеСписка.ИмяСписка].ТекущаяСтрока;
	// Начать обработку данных
	Если ЭтаФорма.ДоступноВыполнениеВФоне Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("МассивСтрок"             , МассивСтрок);
		СтруктураПараметров.Вставить("ТипДокумента"            , ТипДокумента);
		СтруктураПараметров.Вставить("МассивЛогаСобытий"       , МассивЛогаСобытий);
		СтруктураПараметров.Вставить("ЭтоРегламентноеЗадание"  , ЭтоРегламентноеЗадание);
		СтруктураПараметров.Вставить("НомерИсправления"        , ЭтаФорма.НомерИсправления);
		СтруктураПараметров.Вставить("ПодписатьФайл"           , ПодписатьФайл);
		СтруктураПараметров.Вставить("СтруктураЛога"           , СтруктураЛога);
		СтруктураПараметров.Вставить("НачалоВыполнения"       , НачалоВыполнения);
		СтруктураПараметров.Вставить("ДанныеСписка"           , ДанныеСписка);		
		СтруктураПараметров.Вставить("ВыделенныеСтроки"       , ВыделенныеСтроки);
		СтруктураПараметров.Вставить("ПозицияТекущейСтроки"   , ПозицияТекущейСтроки);
		СтруктураПараметров.Вставить("ОбщийПроцентПрогресса"  , ОбщийПроцентПрогресса);
		СтруктураПараметров.Вставить("ЭтоНовыеДокументы"      , ЭтоНовыеДокументы);
		СтруктураПараметров.Вставить("ИмяСобытия"			  , ИмяСобытия);
		СтруктураПараметров.Вставить("КлючЗаписиЦепочкиДокументов", КлючЗаписиЦепочкиДокументов);
		
		НачатьВыполнениеВФоне(СтруктураПараметров, "ОтправитьВсеФайлы", ТекстСообщения + "Формируем XML и отправляем файлы - [" + ТипДокумента + "]...");
		Возврат Ложь;	
	Иначе	
		МассивСтруктур = ОтправитьВсеФайлыНаСервереБезКонтекста(ЭтаФорма.ОбработкаТип, МассивСтрок, ТипДокумента, МассивЛогаСобытий, ЭтоРегламентноеЗадание, ЭтаФорма.НомерИсправления, ПодписатьФайл, ЭтоНовыеДокументы, СтруктураЛога);   	
	    ОбработатьОтправкуФайловНаКлиенте(МассивСтруктур, ТипДокумента, НачалоВыполнения, МассивЛогаСобытий, ДанныеСписка, ПозицияТекущейСтроки, ВыделенныеСтроки, ОбщийПроцентПрогресса, ПодписатьФайл, СтруктураЛога, ЭтоРегламентноеЗадание, ЭтоНовыеДокументы, КлючЗаписиЦепочкиДокументов);		
		Возврат Истина;		
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Процедура ОбработатьОтправкуФайловНаКлиенте(МассивСтруктур, ТипДокумента, НачалоВыполнения, МассивЛогаСобытий, ДанныеСписка, ПозицияТекущейСтроки, ВыделенныеСтроки, ОбщийПроцентПрогресса, ПодписатьФайл, СтруктураЛога, ЭтоРегламентноеЗадание, ЭтоНовыеДокументы, КлючЗаписиЦепочкиДокументов = Неопределено) Экспорт
	НастройкиПрофилейОбмена = ЭКОМ_ОбщегоНазначения.ПолучитьНастройкиПрофилейОбмена();
	СохранятьУПДЛокальноБезПодписи = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_СохранятьУПДЛокальноБезПодписи");
	Если СохранятьУПДЛокальноБезПодписи = Неопределено ИЛИ
		Не ТипЗнч(СохранятьУПДЛокальноБезПодписи) = Тип("Булево") Тогда
		СохранятьУПДЛокальноБезПодписи = Ложь;
	КонецЕсли; 
	
	ИмяСобытия = "Отправка документов на клиенте " + ТипДокумента;	
	Если НЕ МассивСтруктур.Количество() = 0 Тогда
		
		ЗначениеПоУмолчанию = "";
		Измерение           = Неопределено; 
		Обязательно         = Истина;
		ЛокальныйКаталогOUTBOX_Архив = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_Локальный_Каталог_OUTBOX_Архив"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
		
		// Проверка каталогов
		ДанныеОС = ЭКОМ_ПолучитьРазделительПутиОСКлиента();
		РазделительПути = ДанныеОС.Получить("РазделительПути");
		
		РаботаСФайламиВыполняетсяЛокально = Ложь;
		Для Каждого Соответствие Из НастройкиПрофилейОбмена Цикл
			Если Соответствие.Значение Тогда
				РаботаСФайламиВыполняетсяЛокально = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ЛокальныеКаталоги 	    = ПолучитьИнформациюОЛокальныхКаталогах(РаботаСФайламиВыполняетсяЛокально, 
									ЛокальныйКаталогOUTBOX_Архив, ТипДокумента, РазделительПути, МассивЛогаСобытий);  
		КаталогСохранения       = ЛокальныеКаталоги.КаталогСохранения;
		КаталогСохраненияФайл   = ЛокальныеКаталоги.КаталогСохраненияФайл;     			
		КаталогMarkingДоступен  = ЛокальныеКаталоги.КаталогMarkingДоступен;
		КаталогOutboxДоступен   = ЛокальныеКаталоги.КаталогOutboxДоступен;
		ЛокальныйКаталогMarking = ЛокальныеКаталоги.КаталогMarking;
		ЛокальныйКаталогOUTBOX  = ЛокальныеКаталоги.КаталогOUTBOX; 
		
		Если НЕ КаталогСохраненияФайл = Неопределено И КаталогMarkingДоступен И КаталогOutboxДоступен Тогда
			
			МассивОшибочных = Новый Массив;
			Для каждого СтруктураEDI Из МассивСтруктур Цикл
				
				СтруктураEDI.Вставить("Отправлен"    , Ложь);
				СтруктураEDI.Вставить("Сообщение"    , "");
				
				// Проверка чтобы вся цепочка была подписана одним сертификатом для поставщика
				Если ТипДокумента = "DP_IZVPOL_04"
					ИЛИ ТипДокумента = "DP_IZVPOL_10"
					ИЛИ ТипДокумента = "DP_PTORG1" Тогда
					
					// Получаю из хранилища двоичные данные		
					Если НЕ ЗначениеЗаполнено(СтруктураEDI.ЭЦПотЮЗД) Тогда
						ТекстЛогаСобытий = "ЭЦП неопрелен для " + СтруктураEDI.ПредставлениеДок;
						ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
						МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
						
						Продолжить;
					КонецЕсли;
					
					Если СтруктураEDI.СертификатНаСервере = Истина Тогда		
						СертификатСовпадает = Вычислить("ЭКОМ_ОбщегоНазначения.ЭЦП_ОперацииПроверкиПодписиНаСервере(СтруктураEDI.ЭЦПотЮЗД, СтруктураEDI.ДанныеСертификатаЭКОМ, МассивЛогаСобытий)");
					Иначе
						СертификатСовпадает = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ЭЦП_ОперацииПроверкиПодписиНаКлиенте(СтруктураEDI.ЭЦПотЮЗД, СтруктураEDI.ДанныеСертификатаЭКОМ, МассивЛогаСобытий)");
					КонецЕсли;
					
					Если НЕ СертификатСовпадает Тогда
						ТекстЛогаСобытий = "УПД подписан другим сертификатом, " + ТипДокумента + " на " + Строка(СтруктураEDI.ВидДокумента) + " отправлен не будет! (1852) - " + СтруктураEDI.ПредставлениеДок;
						ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
						МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

						Продолжить;
					КонецЕсли;		
					
				КонецЕсли;
				
				// Получем файл 
				ФайлXML = ПолучитьФайлДокументаНаКлиенте(СтруктураEDI.ИмяФайлаXML, СтруктураEDI.СтрокаXML, СтруктураEDI.КодировкаФайла, КаталогСохранения);
				Если НЕ ФайлXML.Существует() Тогда
					Продолжить;
				КонецЕсли; 
				
				ПроверятьФайлыЛокально = НастройкиПрофилейОбмена.Получить(СтруктураEDI.Организация);
				Если ПроверятьФайлыЛокально Тогда
					КопироватьФайл(ФайлXML.ПолноеИмя, ЛокальныйКаталогOUTBOX + ФайлXML.Имя);
				КонецЕсли;
				
				Если ПроверятьФайлыЛокально И СохранятьУПДЛокальноБезПодписи Тогда
					Продолжить;
				КонецЕсли;
				
				Если ПодписатьФайл Тогда
					ФайлBINПолноеИмя = КаталогСохранения + ФайлXML.ИмяБезРасширения + ".bin";
					ДвоичныеДанныеФайлаXML = Новый ДвоичныеДанные(ФайлXML.ПолноеИмя);
					
					//+MOD-2544
					//Если СтруктураEDI.СтранаПрофиля = "kz" И Найти(ТипДокумента, "CONDRA_") > 0 Тогда //добавим прикрепленный файл
					//	ЗначениеПоУмолчанию = "";
					//	ЛокальныйКаталогINBOX_Архив = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_Локальный_Каталог_INBOX_Архив"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
					//	НайденныеФайлы = НайтиФайлы(ЛокальныйКаталогINBOX_Архив + "CONDRA", СтруктураEDI.ИмяФайла, Истина);
					//	
					//	Если НайденныеФайлы.Количество() Тогда
					//		Файл =  Новый Файл(НайденныеФайлы[0].ПолноеИмя);
					//		ДвоичныеДанныеФайлаXML = Новый ДвоичныеДанные(Файл.ПолноеИмя);
					//		СтруктураEDI.Вставить("ИмяФайлаДанных", Файл.Имя);                      
					//		СтруктураEDI.Вставить("ДвоичныеДанныеФайлаДанных", ДвоичныеДанныеФайлаXML);
					//	КонецЕсли;

					//КонецЕсли;
					//-MOD-2544
					
					// Создаем подпись
					Если СтруктураEDI.СертификатНаСервере = Истина Тогда              
						ДвоичныеДанныеФайлаBIN = Вычислить("ЭКОМ_ОбщегоНазначения.ЭЦП_СформироватьПодписьФайлаОбщегоНазначения(ДвоичныеДанныеФайлаXML, СтруктураEDI.ДанныеСертификатаЭКОМ, МассивЛогаСобытий)");
						ТипПодписи = "на сервере";
						
					Иначе
						Если СтруктураEDI.СтранаПрофиля = "kz" Тогда //MOD-2544  					
							Base64ДанныеФайлаBIN = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ПодписатьТекстKalkanCryptCOM(ДвоичныеДанныеФайлаXML, МассивЛогаСобытий)");
							ДвоичныеДанныеФайлаBIN = Base64Значение(Base64ДанныеФайлаBIN);
						Иначе	
							ДвоичныеДанныеФайлаBIN = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ЭЦП_СформироватьПодписьФайлаОбщегоНазначения(ДвоичныеДанныеФайлаXML, СтруктураEDI.ДанныеСертификатаЭКОМ, МассивЛогаСобытий)");
						КонецЕсли;
						//ДвоичныеДанныеФайлаBIN = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ЭЦП_СформироватьПодписьФайлаОбщегоНазначения(ДвоичныеДанныеФайлаXML, СтруктураEDI.ДанныеСертификатаЭКОМ, МассивЛогаСобытий)");
						ТипПодписи = "на клиенте";				
					КонецЕсли;
					
					Если ДвоичныеДанныеФайлаBIN = Неопределено Тогда
						ТекстЛогаСобытий = ТипДокумента + " - по электронному документу " + СокрЛП(СтруктураEDI.Документ) + 
						" - " + ТипПодписи + " не подписан! Проверьте сертификат по организации - " + СокрЛП(СтруктураEDI.Организация);
						ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
						МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

						МассивОшибочных.Добавить(СтруктураEDI);
						Продолжить;
						
					Иначе
						// Файл подписи необходимо закодировать в Base64
						ФайлПодписи = Новый ЗаписьТекста(ФайлBINПолноеИмя, КодировкаТекста.ANSI);		
						ФайлПодписи.Записать(Base64Строка(ДвоичныеДанныеФайлаBIN));
						ФайлПодписи.Закрыть();
						
						Если ПроверятьФайлыЛокально Тогда
							КопироватьФайл(ФайлПодписи.ПолноеИмя, ЛокальныйКаталогOUTBOX + ФайлПодписи.Имя);
						КонецЕсли;
						
					КонецЕсли;
					
					СтруктураEDI.Вставить("ИмяФайлаBIN"           , ФайлXML.ИмяБезРасширения + ".bin");
					СтруктураEDI.Вставить("ДвоичныеДанныеФайлаBIN", ДвоичныеДанныеФайлаBIN);
					
				КонецЕсли;
				
			КонецЦикла;
			
			// Удаляем 
			Для каждого ЭлМассивОшибочных Из МассивОшибочных Цикл
				Для каждого СтруктураEDI Из МассивСтруктур  Цикл
					Если СтруктураEDI.ИмяФайлаXML = ЭлМассивОшибочных.ИмяФайлаXML Тогда
						МассивСтруктур.Удалить(МассивСтруктур.Найти(СтруктураEDI));	
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
			// Начать обработку данных
			Если ЭтаФорма.ДоступноВыполнениеВФоне Тогда
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("МассивФайловВсего"       , МассивСтруктур);
				СтруктураПараметров.Вставить("ТипДокумента"            , ТипДокумента);
				//Docrobot 1.20.0 MOD-1637 [Вместо МассивЛогаСобытий отправляем новый массив, в противном случае лог задваивается]
				СтруктураПараметров.Вставить("МассивЛогаСобытий"       , Новый Массив);
				СтруктураПараметров.Вставить("ЭтоРегламентноеЗадание"  , ЭтоРегламентноеЗадание);
				
				СтруктураПараметров.Вставить("НачалоВыполнения"       , НачалоВыполнения);
				СтруктураПараметров.Вставить("ДанныеСписка"           , ДанныеСписка);			
				СтруктураПараметров.Вставить("ВыделенныеСтроки"       , ВыделенныеСтроки);
				СтруктураПараметров.Вставить("ПозицияТекущейСтроки"   , ПозицияТекущейСтроки);
				СтруктураПараметров.Вставить("ОбщийПроцентПрогресса"  , ОбщийПроцентПрогресса);
				СтруктураПараметров.Вставить("СтруктураЛога"          , СтруктураЛога);
				СтруктураПараметров.Вставить("ЭтоНовыеДокументы"      , ЭтоНовыеДокументы);
				СтруктураПараметров.Вставить("КлючЗаписиЦепочкиДокументов", КлючЗаписиЦепочкиДокументов);
				
				НачатьВыполнениеВФоне(СтруктураПараметров, "ОтправитьФайлы", "Отправляем подписанные файлы XML - [" + ТипДокумента + "]...");
				
			Иначе				
				ОтправитьФайлыНаСервереБезКонтекста(ЭтаФорма.ОбработкаТип, МассивСтруктур, ТипДокумента, МассивЛогаСобытий, ЭтоРегламентноеЗадание, ЭтоНовыеДокументы, СтруктураЛога);	
				ЗавершитьОтправкуНаКлиенте(ТипДокумента, НачалоВыполнения, МассивЛогаСобытий, ДанныеСписка, ПозицияТекущейСтроки, ВыделенныеСтроки, ОбщийПроцентПрогресса, СтруктураЛога, КлючЗаписиЦепочкиДокументов);
				
			КонецЕсли;
		Иначе
			ТекстЛогаСобытий = "";
			Если КаталогСохраненияФайл = Неопределено Тогда
				ТекстЛогаСобытий = ТекстЛогаСобытий + "Проверьте каталог сохранения исходящих и каталог сохранения архива исходящих файлов";
			ИначеЕсли Не КаталогMarkingДоступен Тогда
				ТекстЛогаСобытий = ТекстЛогаСобытий + "Проверьте каталог ""marking"". Возможно незаполнен адрес или каталог недоступен для записи на сервере"; 
			ИначеЕсли Не КаталогOutboxДоступен Тогда
				ТекстЛогаСобытий = ТекстЛогаСобытий + "Проверьте каталог ""outbox"". Возможно незаполнен адрес или каталог недоступен для записи."; 
			КонецЕсли;

			СтруктураЛога.ЕстьОшибка = Истина;
			ЗаписьСтруктурыЛога		 = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

			ЗавершитьОтправкуНаКлиенте(ТипДокумента, НачалоВыполнения, МассивЛогаСобытий, ДанныеСписка, ПозицияТекущейСтроки, ВыделенныеСтроки, ОбщийПроцентПрогресса, СтруктураЛога, КлючЗаписиЦепочкиДокументов);
		КонецЕсли;	
	Иначе
		ТекстЛогаСобытий = "Нет сформированных документов для отправки";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Предупреждение"), ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

		ЗавершитьОтправкуНаКлиенте(ТипДокумента, НачалоВыполнения, МассивЛогаСобытий, ДанныеСписка, ПозицияТекущейСтроки, ВыделенныеСтроки, ОбщийПроцентПрогресса, СтруктураЛога, КлючЗаписиЦепочкиДокументов);

	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьОтправкуНаКлиенте(ТипДокумента, НачалоВыполнения, МассивЛогаСобытий, ДанныеСписка, ПозицияТекущейСтроки, ВыделенныеСтроки, ОбщийПроцентПрогресса, СтруктураЛога, КлючЗаписиЦепочкиДокументов = Неопределено) Экспорт
	
	ИмяСобытия = "Отправка документов на клиенте " + ТипДокумента;
	
	// Статус завершения операции в фоне
	ЭтаФорма.Индикатор = ЭтаФорма.Индикатор + ОбщийПроцентПрогресса;
	Если ЭтаФорма.Индикатор > 99 Тогда
	     Элементы.ПолеИндикатор.Видимость = Ложь;
		 Элементы.КомандаЗакрытьИндикатор.Видимость = Ложь;
	КонецЕсли;
		
	Если СтруктураЛога.ЕстьОшибка = Истина Тогда
		Элементы.КомандаНадписьОшибка.Видимость = Истина;
	КонецЕсли;
	
	ОбновитьДинамическийСписок(ДанныеСписка, Истина, ВыделенныеСтроки, КлючЗаписиЦепочкиДокументов);
	ОбновитьЦепочкуДокументовНаКлиенте(ДанныеСписка.ИмяСписка, КлючЗаписиЦепочкиДокументов);
	ОбновитьКвитанцииНаКлиенте(ДанныеСписка.ИмяСписка);	
    ВосстановитьТекущуюСтрокуСписка(ПозицияТекущейСтроки, ДанныеСписка.ИмяСписка, ВыделенныеСтроки);  
	
	ТекстЛогаСобытий = "Время выполнения " + ЭКОМ_ОбщегоНазначенияКлиент.СекундыВоВремяНаКлиенте(ТекущаяДата() - НачалоВыполнения).Строка;
	ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Информация"), ИмяСобытия);
	МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
	
	ОтобразитьЛогСобытий(МассивЛогаСобытий);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере 
Процедура ПроверитьЗаполнитьЗначенияДопКонстант()
	
	СтруктураДанныеДляПроверки = Новый Структура;	
	
	СтруктураДанныеДляПроверки.Вставить("ЭКОМ_ИспПарольДляНастроек",Ложь);
	СтруктураДанныеДляПроверки.Вставить("ЭКОМ_ОтправлятьДокументыПовторно",Ложь);
	СтруктураДанныеДляПроверки.Вставить("ЭКОМ_ИспользоватьАдресаИзРегистраGLN",Ложь);
	СтруктураДанныеДляПроверки.Вставить("ЭКОМ_ИспользоватьАдресаИзРегистраТочкиДоставкиGLN",Ложь);
	СтруктураДанныеДляПроверки.Вставить("ЭКОМ_ПодписыватьПрайсЛист",Ложь);
	СтруктураДанныеДляПроверки.Вставить("ЭКОМ_ПолучатьСтатусФайлы",Ложь);
	СтруктураДанныеДляПроверки.Вставить("ЭКОМ_СоздаватьДокументЗаказ1СПроведенным",Ложь);
	СтруктураДанныеДляПроверки.Вставить("ЭКОМ_СоздаватьДокументРеализация1СПроведенным",Ложь);
	СтруктураДанныеДляПроверки.Вставить("ЭКОМ_ЗаказыЗагружатьТекущейДатой",Ложь);
	СтруктураДанныеДляПроверки.Вставить("ЭКОМ_РеализацииСоздаватьДатойПоставки",Ложь);
	СтруктураДанныеДляПроверки.Вставить("ЭКОМ_ОтправлятьНепроведенные",Ложь);
	СтруктураДанныеДляПроверки.Вставить("ЭКОМ_СоздаватьДокументПоступления1СПроведенным",Ложь);
	СтруктураДанныеДляПроверки.Вставить("ЭКОМ_СоздаватьДокументПолученныйСЧФ1СПроведенным",Ложь);
	СтруктураДанныеДляПроверки.Вставить("ЭКОМ_ОбрабатыватьПовторныеORDER",Ложь);
	СтруктураДанныеДляПроверки.Вставить("ЭКОМ_ПерезаписыватьЗаказ",Ложь);
	СтруктураДанныеДляПроверки.Вставить("ЭКОМ_ВыборВетвиРепозитория",Ложь);
	СтруктураДанныеДляПроверки.Вставить("ЭКОМ_ОтмечатьИзмененныеШаблоны",Ложь);
	СтруктураДанныеДляПроверки.Вставить("ЭКОМ_ИспользоватьПредставленияШаблонов",Истина);
	
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Для Каждого ЭлементСтруктурыДляПроверки Из СтруктураДанныеДляПроверки Цикл		
		Если ОбработкаОбъект.Настройка_Параметр_Прочитать(ЭлементСтруктурыДляПроверки.Ключ) = Неопределено Тогда			
			ОбработкаОбъект.Настройка_Параметр_Записать(ЭлементСтруктурыДляПроверки.Ключ, ЭлементСтруктурыДляПроверки.Значение);			
		КонецЕсли		
	КонецЦикла;	
	
КонецПроцедуры

// Возвращает настройки формы для текущего пользователя информационной базы
//
// Параметры:
//  ТекущийПользователь  - СправочникСсылка.Пользователи - текущий пользователь информационной базы, полученный из параметров сеанса
//
// Возвращаемое значение:
//   Структура   - Пользовательские настройки
//
&НаСервереБезКонтекста
Функция ПолучитьПользовательскиеНастройки(ТекущийПользователь)

	Настройки = Новый Структура;
	
	ПараметрыОтбора = Новый Структура("КлючОбъекта, Пользователь", "Docrobot_ОсновнаяФорма", ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
	ВыборкаНастроек = ХранилищеНастроекДанныхФорм.Выбрать(ПараметрыОтбора);
	Пока ВыборкаНастроек.Следующий() Цикл
		Настройки.Вставить(ВыборкаНастроек.КлючНастроек, ВыборкаНастроек.Настройки);
	КонецЦикла;
	
	Возврат Настройки;
	
КонецФункции // ПолучитьПользовательскиеНастройки()

// Записывает настройки формы для текущего пользователя информационной базы
//
// Параметры:
//  ТекущийПользователь  - СправочникСсылка.Пользователи - текущий пользователь информационной базы, полученный из параметров сеанса
//  Настройки  - Структура - коллекция настроек формы для текущего пользователя
//
&НаСервереБезКонтекста
Процедура СохранитьПользовательскиеНастройки(ТекущийПользователь, Настройки)

	Для Каждого Настройка Из Настройки Цикл
		ХранилищеНастроекДанныхФорм.Сохранить("Docrobot_ОсновнаяФорма", Настройка.Ключ, Настройка.Значение, , ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
	КонецЦикла;

КонецПроцедуры // СохранитьПользовательскиеНастройки()

// Выполняется вызов функции из модуля объекта обарботки
//
// Параметры:
//  ИмяФункции  - Строка - наименование функции в модуле объекта
//  ПараметрыФункции  - Массив - парамеры функции в последовательности их заполнения 
//
// Возвращаемое значение:
//   Any   - результат выполнения функции
//
&НаСервере                             
Функция ВернутьРезультатИзМодуляОбъекта(ИмяФункции, ПараметрыФункции = Неопределено)	
    
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    
    Если ПараметрыФункции = Неопределено Тогда	
        ПараметрыФункции = Новый Массив;	
    ИначеЕсли ТипЗнч(ПараметрыФункции) <> Тип("Массив") Тогда	
        ВызватьИсключение "Ошибка валидации входного параметра";		
    КонецЕсли;
    
    Результат = Неопределено;
    
    СтрокаФункции = "ОбработкаОбъект." + ИмяФункции + "(";
    Индекс = 0;
    
    ПараметрыФункцииСтруктура = Новый Структура;
    Пока Индекс < ПараметрыФункции.Количество() Цикл
        ПараметрыФункцииСтруктура.Вставить("Ключ_" + Индекс, ПараметрыФункции.Получить(Индекс));
        СтрокаФункции 	= СтрокаФункции + ?(Индекс = 0, "", ", ") + "ПараметрыФункцииСтруктура.Ключ_" + Индекс; 
        Индекс 			= Индекс + 1;
    КонецЦикла;
    
    СтрокаФункции = СтрокаФункции + ")";
    Результат = Вычислить(СтрокаФункции);
    
    Для Каждого ЭлементСтруктуры Из ПараметрыФункцииСтруктура Цикл
        Индекс = Число(СтрЗаменить(ЭлементСтруктуры.Ключ, "Ключ_", ""));
        ПараметрыФункции.Вставить(Индекс, ЭлементСтруктуры.Значение);	
    КонецЦикла;
    
    Возврат Результат;
    
КонецФункции // ВернутьРезультатИзМодуляОбъекта()
	
&НаСервере                             
Функция ВернутьРезультатИзМодуляОбъектаСтруктура(ИмяФункции, ПараметрыФункцииСтруктура, МассивЛогаСобытий = Неопределено)	
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СтрокаФункции = "ОбработкаОбъект." + ИмяФункции + "(";	
	Для каждого СтруктураПараметр Из ПараметрыФункцииСтруктура Цикл
		СтрокаФункции = СтрокаФункции + ?(Прав(СтрокаФункции, 1) = "(", "", ", ") + "ПараметрыФункцииСтруктура." + СтруктураПараметр.Ключ;
	КонецЦикла;
	
	Если НЕ МассивЛогаСобытий = Неопределено Тогда
		 СтрокаФункции = СтрокаФункции + ?(Прав(СтрокаФункции, 1) = "(", "", ", ") + "МассивЛогаСобытий";		
	КонецЕсли;
	СтрокаФункции = СтрокаФункции + ")";
	
	Попытка
		Результат = Вычислить(СтрокаФункции);	
	Исключение
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции 

&НаСервере                             
Процедура ВыполнитьПроцедуруИзМодуляОбъектаСтруктура(ИмяПроцедуры, ПараметрыАлгоритма, МассивЛогаСобытий = Неопределено)	
		 
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Если ТипЗнч(ПараметрыАлгоритма) <> Тип("Структура") Тогда	
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка валидации входного параметра";
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;
	
    СтрокаПроцедуры = "ОбработкаОбъект." + ИмяПроцедуры + "(";	
	Для каждого СтруктураПараметр Из ПараметрыАлгоритма Цикл
		СтрокаПроцедуры = СтрокаПроцедуры + ?(Прав(СтрокаПроцедуры, 1) = "(", "", ", ") + "ПараметрыАлгоритма." + СтруктураПараметр.Ключ;
	КонецЦикла;
	
	Если НЕ МассивЛогаСобытий = Неопределено Тогда
		 СтрокаПроцедуры = СтрокаПроцедуры + ?(Прав(СтрокаПроцедуры, 1) = "(", "", ", ") + "МассивЛогаСобытий";		
	КонецЕсли;
	СтрокаПроцедуры = СтрокаПроцедуры + ")";
	
	Попытка
		Выполнить(СтрокаПроцедуры);	
	Исключение
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере                             
Процедура ВыполнитьПроцедуруИзМодуляОбъекта(ИмяПроцедуры, ПараметрыПроцедуры = Неопределено)	
    
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    
    Если ПараметрыПроцедуры = Неопределено Тогда	
        ПараметрыПроцедуры = Новый Массив;	
    ИначеЕсли ТипЗнч(ПараметрыПроцедуры) <> Тип("Массив") Тогда	
        ВызватьИсключение "Ошибка валидации входного параметра";		
    КонецЕсли;
    
    Результат = Неопределено;
    
    СтрокаПроцедуры = "ОбработкаОбъект." + ИмяПроцедуры + "(";
    Индекс = 0;
    
    ПараметрыПроцедурыСтруктура = Новый Структура;
    Пока Индекс < ПараметрыПроцедуры.Количество() Цикл
        ПараметрыПроцедурыСтруктура.Вставить("Ключ_" + Индекс, ПараметрыПроцедуры.Получить(Индекс));
        СтрокаПроцедуры = СтрокаПроцедуры + ?(Индекс = 0, "", ", ") + "ПараметрыПроцедурыСтруктура.Ключ_" + Индекс; 
        Индекс 			= Индекс + 1;	
    КонецЦикла;
    
    СтрокаПроцедуры = СтрокаПроцедуры + ")";
    Выполнить(СтрокаПроцедуры);
    
    Для Каждого ЭлементСтруктуры Из ПараметрыПроцедурыСтруктура Цикл
        Индекс = Число(СтрЗаменить(ЭлементСтруктуры.Ключ, "Ключ_", ""));
        ПараметрыПроцедуры.Вставить(Индекс, ЭлементСтруктуры.Значение);	
    КонецЦикла;
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСоотвСтатусов()
    
    СоотвСтатусовПоставщик = Новый Соответствие;
    СоотвСтатусовПоставщик.Вставить(Перечисления.ЭКОМ_Статусы.Отправлен                , "Отправлен");            // (ON_SCHFDOPPR  - 01) исх.
	
	// (DP_PDPOL      - 02) вх.  - Подтверждено получение в СОС
	// (DP_IZVPOL     - 04) исх. - Дата поступления УПД
	// (DP_IZVPOL     - 06) вх.  - Извещение получения УПД
	СоотвСтатусовПоставщик.Вставить(Перечисления.ЭКОМ_Статусы.ОжиданиеПодтверждения    , "Ожидание контрагента");       
                
	// (DP_UVUTOCH    - 09) вх.  - Уведомление об уточнении
	// (DP_IZVPOL     - 10) исх. - Извещение получения уточнения
    СоотвСтатусовПоставщик.Вставить(Перечисления.ЭКОМ_Статусы.Уточнение_Получено       , "Получено уточнение");                    
            
	СоотвСтатусовПоставщик.Вставить(Перечисления.ЭКОМ_Статусы.ПодписаноПокупателем     , "Подписан"); // (ON_SCHFDOPPOK - 11) вх. и (DP_IZVPOL - 06 // 10) вх. если СЧФ // Уточ
	СоотвСтатусовПоставщик.Вставить(Перечисления.ЭКОМ_Статусы.ДокументооборотЗавершен  , "Документооборот завершен"); // (ON_SCHFDOPPOK - 11) вх. и (DP_IZVPOL - 06 // 10) вх. если СЧФ // Уточ
    СоотвСтатусовПоставщик.Вставить(Перечисления.ЭКОМ_Статусы.Подтвержден_с_отклонением, "Завершён с уточнением");    //   
    
    СоотвСтатусовПокупатель = Новый Соответствие;
    СоотвСтатусовПокупатель.Вставить(Перечисления.ЭКОМ_Статусы.НеОбработан              , "Не обработан");             // (ON_SCHFDOPPR  - 01) вх.  - УПД
	
	// (DP_PDPOTPR    - 03) вх.  - ПодтверждениеДатыОтправкиУПД 
	// (DP_IZVPOL     - 05) исх. - Дата отправки УПД
	// (DP_IZVPOL     - 06) исх. - Извещение получения УПД
	// (DP_PDPOTPR    - 07) вх.  - Подтверждение отправки в СОС
	// (DP_IZVPOL     - 08) исх. - ДатаОтправкиИзвещенияПокупатель СЧФДОП                      
    СоотвСтатусовПокупатель.Вставить(Перечисления.ЭКОМ_Статусы.ТребуетсяПодписатьУПД    , "Требуется подписать ЮЗД");
	СоотвСтатусовПокупатель.Вставить(Перечисления.ЭКОМ_Статусы.ПодписаноПокупателем     , "Подписан"); 
	
	// (DP_UVUTOCH    - 09) исх. - Уведомление об уточнении
	// (DP_IZVPOL     - 10) вх.  - Извещение получения уточнения 
	СоотвСтатусовПокупатель.Вставить(Перечисления.ЭКОМ_Статусы.ОтправленоУточнение      , "Отправлено уточнение");        	
    СоотвСтатусовПокупатель.Вставить(Перечисления.ЭКОМ_Статусы.ДокументооборотЗавершен  , "Документооборот завершен"); // (ON_SCHFDOPPOK - 11) исх. и (DP_IZVPOL - 08 ) исх. если СЧФ ИнформацияПокупателя
    СоотвСтатусовПокупатель.Вставить(Перечисления.ЭКОМ_Статусы.Подтвержден_с_отклонением, "Завершён с уточнением");    // (DP_OTORG2) вх.  
    
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокДокументов(ВыбраннаяСтрока, ИмяСписка, ВключитьИсходнуюСчФИзОснованияСчФ = Истина)
			
	Если НЕ ИмяСписка = "СписокДляЭТРН" Тогда
		
		СчетФактураИсходная = ВыбраннаяСтрока.ДокументСЧФ;
		СчетФактураКоррИспр = Неопределено;
		СчетФактураИспр     = Неопределено;
		СчетФактураКорр     = Неопределено;
		ЭтоКорректировка    = Ложь;
		ЭтоИсправление      = Ложь;
		
		Если ЗначениеЗаполнено(СчетФактураИсходная) Тогда
			
			Если НЕ СчетФактураИсходная.Метаданные().Реквизиты.Найти("Корректировочный") = Неопределено Тогда
				ЭтоКорректировка = СчетФактураИсходная.Корректировочный;	
			ИначеЕсли НЕ СчетФактураИсходная.Метаданные().Реквизиты.Найти("ВидСчетаФактуры") = Неопределено Тогда
				ЭтоКорректировка = СчетФактураИсходная.ВидСчетаФактуры = ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыВыставленного.Корректировочный");				
			КонецЕсли;
			
			Если НЕ СчетФактураИсходная.Метаданные().Реквизиты.Найти("Исправление") = Неопределено Тогда
				ЭтоИсправление = СчетФактураИсходная.Исправление;		
			КонецЕсли;
			
			СчетФактураОснование = "ИсправляемыйСчетФактура";
			Если НЕ СчетФактураИсходная.Метаданные().Реквизиты.Найти("СчетФактураОснование") = Неопределено Тогда
				СчетФактураОснование = "СчетФактураОснование";		
			КонецЕсли;
			
			Если ЭтоКорректировка И ЭтоИсправление Тогда
				СчетФактураКоррИспр = СчетФактураИсходная;
			ИначеЕсли ЭтоИсправление Тогда
				СчетФактураИспр     = СчетФактураИсходная;
			ИначеЕсли ЭтоКорректировка Тогда
				СчетФактураКорр     = СчетФактураИсходная;
			КонецЕсли;
            
            Если (ЭтоКорректировка Или ЭтоИсправление) И ВключитьИсходнуюСчФИзОснованияСчФ = Истина Тогда
                СчетФактураИсходная = СчетФактураИсходная[СчетФактураОснование];		
            КонецЕсли;
            
		КонецЕсли;
		
	КонецЕсли;

    
    // Чтобы не было задвоений
    СписокСоответствий = Новый Соответствие;
    Если ИмяСписка = "СписокДляПоставщика"  Тогда
        Если ВыбраннаяСтрока.Свойство("ЭКОМ_Документ_ORDER") Тогда
            СписокСоответствий.Вставить(ВыбраннаяСтрока.ЭКОМ_Документ_ORDER, "А");
        КонецЕсли;
        Если ВыбраннаяСтрока.Свойство("ДокументЗаказа") Тогда
            СписокСоответствий.Вставить(ВыбраннаяСтрока.ДокументЗаказа, "Б");
        КонецЕсли;	
        Если ВыбраннаяСтрока.Свойство("ДокументРеализации") Тогда
            СписокСоответствий.Вставить(ВыбраннаяСтрока.ДокументРеализации, "В");
        КонецЕсли;
        Если ВыбраннаяСтрока.Свойство("ЭКОМ_Документ_RECADV") Тогда
            СписокСоответствий.Вставить(ВыбраннаяСтрока.ЭКОМ_Документ_RECADV, "Г");
        КонецЕсли;	
        СписокСоответствий.Вставить(СчетФактураИсходная                       , "Д");
        СписокСоответствий.Вставить(СчетФактураИспр                           , "Е");
        СписокСоответствий.Вставить(СчетФактураКорр                           , "Ж");
        СписокСоответствий.Вставить(СчетФактураКоррИспр                       , "З");
        Если ВыбраннаяСтрока.Свойство("КорректировкаРеализации") Тогда
            СписокСоответствий.Вставить(ВыбраннаяСтрока.КорректировкаРеализации, "И");
        КонецЕсли;	
        Если ВыбраннаяСтрока.Свойство("ВозвратТоваровОтПокупателя") Тогда
            СписокСоответствий.Вставить(ВыбраннаяСтрока.ВозвратТоваровОтПокупателя, "К");		
        КонецЕсли;	
    ИначеЕсли ИмяСписка = "СписокДляПокупателя" Тогда
        Если ВыбраннаяСтрока.Свойство("ДокументЗаказа") Тогда
            СписокСоответствий.Вставить(ВыбраннаяСтрока.ДокументЗаказа            , "А");
        КонецЕсли;	
        Если ВыбраннаяСтрока.Свойство("ЭКОМ_Документ_ORDRSP") Тогда
            СписокСоответствий.Вставить(ВыбраннаяСтрока.ЭКОМ_Документ_ORDRSP      , "Б");
        КонецЕсли;	
        Если ВыбраннаяСтрока.Свойство("ЭКОМ_Документ_DESADV") Тогда
            СписокСоответствий.Вставить(ВыбраннаяСтрока.ЭКОМ_Документ_DESADV      , "В");
        КонецЕсли;	
        Если ВыбраннаяСтрока.Свойство("ДокументПоступления") Тогда
            СписокСоответствий.Вставить(ВыбраннаяСтрока.ДокументПоступления       , "Г");
        КонецЕсли;	
        Если ВыбраннаяСтрока.Свойство("ДокументЭКОМ_ЮЗД") Тогда
            СписокСоответствий.Вставить(ВыбраннаяСтрока.ДокументЭКОМ_ЮЗД          , "Д");
        КонецЕсли;	
        СписокСоответствий.Вставить(СчетФактураИсходная                       , "Е");
        СписокСоответствий.Вставить(СчетФактураИспр                           , "Ж");
        СписокСоответствий.Вставить(СчетФактураКорр                           , "З");
        СписокСоответствий.Вставить(СчетФактураКоррИспр                       , "И");
        Если ВыбраннаяСтрока.Свойство("КорректировкаПоступления") Тогда
            СписокСоответствий.Вставить(ВыбраннаяСтрока.КорректировкаПоступления  , "К");
        КонецЕсли;	
        Если ВыбраннаяСтрока.Свойство("ВозвратТоваровПоставщику") Тогда
            СписокСоответствий.Вставить(ВыбраннаяСтрока.ВозвратТоваровПоставщику  , "Л");		
		КонецЕсли;	
	ИначеЕсли ИмяСписка = "СписокДляЭТРН"  Тогда
		
		Если ВыбраннаяСтрока.Свойство("Накладная") Тогда
			СписокСоответствий.Вставить(ВыбраннаяСтрока.Накладная, "А");
		КонецЕсли;	
		Если ВыбраннаяСтрока.Свойство("ДокументЭКОМ") Тогда
			СписокСоответствий.Вставить(ВыбраннаяСтрока.ДокументЭКОМ, "Б");
		КонецЕсли;

    КонецЕсли;
    
    СписокДокументов = Новый СписокЗначений;
    Для каждого Эл Из СписокСоответствий Цикл
        Если ЗначениеЗаполнено(Эл.Ключ) Тогда
            СписокДокументов.Добавить(Эл.Ключ, Эл.Значение); 
        КонецЕсли;		
    КонецЦикла;
	
    Возврат СписокДокументов;
    
КонецФункции

&НаКлиенте
Процедура СоздатьЛокальныеКаталогиНаКлиенте(МассивЛогаСобытий) Экспорт
		
	МассивНастроек = Новый Массив;
	МассивНастроек.Добавить("ЭКОМ_Рабочий_Каталог");
	МассивНастроек.Добавить("ЭКОМ_Локальный_Каталог_INBOX");
	МассивНастроек.Добавить("ЭКОМ_Локальный_Каталог_INBOX_Архив");
	МассивНастроек.Добавить("ЭКОМ_Локальный_Каталог_OUTBOX");
	МассивНастроек.Добавить("ЭКОМ_Локальный_Каталог_OUTBOX_Архив");
	МассивНастроек.Добавить("ЭКОМ_Локальный_Каталог_UPDATE");
	МассивНастроек.Добавить("ЭКОМ_Локальный_Каталог_Marking");

    НастройкиЭКОМ  = ПолучитьСписокНастроекНаСервере(МассивНастроек);
	 
   	РабочийКаталог                 = НастройкиЭКОМ.Получить("ЭКОМ_Рабочий_Каталог");
	Локальный_Каталог_INBOX        = НастройкиЭКОМ.Получить("ЭКОМ_Локальный_Каталог_INBOX"); 
	Локальный_Каталог_INBOX_Архив  = НастройкиЭКОМ.Получить("ЭКОМ_Локальный_Каталог_INBOX_Архив");
	Локальный_Каталог_OUTBOX       = НастройкиЭКОМ.Получить("ЭКОМ_Локальный_Каталог_OUTBOX");
	Локальный_Каталог_OUTBOX_Архив = НастройкиЭКОМ.Получить("ЭКОМ_Локальный_Каталог_OUTBOX_Архив");
	Локальный_Каталог_UPDATE       = НастройкиЭКОМ.Получить("ЭКОМ_Локальный_Каталог_UPDATE");
	Локальный_Каталог_Marking      = НастройкиЭКОМ.Получить("ЭКОМ_Локальный_Каталог_Marking");
	
	ДанныеОС        = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ЭКОМ_ПолучитьРазделительПутиОСКлиента()");
	Диск            = ДанныеОС.Получить("Диск");
	РазделительПути = ДанныеОС.Получить("РазделительПути");

	ПроверитьЛокальныйКаталог(РабочийКаталог, РазделительПути);
	ПроверитьЛокальныйКаталог(Локальный_Каталог_INBOX, РазделительПути);
	ПроверитьЛокальныйКаталог(Локальный_Каталог_INBOX_Архив, РазделительПути);
	ПроверитьЛокальныйКаталог(Локальный_Каталог_OUTBOX, РазделительПути);
	ПроверитьЛокальныйКаталог(Локальный_Каталог_OUTBOX_Архив, РазделительПути);
	ПроверитьЛокальныйКаталог(Локальный_Каталог_UPDATE, РазделительПути);
	ПроверитьЛокальныйКаталог(Локальный_Каталог_Marking, РазделительПути);

	ЗаписатьКаталоги = Ложь;
	Если НЕ ЗначениеЗаполнено(РабочийКаталог) 
		ИЛИ РабочийКаталог = РазделительПути Тогда
		РабочийКаталог  = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ОпределитьКаталогПоУмолчанию(Диск, РазделительПути)");
		
		Локальный_Каталог_INBOX         = РабочийКаталог + "inbox"      + РазделительПути;
		Локальный_Каталог_INBOX_Архив  	= РабочийКаталог + "inbox_bak"  + РазделительПути;
		Локальный_Каталог_OUTBOX       	= РабочийКаталог + "outbox"     + РазделительПути;
		Локальный_Каталог_OUTBOX_Архив 	= РабочийКаталог + "outbox_bak" + РазделительПути;
		Локальный_Каталог_UPDATE       	= РабочийКаталог + "update"     + РазделительПути;
		Локальный_Каталог_Marking       = РабочийКаталог + "marking"    + РазделительПути;

		ЗаписатьКаталоги = Истина;
	КонецЕсли;
	
	
	СписокКаталогов = Новый Соответствие;
    СписокКаталогов.Вставить("ЭКОМ_Рабочий_Каталог",                РабочийКаталог);
    СписокКаталогов.Вставить("ЭКОМ_Локальный_Каталог_INBOX",        Локальный_Каталог_INBOX);
    СписокКаталогов.Вставить("ЭКОМ_Локальный_Каталог_INBOX_Архив",  Локальный_Каталог_INBOX_Архив);
    СписокКаталогов.Вставить("ЭКОМ_Локальный_Каталог_OUTBOX",       Локальный_Каталог_OUTBOX);
    СписокКаталогов.Вставить("ЭКОМ_Локальный_Каталог_OUTBOX_Архив", Локальный_Каталог_OUTBOX_Архив);
    СписокКаталогов.Вставить("ЭКОМ_Локальный_Каталог_UPDATE",       Локальный_Каталог_UPDATE);
    СписокКаталогов.Вставить("ЭКОМ_Локальный_Каталог_Marking",       Локальный_Каталог_Marking);

	Для Каждого Каталог Из СписокКаталогов Цикл		
		КаталогФайл = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ЭКОМ_СоздатьКаталогПроверитьНаЗапись(Каталог.Значение, МассивЛогаСобытий)");
		Если КаталогФайл = Неопределено Тогда		
			Продолжить;
			
		КонецЕсли;
		
		Если ЗаписатьКаталоги = Истина Тогда
			Настройка_Параметр_Записать(Каталог.Ключ, Каталог.Значение, Неопределено);	
		КонецЕсли;	
	КонецЦикла;
    
КонецПроцедуры

&НаКлиенте
Процедура СписокДляПокупателяВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент = Неопределено 
		Или Элемент.ТекущиеДанные = Неопределено 
		Или ВыбраннаяСтрока = Неопределено Тогда
        Возврат;
    КонецЕсли;
    СтандартнаяОбработка = Ложь;

	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	Если Поле.Имя = ДанныеСписка.ИмяСписка + "Пометка" Тогда
		
		Если Не Элемент.ТекущиеДанные = Неопределено Тогда
			ДокументыЦепочки = МассивИменДокументовЦепочкиПокупателя();
			Если Элемент.ТекущиеДанные.Пометка Тогда
				СнятьПометку(Элемент.ТекущиеДанные.ДокументыВсе);
				Для Каждого ИмяДокумента Из ДокументыЦепочки Цикл
					Если Элемент.ТекущиеДанные.Свойство(ИмяДокумента) Тогда 
						СнятьПометку(Элемент.ТекущиеДанные[ИмяДокумента]);
					КонецЕсли;
				КонецЦикла;
			Иначе
				ПоставитьПометку(Элемент.ТекущиеДанные.ДокументыВсе);
			КонецЕсли;
		КонецЕсли;
		
		//Параметр в динамическом списке нужно обновить
		УстановитьПараметрДинамическогоСписка(ДанныеСписка.ИмяРеквизитаТаблицы, "масПомеченныхДоков", СписокВыбранныхСтрок.ВыгрузитьЗначения());

	ИначеЕсли Поле.Имя = ДанныеСписка.ИмяСписка + "Статус" ИЛИ
		Поле.Имя = ДанныеСписка.ИмяСписка + "Статус_ORDER" ИЛИ
        Поле.Имя = ДанныеСписка.ИмяСписка + "Статус_ORDRSP" ИЛИ
        Поле.Имя = ДанныеСписка.ИмяСписка + "Статус_DESADV" ИЛИ
        Поле.Имя = ДанныеСписка.ИмяСписка + "Статус_RECADV" ИЛИ 
        Поле.Имя = ДанныеСписка.ИмяСписка + "Статус_DESSCC" ИЛИ 
        Поле.Имя = ДанныеСписка.ИмяСписка + "Статус_RETINS" ИЛИ
		Поле.Имя = ДанныеСписка.ИмяСписка + "Статус_RETANN" ИЛИ
		Поле.Имя = ДанныеСписка.ИмяСписка + "Статус_INVOICE" ИЛИ
		Поле.Имя = ДанныеСписка.ИмяСписка + "Статус_STATUS" ИЛИ
        Поле.Имя = ДанныеСписка.ИмяСписка + "Статус_УПД" Тогда
        
        ВыбраннаяСтрока  = Элемент.ТекущиеДанные;
        СписокДокументов = ПолучитьСписокДокументов(ВыбраннаяСтрока, "СписокДляПокупателя");
        
        Форма = ОткрытьФорму("РегистрСведений.ЭКОМ_Объекты_События.Форма.УФ_ФормаСписка");
        ОтборВладелец = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); //Добавлям отбор
        ОтборВладелец.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке; //Как будем сравнивать
        ОтборВладелец.Использование  = Истина; // Устанавливаем галку использованияНовый ПолеКомпоновкиДанных("Номенклатура")
        ОтборВладелец.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Документ_Основание"); //По какому реквизиту будем делать отбор
        ОтборВладелец.ПравоеЗначение = СписокДокументов; // И само значение отбора
        
        УсловиеСортировки = Форма.Список.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
        УсловиеСортировки.Поле = Новый ПолеКомпоновкиДанных("ДатаЗаписи");
        УсловиеСортировки.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
        УсловиеСортировки.Использование = Истина;
                
    ИначеЕсли Поле.Имя = "СписокДляПокупателяТекстОшибки" Тогда
        
        Подсказка = "Текст ошибки";
        Оповещение = Новый ОписаниеОповещения("ЗавершениеПросмотраТекстОшибки", ЭтаФорма);
        ПоказатьВводСтроки(Оповещение, Элемент.ТекущиеДанные.ТекстОшибки, Подсказка, 0, Истина);
		
	ИначеЕсли Поле.Имя = "СписокДляПокупателяТекстУточнения" Тогда
        
        Подсказка = "Текст уточнения";
        Оповещение = Новый ОписаниеОповещения("ЗавершениеПросмотраТекстОшибки", ЭтаФорма);
        ПоказатьВводСтроки(Оповещение, Элемент.ТекущиеДанные.ТекстУточнения, Подсказка, 0, Истина);
		
	ИначеЕсли Поле.Имя = "СписокДляПокупателяТекстОтклоненияАннулирования" Тогда
		
		Подсказка = "Текст отклонения аннулирования";
		Оповещение = Новый ОписаниеОповещения("ЗавершениеПросмотраТекстОшибки", ЭтаФорма);
		ПоказатьВводСтроки(Оповещение, Элемент.ТекущиеДанные.ТекстОтклоненияАннулирования, Подсказка, 0, Истина);
		
		
	ИначеЕсли Поле.Имя = "СписокДляПокупателяТекстПричиныАннулирования" Тогда
		
		Подсказка = "Текст причины аннулирования";
		Оповещение = Новый ОписаниеОповещения("ЗавершениеПросмотраТекстОшибки", ЭтаФорма);
		ПоказатьВводСтроки(Оповещение, Элемент.ТекущиеДанные.ТекстПричиныАннулирования, Подсказка, 0, Истина);
		
    КонецЕсли;
    
    ЭлементОбъект = ОпределитьТипОбъекта(Элемент, Поле.Имя);
    Если ЗначениеЗаполнено(ЭлементОбъект) Тогда
        ПоказатьЗначение( , ЭлементОбъект);
    КонецЕсли;              
    
КонецПроцедуры

&НаСервере
Процедура ОбменRETINSНаСервере()
    // Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОбменRETINS(Команда)
    ОбменRETINSНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, Данные) Экспорт
    
    Данные.МассивСтрок[Данные.ИндексМассива].СтрокаОбработана = Истина;
    
    Если Результат = "КнопкаНет" Тогда		
        Данные.МассивСтрок.Удалить(Данные.ИндексМассива);
    ИначеЕсли Результат = "КнопкаНетДляВсех" Тогда		
        Данные.МассивСтрок.Очистить();
    ИначеЕсли Результат = "КнопкаДаДляВсех" Тогда		
        Для Каждого ТекущаяСтрокаМассива Из Данные.МассивСтрок Цикл
            ТекущаяСтрокаМассива.СтрокаОбработана = Истина;
        КонецЦикла;	
    КонецЕсли;
    
    ПроверитьНаПовторноеСоздание(Данные.МассивСтрок, Данные.ИмяПроцедуры, Данные.МассивЛогаСобытий);
    
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаПовторноеСоздание(МассивСтрок, ИмяПроцедуры, МассивЛогаСобытий) 
	
	ИмяСобытия = "Проверка на повторное создание";
    Кнопки = Новый СписокЗначений;	
    Кнопки.Добавить("КнопкаДа"        , "Да");
    Кнопки.Добавить("КнопкаДаДляВсех" , "Да, для всех");
    Кнопки.Добавить("КнопкаНет"       , "Нет");
    Кнопки.Добавить("КнопкаНетДляВсех", "Нет, для всех");
    
    Данные = Новый Структура;
    Данные.Вставить("МассивСтрок", МассивСтрок);
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	
    ОтправитьДокумент = Истина; 
    Для каждого ЭлМассива Из МассивСтрок Цикл	
        
        Если ЭлМассива.СтрокаОбработана = Ложь Тогда
            ОтправитьДокумент = Ложь; 
            
            ПредставлениеДок = СокрЛП(ЭлМассива.Строка[ЭлМассива.ИмяДокументаПриемника]);
            
            Данные.Вставить("ИндексМассива"    , МассивСтрок.Найти(ЭлМассива));
            Данные.Вставить("ИмяПроцедуры"     , ИмяПроцедуры);
            Данные.Вставить("МассивЛогаСобытий", МассивЛогаСобытий);
            
            Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтаФорма, Данные); // Прописываем название процедуры-обработчика.		
            ПоказатьВопрос(Оповещение, "по " + ПредставлениеДок + " уже был создан документ. Создать повторно?", Кнопки, 0);
            Прервать;
        КонецЕсли;
        
    КонецЦикла;
    
    Если ОтправитьДокумент 
        И МассивСтрок.Количество() > 0 Тогда
        
        ТекстЛогаСобытий = "";
        
        ПараметрыПроцедуры = Новый Массив;
        ПараметрыПроцедуры.Добавить(МассивСтрок);
        ПараметрыПроцедуры.Добавить(ТекстЛогаСобытий);
        ВыполнитьПроцедуруИзМодуляОбъекта(ИмяПроцедуры, ПараметрыПроцедуры);
        
		ТекстЛогаСобытий = ПараметрыПроцедуры[1];	
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Информация"), ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
        
        ОбновитьДинамическийСписок(ДанныеСписка);      
        ОбновитьЦепочкуДокументовНаКлиенте(ДанныеСписка.ИмяСписка);
        ОтобразитьЛогСобытий(МассивЛогаСобытий);
        
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОтправка(Результат, Данные) Экспорт
	
	ИмяСобытия = "Повторная отправка";
    Данные.МассивСтрок[Данные.ИндексМассива].СтрокаОбработана = Истина;
    
    Если Результат = "КнопкаНет" Тогда		
        Данные.МассивСтрок.Удалить(Данные.ИндексМассива);
		ТекстЛогаСобытий = Данные.ПредставлениеДокумента + " - документ пропущен, так как был отправлен ранее!";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Предупреждение"), ИмяСобытия);
		Данные.МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

    ИначеЕсли Результат = "КнопкаНетДляВсех" Тогда		
        Данные.МассивСтрок.Очистить();
		ТекстЛогаСобытий = Данные.ТипДокумента + " - документы пропущены, так как были отправлены ранее!";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Предупреждение"), ИмяСобытия);
		Данные.МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		 
    ИначеЕсли Результат = "КнопкаДаДляВсех" Тогда		
        Для Каждого ТекущаяСтрокаМассива Из Данные.МассивСтрок Цикл
            ТекущаяСтрокаМассива.СтрокаОбработана = Истина;
        КонецЦикла;	
    КонецЕсли;
    
    ПроверитьНаПовторнуюОтправку(Данные.МассивСтрок, Данные.МассивЛогаСобытий, Данные.НужнаПодпись, Данные.ТипДокумента, Данные.ПозицияТекущейСтроки, Данные.ВыделенныеСтроки);
    
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаПовторнуюОтправку(МассивСтрок, МассивЛогаСобытий, НужнаПодпись, ТипДокумента, ПозицияТекущейСтроки, ВыгружаемыеДанные) 
       
    Кнопки = Новый СписокЗначений;	
    Кнопки.Добавить("КнопкаДа"        , "Да");
    Кнопки.Добавить("КнопкаДаДляВсех" , "Да, для всех");
    Кнопки.Добавить("КнопкаНет"       , "Нет");
    Кнопки.Добавить("КнопкаНетДляВсех", "Нет, для всех");
    
    Данные = Новый Структура;
    Данные.Вставить("МассивСтрок", МассивСтрок);
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	
    ОтправитьДокумент = Истина; 
    Для каждого ЭлМассива Из МассивСтрок Цикл	
        
        Если ЭлМассива.СтрокаОбработана = Ложь Тогда
            ОтправитьДокумент = Ложь; 
              		                        
            Данные.Вставить("ИндексМассива"         , МассивСтрок.Найти(ЭлМассива));
            Данные.Вставить("МассивЛогаСобытий"     , МассивЛогаСобытий);
            Данные.Вставить("НужнаПодпись"          , НужнаПодпись);
            Данные.Вставить("ТипДокумента"          , ТипДокумента);
            Данные.Вставить("ПозицияТекущейСтроки"  , ПозицияТекущейСтроки);
			Данные.Вставить("ВыделенныеСтроки"      , ВыгружаемыеДанные);		
			Данные.Вставить("ПредставлениеДокумента", ЭлМассива.ПредставлениеДокумента);
            
            Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОтправка", ЭтаФорма, Данные); // Прописываем название процедуры-обработчика.		
            ПоказатьВопрос(Оповещение, ЭлМассива.ПредставлениеДокумента + " уже был отправлен ранее." 
            + Символы.ПС + "Отправить повторно?", Кнопки, 0);
            Прервать;
        КонецЕсли;
        
    КонецЦикла;
    
    Если ОтправитьДокумент 
        И МассивСтрок.Количество() > 0 Тогда
		
		ЭтаФорма.Индикатор = 1;
		Элементы.ПолеИндикатор.Видимость = Истина;
		Элементы.КомандаЗакрытьИндикатор.Видимость = Истина;
		
		ЭтоНовыеДокументы = Ложь;
        ОтправитьФайлыНаКлиенте(МассивСтрок, ТипДокумента, ДанныеСписка, 100, ПозицияТекущейСтроки, ВыгружаемыеДанные, Истина, МассивЛогаСобытий, НужнаПодпись, ЭтоНовыеДокументы);
                
    КонецЕсли;
	
	Если МассивСтрок.Количество() = 0 Тогда
	     ОтобразитьЛогСобытий(МассивЛогаСобытий);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьЦепочку(Команда)
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
    ОбновитьЦепочкуДокументовНаКлиенте(ДанныеСписка.ИмяСписка);
    
КонецПроцедуры

&НаКлиенте
Функция ПоляДокументовТЧ(ИмяСписка) Экспорт
    Результат = Новый Массив;
      
    Если ИмяСписка = "СписокДляПоставщика" Тогда
        
		Результат.Добавить("ЭКОМ_Документ_RETORD");//Docrobot 1.21.0 MOD-1648
		Результат.Добавить("ЭКОМ_Документ_ORDER");
        Результат.Добавить("ДокументЗаказа");
        Результат.Добавить("ДокументРеализации");
        Результат.Добавить("ЭКОМ_Документ_RECADV");
        
        Результат.Добавить("ЭКОМ_Документ_RETANN");
        Результат.Добавить("ЭКОМ_Документ_RETINS");
		Результат.Добавить("ЭКОМ_Документ_INSDES");
        
        Результат.Добавить("ЭКОМ_Документ_DPOTORG1");
        Результат.Добавить("ЭКОМ_Документ_DPOTORG2");
        Результат.Добавить("ДокументСЧФ");
        Результат.Добавить("СчетФактураИсходная");
        Результат.Добавить("СчетФактураКорректировочная");
        Результат.Добавить("СчетФактураИсправительная");
        
        Результат.Добавить("КорректировкаРеализации");
        Результат.Добавить("ВозвратТоваровОтПокупателя");
        
    ИначеЕсли ИмяСписка = "СписокДляПокупателя" Тогда
        
        Результат.Добавить("ДокументЗаказа");
        Результат.Добавить("ЭКОМ_Документ_ORDRSP");
        Результат.Добавить("ЭКОМ_Документ_DESADV");
        
        Результат.Добавить("ЭКОМ_Документ_RETANN");
        Результат.Добавить("ЭКОМ_Документ_RETINS");
        
        Результат.Добавить("ДокументЭКОМ_ЮЗД");
        Результат.Добавить("ДокументПоступления");
        Результат.Добавить("ДокументСЧФ");
        Результат.Добавить("КорректировкаПоступления");
        Результат.Добавить("ВозвратТоваровПоставщику");
		Результат.Добавить("ПриходныйОрдерНаТовары");
		
	ИначеЕсли ИмяСписка = "СписокДляЭТРН" Тогда
        
        Результат.Добавить("Накладная");
        Результат.Добавить("ДокументЭКОМ");
		
	ИначеЕсли ИмяСписка = "СписокДляCondra" Тогда
		
		Результат.Добавить("ДокументОригинала");
		Результат.Добавить("ДокументПринятия");
		Результат.Добавить("ДокументОтзыва");
		Результат.Добавить("ДокументОтклонения");
		
    ИначеЕсли ИмяСписка = "СписокДляПрайсЛистаВходящий"
		ИЛИ ИмяСписка = "СписокДляПрайсЛистаИсходящий" Тогда		
		Результат.Добавить("PRICAT");
		Результат.Добавить("УстановкаЦенНоменклатуры");
		
    КонецЕсли;
    
    Возврат Результат;
КонецФункции 

&НаКлиенте
Функция ДокументыПоСтрокеВСтруктуруНаКлиенте(МассивСтрок, ПоляИсточникаДанных, ЭтоПовторнаяОтправка, ИспользоватьСтроку) Экспорт
		
	МассивСтрокДокументов = Новый Массив;
	Для каждого Эл Из МассивСтрок Цикл
		
		Если ИспользоватьСтроку = Истина Тогда
			СтрокаМассива = Эл.Строка; 
		Иначе
			СтрокаМассива = Эл;
		КонецЕсли;
		
		РезультатСтруктура = Новый Структура;
		Для каждого ИмяКолонки Из ПоляИсточникаДанных Цикл
			РезультатСтруктура.Вставить(ИмяКолонки, Неопределено);		
		КонецЦикла;
		ЗаполнитьЗначенияСвойств(РезультатСтруктура, СтрокаМассива);
		
		Если ИспользоватьСтроку = Истина Тогда
			СтруктураСтроки = Новый Структура;
			СтруктураСтроки.Вставить("Строка", РезультатСтруктура);
			СтруктураСтроки.Строка.Вставить("ОтправитьПовторно", ЭтоПовторнаяОтправка);
			МассивСтрокДокументов.Добавить(СтруктураСтроки);
		Иначе
			МассивСтрокДокументов.Добавить(РезультатСтруктура);
		КонецЕсли;
				
	КонецЦикла;	
	  
    Возврат МассивСтрокДокументов;
	
КонецФункции 

&НаКлиенте
Процедура ОбновитьЦепочкуДокументовНаКлиенте(ИмяСписка, КлючЗаписиЦепочкиДокументов = Неопределено)
	
	ТекущаяСтрокаЦепочки = Элементы.ТаблицаЦепочкаДокументов.ТекущиеДанные;
    ДокументЦепочки = Неопределено;
	Если НЕ ТекущаяСтрокаЦепочки = Неопределено Тогда
		ДокументЦепочки  = ТекущаяСтрокаЦепочки.Документ;
	КонецЕсли;
	//Docrobot 1.20.0 MOD-1575[Очистка цепочки перенесена выше, до возможного выхода из процедуры]
	ЭтаФорма.ТаблицаЦепочкаДокументов.Очистить();
	
	Если ИмяСписка = "СписокДляПоставщика" 
		ИЛИ ИмяСписка = "СписокДляПокупателя"
		ИЛИ ИмяСписка = "СписокДляCondra"
		ИЛИ ИмяСписка = "СписокДляПрайсЛистаВходящий"
		ИЛИ ИмяСписка = "СписокДляПрайсЛистаИсходящий" Тогда		
		
		Если Не КлючЗаписиЦепочкиДокументов = Неопределено И КлючЗаписиЦепочкиДокументов.УдалосьОпределить Тогда
			ТекущаяСтрокаСписка =  Элементы[ИмяСписка].ДанныеСтроки(КлючЗаписиЦепочкиДокументов.ИдентификаторВыделенныхСтрок);
			Элементы[ИмяСписка].ТекущаяСтрока = КлючЗаписиЦепочкиДокументов.ИдентификаторВыделенныхСтрок;
		ИначеЕсли Не КлючЗаписиЦепочкиДокументов = Неопределено И Не КлючЗаписиЦепочкиДокументов.УдалосьОпределить Тогда
			Возврат;
		Иначе
			ТекущаяСтрокаСписка = Элементы[ИмяСписка].ТекущиеДанные; 
		КонецЕсли;	
		
		Если ТекущаяСтрокаСписка = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		// По строке
		ПоляИсточникаДанных = ПоляДокументовТЧ(ИмяСписка);
		
		ВсеДокументыЦепочкиПоСтроке = Новый Структура;    	
		Для каждого ИмяКолонки Из ПоляИсточникаДанных Цикл
			ВсеДокументыЦепочкиПоСтроке.Вставить(ИмяКолонки, Неопределено);		
		КонецЦикла;
		ЗаполнитьЗначенияСвойств(ВсеДокументыЦепочкиПоСтроке, ТекущаяСтрокаСписка);
		
		// Видимость элементов
		Элементы.ТаблицаПалет.Видимость = Ложь;
		Элементы.ТаблицаЦепочкаДокументов.Видимость = Истина;
		Если ИмяСписка = "СписокДляCondra"
			ИЛИ ИмяСписка = "СписокДляПрайсЛистаВходящий"
			ИЛИ ИмяСписка = "СписокДляПрайсЛистаИсходящий" Тогда
			Элементы.ТаблицаКвитанций.Видимость = Ложь;
		Иначе	
			Элементы.ТаблицаКвитанций.Видимость = Истина;
		КонецЕсли;
	
		Если ВсеДокументыЦепочкиПоСтроке.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		//Docrobot 1.20.0 MOD-1575[Очистка цепочки перенесена выше, до возможного выхода из процедуры]
		ЭтаФорма.ТаблицаЦепочкаДокументов.Очистить();
		
		Н = 1;
		
		ВыведенныеДокументыЦепочки = Новый Массив;
		
		ТаблицаЦепочки = ЭтаФорма.ТаблицаЦепочкаДокументов;
		
		Для каждого ЭлементЦепочкиДокументов Из ВсеДокументыЦепочкиПоСтроке Цикл
			ТекущийДокумент = ЭлементЦепочкиДокументов.Значение;
			
			Если ЗначениеЗаполнено(ТекущийДокумент) Тогда
				
				Если ВыведенныеДокументыЦепочки.Найти(ТекущийДокумент) <> Неопределено Тогда
					Продолжить;
				Иначе
					ВыведенныеДокументыЦепочки.Добавить(ТекущийДокумент);
				КонецЕсли;
				
				// Убираем все счет-фактуры из цепочки
				Если ЭлементЦепочкиДокументов.Ключ = "СчетФактураИсходная" Тогда
					Продолжить;
				ИначеЕсли ЭлементЦепочкиДокументов.Ключ = "СчетФактураИсправительная" Тогда
					Продолжить;
				ИначеЕсли ЭлементЦепочкиДокументов.Ключ = "СчетФактураКорректировочная" Тогда
					Продолжить;
				КонецЕсли;
				
				ВидДокумента = "";
				Если ЭлементЦепочкиДокументов.Ключ = "ДокументСЧФ" Тогда
					ДокСчетФактураИсходная = Неопределено;
					ВсеДокументыЦепочкиПоСтроке.Свойство("СчетФактураИсходная", ДокСчетФактураИсходная);
					
					ДокСчетФактураИсправительная = Неопределено;
					ВсеДокументыЦепочкиПоСтроке.Свойство("СчетФактураИсправительная", ДокСчетФактураИсправительная);
					
					ДокСчетФактураКорректировочная = Неопределено;
					ВсеДокументыЦепочкиПоСтроке.Свойство("СчетФактураКорректировочная", ДокСчетФактураКорректировочная);
					
					Если ДокСчетФактураИсходная = ЭлементЦепочкиДокументов.Значение Тогда
						ВидДокумента = "Первичная";
						
					ИначеЕсли ДокСчетФактураИсправительная = ЭлементЦепочкиДокументов.Значение Тогда
						ВидДокумента = "Исправительная";
						
					ИначеЕсли ДокСчетФактураКорректировочная = ЭлементЦепочкиДокументов.Значение Тогда
						ВидДокумента = "Корректировочная";
						
					КонецЕсли;
				КонецЕсли;
			
				НСтр              = ТаблицаЦепочки.Добавить();
				НСтр.Документ     = ТекущийДокумент;
				НСтр.Статус       = ИндексПиктограммыДокумента(ТекущийДокумент);
				НСтр.НомерСтроки  = Н;
				
				// Подробное описание вида документа
				Если ТипЗнч(НСтр.Документ) = Тип("ДокументСсылка.ЭКОМ_Документы") Тогда					             
					ВидДокумента = ПредставлениеВидаЭКОМ_Документа(НСтр.Документ);
					
				КонецЕсли;
				
				НСтр.ВидДокумента = ВидДокумента;
				
				Н = Н + 1;
			КонецЕсли;
		КонецЦикла;
				
	ИначеЕсли ИмяСписка = "СписокДляЭТРН" Тогда	
		
		ЗначениеПоУмолчанию = Ложь;
		Измерение           = Неопределено; 
		Обязательно         = Ложь;
		ЭКОМ_ТипОбменаЭТРН_Отправитель = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_ТипОбменаЭТРН_Отправитель"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
		ЭКОМ_ТипОбменаЭТРН_Перевозчик = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_ТипОбменаЭТРН_Перевозчик"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
        ЭКОМ_ТипОбменаЭТРН_Получатель = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_ТипОбменаЭТРН_Получатель"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
			
		// Видимость элементов
		Элементы.ТаблицаКвитанций.Видимость = Истина;
        Элементы.ТаблицаЦепочкаДокументов.Видимость = Ложь;
		Если ЭКОМ_ТипОбменаЭТРН_Отправитель Тогда	
			Элементы.ТаблицаПалет.Видимость = Истина;	
		КонецЕсли;
		Если ЭКОМ_ТипОбменаЭТРН_Перевозчик Тогда	
			Элементы.ТаблицаПалет.Видимость = Ложь;	
		КонецЕсли;
		Если ЭКОМ_ТипОбменаЭТРН_Получатель Тогда	
			Элементы.ТаблицаПалет.Видимость = Ложь;	
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ДокументЦепочки = Неопределено Тогда
		 ИдентификаторСтроки  = 0;
		 ПараметрыОтбора = Новый Структура;
		 ПараметрыОтбора.Вставить("Документ", ДокументЦепочки);
	     МассивТекущаяСтрокаЦепочки = ЭтаФорма.ТаблицаЦепочкаДокументов.НайтиСтроки(ПараметрыОтбора);
		 Если МассивТекущаяСтрокаЦепочки.Количество() > 0 Тогда
			 НоваяТекущаяСтрокаЦепочки = МассивТекущаяСтрокаЦепочки[0];
			 ИдентификаторСтроки = НоваяТекущаяСтрокаЦепочки.ПолучитьИдентификатор();
		 КонецЕсли;
		  
	     Элементы.ТаблицаЦепочкаДокументов.ТекущаяСтрока = ИдентификаторСтроки;
	КонецЕсли;
  
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИндексПиктограммыДокумента(ДокументДляПиктограммы)
	
	Результат = 0;
	Если ТипЗнч(ДокументДляПиктограммы) = Тип("ДокументСсылка.ЭКОМ_Документы") Тогда
		Если ДокументДляПиктограммы.СтатусОбработкиДокумента = Перечисления.ЭКОМ_Статусы.Обработан Тогда
			Результат = 1;
		КонецЕсли;	
	Иначе
		Если ДокументДляПиктограммы.Проведен Тогда
			Результат = 1;
		КонецЕсли;	
	КонецЕсли;

	Если ДокументДляПиктограммы.ПометкаУдаления Тогда
		Результат = 2;
	КонецЕсли;	
	
    Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьКвитанцииНаКлиенте(ИмяСписка)
	
	ЭтаФорма.ТаблицаКвитанций.Очистить();

    ВыбраннаяСтрока = Новый Структура;
    
    Если ИмяСписка = "СписокДляПоставщика" Тогда		
        ТекущаяСтрока = Элементы.СписокДляПоставщика.ТекущиеДанные;
        Если ТекущаяСтрока = Неопределено Тогда      
            Возврат;
        КонецЕсли;
        
        Если ТекущаяСтрока.Свойство("ЭКОМ_Документ_ORDER") Тогда
            ВыбраннаяСтрока.Вставить("ЭКОМ_Документ_ORDER", ТекущаяСтрока.ЭКОМ_Документ_ORDER);
        КонецЕсли;
        
        
        Если ТекущаяСтрока.Свойство("ДокументРеализации") Тогда
            ВыбраннаяСтрока.Вставить("ДокументРеализации", ТекущаяСтрока.ДокументРеализации);
        КонецЕсли;
        
        Если ТекущаяСтрока.Свойство("ЭКОМ_Документ_RECADV") Тогда
            ВыбраннаяСтрока.Вставить("ЭКОМ_Документ_RECADV", ТекущаяСтрока.ЭКОМ_Документ_RECADV);
        КонецЕсли;
        
        Если ТекущаяСтрока.Свойство("ДокументСЧФ") Тогда
            ВыбраннаяСтрока.Вставить("ДокументСЧФ", ТекущаяСтрока.ДокументСЧФ);
        КонецЕсли;
        
        Если ТекущаяСтрока.Свойство("КорректировкаРеализации") Тогда
            ВыбраннаяСтрока.Вставить("КорректировкаРеализации", ТекущаяСтрока.КорректировкаРеализации);
        КонецЕсли;
        
        Если ТекущаяСтрока.Свойство("ВозвратТоваровОтПокупателя") Тогда
            ВыбраннаяСтрока.Вставить("ВозвратТоваровОтПокупателя", ТекущаяСтрока.ВозвратТоваровОтПокупателя);
        КонецЕсли;
    ИначеЕсли ИмяСписка = "СписокДляПокупателя" Тогда
        ТекущаяСтрока = Элементы.СписокДляПокупателя.ТекущиеДанные;
        Если ТекущаяСтрока = Неопределено Тогда
            Возврат;
        КонецЕсли;
        
        Если ТекущаяСтрока.Свойство("ДокументЗаказа") Тогда
            ВыбраннаяСтрока.Вставить("ДокументЗаказа"          , ТекущаяСтрока.ДокументЗаказа);
        КонецЕсли;
        
        Если ТекущаяСтрока.Свойство("ЭКОМ_Документ_ORDRSP") Тогда
            ВыбраннаяСтрока.Вставить("ЭКОМ_Документ_ORDRSP"    , ТекущаяСтрока.ЭКОМ_Документ_ORDRSP);
        КонецЕсли;
        
        Если ТекущаяСтрока.Свойство("ЭКОМ_Документ_DESADV") Тогда
            ВыбраннаяСтрока.Вставить("ЭКОМ_Документ_DESADV"    , ТекущаяСтрока.ЭКОМ_Документ_DESADV);
        КонецЕсли;
        
        Если ТекущаяСтрока.Свойство("ДокументЭКОМ_ЮЗД") Тогда
            ВыбраннаяСтрока.Вставить("ДокументЭКОМ_ЮЗД"        , ТекущаяСтрока.ДокументЭКОМ_ЮЗД);
        КонецЕсли;
        
        Если ТекущаяСтрока.Свойство("ДокументПоступления") Тогда
            ВыбраннаяСтрока.Вставить("ДокументПоступления"     , ТекущаяСтрока.ДокументПоступления);
        КонецЕсли;
        
        Если ТекущаяСтрока.Свойство("ДокументСЧФ") Тогда
            ВыбраннаяСтрока.Вставить("ДокументСЧФ"             , ТекущаяСтрока.ДокументСЧФ);
        КонецЕсли;
        
        Если ТекущаяСтрока.Свойство("КорректировкаПоступления") Тогда
            ВыбраннаяСтрока.Вставить("КорректировкаПоступления", ТекущаяСтрока.КорректировкаПоступления);
        КонецЕсли;
        
        Если ТекущаяСтрока.Свойство("ВозвратТоваровПоставщику") Тогда
            ВыбраннаяСтрока.Вставить("ВозвратТоваровПоставщику", ТекущаяСтрока.ВозвратТоваровПоставщику);
        КонецЕсли;
		
	ИначеЕсли ИмяСписка = "СписокДляЭТРН" Тогда	
		ТекущаяСтрока = Элементы.СписокДляЭТРН.ТекущиеДанные;
		Если ТекущаяСтрока = Неопределено Тогда		
			Возврат;
		КонецЕсли;
		
		Если ТекущаяСтрока.Свойство("Накладная") Тогда
			ВыбраннаяСтрока.Вставить("Накладная", ТекущаяСтрока.Накладная);
		КонецЕсли;
		
		Если ТекущаяСтрока.Свойство("ДокументЭКОМ") Тогда
			ВыбраннаяСтрока.Вставить("ДокументЭКОМ"          , ТекущаяСтрока.ДокументЭКОМ);
		КонецЕсли;

    КонецЕсли;
    
    Если ВыбраннаяСтрока.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;
	
	ПараметрыСтруктуры = "Тип, ИспользоватьДерево";
	ИспользуемDP_REZRUISP = Новый Соответствие;
	ИспользуемDP_REZRUISP.Вставить("Исходящий DP_REZRUISP (Акт выполненных работ)" , Новый Структура(ПараметрыСтруктуры, "DP_REZRUISP"   , Ложь));
	ПроверитьНаличиеВеткиДерева(ИспользуемDP_REZRUISP);
	
	ИспользуемDP_REZRUISP = ИспользуемDP_REZRUISP.Получить("Исходящий DP_REZRUISP (Акт выполненных работ)").ИспользоватьДерево = Истина;
	
    ДанныеДляТаблицыКвитанций = ПолучитьДанныеТаблицыКвитанцийНаСервере(ИмяСписка, ВыбраннаяСтрока, ИспользуемDP_REZRUISP);
    Для Каждого СтрокаДанных Из ДанныеДляТаблицыКвитанций Цикл
        НоваяСтрокаКвитанций = ТаблицаКвитанций.Добавить();
        ЗаполнитьЗначенияСвойств(НоваяСтрокаКвитанций, СтрокаДанных);
    КонецЦикла;
    
    ЭтаФорма.ТаблицаКвитанций.Сортировать("ДатаЗаписи, Порядок");
    
    Н = 1;
    Для каждого Стр  Из ЭтаФорма.ТаблицаКвитанций Цикл
        Стр.НомерСтроки = Н;
        Н = Н + 1;
    КонецЦикла;
    
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеТаблицыКвитанцийНаСервере(ИмяСписка, Знач ВыбраннаяСтрока, ИспользуемDP_REZRUISP)
	
	Результат = Новый Массив;  
    Если ВыбраннаяСтрока = Неопределено Тогда
        Возврат Результат;
    КонецЕсли;
	
	Алфавит = Новый Соответствие;
	Алфавит.Вставить(0, "А");
	Алфавит.Вставить(1, "Б");
	Алфавит.Вставить(2, "В");
	Алфавит.Вставить(3, "Г");
	Алфавит.Вставить(4, "Д");
	Алфавит.Вставить(5, "Е");
	Алфавит.Вставить(6, "Ё");
	Алфавит.Вставить(7, "Ж");
	Алфавит.Вставить(8, "З");
	Алфавит.Вставить(9, "И");
	Алфавит.Вставить(10, "Й");
	Алфавит.Вставить(11, "К");
	Алфавит.Вставить(12, "Л");
	Алфавит.Вставить(13, "М");
	Алфавит.Вставить(14, "Н");
	Алфавит.Вставить(15, "О");
	Алфавит.Вставить(16, "П");
	Алфавит.Вставить(17, "Р");
	Алфавит.Вставить(18, "С");
	Алфавит.Вставить(19, "Т");
	Алфавит.Вставить(20, "У");
	Алфавит.Вставить(21, "Ф");
	Алфавит.Вставить(22, "Х");
	Алфавит.Вставить(23, "Ц");
	Алфавит.Вставить(24, "Ч");
	Алфавит.Вставить(25, "Ш");
	Алфавит.Вставить(26, "Щ");
	Алфавит.Вставить(27, "Ъ");
	Алфавит.Вставить(28, "Ы");
	Алфавит.Вставить(29, "Ь");
	Алфавит.Вставить(30, "Э");
	Алфавит.Вставить(31, "Ю");
	Алфавит.Вставить(32, "Я");

	ПервичныеДокументыЮЗД = Новый Массив;
	Для Каждого Элемент Из Алфавит Цикл
		Если Элемент.Ключ < 14 Тогда
			ПервичныеДокументыЮЗД.Добавить(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	МассивВидовДокументовЮЗД = Новый Массив;

    СписокЗначенийДокументов = ПолучитьСписокДокументов(ВыбраннаяСтрока, ИмяСписка, Ложь);   
    СписокВидДокумента = Новый СписокЗначений;   
	Если ИмяСписка = "СписокДляПоставщика" 
		И НЕ ИспользуемDP_REZRUISP Тогда
		
		Выполнить("ЭКОМ_ОбщегоНазначения.ПолучитьПервичныеВидыДокументовЮЗД(МассивВидовДокументовЮЗД);");
		Выполнить("ЭКОМ_ОбщегоНазначения.ПолучитьИсправительныеВидыДокументовЮЗД(МассивВидовДокументовЮЗД);");
		Выполнить("ЭКОМ_ОбщегоНазначения.ПолучитьКорректировочныеВидыДокументовЮЗД(МассивВидовДокументовЮЗД);");
		
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_PDPOL_02);
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_PDOTPR_03);
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_IZVPOL_04);
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_IZVPOL_06);
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_PDOTPR_08);
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_UVUTOCH_09);		
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_IZVPOL_10);
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_PDOTPR_13);
			
		Выполнить("ЭКОМ_ОбщегоНазначения.ПолучитьПодписьВидовДокументовЮЗД(МассивВидовДокументовЮЗД);");
		
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_PRANNUL_22);
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_IZVPOL_23);
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_UVUTOCH_24);
		
	ИначеЕсли ИмяСписка = "СписокДляПоставщика"
		И ИспользуемDP_REZRUISP Тогда
		
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_REZRUISP_Исходящий);
        МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_REZRUZAK_Входящий); 

    ИначеЕсли ИмяСписка = "СписокДляПокупателя" Тогда
		
		Выполнить("ЭКОМ_ОбщегоНазначения.ПолучитьПервичныеВидыДокументовЮЗД(МассивВидовДокументовЮЗД);");
		Выполнить("ЭКОМ_ОбщегоНазначения.ПолучитьИсправительныеВидыДокументовЮЗД(МассивВидовДокументовЮЗД);");
		Выполнить("ЭКОМ_ОбщегоНазначения.ПолучитьКорректировочныеВидыДокументовЮЗД(МассивВидовДокументовЮЗД);");
		
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_PDOTPR_03);
		
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_IZVPOL_05); // Старый формат обмена

		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_IZVPOL_06);
		
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_PDOTPR_07); // Старый формат обмена
		
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_PDPOL_07);
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_PDOTPR_08);
		
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_IZVPOL_08); // Старый формат обмена
		
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_UVUTOCH_09);
		
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_IZVPOL_10); // Старый формат обмена
		
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_PDPOL_12);
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_PDOTPR_13);
		
		Выполнить("ЭКОМ_ОбщегоНазначения.ПолучитьПодписьВидовДокументовЮЗД(МассивВидовДокументовЮЗД);");
		
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_PRANNUL_22);
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_IZVPOL_23);
		МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DP_UVUTOCH_24);
		
	ИначеЕсли ИмяСписка = "СписокДляЭТРН" Тогда
			
		ЗначениеПоУмолчанию = Ложь;
		Измерение           = Неопределено; 
		Обязательно         = Ложь;
		ЭКОМ_ТипОбменаЭТРН_Отправитель = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_ТипОбменаЭТРН_Отправитель"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
		ЭКОМ_ТипОбменаЭТРН_Получатель  = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_ТипОбменаЭТРН_Получатель"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
		
		Если ЭКОМ_ТипОбменаЭТРН_Отправитель = Истина Тогда
			
			МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.WHGOV_01_Исходящий);
			МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DRVGOV_02_Входящий);
			МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DRVGOU_03_Входящий);
			МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.WHGOU_04_Исходящий);
			МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DRVGPV_06_Входящий);
			МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DRVGPU_07_Входящий);
			МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.WHGPU_08_Входящий);
			
		КонецЕсли;
		
		Если ЭКОМ_ТипОбменаЭТРН_Получатель = Истина Тогда
			
			МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DRVGOV_02_Входящий);
			МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DRVGOU_03_Входящий);
			МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.WHGOU_04_Входящий);
			МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.WHGPV_05_Исходящий);
			МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DRVGPV_06_Входящий);
			МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.DRVGPU_07_Входящий);
			МассивВидовДокументовЮЗД.Добавить(Перечисления.ЭКОМ_ВидыДокументов.WHGPU_08_Исходящий);
				
		КонецЕсли;

	Иначе
        Возврат Результат;
    КонецЕсли;	
	
	Индекс = 0;
	Для каждого Строка Из МассивВидовДокументовЮЗД Цикл
		СписокВидДокумента.Добавить(Строка, Алфавит.Получить(Индекс));
		Индекс = Индекс + 1;	
	КонецЦикла;

	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЭКОМ_Объекты_События.Документ_Основание КАК Документ,
	               |	ЭКОМ_Объекты_События.ВидДокумента КАК ВидДокумента,
	               |	ЭКОМ_Объекты_События.Идентификатор КАК Идентификатор,
	               |	ЭКОМ_Объекты_События.ИдентификаторИспр КАК Основание,
	               |	ЭКОМ_Объекты_События.ДатаЗаписи КАК ДатаЗаписи,
	               |	ЭКОМ_Объекты_События.НаправлениеОбмена КАК НаправлениеОбмена
	               |ИЗ
	               |	РегистрСведений.ЭКОМ_Объекты_События КАК ЭКОМ_Объекты_События
	               |ГДЕ
	               |	ЭКОМ_Объекты_События.Документ_Основание В(&Документ_Основание)
	               |	И ЭКОМ_Объекты_События.ВидДокумента В(&ВидДокумента)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаЗаписи";
	
    Запрос.Текст = ТекстЗапроса;
    Запрос.УстановитьПараметр("Документ_Основание", СписокЗначенийДокументов);
    Запрос.УстановитьПараметр("ВидДокумента"      , СписокВидДокумента);
    
    РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	
	РезультатТЗ = Выгрузка.СкопироватьКолонки("Документ, Идентификатор, Основание, ДатаЗаписи, НаправлениеОбмена"); //Docrobot 1.21.0 MOD-1277 [Добавлено НаправлениеОбмена]
	РезультатТЗ.Колонки.Добавить("ВидДокумента");
	РезультатТЗ.Колонки.Добавить("Порядок");
	РезультатТЗ.Колонки.Добавить("Статус");
	
	// Добавляем исходные документы.
	ГруппыКвитанций = Новый Массив;
	
	Для Каждого Строка Из Выгрузка Цикл
		ЭлементВидДокумента = СписокВидДокумента.НайтиПоЗначению(Строка.ВидДокумента);
		Если НЕ ЭлементВидДокумента = Неопределено
			И НЕ ПервичныеДокументыЮЗД.Найти(ЭлементВидДокумента.Представление) = Неопределено Тогда
			
			НоваяГруппа		= РезультатТЗ.СкопироватьКолонки();
			НоваяГруппа.Колонки.Добавить("НомерСтроки");
			НСтр			= НоваяГруппа.Добавить();
			ЗаполнитьЗначенияСвойств(НСтр, Строка);
			НСтр.Порядок	= СписокВидДокумента.НайтиПоЗначению(Строка.ВидДокумента);
            НСтр.Статус		= ИндексПиктограммыДокумента(Строка.Документ);
			ГруппыКвитанций.Добавить(НоваяГруппа);
		КонецЕсли;
	КонецЦикла;
	
	ДобавитьВКонце = Новый Массив; // коллекция строк, основания которых не совпадают с идентификатором исходной УПД (актуально для квитанций в формате до 01.07.2021)
	
	// Добавляем квитанции под исходными документами.
	СтрокаРодителя 	= Неопределено;
	Для Каждого Строка Из Выгрузка Цикл 
		ЭлементВидДокумента = СписокВидДокумента.НайтиПоЗначению(Строка.ВидДокумента);
		Если НЕ ЭлементВидДокумента = Неопределено
			И ПервичныеДокументыЮЗД.Найти(ЭлементВидДокумента.Представление) = Неопределено Тогда
			
			ГруппаКвитанций = Неопределено;
			Для Каждого ГруппаКвитанций Из ГруппыКвитанций Цикл
				Если НЕ ГруппаКвитанций.Найти(Строка.Основание, "Идентификатор") = Неопределено Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ГруппаКвитанций = Неопределено Тогда
				ДобавитьВКонце.Добавить(Строка);
				Продолжить;
			КонецЕсли;
			
			НовыйРодитель 	= НЕ СтрокаРодителя = ГруппаКвитанций.Найти(Строка.Основание, "Идентификатор");
			
			СтрокаРодителя 	= ГруппаКвитанций.Найти(Строка.Основание, "Идентификатор");
			Если СтрокаРодителя = Неопределено Тогда
				ДобавитьВКонце.Добавить(Строка);
				Продолжить;
			КонецЕсли;
			
			Если НовыйРодитель Тогда
				Индекс 		= ГруппаКвитанций.Индекс(СтрокаРодителя) + 1;
			Иначе
				Индекс = Индекс + 1;
			КонецЕсли;
			
			НСтр			= ГруппаКвитанций.Вставить(Индекс);
			ЗаполнитьЗначенияСвойств(НСтр, Строка);
			НСтр.Порядок	= СписокВидДокумента.НайтиПоЗначению(Строка.ВидДокумента);
			НСтр.Статус		= ИндексПиктограммыДокумента(Строка.Документ);
			
		КонецЕсли;
	КонецЦикла;
	
	// Добавляем строки, основания которых не совпадают с идентификатором исходной УПД (актуально для квитанций в формате до 01.07.2021)
	Для Каждого Строка Из ДобавитьВКонце Цикл
		
		ГруппаКвитанций = Неопределено;
		Для Каждого ГруппаКвитанций Из ГруппыКвитанций Цикл
			Если НЕ ГруппаКвитанций.Найти(Строка.Основание, "Идентификатор") = Неопределено Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ГруппаКвитанций = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРодителя = ГруппаКвитанций.Найти(Строка.Основание, "Идентификатор");
		Если СтрокаРодителя = Неопределено Тогда
			НСтр            = ГруппаКвитанций.Добавить();
		Иначе
			Индекс 			= ГруппаКвитанций.Индекс(СтрокаРодителя) + 1;
			НСтр            = ГруппаКвитанций.Вставить(Индекс);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НСтр, Строка);
		НСтр.Порядок     = СписокВидДокумента.НайтиПоЗначению(Строка.ВидДокумента);
        НСтр.Статус      = ИндексПиктограммыДокумента(Строка.Документ);
	КонецЦикла;
	
	
	// Сортировка квитанций, их нумеранция и вывод на форму.
	Н = 1;
	Для Каждого ГруппаКвитанций Из ГруппыКвитанций Цикл
		
		ГруппаКвитанций.Сортировать("ДатаЗаписи, Порядок");
		Для Каждого ЗаписьКвитанции Из ГруппаКвитанций Цикл
			ЗаписьКвитанции.НомерСтроки = Н;
			Н = Н + 1;
			
			ДанныеСтроки = Новый Структура("Документ, ВидДокумента, Идентификатор, Основание, ДатаЗаписи, Порядок, Статус, НомерСтроки, НаправлениеОбмена"); //Docrobot 1.21.0 MOD-1277 [Добавлено НаправлениеОбмена]

			ЗаполнитьЗначенияСвойств(ДанныеСтроки, ЗаписьКвитанции, , "Порядок");
			ДанныеСтроки.Порядок = ЗаписьКвитанции.Порядок.Представление;
			Результат.Добавить(ДанныеСтроки);
			
		КонецЦикла;
		
	КонецЦикла;
	
    Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьЦепочкуДокументовИКвитанцииНаКлиенте(ИмяСписка)
	ОбновитьЦепочкуДокументовНаКлиенте(ИмяСписка);
    ОбновитьКвитанцииНаКлиенте(ИмяСписка);	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, Параметр)

    Если ИмяСобытия = "НастройкиОбновить" Тогда
        ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
        
        // Покупатель
		ЗначениеПоУмолчанию = Ложь;
		Измерение           = Неопределено; 
		Обязательно         = Ложь;	
		ЭКОМ_ОбменСеть = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_ОбменСеть"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
        Элементы.Группа_Покупатель.Видимость = ЭКОМ_ОбменСеть;				
        
        // Поставщик
		ЗначениеПоУмолчанию = Ложь;
		Измерение           = Неопределено; 
		Обязательно         = Ложь;	
		ЭКОМ_ОбменПоставщик = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_ОбменПоставщик"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
        Элементы.Группа_Поставщик.Видимость = ЭКОМ_ОбменПоставщик;		
		
		// ЭТРН
		ЗначениеПоУмолчанию = Ложь;
		Измерение           = Неопределено; 
		Обязательно         = Ложь;	
		ЭКОМ_ОбменЭТРН = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_ОбменЭТРН"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
		Элементы.Группа_ЭТРН.Видимость = ЭКОМ_ОбменЭТРН;		
        
		// Condra
		ЗначениеПоУмолчанию = Ложь;
		Измерение           = Неопределено; 
		Обязательно         = Ложь;	
		ЭКОМ_ОбменCondra = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_ОбменCondra"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
		Элементы.Группа_ЭТРН.Видимость = ЭКОМ_ОбменCondra;		
		
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Функция ПолучитьДоступностьApiПоСтранеНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ДоступностьAPI = ОбработкаОбъект.ПолучитьДоступностьApiПоСтране();
	Возврат ДоступностьAPI;
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник) Экспорт
	
	МассивЛогаСобытий = Новый Массив;
	
	Если ИмяСобытия = "ОбновленПрофильОбмена" Тогда 
		ДоступностьAPI = ПолучитьДоступностьApiПоСтранеНаСервере(); 
		Попытка
			Элементы.КомандаДанныеКонтрагентаПоAPI.Видимость = ДоступностьAPI;	
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ФормаДляОповещения = Неопределено;
	Если ТипЗнч(Параметр) = Тип("Структура") Тогда
		Параметр.Свойство("ФормаДляОповещения", ФормаДляОповещения);
	КонецЕсли;
	
	Если ФормаДляОповещения = "Обработка.УФ_Форма" Тогда		
		Попытка
			Если ИмяСобытия = "НастройкиОбновить"
				И НЕ Параметр.ЗавершениеРаботы Тогда
				
				ОбработкаОповещенияНаСервере(ИмяСобытия, Параметр);
				Если ИмяСобытия = "НастройкиОбновить" Тогда	
					СоздатьДинамическийСписокДобавитьДинамическиеКнопки(Параметр.МассивЛогаСобытий);
				КонецЕсли;
				
				СостояниеСохранение("Настройки основной формы обновлены.", "Обновление настроек после записи", 100); 
			ИначеЕсли ИмяСобытия = "ЭКОМ_ПроверитьФормулуНаФорме" Тогда
				
				МассивЛогаСобытий = Параметр.МассивЛогаСобытий;
				Результат = ПроверитьФормулуНаФорме(Параметр.Текст, Параметр.ИмяЭлементаФормы, МассивЛогаСобытий);
				
				Параметр.Вставить("Результат", Результат);
				Параметр.Вставить("ФормаДляОповещения", "Обработка.УФ_ФормаКонсольЗапросов");
				Оповестить("ЭКОМ_КонецПроверкиФормулыНаФорме", Параметр);
				
				Элементы.Группа_Поставщик.Видимость = Параметр.ЭКОМ_ОбменПоставщик;
				Элементы.Группа_Покупатель.Видимость = Параметр.ЭКОМ_ОбменСеть; 
				Элементы.Группа_ЭТРН.Видимость            = Параметр.ЭКОМ_ОбменЭТРН;
				Элементы.Группа_Condra.Видимость          = Параметр.ЭКОМ_ОбменCondra;
				
				ДанныеСпискаКлюч = "Используется, ТекущаяСтраницаИмя";

				АктивныеОбмены = Новый Соответствие;
				АктивныеОбмены.Вставить("СписокДляПоставщика", Новый Структура(ДанныеСпискаКлюч, Элементы.Группа_Поставщик.Видимость , "Группа_Поставщик"));
				АктивныеОбмены.Вставить("СписокДляПокупателя", Новый Структура(ДанныеСпискаКлюч, Элементы.Группа_Покупатель.Видимость, "Группа_Покупатель"));
				АктивныеОбмены.Вставить("СписокДляЭТРН"      , Новый Структура(ДанныеСпискаКлюч, Элементы.Группа_ЭТРН.Видимость      , "Группа_ЭТРН")); 
				АктивныеОбмены.Вставить("СписокДляCondra"    , Новый Структура(ДанныеСпискаКлюч, Элементы.Группа_Condra.Видимость    , "Группа_Condra"));	
				АктивныеОбмены.Вставить("СписокДляПрайсЛиста", Новый Структура(ДанныеСпискаКлюч, Элементы.ГруппаПрайсЛист.Видимость  , "ГруппаПрайсЛист"));
				
				Для каждого Стр Из АктивныеОбмены Цикл
					
					Если Стр.Значение.Используется = Истина Тогда
						
						ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте(Стр.Значение.ТекущаяСтраницаИмя);
												
						СоздатьСоставПользовательскихНастроекНаСервере(ДанныеСписка);
						СоздатьДеревоПользовательскихНастроекНаСервере(ДанныеСписка, Новый Массив); 
												
					КонецЕсли;						
					
				КонецЦикла;
				
				УстановитьПериоды(АктивныеОбмены);	
											
			ИначеЕсли ИмяСобытия = "ОбновитьКолонкиДинамическогоСписка" Тогда
				СоздатьДинамическийСписокДобавитьДинамическиеКнопки(Параметр.МассивЛогаСобытий);	
			ИначеЕсли ИмяСобытия = "ОбновитьСписокЭТРН" Тогда
				
				ОбновитьАктивныйСписок();
				
			КонецЕсли;
			
		Исключение
			ТекстЛогаСобытий = ОписаниеОшибки();
			Если ИмяСобытия = "ЭКОМ_ПроверитьФормулуНаФорме" Тогда
				МассивЛогаСобытий = Параметр.МассивЛогаСобытий;
			КонецЕсли;
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

		КонецПопытки;
		
	ИначеЕсли ФормаДляОповещения = "Документы.ЭКОМ_Документы" Тогда
		Если ИмяСобытия = "ОбновитьТабличнуюЧасть" Тогда
			Если ЗначениеЗаполнено(Параметр.СобытиеПоДокументу) Тогда
				Если ЗначениеЗаполнено(Параметр.СобытиеПоДокументу) Тогда
					ТекстЛогаСобытий = Параметр.СобытиеПоДокументу;
					ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Информация"), "Обновление табличной части");
					МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
					
					ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
					ОбновитьЦепочкуДокументовИКвитанцииНаКлиенте(ДанныеСписка.ИмяСписка);
					ОбновитьДинамическийСписок(ДанныеСписка);
				КонецЕсли;
			КонецЕсли;							
		КонецЕсли;	
	КонецЕсли;
	
	Если МассивЛогаСобытий.Количество() > 0  Тогда
		ОтобразитьЛогСобытий(МассивЛогаСобытий);
	Иначе 
		Если ИмяСобытия = "ЭКОМ_ПроверитьФормулуНаФорме" Тогда
			Если ЗначениеЗаполнено(Параметр.Текст) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Проверка кода прошла успешно - ошибок нет.";
				Сообщение.Сообщить();
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Пустой текст, проверять нечего";
				Сообщение.Сообщить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
    
    Если ЗавершениеРаботы = Истина Тогда
        ТекстПредупреждения = "Docrobot: для корректного сохранения настроек сначала необходимо закрыть обработку!";
        Отказ = Истина;
		Возврат;
    КонецЕсли;
	
	ИзменитьПриОткрытии = Элементы.ГруппаПодвал.Скрыта();   	
	Если ЭтаФорма.ЭКОМОбъектыАктуальны = Истина Тогда
		МассивЛогаСобытий = Новый Массив;
		НастройкаЗаписана = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкаПараметрЗаписать(""СлужебныйПанельЦепочкиСвернута"", ИзменитьПриОткрытии, ""Служебный"", МассивЛогаСобытий)");
		Если НастройкаЗаписана = Ложь Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Вычислить("ЭКОМ_ОбщегоНазначения.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий)");
			Сообщение.Сообщить();
		КонецЕсли;		
	КонецЕсли;
	
	// Сохранение пользовательских отборов.
	ДанныеСпискаКлюч = "Используется, ТекущаяСтраницаИмя";
	
	АктивныеОбмены = Новый Соответствие;
	АктивныеОбмены.Вставить("СписокДляПоставщика", Новый Структура(ДанныеСпискаКлюч, Элементы.Группа_Поставщик.Видимость , "Группа_Поставщик"));
	АктивныеОбмены.Вставить("СписокДляПокупателя", Новый Структура(ДанныеСпискаКлюч, Элементы.Группа_Покупатель.Видимость, "Группа_Покупатель"));
	АктивныеОбмены.Вставить("СписокДляЭТРН"      , Новый Структура(ДанныеСпискаКлюч, Элементы.Группа_ЭТРН.Видимость      , "Группа_ЭТРН")); 
	АктивныеОбмены.Вставить("СписокДляCondra"    , Новый Структура(ДанныеСпискаКлюч, Элементы.Группа_Condra.Видимость    , "Группа_Condra"));	
	АктивныеОбмены.Вставить("СписокДляПрайсЛиста", Новый Структура(ДанныеСпискаКлюч, Элементы.ГруппаПрайсЛист.Видимость  , "ГруппаПрайсЛист"));
	
	Настройки = Новый Структура;
	
	Для каждого Стр Из АктивныеОбмены Цикл
		
		Используется        = Стр.Значение.Используется;
		ИмяРеквизитаТаблицы = Стр.Ключ;
		ТекущаяСтраницаИмя  = Стр.Значение.ТекущаяСтраницаИмя;
		Если Используется = Истина Тогда
			
			ИдентификаторПользовательскойНастройки = ЭтаФорма[ИмяРеквизитаТаблицы].КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки;
			Если НЕ ЗначениеЗаполнено(ИдентификаторПользовательскойНастройки) Тогда
				ИдентификаторПользовательскойНастройки = СокрЛП(Новый УникальныйИдентификатор);
				ЭтаФорма[ИмяРеквизитаТаблицы].КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскойНастройки;
			КонецЕсли;
	 
			ПользовательскийОтбор = ЭтаФорма[ИмяРеквизитаТаблицы].КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторПользовательскойНастройки);
			Если НЕ ПользовательскийОтбор = Неопределено Тогда
				
				Для каждого Отбор ИЗ ПользовательскийОтбор.Элементы Цикл
					
					// Для периода 
					Если Найти(Отбор.Представление, "Программный отбор") > 0 Тогда			
						
						Если ТипЗнч(Отбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда		
							
							// Поиск именно для периода
							Если Отбор.ПредставлениеПользовательскойНастройки = "ДатаЗаказа"
								ИЛИ (ИмяРеквизитаТаблицы = "СписокДляЭТРН" И Отбор.ПредставлениеПользовательскойНастройки = "ДатаЭТРН")
								ИЛИ (ИмяРеквизитаТаблицы = "СписокДляCondra" И Отбор.ПредставлениеПользовательскойНастройки = "Дата")
								ИЛИ (ИмяРеквизитаТаблицы = "СписокДляПрайсЛиста" И Отбор.ПредставлениеПользовательскойНастройки = "Дата") Тогда
								
								Для каждого Эл Из Отбор.Элементы Цикл
									Если Эл.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
										Настройки.Вставить(ИмяРеквизитаТаблицы + "ДатаНачалаОтбора", Эл.ПравоеЗначение);
									//ИначеЕсли Эл.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
									//	Настройки.Вставить(ИмяРеквизитаТаблицы + "ДатаОкончанияОтбора", Эл.ПравоеЗначение);
									КонецЕсли;
								КонецЦикла;
								
								Настройки.Вставить(ИмяРеквизитаТаблицы + "Использование", Отбор.Использование);
								
								Прервать;
								
							КонецЕсли;		
							
						КонецЕсли;
						
					КонецЕсли;	
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СохранитьПользовательскиеНастройки(ТекущийПользователь, Настройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаличиеФайловНаКлиенте(ТипДокумента, ОбщийПроцентПрогресса, ДанныеСписка, МассивлогаСобытий, НачалоВыполнения = Неопределено) Экспорт
	
	Если НачалоВыполнения 	= Неопределено Тогда
		НачалоВыполнения 	= ТекущаяДата();
	КонецЕсли;
	
	ИмяСобытия	= "Получение документов " + ТипДокумента;
	
	ЗначениеПоУмолчанию = Неопределено;
	Измерение           = Неопределено; 
	Обязательно         = Истина;
	ЛокальныйКаталогINBOX = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_Локальный_Каталог_INBOX"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
	ЛокальныйКаталогINBOX_Архив = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_Локальный_Каталог_INBOX_Архив"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
	
	ДанныеОС = ЭКОМ_ПолучитьРазделительПутиОСКлиента();
	РазделительПути = ДанныеОС.Получить("РазделительПути");
	ТекущаяДата = ТекущаяДата();//Docrobot 1.22.0 MOD-2269
	
	КаталогиДоступны = Истина;	
	Если Не ЗначениеЗаполнено(ЛокальныйКаталогINBOX) ИЛИ Не ЗначениеЗаполнено(ЛокальныйКаталогINBOX_Архив) Тогда
		КаталогиДоступны = Ложь;
	Иначе	
		ПроверитьЛокальныйКаталог(ЛокальныйКаталогINBOX		 , ДанныеОС.Получить("РазделительПути"));
		ПроверитьЛокальныйКаталог(ЛокальныйКаталогINBOX_Архив, ДанныеОС.Получить("РазделительПути"));
		
		ЛокальныйКаталогINBOXФайл = ЭКОМ_СоздатьКаталогПроверитьНаЗаписьКлиент(ЛокальныйКаталогINBOX, МассивЛогаСобытий);
		ЛокальныйКаталогINBOX_АрхивФайл = ЭКОМ_СоздатьКаталогПроверитьНаЗаписьКлиент(ЛокальныйКаталогINBOX, МассивЛогаСобытий);
		Если ЛокальныйКаталогINBOXФайл = Неопределено ИЛИ ЛокальныйКаталогINBOX_АрхивФайл = Неопределено Тогда
			КаталогиДоступны = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Не КаталогиДоступны Тогда
		ТекстЛогаСобытий = "Проверьте каталоги входящих (inbox) и архива входящих (inbox_bak) файлов";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		ОтобразитьЛогСобытий(МассивЛогаСобытий);
		
		Возврат;
	КонецЕсли;

	Если ТипДокумента = "DRVGOV_02_Входящий" 
		ИЛИ ТипДокумента = "DRVGOU_03_Входящий"
		ИЛИ ТипДокумента = "WHGOU_04_Входящий"
		ИЛИ ТипДокумента = "DRVGPV_06_Входящий"
		ИЛИ ТипДокумента = "DRVGPU_07_Входящий"
		ИЛИ ТипДокумента = "WHGPU_08_Входящий" Тогда
		
		НачалоИмениФайла = "TRNX5";
		
	ИначеЕсли ТипДокумента = "DP_Статусы" Тогда
		
		НачалоИмениФайла = "DP_TRNX5";
		
	ИначеЕсли ТипДокумента = "RETINS" Тогда
		
		НачалоИмениФайла = "RETINS";
		
	ИначеЕсли ТипДокумента = "DP_IZVPOL_06"
		      ИЛИ ТипДокумента = "DP_IZVPOL_10" 
			  ИЛИ ТипДокумента = "DP_IZVPOL_23" Тогда	
			  
	    НачалоИмениФайла  = "DP_IZVPOL";
		
	ИначеЕсли Найти(ТипДокумента, "DP_PRANNUL_22") > 0 Тогда //Docrobot 1.19.0 MOD-1377 [Добавлена проверка на вид документа PRANNUL]
		
		НачалоИмениФайла = "DP_PRANNUL";
		
	ИначеЕсли ТипДокумента = "DP_UVUTOCH_09" Тогда //Docrobot 1.19.0 MOD-1377 [Добавлена проверка на вид документа UVUTOCH]
		
		НачалоИмениФайла = "DP_UVUTOCH";
		
	ИначеЕсли Найти(ТипДокумента,"DOPPOK") > 0 Тогда //Docrobot 1.19.0 MOD-1377 [Добавлена проверка для подписи, без номера квитанции]
		НачалоИмениФайла = Лев(ТипДокумента,СтрДлина(ТипДокумента)-3);

	Иначе
		
		НачалоИмениФайла = ТипДокумента;
	
	КонецЕсли;

    // Ищем файлы в локальном каталоге
    ФайлыЛокальные  = Новый Соответствие; // Чтобы не было дублей
    
	ФайлыЛокальныеНижнийРегистр = НайтиФайлы(ЛокальныйКаталогINBOX, "*" + НРЕГ(НачалоИмениФайла) + "_" + "*.xml", Ложь);
	ФайлыXML = НайтиФайлы(ЛокальныйКаталогINBOX, "*" + НачалоИмениФайла + "_" + "*.xml", Ложь);
	ФайлыZIP = НайтиФайлы(ЛокальныйКаталогINBOX, "*" + НачалоИмениФайла + "_" + "*.zip", Ложь);

    Для Каждого лЭлемент Из ФайлыЛокальныеНижнийРегистр Цикл
        ФайлыЛокальные.Вставить(лЭлемент.Имя, лЭлемент);
    КонецЦикла;
    
    Для Каждого лЭлемент Из ФайлыXML Цикл
        ФайлыЛокальные.Вставить(лЭлемент.Имя, лЭлемент);
    КонецЦикла;
    
    Для Каждого лЭлемент Из ФайлыZIP Цикл
        ФайлыЛокальные.Вставить(лЭлемент.Имя, лЭлемент);
    КонецЦикла;
    
    // Передаем файлы с клиента на сервер
    МассивФайловСКлиента 	= Новый Массив;
	ЗаменятьИмяXML			= ТипДокумента = "CONDRA";
	
	ПодписьНеобходима = Вычислить("ЭКОМ_ОбщегоНазначения.ПроверитьНеобходимостьПодписи(ТипДокумента)");
	
    Для каждого ЭлементФайл Из ФайлыЛокальные Цикл
        
        ЭлФайл = ЭлементФайл.Значение;
        
        СтруктураФайла = Новый Структура;
        
        // Распакуем файлы 
        Если ЭлФайл.Расширение = ".zip" 
            ИЛИ ЭлФайл.Расширение = "zip" Тогда
            ЧтениеZIP = Новый ЧтениеZipФайла(ЭлФайл.ПолноеИмя);
            
			// При необходимости сохранить уникальность имени XML получаем его имя из bin или pdf (актуально для CONDRA).
			Если ЗаменятьИмяXML Тогда
				
				//Docrobot 1.22.0 MOD-2269[распакуем сразу в необходимый каталог, обработка ошибок происходит позже]
				КаталогПуть = ЛокальныйКаталогINBOX_Архив + ТипДокумента + РазделительПути + Формат(ТекущаяДата, "ДФ=yyyyMMdd") + РазделительПути + ЭлФайл.ИмяБезРасширения + РазделительПути;			
				СтруктураФайла.Вставить("КаталогПуть", КаталогПуть);
			    СоздатьКаталог(КаталогПуть);
				ЧтениеZIP.ИзвлечьВсе(КаталогПуть, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
							
			Иначе
				
				// Распакуем файлы в отдельный каталог.
				КаталогПуть = ЛокальныйКаталогINBOX + ЭлФайл.ИмяБезРасширения;
				СоздатьКаталог(КаталогПуть);
				ЧтениеZIP.ИзвлечьВсе(КаталогПуть, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
				
			КонецЕсли;
			
			// Перемещение файлов с соблюдением уникальности имени (если необходимо).
			Для Каждого Файл Из НайтиФайлы(КаталогПуть, "*.*", Истина) Цикл
				// Пропускаем каталоги.
				Если Файл.ЭтоКаталог() Тогда
					Продолжить;
				КонецЕсли;
				
				// Перемещаем файл из временного каталога в папку входящих документов, при необходимости изменив его имя.
				Если Не ЗаменятьИмяXML Тогда  //Docrobot 1.22.0 MOD-2269
					ИмяФайлаПриемника = ЛокальныйКаталогINBOX + Файл.Имя;
					ПереместитьФайл(Файл.ПолноеИмя, ИмяФайлаПриемника);
				Иначе 
					ИмяФайлаПриемника = Файл.ПолноеИмя;
				КонецЕсли;
				
				Элемент = Новый Файл(ИмяФайлаПриемника);
				// Обрабатываем файл в зависимости от его расширения.
				СтруктураФайла.Вставить("ИмяБезРасширения",  Элемент.ИмяБезРасширения);
				
				ПоддерживаемыеРасширенияCONDRA = ?(ТипДокумента = "CONDRA", ПоддерживаемыеРасширенияCONDRAНаСервере(), Новый Массив);
				ПоддерживаемыеРасширенияCONDRA.Добавить("bin");
				ПоддерживаемыеРасширенияCONDRA.Добавить("xml");
				
				Для Каждого Расширение Из ПоддерживаемыеРасширенияCONDRA Цикл
					Если Найти(Элемент.Расширение, Расширение) > 0 Тогда
						АдресФайла = Base64Строка(Новый ДвоичныеДанные(Элемент.ПолноеИмя));
						СтруктураФайла.Вставить("ИмяФайла" + Расширение,  	Элемент.Имя);
						СтруктураФайла.Вставить("АдресФайла" + Расширение,  АдресФайла);
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;
            
            ЧтениеZIP.Закрыть();
            // Удаление архива.
            УдалитьФайлы(ЭлФайл.ПолноеИмя);
			// Удаление временной папки.
			Если Не ЗаменятьИмяXML Тогда //Docrobot 1.22.0 MOD-2269 [удалять не нужно, это конечный каталог]
				УдалитьФайлы(КаталогПуть);
			КонецЕсли;
			
        Иначе
			
			//Docrobot 1.22.0 MOD-2269
			Если ЗаменятьИмяXML И ЭлФайл.Расширение = ".xml" 
				ИЛИ ЭлФайл.Расширение = "xml" Тогда
				КаталогПутьCONDRA = ЛокальныйКаталогINBOX_Архив + ТипДокумента + РазделительПути + Формат(ТекущаяДата, "ДФ=yyyyMMdd") + РазделительПути + ЭлФайл.ИмяБезРасширения + РазделительПути;			
				СтруктураФайла.Вставить("КаталогПуть", КаталогПутьCONDRA);
			КонецЕсли;
			
			Если ПодписьНеобходима = Истина Тогда
								
				ФайлыBIN = НайтиФайлы(ЛокальныйКаталогINBOX, "*" + ЭлФайл.ИмяБезРасширения + ".bin", Ложь);
				Если ФайлыBIN.Количество() > 0 Тогда
					ФайлBIN = ФайлыBIN[0];
					АдресФайлаBIN = Base64Строка(Новый ДвоичныеДанные(ФайлBIN.ПолноеИмя));	
					СтруктураФайла.Вставить("ИмяФайлаBIN"     ,  ФайлBIN.Имя);
					СтруктураФайла.Вставить("АдресФайлаBIN"   ,  АдресФайлаBIN);
					СтруктураФайла.Вставить("ИмяБезРасширения",  ФайлBIN.ИмяБезРасширения);
				КонецЕсли;
				
			КонецЕсли;
            
            Если ЭлФайл.Расширение = ".xml" 
                ИЛИ ЭлФайл.Расширение = "xml" Тогда
                АдресФайлаXML = Base64Строка(Новый ДвоичныеДанные(ЭлФайл.ПолноеИмя));	
                СтруктураФайла.Вставить("ИмяФайлаXML"     ,  ЭлФайл.Имя);
                СтруктураФайла.Вставить("АдресФайлаXML"   ,  АдресФайлаXML);
                СтруктураФайла.Вставить("ИмяБезРасширения",  ЭлФайл.ИмяБезРасширения);
            КонецЕсли;
            
        КонецЕсли;
        
        МассивФайловСКлиента.Добавить(СтруктураФайла);
        
	КонецЦикла;
	
	КлючЗаписиЦепочкиДокументов = Элементы[ДанныеСписка.ИмяСписка].ТекущаяСтрока;
    
	СтруктураЛога     = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьСтруктуруЛогаНаКлиенте()");	
	// Начать обработку данных
	Если ЭтаФорма.ДоступноВыполнениеВФоне Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("МассивФайловСКлиента", 	МассивФайловСКлиента);
		СтруктураПараметров.Вставить("ТипДокумента", 			ТипДокумента);
		СтруктураПараметров.Вставить("ОбработатьФайлыНаКлиенте", Истина);
		СтруктураПараметров.Вставить("МассивЛогаСобытий", 		МассивЛогаСобытий);
		СтруктураПараметров.Вставить("ЭтоРегламентноеЗадание", 	Ложь);
		СтруктураПараметров.Вставить("СтруктураЛога", 			СтруктураЛога);	
		СтруктураПараметров.Вставить("ЛокальныйКаталогINBOX", 	ЛокальныйКаталогINBOX);               
		СтруктураПараметров.Вставить("НачалоВыполнения", 		НачалоВыполнения);
		СтруктураПараметров.Вставить("ДанныеСписка", 			ДанныеСписка);	
		СтруктураПараметров.Вставить("ОбщийПроцентПрогресса", 	ОбщийПроцентПрогресса);
		СтруктураПараметров.Вставить("ИмяСобытия",				ИмяСобытия);
		СтруктураПараметров.Вставить("КлючЗаписиЦепочкиДокументов", КлючЗаписиЦепочкиДокументов);

		НачатьВыполнениеВФоне(СтруктураПараметров, "ПолучитьВсеФайлы", "Проверяем файлы на платформе - [" + ТипДокумента + "]...");
		
	Иначе
		
		МассивСтруктурыФайловСервера = ПолучитьВсеФайлыНаСервереБезКонтекста(ЭтаФорма.ОбработкаТип, МассивФайловСКлиента, ТипДокумента, Истина, МассивЛогаСобытий, Ложь, СтруктураЛога);   
		ОбработатьПолучениеФайловНаКлиенте(МассивСтруктурыФайловСервера, ТипДокумента, ЛокальныйКаталогINBOX, НачалоВыполнения, МассивЛогаСобытий, ДанныеСписка, ОбщийПроцентПрогресса, СтруктураЛога, КлючЗаписиЦепочкиДокументов);
		
		ТекстЛогаСобытий = "Время выполнения " + ЭКОМ_ОбщегоНазначенияКлиент.СекундыВоВремяНаКлиенте(ТекущаяДата() - НачалоВыполнения).Строка;
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Информация"), ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолучениеФайловНаКлиенте(МассивСтруктурыФайловСервера, ТипДокумента, ЛокальныйКаталогINBOX, НачалоВыполнения, МассивЛогаСобытий, ДанныеСписка, ОбщийПроцентПрогресса, СтруктураЛога, КлючЗаписиЦепочкиДокументов = Неопределено) Экспорт
	
	ТекущаяДата = ТекущаяДата();
	
	ИмяСобытия = "Получение документов - " + ТипДокумента;
	МассивОбработанныхФайловЛокально   = Новый Массив;
	
    Если МассивСтруктурыФайловСервера = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	ТЗОтветов.Очистить(); //Docrobot 1.19.0 MOD-1377 []
        
    МассивОшибочных = Новый Массив; 
    КоличествоСозданныхДокументов = 0;
    Для Каждого СтруктураФайла Из МассивСтруктурыФайловСервера Цикл
	
		Обработан = Ложь;
		СтруктураДок =  СтруктураФайла.СтруктураДок;
        Если СтруктураДок.Свойство("Обработан") = Истина Тогда
            Обработан = СтруктураДок.Обработан;
        КонецЕсли;	
		
		// Повторная обработка документа, пропускаем - файла нет, чтение из регистра
		Если СтруктураФайла.ПовторнаяОбработка = Истина Тогда
			ТекущееКоличество = 0;
			Если Обработан = Истина Тогда
				ТекущееКоличество = 1;
				КоличествоСозданныхДокументов = КоличествоСозданныхДокументов + ТекущееКоличество;
            КонецЕсли;
			
			Продолжить;			
		КонецЕсли;


        Если СтруктураФайла.АдресФайлаXML = Неопределено Тогда
            
            ТекстЛогаСобытий = "Не найден файл " + СтруктураФайла.ИмяФайлаXML;
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);	
			
            Продолжить;
            
        КонецЕсли;	
        
        // Получем файл из сервера на клиент
		Если ТипДокумента = "CONDRA" Тогда//Docrobot 1.22.0 MOD-2269
			ФайлXMLПолноеИмя = СтруктураДок.КаталогПуть + СтруктураФайла.ИмяФайлаXML
		Иначе
        	ФайлXMLПолноеИмя = ЛокальныйКаталогINBOX + СтруктураФайла.ИмяФайлаXML;
		КонецЕсли;	
        ДвоичныеДанныеФайла = Base64Значение(СтруктураФайла.АдресФайлаXML);
        ДвоичныеДанныеФайла.Записать(ФайлXMLПолноеИмя);
        ТекФайл = Новый Файл(ФайлXMLПолноеИмя);
        
        // Получаем подпись только там где она необходима
		Если СтруктураФайла.Свойство("АдресBIN") Тогда
			Если ТипДокумента = "CONDRA" Тогда//Docrobot 1.22.0 MOD-2269
				ФайлBINПолноеИмя = СтруктураДок.КаталогПуть + СтруктураФайла.ИмяФайлаПодписи;
			Иначе
            	ФайлBINПолноеИмя = ЛокальныйКаталогINBOX + СтруктураФайла.ИмяФайлаПодписи;
			КонецЕсли;	
            ДвоичныеДанныеФайлаПодписи = Base64Значение(СтруктураФайла.АдресBIN);
            ДвоичныеДанныеФайлаПодписи.Записать(ФайлBINПолноеИмя);
            ФайлBIN = Новый Файл(ФайлBINПолноеИмя);
            
        КонецЕсли;
        
        Если СтруктураФайла.Свойство("ИмяДокумента") Тогда	
            
            ТекстЛогаСобытий = " Файл <" + СтруктураФайла.ИмяФайлаXML + "> был загружен ранее. Пропущен. Документ - " + СтруктураФайла.ИмяДокумента;
            ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Предупреждение"), ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);	
            
            МассивОшибочных.Добавить(ТекФайл);
            Если СтруктураФайла.Свойство("АдресBIN") Тогда	     				
                МассивОшибочных.Добавить(ФайлBIN);
            КонецЕсли;
            
            Продолжить;
            
        КонецЕсли;
        	
        Если НЕ ЗначениеЗаполнено(СтруктураДок) Тогда	
            //Нет структуры
            ТекстЛогаСобытий = "Файл " + ТекФайл.Имя + " не загружен! структура файла не верна (260)";
            ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);		
            
            МассивОшибочных.Добавить(ТекФайл);
            Если СтруктураФайла.Свойство("АдресBIN") Тогда	     				
                МассивОшибочных.Добавить(ФайлBIN);
            КонецЕсли;
            
            Продолжить;
            
        КонецЕсли;
        
        знОрганизация = Неопределено;
        СтруктураДок.Свойство("Организация", знОрганизация);
        
        ОбработкаПрерыванияПользователя();
               
        ТекущееКоличество = 0;	
                
        Если Обработан = Истина Тогда
            ТекущееКоличество = 1;
            МассивОбработанныхФайловЛокально.Добавить(ТекФайл);
            Если СтруктураФайла.Свойство("АдресBIN") Тогда	     				
                МассивОбработанныхФайловЛокально.Добавить(ФайлBIN);
			КонецЕсли;
			Если ТипДокумента = "CONDRA" Тогда
				Для Каждого Расширение Из ПоддерживаемыеРасширенияCONDRAНаСервере() Цикл
					Если СтруктураФайла.Свойство("ИмяФайла" + Расширение) И СтруктураФайла.Свойство("АдресФайла" + Расширение) Тогда
						Файлы = НайтиФайлы(ЛокальныйКаталогINBOX, СтруктураФайла["ИмяФайла" + Расширение], Ложь);
						Если Файлы.Количество() > 0 Тогда
							Файл = Файлы[0];
							ПереместитьФайл(Файл.ПолноеИмя, СтруктураДок.КаталогПуть + Файл.Имя);//Docrobot 1.22.0 MOD-2269
						ИначеЕсли СтруктураФайла.Свойство("АдресФайла" + Расширение) Тогда
							ФайлПолноеИмя = СтруктураДок.КаталогПуть + СтруктураФайла["ИмяФайла" + Расширение];
							ДвоичныеДанныеФайла = Base64Значение(СтруктураФайла["АдресФайла" + Расширение]);
							ДвоичныеДанныеФайла.Записать(ФайлПолноеИмя);
						КонецЕсли;
						
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
        Иначе
            МассивОшибочных.Добавить(ТекФайл);
            Если СтруктураФайла.Свойство("АдресBIN") Тогда	     				
                МассивОшибочных.Добавить(ФайлBIN);
			КонецЕсли;
			Если ТипДокумента = "CONDRA" Тогда
				Для Каждого Расширение Из ПоддерживаемыеРасширенияCONDRAНаСервере() Цикл
					Если СтруктураФайла.Свойство("ИмяФайла" + Расширение) И СтруктураФайла.Свойство("АдресФайла" + Расширение) Тогда
						Файлы = НайтиФайлы(ЛокальныйКаталогINBOX, СтруктураФайла["ИмяФайла" + Расширение], Ложь);
						Если Файлы.Количество() > 0 Тогда
							Файл = Файлы[0];
						ИначеЕсли СтруктураФайла.Свойство("АдресФайла" + Расширение) Тогда
							ФайлПолноеИмя = ЛокальныйКаталогINBOX + СтруктураФайла["ИмяФайла" + Расширение];
							ДвоичныеДанныеФайла = Base64Значение(СтруктураФайла["АдресФайла" + Расширение]);
							ДвоичныеДанныеФайла.Записать(ФайлПолноеИмя);
							Файл = Новый Файл(ФайлПолноеИмя);
						КонецЕсли;
						
						МассивОшибочных.Добавить(Файл);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
            //Продолжить; //Docrobot 1.19.0 MOD-1377 [Используется ниже]
		КонецЕсли;
		
		//Docrobot 1.19.0 MOD-1377 [Для каждого вида отдельно считаем количество]
		Если ТипДокумента = "DP_PDOTPR" Или ТипДокумента = "DP_PDPOL" Тогда
			Отбор = Новый Структура;
    		Отбор.Вставить("ВидДокумента", СтруктураДок.ВидДокумента);
			НайденнаяСтрока = ТЗОтветов.НайтиСтроки(Отбор);
			Если НайденнаяСтрока.Количество() = 0 Тогда
				НоваяСтрока = ТЗОтветов.Добавить();		
				НоваяСтрока.ВидДокумента 		 	 = СтруктураДок.ВидДокумента;
				НоваяСтрока.КоличествоОбщее 	 	 = 1;
				НоваяСтрока.КоличествоОбработано 	 = ТекущееКоличество;
			Иначе
				НайденнаяСтрока[0].КоличествоОбщее 	 = НайденнаяСтрока[0].КоличествоОбщее + 1;
				НайденнаяСтрока[0].КоличествоОбработано = НайденнаяСтрока[0].КоличествоОбработано + ТекущееКоличество;
			КонецЕсли;
		КонецЕсли;
		
		Если Не Обработан Тогда
			Продолжить;
		КонецЕсли;
		//Конец Docrobot 1.19.0 MOD-1377 [Для каждого вида отдельно считаем количество]
        
        КоличествоСозданныхДокументов = КоличествоСозданныхДокументов + ТекущееКоличество;
        
    КонецЦикла;
    
    // Перместить ошибочные файлы в архив - Локально
    Если МассивОшибочных.Количество() > 0 Тогда			
		
		ДанныеОС = ЭКОМ_ПолучитьРазделительПутиОСКлиента();
		РазделительПути = ДанныеОС.Получить("РазделительПути");
		
		КаталогОшибок     = ЛокальныйКаталогINBOX + "Ошибки при загрузке" + РазделительПути;
		СоздатьКаталог(КаталогОшибок);

		// После создания переносим загруженный файл в архив
        Для Каждого ЭлФайл Из МассивОшибочных Цикл
            Попытка
                ПереместитьФайл(ЭлФайл.ПолноеИмя, КаталогОшибок + ЭлФайл.Имя);
            Исключение               
                ТекстЛогаСобытий = "Ошибка при переносе файла <" + ЛокальныйКаталогINBOX + ЭлФайл.Имя +  "> в архив";
				ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
				МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);	
				
                Продолжить;
                
            КонецПопытки;			
        КонецЦикла;
        
        ЗаписатьЛогСобытияВФайл(МассивЛогаСобытий, КаталогОшибок);
		    
    КонецЕсли;
    
    // Перместить файлы в архив - Локально
    Если МассивОбработанныхФайловЛокально.Количество() > 0 Тогда			
		
		ЗначениеПоУмолчанию = Неопределено;
		Измерение           = Неопределено; 
		Обязательно         = Истина;
		ЛокальныйКаталогINBOX_Архив = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_Локальный_Каталог_INBOX_Архив"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
		
		ДанныеОС = ЭКОМ_ПолучитьРазделительПутиОСКлиента();
		РазделительПути = ДанныеОС.Получить("РазделительПути");
		
		ПроверитьЛокальныйКаталог(ЛокальныйКаталогINBOX_Архив, РазделительПути);
			
		//Docrobot 1.22.0 MOD-2269
		Если ТипДокумента <> "CONDRA" Тогда
			
			КаталогСохранения = ЛокальныйКаталогINBOX_Архив + ТипДокумента + РазделительПути + Формат(ТекущаяДата, "ДФ=yyyyMMdd") + РазделительПути; 
			СоздатьКаталог(КаталогСохранения);

			// После создания переносим загруженный файл в архив
	        Для Каждого ЭлФайл Из МассивОбработанныхФайловЛокально Цикл
	            Попытка
	                ПереместитьФайл(ЭлФайл.ПолноеИмя, КаталогСохранения + ЭлФайл.Имя);
	            Исключение              
	                ТекстЛогаСобытий = "Ошибка при переносе файла <" + ЛокальныйКаталогINBOX + ЭлФайл.Имя +  "> в архив";
	                ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
					МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
	                
	                Продолжить;
	            КонецПопытки;			
			КонецЦикла;
			
		КонецЕсли;	
			
    КонецЕсли;
	
	КоличествоФайловВсего = МассивСтруктурыФайловСервера.Количество();
	Если НЕ КоличествоСозданныхДокументов = КоличествоФайловВсего Тогда
		УровеньЛогирования = ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Предупреждение");
	ИначеЕсли КоличествоФайловВсего = 0 Тогда
		УровеньЛогирования = ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Информация");	
	Иначе
		УровеньЛогирования = ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Успешно");
	КонецЕсли;

    // Сообщим количество загруженых файлов
	
   	//Docrobot 1.19.0 MOD-1377 [Для каждого вида отдельно выводим в лог количество]
	Если ТЗОтветов.Количество() > 0 Тогда
		
		Для Каждого СтрокаОтвета Из ТЗОтветов Цикл
			Если НЕ СтрокаОтвета.КоличествоОбработано = СтрокаОтвета.КоличествоОбщее Тогда
				УровеньЛогирования = ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Предупреждение");	
			Иначе
				УровеньЛогирования = ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Успешно");
			КонецЕсли;
			
			ИмяСобытия = "Обработка/загрузка документов на клиенте " + ТипДокумента + ВернутьНомерКвитанции(СтрокаОтвета.ВидДокумента);
			
			ТекстЛогаСобытий = "Окончание обработки/загрузки документов. Обработано " + СтрокаОтвета.КоличествоОбработано
			+ " файлов из " + СтрокаОтвета.КоличествоОбщее + " возможных."
			//Docrobot 1.19.0 MOD-1377 [2 этап]
			+ " Время выполнения " + ЭКОМ_ОбщегоНазначенияКлиент.СекундыВоВремяНаКлиенте(ТекущаяДата() - ТекущаяДата).Строка;
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, УровеньЛогирования, ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		КонецЦикла;
		
	ИначеЕсли Не КоличествоФайловВсего = 0 Тогда //Docrobot 1.19.0 MOD-1377 [Добавил проверку. Не выводить, если количество 0. ]
		
		ТекстЛогаСобытий = "Окончание обработки/загрузки документов. Обработано " + КоличествоСозданныхДокументов
		+ " файлов из " + КоличествоФайловВсего + " возможных."
		//Docrobot 1.19.0 MOD-1377 []
		+ " Время выполнения " + ЭКОМ_ОбщегоНазначенияКлиент.СекундыВоВремяНаКлиенте(ТекущаяДата() - ТекущаяДата).Строка;
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, УровеньЛогирования, ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		
	КонецЕсли;
	//Конец Docrobot 1.19.0 MOD-1377 [Для каждого вида отдельно выводим в лог количество]
	
	// Статус завершения операции в фоне
	ЭтаФорма.Индикатор = ЭтаФорма.Индикатор + ОбщийПроцентПрогресса;
	
	Если ЭтаФорма.Индикатор >= 99 Тогда
	     Элементы.ПолеИндикатор.Видимость = Ложь;
		 Элементы.КомандаЗакрытьИндикатор.Видимость = Ложь;
	КонецЕсли;
	
	Если СтруктураЛога.ЕстьОшибка = Истина Тогда
	     Элементы.КомандаНадписьОшибка.Видимость = Истина;
	КонецЕсли;
	
	//ОтобразитьЛогСобытий(МассивЛогаСобытий);

	
	ВыбранныеСтроки = Новый Массив;
	Для Каждого Идентификатор Из Элементы[ДанныеСписка.ИмяСписка].ВыделенныеСтроки Цикл
		ВыбранныеСтроки.Добавить(Новый Структура("ИдентификаторВыделенныхСтрок, Полученные", Идентификатор, Истина));
	КонецЦикла;
	ОбновитьДинамическийСписок(ДанныеСписка, Истина, ВыбранныеСтроки, КлючЗаписиЦепочкиДокументов);
	ОбновитьЦепочкуДокументовНаКлиенте(ДанныеСписка.ИмяСписка, КлючЗаписиЦепочкиДокументов);
	ОбновитьКвитанцииНаКлиенте(ДанныеСписка.ИмяСписка);
	КомандаОбновитьКоличествоДокументовНаПлатформеНаСервере(ИнфоДатаЗагруженоЗа, ИнфоДокументыНаПлатформе);
	Если ВыбранныеСтроки.Количество() Тогда
		ВосстановитьТекущуюСтрокуСписка(Элементы[ДанныеСписка.ИмяСписка].ТекущаяСтрока, ДанныеСписка.ИмяСписка, ВыбранныеСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВернутьНомерКвитанции(ВидДокумента) //Docrobot 1.19.0 MOD-1377 []
	
	Если ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.DP_PDOTPR_03") Тогда
		Возврат "_03";	
	ИначеЕсли ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.DP_PDOTPR_08") Тогда 
		Возврат "_08";
	ИначеЕсли ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.DP_PDOTPR_13") Тогда 
		Возврат "_13";
	ИначеЕсли ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.DP_PDPOL_02") Тогда 
		Возврат "_02";
	ИначеЕсли ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.DP_PDPOL_07") Тогда 
		Возврат "_07";
	ИначеЕсли ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.DP_PDPOL_12") Тогда 
		Возврат "_12";
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыводСообщенийНаЭкранНаКлиенте(Текст, Заголовок, Статус = "", ВыводитьСообщения = Истина)
    
    Если НЕ ВыводитьСообщения Тогда
        Возврат;
    КонецЕсли;
    
    Если Статус = "" Тогда	
        Статус = СтатусСообщения.Обычное;	
    КонецЕсли;
    
    Если Заголовок <> "Авто" Тогда
        Сообщить(Текст, Статус);	
    КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Функция ПроверитьПодписьФайлаНаКлиенте(ИмяПодписанногоФайла, ИмяФайлаПодписиBIN, МассивЛогаСобытий)
    
    Структура = Новый Структура;
    Структура.Вставить("ПодписьВерна", Ложь);
    Структура.Вставить("Отпечаток"   , "");
    
    знСертификат  = Неопределено;
    
    ПодписьТело		= Новый ТекстовыйДокумент;
    ПодписьТело.Прочитать(ИмяФайлаПодписиBIN);
    ПодписьТелоBase64 	= ПодписьТело.ПолучитьТекст();
    ПодписьТелоBase64 	= СтрЗаменить(ПодписьТелоBase64, Символы.ПС, "");
    ПодписьТелоBase64 	= СтрЗаменить(ПодписьТелоBase64, Символы.ВК, "");
    
    ИмяФайлаПодписиSGN = ПолучитьИмяВременногоФайла("sgn");
    // Декодирование и сохранение строки BASE64 в файл.
    ДвоичныеДанные 	= Base64Значение(ПодписьТелоBase64);
    ДвоичныеДанные.Записать(ИмяФайлаПодписиSGN);
    
    Попытка
        МенеджерКриптографии = Новый МенеджерКриптографии("", "", 80);
        МенеджерКриптографии.ПроверитьПодпись(ИмяПодписанногоФайла, ИмяФайлаПодписиSGN, знСертификат);
        Структура.Вставить("Отпечаток"   , Base64Строка(знСертификат.Отпечаток));
        Структура.Вставить("ПодписьВерна", Истина);		
    Исключение
        ТекстЛогаСобытий = ОписаниеОшибки();
        ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), "Проверка подписи на клиенте");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

    КонецПопытки;
    
    Возврат Структура;
    
КонецФункции

&НаСервереБезКонтекста
Функция РазбитьМассивПоЧастям(пМассив)
    
    Структура = Новый Структура;
    
    Счетчик    = 0;
    НомерЧасти = 1;
    Соответствие = Новый Соответствие;
    Для каждого Эл Из пМассив Цикл
        Счетчик = Счетчик + 1;
        Если Счетчик < 2000 Тогда	
            Соответствие.Вставить(Эл.Имя, "");	
        Иначе			
            Счетчик    = 0;
            НомерЧасти = НомерЧасти + 1;		
            Соответствие = Новый Соответствие;
        КонецЕсли;
        
        Структура.Вставить("Часть" + НомерЧасти, Соответствие);
    КонецЦикла;
    
    Возврат Структура;
    
КонецФункции

&НаСервере
Функция НайтиТекущегоПользователя()
    ОбъектЭтаОбработка = РеквизитФормыВЗначение("Объект");
    Результат = ОбъектЭтаОбработка.НайтиТекущегоПользователя();
    
    ОбъектЭтаОбработка = Неопределено;
    Возврат Результат;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ДЛЯ ПОСТАВЩИКА

#Область ФункцииДляПоставщика

&НаКлиенте
Функция ПолучитьСтрокиДинамическогоСпискаДляОбработки(ДанныеСписка, ПозицияТекущейСтроки, ВыделенныеСтроки = Неопределено)
	
	Если ВыделенныеСтроки = Неопределено Тогда
		ВыделенныеСтроки = Новый Массив;
	КонецЕсли;
	
	СписокДляОбработки   = Элементы[ДанныеСписка.ИмяСписка];
	ПозицияТекущейСтроки = СписокДляОбработки.ТекущаяСтрока;
	ВыделенныеСтроки     = СписокДляОбработки.ВыделенныеСтроки;
	
	СтрКолонки = "";
	Для каждого ИмяКолонки Из СписокДляОбработки.ПодчиненныеЭлементы Цикл
		ИмяТекКолонки = СтрЗаменить(ИмяКолонки.Имя, СписокДляОбработки.Имя, "");
		ИмяТекКолонки = СтрЗаменить(ИмяТекКолонки, "ГруппаКолонок_", "");
		СтрКолонки    = ?(СтрКолонки = "", ИмяТекКолонки, СтрКолонки + "," + ИмяТекКолонки);		
	КонецЦикла;
	
	ПомеченныеСтроки = Новый Массив;
	УстанавливаютсяПометкиВЗапросе = Найти(СтрКолонки, "Пометка") > 0;
	Если УстанавливаютсяПометкиВЗапросе = Истина Тогда
		ПомеченныеСтроки = ПолучитьСтроки(ДанныеСписка.ИмяСписка, СтрКолонки);
	КонецЕсли;
	
	Если ПомеченныеСтроки.Количество() = 0 Тогда			
		Для каждого текВыделеннаяСтрока Из ВыделенныеСтроки Цикл
			РезультатСтруктура = Новый Структура(СтрКолонки);
			РезультатСтруктура.Вставить("ИдентификаторВыделенныхСтрок", текВыделеннаяСтрока);			
			ВыбраннаяСтрока = СписокДляОбработки.ДанныеСтроки(текВыделеннаяСтрока);			
			ЗаполнитьЗначенияСвойств(РезультатСтруктура, ВыбраннаяСтрока);
			ПомеченныеСтроки.Добавить(РезультатСтруктура);
		КонецЦикла;				
	КонецЕсли;
	
	//++ MOD-1485 
	// Очищаем пометки
	//Если УстанавливаютсяПометкиВЗапросе = Истина Тогда		
	//	УправлениеПометкамиДинамическогоСписка(Ложь);
	//КонецЕсли;
	//-- MOD-1485
	
	Если ТипЗнч(ПозицияТекущейСтроки) = Тип("Число") 
		И ПомеченныеСтроки.Количество() >= ПозицияТекущейСтроки Тогда
		СписокДляОбработки.ТекущаяСтрока = ПозицияТекущейСтроки;
	КонецЕсли;
	
	Возврат ПомеченныеСтроки;
	
КонецФункции

&НаСервере
Функция ПолучитьСтроки(ИмяСписка, СтрКолонки)
	
	ВыбранныеСтроки = Новый Массив; 
	
	ТЗ = ДинамическийСписок_в_ТЗ(ИмяСписка);
	НайденныеСтроки = ТЗ.НайтиСтроки(Новый Структура("Пометка", Истина));
	Для каждого ТекСтрока Из НайденныеСтроки Цикл
		РезультатСтруктура = Новый Структура(СтрКолонки);	
		ЗаполнитьЗначенияСвойств(РезультатСтруктура, ТекСтрока);
		ВыбранныеСтроки.Добавить(РезультатСтруктура);
	КонецЦикла;
	
	Возврат ВыбранныеСтроки;
	
КонецФункции

// Параметры: 
// ИмяСписка             = "СписокДляПоставщика"
// ИмяДокументаИсточника = "ЭКОМ_Документ_ORDER"
// ИмяДокументаПриемника = "ДокументЗаказа"
// ИмяПроцедурыСоздания  = "СоздатьДокументыЗаказа"
&НаКлиенте
Процедура СоздатьДокументы(ИмяДокументаИсточника, ИмяДокументаПриемника, ИмяПроцедурыСоздания)	
	
	МассивЛогаСобытий = Новый Массив;
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();	
	ПозицияТекущейСтроки = Неопределено;
    ОбрабатываемыеДанные = ПолучитьСтрокиДинамическогоСпискаДляОбработки(ДанныеСписка, ПозицияТекущейСтроки);
  
    МассивСтрокОтправленных    = Новый Массив;
    МассивСтрокНовыхДокументов = Новый Массив;
    Для каждого ВыбраннаяСтрока Из ОбрабатываемыеДанные Цикл
        
        Если ЗначениеЗаполнено(ВыбраннаяСтрока[ИмяДокументаИсточника]) 
            И НЕ ЗначениеЗаполнено(ВыбраннаяСтрока.ТекстОшибки) Тогда
            
            СтруктураСтроки = Новый Структура;
            СтруктураСтроки.Вставить("Строка", ВыбраннаяСтрока);
            СтруктураСтроки.Вставить("ИмяДокументаПриемника", ИмяДокументаПриемника);
            
            Если ЗначениеЗаполнено(ВыбраннаяСтрока[ИмяДокументаПриемника]) Тогда	 
                СтруктураСтроки.Вставить("СтрокаОбработана", Ложь);	 
                МассивСтрокОтправленных.Добавить(СтруктураСтроки);
            Иначе
                СтруктураСтроки.Вставить("СтрокаОбработана", Истина);
                МассивСтрокНовыхДокументов.Добавить(СтруктураСтроки);
            КонецЕсли;
            
        КонецЕсли;	
    КонецЦикла;
    
    Если МассивСтрокОтправленных.Количество() > 0 Тогда
        
        ПроверитьНаПовторноеСоздание(МассивСтрокОтправленных, ИмяПроцедурыСоздания, МассивЛогаСобытий);		
        
    КонецЕсли;
    
    // Создание документов для тех которые еще не созданы
    Если МассивСтрокНовыхДокументов.Количество() > 0 Тогда
        
        ПараметрыПроцедуры = Новый Массив;
        ПараметрыПроцедуры.Добавить(МассивСтрокНовыхДокументов);
        ПараметрыПроцедуры.Добавить(МассивЛогаСобытий);
        ВыполнитьПроцедуруИзМодуляОбъекта(ИмяПроцедурыСоздания, ПараметрыПроцедуры);
        	
		ОбновитьДинамическийСписок(ДанныеСписка);        
        ОбновитьЦепочкуДокументовНаКлиенте(ДанныеСписка.ИмяСписка);
        ОтобразитьЛогСобытий(МассивЛогаСобытий);
        
    КонецЕсли;	
    
КонецПроцедуры

// Параметры: 
// ИмяСписка             = "СписокДляПоставщика"
// ИмяДокументаИсточника = "ЭКОМ_Документ_ORDER"
// ИмяДокументаПриемника = "ДокументЗаказа"
// ИмяПроцедурыСоздания  = "СоздатьДокументыЗаказа"
&НаКлиенте
Функция ОтправитьДокументы(ДанныеСписка, ИмяСтатуса, ИмяДокументаИсточника, ТипДокумента, СоответствиеКолонок, НужнаПодпись)	
	
	Отказ = Ложь;
	МассивЛогаСобытий = Новый Массив;
	ИмяСобытия = "Отправка документов " + ТипДокумента;
	
	Если СоответствиеКолонок.Получить(ИмяСтатуса) = Неопределено Тогда
		ТекстЛогаСобытий = "В списке табличной части нет колонки с именем статуса - [" + ИмяСтатуса + "]";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		Отказ = Истина;
	КонецЕсли;
	
	Если СоответствиеКолонок.Получить(ИмяДокументаИсточника) = Неопределено Тогда
		ТекстЛогаСобытий = "Отсутствует документ-источник (колонка [" + ИмяДокументаИсточника + "])";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ = Ложь Тогда		
		// Проверка заполненности причины отклонения 
		Если Найти(ТипДокумента, "DP_PRANNUL_22") > 0 //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _22]
			ИЛИ ТипДокумента = "DP_UVUTOCH_24" Тогда
			
			ПозицияТекущейСтроки = Неопределено;	
			ВыгружаемыеДанные    = ПолучитьСтрокиДинамическогоСпискаДляОбработки(ДанныеСписка, ПозицияТекущейСтроки);
			ВосстановитьТекущуюСтрокуСписка(ПозицияТекущейСтроки, ДанныеСписка.ИмяСписка, ВыгружаемыеДанные);
			
			Если ТипДокумента = "DP_UVUTOCH_24" Тогда
				ИмяКолонкиТекста = "ТекстОтклоненияАннулирования";
				Подсказка = "Причина отклонения аннулирования";
			Иначе
				ИмяКолонкиТекста = "ТекстПричиныАннулирования";
				Подсказка = "Причина аннулирования";
			КонецЕсли;
			
			Если СоответствиеКолонок.Получить("ТекстПричиныАннулирования") = Неопределено Тогда
				ТекстЛогаСобытий = "В списке табличной части нет колонки с именем документа - [" + ИмяКолонкиТекста + "])";
				ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
				МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
				Отказ = Истина;
			КонецЕсли;
			
			Если Отказ = Ложь Тогда
				ТребуютУстановкиТекста = Новый Массив;
				Для Каждого ВыбраннаяСтрока Из ВыгружаемыеДанные Цикл
					
					Если ПустаяСтрока(ВыбраннаяСтрока[ИмяКолонкиТекста]) Тогда				
						ТребуютУстановкиТекста.Добавить(ВыбраннаяСтрока[ИмяДокументаИсточника]);
					КонецЕсли;
					
				КонецЦикла;
				
				Если ТребуютУстановкиТекста.Количество() > 0 Тогда
					
					ДополнительныеПараметры = Новый Структура;		
					ДополнительныеПараметры.Вставить("ДанныеСписка", 		   ДанныеСписка);
					ДополнительныеПараметры.Вставить("ИмяСтатуса", 			   ИмяСтатуса);
					ДополнительныеПараметры.Вставить("МассивЛогаСобытий", 	   МассивЛогаСобытий);
					ДополнительныеПараметры.Вставить("ТипДокумента", 		   ТипДокумента);
					ДополнительныеПараметры.Вставить("НужнаПодпись", 		   НужнаПодпись);
					ДополнительныеПараметры.Вставить("ТребуютУстановкиТекста", ТребуютУстановкиТекста);
					ДополнительныеПараметры.Вставить("ИмяКолонкиТекста"      , ИмяКолонкиТекста);
					
					Оповещение = Новый ОписаниеОповещения("ЗавершениеВводаТекстаАннулирования", ЭтаФорма, ДополнительныеПараметры);
					ПоказатьВводСтроки(Оповещение, , Подсказка, 0, Истина);
				Иначе
					Возврат ОтправитьДокументыПродолжить(ДанныеСписка, ИмяСтатуса, ТипДокумента, НужнаПодпись, МассивЛогаСобытий);
				КонецЕсли;
				
			КонецЕсли;
			
			// Проверка заполненности причины отклонения для отклоненной кондры.
		ИначеЕсли ТипДокумента = "CONDRA_ОТКЛОНИТЬ" Тогда
			
			ПозицияТекущейСтроки = Неопределено;
			ВыделенныеСтроки	 = Неопределено;
			ВыгружаемыеДанные    = ПолучитьСтрокиДинамическогоСпискаДляОбработки(ДанныеСписка, ПозицияТекущейСтроки, ВыделенныеСтроки);
			
			Для Каждого ВыбраннаяСтрока Из ВыгружаемыеДанные Цикл
				Если ПустаяСтрока(ВыбраннаяСтрока.Информация) Тогда
					Подсказка = "Причина отклонения";
					ДополнительныеПараметры = Новый Структура;
					
					ДополнительныеПараметры.Вставить("ДанныеСписка", 			ДанныеСписка);
					ДополнительныеПараметры.Вставить("ИмяСтатуса", 				ИмяСтатуса);
					ДополнительныеПараметры.Вставить("МассивЛогаСобытий", 		МассивЛогаСобытий);
					ДополнительныеПараметры.Вставить("ТипДокумента", 			ТипДокумента);
					ДополнительныеПараметры.Вставить("НужнаПодпись", 			НужнаПодпись);
					ДополнительныеПараметры.Вставить("ВыгружаемыеДанные", 		ВыгружаемыеДанные);
					ДополнительныеПараметры.Вставить("ПозицияТекущейСтроки", 	ПозицияТекущейСтроки);
					ДополнительныеПараметры.Вставить("ИмяДокумента", 			ИмяДокументаИсточника);
					ДополнительныеПараметры.Вставить("ВыделенныеСтроки",		ВыделенныеСтроки);
					
					Оповещение = Новый ОписаниеОповещения("ЗавершениеВводаИнформация", ЭтаФорма, ДополнительныеПараметры);
					ПоказатьВводСтроки(Оповещение, , Подсказка, 0, Истина);
					Прервать;
				Иначе
					Возврат ОтправитьДокументыПродолжить(ДанныеСписка, ИмяСтатуса, ТипДокумента, НужнаПодпись, МассивЛогаСобытий);
				КонецЕсли;
			КонецЦикла;
		Иначе
			Возврат ОтправитьДокументыПродолжить(ДанныеСписка, ИмяСтатуса, ТипДокумента, НужнаПодпись, МассивЛогаСобытий);
		КонецЕсли;
		
	Иначе		
		ОтобразитьЛогСобытий(МассивЛогаСобытий);
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Продолжение процедуры отправки документов (нужен для отображения поля ввода текста отклонения для CONDRA)
//
// Параметры:
// ИмяСписка             = "СписокДляПоставщика"
// ИмяДокументаИсточника = "ЭКОМ_Документ_ORDER"
// ИмяДокументаПриемника = "ДокументЗаказа"
// ИмяПроцедурыСоздания  = "СоздатьДокументыЗаказа"
//
&НаКлиенте
Функция ОтправитьДокументыПродолжить(ДанныеСписка, ИмяСтатуса, ТипДокумента, НужнаПодпись, МассивЛогаСобытий)
	
	// Обновление ТЧ для актуализации статусов документов перед отправкой.
	ОбновитьДинамическийСписок(ДанныеСписка);
	
	ИмяСобытия = "Отправить документы - " + ТипДокумента;
	ПозицияТекущейСтроки = Неопределено;	
	ВыгружаемыеДанные    = ПолучитьСтрокиДинамическогоСпискаДляОбработки(ДанныеСписка, ПозицияТекущейСтроки);
	ВосстановитьТекущуюСтрокуСписка(ПозицияТекущейСтроки, ДанныеСписка.ИмяСписка, ВыгружаемыеДанные);
	
	МассивСтрокОтправленных    = Новый Массив;
    МассивСтрокНовыхДокументов = Новый Массив;
	
	ЗначениеПоУмолчанию = Ложь;
	Измерение           = Неопределено; 
	Обязательно         = Ложь;
	ЭКОМ_ОтправлятьДокументыПовторно = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_ОтправлятьДокументыПовторно"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
	
	Для каждого ВыбраннаяСтрока Из ВыгружаемыеДанные Цикл
		
		ВыбраннаяСтрока.Вставить("ПредставлениеДокумента", ПолучитьПредставлениеДокумента(ТипДокумента, ВыбраннаяСтрока));
		ДокументУжеБылОтправлен = Ложь;
		// Для EDI
		Если ВыбраннаяСтрока[ИмяСтатуса] = Истина
			ИЛИ ВыбраннаяСтрока[ИмяСтатуса] = ПредопределенноеЗначение("Перечисление.ЭКОМ_СтатусыЭлектронныхДокументов.Отправлен") Тогда
			ДокументУжеБылОтправлен = Истина;
		КонецЕсли;
		
		Если ИмяСтатуса = "Статус_УПД" 
			ИЛИ ИмяСтатуса = "Статус_УПД_Исходящий" Тогда
			
			Если ТипДокумента = "ЮЗД"
				И (ВыбраннаяСтрока[ИмяСтатуса] = "" 
				ИЛИ ВыбраннаяСтрока[ИмяСтатуса] = ПредопределенноеЗначение("Перечисление.ЭКОМ_Статусы.ПустаяСсылка")
				ИЛИ ВыбраннаяСтрока[ИмяСтатуса] = ПредопределенноеЗначение("Перечисление.ЭКОМ_Статусы.НеОбработан")) Тогда
				
				ДокументУжеБылОтправлен = Ложь;
				
			ИначеЕсли ТипДокумента = "DP_UVUTOCH_09" Тогда // Задача MOD-1423 //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _09]
				//И НЕ (ВыбраннаяСтрока[ИмяСтатуса] = "Отправлено уточнение"
				//ИЛИ ВыбраннаяСтрока[ИмяСтатуса] = ПредопределенноеЗначение("Перечисление.ЭКОМ_Статусы.ОтправленоУточнение")) 
				
				ДокументУжеБылОтправлен = Ложь;
				
			ИначеЕсли Найти(ТипДокумента, "DP_PRANNUL_22") > 0  //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _22]  
				И НЕ (ВыбраннаяСтрока[ИмяСтатуса] = "Отправлено аннулирование"
				ИЛИ ВыбраннаяСтрока[ИмяСтатуса] = ПредопределенноеЗначение("Перечисление.ЭКОМ_Статусы.ОтправленоАннулирование")) Тогда
				
				ДокументУжеБылОтправлен = Ложь;
				
			ИначеЕсли ТипДокумента = "DP_UVUTOCH_24" 
				И НЕ (ВыбраннаяСтрока[ИмяСтатуса] = "Отклонено аннулирование"
				ИЛИ ВыбраннаяСтрока[ИмяСтатуса] = ПредопределенноеЗначение("Перечисление.ЭКОМ_Статусы.ОтклоненоАннулирование")) Тогда
				
				ДокументУжеБылОтправлен = Ложь;
				
			ИначеЕсли ТипДокумента = "DP_IZVPOL_23" 
				И НЕ (ВыбраннаяСтрока[ИмяСтатуса] = "Принято аннулирование"
				ИЛИ ВыбраннаяСтрока[ИмяСтатуса] = ПредопределенноеЗначение("Перечисление.ЭКОМ_Статусы.ПринятоАннулирование")) Тогда

				ДокументУжеБылОтправлен = Ложь;

			ИначеЕсли ТипДокумента = "ПодписьЮЗД" Тогда // Задача MOD-1410
				//И НЕ (ВыбраннаяСтрока[ИмяСтатуса] = "Документооборот завершен"
				//ИЛИ ВыбраннаяСтрока[ИмяСтатуса] = ПредопределенноеЗначение("Перечисление.ЭКОМ_Статусы.ДокументооборотЗавершен")) Тогда
				
				ДокументУжеБылОтправлен = Ложь;
				
			ИначеЕсли ТипДокумента = "DP_REZRUISP"
				И (ВыбраннаяСтрока[ИмяСтатуса] = "Не обработан"
				ИЛИ ВыбраннаяСтрока[ИмяСтатуса] = ПредопределенноеЗначение("Перечисление.ЭКОМ_Статусы.НеОбработан")) Тогда 
				
				ДокументУжеБылОтправлен = Ложь;
			
			Иначе
				
				ДокументУжеБылОтправлен = Истина;
				
			КонецЕсли;
			
		// Для прайс-листа
		ИначеЕсли ИмяСтатуса = "СтатусОбработкиДокумента" Тогда		
			Если ВыбраннаяСтрока[ИмяСтатуса] = ПредопределенноеЗначение("Перечисление.ЭКОМ_Статусы.Отправлен") Тогда
				ДокументУжеБылОтправлен = Истина;
			КонецЕсли;

		КонецЕсли;
		
		Если Найти(ТипДокумента, "CONDRA") > 0 Тогда
			Если (ТипДокумента = "CONDRA_ОТКЛОНИТЬ" 
				И ВыбраннаяСтрока[ИмяСтатуса] = ПредопределенноеЗначение("Перечисление.ЭКОМ_СтатусыCONDRA.Отклонён"))
				
				ИЛИ (ТипДокумента = "CONDRA_ПРИНЯТЬ" 
				И ВыбраннаяСтрока[ИмяСтатуса] = ПредопределенноеЗначение("Перечисление.ЭКОМ_СтатусыCONDRA.Принят")) Тогда
				
				ДокументУжеБылОтправлен = Истина;
			КонецЕсли;
		КонецЕсли;
		
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("Строка", ВыбраннаяСтрока);       
		
		Если ДокументУжеБылОтправлен Тогда	 
			Если ЭКОМ_ОтправлятьДокументыПовторно = Ложь Тогда
				ТекстЛогаСобытий = СтруктураСтроки.Строка.ПредставлениеДокумента + " - документ пропущен, так как был уже отправлен!";
				ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Предупреждение"), ИмяСобытия);
				МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

				Продолжить;
			Иначе
				СтруктураСтроки.Вставить("СтрокаОбработана", Ложь);
				СтруктураСтроки.Вставить("ОтправитьПовторно", Истина);
				СтруктураСтроки.Вставить("ПредставлениеДокумента", СтруктураСтроки.Строка.ПредставлениеДокумента);
				МассивСтрокОтправленных.Добавить(СтруктураСтроки);
			КонецЕсли;
		Иначе
			СтруктураСтроки.Вставить("СтрокаОбработана" , Истина);
			СтруктураСтроки.Вставить("ОтправитьПовторно", Ложь);
			СтруктураСтроки.Вставить("ПредставлениеДокумента", СтруктураСтроки.Строка.ПредставлениеДокумента);
			МассивСтрокНовыхДокументов.Добавить(СтруктураСтроки);
		КонецЕсли;
		
	КонецЦикла;
	
	ИсключитьОтправкуПоЗапрещеннымКонтрагентам(МассивСтрокОтправленных, ДанныеСписка.ИмяКнопки, ИмяСобытия, МассивЛогаСобытий, ОбработкаТип);
	ИсключитьОтправкуПоЗапрещеннымКонтрагентам(МассивСтрокНовыхДокументов, ДанныеСписка.ИмяКнопки, ИмяСобытия, МассивЛогаСобытий, ОбработкаТип);
	
    Если МассивСтрокОтправленных.Количество() > 0 
        И ЭКОМ_ОтправлятьДокументыПовторно = Истина Тогда
        
        ПроверитьНаПовторнуюОтправку(МассивСтрокОтправленных, МассивЛогаСобытий, НужнаПодпись, ТипДокумента, ПозицияТекущейСтроки, ВыгружаемыеДанные);		
        
    КонецЕсли;
    
    // Отправка документов которые еще не отправлены
    Если МассивСтрокНовыхДокументов.Количество() > 0 Тогда
		
		ЭтаФорма.Индикатор = 1;
		Элементы.ПолеИндикатор.Видимость = Истина;
        Элементы.КомандаЗакрытьИндикатор.Видимость = Истина;
		
		ЭтоНовыеДокументы = Истина;
		Возврат ОтправитьФайлыНаКлиенте(МассивСтрокНовыхДокументов, ТипДокумента, ДанныеСписка, 100, ПозицияТекущейСтроки, ВыгружаемыеДанные, Ложь, МассивЛогаСобытий, НужнаПодпись, ЭтоНовыеДокументы);
	Иначе
		ОтобразитьЛогСобытий(МассивЛогаСобытий);
		Возврат Ложь;	
    КонецЕсли;	
    
КонецФункции // ОтправитьДокументыПродолжить()

// Исключает из отправки документы по контрагенту, на отправку которому установлен запрет для текущих ролей пользователя
//
// Параметры:
//  МассивСтрок	- Массив - коллекция строк табличного поля с документами к отправке
//  ИмяКнопки  	- Строка - наименование нажатой пользователем кнопки
//	ИмяСобытия	- Строка - имя выполняемого доействия для указания в записи лога
//	МассивЛогаСобытий - Массив - коллекция сообщений для записи в лог событий
//	ОбработкаТип 	  - Строка - внутреннее строковое представление типа значения объекта обработки. Необходимо для обращения к методам модуля обработки 	
//   
&НаСервереБезКонтекста
Процедура ИсключитьОтправкуПоЗапрещеннымКонтрагентам(МассивСтрок, ИмяКнопки, ИмяСобытия, МассивЛогаСобытий, ОбработкаТип)
	
	КоличествоСтрок = МассивСтрок.Количество();
	Если КоличествоСтрок = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаОбъект = Новый (ЗначениеИзСтрокиВнутр(ОбработкаТип));
	ОграниченияПоКонтрагентам = ОбработкаОбъект.ПолучитьОграниченияДоступаПоКонтрагентам();
	Если ОграниченияПоКонтрагентам.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Счетчик = 1 По КоличествоСтрок Цикл
		ИндексСтроки = КоличествоСтрок - Счетчик;
		ЭлементМассива = МассивСтрок.Получить(ИндексСтроки);
		
		Контрагент = Неопределено;
		Если ЭлементМассива.Строка.Свойство("Контрагент", Контрагент) Тогда
			ОграниченияПоКонтрагенту = ОграниченияПоКонтрагентам.НайтиСтроки(Новый Структура("Контрагент, Имя", Контрагент, ИмяКнопки));
			Если ОграниченияПоКонтрагенту.Количество() > 0
				И НЕ ОграниченияПоКонтрагенту.Получить(0).Доступность Тогда
				
				ТекстЛогаСобытий = "Документ " + ЭлементМассива.Строка.ПредставлениеДокумента + " пропущен. Пользователю запрещено отправлять документы по контрагенту " + Строка(Контрагент);
				ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛогаОбщийМодуль(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Предупреждение"), ИмяСобытия);
				МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
				
				МассивСтрок.Удалить(ИндексСтроки);
			КонецЕсли;
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры // ИсключитьОтправкуПоЗапрещеннымКонтрагентам()
&НаКлиенте
Процедура ЗавершениеВводаИнформация(Информация, ДополнительныеПараметры) Экспорт
	
	ДанныеСписка 			= ДополнительныеПараметры.ДанныеСписка;
	ИмяСтатуса				= ДополнительныеПараметры.ИмяСтатуса;
	МассивЛогаСобытий 	    = ДополнительныеПараметры.МассивЛогаСобытий;
	ИмяДокумента 			= ДополнительныеПараметры.ИмяДокумента;
	ТипДокумента 			= ДополнительныеПараметры.ТипДокумента;
	НужнаПодпись 			= ДополнительныеПараметры.НужнаПодпись;
	ВыгружаемыеДанные 		= ДополнительныеПараметры.ВыгружаемыеДанные;
	ПозицияТекущейСтроки 	= ДополнительныеПараметры.ПозицияТекущейСтроки;
	ВыделенныеСтроки		= ДополнительныеПараметры.ВыделенныеСтроки;
	
	ТребуютУстановкиПричиныОтклонения = Новый Массив;
	Для Каждого ВыбраннаяСтрока Из ВыгружаемыеДанные Цикл
		Если ПустаяСтрока(ВыбраннаяСтрока.Информация) Тогда
			ВыбраннаяСтрока.Информация = Информация;
			ТребуютУстановкиПричиныОтклонения.Добавить(ВыбраннаяСтрока[ИмяДокумента]);
		КонецЕсли;
	КонецЦикла;
	// Добавляем причину отклонения в записи регистра.
	Если ТребуютУстановкиПричиныОтклонения.Количество() > 0
		И ЗначениеЗаполнено(Информация) Тогда
		ПараметрыПроцедуры = Новый Массив;
        ПараметрыПроцедуры.Добавить(ТребуютУстановкиПричиныОтклонения);
        ПараметрыПроцедуры.Добавить(Информация);
		ВыполнитьПроцедуруИзМодуляОбъекта("ДобавитьПричинуОтклоненияCONDRA", ПараметрыПроцедуры);
		
		// Здесь нужно обновить форму, но так чтобы выделенные строки остались выделенными!!
		ОбновитьДинамическийСписок(ДанныеСписка);
		ВосстановитьТекущуюСтрокуСписка(ПозицияТекущейСтроки, ДанныеСписка.ИмяСписка, ВыгружаемыеДанные);
	КонецЕсли;
	
	ОтправитьДокументыПродолжить(ДанныеСписка, ИмяСтатуса, ТипДокумента, НужнаПодпись, МассивЛогаСобытий);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВводаТекстаАннулирования(Текст, ДополнительныеПараметры) Экспорт
	
	ДанныеСписка 		    = ДополнительныеПараметры.ДанныеСписка;
	ИмяСтатуса				= ДополнительныеПараметры.ИмяСтатуса;
	МассивЛогаСобытий 	    = ДополнительныеПараметры.МассивЛогаСобытий;
	ТипДокумента 			= ДополнительныеПараметры.ТипДокумента;
	НужнаПодпись 			= ДополнительныеПараметры.НужнаПодпись;
	ТребуютУстановкиТекста 	= ДополнительныеПараметры.ТребуютУстановкиТекста;
	ИмяКолонкиТекста        = ДополнительныеПараметры.ИмяКолонкиТекста;
	
	Для каждого ИндекснаяСтрока Из Элементы[ДанныеСписка.ИмяСписка].ВыделенныеСтроки Цикл
		ВыбраннаяСтрока = Элементы[ДанныеСписка.ИмяСписка].ДанныеСтроки(ИндекснаяСтрока);
		Если ПустаяСтрока(ВыбраннаяСтрока[ИмяКолонкиТекста]) Тогда
			ВыбраннаяСтрока[ИмяКолонкиТекста] = Текст;
		КонецЕсли;   
	КонецЦикла;
	
	// Добавляем причину отклонения в записи регистра.
	Если ЗначениеЗаполнено(Текст) Тогда
		
		ПараметрыАлгоритма = Новый Структура;
		ПараметрыАлгоритма.Вставить("Документы"       , ТребуютУстановкиТекста);
		ПараметрыАлгоритма.Вставить("Текст"           , Текст);
		ПараметрыАлгоритма.Вставить("ИмяКолонкиТекста", ИмяКолонкиТекста);
		ИмяАлгоритма = "ДобавитьТекстАннулирования";
		
		ВыполнитьПроцедуруИзМодуляОбъектаСтруктура(ИмяАлгоритма, ПараметрыАлгоритма, Неопределено);	
	
	КонецЕсли;
	
	ОтправитьДокументыПродолжить(ДанныеСписка, ИмяСтатуса, ТипДокумента, НужнаПодпись, МассивЛогаСобытий);
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьТекущуюСтрокуСписка(ПозицияТекущейСтроки, ИмяСписка, ВыделенныеСтроки)
	      	
	Если ТипЗнч(ВыделенныеСтроки) = Тип("Массив") Тогда
		Элементы[ИмяСписка].ВыделенныеСтроки.Очистить();
		Для Каждого Строка Из ВыделенныеСтроки Цикл
			Если Строка.Свойство("ИдентификаторВыделенныхСтрок") = Истина Тогда
			     Элементы[ИмяСписка].ВыделенныеСтроки.Добавить(Строка.ИдентификаторВыделенныхСтрок);	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Элементы[ИмяСписка].ВыделенныеСтроки.Количество() = 0 Тогда
		Если ТипЗнч(ПозицияТекущейСтроки) = Тип("Число") Тогда
			Элементы[ИмяСписка].ТекущаяСтрока = ПозицияТекущейСтроки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Функция позволяет получить имя источника для шаблонов исходящих документов
//
// Параметры:
//  <ИмяШаблона  - Строка - имя шаблона в базе клиента
//  МассивЛогаСобытий  - Строка - данные лога событий для вывода пользователю
//  ТекстЛогаСобытий  - Строка - нужно передать пустую строку и выполнить проверку на ее заполнение после выхода из функции. Если значение
//		будет заполнено - значит возникла ошибка при получении имени источника. Стоит завершить выполнение операции с оповещением
//		пользователя, чтобы не словить баг.
//
// Возвращаемое значение:
//   Строка   - имя колонки в ТЧ, где находится документ источника для исходящего электронного документа
//
&НаСервере
Функция ПолучитьИмяИсточникаДляИсходящихДокументов(ИмяШаблона, МассивЛогаСобытий, ТекстЛогаСобытий = "")

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");	
    Дерево = ОбработкаОбъект.ПолучитьСтруктуруФайлаДанных(ИмяШаблона);
	Если Дерево.Строки.Количество() = 0 Тогда
		ТекстЛогаСобытий = "Запрошенный тип настроек [" + ИмяШаблона + "] не предусмотрен гибкими настройками модуля.
		|Ошибка получения данных дерева конфигурации " + ИмяШаблона;
		Возврат "";
	КонецЕсли;
	Возврат Дерево.Строки.Получить(0).Источник;

КонецФункции // ПолучитьИмяИсточникаДляИсходящихДокументов()

#КонецОбласти

&НаКлиенте
Функция ПолучитьПредставлениеДокумента(ТипДокумента, ВыбраннаяСтрока)
	
	ПредставлениеДокумента = "";
	
	// EDI
	Если ТипДокумента = "ORDRSP"
		ИЛИ ТипДокумента = "DESADV" 
		ИЛИ ТипДокумента = "INVOICE" 
		ИЛИ ТипДокумента = "DESSCC"
		ИЛИ ТипДокумента = "RETINS"
		ИЛИ ТипДокумента = "ORDER"
		ИЛИ ТипДокумента = "ORDERS"
		ИЛИ	ТипДокумента = "RETORD"
		ИЛИ	ТипДокумента = "RECADV"		 
		ИЛИ ТипДокумента = "STATUS" Тогда
		
		Если ВыбраннаяСтрока.Свойство("НомерЗаказа") Тогда
			ПредставлениеДокумента = "по заказу № " + СокрЛП(ВыбраннаяСтрока.НомерЗаказа);	
		КонецЕсли;
		Если ВыбраннаяСтрока.Свойство("ДатаЗаказа") Тогда
			ПредставлениеДокумента = ПредставлениеДокумента + ?(ЗначениеЗаполнено(ПредставлениеДокумента), " ", "по дате заказа ") 
			+ "от " + Формат(ВыбраннаяСтрока.ДатаЗаказа, "ДФ=dd.MM.yy");	
		КонецЕсли;
		
	// ЮЗД 
	ИначеЕсли ТипДокумента = "ЮЗД" 
		ИЛИ Найти(ТипДокумента, "DP_PRANNUL_22") > 0 //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _22] 
		ИЛИ ТипДокумента = "DP_IZVPOL_23"
		ИЛИ ТипДокумента = "DP_UVUTOCH_24"
		ИЛИ ТипДокумента = "DP_REZRUISP" Тогда
		
		Если ВыбраннаяСтрока.Свойство("СЧФ_Номер") Тогда
			ПредставлениеДокумента = "по счет-фактуре № " + СокрЛП(ВыбраннаяСтрока.СЧФ_Номер);	
		КонецЕсли;
		Если ВыбраннаяСтрока.Свойство("СЧФ_Дата") Тогда
			ПредставлениеДокумента = ПредставлениеДокумента + ?(ЗначениеЗаполнено(ПредставлениеДокумента), " ", "по дате счет-фактуры ")
			+ "от " + Формат(ВыбраннаяСтрока.СЧФ_Дата, "ДФ=dd.MM.yy");	
		КонецЕсли;
		
	// ЭТРН 
	ИначеЕсли ТипДокумента = "WHGOV_01_Исходящий" 
		ИЛИ ТипДокумента = "WHGPV_05_Исходящий" 
		ИЛИ ТипДокумента = "WHGOU_04_Исходящий"
		ИЛИ ТипДокумента = "WHGPU_08_Исходящий" Тогда
		
		Если ВыбраннаяСтрока.Свойство("НомерЭТРН") Тогда
			ПредставлениеДокумента = "по ЭТРН № " + СокрЛП(ВыбраннаяСтрока.НомерЭТРН);	
		КонецЕсли;
		Если ВыбраннаяСтрока.Свойство("ДатаЭТРН") Тогда
			ПредставлениеДокумента = ПредставлениеДокумента + ?(ЗначениеЗаполнено(ПредставлениеДокумента), " ", "по дате ЭТРН ") 
			+ "от " + Формат(ВыбраннаяСтрока.ДатаЭТРН, "ДФ=dd.MM.yy");	
		КонецЕсли;

	// CONDRA 
	ИначеЕсли Найти(ТипДокумента, "CONDRA") > 0 Тогда
		
		Если ВыбраннаяСтрока.Свойство("Номер") Тогда
			ПредставлениеДокумента = "по документу № " + СокрЛП(ВыбраннаяСтрока.Номер);	
		КонецЕсли;
		Если ВыбраннаяСтрока.Свойство("Дата") Тогда
			ПредставлениеДокумента = ПредставлениеДокумента + ?(ЗначениеЗаполнено(ПредставлениеДокумента), " ", "по дате документа ") 
			+ "от " + Формат(ВыбраннаяСтрока.Дата, "ДФ=dd.MM.yy");	
		КонецЕсли;

	КонецЕсли;
	
	ПредставлениеДокумента = ТипДокумента + " " + ПредставлениеДокумента;
	ПредставлениеДокумента = СокрЛП(ПредставлениеДокумента);

	Возврат ПредставлениеДокумента;
	
КонецФункции 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ТОРГОВОЙ СЕТИ (ПОКУПАТЕЛЯ)

// DP_UVUTOCH
&НаКлиенте
Процедура ОтправитьУточнение(Команда)
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте(); 
	ДанныеСписка.Вставить("ИмяКнопки", "СписокДляПокупателяОтправитьУточнение");
	СоответствиеКолонок = ПолучитьСтруктуруКолонок("СписокДляПокупателя");
	ОтправитьДокументы(ДанныеСписка, "Статус_УПД", "ДокументЭКОМ_ЮЗД", "DP_UVUTOCH_09", СоответствиеКолонок, Истина); //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _09
    
КонецПроцедуры

// ON_SCHFDOPPOK
&НаКлиенте
Процедура ПодписатьУПД(Команда)
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();   
	ДанныеСписка.Вставить("ИмяКнопки", "СписокДляПокупателяПодписатьУПД");
	СоответствиеКолонок = ПолучитьСтруктуруКолонок("СписокДляПокупателя");
	ОтправитьДокументы(ДанныеСписка, "Статус_УПД", "ДокументЭКОМ_ЮЗД", "ПодписьЮЗД", СоответствиеКолонок, Истина);
    
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтправитьУточнение(Команда)
    // Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбменКвитанциями(Команда)
	
	ИмяСобытия	= "Проверка статусов ЮЗД";
    ТекущаяДата = ТекущаяДата();

	МассивЛогаСобытий = Новый Массив;
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	ОбменКвитанциямиНаКлиенте(ДанныеСписка, МассивЛогаСобытий);
	
	ТекстЛогаСобытий = "Время выполнения " + ЭКОМ_ОбщегоНазначенияКлиент.СекундыВоВремяНаКлиенте(ТекущаяДата() - ТекущаяДата).Строка;
	ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Информация"), ИмяСобытия);
	МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
	
	ОтобразитьЛогСобытий(МассивлогаСобытий);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнитьРегламент(Команда)
    ПодключитьОбработчикОжидания("ОбработчикСообщенийПользователю", 1, Ложь);
    КомандаВыполнитьРегламентНаСервере();
    ОтключитьОбработчикОжидания("ОбработчикСообщенийПользователю");        		  
КонецПроцедуры

&НаСервере
Процедура КомандаВыполнитьРегламентНаСервере()
    
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    ОбработкаОбъект.ВыполнитьКоманду("ДляОбменаЭлектроннымиДокументами");
    
КонецПроцедуры

&НаСервере
Функция ПолучитьСообщенияНаСервере()
    
    Результат = ПолучитьСообщенияПользователю(Истина);
    Возврат Результат;
КонецФункции // ПолучитьСообщенияНаСервере()

&НаКлиенте
Процедура ОбработчикСообщенийПользователю() Экспорт
    #Если Клиент Тогда
        ТекущиеСообщения = ПолучитьСообщенияНаСервере();
        Для каждого Сообщение Из ТекущиеСообщения Цикл
            Сообщение.Сообщить();
        КонецЦикла;
    #КонецЕсли
КонецПроцедуры

&НаСервере
Процедура КомандаОбновитьКоличествоДокументовНаПлатформеНаСервере(ИнфоДатаЗагруженоЗа, ИнфоДокументыНаПлатформе)
    
    МассивЛогаСобытий = Новый Массив;    
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    Инфо = ОбработкаОбъект.Инфо_СведенияОДокументах(ИнфоДатаЗагруженоЗа, МассивЛогаСобытий);
	Если НЕ Инфо = Неопределено Тогда
		
		ИнфоДокументыНаПлатформе.Очистить();
		Если ТипЗнч(Инфо) = Тип("Структура") И Инфо.Свойство("СписокФайлов") Тогда
			СписокФайлов = Инфо.СписокФайлов;
			ИнфоДокументыНаПлатформе.ЗагрузитьЗначения(СписокФайлов);
			ИнфоДокументыНаПлатформе.СортироватьПоЗначению(НаправлениеСортировки.Возр);
		КонецЕсли;
		
		ИнфоДокументыЗагружено = Инфо.ИнфоОбработано;		
	КонецЕсли;
	
	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Вычислить("ЭКОМ_ОбщегоНазначения.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий)");
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьКоличествоДокументовНаПлатформе(Команда)
    КомандаОбновитьКоличествоДокументовНаПлатформеНаСервере(ИнфоДатаЗагруженоЗа, ИнфоДокументыНаПлатформе);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПолучитьСостояниеОбмена(Команда)
    
    ПолучитьСостояниеОбменаНаКлиенте();
    
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСостояниеОбменаНаКлиенте()
    
    Данные = ВернутьРезультатИзМодуляОбъекта("ПолучитьСостояниеОбмена");
    
    ЭтаФорма.СостояниеВыгрузки = Данные.ДатаОтправления; 
    ЭтаФорма.СостояниеЗагрузки = Данные.ДатаПолучения;	
    
    Если Данные.ЧасыОтправления >= 2  Тогда
        Элементы.СостояниеВыгрузки.ЦветФона = WebЦвета.СветлоРозовый;
    Иначе
        Элементы.СостояниеВыгрузки.ЦветФона = WebЦвета.СветлоЗеленый;
    КонецЕсли;
    
    Если Данные.ЧасыПолучения >= 2  Тогда
        Элементы.СостояниеЗагрузки.ЦветФона = WebЦвета.СветлоРозовый;
    Иначе
        Элементы.СостояниеЗагрузки.ЦветФона = WebЦвета.СветлоЗеленый;
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Функция ПолучитьИменаФайлов(МассивСтрок, РазделительПути)
    
    МассивОбработанныхФайлов = Новый Массив;
    Для каждого Стр  Из МассивСтрок Цикл
        
        // Найдем имя файла для архивирования на сервере
        ПоследнийНомерСлеш = 0;			
        ТекстДляПоиска     = Стр.ИмяФайла;
        ПродолжитьПоиск    = Истина;
        Пока ПродолжитьПоиск Цикл
            ОбратныйСлэш = Найти(ТекстДляПоиска, РазделительПути);
            Если ОбратныйСлэш = 0 Тогда
                ПродолжитьПоиск = Ложь;
            Иначе   // в имени файла есть слэш "C:\EDI_ECOM\inbox_bak\ORDER\20190713\order_201907131754_3194898437.xml"
                ПоследнийНомерСлеш = ПоследнийНомерСлеш + ОбратныйСлэш;
                ТекстДляПоиска     = Сред(ТекстДляПоиска, ОбратныйСлэш + 1); 
            КонецЕсли; 						
        КонецЦикла;
        
        ИмяФайла = СокрЛП(Сред(Стр.ИмяФайла, ПоследнийНомерСлеш + 1));
        
        Структура = Новый Структура;
        Структура.Вставить("Имя", ИмяФайла);
        
        МассивОбработанныхФайлов.Добавить(Структура);
        
        // Пометим на удаление ЭКОМ документ
        ДокЭКОМ = Стр.ПолучитьОбъект();
        ДокЭКОМ.Документ1С = Неопределено;
        ДокЭКОМ.ДокументыСвязанные.Очистить();
        ДокЭКОМ.ПометкаУдаления = Истина;
        ДокЭКОМ.Записать(РежимЗаписиДокумента.Запись);
        
    КонецЦикла;
    
    Возврат МассивОбработанныхФайлов;
    
КонецФункции

&НаСервере
Процедура ПометитьЭКОМЗаказНаУдалениеОтправитьВАрхивНаСервере(МассивОбработанныхФайлов, РазделительПути, МассивЛогаСобытий)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭКОМ_GLN.ПрофильОбмена КАК ПрофильОбмена,
	|	ЭКОМ_GLN.Объект КАК Организация
	|ИЗ
	|	РегистрСведений.ЭКОМ_GLN КАК ЭКОМ_GLN
	|ГДЕ
	|	НЕ ЭКОМ_GLN.ПрофильОбмена = ЗНАЧЕНИЕ(Справочник.ЭКОМ_ПрофилиОбмена.ПустаяСсылка)
	|	И НЕ ЭКОМ_GLN.ПрофильОбмена.ПометкаУдаления И ЭКОМ_GLN.ПрофильОбмена.Активный = ИСТИНА
	|ИТОГИ ПО
	|	ПрофильОбмена";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда		
		
		ЗначениеПоУмолчанию = Истина;
		Измерение           = Неопределено; 
		Обязательно         = Ложь;
	
		знИспользоватьАПИ = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_ИспользоватьАПИ"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
		
		ВыборкаПрофильОбмена = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПрофильОбмена.Следующий() Цикл
			ПрофильОбмена = ВыборкаПрофильОбмена.ПрофильОбмена;
			
			// Перместить файлы в архив 
			Если знИспользоватьАПИ = Истина Тогда
				СтруктураМассивов = РазбитьМассивПоЧастям(МассивОбработанныхФайлов);   
				Для Каждого Эл Из СтруктураМассивов Цикл
					ИменаФайлов = Новый Массив;
					Для каждого ЭлИменаФайлов Из Эл.Значение Цикл
						ИменаФайлов.Добавить(ЭлИменаФайлов.Ключ);
					КонецЦикла;
					
					ПараметрыПроцедуры = Новый Массив;
					ПараметрыПроцедуры.Добавить(ПрофильОбмена);
					ПараметрыПроцедуры.Добавить(ИменаФайлов);
					ПараметрыПроцедуры.Добавить(МассивЛогаСобытий);
					
					ВыполнитьПроцедуруИзМодуляОбъекта("API_АрхивироватьДокументы", ПараметрыПроцедуры);		
					
				КонецЦикла;
			Иначе
				МассивИмен = Новый Массив;
				Для Каждого ЭлИмяФайла Из МассивОбработанныхФайлов Цикл		
					МассивИмен.Добавить(ЭлИмяФайла.Имя);
				КонецЦикла;
				
				ПараметрыПроцедуры = Новый Массив;
				ПараметрыПроцедуры.Добавить(ПрофильОбмена);
				ПараметрыПроцедуры.Добавить("Помещаю в архив");
				ПараметрыПроцедуры.Добавить(МассивЛогаСобытий);
				ПараметрыПроцедуры.Добавить(Ложь);
				ВыполнитьПроцедуруИзМодуляОбъекта("FTP_АрхивироватьДокументы", ПараметрыПроцедуры);	
			КонецЕсли;
			
		КонецЦикла; 		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ОсновнойПрофильОбменаНаСервере(Организация, МассивЛогаСобытий)	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    ОбработкаОбъект.ОсновнойПрофильОбмена(Организация, МассивЛогаСобытий);
	
КонецФункции

&НаКлиенте
Процедура КомандаПометитьЭКОМЗаказНаУдалениеОтправитьВАрхив(Команда)
    
    МассивЛогаСобытий = Новый Массив;
       
    ВыделенныеСтроки = Элементы.СписокДляПоставщика.ВыделенныеСтроки;
    МассивСтрок = Новый Массив();
    Для каждого ИдентификаторСтроки_ Из ВыделенныеСтроки Цикл
        Если ЗначениеЗаполнено(Элементы.СписокДляПоставщика.ДанныеСтроки(ИдентификаторСтроки_).ЭКОМ_Документ_ORDER) Тогда
            МассивСтрок.Добавить(Элементы.СписокДляПоставщика.ДанныеСтроки(ИдентификаторСтроки_).ЭКОМ_Документ_ORDER);
        КонецЕсли;	
    КонецЦикла;
	
	ДанныеОС = ЭКОМ_ПолучитьРазделительПутиОСКлиента();
	РазделительПути = ДанныеОС.Получить("РазделительПути");

	МассивОбработанныхФайлов = ПолучитьИменаФайлов(МассивСтрок, РазделительПути);
	Если МассивОбработанныхФайлов.Количество() > 0 Тогда
		
		ПометитьЭКОМЗаказНаУдалениеОтправитьВАрхивНаСервере(МассивОбработанныхФайлов, ДанныеОС, МассивЛогаСобытий);	 		
		
		ЗначениеПоУмолчанию = Неопределено;
		Измерение           = Неопределено; 
		Обязательно         = Истина;
		ЛокальныйКаталогINBOX = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_Локальный_Каталог_INBOX"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
		
		ЗначениеПоУмолчанию = Неопределено;
		Измерение           = Неопределено; 
		Обязательно         = Истина;
		ЛокальныйКаталогINBOX_Архив = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_Локальный_Каталог_INBOX_Архив"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
		
		ПроверитьЛокальныйКаталог(ЛокальныйКаталогINBOX, РазделительПути);
		ПроверитьЛокальныйКаталог(ЛокальныйКаталогINBOX_Архив, РазделительПути);
		
		КаталогСохранения = ЛокальныйКаталогINBOX_Архив + "ORDER" + РазделительПути + Формат(ТекущаяДата(), "ДФ=yyyyMMdd") + РазделительПути; 
		СоздатьКаталог(КаталогСохранения);
		
		// После создания переносим загруженный файл в архив
		Для Каждого ЭлФайл Из МассивОбработанныхФайлов Цикл
			Файл = Новый Файл(ЛокальныйКаталогINBOX + ЭлФайл.Имя);
			Если Файл.Существует() Тогда
				ПереместитьФайл(ЛокальныйКаталогINBOX + ЭлФайл.Имя, КаталогСохранения + ЭлФайл.Имя);	 
			КонецЕсли;			
		КонецЦикла;		
		
		Элементы.СписокДляПоставщика.Обновить();
	КонецЕсли;
	
	ОтобразитьЛогСобытий(МассивЛогаСобытий);

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЛогСобытияВФайл(МассивЛогаСобытий, Каталог)
	
	ТекстСообщения = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий)");  
    Если ЗначениеЗаполнено(ТекстСообщения) 
        И ЗначениеЗаполнено(Каталог) Тогда
		ИмяФайла  = СокрЛП(Каталог) + "ЛогОшибок" + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd-HH-mm") + ".txt";
		ЛогОшибок = новый ТекстовыйДокумент;
		Попытка    
            ЛогОшибок.УстановитьТекст(ТекстСообщения);           
            ЛогОшибок.Записать(ИмяФайла, КодировкаТекста.ANSI);
        Исключение			
        КонецПопытки;		
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьЛогСобытий(МассивЛогаСобытий) Экспорт
	Выполнить("ЭКОМ_ОбщегоНазначения.ЗаписатьЛогСобытийвРегистрЛогирование(МассивЛогаСобытий);");
	СформироватьЛогСобытий();
	МассивЛогаСобытий.Очистить();
КонецПроцедуры

&НаСервере
Процедура СформироватьЛогСобытий(ПоНажатию = Ложь) Экспорт
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ТабДок = ПолеЛогаСобытий;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;

	//Получаем схему из макета
	СхемаКомпоновкиДанных = ОбработкаОбъект.ПолучитьМакет("ОтчетПоЛогамСобытий"); 
	
	//создадим компоновщик настроек и загрузим настройки по умолчанию, вместо настроек по умолчанию можно использовать восстановленные настройки
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Настройки = КомпоновщикНастроек.Настройки;
	
	//установка параметров отчета, без КомпоновщикНастроекКомпоновкиДанных делать это гораздо сложнее
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", НачалоДня(ЭтаФорма.ПериодНачалоЛога));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода" , КонецДня(ЭтаФорма.ПериодКонецЛога));
	Если ЗначениеЗаполнено(ЭтаФорма.ПолеВводаУровнаяЛога) Тогда
	     УровеньЛогирования = ЭтаФорма.ПолеВводаУровнаяЛога;
	Иначе	
	     УровеньЛогирования = Неопределено;
	КонецЕсли;
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("УровеньЛогирования" , УровеньЛогирования);
		
	//Помещаем в переменную данные о расшифровке данных - здесь ненужный пункт, но пусть будет.
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки,,);
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	////Очищаем поле табличного документа
	ТабДок.Очистить();
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабДок);	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Если ПоНажатию = Ложь
		И ТабДок.ВысотаТаблицы > 1  Тогда
		Элементы.ПодвалСтраницы.ПодчиненныеЭлементы.ГруппаПолеЛогаСобытий.Заголовок = " События (есть непрочитанные)";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбменНаСервере_DP_IZVPOL_05(Команда)
    
    МассивЛогаСобытий = Новый Массив;        
	ОтправитьФайлыНаСервереСПодписьюБезКонтекста(ЭтаФорма.ОбработкаТип, Новый Массив, "DP_IZVPOL_05", МассивЛогаСобытий, Ложь);	
    ОтобразитьЛогСобытий(МассивЛогаСобытий);
    
КонецПроцедуры

&НаКлиенте
Процедура ОбменНаСервере_DP_IZVPOL_06(Команда)
    	
	МассивЛогаСобытий = Новый Массив;      
	ОтправитьФайлыНаСервереСПодписьюБезКонтекста(ЭтаФорма.ОбработкаТип, Новый Массив, "DP_IZVPOL_06", МассивЛогаСобытий, Ложь);
    ОтобразитьЛогСобытий(МассивЛогаСобытий);
  
КонецПроцедуры

&НаКлиенте
Процедура ОбменНаСервере_DP_IZVPOL_08(Команда)
    
	МассивЛогаСобытий = Новый Массив;	
	ОтправитьФайлыНаСервереСПодписьюБезКонтекста(ЭтаФорма.ОбработкаТип, Новый Массив, "DP_IZVPOL_08", МассивЛогаСобытий, Ложь);	
	ОтобразитьЛогСобытий(МассивЛогаСобытий);

КонецПроцедуры

&НаКлиенте
Процедура ОбменНаСервере_DP_IZVPOL_10(Команда)
	
	СтруктураЛога = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьСтруктуруЛогаНаКлиенте()");
	
    ПараметрыПроцедуры = Новый Массив;
    ПараметрыПроцедуры.Добавить("DP_IZVPOL_10");
	ПараметрыПроцедуры.Добавить(Ложь);
	ПараметрыПроцедуры.Добавить(СтруктураЛога);
    ВыполнитьПроцедуруИзМодуляОбъекта("ПроверитьНаличиеФайловНаСервере", ПараметрыПроцедуры);
   
    СформироватьЛогСобытий();
    
КонецПроцедуры

&НаКлиенте
Процедура ОбменНаСервере_DP_PDOTPR(Команда)
    
    СтруктураЛога = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьСтруктуруЛогаНаКлиенте()");
	
    ПараметрыПроцедуры = Новый Массив;
    ПараметрыПроцедуры.Добавить("DP_PDOTPR");
	ПараметрыПроцедуры.Добавить(Ложь);
	ПараметрыПроцедуры.Добавить(СтруктураЛога);
    ВыполнитьПроцедуруИзМодуляОбъекта("ПроверитьНаличиеФайловНаСервере", ПараметрыПроцедуры);
   
    СформироватьЛогСобытий();
    
КонецПроцедуры

&НаКлиенте
Процедура ОбменНаСервере_DP_UVUTOCH_09(Команда)
    
   	МассивЛогаСобытий = Новый Массив;	
	ОтправитьФайлыНаСервереСПодписьюБезКонтекста(ЭтаФорма.ОбработкаТип, Новый Массив, "DP_UVUTOCH_09", МассивЛогаСобытий, Ложь); //Docrobot 1.19.0 MOD-1377 [Добавлен номер квитанции _09]
	ОтобразитьЛогСобытий(МассивЛогаСобытий);

КонецПроцедуры

&НаКлиенте
Процедура ОбменНаСервере_ON_SCHFDOPPOK_11(Команда)
    	
	МассивЛогаСобытий = Новый Массив;	
	ОтправитьФайлыНаСервереСПодписьюБезКонтекста(ЭтаФорма.ОбработкаТип, Новый Массив, "ПодписьЮЗД", МассивЛогаСобытий, Ложь);	
	ОтобразитьЛогСобытий(МассивЛогаСобытий);

КонецПроцедуры

Функция ПолучитьЭлементОтбораПоИдПользНастройки(ИдНастройки = "ОтборПоКонтрагентуНаФорме", ОбъектОтборовНаФорме, УдалитьНайденный = Ложь)
    ВсеЭлементыОтбора = ОбъектОтборовНаФорме.Отбор.Элементы;
    Результат = Неопределено;
    
    Для каждого текЭлементОтбора Из ВсеЭлементыОтбора Цикл
        Если текЭлементОтбора.ИдентификаторПользовательскойНастройки = ИдНастройки Тогда
            Если УдалитьНайденный = Истина Тогда
                ВсеЭлементыОтбора.Удалить(текЭлементОтбора);
            Иначе
                Результат = текЭлементОтбора;
            КонецЕсли;
            Прервать;
        КонецЕсли;
    КонецЦикла;
    
    Возврат Результат;
КонецФункции

&НаКлиенте
Процедура КомандаОтчетПоЗагруженнымЗаказам(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипМакета", "ОтчетПоСетям");
	ОткрытьФорму(ПолноеИмяОбработки + ".Форма.УФ_ФормаОтчета", ПараметрыФормы,,,,,);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтчетПоДокументуЭКОМ(Команда)
	
	Если Элементы.СписокДляПоставщика.ТекущиеДанные = Неопределено Тогда
		Сообщить("Выберите строку в табличной части!");
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("Регистратор", Элементы.СписокДляПоставщика.ТекущиеДанные.ЭКОМ_Документ_ORDER);
	СтруктураПараметров.Вставить("Заказ", Элементы.СписокДляПоставщика.ТекущиеДанные.ДокументЗаказа);
	СтруктураПараметров.Вставить("Накладная", Элементы.СписокДляПоставщика.ТекущиеДанные.ДокументРеализации);
	СтруктураПараметров.Вставить("Заголовок"  , Заголовок);
	
	ТабДок = Новый ТабличныйДокумент();
	
	ЗаполнитьТабличныйДокументОтчетПоставщикНаСервере(СтруктураПараметров,ТабДок);
	
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныйДокументОтчетПоставщикНаСервере(СтруктураПараметров,ТабДок)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
	//Получаем схему из макета
	СхемаКомпоновкиДанных = ОбработкаОбъект.ПолучитьМакет("ОтчетПоставщик");
		
	//создадим компоновщик настроек и загрузим настройки по умолчанию, вместо настроек по умолчанию можно использовать восстановленные настройки
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Настройки = КомпоновщикНастроек.Настройки;
	
	//установка параметров отчета, без КомпоновщикНастроекКомпоновкиДанных делать это гораздо сложнее
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Регистратор", СтруктураПараметров.Регистратор);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Заказ", СтруктураПараметров.Заказ);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Накладная", СтруктураПараметров.Накладная);
	Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок"  , СтруктураПараметров.Заголовок);
	
	//Помещаем в переменную данные о расшифровке данных - здесь ненужный пункт, но пусть будет.
	ДанныеРасшифровки = Вычислить("Новый ДанныеРасшифровкиКомпоновкиДанных");
	
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Вычислить("Новый КомпоновщикМакетаКомпоновкиДанных");
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Вычислить("Новый ПроцессорКомпоновкиДанных");
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	//Очищаем поле табличного документа
	ПроцессорВывода = Вычислить("Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент");
	ПроцессорВывода.УстановитьДокумент(ТабДок);	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	
КонецПроцедуры

&НаКлиенте
Функция ТекущаяСтрокаАктивногоСписка()
    
    ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
    Результат = Элементы[ДанныеСписка.ИмяСписка].ТекущаяСтрока;
    
    Возврат Результат;
КонецФункции

&НаКлиенте
Процедура УстановитьТекущуюСтрокуАктивногоСписка(НомерСтроки)
    Если ТипЗнч(НомерСтроки) <> Тип("Число") Тогда
        Возврат;
    КонецЕсли;
    
    ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
    АктивныйСписок = Элементы[ДанныеСписка.ИмяСписка];
    
    Попытка
	    АктивныйСписок.ТекущаяСтрока = НомерСтроки;
    Исключение
        //нет такой строки
    КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаголовокКнопки(ИмяКнопки)
    Кнопка = Элементы[ИмяКнопки];
    Возврат ?(ЗначениеЗаполнено(Кнопка.Заголовок), Кнопка.Заголовок, Команды[Кнопка.ИмяКоманды].Заголовок);
КонецФункции

Функция ЦветКнопкиФильтра(флВкл = Истина)
    
    Если флВкл = Истина Тогда
        Результат = Новый Цвет(220, 220, 220);//WebЦвета.Индиго;    
    Иначе
        Результат = WebЦвета.Белый;
    КонецЕсли;
    
    //Новый Цвет();  //цвет по-умолчанию
    
    Возврат	Результат;
КонецФункции

Функция ВидСравненияКратко(ВидСравненияДляОписания)
    
    Если      Строка(ВидСравненияДляОписания) = "Больше"           Тогда Результат = ">"
    ИначеЕсли Строка(ВидСравненияДляОписания) = "Больше или равно" Тогда Результат = ">="
    ИначеЕсли Строка(ВидСравненияДляОписания) = "Меньше"           Тогда Результат = "<"
    ИначеЕсли Строка(ВидСравненияДляОписания) = "Меньше или равно" Тогда Результат = "<="
    ИначеЕсли Строка(ВидСравненияДляОписания) = "Не равно"         Тогда Результат = "<>"
    ИначеЕсли Строка(ВидСравненияДляОписания) = "Равно"            Тогда Результат = "="
    Иначе Результат = Строка(ВидСравненияДляОписания)
    КонецЕсли;
    
    Возврат Результат;    
КонецФункции

&НаСервере
Функция ОписатьЭлементКоллекции(ЭлементКоллекции, флТолькоАктивные = Истина, ТипЭлементаСтрокой = "ЭлементОтбораКомпоновкиДанных")
    Результат = "";
    
    Если ТипЗнч(ЭлементКоллекции) = Тип(ТипЭлементаСтрокой) Тогда
        
        Если флТолькоАктивные = Истина
            И НЕ ЭлементКоллекции.Использование 
            Тогда
            Возврат "";
        КонецЕсли;
        
        Результат = Строка(ЭлементКоллекции.ЛевоеЗначение) + " " + ВидСравненияКратко(ЭлементКоллекции.ВидСравнения) + " " + Строка(ЭлементКоллекции.ПравоеЗначение);
    КонецЕсли;
    
    Возврат Результат;
КонецФункции

&НаСервере
Функция ОписатьКоллекциюЭлементовОтбора(Коллекция, флТолькоАктивные = Истина)
    
    Результат = "";
    Для каждого ЭлементКоллекции Из Коллекция Цикл
        ОписаниеЭлементаНастройки = ОписатьЭлементКоллекции(ЭлементКоллекции);
        Результат = Результат + ?(Результат = "", ОписаниеЭлементаНастройки, ", " + ОписаниеЭлементаНастройки); 
    КонецЦикла;
    
    Возврат Результат;
КонецФункции

&НаСервере
Функция ОписатьАктивныеЭлементыНастройки(ЭлементНастройки,флТолькоАктивные = Истина, Знач ТипЭлементаСтрокой = "ОтборКомпоновкиДанных")
    Результат = "";
    КоллекцияЭлементов = ЭлементНастройки.Элементы;
    
    Для каждого ЭлементКоллекции Из КоллекцияЭлементов Цикл
        Если ТипЗнч(ЭлементКоллекции) = Тип("ЭлементОтбораКомпоновкиДанных") Или ТипЗнч(ЭлементКоллекции) = Тип("ОтборКомпоновкиДанных") Тогда
        Иначе
            Продолжить;
        КонецЕсли;
        
        Если ТипЗнч(КоллекцияЭлементов) = Тип("КоллекцияЭлементовПользовательскихНастроекКомпоновкиДанных")  Тогда 
            
            ОписаниеЭлементаНастройки = ОписатьКоллекциюЭлементовОтбора(ЭлементКоллекции.Элементы);
            Результат = Результат + ?(Результат = "", ОписаниеЭлементаНастройки, ", " + ОписаниеЭлементаНастройки); 
            
        Иначе
            
            ОписаниеЭлементаНастройки = ОписатьЭлементКоллекции(ЭлементКоллекции);
            Результат = Результат + ?(Результат = "", ОписаниеЭлементаНастройки, ", " + ОписаниеЭлементаНастройки); 
            
        КонецЕсли;
        
        ОписаниеЭлемента = Неопределено;
        
    КонецЦикла;
    
    КоллекцияЭлементов = Неопределено;
    Возврат Результат;
КонецФункции

&НаКлиенте
Процедура КомандаОбновитьСостоянияОбменов(Команда)
    КомандаПолучитьСостояниеОбмена(Команда);
    КомандаОбновитьКоличествоДокументовНаПлатформе(Команда);
КонецПроцедуры

&НаКлиенте
Процедура КомандаНастройкаСоответствий(Команда)
    
    КлючУникальностиФормы = "ЭКОМ_НастройкиОсновные";
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("НеЗапрашиватьПароль", 						Истина);
	ПараметрыФормы.Вставить("ЭКОМОбъектыАктуальны", 					ЭтаФорма.ЭКОМОбъектыАктуальны);
	ПараметрыФормы.Вставить("ДополнительнаяОбработкаСсылка",			ЭтаФорма.ОбъектСсылка);
	ПараметрыФормы.Вставить("РежимИспользования", 						РежимИспользования);
	ПараметрыФормы.Вставить("ИспользуемоеИмяФайла", 	ЭтаФорма.ИспользуемоеИмяФайла);

	
    ФормаНастроек = ОткрытьФорму(ПолноеИмяОбработки + ".Форма.УФ_ФормаНастройкиОсновные", ПараметрыФормы, ЭтаФорма, КлючУникальностиФормы); 
    ФормаНастроек.Активизировать();
    ФормаНастроек.Элементы.ГруппаПанельНастроек.ТекущаяСтраница = ФормаНастроек.Элементы.ГруппаПанельНастроек.ПодчиненныеЭлементы.ГруппаНастройкаСоответсвий;
    
КонецПроцедуры

&НаКлиенте
Процедура КомандаСкорректироватьДокументыПоступления(Команда)
    
    ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();  
    МассивЛогаСобытий = Новый Массив; 
       
    ВыделенныеСтроки = Элементы[ДанныеСписка.ИмяСписка].ВыделенныеСтроки;
    
    МассивДокументов = Новый Массив;
    Для каждого ИдентификаторСтроки_ Из ВыделенныеСтроки Цикл
        
        ВыбраннаяСтрока  = Элементы[ДанныеСписка.ИмяСписка].ДанныеСтроки(ИдентификаторСтроки_);
        
        Если ЗначениеЗаполнено(ВыбраннаяСтрока.ДокументЭКОМ_ЮЗД) Тогда
            
            МассивДокументов.Добавить(ВыбраннаяСтрока.ДокументЭКОМ_ЮЗД);
            
        КонецЕсли;	
    КонецЦикла;
    
    // Скорректировать документы
    Если МассивДокументов.Количество() > 0 Тогда		
		ПараметрыАлгоритма = Новый Структура;
		ПараметрыАлгоритма.Вставить("МассивДокументов",  МассивДокументов);
		ИмяАлгоритма = "СкорректироватьДокументыПоступления";

		ВыполнитьПроцедуруИзМодуляОбъектаСтруктура(ИмяАлгоритма, ПараметрыАлгоритма, МассивЛогаСобытий);
		
		ОбновитьДинамическийСписок(ДанныеСписка);				
    Иначе
        ТекстЛогаСобытий = "Нет документов поступления для корректировки!";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Предупреждение"), "Скорректировать поступление");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		
    КонецЕсли;
    
    ОтобразитьЛогСобытий(МассивЛогаСобытий);
    
КонецПроцедуры

Процедура ОтборДинамическогоСписка(Источник = "СписокДляПоставщика", ИмяПоля =  "Пометка", ЗначениеПоля = Истина, Очищать = Истина)
    ОтборДС = ЭтаФорма[Источник].Отбор;
    Если Очищать = Истина Тогда
        ОтборДС.Элементы.Очистить();
    КонецЕсли;
    
    Если ИмяПоля = Неопределено И ЗначениеПоля = Неопределено Тогда
        ОтборДС.Элементы.Очистить();
        Возврат;
    КонецЕсли;
    
    
    ЭлОтбора = ОтборДС.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    
    ЭлОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Пометка");
    ЭлОтбора.ПравоеЗначение = ЗначениеПоля;
    ЭлОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
    
КонецПроцедуры

Функция ДинамическийСписок_в_ТЗ(Источник)
    
    //Получаем схема компановки данных (здесь хранится текст запроса)
    Схема = Элементы[Источник].ПолучитьИсполняемуюСхемуКомпоновкиДанных();
    
    //Получаем настройки пользователя (отборы, сортировки и т.п.)
    Настройки = Элементы[Источник].ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
    
    //Выводим динамический список в таблицу значений
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
    
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    
    Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
    
    Возврат Результат;
КонецФункции	

&НаСервере
Функция ПолучитьКоличествоСтрокВДинамичесокмСписке(ИмяСписка)
    
    ТЗ = ДинамическийСписок_в_ТЗ(ИмяСписка);
    
    Возврат ТЗ.Количество();
	
КонецФункции

&НаСервере
Функция ПолучитьМассивВсехДокументовДС(ИмяСписка)
    
    ТЗ = ДинамическийСписок_в_ТЗ(ИмяСписка);
    
    Возврат ТЗ.ВыгрузитьКолонку("ДокументыВсе");
	
КонецФункции

&НаКлиенте
Процедура УправлениеПометкамиДинамическогоСписка(Пометка, ДанныеСписка = Неопределено)
	
	Если ДанныеСписка = Неопределено Тогда
	     ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	КонецЕсли;
	
	СписокВыбранныхСтрок.Очистить();
	Элементы[ДанныеСписка.ИмяСписка].ВыделенныеСтроки.Очистить();
    ЕстьПометкаНаФорме = НЕ Элементы.Найти(ДанныеСписка.ИмяСписка + "Пометка") = Неопределено;
	
	Если Пометка = Истина 
		ИЛИ ЕстьПометкаНаФорме = Истина Тогда
		КоличествоСтрок = ПолучитьКоличествоСтрокВДинамичесокмСписке(ДанныеСписка.ИмяСписка);
		Для Индекс = 1 По КоличествоСтрок Цикл
			Элементы[ДанныеСписка.ИмяСписка].ВыделенныеСтроки.Добавить(Индекс);			
		КонецЦикла;
	КонецЕсли;

	// Если на форме добавлена колонка пометка
	Если ЕстьПометкаНаФорме = Истина Тогда
				
		Если Пометка Тогда
			МассивДляПометки = ПолучитьМассивВсехДокументовДС(ДанныеСписка.ИмяСписка);
			СписокВыбранныхСтрок.Очистить();
			СписокВыбранныхСтрок.ЗагрузитьЗначения(МассивДляПометки);
		Иначе
			СписокВыбранныхСтрок.Очистить();
		КонецЕсли;

		УстановитьПараметрДинамическогоСписка(ДанныеСписка.ИмяРеквизитаТаблицы, "масПомеченныхДоков", СписокВыбранныхСтрок.ВыгрузитьЗначения());
    		
	КонецЕсли;
	
	Если НЕ Элементы[ДанныеСписка.ИмяСписка].ТекущаяСтрока = Неопределено Тогда
		Элементы[ДанныеСписка.ИмяСписка].ВыделенныеСтроки.Добавить(Элементы[ДанныеСписка.ИмяСписка].ТекущаяСтрока);
	КонецЕсли;
		    
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометку(ДокументСтрока)
	ЭлементСпискаЗначений = СписокВыбранныхСтрок.НайтиПоЗначению(ДокументСтрока);
	Если Не ЭлементСпискаЗначений = Неопределено Тогда
		СписокВыбранныхСтрок.Удалить(ЭлементСпискаЗначений);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоставитьПометку(ДокументСтрока)
	ЭлементСпискаЗначений = СписокВыбранныхСтрок.НайтиПоЗначению(ДокументСтрока);
	Если ЭлементСпискаЗначений = Неопределено И Не ДокументСтрока = Неопределено Тогда
		СписокВыбранныхСтрок.Добавить(ДокументСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПометкиСписокДляПоставщикаУстановитьВсе(Команда)
    УправлениеПометкамиДинамическогоСписка(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПометкиСписокДляПоставщикаСнятьВсе(Команда)
	УправлениеПометкамиДинамическогоСписка(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПометкиСписокДляПокупателяСнятьВсе(Команда)
	УправлениеПометкамиДинамическогоСписка(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПометкиСписокДляПокупателяУстановитьВсе(Команда)
	УправлениеПометкамиДинамическогоСписка(Истина);
КонецПроцедуры

//подробное описание вида документа на человеческом языке
&НаСервереБезКонтекста
Функция ПредставлениеВидаЭКОМ_Документа(ЭКОМ_Документ) Экспорт
    
    Если ТипЗнч(ЭКОМ_Документ) <> Тип("ДокументСсылка.ЭКОМ_Документы") Тогда
        Возврат "";
    КонецЕсли;
    
    ВидДокумента = ЭКОМ_Документ.ВидДокумента;
    Возврат Строка(ВидДокумента);
    //если нужно представление отличное от представления в перечислении - уберите вышестоящую строку
    
    Результат = "";
    Если ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ORDER_Входящий Тогда
        Результат = "Заказ покупателя входящий (ORDER)";
    ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ORDER_Исходящий Тогда
        Результат = "Заказ покупателя исходящий (ORDER)";
    ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ORDRSP_Исходящий Тогда
        Результат = "Подтв. заказа покупателя исходящее (ORDERSP)";
    ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ORDRSP_Входящий Тогда
        Результат = "Подтв. заказа покупателя входящее (ORDERSP)";
    ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DESADV_Исходящий Тогда
        Результат = "Уведомление об отгрузке исходящее (DESADV)";
    ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DESADV_Входящий Тогда
        Результат = "Уведомление об отгрузке входящее (DESADV)";
    ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.RECADV_Исходящий Тогда
        Результат = "Уведомление о приемке исходящее (RECADV)";
    ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.RECADV_Входящий Тогда
        Результат = "Уведомление о приемке входящее (RECADV)";
    ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.RETANN_Исходящий Тогда
        Результат = "Уведомление о возврате исходящее (RETANN)";
    ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.RETANN_Входящий Тогда
        Результат = "Уведомление о возврате входящее (RETANN)";
    ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.RETINS_Исходящий Тогда
        Результат = "Инструкция о возврате исходящая (RETINS)";
    ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.RETINS_Входящий Тогда
        Результат = "Инструкция о возврате входящая (RETINS)";
    ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.INVOICE Тогда
        Результат = "Счет (INVOICE)";
    ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DP_OTORG2 Тогда
        Результат = "Подтверждение получения (DP_OTORG2)";
    ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DESSCC_Исходящий Тогда
        Результат = "Уведомление об отгрузке для РЦ исходящее (DESSCC)";
    ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.DESSCC_Входящий Тогда
        Результат = "Уведомление об отгрузке для РЦ входящее (DESSCC)";
        
    ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPR_01 Тогда
        Результат = "УПД/Счет-фактура новый формат (ON_NSCHFDOPPR_01)";
    ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPR_01_Испр Тогда
        Результат = "Исправление УПД/Счет-фактуры новый формат (ON_NSCHFDOPPR_01)";
    ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPOK_11 Тогда
        Результат = "УПД/Счет-фактура (инфо покупателя) новый формат (ON_NSCHFDOPPOK_11)";
	ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPOKMARK_11 Тогда
        Результат = "Маркировка УПД/Счет-фактура (инфо покупателя) новый формат (ON_NSCHFDOPPOKMARK_11)";
	ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_NSCHFDOPPOKPROS_11 Тогда
        Результат = "Прослеживаемость УПД/Счет-фактура (инфо покупателя) новый формат (ON_NSCHFDOPPOKPROS_11)";
    ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_SCHFDOPPR_01 Тогда
        Результат = "УПД/Счет-фактура (ON_SCHFDOPPR_01)";
        
    ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_SCHFDOPPR_01_Испр Тогда
        Результат = "Исправление УПД/Счет-фактуры (ON_SCHFDOPPR_01_Испр)";
    ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_KORSCHFDOPPR_01 Тогда
        Результат = "УКД Корректировочная счет-фактура (ON_KORSCHFDOPPR_01)";
    ИначеЕсли ВидДокумента = Перечисления.ЭКОМ_ВидыДокументов.ON_KORSCHFDOPPR_01_Испр Тогда
        Результат = "УКД Корректировочная исправленная счет-фактура (ON_KORSCHFDOPPR_01_Испр)";
        
    Иначе
        Результат = Строка(ВидДокумента);
    КонецЕсли;		
    
    Возврат Результат;
КонецФункции
//ТВС: КонецИзменений

&НаКлиенте
Процедура КомандаОбработатьПовторно(Команда)
	
	МассивЛогаСобытий = Новый Массив;
    ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();  
	
	ПоляИсточникаДанных = ПоляДокументовТЧ(ДанныеСписка.ИмяСписка);
	ПозицияТекущейСтроки = Неопределено;
	МассивСтрок = ПолучитьСтрокиДинамическогоСпискаДляОбработки(ДанныеСписка, ПозицияТекущейСтроки);
	ВыбранныеСтроки = ДокументыПоСтрокеВСтруктуруНаКлиенте(МассивСтрок, ПоляИсточникаДанных, Ложь, Ложь);
	
    МассивДокументов = Новый Массив;
    Для каждого ВыбраннаяСтрока Из ВыбранныеСтроки Цикл
        Если ЗначениеЗаполнено(ВыбраннаяСтрока.ДокументЭКОМ_ЮЗД) Тогда           
            МассивДокументов.Добавить(ВыбраннаяСтрока.ДокументЭКОМ_ЮЗД);            
        КонецЕсли;	
    КонецЦикла;
    
    // Скорректировать документы
    Если МассивДокументов.Количество() > 0 Тогда       		
		ПараметрыАлгоритма = Новый Структура;
		ПараметрыАлгоритма.Вставить("МассивДокументов", МассивДокументов);
		ИмяАлгоритма = "ОбработатьПовторно";
			
		ВыполнитьПроцедуруИзМодуляОбъектаСтруктура(ИмяАлгоритма, ПараметрыАлгоритма, МассивЛогаСобытий);	
		    
        ОбновитьДинамическийСписок(ДанныеСписка);
        ОбновитьЦепочкуДокументовНаКлиенте(ДанныеСписка.ИмяСписка);
        ОбновитьКвитанцииНаКлиенте(ДанныеСписка.ИмяСписка);

    Иначе
        ТекстЛогаСобытий = "Нет счет-фактур для обработки!";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Информация"), "Обработать повторно");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		
    КонецЕсли;
    
    ОтобразитьЛогСобытий(МассивЛогаСобытий);
    
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТекущееЗначениеТаблицыФормы() 
	Если НЕ Элементы.ТаблицаЦепочкаДокументов.ТекущиеДанные = Неопределено Тогда
		Результат = Элементы.ТаблицаЦепочкаДокументов.ТекущиеДанные.Документ;
	Иначе	
		Результат = Неопределено;
	КонецЕсли;

    Возврат Результат;	
	
КонецФункции

&НаСервере
Процедура ПровестиДокументНаСервере(ДокументДляОбработки)	
	Если НЕ ТипЗнч(ДокументДляОбработки) = Тип("ДокументСсылка.ЭКОМ_Документы") Тогда
		 ДокументОбъект = ДокументДляОбработки.ПолучитьОбъект();
	     ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)
    ДокументДляОбработки = ПолучитьТекущееЗначениеТаблицыФормы();
    Если ДокументДляОбработки = Неопределено Тогда
        Возврат;
    КонецЕсли;
    ПровестиДокументНаСервере(ДокументДляОбработки);
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
    ОбновитьЦепочкуДокументовНаКлиенте(ДанныеСписка.ИмяСписка);
КонецПроцедуры

&НаСервере
Процедура ОтменитьПроведениеДокументаНаСервере(ДокументДляОбработки)	
	Если НЕ ТипЗнч(ДокументДляОбработки) = Тип("ДокументСсылка.ЭКОМ_Документы") Тогда
		ДокументОбъект = ДокументДляОбработки.ПолучитьОбъект();
		ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПроведениеДокумента(Команда)
    ДокументДляОбработки = ПолучитьТекущееЗначениеТаблицыФормы();
    Если ДокументДляОбработки = Неопределено Тогда
        Возврат;
    КонецЕсли;
    ОтменитьПроведениеДокументаНаСервере(ДокументДляОбработки);
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
    ОбновитьЦепочкуДокументовНаКлиенте(ДанныеСписка.ИмяСписка);
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЭКОМ(Знач ТекстСообщения = "", Знач Пояснение = "Docrobot", Знач Прогресс = Неопределено)
    Состояние(ТекстСообщения, Прогресс, Пояснение, БиблиотекаКартинок.ЭКОМ_ОбщаяКартинка);
КонецПроцедуры

&НаКлиенте
Процедура СостояниеСохранение(Знач ТекстСообщения = "", Знач Пояснение = "Docrobot", Знач Прогресс = Неопределено)
    Состояние(ТекстСообщения,Прогресс, Пояснение, БиблиотекаКартинок.ЭКОМ_Сохранить);
КонецПроцедуры

&НаКлиенте
Процедура ЛоготипНажатие(Элемент)
    ЗапуститьПриложение("https://www.docrobot.ru/");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьОбъектыЭКОМ(ОбработкаТип)
	Если НЕ ЗначениеЗаполнено(ОбработкаТип) Тогда
	     Возврат Неопределено;     
	КонецЕсли;
    ОбработкаОбъект = Новый (ЗначениеИзСтрокиВнутр(ОбработкаТип));
   	Возврат ОбработкаОбъект.ПроверкаНаличияОбъектовЭКОМ();
КонецФункции

&НаСервереБезКонтекста
Функция НастройкаПрочитатьОбщийМодуль(ИмяНастройки, ЗначениеПоУмолчанию, Измерение, Обязательно)
	Результат = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(ИмяНастройки, ЗначениеПоУмолчанию, Измерение, Обязательно)");	
   	Возврат Результат;
КонецФункции

&НаКлиенте
Функция УстановкаОбъектовКонфигурацииЭКОМ(МассивЛогаСобытий)
	
	СписокКонопок = Новый СписокЗначений;
	СписокКонопок.Добавить("СкачатьОбновление", "Скачать обновление");
	СписокКонопок.Добавить("Отмена", "Отмена");

	Данные = Новый Структура;
	Данные.Вставить("Действие"            , "Обновление");
	Данные.Вставить("ЭКОМОбъектыАктуальны", ЭтаФорма.ЭКОМОбъектыАктуальны);
	
	УстановленыВсеОбъектыЭКОМ = Ложь;
	
	СписокОтсутствующихОбъектов = "";
	Если ЭтаФорма.ЭКОМОбъектыАктуальны = Ложь Тогда	
		ДанныеОС        = ЭКОМ_ПолучитьРазделительПутиОСКлиента();
		Диск            = ДанныеОС.Получить("Диск");
		РазделительПути = ДанныеОС.Получить("РазделительПути");	
		ЛокальныйКаталогUPDATE = ОпределитьКаталогПоУмолчанию(Диск, РазделительПути);
	    ЭКОМ_СоздатьКаталог(ЛокальныйКаталогUPDATE, ДанныеОС);
 
	Иначе
		ЗначениеПоУмолчанию = Неопределено;
		Измерение           = Неопределено; 
		Обязательно         = Истина;
		ЛокальныйКаталогUPDATE = НастройкаПрочитатьОбщийМодуль("ЭКОМ_Локальный_Каталог_UPDATE", ЗначениеПоУмолчанию, Измерение, Обязательно);
		
		ЗначениеПоУмолчанию = Ложь;
		Измерение           = Неопределено; 
		Обязательно         = Ложь;
		ЭКОМ_Автообновление = НастройкаПрочитатьОбщийМодуль("ЭКОМ_Автообновление", ЗначениеПоУмолчанию, Измерение, Обязательно);
		НеобходимоОбновление =  Ложь;
		Если ЭКОМ_Автообновление = Истина Тогда		
			
			Результат = ПроверитьОбновлениеНаКлиенте(ЭтаФорма.ЭКОМОбъектыАктуальны, ЛокальныйКаталогUPDATE, МассивЛогаСобытий);
			НеобходимоОбновление	= Результат.НеобходимоОбновление;
			
			Если НеобходимоОбновление Тогда
				
				Данные.Вставить("ВерсияМодуля"   , Результат.ВерсияМодуля);	
				Данные.Вставить("ДатаОбработки"  , Результат.ДатаОбработки);	
				Данные.Вставить("Описание"       , Результат.Описание);	
				Данные.Вставить("СтатусОбработки", ?(Результат.Свойство("СтатусОбработки"), Результат.СтатусОбработки, ""));	      
				
			КонецЕсли;		
		КонецЕсли;
		
		ОтсутствующиеОбъекты = ЕстьОбъектыЭКОМ(ЭтаФорма.ОбработкаТип);
		УстановленыВсеОбъектыЭКОМ = (ОтсутствующиеОбъекты.Количество() = 0);
		Для каждого Стр Из ОтсутствующиеОбъекты Цикл
			СписокОтсутствующихОбъектов = СписокОтсутствующихОбъектов + ?(ЗначениеЗаполнено(СписокОтсутствующихОбъектов), Символы.ПС, "") + Стр.Ключ;
		КонецЦикла;
        
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СписокОтсутствующихОбъектов) Тогда		
		ТекстЛогаСобытий = СписокОтсутствующихОбъектов;
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), "Проверка объектов конфигурации");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЛокальныйКаталогUPDATE) = Истина Тогда
		КаталогUpdateФС = Новый Файл(ЛокальныйКаталогUPDATE);
		Если КаталогUpdateФС.Существует() 
			И УстановленыВсеОбъектыЭКОМ = Истина Тогда 
			СписокКонопок.Добавить("ОткрытьПредВерсию", "Открыть пред. версию обработки");
			СписокКонопок.Добавить("ОткрытьКаталог", "Открыть папку с обновлениями");
		КонецЕсли;
	КонецЕсли;

	Данные.Вставить("ЛокальныйКаталогUPDATE", ЛокальныйКаталогUPDATE);
	Данные.Вставить("МассивЛогаСобытий"            , МассивЛогаСобытий);
	Если УстановленыВсеОбъектыЭКОМ = Ложь Тогда	       
        Оповещение = Новый ОписаниеОповещения("УстановкаОбъектовКонфигурацииЭКОМ_Завершение", ЭтаФорма, Данные);
        ПоказатьВопрос(Оповещение, "Необходимо обновить объекты конфигурации.", СписокКонопок, , , "Требуется обновление.");
		
	ИначеЕсли ЭтаФорма.ЭКОМОбъектыАктуальны = Ложь Тогда
		Оповещение = Новый ОписаниеОповещения("УстановкаОбъектовКонфигурацииЭКОМ_Завершение", ЭтаФорма, Данные);
        ПоказатьВопрос(Оповещение, "Доступна новая версия. Обновить?", СписокКонопок, , , "Доступно обновление.");
		
	ИначеЕсли НеобходимоОбновление Тогда
		Оповещение = Новый ОписаниеОповещения("УстановкаОбъектовКонфигурацииЭКОМ_Завершение", ЭтаФорма, Данные);
        ПоказатьВопрос(Оповещение, "Доступна новая версия. Обновить?", СписокКонопок, , , "Доступно обновление.");
			
	КонецЕсли;
    	
	Возврат УстановленыВсеОбъектыЭКОМ;
	
КонецФункции

&НаКлиенте
Процедура УстановкаОбъектовКонфигурацииЭКОМ_Завершение(Ответ, ДополнительныеПараметры) Экспорт
    
	МассивЛогаСобытий = ДополнительныеПараметры.МассивЛогаСобытий;
	
    Если Ответ = "ОткрытьКаталог" Тогда
		
		ЗначениеПоУмолчанию = Неопределено;
		Измерение           = Неопределено; 
		Обязательно         = Истина;
		ЛокальныйКаталог = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_Локальный_Каталог_UPDATE"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
        Если ЛокальныйКаталог = Неопределено Тогда
            Сообщение = Новый СообщениеПользователю;
            Сообщение.Текст = "В настройках не указан каталог для хранения обновлений.";
            Сообщение.Сообщить();
        Иначе
            ЗапуститьПриложение(ЛокальныйКаталог);
        КонецЕсли;
        
    ИначеЕсли Ответ = "ОткрытьПредВерсию" Тогда
        ОткрытьПредыдущуюВерсиюОбработки();
		
	ИначеЕсли Ответ = "СкачатьОбновление" Тогда
		
		Результат = ПроверитьОбновлениеНаКлиенте(ДополнительныеПараметры.ЭКОМОбъектыАктуальны, ДополнительныеПараметры.ЛокальныйКаталогUPDATE, МассивЛогаСобытий);
	
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВерсияМодуля"   , Результат.ВерсияМодуля);	
		ПараметрыФормы.Вставить("ДатаОбработки"  , Результат.ДатаОбработки);	
		ПараметрыФормы.Вставить("Описание"       , Результат.Описание);	
		ПараметрыФормы.Вставить("СтатусОбработки", Результат.СтатусОбработки);
		ПараметрыФормы.Вставить("ЛокальныйКаталогUPDATE", ДополнительныеПараметры.ЛокальныйКаталогUPDATE);
		ПараметрыФормы.Вставить("СтатусОбработки", Результат.СтатусОбработки);
		ПараметрыФормы.Вставить("ЭКОМОбъектыАктуальны", ДополнительныеПараметры.ЭКОМОбъектыАктуальны);
		
		ОткрытьФорму(ПолноеИмяОбработки + ".Форма.УФ_ФормаОбновления", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
    КонецЕсли;	
    
    Если МассивЛогаСобытий.Количество() > 0 Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий)");
        Сообщение.Сообщить();
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Функция ПроверитьОбновлениеНаКлиенте(ЭКОМОбъектыАктуальны, ЛокальныйКаталогUPDATE, МассивЛогаСобытий) 
	
	Результат = Новый Структура;
	Результат.Вставить("ВерсияМодуля"       , "");
	Результат.Вставить("ДатаОбработки"      , "");
	Результат.Вставить("Описание"           , "");
	Результат.Вставить("СтатусОбработки"    , "");
	Результат.Вставить("НеобходимоОбновление", "");
	
	ПараметрыФункции = Новый Структура;
	ПараметрыФункции.Вставить("ЭКОМОбъектыАктуальны", ЭКОМОбъектыАктуальны);
	СтруктураРезультата = ВернутьРезультатИзМодуляОбъектаСтруктура("ПроверитьОбновление", ПараметрыФункции, МассивЛогаСобытий);

	ДанныеОбработки = СтруктураРезультата.ДанныеОбработки;
	
	Если ДанныеОбработки = Неопределено Тогда
		Возврат Новый Структура("НеобходимоОбновление", Ложь);
	КонецЕсли;
	
	Если СтруктураРезультата.ОбновлениеЗагружено = Истина Тогда
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(СтруктураРезультата.ДанныеОбработки.АдресВоВременномХранилище);	
		ПараметрыФормы  = Новый Структура;
		ПараметрыФормы.Вставить("ЭКОМОбъектыАктуальны"  , ЭКОМОбъектыАктуальны);
		ПараметрыФормы.Вставить("ЛокальныйКаталогUPDATE", ЛокальныйКаталогUPDATE); 
		
		ФормаОбновлений = ПолучитьФорму(ЭтаФорма.ПолноеИмяОбработки + ".Форма.УФ_ФормаОбновления", ПараметрыФормы);
		ФормаОбновлений.СохранитьОбновленияНаДиск(ДвоичныеДанныеФайла, СтруктураРезультата.ДанныеОбработки.ФайлОбновленияИмя, ЛокальныйКаталогUPDATE, МассивЛогаСобытий);
	КонецЕсли;
	
	Результат.Вставить("ВерсияМодуля"       , ДанныеОбработки.ВерсияМодуля);
	Результат.Вставить("ДатаОбработки"      , ДанныеОбработки.ДатаОбработки);
	Результат.Вставить("Описание"           , ДанныеОбработки.Описание);
	Результат.Вставить("СтатусОбработки"    , ДанныеОбработки.СтатусОбработки);
	Результат.Вставить("НеобходимоОбновление", СтруктураРезультата.НеобходимоОбновление);

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВерсияПлатформыНаКлиенте() Экспорт
	
	// # Пример: 8.3.11.3034 - 83110 (версия по трем позициям) и до 4 знаков 
    // # Пример: 8.3.5.6565  - 8350 (версия по трем позициям) и до 4 знаков 	
	// # Пример: 8.2.19.4342 - 8219 (версия по трем позициям) и до 4 знаков 
    // # Пример: 8.3.10.4342 - 83100(версия по трем позициям) и до 4 знаков
	// # Пример: 8.3.9.4342  - 8390 (версия по трем позициям) и до 4 знаков
	// # Пример: 8.3.12.4342 - 83120(версия по трем позициям) и до 4 знаков
	// # Пример: 8.3.1.00    - 8310(версия по трем позициям) и до 4 знаков
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ТекущаяВерсия = СистемнаяИнформация.ВерсияПриложения;
	
	Версия  = "";
	Для н = 1  По 3 Цикл
		ПозицияТочки  = Найти(ТекущаяВерсия, ".");
		Символ        = Лев(ТекущаяВерсия , ПозицияТочки - 1);
		ТекущаяВерсия = Сред(ТекущаяВерсия, ПозицияТочки + 1);
		Версия        = Версия + Символ;
	КонецЦикла;
	
	Если СтрДлина(Версия) < 4 
		 ИЛИ (Сред(Версия, 2, 1) = "3" И СтрДлина(Версия) = 4) Тогда
	    Версия = Версия + "0";	
	КонецЕсли;
	
	Попытка
		ВерсияЧисло = Число(Версия);
	Исключение
	   ВерсияЧисло  = 0;
	КонецПопытки;

	Возврат ВерсияЧисло;
	
КонецФункции

&НаКлиенте
Функция ЭКОМ_ПолучитьРазделительПутиОСКлиента()
	
	// По умолчнию Windows
	РазделительПути = "\";
	Диск            = "C:\";
	ОС              = "Windows";
	
	СистемнаяИнформация = Новый СистемнаяИнформация;	
	ЭтоLinuxКлиент = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;
		
	Если ЭтоLinuxКлиент Тогда
		РазделительПути = "/";
		Диск = "/home/";
		ОС   = "Linux";
	КонецЕсли;

	Если ВерсияПлатформыНаКлиенте() >= 8330 Тогда
		РазделительПути = ПолучитьРазделительПутиКлиента();
		Диск            = КаталогДокументов();	
	КонецЕсли;
		
	Данные = Новый Соответствие;
	Данные.Вставить("РазделительПути", РазделительПути);
	Данные.Вставить("Диск"           , Диск);
	Данные.Вставить("ОС"             , ОС);
	Данные.Вставить("РазделительПутиWindows", "\");
	Данные.Вставить("РазделительПутиLinux"  , "/");
	
    Возврат Данные;

КонецФункции

&НаКлиенте
Функция ОпределитьКаталогПоУмолчанию(Диск, РазделительПути)
	
	РабочийКаталогПоУмолчанию = "Диск_EDI_ECOM@";
	
	ПутьКаталога = СтрЗаменить(РабочийКаталогПоУмолчанию, "@", РазделительПути);
	ПутьКаталога = СтрЗаменить(ПутьКаталога, "Диск_", Диск);
	
	ПроверитьЛокальныйКаталог(ПутьКаталога, РазделительПути);
		
	Возврат ПутьКаталога;

КонецФункции

&НаКлиенте
Функция ЭКОМ_СоздатьКаталогПроверитьНаЗаписьКлиент(ПолныйПутьКаталога, МассивЛогаСобытий)
	
	ИмяСобытия = "Проверка каталога";
	Каталог = Неопределено;
	Если ЗначениеЗаполнено(ПолныйПутьКаталога) 
		 И ТипЗнч(ПолныйПутьКаталога) = Тип("Строка") Тогда

		 // Создаем каталог 
		 Каталог = Новый Файл(ПолныйПутьКаталога);
		 Если НЕ Каталог.Существует() Тогда
			 Попытка
				 СоздатьКаталог(ПолныйПутьКаталога);
				 Каталог = Новый Файл(ПолныйПутьКаталога);
			 Исключение
				 ТекстЛогаСобытий = "Каталог, указанный в настройках модуля отсутствует. 
				 |Ошибка создания каталога по настройке [" + ПолныйПутьКаталога + "] Текст ошибки платформы: " + ОписаниеОшибки();
				 ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
				 МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
				 
				 Возврат Неопределено;
				 
			 КонецПопытки;
			 
		 КонецЕсли;
		 
		 // Проверяем на запись
		 Попытка
			 Текст = Новый ЗаписьТекста(ПолныйПутьКаталога + "ТестНаЗапись.txt", КодировкаТекста.ANSI);    
			 Текст.ЗаписатьСтроку("Проверка на запись файлов!");
			 Текст.Закрыть();
			 
		 Исключение
			 ТекстЛогаСобытий = "Нет прав на запись файлов. Текст ошибки платформы: " + ОписаниеОшибки();	
			 ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
			 МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

			 Возврат Неопределено;
			 
		 КонецПопытки;
		 
	КонецЕсли;

    Возврат Каталог;

КонецФункции

&НаКлиенте
Процедура ОткрытьПредыдущуюВерсиюОбработки()
		
   	ДанныеОС = ЭКОМ_ПолучитьРазделительПутиОСКлиента();
	РазделительПути = ДанныеОС.Получить("РазделительПути");
	
	ЗначениеПоУмолчанию = Неопределено;
	Измерение           = Неопределено; 
	Обязательно         = Истина;
	МассивЛогаСобытий = Новый Массив;
	ЛокальныйКаталогUPDATE = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_Локальный_Каталог_UPDATE"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
	
	Если ЗначениеЗаполнено(ЛокальныйКаталогUPDATE) 
		 И ТипЗнч(ЛокальныйКаталогUPDATE) = Тип("Строка") Тогда
		 
		 ПолныйПутьАрхиваUpdate = ЛокальныйКаталогUPDATE + ?(Прав(ЛокальныйКаталогUPDATE, 1) = РазделительПути, "", РазделительПути) + "archive" + РазделительПути;
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан каталог UPDATE!";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	КаталогАрхиваUpdate = ЭКОМ_СоздатьКаталогПроверитьНаЗаписьКлиент(ПолныйПутьАрхиваUpdate, МассивЛогаСобытий);
	Если КаталогАрхиваUpdate = Неопределено Тогда		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий)");
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
    
    СписокФайловВерсий = Новый СписокЗначений;
        
    ФайлыИзАрхива = НайтиФайлы(ПолныйПутьАрхиваUpdate, "*.epf");
    Для каждого ТекущийФайл Из ФайлыИзАрхива Цикл
        ИмяФайла = ТекущийФайл.ИмяБезРасширения;
        СписокФайловВерсий.Добавить(ТекущийФайл.ПолноеИмя, ИмяФайла);
    КонецЦикла;
    
   ФайлыИзАрхива = Неопределено;
   
   ФайлыИзАрхива = НайтиФайлы(ЛокальныйКаталогUPDATE, "Архив*.epf");
   Для каждого ТекущийФайл Из ФайлыИзАрхива Цикл
        ИмяФайла = ТекущийФайл.ИмяБезРасширения;
        СписокФайловВерсий.Добавить(ТекущийФайл.ПолноеИмя, ИмяФайла);
    КонецЦикла;
    
    СписокФайловВерсий.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ОткрытьПредыдущуюВерсиюОбработкиЗавершение", ЭтаФорма), "Какую версию открыть?");
КонецПроцедуры

&НаСервере
Функция ПолучитьОбъектВнешнейОбработки(Адрес)
    Защита = Новый ОписаниеЗащитыОтОпасныхДействий;
    Защита.ПредупреждатьОбОпасныхДействиях = Ложь;
    
    ИмяПредОбработки = ВнешниеОбработки.Подключить(Адрес, , Ложь, Защита);
    Возврат ИмяПредОбработки;    	
КонецФункции

&НаКлиенте
Процедура ОткрытьПредыдущуюВерсиюОбработкиЗавершение(Результат, ДопПараметры) Экспорт
    
	Если Результат = Неопределено Тогда
        Возврат;
    КонецЕсли;
	
	Адрес = "";
	ПоместитьФайл(Адрес, Результат.Значение, , Ложь, Новый УникальныйИдентификатор);
	
    ИмяПредОбработки = ПолучитьОбъектВнешнейОбработки(Адрес);
	
	ПредФорма = ПолучитьФорму("ВнешняяОбработка." + ИмяПредОбработки + ".Форма.УФ_Форма", , ЭтаФорма);
	
	ВсеОткрытыеОкна = ПолучитьОкна();
	Для Каждого ОткрытоеОкно Из ВсеОткрытыеОкна Цикл
		Если НЕ ОткрытоеОкно.Содержимое.Количество() = 0 И ПредФорма.Заголовок = ОткрытоеОкно.Содержимое[0].Заголовок Тогда
			ОткрытоеОкно.Активизировать();
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ПредФорма.Открыть();
	
КонецПроцедуры

&НаСервере
Функция Настройка_Параметр_Записать(пИмя, пЗначение, пИзмерение = Неопределено) Экспорт
    
    МЗ = РегистрыСведений.ЭКОМ_ЗначениеДополнительныхКонстант.СоздатьМенеджерЗаписи();
    
    Если Лев(пИмя , 1) = "_" Тогда
        ПоместитьВХранилище = Истина;
    Иначе
        ПоместитьВХранилище = Ложь;
    КонецЕсли;
    
    МЗ.ДополнительнаяКонстанта  = ?(ПоместитьВХранилище, Сред(пИмя, 2), пИмя);
    МЗ.Измерение                = пИзмерение;
    МЗ.Прочитать();
    
    Если НЕ МЗ.Выбран() Тогда
        МЗ.ДополнительнаяКонстанта  = ?(ПоместитьВХранилище, Сред(пИмя, 2), пИмя);
        МЗ.Измерение                = пИзмерение;
    КонецЕсли;
    
    Если ПоместитьВХранилище Тогда
        МЗ.ЗначениеДополнительногоХранилища = Новый ХранилищеЗначения(пЗначение);
    Иначе
        МЗ.ЗначениеДополнительнойКонстанты 	= пЗначение;
    КонецЕсли;
    
    МЗ.Записать();
    
    Возврат 1;
    
КонецФункции

&НаКлиенте
Процедура ЗавершениеПросмотраТекстОшибки(Строка, Параметры) Экспорт
    
    //это заглушка, действия не нужны.
КонецПроцедуры

//ТВС: Проверка кода гибких настроек на форме (в контексте этой формы): Начало
&НаСервере
Функция ПроверитьФормулуНаФорме(Текст, ИмяЭлементаФормы, МассивЛогаСобытий) Экспорт
    Значение = Неопределено;
    
    Попытка
        
        КодЗапроса = СтрЗаменить(Текст, "¶", Символы.ПС);
        КодЗапроса = СтрЗаменить(КодЗапроса, "Возврат "      , "Значение = ");
        КодЗапроса = СтрЗаменить(КодЗапроса, "Значение = КАК", "Возврат КАК");

        ИмяДинамическогоСписка = ?(ИмяЭлементаФормы = "ГруппаПоставщик", "СписокДляПоставщика", "СписокДляПокупателя");
        ДинамическийСписок     = ?(ИмяЭлементаФормы = "ГруппаПоставщик", СписокДляПоставщика, СписокДляПокупателя);
		
		ТекстЗапроса = "";
		Результат = Новый Структура("ТекстЗапроса, Колонки", ТекстЗапроса, Новый Массив);
		
		Если ЗначениеЗаполнено(КодЗапроса) Тогда   
			
			Выполнить(КодЗапроса);
			
			Запрос = Новый Запрос;		               
			Запрос.Текст = ТекстЗапроса;
			Результат.ТекстЗапроса = ТекстЗапроса;
			Запрос.УстановитьПараметр("ДатаНач", ТекущаяДата());
			Запрос.УстановитьПараметр("ДатаКон", ТекущаяДата());
			Запрос.УстановитьПараметр("масПомеченныхДоков", Новый Массив);
			Запрос.УстановитьПараметр("НаправлениеОбмена" , Перечисления.ЭКОМ_НаправлениеОбмена.ПустаяСсылка());
			
			РезультатЗапроса = Запрос.Выполнить();
			КолонкиЗапроса = РезультатЗапроса.Колонки;
			
			Для каждого ТекКолонка Из КолонкиЗапроса Цикл
				ИмяКолонкиЗапроса = ТекКолонка.Имя;
				Результат.Колонки.Добавить(ИмяКолонкиЗапроса);
				КонецЦикла;			
			
		КонецЕсли;
        
    Исключение 
        ТекстЛогаСобытий = ОписаниеОшибки();
		ЗаписьСтруктурыЛога = Вычислить("ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение(""Перечисление.ЭКОМ_УровниЛогирования.Ошибка""), ""Тестирование гибких настроек"")");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
    КонецПопытки;
	
	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Вычислить("ЭКОМ_ОбщегоНазначения.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий)");
		Сообщение.Сообщить();
	КонецЕсли;
	
    Возврат Результат;
	
КонецФункции

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура СоздатьДинамическийСписокДобавитьДинамическиеКнопки(МассивЛогаСобытий) Экспорт

	Если Элементы.ОсновнаяПанель.ТекущаяСтраница = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	СоздатьДинамическийСписокДобавитьДинамическиеКнопкиНаСервере(ДанныеСписка, МассивЛогаСобытий);

КонецПроцедуры // СоздатьДинамическийСписокДобавитьДинамическиеКнопки()

// Получает данные роли
//
&НаСервере
Процедура СоздатьДинамическийСписокДобавитьДинамическиеКнопкиНаСервере(ДанныеСписка, МассивЛогаСобытий)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Роли 			= ОбработкаОбъект.ПолучитьРолиТекущегоПользвоателя();
	
	~ОбновитьТаблицуКнопок:
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭКОМ_РолиКнопки.Ссылка КАК Роль,
		|	""Кнопка"" КАК ВидДанных,
		|	ЭКОМ_РолиКнопки.Синоним,
		|	ЭКОМ_РолиКнопки.Имя,
		|	ЭКОМ_РолиКнопки.Путь,
		|	ЭКОМ_РолиКнопки.ИмяКоманды,
		|	ЭКОМ_РолиКнопки.Действие,
		|	ЭКОМ_РолиКнопки.Предопределенная,
		|	ЭКОМ_РолиКнопки.Картинка,
		|	ЭКОМ_РолиКнопки.Отображение,
		|	ЭКОМ_РолиКнопки.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Справочник.ЭКОМ_Роли.Кнопки КАК ЭКОМ_РолиКнопки
		|ГДЕ
		|	ЭКОМ_РолиКнопки.Ссылка В(&Роли)
		|	И ЭКОМ_РолиКнопки.Доступность = ИСТИНА
		|	И НЕ ЭКОМ_РолиКнопки.Действие = """"
		|	И НЕ ЭКОМ_РолиКнопки.Ссылка.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЭКОМ_РолиКолонки.Ссылка,
		|	""Колонка"",
		|	ЭКОМ_РолиКолонки.Синоним,
		|	ЭКОМ_РолиКолонки.Имя,
		|	ЭКОМ_РолиКолонки.Путь,
		|	"""",
		|	"""",
		|	"""",
		|	"""",
		|	"""",
		|	ЭКОМ_РолиКолонки.НомерСтроки
		|ИЗ
		|	Справочник.ЭКОМ_Роли.Колонки КАК ЭКОМ_РолиКолонки
		|ГДЕ
		|	ЭКОМ_РолиКолонки.Ссылка В(&Роли)
		|	И ЭКОМ_РолиКолонки.Доступность = ИСТИНА
		|	И НЕ ЭКОМ_РолиКолонки.Ссылка.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";

	Запрос.УстановитьПараметр("Роли", Роли);

	РезультатЗапроса = Запрос.Выполнить();

	НастройкиРоли = РезультатЗапроса.Выгрузить();
	
	Отбор = Новый Структура;
	Отбор.Вставить("Предопределенная", Истина);
	Отбор.Вставить("ИмяКоманды", "");
	ПустыеСтроки = НастройкиРоли.НайтиСтроки(Отбор);
	Если ПустыеСтроки.Количество() > 0 Тогда
		Попытка
			ОбъектПоУмолчанию = Справочники.ЭКОМ_Роли.ПоУмолчанию.ПолучитьОбъект();
		Исключение
			Роль = Справочники.ЭКОМ_Роли.НайтиПоНаименованию("По умолчанию");
			Если Роль = Неопределено Тогда            
				ТекстЛогаСобытий = "Не найдена роль, доступная для текущего пользователя. "
					+ "Динамический список не создан, динамические кнопки не заполнены.";  
				ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛогаОбщийМодуль(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"),
					"СоздатьДинамическийСписокДобавитьДинамическиеКнопкиНаСервере()");
				МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
			КонецЕсли;
			ОбъектПоУмолчанию = Роль.ПолучитьОбъект();
		КонецПопытки;
		ОбъектПоУмолчанию.ОбновитьКнопки();
		ОбъектПоУмолчанию.Записать();
		Роли.Очистить();
		Роли.Добавить(ОбъектПоУмолчанию.Ссылка);
		Перейти ~ОбновитьТаблицуКнопок;
	КонецЕсли;
	ДобавитьДинамическиеКнопки(ДанныеСписка, НастройкиРоли);
	СоздатьДинамическийСписок(ДанныеСписка, НастройкиРоли, Роли, МассивЛогаСобытий);
	
КонецПроцедуры // СоздатьДинамическийСписокДобавитьДинамическиеКнопкиНаСервере()

// Добавляет динамические кнопки на форму
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ДобавитьДинамическиеКнопки(ДанныеСписка, НастройкиРоли)

	// Группа сопоставлений для совместимости с настройками от ОФ.
	СопоставлениеКонтекстныеМеню = Новый Соответствие;
	СопоставлениеКонтекстныеМеню.Вставить("Поставщик"         , "СписокДляПоставщикаКонтекстноеМеню");
	СопоставлениеКонтекстныеМеню.Вставить("Покупатель"        , "СписокДляПокупателяКонтекстноеМеню");
	СопоставлениеКонтекстныеМеню.Вставить("ЭТРН"              , "СписокДляЭТРНКонтекстноеМеню");
	СопоставлениеКонтекстныеМеню.Вставить("ПрайсЛистВходящий" , "СписокДляПрайсЛистаВходящийКонтекстноеМеню");
	СопоставлениеКонтекстныеМеню.Вставить("ПрайсЛистИсходящий", "СписокДляПрайсЛистаИсходящийКонтекстноеМеню");
	
	СопоставлениеГруппыМеню = Новый Соответствие;
	СопоставлениеГруппыМеню.Вставить("Входящие" , "Получить");
	СопоставлениеГруппыМеню.Вставить("Исходящие", "Отправить");
	СопоставлениеГруппыМеню.Вставить("Документы", "Документы");
	
	СопоставлениеКомандныеПанели = Новый Соответствие;
	СопоставлениеКомандныеПанели.Вставить("КоманднаяПанельПоставщик" , "СписокДляПоставщикаКоманднаяПанель");
	СопоставлениеКомандныеПанели.Вставить("КоманднаяПанельПокупатель", "СписокДляПокупателяКоманднаяПанель"); 
	СопоставлениеКомандныеПанели.Вставить("КоманднаяПанельЭТРН"      , "СписокДляЭТРНКоманднаяПанель");
	СопоставлениеКомандныеПанели.Вставить("КоманднаяПанельCondra"    , "СписокДляCondraКоманднаяПанель");
	СопоставлениеКомандныеПанели.Вставить("КоманднаяПанельПрайсЛистВходящий" , "СписокДляПрайсЛистаВходящийКоманднаяПанель");
	СопоставлениеКомандныеПанели.Вставить("КоманднаяПанельПрайсЛистИсходящий", "СписокДляПрайсЛистаИсходящийКоманднаяПанель");
	
	СопоставлениеОтображение = Новый Соответствие;
	СопоставлениеОтображение.Вставить("Авто", 			"Авто");
	СопоставлениеОтображение.Вставить("Картинка", 		"Картинка");
	СопоставлениеОтображение.Вставить("КартинкаИТекст",	"КартинкаИТекст");
	СопоставлениеОтображение.Вставить("Текст", 			"Текст");
	
	КонтекстноеМеню = Элементы.Найти(ДанныеСписка.ИмяСписка).КонтекстноеМеню;
	ОбновитьКонкретнуюПанель = ТипЗнч(КонтекстноеМеню) = Тип("ГруппаФормы");
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ВходящиеНастройки  = ОбработкаОбъект.Настройка_Параметр_Прочитать("СтруктураФайлаXMLВходящие");
	ИсходящиеНастройки = ОбработкаОбъект.Настройка_Параметр_Прочитать("СтруктураФайлаXMLИсходящие");
	ДокументыНастройки = ОбработкаОбъект.Настройка_Параметр_Прочитать("СтруктураФайлаXMLДокументы");
	
	Шаблоны = Новый Структура("Входящие, Исходящие, Документы", ВходящиеНастройки, ИсходящиеНастройки, ДокументыНастройки);

	Кнопки = НастройкиРоли.СкопироватьКолонки();
	Кнопки.Колонки.Удалить("Путь");
	Кнопки.Колонки.Добавить("Путь");
	Кнопки.Колонки.Добавить("Группа");

	ЗаписатьДеревоИсходящие = Ложь;
	ЗаписатьДеревоВходящие  = Ложь;

	Для Каждого КнопкаРоли Из НастройкиРоли.НайтиСтроки(Новый Структура("ВидДанных", "Кнопка")) Цикл
		Пути = СтрЗаменить(КнопкаРоли.Путь, "|", Символы.ПС); // Разделяем строку пути на несколько путей, если в ней указано более одного пути для добавления кнопки
		Для НомерСтрокиПути = 1 По СтрЧислоСтрок(Пути) Цикл
			НоваяКнопка = Кнопки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяКнопка, КнопкаРоли, , "Путь");
			Путь = СокрЛП(СтрПолучитьСтроку(Пути, НомерСтрокиПути));
			Путь	= СтрЗаменить(Путь, "__", Символы.ПС);
			НоваяКнопка.Путь = Новый Массив;
			Для НомерСтроки = 1 По СтрЧислоСтрок(Путь) Цикл
				НоваяКнопка.Путь.Добавить(СокрЛП(СтрПолучитьСтроку(Путь, НомерСтроки)));	
			КонецЦикла;
			
			// Нет имени командной панели, получаем ее из шаблона.
			Если НоваяКнопка.Путь.Количество() > 1
				И ПустаяСтрока(НоваяКнопка.Путь.Получить(0)) Тогда
				Шаблон 	= Неопределено;
				ВидШаблона = НоваяКнопка.Путь.Получить(1);
				Если Шаблоны.Свойство(ВидШаблона, Шаблон) И Шаблон <> Неопределено Тогда //Docrobot 1.21.0 MOD-1648[проверка шаблона]
					СтрокаДерева = Шаблон.Строки.Найти(КнопкаРоли.Синоним, "Кнопка");
					Если СтрокаДерева = Неопределено Тогда
						Кнопки.Удалить(НоваяКнопка); // Такого дерева нет, следовательно и кнопки не будет
						Прервать;
					КонецЕсли;
					
					// Изменение имени операции
					Если ВидШаблона = "Исходящие" 
						И СтрокаДерева.ТипТранзакции = "Исходящий ON_NSCHFDOPPR (Новый формат УПД)" Тогда
						СтрокаДерева.ТипТранзакции = "Исходящий ЮЗД - универсальный передаточный документ";
						ЗаписатьДеревоИсходящие = Истина;
					КонецЕсли;
					
					Если ВидШаблона = "Входящие" 
						И СтрокаДерева.ТипТранзакции = "Входящий ON_SCHFDOPPR (универсальный передаточный документ)" Тогда
						СтрокаДерева.ТипТранзакции = "Входящий ЮЗД - универсальный передаточный документ";
						ЗаписатьДеревоВходящие = Истина;
					КонецЕсли;

					// Определение панелей, на которых должна выводиться кнопка.
					Вкладки = Новый Соответствие;
					Вкладки.Вставить("Поставщик" , Ложь);
					Вкладки.Вставить("Покупатель", Ложь);
					Вкладки.Вставить("ЭТРН"      , Ложь);
					Вкладки.Вставить("ПрайсЛист" , Ложь);
					Если НЕ Шаблон.Колонки.Найти("КоллекцияТЧ") = Неопределено Тогда
						
						Если СтрокаДерева.КоллекцияТЧ.Количество() = 0 Тогда
							 СтрокаДерева.КоллекцияТЧ.Добавить("ИмяКнопки" , СтрокаДерева.Кнопка, Истина);
							 СтрокаДерева.КоллекцияТЧ.Добавить("Поставщик" , "", Истина);
							 СтрокаДерева.КоллекцияТЧ.Добавить("Покупатель", "", Истина);
							 СтрокаДерева.КоллекцияТЧ.Добавить("ЭТРН"      , "", Истина);
							 СтрокаДерева.КоллекцияТЧ.Добавить("ПрайсЛист" , "", Истина);												
						КонецЕсли;

						Для Каждого СтрокаКоллекции Из СтрокаДерева.КоллекцияТЧ Цикл
							ИмяДляПанели = СтрЗаменить(?(СтрокаКоллекции.Значение = "ЭТРН", СтрокаКоллекции.Значение, ТРег(СтрокаКоллекции.Значение)), "-", "");
							Если НЕ Вкладки.Получить(ИмяДляПанели) = Неопределено Тогда
								Вкладки[ИмяДляПанели] = СтрокаКоллекции.Пометка;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
					Вкладки.Вставить("ПрайсЛистВходящий" , Вкладки["ПрайсЛист"]);
					Вкладки.Вставить("ПрайсЛистИсходящий", Вкладки["ПрайсЛист"]);
					Вкладки.Удалить("ПрайсЛист");
					
					// Заполнение имени командной панели и дублирование строк с кнопками, если вывод предполагается на нескольких панелях.
					Для Каждого Вкладка Из Вкладки Цикл
						Если НЕ Вкладка.Значение Тогда
							Продолжить;
						КонецЕсли;
						Если ПустаяСтрока(НоваяКнопка.Путь.Получить(0)) Тогда
							НоваяКнопка.Путь.Установить(0, СопоставлениеКонтекстныеМеню.Получить(Вкладка.Ключ));
						Иначе
							НоваяКнопка2 = Кнопки.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяКнопка2, НоваяКнопка, , "Путь");
							НоваяКнопка2.Путь = Новый Массив;
							Для Каждого Элемент Из НоваяКнопка.Путь Цикл
								НоваяКнопка2.Путь.Добавить(Элемент);
							КонецЦикла;
							НоваяКнопка2.Путь.Установить(0, СопоставлениеКонтекстныеМеню.Получить(Вкладка.Ключ));
						КонецЕсли;     
						
					КонецЦикла;
					
				КонецЕсли;
			ИначеЕсли НоваяКнопка.ИмяКоманды = "СоздатьRETORD" Тогда //Docrobot 1.21.0 MOD-1648
				НоваяКнопка.Путь.Добавить("Документы");	
			Иначе
				НоваяКнопка.Путь.Установить(0, СопоставлениеКомандныеПанели.Получить(НоваяКнопка.Путь.Получить(0)));
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ЗаписатьДеревоИсходящие = Истина Тогда
		 ОбработкаОбъект.Настройка_Параметр_Записать("_СтруктураФайлаXMLИсходящие", ИсходящиеНастройки);
	КонецЕсли;
	Если ЗаписатьДеревоВходящие = Истина Тогда
		 ОбработкаОбъект.Настройка_Параметр_Записать("_СтруктураФайлаXMLВходящие", ВходящиеНастройки);
	КонецЕсли;

	// Преобразовываем путь из массива в группу на панели.
	Для Каждого Кнопка Из Кнопки Цикл
		
		ЭлементФормы 	= Неопределено;
		ПутьСтрокой 	= "";
		
		Для Каждого Путь Из Кнопка.Путь Цикл
			Если СтрДлина(Путь) - Найти(Путь, "КонтекстноеМеню") = 14 Тогда
				ЭлементФормы 	= Элементы.Найти(Путь);
				ПутьСтрокой 	= СтрЗаменить(Путь, "КонтекстноеМеню", "");
			ИначеЕсли СтрДлина(Путь) - Найти(Путь, "КоманднаяПанель") = 14 Тогда
				ЭлементФормы 	= Элементы.Найти(Путь);
				ПутьСтрокой 	= СтрЗаменить(Путь, "КоманднаяПанель", "");
			Иначе
				ПутьСтрокой 	= ПутьСтрокой + "Группа" + СопоставлениеГруппыМеню.Получить(Путь);
				ЭлементФормы 	= Элементы.Найти(ПутьСтрокой);
			КонецЕсли;
		КонецЦикла;
		
		Кнопка.Группа = ЭлементФормы;
		
	КонецЦикла;
	
	// Удаляем все ранее добавленные кнопки.
	Для Каждого ЗаписьКнопки Из Кнопки Цикл
		Если ТипЗнч(ЗаписьКнопки.Группа) = Тип("ГруппаФормы") Тогда
			Для Индекс = 0 По ЗаписьКнопки.Группа.ПодчиненныеЭлементы.Количество() - 1 Цикл
				Попытка
					Кнопка = ЗаписьКнопки.Группа.ПодчиненныеЭлементы.Получить(Индекс);
					Если ТипЗнч(Кнопка) = Тип("КнопкаФормы")
						И Кнопка.РасширеннаяПодсказка.Заголовок = "Кнопка добавлена автоматически" Тогда
						//ЗаписьКнопки.Группа.ПодчиненныеЭлементы.Удалить(Индекс);
					КонецЕсли;
				Исключение 
				    ТекстОшибки = ОписаниеОшибки();	
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	// Добавляем кнопки на форму.
	Для Каждого ЗаписьКнопки Из Кнопки Цикл
		
		// Ищем кнопку.
		Кнопка = Неопределено;
		Если ЗаписьКнопки.Группа = Неопределено Тогда
			Продолжить; // Такого пути не существует (задан неправильный путь для вывода).
		ИначеЕсли ТипЗнч(ЗаписьКнопки.Группа) = Тип("ГруппаФормы") Тогда
			Для Каждого КнопкаГруппы Из ЗаписьКнопки.Группа.ПодчиненныеЭлементы Цикл
				Если КнопкаГруппы.Заголовок = ЗаписьКнопки.Синоним Тогда
					Кнопка = КнопкаГруппы;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// Добавляем новую кнопку, если ранее ее не было.
		Если Кнопка = Неопределено Тогда
			
			// Создаем команду.
			Если ЭтаФорма.Команды.Найти(ЗаписьКнопки.ИмяКоманды) = Неопределено Тогда
				НоваяКоманда = ЭтаФорма.Команды.Добавить(ЗаписьКнопки.ИмяКоманды);
				НоваяКоманда.Действие = ЗаписьКнопки.Действие;
			КонецЕсли;
			
			// Добавляем кнопку.
			Кнопка = Элементы.Добавить(ЗаписьКнопки.Группа.Имя + ЗаписьКнопки.Имя, Тип("КнопкаФормы"), ЗаписьКнопки.Группа);
			Кнопка.Заголовок  = ЗаписьКнопки.Синоним;
			Кнопка.ИмяКоманды = ЗаписьКнопки.ИмяКоманды;
			Кнопка.РасширеннаяПодсказка.Заголовок = "Кнопка добавлена автоматически";
			
			Если НЕ ПустаяСтрока(ЗаписьКнопки.Картинка) Тогда
				Кнопка.Картинка 	= БиблиотекаКартинок[ЗаписьКнопки.Картинка];
			КонецЕсли;
			Если НЕ ПустаяСтрока(ЗаписьКнопки.Отображение) Тогда
				Кнопка.Отображение	= ОтображениеКнопки[СопоставлениеОтображение.Получить(ЗаписьКнопки.Отображение)];
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	             
КонецПроцедуры // ДобавитьДинамическиеКнопки()

// Обновляет колонки в указанной таблице, сортирует их в определенной последовательности и меняет синоним колонки согласно настройкам роли
//
// Параметры:
//  ИмяДинамическогоСписка  - Строка - имя динамического списка на форме
//  НастройкиРоли  - ТаблицаЗначений - результат запроса, выводимый в таблицу формы
//	Роли - Массив - коллекция доступных пользователю ролей
//  МассивЛогаСобытий  - Массив - данные лога событий для вывода пользователю
//
&НаСервере
Процедура СоздатьДинамическийСписок(ДанныеСписка, НастройкиРоли, Роли, МассивЛогаСобытий)

	ИмяСобытия = "Создать динамический список";
	СлужебныйЗапросДляФормы = ДанныеСписка.АлгоритмЗаполненияСписка;
	ДинамическийСписок = ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы];
	
	КодПолученияТекстаЗапроса = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(СлужебныйЗапросДляФормы, Неопределено, ""Служебный"", Ложь)");
	
	Если НЕ ЗначениеЗаполнено(КодПолученияТекстаЗапроса) Тогда
		
		ТекстЛогаСобытий = "Не заполнен алгоритм заполнения списка формы!";
		ЗаписьСтруктурыЛога = Вычислить("ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение(""Перечисление.ЭКОМ_УровниЛогирования.Ошибка""), ИмяСобытия)");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		
		Возврат;
	КонецЕсли;
	
	ОбработанныеКолонки = Новый ТаблицаЗначений;
	ОбработанныеКолонки.Колонки.Добавить("Имя");
	ОбработанныеКолонки.Колонки.Добавить("Синоним");
	ОбработанныеКолонки.Колонки.Добавить("Обработана", Новый ОписаниеТипов("Булево"));
	
	Попытка
		
		ТекстЗапроса = "";
		Выполнить(КодПолученияТекстаЗапроса);
		
		Запрос = Новый Запрос;		               
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ДатаНач", ТекущаяДата());
		Запрос.УстановитьПараметр("ДатаКон", ТекущаяДата());		
		Запрос.УстановитьПараметр("масПомеченныхДоков", Новый Массив);
		Запрос.УстановитьПараметр("НаправлениеОбмена" , Перечисления.ЭКОМ_НаправлениеОбмена.ПустаяСсылка());
		
		Попытка
			РезультатЗапроса = Запрос.Выполнить();
		Исключение
			ТекстЛогаСобытий = ОписаниеОшибки();
			ЗаписьСтруктурыЛога = Вычислить("ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение(""Перечисление.ЭКОМ_УровниЛогирования.Ошибка""), ИмяСобытия)");
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
			
			//Результат = Новый Структура("ТекстЗапроса, Колонки", ТекстЗапроса, Колонки);
			Возврат; // Результат
		КонецПопытки;
		
		КолонкиЗапроса = РезультатЗапроса.Колонки;
		
		Для каждого ТекКолонка Из КолонкиЗапроса Цикл
			НоваяЗапись	= ОбработанныеКолонки.Добавить();
			НоваяЗапись.Имя	= ТекКолонка.Имя;
		КонецЦикла;			
		
		ДинамическийСписок.ТекстЗапроса = ТекстЗапроса;
			
		Если ДанныеСписка.ТипОбмена="Поставщик" Тогда
			ДинамическийСписок.ОсновнаяТаблица = "РегистрСведений.ЭКОМ_ЦепочкиДокументовПоставщика";
			ДинамическийСписок.ДинамическоеСчитываниеДанных = Истина;	
		ИначеЕсли ДанныеСписка.ТипОбмена="Сеть" Тогда
			ДинамическийСписок.ОсновнаяТаблица = "РегистрСведений.ЭКОМ_ЦепочкиДокументовПокупателя";
			ДинамическийСписок.ДинамическоеСчитываниеДанных = Истина;	
		ИначеЕсли ДанныеСписка.ТипОбмена="ЭТРН" Тогда
			ДинамическийСписок.ОсновнаяТаблица = "РегистрСведений.ЭКОМ_ЦепочкиДокументовЭТРН";
			ДинамическийСписок.ДинамическоеСчитываниеДанных = Истина;	
		ИначеЕсли ДанныеСписка.ТипОбмена="Неструкт. докум." Тогда
			ДинамическийСписок.ОсновнаяТаблица = "РегистрСведений.ЭКОМ_ЦепочкиНеструктурированныхДокументов";
			ДинамическийСписок.ДинамическоеСчитываниеДанных = Истина;	
		КонецЕсли;
		 
	Исключение
		ТекстЛогаСобытий = ОписаниеОшибки();
		ЗаписьСтруктурыЛога = Вычислить("ЭКОМ_ОбщегоНазначения.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение(""Перечисление.ЭКОМ_УровниЛогирования.Ошибка""), ИмяСобытия)");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

	КонецПопытки;
		
	// Получение приоритетной настройки колонок (если одна и та же колонка присутствует в нескольких ролях).
	КолонкиРоли = НастройкиРоли.СкопироватьКолонки();
	Для Каждого Роль Из Роли Цикл
		Для Каждого Колонка Из НастройкиРоли.НайтиСтроки(Новый Структура("ВидДанных, Путь, Роль", "Колонка", ДанныеСписка.Путь, Роль)) Цикл
			НоваяКолонка = КолонкиРоли.Найти(Колонка.Имя, "Имя");
			Если НоваяКолонка = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(КолонкиРоли.Добавить(), Колонка);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Совпавшие в запросе и выбранные в роли колонки отмечаем как не требующие удаления.
	Для ИндексКолонкиВРоли = 0 По КолонкиРоли.Количество() - 1 Цикл
		Колонка = КолонкиРоли.Получить(ИндексКолонкиВРоли);
		НоваяЗапись = ОбработанныеКолонки.Найти(Колонка.Имя, "Имя");
		Если НоваяЗапись = Неопределено Тогда // Этой колонки нет в запросе. Пропускаем ее
			Продолжить;
		КонецЕсли;
		НоваяЗапись.Синоним = Колонка.Синоним;
		НоваяЗапись.Обработана = Истина; // Отмечаем те колонки, которые необходимо оставить
		// Изменение позиции колонок в переменной.
		ИндексКолонкиНаФорме = ОбработанныеКолонки.Индекс(НоваяЗапись);
		Смещение = ИндексКолонкиВРоли - ИндексКолонкиНаФорме;
		ОбработанныеКолонки.Сдвинуть(НоваяЗапись, Смещение);
	КонецЦикла;
	
	// Изменение видимости и синонимов колонок.
	ЭлементыФормы = Элементы[ДанныеСписка.ИмяСписка].ПодчиненныеЭлементы;
	Для Каждого Колонка Из ЭлементыФормы Цикл
		Если Колонка.Вид = ПредопределенноеЗначение("ВидГруппыФормы.ГруппаКолонок") Тогда
			Продолжить;
		КонецЕсли;
		
		КолонкаИзРоли = ОбработанныеКолонки.Найти(СтрЗаменить(Колонка.Имя, ДанныеСписка.ИмяСписка, ""), "Имя");
		Колонка.Видимость = ?(КолонкаИзРоли = Неопределено ИЛИ НЕ КолонкаИзРоли.Обработана, Ложь, Истина);
		Если НЕ КолонкаИзРоли = Неопределено Тогда
			Колонка.Заголовок = КолонкаИзРоли.Синоним;
		КонецЕсли;
		
	КонецЦикла;
	
	// Изменение позиции колонок на форме.
	Для Каждого КолонкаИзРоли Из ОбработанныеКолонки Цикл
		
		Если НЕ ЭтоКолонкаСКартинкой(КолонкаИзРоли.Имя) Тогда
			
			КолонкаНаФорме = ДанныеСписка.ИмяСписка + КолонкаИзРоли.Имя;
			ЭлементыСписка = Элементы.Найти(КолонкаНаФорме); 				
			Если ЭлементыСписка = Неопределено	Тогда
				НоваяКолонкаТаблицы = Элементы.Добавить(КолонкаНаФорме, Тип("ПолеФормы"), Элементы[ДанныеСписка.ИмяСписка]);
				НоваяКолонкаТаблицы.ПутьКДанным = ДанныеСписка.ИмяРеквизитаТаблицы + "." + КолонкаИзРоли.Имя;
				ЭлементыСписка = НоваяКолонкаТаблицы;
			КонецЕсли;
			
			Элементы[КолонкаНаФорме].Видимость = КолонкаИзРоли.Обработана;
			Элементы[КолонкаНаФорме].Заголовок = КолонкаИзРоли.Синоним;
			ЭтаФорма.Элементы.Переместить(ЭлементыСписка, Элементы[ДанныеСписка.ИмяСписка]);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Изменение позиции колонок с картинками на форме.
	Для Каждого КолонкаИзРоли Из ОбработанныеКолонки Цикл
		
		Если НЕ ЗначениеЗаполнено(КолонкаИзРоли.Синоним) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭтоКолонкаСКартинкой(КолонкаИзРоли.Имя) Тогда
			                     
			ИмяОсновнойКолонки = ИмяОсновнойКолонки(КолонкаИзРоли.Имя);
			ОсновнаяКолонкаНаФорме = ДанныеСписка.ИмяСписка + ИмяОсновнойКолонки;
			ЭлементОсновнаяКолонка = Элементы.Найти(ОсновнаяКолонкаНаФорме);
			Если ЭлементОсновнаяКолонка = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			КолонкаНаФорме = ДанныеСписка.ИмяСписка + КолонкаИзРоли.Имя;
			ЭлементыСписка = Элементы.Найти(КолонкаНаФорме); 				
			Если ЭлементыСписка = Неопределено	Тогда
				НоваяКолонкаТаблицы = Элементы.Добавить(КолонкаНаФорме, Тип("ПолеФормы"), Элементы[ДанныеСписка.ИмяСписка]);
				НоваяКолонкаТаблицы.ПутьКДанным = ДанныеСписка.ИмяСписка + "." + КолонкаИзРоли.Имя;
				ЭлементыСписка = НоваяКолонкаТаблицы;
			КонецЕсли;
			
			Элементы[КолонкаНаФорме].Видимость = КолонкаИзРоли.Обработана;
			Элементы[КолонкаНаФорме].Заголовок = КолонкаИзРоли.Синоним;
			Элементы[КолонкаНаФорме].Вид = ВидПоляФормы.ПолеКартинки;
			Элементы[КолонкаНаФорме].КартинкаЗначений = КартинкаДляКолонки(КолонкаИзРоли.Имя);
			
			ГруппаКолонокСКартинкой = ЭтаФорма.Элементы.Найти("ГруппаКолонок_" + ИмяОсновнойКолонки);
			Если ГруппаКолонокСКартинкой = Неопределено Тогда
				ГруппаКолонокСКартинкой = ЭтаФорма.Элементы.Добавить("ГруппаКолонок_" + ИмяОсновнойКолонки, Тип("ГруппаФормы"), Элементы[ДанныеСписка.ИмяСписка]);
				ГруппаКолонокСКартинкой.Вид = ВидГруппыФормы.ГруппаКолонок;
				ГруппаКолонокСКартинкой.Группировка = ГруппировкаКолонок.ВЯчейке;
				ГруппаКолонокСКартинкой.Заголовок = ЭлементОсновнаяКолонка.Заголовок;
				ГруппаКолонокСКартинкой.ОтображатьВШапке = Истина;
			КонецЕсли;
			ЭтаФорма.Элементы.Переместить(ГруппаКолонокСКартинкой, Элементы[ДанныеСписка.ИмяСписка], ЭлементОсновнаяКолонка);
			
			ЭтаФорма.Элементы.Переместить(ЭлементОсновнаяКолонка, ГруппаКолонокСКартинкой);
			ЭлементОсновнаяКолонка.ОтображатьВШапке = Ложь;
			ЭтаФорма.Элементы.Переместить(ЭлементыСписка, ГруппаКолонокСКартинкой);
			ЭлементыСписка.ОтображатьВШапке = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЭтаФорма.ДеревоФильтров.ПолучитьЭлементы().Очистить();
	СоздатьСоставПользовательскихНастроекНаСервере(ДанныеСписка);
	СоздатьДеревоПользовательскихНастроекНаСервере(ДанныеСписка, Новый Массив);
	
КонецПроцедуры // СоздатьДинамическийСписок()

Функция ЭтоКолонкаСКартинкой(Знач ИмяКолонки)
	
	Если Найти(ИмяКолонки, "__Картинка") > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ИмяОсновнойКолонки(Знач ИмяКолонкиСКартинкой)
	
	ПозицияПостфикса = Найти(ИмяКолонкиСКартинкой, "__Картинка");
	ИмяОсновнойКолонки = Лев(ИмяКолонкиСКартинкой, ПозицияПостфикса - 1);
		
	Возврат ИмяОсновнойКолонки;
	
КонецФункции

Функция КартинкаДляКолонки(Знач ИмяКолонкиСКартинкой)
	
	ДлинаИмениКолонкиСКартинкой = СтрДлина(ИмяКолонкиСКартинкой);
	ПозицияПостфикса = Найти(ИмяКолонкиСКартинкой, "__Картинка");
	ПозицияИдентификатораКартинки = ПозицияПостфикса + СтрДлина("__Картинка");
	ДлинаИдентификатораКартинки = ДлинаИмениКолонкиСКартинкой - ПозицияИдентификатораКартинки + 1; 
	ИдентификаторКартинки = Прав(ИмяКолонкиСКартинкой, ДлинаИдентификатораКартинки);
	ИмяКартинкиИзКонфигурации = "ЭКОМ_" + ИдентификаторКартинки; 
	
	Если ИмяКартинкиИзКонфигурации = "ЭКОМ_Информация" Тогда
		Картинка = БиблиотекаКартинок.ЭКОМ_Информация;
	ИначеЕсли ИмяКартинкиИзКонфигурации = "ЭКОМ_Вопрос" Тогда
		Картинка = БиблиотекаКартинок.ЭКОМ_Вопрос;
	ИначеЕсли ИмяКартинкиИзКонфигурации = "ЭКОМ_ВосклицательныйЗнак" Тогда
		Картинка = БиблиотекаКартинок.ЭКОМ_ВосклицателыныйЗнак;
	Иначе
        Картинка = БиблиотекаКартинок.ЭКОМ_Информация;
	КонецЕсли;
		
	Возврат Картинка;
	
КонецФункции

//Проверка кода гибких настроек на форме: Конец

&НаКлиенте
Функция ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, УровеньЛогирования, ИмяСобытия)
	ЗаписьСтруктурыЛога = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, УровеньЛогирования, ИмяСобытия)");	
	Возврат ЗаписьСтруктурыЛога;
	
КонецФункции

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ДинамическаяКнопкаПолучитьВыполнитьНажатие(Команда)
	
	ТекущаяДата = ТекущаяДата();
	ИмяСобытия	= "Получение документов";
	
	Элементы.КомандаНадписьОшибка.Видимость = Ложь;
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	Если ДанныеСписка.ИмяСписка = "" Тогда
		Возврат;
	КонецЕсли;
	
	МассивлогаСобытий = Новый Массив;	
	СписокОпераций = ДинамическаяКнопкаПолучитьНаСервере(ДанныеСписка, Команда.Имя, МассивЛогаСобытий);
									
	Элементы.ПолеИндикатор.Видимость = Истина;
	Элементы.КомандаЗакрытьИндикатор.Видимость = Истина;	
	ЭтаФорма.Индикатор = 1;
		
    КоличествоОпераци = СписокОпераций.Количество();			
	Для каждого ТипДокумента Из СписокОпераций Цикл
		ОбщийПроцентПрогресса = Окр(100/КоличествоОпераци, 2, РежимОкругления.Окр15как20);		
		Попытка		
			ПроверитьНаличиеФайловНаКлиенте(ТипДокумента, ОбщийПроцентПрогресса, ДанныеСписка, МассивлогаСобытий, ТекущаяДата);
			
		Исключение
			ТекстЛогаСобытий = ОписаниеОшибки();
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), "Проверка/загрузка документов " + ТипДокумента);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
			
			ТекстЛогаСобытий = "Время выполнения " + ЭКОМ_ОбщегоНазначенияКлиент.СекундыВоВремяНаКлиенте(ТекущаяДата() - ТекущаяДата).Строка;
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Информация"), ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
			
			Элементы.КомандаНадписьОшибка.Видимость = Истина;
			
			Выполнить("ЭКОМ_ОбщегоНазначения.СнятьБлокировкуОперации(ТипДокумента, ""Входящий"", МассивлогаСобытий)");
		КонецПопытки;
			
	КонецЦикла;
	
	ОтобразитьЛогСобытий(МассивлогаСобытий);
	
КонецПроцедуры // ДинамическаяКнопкаПолучитьВыполнитьНажатие()

&НаСервере
Функция ДинамическаяКнопкаПолучитьНаСервере(ДанныеСписка, ИмяКнопки, МассивЛогаСобытий)	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Результат = ОбработкаОбъект.ДинамическаяКнопкаПолучить(ДанныеСписка, ИмяКнопки, МассивЛогаСобытий);
	
	Возврат Результат;	
	
КонецФункции

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ДинамическаяКнопкаОтправитьВыполнитьНажатие(Команда)
	
	ТекущаяДата = ТекущаяДата();
	ИмяСобытия	= "Отправка документов";
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	Если ДанныеСписка.ИмяСписка = "" Тогда
		Возврат;
	КонецЕсли;	
	
	МассивЛогаСобытий = Новый Массив;
	
	СоответствиеКолонок = ПолучитьСтруктуруКолонок(ДанныеСписка.ИмяСписка);
	Результат = ДинамическаяКнопкаОтправитьНаСервере(ДанныеСписка, Команда.Имя, СоответствиеКолонок, МассивЛогаСобытий);
	
	ДанныеСписка.Вставить("ИмяКнопки", Команда.Имя);
	
	Если Результат.ЕстьОшибка = Ложь Тогда
		Если ОтправитьДокументы(ДанныеСписка, Результат.ИмяСтатуса, Результат.ИмяДокументаИсточника, Результат.ТипДокумента, СоответствиеКолонок, Результат.НужнаПодпись) Тогда
			МассивЛогаСобытий 	= Новый Массив;
			ТекстЛогаСобытий 	= "Время выполнения " + ЭКОМ_ОбщегоНазначенияКлиент.СекундыВоВремяНаКлиенте(ТекущаяДата() - ТекущаяДата).Строка;
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Информация"), ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
			ОтобразитьЛогСобытий(МассивЛогаСобытий);
		КонецЕсли;
	Иначе	          
		ТекстЛогаСобытий 	= "Время выполнения " + ЭКОМ_ОбщегоНазначенияКлиент.СекундыВоВремяНаКлиенте(ТекущаяДата() - ТекущаяДата).Строка;
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Информация"), ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		ОтобразитьЛогСобытий(МассивЛогаСобытий);
	КонецЕсли;
		
КонецПроцедуры 

&НаСервере
Функция ДинамическаяКнопкаОтправитьНаСервере(ДанныеСписка, ИмяКнопки, СоответствиеКолонок, МассивЛогаСобытий)	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Результат = ОбработкаОбъект.ДинамическаяКнопкаОтправить(ДанныеСписка, ИмяКнопки, СоответствиеКолонок, МассивЛогаСобытий);
	
	Возврат Результат;	
	
КонецФункции

&НаКлиенте
Функция ПолучитьСтруктуруКолонок(ИмяСписка)

	// Проверяем наличие колонок
	СоответствиеКолонок = Новый Соответствие;
	Для каждого СтрКолонки Из Элементы[ИмяСписка].ПодчиненныеЭлементы Цикл
		ИмяКолонки = СтрЗаменить(СтрКолонки.Имя, ИмяСписка, "");
		ИмяКолонки = СтрЗаменить(ИмяКолонки, "ГруппаКолонок_", "");
		СоответствиеКолонок.Вставить(ИмяКолонки, ИмяКолонки);
	КонецЦикла;
	
	Возврат СоответствиеКолонок;
	
КонецФункции 

&НаКлиенте
Процедура ДинамическаяКнопкаВыполнитьНажатие(Команда)
	
	ИмяСобытия = "Создание документов";
	МассивЛогаСобытий = Новый Массив;
	НачалоВыполнения 	= ТекущаяДата();
	
	ТекущаяСтраница = Элементы.ОсновнаяПанель.ТекущаяСтраница;
	Если ТекущаяСтраница = Неопределено Тогда
		ТекстЛогаСобытий = "Выполнение остановлено. Не определена выбранная страница формы";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		Возврат;
	КонецЕсли;
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	ИмяКнопки 	 = Команда.Имя;
	Кнопка		 = Элементы.Найти(ДанныеСписка.ИмяСписка + "ГруппаДокументы" + ИмяКнопки);
		
	Если Кнопка = Неопределено Тогда
		ТекстЛогаСобытий = "Выполнение остановлено. Среди элементов формы не найдена кнопка с именем " + ИмяКнопки;
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

		Возврат;
	КонецЕсли;
	
	СинонимКнопки = Кнопка.Заголовок;
		
	ПоляИсточникаДанных = ПоляДокументовТЧ(ДанныеСписка.ИмяСписка);
	ПозицияТекущейСтроки = Неопределено;
	МассивСтрок     = ПолучитьСтрокиДинамическогоСпискаДляОбработки(ДанныеСписка, ПозицияТекущейСтроки);
	//ВыбранныеСтроки = ДокументыПоСтрокеВСтруктуруНаКлиенте(МассивСтрок, ПоляИсточникаДанных, Ложь, Ложь); //++ЭКОМ_ДА Закомментил, не используется
	
	//++ЭКОМ_ДА 2021.10.25(( Проверяем на созданные документы  
	ВОбработку = Новый Массив;
	Повторные  = Новый Массив;
	
	СинонимПриемника="";
	ЗаполнитьМассивПовторных(СинонимКнопки,ДанныеСписка.ТипОбмена,МассивСтрок,ВОбработку,Повторные,СинонимПриемника);
	
	КлючЗаписиЦепочкиДокументов = Элементы[ДанныеСписка.ИмяСписка].ТекущаяСтрока;
	Если ВОбработку.Количество() > 0 Тогда
		// Начать обработку данных
		Если ЭтаФорма.ДоступноВыполнениеВФоне Тогда
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("СинонимКнопки", 		СинонимКнопки);
			СтруктураПараметров.Вставить("Роль", 				ДанныеСписка.ТипОбмена);
			СтруктураПараметров.Вставить("ВыбранныеСтроки", 	ВОбработку); //МассивСтрок
			СтруктураПараметров.Вставить("КлючЗаписиЦепочкиДокументов", КлючЗаписиЦепочкиДокументов);
			СтруктураПараметров.Вставить("НачалоВыполнения", 	НачалоВыполнения);
			СтруктураПараметров.Вставить("ДанныеСписка", 		ДанныеСписка);
			СтруктураПараметров.Вставить("ПозицияТекущейСтроки", ПозицияТекущейСтроки);
			СтруктураПараметров.Вставить("ТипДокумента", 		"");
			СтруктураПараметров.Вставить("МассивЛогаСобытий", 	МассивЛогаСобытий);
			СтруктураПараметров.Вставить("ИмяСобытия",			ИмяСобытия);
		                         
			НачатьВыполнениеВФоне(СтруктураПараметров, "СоздатьДокументПоДинамическойКнопке", "Создаем документы - [" + СинонимКнопки + "]...");
			
		Иначе		
			//СоздатьДокументПоДинамическойКнопкеНаСервере(ЭтаФорма.ОбработкаТип, СинонимКнопки, МассивСтрок, ДанныеСписка, МассивЛогаСобытий);	  			
			//ЗавершитьСозданиеДокументов(ДанныеСписка, МассивЛогаСобытий, НачалоВыполнения, ПозицияТекущейСтроки, МассивСтрок, ИмяСобытия);
			СоздатьДокументПоДинамическойКнопкеНаСервере(ЭтаФорма.ОбработкаТип, СинонимКнопки, ВОбработку, ДанныеСписка, МассивЛогаСобытий);	  			
			ЗавершитьСозданиеДокументов(ДанныеСписка, МассивЛогаСобытий, НачалоВыполнения, ПозицияТекущейСтроки, ВОбработку, ИмяСобытия, КлючЗаписиЦепочкиДокументов);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Повторные.Количество() > 0 Тогда
		
		СтруктураПараметров = Новый Структура;  
		СтруктураПараметров.Вставить("СинонимКнопки"  		, СинонимКнопки);
		СтруктураПараметров.Вставить("Роль"           		, ДанныеСписка.ТипОбмена);
	    СтруктураПараметров.Вставить("СинонимПриемника"  	, СинонимПриемника);
		СтруктураПараметров.Вставить("НачалоВыполнения"    	, НачалоВыполнения);
		СтруктураПараметров.Вставить("ДанныеСписка"        	, ДанныеСписка);
		СтруктураПараметров.Вставить("ПозицияТекущейСтроки"	, ПозицияТекущейСтроки);
		СтруктураПараметров.Вставить("ТипДокумента"        	, "");
		СтруктураПараметров.Вставить("МассивЛогаСобытий"   	, МассивЛогаСобытий);
		СтруктураПараметров.Вставить("ИмяСобытия" 		   	, ИмяСобытия);
		СтруктураПараметров.Вставить("КлючЗаписиЦепочкиДокументов", КлючЗаписиЦепочкиДокументов);
		
		ПроверкаМассиваСоздаваемыхДокументов(СтруктураПараметров,Повторные, СинонимКнопки);
		
	КонецЕсли;
	//++ЭКОМ_ДА 2021.10.25))
	
КонецПроцедуры

//++ЭКОМ_ДА(( Используется для проверки повторно создаваемых документов 1С
&НаСервере
Процедура ЗаполнитьМассивПовторных(СинонимКнопки,ТипОбмена,МассивСтрок,ВОбработку,Повторные,СинонимПриемника)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.РаспределитьКоллекциюСоздаваемыхДокументов(СинонимКнопки,ТипОбмена,МассивСтрок,ВОбработку,Повторные,СинонимПриемника);
	
	Для Каждого Стр Из Повторные Цикл 
		Стр.Вставить("СтрокаОбработана",Ложь);	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаМассиваСоздаваемыхДокументов(СтруктураПараметров, Повторные, СинонимКнопки)

	Данные = Новый Структура;
	Данные.Вставить("МассивСтрок", Повторные);
	
	Кнопки = Новый СписокЗначений;	
	Кнопки.Добавить("КнопкаДа"        , "Да");
	Кнопки.Добавить("КнопкаДаДляВсех" , "Да, для всех");
	Кнопки.Добавить("КнопкаНет"       , "Нет");
	Кнопки.Добавить("КнопкаНетДляВсех", "Нет, для всех");
	ОтправитьДокумент = Истина;
		
	Для каждого ЭлМассива Из Повторные Цикл	
		
		Если ЭлМассива.СтрокаОбработана = Ложь Тогда
			ОтправитьДокумент = Ложь; 
			
			Данные.Вставить("ИндексМассива"         , Повторные.Найти(ЭлМассива));
			Данные.Вставить("МассивЛогаСобытий"     , СтруктураПараметров.МассивЛогаСобытий);
			Данные.Вставить("ПредставлениеДокумента", ЭлМассива.НомерЗаказа);
			Данные.Вставить("СтруктураПараметров"	, СтруктураПараметров);
			Данные.Вставить("СинонимПриемника"		, СтруктураПараметров.СинонимПриемника);
			Данные.Вставить("СинонимКнопки"		    , СинонимКнопки);
			
			СтрокаИсточник   = "";
			ДокументИсточник = Неопределено;
			Если Найти(НРег(СинонимКнопки), "заказ") > 0  И ЭлМассива.Свойство("ДокументЗаказа", ДокументИсточник) Тогда
				СтрокаИсточник = " " + Строка(ДокументИсточник);
			ИначеЕсли Найти(НРег(СинонимКнопки), "реализацию") > 0 И ЭлМассива.Свойство("ДокументРеализации", ДокументИсточник) Тогда
				СтрокаИсточник = " " + Строка(ДокументИсточник);
			КонецЕсли;
			
			Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросСозданиеДокументов", ЭтаФорма, Данные); 		
			ПоказатьВопрос(Оповещение, "По заказу " + ЭлМассива.НомерЗаказа + ", документ" + СтрокаИсточник + " уже был создан ранее." 
			+ Символы.ПС + "Продолжить?", Кнопки, 0);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОтправитьДокумент Тогда

		Если Повторные.Количество() > 0 Тогда
			
			Если СтруктураПараметров.ДанныеСписка.ИмяСписка = "СписокДляПоставщика" Тогда
				ЭКОМДокументы    = МассивЭКОМДокументовЦепочкиПоставщика();
			ИначеЕсли СтруктураПараметров.ДанныеСписка.ИмяСписка = "СписокДляПокупателя" Тогда
				ЭКОМДокументы    = МассивЭКОМДокументовЦепочкиПокупателя();
			Иначе
				ЭКОМДокументы = Новый Массив;
			КонецЕсли;
			
			Если СписокВыбранныхСтрок.Количество() Тогда   				
				Для Каждого Строка Из Повторные Цикл
					Для Каждого ИмяЭКОМДок Из ЭКОМДокументы Цикл
						Если Строка.Свойство(ИмяЭКОМДок) И ЗначениеЗаполнено(Строка[ИмяЭКОМДок]) Тогда
							СписокВыбранныхСтрок.Добавить(Строка[ИмяЭКОМДок]);
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			Иначе
				Для Каждого Строка Из Повторные Цикл
					Строка.Вставить("Повтор", Истина);
				КонецЦикла;
			КонецЕсли;
			
			 //Начать обработку данных
			Если ЭтаФорма.ДоступноВыполнениеВФоне Тогда
				
				СтруктураПараметров.Вставить("ВыбранныеСтроки", Повторные);
				НачатьВыполнениеВФоне(СтруктураПараметров, "СоздатьДокументПоДинамическойКнопке", "Создаем документы - [" + СтруктураПараметров.СинонимКнопки + "]...");
				
			Иначе		
				СоздатьДокументПоДинамическойКнопкеНаСервере(ЭтаФорма.ОбработкаТип, СтруктураПараметров.СинонимКнопки, 
					Повторные, СтруктураПараметров.ДанныеСписка, СтруктураПараметров.МассивЛогаСобытий);	  			
				ЗавершитьСозданиеДокументов(СтруктураПараметров.ДанныеСписка, СтруктураПараметров.МассивЛогаСобытий, 
					СтруктураПараметров.НачалоВыполнения, СтруктураПараметров.ПозицияТекущейСтроки, Повторные, СтруктураПараметров.ИмяСобытия, СтруктураПараметров.КлючЗаписиЦепочкиДокументов);
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросСозданиеДокументов(Результат, Данные) Экспорт
	
	ИмяСобытия = "Повторное создание";	
	Если Результат <> КодВозвратаДиалога.Отмена Тогда
    	Данные.МассивСтрок[Данные.ИндексМассива].СтрокаОбработана = Истина;
    КонецЕсли;    
    Если Результат = "КнопкаНет" Тогда		
        Данные.МассивСтрок.Удалить(Данные.ИндексМассива);
		ТекстЛогаСобытий = "Документ("+ Данные.СинонимПриемника +") по заказу №"+ Данные.ПредставлениеДокумента + " не создан, так как был создан ранее!";		
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Предупреждение"), ИмяСобытия);
		мЛог = Новый Массив();
		мЛог.Добавить(ЗаписьСтруктурыЛога);
		ОтобразитьЛогСобытий(мЛог);

    ИначеЕсли Результат = "КнопкаНетДляВсех" Тогда		
        Данные.МассивСтрок.Очистить();
		ТекстЛогаСобытий =  "Документы("+Данные.СинонимПриемника+") не созданы, так как были созданы ранее!";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Предупреждение"), ИмяСобытия);
		мЛог = Новый Массив();
		мЛог.Добавить(ЗаписьСтруктурыЛога);
		ОтобразитьЛогСобытий(мЛог);
		 
    ИначеЕсли Результат = "КнопкаДаДляВсех" Тогда		
        Для Каждого ТекущаяСтрокаМассива Из Данные.МассивСтрок Цикл
            ТекущаяСтрокаМассива.СтрокаОбработана = Истина;
        КонецЦикла;	
    КонецЕсли;
    
    ПроверкаМассиваСоздаваемыхДокументов(Данные.СтруктураПараметров,Данные.МассивСтрок, Данные.СинонимКнопки);
    
КонецПроцедуры
//++ЭКОМ_ДА))

&НаКлиенте
Процедура ЗавершитьСозданиеДокументов(ДанныеСписка, МассивЛогаСобытий, НачалоВыполнения, ПозицияТекущейСтроки, ВыбранныеСтроки, ИмяСобытия, КлючЗаписиЦепочкиДокументов = Неопределено)

	//УправлениеПометкамиДинамическогоСписка(Ложь, ДанныеСписка); //MOD-1485
	ОбновитьДинамическийСписок(ДанныеСписка, Истина, ВыбранныеСтроки, КлючЗаписиЦепочкиДокументов);
	СохранитьВыделенныеСтроки(ВыбранныеСтроки, ДанныеСписка.ИмяСписка);
	ОбновитьЦепочкуДокументовНаКлиенте(ДанныеСписка.ИмяСписка, КлючЗаписиЦепочкиДокументов);
    ВосстановитьТекущуюСтрокуСписка(ПозицияТекущейСтроки, ДанныеСписка.ИмяСписка, ВыбранныеСтроки);  
	
	ТекстЛогаСобытий = "Время выполнения " + ЭКОМ_ОбщегоНазначенияКлиент.СекундыВоВремяНаКлиенте(ТекущаяДата() - НачалоВыполнения).Строка;
	ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Информация"), ИмяСобытия);
	МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
	ОтобразитьЛогСобытий(МассивЛогаСобытий);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьДокументПоДинамическойКнопкеНаСервере(ОбработкаТип, СинонимКнопки, ВыбранныеСтроки, ДанныеСписка, МассивЛогаСобытий)

	Если НЕ ЗначениеЗаполнено(ОбработкаТип) Тогда
	     Возврат;     
	КонецЕсли;
	 
	ОбработкаОбъект = Новый (ЗначениеИзСтрокиВнутр(ОбработкаТип));

	ТЗДокументы =  ОбработкаОбъект.ДинамическаяКнопкаПолучитьТаблицу(СинонимКнопки, ДанныеСписка.ИмяРеквизитаТаблицы, ВыбранныеСтроки, МассивЛогаСобытий);
		
	ОбработкаОбъект.СоздатьДокументПоДинамическойКнопке(ТЗДокументы, СинонимКнопки, ДанныеСписка.ТипОбмена, МассивЛогаСобытий); 
		
КонецПроцедуры

// Функция получает данные в виде таблицы значений из элемента формы
//
// Параметры:
//  ИмяЭлемента  - Строка - имя элемента формы
//
// Возвращаемое значение:
//   ТаблицаЗначений   - данные элемента формы
//
&НаСервере
Функция ТаблицаЗначенийИзЭлементаФормы(ИмяЭлемента)
    
    Схема		= Элементы[ИмяЭлемента].ПолучитьИсполняемуюСхемуКомпоновкиДанных();
    Настройки   = Элементы[ИмяЭлемента].ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
    
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    Макет = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(Макет);
    
    ТЗ = Новый ТаблицаЗначений;
    
    ПроцессорВывода  = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    ПроцессорВывода.УстановитьОбъект(ТЗ);
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
    
    Возврат ТЗ;
    
КонецФункции // ДанныеИзЭлементаФормы()

// Функция получает колонки таблицы значений из элемента формы
//
// Параметры:
//  ИмяЭлемента  - Строка - имя элемента формы
//
// Возвращаемое значение:
//   Массив   - коллекция колонок таблицы значений
//
&НаСервере
Функция КолонкиТаблицыЗначенийИзЭлементаФормы(ИмяЭлемента) Экспорт
    
    Колонки = Новый Массив;
    
    Для Каждого Колонка Из ТаблицаЗначенийИзЭлементаФормы(ИмяЭлемента).Колонки Цикл
        Колонки.Добавить(Колонка.Имя);
    КонецЦикла;
    
    Возврат Колонки;
    
КонецФункции // КолонкиТаблицыЗначенийИзЭлементаФормы()

&НаСервере
Функция ПолучитьСписокНастроекНаСервере(МассивНастроек = Неопределено)
    Перем Результат;
    
    ОбъектЭтаОбработка = РеквизитФормыВЗначение("Объект");
    Результат          = ОбъектЭтаОбработка.ПолучитьСписокНастроек(МассивНастроек);

    Возврат Результат;
КонецФункции

&НаСервере
Функция  КомандаПечатьЮЗДНаСервере(МассивДокументовЮЗД, МассивЛогаСобытий, ОриентацияСтраницы)
	
	МассивДокументовСФайлами= Новый Массив;

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	МассивВидовДокументовЮЗД = Новый Массив;
	Выполнить("ЭКОМ_ОбщегоНазначения.ПолучитьПервичныеВидыДокументовЮЗД(МассивВидовДокументовЮЗД);");
	Выполнить("ЭКОМ_ОбщегоНазначения.ПолучитьИсправительныеВидыДокументовЮЗД(МассивВидовДокументовЮЗД);");
	Выполнить("ЭКОМ_ОбщегоНазначения.ПолучитьКорректировочныеВидыДокументовЮЗД(МассивВидовДокументовЮЗД);");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭКОМ_Объекты_События.Идентификатор,
	|	ЭКОМ_Объекты_События.Документ_Основание,
	|	ЭКОМ_Объекты_События.ВидДокумента,
	|	ЭКОМ_GLN.ПрофильОбмена
	|ИЗ
	|	РегистрСведений.ЭКОМ_Объекты_События КАК ЭКОМ_Объекты_События
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭКОМ_GLN КАК ЭКОМ_GLN
	|		ПО ЭКОМ_Объекты_События.Организация = ЭКОМ_GLN.Объект
	|ГДЕ
	|	ЭКОМ_Объекты_События.Документ_Основание В(&ДокументыЮЗД)
	|	И ЭКОМ_Объекты_События.ВидДокумента В(&ВыдыДокументовЮЗД)";
	
	Запрос.УстановитьПараметр("ВыдыДокументовЮЗД", МассивВидовДокументовЮЗД);
	Запрос.УстановитьПараметр("ДокументыЮЗД"     , МассивДокументовЮЗД);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Ошибка = Новый Структура;
		Ошибка.Вставить("ЕстьОшибка" , Ложь);
		Ошибка.Вставить("КодОшибки"  , "");
		Ошибка.Вставить("ТекстОшибки", "");  
		
		ИД_Документа = Прав(Выборка.Идентификатор, 36);
		СтрокаBase64PDF_Документа = ОбработкаОбъект.ИзвлечьPDF_ЭКОМ(Выборка.ПрофильОбмена, ИД_Документа, Ошибка, МассивЛогаСобытий,ОриентацияСтраницы);
		
		ИмяФайла = Строка(Выборка.ВидДокумента) + " № " + Строка(Выборка.Документ_Основание.Номер) + " от " + Формат(Выборка.Документ_Основание.Дата, "ДФ=dd.MM.yy");
		
		Данные = Новый Структура;
		Данные.Вставить("СтрокаBase64PDF_Документа", СтрокаBase64PDF_Документа);
		Данные.Вставить("ИмяФайла"                 , ИмяФайла);
		Данные.Вставить("ТекстОшибки"              , "Код: " + Ошибка.КодОшибки + " - " + Ошибка.ТекстОшибки);
		Данные.Вставить("ИД_Документа"             , ИД_Документа);
		МассивДокументовСФайлами.Добавить(Данные);
				
	КонецЦикла;
	
	Возврат МассивДокументовСФайлами;
	
КонецФункции

&НаСервере
Функция  КомандаПолучитьВсеДокументыЮЗД(МассивДокументовЮЗД, МассивЛогаСобытий)
			
	МассивДокументовСФайлами= Новый Массив;

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	МассивВидовДокументовЮЗД = Новый Массив;
	Выполнить("ЭКОМ_ОбщегоНазначения.ПолучитьПервичныеВидыДокументовЮЗД(МассивВидовДокументовЮЗД);");
	Выполнить("ЭКОМ_ОбщегоНазначения.ПолучитьИсправительныеВидыДокументовЮЗД(МассивВидовДокументовЮЗД);");
	Выполнить("ЭКОМ_ОбщегоНазначения.ПолучитьКорректировочныеВидыДокументовЮЗД(МассивВидовДокументовЮЗД);");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭКОМ_Объекты_События.Идентификатор КАК Идентификатор,
	|	ЭКОМ_Объекты_События.Документ_Основание КАК Документ_Основание,
	|	ЭКОМ_Объекты_События.ВидДокумента КАК ВидДокумента,
	|	ЭКОМ_GLN.ПрофильОбмена КАК ПрофильОбмена,
	|	ЭКОМ_Объекты_События.ИдентификаторИспр КАК ИдентификаторИспр
	|ИЗ
	|	РегистрСведений.ЭКОМ_Объекты_События КАК ЭКОМ_Объекты_События
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭКОМ_GLN КАК ЭКОМ_GLN
	|		ПО ЭКОМ_Объекты_События.Организация = ЭКОМ_GLN.Объект
	|ГДЕ
	|	ЭКОМ_Объекты_События.Документ_Основание В(&ДокументыЮЗД)
	|	И ЭКОМ_Объекты_События.ВидДокумента В(&ВыдыДокументовЮЗД)";
	
	Запрос.УстановитьПараметр("ВыдыДокументовЮЗД", МассивВидовДокументовЮЗД);
	Запрос.УстановитьПараметр("ДокументыЮЗД"     , МассивДокументовЮЗД);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		
		Ошибка = Новый Структура;
		Ошибка.Вставить("ЕстьОшибка" , Ложь);
		Ошибка.Вставить("КодОшибки"  , "");
		Ошибка.Вставить("ТекстОшибки", "");  
		
		ИД_Документа = Прав(Выборка.Идентификатор, 36);
		СтруктураСвязанныхДокументовBase64 = ОбработкаОбъект.ЗагрузитьСвязанныеДокументыЮЗД(Выборка.ПрофильОбмена, ИД_Документа, Ошибка, МассивЛогаСобытий);
		
		
		ИмяФайла = Строка(Выборка.ВидДокумента) + " № " + Строка(Выборка.Документ_Основание.Номер) + " от " + Формат(Выборка.Документ_Основание.Дата, "ДФ=dd.MM.yy");
		
		Данные = Новый Структура;
		Данные.Вставить("СтруктураСвязанныхДокументовBase64", СтруктураСвязанныхДокументовBase64);
		Данные.Вставить("ИмяФайла"                 , ИмяФайла);
		Данные.Вставить("ТекстОшибки"              , "Код: " + Ошибка.КодОшибки + " - " + Ошибка.ТекстОшибки);
		Данные.Вставить("ИД_Документа"             , ИД_Документа);
		МассивДокументовСФайлами.Добавить(Данные);
		
		Если ЗначениеЗаполнено(Выборка.ИдентификаторИспр) Тогда
		
			ЗапросИспр = Новый Запрос;
			ЗапросИспр.Текст = 
			"ВЫБРАТЬ
			|	ЭКОМ_Объекты_События.Идентификатор КАК Идентификатор,
			|	ЭКОМ_Объекты_События.Документ_Основание КАК Документ_Основание,
			|	ЭКОМ_Объекты_События.ВидДокумента КАК ВидДокумента,
			|	ЭКОМ_GLN.ПрофильОбмена КАК ПрофильОбмена,
			|	ЭКОМ_Объекты_События.ИдентификаторИспр КАК ИдентификаторИспр
			|ИЗ
			|	РегистрСведений.ЭКОМ_Объекты_События КАК ЭКОМ_Объекты_События
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭКОМ_GLN КАК ЭКОМ_GLN
			|		ПО ЭКОМ_Объекты_События.Организация = ЭКОМ_GLN.Объект
			|ГДЕ
			|	ЭКОМ_Объекты_События.Идентификатор ПОДОБНО ""%"" + &ИдентификаторОснования
			|	И ЭКОМ_Объекты_События.ВидДокумента В(&ВыдыДокументовЮЗД)";
			
			ЗапросИспр.УстановитьПараметр("ВыдыДокументовЮЗД", МассивВидовДокументовЮЗД);
			ЗапросИспр.УстановитьПараметр("ИдентификаторОснования"     , Выборка.ИдентификаторИспр);
			
			РезультатЗапросаИспр = ЗапросИспр.Выполнить();	
			ВыборкаИспр = РезультатЗапросаИспр.Выбрать();
			Пока ВыборкаИспр.Следующий() Цикл
				
				
				Ошибка = Новый Структура;
				Ошибка.Вставить("ЕстьОшибка" , Ложь);
				Ошибка.Вставить("КодОшибки"  , "");
				Ошибка.Вставить("ТекстОшибки", "");  
				
				ИД_Документа = Прав(ВыборкаИспр.Идентификатор, 36);
				СтруктураСвязанныхДокументовBase64 = ОбработкаОбъект.ЗагрузитьСвязанныеДокументыЮЗД(ВыборкаИспр.ПрофильОбмена, ИД_Документа, Ошибка, МассивЛогаСобытий);
				
				
				ИмяФайла = Строка(ВыборкаИспр.ВидДокумента) + " № " + Строка(ВыборкаИспр.Документ_Основание.Номер) + " от " + Формат(ВыборкаИспр.Документ_Основание.Дата, "ДФ=dd.MM.yy");
				
				Данные = Новый Структура;
				Данные.Вставить("СтруктураСвязанныхДокументовBase64", СтруктураСвязанныхДокументовBase64);
				Данные.Вставить("ИмяФайла"                 , ИмяФайла);
				Данные.Вставить("ТекстОшибки"              , "Код: " + Ошибка.КодОшибки + " - " + Ошибка.ТекстОшибки);
				Данные.Вставить("ИД_Документа"             , ИД_Документа);
				МассивДокументовСФайлами.Добавить(Данные);
				
			КонецЦикла;			
		КонецЕсли;	
	КонецЦикла;
	
	Возврат МассивДокументовСФайлами;
	
КонецФункции

&НаКлиенте
Процедура КомандаПечатьЮЗД(Команда)
	
		ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	
	Если  ДанныеСписка.ИмяСписка = "СписокДляПокупателя" Тогда
		ПечатьЮЗД(ДанныеСписка, "ДокументЭКОМ_ЮЗД");
	ИначеЕсли  ДанныеСписка.ИмяСписка = "СписокДляПоставщика" Тогда
		ПечатьЮЗД(ДанныеСписка, "ДокументСЧФ");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЮЗД(ДанныеСписка, ИмяДокументаЮЗД)
	
	
    КлючУникальностиФормы = "Docrobot_ФормаНастроекПечати";
	
	ПараметрыНастроек = Новый Структура;
	
	ПараметрыНастроек.Вставить("ИмяДокументаЮЗД", 	ИмяДокументаЮЗД);
	ПараметрыНастроек.Вставить("ИмяСписка", 	ДанныеСписка.ИмяСписка);
		
	Оповещение = Новый ОписаниеОповещения("ОбработатьНастройкиПечати", ЭтаФорма);
    
    ФормаНастройкиПечатиЮЗ = ОткрытьФорму(ПолноеИмяОбработки + ".Форма.УФ_ФормаНастройкиПечатиЮЗД", ПараметрыНастроек, ЭтаФорма, КлючУникальностиФормы,,,Оповещение);
    ФормаНастройкиПечатиЮЗ.Активизировать();

КонецПроцедуры	

&НаКлиенте
Процедура КомандаПолучитьВсеДокументыЮЗДЦепочки(Команда)
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	
	Если  ДанныеСписка.ИмяСписка = "СписокДляПокупателя" Тогда
		ПолучитьВсеДокументыЮЗДЦепочки(ДанныеСписка, "ДокументЭКОМ_ЮЗД");
	ИначеЕсли  ДанныеСписка.ИмяСписка = "СписокДляПоставщика" Тогда
		ПолучитьВсеДокументыЮЗДЦепочки(ДанныеСписка, "ДокументСЧФ");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВсеДокументыЮЗДЦепочки(ИмяСписка, ИмяДокументаЮЗД)
	
	ИмяСобытия = "Получить все документы ЮЗД";
	МассивЛогаСобытий = Новый Массив;
	
	ПозицияТекущейСтроки = Неопределено;	
	СписокДокументов = ПолучитьСтрокиДинамическогоСпискаДляОбработки(ИмяСписка, ПозицияТекущейСтроки);
	
	МассивДокументовЮЗД = Новый Массив;
	Для Каждого ВыбраннаяСтрока Из СписокДокументов Цикл		
		Если ЗначениеЗаполнено(ВыбраннаяСтрока[ИмяДокументаЮЗД]) Тогда
			МассивДокументовЮЗД.Добавить(ВыбраннаяСтрока[ИмяДокументаЮЗД]);
		КонецЕсли;					
	КонецЦикла;
	
	Если МассивДокументовЮЗД.Количество() = 0 Тогда
		ТекстЛогаСобытий = "Список выбранных документов пуст. Проверьте заполнение поля - " + ИмяДокументаЮЗД;
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Предупреждение"), ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		
	Иначе	
		ЗначениеПоУмолчанию = Неопределено;
		Измерение           = Неопределено; 
		Обязательно         = Истина;
		
		ЛокальныйКаталогРабочийКаталог = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_Рабочий_Каталог"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
		
		// Проверка каталогов INBOX
		Если НЕ Прав(ЛокальныйКаталогРабочийКаталог,1) = "\" Тогда	
			ЛокальныйКаталогРабочийКаталогЦепочекЮЗД = ЛокальныйКаталогРабочийКаталог + "\" + "Цепочки ЮЗД Документов\"; 
		Иначе
			ЛокальныйКаталогРабочийКаталогЦепочекЮЗД = ЛокальныйКаталогРабочийКаталог + "Цепочки ЮЗД Документов\";
		КонецЕсли;
		СоздатьКаталог(ЛокальныйКаталогРабочийКаталогЦепочекЮЗД);
		
		МассивДокументовСФайлами = КомандаПолучитьВсеДокументыЮЗД(МассивДокументовЮЗД, МассивЛогаСобытий);
		ДокументыЗаписаны = Ложь;	
		Если МассивДокументовСФайлами.Количество() = 0 Тогда
			ТекстЛогаСобытий = "Выбранные документы не найдены в регистре ЭКОМ События по документам";
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Предупреждение"), ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
			
		Иначе
			Для каждого ЭлементМассива Из МассивДокументовСФайлами Цикл
				СодержаниеОшибки = СтрЗаменить(ЭлементМассива.ТекстОшибки, "Код:  - ","");
				Если ЗначениеЗаполнено(СодержаниеОшибки) Тогда
					ТекстЛогаСобытий = "Нет файлов для загрузки по документу:" + ЭлементМассива.ИмяФайла + "( ИД Документа: " + ЭлементМассива.ИД_Документа+". Текст ошибки: " + СодержаниеОшибки + ").";
					ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
					МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);		
				Иначе
					ИмяКаталогаДляЮЗДЦепочки = ЛокальныйКаталогРабочийКаталогЦепочекЮЗД + ЭлементМассива.ИмяФайла  + "\" ;				
					КаталогДляЮЗДЦепочки = Новый Файл(ИмяКаталогаДляЮЗДЦепочки);
					Если КаталогДляЮЗДЦепочки.Существует()=Ложь Тогда
						СоздатьКаталог(ИмяКаталогаДляЮЗДЦепочки);
					Иначе
						УдалитьФайлы(ИмяКаталогаДляЮЗДЦепочки); 
					КонецЕсли;
					
					Для Каждого ДокСтруктуры Из ЭлементМассива.СтруктураСвязанныхДокументовBase64 Цикл
						Для Каждого ФайлСоответствие из ДокСтруктуры.Значение Цикл
							ДвоичныеДанныеДокумента = Base64Значение(ФайлСоответствие.Значение);
							ИмяФайла = ФайлСоответствие.Ключ;						
							Если НЕ ДвоичныеДанныеДокумента = Неопределено Тогда
								ФайлПолноеИмя = ИмяКаталогаДляЮЗДЦепочки + ИмяФайла;
								ДвоичныеДанныеДокумента.Записать(ФайлПолноеИмя);
								ТекстЛогаСобытий = "Файл сохранен - " + ФайлПолноеИмя;
								ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Успешно"), ИмяСобытия);
								МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);								
								ДокументыЗаписаны = Истина;
							Иначе	
								ТекстЛогаСобытий = "Не найден документ на платформе - " + ЭлементМассива.ИмяФайла + ". Попробуйте позже. /// " 
								+ ЭлементМассива.ТекстОшибки;
								ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Предупреждение"), ИмяСобытия);
								МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
								
							КонецЕсли;						
						КонецЦикла;				
					КонецЦикла;
				КонецЕсли;	
			КонецЦикла;			
		КонецЕсли;
		
		Если ДокументыЗаписаны = Истина Тогда
			Попытка
				ЗапуститьПриложение(ИмяКаталогаДляЮЗДЦепочки);
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;
		
	ОтобразитьЛогСобытий(МассивЛогаСобытий);
	
КонецПроцедуры

&НаКлиенте	
Процедура ОбработатьНастройкиПечати(Результат, Данные) Экспорт
	
	МассивЛогаСобытий = Новый Массив;
	ИмяСобытия = "Печать ЮЗД";

	
	Если Результат.ОтменаОперации = Ложь Тогда
		
		ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
		ИмяДокументаЮЗД = Результат.ИмяДокументаЮЗД;
		
		ПозицияТекущейСтроки = Неопределено;	
		СписокДокументов = ПолучитьСтрокиДинамическогоСпискаДляОбработки(ДанныеСписка, ПозицияТекущейСтроки);
		
		МассивДокументовЮЗД = Новый Массив;
		Для Каждого ВыбраннаяСтрока Из СписокДокументов Цикл		
			Если ЗначениеЗаполнено(ВыбраннаяСтрока[ИмяДокументаЮЗД]) Тогда
				Если ИмяДокументаЮЗД = "ДокументСЧФ" Тогда
					Если Результат.РежимЗагрузкиДокументов = "ЗагружатьПоследнююВерсиюДокумента" Тогда
						МассивДокументовЮЗД.Добавить(ВыбраннаяСтрока[ИмяДокументаЮЗД]);
					ИначеЕсли Результат.РежимЗагрузкиДокументов = "ЗагружатьИсходнуюВерсиюДокумента" Тогда
						МассивДокументовЮЗД.Добавить(ВыбраннаяСтрока.СчетФактураИсходная);
					ИначеЕсли Результат.РежимЗагрузкиДокументов = "ЗагружатьВсеВерсииДокументов" Тогда
						МассивДокументовЮЗД.Добавить(ВыбраннаяСтрока.СчетФактураИсходная);
						
						Если ЗначениеЗаполнено(ВыбраннаяСтрока.СчетФактураКорректировочная) Тогда
							МассивДокументовЮЗД.Добавить(ВыбраннаяСтрока.СчетФактураКорректировочная);
						КонецЕсли;
						
						Если (ЗначениеЗаполнено(ВыбраннаяСтрока.СчетФактураИсправительная)) 
							И (НЕ ВыбраннаяСтрока.СчетФактураИсправительная = ВыбраннаяСтрока.СчетФактураКорректировочная) Тогда
							МассивДокументовЮЗД.Добавить(ВыбраннаяСтрока.СчетФактураИсправительная);
						КонецЕсли;
					КонецЕсли;
				Иначе
					МассивДокументовЮЗД.Добавить(ВыбраннаяСтрока[ИмяДокументаЮЗД]);
				КонецЕсли;
			КонецЕсли;					
		КонецЦикла;
		
		Если МассивДокументовЮЗД.Количество() = 0 Тогда
			ТекстЛогаСобытий = "Список выбранных документов пуст. Проверьте заполнение поля - " + ИмяДокументаЮЗД;
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Предупреждение"), ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
			
		Иначе	
			
			ЗначениеПоУмолчанию = Неопределено;
			Измерение           = Неопределено; 
			Обязательно         = Истина;
			ЛокальныйКаталогРабочийКаталог = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_Рабочий_Каталог"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
			
			// Проверка каталогов INBOX
			ДанныеОС = ЭКОМ_ПолучитьРазделительПутиОСКлиента();
			РазделительПути = ДанныеОС.Получить("РазделительПути");
			
			ПроверитьЛокальныйКаталог(ЛокальныйКаталогРабочийКаталог, РазделительПути);
			ЛокальныйКаталогРабочийКаталогДляПечатныхФорм = ЛокальныйКаталогРабочийКаталог + "Печатные формы счет-фактур" + РазделительПути;
			
			СоздатьКаталог(ЛокальныйКаталогРабочийКаталогДляПечатныхФорм);
			
			МассивДокументовСФайлами = КомандаПечатьЮЗДНаСервере(МассивДокументовЮЗД, МассивЛогаСобытий,Результат.ОриентацияСтраницы);
			ДокументыЗаписаны = Ложь;	
			Если МассивДокументовСФайлами.Количество() = 0 Тогда
				ТекстЛогаСобытий = "Выбранные документы не найдены в регистре ЭКОМ События по документам";
				ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Предупреждение"), ИмяСобытия);
				МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
				
			Иначе
				Для каждого ЭлементМассива Из МассивДокументовСФайлами Цикл
					
					ДвоичныеДанныеPDF_Документа = Base64Значение(ЭлементМассива.СтрокаBase64PDF_Документа);
					
					Если НЕ ДвоичныеДанныеPDF_Документа = Неопределено Тогда
						ФайлПолноеИмя = ЛокальныйКаталогРабочийКаталогДляПечатныхФорм + ЭлементМассива.ИмяФайла + " ИД - " + ЭлементМассива.ИД_Документа + ".pdf";
						ДвоичныеДанныеPDF_Документа.Записать(ФайлПолноеИмя);
						
						ТекстЛогаСобытий = "Файл сохранен - " + ФайлПолноеИмя;
						ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Успешно"), ИмяСобытия);
						МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
						
						ДокументыЗаписаны = Истина;
					Иначе	
						ТекстЛогаСобытий = "Не найден документ на платформе - " + ЭлементМассива.ИмяФайла + ". Попробуйте позже. /// " 
						+ ЭлементМассива.ТекстОшибки;
						ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Предупреждение"), ИмяСобытия);
						МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если ДокументыЗаписаны = Истина Тогда
				Попытка
					ЗапуститьПриложение(ЛокальныйКаталогРабочийКаталогДляПечатныхФорм);
				Исключение
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ТекстЛогаСобытий = "Печать документов ЮЗД отменена.";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Информация"), ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		
	КонецЕсли;
	
	ОтобразитьЛогСобытий(МассивЛогаСобытий);
					
КонецПроцедуры

&НаКлиенте
Процедура СписокДляЭТРНВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	           
	Если Элемент = Неопределено 
		Или Элемент.ТекущиеДанные = Неопределено 
		Или ВыбраннаяСтрока = Неопределено Тогда
        Возврат;
    КонецЕсли;
    СтандартнаяОбработка = Ложь;
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	Если Поле.Имя = ДанныеСписка.ИмяСписка + "Пометка" Тогда
		
		Если Не Элемент.ТекущиеДанные = Неопределено Тогда
			Если Элемент.ТекущиеДанные.Пометка Тогда
				СнятьПометку(Элемент.ТекущиеДанные.Накладная);
			Иначе
				ПоставитьПометку(Элемент.ТекущиеДанные.Накладная);
			КонецЕсли;
		КонецЕсли;
		
		//Параметр в динамическом списке нужно обновить
		УстановитьПараметрДинамическогоСписка(ДанныеСписка.ИмяРеквизитаТаблицы, "масПомеченныхДоков", СписокВыбранныхСтрок.ВыгрузитьЗначения());	
			
    ИначеЕсли Поле.Имя = "СписокДляЭТРНПалеты" Тогда
		
		ТекСтрока = Элемент.ТекущиеДанные;
			
		Если ЗначениеЗаполнено(ТекСтрока.Накладная) Тогда
						
			ЗначениеПоУмолчанию = Неопределено;
			Измерение           = Неопределено; 
			Обязательно         = Ложь;
			ДокументСсылкаИмя = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_ВидРеализацииПоставщик"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
			
			ПараметрыФормыDesscc = Новый Структура("ДокументСсылкаИмя", ДокументСсылкаИмя);
						
			Оповещение = Новый ОписаниеОповещения("ОбработатьВыборПалеты", ЭтаФорма);
			ОткрытьФорму(ПолноеИмяОбработки + ".Форма.УФ_ФормаDesscc", Новый Структура("ДокументСсылкаИмя, ДокументСсылка", ДокументСсылкаИмя, ТекСтрока.Накладная),,,,, Оповещение);
			
		КонецЕсли;
		
    ИначеЕсли Поле.Имя = "СписокДляЭТРНТранспорт" Тогда
		
		ТекСтрока = Элемент.ТекущиеДанные;
		
		Документ = Неопределено;
		Если ЗначениеЗаполнено(ТекСтрока.ДокументЭКОМ) Тогда
			Документ = ТекСтрока.ДокументЭКОМ;
		Иначе	
			Документ = ТекСтрока.Накладная;
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Документ", Документ);
		
		КлючЗаписи = ПолучитьКлючЭКОМ_ТранспортнаяИнформация(Отбор); 
		Структура = Новый Структура("Ключ", КлючЗаписи);
		
		Если КлючЗаписи = Неопределено Тогда
			
			ОткрытьФорму("РегистрСведений.ЭКОМ_ТранспортнаяИнформация.ФормаЗаписи", Отбор,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		Иначе
			
			ОткрытьФорму("РегистрСведений.ЭКОМ_ТранспортнаяИнформация.ФормаЗаписи", Структура,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "СписокДляЭТРНТекстОшибки" Тогда
		
		Подсказка = "Текст ошибки";
		Оповещение = Новый ОписаниеОповещения("ЗавершениеПросмотраТекстОшибки", ЭтаФорма);
		ПоказатьВводСтроки(Оповещение, Элемент.ТекущиеДанные.ТекстОшибки, Подсказка, 0, Истина);
		
	ИначеЕсли Поле.Имя = "СписокДляЭТРНКомментарий" Тогда
		
		Подсказка = "Комментарий к ЭТРН";
		Оповещение = Новый ОписаниеОповещения("ЗавершениеПросмотраТекстОшибки", ЭтаФорма);
		ПоказатьВводСтроки(Оповещение, Элемент.ТекущиеДанные.Комментарий, Подсказка, 0, Истина);
		
	КонецЕсли;
	
	ЭлементОбъект = ОпределитьТипОбъекта(Элемент, Поле.Имя);
    Если ЗначениеЗаполнено(ЭлементОбъект) Тогда
        ПоказатьЗначение( , ЭлементОбъект);
    КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДляCondraВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент = Неопределено 
		Или Элемент.ТекущиеДанные = Неопределено 
		Или ВыбраннаяСтрока = Неопределено Тогда
        Возврат;
    КонецЕсли;
    СтандартнаяОбработка = Ложь;
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	Если Поле.Имя = ДанныеСписка.ИмяСписка + "Пометка" Тогда
		
		Если Не Элемент.ТекущиеДанные = Неопределено Тогда
			Если Элемент.ТекущиеДанные.Пометка Тогда
				СнятьПометку(Элемент.ТекущиеДанные.ДокументОригинала);
			Иначе
				ПоставитьПометку(Элемент.ТекущиеДанные.ДокументОригинала);
			КонецЕсли;
		КонецЕсли;
		
		//Параметр в динамическом списке нужно обновить
		УстановитьПараметрДинамическогоСписка(ДанныеСписка.ИмяРеквизитаТаблицы, "масПомеченныхДоков", СписокВыбранныхСтрок.ВыгрузитьЗначения());	
			
    ИначеЕсли Поле.Имя = "СписокДляCondraТекстОшибки" Тогда
		
		Подсказка = "Текст ошибки";
		Оповещение = Новый ОписаниеОповещения("ЗавершениеПросмотраТекстОшибки", ЭтаФорма);
		ПоказатьВводСтроки(Оповещение, Элемент.ТекущиеДанные.ТекстОшибки, Подсказка, 0, Истина);
		
	ИначеЕсли Поле.Имя = "СписокДляCondraИнформация" Тогда
		
		Подсказка = "Причина отклонения";
		Оповещение = Новый ОписаниеОповещения("ЗавершениеПросмотраТекстОшибки", ЭтаФорма);
		ПоказатьВводСтроки(Оповещение, Элемент.ТекущиеДанные.Информация, Подсказка, 0, Истина);
		
	ИначеЕсли Поле.Имя = "СписокДляCondraОткрытьКаталог" Тогда
		
		ЗначениеПоУмолчанию = Неопределено;
		Измерение           = Неопределено; 
		Обязательно         = Ложь;
		ЛокальныйКаталогINBOX_Архив = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_Локальный_Каталог_INBOX_Архив"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
		
		Файлы 	= НайтиФайлы(ЛокальныйКаталогINBOX_Архив, Элемент.ТекущиеДанные.ИмяФайла, Истина); 
		Если Файлы.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Файл 	= Файлы.Получить(0);
		
		Если Файл.ЭтоФайл() И Файл.Существует() Тогда
			ЗапуститьПриложение("C:\Windows\explorer.exe /select, " + Файл.ПолноеИмя);
		КонецЕсли;
		
		Возврат;
		
	ИначеЕсли Поле.Имя = "СписокДляCondraДокументОригинала" И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДокументОригинала) Тогда
		
		Оповещение = Новый ОписаниеОповещения("ЗавершениеПросмотраТекстОшибки", ЭтаФорма);
		ПоказатьЗначение(Оповещение, Элемент.ТекущиеДанные.ДокументОригинала);
		
	ИначеЕсли Поле.Имя = "СписокДляCondraДокументПринятия" И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДокументПринятия) Тогда
		
		Оповещение = Новый ОписаниеОповещения("ЗавершениеПросмотраТекстОшибки", ЭтаФорма);
		ПоказатьЗначение(Оповещение, Элемент.ТекущиеДанные.ДокументПринятия);
		
	ИначеЕсли Поле.Имя = "СписокДляCondraДокументОтклонения" И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДокументОтклонения) Тогда
		
		Оповещение = Новый ОписаниеОповещения("ЗавершениеПросмотраТекстОшибки", ЭтаФорма);
		ПоказатьЗначение(Оповещение, Элемент.ТекущиеДанные.ДокументОтклонения);
		
	ИначеЕсли Элемент.ТекущиеДанные.НаправлениеОбмена = ПредопределенноеЗначение("Перечисление.ЭКОМ_НаправлениеОбмена.Исходящий") Тогда
		
		СтруктураЗаписи = Новый Структура("TRANSGUID", Элемент.ТекущиеДанные.ИД_Документа);
		МассивСтруктураЗаписи = Новый Массив;
		МассивСтруктураЗаписи.Добавить(СтруктураЗаписи);
		КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.ЭКОМ_ЦепочкиНеструктурированныхДокументов", МассивСтруктураЗаписи);
		ОткрытьФорму("РегистрСведений.ЭКОМ_ЦепочкиНеструктурированныхДокументов.ФормаЗаписи", Новый Структура("Ключ", КлючЗаписи));
		
	ИначеЕсли ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДокументОригинала) Тогда
		
		Оповещение = Новый ОписаниеОповещения("ЗавершениеПросмотраТекстОшибки", ЭтаФорма);
		ПоказатьЗначение(Оповещение, Элемент.ТекущиеДанные.ДокументОригинала);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючЭКОМ_ТранспортнаяИнформация(Отбор)
	
	Рег = РегистрыСведений.ЭКОМ_ТранспортнаяИнформация;
	КлючЗаписи = Рег.СоздатьКлючЗаписи(Отбор);
	
	МенеджерЗаписи = РегистрыСведений.ЭКОМ_ТранспортнаяИнформация.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ = Отбор.Документ;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат КлючЗаписи;
	Иначе
		 Возврат Неопределено;	
	КонецЕсли;
			
КонецФункции

&НаСервере
Функция ПолучитьКлючЭКОМ_CondraДатаПоследнейТранзакции(Отбор)
	
	РегистрСведений = РегистрыСведений.ЭКОМ_ЦепочкиНеструктурированныхДокументов;
	Возврат РегистрСведений.СоздатьКлючЗаписи(Отбор);
			
КонецФункции

&НаКлиенте
Процедура ОбновитьТаблицуПалетНаКлиенте(ИмяДинамическогоСписка)
	
	Если ИмяДинамическогоСписка = "СписокДляЭТРН" Тогда
		 
		 МассивДокументов = Новый Массив;
		 
		 ТекущаяСтрока = Элементы[ИмяДинамическогоСписка].ТекущиеДанные;
		 Если НЕ ТекущаяСтрока = Неопределено Тогда
			 МассивДокументов.Добавить(ТекущаяСтрока.Накладная);			
		 КонецЕсли;
		 
		 ТаблицаПалет.Параметры.УстановитьЗначениеПараметра("масПомеченныхДоков" , МассивДокументов);
		 
	 КонецЕсли;
	    
КонецПроцедуры

&НаКлиенте
Процедура ВызватьКомандуПоИмениОперации(ПараметрыВызова)
    
    Выполнить(ПараметрыВызова.ИмяПроцедуры + "(" + ПараметрыВызова.Команда + ")");
    
КонецПроцедуры

&НаСервере
Процедура СписокДляПоставщикаПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ПриОбновленииСоставаПользовательскихНастроекНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СписокДляПокупателяПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПриОбновленииСоставаПользовательскихНастроекНаСервере();

КонецПроцедуры

&НаСервере
Процедура СписокДляЭТРНПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПриОбновленииСоставаПользовательскихНастроекНаСервере();

КонецПроцедуры

&НаСервере
Процедура СписокДляCondraПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПриОбновленииСоставаПользовательскихНастроекНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСоставПользовательскихНастроекНаСервере(ДанныеСписка)
	
	Если ЭтаФорма.НеобходимоУстановитьОбновление = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеСписка.ИмяРеквизитаТаблицы = "СписокДляПрайсЛиста" Тогда
	   	Элементы[ДанныеСписка.ИмяФильтра].ИспользуемаяТаблица = Элементы[ДанныеСписка.ИмяСписка];
	КонецЕсли;
	
	НачалоИмениЭлементов = "ПрограммноПользовательскиеНастройки";
	//	Очищаем все созданные элементы с отборами, через удаление главной группы
	Для Каждого Эл Из Элементы[ДанныеСписка.ИмяФильтра].ПодчиненныеЭлементы Цикл
		
		Если Найти(Эл.Имя, НачалоИмениЭлементов) > 0 Тогда
		     Элементы.Удалить(Эл);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбязательныеОтборы = Новый Массив;
	ОбязательныеОтборы.Добавить("Организация");
	ОбязательныеОтборы.Добавить("Контрагент");
	ОбязательныеОтборы.Добавить("ТочкаДоставки");
	ОбязательныеОтборы.Добавить("ДатаЗаказа");
	ОбязательныеОтборы.Добавить("ДатаЭТРН");
	ОбязательныеОтборы.Добавить("Дата");
    СоздатьПользовательскиеНастройки(ДанныеСписка, ОбязательныеОтборы);

	//Поиск элемента пользовательских настроек по уникальному идентификатору раздела настроек
	ИдентификаторПользовательскойНастройки = ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки;
	ПользовательскийОтбор = ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторПользовательскойНастройки);
	Если ПользовательскийОтбор = Неопределено Тогда
	     Возврат;
	КонецЕсли;
	 
	// Создаём главную группу
	ОтборыКолонка 		               = ЭтаФорма.Элементы.Добавить(НачалоИмениЭлементов + "ОтборыКолонка" + ДанныеСписка.Путь, Тип("ГруппаФормы"), Элементы[ДанныеСписка.ИмяФильтра]);
	ОтборыКолонка.Вид                  = ВидГруппыФормы.ОбычнаяГруппа;
	ОтборыКолонка.Группировка          = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ОтборыКолонка.ОтображатьЗаголовок  = Ложь;
	ОтборыКолонка.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	
	// Создаём группу период
	ПолеГруппыОтбораПериодГлавный                      = ЭтаФорма.Элементы.Добавить(НачалоИмениЭлементов + "ПериодГлавный" + ДанныеСписка.Путь, Тип("ГруппаФормы"), ОтборыКолонка);
	ПолеГруппыОтбораПериодГлавный.Вид                  = ВидГруппыФормы.ОбычнаяГруппа;
	ПолеГруппыОтбораПериодГлавный.Группировка          = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ПолеГруппыОтбораПериодГлавный.ОтображатьЗаголовок  = Истина;
	ПолеГруппыОтбораПериодГлавный.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
    ПолеГруппыОтбораПериодГлавный.Заголовок            = "Период";
	ПолеГруппыОтбораПериодГлавный.ЗаголовокСвернутогоОтображения = "Период";
	ПолеГруппыОтбораПериодГлавный.Поведение                      = ПоведениеОбычнойГруппы.Свертываемая;
	ПолеГруппыОтбораПериодГлавный.Отображение                    = ОтображениеОбычнойГруппы.Нет;
	ПолеГруппыОтбораПериодГлавный.ОтображениеУправления          = ОтображениеУправленияОбычнойГруппы.Картинка;
	ПолеГруппыОтбораПериодГлавный.ЦветТекстаЗаголовка            = WebЦвета.СинеСерый;
	
	// Создаём группу расширенные настройки
	ПолеГруппыОтбораФильтрРасширенный                      = ЭтаФорма.Элементы.Добавить(НачалоИмениЭлементов + "ФильтрРасширенный" + ДанныеСписка.Путь, Тип("ГруппаФормы"), ОтборыКолонка);
	ПолеГруппыОтбораФильтрРасширенный.Вид                  = ВидГруппыФормы.ОбычнаяГруппа;
	ПолеГруппыОтбораФильтрРасширенный.Группировка          = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ПолеГруппыОтбораФильтрРасширенный.ОтображатьЗаголовок  = Истина;
	ПолеГруппыОтбораФильтрРасширенный.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
    ПолеГруппыОтбораФильтрРасширенный.Заголовок            = "Фильтр расширенный";
	ПолеГруппыОтбораФильтрРасширенный.ЗаголовокСвернутогоОтображения = "Фильтр расширенный";
	ПолеГруппыОтбораФильтрРасширенный.Поведение                      = ПоведениеОбычнойГруппы.Свертываемая;
	ПолеГруппыОтбораФильтрРасширенный.Отображение                    = ОтображениеОбычнойГруппы.Нет;
	ПолеГруппыОтбораФильтрРасширенный.ОтображениеУправления          = ОтображениеУправленияОбычнойГруппы.Картинка;
	
	// Сохраняем название форм в ТЗ
	
	//	Начинаем добавлять настройки на форму
	НомерЭлемента = 0;
	Для каждого ЭлОтбора из ПользовательскийОтбор.Элементы Цикл
		
		ПутьКДанным = ДанныеСписка.ИмяРеквизитаТаблицы + ".КомпоновщикНастроек.ПользовательскиеНастройки[0][" + НомерЭлемента + "]."; 
		ИмяЭлемента = НачалоИмениЭлементов + "КомпоновщикНастроекПользовательскиеНастройкиЭлемент" + ДанныеСписка.Путь + НомерЭлемента;
					
		Если ТипЗнч(ЭлОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			
			ИмяКнопки = "";
			Если Найти(ЭлОтбора.Представление, "Программный отбор") > 0 Тогда
				
				ИмяКнопки = ЭлОтбора.ПредставлениеПользовательскойНастройки;
				
				// Создаём подгруппу период
				ПолеГруппыОтбораПериод = ЭтаФорма.Элементы.Добавить(НачалоИмениЭлементов + "Группа" + ИмяКнопки + ДанныеСписка.Путь + НомерЭлемента, Тип("ГруппаФормы"), ПолеГруппыОтбораПериодГлавный);
				ПолеГруппыОтбораПериод.Вид                  = ВидГруппыФормы.ОбычнаяГруппа;
				ПолеГруппыОтбораПериод.Группировка          = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
				ПолеГруппыОтбораПериод.ОтображатьЗаголовок  = Ложь;
				ПолеГруппыОтбораПериод.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
				
				ПолеИспользование = ЭтаФорма.Элементы.Добавить(ИмяЭлемента + "Использование", Тип("ПолеФормы"), ПолеГруппыОтбораПериод);
				ПолеИспользование.Вид                = ВидПоляФормы.ПолеФлажка;
				ПолеИспользование.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
				ПолеИспользование.Заголовок          = ЭлОтбора.ПредставлениеПользовательскойНастройки;
				ПолеИспользование.ПутьКДанным        = ПутьКДанным + "Использование";
								
			Иначе	
				
				// Создаём группу 
				ПолеГруппыОтбораСУсловием = ЭтаФорма.Элементы.Добавить(НачалоИмениЭлементов + "Группа" + ИмяКнопки + ДанныеСписка.Путь + НомерЭлемента, Тип("ГруппаФормы"), ПолеГруппыОтбораФильтрРасширенный);
				ПолеГруппыОтбораСУсловием.Вид                  = ВидГруппыФормы.ОбычнаяГруппа;
				ПолеГруппыОтбораСУсловием.Группировка          = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				ПолеГруппыОтбораСУсловием.ОтображатьЗаголовок  = Ложь;
				ПолеГруппыОтбораСУсловием.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
				ПолеГруппыОтбораСУсловием.Отображение          = ОтображениеОбычнойГруппы.Нет;
				
				ПолеИспользование = ЭтаФорма.Элементы.Добавить(ИмяЭлемента + "Использование", Тип("ПолеФормы"), ПолеГруппыОтбораСУсловием);
				ПолеИспользование.Вид                 = ВидПоляФормы.ПолеФлажка;
				ПолеИспользование.ПоложениеЗаголовка  = ПоложениеЗаголовкаЭлементаФормы.Лево;
				ПолеИспользование.Заголовок           = Строка(ЭлОтбора.ТипГруппы);
				ПолеИспользование.ПутьКДанным         = ПутьКДанным + "Использование";

			КонецЕсли;
			
		    НомерЭлементаГруппы = 0;
			Для каждого ЭлОтбораСписка Из ЭлОтбора.Элементы Цикл
				
				ЗаголовокЭлемента = Строка(ЭлОтбораСписка.ЛевоеЗначение);
				Если ЗначениеЗаполнено(ЭлОтбораСписка.ПредставлениеПользовательскойНастройки)  Тогда
					ЗаголовокЭлемента = ЭлОтбораСписка.ПредставлениеПользовательскойНастройки;
				КонецЕсли;

				ПутьКДанным = ДанныеСписка.ИмяРеквизитаТаблицы + ".КомпоновщикНастроек.ПользовательскиеНастройки[0]["+НомерЭлемента+"][" + НомерЭлементаГруппы +"]."; 
				ИмяЭлемента = НачалоИмениЭлементов + "КомпоновщикНастроекПользовательскиеНастройкиЭлемент" + ДанныеСписка.Путь + НомерЭлемента + НомерЭлементаГруппы;
				
				// Для периода
				Если Найти(ЭлОтбораСписка.Представление, "Программный отбор") > 0 Тогда
					
					ЗаголовокПолеЗначение = СокрЛП(СтрЗаменить(ЗаголовокЭлемента, СокрЛП(ЭлОтбораСписка.ЛевоеЗначение), ""));
					
					ПолеЗначение = ЭтаФорма.Элементы.Добавить("ЗначениеПериода" + ДанныеСписка.ИмяРеквизитаТаблицы + ИмяКнопки + ЗаголовокПолеЗначение, Тип("ПолеФормы"), ПолеГруппыОтбораПериод);
					ПолеЗначение.Вид                = ВидПоляФормы.ПолеВвода;
					ПолеЗначение.ВыбиратьТип        = Ложь;
					ПолеЗначение.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
					ПолеЗначение.Заголовок          = ЗаголовокПолеЗначение;
					ПолеЗначение.ПутьКДанным        = ПутьКДанным + "Значение";
					ПолеЗначение.РастягиватьПоГоризонтали = Ложь;
					ПолеЗначение.АвтоМаксимальнаяШирина   = Ложь;
					ПолеЗначение.КнопкаВыпадающегоСписка  = Ложь;
					ПолеЗначение.Ширина                   = 7;
					ПолеЗначение.ФорматРедактирования     = "ДФ=dd.MM.yy";
					ПолеЗначение.УстановитьДействие("ПриИзменении", "ИзменитьПериодФильтра");
					
				Иначе
					
					//	Создаём группу под каждую настройку
					ПолеГруппыОтбора = ЭтаФорма.Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ПолеГруппыОтбораСУсловием);
					ПолеГруппыОтбора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
					ПолеГруппыОтбора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
					ПолеГруппыОтбора.ОтображатьЗаголовок = Ложь;
					ПолеГруппыОтбора.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
					
					//	Создаём элементы с привязкой к настройкам компоновщика данных
					ПолеИспользование = ЭтаФорма.Элементы.Добавить(ИмяЭлемента + "Использование", Тип("ПолеФормы"), ПолеГруппыОтбора);
					ПолеИспользование.Вид                = ВидПоляФормы.ПолеФлажка;
					ПолеИспользование.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
					ПолеИспользование.Заголовок          = ЗаголовокЭлемента;
					ПолеИспользование.ПутьКДанным        = ПутьКДанным + "Использование";
					
					ПолеВидСравнения = ЭтаФорма.Элементы.Добавить(ИмяЭлемента + "ВидСравненияЭлементаОтбора", Тип("ПолеФормы"), ПолеГруппыОтбора);
					ПолеВидСравнения.Вид                      = ВидПоляФормы.ПолеВвода;
					ПолеВидСравнения.ПоложениеЗаголовка       = ПоложениеЗаголовкаЭлементаФормы.Нет;
					ПолеВидСравнения.РастягиватьПоГоризонтали = Ложь;
					ПолеВидСравнения.ПутьКДанным              = ПутьКДанным + "ВидСравнения";
					
					ПолеЗначение = ЭтаФорма.Элементы.Добавить(ИмяЭлемента + "Значение", Тип("ПолеФормы"), ПолеГруппыОтбора);
					ПолеЗначение.Вид                = ВидПоляФормы.ПолеВвода;
					ПолеЗначение.ВыбиратьТип        = Ложь;
					ПолеЗначение.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
					ПолеЗначение.ПутьКДанным        = ПутьКДанным + "Значение";
					
				КонецЕсли;
				
				НомерЭлементаГруппы = НомерЭлементаГруппы + 1;
	
			КонецЦикла;
			
			ИмяКнопки = СтрЗаменить(ИмяКнопки, " ", "_");
			
			// Для периода
			Если Найти(ЭлОтбора.Представление, "Программный отбор") > 0 Тогда
								
				// Создадим кнопку и привяжем к ней команду
				КнопкаЭлементПериод		     = ЭтаФорма.Элементы.Добавить("ВыбратьПериод" + ДанныеСписка.ИмяРеквизитаТаблицы + ИмяКнопки, Тип("КнопкаФормы"), ПолеГруппыОтбораПериод);
				КнопкаЭлементПериод.Заголовок	= "...";
				КнопкаЭлементПериод.ИмяКоманды  = "КомандаВыбратьПериод";
				КнопкаЭлементПериод.Картинка    = БиблиотекаКартинок.УстановитьИнтервал;
				КнопкаЭлементПериод.Отображение = ОтображениеКнопки.Картинка;
				КнопкаЭлементПериод.ВажностьПриОтображении = ВажностьПриОтображении.Высокая;
				КнопкаЭлементПериод.Ширина  = 3;


			КонецЕсли;
			
			Если НЕ Элементы.Найти("УдалитьФильтр" + ДанныеСписка.ИмяРеквизитаТаблицы + ИмяКнопки) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			// Кнопка удаления (кроме обязательных отборов)
			Если Найти(ЭлОтбора.Представление, "Программный отбор") > 0 
				И ОбязательныеОтборы.Найти(ИмяКнопки) = Неопределено Тогда
				
				// Создадим кнопку и привяжем к ней команду
				КнопкаЭлементУдалить		     = ЭтаФорма.Элементы.Добавить("УдалитьФильтр" + ДанныеСписка.ИмяРеквизитаТаблицы + ИмяКнопки, Тип("КнопкаФормы"), ПолеГруппыОтбораПериод);
				КнопкаЭлементУдалить.Заголовок	 = "Удалить";
				КнопкаЭлементУдалить.ИмяКоманды  = "КомандаУдалитьФильтр";
				КнопкаЭлементУдалить.Картинка     = БиблиотекаКартинок.ЭКОМ_ОчиститьЛогСобытий;
				КнопкаЭлементУдалить.Отображение  = ОтображениеКнопки.Картинка;
				КнопкаЭлементУдалить.ВажностьПриОтображении = ВажностьПриОтображении.Высокая;
				КнопкаЭлементУдалить.Ширина  = 3;
				
			ИначеЕсли Найти(ЭлОтбора.Представление, "Программный отбор") = 0 Тогда 
				
				// Создадим кнопку и привяжем к ней команду
				КнопкаЭлементУдалить		     = ЭтаФорма.Элементы.Добавить("УдалитьФильтр" + ДанныеСписка.ИмяРеквизитаТаблицы + ИмяКнопки, Тип("КнопкаФормы"), ПолеГруппыОтбораСУсловием);
				КнопкаЭлементУдалить.Заголовок	 = "Удалить";
				КнопкаЭлементУдалить.ИмяКоманды  = "КомандаУдалитьФильтр";
				КнопкаЭлементУдалить.Картинка     = БиблиотекаКартинок.ЭКОМ_ОчиститьЛогСобытий;
				КнопкаЭлементУдалить.Отображение  = ОтображениеКнопки.Картинка;
				КнопкаЭлементУдалить.ВажностьПриОтображении = ВажностьПриОтображении.Высокая;
				КнопкаЭлементУдалить.Ширина  = 3;
				
			КонецЕсли;			
						
		Иначе
			
			ЗаголовокЭлемента = Строка(ЭлОтбора.ЛевоеЗначение);
			Если ЗначениеЗаполнено(ЭлОтбора.ПредставлениеПользовательскойНастройки)  Тогда
				ЗаголовокЭлемента = ЭлОтбора.ПредставлениеПользовательскойНастройки;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ЭлОтбора.ПредставлениеПользовательскойНастройки) Тогда
							
				// Создаём группу 
				ПолеГруппыВертикальная = ЭтаФорма.Элементы.Добавить(НачалоИмениЭлементов + "Группа" + ЗаголовокЭлемента + ДанныеСписка.Путь + НомерЭлемента, Тип("ГруппаФормы"), ПолеГруппыОтбораФильтрРасширенный);
				ПолеГруппыВертикальная.Вид                  = ВидГруппыФормы.ОбычнаяГруппа;
				ПолеГруппыВертикальная.Группировка          = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				ПолеГруппыВертикальная.ОтображатьЗаголовок  = Ложь;
				ПолеГруппыВертикальная.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
				ПолеГруппыВертикальная.Отображение          = ОтображениеОбычнойГруппы.Нет;
				
				//	Создаём элементы с привязкой к настройкам компоновщика данных
				
				//	Создаём группу под каждую настройку
				ПолеГруппыОтбора = ЭтаФорма.Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), ПолеГруппыВертикальная);
				ПолеГруппыОтбора.Вид                  = ВидГруппыФормы.ОбычнаяГруппа;
				ПолеГруппыОтбора.Группировка          = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
				ПолеГруппыОтбора.ОтображатьЗаголовок  = Ложь;
				ПолеГруппыОтбора.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
				
				ПолеИспользование = ЭтаФорма.Элементы.Добавить(ИмяЭлемента + "Использование", Тип("ПолеФормы"), ПолеГруппыОтбора);
				ПолеИспользование.Вид                = ВидПоляФормы.ПолеФлажка;
				ПолеИспользование.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
				ПолеИспользование.Заголовок          = ЗаголовокЭлемента;
				ПолеИспользование.ПутьКДанным        = ПутьКДанным + "Использование";
				
				ПолеВидСравнения = ЭтаФорма.Элементы.Добавить(ИмяЭлемента + "ВидСравненияЭлементаОтбора", Тип("ПолеФормы"), ПолеГруппыОтбора);
				ПолеВидСравнения.Вид                      = ВидПоляФормы.ПолеВвода;
				ПолеВидСравнения.ПоложениеЗаголовка       = ПоложениеЗаголовкаЭлементаФормы.Нет;
				ПолеВидСравнения.РастягиватьПоГоризонтали = Ложь;
				ПолеВидСравнения.ПутьКДанным              = ПутьКДанным + "ВидСравнения";
				ПолеВидСравнения.Ширина                   = 7;
				ПолеВидСравнения.Доступность              = Ложь;
			
				ПолеЗначение = ЭтаФорма.Элементы.Добавить(ИмяЭлемента + "Значение", Тип("ПолеФормы"), ПолеГруппыОтбора);
				ПолеЗначение.Вид                = ВидПоляФормы.ПолеВвода;
				ПолеЗначение.ВыбиратьТип        = Ложь;
				ПолеЗначение.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
				ПолеЗначение.ПутьКДанным        = ПутьКДанным + "Значение";
				
				ЗаголовокЭлемента = СтрЗаменить(ЗаголовокЭлемента, " ", "_");
				
				Если Элементы.Найти("УдалитьФильтр" + ДанныеСписка.ИмяРеквизитаТаблицы + ЗаголовокЭлемента) = Неопределено Тогда
					// Кнопка удаления	
					// Создадим кнопку и привяжем к ней команду
					КнопкаЭлементУдалить		     = ЭтаФорма.Элементы.Добавить("УдалитьФильтр" + ДанныеСписка.ИмяРеквизитаТаблицы + ЗаголовокЭлемента, Тип("КнопкаФормы"), ПолеГруппыОтбора);
					КнопкаЭлементУдалить.Заголовок	 = "Удалить";
					КнопкаЭлементУдалить.ИмяКоманды  = "КомандаУдалитьФильтр";
					КнопкаЭлементУдалить.Картинка     = БиблиотекаКартинок.ЭКОМ_ОчиститьЛогСобытий;
					КнопкаЭлементУдалить.Отображение  = ОтображениеКнопки.Картинка;
					
				КонецЕсли;
				
			КонецЕсли;
								
		КонецЕсли;
		
		НомерЭлемента = НомерЭлемента + 1;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьПользовательскиеНастройки(ДанныеСписка, МассивОтборов)
	
	ИдентификаторПользовательскойНастройки = ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки;
	ПользовательскийОтбор = ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторПользовательскойНастройки);
	
	Для каждого ИмяЭлементаОтбора Из МассивОтборов Цикл
		
		Если ПользовательскийОтбор = Неопределено Тогда
		     Продолжить;
		КонецЕсли;
		 
		ДоступныйЭлементОтбора = ПользовательскийОтбор.ДоступныеПоляОтбора.Элементы.Найти(ИмяЭлементаОтбора);
		Если ДоступныйЭлементОтбора = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МассивТипов         = ДоступныйЭлементОтбора.ТипЗначения.Типы();
		
		// Исключаем Null и Неопределено 
		ОпределенныеТипы = Новый Структура;
		ОпределенныеТипы.Вставить("ЗначениеПоУмолчанию", Неопределено);
		Для каждого ЭлементМассива Из МассивТипов Цикл
			
			Если Тип("Null") = ЭлементМассива
				ИЛИ Тип("Неопределено") = ЭлементМассива Тогда
				Продолжить;
			КонецЕсли;	
			
			ОпределенныеТипы.Вставить("Тип", ЭлементМассива);
			
		КонецЦикла;
	
		Для каждого ЭлементСтруктуры Из ОпределенныеТипы Цикл
			
			Если Тип("Строка") = ЭлементСтруктуры.Значение  Тогда
				
				ОпределенныеТипы.Вставить("ЗначениеПоУмолчанию", "");
				ОпределенныеТипы.Вставить("ВидСравнения"       , ВидСравненияКомпоновкиДанных.Содержит);
							
			ИначеЕсли Тип("Число") = ЭлементСтруктуры.Значение  Тогда
				
				ОпределенныеТипы.Вставить("ЗначениеПоУмолчанию", 0);
				ОпределенныеТипы.Вставить("ВидСравнения"       , ВидСравненияКомпоновкиДанных.Равно);

			ИначеЕсли Тип("Дата") = ЭлементСтруктуры.Значение  Тогда
				
				ОпределенныеТипы.Вставить("ЗначениеПоУмолчанию", ТекущаяДата());		
				
			ИначеЕсли Тип("Булево") = ЭлементСтруктуры.Значение  Тогда
				
				ОпределенныеТипы.Вставить("ЗначениеПоУмолчанию", Истина);
				ОпределенныеТипы.Вставить("ВидСравнения"       , ВидСравненияКомпоновкиДанных.Равно);
				
			Иначе
				
				ОпределенныеТипы.Вставить("ЗначениеПоУмолчанию", Новый СписокЗначений);
			    ОпределенныеТипы.Вставить("ВидСравнения"       , ВидСравненияКомпоновкиДанных.ВСписке);

			КонецЕсли;	
			
		КонецЦикла;
		
		ПолеКомпоновки = ДоступныйЭлементОтбора.Поле;
		
		//Поиск уже созданного ранее элемента отбора	
		КоличествоФильтров = 0;
		Для каждого ЭлементОтбора Из ПользовательскийОтбор.Элементы Цикл
			Если ЭлементОтбора.ПредставлениеПользовательскойНастройки = ИмяЭлементаОтбора  
				И Найти(ЭлементОтбора.Представление, "Программный отбор") > 0  Тогда
				
				Если ИмяЭлементаОтбора = "Организация" 
					ИЛИ ИмяЭлементаОтбора = "Контрагент"  
					ИЛИ ИмяЭлементаОтбора = "ТочкаДоставки" Тогда
					
					Если НЕ ТипЗнч(ОпределенныеТипы.ЗначениеПоУмолчанию) = Тип("СписокЗначений") Тогда
						
						 ПользовательскийОтбор.Элементы.Удалить(ЭлементОтбора);
						 ОпределенныеТипы.Вставить("ЗначениеПоУмолчанию", Новый СписокЗначений);
						 ОпределенныеТипы.Вставить("ВидСравнения"       , ВидСравненияКомпоновкиДанных.ВСписке);

						 Прервать;
					КонецЕсли;
					
				КонецЕсли;
				
				КоличествоФильтров = КоличествоФильтров + 1;
				Прервать;
			Иначе
				
				// Проверка на тип 
				Если ИмяЭлементаОтбора = "Организация" 
					ИЛИ ИмяЭлементаОтбора = "Контрагент"  
					ИЛИ ИмяЭлементаОтбора = "ТочкаДоставки" Тогда
					
					Если НЕ ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных")
						 И СокрЛП(ЭлементОтбора.ЛевоеЗначение) = ИмяЭлементаОтбора
						 И ТипЗнч(ОпределенныеТипы.ЗначениеПоУмолчанию) = Тип("СписокЗначений") 
						 И ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит Тогда
						 
						ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
						ЭлементОтбора.ПравоеЗначение = Новый СписокЗначений;
					
						Прервать;
					КонецЕсли;
					
				КонецЕсли;

			КонецЕсли;	
		КонецЦикла;
		
		//Создание нового элемента отбора в пользовательских настройках	
		Если КоличествоФильтров = 0 Тогда
			
			// Для даты создаем два отбора
			Если ТипЗнч(ОпределенныеТипы.ЗначениеПоУмолчанию) = Тип("Дата") Тогда
				
				ГруппаОтбора = ПользовательскийОтбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ГруппаОтбора.Использование = Истина;
				ГруппаОтбора.ТипГруппы     = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
				ГруппаОтбора.Представление = "Программный отбор [" + ИмяЭлементаОтбора + "]";
				ГруппаОтбора.ПредставлениеПользовательскойНастройки = ИмяЭлементаОтбора;
				
				ОсталосьСоздать = 2 - КоличествоФильтров; 
				Для Н = 1 По ОсталосьСоздать Цикл
					//Создание нового элемента отбора в пользовательских настройках	
					Отбор = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					Отбор.ЛевоеЗначение    = ПолеКомпоновки;
					Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
					Отбор.Использование    = Истина;
					Если Н = 1 Тогда
						Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
						Отбор.ПравоеЗначение = НачалоДня(ОпределенныеТипы.ЗначениеПоУмолчанию - 7*24*60*60);
						Отбор.ПредставлениеПользовательскойНастройки  = ИмяЭлементаОтбора + " с ";
					Иначе
						Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
						Отбор.ПравоеЗначение = КонецДня(ОпределенныеТипы.ЗначениеПоУмолчанию);
						Отбор.ПредставлениеПользовательскойНастройки  = ИмяЭлементаОтбора + " по ";
					КонецЕсли;
					Отбор.Представление = "Программный отбор [" + Отбор.ПредставлениеПользовательскойНастройки + "]";

					//Для вывода отбора в быстром доступе необходимо обязательно назначить идентификатор пользовательской настройки
					Отбор.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;		
				КонецЦикла;	
			Иначе
				
				Отбор = ПользовательскийОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				Отбор.ЛевоеЗначение    = ПолеКомпоновки;
				Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
				Отбор.Использование    = Ложь;
				Отбор.ВидСравнения     = ОпределенныеТипы.ВидСравнения;
				Отбор.ПравоеЗначение   = ОпределенныеТипы.ЗначениеПоУмолчанию;
				Отбор.ПредставлениеПользовательскойНастройки = ИмяЭлементаОтбора;
				Отбор.Представление = "Программный отбор [" + ИмяЭлементаОтбора + "]";
				
				//Для вывода отбора в быстром доступе необходимо обязательно назначить идентификатор пользовательской настройки
				Отбор.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;	
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДеревоПользовательскихНастроекНаСервере(ДанныеСписка, МассивНовыхОтборов)
	
	Если ЭтаФорма.НеобходимоУстановитьОбновление = Истина Тогда
		Возврат;
	КонецЕсли;

	//Поиск элемента пользовательских настроек по уникальному идентификатору раздела настроек
	ИдентификаторПользовательскойНастройки = ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки;
	ПользовательскийОтбор = ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторПользовательскойНастройки);
	Если ПользовательскийОтбор = Неопределено Тогда
	     Возврат;
	КонецЕсли;	
	 
	// Получим все существующие элементы в корневом отборе
	СуществующиеОтборы = Новый Соответствие;
	СтрокиКорневые     = ЭтаФорма.ДеревоФильтров.ПолучитьЭлементы();
	Для каждого Эл Из СтрокиКорневые Цикл
		СуществующиеОтборы.Вставить(Эл.Значение, Эл.Значение);
	КонецЦикла;
	
	Для каждого ЭлементОтбора Из ПользовательскийОтбор.Элементы Цикл
		
		ЭтоНовыйОтбор = Ложь;
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;	
		
		Если Найти(ЭлементОтбора.Представление, "Программный отбор") > 0  Тогда
			
			Если СуществующиеОтборы.Получить(ЭлементОтбора.ПредставлениеПользовательскойНастройки) = Неопределено Тогда
				
				ДоступныйЭлементОтбора = ПользовательскийОтбор.ДоступныеПоляОтбора.Элементы.Найти(ЭлементОтбора.ПредставлениеПользовательскойНастройки);
				Если ДоступныйЭлементОтбора = Неопределено Тогда
					Продолжить;;
				КонецЕсли;
				
				МассивТипов = ДоступныйЭлементОтбора.ТипЗначения.Типы();
				
				// Исключаем Null и Неопределено 
				ОпределенныеТипы = Новый Структура;
				Для каждого ЭлементМассива Из МассивТипов Цикл
					
					Если Тип("Null") = ЭлементМассива
						ИЛИ Тип("Неопределено") = ЭлементМассива Тогда
						Продолжить;
					КонецЕсли;	
					
					ОпределенныеТипы.Вставить("Тип", ЭлементМассива);
					
				КонецЦикла;
				
				ИмяСравнения = СокрЛП(ЭлементОтбора.ВидСравнения);		
				ИмяСравнения = НРег(ИмяСравнения);
				
				Попытка
					ОтрицаниеЗначение = БиблиотекаКартинок.ЭКОМ_ВосклицательныйЗнакВыключенСерый;
					Если Найти(ИмяСравнения, "не") = 1 Тогда
					     ОтрицаниеЗначение = БиблиотекаКартинок.ЭКОМ_ВосклицателыныйЗнак;
					КонецЕсли;
				Исключение
					ОтрицаниеЗначение = Неопределено;
				КонецПопытки;
			
				Данные = Новый Структура;
				Данные.Вставить("Иконка"              , "");
				Данные.Вставить("РодительИзменить"    , "");
				Данные.Вставить("ЗначениеВидСравнения", "");
				Данные.Вставить("ТипЗначения"         , "");
				Данные.Вставить("ОтрицаниеЗначение"   , ОтрицаниеЗначение);
				Данные.Вставить("ЗначениеПоУмолчанию" , Неопределено);
				
				Для каждого ЭлементСтруктуры Из ОпределенныеТипы Цикл
					
					Если Тип("Строка") = ЭлементСтруктуры.Значение  Тогда
						
						Данные.Вставить("Иконка"              , БиблиотекаКартинок.Задача);
						Данные.Вставить("РодительИзменить"    , БиблиотекаКартинок.ЭКОМ_ДобавитьНовуюСтроку);
						Данные.Вставить("ЗначениеВидСравнения", ЭлементОтбора.ВидСравнения);
						Данные.Вставить("ТипЗначения"         , "Строка");
						Данные.Вставить("ЗначениеПоУмолчанию" , "");

					ИначеЕсли Тип("Число") = ЭлементСтруктуры.Значение  Тогда
						
						Данные.Вставить("Иконка"             , БиблиотекаКартинок.Калькулятор);
						Данные.Вставить("РодительИзменить"    , БиблиотекаКартинок.ЭКОМ_ДобавитьНовуюСтроку);
						Данные.Вставить("ЗначениеВидСравнения", ЭлементОтбора.ВидСравнения);
						Данные.Вставить("ТипЗначения"         , "Число");
						Данные.Вставить("ЗначениеПоУмолчанию" , 0);

					ИначеЕсли Тип("Дата") = ЭлементСтруктуры.Значение  Тогда
											
						Данные.Вставить("Иконка"             , БиблиотекаКартинок.Календарь);
						Данные.Вставить("РодительИзменить"    , БиблиотекаКартинок.ЭКОМ_ДобавитьНовуюСтроку);
						Данные.Вставить("ЗначениеВидСравнения", ЭлементОтбора.ВидСравнения);
						Данные.Вставить("ТипЗначения"         , "Дата");
			            Данные.Вставить("ЗначениеПоУмолчанию" , Дата(0001, 01, 01));

					ИначеЕсли Тип("Булево") = ЭлементСтруктуры.Значение  Тогда
						
						Данные.Вставить("Иконка"              , БиблиотекаКартинок.ЗаписатьИЗакрыть);
						Данные.Вставить("РодительИзменить"    , "");
						Данные.Вставить("ЗначениеВидСравнения", "");
						Данные.Вставить("ТипЗначения"         , "Булево");
						Данные.Вставить("ЗначениеПоУмолчанию" , Ложь);

					Иначе
						
						ТипЗначения = "";
						ОбъектМетаданных = Метаданные.НайтиПоТипу(ЭлементСтруктуры.Значение);
						Если НЕ ОбъектМетаданных = Неопределено Тогда
							ТипЗначения = ОбъектМетаданных.ПолноеИмя();
						КонецЕсли;
						
						Если Найти(ТипЗначения, "Документ") = 1  Тогда
							
							 ИмяОбъекта = СтрЗаменить(ТипЗначения, "Документ.", "");
						     Данные.Вставить("Иконка"              , БиблиотекаКартинок.Документ);
							 Данные.Вставить("ЗначениеПоУмолчанию" , Документы[ИмяОбъекта].ПустаяСсылка());
							 
						ИначеЕсли Найти(ТипЗначения, "Перечисление") = 1  Тогда
							 
							 ИмяОбъекта = СтрЗаменить(ТипЗначения, "Перечисление.", "");
                           	 Данные.Вставить("Иконка"              , БиблиотекаКартинок.Перечисление);
							 Данные.Вставить("ЗначениеПоУмолчанию" , Перечисления[ИмяОбъекта].ПустаяСсылка());
							 
						ИначеЕсли Найти(ТипЗначения, "Справочник") = 1  Тогда
						
							 ИмяОбъекта = СтрЗаменить(ТипЗначения, "Справочник.", "");
							 Данные.Вставить("Иконка"              , БиблиотекаКартинок.Справочник);
							 Данные.Вставить("ЗначениеПоУмолчанию" , Справочники[ИмяОбъекта].ПустаяСсылка());
							 
						КонецЕсли;
						
						Данные.Вставить("РодительИзменить"    , БиблиотекаКартинок.ЭКОМ_ДобавитьНовуюСтроку);
						Данные.Вставить("ЗначениеВидСравнения", ЭлементОтбора.ВидСравнения);
						Данные.Вставить("ТипЗначения"         , ТипЗначения);
											
					КонецЕсли;	
					
				КонецЦикла;
				
				Если ЭлементОтбора.ПредставлениеПользовательскойНастройки = "Организация" 
					ИЛИ ЭлементОтбора.ПредставлениеПользовательскойНастройки = "Контрагент"  
					ИЛИ ЭлементОтбора.ПредставлениеПользовательскойНастройки = "ТочкаДоставки" Тогда
					
					Если НЕ (Данные.ТипЗначения = "Строка" 
						 ИЛИ Данные.ТипЗначения = "") Тогда
						
						Если НЕ МассивНовыхОтборов.Найти(ЭлементОтбора.ПредставлениеПользовательскойНастройки) = Неопределено Тогда
							ЭлементОтбора.Использование = Истина;
							ЭтоНовыйОтбор               = Истина;
						КонецЕсли;
						ДобавитьОтборДеревоФильтров(ЭлементОтбора, Данные, ЭтоНовыйОтбор);
						
					КонецЕсли;
				Иначе
					
					Если НЕ МассивНовыхОтборов.Найти(ЭлементОтбора.ПредставлениеПользовательскойНастройки) = Неопределено Тогда
						ЭлементОтбора.Использование = Истина;
						ЭтоНовыйОтбор               = Истина;
					КонецЕсли;
					ДобавитьОтборДеревоФильтров(ЭлементОтбора, Данные, ЭтоНовыйОтбор);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ДобавитьОтборДеревоФильтров(ЭлементОтбора, Данные, ЭтоНовыйОтбор)
		
	// Родитель
	НоваяСтрокаДерева = ЭтаФорма.ДеревоФильтров.ПолучитьЭлементы().Добавить();
	НоваяСтрокаДерева.Значение          = ЭлементОтбора.ПредставлениеПользовательскойНастройки;
	НоваяСтрокаДерева.Представление     = ЭлементОтбора.ПредставлениеПользовательскойНастройки;
	НоваяСтрокаДерева.Пометка           = ЭлементОтбора.Использование;
	НоваяСтрокаДерева.Иконка            = Данные.Иконка;
	НоваяСтрокаДерева.Изменить          = Данные.РодительИзменить;
	НоваяСтрокаДерева.ГруппаНастроек    = ЭлементОтбора.ПредставлениеПользовательскойНастройки;
	НоваяСтрокаДерева.ВидСравнения      = Данные.ЗначениеВидСравнения;
	НоваяСтрокаДерева.ТипЗначения       = Данные.ТипЗначения;
	НоваяСтрокаДерева.ОтрицаниеЗначение = Данные.ОтрицаниеЗначение;
	
	Подстрока = Неопределено;
	
	// Потомки
	Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
		Для каждого Эл Из ЭлементОтбора.ПравоеЗначение Цикл	
			Если ЗначениеЗаполнено(Эл.Значение) Тогда
				Подстрока = НоваяСтрокаДерева.ПолучитьЭлементы().Добавить(); 
				Подстрока.Значение    = Эл.Значение; 
				Подстрока.Пометка     = Истина;
				Подстрока.Изменить    = БиблиотекаКартинок.ЭКОМ_ОчиститьЛогСобытий;
				Подстрока.Иконка      = Данные.Иконка;
				Подстрока.ТипЗначения = Данные.ТипЗначения;
			КонецЕсли;				
		КонецЦикла;
		Если ЭтоНовыйОтбор Тогда
			Подстрока = НоваяСтрокаДерева.ПолучитьЭлементы().Добавить(); 
			Подстрока.Значение    = Данные.ЗначениеПоУмолчанию; 
			Подстрока.Пометка     = Истина;
			Подстрока.Изменить    = БиблиотекаКартинок.ЭКОМ_ОчиститьЛогСобытий;
			Подстрока.Иконка      = Данные.Иконка;
			Подстрока.ТипЗначения = Данные.ТипЗначения;	
		КонецЕсли;
					
	// Для строки и числа
	ИначеЕсли НЕ Данные.ТипЗначения = "Булево" Тогда
		Подстрока = НоваяСтрокаДерева.ПолучитьЭлементы().Добавить(); 
		Подстрока.Значение    = ЭлементОтбора.ПравоеЗначение; 
		Подстрока.Пометка     = Истина;
		Подстрока.Изменить    = БиблиотекаКартинок.ЭКОМ_ОчиститьЛогСобытий;
		Подстрока.Иконка      = Данные.Иконка;
		Подстрока.ТипЗначения = Данные.ТипЗначения;
	КонецЕсли;
	
	// Текущая строка
	Если НЕ Подстрока = Неопределено Тогда
	     Элементы.ДеревоФильтров.ТекущаяСтрока = Подстрока.ПолучитьИдентификатор();
	Иначе
		 Элементы.ДеревоФильтров.ТекущаяСтрока = НоваяСтрокаДерева.ПолучитьИдентификатор(); 
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПоТекущейСтранице(ИмяРеквизитаТаблицы)
	
	Элементы.ГруппаДинамическийФильтрСеть.Видимость      	= Ложь;
	Элементы.ГруппаДинамическийФильтрЭТРН.Видимость      	= Ложь;
	Элементы.ГруппаДинамическийФильтрПоставщик.Видимость 	= Ложь;
	Элементы.ГруппаДинамическийФильтрCondra.Видимость 		= Ложь;
	Элементы.ГруппаДинамическийФильтрПрайсЛист.Видимость    = Ложь;
	
	Элементы.СписокДляПокупателяНастройкаСписка.Видимость 	= Ложь;
	Элементы.СписокДляЭТРННастройкаСписка.Видимость       	= Ложь;
	Элементы.СписокДляПоставщикаНастройкаСписка.Видимость 	= Ложь;
	Элементы.СписокДляCondraНастройкаСписка.Видимость		= Ложь;
	Элементы.СписокДляПрайсЛистаНастройкаСписка.Видимость	= Ложь;
    Элементы.НомерИсправления.Видимость                     = Ложь;
	Элементы.ТаблицаПалет.Видимость                         = Ложь;
	
	Элементы.СписокДляПокупателяКомпоновщикНастроекПользовательскиеНастройкиПорядок.Видимость = Ложь;
	Элементы.СписокДляCondraКомпоновщикНастроекПользовательскиеНастройкиПорядок.Видимость = Ложь;
	Элементы.СписокДляПоставщикаКомпоновщикНастроекПользовательскиеНастройкиПорядок.Видимость = Ложь;
	Элементы.СписокДляПрайсЛистаКомпоновщикНастроекПользовательскиеНастройкиПорядок.Видимость = Ложь;
	Элементы.СписокДляЭТРНКомпоновщикНастроекПользовательскиеНастройкиПорядок.Видимость = Ложь;
	
	Элементы.СписокДляПокупателяКомпоновщикНастроекПользовательскиеНастройки.Видимость = Ложь;
	Элементы.СписокДляCondraКомпоновщикНастроекПользовательскиеНастройки.Видимость = Ложь;
	Элементы.СписокДляПоставщикаКомпоновщикНастроекПользовательскиеНастройки.Видимость = Ложь;
	Элементы.СписокДляПрайсЛистаКомпоновщикНастроекПользовательскиеНастройки.Видимость = Ложь;
	Элементы.СписокДляЭТРНКомпоновщикНастроекПользовательскиеНастройки.Видимость = Ложь;
	
	Элементы.КомандаОтчетПоДокументуЭКОМ.Видимость = Ложь;
	Элементы.СписокДляПоставщикаКомандаОтчетПоЗагруженнымЗаказам.Видимость = Ложь;
	
	Если ИмяРеквизитаТаблицы = "СписокДляПоставщика" Тогда
		Элементы.КомандаОтчетПоДокументуЭКОМ.Видимость 			= Истина;
		Элементы.ГруппаДинамическийФильтрПоставщик.Видимость	= Истина;
		Элементы.СписокДляПоставщикаНастройкаСписка.Видимость 	= Истина;
		Элементы.НомерИсправления.Видимость                     = Истина;
		Элементы.СписокДляПоставщикаКомпоновщикНастроекПользовательскиеНастройки.Видимость = Истина;
		Элементы.СписокДляПоставщикаКомпоновщикНастроекПользовательскиеНастройкиПорядок.Видимость = Истина;
        	
	ИначеЕсли ИмяРеквизитаТаблицы = "СписокДляПокупателя" Тогда
		Элементы.СписокДляПоставщикаКомандаОтчетПоЗагруженнымЗаказам.Видимость 	= Истина;
		Элементы.ГруппаДинамическийФильтрСеть.Видимость      					= Истина;
		Элементы.СписокДляПокупателяНастройкаСписка.Видимость 					= Истина;
		Элементы.СписокДляПокупателяКомпоновщикНастроекПользовательскиеНастройки.Видимость = Истина;
        Элементы.СписокДляПокупателяКомпоновщикНастроекПользовательскиеНастройкиПорядок.Видимость = Истина;
		
    ИначеЕсли ИмяРеквизитаТаблицы = "СписокДляЭТРН" Тогда			
		Элементы.ГруппаДинамическийФильтрЭТРН.Видимость      	= Истина;			
		Элементы.СписокДляЭТРННастройкаСписка.Видимость       	= Истина;
		Элементы.СписокДляЭТРНКомпоновщикНастроекПользовательскиеНастройки.Видимость = Истина;
		Элементы.СписокДляЭТРНКомпоновщикНастроекПользовательскиеНастройкиПорядок.Видимость = Истина;
		
	ИначеЕсли ИмяРеквизитаТаблицы = "СписокДляCondra" Тогда			
		Элементы.ГруппаДинамическийФильтрCondra.Видимость 		= Истина;		
		Элементы.СписокДляCondraНастройкаСписка.Видимость		= Истина;
		Элементы.СписокДляCondraКомпоновщикНастроекПользовательскиеНастройки.Видимость = Истина;
		Элементы.СписокДляCondraКомпоновщикНастроекПользовательскиеНастройкиПорядок.Видимость = Истина;
			
	ИначеЕсли ИмяРеквизитаТаблицы = "СписокДляПрайсЛиста" Тогда		
		Элементы.ГруппаДинамическийФильтрПрайсЛист.Видимость    = Истина;
		Элементы.СписокДляПрайсЛистаНастройкаСписка.Видимость   = Истина;		
		Элементы.СписокДляПрайсЛистаКомпоновщикНастроекПользовательскиеНастройки.Видимость = Истина;
        Элементы.СписокДляПрайсЛистаКомпоновщикНастроекПользовательскиеНастройкиПорядок.Видимость = Истина;
	КонецЕсли;   
	
	
	Элементы.КомандаПечатьЮЗД.Доступность = ИмяРеквизитаТаблицы = "СписокДляПокупателя" ИЛИ ИмяРеквизитаТаблицы = "СписокДляПоставщика";
	Элементы.КнопкаПолучитьВсеДокументыЮЗДЦепочки.Доступность = ИмяРеквизитаТаблицы = "СписокДляПокупателя" ИЛИ ИмяРеквизитаТаблицы = "СписокДляПоставщика";
	

       
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)	
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();	
	ТипКнопки = "";
	
	ДатаНачалаОтбора    = ТекущаяДата();
	ДатаОкончанияОтбора = ТекущаяДата();

	ПользовательскийОтбор = ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
	Для каждого Отбор ИЗ ПользовательскийОтбор.Элементы Цикл
		
		// Для периода 
		Если Найти(Отбор.Представление, "Программный отбор") > 0 Тогда
			
			Если ТипЗнч(Отбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
				
				// Поиск именно для периода
				Если ТекущийЭлемент.Имя = "ВыбратьПериод" + ДанныеСписка.ИмяРеквизитаТаблицы + Отбор.ПредставлениеПользовательскойНастройки Тогда
					
					ТипКнопки = Отбор.ПредставлениеПользовательскойНастройки;
 
					Для каждого Эл Из Отбор.Элементы Цикл
						
						Если Эл.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
							ДатаНачалаОтбора = Эл.ПравоеЗначение; 
						ИначеЕсли Эл.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
							ДатаОкончанияОтбора = Эл.ПравоеЗначение;
						КонецЕсли;
						
					КонецЦикла;	
					
				КонецЕсли;	
			КонецЕсли;			
		КонецЕсли;	
	КонецЦикла;

	Диалог = Новый ДиалогРедактированияСтандартногоПериода();                                 
    Диалог.Период = Новый СтандартныйПериод(ДатаНачалаОтбора, ДатаОкончанияОтбора);
	
	Данные = Новый Структура;
	Данные.Вставить("Диалог"                         , Диалог);
	Данные.Вставить("ЭлементыПользовательскогоОтбора", ПользовательскийОтбор.Элементы);
	Данные.Вставить("ТипКнопки"                      , ТипКнопки);
	
    ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("УстановитьПериодЗавершение", ЭтаФорма, Данные);
    Диалог.Показать(ОписаниеОповещенияОЗакрытии); 	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодЗавершение(Период, ДополнительныеПараметры) Экспорт	
	
	Если НЕ Период = Неопределено Тогда		
		Диалог = ДополнительныеПараметры.Диалог; 
		Для каждого Отбор ИЗ ДополнительныеПараметры.ЭлементыПользовательскогоОтбора Цикл
			
			// Для периода 
			Если Найти(Отбор.Представление, "Программный отбор") > 0 Тогда			
				
				Если ТипЗнч(Отбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда		
					
					// Поиск именно для периода
					Если ДополнительныеПараметры.ТипКнопки = Отбор.ПредставлениеПользовательскойНастройки Тогда
						Для каждого Эл Из Отбор.Элементы Цикл
							Если Эл.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
								Эл.ПравоеЗначение = НачалоДня(Диалог.Период.ДатаНачала);  
							ИначеЕсли Эл.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
								Эл.ПравоеЗначение= КонецДня(Диалог.Период.ДатаОкончания);					
							КонецЕсли;
						КонецЦикла;
						
						// Завершаем поиск
						Прервать;

					КонецЕсли;		
					
				КонецЕсли;
				
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокОрганизаций()
	
	ОбъектЭтаОбработка    = РеквизитФормыВЗначение("Объект");
    Возврат ОбъектЭтаОбработка.ПолучитьСписокОрганизацийGLN();

КонецФункции 

&НаСервере
Функция ПолучитьСписокКонтрагентов()
	
	ОбъектЭтаОбработка    = РеквизитФормыВЗначение("Объект");
    Возврат ОбъектЭтаОбработка.ПолучитьСписокКонтрагентовGLN()

КонецФункции

&НаСервере
Функция ПолучитьСписокТочекДоставки()
	
	ОбъектЭтаОбработка    = РеквизитФормыВЗначение("Объект");
    Возврат ОбъектЭтаОбработка.ПолучитьСписокТочекДоставкиGLN();

КонецФункции

&НаКлиенте
Процедура ДеревоФильтровВыбор(Элемент, ЗНАЧ ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    ЭтоКореньДерева      = Ложь;

	ВыбраннаяСтрока = Элементы.ДеревоФильтров.ТекущиеДанные; 
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РодительСтроки  = ВыбраннаяСтрока.ПолучитьРодителя();
	Если РодительСтроки = Неопределено Тогда
	     ЭтоКореньДерева = Истина;
	КонецЕсли;
	
	ГруппаНастроек = ВыбраннаяСтрока.ГруппаНастроек;
	
	Если ГруппаНастроек ="Организация" 
		И Элемент.ТекущийЭлемент.Имя = "ДеревоФильтровИзменить" Тогда 
		
		СписокВыбора = ПолучитьСписокОрганизаций();
		
		СписокПараметров = Новый Структура;
		СписокПараметров.Вставить("Родитель"          , ВыбраннаяСтрока);
		СписокПараметров.Вставить("ДобавитьНовыйОтбор", Ложь);
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораЭлемента", ЭтаФорма, СписокПараметров);
		СписокВыбора.ПоказатьОтметкуЭлементов(Оповещение, "Выберите организацию (GLN организации)");
		
	ИначеЕсли ГруппаНастроек ="Контрагент" 
		И Элемент.ТекущийЭлемент.Имя = "ДеревоФильтровИзменить" Тогда 
		
		СписокВыбора = ПолучитьСписокКонтрагентов();
		
		СписокПараметров = Новый Структура;
		СписокПараметров.Вставить("Родитель"          , ВыбраннаяСтрока);
		СписокПараметров.Вставить("ДобавитьНовыйОтбор", Ложь);
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораЭлемента", ЭтаФорма, СписокПараметров);
		СписокВыбора.ПоказатьОтметкуЭлементов(Оповещение, "Выберите контрагента (GLN контрагенты)");
		
	ИначеЕсли ГруппаНастроек ="ТочкаДоставки" 
		И Элемент.ТекущийЭлемент.Имя = "ДеревоФильтровИзменить" Тогда 
		
		СписокВыбора = ПолучитьСписокТочекДоставки();
		
		СписокПараметров = Новый Структура;
		СписокПараметров.Вставить("Родитель"          , ВыбраннаяСтрока);
		СписокПараметров.Вставить("ДобавитьНовыйОтбор", Ложь);
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораЭлемента", ЭтаФорма, СписокПараметров);
		СписокВыбора.ПоказатьОтметкуЭлементов(Оповещение, "Выберите точки доставки (GLN точки доставки)");
		
	ИначеЕсли ВыбраннаяСтрока.ТипЗначения = "Строка" 
		И Элемент.ТекущийЭлемент.Имя = "ДеревоФильтровИзменить"
		И ЭтоКореньДерева = Истина Тогда 
		
		ИдентификаторСтроки = Элементы.ДеревоФильтров.ТекущаяСтрока;
		ТекущаяСтрока       = ДеревоФильтров.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		НоваяСтрокаДерева          = ТекущаяСтрока.ПолучитьЭлементы().Добавить();
		НоваяСтрокаДерева.Значение = "";
		НоваяСтрокаДерева.Изменить = БиблиотекаКартинок.ЭКОМ_ОчиститьЛогСобытий;
		НоваяСтрокаДерева.Иконка   = ТекущаяСтрока.Иконка;
		НоваяСтрокаДерева.Пометка  = Истина;
		
		ТекущаяСтрока.Пометка  = Истина;
		ДеревоФильтровИзменитьФильтры(ТекущаяСтрока);
		
		// Развернуть дерево отборов требуемого действия
		Элементы.ДеревоФильтров.Развернуть(ИдентификаторСтроки, ИСТИНА);
		
	ИначеЕсли ВыбраннаяСтрока.ТипЗначения = "Число" 
		И Элемент.ТекущийЭлемент.Имя = "ДеревоФильтровИзменить"
		И ЭтоКореньДерева = Истина Тогда 
		
		ИдентификаторСтроки = Элементы.ДеревоФильтров.ТекущаяСтрока;
		ТекущаяСтрока       = ДеревоФильтров.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		НоваяСтрокаДерева          = ТекущаяСтрока.ПолучитьЭлементы().Добавить();
		НоваяСтрокаДерева.Значение = 0;
		НоваяСтрокаДерева.Изменить = БиблиотекаКартинок.ЭКОМ_ОчиститьЛогСобытий;
		НоваяСтрокаДерева.Иконка   = ТекущаяСтрока.Иконка;
		НоваяСтрокаДерева.Пометка  = Истина;
		
		ТекущаяСтрока.Пометка  = Истина;
		ДеревоФильтровИзменитьФильтры(ТекущаяСтрока);
		
		// Развернуть дерево отборов требуемого действия
		Элементы.ДеревоФильтров.Развернуть(ИдентификаторСтроки, ИСТИНА);
		
	ИначеЕсли (Найти(ВыбраннаяСтрока.ТипЗначения, "Документ") > 0
		ИЛИ Найти(ВыбраннаяСтрока.ТипЗначения, "Справочник") > 0
		ИЛИ Найти(ВыбраннаяСтрока.ТипЗначения, "Перечислени") > 0)
		И Элемент.ТекущийЭлемент.Имя = "ДеревоФильтровИзменить"
		И ЭтоКореньДерева = Истина Тогда 
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
		
		СписокПараметров = Новый Структура;
		СписокПараметров.Вставить("Родитель"          , ВыбраннаяСтрока);
		СписокПараметров.Вставить("ДобавитьНовыйОтбор", Ложь);
		
		ОписаниеВыбора = Новый ОписаниеОповещения("ПослеВыбораЭлемента", ЭтаФорма, СписокПараметров);
	
		ОткрытьФорму(ВыбраннаяСтрока.ТипЗначения + ".ФормаВыбора", 
		ПараметрыФормы,,,,,
		ОписаниеВыбора,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
	// Удалить строки дерева
	ИначеЕсли Поле.Имя = "ДеревоФильтровИзменить" 
		И ЭтоКореньДерева = Ложь Тогда 
		
		ВыбраннаяСтрока.Пометка = Ложь;
		ДеревоФильтровИзменитьФильтры(ВыбраннаяСтрока);
		РодительСтроки.ПолучитьЭлементы().Удалить(ВыбраннаяСтрока);
		
		// Если нет элементов то снимаем галку с родителя
		Если РодительСтроки.ПолучитьЭлементы().Количество() = 0 Тогда
		     РодительСтроки.Пометка = Ложь;
		     ДеревоФильтровИзменитьФильтры(РодительСтроки);			
		КонецЕсли;

	// Отрицание значения 
    ИначеЕсли Поле.Имя = "ДеревоФильтровОтрицаниеЗначение"  
	      И ЭтоКореньДерева = Истина Тогда 
		
		ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();	
	    ПользовательскийОтбор = ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
		НайденныйОтбор = НайтиПользовательскийОтбор(ПользовательскийОтбор, ВыбраннаяСтрока.ГруппаНастроек);
		
		ИмяСравнения = СокрЛП(НайденныйОтбор.ВидСравнения);		
		ИмяСравнения = НРег(ИмяСравнения);
		ИмяСравнения = СтрЗаменить(ИмяСравнения, "не ", "");
		
		СоответствиеВидСравнения = Новый Соответствие;
		СоответствиеВидСравнения.Вставить("не содержит", ВидСравненияКомпоновкиДанных.НеСодержит);
		СоответствиеВидСравнения.Вставить("содержит"   , ВидСравненияКомпоновкиДанных.Содержит);
		СоответствиеВидСравнения.Вставить("не равно"   , ВидСравненияКомпоновкиДанных.НеРавно);
		СоответствиеВидСравнения.Вставить("равно"      , ВидСравненияКомпоновкиДанных.Равно);
		СоответствиеВидСравнения.Вставить("не в списке", ВидСравненияКомпоновкиДанных.НеВСписке);
		СоответствиеВидСравнения.Вставить("в списке"   , ВидСравненияКомпоновкиДанных.ВСписке);
		
		Если ВыбраннаяСтрока.ОтрицаниеЗначение = БиблиотекаКартинок.ЭКОМ_ВосклицателыныйЗнак Тогда
		     ВыбраннаяСтрока.ОтрицаниеЗначение = БиблиотекаКартинок.ЭКОМ_ВосклицательныйЗнакВыключенСерый;
			 НайденныйОтбор.ВидСравнения = СоответствиеВидСравнения.Получить(ИмяСравнения);
		Иначе	
		     ВыбраннаяСтрока.ОтрицаниеЗначение = БиблиотекаКартинок.ЭКОМ_ВосклицателыныйЗнак;
			 НайденныйОтбор.ВидСравнения = СоответствиеВидСравнения.Получить("не " + ИмяСравнения); 
		КонецЕсли;   
		
	// Число строка 
    ИначеЕсли Поле.Имя = "ДеревоФильтровЗначение"  
	      И ЭтоКореньДерева = Ложь Тогда 
		  
		  СтандартнаяОбработка = Истина;

	КонецЕсли;			
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЭлемента(ВыбранныйЭлемент, СписокПараметров) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
	     Возврат;
	КонецЕсли;
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	
	Если СписокПараметров.ДобавитьНовыйОтбор = Истина Тогда
		
		// Получим все существующие элементы в корневом отборе
		СуществующиеОтборы = Новый Соответствие;
		СтрокиКорневые       = ЭтаФорма.ДеревоФильтров.ПолучитьЭлементы();
		Для каждого Эл Из СтрокиКорневые Цикл
			СуществующиеОтборы.Вставить(Эл.Значение, Эл.Значение);
		КонецЦикла;
		
		// Чтобы не было дублей поместим все в соответсвие
		НовыйОтбор = Новый Массив;
		Для каждого Эл Из ВыбранныйЭлемент Цикл
			Если Эл.Пометка = Истина Тогда
				НовыйОтбор.Добавить(Эл.Значение);
			КонецЕсли;		
		КонецЦикла;
		
		// Создаем новый отбор
        СоздатьПользовательскиеНастройки(ДанныеСписка, НовыйОтбор);
		СоздатьДеревоПользовательскихНастроекНаСервере(ДанныеСписка, НовыйОтбор);
		    
	Иначе
		
		// Получим все существующие элементы в отборе
		Соответствие = Новый Соответствие;
		Строки       = Элементы.ДеревоФильтров.ТекущиеДанные.ПолучитьЭлементы();
		Для каждого Эл Из Строки  Цикл
			Соответствие.Вставить(Эл.Значение, Эл.Пометка);
		КонецЦикла;
		
		// Чтобы не было дублей поместим все в соответсвие
		Если ТипЗнч(ВыбранныйЭлемент) = Тип("СписокЗначений") Тогда
			Для каждого Эл Из ВыбранныйЭлемент  Цикл
				Если Эл.Пометка = Истина Тогда
					Соответствие.Вставить(Эл.Значение, Истина);
				КонецЕсли;		
			КонецЦикла;
		Иначе	
			Для каждого Эл Из ВыбранныйЭлемент  Цикл				
					Соответствие.Вставить(Эл, Истина);
			КонецЦикла;
		КонецЕсли;
		
		
		// Ищем строку в отборе и очищаем
		ИдентификаторСтроки = Элементы.ДеревоФильтров.ТекущаяСтрока;	
		ТекущаяСтрока       = ЭтаФорма.ДеревоФильтров.НайтиПоИдентификатору(ИдентификаторСтроки);
		ТекущаяСтрока.ПолучитьЭлементы().Очистить();
		
		// Добавляем все элементы
		Для каждого Эл Из Соответствие  Цикл
			НоваяСтрокаДерева  = ТекущаяСтрока.ПолучитьЭлементы().Добавить();
			НоваяСтрокаДерева.Пометка  = Эл.Значение;
			НоваяСтрокаДерева.Иконка   = СписокПараметров.Родитель.Иконка;
			НоваяСтрокаДерева.Значение = Эл.Ключ;
			НоваяСтрокаДерева.Изменить = БиблиотекаКартинок.ЭКОМ_ОчиститьЛогСобытий; 
		КонецЦикла;
		
		ТекущаяСтрока.Пометка  = Истина;
		ДеревоФильтровИзменитьФильтры(ТекущаяСтрока);
		
		//Поиск элемента пользовательских настроек по уникальному идентификатору раздела настроек 
		ПользовательскийОтбор = ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
		
		НайденныйОтбор = НайтиПользовательскийОтбор(ПользовательскийОтбор, ТекущаяСтрока.ГруппаНастроек);
		Если НЕ НайденныйОтбор = Неопределено Тогда
			
			НайденныйОтбор.ПравоеЗначение.Очистить();
			
			Если НЕ СписокПараметров.Родитель = Неопределено Тогда
				Строки = СписокПараметров.Родитель.ПолучитьЭлементы();
				Для каждого Стр Из Строки Цикл
					
					Если Стр.Пометка = Истина Тогда
						
						НайденныйОтбор.ПравоеЗначение.Добавить(Стр.Значение);
						
					КонецЕсли;  
					
				КонецЦикла;			
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЕсли;
		
	РазвернутьДеревоФильтровКлиент();
	
КонецПроцедуры

&НаКлиенте
Функция НайтиВДереве(ДеревоИлиЕгоЭлемент,ЧтоИщем,ВКакойКолонке)
	НайденныйЭлемент = Неопределено;
	
	Для	Каждого ЭлементДерева Из ДеревоИлиЕгоЭлемент.ПолучитьЭлементы() Цикл
		ЗначениеВКолонке = Неопределено;
		НашлиПоСвойству = ЭлементДерева.Свойство(ВКакойКолонке,ЗначениеВКолонке);
		Если НашлиПоСвойству и ЗначениеВКолонке=ЧтоИщем Тогда 
			НайденныйЭлемент = ЭлементДерева;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НайденныйЭлемент;
КонецФункции

&НаКлиенте
Процедура ДеревоФильтровПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)	
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФильтровПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФильтровУстановитьВсеФлажки(Команда)
	
	Если Команда.Имя = "ДеревоФильтровУстановитьВсеФлажки"  Тогда
		УстановитьИлиСброситьФлажкиДереваОтборов(Истина);
	Иначе
		УстановитьИлиСброситьФлажкиДереваОтборов(Ложь);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИлиСброситьФлажкиДереваОтборов(Установить) 
	
	Для Каждого Родитель Из ДеревоФильтров.ПолучитьЭлементы() Цикл
		Родитель.Пометка = Установить;
		ДеревоФильтровИзменитьФильтры(Родитель);
		
		Для Каждого Потомок Из Родитель.ПолучитьЭлементы() Цикл
			Потомок.Пометка = Установить;
			ДеревоФильтровИзменитьФильтры(Потомок);
			
			//Для Каждого Стр3 Из Потомок.ПолучитьЭлементы() Цикл
			//	Стр3.Пометка = Установить;
			//КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФильтровПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	ДеревоФильтровИзменитьФильтры(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФильтровИзменитьФильтры(ТекущаяСтрока)
	
	Родитель      = ТекущаяСтрока.ПолучитьРодителя();

	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	
	ПользовательскийОтбор = ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
	Для каждого Отбор ИЗ ПользовательскийОтбор.Элементы Цикл
		
		Если Родитель = Неопределено Тогда
			
			Если ТипЗнч(Отбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;	
			
			Если  Найти(Отбор.Представление, "Программный отбор") > 0 
				И Отбор.ПредставлениеПользовательскойНастройки = ТекущаяСтрока.ГруппаНастроек Тогда
				
		        Отбор.Использование = ТекущаяСтрока.Пометка;
				
			КонецЕсли;
		
		Иначе
			
			Если Отбор.ПредставлениеПользовательскойНастройки = Родитель.ГруппаНастроек Тогда
				
				Если Родитель = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если Родитель.ТипЗначения = "Число" 
					ИЛИ Родитель.ТипЗначения = "Строка" Тогда
					
					Если ТекущаяСтрока.Пометка = Истина Тогда
					     Отбор.ПравоеЗначение =ТекущаяСтрока.Значение;
					КонецЕсли;
					
				Иначе	
					
					Отбор.ПравоеЗначение.Очистить();
					
					Строки = Родитель.ПолучитьЭлементы();
					Для каждого Стр Из Строки Цикл
						
						Если Стр.Пометка = Истина Тогда
							
							Отбор.ПравоеЗначение.Добавить(Стр.Значение);
							
						КонецЕсли;  
						
					КонецЦикла;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция  НайтиПользовательскийОтбор(ПользовательскийОтбор, ИмяГруппыНастроек)
	
	НайденныйОтбор = Неопределено;
	
	Для каждого Отбор ИЗ ПользовательскийОтбор.Элементы Цикл
		
		Если ТипЗнч(Отбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		Если  Найти(Отбор.Представление, "Программный отбор") > 0 
			И Отбор.ПредставлениеПользовательскойНастройки = ИмяГруппыНастроек Тогда
			
			НайденныйОтбор = Отбор;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НайденныйОтбор;
	
КонецФункции

&НаКлиенте
Процедура РазвернутьДеревоФильтровКлиент()
	
	//развернуть дерево отборов требуемого действия
	КоллекцияЭлементовДерева=ДеревоФильтров.ПолучитьЭлементы();
    Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
        ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
        Элементы.ДеревоФильтров.Развернуть(ИдентификаторСтроки,ИСТИНА);
	КонецЦикла;
	 
КонецПроцедуры

&НаКлиенте
Процедура ОтборДобавить(Команда)
	
	СписокВыбора = ПолучитьСписокОтборов();
	
	СписокПараметров = Новый Структура;
	СписокПараметров.Вставить("Родитель"          , Неопределено);
	СписокПараметров.Вставить("ДобавитьНовыйОтбор", Истина);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораЭлемента", ЭтаФорма, СписокПараметров);
	СписокВыбора.ПоказатьОтметкуЭлементов(Оповещение, "Выберите отбор");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокОтборов()
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаСервере();
	
	ЗначениеПоУмолчанию = Неопределено;
	Измерение           = "Служебный"; 
	Обязательно         = Ложь;
	АлгоритмЗаполненияСписка = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(ДанныеСписка.АлгоритмЗаполненияСписка, ЗначениеПоУмолчанию, Измерение, Обязательно)");
	
	Запрос = Новый Запрос;	
    ТекстЗапроса = "";
	СписокВыбора = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(АлгоритмЗаполненияСписка) Тогда
		Попытка
			
			Выполнить(АлгоритмЗаполненияСписка);
               
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("ДатаНач", ТекущаяДата());
			Запрос.УстановитьПараметр("ДатаКон", ТекущаяДата());	
			Запрос.УстановитьПараметр("масПомеченныхДоков", Новый Массив);
			Запрос.УстановитьПараметр("НаправлениеОбмена" , Перечисления.ЭКОМ_НаправлениеОбмена.ПустаяСсылка());
			
			РезультатЗапроса = Запрос.Выполнить();
			КолонкиЗапроса = РезультатЗапроса.Колонки;				
			Для каждого ТекКолонка Из КолонкиЗапроса Цикл
				СписокВыбора.Добавить(ТекКолонка.Имя);			
			КонецЦикла;
			
		Исключение				
		КонецПопытки;
	Иначе
		
		Попытка
			               
			Запрос.Текст = ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].ТекстЗапроса;
			Запрос.УстановитьПараметр("ДатаНач", ТекущаяДата());
			Запрос.УстановитьПараметр("ДатаКон", ТекущаяДата());	
			Запрос.УстановитьПараметр("масПомеченныхДоков", Новый Массив);
			Запрос.УстановитьПараметр("НаправлениеОбмена" , Перечисления.ЭКОМ_НаправлениеОбмена.ПустаяСсылка());
			
			РезультатЗапроса = Запрос.Выполнить();
			КолонкиЗапроса = РезультатЗапроса.Колонки;				
			Для каждого ТекКолонка Из КолонкиЗапроса Цикл
				СписокВыбора.Добавить(ТекКолонка.Имя);			
			КонецЦикла;
			
		Исключение				
		КонецПопытки;
		
	КонецЕсли;
		
	СписокВыбора.СортироватьПоЗначению();
	
	Возврат СписокВыбора;
	
КонецФункции 

&НаСервере
Функция ПолучитьТекущиеДанныеПоИмениСпискаНаСервере()
	
	ТекущаяСтраницаИмя = Элементы.ОсновнаяПанель.ТекущаяСтраница.Имя;
	
	ИмяРеквизитаТаблицы      = "";
	ИмяСписка                = "";		
	АлгоритмЗаполненияСписка = "";
	ИмяФильтра               = "";
	ТипОбмена                = "";
	Путь                     = "";

	Если ТекущаяСтраницаИмя = "Группа_ЭТРН" Тогда
		
		ИмяРеквизитаТаблицы      = "СписокДляЭТРН";
		ИмяСписка                = "СписокДляЭТРН";		
		АлгоритмЗаполненияСписка = "СлужебныйЗапросДляФормыЭТРН";
		ИмяФильтра               = "ГруппаДинамическийФильтрЭТРН";
		ТипОбмена                = "ЭТРН";
		Путь                     = "ЭТРН";
		
	ИначеЕсли ТекущаяСтраницаИмя = "Группа_Покупатель" Тогда		
		
		ИмяРеквизитаТаблицы      = "СписокДляПокупателя";
		ИмяСписка                = "СписокДляПокупателя";	
		АлгоритмЗаполненияСписка = "СлужебныйЗапросДляФормыПокупателя";
		ИмяФильтра               = "ГруппаДинамическийФильтрСеть";
		ТипОбмена                = "Сеть";
		Путь                     = "Сеть";
		
	ИначеЕсли ТекущаяСтраницаИмя = "Группа_Поставщик" Тогда 	
		
		ИмяРеквизитаТаблицы      = "СписокДляПоставщика";
		ИмяСписка                = "СписокДляПоставщика";
		АлгоритмЗаполненияСписка = "СлужебныйЗапросДляФормыПоставщика";
		ИмяФильтра               = "ГруппаДинамическийФильтрПоставщик";
		ТипОбмена                = "Поставщик";
		Путь                     = "Поставщик";

	ИначеЕсли ТекущаяСтраницаИмя = "Группа_Condra" Тогда 	
		
		ИмяРеквизитаТаблицы      = "СписокДляCondra";
		ИмяСписка                = "СписокДляCondra";
		АлгоритмЗаполненияСписка = "СлужебныйЗапросДляФормыCondra";
		ИмяФильтра               = "ГруппаДинамическийФильтрCondra";
		ТипОбмена                = "Неструкт. докум.";
		Путь                     = "Condra";
		
	ИначеЕсли ТекущаяСтраницаИмя = "ГруппаПрайсЛист" Тогда 	
		
		ИмяРеквизитаТаблицы      = "СписокДляПрайсЛиста";
		АлгоритмЗаполненияСписка = "СлужебныйЗапросДляФормыПрайсЛист";
		ИмяФильтра               = "ГруппаДинамическийФильтрПрайсЛист";
		ТипОбмена                = "Прайс-лист";
		Путь                     = "ПрайсЛист";
		
		ТекущаяВкладка = Элементы.ГруппаСтраницыПрайсЛиста.ТекущаяСтраница.Имя;		
		Если ТекущаяВкладка = "ГруппаВходящийПрайсЛист" Тогда
			ИмяСписка = "СписокДляПрайсЛистаВходящий";
		Иначе	
			ИмяСписка = "СписокДляПрайсЛистаИсходящий";	
		КонецЕсли;
		
	КонецЕсли;

	ДанныеСписка = Новый Структура;
	ДанныеСписка.Вставить("ИмяРеквизитаТаблицы"     , ИмяРеквизитаТаблицы); // Имя реквизита таблицы формы
	ДанныеСписка.Вставить("ИмяСтраницы"             , ТекущаяСтраницаИмя);
	ДанныеСписка.Вставить("ИмяСписка"               , ИмяСписка); // Имя элемента таблицы формы
	ДанныеСписка.Вставить("АлгоритмЗаполненияСписка", АлгоритмЗаполненияСписка);
	ДанныеСписка.Вставить("ИмяФильтра"              , ИмяФильтра);
	ДанныеСписка.Вставить("ТипОбмена"               , ТипОбмена);
	ДанныеСписка.Вставить("Путь"                    , Путь);

	Возврат ДанныеСписка;
	
КонецФункции

&НаКлиенте
Функция ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте(ТекущаяСтраницаИмя = "")

	Если НЕ ЗначениеЗаполнено(ТекущаяСтраницаИмя) Тогда
	     ТекущаяСтраницаИмя = Элементы.ОсновнаяПанель.ТекущаяСтраница.Имя;
	КонецЕсли;

	ИмяРеквизитаТаблицы      = "";
	ИмяСписка                = "";		
	АлгоритмЗаполненияСписка = "";
	ИмяФильтра               = "";
	ТипОбмена                = "";
	Путь                     = "";

	Если ТекущаяСтраницаИмя = "Группа_ЭТРН" Тогда
		
		ИмяРеквизитаТаблицы      = "СписокДляЭТРН";
		ИмяСписка                = "СписокДляЭТРН";		
		АлгоритмЗаполненияСписка = "СлужебныйЗапросДляФормыЭТРН";
		ИмяФильтра               = "ГруппаДинамическийФильтрЭТРН";
		ТипОбмена                = "ЭТРН";
		Путь                     = "ЭТРН";
		
	ИначеЕсли ТекущаяСтраницаИмя = "Группа_Покупатель" Тогда		
		
		ИмяРеквизитаТаблицы      = "СписокДляПокупателя";
		ИмяСписка                = "СписокДляПокупателя";	
		АлгоритмЗаполненияСписка = "СлужебныйЗапросДляФормыПокупателя";
		ИмяФильтра               = "ГруппаДинамическийФильтрСеть";
		ТипОбмена                = "Сеть";
		Путь                     = "Сеть";
		
	ИначеЕсли ТекущаяСтраницаИмя = "Группа_Поставщик" Тогда 	
		
		ИмяРеквизитаТаблицы      = "СписокДляПоставщика";
		ИмяСписка                = "СписокДляПоставщика";
		АлгоритмЗаполненияСписка = "СлужебныйЗапросДляФормыПоставщика";
		ИмяФильтра               = "ГруппаДинамическийФильтрПоставщик";
		ТипОбмена                = "Поставщик";
		Путь                     = "Поставщик";

	ИначеЕсли ТекущаяСтраницаИмя = "Группа_Condra" Тогда 	
		
		ИмяРеквизитаТаблицы      = "СписокДляCondra";
		ИмяСписка                = "СписокДляCondra";
		АлгоритмЗаполненияСписка = "СлужебныйЗапросДляФормыCondra";
		ИмяФильтра               = "ГруппаДинамическийФильтрCondra";
		ТипОбмена                = "Неструкт. докум.";
		Путь                     = "Condra";
		
	ИначеЕсли ТекущаяСтраницаИмя = "ГруппаПрайсЛист" Тогда 	
		
		ИмяРеквизитаТаблицы      = "СписокДляПрайсЛиста";
		АлгоритмЗаполненияСписка = "СлужебныйЗапросДляФормыПрайсЛист";
		ИмяФильтра               = "ГруппаДинамическийФильтрПрайсЛист";
		ТипОбмена                = "Прайс-лист";
		Путь                     = "ПрайсЛист";
		
		ТекущаяВкладка = Элементы.ГруппаСтраницыПрайсЛиста.ТекущаяСтраница.Имя;		
		Если ТекущаяВкладка = "ГруппаВходящийПрайсЛист" Тогда
			ИмяСписка = "СписокДляПрайсЛистаВходящий";
		Иначе	
			ИмяСписка = "СписокДляПрайсЛистаИсходящий";	
		КонецЕсли;
		
	КонецЕсли;

	ДанныеСписка = Новый Структура;
	ДанныеСписка.Вставить("ИмяРеквизитаТаблицы"     , ИмяРеквизитаТаблицы); // Имя реквизита таблицы формы
	ДанныеСписка.Вставить("ИмяСтраницы"             , ТекущаяСтраницаИмя);
	ДанныеСписка.Вставить("ИмяСписка"               , ИмяСписка); // Имя элемента таблицы формы
	ДанныеСписка.Вставить("АлгоритмЗаполненияСписка", АлгоритмЗаполненияСписка);
	ДанныеСписка.Вставить("ИмяФильтра"              , ИмяФильтра);
	ДанныеСписка.Вставить("ТипОбмена"               , ТипОбмена);
	ДанныеСписка.Вставить("Путь"                    , Путь);

	Возврат ДанныеСписка;
	
КонецФункции

&НаКлиенте
Процедура ОтборУдалить(Команда)
	
	ИдентификаторСтроки = Элементы.ДеревоФильтров.ТекущаяСтрока;
	ТекущаяСтрока       = ЭтаФорма.ДеревоФильтров.НайтиПоИдентификатору(ИдентификаторСтроки);
	СтрокаРодитель      = ТекущаяСтрока.ПолучитьРодителя();
	Если НЕ СтрокаРодитель = Неопределено Тогда
	     Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока.ГруппаНастроек = "Организация"
		ИЛИ ТекущаяСтрока.ГруппаНастроек = "Контрагент" 
		ИЛИ ТекущаяСтрока.ГруппаНастроек = "ТочкаДоставки" Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	
	ПользовательскийОтбор = ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
	НайденныйОтбор = НайтиПользовательскийОтбор(ПользовательскийОтбор, ТекущаяСтрока.ГруппаНастроек);
	Если НЕ НайденныйОтбор = Неопределено Тогда
		ПользовательскийОтбор.Элементы.Удалить(НайденныйОтбор);					
	КонецЕсли;
	ЭтаФорма.ДеревоФильтров.ПолучитьЭлементы().Удалить(ТекущаяСтрока);
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалитьФильтр(Команда)
	
	КомандаУдалитьФильтрНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура КомандаУдалитьФильтрНаСервере()
		
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаСервере();                
	
	ЗаголовокЭлемента = СтрЗаменить(ТекущийЭлемент.Имя, "УдалитьФильтр" + ДанныеСписка.ИмяРеквизитаТаблицы, "");
	НачалоИмениЭлементов = "ПрограммноПользовательскиеНастройки";
	
	ПользовательскийОтбор = ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
	Для каждого Отбор ИЗ ПользовательскийОтбор.Элементы Цикл
		
		Если ТипЗнч(Отбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных")  Тогда
			
			Если Отбор.ПредставлениеПользовательскойНастройки = ЗаголовокЭлемента Тогда
			     ПользовательскийОтбор.Элементы.Удалить(Отбор);
   			КонецЕсли;
			
		Иначе
			Если Строка(Отбор.ЛевоеЗначение) = ЗаголовокЭлемента Тогда
				
				ПользовательскийОтбор.Элементы.Удалить(Отбор);
				Прервать;
				
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;
	
	// Проверяем относится ли элемент к периоду
	ЭлементПериод = Элементы.Найти(НачалоИмениЭлементов + "ПериодГлавный" + ДанныеСписка.Путь);
	Если НЕ ЭлементПериод = Неопределено Тогда
		Для Каждого Эл Из ЭлементПериод.ПодчиненныеЭлементы Цикл
			
			Если Найти(Эл.Имя, НачалоИмениЭлементов + "Группа" + ЗаголовокЭлемента + ДанныеСписка.Путь) > 0 Тогда
				Элементы.Удалить(Эл);
			КонецЕсли;
			
		КонецЦикла;	
	КонецЕсли;
	
	// Удаляем прочие
	Для Каждого Эл Из Элементы[НачалоИмениЭлементов + "ОтборыКолонка" + ДанныеСписка.Путь].ПодчиненныеЭлементы Цикл
		
		Если Найти(Эл.Имя, НачалоИмениЭлементов + "Группа" + ЗаголовокЭлемента + ДанныеСписка.Путь) > 0 Тогда
			Элементы.Удалить(Эл);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаФильтрыИМеню(Команда)
	
	Если Элементы.ГруппаДинамическийФильтр.Видимость = Истина Тогда
		Элементы.ГруппаДинамическийФильтр.Видимость = Ложь;
		Элементы.КомандаФильтрыИМеню.Картинка = БиблиотекаКартинок.ЭКОМ_МенюРаскрыть;
	Иначе
		Элементы.ГруппаДинамическийФильтр.Видимость = Истина;
		Элементы.КомандаФильтрыИМеню.Картинка = БиблиотекаКартинок.ЭКОМ_МенюСкрыть;
	КонецЕсли;
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();	

	// Сбрасываем выделенные строки, если их больше 200 штук.
	ВыделенныеСтроки = Элементы[ДанныеСписка.ИмяСписка].ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() > 200 Тогда
		ВыделенныеСтроки.Очистить();
		ВыделенныеСтроки.Добавить(Элементы[ДанныеСписка.ИмяСписка].ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОпределитьТипОбъекта(Элемент, ИмяКолонки)

	ОбъектЭлемент = "";

	СокращенноеИмяКолонки      = СтрЗаменить(ИмяКолонки, Элемент.Имя, "");
	ЗначениеКолонки = Неопределено;
	Элемент.ТекущиеДанные.Свойство(СокращенноеИмяКолонки, ЗначениеКолонки);
	
		ТипЗначения = ТипЗнч(ЗначениеКолонки);
	Если НЕ (ТипЗначения = Тип("Строка") 
		ИЛИ ТипЗначения = Тип("Неопределено") 
		ИЛИ ТипЗначения = Тип("Число")
		ИЛИ ТипЗначения = Тип("Null") 
		ИЛИ ТипЗначения = Тип("Дата")  
		ИЛИ ТипЗначения = Тип("Булево")) Тогда
	        
		    ОбъектЭлемент = ЗначениеКолонки;
	
	КонецЕсли;

    Возврат ОбъектЭлемент;
	
КонецФункции 

&НаКлиенте
Процедура ОбновитьДинамическийСписок(ДанныеСписка, ОбновитьВыбранныеСтроки = Ложь, ВыбранныеСтроки = Неопределено, КлючЗаписиЦепочкиДокументов = Неопределено, ПозицияТекущейСтроки = Неопределено)
	
	Если ДанныеСписка.ИмяСтраницы = "ГруппаПрайсЛист" Тогда
		Попытка
			Если ДанныеСписка.ИмяСписка = "СписокДляПрайсЛистаИсходящий" Тогда
				НаправлениеОбмена = ПредопределенноеЗначение("Перечисление.ЭКОМ_НаправлениеОбмена.Исходящий");
				//Docrobot 2021.11.29 MOD-1340
				Если Элементы.Найти("СписокДляПрайсЛистаИсходящийКоманднаяПанельИсходящийPricat") <> Неопределено Тогда
					Элементы.СписокДляПрайсЛистаИсходящийКоманднаяПанельИсходящийPricat.РасширеннаяПодсказка.Заголовок = "Отправить";
				КонецЕсли;	
				Элементы.СписокДляПрайсЛистаИсходящийОбновитьАктивныйСписок.РасширеннаяПодсказка.Заголовок = "Обновить";
				Элементы.СписокДляПрайсЛистаИсходящийГруппаДокументы.Подсказка = "Документы";
			Иначе	 
				НаправлениеОбмена = ПредопределенноеЗначение("Перечисление.ЭКОМ_НаправлениеОбмена.Входящий");
				//Docrobot 2021.11.29 MOD-1340
				Если Элементы.Найти("СписокДляПрайсЛистаВходящийКоманднаяПанельВходящийPricat") <> Неопределено Тогда
					Элементы.СписокДляПрайсЛистаВходящийКоманднаяПанельВходящийPricat.РасширеннаяПодсказка.Заголовок = "Получить";
				КонецЕсли;
				Элементы.ОбновитьАктивныйСписокПрайсЛистВходящий.РасширеннаяПодсказка.Заголовок = "Обновить";
				Элементы.СписокДляПрайсЛистаВходящийГруппаДокументы.Подсказка = "Документы";
			КонецЕсли;
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось обновить кнопки Прайс листа, обновите роли в справочнике ЭКОМ_Роли";
			Сообщение.Сообщить();
		КонецПопытки;
		УстановитьПараметрДинамическогоСписка(ДанныеСписка.ИмяРеквизитаТаблицы, "НаправлениеОбмена", НаправлениеОбмена);
	КонецЕсли;
	
	Если ОбновитьВыбранныеСтроки И СписокВыбранныхСтрок.Количество() Тогда
		ОбновитьСписокВыбранныхСтрок(ДанныеСписка.ИмяСписка); 
	ИначеЕсли ВыбранныеСтроки <> Неопределено Тогда
		ОбновитьИдентификаторыВыделенныхСтрок(ВыбранныеСтроки, ДанныеСписка.ИмяСписка);
	КонецЕсли;
	
	Если КлючЗаписиЦепочкиДокументов <> Неопределено И (ДанныеСписка.ИмяСписка = "СписокДляПоставщика" ИЛИ ДанныеСписка.ИмяСписка = "СписокДляПокупателя") Тогда			
		КлючЗаписи = Новый Массив;
		КлючЗаписи.Добавить(Новый Структура("ИдентификаторВыделенныхСтрок, КлючЗаписиЦепочкиДокументов", КлючЗаписиЦепочкиДокументов, Истина));
		ОбновитьИдентификаторыВыделенныхСтрок(КлючЗаписи, ДанныеСписка.ИмяСписка);
		КлючЗаписиЦепочкиДокументов = КлючЗаписи;
	Иначе 
		КлючЗаписиЦепочкиДокументов = Неопределено;
	КонецЕсли;
	УстановитьПараметрДинамическогоСписка(ДанныеСписка.ИмяРеквизитаТаблицы, "масПомеченныхДоков", СписокВыбранныхСтрок.ВыгрузитьЗначения());
	Элементы[ДанныеСписка.ИмяСписка].Обновить();
	
	// Сортировка
	ОтобразитьСортировку(ДанныеСписка);
	

КонецПроцедуры

&НаКлиенте
Процедура ДеревоФильтровПриАктивизацииСтроки(Элемент)
	
	ЭтоКореньДерева = Ложь;

	ИдентификаторСтроки = Элементы.ДеревоФильтров.ТекущаяСтрока;
	Если НЕ ИдентификаторСтроки = Неопределено Тогда
		
		ТекущаяСтрока       = ДеревоФильтров.НайтиПоИдентификатору(ИдентификаторСтроки);	
		РодительСтроки      = ТекущаяСтрока.ПолучитьРодителя();
		Если РодительСтроки = Неопределено Тогда
			ЭтоКореньДерева = Истина;
		КонецЕсли;
		
		Если ТекущаяСтрока.ГруппаНастроек = "Организация"
			ИЛИ ТекущаяСтрока.ГруппаНастроек = "Контрагент" 
			ИЛИ ТекущаяСтрока.ГруппаНастроек = "ТочкаДоставки" Тогда
			Элементы.ОтборУдалить.Доступность = Ложь;
		Иначе
			Элементы.ОтборУдалить.Доступность = ЭтоКореньДерева;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПериодФильтра(Элемент)
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();	
	ИмяЭлемента = "ЗначениеПериода" + ДанныеСписка.ИмяСписка;
	
	ИзменитьДатуНачалаОтбора    = Ложь;
	ИзменитьДатуОкончанияОтбора = Ложь;

	Если Элемент.Заголовок = "с" Тогда
	     ИзменитьДатуНачалаОтбора = Истина;
	Иначе
	     ИзменитьДатуОкончанияОтбора = Истина;
	КонецЕсли;	
	
	ПользовательскийОтбор = ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭтаФорма[ДанныеСписка.ИмяРеквизитаТаблицы].КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
	Для каждого Отбор ИЗ ПользовательскийОтбор.Элементы Цикл
		
		// Для периода 
		Если Найти(Отбор.Представление, "Программный отбор") > 0 Тогда					
			Если ТипЗнч(Отбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда					
				// Поиск именно для периода				
				Если Элемент.Имя = ИмяЭлемента + Отбор.ПредставлениеПользовательскойНастройки + Элемент.Заголовок Тогда
					Для каждого Эл Из Отбор.Элементы Цикл
						Если Эл.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно 
							И ИзменитьДатуНачалаОтбора = Истина Тогда
							
							Эл.ПравоеЗначение = НачалоДня(Эл.ПравоеЗначение);  
							
						ИначеЕсли Эл.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно 
							И ИзменитьДатуОкончанияОтбора = Истина Тогда
							
							Эл.ПравоеЗначение= КонецДня(Эл.ПравоеЗначение);					
							
						КонецЕсли;
					КонецЦикла;
					
					// Завершаем поиск
					Прервать;
					
				КонецЕсли;			
			КонецЕсли;		
		КонецЕсли;		
	КонецЦикла;	
	
	ОбновитьЦепочкуДокументовИКвитанцииНаКлиенте(ДанныеСписка.ИмяСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрДинамическогоСписка(ИмяРеквизитаТаблицы, ИмяПараметра, ЗначениеПараметра)
	
	ЕстьПараметр = ЭтаФорма[ИмяРеквизитаТаблицы].Параметры.Элементы.Найти(ИмяПараметра);	
	Если Не ЕстьПараметр = Неопределено Тогда
		ЭтаФорма[ИмяРеквизитаТаблицы].Параметры.УстановитьЗначениеПараметра(ИмяПараметра, ЗначениеПараметра);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеПараметрыДинамическогоСписка(ИмяРеквизитаТаблицы)
	
    УстановитьПараметрДинамическогоСписка(ИмяРеквизитаТаблицы, "ДатаНач"  , Дата(2000, 01, 01));
    УстановитьПараметрДинамическогоСписка(ИмяРеквизитаТаблицы, "ДатаКон"  , Дата(2050, 01, 01));
    УстановитьПараметрДинамическогоСписка(ИмяРеквизитаТаблицы, "масПомеченныхДоков", СписокВыбранныхСтрок.ВыгрузитьЗначения());
	УстановитьПараметрДинамическогоСписка(ИмяРеквизитаТаблицы, "НаправлениеОбмена", ПредопределенноеЗначение("Перечисление.ЭКОМ_НаправлениеОбмена.ПустаяСсылка"));
	
КонецПроцедуры

// Процедура - Обновить активный список - аналог системной команды платформы для динамического списка чтобы обновлять подчиненные списки без смены текущей строки
//
// Параметры:
//  Команда  - Команда - любая команда
//
&НаКлиенте
Процедура ОбновитьАктивныйСписок(Команда = Неопределено)
    
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	ОбновитьЦепочкуДокументовИКвитанцииНаКлиенте(ДанныеСписка.ИмяСписка);
	ОбновитьДинамическийСписок(ДанныеСписка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтправитьФайлыНаСервереБезКонтекста(ОбработкаТип, МассивФайловВсего, ТипДокумента, МассивЛогаСобытий, ЭтоРегламентноеЗадание, ЭтоНовыеДокументы, СтруктураЛога)

	 Если НЕ ЗначениеЗаполнено(ОбработкаТип) Тогда
	     Возврат;     
	 КонецЕсли;
	 
	 ОбработкаОбъект = Новый (ЗначениеИзСтрокиВнутр(ОбработкаТип));
	 ОбработкаОбъект.ОтправитьФайлы(МассивФайловВсего, ТипДокумента, МассивЛогаСобытий, ЭтоРегламентноеЗадание, ЭтоНовыеДокументы, СтруктураЛога); 
	 
 КонецПроцедуры
 
&НаСервереБезКонтекста
Процедура ОтправитьФайлыНаСервереСПодписьюБезКонтекста(ОбработкаТип, МассивФайловВсего, ТипДокумента, МассивЛогаСобытий, ЭтоРегламентноеЗадание)

	 Если НЕ ЗначениеЗаполнено(ОбработкаТип) Тогда
	     Возврат;     
	 КонецЕсли;
	 
	 ОбработкаОбъект = Новый (ЗначениеИзСтрокиВнутр(ОбработкаТип));
	 ОбработкаОбъект.ОтправитьФайлыНаСервереСПодписью(МассивФайловВсего, ТипДокумента, МассивЛогаСобытий, ЭтоРегламентноеЗадание); 
	 
КонецПроцедуры

 &НаСервереБезКонтекста
Функция ПолучитьВсеФайлыНаСервереБезКонтекста(ОбработкаТип, МассивФайловСКлиента, ТипДокумента, ОбработатьФайлыНаКлиенте, МассивЛогаСобытий, ЭтоРегламентноеЗадание, СтруктураЛога)

	Если НЕ ЗначениеЗаполнено(ОбработкаТип) Тогда
		Возврат Неопределено;     
	КонецЕсли;
	 ОбработкаОбъект = Новый (ЗначениеИзСтрокиВнутр(ОбработкаТип));
	 МассивСтруктурыФайловСервера = ОбработкаОбъект.ПолучитьВсеФайлы(МассивФайловСКлиента, ТипДокумента, ОбработатьФайлыНаКлиенте, МассивЛогаСобытий, ЭтоРегламентноеЗадание, СтруктураЛога); 
	 Возврат МассивСтруктурыФайловСервера;

КонецФункции

&НаСервереБезКонтекста
Функция ОтправитьВсеФайлыНаСервереБезКонтекста(ОбработкаТип, МассивСтрок, ТипДокумента, МассивЛогаСобытий, ЭтоРегламентноеЗадание, НомерИсправления, ПодписатьФайл, ЭтоНовыеДокументы, СтруктураЛога)
	
	Если НЕ ЗначениеЗаполнено(ОбработкаТип) Тогда
		Возврат Неопределено;     
	КонецЕсли;
	ОбработкаОбъект = Новый (ЗначениеИзСтрокиВнутр(ОбработкаТип));
	МассивСтруктур  = ОбработкаОбъект.ОтправитьВсеФайлы(МассивСтрок, ТипДокумента, МассивЛогаСобытий, НомерИсправления, ЭтоРегламентноеЗадание, ПодписатьФайл, ЭтоНовыеДокументы, СтруктураЛога); 
	Возврат МассивСтруктур;
	 
КонецФункции 

&НаКлиенте
Процедура НачатьВыполнениеВФоне(ПараметрыЗапуска, ИмяМетодаВыполнения, ТекстСообщения) 

	ПараметрыЗапуска.Вставить("ИмяМетодаВыполнения", ИмяМетодаВыполнения);
		
	Если ЭтаФорма.ЭтоВнешняяОбработка 
		И НЕ ЗначениеЗаполнено(ОбъектСсылка) Тогда		
		ДанныеОбработки = Новый ДвоичныеДанные(ЭтаФорма.ИспользуемоеИмяФайла);
	Иначе
		ДанныеОбработки = Неопределено;
	КонецЕсли;

    СтруктураФоновогоЗадания = ВыполнитьФоновоеЗаданиеНаСервере(ЭтаФорма.ИспользуемоеИмяФайла, ДанныеОбработки, ЭтаФорма.ЭтоВнешняяОбработка, ЭтаФорма.ОбъектСсылка, ПараметрыЗапуска, УникальныйИдентификатор);
    
    ПараметрыОжидания = Вычислить("ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма)");
    ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения          = Истина;
	ПараметрыОжидания.ВыводитьОкноОжидания       = Истина;
	ПараметрыОжидания.ТекстСообщения             = ТекстСообщения;
	
	Если ПараметрыЗапуска.Свойство("ИмяСобытия") Тогда
		ПараметрыОжидания.Вставить("ИмяСобытия", ПараметрыЗапуска.ИмяСобытия);
	КонецЕсли;
	
    // указываем интервал обновления состояния в секундах, если не указать, 
    // то интервал будет увеличиваться при каждой итерации в 1.4 раза.
    ПараметрыОжидания.Интервал = 3;
    
    Выполнить("ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, Новый ОписаниеОповещения(""ФоновоеЗаданиеЗавершение"", ЭтаФорма), ПараметрыОжидания);");
        
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьФоновоеЗаданиеНаСервере(ИспользуемоеИмяФайла, ДанныеОбработки, ЭтоВнешняяОбработка, ОбъектСсылка, ПараметрыЗапуска, УникальныйИдентификатор)

  	ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки";	
  	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("БезопасныйРежим", Ложь);
	ПараметрыЗадания.Вставить("ЭтоВнешняяОбработка"          , ЭтоВнешняяОбработка);
    ПараметрыЗадания.Вставить("ДополнительнаяОбработкаСсылка", ОбъектСсылка);
    ПараметрыЗадания.Вставить("ИмяМетода"                    , "ВыполнитьКомандуВФоне");

	Если ЭтоВнешняяОбработка Тогда
		Если НЕ ЗначениеЗаполнено(ОбъектСсылка) Тогда
			ИмяОбработки = ПолучитьИмяВременногоФайла("epf");
			ДанныеОбработки.Записать(ИмяОбработки);
			ПараметрыЗапуска.Вставить("ФайлКУдалению", ИмяОбработки);
			ПараметрыЗадания.Вставить("ИмяОбработки", ИмяОбработки);
		КонецЕсли;
	Иначе
		ПараметрыЗадания.Вставить("ИмяОбработки", ИспользуемоеИмяФайла);
	КонецЕсли;
	ПараметрыЗадания.Вставить("ПараметрыВыполнения", ПараметрыЗапуска);
      
    ПараметрыВыполнения                             = Вычислить("ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор)");
    ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Фоновое задание длительной операции");
    ПараметрыВыполнения.ЗапуститьВФоне              = Истина;
    ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 
	
    СтруктураФоновогоЗадания = Вычислить("ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗадания, ПараметрыВыполнения)");
    
    Возврат СтруктураФоновогоЗадания;
    
КонецФункции

&НаКлиенте
Процедура ФоновоеЗаданиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Если Результат = Неопределено Тогда
        Возврат;
    ИначеЕсли Результат.Статус = "Ошибка" Тогда
        Выполнить("ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);");
    ИначеЕсли Результат.Статус = "Выполнено" Тогда
        // обрабатываем результат
        Данные = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
        Если ТипЗнч(Данные) = Тип("Структура") Тогда
			
			ТипДокумента          = Данные.СтруктураПараметров.ТипДокумента;
			НачалоВыполнения      = Данные.СтруктураПараметров.НачалоВыполнения;
			ДанныеСписка          = Данные.СтруктураПараметров.ДанныеСписка;
			МассивЛогаСобытий     = Данные.СтруктураПараметров.МассивЛогаСобытий;
			
			ПодписатьФайл = Ложь;
			Если Данные.СтруктураПараметров.Свойство("ПодписатьФайл") Тогда
			     ПодписатьФайл = Данные.СтруктураПараметров.ПодписатьФайл;		
			КонецЕсли;
													
			Если Данные.СтруктураПараметров.ИмяМетодаВыполнения = "ПолучитьВсеФайлы" Тогда
				
				 ОбщийПроцентПрогресса = Данные.СтруктураПараметров.ОбщийПроцентПрогресса;
				 МассивСтруктурыФайловСервера = Данные.МассивСтруктурыФайловСервера;
				 ЛокальныйКаталогINBOX = Данные.СтруктураПараметров.ЛокальныйКаталогINBOX;
				 СтруктураЛога = Данные.СтруктураПараметров.СтруктураЛога;
				 КлючЗаписиЦепочкиДокументов = Данные.СтруктураПараметров.КлючЗаписиЦепочкиДокументов;

				 ОбработатьПолучениеФайловНаКлиенте(МассивСтруктурыФайловСервера, ТипДокумента, ЛокальныйКаталогINBOX, НачалоВыполнения, МассивЛогаСобытий, ДанныеСписка, ОбщийПроцентПрогресса, СтруктураЛога, КлючЗаписиЦепочкиДокументов);

			 ИначеЕсли Данные.СтруктураПараметров.ИмяМетодаВыполнения = "ОтправитьВсеФайлы" Тогда	
				
				ОбщийПроцентПрогресса  = Данные.СтруктураПараметров.ОбщийПроцентПрогресса;
				МассивСтруктур         = Данные.МассивСтруктур;
				ВыделенныеСтроки       = Данные.СтруктураПараметров.ВыделенныеСтроки;
				ПозицияТекущейСтроки   = Данные.СтруктураПараметров.ПозицияТекущейСтроки;
				СтруктураЛога          = Данные.СтруктураПараметров.СтруктураЛога;
                ПодписатьФайл          = Данные.СтруктураПараметров.ПодписатьФайл;
				ЭтоРегламентноеЗадание = Данные.СтруктураПараметров.ЭтоРегламентноеЗадание;
				ЭтоНовыеДокументы      = Данные.СтруктураПараметров.ЭтоНовыеДокументы;
				КлючЗаписиЦепочкиДокументов = Данные.СтруктураПараметров.КлючЗаписиЦепочкиДокументов;
				
				ОбработатьОтправкуФайловНаКлиенте(МассивСтруктур, ТипДокумента, НачалоВыполнения, МассивЛогаСобытий, ДанныеСписка, ПозицияТекущейСтроки, ВыделенныеСтроки, ОбщийПроцентПрогресса, ПодписатьФайл, СтруктураЛога, ЭтоРегламентноеЗадание, ЭтоНовыеДокументы, КлючЗаписиЦепочкиДокументов);
				
			ИначеЕсли Данные.СтруктураПараметров.ИмяМетодаВыполнения = "ОтправитьФайлы" Тогда
				
				ВыделенныеСтроки      = Данные.СтруктураПараметров.ВыделенныеСтроки;
				ОбщийПроцентПрогресса = Данные.СтруктураПараметров.ОбщийПроцентПрогресса;
				ПозицияТекущейСтроки  = Данные.СтруктураПараметров.ПозицияТекущейСтроки;
				СтруктураЛога         = Данные.СтруктураПараметров.СтруктураЛога;
				КлючЗаписиЦепочкиДокументов = Данные.СтруктураПараметров.КлючЗаписиЦепочкиДокументов;

				ЗавершитьОтправкуНаКлиенте(ТипДокумента, НачалоВыполнения, МассивЛогаСобытий, ДанныеСписка, ПозицияТекущейСтроки, ВыделенныеСтроки, ОбщийПроцентПрогресса, СтруктураЛога, КлючЗаписиЦепочкиДокументов);
				
			ИначеЕсли Данные.СтруктураПараметров.ИмяМетодаВыполнения = "СоздатьДокументПоДинамическойКнопке" Тогда
				
				ВыбранныеСтроки      	= Данные.СтруктураПараметров.ВыбранныеСтроки;
				ПозицияТекущейСтроки 	= Данные.СтруктураПараметров.ПозицияТекущейСтроки; 
				ИмяСобытия				= Данные.СтруктураПараметров.ИмяСобытия;
				КлючЗаписиЦепочкиДокументов = Данные.СтруктураПараметров.КлючЗаписиЦепочкиДокументов;
											
				ЗавершитьСозданиеДокументов(ДанныеСписка, МассивЛогаСобытий, НачалоВыполнения, ПозицияТекущейСтроки, ВыбранныеСтроки, ИмяСобытия, КлючЗаписиЦепочкиДокументов);
				 
			КонецЕсли;
			
			Если Данные.СтруктураПараметров.Свойство("ФайлКУдалению") Тогда			
				УдалитьВременныйФайл(Данные.СтруктураПараметров.ФайлКУдалению);	
			КонецЕсли;
			
			//Docrobot 1.20.0 MOD-1431 [Закомментировал вывод времени выполнения(повтор), добавил вывод лога если он не пуст] 
			Если МассивЛогаСобытий.Количество() <> 0 Тогда
				 ОтобразитьЛогСобытий(МассивЛогаСобытий);
			КонецЕсли;
			//НачалоВыполнения = '0001-01-01';
			//Если Данные.СтруктураПараметров.Свойство("НачалоВыполнения", НачалоВыполнения)
			//	И ЗначениеЗаполнено(НачалоВыполнения)
			//	И Данные.СтруктураПараметров.Свойство("ИмяСобытия") Тогда			
			//	ТекстЛогаСобытий = "Время выполнения " + ЭКОМ_ОбщегоНазначенияКлиент.СекундыВоВремяНаКлиенте(ТекущаяДата() - НачалоВыполнения).Строка;
			//	ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Информация"), Данные.СтруктураПараметров.ИмяСобытия);
			//	МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
			//	ОтобразитьЛогСобытий(МассивЛогаСобытий);
			//КонецЕсли; 
			
        КонецЕсли;
        
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УдалитьВременныйФайл(ИмяФайла)
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		УдалитьФайлы(ИмяФайла);
	КонецЕсли;
КонецПроцедуры

Функция ВыполнитьТекстКодаВЭтомКонтекстеФормы(ТекстКода, ПереченьПеременныхВСтруктуреРезультата = "") Экспорт
    Перем Результат;
    
    Если ЗначениеЗаполнено(ПереченьПеременныхВСтруктуреРезультата) Тогда
        ТекстКодаПолученияПеременных = "Результат = Новый Структура(""" + ПереченьПеременныхВСтруктуреРезультата + """, " + ПереченьПеременныхВСтруктуреРезультата + ")";
    Иначе
        ТекстКодаПолученияПеременных = ""
    КонецЕсли;
    
    ТекстКода = ТекстКодаПолученияПеременных + Символы.ПС + ТекстКода;
    Выполнить(ТекстКода);
    
    Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ПометкиСписокДляCondraУстановитьВсе(Команда)
	УправлениеПометкамиДинамическогоСписка(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПометкиСписокДляCondraСнятьВсе(Команда)
	УправлениеПометкамиДинамическогоСписка(Ложь);
КонецПроцедуры

// Вызывает соответствующую функцию модуля объекта
//
// Возвращаемое значение:
//   Массив   - Коллекция поддерживаемых расширений с типом Строка
//
&НаСервере
Функция ПоддерживаемыеРасширенияCONDRAНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Результат 		= ОбработкаОбъект.ПоддерживаемыеРасширенияCONDRA();
	
	Возврат Результат;
	
КонецФункции // ПоддерживаемыеРасширенияCONDRAНаСервере()

&НаКлиенте
Процедура КомандаЗакрытьИндикатор(Команда)
	Элементы.ПолеИндикатор.Видимость = Ложь;
	Элементы.КомандаЗакрытьИндикатор.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСинхронизацияКвитанций(Команда)
	
	КлючУникальностиФормы = "ЭКОМ_СинхронизацияКвитанций";
    
    ФормаСинхронизации = ОткрытьФорму(ПолноеИмяОбработки + ".Форма.УФ_СинхронизацияКвитанций", , ЭтаФорма, КлючУникальностиФормы);
    ФормаСинхронизации.Активизировать();

КонецПроцедуры

&НаКлиенте
Процедура КомандаНадписьОшибка(Команда)
	
	Элементы.КомандаНадписьОшибка.Видимость = Ложь;
    ОткрытьФорму("РегистрСведений.ЭКОМ_Логирование.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьФайлДокументаНаКлиенте(ИмяФайлаXML, ТекстXML, КодировкаФайла, ВременныйКаталог)
	
	ПолноеИмяФайлаXML = ВременныйКаталог + ИмяФайлаXML;
	Текст = Новый ТекстовыйДокумент; 
	Текст.УстановитьТекст(ТекстXML); 
	Текст.Записать(ПолноеИмяФайлаXML, КодировкаФайла); 
	
	ФайлXML = Новый Файл(ПолноеИмяФайлаXML);
	
	Возврат ФайлXML;			
		
КонецФункции

&НаКлиенте
Процедура ПометкиСписокДляЭТРНСнятьВсе(Команда)
	УправлениеПометкамиДинамическогоСписка(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПометкиСписокДляЭТРНУстановитьВсе(Команда)
	УправлениеПометкамиДинамическогоСписка(Истина);
КонецПроцедуры

&НаСервере
Процедура РазблокировкаПроцессаОбменаНаСервере()
	
	ОбъектЭтаОбработка = РеквизитФормыВЗначение("Объект");

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Измерение", "Блокировка");
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ЗначениеДополнительнойКонстанты", Ложь);
	
	ОбъектЭтаОбработка.ЗаписьВРегистр("ЭКОМ_ЗначениеДополнительныхКонстант", ПараметрыОтбора, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура РазблокировкаПроцессаОбмена(Команда)
	
	РазблокировкаПроцессаОбменаНаСервере();
	
	МассивЛогаСобытий = Новый Массив;
	ТекстЛогаСобытий = "Обмен документами разблокирован!";
	ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Информация"), "Разблокировка документов");
	МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

	ОтобразитьЛогСобытий(МассивЛогаСобытий);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЛокальныйКаталог(ЛокальныйКаталог, РазделительПути)

	// Проверка каталога
	Если НЕ Прав(ЛокальныйКаталог, 1) = РазделительПути 
		И ЗначениеЗаполнено(ЛокальныйКаталог) Тогда	
		ЛокальныйКаталог = ЛокальныйКаталог + РазделительПути; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭКОМ_СоздатьКаталог(ЛокальныйКаталог, ДанныеОС)
	
	Диск            = ДанныеОС.Получить("Диск");
	РазделительПути = ДанныеОС.Получить("РазделительПути");

	Файл = Новый Файл(ЛокальныйКаталог);
	Если Файл.Существует() Тогда
		
		Если Файл.ЭтоФайл() Тогда
			Сообщить("Каталог <" + ЛокальныйКаталог + "> является файлом (195). Создан каталог по умолчанию!!! ", СтатусСообщения.Важное);
			ЛокальныйКаталог = ОпределитьКаталогПоУмолчанию(Диск, РазделительПути);
			СоздатьКаталог(ЛокальныйКаталог);
			Сообщить("Создан каталог по умолчанию!!! - <" + ЛокальныйКаталог + ">", СтатусСообщения.Важное);
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(ЛокальныйКаталог) Тогда
			Попытка
				СоздатьКаталог(ЛокальныйКаталог);
			Исключение
				Сообщить("Ошибка при создании каталога (196): <" + ЛокальныйКаталог + ">");
				ЛокальныйКаталог = ОпределитьКаталогПоУмолчанию(Диск, РазделительПути);
				СоздатьКаталог(ЛокальныйКаталог);
	            Сообщить("Создан каталог по умолчанию!!! - <" + ЛокальныйКаталог + ">", СтатусСообщения.Важное);
			КонецПопытки;	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПометкиСписокДляПрайсЛистаСнятьВсе(Команда)
	УправлениеПометкамиДинамическогоСписка(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПометкиСписокДляПрайсЛистаУстановитьВсе(Команда)
	УправлениеПометкамиДинамическогоСписка(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИсходящийCondra_Добавить(Команда)
	
    КлючУникальностиФормы = "ФормаНовыйCONDRA";
	
	ПараметрыНастроек = Новый Структура;
	
	ПараметрыНастроек.Вставить("ЭКОМОбъектыАктуальны", 			ЭтаФорма.ЭКОМОбъектыАктуальны);
	ПараметрыНастроек.Вставить("ДополнительнаяОбработкаСсылка", ЭтаФорма.ОбъектСсылка);
    
    ФормаНастроек = ОткрытьФорму(ПолноеИмяОбработки + ".Форма.УФ_ФормаНовыйCONDRA", ПараметрыНастроек, ЭтаФорма, КлючУникальностиФормы);
    ФормаНастроек.Активизировать();

КонецПроцедуры

&НаКлиенте
Процедура ИсходящийCondra_Отправить(Команда, transguidКОтправке = Неопределено) Экспорт
	
	ИмяСобытия = "Отправка CONDRA";
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	Если ДанныеСписка.ИмяСписка = "" Тогда
		Возврат;
	КонецЕсли;
	
	ПозицияТекущейСтроки = Неопределено;	
	
	ВыделенныеЗаписи = Новый Массив;
	Если transguidКОтправке = Неопределено Тогда
		
		ВыделенныеЗаписи = ПолучитьСтрокиДинамическогоСпискаДляОбработки(ДанныеСписка, ПозицияТекущейСтроки);
		
		transguidКОтправке = Новый Массив;
		Для Каждого Запись Из ВыделенныеЗаписи Цикл
			transguidКОтправке.Добавить(Запись.ИД_Документа);
		КонецЦикла;
	
	КонецЕсли;

	МассивЛогаСобытий 	= Новый Массив;
	
	Если transguidКОтправке.Количество() = 0 Тогда
		ТекстЛогаСобытий = "Нет данных для отправки";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Предупреждение"), ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

		ОтобразитьЛогСобытий(МассивЛогаСобытий);
		Возврат;
	КонецЕсли;
	
	ЗначениеПоУмолчанию = Неопределено;
	Измерение           = Неопределено; 
	Обязательно         = Истина;
	
	ЛокальныйКаталогOUTBOX_Архив = Вычислить("ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере(""ЭКОМ_Локальный_Каталог_OUTBOX_Архив"", ЗначениеПоУмолчанию, Измерение, Обязательно)");
	
	ЗаписиКОтправке = ИсходящийCondra_ПодготовитьКОтправкеНаСервере(transguidКОтправке, МассивЛогаСобытий);
	
	// Подписание на клиенте.
	МаксИндекс = ЗаписиКОтправке.ВГраница();
	Для Индекс = 0 По МаксИндекс Цикл
		Запись = ЗаписиКОтправке.Получить(МаксИндекс - Индекс);
		Если Запись.СертификатНаСервере = Ложь Тогда
			ДвоичныеДанныеФайлаДанных = ПолучитьИзВременногоХранилища(Запись.АдресФайлаДанных);
			Если Запись.Страна = "kz" Тогда //MOD-2544  					
				Base64ДанныеФайлаBIN = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ПодписатьТекстKalkanCryptCOM(ДвоичныеДанныеФайлаДанных, МассивЛогаСобытий)");
				ДвоичныеДанныеФайлаBIN = Base64Значение(Base64ДанныеФайлаBIN);
				Если Base64ДанныеФайлаBIN = Неопределено Тогда 
					ОтобразитьЛогСобытий(МассивЛогаСобытий);
					Возврат;
				КонецЕсли;
			Иначе	
				ДвоичныеДанныеФайлаBIN = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ЭЦП_СформироватьПодписьФайлаОбщегоНазначения(ДвоичныеДанныеФайлаДанных, Запись.ДанныеСертификатаЭКОМ, МассивЛогаСобытий)");
			КонецЕсли;
			Если ДвоичныеДанныеФайлаBIN = Неопределено Тогда
				ТекстЛогаСобытий = "Ошибка подписания файла на клиенте. Проверьте настройки подписи (TRANSGUID " + Запись.Идентификатор + ")";
				ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
				МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

				ЗаписиКОтправке.Удалить(МаксИндекс - Индекс);
				Продолжить;
			КонецЕсли;
			Запись.АдресФайлаДанных = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайлаДанных, Новый УникальныйИдентификатор);
			Запись.АдресФайлаBIN 	= ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайлаBIN, Новый УникальныйИдентификатор);
		КонецЕсли;
	КонецЦикла;
	
	ЗаписиОтправленные	= ИсходящийCondra_ОтправитьНаСервере(ЗаписиКОтправке, МассивЛогаСобытий);
	РазделительПути 	= ЭКОМ_ПолучитьРазделительПутиОСКлиента().Получить("РазделительПути");
	
	КаталогСохранения = ЛокальныйКаталогOUTBOX_Архив + ДанныеСписка.Путь
		+ РазделительПути + Формат(ТекущаяДата(), "ДФ=yyyyMMdd") + РазделительПути;		
	СоздатьКаталог(КаталогСохранения);
	
	Для Каждого Запись Из ЗаписиОтправленные Цикл
		Если НЕ Запись.Отправлен = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(Запись.АдресАрхива);
		ДвоичныеДанные.Записать(КаталогСохранения + Запись.ИмяАрхива);
		
	КонецЦикла;
	
	ОбновитьДинамическийСписок(ДанныеСписка);
	ВосстановитьТекущуюСтрокуСписка(ПозицияТекущейСтроки, ДанныеСписка.ИмяСписка, ВыделенныеЗаписи);
	ОтобразитьЛогСобытий(МассивЛогаСобытий);
	
КонецПроцедуры

// Подготавливает к отправке документы CONDRA по выделенным строкам на сервере
//
// Параметры:
//  transguidКОтправке  - Массив - коллекция значений TRANSGUID из РС ЭКОМ_ЦепочкиНеструктурированныхДокументов для отправки
//  МассивЛогаСобытий  	- Массив - данные лога бсобытий
//
// Возвращаемое значение:
//   Массив - коллекция подготовленных записей
//
&НаСервере
Функция ИсходящийCondra_ПодготовитьКОтправкеНаСервере(transguidКОтправке, МассивЛогаСобытий)

	ОбработкаОбъект	= РеквизитФормыВЗначение("Объект");
	ЗаписиКОтправке =  ОбработкаОбъект.CondraПодготовитьКОтправке(transguidКОтправке, МассивЛогаСобытий);
	ОбработкаОбъект.CondraДобавитьОтпрвляемыеФайлы(ЗаписиКОтправке, МассивЛогаСобытий);
	
	Возврат ЗаписиКОтправке;
	
КонецФункции // ИсходящийCondra_ПодготовитьКОтправкеНаСервере()

// Выполняет отправку документа CONDRA по выделенным строкам на сервере
//
// Параметры:
//  ЗаписиКОтправке  	- Массив - коллекция подготовленных записей
//  МассивЛогаСобытий  	- Массив - данные лога бсобытий
//
// Возвращаемое значение:
//   Массив - коллекция обработанных записей
//
&НаСервере
Функция ИсходящийCondra_ОтправитьНаСервере(ЗаписиКОтправке, МассивЛогаСобытий)

	ОбработкаОбъект		= РеквизитФормыВЗначение("Объект");
	ЗаписиОтправленные 	= ОбработкаОбъект.CondraОтправить(ЗаписиКОтправке, МассивЛогаСобытий);

	Возврат ЗаписиОтправленные;

КонецФункции // ИсходящийCondra_ОтправитьНаСервере()

&НаКлиенте
Процедура СписокДляПрайсЛистаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент = Неопределено 
		Или Элемент.ТекущиеДанные = Неопределено 
		Или ВыбраннаяСтрока = Неопределено Тогда
        Возврат;
    КонецЕсли;
    СтандартнаяОбработка = Ложь;
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	Если Поле.Имя = ДанныеСписка.ИмяСписка + "Пометка" Тогда
		
		Если Не Элемент.ТекущиеДанные = Неопределено Тогда
			Если Элемент.ТекущиеДанные.Пометка Тогда
				СнятьПометку(Элемент.ТекущиеДанные.ДокументыВсе);
			Иначе
				ПоставитьПометку(Элемент.ТекущиеДанные.ДокументыВсе);
			КонецЕсли;
		КонецЕсли;
		
		//Параметр в динамическом списке нужно обновить
		УстановитьПараметрДинамическогоСписка(ДанныеСписка.ИмяРеквизитаТаблицы, "масПомеченныхДоков", СписокВыбранныхСтрок.ВыгрузитьЗначения());
    
    КонецЕсли;
	
	ЭлементОбъект = ОпределитьТипОбъекта(Элемент, Поле.Имя);
    Если ЗначениеЗаполнено(ЭлементОбъект) Тогда
        ПоказатьЗначение( , ЭлементОбъект);
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Процедура СписокДляПрайсЛистаПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПриОбновленииСоставаПользовательскихНастроекНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере()
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаСервере();
	СоздатьСоставПользовательскихНастроекНаСервере(ДанныеСписка);
	СоздатьДеревоПользовательскихНастроекНаСервере(ДанныеСписка, Новый Массив);

КонецПроцедуры

&НаКлиенте
Процедура СписокДляПрайсЛистаВходящийПриАктивизацииСтроки(Элемент)
	
	Если НЕ Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.ГруппаПрайсЛист Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ТаблицаЦепочкаДокументов.Видимость = Истина;
	Элементы.ТаблицаКвитанций.Видимость         = Ложь;
	Элементы.ТаблицаПалет.Видимость             = Ложь;

	Если НЕ ТекущийЭлемент.Имя = "КомандаФильтрыИМеню" Тогда
		ОбновитьЦепочкуДокументовИКвитанцииНаКлиенте("СписокДляПрайсЛистаВходящий");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокДляПрайсЛистаИсходящийПриАктивизацииСтроки(Элемент)
	
	Если НЕ Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.ГруппаПрайсЛист Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТекущийЭлемент.Имя = "КомандаФильтрыИМеню" Тогда
		ОбновитьЦепочкуДокументовИКвитанцииНаКлиенте("СписокДляПрайсЛистаИсходящий");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПрайсЛистаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	// Очищаем пометки при смене страницы
	СписокВыбранныхСтрок.Очистить();
	
	МассивЛогаСобытий = Новый Массив;
	
	ДанныеСписка = ПолучитьТекущиеДанныеПоИмениСпискаНаКлиенте();
	СоздатьДинамическийСписокДобавитьДинамическиеКнопки(МассивЛогаСобытий);
	ОбновитьЦепочкуДокументовИКвитанцииНаКлиенте(ДанныеСписка.ИмяСписка);
	ОбновитьДинамическийСписок(ДанныеСписка);

	Если МассивЛогаСобытий.Количество() > 0  Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий)");
		Сообщение.Сообщить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурналРегистрации(Команда)
	
	ЕстьЖурнал = ЖурналСуществует();
	Если ЕстьЖурнал = Истина Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ДатаНачала", НачалоДня(ТекущаяДата()));
		ПараметрыФормы.Вставить("Пользователь", ТекущийПользователь);

		Форма = ОткрытьФорму("Обработка.ЖурналРегистрации.Форма.ЖурналРегистрации", ПараметрыФормы);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЖурналСуществует()
	
	ЕстьЖурнал = Ложь;
	НайденныеМетаданные = Метаданные.Обработки.Найти("ЖурналРегистрации");
	Если НЕ НайденныеМетаданные = Неопределено Тогда
		ЕстьЖурнал = Истина;
	КонецЕсли;

	Возврат ЕстьЖурнал;
	
КонецФункции

&НаКлиенте
Процедура КомандаСформироватьЛог(Команда)
	СформироватьЛогСобытий(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРегистрЛогаСобытий(Команда)
	ОткрытьФорму("РегистрСведений.ЭКОМ_Логирование.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ПодвалСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Элементы.ПодвалСтраницы.ПодчиненныеЭлементы.ГруппаПолеЛогаСобытий.Заголовок = "События";
КонецПроцедуры

&НаКлиенте
Процедура КомандаСправка(Команда)
	ЭтаФорма.ОткрытьСправкуФормы();
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИнформациюОЛокальныхКаталогах(ЛокальнаяРаботаСФайлами, ЛокальныйКаталогOUTBOX_Архив, ТипДокумента, РазделительПути, МассивЛогаСобытий)
	
	ДополнениеПути = ТипДокумента + РазделительПути + Формат(ТекущаяДата(), "ДФ=yyyyMMdd") + РазделительПути;

	Если НЕ ЗначениеЗаполнено(ЛокальныйКаталогOUTBOX_Архив)
		ИЛИ ЛокальныйКаталогOUTBOX_Архив = РазделительПути Тогда
		КаталогСохраненияФайл = Неопределено;
	Иначе	
		ПроверитьЛокальныйКаталог(ЛокальныйКаталогOUTBOX_Архив, РазделительПути);		
		КаталогСохранения = ЛокальныйКаталогOUTBOX_Архив + ДополнениеПути;		
		КаталогСохраненияФайл = ЭКОМ_СоздатьКаталогПроверитьНаЗаписьКлиент(КаталогСохранения, МассивЛогаСобытий);     			
	КонецЕсли;
	
	КаталогMarkingДоступен = Истина;        	
	Если ЭКОМ_ОбщегоНазначения.ИспользуетсяОтправкаВMarking() Тогда
		КаталогMarking = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_Локальный_Каталог_Marking", "", Неопределено, Истина);
		Если ЗначениеЗаполнено(КаталогMarking) Тогда
			ПроверитьЛокальныйКаталог(КаталогMarking, РазделительПути);
			КаталогMarkingДоступен = ЭКОМ_ОбщегоНазначения.ЭКОМ_СоздатьКаталогПроверитьНаЗапись(КаталогMarking, МассивЛогаСобытий);
		Иначе
			КаталогMarkingДоступен = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	КаталогOutboxДоступен = Истина;
	Если ЛокальнаяРаботаСФайлами Тогда
		КаталогOUTBOX = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_Локальный_Каталог_OUTBOX", "", Неопределено, Истина); 
		Если ЗначениеЗаполнено(КаталогOUTBOX) Тогда
			ПроверитьЛокальныйКаталог(КаталогOUTBOX, РазделительПути);
			КаталогOUTBOX = КаталогOUTBOX;
			КаталогOutboxДоступен = ЭКОМ_ОбщегоНазначенияКлиент.ЭКОМ_СоздатьКаталогПроверитьНаЗапись(КаталогOUTBOX, МассивЛогаСобытий);
			Если КаталогOutboxДоступен = Неопределено Тогда
				КаталогOutboxДоступен = Ложь;
			Иначе
				КаталогOutboxДоступен = Истина;
			КонецЕсли;
		Иначе
			КаталогOutboxДоступен = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("КаталогMarkingДоступен", КаталогMarkingДоступен);
	Результат.Вставить("КаталогOutboxДоступен" , КаталогOutboxДоступен);
	Результат.Вставить("КаталогMarking"		   , ?(КаталогMarkingДоступен, КаталогMarking, ""));
	Результат.Вставить("КаталогOUTBOX" 		   , ?(КаталогOutboxДоступен , КаталогOUTBOX , ""));
	Результат.Вставить("КаталогСохранения"     , КаталогСохранения);
	Результат.Вставить("КаталогСохраненияФайл" , КаталогСохраненияФайл);
	
	Возврат Результат;
КонецФункции


&НаКлиенте
Процедура СписокДляПокупателяПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура СписокДляЭТРНПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура СписокДляCondraПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура СписокДляПрайсЛистаВходящийПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура СписокДляПрайсЛистаИсходящийПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура СписокДляПоставщикаПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура ОбновитьИдентификаторыВыделенныхСтрок(ВыделенныеСтроки, ИмяСписка)
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// сбор документов выделенных строк для использования в отборах при обращении к регистру цепочки
	Если ИмяСписка = "СписокДляПоставщика" Тогда
		СоответствиеЦепочки = СоответствиеПолейЦепочкиПоставщика();
		МассивПолейЦепочки  = МассивПолейЦепочкиПоставщика();
		ИмяРегистра = "ЭКОМ_ЦепочкиДокументовПоставщика";
		ЭКОМДокументы = МассивЭКОМДокументовЦепочкиПоставщика();
		ТиповыеДокументы = МассивТиповыхДокументовЦепочкиПоставщика();
	ИначеЕсли ИмяСписка = "СписокДляПокупателя" Тогда
		СоответствиеЦепочки = СоответствиеПолейЦепочкиПокупателя();
		МассивПолейЦепочки  = МассивПолейЦепочкиПокупателя();
		ИмяРегистра = "ЭКОМ_ЦепочкиДокументовПокупателя";
		ЭКОМДокументы = МассивЭКОМДокументовЦепочкиПокупателя();
		ТиповыеДокументы = МассивТиповыхДокументовЦепочкиПокупателя();
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ВыделенныеСтроки[0].Свойство("Полученные") ИЛИ ВыделенныеСтроки[0].Свойство("КлючЗаписиЦепочкиДокументов") Тогда
		Для Каждого Строка Из ВыделенныеСтроки Цикл
			Для Каждого Элемент Из СоответствиеЦепочки Цикл
				Строка.Вставить(Элемент.Ключ, Строка.ИдентификаторВыделенныхСтрок[Элемент.Значение]);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	МассивыДокументов = Новый Структура;
	Для Каждого Элемент Из СоответствиеЦепочки Цикл
		МассивыДокументов.Вставить(Элемент.Значение, Новый Массив);
	КонецЦикла;

	Для Каждого Строка Из ВыделенныеСтроки Цикл	
		Для Каждого Элемент Из СоответствиеЦепочки Цикл
			Если Строка.Свойство(Элемент.Ключ) = Ложь Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументСтроки = Строка[Элемент.Ключ];
			Если ЗначениеЗаполнено(ДокументСтроки) Тогда
				МассивДокументов = МассивыДокументов[Элемент.Значение];
				МассивДокументов.Добавить(ДокументСтроки);	
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// получение всех измерений цепочки для заполнения полей запроса
	Измерения	   = "";
	СтруктураКлюча = Новый Структура;
	Для Каждого Измерение Из Метаданные.РегистрыСведений[ИмяРегистра].Измерения Цикл
		Измерения = Измерения + Измерение.Имя + ",";
		СтруктураКлюча.Вставить(Измерение.Имя);
	КонецЦикла;
	
	МассивПолей = ЭКОМ_ОбщегоНазначения.Эком_РазложитьСтрокуВМассивПодстрок(Измерения, ",", Истина, Истина); 
	Запрос      = ЭКОМ_ОбщегоНазначения.ЗапросКРегиструЭКОМ(ИмяРегистра, МассивПолей, МассивыДокументов, "В", "ИЛИ");
	
	Если ВыделенныеСтроки[0].Свойство("Полученные") Тогда
		Для Каждого Строка Из ВыделенныеСтроки Цикл
			Для Каждого Элемент Из СоответствиеЦепочки Цикл
				Строка.Вставить(Элемент.Ключ, Строка.ИдентификаторВыделенныхСтрок[Элемент.Значение]);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	
	Попытка
		ТаблицаЦепочки = Запрос.Выполнить().Выгрузить();
		// актуализация ключа записи для строки-источника таблицы формы ЦепочкаДокументов
		Если ВыделенныеСтроки[0].Свойство("КлючЗаписиЦепочкиДокументов") Тогда
			Строка = ВыделенныеСтроки[0];
			НоваяЗапись = Неопределено;
			Для Каждого Ключ Из МассивПолейЦепочки Цикл
				Если Строка.Свойство(Ключ) = Ложь Тогда
					Продолжить;
				КонецЕсли;
				ЗначениеСоответствия = СоответствиеЦепочки.Получить(Ключ);
				
				ДокументДляПоиска = Строка[Ключ]; 
				Если ЗначениеЗаполнено(ДокументДляПоиска) Тогда
					НайденныеСтроки = ТаблицаЦепочки.НайтиСтроки(Новый Структура(ЗначениеСоответствия, Строка[Ключ]));
					Если НайденныеСтроки.Количество() = 1 Тогда
						НоваяЗапись = НайденныеСтроки[0];
						Прервать;
					КонецЕсли;
				КонецЕсли;				
			КонецЦикла;
			
			Если НоваяЗапись = Неопределено Тогда
				ВыделенныеСтроки = Новый Структура("ИдентификаторВыделенныхСтрок, КлючЗаписиЦепочкиДокументов, УдалосьОпределить", ВыделенныеСтроки[0].ИдентификаторВыделенныхСтрок, Истина, Ложь);
			Иначе
				ЗаполнитьЗначенияСвойств(СтруктураКлюча, НоваяЗапись);
				КлючЗаписи  = РегистрыСведений[ИмяРегистра].СоздатьКлючЗаписи(СтруктураКлюча);
				ВыделенныеСтроки = Новый Структура("ИдентификаторВыделенныхСтрок, КлючЗаписиЦепочкиДокументов, УдалосьОпределить",КлючЗаписи, Истина, Истина);
			КонецЕсли;
			
			Возврат;
		КонецЕсли;
		
		Для Каждого Строка Из ВыделенныеСтроки Цикл
			Отбор = Новый Структура;
			// заполнение отбора всеми доступными документами выделенной строки
			Для Каждого Элемент Из СоответствиеЦепочки Цикл
				// если строка является повторной (документ пересоздается), то отбор будет только по тем документам,
				// которые нельзя пересоздать (все ЭКОМ и для покупателя дополнительно - заказ)
				Если Строка.Свойство("Повтор") И ЭКОМДокументы.Найти(Элемент.Ключ) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				//// если строка является полученной, то отбор будет только по тем документам,
				//// которые нельзя получить (все типовые документы 1С в цепочке)
				Если Строка.Свойство("Полученные") И ТиповыеДокументы.Найти(Элемент.Ключ) = Неопределено Тогда
					Продолжить;
				КонецЕсли;  
				
				Если Строка.Свойство(Элемент.Ключ) = Ложь Тогда
					Продолжить;
				КонецЕсли;
				
				ДокументДляПоиска = Строка[Элемент.Ключ]; 
				Если ЗначениеЗаполнено(ДокументДляПоиска) Тогда
					Отбор.Вставить(Элемент.Значение, Строка[Элемент.Ключ]);
				КонецЕсли;
			КонецЦикла;
			
			// поиск строки в регистре цепочки с актуальными данными, по отбору данными выделенной строки до изменения
			// когда поиск успешен, актуализируется идентификатор выделенных строк
			НайденныеСтроки = ТаблицаЦепочки.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() Тогда
				ЗаполнитьЗначенияСвойств(СтруктураКлюча, НайденныеСтроки[0]);
				КлючЗаписи  = РегистрыСведений[ИмяРегистра].СоздатьКлючЗаписи(СтруктураКлюча);
				Строка.ИдентификаторВыделенныхСтрок = КлючЗаписи;  				
			КонецЕсли;
		КонецЦикла;

	Исключение
		Сообщить("Не удалось обновить идентификаторы выделенных строк");
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокВыбранныхСтрок(ИмяСписка);
	ТЗ = ДинамическийСписок_в_ТЗ(ИмяСписка);
	ПоследнийИндекс = СписокВыбранныхСтрок.Количество() - 1;
	
	МассивEDI = ЭКОМ_ВзаимодействиеREST_API.ПолучитьМассивТиповEDI();	
	Если ИмяСписка = "СписокДляПоставщика" Тогда
		ИменаДокументовЦепочки = МассивИменДокументовЦепочкиПоставщика();
	ИначеЕсли ИмяСписка = "СписокДляПокупателя" Тогда
		ИменаДокументовЦепочки = МассивИменДокументовЦепочкиПокупателя();
	ИначеЕсли ЭКОМ_ОбщегоНазначения.ПоискВСтроке(ИмяСписка, "СписокДляПрайсЛиста") > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЭКОМ_Документы.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭКОМ_Документы КАК ЭКОМ_Документы
		|		ПО (ЭКОМ_Документы.Документ1С = УстановкаЦенНоменклатуры.Ссылка)
		|			И (ЭКОМ_Документы.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.PRICAT_Исходящий))
		|ГДЕ
		|	УстановкаЦенНоменклатуры.Ссылка В(&МассивУстановок)
		|	И НЕ ЭКОМ_Документы.Ссылка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЭКОМ_Документы.Документ1С
		|ИЗ
		|	Документ.ЭКОМ_Документы КАК ЭКОМ_Документы
		|ГДЕ
		|	ЭКОМ_Документы.Ссылка В(&МассивPRICAT)
		|	И ЭКОМ_Документы.ВидДокумента = ЗНАЧЕНИЕ(Перечисление.ЭКОМ_ВидыДокументов.PRICAT_Входящий)
		|	И НЕ ЭКОМ_Документы.Документ1С = ЗНАЧЕНИЕ(Документ.УстановкаЦенНоменклатуры.ПустаяСсылка)";
		МассивУстановок = Новый Массив;
		МассивPRICAT    = Новый Массив;
		
		Для Каждого ВыбраннаяСтрока Из СписокВыбранныхСтрок Цикл
			Если ТипЗнч(ВыбраннаяСтрока.Значение) = Тип("ДокументСсылка.УстановкаЦенНоменклатуры") Тогда
				МассивУстановок.Добавить(ВыбраннаяСтрока.Значение);
			ИначеЕсли ТипЗнч(ВыбраннаяСтрока.Значение) = Тип("ДокументСсылка.ЭКОМ_Документы") Тогда
				МассивPRICAT.Добавить(ВыбраннаяСтрока.Значение);
			КонецЕсли;
		КонецЦикла;
		
		Запрос.УстановитьПараметр("МассивУстановок", МассивУстановок);
		Запрос.УстановитьПараметр("МассивPRICAT"   , МассивPRICAT);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокВыбранныхСтрок.Добавить(Выборка.Ссылка);
		КонецЦикла;
		
		Возврат;
	Иначе
		Возврат;
	КонецЕсли;
	
	ИсключитьИзПроверки = Новый Массив;
	ИсключитьИзПроверки.Добавить("ВозвратТоваровОтПокупателя");
	ИсключитьИзПроверки.Добавить("ЭКОМ_Документ_RECADV");
	ИсключитьИзПроверки.Добавить("ЭКОМ_Документ_RETINS");
	ИсключитьИзПроверки.Добавить("ВозвратТоваровПоставщику");
	ИсключитьИзПроверки.Добавить("ДокументыВсе");
	ИсключитьИзПроверки.Добавить("Ссылка");
	
	Если ТЗ.Количество() Тогда
		
		ИндексПоследнего = СписокВыбранныхСтрок.Количество() - 1;
		Для Счетчик = 0 По ИндексПоследнего Цикл
			ИндексТекущего = ИндексПоследнего - Счетчик;
			ВыбраннаяСтрока = СписокВыбранныхСтрок[ИндексТекущего];
			
			ПредставлениеВыбранного = Строка(ВыбраннаяСтрока.Значение);
			ПредставлениеВыбранного = Лев(ПредставлениеВыбранного, ЭКОМ_ОбщегоНазначения.ПоискВСтроке(ПредставлениеВыбранного, " ") - 1);
			
			Для Каждого Колонка Из ТЗ.Колонки Цикл
				Если ТипЗнч(ВыбраннаяСтрока.Значение) =  ТипЗнч(ТЗ[0][Колонка.Имя]) И ИсключитьИзПроверки.Найти(Колонка.Имя) = Неопределено Тогда
					Если ТипЗнч(ВыбраннаяСтрока.Значение) = Тип("ДокументСсылка.ЭКОМ_Документы")Тогда
						
						ПредставлениеНайденного = Строка(ТЗ[0][Колонка.Имя]);
						ПредставлениеНайденного = Лев(ПредставлениеНайденного, ЭКОМ_ОбщегоНазначения.ПоискВСтроке(ПредставлениеНайденного, " ") - 1); 
						
						ТипДокументаОтсутствуетВКолонке = ЭКОМ_ОбщегоНазначения.ПоискВСтроке(Колонка.Имя, ПредставлениеВыбранного) = 0;
						Если Не ПредставлениеВыбранного = ПредставлениеНайденного И ТипДокументаОтсутствуетВКолонке Тогда
							Продолжить;	
						КонецЕсли;
					КонецЕсли;
					КолонкаПоиска = Колонка.Имя;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			ТипЮЗД = МассивEDI.Найти(ПредставлениеВыбранного) = Неопределено;
			Если ТипЮЗД И Не ЗначениеЗаполнено(КолонкаПоиска) Тогда
				КолонкаПоиска = "ДокументЭКОМ_ЮЗД";
			КонецЕсли;
			
			Если ЗначениеЗаполнено(КолонкаПоиска) Тогда
				НайденнаяСтрока = ТЗ.Найти(ВыбраннаяСтрока.Значение, КолонкаПоиска);
				Если НайденнаяСтрока <> Неопределено Тогда
					Для Каждого Элемент Из ИменаДокументовЦепочки Цикл
						Если ТЗ.Колонки.Найти(Элемент) = Неопределено Тогда
							Продолжить;
						КонецЕсли;
						
						АктуальныйДокумент = НайденнаяСтрока[Элемент];
						Если ЗначениеЗаполнено(АктуальныйДокумент) И ИсключитьИзПроверки.Найти(Элемент) = Неопределено Тогда
							Если СписокВыбранныхСтрок.НайтиПоЗначению(АктуальныйДокумент) = Неопределено Тогда
								ВыбраннаяСтрока.Значение = АктуальныйДокумент;
							КонецЕсли;
							Прервать;
						КонецЕсли;
					КонецЦикла; 
				Иначе
					// когда выбранная строка не найдена - её больше нет в динамическом списке, 
					// поэтому требуется удаление из списка выбранных
					СписокВыбранныхСтрок.Удалить(ИндексТекущего);
				КонецЕсли; // строка найдена
			КонецЕсли; // заполненность колонки поиска
			
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВыделенныеСтроки(ВыбранныеСтроки, ИмяСписка) 
	Если ВыбранныеСтроки.Количество() И ВыбранныеСтроки[0].Свойство("ИдентификаторВыделенныхСтрок") Тогда
		ИдентификаторВМассиве = Ложь;
		Для Каждого Идентификатор Из Элементы[ИмяСписка].ВыделенныеСтроки Цикл
			Для Каждого Строка Из ВыбранныеСтроки Цикл
				Если Идентификатор = Строка.ИдентификаторВыделенныхСтрок Тогда
					ИдентификаторВМассиве = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если Не ИдентификаторВМассиве Тогда
				ВыбранныеСтроки.Добавить(Новый Структура("ИдентификаторВыделенныхСтрок", Идентификатор));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция МассивИменДокументовЦепочкиПокупателя()
	Массив = Новый Массив;
	Массив.Добавить("ДокументСЧФ");
	Массив.Добавить("ДокументЭКОМ_ЮЗД");
	Массив.Добавить("ЭКОМ_Документ_RETINS");
	Массив.Добавить("ВозвратТоваровПоставщику");
	Массив.Добавить("ДокументПоступления");
	Массив.Добавить("ЭКОМ_Документ_DESADV");
	Массив.Добавить("ЭКОМ_Документ_ORDRSP");
	Массив.Добавить("ДокументЗаказа");
	
	Возврат Массив;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МассивИменДокументовЦепочкиПоставщика()
	Массив = Новый Массив;
	Массив.Добавить("СЧФ_Кор");
	Массив.Добавить("КорректировкаРеализации");
	Массив.Добавить("ДокументСЧФ");
	Массив.Добавить("ЭКОМ_Документ_RETANN");
	Массив.Добавить("ВозвратТоваровОтПокупателя");
	Массив.Добавить("ЭКОМ_Документ_RECADV");
	Массив.Добавить("ДокументРеализации");
	Массив.Добавить("ДокументЗаказа");
	Массив.Добавить("ЭКОМ_Документ_ORDER");
	
	Возврат Массив;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МассивЭКОМДокументовЦепочкиПокупателя()
	Массив = Новый Массив;
	Массив.Добавить("ЭКОМ_Документ_RETINS");
	Массив.Добавить("ЭКОМ_Документ_DESADV");
	Массив.Добавить("ЭКОМ_Документ_ORDRSP");
	Массив.Добавить("ДокументЗаказа");
	
	Возврат Массив;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МассивТиповыхДокументовЦепочкиПокупателя()
	Массив = Новый Массив;
	Массив.Добавить("ДокументСЧФ");
	Массив.Добавить("ВозвратТоваровПоставщику");
	Массив.Добавить("ДокументПоступления");
	Массив.Добавить("ДокументЗаказа");
	
	Возврат Массив;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МассивЭКОМДокументовЦепочкиПоставщика()
	Массив = Новый Массив;
	Массив.Добавить("ЭКОМ_Документ_RETANN");
	Массив.Добавить("ЭКОМ_Документ_RECADV");
	Массив.Добавить("ЭКОМ_Документ_ORDER");
	
	Возврат Массив;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МассивТиповыхДокументовЦепочкиПоставщика()
	Массив = Новый Массив;
	Массив.Добавить("СЧФ_Кор");
	Массив.Добавить("КорректировкаРеализации");
	Массив.Добавить("ДокументСЧФ");
	Массив.Добавить("ВозвратТоваровОтПокупателя");
	Массив.Добавить("ДокументРеализации");
	Массив.Добавить("ДокументЗаказа");
	
	Возврат Массив;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СоответствиеПолейЦепочкиПокупателя()
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("ДокументСЧФ"			     , "СЧФ");
	Соответствие.Вставить("ДокументЭКОМ_ЮЗД"     	 , "ЮЗД");
	Соответствие.Вставить("ЭКОМ_Документ_RETINS"     , "RETINS");
	Соответствие.Вставить("ВозвратТоваровПоставщику" , "ВозвратнаяНакладная");
	Соответствие.Вставить("ДокументПоступления"  	 , "Накладная");
	Соответствие.Вставить("ЭКОМ_Документ_DESADV"     , "DESADV");
	Соответствие.Вставить("ЭКОМ_Документ_ORDRSP"     , "ORDRSP");
	Соответствие.Вставить("ДокументЗаказа"	         , "Заказ");
	
	Возврат Соответствие;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СоответствиеПолейЦепочкиПоставщика()
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("СЧФ_Кор"			           , "СЧФ_Кор");
	Соответствие.Вставить("КорректировкаРеализации"	   , "Накладная_Кор");
	Соответствие.Вставить("ДокументСЧФ"				   , "СЧФ");
	Соответствие.Вставить("ЭКОМ_Документ_RETANN"       , "RETANN");
	Соответствие.Вставить("ВозвратТоваровОтПокупателя" , "ВозвратнаяНакладная");
	Соответствие.Вставить("ЭКОМ_Документ_RECADV"	   , "RECADV");
	Соответствие.Вставить("ДокументРеализации"  	   , "Накладная");
	Соответствие.Вставить("ДокументЗаказа"	    	   , "Заказ");
	Соответствие.Вставить("ЭКОМ_Документ_ORDER" 	   , "ORDER");
	
	Возврат Соответствие;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьИдентификаторыЦепочек(Команда)
	ЗаписыватьЛог = Истина;
	ЭКОМ_ВзаимодействиеREST_API.ЗаполнитьИдентификаторыЦепочекСредствамиRESTv2(ЗаписыватьЛог);
	СформироватьЛогСобытий();
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция МассивПолейЦепочкиПоставщика()
	Массив = Новый Массив;
	Массив.Добавить("СЧФ_Кор");
	Массив.Добавить("КорректировкаРеализации");
	Массив.Добавить("ДокументСЧФ");
	Массив.Добавить("ЭКОМ_Документ_RETANN");
	Массив.Добавить("ВозвратТоваровОтПокупателя");
	Массив.Добавить("ЭКОМ_Документ_RECADV");
	Массив.Добавить("ДокументРеализации");
	Массив.Добавить("ДокументЗаказа");
	Массив.Добавить("ЭКОМ_Документ_ORDER");
	
	Возврат Массив;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МассивПолейЦепочкиПокупателя()
	Массив = Новый Массив;
	Массив.Добавить("ДокументСЧФ");
	Массив.Добавить("ДокументЭКОМ_ЮЗД");
	Массив.Добавить("ЭКОМ_Документ_RETINS");
	Массив.Добавить("ВозвратТоваровПоставщику");
	Массив.Добавить("ДокументПоступления");
	Массив.Добавить("ЭКОМ_Документ_DESADV");
	Массив.Добавить("ЭКОМ_Документ_ORDRSP");
	Массив.Добавить("ДокументЗаказа");
	
	Возврат Массив;
КонецФункции

&НаКлиенте
Процедура СоздатьRETORD(Команда)
	нФорма = ПолучитьФорму("Документ.ЭКОМ_Документы.Форма.УФ_ФормаДокумента");
	нФорма.Объект.ВидДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_ВидыДокументов.RETORD_Исходящий");
	нФорма.Объект.СтатусОбработкиДокумента = ПредопределенноеЗначение("Перечисление.ЭКОМ_Статусы.Обработан");
	нФорма.Открыть();
КонецПроцедуры

//Docrobot Сергей начало

&НаСервере
Процедура ЗагрузкаНоменклатурыНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаНоменклатуры(Команда)
	
	Параметр = Новый Структура("Номенклатура", "Номенклатура");
	ФормаЗагрузки = ПолучитьФорму("Обработка.ЭКОМ_Интеграция_EDI_ЮЗД.Форма.ЗагрузкаXLSX", Параметр);
	ФормаЗагрузки.Открыть();
	
	//ЗагрузкаНоменклатурыНаСервере();
КонецПроцедуры 

&НаСервере
Процедура СоздатьЗаказПоставщикуНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказПоставщику(Команда)

	Параметр = Новый Структура("ЗаказПоставщику", "ЗаказПоставщику");
    ФормаЗагрузки = ПолучитьФорму("Обработка.ЭКОМ_Интеграция_EDI_ЮЗД.Форма.ЗагрузкаXLSX", Параметр);
	ФормаЗагрузки.Открыть();
	
	//СоздатьЗаказПоставщикуНаСервере();
КонецПроцедуры

//Docrobot Сергей конец


