#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает таблицу доходов и примененных льгот налогообложения для списка сотрудников
//
Функция СведенияОДоходахПримененныхЛьготах(Сотрудники, Организация, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоНП",          НачалоГода(Дата));
	Запрос.УстановитьПараметр("КонецНП",           Дата);
	Запрос.УстановитьПараметр("Организация",       Организация);
	Запрос.УстановитьПараметр("СписокСотрудников", Сотрудники);

	Запрос.Текст = "ВЫБРАТЬ
	|	СведенияОДоходахФизическихЛиц.Период КАК МесяцНалоговогоПериода,
	|	СведенияОДоходахФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СУММА(СведенияОДоходахФизическихЛиц.СуммаДоходаОборот) КАК СуммаДохода,
	|	0 КАК ПримененнаяЛьгота
	|ПОМЕСТИТЬ ВТДоходыЛьготы
	|ИЗ
	|	РегистрНакопления.СведенияОДоходахФизическихЛиц.Обороты(
	|			&НачалоНП,
	|			&КонецНП,
	|			Месяц,
	|			Организация = &Организация
	|				И ФизическоеЛицо В (&СписокСотрудников)) КАК СведенияОДоходахФизическихЛиц
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходахФизическихЛиц.ФизическоеЛицо,
	|	МЕСЯЦ(СведенияОДоходахФизическихЛиц.ПериодРегистрации),
	|	СведенияОДоходахФизическихЛиц.Период
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СведенияОбИсчисленииНалоговВзносовОтчислений.Период,
	|	СведенияОбИсчисленииНалоговВзносовОтчислений.ФизическоеЛицо,
	|	0,
	|	СУММА(СведенияОбИсчисленииНалоговВзносовОтчислений.ПримененнаяЛьготаОборот)
	|ИЗ
	|	РегистрНакопления.СведенияОбИсчисленииНалоговВзносовОтчислений.Обороты(
	|			&НачалоНП,
	|			&КонецНП,
	|			Месяц,
	|			Организация = &Организация
	|				И ФизическоеЛицо В (&СписокСотрудников)
	|				И ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН)) КАК СведенияОбИсчисленииНалоговВзносовОтчислений
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОбИсчисленииНалоговВзносовОтчислений.ФизическоеЛицо,
	|	СведенияОбИсчисленииНалоговВзносовОтчислений.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДоходыЛьготы.МесяцНалоговогоПериода,
	|	ВТДоходыЛьготы.ФизическоеЛицо,
	|	СУММА(ВТДоходыЛьготы.СуммаДохода) КАК СуммаДохода,
	|	СУММА(ВТДоходыЛьготы.ПримененнаяЛьгота) КАК ПримененнаяЛьгота
	|ИЗ
	|	ВТДоходыЛьготы КАК ВТДоходыЛьготы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДоходыЛьготы.МесяцНалоговогоПериода,
	|	ВТДоходыЛьготы.ФизическоеЛицо";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура УчетнаяПолитикаОрганизацииПриЗаписиУчетОППВПриЗаписи(Источник, Отказ, Замещение) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УчетнаяПолитикаПоНалоговомуУчету.ПлательщикОППВ
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаПоНалоговомуУчету КАК УчетнаяПолитикаПоНалоговомуУчету
	|ГДЕ
	|	УчетнаяПолитикаПоНалоговомуУчету.ПлательщикОППВ";
	
	Результат = Запрос.Выполнить();
	
	Константы.ИспользуетсяОППВ.Установить(Не Результат.Пустой());
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОВЕДЕНИЕ И ФОРМИРОВАНИЕ ДВИЖЕНИЙ
////////////////////////////////////////////////////////////////////////////////

// Формирует движения по регистрам подсистемы.
// Параметры:
//		Движения - коллекция движений регистратора.
//		Отказ - признак отказа от заполнения движений.
//		ДанныеДокумента - Таблица значений с колонками
//			МесяцРегистрации
//			ФизическоеЛицо
//			Организация
//			ИзменитьСтандартныйВычет
//			ПредоставлятьСтандартныйВычет
//			ИзменитьЛьготу
//			ПредоставлятьЛьготу
//			КатегорияЛицаПолучателяЛьготы
//			ДействуетДо
//			ДокументПодтверждающийПравоНаЛьготу
//			ИзменитьПрочиеВычеты
//			ПрочиеВычеты: таблица значений, соответствующая по структуре регистру ПрочиеВычетыФизическихЛицИПН
//			ВидВычетаИПН
//			Размер
//			ДействуетДо
//			ДокументПодтверждающийПравоНаВычет.
//		Записывать - Булево - признак того, надо ли записывать движения сразу, или они будут записаны позже.
//
Процедура СформироватьПрименениеСтандартныхВычетов(Движения, 
	Отказ, ДанныеДокумента, Записывать = Ложь, ЗаполнятьДополнительныеДанные = Истина) Экспорт
	
	Если ДанныеДокумента = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	//Проверка схемы проведения по регистрам после 01 января 2018 года.
	Если ДанныеДокумента.Свойство("НаличиеЗаявления")
			И НЕ ДанныеДокумента.НаличиеЗаявления
			И ДанныеДокумента.МесяцРегистрации >= '2018-01-01' Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьОПримененииВычета						= Движения.ПрименениеВычетовИПН.Добавить();
	ЗаписьОПримененииВычета.Период				= ДанныеДокумента.МесяцРегистрации;
	ЗаписьОПримененииВычета.ФизическоеЛицо		= ДанныеДокумента.ФизическоеЛицо;
	ЗаписьОПримененииВычета.Организация			= ДанныеДокумента.Организация;
	Если Записывать Тогда
		Движения.ПрименениеВычетовИПН.Записать();
		Движения.ПрименениеВычетовИПН.Записывать = Ложь;
	Иначе
		Движения.ПрименениеВычетовИПН.Записывать = Истина;
	КонецЕсли;
	
	//Схема проведения по регистрам до 01 января 2018 года.
	Если ДанныеДокумента.МесяцРегистрации < '2018-01-01' Тогда
		
		Если ДанныеДокумента.ИзменитьПрочиеВычеты Тогда
			Для Каждого ПрочийВычет Из ДанныеДокумента.ПрочиеВычеты Цикл
				ЗаписьПрочийВычет								= Движения.ПрочиеВычетыФизическихЛицИПН.Добавить();
				ЗаписьПрочийВычет.Период						= ПрочийВычет.МесяцРегистрации;
				ЗаписьПрочийВычет.ДействуетС					= ПрочийВычет.ДействуетС;
				ЗаписьПрочийВычет.ФизическоеЛицо				= ПрочийВычет.ФизическоеЛицо;
				ЗаписьПрочийВычет.ВидВычета						= ПрочийВычет.ВидВычета;
				
				Если ЗаполнятьДополнительныеДанные Тогда
					ЗаписьПрочийВычет.ДействуетПо					= ПрочийВычет.ДействуетПо;
					ЗаписьПрочийВычет.Размер						= ПрочийВычет.Размер;
					ЗаписьПрочийВычет.Основание						= ПрочийВычет.ДокументПодтверждающийПравоНаВычет;
				КонецЕсли;
			КонецЦикла;
			
			Если Записывать Тогда
				Движения.ПрочиеВычетыФизическихЛицИПН.Записать();
				Движения.ПрочиеВычетыФизическихЛицИПН.Записывать = Ложь;
			Иначе
				Движения.ПрочиеВычетыФизическихЛицИПН.Записывать = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеДокумента.ИзменитьСтандартныйВычет Тогда
			ЗаписьОСтандартномВычете					= Движения.ВычетыФизическихЛицИПН.Добавить();
			ЗаписьОСтандартномВычете.Период				= ДанныеДокумента.МесяцРегистрации;
			ЗаписьОСтандартномВычете.ФизическоеЛицо		= ДанныеДокумента.ФизическоеЛицо;
			Если ЗаполнятьДополнительныеДанные Тогда
				ЗаписьОСтандартномВычете.ПредоставлятьВычет	= ДанныеДокумента.ПредоставлятьСтандартныйВычет;
			КонецЕсли;
			Если Записывать Тогда
				Движения.ВычетыФизическихЛицИПН.Записать();
				Движения.ВычетыФизическихЛицИПН.Записывать = Ложь;
			Иначе
				Движения.ВычетыФизическихЛицИПН.Записывать = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеДокумента.ИзменитьЛьготу Тогда
			ЗаписьОЛьготе								= Движения.ЛьготыФизическихЛицИПН.Добавить();
			ЗаписьОЛьготе.Период						= ДанныеДокумента.МесяцРегистрации;
			ЗаписьОЛьготе.ФизическоеЛицо				= ДанныеДокумента.ФизическоеЛицо;
			
			Если ЗаполнятьДополнительныеДанные Тогда
				ЗаписьОЛьготе.ПредоставлятьЛьготу			= ДанныеДокумента.ПредоставлятьЛьготу;
				ЗаписьОЛьготе.ДействуетДо					= ДанныеДокумента.ДействуетДо;
				ЗаписьОЛьготе.КатегорияЛицаПолучателяЛьготы	= ДанныеДокумента.КатегорияЛицаПолучателяЛьготы;
				ЗаписьОЛьготе.Основание						= ДанныеДокумента.ДокументПодтверждающийПравоНаЛьготу;
			КонецЕсли;
			Если Записывать Тогда
				Движения.ЛьготыФизическихЛицИПН.Записать();
				Движения.ЛьготыФизическихЛицИПН.Записывать = Ложь;
			Иначе
				Движения.ЛьготыФизическихЛицИПН.Записывать = Истина;
			КонецЕсли;
		КонецЕсли;
		
	//Схема проведения по регистрам после 01 января 2018 года.
	Иначе
		
		Для Каждого Вычет Из ДанныеДокумента.Вычеты Цикл
			ЗаписьВычет								= Движения.ВычетыФизическихЛицИПН.Добавить();
			ЗаписьВычет.Период						= Вычет.МесяцРегистрации;
			ЗаписьВычет.ФизическоеЛицо				= Вычет.ФизическоеЛицо;
			ЗаписьВычет.ВидВычета					= Вычет.ВидВычета;
			ЗаписьВычет.ПредоставлятьВычет			= Вычет.ПредоставлятьВычет;
			
			Если ЗаполнятьДополнительныеДанные Тогда
				ЗаписьВычет.ДействуетПо				= Вычет.ДействуетПо;
			КонецЕсли;
		КонецЦикла;
		
		Если Записывать Тогда
			Движения.ВычетыФизическихЛицИПН.Записать();
			Движения.ВычетыФизическихЛицИПН.Записывать = Ложь;
		Иначе
			Движения.ВычетыФизическихЛицИПН.Записывать = Истина;
		КонецЕсли;
		
		Для Каждого ПрочийВычет Из ДанныеДокумента.ПрочиеВычеты Цикл
			ЗаписьПрочийВычет								= Движения.ПрочиеВычетыФизическихЛицИПН.Добавить();
			ЗаписьПрочийВычет.Период						= ДанныеДокумента.МесяцРегистрации;
			ЗаписьПрочийВычет.ФизическоеЛицо				= ПрочийВычет.ФизическоеЛицо;
			ЗаписьПрочийВычет.ВидВычета						= ПрочийВычет.ВидВычета;
			ЗаписьПрочийВычет.ДействуетС					= ПрочийВычет.ДействуетС;
			ЗаписьПрочийВычет.Размер						= ПрочийВычет.Размер;
			
			Если ЗаполнятьДополнительныеДанные Тогда
				ЗаписьПрочийВычет.ДействуетПо					= ПрочийВычет.ДействуетПо;
				ЗаписьПрочийВычет.Основание						= ПрочийВычет.ДокументПодтверждающийПравоНаВычет;
			КонецЕсли;
		КонецЦикла;
		
		Если Записывать Тогда
			Движения.ПрочиеВычетыФизическихЛицИПН.Записать();
			Движения.ПрочиеВычетыФизическихЛицИПН.Записывать = Ложь;
		Иначе
			Движения.ПрочиеВычетыФизическихЛицИПН.Записывать = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует движения по налогам, взносам и отчислениям.
//
// Параметры:
//		Регистратор - ДокументСсылка -
//		Движения - коллекция движений регистратора.
//		Отказ - булево - признак отказа от заполнения движений.
//		Организация - СправочникСсылка.Организации -
//		ПериодРегистрации - реквизиты регистратора.
//		ПорядокВыплаты - ПеречислениеСсылка.ХарактерВыплатыЗарплаты - Межрасчет / Зарплата / Аванс
//		ДанныеДляПроведения - структура - структура данных, используемая при проведении документов
//				обязательные поля
//					МенеджерВременныхТаблиц с вр.таблицами ВТНачисления, ВТФизическиеЛица.
//					НалогиВзносыОтчисления - таблица значений с данными об исчисленных налогах, взносах и отчислениях.
//					УдержанияПоСотрудникам - таблица значений с данными о суммах удержаний.
//		Записывать - булево - признак того, надо ли записывать движения сразу, или они будут записаны позже.
//		РегистрироватьСуммыНалоговВзносов - булево - признак того, надо ли писать движения по исчисленным налогам,
//					если не указан будет определяться по значению параметра ПорядокВыплаты: истине соответствует Межрасчет.
//
Процедура ЗарегистрироватьДоходыИСуммыНалоговВзносовОтчисленийПоВременнойТаблицеНачислений(Движения, Отказ, Организация, ПериодРегистрации, ПорядокВыплаты, ДанныеДляПроведения, Записывать = Ложь, РегистрироватьСуммыНалоговВзносов = Неопределено, ЕстьРеквизитИсправленныйДокумент = Ложь, ЕстьРеквизитМесяцНачисления = Ложь) Экспорт 
	
	Если РегистрироватьСуммыНалоговВзносов = Неопределено Тогда 
		РегистрироватьСуммыНалоговВзносов = РасчетЗарплатыРасширенный.ЭтоМежрасчетнаяВыплата(ПорядокВыплаты);
	КонецЕсли;
	
	// регистрация доходов
	СформироватьСведенияОДоходахПоНачислениям(Движения, Отказ, Организация, ДанныеДляПроведения.МенеджерВременныхТаблиц, ПериодРегистрации, Записывать, Не РегистрироватьСуммыНалоговВзносов,, ЕстьРеквизитИсправленныйДокумент, ЕстьРеквизитМесяцНачисления);
	
	Если РегистрироватьСуммыНалоговВзносов Тогда
		
		// Сведения о необлагаемых доходах физических лиц
		СформироватьСведенияОНеоблагаемыхДоходахПоНачислениям(ДанныеДляПроведения, Движения, Отказ, Организация, Записывать, Не РегистрироватьСуммыНалоговВзносов);
		
		// Сведения об исчислении налогов взносов отчислений
		СформироватьСведенияОбИсчисленииНалоговВзносовОтчислений(ДанныеДляПроведения, Движения, Отказ, Организация, ПериодРегистрации, Не РегистрироватьСуммыНалоговВзносов);
		
		// Сведения об исчислении вычетов ИПН
		СформироватьСведенияОбИсчисленииВычетовИПН(ДанныеДляПроведения, Движения, Отказ, Организация, ПериодРегистрации, Не РегистрироватьСуммыНалоговВзносов);
		
		// Учет исчисленных налогов, взносов, отчислений
		СформироватьНалогиВзносыОтчисленияРасчетыСБюджетом(ДанныеДляПроведения, Движения, Отказ, Организация, ПериодРегистрации);
		
		СформироватьНалогиВзносыРасчетыНалогоплательщиков(ДанныеДляПроведения, Движения, Отказ, Организация, ПериодРегистрации);
		
		ЗарегистрироватьНалогиВзносыОтчисления(Движения, Отказ, Организация, ПериодРегистрации, ДанныеДляПроведения.НалогиВзносыОтчисления, ДанныеДляПроведения.МенеджерВременныхТаблиц, ПорядокВыплаты);

	КонецЕсли;
	
КонецПроцедуры

// Формирует движения по регистрам подсистемы.
// Параметры:
//		Движения - коллекция движений регистратора.
//		Отказ - булево - признак отказа от заполнения движений.
//		Организация
//		МесяцНачисления - дата - период, в котором зарегистрированы начисления.
//		СведенияОДоходах - Таблица значений с колонками
//			ФизическоеЛицо, с непустым значением
//			Сотрудник
//         	МесяцНалоговогоПериода, с непустым значением
//			Подразделение, тип СправочникСсылка.ПодразделенияОрганизаций
//			Начисление, с непустым значением
//			СуммаДохода
//		Записывать - булево - признак того, надо ли записывать движения сразу, или они будут записаны позже.
//
Процедура СформироватьСведенияОДоходах(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты = Истина, НаборыЗаписей = Неопределено) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	// Метаданные документа используем для обращения к таблице.
	МетаданныеДокумента = Метаданные.НайтиПоТипу(ТипЗнч(ДокументСсылка));

	// Для формирования доходов создаем коллекцию наборов записей.
	Если НаборыЗаписей = Неопределено Тогда 
		НаборыЗаписей = ЗарплатаКадры.НаборыЗаписейРегистратора(МетаданныеДокумента);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ВТСуществует(МенеджерВременныхТаблиц,"ВТНачисления") Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Начисления.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(Начисления.СуммаДохода) КАК СуммаДохода,
		|	Начисления.Подразделение,
		|	Начисления.Сотрудник,
		|	Начисления.Начисление,
		|	Начисления.ИсправленныйДокумент
		|ПОМЕСТИТЬ ВТНачисленияСведенияОДоходах
		|ИЗ
		|	ВТНачисления КАК Начисления
		|ГДЕ
		|	Начисления.СуммаДохода <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.Сотрудник.ФизическоеЛицо,
		|	Начисления.Подразделение,
		|	Начисления.Сотрудник,
		|	Начисления.Начисление,
		|	Начисления.ИсправленныйДокумент";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		СформироватьСведенияОДоходахПоНачислениям(
			НаборыЗаписей, Ложь, Организация, МенеджерВременныхТаблиц, МесяцНачисления, Ложь, ОкончательныйРасчетЗарплаты, "ВТНачисленияСведенияОДоходах", МетаданныеДокумента.Реквизиты.Найти("ИсправленныйДокумент") <> Неопределено, МетаданныеДокумента.Реквизиты.Найти("МесяцНачисления") <> Неопределено);
			
		УничтожитьВТ.Добавить("ВТНачисленияСведенияОДоходах");
	КонецЕсли;
	
	// Формируем доходы по начислениям по договорам.
	Если ВТСуществует(МенеджерВременныхТаблиц,"ВТНачисленияПоДоговорам") Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	НачисленияПоДоговорам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(НачисленияПоДоговорам.Сумма) КАК СуммаДохода,
		|	НачисленияПоДоговорам.Подразделение,
		|	НачисленияПоДоговорам.Сотрудник,
		|	НачисленияПоДоговорам.ВидДохода КАК Начисление
		|ПОМЕСТИТЬ ВТНачисленияПоДоговорамСведенияОДоходах
		|ИЗ
		|	ВТНачисленияПоДоговорам КАК НачисленияПоДоговорам
		|ГДЕ
		|	НачисленияПоДоговорам.Сумма <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияПоДоговорам.ФизическоеЛицо,
		|	НачисленияПоДоговорам.Подразделение,
		|	НачисленияПоДоговорам.Сотрудник,
		|	НачисленияПоДоговорам.ВидДохода
		|";
	
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
		СформироватьСведенияОДоходахПоНачислениям(
			НаборыЗаписей, Ложь, Организация, МенеджерВременныхТаблиц, МесяцНачисления, Ложь, ОкончательныйРасчетЗарплаты, "ВТНачисленияПоДоговорамСведенияОДоходах");
			
		УничтожитьВТ.Добавить("ВТНачисленияПоДоговорамСведенияОДоходах");
	КонецЕсли;
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
КонецПроцедуры

Процедура СформироватьСведенияОДоходахПоНачислениям(Движения, Отказ, Организация, МенеджерВременныхТаблиц, МесяцНачисления, Записывать = Ложь, ОкончательныйРасчет = Истина, ИмяВТНачисления = "ВТНачисления", ЕстьРеквизитИсправленныйДокумент = Ложь, ЕстьРеквизитМесяцНачисления = Ложь, ЕстьРеквизитФизическоеЛицо = Ложь) Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Начисления.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(Начисления.СуммаДохода) КАК СуммаДохода,
		|	Начисления.Подразделение КАК Подразделение,
		|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	Начисления.Сотрудник,
		|	Начисления.Начисление,
		|	&МесяцНачисления КАК ПериодРегистрации,
		|	&МесяцНалоговогоПериода КАК МесяцНалоговогоПериода
		|ИЗ
		|	#ИмяВТНачисления КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(
		|				&КонецМесяцаНачисления,
		|				СтруктурнаяЕдиница В
		|					(ВЫБРАТЬ
		|						Начисления.Подразделение
		|					ИЗ
		|						#ИмяВТНачисления КАК Начисления)) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
		|		ПО Начисления.Подразделение = ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница
		|ГДЕ
		|	Начисления.СуммаДохода <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.Подразделение,
		|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане,
		|	Начисления.Сотрудник,
		|	Начисления.Начисление,
		|	Начисления.Сотрудник.ФизическоеЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо";
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ИмяВТНачисления", ИмяВТНачисления);		
	Если ЕстьРеквизитФизическоеЛицо Тогда 
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Начисления.Сотрудник.ФизическоеЛицо", "Начисления.ФизическоеЛицо");
	КонецЕсли;
	
	Если ЕстьРеквизитИсправленныйДокумент Тогда
		// При внесении исправлений корректировки относим на месяц налогового периода по документу-исправлению
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&МесяцНалоговогоПериода КАК", 
			"ВЫБОР
			|		КОГДА НЕ Начисления.ИсправленныйДокумент.ПериодРегистрации ЕСТЬ NULL
			|			ТОГДА Начисления.ИсправленныйДокумент.ПериодРегистрации
			|		ИНАЧЕ &МесяцНалоговогоПериода
			|	КОНЕЦ КАК");
			
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "УПОРЯДОЧИТЬ ПО", ",
			|ВЫБОР
			|		КОГДА НЕ Начисления.ИсправленныйДокумент.ПериодРегистрации ЕСТЬ NULL
			|			ТОГДА Начисления.ИсправленныйДокумент.ПериодРегистрации
			|		ИНАЧЕ &МесяцНалоговогоПериода
			|	КОНЕЦ
			|
			|УПОРЯДОЧИТЬ ПО");
			
		Если ЕстьРеквизитМесяцНачисления Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".ПериодРегистрации", ".МесяцНачисления");
		КонецЕсли;
		
	КонецЕсли;

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МесяцНачисления", НачалоМесяца(МесяцНачисления));
	Запрос.УстановитьПараметр("МесяцНалоговогоПериода", НачалоМесяца(МесяцНачисления));
	Запрос.УстановитьПараметр("КонецМесяцаНачисления", КонецМесяца(МесяцНачисления));
	
	РегистрацияОрганизации = ?(ЗначениеЗаполнено(Организация),ЗарплатаКадры.РегистрацияВНалоговомОргане(Организация, КонецМесяца(МесяцНачисления)),Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СтрокаСведенийОДоходах(Движения.СведенияОДоходахФизическихЛиц, Организация, МесяцНачисления, Выборка, ОкончательныйРасчет);
		ПроставитьРегистрациюВНалоговомОрганеВСтроке(НоваяСтрока, Выборка.РегистрацияВНалоговомОргане, РегистрацияОрганизации);
	КонецЦикла;
	
	Если Записывать Тогда
		// Записываем сразу и не выставляем признак Записывать этому набору записей движений документа.
		УстановитьПривилегированныйРежим(Истина);
		Движения.СведенияОДоходахФизическихЛиц.Записать();
		Движения.СведенияОДоходахФизическихЛиц.Записывать = Ложь;
	Иначе
		Движения.СведенияОДоходахФизическихЛиц.Записывать = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура СформироватьСведенияОНеоблагаемыхДоходахПоНачислениям(ДанныеДляПроведения, Движения, Отказ, Организация, Записывать = Ложь, ОкончательныйРасчет = Истина) Экспорт
	
	Для Каждого СтрокаНеоблагаемыхДоходов Из ДанныеДляПроведения.ДоходыНеПодлежащиеНалогообложению Цикл
		НоваяСтрока =  Движения.СведенияОНеоблагаемыхДоходахФизическихЛиц.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНеоблагаемыхДоходов);
		НоваяСтрока.ДанныеМежрасчетногоПериода = Не ОкончательныйРасчет;		
	КонецЦикла;
	
	Если Записывать Тогда
		УстановитьПривилегированныйРежим(Истина);
		Движения.СведенияОНеоблагаемыхДоходахФизическихЛиц.Записать();
		Движения.СведенияОНеоблагаемыхДоходахФизическихЛиц.Записывать = Ложь;
	Иначе
		Движения.СведенияОНеоблагаемыхДоходахФизическихЛиц.Записывать = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеДляПроведенияПоНалогамВзносамОтчислениям(ДанныеДляПроведения, ДокументСсылка, ИмяПоляМесяц = "Ссылка.МесяцНачисления") Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	НалогиВзносыОтчисления.Ссылка КАК ДокументСсылка,
		|	НалогиВзносыОтчисления.НомерСтроки КАК НомерСтроки,
		|	НалогиВзносыОтчисления.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НалогиВзносыОтчисления.Подразделение КАК Подразделение,
		|	НалогиВзносыОтчисления.ВидДохода КАК ВидДохода,
		|	НалогиВзносыОтчисления.Ссылка.Организация КАК Организация,
		|	НалогиВзносыОтчисления.Ссылка.МесяцНачисления КАК ПериодРегистрации,
		|	НалогиВзносыОтчисления.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
		|	СУММА(НалогиВзносыОтчисления.НалогВзнос) КАК НалогВзнос,
		|	СУММА(НалогиВзносыОтчисления.ОбъектИсчисления) КАК ОбъектИсчисления,
		|	СУММА(НалогиВзносыОтчисления.РазрешенныйВычет) КАК РазрешенныйВычет,
		|	СУММА(НалогиВзносыОтчисления.ПримененныйВычет) КАК ПримененныйВычет,
		|	СУММА(НалогиВзносыОтчисления.ПримененнаяЛьгота) КАК ПримененнаяЛьгота,
		|	СУММА(НалогиВзносыОтчисления.ПрочиеВычеты) КАК ПрочиеВычеты,
		|	СУММА(НалогиВзносыОтчисления.ОблагаемыйДоход) КАК ОблагаемыйДоход,
		|	СУММА(НалогиВзносыОтчисления.НеоблагаемыйДоход) КАК НеоблагаемыйДоход
		|ПОМЕСТИТЬ ВТНалогиВзносыОтчисления
		|ИЗ
		|	#НалогиВзносыОтчисления КАК НалогиВзносыОтчисления
		|ГДЕ
		|	НалогиВзносыОтчисления.Ссылка = &ДокументСсылка
		|
		|СГРУППИРОВАТЬ ПО
		|	НалогиВзносыОтчисления.Ссылка,
		|	НалогиВзносыОтчисления.НомерСтроки,
		|	НалогиВзносыОтчисления.ФизическоеЛицо,
		|	НалогиВзносыОтчисления.Подразделение,
		|	НалогиВзносыОтчисления.ВидДохода,
		|	НалогиВзносыОтчисления.Ссылка.МесяцНачисления,
		|	НалогиВзносыОтчисления.Ссылка.Организация,
		|	НалогиВзносыОтчисления.МесяцНалоговогоПериода,
		|	НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогиВзносыОтчисления.ДокументСсылка КАК ДокументСсылка,
		|	НалогиВзносыОтчисления.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НалогиВзносыОтчисления.Организация КАК Организация,
		|	НалогиВзносыОтчисления.Подразделение КАК Подразделение,
		|	НалогиВзносыОтчисления.ВидДохода КАК ВидДохода,
		|	НалогиВзносыОтчисления.ПериодРегистрации КАК ПериодРегистрации,
		|	НалогиВзносыОтчисления.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
		|	НалогиВзносыОтчисления.НалогВзнос КАК Сумма
		|ИЗ
		|	ВТНалогиВзносыОтчисления КАК НалогиВзносыОтчисления
		|ГДЕ
		|	(НалогиВзносыОтчисления.НалогВзнос <> 0
		|			ИЛИ НалогиВзносыОтчисления.ОбъектИсчисления <> 0
		|			ИЛИ НалогиВзносыОтчисления.РазрешенныйВычет <> 0
		|			ИЛИ НалогиВзносыОтчисления.ПримененныйВычет <> 0
		|			ИЛИ НалогиВзносыОтчисления.ПримененнаяЛьгота <> 0
		|			ИЛИ НалогиВзносыОтчисления.ПрочиеВычеты <> 0
		|			ИЛИ НалогиВзносыОтчисления.ОблагаемыйДоход <> 0
		|			ИЛИ НалогиВзносыОтчисления.НеоблагаемыйДоход <> 0)";
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Ссылка.МесяцНачисления", ИмяПоляМесяц);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#НалогиВзносыОтчисления", ДокументСсылка.Метаданные().ПолноеИмя() + ".НалогиВзносыОтчисления");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ДанныеДляПроведения.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	ДанныеДляПроведения.НалогиВзносыОтчисления = Запрос.Выполнить().Выгрузить();
		
КонецПроцедуры

Процедура ЗаполнитьДанныеДляПроведенияПоДоходамНеПодлежащимНалогообложению(ДанныеДляПроведения, ДокументСсылка, ИмяПоляМесяц = "Ссылка.МесяцНачисления") Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДоходыНеПодлежащиеНалогообложению.Ссылка.Организация КАК Организация,
		|	ДоходыНеПодлежащиеНалогообложению.Подразделение,
		|	ДоходыНеПодлежащиеНалогообложению.ФизическоеЛицо,
		|	ДоходыНеПодлежащиеНалогообложению.МесяцНалоговогоПериода,
		|	ДоходыНеПодлежащиеНалогообложению.Ссылка.МесяцНачисления КАК ПериодРегистрации,
		|	ДоходыНеПодлежащиеНалогообложению.ДоходНеПодлежащийНалогообложению,
		|	ДоходыНеПодлежащиеНалогообложению.ВидНалогаВзносаОтчисления,
		|	ДоходыНеПодлежащиеНалогообложению.Начисление,
		|	СУММА(ДоходыНеПодлежащиеНалогообложению.СуммаДохода) КАК СуммаДохода,
		|	СУММА(ДоходыНеПодлежащиеНалогообложению.НеоблагаемыйДоход) КАК НеоблагаемыйДоход
		|ПОМЕСТИТЬ ВТДоходыНеПодлежащиеНалогообложению
		|ИЗ
		|	#ДоходыНеПодлежащиеНалогообложению КАК ДоходыНеПодлежащиеНалогообложению
		|ГДЕ
		|	ДоходыНеПодлежащиеНалогообложению.Ссылка = &ДокументСсылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоходыНеПодлежащиеНалогообложению.Ссылка.Организация,
		|	ДоходыНеПодлежащиеНалогообложению.Подразделение,
		|	ДоходыНеПодлежащиеНалогообложению.ФизическоеЛицо,
		|	ДоходыНеПодлежащиеНалогообложению.МесяцНалоговогоПериода,
		|	ДоходыНеПодлежащиеНалогообложению.Ссылка.МесяцНачисления,
		|	ДоходыНеПодлежащиеНалогообложению.ДоходНеПодлежащийНалогообложению,
		|	ДоходыНеПодлежащиеНалогообложению.ВидНалогаВзносаОтчисления,
		|	ДоходыНеПодлежащиеНалогообложению.Начисление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыНеПодлежащиеНалогообложению.Организация,
		|	ДоходыНеПодлежащиеНалогообложению.Подразделение,
		|	ДоходыНеПодлежащиеНалогообложению.ФизическоеЛицо,
		|	ДоходыНеПодлежащиеНалогообложению.МесяцНалоговогоПериода КАК Период,
		|	ДоходыНеПодлежащиеНалогообложению.ПериодРегистрации,
		|	ДоходыНеПодлежащиеНалогообложению.ДоходНеПодлежащийНалогообложению,
		|	ДоходыНеПодлежащиеНалогообложению.ВидНалогаВзносаОтчисления,
		|	ДоходыНеПодлежащиеНалогообложению.Начисление,
		|	ДоходыНеПодлежащиеНалогообложению.СуммаДохода,
		|	ДоходыНеПодлежащиеНалогообложению.НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыНеПодлежащиеНалогообложению КАК ДоходыНеПодлежащиеНалогообложению
		|ГДЕ
		|	ДоходыНеПодлежащиеНалогообложению.СуммаДохода <> 0
		|	ИЛИ ДоходыНеПодлежащиеНалогообложению.НеоблагаемыйДоход <> 0";
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Ссылка.МесяцНачисления", ИмяПоляМесяц);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ДоходыНеПодлежащиеНалогообложению", ДокументСсылка.Метаданные().ПолноеИмя() + ".ДоходыНеПодлежащиеНалогообложению");
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ДанныеДляПроведения.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	ДанныеДляПроведения.ДоходыНеПодлежащиеНалогообложению = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

Процедура СформироватьСведенияОбИсчисленииНалоговВзносовОтчислений(ДанныеДляПроведения, Движения, Отказ, Организация, МесяцНачисления, ОкончательныйРасчет = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДанныеДляПроведения.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КонецМесяцаНачисления", КонецМесяца(МесяцНачисления));
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НалогиВзносыОтчисления.ФизическоеЛицо,
		|	НалогиВзносыОтчисления.Подразделение,
		|	НалогиВзносыОтчисления.ВидДохода,
		|	НалогиВзносыОтчисления.ПериодРегистрации,
		|	НалогиВзносыОтчисления.МесяцНалоговогоПериода КАК Период,
		|	НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления,
		|	НалогиВзносыОтчисления.ОблагаемыйДоход,
		|	НалогиВзносыОтчисления.НеоблагаемыйДоход,
		|	НалогиВзносыОтчисления.НалогВзнос,
		|	НалогиВзносыОтчисления.ОбъектИсчисления,
		|	НалогиВзносыОтчисления.РазрешенныйВычет,
		|	НалогиВзносыОтчисления.ПримененныйВычет,
		|	НалогиВзносыОтчисления.ПримененнаяЛьгота,
		|	НалогиВзносыОтчисления.ПрочиеВычеты,
		|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане
		|ИЗ
		|	ВТНалогиВзносыОтчисления КАК НалогиВзносыОтчисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(
		|				&КонецМесяцаНачисления,
		|				СтруктурнаяЕдиница В
		|					(ВЫБРАТЬ
		|						НалогиВзносыОтчисления.Подразделение
		|					ИЗ
		|						ВТНалогиВзносыОтчисления КАК НалогиВзносыОтчисления)) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
		|		ПО НалогиВзносыОтчисления.Подразделение = ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница
		|ГДЕ
		|	(НалогиВзносыОтчисления.ОблагаемыйДоход <> 0
		|			ИЛИ НалогиВзносыОтчисления.НеоблагаемыйДоход <> 0
		|			ИЛИ НалогиВзносыОтчисления.НалогВзнос <> 0
		|			ИЛИ НалогиВзносыОтчисления.ОбъектИсчисления <> 0
		|			ИЛИ НалогиВзносыОтчисления.РазрешенныйВычет <> 0
		|			ИЛИ НалогиВзносыОтчисления.ПримененныйВычет <> 0
		|			ИЛИ НалогиВзносыОтчисления.ПримененнаяЛьгота <> 0
		|			ИЛИ НалогиВзносыОтчисления.ПрочиеВычеты <> 0)";
		
	Выборка = Запрос.Выполнить().Выбрать();

	РегистрацияОрганизации = ЗарплатаКадры.РегистрацияВНалоговомОргане(Организация, КонецМесяца(МесяцНачисления));
	
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = Движения.СведенияОбИсчисленииНалоговВзносовОтчислений.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		НоваяЗапись.Организация = Организация;
		НоваяЗапись.ДанныеМежрасчетногоПериода = НЕ ОкончательныйРасчет;
		ПроставитьРегистрациюВНалоговомОрганеВСтроке(НоваяЗапись, Выборка.РегистрацияВНалоговомОргане, РегистрацияОрганизации);
	КонецЦикла;
	
	Движения.СведенияОбИсчисленииНалоговВзносовОтчислений.Записывать = Истина;

КонецПроцедуры

Процедура СформироватьНалогиВзносыОтчисленияРасчетыСБюджетом(ДанныеДляПроведения, Движения, Отказ, Организация, МесяцНачисления, ВидПлатежа = Неопределено, ПолучитьРегистрациюВНалоговомОргане = Истина, Записывать = Ложь, РасчетПени = Ложь) Экспорт
	
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(МесяцНачисления, Новый Структура("Организация", Организация));
	ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу = Ложь;
	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу = УчетнаяПолитикаНУ[0].ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДанныеДляПроведения.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КонецМесяцаНачисления", КонецМесяца(МесяцНачисления));
	Запрос.УстановитьПараметр("ИсключитьНалогиВзносы", ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу);
	Запрос.УстановитьПараметр("РасчетПени", РасчетПени);
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН)
		|				ИЛИ НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СН)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|		ИНАЧЕ НалогиВзносыОтчисления.ФизическоеЛицо
		|	КОНЕЦ КАК ФизическоеЛицо,
		|	НалогиВзносыОтчисления.ПериодРегистрации КАК Период,
		|	НалогиВзносыОтчисления.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
		|	СУММА(НалогиВзносыОтчисления.НалогВзнос) КАК НалогВзнос,
		|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
		|ИЗ
		|	ВТНалогиВзносыОтчисления КАК НалогиВзносыОтчисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(
		|				&КонецМесяцаНачисления,
		|				СтруктурнаяЕдиница В
		|					(ВЫБРАТЬ
		|						НалогиВзносыОтчисления.Подразделение
		|					ИЗ
		|						ВТНалогиВзносыОтчисления КАК НалогиВзносыОтчисления)) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
		|		ПО НалогиВзносыОтчисления.Подразделение = ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница
		|ГДЕ
		|	НалогиВзносыОтчисления.НалогВзнос <> 0
		|	И ВЫБОР
		|			КОГДА &ИсключитьНалогиВзносы
		|					И НЕ &РасчетПени
		|				ТОГДА НЕ НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления В (ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН),
		|																			 ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОПВ),
		|																			 ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС))
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН)
		|				ИЛИ НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СН)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|		ИНАЧЕ НалогиВзносыОтчисления.ФизическоеЛицо
		|	КОНЕЦ,
		|	НалогиВзносыОтчисления.ПериодРегистрации,
		|	НалогиВзносыОтчисления.МесяцНалоговогоПериода,
		|	НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления,
		|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане";

		
	Если НЕ ПолучитьРегистрациюВНалоговомОргане Тогда
			
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане", "НалогиВзносыОтчисления.РегистрацияВНалоговомОргане");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(
												|				&КонецМесяцаНачисления,
												|				СтруктурнаяЕдиница В
												|					(ВЫБРАТЬ
												|						НалогиВзносыОтчисления.Подразделение
												|					ИЗ
												|						ВТНалогиВзносыОтчисления КАК НалогиВзносыОтчисления)) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
												|		ПО НалогиВзносыОтчисления.Подразделение = ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница", "");
			
			
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	РегистрацияОрганизации = ЗарплатаКадры.РегистрацияВНалоговомОргане(Организация, КонецМесяца(МесяцНачисления));
	
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = Движения.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяЗапись.Организация = Организация;
		НоваяЗапись.Период = Выборка.Период;
		НоваяЗапись.ВидПлатежа = ?(ЗначениеЗаполнено(ВидПлатежа), ВидПлатежа, Перечисления.ВидыПлатежейВГосБюджет.Налог);
		ПроставитьРегистрациюВНалоговомОрганеВСтроке(НоваяЗапись, Выборка.РегистрацияВНалоговомОргане, РегистрацияОрганизации);
	КонецЦикла;
	
	Если Записывать Тогда
		Движения.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Записать();
		Движения.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Записывать = Ложь;
	Иначе
		Движения.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Записывать = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьНалогиВзносыРасчетыНалогоплательщиков(ДанныеДляПроведения, Движения, Отказ, Организация, МесяцНачисления, ВидПлатежа = Неопределено, ПолучитьРегистрациюВНалоговомОргане = Истина, Записывать = Ложь) Экспорт
	
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(МесяцНачисления, Новый Структура("Организация", Организация));
	ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу = Ложь;
	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу = УчетнаяПолитикаНУ[0].ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДанныеДляПроведения.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КонецМесяцаНачисления", КонецМесяца(МесяцНачисления));
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	НалогиВзносыОтчисления.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НалогиВзносыОтчисления.ПериодРегистрации КАК Период,
		|	НалогиВзносыОтчисления.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
		|	НалогиВзносыОтчисления.ВидДохода КАК ВидДохода,
		|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	СУММА(НалогиВзносыОтчисления.НалогВзнос) КАК НалогВзнос
		|ИЗ
		|	ВТНалогиВзносыОтчисления КАК НалогиВзносыОтчисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(
		|				&КонецМесяцаНачисления,
		|				СтруктурнаяЕдиница В
		|					(ВЫБРАТЬ
		|						НалогиВзносыОтчисления.Подразделение
		|					ИЗ
		|						ВТНалогиВзносыОтчисления КАК НалогиВзносыОтчисления)) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
		|		ПО НалогиВзносыОтчисления.Подразделение = ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница
		|ГДЕ
		|	НалогиВзносыОтчисления.НалогВзнос <> 0
		|	И (НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН)
		|		ИЛИ НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОПВ)
		|		ИЛИ НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС))
		|
		|СГРУППИРОВАТЬ ПО
		|	НалогиВзносыОтчисления.ФизическоеЛицо,
		|	НалогиВзносыОтчисления.ПериодРегистрации,
		|	НалогиВзносыОтчисления.МесяцНалоговогоПериода,
		|	НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления,
		|	НалогиВзносыОтчисления.ВидДохода,
		|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане";

		
	Если НЕ ПолучитьРегистрациюВНалоговомОргане Тогда
			
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане", "НалогиВзносыОтчисления.РегистрацияВНалоговомОргане");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(
												|				&КонецМесяцаНачисления,
												|				СтруктурнаяЕдиница В
												|					(ВЫБРАТЬ
												|						НалогиВзносыОтчисления.Подразделение
												|					ИЗ
												|						ВТНалогиВзносыОтчисления КАК НалогиВзносыОтчисления)) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
												|		ПО НалогиВзносыОтчисления.Подразделение = ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница", "");
			
			
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	РегистрацияОрганизации = ЗарплатаКадры.РегистрацияВНалоговомОргане(Организация, КонецМесяца(МесяцНачисления));
	
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = Движения.НалогиВзносыРасчетыНалогоплательщиков.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяЗапись.Организация = Организация;
		ПроставитьРегистрациюВНалоговомОрганеВСтроке(НоваяЗапись, Выборка.РегистрацияВНалоговомОргане, РегистрацияОрганизации);
	КонецЦикла;
	
	Если НЕ ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу Тогда 
		
		Выборка.Сбросить();
		Пока Выборка.Следующий() Цикл
			НоваяЗапись = Движения.НалогиВзносыРасчетыНалогоплательщиков.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяЗапись.Период = Выборка.Период;
			НоваяЗапись.Организация = Организация;
			ПроставитьРегистрациюВНалоговомОрганеВСтроке(НоваяЗапись, Выборка.РегистрацияВНалоговомОргане, РегистрацияОрганизации);
		КонецЦикла;
		
	КонецЕсли;
	
	Если Записывать Тогда
		Движения.НалогиВзносыРасчетыНалогоплательщиков.Записать();
		Движения.НалогиВзносыРасчетыНалогоплательщиков.Записывать = Ложь;
	Иначе
		Движения.НалогиВзносыРасчетыНалогоплательщиков.Записывать = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьУдержаниеНалогиВзносыПоВременнойТаблице(Движения, Отказ, Организация, ПериодРегистрации, МенеджерВременныхТаблиц, Записывать = Ложь) Экспорт
	
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(ПериодРегистрации, Новый Структура("Организация", Организация));
	ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу = Ложь;
	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу = УчетнаяПолитикаНУ[0].ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу;
	КонецЕсли;
	
	Если НЕ ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НалогиВзносы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НалогиВзносы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	НалогиВзносы.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
		|	НалогиВзносы.ВидДохода КАК ВидДохода,
		|	НалогиВзносы.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	СУММА(НалогиВзносы.НалогВзнос) КАК НалогВзнос
		|ИЗ
		|	ВТ_ДокументНалогиВзносы КАК НалогиВзносы
		|ГДЕ
		|	НалогиВзносы.НалогВзнос <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	НалогиВзносы.ФизическоеЛицо,
		|	НалогиВзносы.ВидНалогаВзносаОтчисления,
		|	НалогиВзносы.ВидДохода,
		|	НалогиВзносы.МесяцНалоговогоПериода,
		|	НалогиВзносы.РегистрацияВНалоговомОргане";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	РегистрацияОрганизации = ЗарплатаКадры.РегистрацияВНалоговомОргане(Организация, КонецМесяца(ПериодРегистрации));
	
	Пока Выборка.Следующий() Цикл
		
		НоваяЗапись = Движения.НалогиВзносыРасчетыНалогоплательщиков.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
		НоваяЗапись.Организация = Организация;
		ПроставитьРегистрациюВНалоговомОрганеВСтроке(НоваяЗапись, Выборка.РегистрацияВНалоговомОргане, РегистрацияОрганизации);
		НоваяЗапись.Период = ПериодРегистрации;
		
	КонецЦикла;
	
	Если Записывать Тогда
		Движения.НалогиВзносыРасчетыНалогоплательщиков.Записать();
		Движения.НалогиВзносыРасчетыНалогоплательщиков.Записывать = Ложь;
	Иначе
		Движения.НалогиВзносыРасчетыНалогоплательщиков.Записывать = Истина;
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА НалогиВзносы.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|		ИНАЧЕ НалогиВзносы.ФизическоеЛицо
		|	КОНЕЦ КАК ФизическоеЛицо,
		|	НалогиВзносы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	НалогиВзносы.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
		//|	НалогиВзносы.ВидДохода КАК ВидДохода,
		|	НалогиВзносы.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	СУММА(НалогиВзносы.НалогВзнос) КАК НалогВзнос
		|ИЗ
		|	ВТ_ДокументНалогиВзносы КАК НалогиВзносы
		|ГДЕ
		|	НалогиВзносы.НалогВзнос <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА НалогиВзносы.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|		ИНАЧЕ НалогиВзносы.ФизическоеЛицо
		|	КОНЕЦ,
		|	НалогиВзносы.ВидНалогаВзносаОтчисления,
		//|	НалогиВзносы.ВидДохода,
		|	НалогиВзносы.МесяцНалоговогоПериода,
		|	НалогиВзносы.РегистрацияВНалоговомОргане";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяЗапись = Движения.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяЗапись.Организация = Организация;
		ПроставитьРегистрациюВНалоговомОрганеВСтроке(НоваяЗапись, Выборка.РегистрацияВНалоговомОргане, РегистрацияОрганизации);
		НоваяЗапись.ВидПлатежа = Перечисления.ВидыПлатежейВГосБюджет.Налог;
		НоваяЗапись.Период = ПериодРегистрации;
		
	КонецЦикла;
	
	Если Записывать Тогда
		Движения.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Записать();
		Движения.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Записывать = Ложь;
	Иначе
		Движения.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Записывать = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьНалогиВзносыОтчисления(Движения, Отказ, Организация, ПериодРегистрации, РезультатыРасчетаНалоговВзносовОтчислений, МенеджерВременныхТаблиц, ХарактерВыплаты = Неопределено, ЗаписыватьДвижения = Ложь) Экспорт
	
	ДанныеМежрасчетногоПериода = ?(	ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Зарплата Или
									ХарактерВыплаты = Неопределено, Ложь, Истина);
									
	ДоходОтРаботодателя = Справочники.ВидыДоходов.ДоходыОтРаботодателя;

	СтруктураОтбора = Новый Структура("ВидНалогаВзносаОтчисления, ВидДохода");
	СтруктураОтбора.ВидДохода = ДоходОтРаботодателя;
	
	// ИПН
	СтруктураОтбора.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ИПН;
	ТаблицаИПН = РезультатыРасчетаНалоговВзносовОтчислений.Скопировать(СтруктураОтбора);
	// ОПВ
	СтруктураОтбора.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ОПВ;
	ТаблицаОПВ = РезультатыРасчетаНалоговВзносовОтчислений.Скопировать(СтруктураОтбора);
	// ВОСМС
	СтруктураОтбора.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС;
	ТаблицаВОСМС = РезультатыРасчетаНалоговВзносовОтчислений.Скопировать(СтруктураОтбора);

	ТаблицаИПН.Колонки.Добавить("ТерриторияВыполненияРаботВОрганизации", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ТаблицаИПН.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаИПН.Колонки.Добавить("СтатьиФинансированияЗарплата", Новый ОписаниеТипов("СправочникСсылка.СтатьиФинансированияЗарплата"));
	ТаблицаИПН.Колонки.Добавить("СтатьиРасходовЗарплата", Новый ОписаниеТипов("СправочникСсылка.СтатьиРасходовЗарплата"));
	ТаблицаИПН.Колонки.Добавить("ГруппаНачисленияУдержанияВыплаты", Новый ОписаниеТипов("ПеречислениеСсылка.ГруппыНачисленияУдержанияВыплаты"));
	ТаблицаИПН.ЗаполнитьЗначения(Перечисления.ГруппыНачисленияУдержанияВыплаты.Удержано, "ГруппаНачисленияУдержанияВыплаты");

	ТаблицаОПВ.Колонки.Добавить("ТерриторияВыполненияРаботВОрганизации", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ТаблицаОПВ.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаОПВ.Колонки.Добавить("СтатьиФинансированияЗарплата", Новый ОписаниеТипов("СправочникСсылка.СтатьиФинансированияЗарплата"));
	ТаблицаОПВ.Колонки.Добавить("СтатьиРасходовЗарплата", Новый ОписаниеТипов("СправочникСсылка.СтатьиРасходовЗарплата"));
	ТаблицаОПВ.Колонки.Добавить("ГруппаНачисленияУдержанияВыплаты", Новый ОписаниеТипов("ПеречислениеСсылка.ГруппыНачисленияУдержанияВыплаты"));
	ТаблицаОПВ.ЗаполнитьЗначения(Перечисления.ГруппыНачисленияУдержанияВыплаты.Удержано, "ГруппаНачисленияУдержанияВыплаты");

	ТаблицаВОСМС.Колонки.Добавить("ТерриторияВыполненияРаботВОрганизации", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ТаблицаВОСМС.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаВОСМС.Колонки.Добавить("СтатьиФинансированияЗарплата", Новый ОписаниеТипов("СправочникСсылка.СтатьиФинансированияЗарплата"));
	ТаблицаВОСМС.Колонки.Добавить("СтатьиРасходовЗарплата", Новый ОписаниеТипов("СправочникСсылка.СтатьиРасходовЗарплата"));
	ТаблицаВОСМС.Колонки.Добавить("ГруппаНачисленияУдержанияВыплаты", Новый ОписаниеТипов("ПеречислениеСсылка.ГруппыНачисленияУдержанияВыплаты"));
	ТаблицаВОСМС.ЗаполнитьЗначения(Перечисления.ГруппыНачисленияУдержанияВыплаты.Удержано, "ГруппаНачисленияУдержанияВыплаты");

	// Нужно выполнить распределение по сотрудникам.
	ФизическиеЛицаМассив = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаИПН, "ФизическоеЛицо", Истина);
	
	БазыРасчета = ПолучитьБазуДляРасчетаНалоговВзносов(Организация, ПериодРегистрации, ФизическиеЛицаМассив, ДоходОтРаботодателя);
	
	// ИПН
	УдержанияПоРабочимМестамИПН = УчетНачисленнойЗарплаты.РаспределениеПрочихУдержанийПоРабочимМестам(ТаблицаИПН, ПериодРегистрации, Организация, БазыРасчета.БазаРасчетаИПН, , Перечисления.ВидыОсобыхНачисленийИУдержаний.ИПН, , , Истина);
	УдержанияПоРабочимМестамИПН.ЗаполнитьЗначения(ДанныеМежрасчетногоПериода, "ДанныеМежрасчетногоПериода");
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(УдержанияПоРабочимМестамИПН, Движения.НачисленияУдержанияПоСотрудникам);
	// ОПВ
	УдержанияПоРабочимМестамОПВ = УчетНачисленнойЗарплаты.РаспределениеПрочихУдержанийПоРабочимМестам(ТаблицаОПВ, ПериодРегистрации, Организация, БазыРасчета.БазаРасчетаОПВ, , Перечисления.ВидыОсобыхНачисленийИУдержаний.ОПВ, 0, , Истина);
	УдержанияПоРабочимМестамОПВ.ЗаполнитьЗначения(ДанныеМежрасчетногоПериода, "ДанныеМежрасчетногоПериода");
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(УдержанияПоРабочимМестамОПВ, Движения.НачисленияУдержанияПоСотрудникам);
	// ВОСМС
	УдержанияПоРабочимМестамВОСМС = УчетНачисленнойЗарплаты.РаспределениеПрочихУдержанийПоРабочимМестам(ТаблицаВОСМС, ПериодРегистрации, Организация, БазыРасчета.БазаРасчетаВОСМС, , Перечисления.ВидыОсобыхНачисленийИУдержаний.ВОСМС, 0, , Истина);
	УдержанияПоРабочимМестамВОСМС.ЗаполнитьЗначения(ДанныеМежрасчетногоПериода, "ДанныеМежрасчетногоПериода");
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(УдержанияПоРабочимМестамВОСМС, Движения.НачисленияУдержанияПоСотрудникам);

	Движения.НачисленияУдержанияПоСотрудникам.Записывать = Истина;
	
	Если ЗаписыватьДвижения Тогда
		Движения.НачисленияУдержанияПоСотрудникам.Записать();
		Движения.НачисленияУдержанияПоСотрудникам.Записывать = Ложь;
	КонецЕсли;
	
	// Взаиморасчеты
	Если ЗначениеЗаполнено(ХарактерВыплаты) Тогда
		УдержанияДляВзаиморасчетов = ВзаиморасчетыССотрудниками.НоваяТаблицаНачисленнойЗарплаты();
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(УдержанияПоРабочимМестамИПН, УдержанияДляВзаиморасчетов);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(УдержанияПоРабочимМестамОПВ, УдержанияДляВзаиморасчетов);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(УдержанияПоРабочимМестамВОСМС, УдержанияДляВзаиморасчетов);
		ВзаиморасчетыССотрудниками.ЗарегистрироватьНачисленнуюЗарплату(
			Движения, Отказ, 
			Организация, ПериодРегистрации, ХарактерВыплаты,
			Неопределено, УдержанияДляВзаиморасчетов);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьНалогиВзносыОтчисленияПоСотрудникам(Движения, Отказ, Организация, ПериодРегистрации, НалогиВзносыОтчисленияИсчисленные, ЗаписыватьДвижения = Ложь) Экспорт

	Если НалогиВзносыОтчисленияИсчисленные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Регистратор = Движения.НалогиВзносыОтчисленияПоСотрудникам.Отбор.Регистратор.Значение;
	
	МассивФизическихЛиц = ОбщегоНазначения.ВыгрузитьКолонку(НалогиВзносыОтчисленияИсчисленные, "ФизическоеЛицо", Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизическиеЛица", МассивФизическихЛиц);
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Сотрудник,
		|	СведенияОДоходах.Организация КАК Организация,
		|	СведенияОДоходах.Подразделение,
		|	СУММА(СведенияОДоходах.СуммаДохода) КАК Сумма,
		|	СведенияОДоходах.Период КАК МесяцНалоговогоПериода,
		|	СведенияОДоходах.Начисление
		|ПОМЕСТИТЬ ВТСведенияОДоходах
		|ИЗ
		|	РегистрНакопления.СведенияОДоходахФизическихЛиц КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &Организация
		|	И СведенияОДоходах.ПериодРегистрации = &ПериодРегистрации
		|	И СведенияОДоходах.ФизическоеЛицо В(&ФизическиеЛица)
		|	И СведенияОДоходах.Активность
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Сотрудник,
		|	СведенияОДоходах.Организация,
		|	СведенияОДоходах.Подразделение,
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.Начисление
		|
		// к базе распределения за месяц принимаем только положительные суммы
		|ИМЕЮЩИЕ
		|	СУММА(СведенияОДоходах.СуммаДохода) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(НалогообложениеНачислений.Период) КАК Период,
		|	НалогообложениеНачислений.Начисление,
		|	ВТСведенияОДоходах.МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТПериодыНалогообложения
		|ИЗ
		|	ВТСведенияОДоходах КАК ВТСведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений КАК НалогообложениеНачислений
		|		ПО ВТСведенияОДоходах.МесяцНалоговогоПериода >= НалогообложениеНачислений.Период
		|			И ВТСведенияОДоходах.Начисление = НалогообложениеНачислений.Начисление
		|
		|СГРУППИРОВАТЬ ПО
		|	НалогообложениеНачислений.Начисление,
		|	ВТСведенияОДоходах.МесяцНалоговогоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПериодыНалогообложения.МесяцНалоговогоПериода,
		|	ВТПериодыНалогообложения.Начисление,
		|	НалогообложениеНачислений.ВидДохода,
		|	НалогообложениеНачислений.СпособОбложенияСН,
		|	НалогообложениеНачислений.СпособОбложенияСО,
		|	НалогообложениеНачислений.СпособОбложенияОППВ,
		|	НалогообложениеНачислений.СпособОбложенияООСМС
		|ПОМЕСТИТЬ ВТНалогообложениеНачислений
		|ИЗ
		|	ВТПериодыНалогообложения КАК ВТПериодыНалогообложения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений КАК НалогообложениеНачислений
		|		ПО ВТПериодыНалогообложения.Период = НалогообложениеНачислений.Период
		|			И ВТПериодыНалогообложения.Начисление = НалогообложениеНачислений.Начисление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСведенияОДоходах.ФизическоеЛицо,
		|	ВТСведенияОДоходах.Сотрудник,
		|	ВТСведенияОДоходах.Организация,
		|	ВТСведенияОДоходах.Подразделение,
		|	ВТСведенияОДоходах.Начисление,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТНалогообложениеНачислений.СпособОбложенияСН, ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)) <> ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
		|				ТОГДА ВТСведенияОДоходах.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК База
		|ИЗ
		|	ВТСведенияОДоходах КАК ВТСведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогообложениеНачислений КАК ВТНалогообложениеНачислений
		|		ПО ВТСведенияОДоходах.МесяцНалоговогоПериода = ВТНалогообложениеНачислений.МесяцНалоговогоПериода
		|			И ВТСведенияОДоходах.Начисление = ВТНалогообложениеНачислений.Начисление
		|ГДЕ
		|	ВТНалогообложениеНачислений.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСведенияОДоходах.ФизическоеЛицо,
		|	ВТСведенияОДоходах.Сотрудник,
		|	ВТСведенияОДоходах.Организация,
		|	ВТСведенияОДоходах.Подразделение,
		|	ВТСведенияОДоходах.Начисление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСведенияОДоходах.ФизическоеЛицо,
		|	ВТСведенияОДоходах.Сотрудник,
		|	ВТСведенияОДоходах.Организация,
		|	ВТСведенияОДоходах.Подразделение,
		|	ВТСведенияОДоходах.Начисление,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТНалогообложениеНачислений.СпособОбложенияСО, ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)) <> ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
		|				ТОГДА ВТСведенияОДоходах.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК База
		|ИЗ
		|	ВТСведенияОДоходах КАК ВТСведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогообложениеНачислений КАК ВТНалогообложениеНачислений
		|		ПО ВТСведенияОДоходах.МесяцНалоговогоПериода = ВТНалогообложениеНачислений.МесяцНалоговогоПериода
		|			И ВТСведенияОДоходах.Начисление = ВТНалогообложениеНачислений.Начисление
		|			И НЕ ВТСведенияОДоходах.Начисление В (ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорАвторскогоЗаказа), ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорРаботыУслуги))
		|ГДЕ
		|	ВТНалогообложениеНачислений.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСведенияОДоходах.ФизическоеЛицо,
		|	ВТСведенияОДоходах.Сотрудник,
		|	ВТСведенияОДоходах.Организация,
		|	ВТСведенияОДоходах.Подразделение,
		|	ВТСведенияОДоходах.Начисление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСведенияОДоходах.ФизическоеЛицо,
		|	ВТСведенияОДоходах.Сотрудник,
		|	ВТСведенияОДоходах.Организация,
		|	ВТСведенияОДоходах.Подразделение,
		|	ВТСведенияОДоходах.Начисление,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТНалогообложениеНачислений.СпособОбложенияОППВ, ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)) <> ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
		|				ТОГДА ВТСведенияОДоходах.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК База
		|ИЗ
		|	ВТСведенияОДоходах КАК ВТСведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогообложениеНачислений КАК ВТНалогообложениеНачислений
		|		ПО ВТСведенияОДоходах.МесяцНалоговогоПериода = ВТНалогообложениеНачислений.МесяцНалоговогоПериода
		|			И ВТСведенияОДоходах.Начисление = ВТНалогообложениеНачислений.Начисление
		|			И НЕ ВТСведенияОДоходах.Начисление В (ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорАвторскогоЗаказа), ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорРаботыУслуги))
		|ГДЕ
		|	ВТНалогообложениеНачислений.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСведенияОДоходах.ФизическоеЛицо,
		|	ВТСведенияОДоходах.Сотрудник,
		|	ВТСведенияОДоходах.Организация,
		|	ВТСведенияОДоходах.Подразделение,
		|	ВТСведенияОДоходах.Начисление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСведенияОДоходах.ФизическоеЛицо,
		|	ВТСведенияОДоходах.Сотрудник,
		|	ВТСведенияОДоходах.Организация,
		|	ВТСведенияОДоходах.Подразделение,
		|	ВТСведенияОДоходах.Начисление,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТНалогообложениеНачислений.СпособОбложенияООСМС, ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)) <> ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
		|				ТОГДА ВТСведенияОДоходах.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК База
		|ИЗ
		|	ВТСведенияОДоходах КАК ВТСведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогообложениеНачислений КАК ВТНалогообложениеНачислений
		|		ПО ВТСведенияОДоходах.МесяцНалоговогоПериода = ВТНалогообложениеНачислений.МесяцНалоговогоПериода
		|			И ВТСведенияОДоходах.Начисление = ВТНалогообложениеНачислений.Начисление
		|			И НЕ ВТСведенияОДоходах.Начисление В (ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорАвторскогоЗаказа), ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорРаботыУслуги))
		|ГДЕ
		|	ВТНалогообложениеНачислений.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСведенияОДоходах.ФизическоеЛицо,
		|	ВТСведенияОДоходах.Сотрудник,
		|	ВТСведенияОДоходах.Организация,
		|	ВТСведенияОДоходах.Подразделение,
		|	ВТСведенияОДоходах.Начисление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.Организация,
		|	СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.ВидДохода,
		|	СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.ВидНалогаВзносаОтчисления,
		|	СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.ПериодРегистрации,
		|	НАЧАЛОПЕРИОДА(СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
		|	СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.Подразделение,
		|	СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.ФизическоеЛицо,
		|	СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.НалогВзносОборот КАК Сумма
		|ИЗ
		|	РегистрНакопления.СведенияОбИсчисленииНалоговВзносовОтчислений.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			ПериодРегистрации = &ПериодРегистрации
		|				И Организация = &Организация
		|				И ФизическоеЛицо В (&ФизическиеЛица)) КАК СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты
		|ГДЕ
		|	СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.Регистратор <> &Регистратор";
		
	//Запрос.Текст = СтрЗаменить(Запрос.Текст, "#НалогиВзносыОтчисленияИсчисленные", "&НалогиВзносыОтчисленияИсчисленные");
	
	Результат = Запрос.ВыполнитьПакет();
	ВсегоРезультатов = Результат.Количество();

	БазаРасчетаСН = Результат[ВсегоРезультатов-5].Выгрузить();
	БазаРасчетаСО = Результат[ВсегоРезультатов-4].Выгрузить();
	БазаРасчетаОППВ = Результат[ВсегоРезультатов-3].Выгрузить();
	БазаРасчетаООСМС = Результат[ВсегоРезультатов-2].Выгрузить();
	ИсчисленныеНалогиВзносы = Результат[ВсегоРезультатов-1].Выгрузить();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НалогиВзносыОтчисленияИсчисленные, ИсчисленныеНалогиВзносы);
	
	СтруктураОтбора = Новый Структура("ВидНалогаВзносаОтчисления");
	// СН
	СтруктураОтбора.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.СН;
	ТаблицаСН = ИсчисленныеНалогиВзносы.Скопировать(СтруктураОтбора);
	// СО
	СтруктураОтбора.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.СО;
	ТаблицаСО = ИсчисленныеНалогиВзносы.Скопировать(СтруктураОтбора);
	
	// ОППВ
	СтруктураОтбора.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ОППВ;
	ТаблицаОППВ = ИсчисленныеНалогиВзносы.Скопировать(СтруктураОтбора);
	
	// ООСМС
	СтруктураОтбора.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ООСМС;
	ТаблицаООСМС = ИсчисленныеНалогиВзносы.Скопировать(СтруктураОтбора);
	
	НоваяТаблицаРаспределения = Движения.НалогиВзносыОтчисленияПоСотрудникам.ВыгрузитьКолонки();
	// СН
	СНПоСотрудникам = НалогиВзносыОтчисленияПоСотрудникам(ТаблицаСН, БазаРасчетаСН);
	СНПоСотрудникам.Колонки.Сумма.Имя = "СН";
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СНПоСотрудникам, НоваяТаблицаРаспределения);
	// СО
	СОПоСотрудникам = НалогиВзносыОтчисленияПоСотрудникам(ТаблицаСО, БазаРасчетаСО);
	СОПоСотрудникам.Колонки.Сумма.Имя = "СО";
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СОПоСотрудникам, НоваяТаблицаРаспределения);
	
	// ОППВ
	ОППВПоСотрудникам = НалогиВзносыОтчисленияПоСотрудникам(ТаблицаОППВ, БазаРасчетаОППВ);
	ОППВПоСотрудникам.Колонки.Сумма.Имя = "ОППВ";
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ОППВПоСотрудникам, НоваяТаблицаРаспределения);
	
	// ООСМС
	ООСМСПоСотрудникам = НалогиВзносыОтчисленияПоСотрудникам(ТаблицаООСМС, БазаРасчетаООСМС);
	ООСМСПоСотрудникам.Колонки.Сумма.Имя = "ООСМС";
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ООСМСПоСотрудникам, НоваяТаблицаРаспределения);

	ТекстКорректировкаРаспределения = 
		"ВЫБРАТЬ
		|	НалогиВзносыОтчисленияПоСотрудникам.Организация,
		|	НалогиВзносыОтчисленияПоСотрудникам.ФизическоеЛицо,
		|	НалогиВзносыОтчисленияПоСотрудникам.Сотрудник,
		|	НалогиВзносыОтчисленияПоСотрудникам.Подразделение,
		|	НалогиВзносыОтчисленияПоСотрудникам.Начисление,
		|	-НалогиВзносыОтчисленияПоСотрудникам.СООборот КАК СО,
		|	-НалогиВзносыОтчисленияПоСотрудникам.СНОборот КАК СН,
		|	-НалогиВзносыОтчисленияПоСотрудникам.ОППВОборот КАК ОППВ,
		|	-НалогиВзносыОтчисленияПоСотрудникам.ООСМСОборот КАК ООСМС
		|ИЗ
		|	РегистрНакопления.НалогиВзносыОтчисленияПоСотрудникам.Обороты(
		|			НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ),
		|			КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ),
		|			Регистратор,
		|			Организация = &Организация
		|				И ФизическоеЛицо В (&ФизическиеЛица)) КАК НалогиВзносыОтчисленияПоСотрудникам
		|ГДЕ
		|	НалогиВзносыОтчисленияПоСотрудникам.Регистратор <> &Регистратор";
		
	Запрос.Текст = ТекстКорректировкаРаспределения;
	РанееИсчисленныеНалогиВзносыОтчисления = Запрос.Выполнить().Выгрузить();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РанееИсчисленныеНалогиВзносыОтчисления, НоваяТаблицаРаспределения);
	НоваяТаблицаРаспределения.ЗаполнитьЗначения(ПериодРегистрации, "Период");
	НоваяТаблицаРаспределения.Свернуть("Период, Организация, ФизическоеЛицо, Сотрудник, Подразделение, Начисление", "СО, СН, ОППВ, ООСМС");
	
	КоличествоЗаписей = НоваяТаблицаРаспределения.Количество();
	
	Для Н = 1 По КоличествоЗаписей Цикл

		СтрокаТаблицы = НоваяТаблицаРаспределения[КоличествоЗаписей - Н];
		Если СтрокаТаблицы.СО = 0  
			И СтрокаТаблицы.СН = 0
			И СтрокаТаблицы.ОППВ = 0
			И СтрокаТаблицы.ООСМС = 0 Тогда
			НоваяТаблицаРаспределения.Удалить(КоличествоЗаписей - Н);
		КонецЕсли;
				
	КонецЦикла;
	
	Движения.НалогиВзносыОтчисленияПоСотрудникам.Загрузить(НоваяТаблицаРаспределения);

	Движения.НалогиВзносыОтчисленияПоСотрудникам.Записывать = Истина;
	Если ЗаписыватьДвижения Тогда
		Движения.НалогиВзносыОтчисленияПоСотрудникам.Записать();
		Движения.НалогиВзносыОтчисленияПоСотрудникам.Записывать = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьНалогиВзносыОтчисленияПоДоходуСубъектаПредпринимательства(Движения, Отказ, Организация, ПериодРегистрации, Начисление, НалогиВзносыОтчисленияИсчисленные, ЗаписыватьДвижения = Ложь) Экспорт

	Если НалогиВзносыОтчисленияИсчисленные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Регистратор = Движения.НалогиВзносыОтчисленияПоСотрудникам.Отбор.Регистратор.Значение;
	
	МассивФизическихЛиц = ОбщегоНазначения.ВыгрузитьКолонку(НалогиВзносыОтчисленияИсчисленные, "ФизическоеЛицо", Истина);
	
	СтруктураОтбора = Новый Структура("ВидНалогаВзносаОтчисления");
	// СН
	СтруктураОтбора.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.СН;
	ТаблицаСН = НалогиВзносыОтчисленияИсчисленные.Скопировать(СтруктураОтбора);
	// СО
	СтруктураОтбора.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.СО;
	ТаблицаСО = НалогиВзносыОтчисленияИсчисленные.Скопировать(СтруктураОтбора);
	
	НоваяТаблицаРаспределения = Движения.НалогиВзносыОтчисленияПоСотрудникам.ВыгрузитьКолонки();
	// СН
	ТаблицаСН.Колонки.Сумма.Имя = "СН";
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаСН, НоваяТаблицаРаспределения);
	// СО
	ТаблицаСО.Колонки.Сумма.Имя = "СО";
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаСО, НоваяТаблицаРаспределения);

	НоваяТаблицаРаспределения.ЗаполнитьЗначения(ПериодРегистрации, "Период");
	НоваяТаблицаРаспределения.ЗаполнитьЗначения(Организация, "Организация");
	НоваяТаблицаРаспределения.ЗаполнитьЗначения(Начисление, "Начисление");
	НоваяТаблицаРаспределения.Свернуть("Период, Организация, ФизическоеЛицо, Сотрудник, Подразделение, Начисление", "СО, СН, ОППВ, ООСМС");
	
	КоличествоЗаписей = НоваяТаблицаРаспределения.Количество();
	
	Для Н = 1 По КоличествоЗаписей Цикл

		СтрокаТаблицы = НоваяТаблицаРаспределения[КоличествоЗаписей - Н];
		Если СтрокаТаблицы.СО = 0  
			И СтрокаТаблицы.СН = 0 Тогда
			НоваяТаблицаРаспределения.Удалить(КоличествоЗаписей - Н);
		КонецЕсли;
				
	КонецЦикла;
		
	Движения.НалогиВзносыОтчисленияПоСотрудникам.Загрузить(НоваяТаблицаРаспределения);

	Движения.НалогиВзносыОтчисленияПоСотрудникам.Записывать = Истина;
	Если ЗаписыватьДвижения Тогда
		Движения.НалогиВзносыОтчисленияПоСотрудникам.Записать();
		Движения.НалогиВзносыОтчисленияПоСотрудникам.Записывать = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьНалогиВзносыОтчисленияАвансом(Движения, Отказ, Организация, ПериодРегистрации, РезультатыРасчетаНалоговВзносовОтчислений, МенеджерВременныхТаблиц, ХарактерВыплаты = Неопределено, ЗаписыватьДвижения = Ложь) Экспорт
	
	ДанныеМежрасчетногоПериода = ?(	ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Зарплата Или
									ХарактерВыплаты = Неопределено, Ложь, Истина);
									
	ДоходОтРаботодателя = Справочники.ВидыДоходов.ДоходыОтРаботодателя;

	СтруктураОтбора = Новый Структура("ВидНалогаВзносаОтчисления, ВидДохода");
	СтруктураОтбора.ВидДохода = ДоходОтРаботодателя;
	
	// ИПН
	СтруктураОтбора.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ИПН;
	ТаблицаИПН = РезультатыРасчетаНалоговВзносовОтчислений.Скопировать(СтруктураОтбора);
	// ОПВ
	СтруктураОтбора.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ОПВ;
	ТаблицаОПВ = РезультатыРасчетаНалоговВзносовОтчислений.Скопировать(СтруктураОтбора);
	// ВОСМС
	СтруктураОтбора.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС;
	ТаблицаВОСМС = РезультатыРасчетаНалоговВзносовОтчислений.Скопировать(СтруктураОтбора);

	ТаблицаИПН.Колонки.Добавить("ТерриторияВыполненияРаботВОрганизации", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ТаблицаИПН.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаИПН.Колонки.Добавить("СтатьиФинансированияЗарплата", Новый ОписаниеТипов("СправочникСсылка.СтатьиФинансированияЗарплата"));
	ТаблицаИПН.Колонки.Добавить("СтатьиРасходовЗарплата", Новый ОписаниеТипов("СправочникСсылка.СтатьиРасходовЗарплата"));
	ТаблицаИПН.Колонки.Добавить("ГруппаНачисленияУдержанияВыплаты", Новый ОписаниеТипов("ПеречислениеСсылка.ГруппыНачисленияУдержанияВыплаты"));
	ТаблицаИПН.ЗаполнитьЗначения(Перечисления.ГруппыНачисленияУдержанияВыплаты.Удержано, "ГруппаНачисленияУдержанияВыплаты");

	ТаблицаОПВ.Колонки.Добавить("ТерриторияВыполненияРаботВОрганизации", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ТаблицаОПВ.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаОПВ.Колонки.Добавить("СтатьиФинансированияЗарплата", Новый ОписаниеТипов("СправочникСсылка.СтатьиФинансированияЗарплата"));
	ТаблицаОПВ.Колонки.Добавить("СтатьиРасходовЗарплата", Новый ОписаниеТипов("СправочникСсылка.СтатьиРасходовЗарплата"));
	ТаблицаОПВ.Колонки.Добавить("ГруппаНачисленияУдержанияВыплаты", Новый ОписаниеТипов("ПеречислениеСсылка.ГруппыНачисленияУдержанияВыплаты"));
	ТаблицаОПВ.ЗаполнитьЗначения(Перечисления.ГруппыНачисленияУдержанияВыплаты.Удержано, "ГруппаНачисленияУдержанияВыплаты");

	ТаблицаВОСМС.Колонки.Добавить("ТерриторияВыполненияРаботВОрганизации", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ТаблицаВОСМС.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаВОСМС.Колонки.Добавить("СтатьиФинансированияЗарплата", Новый ОписаниеТипов("СправочникСсылка.СтатьиФинансированияЗарплата"));
	ТаблицаВОСМС.Колонки.Добавить("СтатьиРасходовЗарплата", Новый ОписаниеТипов("СправочникСсылка.СтатьиРасходовЗарплата"));
	ТаблицаВОСМС.Колонки.Добавить("ГруппаНачисленияУдержанияВыплаты", Новый ОписаниеТипов("ПеречислениеСсылка.ГруппыНачисленияУдержанияВыплаты"));
	ТаблицаВОСМС.ЗаполнитьЗначения(Перечисления.ГруппыНачисленияУдержанияВыплаты.Удержано, "ГруппаНачисленияУдержанияВыплаты");

	// Нужно выполнить распределение по сотрудникам.
	ФизическиеЛицаМассив = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаИПН, "ФизическоеЛицо", Истина);

	БазыРасчета = ПолучитьБазуДляРасчетаНалоговВзносов(Организация, ПериодРегистрации, ФизическиеЛицаМассив, ДоходОтРаботодателя);
	
	// ИПН
	УдержанияПоРабочимМестамИПН = УчетНачисленнойЗарплаты.РаспределениеПрочихУдержанийПоРабочимМестам(ТаблицаИПН, ПериодРегистрации, Организация, БазыРасчета.БазаРасчетаИПН, , Перечисления.ВидыОсобыхНачисленийИУдержаний.ИПН, , , Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(УдержанияПоРабочимМестамИПН, Движения.НачисленияУдержанияПоСотрудникамАвансом);
	// ОПВ
	УдержанияПоРабочимМестамОПВ = УчетНачисленнойЗарплаты.РаспределениеПрочихУдержанийПоРабочимМестам(ТаблицаОПВ, ПериодРегистрации, Организация, БазыРасчета.БазаРасчетаОПВ, , Перечисления.ВидыОсобыхНачисленийИУдержаний.ОПВ, 0, , Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(УдержанияПоРабочимМестамОПВ, Движения.НачисленияУдержанияПоСотрудникамАвансом);
	// ВОСМС
	УдержанияПоРабочимМестамВОСМС = УчетНачисленнойЗарплаты.РаспределениеПрочихУдержанийПоРабочимМестам(ТаблицаВОСМС, ПериодРегистрации, Организация, БазыРасчета.БазаРасчетаВОСМС, , Перечисления.ВидыОсобыхНачисленийИУдержаний.ВОСМС, 0, , Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(УдержанияПоРабочимМестамВОСМС, Движения.НачисленияУдержанияПоСотрудникамАвансом);

	Движения.НачисленияУдержанияПоСотрудникамАвансом.Записывать = Истина;
	
	Если ЗаписыватьДвижения Тогда
		Движения.НачисленияУдержанияПоСотрудникамАвансом.Записать();
		Движения.НачисленияУдержанияПоСотрудникамАвансом.Записывать = Ложь;
	КонецЕсли;
	
	// Взаиморасчеты
	УдержанияДляВзаиморасчетов = ВзаиморасчетыССотрудниками.НоваяТаблицаНачисленнойЗарплаты();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(УдержанияПоРабочимМестамИПН, УдержанияДляВзаиморасчетов);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(УдержанияПоРабочимМестамОПВ, УдержанияДляВзаиморасчетов);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(УдержанияПоРабочимМестамВОСМС, УдержанияДляВзаиморасчетов);
	ВзаиморасчетыССотрудникамиРасширенный.ЗарегистрироватьНачисленныйАванс(
		Движения, Отказ, 
		Организация, ПериодРегистрации,
		Неопределено, УдержанияДляВзаиморасчетов);
	
КонецПроцедуры

Процедура СформироватьПениПоВзносамИОтчислениям(Движения, Отказ, Организация, ПериодРегистрации, РезультатыРасчетаПени, Записывать = Ложь) Экспорт
	
	Для Каждого СтрокаПени Из РезультатыРасчетаПени Цикл
		НоваяСтрока =  Движения.ПениПоВзносамИОтчислениям.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПени);
		НоваяСтрока.Организация = Организация;	
		НоваяСтрока.Период = ПериодРегистрации;
	КонецЦикла;
	
	
	Если Записывать Тогда
		// Записываем сразу и не выставляем признак Записывать этому набору записей движений документа.
		Движения.ПениПоВзносамИОтчислениям.Записать();
		Движения.ПениПоВзносамИОтчислениям.Записывать = Ложь;
	Иначе
		Движения.ПениПоВзносамИОтчислениям.Записывать = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеДляПроведенияСведенияОбИсчисленииВычетовИПН(ДанныеДляПроведения, ДокументСсылка, ИмяПоляМесяц = "Ссылка.МесяцНачисления") Экспорт
	
	ДатаКонтроля = '2018-01-01';
	ИмяРеквизита = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяПоляМесяц,".")[1];
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка,ИмяРеквизита) < ДатаКонтроля Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НалогиВзносыОтчисления.ФизическоеЛицо,
	|	НалогиВзносыОтчисления.Подразделение,
	|	НалогиВзносыОтчисления.Ссылка.МесяцНачисления КАК ПериодРегистрации,
	|	НалогиВзносыОтчисления.МесяцНалоговогоПериода,
	|	НалогиВзносыОтчисления.ВидДохода,
	|	ВычетыИПН.ВидВычетаИПН,
	|	СУММА(ВычетыИПН.РазрешенныйВычет) КАК РазрешенныйВычет,
	|	СУММА(ВычетыИПН.ПримененныйВычет) КАК ПримененныйВычет
	|ПОМЕСТИТЬ ВТСведенияОбИсчисленииВычетовИПН
	|ИЗ
	|	#НалогиВзносыОтчисления КАК НалогиВзносыОтчисления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ВычетыИПН КАК ВычетыИПН
	|		ПО НалогиВзносыОтчисления.ИдентификаторСтрокиНалогиВзносыОтчисления = ВычетыИПН.ИдентификаторСтрокиНалогиВзносыОтчисления
	|			И НалогиВзносыОтчисления.Ссылка = ВычетыИПН.Ссылка
	|ГДЕ
	|	НалогиВзносыОтчисления.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	НалогиВзносыОтчисления.ФизическоеЛицо,
	|	НалогиВзносыОтчисления.Подразделение,
	|	НалогиВзносыОтчисления.Ссылка.МесяцНачисления,
	|	НалогиВзносыОтчисления.МесяцНалоговогоПериода,
	|	НалогиВзносыОтчисления.ВидДохода,
	|	ВычетыИПН.ВидВычетаИПН";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Ссылка.МесяцНачисления",  ИмяПоляМесяц);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#НалогиВзносыОтчисления", ДокументСсылка.Метаданные().ПолноеИмя() + ".НалогиВзносыОтчисления");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ВычетыИПН",              ДокументСсылка.Метаданные().ПолноеИмя() + ".ВычетыИПН");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ДанныеДляПроведения.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СформироватьСведенияОбИсчисленииВычетовИПН(ДанныеДляПроведения, Движения, Отказ, Организация, МесяцНачисления,ОкончательныйРасчет = Истина)Экспорт
	
	ДатаКонтроля = '2018-01-01';
	Если МесяцНачисления < ДатаКонтроля Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДанныеДляПроведения.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КонецМесяцаНачисления", КонецМесяца(МесяцНачисления));
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОбИсчисленииВычетовИПН.ФизическоеЛицо,
		|	СведенияОбИсчисленииВычетовИПН.Подразделение,
		|	СведенияОбИсчисленииВычетовИПН.ПериодРегистрации,
		|	СведенияОбИсчисленииВычетовИПН.МесяцНалоговогоПериода КАК Период,
		|	СведенияОбИсчисленииВычетовИПН.ВидДохода КАК ВидДохода,
		|	СведенияОбИсчисленииВычетовИПН.ВидВычетаИПН КАК ВидВычета,
		|	СведенияОбИсчисленииВычетовИПН.РазрешенныйВычет,
		|	СведенияОбИсчисленииВычетовИПН.ПримененныйВычет,
		|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане
		|ИЗ
		|	ВТСведенияОбИсчисленииВычетовИПН КАК СведенияОбИсчисленииВычетовИПН
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(
		|				&КонецМесяцаНачисления,
		|				СтруктурнаяЕдиница В
		|					(ВЫБРАТЬ
		|						СведенияОбИсчисленииВычетовИПН.Подразделение
		|					ИЗ
		|						ВТСведенияОбИсчисленииВычетовИПН КАК СведенияОбИсчисленииВычетовИПН)) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
		|		ПО СведенияОбИсчисленииВычетовИПН.Подразделение = ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница
		|ГДЕ
		|	(СведенияОбИсчисленииВычетовИПН.РазрешенныйВычет <> 0
		|			ИЛИ СведенияОбИсчисленииВычетовИПН.ПримененныйВычет <> 0)";
		
	Выборка = Запрос.Выполнить().Выбрать();

	РегистрацияОрганизации = ЗарплатаКадры.РегистрацияВНалоговомОргане(Организация, КонецМесяца(МесяцНачисления));
	
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = Движения.СведенияОбИсчисленииВычетовИПН.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		НоваяЗапись.Организация = Организация;
		НоваяЗапись.ДанныеМежрасчетногоПериода = НЕ ОкончательныйРасчет;
		ПроставитьРегистрациюВНалоговомОрганеВСтроке(НоваяЗапись, Выборка.РегистрацияВНалоговомОргане, РегистрацияОрганизации);
	КонецЦикла;
	
	Движения.СведенияОбИсчисленииВычетовИПН.Записывать = Истина;
	
КонецПроцедуры

Процедура СформироватьПрекращениеВычетов(Движения, ФизическиеЛица, Организация, МесяцРегистрации, Отказ, ИсключаемыеРегистраторы) Экспорт
	
	Если ТипЗнч(ФизическиеЛица) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		СписокФизическихЛиц = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическиеЛица);
	Иначе
		СписокФизическихЛиц = ФизическиеЛица;
	КонецЕсли;
	
	ТаблицаВычеты = Новый ТаблицаЗначений;
	ТаблицаВычеты.Колонки.Добавить("ФизическоеЛицо");
	ТаблицаВычеты.Колонки.Добавить("МесяцРегистрации");
	ТаблицаВычеты.Колонки.Добавить("ВидВычета");
	ТаблицаВычеты.Колонки.Добавить("ПредоставлятьВычет");
	
	ТаблицаПрочиеВычеты = Новый ТаблицаЗначений;
	ТаблицаПрочиеВычеты.Колонки.Добавить("ФизическоеЛицо");
	ТаблицаПрочиеВычеты.Колонки.Добавить("МесяцРегистрации");
	ТаблицаПрочиеВычеты.Колонки.Добавить("ВидВычета");
	ТаблицаПрочиеВычеты.Колонки.Добавить("Размер");
	ТаблицаПрочиеВычеты.Колонки.Добавить("ДействуетС");
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Месяц",					МесяцРегистрации);
	Запрос.УстановитьПараметр("ПустаяДата",				Дата(1,1,1));
	Запрос.УстановитьПараметр("ДатаКонтроля",			Дата(2018,1,1));
	Запрос.УстановитьПараметр("ФизическиеЛица",			СписокФизическихЛиц);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",	Организация);
	Запрос.УстановитьПараметр("ИсключаемыеРегистраторы",ИсключаемыеРегистраторы);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрименениеВычетовИПНСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПрименениеВычетовИПНСрезПоследних.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_МестоПримененияВычетов
	|ИЗ
	|	РегистрСведений.ПрименениеВычетовИПН.СрезПоследних(
	|			&Месяц,
	|			ФизическоеЛицо В (&ФизическиеЛица)
	|				И НЕ Регистратор В (&ИсключаемыеРегистраторы)) КАК ПрименениеВычетовИПНСрезПоследних
	|ГДЕ
	|	ПрименениеВычетовИПНСрезПоследних.Организация = &ГоловнаяОрганизация";
	
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВычетыФизическихЛицИПН.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВычетыФизическихЛицИПН.ВидВычета КАК ВидВычетаИПН
	|ИЗ
	|	РегистрСведений.ВычетыФизическихЛицИПН.СрезПоследних(
	|			&Месяц,
	|			ФизическоеЛицо В (&ФизическиеЛица)
	|				И НЕ Регистратор В (&ИсключаемыеРегистраторы)) КАК ВычетыФизическихЛицИПН
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МестоПримененияВычетов КАК МестоПримененияВычетов
	|		ПО МестоПримененияВычетов.ФизическоеЛицо = ВычетыФизическихЛицИПН.ФизическоеЛицо
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВычетыФизическихЛицИПН.ДействуетПо = &ПустаяДата
	|				ТОГДА ВычетыФизическихЛицИПН.ПредоставлятьВычет
	|			ИНАЧЕ ВычетыФизическихЛицИПН.ДействуетПо >= &Месяц
	|		КОНЕЦ";
	
	СтандартныеВычетыВыборка = Запрос.Выполнить().Выбрать();
	
	Если МесяцРегистрации < '2018-01-01' Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МАКСИМУМ(ПрочиеВычетыФизическихЛицИПН.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_МаксимумПрочиеВычеты
		|ИЗ
		|	РегистрСведений.ПрочиеВычетыФизическихЛицИПН КАК ПрочиеВычетыФизическихЛицИПН
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МестоПримененияВычетов КАК МестоПримененияВычетов
		|		ПО МестоПримененияВычетов.ФизическоеЛицо = ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо
		|ГДЕ
		|	ПрочиеВычетыФизическихЛицИПН.Период < &Месяц
		|
		|СГРУППИРОВАТЬ ПО
		|   ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПрочиеВычетыФизическихЛицИПН.ВидВычета КАК ВидВычетаИПН,
		|	ПрочиеВычетыФизическихЛицИПН.ДействуетС
		|ИЗ
		|	РегистрСведений.ПрочиеВычетыФизическихЛицИПН КАК ПрочиеВычетыФизическихЛицИПН
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксимумПрочиеВычеты КАК МаксимумПрочиеВычеты
		|		ПО ПрочиеВычетыФизическихЛицИПН.Период = МаксимумПрочиеВычеты.Период
		|			И ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо = МаксимумПрочиеВычеты.ФизическоеЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо,
		|	ПрочиеВычетыФизическихЛицИПН.ВидВычета,
		|	ПрочиеВычетыФизическихЛицИПН.ДействуетС";
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПрочиеВычетыФизическихЛицИПН.ВидВычета КАК ВидВычетаИПН,
		|	ПрочиеВычетыФизическихЛицИПН.ДействуетС КАК ДействуетС
		|ИЗ
		|	РегистрСведений.ПрочиеВычетыФизическихЛицИПН.СрезПоследних(
		|			&Месяц,
		|			ФизическоеЛицо В (&ФизическиеЛица)
		|				И НЕ Регистратор В (&ИсключаемыеРегистраторы)) КАК ПрочиеВычетыФизическихЛицИПН
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МестоПримененияВычетов КАК МестоПримененияВычетов
		|		ПО МестоПримененияВычетов.ФизическоеЛицо = ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо
		|ГДЕ
		|	ПрочиеВычетыФизическихЛицИПН.Период >= &ДатаКонтроля
		|	И ВЫБОР
		|			КОГДА ПрочиеВычетыФизическихЛицИПН.ДействуетПо = &ПустаяДата
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ПрочиеВычетыФизическихЛицИПН.ДействуетПо >= &Месяц
		|		КОНЕЦ
		|	И ПрочиеВычетыФизическихЛицИПН.Размер <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо,
		|	ПрочиеВычетыФизическихЛицИПН.ВидВычета,
		|	ДействуетС";
		
	КонецЕсли;
	
	ПрочиеВычетыВыборка = Запрос.Выполнить().Выбрать();
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЛьготыФизическихЛицИПН.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МАКСИМУМ(ЛьготыФизическихЛицИПН.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_МаксимумЛьготыФизическихЛицИПН
		|ИЗ
		|	РегистрСведений.ЛьготыФизическихЛицИПН КАК ЛьготыФизическихЛицИПН
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МестоПримененияВычетов КАК МестоПримененияВычетов
		|		ПО МестоПримененияВычетов.ФизическоеЛицо = ЛьготыФизическихЛицИПН.ФизическоеЛицо
		|ГДЕ
		|	ЛьготыФизическихЛицИПН.Период < &Месяц
		|	И ВЫБОР
		|			КОГДА ЛьготыФизическихЛицИПН.ДействуетДо = &ПустаяДата
		|				ТОГДА ЛьготыФизическихЛицИПН.ПредоставлятьЛьготу
		|			ИНАЧЕ ЛьготыФизическихЛицИПН.ДействуетДо >= &Месяц
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|   ЛьготыФизическихЛицИПН.ФизическоеЛицо
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛьготыФизическихЛицИПН.ФизическоеЛицо,
		|	ЛьготыФизическихЛицИПН.ПредоставлятьЛьготу
		|ИЗ
		|	РегистрСведений.ЛьготыФизическихЛицИПН КАК ЛьготыФизическихЛицИПН
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксимумЛьготыФизическихЛицИПН КАК МаксимумЛьготыФизическихЛицИПН
		|		ПО ЛьготыФизическихЛицИПН.Период = МаксимумЛьготыФизическихЛицИПН.Период
		|			И ЛьготыФизическихЛицИПН.ФизическоеЛицо = МаксимумЛьготыФизическихЛицИПН.ФизическоеЛицо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МестоПримененияВычетов КАК МестоПримененияВычетов
		|		ПО МестоПримененияВычетов.ФизическоеЛицо = ЛьготыФизическихЛицИПН.ФизическоеЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛьготыФизическихЛицИПН.ФизическоеЛицо";
	
	ЛьготыВыборка = Запрос.Выполнить().Выбрать();
	
	Если ЛьготыВыборка.Следующий() Тогда
		ИзменитьЛьготу = Истина;
	Иначе
		ИзменитьЛьготу = Ложь;
	КонецЕсли;

	Для каждого ФизическоеЛицо Из СписокФизическихЛиц Цикл
		
		ДанныеОВычетах = Новый Структура(
			"МесяцРегистрации,ФизическоеЛицо,Организация,
			|ИзменитьСтандартныйВычет, 
			|ИзменитьЛьготу,
			|ИзменитьПрочиеВычеты,ПрочиеВычеты");
		
		// Общие сведения для прекращения вычетов
		ДанныеОВычетах.МесяцРегистрации = МесяцРегистрации;
		ДанныеОВычетах.ФизическоеЛицо = ФизическоеЛицо;
		ДанныеОВычетах.Организация = Организация;
		
		СтруктураПоиска = Новый Структура("ФизическоеЛицо", ФизическоеЛицо);
		
		СтандартныеВычетыВыборка.Сбросить();
		Если СтандартныеВычетыВыборка.НайтиСледующий(СтруктураПоиска) Тогда
			ДанныеОВычетах.ИзменитьСтандартныйВычет = Истина;
		Иначе
			ДанныеОВычетах.ИзменитьСтандартныйВычет = Ложь;
		КонецЕсли;
		
		Если МесяцРегистрации >= '2018-01-01' Тогда
			
			ДанныеОВычетах.Вставить("Вычеты", ТаблицаВычеты);
			
			СтандартныеВычетыВыборка.Сбросить();
			Пока СтандартныеВычетыВыборка.НайтиСледующий(СтруктураПоиска) Цикл
			
				ЗаписьОВычетах = ТаблицаВычеты.Добавить();
				
				ЗаписьОВычетах.ФизическоеЛицо		= ФизическоеЛицо;
				ЗаписьОВычетах.МесяцРегистрации		= МесяцРегистрации;
				ЗаписьОВычетах.ВидВычета			= СтандартныеВычетыВыборка.ВидВычетаИПН;
				ЗаписьОВычетах.ПредоставлятьВычет	= Ложь;
			
			КонецЦикла;
			
		КонецЕсли;
		
		ПрочиеВычетыВыборка.Сбросить();
		Если ПрочиеВычетыВыборка.НайтиСледующий(СтруктураПоиска) Тогда
			ДанныеОВычетах.ИзменитьПрочиеВычеты = Истина;
		Иначе
			ДанныеОВычетах.ИзменитьПрочиеВычеты = Ложь;
		КонецЕсли;
		
		ПрочиеВычетыВыборка.Сбросить();
		Пока ПрочиеВычетыВыборка.НайтиСледующий(СтруктураПоиска) Цикл
					
			ЗаписьОПрочихВычетах = ТаблицаПрочиеВычеты.Добавить();
			
			ЗаписьОПрочихВычетах.ФизическоеЛицо		= ФизическоеЛицо;
			ЗаписьОПрочихВычетах.МесяцРегистрации	= МесяцРегистрации;
			ЗаписьОПрочихВычетах.ВидВычета			= ПрочиеВычетыВыборка.ВидВычетаИПН;
			ЗаписьОПрочихВычетах.Размер				= 0;
			ЗаписьОПрочихВычетах.ДействуетС			= ПрочиеВычетыВыборка.ДействуетС;
			
		КонецЦикла;
		
		ЛьготыВыборка.Сбросить();
		Если ЛьготыВыборка.НайтиСледующий(СтруктураПоиска) Тогда
			ДанныеОВычетах.ИзменитьЛьготу = Истина;
		Иначе
			ДанныеОВычетах.ИзменитьЛьготу = Ложь;
		КонецЕсли;
		
		ДанныеОВычетах.Вставить("ПрочиеВычеты", ТаблицаПрочиеВычеты);
		
		// Формирование движений
		Если ДанныеОВычетах.ИзменитьСтандартныйВычет
			ИЛИ ДанныеОВычетах.ИзменитьПрочиеВычеты
			ИЛИ ДанныеОВычетах.ИзменитьЛьготу Тогда
			
			СформироватьПрименениеСтандартныхВычетов(Движения, Отказ, ДанныеОВычетах, , Ложь);
			
			Если СписокФизическихЛиц.Количество() > 1 Тогда
				
				ТаблицаВычеты.Очистить();
				ТаблицаПрочиеВычеты.Очистить();
								
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// РАСЧЕТ НАЛОГОВ, ВЗНОСОВ И ОТЧИСЛЕНИЙ
////////////////////////////////////////////////////////////////////////////////

Процедура ПодготовитьДанныеДляРасчетаНалоговВзносов(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, Знач ПервыйМесяцНалоговогоПериода = Неопределено, Знач ПоследнийМесяцНалоговогоПериода = Неопределено, ИсключатьДоходыРегистратора = Истина) Экспорт
	
	
	ЗарплатаКадры.СоздатьПустуюВТ(МенеджерВременныхТаблиц, "РегистрНакопления.СведенияОДоходахФизическихЛиц");

	ЭтоРасчетПоДоходамТекущегоМесяца = ПервыйМесяцНалоговогоПериода = Неопределено Или ПоследнийМесяцНалоговогоПериода = Неопределено;
	
	Если ЭтоРасчетПоДоходамТекущегоМесяца Тогда

		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ПериодРегистрации",МесяцНачисления);
		Запрос.УстановитьПараметр("НачалоМесяцаРасчета",НачалоМесяца(МесяцНачисления));
		Запрос.УстановитьПараметр("КонецМесяцаРасчета",КонецМесяца(МесяцНачисления));
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	МАКСИМУМ(СведенияОДоходах.ПоследнийМесяцНалоговогоПериода) КАК ПоследнийМесяцНалоговогоПериода,
			|	МИНИМУМ(СведенияОДоходах.ПервыйМесяцНалоговогоПериода) КАК ПервыйМесяцНалоговогоПериода
			|ИЗ
			|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|		МАКСИМУМ(СведенияОДоходахФизическихЛицОбороты.Период) КАК ПоследнийМесяцНалоговогоПериода,
			|		МИНИМУМ(СведенияОДоходахФизическихЛицОбороты.Период) КАК ПервыйМесяцНалоговогоПериода
			|	ИЗ
			|		РегистрНакопления.СведенияОДоходахФизическихЛиц.Обороты(
			|				,
			|				,
			|				Месяц,
			|				Организация = &Организация
			|					И ПериодРегистрации = &ПериодРегистрации
			|					И ФизическоеЛицо В
			|						(ВЫБРАТЬ
			|							СписокСотрудников.ФизическоеЛицо
			|						ИЗ
			|							ВТФизическиеЛица КАК СписокСотрудников)) КАК СведенияОДоходахФизическихЛицОбороты
			|	
			|	ОБЪЕДИНИТЬ
			|	
			|	ВЫБРАТЬ
			|		МАКСИМУМ(СведенияОДоходах.Период),
			|		МИНИМУМ(СведенияОДоходах.Период)
			|	ИЗ
			|		ВТРегистрНакопления_СведенияОДоходахФизическихЛиц КАК СведенияОДоходах
			|	ГДЕ
			|		СведенияОДоходах.ПериодРегистрации МЕЖДУ &НачалоМесяцаРасчета И &КонецМесяцаРасчета
			|		И СведенияОДоходах.Организация = &Организация
			|		И СведенияОДоходах.ФизическоеЛицо В
			|				(ВЫБРАТЬ
			|					СписокСотрудников.ФизическоеЛицо
			|				ИЗ
			|					ВТФизическиеЛица КАК СписокСотрудников)
			|		И СведенияОДоходах.Активность) КАК СведенияОДоходах";		
		Выборка = Запрос.Выполнить().Выбрать();

		Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ПоследнийМесяцНалоговогоПериода) Тогда
			ПоследнийМесяцНалоговогоПериода = КонецМесяца(Выборка.ПоследнийМесяцНалоговогоПериода);
			ПервыйМесяцНалоговогоПериода = НачалоМесяца(Выборка.ПервыйМесяцНалоговогоПериода);
		Иначе
			ПоследнийМесяцНалоговогоПериода = КонецМесяца(МесяцНачисления);
			ПервыйМесяцНалоговогоПериода = НачалоМесяца(МесяцНачисления);
		КонецЕсли;
		
	КонецЕсли;

	// Таблица ВТДатыПоМесяцам: список налоговых периодов, в которых выполняется расчет.
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТПериоды(МенеджерВременныхТаблиц, НачалоГода(ПервыйМесяцНалоговогоПериода), НачалоМесяца(ПоследнийМесяцНалоговогоПериода),,,"ВТДатыПоМесяцам");
	
	// Таблица ВТПериодыПоГодам: список налоговых периодов (в виде даты начала года), в которых выполняется расчет.
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТПериоды(МенеджерВременныхТаблиц, НачалоГода(ПервыйМесяцНалоговогоПериода), НачалоГода(ПоследнийМесяцНалоговогоПериода), "ГОД", "НачалоНалоговогоПериода","ВТПериодыПоГодам");
	
	// Таблица ВТПериодыПоФизлицам
	СоздатьВТПериодыПоФизлицам(Организация, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет);
	
	//Таблица  ВТСтавкиНалоговВзносов:
	СоздатьВТСтавкиНалоговВзносовПоПериодам(Организация, МенеджерВременныхТаблиц);
	
	//Таблица  ВТСтавкиОСМС:
	СоздатьВТСтавкиОСМС(Организация, МенеджерВременныхТаблиц);

	// Таблица ВТСведенияОДоходах
	СоздатьВТСведенияОДоходах(Организация, Регистратор, МенеджерВременныхТаблиц, ПервыйМесяцНалоговогоПериода, ПоследнийМесяцНалоговогоПериода, ОкончательныйРасчет, ИсключатьДоходыРегистратора);
	
	// Таблица ВТРанееИсчисленныеНалогиВзносы
	СоздатьВТРанееИсчисленныеНалогиВзносы(Организация, Регистратор, МенеджерВременныхТаблиц, ПервыйМесяцНалоговогоПериода, ПоследнийМесяцНалоговогоПериода, ОкончательныйРасчет, ИсключатьДоходыРегистратора);
	
	// Таблица ВТРазмерыМЗППоПериодам
	СоздатьВТРазмерыМЗППоПериодам(МенеджерВременныхТаблиц);

	// Таблица ВТРазмерыМРППоПериодам
	СоздатьВТРазмерыМРППоПериодам(МенеджерВременныхТаблиц);

	// Таблица ВТНалогообложениеНачислений
	СоздатьВТНалогообложениеНачисленийПоПериодам(МенеджерВременныхТаблиц);
	
	// Таблица ВТСпособыОкругления
	СоздатьВТСпособыОкругления(Организация, МесяцНачисления, МенеджерВременныхТаблиц);
	
	// Получение кадровых данных физических лиц
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Если ВТСуществует(МенеджерВременныхТаблиц,"ВТВсеСотрудникиОрганизации") Тогда
		УничтожитьВТ = Новый Массив;
		УничтожитьВТ.Добавить("ВТСотрудникиОрганизации");
		ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	КонецЕсли;
	
	// ЗУПК в некоторых ситуациях таблица ВТОсновныеСотрудникиФизическихЛиц может быть создана раннее
	// в МенеджерРасчетаЗарплаты.ЗаполнитьОсновногоСотрудникаВТУдержаний с отличными периодами
	// удалим таблицу, если она существует и создадим новую с необходимым периодом 
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, "ВТОсновныеСотрудникиФизическихЛиц", Истина);
	Запрос.Текст = "ВЫБРАТЬ ФизическоеЛицо ИЗ ВТФизическиеЛица КАК ФизическиеЛица";
	Физлица = ОбщегоНазначения.ВыгрузитьКолонку(Запрос.Выполнить().Выгрузить(), "ФизическоеЛицо", Истина);
	КадровыйУчет.СоздатьВТОсновныеСотрудникиФизическихЛиц(МенеджерВременныхТаблиц, Истина, Физлица, Организация, НачалоМесяца(ПервыйМесяцНалоговогоПериода), КонецМесяца(ПоследнийМесяцНалоговогоПериода));
	ОписательТаблиц = КадровыйУчет.ОписаниеВременнойТаблицыОтборовСотрудников("ВТОсновныеСотрудникиФизическихЛиц");
	ЗапросКадровыеДанные = КадровыйУчет.ЗапросВТПостоянныеКадровыеДанныеСотрудников(Истина,	ОписательТаблиц, "ТекущееПодразделение,ДатаПриема,ДатаУвольнения",, "ВТКадровыеДанныеСотрудников");
	ЗапросКадровыеДанные.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросКадровыеДанные.Выполнить();

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода,
		|	ПериодыПоФизлицам.НачалоГодаНалоговогоПериода,
		|	ПериодыПоФизлицам.ФизическоеЛицо,
		|	КадровыеДанныеСотрудников.Сотрудник,
		|	ЕСТЬNULL(КадровыеДанныеСотрудников.ДатаПриема, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПриема,
		|	ЕСТЬNULL(КадровыеДанныеСотрудников.ДатаУвольнения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаУвольнения
		|ПОМЕСТИТЬ ВТКадровыеДанныеСотрудниковПоПериодам
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ПериодыПоФизлицам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|		ПО ПериодыПоФизлицам.ФизическоеЛицо = КадровыеДанныеСотрудников.ФизическоеЛицо
		|			И (НАЧАЛОПЕРИОДА(ПериодыПоФизлицам.МесяцНалоговогоПериода, МЕСЯЦ) >= НАЧАЛОПЕРИОДА(КадровыеДанныеСотрудников.ДатаПриема, МЕСЯЦ))
		|			И (ВЫБОР
		|				КОГДА КадровыеДанныеСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА НАЧАЛОПЕРИОДА(ПериодыПоФизлицам.МесяцНалоговогоПериода, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(КадровыеДанныеСотрудников.ДатаУвольнения, МЕСЯЦ)
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)";
	
	Запрос.Выполнить();
	
	// Получаем применение вычета в месяц отсутствия дохода
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(МесяцНачисления, Новый Структура("Организация", Организация));
	ПредоставлятьВычетВМесяцеОтсутствияДохода = Ложь;
	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		ПредоставлятьВычетВМесяцеОтсутствияДохода = УчетнаяПолитикаНУ[0].ПредоставлятьВычетВМесяцеОтсутствияДохода;
		//И ТипЗнч(Регистратор) = Тип("ДокументСсылка.НачислениеЗарплаты");
	КонецЕсли;
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		ПараметрыПолученияСотрудниковОрганизаций = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
		ПараметрыПолученияСотрудниковОрганизаций.Организация = Организация;
		ПараметрыПолученияСотрудниковОрганизаций.НачалоПериода = НачалоМесяца(МесяцНачисления);
		ПараметрыПолученияСотрудниковОрганизаций.ОкончаниеПериода = КонецМесяца(МесяцНачисления);
		ПараметрыПолученияСотрудниковОрганизаций.КадровыеДанные = "Подразделение";
		КадровыйУчет.СоздатьВТСотрудникиОрганизации(МенеджерВременныхТаблиц, Истина, ПараметрыПолученияСотрудниковОрганизаций, "ВТСотрудникиОрганизацииОбъединенная");
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиОрганизации.ФизическоеЛицо КАК ФизическоеЛицо,
		|	КадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
		|	СотрудникиОрганизации.Подразделение КАК Подразделение,
		|	НАЧАЛОПЕРИОДА(&МесяцНалоговогоПериода, МЕСЯЦ) КАК МесяцНалоговогоПериода,
		|	НАЧАЛОПЕРИОДА(&МесяцНалоговогоПериода, ГОД) КАК НачалоГодаНалоговогоПериода,
		|	ЕСТЬNULL(КадровыеДанныеСотрудников.ДатаПриема, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПриема,
		|	ЕСТЬNULL(КадровыеДанныеСотрудников.ДатаУвольнения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаУвольнения,
		|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя) КАК ВидДохода,
		|	0 КАК ОблагаемыйДоход,
		|	0 КАК НеоблагаемыйДоход
		|ПОМЕСТИТЬ ВТСотрудникиОрганизацииБезДохода
		|ИЗ
		|	ВТСотрудникиОрганизацииОбъединенная КАК СотрудникиОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|		ПО СотрудникиОрганизации.ФизическоеЛицо = КадровыеДанныеСотрудников.ФизическоеЛицо
		|			И (НАЧАЛОПЕРИОДА(&МесяцНалоговогоПериода, МЕСЯЦ) >= НАЧАЛОПЕРИОДА(КадровыеДанныеСотрудников.ДатаПриема, МЕСЯЦ))
		|			И (ВЫБОР
		|				КОГДА КадровыеДанныеСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА НАЧАЛОПЕРИОДА(&МесяцНалоговогоПериода, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(КадровыеДанныеСотрудников.ДатаУвольнения, МЕСЯЦ)
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|ГДЕ
		|	СотрудникиОрганизации.ФизическоеЛицо В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				Т1.ФизическоеЛицо
		|			ИЗ
		|				ВТФизическиеЛица КАК Т1
		|					ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыПоФизлицам КАК Т2
		|					ПО
		|						Т1.ФизическоеЛицо = Т2.ФизическоеЛицо
		|			ГДЕ
		|				Т2.ФизическоеЛицо ЕСТЬ NULL)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ПериодыПоФизлицам.НачалоГодаНалоговогоПериода КАК НачалоГодаНалоговогоПериода,
		|	ПериодыПоФизлицам.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТПериодыПоФизлицамОбъединенная
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ПериодыПоФизлицам
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТСотрудникиОрганизацииБезДохода.МесяцНалоговогоПериода,
		|	ВТСотрудникиОрганизацииБезДохода.НачалоГодаНалоговогоПериода,
		|	ВТСотрудникиОрганизацииБезДохода.ФизическоеЛицо
		|ИЗ
		|	ВТСотрудникиОрганизацииБезДохода КАК ВТСотрудникиОрганизацииБезДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КадровыеДанныеСотрудниковПоПериодам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	КадровыеДанныеСотрудниковПоПериодам.НачалоГодаНалоговогоПериода КАК НачалоГодаНалоговогоПериода,
		|	КадровыеДанныеСотрудниковПоПериодам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	КадровыеДанныеСотрудниковПоПериодам.Сотрудник КАК Сотрудник,
		|	КадровыеДанныеСотрудниковПоПериодам.ДатаПриема КАК ДатаПриема,
		|	КадровыеДанныеСотрудниковПоПериодам.ДатаУвольнения КАК ДатаУвольнения
		|ПОМЕСТИТЬ ВТКадровыеДанныеСотрудниковПоПериодамОбъединенная
		|ИЗ
		|	ВТКадровыеДанныеСотрудниковПоПериодам КАК КадровыеДанныеСотрудниковПоПериодам
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТСотрудникиОрганизацииБезДохода.МесяцНалоговогоПериода,
		|	ВТСотрудникиОрганизацииБезДохода.НачалоГодаНалоговогоПериода,
		|	ВТСотрудникиОрганизацииБезДохода.ФизическоеЛицо,
		|	ВТСотрудникиОрганизацииБезДохода.Сотрудник,
		|	ВТСотрудникиОрганизацииБезДохода.ДатаПриема,
		|	ВТСотрудникиОрганизацииБезДохода.ДатаУвольнения
		|ИЗ
		|	ВТСотрудникиОрганизацииБезДохода КАК ВТСотрудникиОрганизацииБезДохода";
		
		Запрос.УстановитьПараметр("МесяцНалоговогоПериода", МесяцНачисления);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.Выполнить();
		
		// Таблица ВТРанееИсчисленныеНалогиВзносыОбъедененная
		СоздатьВТРанееИсчисленныеНалогиВзносы(Организация, Регистратор, МенеджерВременныхТаблиц, ПервыйМесяцНалоговогоПериода, ПоследнийМесяцНалоговогоПериода, ОкончательныйРасчет, ИсключатьДоходыРегистратора, Истина);
		
	КонецЕсли;
	
	// Таблица ВТНакопленныеДанныеПоВычетам
	СоздатьВТНакопленныеДанныеПоВычетам(Организация, Регистратор, МенеджерВременныхТаблиц, ПервыйМесяцНалоговогоПериода, ПоследнийМесяцНалоговогоПериода, ОкончательныйРасчет, ИсключатьДоходыРегистратора, ПредоставлятьВычетВМесяцеОтсутствияДохода); 
	
КонецПроцедуры

Функция РезультатРасчетаОПВ(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты) Экспорт
	
	Если МесяцНачисления >= Дата(2021, 1, 1) Тогда
		ОПВ = РассчитатьОПВПосле2021(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	ИначеЕсли МесяцНачисления >= Дата(2020, 1, 1) Тогда
		ОПВ = РассчитатьОПВПосле2020(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	ИначеЕсли МесяцНачисления >= Дата(2019, 1, 1) Тогда
		ОПВ = РассчитатьОПВПосле2019(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	Иначе
		ОПВ = РассчитатьОПВДо2019(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	КонецЕсли;
	
	Возврат ДанныеОРезультатахРасчетаОПВДляДокумента(ОПВ)

КонецФункции

Функция РезультатРасчетаИПН(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты) Экспорт
	
	ИПН = РассчитатьИПН(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления,ОкончательныйРасчетЗарплаты);
	
	Возврат ДанныеОРезультатахРасчетаИПНДляДокумента(МесяцНачисления, ИПН)

КонецФункции

Функция РезультатРасчетаСО(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты) Экспорт
	
	Если МесяцНачисления >= Дата(2022, 1, 1) Тогда
		СО = РассчитатьСОПосле2022(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления,ОкончательныйРасчетЗарплаты);
	ИначеЕсли МесяцНачисления >= Дата(2021, 1, 1) Тогда
		СО = РассчитатьСОПосле2021(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления,ОкончательныйРасчетЗарплаты);
	ИначеЕсли МесяцНачисления >= Дата(2019, 1, 1) Тогда
		СО = РассчитатьСОПосле2019(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления,ОкончательныйРасчетЗарплаты);
	Иначе
		СО = РассчитатьСОДо2019(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления,ОкончательныйРасчетЗарплаты);
	КонецЕсли;
		
	Возврат ДанныеОРезультатахРасчетаСОДляДокумента(СО)

КонецФункции

Функция РезультатРасчетаСН(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты) Экспорт
	
   	Если МесяцНачисления >= Дата(2022, 1, 1) Тогда
		СН = РассчитатьСНПосле2022(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления,ОкончательныйРасчетЗарплаты);
   	ИначеЕсли МесяцНачисления >= Дата(2021, 1, 1) Тогда
		СН = РассчитатьСНПосле2021(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления,ОкончательныйРасчетЗарплаты);
    ИначеЕсли МесяцНачисления >= Дата(2020, 1, 1) Тогда
		СН = РассчитатьСНПосле2020(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления,ОкончательныйРасчетЗарплаты);
	ИначеЕсли МесяцНачисления >= Дата(2019, 1, 1) Тогда
		СН = РассчитатьСНПосле2019(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления,ОкончательныйРасчетЗарплаты);
	Иначе
		СН = РассчитатьСНДо2019(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления,ОкончательныйРасчетЗарплаты);
	КонецЕсли;
	
	Возврат ДанныеОРезультатахРасчетаСНДляДокумента(СН)

КонецФункции

Функция РезультатРасчетаОППВ(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты) Экспорт
	
	Если МесяцНачисления >= Дата(2019, 1, 1) Тогда
		ОППВ = РассчитатьОППВПосле2019(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	Иначе
		ОППВ = РассчитатьОППВДо2019(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	КонецЕсли;
	
	Возврат ДанныеОРезультатахРасчетаОППВДляДокумента(ОППВ)

КонецФункции

Функция РезультатРасчетаВОСМС(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты) Экспорт
	
    Если МесяцНачисления >= Дата(2022, 1, 1) Тогда

		ВОСМС = РассчитатьВОСМСПосле2022(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления,ОкончательныйРасчетЗарплаты);
        
    ИначеЕсли МесяцНачисления >= Дата(2021, 1, 1) Тогда

		ВОСМС = РассчитатьВОСМСПосле2021(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления,ОкончательныйРасчетЗарплаты);
        
    ИначеЕсли МесяцНачисления >= Дата(2020, 1, 1) Тогда

		ВОСМС = РассчитатьВОСМСПосле2020(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления,ОкончательныйРасчетЗарплаты);
		
	ИначеЕсли (МесяцНачисления >= Дата(2017, 7, 1) И МесяцНачисления < Дата(2018, 1, 1)) Тогда
		// С 1 июля 2017 года введено обязательное социальное медицинское страхование
		// С 1 января 2018 года уплата взносов ОСМС отложена до 2020 года
		ВОСМС = РассчитатьВОСМСДо2019(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления,ОкончательныйРасчетЗарплаты);
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДанныеОРезультатахРасчетаВОСМСДляДокумента(ВОСМС);

КонецФункции

Функция РезультатРасчетаООСМС(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты) Экспорт
	
   	Если МесяцНачисления >= Дата(2022, 1, 1) Тогда
		ООСМС = РассчитатьООСМСПосле2022(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления,ОкончательныйРасчетЗарплаты);
   	ИначеЕсли МесяцНачисления >= Дата(2021, 1, 1) Тогда
		ООСМС = РассчитатьООСМСПосле2021(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления,ОкончательныйРасчетЗарплаты);
    ИначеЕсли МесяцНачисления >= Дата(2020, 1, 1) Тогда
		ООСМС = РассчитатьООСМСПосле2020(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления,ОкончательныйРасчетЗарплаты);
	ИначеЕсли МесяцНачисления >= Дата(2019, 1, 1) Тогда
		ООСМС = РассчитатьООСМСПосле2019(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления,ОкончательныйРасчетЗарплаты);
	ИначеЕсли МесяцНачисления >= Дата(2017, 7, 1) Тогда
		// С 1 июля 2017 года введено обязательное социальное медицинское страхование
		ООСМС = РассчитатьООСМС(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления,ОкончательныйРасчетЗарплаты);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДанныеОРезультатахРасчетаООСМСДляДокумента(ООСМС)
		
КонецФункции

Функция КонтролируемыеПоляДляФиксацииРезультатов() Экспорт

	НалогиВзносыОтчисленияФиксРасчет = Новый Массив;
	НалогиВзносыОтчисленияФиксРасчет.Добавить("ОблагаемыйДоход");
	НалогиВзносыОтчисленияФиксРасчет.Добавить("НеоблагаемыйДоход");
	НалогиВзносыОтчисленияФиксРасчет.Добавить("НалогВзнос");
	НалогиВзносыОтчисленияФиксРасчет.Добавить("ОбъектИсчисления");
	НалогиВзносыОтчисленияФиксРасчет.Добавить("РазрешенныйВычет");
	НалогиВзносыОтчисленияФиксРасчет.Добавить("ПримененныйВычет");
	НалогиВзносыОтчисленияФиксРасчет.Добавить("ПримененнаяЛьгота");
	НалогиВзносыОтчисленияФиксРасчет.Добавить("ПрочиеВычеты");

	НалогиВзносыОтчисленияФиксСтрока = Новый Массив;
	НалогиВзносыОтчисленияФиксСтрока.Добавить("ФизическоеЛицо");
	НалогиВзносыОтчисленияФиксСтрока.Добавить("МесяцНалоговогоПериода");
	НалогиВзносыОтчисленияФиксСтрока.Добавить("Подразделение");
	НалогиВзносыОтчисленияФиксСтрока.Добавить("ВидДохода");
	НалогиВзносыОтчисленияФиксСтрока.Добавить("ВидНалогаВзносаОтчисления");
	
	Возврат Новый Структура("ФиксРасчет, ФиксСтрока", НалогиВзносыОтчисленияФиксРасчет, НалогиВзносыОтчисленияФиксСтрока)
	
КонецФункции

Функция КонтролируемыеПоляНеоблагаемыхДоходовДляФиксацииРезультатов() Экспорт
	
	ДоходыНеПодлежащиеНалогообложениюРасчет = Новый Массив;
	ДоходыНеПодлежащиеНалогообложениюРасчет.Добавить("СуммаДохода");
	ДоходыНеПодлежащиеНалогообложениюРасчет.Добавить("НеоблагаемыйДоход");

	ДоходыНеПодлежащиеНалогообложениюФиксСтрока = Новый Массив;
	ДоходыНеПодлежащиеНалогообложениюФиксСтрока.Добавить("ФизическоеЛицо");
	ДоходыНеПодлежащиеНалогообложениюФиксСтрока.Добавить("МесяцНалоговогоПериода");
	ДоходыНеПодлежащиеНалогообложениюФиксСтрока.Добавить("Подразделение");
	ДоходыНеПодлежащиеНалогообложениюФиксСтрока.Добавить("ДоходНеПодлежащийНалогообложению");
	ДоходыНеПодлежащиеНалогообложениюФиксСтрока.Добавить("ВидНалогаВзносаОтчисления");
	ДоходыНеПодлежащиеНалогообложениюФиксСтрока.Добавить("Начисление");
	
	Возврат Новый Структура("ФиксРасчет, ФиксСтрока", ДоходыНеПодлежащиеНалогообложениюРасчет, ДоходыНеПодлежащиеНалогообложениюФиксСтрока)
	
КонецФункции

// Возвращает максимальное значение идентификатора строки НалогиВзносыОтчисления.
//
// Параметры:
//		ТаблицаНалогиВзносыОтчисления - ДанныеФормыКоллекция
//
// Возвращаемое значение:
//		Число
//
Функция МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления(ТаблицаНалогиВзносыОтчисления) Экспорт
	
	МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления = 0;
	
	Для каждого СтрокаТаблицыНалогиВзносыОтчисления Из ТаблицаНалогиВзносыОтчисления Цикл
		
		Если МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления < СтрокаТаблицыНалогиВзносыОтчисления.ИдентификаторСтрокиНалогиВзносыОтчисления Тогда
			МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления = СтрокаТаблицыНалогиВзносыОтчисления.ИдентификаторСтрокиНалогиВзносыОтчисления;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления;
	
КонецФункции

// Назначает идентификаторы строкам таблицы значений НалогиВзносыОтчисления и строкам связанной 
// таблицы значений ВычетыИПН, перед добавление в
// коллекции строк табличных частей объектов.
//
// Параметры:
//		МаксимальныйИдентификаторСтрокиНДФЛ - Число
//		ТаблицаНалогиВзносыОтчисления - ТаблицаЗначений
//		ВычетыИПН - ТаблицаЗначений
//
Процедура НазначитьИдентификаторыНовымСтрокамТаблицамНалогиВзносыОтчисленияИВычетыИПН(Знач МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления, ТаблицаНалогиВзносыОтчисления, ВычетыИПН) Экспорт
	
	СоответствиеИдентификаторов = Новый Соответствие;
	Для каждого СтрокаТаблицыНалогиВзносыОтчисления Из ТаблицаНалогиВзносыОтчисления Цикл
		
		СоответствиеИдентификаторов.Вставить(СтрокаТаблицыНалогиВзносыОтчисления.ИдентификаторСтрокиНалогиВзносыОтчисления, МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления);
		СтрокаТаблицыНалогиВзносыОтчисления.ИдентификаторСтрокиНалогиВзносыОтчисления = МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления;
		МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления = МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления + 1;
		
	КонецЦикла;
	
	Для каждого СтрокаВычетыИПН Из ВычетыИПН Цикл
		
		ИдентификаторСтрокиНалогиВзносыОтчисления = СоответствиеИдентификаторов.Получить(СтрокаВычетыИПН.ИдентификаторСтрокиНалогиВзносыОтчисления);
		Если ИдентификаторСтрокиНалогиВзносыОтчисления <> Неопределено Тогда
			СтрокаВычетыИПН.ИдентификаторСтрокиНалогиВзносыОтчисления = ИдентификаторСтрокиНалогиВзносыОтчисления;
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьТаблицуНалогиВзносыОтчисления(ТаблицаИсточник, ТаблицаПриемник) Экспорт
	
	МаксимальныеИдентификатор = МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления(ТаблицаПриемник); 
	МаксимальныеИдентификатор = МаксимальныеИдентификатор + ?(ТаблицаПриемник.Количество() > 0, 1, 0);
		
	Для Каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл
		НоваяСтрока = ТаблицаПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыИсточник);
		НоваяСтрока.ИдентификаторСтрокиНалогиВзносыОтчисления = МаксимальныеИдентификатор;
		МаксимальныеИдентификатор = МаксимальныеИдентификатор + 1;		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОВЕДЕНИЕ И ФОРМИРОВАНИЕ ДВИЖЕНИЙ
////////////////////////////////////////////////////////////////////////////////

// Уточняет значение поля РегистрацияВНалоговомОргане в строке регистра.
// Параметры:
//		СтрокаДанных - срока набора записей учетного регистра, содержит поле РегистрацияВНалоговомОргане.
//      РегистрацияПодразделенияВНалоговомОргане - регистрация в НО, указанная в подразделении (возможно пустая).
//      РегистрацияОрганизацииВНалоговомОргане - регистрация в НО, указанная в организации.
//
Процедура ПроставитьРегистрациюВНалоговомОрганеВСтроке(СтрокаДанных, РегистрацияПодразделенияВНалоговомОргане, РегистрацияОрганизацииВНалоговомОргане) Экспорт
	СтрокаДанных.РегистрацияВНалоговомОргане = ?(ЗначениеЗаполнено(РегистрацияПодразделенияВНалоговомОргане), РегистрацияПодразделенияВНалоговомОргане, РегистрацияОрганизацииВНалоговомОргане);
КонецПроцедуры	

// Формирует строку движения по регистру СведенияОДоходахФизическихЛиц.
//
// Параметры:
//		СведенияОДоходахФизическихЛиц - набор записей регистра накопления СведенияОДоходахФизическихЛиц.
//		Организация
//		ДанныеДокумента - некоторая структура (строка таблицы значений, выборки из результата запроса и т.п.) 
//				с полями, соответствующими полям регистра (в структуре могут отсутствовать необязательные поля):
//					ФизическоеЛицо, с непустым значением
//					ПериодРегистрации, с непустым значением
//					МесяцНалоговогоПериода, с непустым значением
//					РегистрацияВНалоговомОргане
//					СуммаДохода
//					Начисление, с непустым значением
//					Подразделение, с непустым значением
//					Сотрудник
//
Функция СтрокаСведенийОДоходах(СведенияОДоходахФизическихЛиц, Организация, МесяцНачисления, ДанныеДокумента, ОкончательныйРасчет = Истина)
	
	НоваяСтрока = СведенияОДоходахФизическихЛиц.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеДокумента);
	НоваяСтрока.Организация = Организация;
	НоваяСтрока.Период = ДанныеДокумента.МесяцНалоговогоПериода;
	НоваяСтрока.ДанныеМежрасчетногоПериода = Не ОкончательныйРасчет;
	
	Возврат НоваяСтрока
	
КонецФункции

Функция ПолучитьБазуДляРасчетаНалоговВзносов(Организация, ПериодРегистрации, ФизическиеЛицаМассив, ВидДохода = Неопределено)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.Сотрудник КАК Сотрудник,
		|	СведенияОДоходах.Подразделение КАК Подразделение,
		|	СУММА(СведенияОДоходах.СуммаДохода) КАК Сумма,
		|	СведенияОДоходах.Период КАК МесяцНалоговогоПериода,
		|	СведенияОДоходах.Начисление КАК Начисление
		|ПОМЕСТИТЬ ВТСведенияОДоходах
		|ИЗ
		|	РегистрНакопления.СведенияОДоходахФизическихЛиц КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Организация = &Организация
		|	И СведенияОДоходах.ПериодРегистрации = &ПериодРегистрации
		|	И СведенияОДоходах.ФизическоеЛицо В(&ФизическиеЛица)
		|	И СведенияОДоходах.Активность
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Сотрудник,
		|	СведенияОДоходах.Подразделение,
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.Начисление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(НалогообложениеНачислений.Период) КАК Период,
		|	НалогообложениеНачислений.Начисление КАК Начисление,
		|	ВТСведенияОДоходах.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТПериодыНалогообложения
		|ИЗ
		|	ВТСведенияОДоходах КАК ВТСведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений КАК НалогообложениеНачислений
		|		ПО ВТСведенияОДоходах.МесяцНалоговогоПериода >= НалогообложениеНачислений.Период
		|			И ВТСведенияОДоходах.Начисление = НалогообложениеНачислений.Начисление
		|
		|СГРУППИРОВАТЬ ПО
		|	НалогообложениеНачислений.Начисление,
		|	ВТСведенияОДоходах.МесяцНалоговогоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПериодыНалогообложения.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ВТПериодыНалогообложения.Начисление КАК Начисление,
		|	НалогообложениеНачислений.ВидДохода КАК ВидДохода,
		|	НалогообложениеНачислений.СпособОбложенияИПН КАК СпособОбложенияИПН,
		|	НалогообложениеНачислений.СпособОбложенияОПВ КАК СпособОбложенияОПВ,
		|	НалогообложениеНачислений.СпособОбложенияВОСМС КАК СпособОбложенияВОСМС
		|ПОМЕСТИТЬ ВТНалогообложениеНачислений
		|ИЗ
		|	ВТПериодыНалогообложения КАК ВТПериодыНалогообложения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений КАК НалогообложениеНачислений
		|		ПО ВТПериодыНалогообложения.Период = НалогообложениеНачислений.Период
		|			И ВТПериодыНалогообложения.Начисление = НалогообложениеНачислений.Начисление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТСведенияОДоходах.Сотрудник КАК Сотрудник,
		|	ВТСведенияОДоходах.Подразделение КАК Подразделение,
		|	ВТНалогообложениеНачислений.ВидДохода КАК ВидДохода,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТНалогообложениеНачислений.СпособОбложенияИПН, ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)) <> ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
		|				ТОГДА ВТСведенияОДоходах.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Сумма
		|ИЗ
		|	ВТСведенияОДоходах КАК ВТСведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогообложениеНачислений КАК ВТНалогообложениеНачислений
		|		ПО ВТСведенияОДоходах.МесяцНалоговогоПериода = ВТНалогообложениеНачислений.МесяцНалоговогоПериода
		|			И ВТСведенияОДоходах.Начисление = ВТНалогообложениеНачислений.Начисление
		|ГДЕ
		|	ВТНалогообложениеНачислений.ВидДохода ЕСТЬ NULL
		|	ИЛИ ВТНалогообложениеНачислений.ВидДохода = &ВидДохода
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСведенияОДоходах.ФизическоеЛицо,
		|	ВТСведенияОДоходах.Сотрудник,
		|	ВТСведенияОДоходах.Подразделение,
		|	ВТНалогообложениеНачислений.ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТСведенияОДоходах.Сотрудник КАК Сотрудник,
		|	ВТСведенияОДоходах.Подразделение КАК Подразделение,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТНалогообложениеНачислений.СпособОбложенияОПВ, ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)) <> ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
		|				ТОГДА ВТСведенияОДоходах.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Сумма,
		|	ВТНалогообложениеНачислений.ВидДохода КАК ВидДохода
		|ИЗ
		|	ВТСведенияОДоходах КАК ВТСведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогообложениеНачислений КАК ВТНалогообложениеНачислений
		|		ПО ВТСведенияОДоходах.МесяцНалоговогоПериода = ВТНалогообложениеНачислений.МесяцНалоговогоПериода
		|			И ВТСведенияОДоходах.Начисление = ВТНалогообложениеНачислений.Начисление
		|ГДЕ
		|	ВТНалогообложениеНачислений.ВидДохода ЕСТЬ NULL
		|	ИЛИ ВТНалогообложениеНачислений.ВидДохода = &ВидДохода
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСведенияОДоходах.ФизическоеЛицо,
		|	ВТСведенияОДоходах.Сотрудник,
		|	ВТСведенияОДоходах.Подразделение,
		|	ВТНалогообложениеНачислений.ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТСведенияОДоходах.Сотрудник КАК Сотрудник,
		|	ВТСведенияОДоходах.Подразделение КАК Подразделение,
		|	ВТНалогообложениеНачислений.ВидДохода КАК ВидДохода,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТНалогообложениеНачислений.СпособОбложенияВОСМС, ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)) <> ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
		|				ТОГДА ВТСведенияОДоходах.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Сумма
		|ИЗ
		|	ВТСведенияОДоходах КАК ВТСведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогообложениеНачислений КАК ВТНалогообложениеНачислений
		|		ПО ВТСведенияОДоходах.МесяцНалоговогоПериода = ВТНалогообложениеНачислений.МесяцНалоговогоПериода
		|			И ВТСведенияОДоходах.Начисление = ВТНалогообложениеНачислений.Начисление
		|ГДЕ
		|	ВТНалогообложениеНачислений.ВидДохода ЕСТЬ NULL
		|	ИЛИ ВТНалогообложениеНачислений.ВидДохода = &ВидДохода
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСведенияОДоходах.ФизическоеЛицо,
		|	ВТСведенияОДоходах.Сотрудник,
		|	ВТСведенияОДоходах.Подразделение,
		|	ВТНалогообложениеНачислений.ВидДохода";
		
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("ФизическиеЛица", ФизическиеЛицаМассив);
	
	Если ВидДохода = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИЛИ ВТНалогообложениеНачислений.ВидДохода = &ВидДохода", "ИЛИ ИСТИНА");
	Иначе
		Запрос.УстановитьПараметр("ВидДохода", ВидДохода);
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();
	ВсегоРезультатов = Результат.Количество();

	БазаРасчетаИПН = Результат[ВсегоРезультатов-3].Выгрузить();
	БазаРасчетаОПВ = Результат[ВсегоРезультатов-2].Выгрузить();
	БазаРасчетаВОСМС = Результат[ВсегоРезультатов-1].Выгрузить();
	
	Возврат Новый Структура("БазаРасчетаИПН, БазаРасчетаОПВ, БазаРасчетаВОСМС", БазаРасчетаИПН, БазаРасчетаОПВ, БазаРасчетаВОСМС);
	
КонецФункции

Функция НалогиВзносыОтчисленияПоСотрудникам(ИсходныеДанные, БазаРаспределения, Точность = 2)
	
	НалогиВзносыОтчисленияПоСотрудникам = Новый ТаблицаЗначений;
	НалогиВзносыОтчисленияПоСотрудникам.Колонки.Добавить("Организация");
	НалогиВзносыОтчисленияПоСотрудникам.Колонки.Добавить("ФизическоеЛицо");
	НалогиВзносыОтчисленияПоСотрудникам.Колонки.Добавить("Сотрудник");
	НалогиВзносыОтчисленияПоСотрудникам.Колонки.Добавить("Подразделение");
	НалогиВзносыОтчисленияПоСотрудникам.Колонки.Добавить("Начисление");
	НалогиВзносыОтчисленияПоСотрудникам.Колонки.Добавить("Сумма");
	
	ИсходныеДанные.Сортировать("ФизическоеЛицо, Подразделение");
	
	СтруктураПоиска = Новый Структура("ФизическоеЛицо, Подразделение"); 
	Для Каждого СтрокаДанных Из ИсходныеДанные Цикл
		
		Если СтрокаДанных.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска.ФизическоеЛицо = СтрокаДанных.ФизическоеЛицо;
		СтруктураПоиска.Подразделение = СтрокаДанных.Подразделение;
		НайденныеСтроки = БазаРаспределения.НайтиСтроки(СтруктураПоиска);
		КоэффициентыРаспределения = ОбщегоНазначения.ВыгрузитьКолонку(НайденныеСтроки, "База");
			
			
		РезультатРаспределения = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СтрокаДанных.Сумма, КоэффициентыРаспределения, Точность);
		Если РезультатРаспределения = Неопределено Тогда
			НоваяСтрока = НалогиВзносыОтчисленияПоСотрудникам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
		Иначе
			Индекс = 0;
			Для Каждого СтрокаБазы Из НайденныеСтроки Цикл
				НоваяСтрока = НалогиВзносыОтчисленияПоСотрудникам.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаБазы);
				НоваяСтрока.Сумма = РезультатРаспределения[Индекс];
				Индекс = Индекс + 1;
			КонецЦикла;
		КонецЕсли;

	КонецЦикла;
	
	Возврат НалогиВзносыОтчисленияПоСотрудникам;
	
КонецФункции

Функция ДанныеОРезультатахРасчетаОПВДляДокумента(ОПВ) Экспорт

	ВидНалогаВзноса = Перечисления.ВидыНалоговВзносовОтчислений.ОПВ;
	
	// Приводим таблицу к структуре, соответствующей документам расчета.
	ОПВ.Колонки.Добавить("НалогВзнос", Новый ОписаниеТипов("Число"));
	ОПВ.Колонки.Добавить("ОбъектИсчисления", Новый ОписаниеТипов("Число"));
	ОПВ.Колонки.Добавить("ВидНалогаВзносаОтчисления", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалоговВзносовОтчислений"));
	
	Для Каждого СтрокаОПВ Из ОПВ Цикл
		СтрокаОПВ.НалогВзнос = СтрокаОПВ.ИсчисленныеОПВ;
		СтрокаОПВ.ОбъектИсчисления = СтрокаОПВ.ОбъектИсчисленияОПВ;
		СтрокаОПВ.ВидНалогаВзносаОтчисления = ВидНалогаВзноса;
	КонецЦикла;
	
	Возврат Новый Структура("ОПВ", ОПВ);

КонецФункции

Функция ДанныеОРезультатахРасчетаИПНДляДокумента(МесяцНачисления, ИПН) Экспорт

	Если МесяцНачисления >= Дата(2018,1,1) Тогда
		ДанныеОРезультатах = ДанныеОРезультатахРасчетаИПНДляДокументаПосле2018(ИПН);
	Иначе 
		ДанныеОРезультатах = ДанныеОРезультатахРасчетаИПНДляДокументаДо2018(ИПН);
	КонецЕсли;

	Возврат ДанныеОРезультатах;

КонецФункции

Функция ДанныеОРезультатахРасчетаИПНДляДокументаДо2018(ИПН) 

	ВидНалогаВзноса = Перечисления.ВидыНалоговВзносовОтчислений.ИПН;
	
	// Приводим таблицу к структуре, соответствующей документам расчета.
	ИПН.Колонки.Добавить("ИдентификаторСтрокиНалогиВзносыОтчисления", Новый ОписаниеТипов("Число"));
	ИПН.Колонки.Добавить("НалогВзнос", Новый ОписаниеТипов("Число"));
	ИПН.Колонки.Добавить("ОбъектИсчисления", Новый ОписаниеТипов("Число"));
	ИПН.Колонки.Добавить("ВидНалогаВзносаОтчисления", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалоговВзносовОтчислений"));
	
	Для Каждого СтрокаИПН Из ИПН Цикл
		СтрокаИПН.ИдентификаторСтрокиНалогиВзносыОтчисления = ИПН.Индекс(СтрокаИПН);
		СтрокаИПН.НалогВзнос = СтрокаИПН.ИсчисленныйИПН;
		СтрокаИПН.ОбъектИсчисления = СтрокаИПН.ОбъектИсчисленияИПН;
		СтрокаИПН.ВидНалогаВзносаОтчисления = ВидНалогаВзноса;
	КонецЦикла;
	
	ВычетыИПН = Новый ТаблицаЗначений;
	ВычетыИПН.Колонки.Добавить("ИдентификаторСтрокиНалогиВзносыОтчисления", Новый ОписаниеТипов("Число"));
	ВычетыИПН.Колонки.Добавить("ВидВычетаИПН", Новый ОписаниеТипов("СправочникСсылка.ВидыВычетовИПН"));
	ВычетыИПН.Колонки.Добавить("РазрешенныйВычет", Новый ОписаниеТипов("Число"));
	ВычетыИПН.Колонки.Добавить("ПримененныйВычет", Новый ОписаниеТипов("Число"));
	
	Возврат Новый Структура("ИПН, ВычетыИПН", ИПН, ВычетыИПН);

КонецФункции

Функция ДанныеОРезультатахРасчетаИПНДляДокументаПосле2018(ИПН) 
	
	// Надо разделить вычеты и ИПН
	
	ВидНалогаВзноса = Перечисления.ВидыНалоговВзносовОтчислений.ИПН;

	// Приводим таблицу к структуре, соответствующей документам расчета.
	ИПН.Колонки.Добавить("ИдентификаторСтрокиНалогиВзносыОтчисления", Новый ОписаниеТипов("Число"));
	ИПН.Колонки.Добавить("НалогВзнос", Новый ОписаниеТипов("Число"));
	ИПН.Колонки.Добавить("ОбъектИсчисления", Новый ОписаниеТипов("Число"));
	ИПН.Колонки.Добавить("ВидНалогаВзносаОтчисления", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалоговВзносовОтчислений"));
	
	Для Каждого СтрокаИПН Из ИПН Цикл
		СтрокаИПН.НалогВзнос = СтрокаИПН.ИсчисленныйИПН;
		СтрокаИПН.ОбъектИсчисления = СтрокаИПН.ОбъектИсчисленияИПН;
		СтрокаИПН.ВидНалогаВзносаОтчисления = ВидНалогаВзноса;
	КонецЦикла;
	
	ВычетыИПН = Новый ТаблицаЗначений;
	ВычетыИПН.Колонки.Добавить("ИдентификаторСтрокиНалогиВзносыОтчисления", Новый ОписаниеТипов("Число"));
	ВычетыИПН.Колонки.Добавить("ВидВычетаИПН", Новый ОписаниеТипов("СправочникСсылка.ВидыВычетовИПН"));
	ВычетыИПН.Колонки.Добавить("РазрешенныйВычет", Новый ОписаниеТипов("Число"));
	ВычетыИПН.Колонки.Добавить("ПримененныйВычет", Новый ОписаниеТипов("Число"));
	
	// Определяем соответствие видов вычетов полям таблицы.
	ВидыВычетов = ВидыВычетовПоПолямТаблицы(ИПН.СкопироватьКолонки());
	
	// Заполняем таблицу ВычетыИПН: 
	// для каждой строки ИПН добавляем столько отдельных строк, сколько вычетов было применено.
	Для Каждого СтрокаИПН Из ИПН Цикл
		СтрокаИПН.ИдентификаторСтрокиНалогиВзносыОтчисления = ИПН.Индекс(СтрокаИПН);
		Для Каждого КлючПоля Из ВидыВычетов Цикл
			Если СтрокаИПН["РазрешенныйВычет" + КлючПоля] <> 0 
				ИЛИ СтрокаИПН["ПримененныйВычет" + КлючПоля] <> 0 Тогда
				СтрокаВычетов = ВычетыИПН.Добавить();
				СтрокаВычетов.ИдентификаторСтрокиНалогиВзносыОтчисления = СтрокаИПН.ИдентификаторСтрокиНалогиВзносыОтчисления;
				СтрокаВычетов.ВидВычетаИПН = СтрокаИПН["ВидВычета" + КлючПоля];
				СтрокаВычетов.РазрешенныйВычет = СтрокаИПН["РазрешенныйВычет" + КлючПоля];
				СтрокаВычетов.ПримененныйВычет = СтрокаИПН["ПримененныйВычет" + КлючПоля];
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Новый Структура("ИПН, ВычетыИПН", ИПН, ВычетыИПН);

КонецФункции

Функция ДанныеОРезультатахРасчетаСОДляДокумента(СО) Экспорт

	ВидНалогаВзноса = Перечисления.ВидыНалоговВзносовОтчислений.СО;
	
	// Приводим таблицу к структуре, соответствующей документам расчета.
	СО.Колонки.Добавить("НалогВзнос", Новый ОписаниеТипов("Число"));
	СО.Колонки.Добавить("ОбъектИсчисления", Новый ОписаниеТипов("Число"));
	СО.Колонки.Добавить("ВидНалогаВзносаОтчисления", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалоговВзносовОтчислений"));
	
	Для Каждого СтрокаСО Из СО Цикл
		СтрокаСО.НалогВзнос = СтрокаСО.ИсчисленныеСО;
		СтрокаСО.ОбъектИсчисления = СтрокаСО.ОбъектИсчисленияСО;
		СтрокаСО.ВидНалогаВзносаОтчисления = ВидНалогаВзноса;
	КонецЦикла;
	
	Возврат Новый Структура("СО", СО);

КонецФункции

Функция ДанныеОРезультатахРасчетаСНДляДокумента(СН) Экспорт

	ВидНалогаВзноса = Перечисления.ВидыНалоговВзносовОтчислений.СН;
	
	// Приводим таблицу к структуре, соответствующей документам расчета.
	СН.Колонки.Добавить("НалогВзнос", Новый ОписаниеТипов("Число"));
	СН.Колонки.Добавить("ОбъектИсчисления", Новый ОписаниеТипов("Число"));
	СН.Колонки.Добавить("ВидНалогаВзносаОтчисления", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалоговВзносовОтчислений"));
	
	Для Каждого СтрокаСН Из СН Цикл
		СтрокаСН.НалогВзнос = СтрокаСН.ИсчисленныйСН;
		СтрокаСН.ОбъектИсчисления = СтрокаСН.ОбъектИсчисленияСН;
		СтрокаСН.ВидНалогаВзносаОтчисления = ВидНалогаВзноса;
	КонецЦикла;
	
	Возврат Новый Структура("СН", СН);

КонецФункции

Функция ДанныеОРезультатахРасчетаОППВДляДокумента(ОППВ) Экспорт

	ВидНалогаВзноса = Перечисления.ВидыНалоговВзносовОтчислений.ОППВ;
	
	// Приводим таблицу к структуре, соответствующей документам расчета.
	ОППВ.Колонки.Добавить("НалогВзнос", Новый ОписаниеТипов("Число"));
	ОППВ.Колонки.Добавить("ОбъектИсчисления", Новый ОписаниеТипов("Число"));
	ОППВ.Колонки.Добавить("ВидНалогаВзносаОтчисления", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалоговВзносовОтчислений"));
	
	Для Каждого СтрокаОППВ Из ОППВ Цикл
		СтрокаОППВ.НалогВзнос = СтрокаОППВ.ИсчисленныеОППВ;
		СтрокаОППВ.ОбъектИсчисления = СтрокаОППВ.ОбъектИсчисленияОППВ;
		СтрокаОППВ.ВидНалогаВзносаОтчисления = ВидНалогаВзноса;
	КонецЦикла;
	
	Возврат Новый Структура("ОППВ", ОППВ);

КонецФункции

Функция ДанныеОРезультатахРасчетаВОСМСДляДокумента(ВОСМС) Экспорт

	ВидНалогаВзноса = Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС;
	
	// Приводим таблицу к структуре, соответствующей документам расчета.
	ВОСМС.Колонки.Добавить("НалогВзнос", Новый ОписаниеТипов("Число"));
	ВОСМС.Колонки.Добавить("ОбъектИсчисления", Новый ОписаниеТипов("Число"));
	ВОСМС.Колонки.Добавить("ВидНалогаВзносаОтчисления", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалоговВзносовОтчислений"));
	
	Для Каждого СтрокаВОСМС Из ВОСМС Цикл
		СтрокаВОСМС.НалогВзнос = СтрокаВОСМС.ИсчисленныеВОСМС;
		СтрокаВОСМС.ОбъектИсчисления = СтрокаВОСМС.ОбъектИсчисленияВОСМС;
		СтрокаВОСМС.ВидНалогаВзносаОтчисления = ВидНалогаВзноса;
	КонецЦикла;
	
	Возврат Новый Структура("ВОСМС", ВОСМС);

КонецФункции

Функция ДанныеОРезультатахРасчетаООСМСДляДокумента(ООСМС) Экспорт

	ВидНалогаВзноса = Перечисления.ВидыНалоговВзносовОтчислений.ООСМС;
	
	// Приводим таблицу к структуре, соответствующей документам расчета.
	ООСМС.Колонки.Добавить("НалогВзнос", Новый ОписаниеТипов("Число"));
	ООСМС.Колонки.Добавить("ОбъектИсчисления", Новый ОписаниеТипов("Число"));
	ООСМС.Колонки.Добавить("ВидНалогаВзносаОтчисления", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалоговВзносовОтчислений"));
	
	Для Каждого СтрокаООСМС Из ООСМС Цикл
		СтрокаООСМС.НалогВзнос = СтрокаООСМС.ИсчисленныеООСМС;
		СтрокаООСМС.ОбъектИсчисления = СтрокаООСМС.ОбъектИсчисленияООСМС;
		СтрокаООСМС.ВидНалогаВзносаОтчисления = ВидНалогаВзноса;
	КонецЦикла;
	
	Возврат Новый Структура("ООСМС", ООСМС);

КонецФункции

Функция РассчитатьНеоблагаемыеДоходы(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(МесяцНачисления));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", Регистратор);
	Запрос.УстановитьПараметр("ОкончательныйРасчет", ОкончательныйРасчет);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(СведенияОНеоблагаемыхДоходах.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
		|	СведенияОНеоблагаемыхДоходах.ПериодРегистрации,
		|	СведенияОНеоблагаемыхДоходах.Подразделение,
		|	СведенияОНеоблагаемыхДоходах.ФизическоеЛицо,
		|	СведенияОНеоблагаемыхДоходах.Начисление,
		|	СведенияОНеоблагаемыхДоходах.ВидНалогаВзносаОтчисления,
		|	СведенияОНеоблагаемыхДоходах.ДоходНеПодлежащийНалогообложению,
		|	СУММА(СведенияОНеоблагаемыхДоходах.СуммаДоходаОборот) КАК СуммаДохода,
		|	СУММА(СведенияОНеоблагаемыхДоходах.НеоблагаемыйДоходОборот) КАК НеоблагаемыйДоход
		|ПОМЕСТИТЬ ВТСведенияОНеоблагаемыхЧастичноДоходахРанееИсчисленные
		|ИЗ
		|	РегистрНакопления.СведенияОНеоблагаемыхДоходахФизическихЛиц.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			Организация = &Организация
		|				И ФизическоеЛицо В
		|					(ВЫБРАТЬ
		|						СписокСотрудников.ФизическоеЛицо
		|					ИЗ
		|						ВТФизическиеЛица КАК СписокСотрудников)
		|				И &ОкончательныйРасчетДоходы) КАК СведенияОНеоблагаемыхДоходах
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериодыПоФизлицам КАК ПериодыПоФизлицам
		|		ПО (НАЧАЛОПЕРИОДА(СведенияОНеоблагаемыхДоходах.Период, ГОД) = НАЧАЛОПЕРИОДА(ПериодыПоФизлицам.МесяцНалоговогоПериода, ГОД))
		|			И СведенияОНеоблагаемыхДоходах.ФизическоеЛицо = ПериодыПоФизлицам.ФизическоеЛицо
		|ГДЕ
		|	СведенияОНеоблагаемыхДоходах.Регистратор <> &ИсключаемыйРегистратор
		|	И СведенияОНеоблагаемыхДоходах.ПериодРегистрации <= &ПериодРегистрации
		|	И (ВЫБОР
		|		КОГДА &ОкончательныйРасчет 
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ СведенияОНеоблагаемыхДоходах.ВидНалогаВзносаОтчисления В (ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН), ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОПВ), ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС))
		|	КОНЕЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОНеоблагаемыхДоходах.ПериодРегистрации,
		|	СведенияОНеоблагаемыхДоходах.Подразделение,
		|	СведенияОНеоблагаемыхДоходах.ФизическоеЛицо,
		|	СведенияОНеоблагаемыхДоходах.Начисление,
		|	СведенияОНеоблагаемыхДоходах.ВидНалогаВзносаОтчисления,
		|	СведенияОНеоблагаемыхДоходах.ДоходНеПодлежащийНалогообложению,
		|	НАЧАЛОПЕРИОДА(СведенияОНеоблагаемыхДоходах.Период, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОДоходах.МесяцНалоговогоПериода,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Подразделение,
		|	СведенияОДоходах.Начисление,
		|	СведенияОДоходах.СуммаДохода,
		|	ЕСТЬNULL(НалогообложениеНачислений.СпособОбложенияОПВ, ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ПустаяСсылка)) КАК СпособОбложенияОПВ,
		|	ЕСТЬNULL(НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюОПВ, ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)) КАК ДоходНеПодлежащийНалогообложениюОПВ,
		|	ЕСТЬNULL(НалогообложениеНачислений.СпособОбложенияИПН, ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ПустаяСсылка)) КАК СпособОбложенияИПН,
		|	ЕСТЬNULL(НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюИПН, ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)) КАК ДоходНеПодлежащийНалогообложениюИПН,
		|	ЕСТЬNULL(НалогообложениеНачислений.СпособОбложенияСО, ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ПустаяСсылка)) КАК СпособОбложенияСО,
		|	ЕСТЬNULL(НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюСО, ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)) КАК ДоходНеПодлежащийНалогообложениюСО,
		|	ЕСТЬNULL(НалогообложениеНачислений.СпособОбложенияСН, ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ПустаяСсылка)) КАК СпособОбложенияСН,
		|	ЕСТЬNULL(НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюСН, ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)) КАК ДоходНеПодлежащийНалогообложениюСН,
		|	ЕСТЬNULL(НалогообложениеНачислений.СпособОбложенияОППВ, ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ПустаяСсылка)) КАК СпособОбложенияОППВ,
		|	ЕСТЬNULL(НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюОППВ, ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)) КАК ДоходНеПодлежащийНалогообложениюОППВ,
		|	ЕСТЬNULL(НалогообложениеНачислений.СпособОбложенияВОСМС, ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ПустаяСсылка)) КАК СпособОбложенияВОСМС,
		|	ЕСТЬNULL(НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюВОСМС, ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)) КАК ДоходНеПодлежащийНалогообложениюВОСМС,
		|	ЕСТЬNULL(НалогообложениеНачислений.СпособОбложенияООСМС, ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ПустаяСсылка)) КАК СпособОбложенияООСМС,
		|	ЕСТЬNULL(НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюООСМС, ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)) КАК ДоходНеПодлежащийНалогообложениюООСМС
		|ПОМЕСТИТЬ ВТПорядокОбложенияНачислений
		|ИЗ
		|	ВТСведенияОДоходах КАК СведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогообложениеНачислений КАК НалогообложениеНачислений
		|		ПО СведенияОДоходах.Начисление = НалогообложениеНачислений.Начисление
		|			И СведенияОДоходах.МесяцНалоговогоПериода = НалогообложениеНачислений.МесяцНалоговогоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПорядокОбложенияНачислений.МесяцНалоговогоПериода,
		|	ВТПорядокОбложенияНачислений.ФизическоеЛицо,
		|	ВТПорядокОбложенияНачислений.Подразделение,
		|	ВТПорядокОбложенияНачислений.Начисление,
		|	ВТПорядокОбложенияНачислений.СуммаДохода,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОПВ) КАК ВидНалогаВзносаОтчисления,
		|	ВЫБОР
		|		КОГДА ВТПорядокОбложенияНачислений.СпособОбложенияОПВ = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично)
		|			ТОГДА ВТПорядокОбложенияНачислений.ДоходНеПодлежащийНалогообложениюОПВ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)
		|	КОНЕЦ КАК ДоходНеПодлежащийНалогообложению
		|ПОМЕСТИТЬ ВТДоходыНеоблагаемые
		|ИЗ
		|	ВТПорядокОбложенияНачислений КАК ВТПорядокОбложенияНачислений
		|ГДЕ
		|	ВТПорядокОбложенияНачислений.СпособОбложенияОПВ = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично)
		|	ИЛИ ВТПорядокОбложенияНачислений.СпособОбложенияОПВ = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТПорядокОбложенияНачислений.МесяцНалоговогоПериода,
		|	ВТПорядокОбложенияНачислений.ФизическоеЛицо,
		|	ВТПорядокОбложенияНачислений.Подразделение,
		|	ВТПорядокОбложенияНачислений.Начисление,
		|	ВТПорядокОбложенияНачислений.СуммаДохода,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН),
		|	ВЫБОР
		|		КОГДА ВТПорядокОбложенияНачислений.СпособОбложенияИПН = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично)
		|			ТОГДА ВТПорядокОбложенияНачислений.ДоходНеПодлежащийНалогообложениюИПН
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)
		|	КОНЕЦ
		|ИЗ
		|	ВТПорядокОбложенияНачислений КАК ВТПорядокОбложенияНачислений
		|ГДЕ
		|	ВТПорядокОбложенияНачислений.СпособОбложенияИПН = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично)
		|	ИЛИ ВТПорядокОбложенияНачислений.СпособОбложенияИПН = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТПорядокОбложенияНачислений.МесяцНалоговогоПериода,
		|	ВТПорядокОбложенияНачислений.ФизическоеЛицо,
		|	ВТПорядокОбложенияНачислений.Подразделение,
		|	ВТПорядокОбложенияНачислений.Начисление,
		|	ВТПорядокОбложенияНачислений.СуммаДохода,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СО),
		|	ВЫБОР
		|		КОГДА ВТПорядокОбложенияНачислений.СпособОбложенияСО = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично)
		|			ТОГДА ВТПорядокОбложенияНачислений.ДоходНеПодлежащийНалогообложениюСО
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)
		|	КОНЕЦ
		|ИЗ
		|	ВТПорядокОбложенияНачислений КАК ВТПорядокОбложенияНачислений
		|ГДЕ
		|	(ВТПорядокОбложенияНачислений.СпособОбложенияСО = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично)
		|	ИЛИ ВТПорядокОбложенияНачислений.СпособОбложенияСО = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом))
		|	И &ОкончательныйРасчет
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТПорядокОбложенияНачислений.МесяцНалоговогоПериода,
		|	ВТПорядокОбложенияНачислений.ФизическоеЛицо,
		|	ВТПорядокОбложенияНачислений.Подразделение,
		|	ВТПорядокОбложенияНачислений.Начисление,
		|	ВТПорядокОбложенияНачислений.СуммаДохода,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СН),
		|	ВЫБОР
		|		КОГДА ВТПорядокОбложенияНачислений.СпособОбложенияСН = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично)
		|			ТОГДА ВТПорядокОбложенияНачислений.ДоходНеПодлежащийНалогообложениюСН
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)
		|	КОНЕЦ
		|ИЗ
		|	ВТПорядокОбложенияНачислений КАК ВТПорядокОбложенияНачислений
		|ГДЕ
		|	(ВТПорядокОбложенияНачислений.СпособОбложенияСН = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично)
		|	ИЛИ ВТПорядокОбложенияНачислений.СпособОбложенияСН = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом))
		|	И &ОкончательныйРасчет
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТПорядокОбложенияНачислений.МесяцНалоговогоПериода,
		|	ВТПорядокОбложенияНачислений.ФизическоеЛицо,
		|	ВТПорядокОбложенияНачислений.Подразделение,
		|	ВТПорядокОбложенияНачислений.Начисление,
		|	ВТПорядокОбложенияНачислений.СуммаДохода,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОППВ),
		|	ВЫБОР
		|		КОГДА ВТПорядокОбложенияНачислений.СпособОбложенияОППВ = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично)
		|			ТОГДА ВТПорядокОбложенияНачислений.ДоходНеПодлежащийНалогообложениюОППВ
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)
		|	КОНЕЦ
		|ИЗ
		|	ВТПорядокОбложенияНачислений КАК ВТПорядокОбложенияНачислений
		|ГДЕ
		|	(ВТПорядокОбложенияНачислений.СпособОбложенияОППВ = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично)
		|	ИЛИ ВТПорядокОбложенияНачислений.СпособОбложенияОППВ = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом))
		|	И &ОкончательныйРасчет
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТПорядокОбложенияНачислений.МесяцНалоговогоПериода,
		|	ВТПорядокОбложенияНачислений.ФизическоеЛицо,
		|	ВТПорядокОбложенияНачислений.Подразделение,
		|	ВТПорядокОбложенияНачислений.Начисление,
		|	ВТПорядокОбложенияНачислений.СуммаДохода,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС),
		|	ВЫБОР
		|		КОГДА ВТПорядокОбложенияНачислений.СпособОбложенияВОСМС = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично)
		|			ТОГДА ВТПорядокОбложенияНачислений.ДоходНеПодлежащийНалогообложениюВОСМС
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)
		|	КОНЕЦ
		|ИЗ
		|	ВТПорядокОбложенияНачислений КАК ВТПорядокОбложенияНачислений
		|ГДЕ
		|	ВТПорядокОбложенияНачислений.СпособОбложенияВОСМС = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично)
		|	ИЛИ ВТПорядокОбложенияНачислений.СпособОбложенияВОСМС = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТПорядокОбложенияНачислений.МесяцНалоговогоПериода,
		|	ВТПорядокОбложенияНачислений.ФизическоеЛицо,
		|	ВТПорядокОбложенияНачислений.Подразделение,
		|	ВТПорядокОбложенияНачислений.Начисление,
		|	ВТПорядокОбложенияНачислений.СуммаДохода,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ООСМС),
		|	ВЫБОР
		|		КОГДА ВТПорядокОбложенияНачислений.СпособОбложенияООСМС = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично)
		|			ТОГДА ВТПорядокОбложенияНачислений.ДоходНеПодлежащийНалогообложениюООСМС
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)
		|	КОНЕЦ
		|ИЗ
		|	ВТПорядокОбложенияНачислений КАК ВТПорядокОбложенияНачислений
		|ГДЕ
		|	(ВТПорядокОбложенияНачислений.СпособОбложенияООСМС = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично)
		|	ИЛИ ВТПорядокОбложенияНачислений.СпособОбложенияООСМС = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом))
		|	И &ОкончательныйРасчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПериодыПределов.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ПериодыПределов.ДоходНеПодлежащийНалогообложению КАК ДоходНеПодлежащийНалогообложению,
		|	ДоходыНеПодлежащиеНалогообложениюЧастично.ПериодПредоставления КАК ПериодПредоставления,
		|	ЕСТЬNULL(РазмерыДоходовНеПодлежащихНалогообложениюЧастично.ВидПредела, ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МЗП)) КАК ВидПределаВычета,
		|	ЕСТЬNULL(РазмерыДоходовНеПодлежащихНалогообложениюЧастично.Размер, ДоходыНеПодлежащиеНалогообложениюЧастично.РазмерНеоблагаемогоДохода) КАК РазмерНеоблагаемогоДохода
		|ПОМЕСТИТЬ ВТДанныеДоходовНеоблагамыхЧастично
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ДоходыНеоблагаемыеЧастично.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		ДоходыНеоблагаемыеЧастично.ДоходНеПодлежащийНалогообложению КАК ДоходНеПодлежащийНалогообложению,
		|		МАКСИМУМ(РазмерыДоходовНеПодлежащихНалогообложениюЧастично.Период) КАК Период
		|	ИЗ
		|		ВТДоходыНеоблагаемые КАК ДоходыНеоблагаемыеЧастично
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерыДоходовНеПодлежащихНалогообложениюЧастично КАК РазмерыДоходовНеПодлежащихНалогообложениюЧастично
		|			ПО (РазмерыДоходовНеПодлежащихНалогообложениюЧастично.ВидДоходаНеПодлежащегоНалогообложениюЧастично = ДоходыНеоблагаемыеЧастично.ДоходНеПодлежащийНалогообложению)
		|				И (РазмерыДоходовНеПодлежащихНалогообложениюЧастично.Период <= НАЧАЛОПЕРИОДА(ДоходыНеоблагаемыеЧастично.МесяцНалоговогоПериода, ГОД))
		|				И ДоходыНеоблагаемыеЧастично.МесяцНалоговогоПериода >= ДАТАВРЕМЯ(2019, 1, 1, 0, 0, 0)
		|ГДЕ
		|	НЕ ДоходыНеоблагаемыеЧастично.ДоходНеПодлежащийНалогообложению = ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ДоходыНеоблагаемыеЧастично.МесяцНалоговогоПериода,
		|		ДоходыНеоблагаемыеЧастично.ДоходНеПодлежащийНалогообложению) КАК ПериодыПределов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично КАК ДоходыНеПодлежащиеНалогообложениюЧастично
		|		ПО ПериодыПределов.ДоходНеПодлежащийНалогообложению = ДоходыНеПодлежащиеНалогообложениюЧастично.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерыДоходовНеПодлежащихНалогообложениюЧастично КАК РазмерыДоходовНеПодлежащихНалогообложениюЧастично
		|		ПО ПериодыПределов.Период = РазмерыДоходовНеПодлежащихНалогообложениюЧастично.Период
		|			И ПериодыПределов.ДоходНеПодлежащийНалогообложению = РазмерыДоходовНеПодлежащихНалогообложениюЧастично.ВидДоходаНеПодлежащегоНалогообложениюЧастично
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДоходыНеоблагаемыеЧастично.МесяцНалоговогоПериода,
		|	ВТДоходыНеоблагаемыеЧастично.ФизическоеЛицо,
		|	ВТДоходыНеоблагаемыеЧастично.Начисление,
		|	СУММА(ВТДоходыНеоблагаемыеЧастично.СуммаДохода) КАК СуммаДохода,
		|	ВТДоходыНеоблагаемыеЧастично.ВидНалогаВзносаОтчисления,
		|	ВТДоходыНеоблагаемыеЧастично.ДоходНеПодлежащийНалогообложению,
		|	ДанныеДоходовНеоблагамыхЧастично.РазмерНеоблагаемогоДохода * ВЫБОР
		|		КОГДА ДанныеДоходовНеоблагамыхЧастично.ПериодПредоставления = ЗНАЧЕНИЕ(Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода)
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(ДанныеДоходовНеоблагамыхЧастично.ВидПределаВычета, ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МЗП)) = ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МЗП)
		|						ТОГДА ЕСТЬNULL(РазмерыМЗП.РазмерМЗПНаНачалоГода, 0)
		|					ИНАЧЕ ЕСТЬNULL(РазмерыМРП.РазмерМРПНаНачалоГода, 0)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕСТЬNULL(ДанныеДоходовНеоблагамыхЧастично.ВидПределаВычета, ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МЗП)) = ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МЗП)
		|					ТОГДА ЕСТЬNULL(РазмерыМЗП.РазмерМЗП, 0)
		|				ИНАЧЕ ЕСТЬNULL(РазмерыМРП.РазмерМРП, 0)
		|			КОНЕЦ
		|	КОНЕЦ КАК МаксимальныйРазмерНеоблагаемогоДохода,
		|	ДанныеДоходовНеоблагамыхЧастично.ПериодПредоставления
		|ПОМЕСТИТЬ ВТРазмерыНеоблагаемыхДоходов
		|ИЗ
		|	ВТДоходыНеоблагаемые КАК ВТДоходыНеоблагаемыеЧастично
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеДоходовНеоблагамыхЧастично КАК ДанныеДоходовНеоблагамыхЧастично
		|		ПО ВТДоходыНеоблагаемыеЧастично.ДоходНеПодлежащийНалогообложению = ДанныеДоходовНеоблагамыхЧастично.ДоходНеПодлежащийНалогообложению
		|			И ВТДоходыНеоблагаемыеЧастично.МесяцНалоговогоПериода = ДанныеДоходовНеоблагамыхЧастично.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыМЗППоПериодам КАК РазмерыМЗП
		|		ПО ВТДоходыНеоблагаемыеЧастично.МесяцНалоговогоПериода = РазмерыМЗП.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыМРППоПериодам КАК РазмерыМРП
		|		ПО ВТДоходыНеоблагаемыеЧастично.МесяцНалоговогоПериода = РазмерыМРП.МесяцНалоговогоПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТДоходыНеоблагаемыеЧастично.МесяцНалоговогоПериода,
		|	ВТДоходыНеоблагаемыеЧастично.ФизическоеЛицо,
		|	ВТДоходыНеоблагаемыеЧастично.Начисление,
		|	ВТДоходыНеоблагаемыеЧастично.ВидНалогаВзносаОтчисления,
		|	ВТДоходыНеоблагаемыеЧастично.ДоходНеПодлежащийНалогообложению,
		|	ДанныеДоходовНеоблагамыхЧастично.ПериодПредоставления,
		|	ДанныеДоходовНеоблагамыхЧастично.РазмерНеоблагаемогоДохода * ВЫБОР
		|		КОГДА ДанныеДоходовНеоблагамыхЧастично.ПериодПредоставления = ЗНАЧЕНИЕ(Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода)
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(ДанныеДоходовНеоблагамыхЧастично.ВидПределаВычета, ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МЗП)) = ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МЗП)
		|						ТОГДА ЕСТЬNULL(РазмерыМЗП.РазмерМЗПНаНачалоГода, 0)
		|					ИНАЧЕ ЕСТЬNULL(РазмерыМРП.РазмерМРПНаНачалоГода, 0)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕСТЬNULL(ДанныеДоходовНеоблагамыхЧастично.ВидПределаВычета, ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МЗП)) = ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МЗП)
		|					ТОГДА ЕСТЬNULL(РазмерыМЗП.РазмерМЗП, 0)
		|				ИНАЧЕ ЕСТЬNULL(РазмерыМРП.РазмерМРП, 0)
		|			КОНЕЦ
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РазмерыНеоблагаемыхДоходов.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	РазмерыНеоблагаемыхДоходов.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РазмерыНеоблагаемыхДоходов.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
		|	РазмерыНеоблагаемыхДоходов.ДоходНеПодлежащийНалогообложению КАК ДоходНеПодлежащийНалогообложению,
		|	РазмерыНеоблагаемыхДоходов.МаксимальныйРазмерНеоблагаемогоДохода,
		|	РазмерыНеоблагаемыхДоходов.ПериодПредоставления,
		|	РазмерыНеоблагаемыхДоходов.СуммаДохода КАК СуммаДохода,
		|	СУММА(ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(РазмерыНеоблагаемыхДоходов.МесяцНалоговогоПериода, ГОД) = НАЧАЛОПЕРИОДА(СведенияОНеоблагаемыхДоходах.МесяцНалоговогоПериода, ГОД)
		|					И РазмерыНеоблагаемыхДоходов.МесяцНалоговогоПериода > СведенияОНеоблагаемыхДоходах.МесяцНалоговогоПериода
		|				ТОГДА ЕСТЬNULL(СведенияОНеоблагаемыхДоходах.СуммаДохода, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДоходаСНачалаГода,
		|	СУММА(ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(РазмерыНеоблагаемыхДоходов.МесяцНалоговогоПериода, ГОД) = НАЧАЛОПЕРИОДА(СведенияОНеоблагаемыхДоходах.МесяцНалоговогоПериода, ГОД)
		|					И РазмерыНеоблагаемыхДоходов.МесяцНалоговогоПериода > СведенияОНеоблагаемыхДоходах.МесяцНалоговогоПериода
		|				ТОГДА ЕСТЬNULL(СведенияОНеоблагаемыхДоходах.НеоблагаемыйДоход, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНеоблагаемогоДоходаСНачалаГода,
		|	СУММА(ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(РазмерыНеоблагаемыхДоходов.МесяцНалоговогоПериода, МЕСЯЦ) = НАЧАЛОПЕРИОДА(СведенияОНеоблагаемыхДоходах.МесяцНалоговогоПериода, МЕСЯЦ)
		|				ТОГДА ЕСТЬNULL(СведенияОНеоблагаемыхДоходах.СуммаДохода, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДоходаТекущегоМесяца,
		|	СУММА(ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(РазмерыНеоблагаемыхДоходов.МесяцНалоговогоПериода, МЕСЯЦ) = НАЧАЛОПЕРИОДА(СведенияОНеоблагаемыхДоходах.МесяцНалоговогоПериода, МЕСЯЦ)
		|				ТОГДА ЕСТЬNULL(СведенияОНеоблагаемыхДоходах.НеоблагаемыйДоход, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНеоблагаемогоДоходаТекущегоМесяца
		|ИЗ
		|	ВТРазмерыНеоблагаемыхДоходов КАК РазмерыНеоблагаемыхДоходов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОНеоблагаемыхЧастичноДоходахРанееИсчисленные КАК СведенияОНеоблагаемыхДоходах
		|		ПО РазмерыНеоблагаемыхДоходов.ФизическоеЛицо = СведенияОНеоблагаемыхДоходах.ФизическоеЛицо
		|			И РазмерыНеоблагаемыхДоходов.ВидНалогаВзносаОтчисления = СведенияОНеоблагаемыхДоходах.ВидНалогаВзносаОтчисления
		|			И РазмерыНеоблагаемыхДоходов.ДоходНеПодлежащийНалогообложению = СведенияОНеоблагаемыхДоходах.ДоходНеПодлежащийНалогообложению
		|			И РазмерыНеоблагаемыхДоходов.Начисление = СведенияОНеоблагаемыхДоходах.Начисление
		|
		|
		|СГРУППИРОВАТЬ ПО
		|	РазмерыНеоблагаемыхДоходов.МесяцНалоговогоПериода,
		|	РазмерыНеоблагаемыхДоходов.ФизическоеЛицо,
		|	РазмерыНеоблагаемыхДоходов.ВидНалогаВзносаОтчисления,
		|	РазмерыНеоблагаемыхДоходов.ДоходНеПодлежащийНалогообложению,
		|	РазмерыНеоблагаемыхДоходов.МаксимальныйРазмерНеоблагаемогоДохода,
		|	РазмерыНеоблагаемыхДоходов.ПериодПредоставления,
		|	РазмерыНеоблагаемыхДоходов.СуммаДохода
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	ДоходНеПодлежащийНалогообложению,
		|	ВидНалогаВзносаОтчисления,
		|	МесяцНалоговогоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыНеоблагаемые.МесяцНалоговогоПериода,
		|	ДоходыНеоблагаемые.ФизическоеЛицо,
		|	ДоходыНеоблагаемые.ДоходНеПодлежащийНалогообложению,
		|	ДоходыНеоблагаемые.ВидНалогаВзносаОтчисления,
		|	ДоходыНеоблагаемые.Подразделение,
		|	ДоходыНеоблагаемые.Начисление,
		|	ДоходыНеоблагаемые.СуммаДохода
		|ИЗ
		|	ВТДоходыНеоблагаемые КАК ДоходыНеоблагаемые
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОНеоблагаемыхДоходах.МесяцНалоговогоПериода,
		|	СведенияОНеоблагаемыхДоходах.Подразделение,
		|	СведенияОНеоблагаемыхДоходах.ФизическоеЛицо,
		|	СведенияОНеоблагаемыхДоходах.Начисление,
		|	СведенияОНеоблагаемыхДоходах.ВидНалогаВзносаОтчисления,
		|	СведенияОНеоблагаемыхДоходах.ДоходНеПодлежащийНалогообложению,
		|	- СведенияОНеоблагаемыхДоходах.СуммаДохода КАК СуммаДохода,
		|	- СведенияОНеоблагаемыхДоходах.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	СведенияОНеоблагаемыхДоходах.СуммаДохода КАК СуммаДоходаИсчисленногоРанее,
		|	СведенияОНеоблагаемыхДоходах.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее
		|ИЗ
		|	ВТСведенияОНеоблагаемыхЧастичноДоходахРанееИсчисленные КАК СведенияОНеоблагаемыхДоходах
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериодыПоФизлицам КАК ПериодыПоФизлицам
		|		ПО (СведенияОНеоблагаемыхДоходах.МесяцНалоговогоПериода = ПериодыПоФизлицам.МесяцНалоговогоПериода)
		|			И СведенияОНеоблагаемыхДоходах.ФизическоеЛицо = ПериодыПоФизлицам.ФизическоеЛицо
		|";
		
	Если ОкончательныйРасчет Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОкончательныйРасчетДоходы", "Истина");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОкончательныйРасчетДоходы", "ДанныеМежрасчетногоПериода");
	КонецЕсли;
		
	Результат = Запрос.ВыполнитьПакет();
	УничтожитьВТ.Добавить("ВТСведенияОНеоблагаемыхЧастичноДоходахРанееИсчисленные");
	УничтожитьВТ.Добавить("ВТПорядокОбложенияНачислений");
	УничтожитьВТ.Добавить("ВТДоходыНеоблагаемые");
	УничтожитьВТ.Добавить("ВТРазмерыНеоблагаемыхДоходов");
	УничтожитьВТ.Добавить("ВТДанныеДоходовНеоблагамыхЧастично");
	
	ВсегоРезультатов = Результат.Количество();
	НеоблагаемыеДоходыПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	Выборка = Результат[ВсегоРезультатов - 3].Выбрать();

	КвалификаторЧисла = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2));
	
	ВспомогательнаяТаблицаРасчета = Новый ТаблицаЗначений;
	ВспомогательнаяТаблицаРасчета.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ВспомогательнаяТаблицаРасчета.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ВспомогательнаяТаблицаРасчета.Колонки.Добавить("ВидНалогаВзносаОтчисления", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалоговВзносовОтчислений"));
	ВспомогательнаяТаблицаРасчета.Колонки.Добавить("ДоходНеПодлежащийНалогообложению", Новый ОписаниеТипов("СправочникСсылка.ДоходыНеПодлежащиеНалогообложениюЧастично"));
	ВспомогательнаяТаблицаРасчета.Колонки.Добавить("НеоблагаемыйДоход", КвалификаторЧисла);
	
	МассивТиповНачислений = Новый Массив;
	МассивТиповНачислений.Добавить(Тип("ПланВидовРасчетаСсылка.Начисления"));
	МассивТиповНачислений.Добавить(Тип("СправочникСсылка.ВидыВыплатБывшимСотрудникам"));
	МассивТиповНачислений.Добавить(Тип("СправочникСсылка.ВидыПрочихДоходовФизическихЛиц"));
	МассивТиповНачислений.Добавить(Тип("СправочникСсылка.ВидыДивидендов"));
	
	РезультатыРасчетов = ВспомогательнаяТаблицаРасчета.СкопироватьКолонки();
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("Начисление", Новый ОписаниеТипов(МассивТиповНачислений));
	РезультатыРасчетов.Колонки.Добавить("СуммаДохода", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("СуммаДоходаВЦеломЗаПериод", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("СуммаДоходаИсчисленногоРанее", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", КвалификаторЧисла);

	ТекущееФизическоеЛицо 					= Неопределено;
	ТекущийДоходНеПодлежащийНалогообложению = Неопределено;
	ТекущийВидНалогаВзносаОтчисления		= Неопределено;
	
	НеоблагаемыйДоходВТекущемРасчете = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Если ТекущееФизическоеЛицо <> Выборка.ФизическоеЛицо 
			ИЛИ ТекущийДоходНеПодлежащийНалогообложению <> Выборка.ДоходНеПодлежащийНалогообложению
			ИЛИ ТекущийВидНалогаВзносаОтчисления <> Выборка.ВидНалогаВзносаОтчисления Тогда
			
			ТекущееФизическоеЛицо 					= Выборка.ФизическоеЛицо;
			ТекущийДоходНеПодлежащийНалогообложению = Выборка.ДоходНеПодлежащийНалогообложению;
			ТекущийВидНалогаВзносаОтчисления		= Выборка.ВидНалогаВзносаОтчисления;
			
			НеоблагаемыйДоходВТекущемРасчете = 0;
		КонецЕсли;
		
		Если Выборка.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца Тогда
			НеоблагаемыйДоход = Мин(Выборка.СуммаДохода, Выборка.МаксимальныйРазмерНеоблагаемогоДохода);
		ИначеЕсли Выборка.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода Тогда
			ОстатокНеоблагаемогоДохода = Выборка.МаксимальныйРазмерНеоблагаемогоДохода - Выборка.СуммаНеоблагаемогоДоходаСНачалаГода - НеоблагаемыйДоходВТекущемРасчете;
			НеоблагаемыйДоход = Мин(Выборка.СуммаДохода, ОстатокНеоблагаемогоДохода);			
		ИначеЕсли НЕ ЗначениеЗаполнено(Выборка.ДоходНеПодлежащийНалогообложению) Тогда
			НеоблагаемыйДоход = Выборка.СуммаДохода;
		КонецЕсли;
		
		НоваяСтрока = ВспомогательнаяТаблицаРасчета.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.НеоблагаемыйДоход = НеоблагаемыйДоход;
		НеоблагаемыйДоходВТекущемРасчете = НеоблагаемыйДоходВТекущемРасчете + НоваяСтрока.НеоблагаемыйДоход;
	КонецЦикла;
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ДоходНеПодлежащийНалогообложению, ВидНалогаВзносаОтчисления";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	Для Каждого СтрокаРасчета Из ВспомогательнаяТаблицаРасчета Цикл
		СтруктураПоиска.ФизическоеЛицо 						= СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода 				= СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ДоходНеПодлежащийНалогообложению 	= СтрокаРасчета.ДоходНеПодлежащийНалогообложению;
		СтруктураПоиска.ВидНалогаВзносаОтчисления 			= СтрокаРасчета.ВидНалогаВзносаОтчисления;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		
		Коэффициенты = ОбщегоНазначения.ВыгрузитьКолонку(ДоходыМесяца, "СуммаДохода");    

		РаспределениеРесурса = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СтрокаРасчета.НеоблагаемыйДоход, Коэффициенты);
		Если РаспределениеРесурса = Неопределено Тогда
			НоваяСтрока = РезультатыРасчетов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасчета,, "НеоблагаемыйДоход");
			НоваяСтрока.НеоблагаемыйДоход = СтрокаРасчета.НеоблагаемыйДоход;
		Иначе
			Индекс = 0;
			Для Каждого СтрокаДоходы Из ДоходыМесяца Цикл
				НоваяСтрока = РезультатыРасчетов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасчета,, "НеоблагаемыйДоход");
				НоваяСтрока.Подразделение = СтрокаДоходы.Подразделение;
				НоваяСтрока.Начисление = СтрокаДоходы.Начисление;
				НоваяСтрока.СуммаДохода = СтрокаДоходы.СуммаДохода;
				НоваяСтрока.СуммаДоходаВЦеломЗаПериод = СтрокаДоходы.СуммаДохода;
				НоваяСтрока.НеоблагаемыйДоход = РаспределениеРесурса[Индекс];
				НоваяСтрока.НеоблагаемыйДоходВЦеломЗаПериод = РаспределениеРесурса[Индекс];
				Индекс = Индекс + 1;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НеоблагаемыеДоходыПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ДоходНеПодлежащийНалогообложению, Начисление, ВидНалогаВзносаОтчисления",
								"СуммаДоходаВЦеломЗаПериод,    НеоблагаемыйДоходВЦеломЗаПериод, 
								|СуммаДоходаИсчисленногоРанее, НеоблагаемыйДоходИсчисленныйРанее,
								|СуммаДохода, 				   НеоблагаемыйДоход");

	Запрос.УстановитьПараметр("ТаблицаСведенияОНеоблагаемыхДоходах", РезультатыРасчетов);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОНеоблагаемыхДоходах.ФизическоеЛицо,
		|	СведенияОНеоблагаемыхДоходах.Подразделение,
		|	СведенияОНеоблагаемыхДоходах.МесяцНалоговогоПериода,
		|	СведенияОНеоблагаемыхДоходах.ДоходНеПодлежащийНалогообложению,
		|	СведенияОНеоблагаемыхДоходах.Начисление,
		|	СведенияОНеоблагаемыхДоходах.ВидНалогаВзносаОтчисления,
		|	СведенияОНеоблагаемыхДоходах.НеоблагаемыйДоходВЦеломЗаПериод КАК НеоблагаемыйДоход
		|ПОМЕСТИТЬ ВТСведенияОНеоблагаемыхДоходах
		|ИЗ
		|	&ТаблицаСведенияОНеоблагаемыхДоходах КАК СведенияОНеоблагаемыхДоходах
		|ГДЕ 
		|	НЕ СведенияОНеоблагаемыхДоходах.ДоходНеПодлежащийНалогообложению = ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)
		|";
	Запрос.Выполнить();
	
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	СтрокиДляУдаления = Новый Массив;
	
	Для Каждого СтрокаРасчета Из РезультатыРасчетов Цикл
		
		Если СтрокаРасчета.СуммаДохода = 0 
			И СтрокаРасчета.НеоблагаемыйДоход = 0 Тогда
			
			СтрокиДляУдаления.Добавить(СтрокаРасчета);
			Продолжить;
			
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		СтрокаРасчета.НомерСтроки = НомерСтроки;
		
	КонецЦикла;
	
	Для Каждого СтрокаУдаления Из СтрокиДляУдаления Цикл
		РезультатыРасчетов.Удалить(СтрокаУдаления);
	КонецЦикла;	
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов; 
		
КонецФункции

// Подготовка данных к расчету налогов, взносов, отчислений

Процедура СоздатьВТПериодыПоФизлицам(Организация, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(МесяцНачисления));
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(СведенияОДоходахФизическихЛицОбороты.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
		|	НАЧАЛОПЕРИОДА(СведенияОДоходахФизическихЛицОбороты.Период, ГОД) КАК НачалоГодаНалоговогоПериода,
		|	СведенияОДоходахФизическихЛицОбороты.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТПериодыПоФизлицам
		|ИЗ
		|	РегистрНакопления.СведенияОДоходахФизическихЛиц.Обороты(
		|			,
		|			,
		|			Месяц,
		|			Организация = &Организация
		|				И ПериодРегистрации = &ПериодРегистрации
		|				И ФизическоеЛицо В
		|					(ВЫБРАТЬ
		|						СписокСотрудников.ФизическоеЛицо
		|					ИЗ
		|						ВТФизическиеЛица КАК СписокСотрудников)) КАК СведенияОДоходахФизическихЛицОбороты
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(СведенияОДоходахФизическихЛиц.Период, МЕСЯЦ),
		|	НАЧАЛОПЕРИОДА(СведенияОДоходахФизическихЛиц.Период, ГОД),
		|	СведенияОДоходахФизическихЛиц.ФизическоеЛицо
		|ИЗ
		|	ВТРегистрНакопления_СведенияОДоходахФизическихЛиц КАК СведенияОДоходахФизическихЛиц
		|ГДЕ
		|	СведенияОДоходахФизическихЛиц.Организация = &Организация
		|	И СведенияОДоходахФизическихЛиц.ПериодРегистрации = &ПериодРегистрации
		|	И СведенияОДоходахФизическихЛиц.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				СписокСотрудников.ФизическоеЛицо
		|			ИЗ
		|				ВТФизическиеЛица КАК СписокСотрудников)";

		
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВТСведенияОДоходах(Организация, Регистратор, МенеджерВременныхТаблиц, ПервыйМесяцНалоговогоПериода, ПоследнийМесяцНалоговогоПериода, ОкончательныйРасчет, ИсключатьДоходыРегистратора)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПервыйМесяцНалоговогоПериода", НачалоМесяца(ПервыйМесяцНалоговогоПериода));
	Запрос.УстановитьПараметр("ПоследнийМесяцНалоговогоПериода", КонецМесяца(ПоследнийМесяцНалоговогоПериода));
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ?(ИсключатьДоходыРегистратора, Регистратор, Неопределено));
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОДоходах.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	СведенияОДоходах.ПериодРегистрации КАК ПериодРегистрации,
		|	СведенияОДоходах.Подразделение КАК Подразделение,
		|	СведенияОДоходах.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОДоходах.Начисление КАК Начисление,
		|	СУММА(СведенияОДоходах.СуммаДохода) КАК СуммаДохода
		|ПОМЕСТИТЬ ВТСведенияОДоходах
		|ИЗ
		|	(ВЫБРАТЬ
		|		НАЧАЛОПЕРИОДА(СведенияОДоходахФизическихЛицОбороты.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
		|		СведенияОДоходахФизическихЛицОбороты.ПериодРегистрации КАК ПериодРегистрации,
		|		СведенияОДоходахФизическихЛицОбороты.Подразделение КАК Подразделение,
		|		СведенияОДоходахФизическихЛицОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
		|		СведенияОДоходахФизическихЛицОбороты.Начисление КАК Начисление,
		|		СведенияОДоходахФизическихЛицОбороты.СуммаДоходаОборот КАК СуммаДохода
		|	ИЗ
		|		РегистрНакопления.СведенияОДоходахФизическихЛиц.Обороты(
		|				&ПервыйМесяцНалоговогоПериода,
		|				&ПоследнийМесяцНалоговогоПериода,
		|				Регистратор,
		|				Организация = &Организация
		|					И ФизическоеЛицо В
		|						(ВЫБРАТЬ
		|							СписокСотрудников.ФизическоеЛицо
		|						ИЗ
		|							ВТФизическиеЛица КАК СписокСотрудников)
		|					И &ОкончательныйРасчетДоходы) КАК СведенияОДоходахФизическихЛицОбороты
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериодыПоФизлицам КАК ПериодыПоФизлицам
		|			ПО (НАЧАЛОПЕРИОДА(СведенияОДоходахФизическихЛицОбороты.Период, МЕСЯЦ) = ПериодыПоФизлицам.МесяцНалоговогоПериода)
		|				И СведенияОДоходахФизическихЛицОбороты.ФизическоеЛицо = ПериодыПоФизлицам.ФизическоеЛицо
		|	ГДЕ
		|		СведенияОДоходахФизическихЛицОбороты.Регистратор <> &ИсключаемыйРегистратор
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ),
		|		СведенияОДоходах.ПериодРегистрации,
		|		СведенияОДоходах.Подразделение,
		|		СведенияОДоходах.ФизическоеЛицо,
		|		СведенияОДоходах.Начисление,
		|		СведенияОДоходах.СуммаДохода
		|	ИЗ
		|		ВТРегистрНакопления_СведенияОДоходахФизическихЛиц КАК СведенияОДоходах
		|	ГДЕ
		|		СведенияОДоходах.Период МЕЖДУ &ПервыйМесяцНалоговогоПериода И &ПоследнийМесяцНалоговогоПериода
		|		И СведенияОДоходах.Организация = &Организация
		|		И СведенияОДоходах.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					СписокСотрудников.ФизическоеЛицо
		|				ИЗ
		|					ВТФизическиеЛица КАК СписокСотрудников)) КАК СведенияОДоходах
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.МесяцНалоговогоПериода,
		|	СведенияОДоходах.ПериодРегистрации,
		|	СведенияОДоходах.Подразделение,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	СведенияОДоходах.Начисление";

		
	Если ОкончательныйРасчет Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОкончательныйРасчетДоходы", "Истина");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОкончательныйРасчетДоходы", "ДанныеМежрасчетногоПериода");
	КонецЕсли;

	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВТСтавкиНалоговВзносовПоПериодам(Организация, МенеджерВременныхТаблиц, ИмяВТСтавки = "ВТСтавки") Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	1 КАК Приоритет,
		|	МАКСИМУМ(ЕСТЬNULL(СведенияОСтавкахНалоговСборовОтчислений.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК ПериодСтавки,
		|	ПериодыРасчета.Период КАК МесяцНалоговогоПериода,
		|	СведенияОСтавкахНалоговСборовОтчислений.Организация КАК Организация,
		|	СведенияОСтавкахНалоговСборовОтчислений.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
		|	СведенияОСтавкахНалоговСборовОтчислений.ВидДохода КАК ВидДохода
		|ПОМЕСТИТЬ ВТПериодыСтавок
		|ИЗ
		|	ВТДатыПоМесяцам КАК ПериодыРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахНалоговСборовОтчислений КАК СведенияОСтавкахНалоговСборовОтчислений
		|		ПО ПериодыРасчета.Период >= СведенияОСтавкахНалоговСборовОтчислений.Период
		|ГДЕ
		|	СведенияОСтавкахНалоговСборовОтчислений.Организация = &Организация
		|	И СведенияОСтавкахНалоговСборовОтчислений.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПериодыРасчета.Период,
		|	СведенияОСтавкахНалоговСборовОтчислений.Организация,
		|	СведенияОСтавкахНалоговСборовОтчислений.ВидНалогаВзносаОтчисления,
		|	СведенияОСтавкахНалоговСборовОтчислений.ВидДохода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	МАКСИМУМ(ЕСТЬNULL(СведенияОСтавкахНалоговСборовОтчислений.Период, ДАТАВРЕМЯ(1, 1, 1))),
		|	ПериодыРасчета.Период,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка),
		|	СведенияОСтавкахНалоговСборовОтчислений.ВидНалогаВзносаОтчисления,
		|	СведенияОСтавкахНалоговСборовОтчислений.ВидДохода
		|ИЗ
		|	ВТДатыПоМесяцам КАК ПериодыРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахНалоговСборовОтчислений КАК СведенияОСтавкахНалоговСборовОтчислений
		|		ПО ПериодыРасчета.Период >= СведенияОСтавкахНалоговСборовОтчислений.Период
		|ГДЕ
		|	СведенияОСтавкахНалоговСборовОтчислений.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПериодыРасчета.Период,
		|	СведенияОСтавкахНалоговСборовОтчислений.ВидНалогаВзносаОтчисления,
		|	СведенияОСтавкахНалоговСборовОтчислений.ВидДохода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПериодСтавки,
		|	Организация,
		|	ВидНалогаВзносаОтчисления,
		|	ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыСтавок.Приоритет КАК Приоритет,
		|	ПериодыСтавок.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ПериодыСтавок.ПериодСтавки КАК ПериодСтавки,
		|	ЕСТЬNULL(СведенияОСтавкахНалоговСборовОтчислений.Ставка, 0) / 100 КАК Ставка,
		|	ПериодыСтавок.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
		|	ПериодыСтавок.ВидДохода КАК ВидДохода
		|ПОМЕСТИТЬ ВТСтавкиПоПриоритетам
		|ИЗ
		|	ВТПериодыСтавок КАК ПериодыСтавок
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахНалоговСборовОтчислений КАК СведенияОСтавкахНалоговСборовОтчислений
		|		ПО ПериодыСтавок.ПериодСтавки = СведенияОСтавкахНалоговСборовОтчислений.Период
		|			И ПериодыСтавок.Организация = СведенияОСтавкахНалоговСборовОтчислений.Организация
		|			И ПериодыСтавок.ВидНалогаВзносаОтчисления = СведенияОСтавкахНалоговСборовОтчислений.ВидНалогаВзносаОтчисления
		|			И ПериодыСтавок.ВидДохода = СведенияОСтавкахНалоговСборовОтчислений.ВидДохода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	МесяцНалоговогоПериода,
		|	ПериодСтавки,
		|	ВидНалогаВзносаОтчисления,
		|	ВидДохода,
		|	Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСтавкиПоПриоритетам.Приоритет КАК Приоритет,
		|	МаксимумСтавок.ПериодСтавки КАК ПериодСтавки,
		|	МаксимумСтавок.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	МаксимумСтавок.ВидДохода КАК ВидДохода,
		|	МаксимумСтавок.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления
		|ПОМЕСТИТЬ ВТ_МаксимумыСтавокПоПериоду
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ПриоритетСтавок.ПериодСтавки) КАК ПериодСтавки,
		|		ПриоритетСтавок.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		ПриоритетСтавок.ВидДохода КАК ВидДохода,
		|		ПриоритетСтавок.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления
		|	ИЗ
		|		ВТСтавкиПоПриоритетам КАК ПриоритетСтавок
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПриоритетСтавок.МесяцНалоговогоПериода,
		|		ПриоритетСтавок.ВидНалогаВзносаОтчисления,
		|		ПриоритетСтавок.ВидДохода) КАК МаксимумСтавок
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиПоПриоритетам КАК ВТСтавкиПоПриоритетам
		|		ПО МаксимумСтавок.ПериодСтавки = ВТСтавкиПоПриоритетам.ПериодСтавки
		|			И МаксимумСтавок.МесяцНалоговогоПериода = ВТСтавкиПоПриоритетам.МесяцНалоговогоПериода
		|			И МаксимумСтавок.ВидДохода = ВТСтавкиПоПриоритетам.ВидДохода
		|			И МаксимумСтавок.ВидНалогаВзносаОтчисления = ВТСтавкиПоПриоритетам.ВидНалогаВзносаОтчисления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	МесяцНалоговогоПериода,
		|	ВидНалогаВзносаОтчисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриоритетСтавок.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ВТСтавкиПоПриоритетам.Ставка КАК Ставка,
		|	ВТСтавкиПоПриоритетам.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
		|	ВТСтавкиПоПриоритетам.ВидДохода КАК ВидДохода
		|ПОМЕСТИТЬ #ВТСтавки
		|ИЗ
		|	(ВЫБРАТЬ
		|		МИНИМУМ(ПриоритетСтавок.Приоритет) КАК Приоритет,
		|		ПриоритетСтавок.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		ПриоритетСтавок.ВидДохода КАК ВидДохода,
		|		ПриоритетСтавок.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления
		|	ИЗ
		|		ВТ_МаксимумыСтавокПоПериоду КАК ПриоритетСтавок
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПриоритетСтавок.МесяцНалоговогоПериода,
		|		ПриоритетСтавок.ВидНалогаВзносаОтчисления,
		|		ПриоритетСтавок.ВидДохода) КАК ПриоритетСтавок
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиПоПриоритетам КАК ВТСтавкиПоПриоритетам
		|		ПО ПриоритетСтавок.Приоритет = ВТСтавкиПоПриоритетам.Приоритет
		|			И ПриоритетСтавок.МесяцНалоговогоПериода = ВТСтавкиПоПриоритетам.МесяцНалоговогоПериода
		|			И ПриоритетСтавок.ВидНалогаВзносаОтчисления = ВТСтавкиПоПриоритетам.ВидНалогаВзносаОтчисления
		|			И ПриоритетСтавок.ВидДохода = ВТСтавкиПоПриоритетам.ВидДохода";
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСтавки", ИмяВТСтавки);
	
	Запрос.Выполнить();	
	УничтожитьВТ.Добавить("ВТПериодыСтавок");
	УничтожитьВТ.Добавить("ВТСтавкиПоПриоритетам");
	УничтожитьВТ.Добавить("ВТ_МаксимумыСтавокПоПериоду");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
КонецПроцедуры

Процедура СоздатьВТРанееИсчисленныеНалогиВзносы(Организация, Регистратор, МенеджерВременныхТаблиц, ПервыйМесяцНалоговогоПериода, ПоследнийМесяцНалоговогоПериода, ОкончательныйРасчет, ИсключатьДоходыРегистратора, ПредоставлятьВычетВМесяцеОтсутствияДохода = Ложь)
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("НачалоГодаПервогоМесяцаНалоговогоПериода", НачалоГода(ПервыйМесяцНалоговогоПериода));
	Запрос.УстановитьПараметр("ПоследнийМесяцНалоговогоПериода", ПоследнийМесяцНалоговогоПериода);
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ?(ИсключатьДоходыРегистратора, Регистратор, Неопределено));

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(СведенияОбИсчисленииНалоговВзносовОтчислений.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.Подразделение,
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.ФизическоеЛицо,
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.ВидНалогаВзносаОтчисления,
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.ВидДохода,
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.ДанныеМежрасчетногоПериода,
		|	СУММА(СведенияОбИсчисленииНалоговВзносовОтчислений.ОблагаемыйДоходОборот + ЕСТЬNULL(ДанныеДокументаИсправления.ОблагаемыйДоход, 0)) КАК ОблагаемыйДоход,
		|	СУММА(СведенияОбИсчисленииНалоговВзносовОтчислений.НеоблагаемыйДоходОборот + ЕСТЬNULL(ДанныеДокументаИсправления.НеоблагаемыйДоход, 0)) КАК НеоблагаемыйДоход,
		|	СУММА(СведенияОбИсчисленииНалоговВзносовОтчислений.НалогВзносОборот + ЕСТЬNULL(ДанныеДокументаИсправления.НалогВзнос, 0)) КАК НалогВзнос,
		|	СУММА(СведенияОбИсчисленииНалоговВзносовОтчислений.ОбъектИсчисленияОборот + ЕСТЬNULL(ДанныеДокументаИсправления.ОбъектИсчисления, 0)) КАК ОбъектИсчисления,
		|	СУММА(СведенияОбИсчисленииНалоговВзносовОтчислений.ПримененныйВычетОборот + ЕСТЬNULL(ДанныеДокументаИсправления.ПримененныйВычет, 0)) КАК ПримененныйВычет,
		|	СУММА(СведенияОбИсчисленииНалоговВзносовОтчислений.РазрешенныйВычетОборот + ЕСТЬNULL(ДанныеДокументаИсправления.РазрешенныйВычет, 0)) КАК РазрешенныйВычет,
		|	СУММА(СведенияОбИсчисленииНалоговВзносовОтчислений.ПримененнаяЛьготаОборот + ЕСТЬNULL(ДанныеДокументаИсправления.ПримененнаяЛьгота, 0)) КАК ПримененнаяЛьгота,
		|	СУММА(СведенияОбИсчисленииНалоговВзносовОтчислений.ПрочиеВычетыОборот + ЕСТЬNULL(ДанныеДокументаИсправления.ПрочиеВычеты, 0)) КАК ПрочиеВычеты
		|ПОМЕСТИТЬ ВТИсчисленныеНалогиВзносы
		|ИЗ
		|	РегистрНакопления.СведенияОбИсчисленииНалоговВзносовОтчислений.Обороты(
		|			&НачалоГодаПервогоМесяцаНалоговогоПериода,
		|			&ПоследнийМесяцНалоговогоПериода,
		|			Регистратор,
		|			Организация = &Организация
		|				И ФизическоеЛицо В
		|					(ВЫБРАТЬ
		|						СписокСотрудников.ФизическоеЛицо
		|					ИЗ
		|						ВТФизическиеЛица КАК СписокСотрудников)) КАК СведенияОбИсчисленииНалоговВзносовОтчислений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СведенияОбИсчисленииНалоговВзносовОтчисленийДокументаИсправления КАК ДанныеДокументаИсправления
		|	    ПО НАЧАЛОПЕРИОДА(СведенияОбИсчисленииНалоговВзносовОтчислений.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ДанныеДокументаИсправления.Период, МЕСЯЦ) 
		|	    	И СведенияОбИсчисленииНалоговВзносовОтчислений.Подразделение = ДанныеДокументаИсправления.Подразделение 
		|	    	И СведенияОбИсчисленииНалоговВзносовОтчислений.ФизическоеЛицо = ДанныеДокументаИсправления.ФизическоеЛицо 
		|	    	И СведенияОбИсчисленииНалоговВзносовОтчислений.ВидНалогаВзносаОтчисления = ДанныеДокументаИсправления.ВидНалогаВзносаОтчисления 
		|	    	И СведенияОбИсчисленииНалоговВзносовОтчислений.ВидДохода = ДанныеДокументаИсправления.ВидДохода 
		|	    	И СведенияОбИсчисленииНалоговВзносовОтчислений.Подразделение = ДанныеДокументаИсправления.Подразделение 
		|			И СведенияОбИсчисленииНалоговВзносовОтчислений.ДанныеМежрасчетногоПериода
		|
		|ГДЕ
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.Регистратор <> &ИсключаемыйРегистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.ФизическоеЛицо,
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.ВидНалогаВзносаОтчисления,
		|	НАЧАЛОПЕРИОДА(СведенияОбИсчисленииНалоговВзносовОтчислений.Период, МЕСЯЦ),
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.ВидДохода,
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.ДанныеМежрасчетногоПериода,
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ДоходыПредыдущегоМестаРаботы.МесяцНалоговогоПериода, МЕСЯЦ) КАК МесяцНалоговогоПериода,
		|	ДоходыПредыдущегоМестаРаботы.ФизическоеЛицо,
		|	ДоходыПредыдущегоМестаРаботы.ПримененнаяЛьгота КАК ПримененнаяЛьгота,
		|	ДоходыПредыдущегоМестаРаботы.ВОСМС КАК ВОСМС
		|ПОМЕСТИТЬ ВТДоходыПредыдущегоМестаРаботы
		|ИЗ
		|	РегистрСведений.ДоходыПредыдущегоМестаРаботы КАК ДоходыПредыдущегоМестаРаботы
		|ГДЕ
		|	ДоходыПредыдущегоМестаРаботы.МесяцНалоговогоПериода МЕЖДУ &НачалоГодаПервогоМесяцаНалоговогоПериода И &ПоследнийМесяцНалоговогоПериода
		|	И ДоходыПредыдущегоМестаРаботы.Организация = &Организация
		|	И ДоходыПредыдущегоМестаРаботы.ФизическоеЛицо В
		|			(ВЫБРАТЬ
		|				СписокСотрудников.ФизическоеЛицо
		|			ИЗ
		|				ВТФизическиеЛица КАК СписокСотрудников)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода,
		|	ИсчисленныеНалогиВзносы.ФизическоеЛицо,
		|	ИсчисленныеНалогиВзносы.Подразделение,
		|	ИсчисленныеНалогиВзносы.ВидНалогаВзносаОтчисления,
		|	ИсчисленныеНалогиВзносы.ВидДохода,
		|	СУММА(ВЫБОР
		|			КОГДА ПериодыПоФизлицам.МесяцНалоговогоПериода = ИсчисленныеНалогиВзносы.МесяцНалоговогоПериода
		|				И &ОкончательныйРасчетНалоги
		|				ТОГДА ИсчисленныеНалогиВзносы.ОблагаемыйДоход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОблагаемыйДоход,
		|	СУММА(ВЫБОР
		|			КОГДА ПериодыПоФизлицам.МесяцНалоговогоПериода = ИсчисленныеНалогиВзносы.МесяцНалоговогоПериода
		|				И &ОкончательныйРасчетНалоги
		|				ТОГДА ИсчисленныеНалогиВзносы.НеоблагаемыйДоход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НеоблагаемыйДоход,
		|	СУММА(ВЫБОР
		|			КОГДА ПериодыПоФизлицам.МесяцНалоговогоПериода = ИсчисленныеНалогиВзносы.МесяцНалоговогоПериода
		|				И &ОкончательныйРасчетНалоги
		|				ТОГДА ИсчисленныеНалогиВзносы.НалогВзнос
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НалогВзнос,
		|	СУММА(ВЫБОР
		|			КОГДА ПериодыПоФизлицам.МесяцНалоговогоПериода = ИсчисленныеНалогиВзносы.МесяцНалоговогоПериода
		|				И &ОкончательныйРасчетНалоги
		|				ТОГДА ИсчисленныеНалогиВзносы.ОбъектИсчисления
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбъектИсчисления,
		|	СУММА(ВЫБОР
		|			КОГДА ПериодыПоФизлицам.МесяцНалоговогоПериода = ИсчисленныеНалогиВзносы.МесяцНалоговогоПериода
		|				И &ОкончательныйРасчетНалоги
		|				ТОГДА ИсчисленныеНалогиВзносы.ПримененныйВычет
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПримененныйВычет,
		|	СУММА(ВЫБОР
		|			КОГДА ПериодыПоФизлицам.МесяцНалоговогоПериода = ИсчисленныеНалогиВзносы.МесяцНалоговогоПериода
		|				И &ОкончательныйРасчетНалоги
		|				ТОГДА ИсчисленныеНалогиВзносы.РазрешенныйВычет
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК РазрешенныйВычет,
		|	СУММА(ВЫБОР
		|			КОГДА ПериодыПоФизлицам.МесяцНалоговогоПериода = ИсчисленныеНалогиВзносы.МесяцНалоговогоПериода
		|				И &ОкончательныйРасчетНалоги
		|				ТОГДА ИсчисленныеНалогиВзносы.ПримененнаяЛьгота
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПримененнаяЛьгота,
		|	СУММА(ВЫБОР
		|			КОГДА ПериодыПоФизлицам.МесяцНалоговогоПериода = ИсчисленныеНалогиВзносы.МесяцНалоговогоПериода
		|				И &ОкончательныйРасчетНалоги
		|				ТОГДА ИсчисленныеНалогиВзносы.ПрочиеВычеты
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПрочиеВычеты,
		|	СУММА(ВЫБОР
		|			КОГДА (НАЧАЛОПЕРИОДА(ПериодыПоФизлицам.МесяцНалоговогоПериода, ГОД) = НАЧАЛОПЕРИОДА(ИсчисленныеНалогиВзносы.МесяцНалоговогоПериода, ГОД)
		|				И ПериодыПоФизлицам.МесяцНалоговогоПериода > ИсчисленныеНалогиВзносы.МесяцНалоговогоПериода)
		|				ИЛИ (ПериодыПоФизлицам.МесяцНалоговогоПериода = ИсчисленныеНалогиВзносы.МесяцНалоговогоПериода И &ОкончательныйРасчетНалоги)
		|				ТОГДА ИсчисленныеНалогиВзносы.ПримененныйВычет
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПримененныйВычетСНачалаГода,
		|	СУММА(ВЫБОР
		|			КОГДА (НАЧАЛОПЕРИОДА(ПериодыПоФизлицам.МесяцНалоговогоПериода, ГОД) = НАЧАЛОПЕРИОДА(ИсчисленныеНалогиВзносы.МесяцНалоговогоПериода, ГОД)
		|				И ПериодыПоФизлицам.МесяцНалоговогоПериода > ИсчисленныеНалогиВзносы.МесяцНалоговогоПериода)
		|				ИЛИ (ПериодыПоФизлицам.МесяцНалоговогоПериода = ИсчисленныеНалогиВзносы.МесяцНалоговогоПериода И &ОкончательныйРасчетНалоги)
		|				ТОГДА ИсчисленныеНалогиВзносы.РазрешенныйВычет
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК РазрешенныйВычетСНачалаГода,
		|	СУММА(ВЫБОР
		|			КОГДА (НАЧАЛОПЕРИОДА(ПериодыПоФизлицам.МесяцНалоговогоПериода, ГОД) = НАЧАЛОПЕРИОДА(ИсчисленныеНалогиВзносы.МесяцНалоговогоПериода, ГОД)
		|				И ПериодыПоФизлицам.МесяцНалоговогоПериода > ИсчисленныеНалогиВзносы.МесяцНалоговогоПериода)
		|				ИЛИ (ПериодыПоФизлицам.МесяцНалоговогоПериода = ИсчисленныеНалогиВзносы.МесяцНалоговогоПериода И &ОкончательныйРасчетНалоги)
		|				ТОГДА ИсчисленныеНалогиВзносы.ПримененнаяЛьгота
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПримененнаяЛьготаСНачалаГода,
		|	0 КАК ВОСМСПредыдущегоМестаРаботы
		|ПОМЕСТИТЬ ВТРанееИсчисленныеНалогиВзносы
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ПериодыПоФизлицам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИсчисленныеНалогиВзносы КАК ИсчисленныеНалогиВзносы
		|		ПО ПериодыПоФизлицам.МесяцНалоговогоПериода >= ИсчисленныеНалогиВзносы.МесяцНалоговогоПериода
		|			И ПериодыПоФизлицам.ФизическоеЛицо = ИсчисленныеНалогиВзносы.ФизическоеЛицо
		|
		|СГРУППИРОВАТЬ ПО
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода,
		|	ИсчисленныеНалогиВзносы.Подразделение,
		|	ИсчисленныеНалогиВзносы.ФизическоеЛицо,
		|	ИсчисленныеНалогиВзносы.ВидНалогаВзносаОтчисления,
		|	ИсчисленныеНалогиВзносы.ВидДохода
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода,
		|	ДоходыПредыдущегоМестаРаботы.ФизическоеЛицо,
		|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН),
		|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	СУММА(ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ПериодыПоФизлицам.МесяцНалоговогоПериода, ГОД) = НАЧАЛОПЕРИОДА(ДоходыПредыдущегоМестаРаботы.МесяцНалоговогоПериода, ГОД)
		|				ТОГДА ДоходыПредыдущегоМестаРаботы.ПримененнаяЛьгота
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	0
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ПериодыПоФизлицам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДоходыПредыдущегоМестаРаботы КАК ДоходыПредыдущегоМестаРаботы
		|		ПО ПериодыПоФизлицам.МесяцНалоговогоПериода >= ДоходыПредыдущегоМестаРаботы.МесяцНалоговогоПериода
		|			И ПериодыПоФизлицам.ФизическоеЛицо = ДоходыПредыдущегоМестаРаботы.ФизическоеЛицо
		|
		|СГРУППИРОВАТЬ ПО
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода,
		|	ДоходыПредыдущегоМестаРаботы.ФизическоеЛицо
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода,
		|	ДоходыПредыдущегоМестаРаботы.ФизическоеЛицо,
		|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС),
		|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПустаяСсылка),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	СУММА(ДоходыПредыдущегоМестаРаботы.ВОСМС)
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ПериодыПоФизлицам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДоходыПредыдущегоМестаРаботы КАК ДоходыПредыдущегоМестаРаботы
		|		ПО ПериодыПоФизлицам.МесяцНалоговогоПериода = ДоходыПредыдущегоМестаРаботы.МесяцНалоговогоПериода
		|			И ПериодыПоФизлицам.ФизическоеЛицо = ДоходыПредыдущегоМестаРаботы.ФизическоеЛицо
		|
		|СГРУППИРОВАТЬ ПО
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода,
		|	ДоходыПредыдущегоМестаРаботы.ФизическоеЛицо";
		
	Если ОкончательныйРасчет Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОкончательныйРасчетНалоги", "Истина");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОкончательныйРасчетНалоги", "ИсчисленныеНалогиВзносы.ДанныеМежрасчетногоПериода");
	КонецЕсли;
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТПериодыПоФизлицам КАК ПериодыПоФизлицам", "ВТПериодыПоФизлицамОбъединенная КАК ПериодыПоФизлицам");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПОМЕСТИТЬ ВТРанееИсчисленныеНалогиВзносы", "ПОМЕСТИТЬ ВТРанееИсчисленныеНалогиВзносыОбъедененная");
	КонецЕсли;
	
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносы");	
	УничтожитьВТ.Добавить("ВТДоходыПредыдущегоМестаРаботы");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
КонецПроцедуры

Процедура СоздатьВТРазмерыМЗППоПериодам(МенеджерВременныхТаблиц) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(МинимальнаяЗаработнаяПлата.Период) КАК ПериодМЗП,
		|	МАКСИМУМ(МинимальнаяЗаработнаяПлатаНаНачалоГода.Период) КАК ПериодМЗПНаНачалоГода,
		|	ПериодыРасчета.Период КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТПериодыМЗП
		|ИЗ
		|	ВТДатыПоМесяцам КАК ПериодыРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинимальнаяОплатаТрудаРФ КАК МинимальнаяЗаработнаяПлата
		|		ПО ПериодыРасчета.Период >= МинимальнаяЗаработнаяПлата.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинимальнаяОплатаТрудаРФ КАК МинимальнаяЗаработнаяПлатаНаНачалоГода
		|		ПО НАЧАЛОПЕРИОДА(ПериодыРасчета.Период, ГОД) >= МинимальнаяЗаработнаяПлатаНаНачалоГода.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ПериодыРасчета.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПериодыМЗП.МесяцНалоговогоПериода,
		|	ЕСТЬNULL(МинимальнаяЗаработнаяПлата.Размер, 0) КАК РазмерМЗП,
		|	ЕСТЬNULL(МинимальнаяЗаработнаяПлатаНаНачалоГода.Размер, 0) КАК РазмерМЗПНаНачалоГода
		|ПОМЕСТИТЬ ВТРазмерыМЗППоПериодам
		|ИЗ
		|	ВТПериодыМЗП КАК ВТПериодыМЗП
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинимальнаяОплатаТрудаРФ КАК МинимальнаяЗаработнаяПлата
		|		ПО ВТПериодыМЗП.ПериодМЗП = МинимальнаяЗаработнаяПлата.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинимальнаяОплатаТрудаРФ КАК МинимальнаяЗаработнаяПлатаНаНачалоГода
		|		ПО ВТПериодыМЗП.ПериодМЗПНаНачалоГода = МинимальнаяЗаработнаяПлатаНаНачалоГода.Период
		|";
		
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТПериодыМЗП");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
КонецПроцедуры

Процедура СоздатьВТНалогообложениеНачисленийПоПериодам(МенеджерВременныхТаблиц) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(НалогообложениеНачислений.Период) КАК ПериодСведений,
		|	НалогообложениеНачислений.Начисление,
		|	ПериодыРасчета.Период КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТПериодыСведений
		|ИЗ
		|	ВТДатыПоМесяцам КАК ПериодыРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений КАК НалогообложениеНачислений
		|		ПО ПериодыРасчета.Период >= НалогообложениеНачислений.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	НалогообложениеНачислений.Начисление,
		|	ПериодыРасчета.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПериодыСведений.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	НалогообложениеНачислений.Начисление,
		|	НалогообложениеНачислений.ВидДохода,
		|
		|	НалогообложениеНачислений.СпособОбложенияОПВ,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюОПВ,
		|
		|	НалогообложениеНачислений.СпособОбложенияИПН,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюИПН,
		|
		|	НалогообложениеНачислений.СпособОбложенияСО,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюСО,
		|
		|	НалогообложениеНачислений.СпособОбложенияСН,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюСН,
		|
		|	НалогообложениеНачислений.СпособОбложенияОППВ,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюОППВ,
		|
		|	НалогообложениеНачислений.СпособОбложенияВОСМС,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюВОСМС,
		|
		|	НалогообложениеНачислений.СпособОбложенияООСМС,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюООСМС
		|
		|ПОМЕСТИТЬ ВТНалогообложениеНачислений
		|ИЗ
		|	ВТПериодыСведений КАК ВТПериодыСведений
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений КАК НалогообложениеНачислений
		|		ПО ВТПериодыСведений.ПериодСведений = НалогообложениеНачислений.Период
		|			И ВТПериодыСведений.Начисление = НалогообложениеНачислений.Начисление";
		
	Запрос.Выполнить();	
	УничтожитьВТ.Добавить("ВТПериодыСведений");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);

КонецПроцедуры

Процедура СоздатьВТСпособыОкругления(Организация, МесяцНачисления, МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МесяцНачисления", МесяцНачисления);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПорядокОкругленияРезультатовРасчетаЗарплатыСрезПоследних.Период,
		|	ПорядокОкругленияРезультатовРасчетаЗарплатыСрезПоследних.ВидРасчета,
		|	ПорядокОкругленияРезультатовРасчетаЗарплатыСрезПоследних.СпособОкругления
		|ПОМЕСТИТЬ ВТСпособыОкругления
		|ИЗ
		|	РегистрСведений.ПорядокОкругленияРезультатовРасчетаЗарплаты.СрезПоследних(&МесяцНачисления, Организация = &Организация) КАК ПорядокОкругленияРезультатовРасчетаЗарплатыСрезПоследних";
		
	Запрос.Выполнить();
	
КонецПроцедуры
	
// Универсальные функции и процедуры

Процедура СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаОтчисления, ИмяВТИсключаемыеЛица = Неопределено, ИсключаемыеЛицаУдалитьСвязьПоПериоду = Истина)
	
	УничтожитьВТ = Новый Массив;
	
	Если ИмяВТИсключаемыеЛица = Неопределено Тогда
		ИмяВТИсключаемыеЛица = 
			"(ВЫБРАТЬ
			|	NULL КАК ФизическоеЛицо)";
	КонецЕсли;
	
	// Облагаемые и необлагаемые доходы 
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	НалогообложениеНачислений.МесяцНалоговогоПериода,
		|	НалогообложениеНачислений.Начисление,
		|	НалогообложениеНачислений.ВидДохода,
		|	ВЫБОР
		|		КОГДА &ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОПВ)
		|			ТОГДА НалогообложениеНачислений.СпособОбложенияОПВ
		|		КОГДА &ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН)
		|			ТОГДА НалогообложениеНачислений.СпособОбложенияИПН
		|		КОГДА &ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СО)
		|			ТОГДА НалогообложениеНачислений.СпособОбложенияСО
		|		КОГДА &ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СН)
		|			ТОГДА НалогообложениеНачислений.СпособОбложенияСН
		|		КОГДА &ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОППВ)
		|			ТОГДА НалогообложениеНачислений.СпособОбложенияОППВ
		|		КОГДА &ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС)
		|			ТОГДА НалогообложениеНачислений.СпособОбложенияВОСМС
		|		КОГДА &ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ООСМС)
		|			ТОГДА НалогообложениеНачислений.СпособОбложенияООСМС
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ПустаяСсылка)
		|	КОНЕЦ КАК СпособОбложения,
		|	ВЫБОР
		|		КОГДА &ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОПВ)
		|			ТОГДА НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюОПВ
		|		КОГДА &ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН)
		|			ТОГДА НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюИПН
		|		КОГДА &ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СО)
		|			ТОГДА НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюСО
		|		КОГДА &ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СН)
		|			ТОГДА НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюСН
		|		КОГДА &ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОППВ)
		|			ТОГДА НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюОППВ
		|		КОГДА &ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС)
		|			ТОГДА НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюВОСМС
		|		КОГДА &ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ООСМС)
		|			ТОГДА НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюООСМС
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)
		|	КОНЕЦ КАК ДоходНеПодлежащийНалогообложению
		|ПОМЕСТИТЬ ВТНалогообложениеНачисленийПоВидуНалогаВзноса
		|ИЗ
		|	ВТНалогообложениеНачислений КАК НалогообложениеНачислений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогобложениеНачислений.МесяцНалоговогоПериода,
		|	СведенияОДоходах.Подразделение,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	НалогобложениеНачислений.ВидДохода,
		|	СУММА(СведенияОДоходах.СуммаДохода) КАК СуммаДохода,
		|	СУММА(ВЫБОР
		|			КОГДА НалогобложениеНачислений.СпособОбложения = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)
		|					ИЛИ НалогобложениеНачислений.СпособОбложения = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично)
		|				ТОГДА СведенияОДоходах.СуммаДохода
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОблагаемыйДоход,
		|	СУММА(ВЫБОР
		|			КОГДА НалогобложениеНачислений.СпособОбложения = ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
		|				ТОГДА СведенияОДоходах.СуммаДохода
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НеоблагаемыйДоход
		|ПОМЕСТИТЬ ВТДоходыПоПодразделениям
		|ИЗ
		|	ВТСведенияОДоходах КАК СведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогообложениеНачисленийПоВидуНалогаВзноса КАК НалогобложениеНачислений
		|		ПО СведенияОДоходах.Начисление = НалогобложениеНачислений.Начисление
		|			И СведенияОДоходах.МесяцНалоговогоПериода = НалогобложениеНачислений.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ #ВТИсключаемыеЛица КАК ИсключаемыеЛица
		|		ПО СведенияОДоходах.ФизическоеЛицо = ИсключаемыеЛица.ФизическоеЛицо
		|			И (ВЫБОР
		|				КОГДА ИсключаемыеЛица.МесяцНалоговогоПериода = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ СведенияОДоходах.МесяцНалоговогоПериода = ИсключаемыеЛица.МесяцНалоговогоПериода
		|			КОНЕЦ)
		|ГДЕ
		|	ИсключаемыеЛица.ФизическоеЛицо ЕСТЬ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	НалогобложениеНачислений.МесяцНалоговогоПериода,
		|	СведенияОДоходах.Подразделение,
		|	СведенияОДоходах.ФизическоеЛицо,
		|	НалогобложениеНачислений.ВидДохода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОНеоблагаемыхДоходах.МесяцНалоговогоПериода,
		|	СведенияОНеоблагаемыхДоходах.Подразделение,
		|	СведенияОНеоблагаемыхДоходах.ФизическоеЛицо,
		|	НалогобложениеНачислений.ВидДохода,
		|	0,
		|	-СведенияОНеоблагаемыхДоходах.НеоблагаемыйДоход,
		|	СведенияОНеоблагаемыхДоходах.НеоблагаемыйДоход
		|ИЗ
		|	ВТСведенияОНеоблагаемыхДоходах КАК СведенияОНеоблагаемыхДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогообложениеНачисленийПоВидуНалогаВзноса КАК НалогобложениеНачислений
		|		ПО СведенияОНеоблагаемыхДоходах.Начисление = НалогобложениеНачислений.Начисление
		|			И СведенияОНеоблагаемыхДоходах.МесяцНалоговогоПериода = НалогобложениеНачислений.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ #ВТИсключаемыеЛица КАК ИсключаемыеЛица
		|		ПО СведенияОНеоблагаемыхДоходах.ФизическоеЛицо = ИсключаемыеЛица.ФизическоеЛицо
		|			И (ВЫБОР
		|				КОГДА ИсключаемыеЛица.МесяцНалоговогоПериода = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ СведенияОНеоблагаемыхДоходах.МесяцНалоговогоПериода = ИсключаемыеЛица.МесяцНалоговогоПериода
		|			КОНЕЦ)
		|ГДЕ
		|	СведенияОНеоблагаемыхДоходах.ВидНалогаВзносаОтчисления = &ВидНалогаВзносаОтчисления	
		|	И ИсключаемыеЛица.ФизическоеЛицо ЕСТЬ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыФизическихЛиц.МесяцНалоговогоПериода,
		|	ДоходыФизическихЛиц.ФизическоеЛицо,
		|	ДоходыФизическихЛиц.ВидДохода,
		|	СУММА(ДоходыФизическихЛиц.СуммаДохода) КАК СуммаДохода,
		|	СУММА(ДоходыФизическихЛиц.ОблагаемыйДоход) КАК ОблагаемыйДоход,
		|	СУММА(ДоходыФизическихЛиц.НеоблагаемыйДоход) КАК НеоблагаемыйДоход
		|ПОМЕСТИТЬ ВТДоходы
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыФизическихЛиц
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоходыФизическихЛиц.МесяцНалоговогоПериода,
		|	ДоходыФизическихЛиц.ФизическоеЛицо,
		|	ДоходыФизическихЛиц.ВидДохода";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ВТИсключаемыеЛица", ИмяВТИсключаемыеЛица);
	Если ИсключаемыеЛицаУдалитьСвязьПоПериоду Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
					"И (ВЫБОР
					|				КОГДА ИсключаемыеЛица.МесяцНалоговогоПериода = ДАТАВРЕМЯ(1, 1, 1)
					|					ТОГДА ИСТИНА
					|				ИНАЧЕ СведенияОДоходах.МесяцНалоговогоПериода = ИсключаемыеЛица.МесяцНалоговогоПериода
					|			КОНЕЦ)", "");	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
					"И (ВЫБОР
					|				КОГДА ИсключаемыеЛица.МесяцНалоговогоПериода = ДАТАВРЕМЯ(1, 1, 1)
					|					ТОГДА ИСТИНА
					|				ИНАЧЕ СведенияОНеоблагаемыхДоходах.МесяцНалоговогоПериода = ИсключаемыеЛица.МесяцНалоговогоПериода
					|			КОНЕЦ)", "");	
	КонецЕсли;
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ВидНалогаВзносаОтчисления", ВидНалогаВзносаОтчисления);
	Запрос.Выполнить();	
	УничтожитьВТ.Добавить("ВТНалогообложениеНачисленийПоВидуНалогаВзноса");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
КонецПроцедуры

Процедура СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаОтчисления, ПредоставлятьВычетВМесяцеОтсутствияДохода = Ложь)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ВидНалогаВзносаОтчисления", ВидНалогаВзносаОтчисления);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РанееИсчисленныеНалогиВзносы.МесяцНалоговогоПериода,
		|	РанееИсчисленныеНалогиВзносы.Подразделение,
		|	РанееИсчисленныеНалогиВзносы.ФизическоеЛицо,
		|	РанееИсчисленныеНалогиВзносы.ВидДохода,
		|	РанееИсчисленныеНалогиВзносы.ОблагаемыйДоход,
		|	РанееИсчисленныеНалогиВзносы.НеоблагаемыйДоход,
		|	РанееИсчисленныеНалогиВзносы.НалогВзнос,
		|	РанееИсчисленныеНалогиВзносы.ОбъектИсчисления,
		|	РанееИсчисленныеНалогиВзносы.ПримененныйВычет,
		|	РанееИсчисленныеНалогиВзносы.РазрешенныйВычет,
		|	РанееИсчисленныеНалогиВзносы.ПримененнаяЛьгота,
		|	РанееИсчисленныеНалогиВзносы.ПрочиеВычеты,
		|	РанееИсчисленныеНалогиВзносы.ПримененныйВычетСНачалаГода,
		|	РанееИсчисленныеНалогиВзносы.РазрешенныйВычетСНачалаГода,
		|	РанееИсчисленныеНалогиВзносы.ПримененнаяЛьготаСНачалаГода
		|ПОМЕСТИТЬ ВТИсчисленныеНалогиВзносыПоПодразделениям
		|ИЗ
		|	ВТРанееИсчисленныеНалогиВзносы КАК РанееИсчисленныеНалогиВзносы
		|ГДЕ
		|	РанееИсчисленныеНалогиВзносы.ВидНалогаВзносаОтчисления = &ВидНалогаВзносаОтчисления";
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТРанееИсчисленныеНалогиВзносы КАК РанееИсчисленныеНалогиВзносы", "ВТРанееИсчисленныеНалогиВзносыОбъедененная КАК РанееИсчисленныеНалогиВзносы");
	КонецЕсли;
		
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаОтчисления)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидНалогаВзносаОтчисления", ВидНалогаВзносаОтчисления);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТСпособыОкругления.СпособОкругления
		|ИЗ
		|	ВТСпособыОкругления КАК ВТСпособыОкругления
		|ГДЕ
		|	ВТСпособыОкругления.ВидРасчета = &ВидНалогаВзносаОтчисления";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СпособОкругления = Выборка.СпособОкругления;
	Иначе 
		СпособОкругления = Справочники.СпособыОкругленияПриРасчетеЗарплаты.ПоУмолчанию();
	КонецЕсли;
	
	Возврат СпособОкругления;
	
КонецФункции

Функция ПолучитьСпособОкругленияСПериодом(МенеджерВременныхТаблиц, ВидНалогаВзносаОтчисления)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидНалогаВзносаОтчисления", ВидНалогаВзносаОтчисления);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТСпособыОкругления.Период,
		|	ВТСпособыОкругления.СпособОкругления
		|ИЗ
		|	ВТСпособыОкругления КАК ВТСпособыОкругления
		|ГДЕ
		|	ВТСпособыОкругления.ВидРасчета = &ВидНалогаВзносаОтчисления";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДанныеОкругления = Новый Структура("Период, СпособОкругления", Выборка.Период, Выборка.СпособОкругления);
	Иначе 
		ДанныеОкругления = Новый Структура("Период, СпособОкругления", '00010101', Справочники.СпособыОкругленияПриРасчетеЗарплаты.ПоУмолчанию());
	КонецЕсли;
	
	Возврат ДанныеОкругления;
	
КонецФункции

Процедура РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРаспределения, ДоходыМесяца, РаспределяемыеРесурсы, Точность = 2)
	
	МассивРесурсов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(РаспределяемыеРесурсы);
	КоэффициентыПодразделений = ОбщегоНазначения.ВыгрузитьКолонку(ДоходыМесяца, "ОблагаемыйДоход");    
	СоответствиеРаспределений = Новый Соответствие;
	// типовая БСП процедура в некоторых ситуациях производит округление числа, при отсутствии распределения
	// Например
	// РаспределяемаяСумма 117 569.98 (погрешность -0.02)
	// Коэффициенты (массив из одной строки) 117 569.98
	// Точность 0
	// Типовая возвращает округленное значение 117570
	// При отсутствии распределения округление происходить не должно и должно вернуться число 117 569.98	
	ПроизводитьРаспределение = КоэффициентыПодразделений.Количество() > 1;
	
	Для Каждого Ресурс Из МассивРесурсов Цикл 
		Если СтрокаРаспределения[Ресурс] = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПроизводитьРаспределение Тогда
			РаспределениеРесурса = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СтрокаРаспределения[Ресурс], КоэффициентыПодразделений, Точность);
		Иначе
			РаспределениеРесурса = Новый Массив;
			РаспределениеРесурса.Добавить(СтрокаРаспределения[Ресурс]);
		КонецЕсли;
		
		Если РаспределениеРесурса = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СоответствиеРаспределений.Вставить(Ресурс, РаспределениеРесурса);
	КонецЦикла;
	
	Если ДоходыМесяца.Количество() > 0 Тогда
		
		Индекс = 0;
		Для Каждого СтрокаДоходы Из ДоходыМесяца Цикл
			НоваяСтрока = РезультатыРасчетов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспределения,, РаспределяемыеРесурсы);
			НоваяСтрока.Подразделение = ДоходыМесяца[Индекс].Подразделение;
			НоваяСтрока.ОблагаемыйДоход = СтрокаДоходы.ОблагаемыйДоход;
			НоваяСтрока.НеоблагаемыйДоход = СтрокаДоходы.НеоблагаемыйДоход;
			НоваяСтрока.ОблагаемыйДоходВЦеломЗаПериод = СтрокаДоходы.ОблагаемыйДоход;
			НоваяСтрока.НеоблагаемыйДоходВЦеломЗаПериод = СтрокаДоходы.НеоблагаемыйДоход;
			Для Каждого  Ресурс Из МассивРесурсов Цикл
				РаспределениеРесурса = СоответствиеРаспределений.Получить(Ресурс);
				Если РаспределениеРесурса = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				НоваяСтрока[Ресурс] = РаспределениеРесурса[Индекс];
				НоваяСтрока[Ресурс + "ВЦеломЗаПериод"] = РаспределениеРесурса[Индекс];
			КонецЦикла;
			Индекс = Индекс + 1;
		КонецЦикла;
		
	Иначе
		
		НоваяСтрока = РезультатыРасчетов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспределения);
		
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьКоэффициентКРаспределениюПоВидуДохода(РаспределениеПоВидамДохода, НастройкиВидовВычетаПоВидамДоходаМесяцаПоВидуВычета, ВидДохода)
	
	// рассчитываем коэффициент, если более одного вида дохода
	Если РаспределениеПоВидамДохода.Количество() < 2 Тогда
		Возврат 1;
	КонецЕсли;
	
	СуммаДоходовВычета = 0;
	
	Для Каждого СтрокаНастроек Из НастройкиВидовВычетаПоВидамДоходаМесяцаПоВидуВычета Цикл
		
		СтрокаСуммы = РаспределениеПоВидамДохода.Найти(СтрокаНастроек.ВидДохода, "ВидДохода");
		
		Если НЕ СтрокаСуммы = Неопределено Тогда
			СуммаДоходовВычета = СуммаДоходовВычета + СтрокаСуммы.ОблагаемыйДоход;
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокаВидаДохода = РаспределениеПоВидамДохода.Найти(ВидДохода, "ВидДохода");
	
	Если СтрокаВидаДохода = Неопределено
		ИЛИ СуммаДоходовВычета = 0 Тогда
		Возврат 1;
	Иначе
		Возврат СтрокаВидаДохода.ОблагаемыйДоход / СуммаДоходовВычета;
	КонецЕсли;
	
КонецФункции

Процедура РаспределитьНалогиВзносыПоПодразделениямИВидуДохода(РезультатыРасчетов, СтрокаРаспределения, ДоходыМесяца, ДоходыПоВидамДохода, РаспределяемыеРесурсы, НастройкиВидовВычетаПоВидамДоходаМесяца, Точность = 2)
	
	// распредилить по подразделению
	МассивРесурсов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(РаспределяемыеРесурсы);
	КоэффициентыПодразделений = ОбщегоНазначения.ВыгрузитьКолонку(ДоходыМесяца, "ОблагаемыйДоход");    
	СоответствиеРаспределений = Новый Соответствие;
	МаксимальныйПриоритет = ЗарплатаКадрыРКПовтИсп.МаксимальныйПриоритетВычетаИПН();
	// типовая БСП процедура в некоторых ситуациях производит округление числа, при отсутствии распределения
	// Например
	// РаспределяемаяСумма 117 569.98 (погрешность -0.02)
	// Коэффициенты (массив из одной строки) 117 569.98
	// Точность 0
	// Типовая возвращает округленное значение 117570
	// При отсутствии распределения округление происходить не должно и должно вернуться число 117 569.98	
	ПроизводитьРаспределение = КоэффициентыПодразделений.Количество() > 1;
	
	Для Каждого Ресурс Из МассивРесурсов Цикл 
		Если СтрокаРаспределения[Ресурс] = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		КоэффициентПоВидуДохода = 1;
		
		ЭтоРесурРазрешенный = СтрНайти(Ресурс, "Разрешенный") > 0;
		
		// применяем коэффициент только для разрешенного вычета
		Если СтрНайти(Ресурс, "Разрешенный") > 0  Тогда
			
			Счетчик = МаксимальныйПриоритет;
			
			Пока Счетчик <> 0 Цикл
				
				Позиция = СтрНайти(Ресурс, Строка(Счетчик));
				
				Если Позиция <> 0 Тогда
					Прервать;
				КонецЕсли;
				
				Счетчик = Счетчик - 1;
				
			КонецЦикла;
			
			Если Счетчик <> 0 Тогда
				Если СтрокаРаспределения["ИспользуетсяПоНесколькимВидамДохода" + Строка(Счетчик)] Тогда
					НастройкиВидовВычетаПоВидамДоходаМесяцаПоВидуВычета = НастройкиВидовВычетаПоВидамДоходаМесяца.Скопировать(Новый Структура("ВидВычета", СтрокаРаспределения["ВидВычета" + Строка(Счетчик)]));
					КоэффициентПоВидуДохода = ПолучитьКоэффициентКРаспределениюПоВидуДохода(ДоходыПоВидамДохода, НастройкиВидовВычетаПоВидамДоходаМесяцаПоВидуВычета, СтрокаРаспределения.ВидДохода);
				Иначе
					КоэффициентПоВидуДохода = 1;
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПроизводитьРаспределение Тогда
			// округлим до одного знака после запятой, уберем погрешность КоэффициентПоВидуДохода
			РаспределениеРесурса = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СтрокаРаспределения[Ресурс] * КоэффициентПоВидуДохода, КоэффициентыПодразделений, ?(ЭтоРесурРазрешенный И КоэффициентПоВидуДохода > 1, 1, 2));
		Иначе
			РаспределениеРесурса = Новый Массив;
			РаспределениеРесурса.Добавить(СтрокаРаспределения[Ресурс] * КоэффициентПоВидуДохода);
		КонецЕсли;
		
		Если РаспределениеРесурса = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СоответствиеРаспределений.Вставить(Ресурс, РаспределениеРесурса);
	КонецЦикла;
	
	Индекс = 0;
	Для Каждого СтрокаДоходы Из ДоходыМесяца Цикл
		НоваяСтрока = РезультатыРасчетов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспределения,, РаспределяемыеРесурсы);
		НоваяСтрока.Подразделение = ДоходыМесяца[Индекс].Подразделение;
		НоваяСтрока.ОблагаемыйДоход = СтрокаДоходы.ОблагаемыйДоход;
		НоваяСтрока.НеоблагаемыйДоход = СтрокаДоходы.НеоблагаемыйДоход;
		НоваяСтрока.ОблагаемыйДоходВЦеломЗаПериод = СтрокаДоходы.ОблагаемыйДоход;
		НоваяСтрока.НеоблагаемыйДоходВЦеломЗаПериод = СтрокаДоходы.НеоблагаемыйДоход;
		Для Каждого  Ресурс Из МассивРесурсов Цикл
			РаспределениеРесурса = СоответствиеРаспределений.Получить(Ресурс);
			Если РаспределениеРесурса = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока[Ресурс] = РаспределениеРесурса[Индекс];
			НоваяСтрока[Ресурс + "ВЦеломЗаПериод"] = РаспределениеРесурса[Индекс];
		КонецЦикла;
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецПроцедуры


// Расчет ИПН

// Расчеты до 2018 года

Процедура СоздатьВТЛьготыФизическихЛиц(МенеджерВременныхТаблиц)
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	// Льготы физических лиц	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ЛьготыФизическихЛицИПН.Период) КАК Период,
		|	ЛьготыФизическихЛицИПН.ФизическоеЛицо,
		|	ПериодыРасчета.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТПериодыЛьгот
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ПериодыРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛьготыФизическихЛицИПН КАК ЛьготыФизическихЛицИПН
		|		ПО ПериодыРасчета.МесяцНалоговогоПериода >= ЛьготыФизическихЛицИПН.Период
		|			И ПериодыРасчета.ФизическоеЛицо = ЛьготыФизическихЛицИПН.ФизическоеЛицо
		|			И ЛьготыФизическихЛицИПН.Активность
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛьготыФизическихЛицИПН.ФизическоеЛицо,
		|	ПериодыРасчета.МесяцНалоговогоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПериодыЛьгот.ФизическоеЛицо,
		|	ВТПериодыЛьгот.МесяцНалоговогоПериода,
		|	ЛьготыФизическихЛицИПН.КатегорияЛицаПолучателяЛьготы
		|ПОМЕСТИТЬ ВТКатегорииЛьготФизическихЛиц
		|ИЗ
		|	ВТПериодыЛьгот КАК ВТПериодыЛьгот
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛьготыФизическихЛицИПН КАК ЛьготыФизическихЛицИПН
		|		ПО ВТПериодыЛьгот.Период = ЛьготыФизическихЛицИПН.Период
		|			И ВТПериодыЛьгот.ФизическоеЛицо = ЛьготыФизическихЛицИПН.ФизическоеЛицо
		|			И ЛьготыФизическихЛицИПН.Активность
		|ГДЕ
		|	(ЛьготыФизическихЛицИПН.ДействуетДо = ДАТАВРЕМЯ(1,1,1) 
		|		ИЛИ ЛьготыФизическихЛицИПН.ДействуетДо >= ВТПериодыЛьгот.МесяцНалоговогоПериода)
		|	И ЛьготыФизическихЛицИПН.ПредоставлятьЛьготу
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(РазмерыЛьготИПН.Период) КАК Период,
		|	РазмерыЛьготИПН.КатегорияЛицаПолучателяЛьготы,
		|	ПериодыРасчета.Период КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТПериодыРазмеровЛьгот
		|ИЗ
		|	ВТДатыПоМесяцам КАК ПериодыРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерыЛьготИПН КАК РазмерыЛьготИПН
		|		ПО ПериодыРасчета.Период >= РазмерыЛьготИПН.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	РазмерыЛьготИПН.КатегорияЛицаПолучателяЛьготы,
		|	ПериодыРасчета.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПериодыРазмеровЛьгот.КатегорияЛицаПолучателяЛьготы,
		|	ВТПериодыРазмеровЛьгот.МесяцНалоговогоПериода,
		|	РазмерыЛьготИПН.Размер
		|ПОМЕСТИТЬ ВТРазмерыЛьготПоКатегориям
		|ИЗ
		|	ВТПериодыРазмеровЛьгот КАК ВТПериодыРазмеровЛьгот
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерыЛьготИПН КАК РазмерыЛьготИПН
		|		ПО ВТПериодыРазмеровЛьгот.Период = РазмерыЛьготИПН.Период
		|			И ВТПериодыРазмеровЛьгот.КатегорияЛицаПолучателяЛьготы = РазмерыЛьготИПН.КатегорияЛицаПолучателяЛьготы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КатегорииЛьготФизическихЛиц.МесяцНалоговогоПериода,
		|	КатегорииЛьготФизическихЛиц.КатегорияЛицаПолучателяЛьготы,
		|	КатегорииЛьготФизическихЛиц.ФизическоеЛицо,
		|	ЕСТЬNULL(РазмерыЛьготПоКатегориям.Размер, ЕСТЬNULL(ОбщеустановленныеРазмерыЛьгот.Размер, 0)) * ЕСТЬNULL(РазмерыМЗППоПериодам.РазмерМЗПНаНачалоГода, 0) КАК РазмерЛьготы
		|ПОМЕСТИТЬ ВТЛьготыФизическихЛиц
		|ИЗ
		|	ВТКатегорииЛьготФизическихЛиц КАК КатегорииЛьготФизическихЛиц
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыЛьготПоКатегориям КАК РазмерыЛьготПоКатегориям
		|		ПО КатегорииЛьготФизическихЛиц.МесяцНалоговогоПериода = РазмерыЛьготПоКатегориям.МесяцНалоговогоПериода
		|			И КатегорииЛьготФизическихЛиц.КатегорияЛицаПолучателяЛьготы = РазмерыЛьготПоКатегориям.КатегорияЛицаПолучателяЛьготы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыЛьготПоКатегориям КАК ОбщеустановленныеРазмерыЛьгот
		|		ПО КатегорииЛьготФизическихЛиц.МесяцНалоговогоПериода = ОбщеустановленныеРазмерыЛьгот.МесяцНалоговогоПериода
		|			И (ОбщеустановленныеРазмерыЛьгот.КатегорияЛицаПолучателяЛьготы = ЗНАЧЕНИЕ(Справочник.КатегорииЛицПолучателейЛьготИПН.ПустаяСсылка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|		ПО КатегорииЛьготФизическихЛиц.МесяцНалоговогоПериода = РазмерыМЗППоПериодам.МесяцНалоговогоПериода";
		
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТПериодыЛьгот");
	УничтожитьВТ.Добавить("ВТКатегорииЛьготФизическихЛиц");
	УничтожитьВТ.Добавить("ВТПериодыРазмеровЛьгот");
	УничтожитьВТ.Добавить("ВТРазмерыЛьготПоКатегориям");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);

КонецПроцедуры

Процедура СоздатьВТПредоставлениеВычетовФизическимЛицам(МенеджерВременныхТаблиц, Организация)
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтработанноеВремя.МесяцНалоговогоПериода,
		|	ОтработанноеВремя.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВЫБОР
		|		КОГДА ОтработанноеВремя.ДатаПриема = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|		КОГДА НАЧАЛОПЕРИОДА(ОтработанноеВремя.ДатаПриема, МЕСЯЦ) < ОтработанноеВремя.МесяцНалоговогоПериода
		|			ТОГДА ОтработанноеВремя.МесяцНалоговогоПериода
		|		КОГДА НАЧАЛОПЕРИОДА(ОтработанноеВремя.ДатаПриема, МЕСЯЦ) = ОтработанноеВремя.МесяцНалоговогоПериода
		|			ТОГДА ОтработанноеВремя.ДатаПриема
		|		ИНАЧЕ ДАТАВРЕМЯ(3999, 12, 31)
		|	КОНЕЦ КАК ДатаС,
		|	ВЫБОР
		|		КОГДА ОтработанноеВремя.ДатаПриема > ОтработанноеВремя.ДатаУвольнения
		|				ИЛИ ГОД(ОтработанноеВремя.ДатаУвольнения) = 1
		|			ТОГДА КОНЕЦПЕРИОДА(ОтработанноеВремя.МесяцНалоговогоПериода, МЕСЯЦ)
		|		КОГДА ОтработанноеВремя.ДатаУвольнения < ОтработанноеВремя.МесяцНалоговогоПериода
		|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
		|		КОГДА НАЧАЛОПЕРИОДА(ОтработанноеВремя.ДатаУвольнения, МЕСЯЦ) = ОтработанноеВремя.МесяцНалоговогоПериода
		|			ТОГДА ОтработанноеВремя.ДатаУвольнения
		|		ИНАЧЕ КОНЕЦПЕРИОДА(ОтработанноеВремя.МесяцНалоговогоПериода, МЕСЯЦ)
		|	КОНЕЦ КАК ДатаПо
		|ПОМЕСТИТЬ ВТПериодыОтработанногоВремени
		|ИЗ
		|	ВТКадровыеДанныеСотрудниковПоПериодам КАК ОтработанноеВремя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыОтработанногоВремени.МесяцНалоговогоПериода,
		|	ПериодыОтработанногоВремени.ФизическоеЛицо,
		|	ВЫБОР
		|		КОГДА ПериодыОтработанногоВремени.ДатаС <= ПериодыОтработанногоВремени.ДатаПо
		|			ТОГДА РАЗНОСТЬДАТ(ПериодыОтработанногоВремени.ДатаС, ПериодыОтработанногоВремени.ДатаПо, ДЕНЬ) + 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КалендарныхДнейРаботы,
		|	ВЫБОР
		|		КОГДА ВЫБОР
		|				КОГДА ПериодыОтработанногоВремени.ДатаС <= ПериодыОтработанногоВремени.ДатаПо
		|					ТОГДА РАЗНОСТЬДАТ(ПериодыОтработанногоВремени.ДатаС, ПериодыОтработанногоВремени.ДатаПо, ДЕНЬ) + 1
		|				ИНАЧЕ 0
		|			КОНЕЦ >= 16
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПредоставлятьВычет
		|ПОМЕСТИТЬ ВТОтработанноеВремя
		|ИЗ
		|	ВТПериодыОтработанногоВремени КАК ПериодыОтработанногоВремени
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ПрименениеВычетовИПН.Период) КАК Период,
		|	ПрименениеВычетовИПН.ФизическоеЛицо,
		|	ПериодыРасчета.Период КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТПериодыПримененияВычетов
		|ИЗ
		|	ВТДатыПоМесяцам КАК ПериодыРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрименениеВычетовИПН КАК ПрименениеВычетовИПН
		|		ПО ПериодыРасчета.Период >= ПрименениеВычетовИПН.Период
		|			И ПрименениеВычетовИПН.Активность 
		|
		|СГРУППИРОВАТЬ ПО
		|	ПрименениеВычетовИПН.ФизическоеЛицо,
		|	ПериодыРасчета.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПериодыПримененияВычетов.ФизическоеЛицо,
		|	ВТПериодыПримененияВычетов.МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТПрименениеВычетов
		|ИЗ
		|	ВТПериодыПримененияВычетов КАК ВТПериодыПримененияВычетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрименениеВычетовИПН КАК ПрименениеВычетовИПН
		|		ПО ВТПериодыПримененияВычетов.Период = ПрименениеВычетовИПН.Период
		|			И ВТПериодыПримененияВычетов.ФизическоеЛицо = ПрименениеВычетовИПН.ФизическоеЛицо
		|			И ПрименениеВычетовИПН.Активность
		|ГДЕ
		|	ПрименениеВычетовИПН.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВычетыФизическихЛицИПН.Период) КАК Период,
		|	ВычетыФизическихЛицИПН.ФизическоеЛицо,
		|	ПериодыРасчета.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТПериодыВычетов
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ПериодыРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВычетыФизическихЛицИПН КАК ВычетыФизическихЛицИПН
		|		ПО ПериодыРасчета.МесяцНалоговогоПериода >= ВычетыФизическихЛицИПН.Период
		|			И ПериодыРасчета.ФизическоеЛицо = ВычетыФизическихЛицИПН.ФизическоеЛицо
		|			И ВычетыФизическихЛицИПН.Активность
		|
		|СГРУППИРОВАТЬ ПО
		|	ВычетыФизическихЛицИПН.ФизическоеЛицо,
		|	ПериодыРасчета.МесяцНалоговогоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыВычетов.ФизическоеЛицо,
		|	ПериодыВычетов.МесяцНалоговогоПериода,
		|	ВычетыФизическихЛицИПН.ПредоставлятьВычет
		|ПОМЕСТИТЬ ВТСтандартныеВычетыФизическихЛиц
		|ИЗ
		|	ВТПериодыВычетов КАК ПериодыВычетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВычетыФизическихЛицИПН КАК ВычетыФизическихЛицИПН
		|		ПО ПериодыВычетов.Период = ВычетыФизическихЛицИПН.Период
		|			И ПериодыВычетов.ФизическоеЛицо = ВычетыФизическихЛицИПН.ФизическоеЛицо
		|			И ВычетыФизическихЛицИПН.Активность
		|ГДЕ
		|	ВычетыФизическихЛицИПН.ПредоставлятьВычет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтандартныеВычетыФизическихЛиц.МесяцНалоговогоПериода,
		|	СтандартныеВычетыФизическихЛиц.ФизическоеЛицо,
		|	ЕСТЬNULL(СтандартныеВычетыФизическихЛиц.ПредоставлятьВычет, ЛОЖЬ) КАК ЕстьЗаявлениеНаВычет, 
		|	ЕСТЬNULL(ОтработанноеВремя.ПредоставлятьВычет, ЛОЖЬ) КАК ПредоставлятьВычет,
		|	ОтработанноеВремя.КалендарныхДнейРаботы, 
		|   ВЫБОР
		|		КОГДА ЕСТЬNULL(СтандартныеВычетыФизическихЛиц.ПредоставлятьВычет, ЛОЖЬ) И ЕСТЬNULL(ОтработанноеВремя.ПредоставлятьВычет, ЛОЖЬ)
		|			ТОГДА ЕСТЬNULL(РазмерыМЗППоПериодам.РазмерМЗП, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РазмерСтандартногоВычета
		|ПОМЕСТИТЬ ВТПредоставлениеВычетовФизическимЛицам
		|ИЗ
		|	ВТСтандартныеВычетыФизическихЛиц КАК СтандартныеВычетыФизическихЛиц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПрименениеВычетов КАК ПрименениеВычетов
		|		ПО СтандартныеВычетыФизическихЛиц.ФизическоеЛицо = ПрименениеВычетов.ФизическоеЛицо
		|			И СтандартныеВычетыФизическихЛиц.МесяцНалоговогоПериода = ПрименениеВычетов.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтработанноеВремя КАК ОтработанноеВремя
		|		ПО СтандартныеВычетыФизическихЛиц.МесяцНалоговогоПериода = ОтработанноеВремя.МесяцНалоговогоПериода
		|			И СтандартныеВычетыФизическихЛиц.ФизическоеЛицо = ОтработанноеВремя.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|		ПО СтандартныеВычетыФизическихЛиц.МесяцНалоговогоПериода = РазмерыМЗППоПериодам.МесяцНалоговогоПериода";
		
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТПериодыПримененияВычетов");
	УничтожитьВТ.Добавить("ВТПериодыВычетов");
	УничтожитьВТ.Добавить("ВТПериодыОтработанногоВремени");
	УничтожитьВТ.Добавить("ВТСтандартныеВычетыФизическихЛиц");
	УничтожитьВТ.Добавить("ВТОтработанноеВремя");

	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
КонецПроцедуры

// Расчеты с 2018 года

Процедура СоздатьВТНакопленныеДанныеПоВычетам(Организация, Регистратор, МенеджерВременныхТаблиц, ПервыйМесяцНалоговогоПериода, ПоследнийМесяцНалоговогоПериода, ОкончательныйРасчет, ИсключатьДоходыРегистратора, ПредоставлятьВычетВМесяцеОтсутствияДохода = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(ПервыйМесяцНалоговогоПериода));
	Запрос.УстановитьПараметр("ПервыйМесяцНалоговогоПериода", ПервыйМесяцНалоговогоПериода);
	Запрос.УстановитьПараметр("ПоследнийМесяцНалоговогоПериода", ПоследнийМесяцНалоговогоПериода);
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ?(ИсключатьДоходыРегистратора, Регистратор, Неопределено));
	
	// Накопленные данные по вычетам	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ПериодыПоФизлицам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СведенияОбИсчисленииВычетовИПНОбороты.Подразделение,
		|	СведенияОбИсчисленииВычетовИПНОбороты.ВидВычета КАК ВидВычета,
		|	СведенияОбИсчисленииВычетовИПНОбороты.ВидДохода КАК ВидДохода,
		|	СУММА(ВЫБОР
		|			КОГДА ПериодыПоФизлицам.МесяцНалоговогоПериода = НАЧАЛОПЕРИОДА(СведенияОбИсчисленииВычетовИПНОбороты.Период, МЕСЯЦ)
		|				И &ОкончательныйРасчетДоходы
		|				ТОГДА СведенияОбИсчисленииВычетовИПНОбороты.РазрешенныйВычетОборот + ЕСТЬNULL(ВычетыДокументаИсправления.РазрешенныйВычет, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК РазрешенныйВычетВТекущемПериоде,
		|	СУММА(ВЫБОР
		|			КОГДА ПериодыПоФизлицам.МесяцНалоговогоПериода = НАЧАЛОПЕРИОДА(СведенияОбИсчисленииВычетовИПНОбороты.Период, МЕСЯЦ)
		|				И &ОкончательныйРасчетДоходы
		|				ТОГДА СведенияОбИсчисленииВычетовИПНОбороты.ПримененныйВычетОборот + ЕСТЬNULL(ВычетыДокументаИсправления.ПримененныйВычет, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПримененныйВычетВТекущемПериоде,
		|	СУММА(ВЫБОР
		|			КОГДА ПериодыПоФизлицам.НачалоГодаНалоговогоПериода = НАЧАЛОПЕРИОДА(СведенияОбИсчисленииВычетовИПНОбороты.Период, ГОД)
		|				ТОГДА СведенияОбИсчисленииВычетовИПНОбороты.РазрешенныйВычетОборот + ЕСТЬNULL(ВычетыДокументаИсправления.РазрешенныйВычет, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК РазрешенныйВычетСНачалаГода,
		|	СУММА(ВЫБОР
		|			КОГДА ПериодыПоФизлицам.НачалоГодаНалоговогоПериода = НАЧАЛОПЕРИОДА(СведенияОбИсчисленииВычетовИПНОбороты.Период, ГОД)
		|				ТОГДА СведенияОбИсчисленииВычетовИПНОбороты.ПримененныйВычетОборот + ЕСТЬNULL(ВычетыДокументаИсправления.ПримененныйВычет, 0)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПримененныйВычетСНачалаГода,
		|	СУММА(ВЫБОР
		|			КОГДА ПериодыПоФизлицам.НачалоГодаНалоговогоПериода = НАЧАЛОПЕРИОДА(СведенияОбИсчисленииВычетовИПНОбороты.Период, ГОД)
		|				И ПериодыПоФизлицам.МесяцНалоговогоПериода > СведенияОбИсчисленииВычетовИПНОбороты.Период
		|				ТОГДА СведенияОбИсчисленииВычетовИПНОбороты.РазрешенныйВычетОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК РазрешенныйВычетСНачалаГодаОтОбратного,
		|	СУММА(ВЫБОР
		|			КОГДА ПериодыПоФизлицам.НачалоГодаНалоговогоПериода = НАЧАЛОПЕРИОДА(СведенияОбИсчисленииВычетовИПНОбороты.Период, ГОД)
		|				И ПериодыПоФизлицам.МесяцНалоговогоПериода > СведенияОбИсчисленииВычетовИПНОбороты.Период
		|				ТОГДА СведенияОбИсчисленииВычетовИПНОбороты.ПримененныйВычетОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПримененныйВычетСНачалаГодаОтОбратного
		|ПОМЕСТИТЬ ВТНакопленныеДанныеПоВычетам
		|ИЗ
		|	ВТКадровыеДанныеСотрудниковПоПериодам КАК ПериодыПоФизлицам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СведенияОбИсчисленииВычетовИПН.Обороты(
		|				&НачалоГода,
		|				&ПоследнийМесяцНалоговогоПериода,
		|				Регистратор,
		|				Организация = &Организация) КАК СведенияОбИсчисленииВычетовИПНОбороты
		|		ПО ПериодыПоФизлицам.ФизическоеЛицо = СведенияОбИсчисленииВычетовИПНОбороты.ФизическоеЛицо
		|			И ПериодыПоФизлицам.МесяцНалоговогоПериода >= СведенияОбИсчисленииВычетовИПНОбороты.Период
		|			И (ПериодыПоФизлицам.НачалоГодаНалоговогоПериода = НАЧАЛОПЕРИОДА(СведенияОбИсчисленииВычетовИПНОбороты.Период, ГОД))
		// соединение по дате приема используем только для дохода работодателя, в связи с использованием вычетов по разным видам дохода
		|			И (ВЫБОР КОГДА СведенияОбИсчисленииВычетовИПНОбороты.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
		|						ТОГДА (НАЧАЛОПЕРИОДА(ПериодыПоФизлицам.ДатаПриема, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(СведенияОбИсчисленииВычетовИПНОбороты.Период, МЕСЯЦ))
		|					ИНАЧЕ ИСТИНА КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВычетыДокументаИсправления КАК ВычетыДокументаИсправления
		|		ПО ПериодыПоФизлицам.ФизическоеЛицо = ВычетыДокументаИсправления.ФизическоеЛицо
		|			И ПериодыПоФизлицам.МесяцНалоговогоПериода = ВычетыДокументаИсправления.Период
		|			И СведенияОбИсчисленииВычетовИПНОбороты.ВидВычета = ВычетыДокументаИсправления.ВидВычета
		|			И СведенияОбИсчисленииВычетовИПНОбороты.ВидВычета = ВычетыДокументаИсправления.ВидВычета
		|			И СведенияОбИсчисленииВычетовИПНОбороты.ВидДохода = ВычетыДокументаИсправления.ВидДохода
		|			И СведенияОбИсчисленииВычетовИПНОбороты.Подразделение = ВычетыДокументаИсправления.Подразделение
		|			И &ОкончательныйРасчетДоходы
		|
		|ГДЕ
		|	СведенияОбИсчисленииВычетовИПНОбороты.Регистратор <> &ИсключаемыйРегистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода,
		|	ПериодыПоФизлицам.ФизическоеЛицо,
		|	СведенияОбИсчисленииВычетовИПНОбороты.ВидВычета,
		|	СведенияОбИсчисленииВычетовИПНОбороты.ВидДохода,
		|	СведенияОбИсчисленииВычетовИПНОбороты.Подразделение
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	МесяцНалоговогоПериода,
		|	ФизическоеЛицо,
		|	ВидВычета,
		|	ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ПериодыПоФизлицам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВидыВычетовИПН.Ссылка КАК ВидВычета,
		|	СУММА(ВЫБОР
		|		КОГДА ПериодыПоФизлицам.НачалоГодаНалоговогоПериода = НАЧАЛОПЕРИОДА(ДоходыПредыдущегоМестаРаботы.МесяцНалоговогоПериода, ГОД)
		|			ТОГДА ДоходыПредыдущегоМестаРаботы.ПримененнаяЛьгота
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК ПримененныйВычетСНачалаГода
		|ПОМЕСТИТЬ ВТВычетыПримененныеУДругогоРаботодателя
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ПериодыПоФизлицам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДоходыПредыдущегоМестаРаботы КАК ДоходыПредыдущегоМестаРаботы
		|		ПО ПериодыПоФизлицам.МесяцНалоговогоПериода >= ДоходыПредыдущегоМестаРаботы.МесяцНалоговогоПериода
		|			И ПериодыПоФизлицам.ФизическоеЛицо = ДоходыПредыдущегоМестаРаботы.ФизическоеЛицо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|		ПО (ВидыВычетовИПН.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.Стандартный))
		|			И (ВидыВычетовИПН.ПериодПредоставления = ЗНАЧЕНИЕ(Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода))
		|ГДЕ
		|	ДоходыПредыдущегоМестаРаботы.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода,
		|	ПериодыПоФизлицам.ФизическоеЛицо,
		|	ВидыВычетовИПН.Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	МесяцНалоговогоПериода,
		|	ФизическоеЛицо,
		|	ВидВычета";
		
	Если ОкончательныйРасчет Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОкончательныйРасчетДоходы", "Истина");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОкончательныйРасчетДоходы", "СведенияОбИсчисленииВычетовИПНОбороты.ДанныеМежрасчетногоПериода");
	КонецЕсли;
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТКадровыеДанныеСотрудниковПоПериодам КАК ПериодыПоФизлицам", "ВТКадровыеДанныеСотрудниковПоПериодамОбъединенная КАК ПериодыПоФизлицам");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТПериодыПоФизлицам КАК ПериодыПоФизлицам", "ВТПериодыПоФизлицамОбъединенная КАК ПериодыПоФизлицам");
		
	КонецЕсли;
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВТДанныеДляРасчетаВычетовИПН(МенеджерВременныхТаблиц, Организация, ПредоставлятьВычетВМесяцеОтсутствияДохода = Ложь, МесяцНачисления) Экспорт
	
	Если МесяцНачисления >= Дата(2021,1,1) Тогда
		СоздатьВТДанныеДляРасчетаВычетовИПНПосле2021(МенеджерВременныхТаблиц, Организация, ПредоставлятьВычетВМесяцеОтсутствияДохода, МесяцНачисления);
    ИначеЕсли МесяцНачисления >= Дата(2019, 1, 1) Тогда
        СоздатьВТДанныеДляРасчетаВычетовИПНДо2021(МенеджерВременныхТаблиц, Организация, ПредоставлятьВычетВМесяцеОтсутствияДохода, МесяцНачисления);
    Иначе
        СоздатьВТДанныеДляРасчетаВычетовИПНДо2018(МенеджерВременныхТаблиц, Организация, ПредоставлятьВычетВМесяцеОтсутствияДохода, МесяцНачисления);
    КонецЕсли;

КонецПроцедуры

Процедура СоздатьВТДанныеДляРасчетаВычетовИПНПосле2021(МенеджерВременныхТаблиц, Организация, ПредоставлятьВычетВМесяцеОтсутствияДохода = Ложь, МесяцНачисления) Экспорт
    
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если НЕ ВТСуществует(МенеджерВременныхТаблиц, "ВТИсчисленныеОПВ") Тогда
		Запрос.Текст =
			"ВЫБРАТЬ
			|	NULL КАК МесяцНалоговогоПериода,
			|	NULL КАК ФизическоеЛицо,
			|	NULL КАК ВидДохода,
			|	0 КАК ИсчисленныеОПВ
			|ПОМЕСТИТЬ ВТИсчисленныеОПВ";
		Запрос.Выполнить();
	КонецЕсли;
	
    Если НЕ ВТСуществует(МенеджерВременныхТаблиц, "ВТИсчисленныеВОСМС") Тогда
    	Запрос.Текст =
    		"ВЫБРАТЬ
    		|	NULL КАК МесяцНалоговогоПериода,
    		|	NULL КАК ФизическоеЛицо,
    		|	NULL КАК ВидДохода,
    		|	0 КАК ИсчисленныеВОСМС
    		|ПОМЕСТИТЬ ВТИсчисленныеВОСМС";
    	Запрос.Выполнить();
    КонецЕсли;
	
	// Применение вычетов ИПН
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ПрименениеВычетовИПН.Период) КАК Период,
		|	ПрименениеВычетовИПН.ФизическоеЛицо,
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТПериодыПримененияВычетов
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ПериодыПоФизлицам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрименениеВычетовИПН КАК ПрименениеВычетовИПН
		|		ПО ПериодыПоФизлицам.МесяцНалоговогоПериода >= ПрименениеВычетовИПН.Период
		|			И ПериодыПоФизлицам.ФизическоеЛицо = ПрименениеВычетовИПН.ФизическоеЛицо
		|			И (ПрименениеВычетовИПН.Активность)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПрименениеВычетовИПН.ФизическоеЛицо,
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПериодыПримененияВычетов.ФизическоеЛицо,
		|	ВТПериодыПримененияВычетов.МесяцНалоговогоПериода,
		|	ПрименениеВычетовИПН.Организация
		|ПОМЕСТИТЬ ВТПрименениеВычетовИПН
		|ИЗ
		|	ВТПериодыПримененияВычетов КАК ВТПериодыПримененияВычетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрименениеВычетовИПН КАК ПрименениеВычетовИПН
		|		ПО ВТПериодыПримененияВычетов.Период = ПрименениеВычетовИПН.Период
		|			И ВТПериодыПримененияВычетов.ФизическоеЛицо = ПрименениеВычетовИПН.ФизическоеЛицо
		|			И (ПрименениеВычетовИПН.Активность)
		|ГДЕ
		|	ПрименениеВычетовИПН.Организация = &Организация";
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВТПериодыПоФизлицам КАК ПериодыПоФизлицам","ВТПериодыПоФизлицамОбъединенная КАК ПериодыПоФизлицам");
	КонецЕсли;
	
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТПериодыПримененияВычетов");
	УничтожитьВТ.Добавить("ВТПрименениеВычетовИПН");
	
	// Назначенные вычеты ИПН
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ВычетыФизическихЛицИПН.Период) КАК Период,
		|	ВычетыФизическихЛицИПН.ФизическоеЛицо,
		|	ВычетыФизическихЛицИПН.ВидВычета,
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТПериодыВычетовИПН
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ПериодыПоФизлицам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВычетыФизическихЛицИПН КАК ВычетыФизическихЛицИПН
		|		ПО ПериодыПоФизлицам.МесяцНалоговогоПериода >= ВычетыФизическихЛицИПН.Период
		|			И ПериодыПоФизлицам.ФизическоеЛицо = ВычетыФизическихЛицИПН.ФизическоеЛицо
		|			И (ВычетыФизическихЛицИПН.Активность)
		|ГДЕ
		|	ВычетыФизическихЛицИПН.ВидВычета <> ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетОПВ)
		|	И ВычетыФизическихЛицИПН.ВидВычета <> ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетВОСМС)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВычетыФизическихЛицИПН.ФизическоеЛицо,
		|	ВычетыФизическихЛицИПН.ВидВычета,
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПериодыВычетовИПН.МесяцНалоговогоПериода,
		|	ВТПериодыВычетовИПН.ФизическоеЛицо,
		|	ВТПериодыВычетовИПН.ВидВычета,
		|	ВычетыФизическихЛицИПН.ПредоставлятьВычет,
		|	ВычетыФизическихЛицИПН.ДействуетПо
		|ПОМЕСТИТЬ ВТВычетыФизическихЛицИПН
		|ИЗ
		|	ВТПериодыВычетовИПН КАК ВТПериодыВычетовИПН
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВычетыФизическихЛицИПН КАК ВычетыФизическихЛицИПН
		|		ПО ВТПериодыВычетовИПН.Период = ВычетыФизическихЛицИПН.Период
		|			И ВТПериодыВычетовИПН.ФизическоеЛицо = ВычетыФизическихЛицИПН.ФизическоеЛицо
		|			И ВТПериодыВычетовИПН.ВидВычета = ВычетыФизическихЛицИПН.ВидВычета
		|			И (ВычетыФизическихЛицИПН.Активность)
		|ГДЕ
		|	ВычетыФизическихЛицИПН.ПредоставлятьВычет
		|	И ВЫБОР
		|			КОГДА ВычетыФизическихЛицИПН.ДействуетПо = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(ВТПериодыВычетовИПН.МесяцНалоговогоПериода, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(ВычетыФизическихЛицИПН.ДействуетПо, МЕСЯЦ)
		|		КОНЕЦ";
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВТПериодыПоФизлицам КАК ПериодыПоФизлицам","ВТПериодыПоФизлицамОбъединенная КАК ПериодыПоФизлицам");
	КонецЕсли;
	
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТПериодыВычетовИПН");
	УничтожитьВТ.Добавить("ВТВычетыФизическихЛицИПН");
	
	// Прочие вычеты физических лиц
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ПрочиеВычетыФизическихЛицИПН.Период) КАК Период,
		|	ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо,
		|	ПрочиеВычетыФизическихЛицИПН.ВидВычета,
		|	ПрочиеВычетыФизическихЛицИПН.ДействуетС,
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТПериодыПрочихВычетовИПН
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ПериодыПоФизлицам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрочиеВычетыФизическихЛицИПН КАК ПрочиеВычетыФизическихЛицИПН
		|		ПО ПериодыПоФизлицам.МесяцНалоговогоПериода >= ПрочиеВычетыФизическихЛицИПН.Период
		|			И ПериодыПоФизлицам.ФизическоеЛицо = ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо
		|			И (ПрочиеВычетыФизическихЛицИПН.Активность)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо,
		|	ПрочиеВычетыФизическихЛицИПН.ВидВычета,
		|	ПрочиеВычетыФизическихЛицИПН.ДействуетС,
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПериодыПрочихВычетовИПН.МесяцНалоговогоПериода,
		|	ВТПериодыПрочихВычетовИПН.ФизическоеЛицо,
		|	ВТПериодыПрочихВычетовИПН.ВидВычета,
		|	ВТПериодыПрочихВычетовИПН.ДействуетС,
		|	ПрочиеВычетыФизическихЛицИПН.Размер,
		|	ПрочиеВычетыФизическихЛицИПН.ДействуетПо
		|ПОМЕСТИТЬ ВТПрочиеВычетыФизическихЛицИПН
		|ИЗ
		|	ВТПериодыПрочихВычетовИПН КАК ВТПериодыПрочихВычетовИПН
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрочиеВычетыФизическихЛицИПН КАК ПрочиеВычетыФизическихЛицИПН
		|		ПО ВТПериодыПрочихВычетовИПН.Период = ПрочиеВычетыФизическихЛицИПН.Период
		|			И ВТПериодыПрочихВычетовИПН.ФизическоеЛицо = ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо
		|			И ВТПериодыПрочихВычетовИПН.ВидВычета = ПрочиеВычетыФизическихЛицИПН.ВидВычета
		|			И ВТПериодыПрочихВычетовИПН.ДействуетС = ПрочиеВычетыФизическихЛицИПН.ДействуетС
		|			И (ПрочиеВычетыФизическихЛицИПН.Активность)
		|ГДЕ
		|	ВТПериодыПрочихВычетовИПН.МесяцНалоговогоПериода МЕЖДУ ПрочиеВычетыФизическихЛицИПН.ДействуетС И ПрочиеВычетыФизическихЛицИПН.ДействуетПо
		|	И ПрочиеВычетыФизическихЛицИПН.Размер <> 0";
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВТПериодыПоФизлицам КАК ПериодыПоФизлицам","ВТПериодыПоФизлицамОбъединенная КАК ПериодыПоФизлицам");
	КонецЕсли;
	
	Запрос.Выполнить();	
	УничтожитьВТ.Добавить("ВТПериодыПрочихВычетовИПН");
	УничтожитьВТ.Добавить("ВТПрочиеВычетыФизическихЛицИПН");
	
	// Размеры взносов
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеОПВ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОПВ) КАК ВидВзносов,
		|	ДанныеОПВ.ФизическоеЛицо,
		|	ДанныеОПВ.ВидДохода,
		|	ДанныеОПВ.ИсчисленныеОПВ КАК СуммаВзносов
		|ПОМЕСТИТЬ ВТРазмерыВзносов
		|ИЗ
		|	ВТИсчисленныеОПВ КАК ДанныеОПВ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеВОСМС.МесяцНалоговогоПериода,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС),
		|	ДанныеВОСМС.ФизическоеЛицо,
		|	ДанныеВОСМС.ВидДохода,
		|	ДанныеВОСМС.ИсчисленныеВОСМС
		|ИЗ
		|	ВТИсчисленныеВОСМС КАК ДанныеВОСМС";
		
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТРазмерыВзносов");
	
	// Размеры пределов
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПериодыПределов.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ПериодыПределов.ВидВычета КАК ВидВычета,
		|	РазмерыВычетовИПН.ВидПределаВычета КАК ВидПределаВычета,
		|	РазмерыВычетовИПН.Размер КАК Размер
		|ПОМЕСТИТЬ ВТРазмерыПределовПосле2018
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ПериодыВычетовИПН.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		ПериодыВычетовИПН.ВидВычета КАК ВидВычета,
		|		МАКСИМУМ(РазмерыВычетовИПН.Период) КАК Период
		|	ИЗ
		|		ВТПериодыВычетовИПН КАК ПериодыВычетовИПН
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерыВычетовИПН КАК РазмерыВычетовИПН
		|			ПО (РазмерыВычетовИПН.ВидВычетаИПН = ПериодыВычетовИПН.ВидВычета)
		|				И (РазмерыВычетовИПН.Период <= НАЧАЛОПЕРИОДА(ПериодыВычетовИПН.МесяцНалоговогоПериода, ГОД))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПериодыВычетовИПН.МесяцНалоговогоПериода,
		|		ПериодыВычетовИПН.ВидВычета) КАК ПериодыПределов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РазмерыВычетовИПН КАК РазмерыВычетовИПН
		|		ПО ПериодыПределов.Период = РазмерыВычетовИПН.Период
		|			И ПериодыПределов.ВидВычета = РазмерыВычетовИПН.ВидВычетаИПН";
		
	Запрос.Выполнить();
	
	// Настройки вычетов по видам дохода
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПериодыПределов.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ПериодыПределов.ВидВычета КАК ВидВычета,
		|	ПрименениеВычетовПоВидамДохода.ВидДохода КАК ВидДохода
		|ПОМЕСТИТЬ ВТНастройкиВычетовПоВидамДохода
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ДатыПоМесяцам.Период КАК МесяцНалоговогоПериода,
		|		ПрименениеВычетовПоВидамДохода.ВидВычетаИПН КАК ВидВычета,
		|		МАКСИМУМ(ПрименениеВычетовПоВидамДохода.Период) КАК Период
		|	ИЗ
		|		ВТДатыПоМесяцам КАК ДатыПоМесяцам
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрименениеВычетовПоВидамДохода КАК ПрименениеВычетовПоВидамДохода
		|			ПО (ПрименениеВычетовПоВидамДохода.Период <= НАЧАЛОПЕРИОДА(ДатыПоМесяцам.Период, ГОД))
		|ГДЕ	
		|	ПрименениеВычетовПоВидамДохода.Используется		
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ДатыПоМесяцам.Период,
		|		ПрименениеВычетовПоВидамДохода.ВидВычетаИПН) КАК ПериодыПределов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрименениеВычетовПоВидамДохода КАК ПрименениеВычетовПоВидамДохода
		|		ПО ПериодыПределов.Период = ПрименениеВычетовПоВидамДохода.Период
		|			И ПериодыПределов.ВидВычета = ПрименениеВычетовПоВидамДохода.ВидВычетаИПН
		|			И ПрименениеВычетовПоВидамДохода.Используется";
	
	Запрос.Выполнить();
	
	// Настройки вычетов
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВычетыФизическихЛицИПН.МесяцНалоговогоПериода,
		|	ВычетыФизическихЛицИПН.ФизическоеЛицо,
		|	ВычетыФизическихЛицИПН.ВидВычета,
		|	ВидыВычетовИПН.Приоритет,
		|	ВидыВычетовИПН.ПредоставлениеВычета,
		|	ВидыВычетовИПН.ВидВзносов,
		|	ЕСТЬNULL(РазмерыПределовПосле2018.ВидПределаВычета, ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МЗП)) КАК ВидПределаВычета,
		|	ЕСТЬNULL(РазмерыПределовПосле2018.Размер, ВидыВычетовИПН.ПределВычета) КАК ПределВычета,
		|	ВидыВычетовИПН.ПериодПредоставления
		|ПОМЕСТИТЬ ВТНастойкиВычетов
		|ИЗ
		|	ВТВычетыФизическихЛицИПН КАК ВычетыФизическихЛицИПН
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПрименениеВычетовИПН КАК ПрименениеВычетовИПН
		|		ПО ВычетыФизическихЛицИПН.МесяцНалоговогоПериода = ПрименениеВычетовИПН.МесяцНалоговогоПериода
		|			И ВычетыФизическихЛицИПН.ФизическоеЛицо = ПрименениеВычетовИПН.ФизическоеЛицо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|		ПО ВычетыФизическихЛицИПН.ВидВычета = ВидыВычетовИПН.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыПределовПосле2018 КАК РазмерыПределовПосле2018
		|		ПО ВычетыФизическихЛицИПН.ВидВычета = РазмерыПределовПосле2018.ВидВычета
		|			И ВычетыФизическихЛицИПН.МесяцНалоговогоПериода = РазмерыПределовПосле2018.МесяцНалоговогоПериода
		|			И ВычетыФизическихЛицИПН.МесяцНалоговогоПериода >= ДАТАВРЕМЯ(2019, 1, 1, 0, 0, 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТПериодыПоФизлицам.МесяцНалоговогоПериода,
		|	ВТПериодыПоФизлицам.ФизическоеЛицо,
		|	ВидыВычетовИПН.Ссылка,
		|	ВидыВычетовИПН.Приоритет,
		|	ВидыВычетовИПН.ПредоставлениеВычета,
		|	ВидыВычетовИПН.ВидВзносов,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МЗП),
		|	ВидыВычетовИПН.ПределВычета,
		|	ВидыВычетовИПН.ПериодПредоставления
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ВТПериодыПоФизлицам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|		ПО (ВидыВычетовИПН.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетОПВ))
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТПериодыПоФизлицам.МесяцНалоговогоПериода,
		|	ВТПериодыПоФизлицам.ФизическоеЛицо,
		|	ВидыВычетовИПН.Ссылка,
		|	ВидыВычетовИПН.Приоритет,
		|	ВидыВычетовИПН.ПредоставлениеВычета,
		|	ВидыВычетовИПН.ВидВзносов,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МЗП),
		|	ВидыВычетовИПН.ПределВычета,
		|	ВидыВычетовИПН.ПериодПредоставления
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ВТПериодыПоФизлицам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|		ПО (ВидыВычетовИПН.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетВОСМС))
		|ГДЕ
		|	ВТПериодыПоФизлицам.МесяцНалоговогоПериода >= ДАТАВРЕМЯ(2020, 1, 1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиВычетовПоВидамДохода.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	НастройкиВычетовПоВидамДохода.ВидВычета КАК ВидВычета,
		|	КОЛИЧЕСТВО(НастройкиВычетовПоВидамДохода.ВидДохода) КАК КоличествоВидовДохода
		|ПОМЕСТИТЬ ВТНастройкиВычетовПоВидамДоходаКоличество
		|ИЗ
		|	ВТНастройкиВычетовПоВидамДохода КАК НастройкиВычетовПоВидамДохода
		|
		|СГРУППИРОВАТЬ ПО
		|	НастройкиВычетовПоВидамДохода.МесяцНалоговогоПериода,
		|	НастройкиВычетовПоВидамДохода.ВидВычета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиВычетов.МесяцНалоговогоПериода,
		|	НастройкиВычетов.ФизическоеЛицо,
		|	НастройкиВычетов.ВидВычета,
		|	НастройкиВычетов.Приоритет,
		|	НастройкиВычетов.ПредоставлениеВычета,
		|	НастройкиВычетов.ВидВзносов,
		|	НастройкиВычетов.ПределВычета,
		|	НастройкиВычетов.ПериодПредоставления,
		|	РазмерыВзносов.ВидДохода КАК ВидДоходаВзносов,
		|	НастройкиВычетовПоВидамДохода.ВидДохода КАК ВидДоходаВычета,
		|	ЕСТЬNULL(РазмерыВзносов.СуммаВзносов, 0) КАК СуммаВзносов,
		|	ЕСТЬNULL(РазмерыМЗППоПериодам.РазмерМЗПНаНачалоГода, 0) КАК РазмерМЗПНаНачалоГода,
		|	ЕСТЬNULL(РазмерыМРППоПериодам.РазмерМРПНаНачалоГода, 0) КАК РазмерМРПНаНачалоГода,
		|	ЕСТЬNULL(ПрочиеВычетыФизическихЛицИПН.Размер, 0) КАК РазмерПрочегоВычета,
		|	ВЫБОР
		|		КОГДА НастройкиВычетовПоВидамДоходаКоличество.КоличествоВидовДохода > 1
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ИспользуетсяПоНесколькимВидамДохода,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СтатусыФизическихЛицКакНалогоплательщиков.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Резидент)
		|			ТОГДА 
		|				ВЫБОР
		|					КОГДА НастройкиВычетов.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.Стандартный)
		|						ТОГДА НастройкиВычетов.ПределВычета * 
		|								ВЫБОР
		|									КОГДА НастройкиВычетов.ВидПределаВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МРП)
		|										ТОГДА ЕСТЬNULL(РазмерыМРППоПериодам.РазмерМРПНаНачалоГода, 0)
		|									ИНАЧЕ ЕСТЬNULL(РазмерыМЗППоПериодам.РазмерМЗПНаНачалоГода, 0)
		|								КОНЕЦ
		|					КОГДА НастройкиВычетов.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов)
		|						ТОГДА ЕСТЬNULL(РазмерыВзносов.СуммаВзносов, 0)
		|					КОГДА НастройкиВычетов.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.ПоПериодическимПлатежам)
		|						ТОГДА ЕСТЬNULL(ПрочиеВычетыФизическихЛицИПН.Размер, 0)
		|					ИНАЧЕ 0 
		|				КОНЕЦ
		| 		ИНАЧЕ 0 
		|	КОНЕЦ КАК РазмерВычета,
		|	ВЫБОР
		|		КОГДА НастройкиВычетов.ПредоставлениеВычета В (ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.Стандартный), ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.ПоПериодическимПлатежам))
		|			ТОГДА НастройкиВычетов.ПределВычета * ВЫБОР
		|					КОГДА НастройкиВычетов.ВидПределаВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МРП)
		|						ТОГДА ЕСТЬNULL(РазмерыМРППоПериодам.РазмерМРПНаНачалоГода, 0)
		|					ИНАЧЕ ЕСТЬNULL(РазмерыМЗППоПериодам.РазмерМЗПНаНачалоГода, 0)
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммовойПределВычета
		|ПОМЕСТИТЬ ВТНастройкиИРазмерыВычетов
		|ИЗ
		|	ВТНастойкиВычетов КАК НастройкиВычетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыВзносов КАК РазмерыВзносов
		|		ПО НастройкиВычетов.МесяцНалоговогоПериода = РазмерыВзносов.МесяцНалоговогоПериода
		|			И НастройкиВычетов.ФизическоеЛицо = РазмерыВзносов.ФизическоеЛицо
		|			И НастройкиВычетов.ВидВзносов = РазмерыВзносов.ВидВзносов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизическихЛицКакНалогоплательщиков КАК СтатусыФизическихЛицКакНалогоплательщиков
		|		ПО НастройкиВычетов.МесяцНалоговогоПериода = СтатусыФизическихЛицКакНалогоплательщиков.МесяцНалоговогоПериода
		|			И НастройкиВычетов.ФизическоеЛицо = СтатусыФизическихЛицКакНалогоплательщиков.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|		ПО НастройкиВычетов.МесяцНалоговогоПериода = РазмерыМЗППоПериодам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыМРППоПериодам КАК РазмерыМРППоПериодам
		|		ПО НастройкиВычетов.МесяцНалоговогоПериода = РазмерыМРППоПериодам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНастройкиВычетовПоВидамДоходаКоличество КАК НастройкиВычетовПоВидамДоходаКоличество
		|		ПО НастройкиВычетов.МесяцНалоговогоПериода = НастройкиВычетовПоВидамДоходаКоличество.МесяцНалоговогоПериода
		|			И НастройкиВычетов.ВидВычета = НастройкиВычетовПоВидамДоходаКоличество.ВидВычета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНастройкиВычетовПоВидамДохода КАК НастройкиВычетовПоВидамДохода
		|		ПО НастройкиВычетовПоВидамДоходаКоличество.ВидВычета = НастройкиВычетовПоВидамДохода.ВидВычета
		|			И НастройкиВычетовПоВидамДоходаКоличество.МесяцНалоговогоПериода = НастройкиВычетовПоВидамДохода.МесяцНалоговогоПериода
		// распределение более одного вида дохода у вычета будет происходить при расчете налога
		|			И НастройкиВычетовПоВидамДоходаКоличество.КоличествоВидовДохода = 1
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПрочиеВычетыФизическихЛицИПН КАК ПрочиеВычетыФизическихЛицИПН
		|		ПО НастройкиВычетов.МесяцНалоговогоПериода = ПрочиеВычетыФизическихЛицИПН.МесяцНалоговогоПериода
		|			И НастройкиВычетов.ФизическоеЛицо = ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо
		|			И НастройкиВычетов.ВидВычета = ПрочиеВычетыФизическихЛицИПН.ВидВычета
		|";
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВТПериодыПоФизлицам КАК ПериодыПоФизлицам","ВТПериодыПоФизлицамОбъединенная КАК ПериодыПоФизлицам");
	КонецЕсли;
	
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТНастойкиВычетов");
	УничтожитьВТ.Добавить("ВТНастройкиИРазмерыВычетов");
	УничтожитьВТ.Добавить("ВТРазмерыПределовПосле2018");
	УничтожитьВТ.Добавить("ВТНастройкиВычетовПоВидамДоходаКоличество");
		
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиИРазмерыВычетов.МесяцНалоговогоПериода,
		|	НастройкиИРазмерыВычетов.ФизическоеЛицо,
		|	НастройкиИРазмерыВычетов.ВидВычета,
		|	НастройкиИРазмерыВычетов.Приоритет,
		|	НастройкиИРазмерыВычетов.ПредоставлениеВычета,
		|	НастройкиИРазмерыВычетов.ВидВзносов,
		|	НастройкиИРазмерыВычетов.ПределВычета,
		|	НастройкиИРазмерыВычетов.ПериодПредоставления,
		|	НастройкиИРазмерыВычетов.ВидДоходаВзносов,
		|	НастройкиИРазмерыВычетов.ВидДоходаВычета,
		|	НастройкиИРазмерыВычетов.ИспользуетсяПоНесколькимВидамДохода,
		|	НастройкиИРазмерыВычетов.РазмерВычета,
		|	НастройкиИРазмерыВычетов.СуммовойПределВычета,
		|	СУММА(ЕСТЬNULL(НакопленныеДанныеПоВычетам.РазрешенныйВычетВТекущемПериоде, 0)) КАК РазрешенныйВычетВТекущемПериоде,
		|	СУММА(ЕСТЬNULL(НакопленныеДанныеПоВычетам.ПримененныйВычетВТекущемПериоде, 0)) КАК ПримененныйВычетВТекущемПериоде,
		|	СУММА(ЕСТЬNULL(НакопленныеДанныеПоВычетам.РазрешенныйВычетСНачалаГода, 0)) КАК РазрешенныйВычетСНачалаГода,
		|	СУММА(ЕСТЬNULL(НакопленныеДанныеПоВычетам.ПримененныйВычетСНачалаГода, 0) + ЕСТЬNULL(ВычетыПримененныеУДругогоРаботодателя.ПримененныйВычетСНачалаГода, 0)) КАК ПримененныйВычетСНачалаГода,
		|	СУММА(ЕСТЬNULL(НакопленныеДанныеПоВычетам.РазрешенныйВычетСНачалаГодаОтОбратного, 0)) КАК РазрешенныйВычетСНачалаГодаОтОбратного,
		|	СУММА(ЕСТЬNULL(НакопленныеДанныеПоВычетам.ПримененныйВычетСНачалаГодаОтОбратного, 0) + ЕСТЬNULL(ВычетыПримененныеУДругогоРаботодателя.ПримененныйВычетСНачалаГода, 0)) КАК ПримененныйВычетСНачалаГодаОтОбратного
		|ПОМЕСТИТЬ ВТДанныеДляРасчетаВычетовИПН
		|ИЗ
		|	ВТНастройкиИРазмерыВычетов КАК НастройкиИРазмерыВычетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНакопленныеДанныеПоВычетам КАК НакопленныеДанныеПоВычетам
		|		ПО НастройкиИРазмерыВычетов.МесяцНалоговогоПериода = НакопленныеДанныеПоВычетам.МесяцНалоговогоПериода
		|			И НастройкиИРазмерыВычетов.ФизическоеЛицо = НакопленныеДанныеПоВычетам.ФизическоеЛицо
		|			И НастройкиИРазмерыВычетов.ВидВычета = НакопленныеДанныеПоВычетам.ВидВычета
		|			И НастройкиИРазмерыВычетов.МесяцНалоговогоПериода = НакопленныеДанныеПоВычетам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВычетыПримененныеУДругогоРаботодателя КАК ВычетыПримененныеУДругогоРаботодателя
		|		ПО НастройкиИРазмерыВычетов.МесяцНалоговогоПериода = ВычетыПримененныеУДругогоРаботодателя.МесяцНалоговогоПериода
		|			И НастройкиИРазмерыВычетов.ФизическоеЛицо = ВычетыПримененныеУДругогоРаботодателя.ФизическоеЛицо
		|			И НастройкиИРазмерыВычетов.ВидВычета = ВычетыПримененныеУДругогоРаботодателя.ВидВычета
		|
		|СГРУППИРОВАТЬ ПО
		|	НастройкиИРазмерыВычетов.МесяцНалоговогоПериода,
		|	НастройкиИРазмерыВычетов.ФизическоеЛицо,
		|	НастройкиИРазмерыВычетов.ВидВычета,
		|	НастройкиИРазмерыВычетов.Приоритет,
		|	НастройкиИРазмерыВычетов.ПредоставлениеВычета,
		|	НастройкиИРазмерыВычетов.ВидВзносов,
		|	НастройкиИРазмерыВычетов.ПределВычета,
		|	НастройкиИРазмерыВычетов.ПериодПредоставления,
		|	НастройкиИРазмерыВычетов.ВидДоходаВзносов,
		|	НастройкиИРазмерыВычетов.ВидДоходаВычета,
		|	НастройкиИРазмерыВычетов.ИспользуетсяПоНесколькимВидамДохода,
		|	НастройкиИРазмерыВычетов.РазмерВычета,
		|	НастройкиИРазмерыВычетов.СуммовойПределВычета";
		
	Запрос.Выполнить();
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);

КонецПроцедуры

Процедура СоздатьВТДанныеДляРасчетаВычетовИПНДо2021(МенеджерВременныхТаблиц, Организация, ПредоставлятьВычетВМесяцеОтсутствияДохода = Ложь, МесяцНачисления) Экспорт
    
	УничтожитьВТ = Новый Массив;
	
	// если применяется корректировка прочих доходов, то расчет ВОСМС происходит позже расчета ИПН
	ПрименятьКорректировкуПрочихНалоговВзносовОтчислений = ЗарплатаКадрыРКПовтИсп.ПрименятьКорректировкуПрочихНалоговВзносовОтчислений(ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(Организация), МесяцНачисления);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ПрименятьВычетВОСМСДляФизическихЛиц = ЗарплатаКадрыРКПовтИсп.ПрименятьВычетВОСМСДляФизическихЛицИГПХ(Организация, МесяцНачисления);
	ПрименятьВычетОПВиВОСМСГПХ = ЗарплатаКадрыРКПовтИсп.ПрименятьВычетОПВиВОСМСДляГПХ(Организация, МесяцНачисления);
	
	Если НЕ ВТСуществует(МенеджерВременныхТаблиц, "ВТИсчисленныеОПВ") Тогда
		Запрос.Текст =
			"ВЫБРАТЬ
			|	NULL КАК МесяцНалоговогоПериода,
			|	NULL КАК ФизическоеЛицо,
			|	NULL КАК ВидДохода,
			|	0 КАК ИсчисленныеОПВ
			|ПОМЕСТИТЬ ВТИсчисленныеОПВ";
		Запрос.Выполнить();
	КонецЕсли;
	
	Если НЕ ВТСуществует(МенеджерВременныхТаблиц, "ВТИсчисленныеВОСМС")
		И НЕ ПрименятьКорректировкуПрочихНалоговВзносовОтчислений Тогда
		Запрос.Текст =
			"ВЫБРАТЬ
			|	NULL КАК МесяцНалоговогоПериода,
			|	NULL КАК ФизическоеЛицо,
			|	NULL КАК ВидДохода,
			|	0 КАК ИсчисленныеВОСМС
			|ПОМЕСТИТЬ ВТИсчисленныеВОСМС";
		Запрос.Выполнить();
	КонецЕсли;
	
	// Применение вычетов ИПН
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ПрименениеВычетовИПН.Период) КАК Период,
		|	ПрименениеВычетовИПН.ФизическоеЛицо,
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТПериодыПримененияВычетов
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ПериодыПоФизлицам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрименениеВычетовИПН КАК ПрименениеВычетовИПН
		|		ПО ПериодыПоФизлицам.МесяцНалоговогоПериода >= ПрименениеВычетовИПН.Период
		|			И ПериодыПоФизлицам.ФизическоеЛицо = ПрименениеВычетовИПН.ФизическоеЛицо
		|			И (ПрименениеВычетовИПН.Активность)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПрименениеВычетовИПН.ФизическоеЛицо,
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПериодыПримененияВычетов.ФизическоеЛицо,
		|	ВТПериодыПримененияВычетов.МесяцНалоговогоПериода,
		|	ПрименениеВычетовИПН.Организация
		|ПОМЕСТИТЬ ВТПрименениеВычетовИПН
		|ИЗ
		|	ВТПериодыПримененияВычетов КАК ВТПериодыПримененияВычетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрименениеВычетовИПН КАК ПрименениеВычетовИПН
		|		ПО ВТПериодыПримененияВычетов.Период = ПрименениеВычетовИПН.Период
		|			И ВТПериодыПримененияВычетов.ФизическоеЛицо = ПрименениеВычетовИПН.ФизическоеЛицо
		|			И (ПрименениеВычетовИПН.Активность)
		|ГДЕ
		|	ПрименениеВычетовИПН.Организация = &Организация";
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВТПериодыПоФизлицам КАК ПериодыПоФизлицам","ВТПериодыПоФизлицамОбъединенная КАК ПериодыПоФизлицам");
	КонецЕсли;
	
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТПериодыПримененияВычетов");
	УничтожитьВТ.Добавить("ВТПрименениеВычетовИПН");
	
	// Назначенные вычеты ИПН
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ВычетыФизическихЛицИПН.Период) КАК Период,
		|	ВычетыФизическихЛицИПН.ФизическоеЛицо,
		|	ВычетыФизическихЛицИПН.ВидВычета,
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТПериодыВычетовИПН
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ПериодыПоФизлицам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВычетыФизическихЛицИПН КАК ВычетыФизическихЛицИПН
		|		ПО ПериодыПоФизлицам.МесяцНалоговогоПериода >= ВычетыФизическихЛицИПН.Период
		|			И ПериодыПоФизлицам.ФизическоеЛицо = ВычетыФизическихЛицИПН.ФизическоеЛицо
		|			И (ВычетыФизическихЛицИПН.Активность)
		|ГДЕ
		|	ВычетыФизическихЛицИПН.ВидВычета <> ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетОПВ)
		|	И ВычетыФизическихЛицИПН.ВидВычета <> ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетВОСМС)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВычетыФизическихЛицИПН.ФизическоеЛицо,
		|	ВычетыФизическихЛицИПН.ВидВычета,
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПериодыВычетовИПН.МесяцНалоговогоПериода,
		|	ВТПериодыВычетовИПН.ФизическоеЛицо,
		|	ВТПериодыВычетовИПН.ВидВычета,
		|	ВычетыФизическихЛицИПН.ПредоставлятьВычет,
		|	ВычетыФизическихЛицИПН.ДействуетПо
		|ПОМЕСТИТЬ ВТВычетыФизическихЛицИПН
		|ИЗ
		|	ВТПериодыВычетовИПН КАК ВТПериодыВычетовИПН
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВычетыФизическихЛицИПН КАК ВычетыФизическихЛицИПН
		|		ПО ВТПериодыВычетовИПН.Период = ВычетыФизическихЛицИПН.Период
		|			И ВТПериодыВычетовИПН.ФизическоеЛицо = ВычетыФизическихЛицИПН.ФизическоеЛицо
		|			И ВТПериодыВычетовИПН.ВидВычета = ВычетыФизическихЛицИПН.ВидВычета
		|			И (ВычетыФизическихЛицИПН.Активность)
		|ГДЕ
		|	ВычетыФизическихЛицИПН.ПредоставлятьВычет
		|	И ВЫБОР
		|			КОГДА ВычетыФизическихЛицИПН.ДействуетПо = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(ВТПериодыВычетовИПН.МесяцНалоговогоПериода, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(ВычетыФизическихЛицИПН.ДействуетПо, МЕСЯЦ)
		|		КОНЕЦ";
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВТПериодыПоФизлицам КАК ПериодыПоФизлицам","ВТПериодыПоФизлицамОбъединенная КАК ПериодыПоФизлицам");
	КонецЕсли;
	
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТПериодыВычетовИПН");
	УничтожитьВТ.Добавить("ВТВычетыФизическихЛицИПН");
	
	// Прочие вычеты физических лиц
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ПрочиеВычетыФизическихЛицИПН.Период) КАК Период,
		|	ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо,
		|	ПрочиеВычетыФизическихЛицИПН.ВидВычета,
		|	ПрочиеВычетыФизическихЛицИПН.ДействуетС,
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТПериодыПрочихВычетовИПН
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ПериодыПоФизлицам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрочиеВычетыФизическихЛицИПН КАК ПрочиеВычетыФизическихЛицИПН
		|		ПО ПериодыПоФизлицам.МесяцНалоговогоПериода >= ПрочиеВычетыФизическихЛицИПН.Период
		|			И ПериодыПоФизлицам.ФизическоеЛицо = ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо
		|			И (ПрочиеВычетыФизическихЛицИПН.Активность)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо,
		|	ПрочиеВычетыФизическихЛицИПН.ВидВычета,
		|	ПрочиеВычетыФизическихЛицИПН.ДействуетС,
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПериодыПрочихВычетовИПН.МесяцНалоговогоПериода,
		|	ВТПериодыПрочихВычетовИПН.ФизическоеЛицо,
		|	ВТПериодыПрочихВычетовИПН.ВидВычета,
		|	ВТПериодыПрочихВычетовИПН.ДействуетС,
		|	ПрочиеВычетыФизическихЛицИПН.Размер,
		|	ПрочиеВычетыФизическихЛицИПН.ДействуетПо
		|ПОМЕСТИТЬ ВТПрочиеВычетыФизическихЛицИПН
		|ИЗ
		|	ВТПериодыПрочихВычетовИПН КАК ВТПериодыПрочихВычетовИПН
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрочиеВычетыФизическихЛицИПН КАК ПрочиеВычетыФизическихЛицИПН
		|		ПО ВТПериодыПрочихВычетовИПН.Период = ПрочиеВычетыФизическихЛицИПН.Период
		|			И ВТПериодыПрочихВычетовИПН.ФизическоеЛицо = ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо
		|			И ВТПериодыПрочихВычетовИПН.ВидВычета = ПрочиеВычетыФизическихЛицИПН.ВидВычета
		|			И ВТПериодыПрочихВычетовИПН.ДействуетС = ПрочиеВычетыФизическихЛицИПН.ДействуетС
		|			И (ПрочиеВычетыФизическихЛицИПН.Активность)
		|ГДЕ
		|	ВТПериодыПрочихВычетовИПН.МесяцНалоговогоПериода МЕЖДУ ПрочиеВычетыФизическихЛицИПН.ДействуетС И ПрочиеВычетыФизическихЛицИПН.ДействуетПо
		|	И ПрочиеВычетыФизическихЛицИПН.Размер <> 0";
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВТПериодыПоФизлицам КАК ПериодыПоФизлицам","ВТПериодыПоФизлицамОбъединенная КАК ПериодыПоФизлицам");
	КонецЕсли;
	
	Запрос.Выполнить();	
	УничтожитьВТ.Добавить("ВТПериодыПрочихВычетовИПН");
	УничтожитьВТ.Добавить("ВТПрочиеВычетыФизическихЛицИПН");
	
	// Размеры взносов
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеОПВ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОПВ) КАК ВидВзносов,
		|	ДанныеОПВ.ФизическоеЛицо,
		|	ДанныеОПВ.ВидДохода,
		|	ДанныеОПВ.ИсчисленныеОПВ КАК СуммаВзносов
		|ПОМЕСТИТЬ ВТРазмерыВзносов
		|ИЗ
		|	ВТИсчисленныеОПВ КАК ДанныеОПВ
		|" + ?(НЕ ПрименятьКорректировкуПрочихНалоговВзносовОтчислений, "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеВОСМС.МесяцНалоговогоПериода,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС),
		|	ДанныеВОСМС.ФизическоеЛицо,
		|	ДанныеВОСМС.ВидДохода,
		|	ДанныеВОСМС.ИсчисленныеВОСМС
		|ИЗ
		|	ВТИсчисленныеВОСМС КАК ДанныеВОСМС", "") 
		+ ?(НЕ МенеджерВременныхТаблиц.Таблицы.Найти("ВТИсчисленныеВОСМСДоходОтНалоговогоАгента") = Неопределено, "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеВОСМС.МесяцНалоговогоПериода,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС),
		|	ДанныеВОСМС.ФизическоеЛицо,
		|	ДанныеВОСМС.ВидДохода,
		|	ДанныеВОСМС.ИсчисленныеВОСМС
		|ИЗ
		|	ВТИсчисленныеВОСМСДоходОтНалоговогоАгента КАК ДанныеВОСМС", "");
		
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТРазмерыВзносов");
	
	// Размеры пределов
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПериодыПределов.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ПериодыПределов.ВидВычета КАК ВидВычета,
		|	РазмерыВычетовИПН.ВидПределаВычета КАК ВидПределаВычета,
		|	РазмерыВычетовИПН.Размер КАК Размер
		|ПОМЕСТИТЬ ВТРазмерыПределовПосле2018
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ПериодыВычетовИПН.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		ПериодыВычетовИПН.ВидВычета КАК ВидВычета,
		|		МАКСИМУМ(РазмерыВычетовИПН.Период) КАК Период
		|	ИЗ
		|		ВТПериодыВычетовИПН КАК ПериодыВычетовИПН
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерыВычетовИПН КАК РазмерыВычетовИПН
		|			ПО (РазмерыВычетовИПН.ВидВычетаИПН = ПериодыВычетовИПН.ВидВычета)
		|				И (РазмерыВычетовИПН.Период <= НАЧАЛОПЕРИОДА(ПериодыВычетовИПН.МесяцНалоговогоПериода, ГОД))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПериодыВычетовИПН.МесяцНалоговогоПериода,
		|		ПериодыВычетовИПН.ВидВычета) КАК ПериодыПределов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РазмерыВычетовИПН КАК РазмерыВычетовИПН
		|		ПО ПериодыПределов.Период = РазмерыВычетовИПН.Период
		|			И ПериодыПределов.ВидВычета = РазмерыВычетовИПН.ВидВычетаИПН";
		
	Запрос.Выполнить();
	
	// Настройки вычетов по видам дохода
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПериодыПределов.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ПериодыПределов.ВидВычета КАК ВидВычета,
		|	ПрименениеВычетовПоВидамДохода.ВидДохода КАК ВидДохода
		|ПОМЕСТИТЬ ВТНастройкиВычетовПоВидамДохода
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ДатыПоМесяцам.Период КАК МесяцНалоговогоПериода,
		|		ПрименениеВычетовПоВидамДохода.ВидВычетаИПН КАК ВидВычета,
		|		МАКСИМУМ(ПрименениеВычетовПоВидамДохода.Период) КАК Период
		|	ИЗ
		|		ВТДатыПоМесяцам КАК ДатыПоМесяцам
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрименениеВычетовПоВидамДохода КАК ПрименениеВычетовПоВидамДохода
		|			ПО (ПрименениеВычетовПоВидамДохода.Период <= НАЧАЛОПЕРИОДА(ДатыПоМесяцам.Период, ГОД))
		|ГДЕ	
		|	ПрименениеВычетовПоВидамДохода.Используется		
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ДатыПоМесяцам.Период,
		|		ПрименениеВычетовПоВидамДохода.ВидВычетаИПН) КАК ПериодыПределов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрименениеВычетовПоВидамДохода КАК ПрименениеВычетовПоВидамДохода
		|		ПО ПериодыПределов.Период = ПрименениеВычетовПоВидамДохода.Период
		|			И ПериодыПределов.ВидВычета = ПрименениеВычетовПоВидамДохода.ВидВычетаИПН
		|			И ПрименениеВычетовПоВидамДохода.Используется";
	
	Запрос.Выполнить();
	
	// Настройки вычетов
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВычетыФизическихЛицИПН.МесяцНалоговогоПериода,
		|	ВычетыФизическихЛицИПН.ФизическоеЛицо,
		|	ВычетыФизическихЛицИПН.ВидВычета,
		|	ВидыВычетовИПН.Приоритет,
		|	ВидыВычетовИПН.ПредоставлениеВычета,
		|	ВидыВычетовИПН.ВидВзносов,
		|	ЕСТЬNULL(РазмерыПределовПосле2018.ВидПределаВычета, ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МЗП)) КАК ВидПределаВычета,
		|	ЕСТЬNULL(РазмерыПределовПосле2018.Размер, ВидыВычетовИПН.ПределВычета) КАК ПределВычета,
		|	ВидыВычетовИПН.ПериодПредоставления
		|ПОМЕСТИТЬ ВТНастойкиВычетов
		|ИЗ
		|	ВТВычетыФизическихЛицИПН КАК ВычетыФизическихЛицИПН
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПрименениеВычетовИПН КАК ПрименениеВычетовИПН
		|		ПО ВычетыФизическихЛицИПН.МесяцНалоговогоПериода = ПрименениеВычетовИПН.МесяцНалоговогоПериода
		|			И ВычетыФизическихЛицИПН.ФизическоеЛицо = ПрименениеВычетовИПН.ФизическоеЛицо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|		ПО ВычетыФизическихЛицИПН.ВидВычета = ВидыВычетовИПН.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыПределовПосле2018 КАК РазмерыПределовПосле2018
		|		ПО ВычетыФизическихЛицИПН.ВидВычета = РазмерыПределовПосле2018.ВидВычета
		|			И ВычетыФизическихЛицИПН.МесяцНалоговогоПериода = РазмерыПределовПосле2018.МесяцНалоговогоПериода
		|			И ВычетыФизическихЛицИПН.МесяцНалоговогоПериода >= ДАТАВРЕМЯ(2019, 1, 1, 0, 0, 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТПериодыПоФизлицам.МесяцНалоговогоПериода,
		|	ВТПериодыПоФизлицам.ФизическоеЛицо,
		|	ВидыВычетовИПН.Ссылка,
		|	ВидыВычетовИПН.Приоритет,
		|	ВидыВычетовИПН.ПредоставлениеВычета,
		|	ВидыВычетовИПН.ВидВзносов,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МЗП),
		|	ВидыВычетовИПН.ПределВычета,
		|	ВидыВычетовИПН.ПериодПредоставления
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ВТПериодыПоФизлицам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|		ПО (ВидыВычетовИПН.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетОПВ))
		|" + ?(ПрименятьВычетВОСМСДляФизическихЛиц ИЛИ ПрименятьВычетОПВиВОСМСГПХ, "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТПериодыПоФизлицам.МесяцНалоговогоПериода,
		|	ВТПериодыПоФизлицам.ФизическоеЛицо,
		|	ВидыВычетовИПН.Ссылка,
		|	ВидыВычетовИПН.Приоритет,
		|	ВидыВычетовИПН.ПредоставлениеВычета,
		|	ВидыВычетовИПН.ВидВзносов,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МЗП),
		|	ВидыВычетовИПН.ПределВычета,
		|	ВидыВычетовИПН.ПериодПредоставления
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ВТПериодыПоФизлицам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|		ПО (ВидыВычетовИПН.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетВОСМС))
		|ГДЕ
		|	ВТПериодыПоФизлицам.МесяцНалоговогоПериода >= ДАТАВРЕМЯ(2020, 1, 1)", "") + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиВычетовПоВидамДохода.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	НастройкиВычетовПоВидамДохода.ВидВычета КАК ВидВычета,
		|	КОЛИЧЕСТВО(НастройкиВычетовПоВидамДохода.ВидДохода) КАК КоличествоВидовДохода
		|ПОМЕСТИТЬ ВТНастройкиВычетовПоВидамДоходаКоличество
		|ИЗ
		|	ВТНастройкиВычетовПоВидамДохода КАК НастройкиВычетовПоВидамДохода
		|
		|СГРУППИРОВАТЬ ПО
		|	НастройкиВычетовПоВидамДохода.МесяцНалоговогоПериода,
		|	НастройкиВычетовПоВидамДохода.ВидВычета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиВычетов.МесяцНалоговогоПериода,
		|	НастройкиВычетов.ФизическоеЛицо,
		|	НастройкиВычетов.ВидВычета,
		|	НастройкиВычетов.Приоритет,
		|	НастройкиВычетов.ПредоставлениеВычета,
		|	НастройкиВычетов.ВидВзносов,
		|	НастройкиВычетов.ПределВычета,
		|	НастройкиВычетов.ПериодПредоставления,
		|	РазмерыВзносов.ВидДохода КАК ВидДоходаВзносов,
		|	НастройкиВычетовПоВидамДохода.ВидДохода КАК ВидДоходаВычета,
		|	ЕСТЬNULL(РазмерыВзносов.СуммаВзносов, 0) КАК СуммаВзносов,
		|	ЕСТЬNULL(РазмерыМЗППоПериодам.РазмерМЗПНаНачалоГода, 0) КАК РазмерМЗПНаНачалоГода,
		|	ЕСТЬNULL(РазмерыМРППоПериодам.РазмерМРПНаНачалоГода, 0) КАК РазмерМРПНаНачалоГода,
		|	ЕСТЬNULL(ПрочиеВычетыФизическихЛицИПН.Размер, 0) КАК РазмерПрочегоВычета,
		|	ВЫБОР
		|		КОГДА НастройкиВычетовПоВидамДоходаКоличество.КоличествоВидовДохода > 1
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ИспользуетсяПоНесколькимВидамДохода,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СтатусыФизическихЛицКакНалогоплательщиков.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Резидент)
		|			ТОГДА 
		|				ВЫБОР
		|					КОГДА НастройкиВычетов.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.Стандартный)
		|						ТОГДА НастройкиВычетов.ПределВычета * 
		|								ВЫБОР
		|									КОГДА НастройкиВычетов.ВидПределаВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МРП)
		|										ТОГДА ЕСТЬNULL(РазмерыМРППоПериодам.РазмерМРПНаНачалоГода, 0)
		|									ИНАЧЕ ЕСТЬNULL(РазмерыМЗППоПериодам.РазмерМЗПНаНачалоГода, 0)
		|								КОНЕЦ
		|					КОГДА НастройкиВычетов.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов)
		|						ТОГДА ЕСТЬNULL(РазмерыВзносов.СуммаВзносов, 0)
		|					КОГДА НастройкиВычетов.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.ПоПериодическимПлатежам)
		|						ТОГДА ЕСТЬNULL(ПрочиеВычетыФизическихЛицИПН.Размер, 0)
		|					ИНАЧЕ 0 
		|				КОНЕЦ
		| 		ИНАЧЕ 0 
		|	КОНЕЦ КАК РазмерВычета,
		|	ВЫБОР
		|		КОГДА НастройкиВычетов.ПредоставлениеВычета В (ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.Стандартный), ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.ПоПериодическимПлатежам))
		|			ТОГДА НастройкиВычетов.ПределВычета * ВЫБОР
		|					КОГДА НастройкиВычетов.ВидПределаВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МРП)
		|						ТОГДА ЕСТЬNULL(РазмерыМРППоПериодам.РазмерМРПНаНачалоГода, 0)
		|					ИНАЧЕ ЕСТЬNULL(РазмерыМЗППоПериодам.РазмерМЗПНаНачалоГода, 0)
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммовойПределВычета
		|ПОМЕСТИТЬ ВТНастройкиИРазмерыВычетов
		|ИЗ
		|	ВТНастойкиВычетов КАК НастройкиВычетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыВзносов КАК РазмерыВзносов
		|		ПО НастройкиВычетов.МесяцНалоговогоПериода = РазмерыВзносов.МесяцНалоговогоПериода
		|			И НастройкиВычетов.ФизическоеЛицо = РазмерыВзносов.ФизическоеЛицо
		|			И НастройкиВычетов.ВидВзносов = РазмерыВзносов.ВидВзносов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизическихЛицКакНалогоплательщиков КАК СтатусыФизическихЛицКакНалогоплательщиков
		|		ПО НастройкиВычетов.МесяцНалоговогоПериода = СтатусыФизическихЛицКакНалогоплательщиков.МесяцНалоговогоПериода
		|			И НастройкиВычетов.ФизическоеЛицо = СтатусыФизическихЛицКакНалогоплательщиков.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|		ПО НастройкиВычетов.МесяцНалоговогоПериода = РазмерыМЗППоПериодам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыМРППоПериодам КАК РазмерыМРППоПериодам
		|		ПО НастройкиВычетов.МесяцНалоговогоПериода = РазмерыМРППоПериодам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНастройкиВычетовПоВидамДоходаКоличество КАК НастройкиВычетовПоВидамДоходаКоличество
		|		ПО НастройкиВычетов.МесяцНалоговогоПериода = НастройкиВычетовПоВидамДоходаКоличество.МесяцНалоговогоПериода
		|			И НастройкиВычетов.ВидВычета = НастройкиВычетовПоВидамДоходаКоличество.ВидВычета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНастройкиВычетовПоВидамДохода КАК НастройкиВычетовПоВидамДохода
		|		ПО НастройкиВычетовПоВидамДоходаКоличество.ВидВычета = НастройкиВычетовПоВидамДохода.ВидВычета
		|			И НастройкиВычетовПоВидамДоходаКоличество.МесяцНалоговогоПериода = НастройкиВычетовПоВидамДохода.МесяцНалоговогоПериода
		// распределение более одного вида дохода у вычета будет происходить при расчете налога
		|			И НастройкиВычетовПоВидамДоходаКоличество.КоличествоВидовДохода = 1
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПрочиеВычетыФизическихЛицИПН КАК ПрочиеВычетыФизическихЛицИПН
		|		ПО НастройкиВычетов.МесяцНалоговогоПериода = ПрочиеВычетыФизическихЛицИПН.МесяцНалоговогоПериода
		|			И НастройкиВычетов.ФизическоеЛицо = ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо
		|			И НастройкиВычетов.ВидВычета = ПрочиеВычетыФизическихЛицИПН.ВидВычета
		|" + ?(ПрименятьВычетОПВиВОСМСГПХ И НЕ ПрименятьВычетВОСМСДляФизическихЛиц, "ГДЕ НЕ (НастройкиВычетов.ВидВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетВОСМС) И РазмерыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя))","")
		 + ?(ПрименятьВычетВОСМСДляФизическихЛиц И НЕ ПрименятьВычетОПВиВОСМСГПХ, "ГДЕ НЕ (НастройкиВычетов.ВидВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетВОСМС) И РазмерыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента))","");
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВТПериодыПоФизлицам КАК ПериодыПоФизлицам","ВТПериодыПоФизлицамОбъединенная КАК ПериодыПоФизлицам");
	КонецЕсли;
	
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТНастойкиВычетов");
	УничтожитьВТ.Добавить("ВТНастройкиИРазмерыВычетов");
	УничтожитьВТ.Добавить("ВТРазмерыПределовПосле2018");
	УничтожитьВТ.Добавить("ВТНастройкиВычетовПоВидамДоходаКоличество");
		
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиИРазмерыВычетов.МесяцНалоговогоПериода,
		|	НастройкиИРазмерыВычетов.ФизическоеЛицо,
		|	НастройкиИРазмерыВычетов.ВидВычета,
		|	НастройкиИРазмерыВычетов.Приоритет,
		|	НастройкиИРазмерыВычетов.ПредоставлениеВычета,
		|	НастройкиИРазмерыВычетов.ВидВзносов,
		|	НастройкиИРазмерыВычетов.ПределВычета,
		|	НастройкиИРазмерыВычетов.ПериодПредоставления,
		|	НастройкиИРазмерыВычетов.ВидДоходаВзносов,
		|	НастройкиИРазмерыВычетов.ВидДоходаВычета,
		|	НастройкиИРазмерыВычетов.ИспользуетсяПоНесколькимВидамДохода,
		|	НастройкиИРазмерыВычетов.РазмерВычета,
		|	НастройкиИРазмерыВычетов.СуммовойПределВычета,
		|	СУММА(ЕСТЬNULL(НакопленныеДанныеПоВычетам.РазрешенныйВычетВТекущемПериоде, 0)) КАК РазрешенныйВычетВТекущемПериоде,
		|	СУММА(ЕСТЬNULL(НакопленныеДанныеПоВычетам.ПримененныйВычетВТекущемПериоде, 0)) КАК ПримененныйВычетВТекущемПериоде,
		|	СУММА(ЕСТЬNULL(НакопленныеДанныеПоВычетам.РазрешенныйВычетСНачалаГода, 0)) КАК РазрешенныйВычетСНачалаГода,
		|	СУММА(ЕСТЬNULL(НакопленныеДанныеПоВычетам.ПримененныйВычетСНачалаГода, 0) + ЕСТЬNULL(ВычетыПримененныеУДругогоРаботодателя.ПримененныйВычетСНачалаГода, 0)) КАК ПримененныйВычетСНачалаГода,
		|	СУММА(ЕСТЬNULL(НакопленныеДанныеПоВычетам.РазрешенныйВычетСНачалаГодаОтОбратного, 0)) КАК РазрешенныйВычетСНачалаГодаОтОбратного,
		|	СУММА(ЕСТЬNULL(НакопленныеДанныеПоВычетам.ПримененныйВычетСНачалаГодаОтОбратного, 0) + ЕСТЬNULL(ВычетыПримененныеУДругогоРаботодателя.ПримененныйВычетСНачалаГода, 0)) КАК ПримененныйВычетСНачалаГодаОтОбратного
		|ПОМЕСТИТЬ ВТДанныеДляРасчетаВычетовИПН
		|ИЗ
		|	ВТНастройкиИРазмерыВычетов КАК НастройкиИРазмерыВычетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНакопленныеДанныеПоВычетам КАК НакопленныеДанныеПоВычетам
		|		ПО НастройкиИРазмерыВычетов.МесяцНалоговогоПериода = НакопленныеДанныеПоВычетам.МесяцНалоговогоПериода
		|			И НастройкиИРазмерыВычетов.ФизическоеЛицо = НакопленныеДанныеПоВычетам.ФизическоеЛицо
		|			И НастройкиИРазмерыВычетов.ВидВычета = НакопленныеДанныеПоВычетам.ВидВычета
		|			И НастройкиИРазмерыВычетов.МесяцНалоговогоПериода = НакопленныеДанныеПоВычетам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВычетыПримененныеУДругогоРаботодателя КАК ВычетыПримененныеУДругогоРаботодателя
		|		ПО НастройкиИРазмерыВычетов.МесяцНалоговогоПериода = ВычетыПримененныеУДругогоРаботодателя.МесяцНалоговогоПериода
		|			И НастройкиИРазмерыВычетов.ФизическоеЛицо = ВычетыПримененныеУДругогоРаботодателя.ФизическоеЛицо
		|			И НастройкиИРазмерыВычетов.ВидВычета = ВычетыПримененныеУДругогоРаботодателя.ВидВычета
		|
		|СГРУППИРОВАТЬ ПО
		|	НастройкиИРазмерыВычетов.МесяцНалоговогоПериода,
		|	НастройкиИРазмерыВычетов.ФизическоеЛицо,
		|	НастройкиИРазмерыВычетов.ВидВычета,
		|	НастройкиИРазмерыВычетов.Приоритет,
		|	НастройкиИРазмерыВычетов.ПредоставлениеВычета,
		|	НастройкиИРазмерыВычетов.ВидВзносов,
		|	НастройкиИРазмерыВычетов.ПределВычета,
		|	НастройкиИРазмерыВычетов.ПериодПредоставления,
		|	НастройкиИРазмерыВычетов.ВидДоходаВзносов,
		|	НастройкиИРазмерыВычетов.ВидДоходаВычета,
		|	НастройкиИРазмерыВычетов.ИспользуетсяПоНесколькимВидамДохода,
		|	НастройкиИРазмерыВычетов.РазмерВычета,
		|	НастройкиИРазмерыВычетов.СуммовойПределВычета";
		
	Запрос.Выполнить();
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);

КонецПроцедуры

Процедура СоздатьВТДанныеДляРасчетаВычетовИПНДо2018(МенеджерВременныхТаблиц, Организация, ПредоставлятьВычетВМесяцеОтсутствияДохода = Ложь, МесяцНачисления) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	// если применяется корректировка прочих доходов, то расчет ВОСМС происходит позже расчета ИПН
	ПрименятьКорректировкуПрочихНалоговВзносовОтчислений = ЗарплатаКадрыРКПовтИсп.ПрименятьКорректировкуПрочихНалоговВзносовОтчислений(ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(Организация), МесяцНачисления);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ПрименятьВычетВОСМСДляФизическихЛиц = ЗарплатаКадрыРКПовтИсп.ПрименятьВычетВОСМСДляФизическихЛицИГПХ(Организация, МесяцНачисления);
	ПрименятьВычетОПВиВОСМСГПХ = ЗарплатаКадрыРКПовтИсп.ПрименятьВычетВОСМСДляФизическихЛицИГПХ(Организация, МесяцНачисления);
	
	Если НЕ ВТСуществует(МенеджерВременныхТаблиц, "ВТИсчисленныеОПВ") Тогда
		Запрос.Текст =
			"ВЫБРАТЬ
			|	NULL КАК МесяцНалоговогоПериода,
			|	NULL КАК ФизическоеЛицо,
			|	NULL КАК ВидДохода,
			|	0 КАК ИсчисленныеОПВ
			|ПОМЕСТИТЬ ВТИсчисленныеОПВ";
		Запрос.Выполнить();
	КонецЕсли;
	
	Если НЕ ВТСуществует(МенеджерВременныхТаблиц, "ВТИсчисленныеВОСМС")
		И НЕ ПрименятьКорректировкуПрочихНалоговВзносовОтчислений Тогда
		Запрос.Текст =
			"ВЫБРАТЬ
			|	NULL КАК МесяцНалоговогоПериода,
			|	NULL КАК ФизическоеЛицо,
			|	NULL КАК ВидДохода,
			|	0 КАК ИсчисленныеВОСМС
			|ПОМЕСТИТЬ ВТИсчисленныеВОСМС";
		Запрос.Выполнить();
	КонецЕсли;
	
	// Применение вычетов ИПН
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ПрименениеВычетовИПН.Период) КАК Период,
		|	ПрименениеВычетовИПН.ФизическоеЛицо,
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТПериодыПримененияВычетов
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ПериодыПоФизлицам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрименениеВычетовИПН КАК ПрименениеВычетовИПН
		|		ПО ПериодыПоФизлицам.МесяцНалоговогоПериода >= ПрименениеВычетовИПН.Период
		|			И ПериодыПоФизлицам.ФизическоеЛицо = ПрименениеВычетовИПН.ФизическоеЛицо
		|			И (ПрименениеВычетовИПН.Активность)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПрименениеВычетовИПН.ФизическоеЛицо,
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПериодыПримененияВычетов.ФизическоеЛицо,
		|	ВТПериодыПримененияВычетов.МесяцНалоговогоПериода,
		|	ПрименениеВычетовИПН.Организация
		|ПОМЕСТИТЬ ВТПрименениеВычетовИПН
		|ИЗ
		|	ВТПериодыПримененияВычетов КАК ВТПериодыПримененияВычетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрименениеВычетовИПН КАК ПрименениеВычетовИПН
		|		ПО ВТПериодыПримененияВычетов.Период = ПрименениеВычетовИПН.Период
		|			И ВТПериодыПримененияВычетов.ФизическоеЛицо = ПрименениеВычетовИПН.ФизическоеЛицо
		|			И (ПрименениеВычетовИПН.Активность)
		|ГДЕ
		|	ПрименениеВычетовИПН.Организация = &Организация";
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВТПериодыПоФизлицам КАК ПериодыПоФизлицам","ВТПериодыПоФизлицамОбъединенная КАК ПериодыПоФизлицам");
	КонецЕсли;
	
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТПериодыПримененияВычетов");
	УничтожитьВТ.Добавить("ВТПрименениеВычетовИПН");
	
	// Назначенные вычеты ИПН
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ВычетыФизическихЛицИПН.Период) КАК Период,
		|	ВычетыФизическихЛицИПН.ФизическоеЛицо,
		|	ВычетыФизическихЛицИПН.ВидВычета,
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТПериодыВычетовИПН
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ПериодыПоФизлицам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВычетыФизическихЛицИПН КАК ВычетыФизическихЛицИПН
		|		ПО ПериодыПоФизлицам.МесяцНалоговогоПериода >= ВычетыФизическихЛицИПН.Период
		|			И ПериодыПоФизлицам.ФизическоеЛицо = ВычетыФизическихЛицИПН.ФизическоеЛицо
		|			И (ВычетыФизическихЛицИПН.Активность)
		|ГДЕ
		|	ВычетыФизическихЛицИПН.ВидВычета <> ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетОПВ)
		|	И ВычетыФизическихЛицИПН.ВидВычета <> ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетВОСМС)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВычетыФизическихЛицИПН.ФизическоеЛицо,
		|	ВычетыФизическихЛицИПН.ВидВычета,
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПериодыВычетовИПН.МесяцНалоговогоПериода,
		|	ВТПериодыВычетовИПН.ФизическоеЛицо,
		|	ВТПериодыВычетовИПН.ВидВычета,
		|	ВычетыФизическихЛицИПН.ПредоставлятьВычет,
		|	ВычетыФизическихЛицИПН.ДействуетПо
		|ПОМЕСТИТЬ ВТВычетыФизическихЛицИПН
		|ИЗ
		|	ВТПериодыВычетовИПН КАК ВТПериодыВычетовИПН
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВычетыФизическихЛицИПН КАК ВычетыФизическихЛицИПН
		|		ПО ВТПериодыВычетовИПН.Период = ВычетыФизическихЛицИПН.Период
		|			И ВТПериодыВычетовИПН.ФизическоеЛицо = ВычетыФизическихЛицИПН.ФизическоеЛицо
		|			И ВТПериодыВычетовИПН.ВидВычета = ВычетыФизическихЛицИПН.ВидВычета
		|			И (ВычетыФизическихЛицИПН.Активность)
		|ГДЕ
		|	ВычетыФизическихЛицИПН.ПредоставлятьВычет
		|	И ВЫБОР
		|			КОГДА ВычетыФизическихЛицИПН.ДействуетПо = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(ВТПериодыВычетовИПН.МесяцНалоговогоПериода, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(ВычетыФизическихЛицИПН.ДействуетПо, МЕСЯЦ)
		|		КОНЕЦ";
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВТПериодыПоФизлицам КАК ПериодыПоФизлицам","ВТПериодыПоФизлицамОбъединенная КАК ПериодыПоФизлицам");
	КонецЕсли;
	
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТПериодыВычетовИПН");
	УничтожитьВТ.Добавить("ВТВычетыФизическихЛицИПН");
	
	// Прочие вычеты физических лиц
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ПрочиеВычетыФизическихЛицИПН.Период) КАК Период,
		|	ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо,
		|	ПрочиеВычетыФизическихЛицИПН.ВидВычета,
		|	ПрочиеВычетыФизическихЛицИПН.ДействуетС,
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТПериодыПрочихВычетовИПН
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ПериодыПоФизлицам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрочиеВычетыФизическихЛицИПН КАК ПрочиеВычетыФизическихЛицИПН
		|		ПО ПериодыПоФизлицам.МесяцНалоговогоПериода >= ПрочиеВычетыФизическихЛицИПН.Период
		|			И ПериодыПоФизлицам.ФизическоеЛицо = ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо
		|			И (ПрочиеВычетыФизическихЛицИПН.Активность)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо,
		|	ПрочиеВычетыФизическихЛицИПН.ВидВычета,
		|	ПрочиеВычетыФизическихЛицИПН.ДействуетС,
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПериодыПрочихВычетовИПН.МесяцНалоговогоПериода,
		|	ВТПериодыПрочихВычетовИПН.ФизическоеЛицо,
		|	ВТПериодыПрочихВычетовИПН.ВидВычета,
		|	ВТПериодыПрочихВычетовИПН.ДействуетС,
		|	ПрочиеВычетыФизическихЛицИПН.Размер,
		|	ПрочиеВычетыФизическихЛицИПН.ДействуетПо
		|ПОМЕСТИТЬ ВТПрочиеВычетыФизическихЛицИПН
		|ИЗ
		|	ВТПериодыПрочихВычетовИПН КАК ВТПериодыПрочихВычетовИПН
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрочиеВычетыФизическихЛицИПН КАК ПрочиеВычетыФизическихЛицИПН
		|		ПО ВТПериодыПрочихВычетовИПН.Период = ПрочиеВычетыФизическихЛицИПН.Период
		|			И ВТПериодыПрочихВычетовИПН.ФизическоеЛицо = ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо
		|			И ВТПериодыПрочихВычетовИПН.ВидВычета = ПрочиеВычетыФизическихЛицИПН.ВидВычета
		|			И ВТПериодыПрочихВычетовИПН.ДействуетС = ПрочиеВычетыФизическихЛицИПН.ДействуетС
		|			И (ПрочиеВычетыФизическихЛицИПН.Активность)
		|ГДЕ
		|	ВТПериодыПрочихВычетовИПН.МесяцНалоговогоПериода МЕЖДУ ПрочиеВычетыФизическихЛицИПН.ДействуетС И ПрочиеВычетыФизическихЛицИПН.ДействуетПо
		|	И ПрочиеВычетыФизическихЛицИПН.Размер <> 0";
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВТПериодыПоФизлицам КАК ПериодыПоФизлицам","ВТПериодыПоФизлицамОбъединенная КАК ПериодыПоФизлицам");
	КонецЕсли;
	
	Запрос.Выполнить();	
	УничтожитьВТ.Добавить("ВТПериодыПрочихВычетовИПН");
	УничтожитьВТ.Добавить("ВТПрочиеВычетыФизическихЛицИПН");
	
	// Размеры взносов
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеОПВ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОПВ) КАК ВидВзносов,
		|	ДанныеОПВ.ФизическоеЛицо,
		|	ДанныеОПВ.ВидДохода,
		|	ДанныеОПВ.ИсчисленныеОПВ КАК СуммаВзносов
		|ПОМЕСТИТЬ ВТРазмерыВзносов
		|ИЗ
		|	ВТИсчисленныеОПВ КАК ДанныеОПВ
		|" + ?(НЕ ПрименятьКорректировкуПрочихНалоговВзносовОтчислений, "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеВОСМС.МесяцНалоговогоПериода,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС),
		|	ДанныеВОСМС.ФизическоеЛицо,
		|	ДанныеВОСМС.ВидДохода,
		|	ДанныеВОСМС.ИсчисленныеВОСМС
		|ИЗ
		|	ВТИсчисленныеВОСМС КАК ДанныеВОСМС", "");
		
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТРазмерыВзносов");
	
	// Размеры пределов
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПериодыПределов.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ПериодыПределов.ВидВычета КАК ВидВычета,
		|	РазмерыВычетовИПН.ВидПределаВычета КАК ВидПределаВычета,
		|	РазмерыВычетовИПН.Размер КАК Размер
		|ПОМЕСТИТЬ ВТРазмерыПределовПосле2018
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ПериодыВычетовИПН.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		ПериодыВычетовИПН.ВидВычета КАК ВидВычета,
		|		МАКСИМУМ(РазмерыВычетовИПН.Период) КАК Период
		|	ИЗ
		|		ВТПериодыВычетовИПН КАК ПериодыВычетовИПН
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмерыВычетовИПН КАК РазмерыВычетовИПН
		|			ПО (РазмерыВычетовИПН.ВидВычетаИПН = ПериодыВычетовИПН.ВидВычета)
		|				И (РазмерыВычетовИПН.Период <= НАЧАЛОПЕРИОДА(ПериодыВычетовИПН.МесяцНалоговогоПериода, ГОД))
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПериодыВычетовИПН.МесяцНалоговогоПериода,
		|		ПериодыВычетовИПН.ВидВычета) КАК ПериодыПределов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РазмерыВычетовИПН КАК РазмерыВычетовИПН
		|		ПО ПериодыПределов.Период = РазмерыВычетовИПН.Период
		|			И ПериодыПределов.ВидВычета = РазмерыВычетовИПН.ВидВычетаИПН";
		
	Запрос.Выполнить();
	
	// Настройки вычетов по видам дохода
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПериодыПределов.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ПериодыПределов.ВидВычета КАК ВидВычета,
		|	ПрименениеВычетовПоВидамДохода.ВидДохода КАК ВидДохода
		|ПОМЕСТИТЬ ВТНастройкиВычетовПоВидамДохода
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ДатыПоМесяцам.Период КАК МесяцНалоговогоПериода,
		|		ПрименениеВычетовПоВидамДохода.ВидВычетаИПН КАК ВидВычета,
		|		МАКСИМУМ(ПрименениеВычетовПоВидамДохода.Период) КАК Период
		|	ИЗ
		|		ВТДатыПоМесяцам КАК ДатыПоМесяцам
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрименениеВычетовПоВидамДохода КАК ПрименениеВычетовПоВидамДохода
		|			ПО (ПрименениеВычетовПоВидамДохода.Период <= НАЧАЛОПЕРИОДА(ДатыПоМесяцам.Период, ГОД))
		|ГДЕ	
		|	ПрименениеВычетовПоВидамДохода.Используется		
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ДатыПоМесяцам.Период,
		|		ПрименениеВычетовПоВидамДохода.ВидВычетаИПН) КАК ПериодыПределов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрименениеВычетовПоВидамДохода КАК ПрименениеВычетовПоВидамДохода
		|		ПО ПериодыПределов.Период = ПрименениеВычетовПоВидамДохода.Период
		|			И ПериодыПределов.ВидВычета = ПрименениеВычетовПоВидамДохода.ВидВычетаИПН
		|			И ПрименениеВычетовПоВидамДохода.Используется";
	
	Запрос.Выполнить();
	
	// Настройки вычетов
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВычетыФизическихЛицИПН.МесяцНалоговогоПериода,
		|	ВычетыФизическихЛицИПН.ФизическоеЛицо,
		|	ВычетыФизическихЛицИПН.ВидВычета,
		|	ВидыВычетовИПН.Приоритет,
		|	ВидыВычетовИПН.ПредоставлениеВычета,
		|	ВидыВычетовИПН.ВидВзносов,
		|	ЕСТЬNULL(РазмерыПределовПосле2018.ВидПределаВычета, ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МЗП)) КАК ВидПределаВычета,
		|	ЕСТЬNULL(РазмерыПределовПосле2018.Размер, ВидыВычетовИПН.ПределВычета) КАК ПределВычета,
		|	ВидыВычетовИПН.ПериодПредоставления
		|ПОМЕСТИТЬ ВТНастойкиВычетов
		|ИЗ
		|	ВТВычетыФизическихЛицИПН КАК ВычетыФизическихЛицИПН
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПрименениеВычетовИПН КАК ПрименениеВычетовИПН
		|		ПО ВычетыФизическихЛицИПН.МесяцНалоговогоПериода = ПрименениеВычетовИПН.МесяцНалоговогоПериода
		|			И ВычетыФизическихЛицИПН.ФизическоеЛицо = ПрименениеВычетовИПН.ФизическоеЛицо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|		ПО ВычетыФизическихЛицИПН.ВидВычета = ВидыВычетовИПН.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыПределовПосле2018 КАК РазмерыПределовПосле2018
		|		ПО ВычетыФизическихЛицИПН.ВидВычета = РазмерыПределовПосле2018.ВидВычета
		|			И ВычетыФизическихЛицИПН.МесяцНалоговогоПериода = РазмерыПределовПосле2018.МесяцНалоговогоПериода
		|			И ВычетыФизическихЛицИПН.МесяцНалоговогоПериода >= ДАТАВРЕМЯ(2019, 1, 1, 0, 0, 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТПериодыПоФизлицам.МесяцНалоговогоПериода,
		|	ВТПериодыПоФизлицам.ФизическоеЛицо,
		|	ВидыВычетовИПН.Ссылка,
		|	ВидыВычетовИПН.Приоритет,
		|	ВидыВычетовИПН.ПредоставлениеВычета,
		|	ВидыВычетовИПН.ВидВзносов,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МЗП),
		|	ВидыВычетовИПН.ПределВычета,
		|	ВидыВычетовИПН.ПериодПредоставления
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ВТПериодыПоФизлицам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|		ПО (ВидыВычетовИПН.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетОПВ))
		|" + ?(ПрименятьВычетВОСМСДляФизическихЛиц ИЛИ ПрименятьВычетОПВиВОСМСГПХ, "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТПериодыПоФизлицам.МесяцНалоговогоПериода,
		|	ВТПериодыПоФизлицам.ФизическоеЛицо,
		|	ВидыВычетовИПН.Ссылка,
		|	ВидыВычетовИПН.Приоритет,
		|	ВидыВычетовИПН.ПредоставлениеВычета,
		|	ВидыВычетовИПН.ВидВзносов,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МЗП),
		|	ВидыВычетовИПН.ПределВычета,
		|	ВидыВычетовИПН.ПериодПредоставления
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ВТПериодыПоФизлицам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|		ПО (ВидыВычетовИПН.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетВОСМС))
		|ГДЕ
		|	ВТПериодыПоФизлицам.МесяцНалоговогоПериода >= ДАТАВРЕМЯ(2020, 1, 1)", "") + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиВычетовПоВидамДохода.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	НастройкиВычетовПоВидамДохода.ВидВычета КАК ВидВычета,
		|	КОЛИЧЕСТВО(НастройкиВычетовПоВидамДохода.ВидДохода) КАК КоличествоВидовДохода
		|ПОМЕСТИТЬ ВТНастройкиВычетовПоВидамДоходаКоличество
		|ИЗ
		|	ВТНастройкиВычетовПоВидамДохода КАК НастройкиВычетовПоВидамДохода
		|
		|СГРУППИРОВАТЬ ПО
		|	НастройкиВычетовПоВидамДохода.МесяцНалоговогоПериода,
		|	НастройкиВычетовПоВидамДохода.ВидВычета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиВычетов.МесяцНалоговогоПериода,
		|	НастройкиВычетов.ФизическоеЛицо,
		|	НастройкиВычетов.ВидВычета,
		|	НастройкиВычетов.Приоритет,
		|	НастройкиВычетов.ПредоставлениеВычета,
		|	НастройкиВычетов.ВидВзносов,
		|	НастройкиВычетов.ПределВычета,
		|	НастройкиВычетов.ПериодПредоставления,
		|	РазмерыВзносов.ВидДохода КАК ВидДоходаВзносов,
		|	НастройкиВычетовПоВидамДохода.ВидДохода КАК ВидДоходаВычета,
		|	ЕСТЬNULL(РазмерыВзносов.СуммаВзносов, 0) КАК СуммаВзносов,
		|	ЕСТЬNULL(РазмерыМЗППоПериодам.РазмерМЗПНаНачалоГода, 0) КАК РазмерМЗПНаНачалоГода,
		|	ЕСТЬNULL(РазмерыМРППоПериодам.РазмерМРПНаНачалоГода, 0) КАК РазмерМРПНаНачалоГода,
		|	ЕСТЬNULL(ПрочиеВычетыФизическихЛицИПН.Размер, 0) КАК РазмерПрочегоВычета,
		|	ВЫБОР
		|		КОГДА НастройкиВычетовПоВидамДоходаКоличество.КоличествоВидовДохода > 1
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ИспользуетсяПоНесколькимВидамДохода,
		|	ВЫБОР
		|		КОГДА НастройкиВычетов.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.Стандартный)
		|			ТОГДА НастройкиВычетов.ПределВычета * ВЫБОР
		|					КОГДА НастройкиВычетов.ВидПределаВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МРП)
		|						ТОГДА ЕСТЬNULL(РазмерыМРППоПериодам.РазмерМРПНаНачалоГода, 0)
		|					ИНАЧЕ ЕСТЬNULL(РазмерыМЗППоПериодам.РазмерМЗПНаНачалоГода, 0)
		|				КОНЕЦ
		|		КОГДА НастройкиВычетов.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов)
		|			ТОГДА ЕСТЬNULL(РазмерыВзносов.СуммаВзносов, 0)
		|		КОГДА НастройкиВычетов.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.ПоПериодическимПлатежам)
		|			ТОГДА ЕСТЬNULL(ПрочиеВычетыФизическихЛицИПН.Размер, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК РазмерВычета,
		|	ВЫБОР
		|		КОГДА НастройкиВычетов.ПредоставлениеВычета В (ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.Стандартный), ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.ПоПериодическимПлатежам))
		|			ТОГДА НастройкиВычетов.ПределВычета * ВЫБОР
		|					КОГДА НастройкиВычетов.ВидПределаВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПределовВычетовИКорректировокДоходов.МРП)
		|						ТОГДА ЕСТЬNULL(РазмерыМРППоПериодам.РазмерМРПНаНачалоГода, 0)
		|					ИНАЧЕ ЕСТЬNULL(РазмерыМЗППоПериодам.РазмерМЗПНаНачалоГода, 0)
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммовойПределВычета
		|ПОМЕСТИТЬ ВТНастройкиИРазмерыВычетов
		|ИЗ
		|	ВТНастойкиВычетов КАК НастройкиВычетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыВзносов КАК РазмерыВзносов
		|		ПО НастройкиВычетов.МесяцНалоговогоПериода = РазмерыВзносов.МесяцНалоговогоПериода
		|			И НастройкиВычетов.ФизическоеЛицо = РазмерыВзносов.ФизическоеЛицо
		|			И НастройкиВычетов.ВидВзносов = РазмерыВзносов.ВидВзносов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|		ПО НастройкиВычетов.МесяцНалоговогоПериода = РазмерыМЗППоПериодам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыМРППоПериодам КАК РазмерыМРППоПериодам
		|		ПО НастройкиВычетов.МесяцНалоговогоПериода = РазмерыМРППоПериодам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНастройкиВычетовПоВидамДоходаКоличество КАК НастройкиВычетовПоВидамДоходаКоличество
		|		ПО НастройкиВычетов.МесяцНалоговогоПериода = НастройкиВычетовПоВидамДоходаКоличество.МесяцНалоговогоПериода
		|			И НастройкиВычетов.ВидВычета = НастройкиВычетовПоВидамДоходаКоличество.ВидВычета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНастройкиВычетовПоВидамДохода КАК НастройкиВычетовПоВидамДохода
		|		ПО НастройкиВычетовПоВидамДоходаКоличество.ВидВычета = НастройкиВычетовПоВидамДохода.ВидВычета
		|			И НастройкиВычетовПоВидамДоходаКоличество.МесяцНалоговогоПериода = НастройкиВычетовПоВидамДохода.МесяцНалоговогоПериода
		// распределение более одного вида дохода у вычета будет происходить при расчете налога
		|			И НастройкиВычетовПоВидамДоходаКоличество.КоличествоВидовДохода = 1
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПрочиеВычетыФизическихЛицИПН КАК ПрочиеВычетыФизическихЛицИПН
		|		ПО НастройкиВычетов.МесяцНалоговогоПериода = ПрочиеВычетыФизическихЛицИПН.МесяцНалоговогоПериода
		|			И НастройкиВычетов.ФизическоеЛицо = ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо
		|			И НастройкиВычетов.ВидВычета = ПрочиеВычетыФизическихЛицИПН.ВидВычета
		|" + ?(ПрименятьВычетОПВиВОСМСГПХ И НЕ ПрименятьВычетВОСМСДляФизическихЛиц, "ГДЕ НЕ (НастройкиВычетов.ВидВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетВОСМС) И РазмерыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя))","")
		 + ?(ПрименятьВычетВОСМСДляФизическихЛиц И НЕ ПрименятьВычетОПВиВОСМСГПХ, "ГДЕ НЕ (НастройкиВычетов.ВидВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетВОСМС) И РазмерыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента))","");
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВТПериодыПоФизлицам КАК ПериодыПоФизлицам","ВТПериодыПоФизлицамОбъединенная КАК ПериодыПоФизлицам");
	КонецЕсли;
	
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТНастойкиВычетов");
	УничтожитьВТ.Добавить("ВТНастройкиИРазмерыВычетов");
	УничтожитьВТ.Добавить("ВТРазмерыПределовПосле2018");
	УничтожитьВТ.Добавить("ВТНастройкиВычетовПоВидамДоходаКоличество");
		
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиИРазмерыВычетов.МесяцНалоговогоПериода,
		|	НастройкиИРазмерыВычетов.ФизическоеЛицо,
		|	НастройкиИРазмерыВычетов.ВидВычета,
		|	НастройкиИРазмерыВычетов.Приоритет,
		|	НастройкиИРазмерыВычетов.ПредоставлениеВычета,
		|	НастройкиИРазмерыВычетов.ВидВзносов,
		|	НастройкиИРазмерыВычетов.ПределВычета,
		|	НастройкиИРазмерыВычетов.ПериодПредоставления,
		|	НастройкиИРазмерыВычетов.ВидДоходаВзносов,
		|	НастройкиИРазмерыВычетов.ВидДоходаВычета,
		|	НастройкиИРазмерыВычетов.ИспользуетсяПоНесколькимВидамДохода,
		|	НастройкиИРазмерыВычетов.РазмерВычета,
		|	НастройкиИРазмерыВычетов.СуммовойПределВычета,
		|	СУММА(ЕСТЬNULL(НакопленныеДанныеПоВычетам.РазрешенныйВычетВТекущемПериоде, 0)) КАК РазрешенныйВычетВТекущемПериоде,
		|	СУММА(ЕСТЬNULL(НакопленныеДанныеПоВычетам.ПримененныйВычетВТекущемПериоде, 0)) КАК ПримененныйВычетВТекущемПериоде,
		|	СУММА(ЕСТЬNULL(НакопленныеДанныеПоВычетам.РазрешенныйВычетСНачалаГода, 0)) КАК РазрешенныйВычетСНачалаГода,
		|	СУММА(ЕСТЬNULL(НакопленныеДанныеПоВычетам.ПримененныйВычетСНачалаГода, 0) + ЕСТЬNULL(ВычетыПримененныеУДругогоРаботодателя.ПримененныйВычетСНачалаГода, 0)) КАК ПримененныйВычетСНачалаГода,
		|	СУММА(ЕСТЬNULL(НакопленныеДанныеПоВычетам.РазрешенныйВычетСНачалаГодаОтОбратного, 0)) КАК РазрешенныйВычетСНачалаГодаОтОбратного,
		|	СУММА(ЕСТЬNULL(НакопленныеДанныеПоВычетам.ПримененныйВычетСНачалаГодаОтОбратного, 0) + ЕСТЬNULL(ВычетыПримененныеУДругогоРаботодателя.ПримененныйВычетСНачалаГода, 0)) КАК ПримененныйВычетСНачалаГодаОтОбратного
		|ПОМЕСТИТЬ ВТДанныеДляРасчетаВычетовИПН
		|ИЗ
		|	ВТНастройкиИРазмерыВычетов КАК НастройкиИРазмерыВычетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНакопленныеДанныеПоВычетам КАК НакопленныеДанныеПоВычетам
		|		ПО НастройкиИРазмерыВычетов.МесяцНалоговогоПериода = НакопленныеДанныеПоВычетам.МесяцНалоговогоПериода
		|			И НастройкиИРазмерыВычетов.ФизическоеЛицо = НакопленныеДанныеПоВычетам.ФизическоеЛицо
		|			И НастройкиИРазмерыВычетов.ВидВычета = НакопленныеДанныеПоВычетам.ВидВычета
		|			И НастройкиИРазмерыВычетов.МесяцНалоговогоПериода = НакопленныеДанныеПоВычетам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВычетыПримененныеУДругогоРаботодателя КАК ВычетыПримененныеУДругогоРаботодателя
		|		ПО НастройкиИРазмерыВычетов.МесяцНалоговогоПериода = ВычетыПримененныеУДругогоРаботодателя.МесяцНалоговогоПериода
		|			И НастройкиИРазмерыВычетов.ФизическоеЛицо = ВычетыПримененныеУДругогоРаботодателя.ФизическоеЛицо
		|			И НастройкиИРазмерыВычетов.ВидВычета = ВычетыПримененныеУДругогоРаботодателя.ВидВычета
		|
		|СГРУППИРОВАТЬ ПО
		|	НастройкиИРазмерыВычетов.МесяцНалоговогоПериода,
		|	НастройкиИРазмерыВычетов.ФизическоеЛицо,
		|	НастройкиИРазмерыВычетов.ВидВычета,
		|	НастройкиИРазмерыВычетов.Приоритет,
		|	НастройкиИРазмерыВычетов.ПредоставлениеВычета,
		|	НастройкиИРазмерыВычетов.ВидВзносов,
		|	НастройкиИРазмерыВычетов.ПределВычета,
		|	НастройкиИРазмерыВычетов.ПериодПредоставления,
		|	НастройкиИРазмерыВычетов.ВидДоходаВзносов,
		|	НастройкиИРазмерыВычетов.ВидДоходаВычета,
		|	НастройкиИРазмерыВычетов.ИспользуетсяПоНесколькимВидамДохода,
		|	НастройкиИРазмерыВычетов.РазмерВычета,
		|	НастройкиИРазмерыВычетов.СуммовойПределВычета";
		
	Запрос.Выполнить();
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);

КонецПроцедуры

Функция ПодготовитьСлужебныеДанныеДляРасчетаИПН();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыВычетовИПН.Ссылка,
		|	ВидыВычетовИПН.Приоритет КАК Приоритет
		|ИЗ
		|	Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|ГДЕ
		|	ВидыВычетовИПН.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КвалификаторЧисла = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2));
	ВспомогательнаяТаблицаРасчета = Новый ТаблицаЗначений;
	ВспомогательнаяТаблицаРасчета.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ВспомогательнаяТаблицаРасчета.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ВспомогательнаяТаблицаРасчета.Колонки.Добавить("ВидДохода", Новый ОписаниеТипов("СправочникСсылка.ВидыДоходов"));
	ВспомогательнаяТаблицаРасчета.Колонки.Добавить("ОбъектИсчисленияИПН", КвалификаторЧисла);
	ВспомогательнаяТаблицаРасчета.Колонки.Добавить("ИсчисленныйИПН", КвалификаторЧисла);
	ВспомогательнаяТаблицаРасчета.Колонки.Добавить("ПримененнаяЛьгота", КвалификаторЧисла);
	
	РезультатыРасчетов = ВспомогательнаяТаблицаРасчета.СкопироватьКолонки();
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", КвалификаторЧисла);      
	
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияИПНВЦеломЗаПериод", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныйИПНВЦеломЗаПериод", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("ПримененнаяЛьготаВЦеломЗаПериод", КвалификаторЧисла);
	
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("ОбъектИПНИсчисленныйРанее", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("ИПНИсчисленныйРанее", КвалификаторЧисла);

	ИзмеренияРасчетаВычетов = "";
	РесурсыРасчетаВычетов = "";
	
	// Добавляем колонки для вычетов
	Пока Выборка.Следующий() Цикл
		
		ВспомогательнаяТаблицаРасчета.Колонки.Добавить("ВидВычета" + Строка(Выборка.Приоритет), Новый ОписаниеТипов("СправочникСсылка.ВидыВычетовИПН"));
		ВспомогательнаяТаблицаРасчета.Колонки.Добавить("ПримененныйВычет" + Строка(Выборка.Приоритет), КвалификаторЧисла);
		ВспомогательнаяТаблицаРасчета.Колонки.Добавить("РазрешенныйВычет" + Строка(Выборка.Приоритет), КвалификаторЧисла);
		ВспомогательнаяТаблицаРасчета.Колонки.Добавить("ИспользуетсяПоНесколькимВидамДохода" + Строка(Выборка.Приоритет), Новый ОписаниеТипов("Булево"));
		
		РезультатыРасчетов.Колонки.Добавить("ВидВычета" + Строка(Выборка.Приоритет), Новый ОписаниеТипов("СправочникСсылка.ВидыВычетовИПН"));
		РезультатыРасчетов.Колонки.Добавить("ПримененныйВычет" + Строка(Выборка.Приоритет), КвалификаторЧисла);
		РезультатыРасчетов.Колонки.Добавить("РазрешенныйВычет" + Строка(Выборка.Приоритет), КвалификаторЧисла);
		
		РезультатыРасчетов.Колонки.Добавить("ПримененныйВычет" + Строка(Выборка.Приоритет) + "ВЦеломЗаПериод", КвалификаторЧисла);
		РезультатыРасчетов.Колонки.Добавить("РазрешенныйВычет" + Строка(Выборка.Приоритет) + "ВЦеломЗаПериод", КвалификаторЧисла);
		
		РезультатыРасчетов.Колонки.Добавить("ПримененныйВычет" + Строка(Выборка.Приоритет) + "ИсчисленныйРанее", КвалификаторЧисла);
		РезультатыРасчетов.Колонки.Добавить("РазрешенныйВычет" + Строка(Выборка.Приоритет) + "ИсчисленныйРанее", КвалификаторЧисла);
		
		ИзмеренияРасчетаВычетов = ИзмеренияРасчетаВычетов + ",ВидВычета" + Строка(Выборка.Приоритет);
		РесурсыРасчетаВычетов = РесурсыРасчетаВычетов + ",ПримененныйВычет" + Строка(Выборка.Приоритет)
													  + ",РазрешенныйВычет" + Строка(Выборка.Приоритет); 
	КонецЦикла;
												  
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ВспомогательнаяТаблицаРасчета", ВспомогательнаяТаблицаРасчета);
	СтруктураДанных.Вставить("РезультатыРасчетов", РезультатыРасчетов);
	СтруктураДанных.Вставить("ИзмеренияРасчетаВычетов", ИзмеренияРасчетаВычетов);
	СтруктураДанных.Вставить("РесурсыРасчетаВычетов", РесурсыРасчетаВычетов);
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция ВидыВычетовПоПолямТаблицы(ТаблицаИПН)
	
	МассивВычетов = Новый Массив;
	
	Для Каждого Колонка Из ТаблицаИПН.Колонки Цикл
		Если СтрНайти(Колонка.Имя, "ВидВычета") > 0 Тогда
			МассивВычетов.Добавить(СтрЗаменить(Колонка.Имя, "ВидВычета", ""));			
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивВычетов;
	
КонецФункции

Функция РассчитатьУдержаниеНалоговВзносовПоНУ(МенеджерВременныхТаблиц, Ссылка, Организация, ДатаОперации, ПериодРегистрации = Неопределено, ОкончательныйРасчет = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПериодРегистрации",ПериодРегистрации);
	Запрос.УстановитьПараметр("ПериодВзаиморасчетов",КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗарплатаКВыплатеОстатки.Сотрудник КАК Сотрудник,
	|	ЗарплатаКВыплатеОстатки.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗарплатаКВыплатеОстатки.Подразделение КАК Подразделение,
	|	ЗарплатаКВыплатеОстатки.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ЗарплатаКВыплатеОстатки.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ЗарплатаКВыплатеОстатки.СтатьяРасходов КАК СтатьяРасходов,
	|	ЗарплатаКВыплатеОстатки.ДокументОснование КАК ДокументОснование,
	|	СУММА(ЗарплатаКВыплатеОстатки.СуммаКВыплатеОстаток) КАК СуммаКВыплате
	|ПОМЕСТИТЬ ВТЗарплатаКВыплатеОстатки
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплате.Остатки(
	|			&ПериодВзаиморасчетов,
	|					Организация = &Организация
	|				И Сотрудник В
	|					(ВЫБРАТЬ
	|						T.Сотрудник
	|					ИЗ
	|						ВТСотрудники КАК T)) КАК ЗарплатаКВыплатеОстатки
	//|ГДЕ
	//|	ЗарплатаКВыплатеОстатки.ДокументОснование <> НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗарплатаКВыплатеОстатки.Сотрудник,
	|	ЗарплатаКВыплатеОстатки.ФизическоеЛицо,
	|	ЗарплатаКВыплатеОстатки.Подразделение,
	|	ЗарплатаКВыплатеОстатки.ПериодВзаиморасчетов,
	|	ЗарплатаКВыплатеОстатки.СтатьяФинансирования,
	|	ЗарплатаКВыплатеОстатки.СтатьяРасходов,
	|	ЗарплатаКВыплатеОстатки.ДокументОснование
	// добавим полностью выплаченные документы за месяц
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗарплатаКВыплатеОстатки.Сотрудник КАК Сотрудник,
	|	ЗарплатаКВыплатеОстатки.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗарплатаКВыплатеОстатки.Подразделение КАК Подразделение,
	|	ЗарплатаКВыплатеОстатки.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ЗарплатаКВыплатеОстатки.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ЗарплатаКВыплатеОстатки.СтатьяРасходов КАК СтатьяРасходов,
	|	ЗарплатаКВыплатеОстатки.ДокументОснование КАК ДокументОснование,
	|	0
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплате.Обороты(НАЧАЛОПЕРИОДА(&ПериодВзаиморасчетов, МЕСЯЦ), КОНЕЦПЕРИОДА(&ПериодВзаиморасчетов, МЕСЯЦ), МЕСЯЦ, Организация = &Организация) КАК ЗарплатаКВыплатеОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗарплатаКВыплатеОстатки.Сотрудник,
	|	ЗарплатаКВыплатеОстатки.ФизическоеЛицо,
	|	ЗарплатаКВыплатеОстатки.Подразделение,
	|	ЗарплатаКВыплатеОстатки.ПериодВзаиморасчетов,
	|	ЗарплатаКВыплатеОстатки.СтатьяФинансирования,
	|	ЗарплатаКВыплатеОстатки.СтатьяРасходов,
	|	ЗарплатаКВыплатеОстатки.ДокументОснование
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЗарплатаКВыплатеОстатки.СуммаКВыплатеПриход) - СУММА(ЗарплатаКВыплатеОстатки.СуммаКВыплатеРасход) = 0	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленияУдержанияПоСотрудникам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НачисленияУдержанияПоСотрудникам.Регистратор КАК ДокументОснование,
	|	НачисленияУдержанияПоСотрудникам.СтатьяФинансирования КАК СтатьяФинансирования,
	|	НачисленияУдержанияПоСотрудникам.СтатьяРасходов КАК СтатьяРасходов,
	|	СУММА(НачисленияУдержанияПоСотрудникам.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТУдержания
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияУдержанияПоСотрудникам
	|ГДЕ
	|	НачисленияУдержанияПоСотрудникам.Период <= &ПериодРегистрации
	|	И НачисленияУдержанияПоСотрудникам.Организация = &Организация
	|	И (ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоСотрудникам.НачислениеУдержание) = ТИП(ПланВидовРасчета.Удержания)
	|		ИЛИ НачисленияУдержанияПоСотрудникам.НачислениеУдержание В (
	|			ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ПогашениеЗаймаИзЗарплаты),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ПроцентыПоЗайму),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.НачисленоПроцентовПоЗайму),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.МатериальнаяВыгодаПоЗаймам)))
	|	И НачисленияУдержанияПоСотрудникам.Сотрудник В
	|			(ВЫБРАТЬ
	|				Т.Сотрудник
	|			ИЗ
	|				ВТСотрудники КАК Т)
	|	И НачисленияУдержанияПоСотрудникам.Регистратор В
	|			(ВЫБРАТЬ
	|				Т.ДокументОснование
	|			ИЗ
	|				ВТЗарплатаКВыплатеОстатки КАК Т)
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленияУдержанияПоСотрудникам.ФизическоеЛицо,
	|	НачисленияУдержанияПоСотрудникам.Регистратор,
	|	НачисленияУдержанияПоСотрудникам.СтатьяФинансирования,
	|	НачисленияУдержанияПоСотрудникам.СтатьяРасходов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	ДокументОснование,
	|	СтатьяФинансирования,
	|	СтатьяРасходов
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходахФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СведенияОДоходахФизическихЛиц.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СведенияОДоходахФизическихЛиц.ПериодРегистрации КАК ПериодРегистрации,
	|	СУММА(СведенияОДоходахФизическихЛиц.СуммаДоходаОборот) КАК Сумма
	|ПОМЕСТИТЬ ВТДоходВНатуральнойФорме
	|ИЗ
	|	РегистрНакопления.СведенияОДоходахФизическихЛиц.Обороты(
	|				НАЧАЛОПЕРИОДА(&ПериодРегистрации,МЕСЯЦ),
	|				КОНЕЦПЕРИОДА(&ПериодРегистрации,МЕСЯЦ),
	|				,
	|				Организация = &Организация
	|				И ФизическоеЛицо В
	|				(ВЫБРАТЬ
	|					Т.ФизическоеЛицо
	|						ИЗ
	|					ВТСотрудники КАК Т)
	|				И ВЫРАЗИТЬ(Начисление КАК ПланВидовРасчета.Начисления).КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме)
	|				) КАК СведенияОДоходахФизическихЛиц
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходахФизическихЛиц.ФизическоеЛицо,
	|	СведенияОДоходахФизическихЛиц.ПериодРегистрации,
	|	СведенияОДоходахФизическихЛиц.РегистрацияВНалоговомОргане
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	ПериодРегистрации,
	|	РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗарплатаКВыплате.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗарплатаКВыплате.ДокументОснование КАК ДокументОснование,
	|	ЗарплатаКВыплате.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ЗарплатаКВыплате.СтатьяРасходов КАК СтатьяРасходов,
	|	СУММА(ВЫБОР
	|			КОГДА ЗарплатаКВыплате.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА ЗарплатаКВыплате.СуммаКВыплате
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНачисленная,
	|	СУММА(ВЫБОР
	|			КОГДА ЗарплатаКВыплате.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ЗарплатаКВыплате.СуммаКВыплате
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаВыплаченная
	|ПОМЕСТИТЬ ВТЗарплатаКВыплате
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплате КАК ЗарплатаКВыплате
	|ГДЕ
	|	ЗарплатаКВыплате.Период <= &ПериодРегистрации
	|	И ЗарплатаКВыплате.Организация = &Организация
	|	И ЗарплатаКВыплате.Сотрудник В
	|			(ВЫБРАТЬ
	|				Т.Сотрудник
	|			ИЗ
	|				ВТСотрудники КАК Т)
	|	И ЗарплатаКВыплате.ДокументОснование В
	|			(ВЫБРАТЬ
	|				Т.ДокументОснование
	|			ИЗ
	|				ВТЗарплатаКВыплатеОстатки КАК Т)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗарплатаКВыплате.ФизическоеЛицо,
	|	ЗарплатаКВыплате.ДокументОснование,
	|	ЗарплатаКВыплате.СтатьяФинансирования,
	|	ЗарплатаКВыплате.СтатьяРасходов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	ДокументОснование,
	|	СтатьяФинансирования,
	|	СтатьяРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Остатки.ДокументОснование КАК ДокументОснование,
	|	Остатки.СтатьяФинансирования КАК СтатьяФинансирования,
	|	Остатки.СтатьяРасходов КАК СтатьяРасходов,
	|	Остатки.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ЕСТЬNULL(ЗарплатаКВыплате.СуммаНачисленная, 0) + ВЫБОР КОГДА Удержания.Сумма ЕСТЬ NULL ТОГДА 0 ИНАЧЕ Удержания.Сумма КОНЕЦ
	|													+ ВЫБОР КОГДА ДоходВНатуральнойФорме.Сумма ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ДоходВНатуральнойФорме.Сумма КОНЕЦ
	|		КАК СуммаНачисленная,
	|	ЕСТЬNULL(ЗарплатаКВыплате.СуммаВыплаченная, 0) + ВЫБОР КОГДА Удержания.Сумма ЕСТЬ NULL ТОГДА 0 ИНАЧЕ Удержания.Сумма КОНЕЦ 
	|													+ ВЫБОР КОГДА ДоходВНатуральнойФорме.Сумма ЕСТЬ NULL ТОГДА 0 ИНАЧЕ ДоходВНатуральнойФорме.Сумма КОНЕЦ
	|		КАК СуммаВыплаченная
	|ПОМЕСТИТЬ ВТСписокСотрудников
	|ИЗ
	|	ВТЗарплатаКВыплатеОстатки КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗарплатаКВыплате КАК ЗарплатаКВыплате
	|		ПО Остатки.ФизическоеЛицо = ЗарплатаКВыплате.ФизическоеЛицо
	|			И Остатки.ДокументОснование = ЗарплатаКВыплате.ДокументОснование
	|			И Остатки.СтатьяФинансирования = ЗарплатаКВыплате.СтатьяФинансирования
	|			И Остатки.СтатьяРасходов = ЗарплатаКВыплате.СтатьяРасходов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУдержания КАК Удержания
	|		ПО Остатки.ФизическоеЛицо = Удержания.ФизическоеЛицо
	|			И Остатки.ДокументОснование = Удержания.ДокументОснование
	|			И Остатки.СтатьяФинансирования = Удержания.СтатьяФинансирования
	|			И Остатки.СтатьяРасходов = Удержания.СтатьяРасходов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходВНатуральнойФорме КАК ДоходВНатуральнойФорме
	|		ПО Остатки.ФизическоеЛицо = ДоходВНатуральнойФорме.ФизическоеЛицо";
	
	Запрос.Выполнить();
	
	ТаблицыКУдалению = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ВТЗарплатаКВыплатеОстатки");
	ТаблицыКУдалению.Добавить("ВТЗарплатаКВыплате");
	ТаблицыКУдалению.Добавить("ВТСписокСотрудников");
	ТаблицыКУдалению.Добавить("ВТУдержания");
	ТаблицыКУдалению.Добавить("ВТДоходВНатуральнойФорме");
	
	РезультатыРасчетов = Новый ТаблицаЗначений;
	РезультатыРасчетов.Колонки.Добавить("ФизическоеЛицо",Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	РезультатыРасчетов.Колонки.Добавить("МесяцНалоговогоПериода",Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	РезультатыРасчетов.Колонки.Добавить("РегистрацияВНалоговомОргане",Новый ОписаниеТипов("СправочникСсылка.РегистрацииВНалоговомОргане"));
	РезультатыРасчетов.Колонки.Добавить("ВидНалогаВзносаОтчисления",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалоговВзносовОтчислений"));
	РезультатыРасчетов.Колонки.Добавить("ВидДохода",Новый ОписаниеТипов("СправочникСсылка.ВидыДоходов"));
	РезультатыРасчетов.Колонки.Добавить("НалогВзнос",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)));
	РезультатыРасчетов.Колонки.Добавить("НачисленоНалога",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)));
	
	ЗарплатаКадры.СоздатьПустуюВТ(Запрос.МенеджерВременныхТаблиц, "РегистрНакопления.НалогиВзносыРасчетыНалогоплательщиков");

	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("ОкончательныйРасчет", ОкончательныйРасчет);
	
	ТекстЗапроса =  
		"ВЫБРАТЬ
		|	СписокСотрудников.ФизическоеЛицо,
		|	СписокСотрудников.ПериодВзаиморасчетов,
		|	СУММА(СписокСотрудников.СуммаНачисленная) КАК СуммаНачисленная,
		|	СУММА(СписокСотрудников.СуммаВыплаченная) КАК СуммаВыплаченная

		|ПОМЕСТИТЬ ВТСуммыНалоговВзносовПоСотрудникам
		|ИЗ
		|	ВТСписокСотрудников КАК СписокСотрудников
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокСотрудников.ФизическоеЛицо,
		|	СписокСотрудников.ПериодВзаиморасчетов";
	
	Запрос.Текст = ТекстЗапроса; 
	Запрос.Выполнить();
	
	ТаблицыКУдалению.Добавить("ВТСуммыНалоговВзносовПоСотрудникам");
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтрокиДанных.Период КАК Период,
	|	СтрокиДанных.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	СтрокиДанных.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СтрокиДанных.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
	|	СтрокиДанных.ВидДохода КАК ВидДохода,
	|	СтрокиДанных.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СтрокиДанных.Организация КАК Организация,
	|	СУММА(СтрокиДанных.НалогВзнос) КАК НалогВзнос,
	|	СтрокиДанных.ВидДвижения КАК ВидДвижения
	|ПОМЕСТИТЬ ВТДанныеРегистра
	|ИЗ
	|	(ВЫБРАТЬ
	|		НалогиВзносыРасчетыНалогоплательщиков.Период КАК Период,
	|		НалогиВзносыРасчетыНалогоплательщиков.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|		НалогиВзносыРасчетыНалогоплательщиков.ФизическоеЛицо КАК ФизическоеЛицо,
	|		НалогиВзносыРасчетыНалогоплательщиков.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
	|		НалогиВзносыРасчетыНалогоплательщиков.ВидДохода КАК ВидДохода,
	|		НалогиВзносыРасчетыНалогоплательщиков.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|		НалогиВзносыРасчетыНалогоплательщиков.Организация КАК Организация,
	|		НалогиВзносыРасчетыНалогоплательщиков.НалогВзнос КАК НалогВзнос,
	|		НалогиВзносыРасчетыНалогоплательщиков.ВидДвижения КАК ВидДвижения
	|	ИЗ
	|		РегистрНакопления.НалогиВзносыРасчетыНалогоплательщиков КАК НалогиВзносыРасчетыНалогоплательщиков
	|	ГДЕ
	|		НалогиВзносыРасчетыНалогоплательщиков.Регистратор <> &Регистратор
	|		И НалогиВзносыРасчетыНалогоплательщиков.Организация = &Организация
	|		И НалогиВзносыРасчетыНалогоплательщиков.Период <= &КонецМесяца
	|		И НалогиВзносыРасчетыНалогоплательщиков.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
	|		И НалогиВзносыРасчетыНалогоплательщиков.ФизическоеЛицо В 
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				СписокФизическихЛиц.ФизическоеЛицо
	|			ИЗ
	|				ВТСотрудники КАК СписокФизическихЛиц)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НалогиВзносыРасчетыНалогоплательщиков.Период,
	|		НалогиВзносыРасчетыНалогоплательщиков.МесяцНалоговогоПериода,
	|		НалогиВзносыРасчетыНалогоплательщиков.ФизическоеЛицо,
	|		НалогиВзносыРасчетыНалогоплательщиков.ВидНалогаВзносаОтчисления,
	|		НалогиВзносыРасчетыНалогоплательщиков.ВидДохода КАК ВидДохода,
	|		НалогиВзносыРасчетыНалогоплательщиков.РегистрацияВНалоговомОргане,
	|		НалогиВзносыРасчетыНалогоплательщиков.Организация,
	|		НалогиВзносыРасчетыНалогоплательщиков.НалогВзнос,
	|		НалогиВзносыРасчетыНалогоплательщиков.ВидДвижения
	|	ИЗ
	|		ВТРегистрНакопления_НалогиВзносыРасчетыНалогоплательщиков КАК НалогиВзносыРасчетыНалогоплательщиков
	|	ГДЕ
	|		НалогиВзносыРасчетыНалогоплательщиков.Период <= &КонецМесяца
	|		И НалогиВзносыРасчетыНалогоплательщиков.ФизическоеЛицо В 
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					СписокФизическихЛиц.ФизическоеЛицо
	|				ИЗ
	|					ВТСотрудники КАК СписокФизическихЛиц)) КАК СтрокиДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	СтрокиДанных.Период,
	|	СтрокиДанных.МесяцНалоговогоПериода,
	|	СтрокиДанных.ФизическоеЛицо,
	|	СтрокиДанных.ВидНалогаВзносаОтчисления,
	|	СтрокиДанных.ВидДохода,
	|	СтрокиДанных.РегистрацияВНалоговомОргане,
	|	СтрокиДанных.Организация,
	|	СтрокиДанных.ВидДвижения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(НАЧАЛОПЕРИОДА(НалогиВзносыРасчетыНалогоплательщиков.Период, ДЕНЬ)) КАК ДатаНачисления,
	|	НалогиВзносыРасчетыНалогоплательщиков.МесяцНалоговогоПериода КАК Период,
	|	НалогиВзносыРасчетыНалогоплательщиков.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	НалогиВзносыРасчетыНалогоплательщиков.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НалогиВзносыРасчетыНалогоплательщиков.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
	|	НалогиВзносыРасчетыНалогоплательщиков.ВидДохода КАК ВидДохода,
	|	НалогиВзносыРасчетыНалогоплательщиков.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	НалогиВзносыРасчетыНалогоплательщиков.Организация КАК Организация,
	|	СУММА(ВЫБОР
	|			КОГДА НалогиВзносыРасчетыНалогоплательщиков.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА НалогиВзносыРасчетыНалогоплательщиков.НалогВзнос
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НачисленоНалога,
	|	СУММА(ВЫБОР
	|			КОГДА НалогиВзносыРасчетыНалогоплательщиков.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА 0
	|			ИНАЧЕ НалогиВзносыРасчетыНалогоплательщиков.НалогВзнос
	|		КОНЕЦ) КАК УдержаноНалога,
	|	СУММА(ВЫБОР
	|			КОГДА НалогиВзносыРасчетыНалогоплательщиков.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА НалогиВзносыРасчетыНалогоплательщиков.НалогВзнос
	|			ИНАЧЕ -НалогиВзносыРасчетыНалогоплательщиков.НалогВзнос
	|		КОНЕЦ) КАК СуммаОстаток,
	|	ЕСТЬNULL(МАКСИМУМ(ВЫБОР
	|				КОГДА СуммыНалоговВзносовПоСотрудникам.СуммаНачисленная = 0
	|					ТОГДА 1
	|				КОГДА СуммыНалоговВзносовПоСотрудникам.СуммаВыплаченная ЕСТЬ NULL 
	|					ТОГДА 1
	|				ИНАЧЕ СуммыНалоговВзносовПоСотрудникам.СуммаВыплаченная / СуммыНалоговВзносовПоСотрудникам.СуммаНачисленная
	|			КОНЕЦ), 1) КАК Доля,
	|	МАКСИМУМ(НалогиВзносыРасчетыНалогоплательщиков.НалогВзнос) КАК СуммаВыплаты
	|ПОМЕСТИТЬ ВТДанныеУчета
	|ИЗ
	|		ВТДанныеРегистра КАК НалогиВзносыРасчетыНалогоплательщиков
	|		ЛЕВОЕ СОЕДИНЕНИЕ  ВТСуммыНалоговВзносовПоСотрудникам КАК СуммыНалоговВзносовПоСотрудникам
	|		ПО СуммыНалоговВзносовПоСотрудникам.ФизическоеЛицо = НалогиВзносыРасчетыНалогоплательщиков.ФизическоеЛицо
	|			И НАЧАЛОПЕРИОДА(СуммыНалоговВзносовПоСотрудникам.ПериодВзаиморасчетов, МЕСЯЦ) = НАЧАЛОПЕРИОДА(НалогиВзносыРасчетыНалогоплательщиков.МесяцНалоговогоПериода, МЕСЯЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	НалогиВзносыРасчетыНалогоплательщиков.ФизическоеЛицо,
	|	НалогиВзносыРасчетыНалогоплательщиков.ВидНалогаВзносаОтчисления,
	|	НалогиВзносыРасчетыНалогоплательщиков.ВидДохода,
	|	НалогиВзносыРасчетыНалогоплательщиков.РегистрацияВНалоговомОргане,
	|	НалогиВзносыРасчетыНалогоплательщиков.Организация,
	|	НалогиВзносыРасчетыНалогоплательщиков.МесяцНалоговогоПериода,
	|	НалогиВзносыРасчетыНалогоплательщиков.МесяцНалоговогоПериода
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА НалогиВзносыРасчетыНалогоплательщиков.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА НалогиВзносыРасчетыНалогоплательщиков.НалогВзнос
	|			ИНАЧЕ -НалогиВзносыРасчетыНалогоплательщиков.НалогВзнос
	|		КОНЕЦ) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеУчета.ДатаНачисления КАК ДатаНачисления,
	|	ДанныеУчета.Период КАК Период,
	|	ДанныеУчета.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ДанныеУчета.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеУчета.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
	|	ДанныеУчета.ВидДохода КАК ВидДохода,
	|	ДанныеУчета.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ДанныеУчета.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ДанныеУчета.СуммаОстаток < 0
	|			ТОГДА ДанныеУчета.СуммаОстаток
	|		КОГДА ДанныеУчета.Доля = 1
	|			ТОГДА ДанныеУчета.СуммаОстаток
	|		КОГДА ДанныеУчета.СуммаОстаток <= ВЫБОР
	|				КОГДА (ВЫРАЗИТЬ(ДанныеУчета.НачисленоНалога * ДанныеУчета.Доля КАК ЧИСЛО(15, 2))) - ДанныеУчета.УдержаноНалога > 0
	|					ТОГДА (ВЫРАЗИТЬ(ДанныеУчета.НачисленоНалога * ДанныеУчета.Доля КАК ЧИСЛО(15, 2))) - ДанныеУчета.УдержаноНалога
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|			ТОГДА ДанныеУчета.СуммаОстаток
	|		ИНАЧЕ ВЫБОР
	|				КОГДА (ВЫРАЗИТЬ(ДанныеУчета.НачисленоНалога * ДанныеУчета.Доля КАК ЧИСЛО(15, 2))) - ДанныеУчета.УдержаноНалога > 0
	|					ТОГДА (ВЫРАЗИТЬ(ДанныеУчета.НачисленоНалога * ДанныеУчета.Доля КАК ЧИСЛО(15, 2))) - ДанныеУчета.УдержаноНалога
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаОстаток,
	|	ДанныеУчета.СуммаВыплаты КАК СуммаВыплаты,
	|	ДанныеУчета.НачисленоНалога КАК НачисленоНалога,
    |   ДанныеУчета.УдержаноНалога КАК УдержаноНалога
	|ПОМЕСТИТЬ ВТПодробно
	|ИЗ
	|	ВТДанныеУчета КАК ДанныеУчета
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ДанныеУчета.СуммаОстаток < 0
	|				ТОГДА ДанныеУчета.СуммаОстаток
	|			КОГДА ДанныеУчета.Доля = 1
	|				ТОГДА ДанныеУчета.СуммаОстаток
	|			КОГДА ДанныеУчета.СуммаОстаток <= ВЫБОР
	|					КОГДА (ВЫРАЗИТЬ(ДанныеУчета.НачисленоНалога * ДанныеУчета.Доля КАК ЧИСЛО(15, 2))) - ДанныеУчета.УдержаноНалога > 0
	|						ТОГДА (ВЫРАЗИТЬ(ДанныеУчета.НачисленоНалога * ДанныеУчета.Доля КАК ЧИСЛО(15, 2))) - ДанныеУчета.УдержаноНалога
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|				ТОГДА ДанныеУчета.СуммаОстаток
	|			ИНАЧЕ ВЫБОР
	|					КОГДА (ВЫРАЗИТЬ(ДанныеУчета.НачисленоНалога * ДанныеУчета.Доля КАК ЧИСЛО(15, 2))) - ДанныеУчета.УдержаноНалога > 0
	|						ТОГДА (ВЫРАЗИТЬ(ДанныеУчета.НачисленоНалога * ДанныеУчета.Доля КАК ЧИСЛО(15, 2))) - ДанныеУчета.УдержаноНалога
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПодробныеДанные.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПодробныеДанные.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
	|	ПодробныеДанные.ВидДохода КАК ВидДохода,
	|	НАЧАЛОПЕРИОДА(ПодробныеДанные.МесяцНалоговогоПериода, ДЕНЬ) КАК ДатаПолученияДохода,
	|	СУММА(ПодробныеДанные.СуммаОстаток) КАК СуммаОстаток
	|ПОМЕСТИТЬ ВТПоФизическомуЛицуНаДатуПолученияДохода
	|ИЗ
	|	ВТПодробно КАК ПодробныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ПодробныеДанные.ФизическоеЛицо,
	|	ПодробныеДанные.ВидНалогаВзносаОтчисления,
	|	ПодробныеДанные.ВидДохода,
	|	НАЧАЛОПЕРИОДА(ПодробныеДанные.МесяцНалоговогоПериода, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПодробныеДанные.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПодробныеДанные.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
	|	ПодробныеДанные.ВидДохода КАК ВидДохода,
	|	НАЧАЛОПЕРИОДА(ПодробныеДанные.МесяцНалоговогоПериода, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	СУММА(ПодробныеДанные.СуммаОстаток) КАК СуммаОстаток,
    |   ПодробныеДанные.УдержаноНалога КАК УдержаноНалога
	|ПОМЕСТИТЬ ВТПоФизическомуЛицуЗаМесяц
	|ИЗ
	|	ВТПодробно КАК ПодробныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ПодробныеДанные.ФизическоеЛицо,
	|	ПодробныеДанные.ВидНалогаВзносаОтчисления,
	|	ПодробныеДанные.ВидДохода,
	|	НАЧАЛОПЕРИОДА(ПодробныеДанные.МесяцНалоговогоПериода, МЕСЯЦ),
    |   ПодробныеДанные.УдержаноНалога";
	Запрос.Выполнить();
	ТаблицыКУдалению.Добавить("ВТДанныеУчета");
	ТаблицыКУдалению.Добавить("ВТПодробно");
	ТаблицыКУдалению.Добавить("ВТПоФизическомуЛицуНаДатуПолученияДохода");
	ТаблицыКУдалению.Добавить("ВТПоФизическомуЛицуЗаМесяц");
	
	Запрос.Текст =  
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПодробныеДанные.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПодробныеДанные.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
	|	ПодробныеДанные.ВидДохода КАК ВидДохода,
	|	СУММА(ПодробныеДанные.СуммаОстаток) КАК СуммаОстаток,
	|	ГОД(ПодробныеДанные.МесяцНалоговогоПериода) КАК НалоговыйПериод
	|ПОМЕСТИТЬ ВТВсегоПоФизическомуЛицу
	|ИЗ
	|	ВТПодробно КАК ПодробныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ПодробныеДанные.ФизическоеЛицо,
	|	ПодробныеДанные.ВидНалогаВзносаОтчисления,
	|	ПодробныеДанные.ВидДохода,
	|	ГОД(ПодробныеДанные.МесяцНалоговогоПериода)
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ПорядокОкругленияРезультатовРасчетаЗарплатыСрезПоследних.ВидРасчета КАК ВидРасчета,
    |	ПорядокОкругленияРезультатовРасчетаЗарплатыСрезПоследних.СпособОкругления.ПравилоОкругления КАК ПравилоОкругления,
    |	ПорядокОкругленияРезультатовРасчетаЗарплатыСрезПоследних.СпособОкругления.Точность КАК Точность,
    |	ПорядокОкругленияРезультатовРасчетаЗарплатыСрезПоследних.Период КАК Период
    |ПОМЕСТИТЬ ВТ_СпособыОкругленияОрганизации
    |ИЗ
    |	РегистрСведений.ПорядокОкругленияРезультатовРасчетаЗарплаты.СрезПоследних(
    |			&ПериодРегистрации,
    |			Организация = &Организация
    |				И ВидРасчета В (ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОПВ), ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС), ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН))) КАК ПорядокОкругленияРезультатовРасчетаЗарплатыСрезПоследних
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	МАКСИМУМ(СпособыОкругленияОрганизации.ПравилоОкругления) КАК ПравилоОкругления,
    |	МАКСИМУМ(СпособыОкругленияОрганизации.Точность) КАК ТочностьОкругления,
    |	СпособыОкругленияОрганизации.Период КАК Период,
    |	СпособыОкругленияОрганизации.ВидРасчета КАК ВидРасчета
    |ПОМЕСТИТЬ ВТ_СпособыОкругления
    |ИЗ
    |	ВТ_СпособыОкругленияОрганизации КАК СпособыОкругленияОрганизации
    |
    |СГРУППИРОВАТЬ ПО
    |	СпособыОкругленияОрганизации.Период,
    |	СпособыОкругленияОрганизации.ВидРасчета
    |;
    |
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыНалоговВзносовПоСотрудникам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СуммыНалоговВзносовПоСотрудникам.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
	|	СуммыНалоговВзносовПоСотрудникам.ВидДохода КАК ВидДохода,
	|	ВсегоПоФизическомуЛицу.НалоговыйПериод КАК НалоговыйПериод,
	|	ВсегоПоФизическомуЛицу.СуммаОстаток КАК ОстатокЗаНалоговыйПериод,
	|	НАЧАЛОПЕРИОДА(СуммыНалоговВзносовПоСотрудникам.МесяцНалоговогоПериода, МЕСЯЦ) КАК НачалоМесяцаНалоговогоПериода,
	|	СуммыНалоговВзносовПоСотрудникам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	СуммыНалоговВзносовПоСотрудникам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СуммыНалоговВзносовПоСотрудникам.СуммаОстаток КАК СуммаОстаток,
	|	СуммыНалоговВзносовПоСотрудникам.НачисленоНалога КАК НачисленоНалога,
	|	СуммыНалоговВзносовПоСотрудникам.Организация КАК Организация,
	|	СуммыНалоговВзносовПоСотрудникам.СуммаВыплаты КАК СуммаВыплаты,
    |	ПоФизическомуЛицуЗаМесяц.СуммаОстаток КАК СуммаЗаМесяц,
    |	ПоФизическомуЛицуЗаМесяц.УдержаноНалога КАК УдержаноНалога,
	|	ЕСТЬNULL(СпособыОкругления.ПравилоОкругления, ЗНАЧЕНИЕ(Перечисление.ПравилаОкругленияПриРасчетеЗарплаты.Авто)) КАК ПравилоОкругления,
	|	ЕСТЬNULL(СпособыОкругления.ТочностьОкругления, 0.01) КАК ТочностьОкругления
	|ИЗ
	|	ВТПодробно КАК СуммыНалоговВзносовПоСотрудникам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВсегоПоФизическомуЛицу КАК ВсегоПоФизическомуЛицу
	|		ПО СуммыНалоговВзносовПоСотрудникам.ФизическоеЛицо = ВсегоПоФизическомуЛицу.ФизическоеЛицо
	|			И СуммыНалоговВзносовПоСотрудникам.ВидНалогаВзносаОтчисления = ВсегоПоФизическомуЛицу.ВидНалогаВзносаОтчисления
	|			И СуммыНалоговВзносовПоСотрудникам.ВидДохода = ВсегоПоФизическомуЛицу.ВидДохода
	|			И (ГОД(СуммыНалоговВзносовПоСотрудникам.МесяцНалоговогоПериода) = ВсегоПоФизическомуЛицу.НалоговыйПериод)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоФизическомуЛицуЗаМесяц КАК ПоФизическомуЛицуЗаМесяц
	|		ПО СуммыНалоговВзносовПоСотрудникам.ФизическоеЛицо = ПоФизическомуЛицуЗаМесяц.ФизическоеЛицо
	|			И СуммыНалоговВзносовПоСотрудникам.ВидНалогаВзносаОтчисления = ПоФизическомуЛицуЗаМесяц.ВидНалогаВзносаОтчисления
	|			И СуммыНалоговВзносовПоСотрудникам.ВидДохода = ПоФизическомуЛицуЗаМесяц.ВидДохода
	|			И (НАЧАЛОПЕРИОДА(СуммыНалоговВзносовПоСотрудникам.МесяцНалоговогоПериода, МЕСЯЦ) = ПоФизическомуЛицуЗаМесяц.МесяцНалоговогоПериода)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоФизическомуЛицуНаДатуПолученияДохода КАК ПоФизическомуЛицуНаДатуПолученияДохода
	|		ПО СуммыНалоговВзносовПоСотрудникам.ФизическоеЛицо = ПоФизическомуЛицуНаДатуПолученияДохода.ФизическоеЛицо
	|			И СуммыНалоговВзносовПоСотрудникам.ВидНалогаВзносаОтчисления = ПоФизическомуЛицуНаДатуПолученияДохода.ВидНалогаВзносаОтчисления
	|			И СуммыНалоговВзносовПоСотрудникам.ВидДохода = ПоФизическомуЛицуНаДатуПолученияДохода.ВидДохода
	|			И СуммыНалоговВзносовПоСотрудникам.МесяцНалоговогоПериода = ПоФизическомуЛицуНаДатуПолученияДохода.ДатаПолученияДохода
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СпособыОкругления КАК СпособыОкругления
    |		ПО СуммыНалоговВзносовПоСотрудникам.ВидНалогаВзносаОтчисления = СпособыОкругления.ВидРасчета
    |ГДЕ
	|	ВсегоПоФизическомуЛицу.СуммаОстаток > 0
	|	И ПоФизическомуЛицуНаДатуПолученияДохода.СуммаОстаток <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизическоеЛицо,
	|	ВидНалогаВзносаОтчисления,
	|	ВидДохода,
	|	НалоговыйПериод,
	|	НачалоМесяцаНалоговогоПериода,
	|	МесяцНалоговогоПериода,
	|	СуммыНалоговВзносовПоСотрудникам.ДатаНачисления,
	|	РегистрацияВНалоговомОргане";
	
	МассивРез = Запрос.ВыполнитьПакет();
	Выборка = МассивРез[3].Выбрать();
	
	ТаблицыКУдалению.Добавить("ВТВсегоПоФизическомуЛицу");
	
	Пока Выборка.СледующийПоЗначениюПоля("ФизическоеЛицо") Цикл 
		
		Пока Выборка.СледующийПоЗначениюПоля("ВидНалогаВзносаОтчисления") Цикл 
			
			Пока Выборка.СледующийПоЗначениюПоля("ВидДохода") Цикл 
				Пока Выборка.СледующийПоЗначениюПоля("НалоговыйПериод") Цикл 
					Если Выборка.ОстатокЗаНалоговыйПериод >= 0 Тогда
						ОстатокКУдержанию = 0;
						Пока Выборка.СледующийПоЗначениюПоля("НачалоМесяцаНалоговогоПериода") Цикл 
							СуммаКРаспределению = Выборка.ОстатокЗаНалоговыйПериод;
							ОстатокКУдержанию = ОстатокКУдержанию + Выборка.СуммаЗаМесяц;
							Если ОстатокКУдержанию > 0 И Выборка.СуммаЗаМесяц > 0 Тогда
								Пока Выборка.Следующий() И СуммаКРаспределению > 0 И ОстатокКУдержанию > 0 Цикл
									Если Выборка.СуммаОстаток > 0 Тогда

										СписываемаяСумма = Мин(Выборка.СуммаОстаток, ОстатокКУдержанию);
										СуммаКРаспределению = СуммаКРаспределению - СписываемаяСумма;
										ОстатокКУдержанию = ОстатокКУдержанию - СписываемаяСумма;
										
										СтрокаТаблицыРезультатов = РезультатыРасчетов.Добавить();
										ЗаполнитьЗначенияСвойств(СтрокаТаблицыРезультатов, Выборка);
                                        
                                        Если ПериодРегистрации >= Дата(2020,1,1) И Выборка.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС Тогда
                                            НалогВзнос = ЗарплатаКадрыКлиентСервер.Округлить(СписываемаяСумма, 1, ПредопределенноеЗначение("Перечисление.ПравилаОкругленияПриРасчетеЗарплаты.ВБольшуюСторону"));
                                        Иначе
                                            НалогВзнос = ЗарплатаКадрыКлиентСервер.Округлить(СписываемаяСумма, Выборка.ТочностьОкругления, Выборка.ПравилоОкругления);
                                        КонецЕсли;
                                        
                                        //проверяем остатки на текущий период, если есть остатки с дробью, не округляем значение, чтобы не увеличить сумму выплаченных налогов
                                        Если Выборка.НачисленоНалога - Выборка.УдержаноНалога <= НалогВзнос Тогда
                                            СтрокаТаблицыРезультатов.НалогВзнос = СписываемаяСумма;
                                        Иначе
                                            СтрокаТаблицыРезультатов.НалогВзнос = НалогВзнос;
                                        КонецЕсли; 
										
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
						КонецЦикла;
					Иначе
						СуммаКРаспределению = СуммаКРаспределению - Выборка.ОстатокЗаНалоговыйПериод;
						СтрокаТаблицыРезультатов = РезультатыРасчетов.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТаблицыРезультатов, Выборка);
                        Если ПериодРегистрации >= Дата(2020,1,1) И Выборка.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС Тогда
                            НалогВзнос = ЗарплатаКадрыКлиентСервер.Округлить(Выборка.ОстатокЗаНалоговыйПериод, 1, ПредопределенноеЗначение("Перечисление.ПравилаОкругленияПриРасчетеЗарплаты.ВБольшуюСторону"));
                        Иначе
                            НалогВзнос = ЗарплатаКадрыКлиентСервер.Округлить(Выборка.ОстатокЗаНалоговыйПериод, Выборка.ТочностьОкругления, Выборка.ПравилоОкругления);
                        КонецЕсли;
                        
                        //проверяем остатки на текущий период, если есть остатки с дробью, не округляем значение, чтобы не увеличить сумму выплаченных налогов
                        Если Выборка.НачисленоНалога - Выборка.УдержаноНалога <= НалогВзнос Тогда
                            СтрокаТаблицыРезультатов.НалогВзнос = Выборка.ОстатокЗаНалоговыйПериод;
                        Иначе
                            СтрокаТаблицыРезультатов.НалогВзнос = НалогВзнос;
                        КонецЕсли;
						СтрокаТаблицыРезультатов.МесяцНалоговогоПериода = Выборка.ПоследнийМесяцНалоговогоПериода;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, ТаблицыКУдалению);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьУдержаниеНалоговВзносовПоНУПрочиеДоходы(Ссылка, Организация, ДатаОперации, ПериодРегистрации = Неопределено) Экспорт
	
	РезультатыРасчетов = Новый ТаблицаЗначений;
	РезультатыРасчетов.Колонки.Добавить("ФизическоеЛицо",Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	РезультатыРасчетов.Колонки.Добавить("МесяцНалоговогоПериода",Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	РезультатыРасчетов.Колонки.Добавить("РегистрацияВНалоговомОргане",Новый ОписаниеТипов("СправочникСсылка.РегистрацииВНалоговомОргане"));
	РезультатыРасчетов.Колонки.Добавить("ВидНалогаВзносаОтчисления",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалоговВзносовОтчислений"));
	РезультатыРасчетов.Колонки.Добавить("ВидДохода",Новый ОписаниеТипов("СправочникСсылка.ВидыДоходов"));
	РезультатыРасчетов.Колонки.Добавить("НалогВзнос",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)));
	РезультатыРасчетов.Колонки.Добавить("НачисленоНалога",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)));
	
	// УПК
	ИспользоватьВедомостиДляВыплатыПрочихДоходов = Ложь;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ДивидендыИмяДокумента = "ДивидендыФизическимЛицам";
		ИспользоватьВедомостиДляВыплатыПрочихДоходов = ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов");	
		ТекстСоединенияДивиденды = "";
	Иначе
		ДивидендыИмяДокумента = "НачислениеДивидендов";
		// в УПК ведомости прочих доходов используются всегда вне зависимости от ФО ИспользоватьВедомостиДляВыплатыПрочихДоходов
		ИспользоватьВедомостиДляВыплатыПрочихДоходов = Истина;	
		ТекстСоединенияДивиденды = "И ЛОЖЬ";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПериодРегистрации",ПериодРегистрации);
	Запрос.УстановитьПараметр("ПериодВзаиморасчетов",КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ПериодРегистрации));
	
	Если ИспользоватьВедомостиДляВыплатыПрочихДоходов Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыСКонтрагентамиОстатки.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВЫБОР
		|		КОГДА НЕ НачислениеЗарплаты.Ссылка ЕСТЬ NULL
		|			ТОГДА НачислениеЗарплаты.МесяцНачисления
		|		КОГДА НЕ НачислениеПоДоговорам.Ссылка ЕСТЬ NULL
		|			ТОГДА НачислениеПоДоговорам.МесяцНачисления
		|		КОГДА НЕ РегистрацияПрочихДоходов.Ссылка ЕСТЬ NULL
		|			ТОГДА РегистрацияПрочихДоходов.ПериодРегистрации
		|		КОГДА НЕ ДивидендыФизическимЛицам.Ссылка ЕСТЬ NULL
		|			ТОГДА НАЧАЛОПЕРИОДА(ДивидендыФизическимЛицам.ДатаВыплаты, МЕСЯЦ)
		|		КОГДА НЕ ВыплатаБывшимСотрудникам.Ссылка ЕСТЬ NULL
		|			ТОГДА ВыплатаБывшимСотрудникам.ПериодРегистрации
		|		ИНАЧЕ &ПериодРегистрации
		|	КОНЕЦ КАК ПериодВзаиморасчетов,
		|	ВзаиморасчетыСКонтрагентамиОстатки.СтатьяФинансирования КАК СтатьяФинансирования,
		|	ВзаиморасчетыСКонтрагентамиОстатки.СтатьяРасходов КАК СтатьяРасходов,
		|	ВзаиморасчетыСКонтрагентамиОстатки.ДокументОснование КАК ДокументОснование,
		|	СУММА(ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток) КАК СуммаКВыплате
		|ПОМЕСТИТЬ ВТВзаиморасчетыСКонтрагентамиОстатки
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами.Остатки(&ПериодВзаиморасчетов, Организация = &Организация) КАК ВзаиморасчетыСКонтрагентамиОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗарплаты КАК НачислениеЗарплаты 
		|		ПО НачислениеЗарплаты.Ссылка = ВзаиморасчетыСКонтрагентамиОстатки.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеПоДоговорам КАК НачислениеПоДоговорам 
		|		ПО НачислениеПоДоговорам.Ссылка = ВзаиморасчетыСКонтрагентамиОстатки.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияПрочихДоходов КАК РегистрацияПрочихДоходов 
		|		ПО РегистрацияПрочихДоходов.Ссылка = ВзаиморасчетыСКонтрагентамиОстатки.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ." + ДивидендыИмяДокумента + " КАК ДивидендыФизическимЛицам 
		|		ПО ДивидендыФизическимЛицам.Ссылка = ВзаиморасчетыСКонтрагентамиОстатки.ДокументОснование
		|			" + ТекстСоединенияДивиденды + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыплатаБывшимСотрудникам КАК ВыплатаБывшимСотрудникам 
		|		ПО ВыплатаБывшимСотрудникам.Ссылка = ВзаиморасчетыСКонтрагентамиОстатки.ДокументОснование
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзаиморасчетыСКонтрагентамиОстатки.ФизическоеЛицо,
		|	ВЫБОР
		|		КОГДА НЕ НачислениеЗарплаты.Ссылка ЕСТЬ NULL
		|			ТОГДА НачислениеЗарплаты.МесяцНачисления
		|		КОГДА НЕ НачислениеПоДоговорам.Ссылка ЕСТЬ NULL
		|			ТОГДА НачислениеПоДоговорам.МесяцНачисления
		|		КОГДА НЕ РегистрацияПрочихДоходов.Ссылка ЕСТЬ NULL
		|			ТОГДА РегистрацияПрочихДоходов.ПериодРегистрации
		|		КОГДА НЕ ДивидендыФизическимЛицам.Ссылка ЕСТЬ NULL
		|			ТОГДА НАЧАЛОПЕРИОДА(ДивидендыФизическимЛицам.ДатаВыплаты, МЕСЯЦ)
		|		КОГДА НЕ ВыплатаБывшимСотрудникам.Ссылка ЕСТЬ NULL
		|			ТОГДА ВыплатаБывшимСотрудникам.ПериодРегистрации
		|		ИНАЧЕ &ПериодРегистрации
		|	КОНЕЦ,
		|	ВзаиморасчетыСКонтрагентамиОстатки.СтатьяФинансирования,
		|	ВзаиморасчетыСКонтрагентамиОстатки.СтатьяРасходов,
		|	ВзаиморасчетыСКонтрагентамиОстатки.ДокументОснование
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизическоеЛицо,
		|	ДокументОснование,
		|	СтатьяФинансирования,
		|	СтатьяРасходов
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ) КАК Период,
		|	ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование КАК ДокументОснование,
		|	ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяФинансирования КАК СтатьяФинансирования,
		|	ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяРасходов КАК СтатьяРасходов,
		|	СУММА(ВЫБОР
		|			КОГДА ВзаиморасчетыСКонтрагентамиАкционерами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА ВзаиморасчетыСКонтрагентамиАкционерами.СуммаВзаиморасчетов
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНачисленная,
		|	СУММА(ВЫБОР
		|			КОГДА ВзаиморасчетыСКонтрагентамиАкционерами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ВзаиморасчетыСКонтрагентамиАкционерами.СуммаВзаиморасчетов
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаВыплаченная
		|ПОМЕСТИТЬ ВТВзаиморасчетыСКонтрагентами
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами КАК ВзаиморасчетыСКонтрагентамиАкционерами
		|ГДЕ
		|	ВзаиморасчетыСКонтрагентамиАкционерами.Период <= &ПериодРегистрации
		|	И ВзаиморасчетыСКонтрагентамиАкционерами.Организация = &Организация
		|	И ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование В
		|			(ВЫБРАТЬ
		|				ВзаиморасчетыСКонтрагентамиОстатки.ДокументОснование
		|			ИЗ
		|				ВТВзаиморасчетыСКонтрагентамиОстатки КАК ВзаиморасчетыСКонтрагентамиОстатки)
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ),
		|	ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо,
		|	ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование,
		|	ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяФинансирования,
		|	ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяРасходов
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизическоеЛицо,
		|	ДокументОснование,
		|	СтатьяФинансирования,
		|	СтатьяРасходов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Остатки.ДокументОснование КАК ДокументОснование,
		|	Остатки.СтатьяФинансирования КАК СтатьяФинансирования,
		|	Остатки.СтатьяРасходов КАК СтатьяРасходов,
		|	Остатки.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
		|	ЕСТЬNULL(ВзаиморасчетыСКонтрагентами.СуммаНачисленная, 0) КАК  СуммаНачисленная,
		|	ЕСТЬNULL(ВзаиморасчетыСКонтрагентами.СуммаВыплаченная, 0) КАК СуммаВыплаченная
		|ПОМЕСТИТЬ ВТВзаиморасчетыСКонтрагентамиОстаткиСумм
		|ИЗ
		|	ВТВзаиморасчетыСКонтрагентамиОстатки КАК Остатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВзаиморасчетыСКонтрагентами КАК ВзаиморасчетыСКонтрагентами
		|		ПО Остатки.ФизическоеЛицо = ВзаиморасчетыСКонтрагентами.ФизическоеЛицо
		|			И Остатки.ДокументОснование = ВзаиморасчетыСКонтрагентами.ДокументОснование
		|			И Остатки.СтатьяФинансирования = ВзаиморасчетыСКонтрагентами.СтатьяФинансирования
		|			И Остатки.СтатьяРасходов = ВзаиморасчетыСКонтрагентами.СтатьяРасходов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТВзаиморасчетыСКонтрагентамиОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТВзаиморасчетыСКонтрагентами
		|";	
		
	Иначе
		    
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодВзаиморасчетов,
		|	0 КАК СуммаНачисленная,
		|	0 КАК СуммаВыплаченная
		|ПОМЕСТИТЬ ВТВзаиморасчетыСКонтрагентамиОстаткиСумм";
	
	КонецЕсли;
	
	Запрос.Выполнить();
	
	ТекстЗапроса =  
		"ВЫБРАТЬ
		|	СписокСотрудников.ФизическоеЛицо,
		|	СписокСотрудников.ПериодВзаиморасчетов,
		|	СУММА(СписокСотрудников.СуммаНачисленная) КАК СуммаНачисленная,
		|	СУММА(СписокСотрудников.СуммаВыплаченная) КАК СуммаВыплаченная
		|
		|ПОМЕСТИТЬ ВТСуммыНалоговВзносовПоСотрудникам
		|ИЗ
		|	ВТВзаиморасчетыСКонтрагентамиОстаткиСумм КАК СписокСотрудников
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокСотрудников.ФизическоеЛицо,
		|	СписокСотрудников.ПериодВзаиморасчетов
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизическоеЛицо,
		|	ПериодВзаиморасчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТВзаиморасчетыСКонтрагентамиОстаткиСумм";
	
	Запрос.Текст = ТекстЗапроса; 
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НалогиВзносыРасчетыНалогоплательщиков.Период КАК Период,
	|	НалогиВзносыРасчетыНалогоплательщиков.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	НалогиВзносыРасчетыНалогоплательщиков.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НалогиВзносыРасчетыНалогоплательщиков.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
	|	НалогиВзносыРасчетыНалогоплательщиков.ВидДохода КАК ВидДохода,
	|	НалогиВзносыРасчетыНалогоплательщиков.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	НалогиВзносыРасчетыНалогоплательщиков.Организация КАК Организация,
	|	СУММА(НалогиВзносыРасчетыНалогоплательщиков.НалогВзнос) КАК НалогВзнос,
	|	НалогиВзносыРасчетыНалогоплательщиков.ВидДвижения КАК ВидДвижения
	|ПОМЕСТИТЬ ВТНалогиВзносыРасчетыНалогоплательщиков
	|ИЗ
	|	РегистрНакопления.НалогиВзносыРасчетыНалогоплательщиков КАК НалогиВзносыРасчетыНалогоплательщиков
	|ГДЕ
	|	НалогиВзносыРасчетыНалогоплательщиков.Регистратор <> &Регистратор
	|	И НалогиВзносыРасчетыНалогоплательщиков.Организация = &Организация
	|	И НалогиВзносыРасчетыНалогоплательщиков.Период <= &КонецМесяца
	|	И НЕ НалогиВзносыРасчетыНалогоплательщиков.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
	|	
	|СГРУППИРОВАТЬ ПО
	|	НалогиВзносыРасчетыНалогоплательщиков.Период,
	|	НалогиВзносыРасчетыНалогоплательщиков.МесяцНалоговогоПериода,
	|	НалогиВзносыРасчетыНалогоплательщиков.ФизическоеЛицо,
	|	НалогиВзносыРасчетыНалогоплательщиков.ВидНалогаВзносаОтчисления,
	|	НалогиВзносыРасчетыНалогоплательщиков.ВидДохода,
	|	НалогиВзносыРасчетыНалогоплательщиков.РегистрацияВНалоговомОргане,
	|	НалогиВзносыРасчетыНалогоплательщиков.Организация,
	|	НалогиВзносыРасчетыНалогоплательщиков.ВидДвижения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	МесяцНалоговогоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(НАЧАЛОПЕРИОДА(НалогиВзносыРасчетыНалогоплательщиков.Период, ДЕНЬ)) КАК ДатаНачисления,
	|	НалогиВзносыРасчетыНалогоплательщиков.МесяцНалоговогоПериода КАК Период,
	|	НалогиВзносыРасчетыНалогоплательщиков.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	НалогиВзносыРасчетыНалогоплательщиков.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НалогиВзносыРасчетыНалогоплательщиков.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
	|	НалогиВзносыРасчетыНалогоплательщиков.ВидДохода КАК ВидДохода,
	|	НалогиВзносыРасчетыНалогоплательщиков.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	НалогиВзносыРасчетыНалогоплательщиков.Организация КАК Организация,
	|	СУММА(ВЫБОР
	|			КОГДА НалогиВзносыРасчетыНалогоплательщиков.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА НалогиВзносыРасчетыНалогоплательщиков.НалогВзнос
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НачисленоНалога,
	|	СУММА(ВЫБОР
	|			КОГДА НалогиВзносыРасчетыНалогоплательщиков.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА 0
	|			ИНАЧЕ НалогиВзносыРасчетыНалогоплательщиков.НалогВзнос
	|		КОНЕЦ) КАК УдержаноНалога,
	|	СУММА(ВЫБОР
	|			КОГДА НалогиВзносыРасчетыНалогоплательщиков.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА НалогиВзносыРасчетыНалогоплательщиков.НалогВзнос
	|			ИНАЧЕ -НалогиВзносыРасчетыНалогоплательщиков.НалогВзнос
	|		КОНЕЦ) КАК СуммаОстаток,
	|	ЕСТЬNULL(МАКСИМУМ(ВЫБОР
	|				КОГДА СуммыНалоговВзносовПоСотрудникам.СуммаНачисленная = 0
	|					ТОГДА 1
	|				КОГДА СуммыНалоговВзносовПоСотрудникам.СуммаВыплаченная ЕСТЬ NULL 
	|					ТОГДА 1
	|				ИНАЧЕ СуммыНалоговВзносовПоСотрудникам.СуммаВыплаченная / СуммыНалоговВзносовПоСотрудникам.СуммаНачисленная
	|			КОНЕЦ), 1) КАК Доля,
	|	МАКСИМУМ(НалогиВзносыРасчетыНалогоплательщиков.НалогВзнос) КАК СуммаВыплаты
	|ПОМЕСТИТЬ ВТДанныеУчетаСДолей
	|ИЗ
	|	ВТНалогиВзносыРасчетыНалогоплательщиков КАК НалогиВзносыРасчетыНалогоплательщиков
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСуммыНалоговВзносовПоСотрудникам КАК СуммыНалоговВзносовПоСотрудникам
	|		ПО СуммыНалоговВзносовПоСотрудникам.ФизическоеЛицо = НалогиВзносыРасчетыНалогоплательщиков.ФизическоеЛицо
	|			И НАЧАЛОПЕРИОДА(СуммыНалоговВзносовПоСотрудникам.ПериодВзаиморасчетов, МЕСЯЦ) = НАЧАЛОПЕРИОДА(НалогиВзносыРасчетыНалогоплательщиков.МесяцНалоговогоПериода, МЕСЯЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	НалогиВзносыРасчетыНалогоплательщиков.ФизическоеЛицо,
	|	НалогиВзносыРасчетыНалогоплательщиков.ВидНалогаВзносаОтчисления,
	|	НалогиВзносыРасчетыНалогоплательщиков.ВидДохода,
	|	НалогиВзносыРасчетыНалогоплательщиков.РегистрацияВНалоговомОргане,
	|	НалогиВзносыРасчетыНалогоплательщиков.Организация,
	|	НалогиВзносыРасчетыНалогоплательщиков.МесяцНалоговогоПериода,
	|	НалогиВзносыРасчетыНалогоплательщиков.МесяцНалоговогоПериода
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА НалогиВзносыРасчетыНалогоплательщиков.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА НалогиВзносыРасчетыНалогоплательщиков.НалогВзнос
	|			ИНАЧЕ -НалогиВзносыРасчетыНалогоплательщиков.НалогВзнос
	|		КОНЕЦ) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТНалогиВзносыРасчетыНалогоплательщиков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеУчета.ДатаНачисления КАК ДатаНачисления,
	|	ДанныеУчета.Период КАК Период,
	|	ДанныеУчета.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ДанныеУчета.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеУчета.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
	|	ДанныеУчета.ВидДохода КАК ВидДохода,
	|	ДанныеУчета.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ДанныеУчета.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ДанныеУчета.СуммаОстаток < 0
	|			ТОГДА ДанныеУчета.СуммаОстаток
	|		КОГДА ДанныеУчета.Доля = 1
	|			ТОГДА ДанныеУчета.СуммаОстаток
	|		КОГДА ДанныеУчета.СуммаОстаток <= ВЫБОР
	|				КОГДА (ВЫРАЗИТЬ(ДанныеУчета.НачисленоНалога * ДанныеУчета.Доля КАК ЧИСЛО(15, 2))) - ДанныеУчета.УдержаноНалога > 0
	|					ТОГДА (ВЫРАЗИТЬ(ДанныеУчета.НачисленоНалога * ДанныеУчета.Доля КАК ЧИСЛО(15, 2))) - ДанныеУчета.УдержаноНалога
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|			ТОГДА ДанныеУчета.СуммаОстаток
	|		ИНАЧЕ ВЫБОР
	|				КОГДА (ВЫРАЗИТЬ(ДанныеУчета.НачисленоНалога * ДанныеУчета.Доля КАК ЧИСЛО(15, 2))) - ДанныеУчета.УдержаноНалога > 0
	|					ТОГДА (ВЫРАЗИТЬ(ДанныеУчета.НачисленоНалога * ДанныеУчета.Доля КАК ЧИСЛО(15, 2))) - ДанныеУчета.УдержаноНалога
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаОстаток,
	|	ДанныеУчета.СуммаВыплаты КАК СуммаВыплаты,
	|	ДанныеУчета.НачисленоНалога КАК НачисленоНалога,
    |	ДанныеУчета.УдержаноНалога КАК УдержаноНалога
	|ПОМЕСТИТЬ ВТПодробно
	|ИЗ
	|	ВТДанныеУчетаСДолей КАК ДанныеУчета
	|ГДЕ
	|	ВЫБОР
	|		КОГДА ДанныеУчета.СуммаОстаток < 0
	|			ТОГДА ДанныеУчета.СуммаОстаток
	|		КОГДА ДанныеУчета.Доля = 1
	|			ТОГДА ДанныеУчета.СуммаОстаток
	|		КОГДА ДанныеУчета.СуммаОстаток <= ВЫБОР
	|				КОГДА (ВЫРАЗИТЬ(ДанныеУчета.НачисленоНалога * ДанныеУчета.Доля КАК ЧИСЛО(15, 2))) - ДанныеУчета.УдержаноНалога > 0
	|					ТОГДА (ВЫРАЗИТЬ(ДанныеУчета.НачисленоНалога * ДанныеУчета.Доля КАК ЧИСЛО(15, 2))) - ДанныеУчета.УдержаноНалога
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|			ТОГДА ДанныеУчета.СуммаОстаток
	|		ИНАЧЕ ВЫБОР
	|				КОГДА (ВЫРАЗИТЬ(ДанныеУчета.НачисленоНалога * ДанныеУчета.Доля КАК ЧИСЛО(15, 2))) - ДанныеУчета.УдержаноНалога > 0
	|					ТОГДА (ВЫРАЗИТЬ(ДанныеУчета.НачисленоНалога * ДанныеУчета.Доля КАК ЧИСЛО(15, 2))) - ДанныеУчета.УдержаноНалога
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДанныеУчетаСДолей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСуммыНалоговВзносовПоСотрудникам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПодробныеДанные.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПодробныеДанные.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
	|	ПодробныеДанные.ВидДохода КАК ВидДохода,
	|	НАЧАЛОПЕРИОДА(ПодробныеДанные.МесяцНалоговогоПериода, ДЕНЬ) КАК ДатаПолученияДохода,
	|	СУММА(ПодробныеДанные.СуммаОстаток) КАК СуммаОстаток
	|ПОМЕСТИТЬ ВТПоФизическомуЛицуНаДатуПолученияДохода
	|ИЗ
	|	ВТПодробно КАК ПодробныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ПодробныеДанные.ФизическоеЛицо,
	|	ПодробныеДанные.ВидНалогаВзносаОтчисления,
	|	ПодробныеДанные.ВидДохода,
	|	НАЧАЛОПЕРИОДА(ПодробныеДанные.МесяцНалоговогоПериода, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПодробныеДанные.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПодробныеДанные.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
	|	ПодробныеДанные.ВидДохода КАК ВидДохода,
	|	НАЧАЛОПЕРИОДА(ПодробныеДанные.МесяцНалоговогоПериода, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	СУММА(ПодробныеДанные.СуммаОстаток) КАК СуммаОстаток,
    |	ПодробныеДанные.УдержаноНалога КАК УдержаноНалога
	|ПОМЕСТИТЬ ВТПоФизическомуЛицуЗаМесяц
	|ИЗ
	|	ВТПодробно КАК ПодробныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ПодробныеДанные.ФизическоеЛицо,
	|	ПодробныеДанные.ВидНалогаВзносаОтчисления,
	|	ПодробныеДанные.ВидДохода,
    |	ПодробныеДанные.УдержаноНалога,
	|	НАЧАЛОПЕРИОДА(ПодробныеДанные.МесяцНалоговогоПериода, МЕСЯЦ)";
	
	Запрос.Выполнить();
	
	Запрос.Текст =  
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПодробныеДанные.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПодробныеДанные.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
	|	ПодробныеДанные.ВидДохода КАК ВидДохода,
	|	СУММА(ПодробныеДанные.СуммаОстаток) КАК СуммаОстаток,
	|	ГОД(ПодробныеДанные.МесяцНалоговогоПериода) КАК НалоговыйПериод
	|ПОМЕСТИТЬ ВТВсегоПоФизическомуЛицу
	|ИЗ
	|	ВТПодробно КАК ПодробныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ПодробныеДанные.ФизическоеЛицо,
	|	ПодробныеДанные.ВидНалогаВзносаОтчисления,
	|	ПодробныеДанные.ВидДохода,
	|	ГОД(ПодробныеДанные.МесяцНалоговогоПериода)
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ПорядокОкругленияРезультатовРасчетаЗарплатыСрезПоследних.ВидРасчета КАК ВидРасчета,
    |	ПорядокОкругленияРезультатовРасчетаЗарплатыСрезПоследних.СпособОкругления.ПравилоОкругления КАК ПравилоОкругления,
    |	ПорядокОкругленияРезультатовРасчетаЗарплатыСрезПоследних.СпособОкругления.Точность КАК Точность,
    |	ПорядокОкругленияРезультатовРасчетаЗарплатыСрезПоследних.Период КАК Период
    |ПОМЕСТИТЬ ВТ_СпособыОкругленияОрганизации
    |ИЗ
    |	РегистрСведений.ПорядокОкругленияРезультатовРасчетаЗарплаты.СрезПоследних(
    |			&ПериодРегистрации,
    |			Организация = &Организация
    |				И ВидРасчета В (ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОПВ), ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС), ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН))) КАК ПорядокОкругленияРезультатовРасчетаЗарплатыСрезПоследних
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	МАКСИМУМ(СпособыОкругленияОрганизации.ПравилоОкругления) КАК ПравилоОкругления,
    |	МАКСИМУМ(СпособыОкругленияОрганизации.Точность) КАК ТочностьОкругления,
    |	СпособыОкругленияОрганизации.Период КАК Период,
    |	СпособыОкругленияОрганизации.ВидРасчета КАК ВидРасчета
    |ПОМЕСТИТЬ ВТ_СпособыОкругления
    |ИЗ
    |	ВТ_СпособыОкругленияОрганизации КАК СпособыОкругленияОрганизации
    |
    |СГРУППИРОВАТЬ ПО
    |	СпособыОкругленияОрганизации.Период,
    |	СпособыОкругленияОрганизации.ВидРасчета
    |;
    |
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыНалоговВзносовПоСотрудникам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СуммыНалоговВзносовПоСотрудникам.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
	|	СуммыНалоговВзносовПоСотрудникам.ВидДохода КАК ВидДохода,
	|	ВсегоПоФизическомуЛицу.НалоговыйПериод КАК НалоговыйПериод,
	|	ВсегоПоФизическомуЛицу.СуммаОстаток КАК ОстатокЗаНалоговыйПериод,
	|	НАЧАЛОПЕРИОДА(СуммыНалоговВзносовПоСотрудникам.МесяцНалоговогоПериода, МЕСЯЦ) КАК НачалоМесяцаНалоговогоПериода,
	|	СуммыНалоговВзносовПоСотрудникам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	СуммыНалоговВзносовПоСотрудникам.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СуммыНалоговВзносовПоСотрудникам.СуммаОстаток КАК СуммаОстаток,
	|	СуммыНалоговВзносовПоСотрудникам.НачисленоНалога КАК НачисленоНалога,
	|	СуммыНалоговВзносовПоСотрудникам.Организация КАК Организация,
	|	СуммыНалоговВзносовПоСотрудникам.СуммаВыплаты КАК СуммаВыплаты,
	|	ПоФизическомуЛицуЗаМесяц.СуммаОстаток КАК СуммаЗаМесяц,
    |	ПоФизическомуЛицуЗаМесяц.УдержаноНалога КАК УдержаноНалога,
  	|	ЕСТЬNULL(СпособыОкругления.ПравилоОкругления, ЗНАЧЕНИЕ(Перечисление.ПравилаОкругленияПриРасчетеЗарплаты.Авто)) КАК ПравилоОкругления,
	|	ЕСТЬNULL(СпособыОкругления.ТочностьОкругления, 0.01) КАК ТочностьОкругления
	|ИЗ
	|	ВТПодробно КАК СуммыНалоговВзносовПоСотрудникам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВсегоПоФизическомуЛицу КАК ВсегоПоФизическомуЛицу
	|		ПО СуммыНалоговВзносовПоСотрудникам.ФизическоеЛицо = ВсегоПоФизическомуЛицу.ФизическоеЛицо
	|			И СуммыНалоговВзносовПоСотрудникам.ВидНалогаВзносаОтчисления = ВсегоПоФизическомуЛицу.ВидНалогаВзносаОтчисления
	|			И СуммыНалоговВзносовПоСотрудникам.ВидДохода = ВсегоПоФизическомуЛицу.ВидДохода
	|			И (ГОД(СуммыНалоговВзносовПоСотрудникам.МесяцНалоговогоПериода) = ВсегоПоФизическомуЛицу.НалоговыйПериод)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоФизическомуЛицуЗаМесяц КАК ПоФизическомуЛицуЗаМесяц
	|		ПО СуммыНалоговВзносовПоСотрудникам.ФизическоеЛицо = ПоФизическомуЛицуЗаМесяц.ФизическоеЛицо
	|			И СуммыНалоговВзносовПоСотрудникам.ВидНалогаВзносаОтчисления = ПоФизическомуЛицуЗаМесяц.ВидНалогаВзносаОтчисления
	|			И СуммыНалоговВзносовПоСотрудникам.ВидДохода = ПоФизическомуЛицуЗаМесяц.ВидДохода
	|			И (НАЧАЛОПЕРИОДА(СуммыНалоговВзносовПоСотрудникам.МесяцНалоговогоПериода, МЕСЯЦ) = ПоФизическомуЛицуЗаМесяц.МесяцНалоговогоПериода)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоФизическомуЛицуНаДатуПолученияДохода КАК ПоФизическомуЛицуНаДатуПолученияДохода
	|		ПО СуммыНалоговВзносовПоСотрудникам.ФизическоеЛицо = ПоФизическомуЛицуНаДатуПолученияДохода.ФизическоеЛицо
	|			И СуммыНалоговВзносовПоСотрудникам.ВидНалогаВзносаОтчисления = ПоФизическомуЛицуНаДатуПолученияДохода.ВидНалогаВзносаОтчисления
	|			И СуммыНалоговВзносовПоСотрудникам.ВидДохода = ПоФизическомуЛицуНаДатуПолученияДохода.ВидДохода
	|			И СуммыНалоговВзносовПоСотрудникам.МесяцНалоговогоПериода = ПоФизическомуЛицуНаДатуПолученияДохода.ДатаПолученияДохода
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СпособыОкругления КАК СпособыОкругления
    |		ПО СуммыНалоговВзносовПоСотрудникам.ВидНалогаВзносаОтчисления = СпособыОкругления.ВидРасчета
    |ГДЕ
	|	ВсегоПоФизическомуЛицу.СуммаОстаток > 0
	|	И ПоФизическомуЛицуНаДатуПолученияДохода.СуммаОстаток <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизическоеЛицо,
	|	ВидНалогаВзносаОтчисления,
	|	ВидДохода,
	|	НалоговыйПериод,
	|	НачалоМесяцаНалоговогоПериода,
	|	МесяцНалоговогоПериода,
	|	СуммыНалоговВзносовПоСотрудникам.ДатаНачисления,
	|	РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПодробно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТВсегоПоФизическомуЛицу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПоФизическомуЛицуЗаМесяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПоФизическомуЛицуНаДатуПолученияДохода
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
 	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.СледующийПоЗначениюПоля("ФизическоеЛицо") Цикл 
		
		Пока Выборка.СледующийПоЗначениюПоля("ВидНалогаВзносаОтчисления") Цикл 
			
			Пока Выборка.СледующийПоЗначениюПоля("ВидДохода") Цикл 
				Пока Выборка.СледующийПоЗначениюПоля("НалоговыйПериод") Цикл 
					Если Выборка.ОстатокЗаНалоговыйПериод >= 0 Тогда
						ОстатокКУдержанию = 0;
						Пока Выборка.СледующийПоЗначениюПоля("НачалоМесяцаНалоговогоПериода") Цикл 
							СуммаКРаспределению = Выборка.ОстатокЗаНалоговыйПериод;
							ОстатокКУдержанию = ОстатокКУдержанию + Выборка.СуммаЗаМесяц;
							Если ОстатокКУдержанию > 0 И Выборка.СуммаЗаМесяц > 0 Тогда
								Пока Выборка.Следующий() И СуммаКРаспределению > 0 И ОстатокКУдержанию > 0 Цикл
									Если Выборка.СуммаОстаток > 0 Тогда
                                      
										СписываемаяСумма = Мин(Выборка.СуммаОстаток, ОстатокКУдержанию);
										СуммаКРаспределению = СуммаКРаспределению - СписываемаяСумма;
										ОстатокКУдержанию = ОстатокКУдержанию - СписываемаяСумма;
										
										СтрокаТаблицыРезультатов = РезультатыРасчетов.Добавить();
										ЗаполнитьЗначенияСвойств(СтрокаТаблицыРезультатов, Выборка);
                                        
                                        Если ПериодРегистрации >= Дата(2020,1,1) И Выборка.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС Тогда
                                            НалогВзнос = ЗарплатаКадрыКлиентСервер.Округлить(СписываемаяСумма, 1, ПредопределенноеЗначение("Перечисление.ПравилаОкругленияПриРасчетеЗарплаты.ВБольшуюСторону"));
                                        Иначе
                                            НалогВзнос = ЗарплатаКадрыКлиентСервер.Округлить(СписываемаяСумма, Выборка.ТочностьОкругления, Выборка.ПравилоОкругления);
                                        КонецЕсли;
                                        
                                        //проверяем остатки на текущий период, если есть остатки с дробью, не округляем значение, чтобы не увеличить сумму выплаченных налогов
                                        Если Выборка.НачисленоНалога - Выборка.УдержаноНалога <= НалогВзнос Тогда
                                            СтрокаТаблицыРезультатов.НалогВзнос = СписываемаяСумма;
                                        Иначе
                                            СтрокаТаблицыРезультатов.НалогВзнос = НалогВзнос;
                                        КонецЕсли; 
									
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
						КонецЦикла;
					Иначе
						СуммаКРаспределению = СуммаКРаспределению - Выборка.ОстатокЗаНалоговыйПериод;
						СтрокаТаблицыРезультатов = РезультатыРасчетов.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТаблицыРезультатов, Выборка);
                        Если ПериодРегистрации >= Дата(2020,1,1) И Выборка.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС Тогда
                            НалогВзнос = ЗарплатаКадрыКлиентСервер.Округлить(Выборка.ОстатокЗаНалоговыйПериод, 1, ПредопределенноеЗначение("Перечисление.ПравилаОкругленияПриРасчетеЗарплаты.ВБольшуюСторону"));
                        Иначе
                            НалогВзнос = ЗарплатаКадрыКлиентСервер.Округлить(Выборка.ОстатокЗаНалоговыйПериод, Выборка.ТочностьОкругления, Выборка.ПравилоОкругления);
                        КонецЕсли;
                        
                        //проверяем остатки на текущий период, если есть остатки с дробью, не округляем значение, чтобы не увеличить сумму выплаченных налогов
                        Если Выборка.НачисленоНалога - Выборка.УдержаноНалога <= НалогВзнос Тогда
                            СтрокаТаблицыРезультатов.НалогВзнос = Выборка.ОстатокЗаНалоговыйПериод;
                        Иначе
                            СтрокаТаблицыРезультатов.НалогВзнос = НалогВзнос;
                        КонецЕсли; 

						СтрокаТаблицыРезультатов.МесяцНалоговогоПериода = Выборка.ПоследнийМесяцНалоговогоПериода;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат РезультатыРасчетов;
	
КонецФункции

// Расчеты с 2019 года

Процедура СоздатьВТДанныеПоКорректировкеДоходаИПН(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет, ИсключатьДоходыРегистратора, ПрименятьКорректировку = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоМесяцаРасчета", НачалоМесяца(МесяцНачисления));
	Запрос.УстановитьПараметр("КонецМесяцаРасчета", КонецМесяца(МесяцНачисления));
	Запрос.УстановитьПараметр("ОкончательныйРасчет", ОкончательныйРасчет);
	Запрос.УстановитьПараметр("ПрименятьКорректировку", ПрименятьКорректировку);
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ?(ИсключатьДоходыРегистратора, Регистратор, Неопределено));
	
	// Накопленные данные по вычетам	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ПериодыПоФизлицам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(СведенияОбИсчисленииНалоговВзносовОтчислений.ПримененнаяЛьготаОборот) КАК ПримененнаяКорректировка
		|ПОМЕСТИТЬ ВТДанныеПоКорректировкеДоходаИПН
		|ИЗ
		|	ВТКадровыеДанныеСотрудниковПоПериодам КАК ПериодыПоФизлицам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СведенияОбИсчисленииНалоговВзносовОтчислений.Обороты(
		|				&НачалоМесяцаРасчета,
		|				&КонецМесяцаРасчета,
		|				Регистратор,
		|				Организация = &Организация
		|					И &ОкончательныйРасчет
		|					И &ПрименятьКорректировку
		|					И ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН)
		|					И ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)) КАК СведенияОбИсчисленииНалоговВзносовОтчислений
		|		ПО ПериодыПоФизлицам.ФизическоеЛицо = СведенияОбИсчисленииНалоговВзносовОтчислений.ФизическоеЛицо
		|			И ПериодыПоФизлицам.МесяцНалоговогоПериода >= СведенияОбИсчисленииНалоговВзносовОтчислений.Период
		|			И (ПериодыПоФизлицам.НачалоГодаНалоговогоПериода = НАЧАЛОПЕРИОДА(СведенияОбИсчисленииНалоговВзносовОтчислений.Период, ГОД))
		|			И (НАЧАЛОПЕРИОДА(ПериодыПоФизлицам.ДатаПриема, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(СведенияОбИсчисленииНалоговВзносовОтчислений.Период, МЕСЯЦ))
		|
		|ГДЕ
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.Регистратор <> &ИсключаемыйРегистратор
		|	И СведенияОбИсчисленииНалоговВзносовОтчислений.ПериодРегистрации >= ДАТАВРЕМЯ(2019, 1, 1)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода,
		|	ПериодыПоФизлицам.ФизическоеЛицо
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	МесяцНалоговогоПериода,
		|	ФизическоеЛицо
		|";
		
	Запрос.Выполнить();
	
КонецПроцедуры

// Взносы и отчисления ОСМС

Процедура СоздатьВТИсключаемыеЛицаОСМС(МенеджерВременныхТаблиц, ИмяТаблицы, МесяцНачисления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КонецМесяцаРасчета", КонецМесяца(МесяцНачисления)); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	// Исключаемые лица
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОПенсионномОбеспеченииФизическихЛиц.ФизическоеЛицо,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТИсключаемыеФизическиеЛица
		|ИЗ
		|	РегистрСведений.СведенияОПенсионномОбеспеченииФизическихЛиц.СрезПоследних(
		|			&КонецМесяцаРасчета,
		|			ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					СписокСотрудников.ФизическоеЛицо
		|				ИЗ
		|					ВТФизическиеЛица КАК СписокСотрудников)) КАК СведенияОПенсионномОбеспеченииФизическихЛиц
		|ГДЕ
		|	(СведенияОПенсионномОбеспеченииФизическихЛиц.ПенсионерПоВозрасту
		|			ИЛИ СведенияОПенсионномОбеспеченииФизическихЛиц.ПенсионерПоВыслугеЛет)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОбИнвалидностиФизическихЛицСрезПоследних.ФизическоеЛицо,
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода
		|ИЗ
		|	РегистрСведений.СведенияОбИнвалидностиФизическихЛиц.СрезПоследних(
		|			&КонецМесяцаРасчета,
		|			ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					СписокСотрудников.ФизическоеЛицо
		|				ИЗ
		|					ВТФизическиеЛица КАК СписокСотрудников)) КАК СведенияОбИнвалидностиФизическихЛицСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериодыПоФизлицам КАК ПериодыПоФизлицам
		|		ПО СведенияОбИнвалидностиФизическихЛицСрезПоследних.ФизическоеЛицо = ПериодыПоФизлицам.ФизическоеЛицо
		|ГДЕ
		|	СведенияОбИнвалидностиФизическихЛицСрезПоследних.ОтношениеКИнвалидности = ЗНАЧЕНИЕ(Перечисление.ОтношениеКИнвалидности.Инвалид)
		|	И (СведенияОбИнвалидностиФизическихЛицСрезПоследних.ДействуетДо = ДАТАВРЕМЯ(1,1,1) ИЛИ КОНЕЦПЕРИОДА(СведенияОбИнвалидностиФизическихЛицСрезПоследних.ДействуетДо, МЕСЯЦ) >= КОНЕЦПЕРИОДА(ПериодыПоФизлицам.МесяцНалоговогоПериода, МЕСЯЦ))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОФизическихЛицахУчастникахВОВСрезПоследних.ФизическоеЛицо,
		|	ДАТАВРЕМЯ(1, 1, 1)
		|ИЗ
		|	РегистрСведений.СведенияОФизическихЛицахУчастникахВОВ.СрезПоследних(
		|			&КонецМесяцаРасчета,
		|			ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					СписокСотрудников.ФизическоеЛицо
		|				ИЗ
		|					ВТФизическиеЛица КАК СписокСотрудников)) КАК СведенияОФизическихЛицахУчастникахВОВСрезПоследних
		|ГДЕ
		|	(СведенияОФизическихЛицахУчастникахВОВСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КатегорииФизическихЛицУчастниковВОВ.УчастникВОВ)
		|			ИЛИ СведенияОФизическихЛицахУчастникахВОВСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КатегорииФизическихЛицУчастниковВОВ.ИнвалидВОВ))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтатусФизическихЛицКакНалогоплательщиков.ФизическоеЛицо,
		|	ДАТАВРЕМЯ(1, 1, 1)
		|ИЗ
		|	РегистрСведений.СтатусФизическихЛицКакНалогоплательщиков.СрезПоследних(
		|			&КонецМесяцаРасчета,
		|			ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					СписокСотрудников.ФизическоеЛицо
		|				ИЗ
		|					ВТФизическиеЛица КАК СписокСотрудников)) КАК СтатусФизическихЛицКакНалогоплательщиков
		|ГДЕ
		|	НЕ СтатусФизическихЛицКакНалогоплательщиков.ПодлежитСоциальномуМедицинскомуСтрахованию";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТИсключаемыеФизическиеЛица", ИмяТаблицы);	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВТСтавкиОСМС(Организация, МенеджерВременныхТаблиц) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	// Ставки ОСМС
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	1 КАК Приоритет,
	|	МАКСИМУМ(ЕСТЬNULL(СведенияОСтавкахОСМС.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК ПериодСтавки,
	|	ПериодыРасчета.Период КАК МесяцНалоговогоПериода,
	|	СведенияОСтавкахОСМС.Организация КАК Организация,
	|	СведенияОСтавкахОСМС.ВидДохода КАК ВидДохода
	|ПОМЕСТИТЬ ВТПериодыСтавокОСМС
	|ИЗ
	|	ВТДатыПоМесяцам КАК ПериодыРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахОСМС КАК СведенияОСтавкахОСМС
	|		ПО ПериодыРасчета.Период >= СведенияОСтавкахОСМС.Период
	|ГДЕ
	|	СведенияОСтавкахОСМС.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ПериодыРасчета.Период,
	|	СведенияОСтавкахОСМС.Организация,
	|	СведенияОСтавкахОСМС.ВидДохода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	МАКСИМУМ(ЕСТЬNULL(СведенияОСтавкахОСМС.Период, ДАТАВРЕМЯ(1, 1, 1))),
	|	ПериодыРасчета.Период,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка),
	|	СведенияОСтавкахОСМС.ВидДохода
	|ИЗ
	|	ВТДатыПоМесяцам КАК ПериодыРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахОСМС КАК СведенияОСтавкахОСМС
	|		ПО ПериодыРасчета.Период >= СведенияОСтавкахОСМС.Период
	|ГДЕ
	|	СведенияОСтавкахОСМС.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПериодыРасчета.Период,
	|	СведенияОСтавкахОСМС.ВидДохода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПериодСтавки,
	|	ВидДохода,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыСтавокОСМС.Приоритет КАК Приоритет,
	|	ПериодыСтавокОСМС.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ПериодыСтавокОСМС.ПериодСтавки КАК ПериодСтавки,
	|	ПериодыСтавокОСМС.ВидДохода КАК ВидДохода,
	|	ЕСТЬNULL(СведенияОСтавкахОСМС.СтавкаВзносы, 0) / 100 КАК СтавкаВзносы,
	|	ЕСТЬNULL(СведенияОСтавкахОСМС.СтавкаОтчисления, 0) / 100 КАК СтавкаОтчисления
	|ПОМЕСТИТЬ ВТСтавкиОСМСПоПриоритетам
	|ИЗ
	|	ВТПериодыСтавокОСМС КАК ПериодыСтавокОСМС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахОСМС КАК СведенияОСтавкахОСМС
	|		ПО ПериодыСтавокОСМС.ПериодСтавки = СведенияОСтавкахОСМС.Период
	|			И ПериодыСтавокОСМС.Организация = СведенияОСтавкахОСМС.Организация
	|			И ПериодыСтавокОСМС.ВидДохода = СведенияОСтавкахОСМС.ВидДохода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Приоритет,
	|	МесяцНалоговогоПериода,
	|	ПериодСтавки,
	|	ВидДохода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтавкиПоПриоритетам.Приоритет КАК Приоритет,
	|	МаксимумСтавок.ПериодСтавки КАК ПериодСтавки,
	|	МаксимумСтавок.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	МаксимумСтавок.ВидДохода КАК ВидДохода
	|ПОМЕСТИТЬ ВТ_МаксимумыСтавокПоПериоду
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ПриоритетСтавок.ПериодСтавки) КАК ПериодСтавки,
	|		ПриоритетСтавок.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|		ПриоритетСтавок.ВидДохода КАК ВидДохода
	|	ИЗ
	|		ВТСтавкиОСМСПоПриоритетам КАК ПриоритетСтавок
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПриоритетСтавок.МесяцНалоговогоПериода,
	|		ПриоритетСтавок.ВидДохода) КАК МаксимумСтавок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиОСМСПоПриоритетам КАК ВТСтавкиПоПриоритетам
	|		ПО МаксимумСтавок.ПериодСтавки = ВТСтавкиПоПриоритетам.ПериодСтавки
	|			И МаксимумСтавок.МесяцНалоговогоПериода = ВТСтавкиПоПриоритетам.МесяцНалоговогоПериода
	|			И МаксимумСтавок.ВидДохода = ВТСтавкиПоПриоритетам.ВидДохода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	МесяцНалоговогоПериода,
	|	ВидДохода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриоритетСтавок.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ПриоритетСтавок.ВидДохода КАК ВидДохода,
	|	ВТСтавкиПоПриоритетам.СтавкаВзносы КАК СтавкаВзносы,
	|	ВТСтавкиПоПриоритетам.СтавкаОтчисления КАК СтавкаОтчисления
	|ПОМЕСТИТЬ ВТСтавкиОСМС
	|ИЗ
	|	(ВЫБРАТЬ
	|		МИНИМУМ(ПриоритетСтавок.Приоритет) КАК Приоритет,
	|		ПриоритетСтавок.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|		ПриоритетСтавок.ВидДохода КАК ВидДохода
	|	ИЗ
	|		ВТ_МаксимумыСтавокПоПериоду КАК ПриоритетСтавок
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПриоритетСтавок.МесяцНалоговогоПериода,
	|		ПриоритетСтавок.ВидДохода) КАК ПриоритетСтавок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиОСМСПоПриоритетам КАК ВТСтавкиПоПриоритетам
	|		ПО ПриоритетСтавок.Приоритет = ВТСтавкиПоПриоритетам.Приоритет
	|			И ПриоритетСтавок.МесяцНалоговогоПериода = ВТСтавкиПоПриоритетам.МесяцНалоговогоПериода
	|			И ПриоритетСтавок.ВидДохода = ВТСтавкиПоПриоритетам.ВидДохода";
		
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТПериодыСтавокОСМС");
	УничтожитьВТ.Добавить("ВТСтавкиОСМСПоПриоритетам");
	УничтожитьВТ.Добавить("ВТ_МаксимумыСтавокПоПериоду");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
КонецПроцедуры


#Область ВычетыИПН

Функция ПолучитьСведенияОЛьготахИВычетахИПН(ФизическоеЛицо,Дата) Экспорт
	
	ДатаКонтроля = '2018-01-01';
	ВозвращаемыйМассив = Новый Массив;
	
	Если Дата >= ДатаКонтроля Тогда
		ТЗ =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ВычетыФизическихЛицИПНСрезПоследних.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТ_Регистратор
		|ИЗ
		|	РегистрСведений.ВычетыФизическихЛицИПН.СрезПоследних(&Дата, ФизическоеЛицо = &ФизическоеЛицо) КАК ВычетыФизическихЛицИПНСрезПоследних
		|ГДЕ
		|	ВычетыФизическихЛицИПНСрезПоследних.Период >= &ДатаОграниченияПолученияДанных
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Регистратор.Регистратор,
		|	ВТ_Регистратор.Регистратор.Дата КАК Дата,
		|	ВТ_Регистратор.Регистратор.Номер КАК Номер,
		|	ВТ_Регистратор.Регистратор.Организация КАК Организация
		|ИЗ
		|	ВТ_Регистратор КАК ВТ_Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВычетыФизическихЛицИПНСрезПоследних.ПредоставлятьВычет,
		|	ВычетыФизическихЛицИПНСрезПоследних.ВидВычета КАК ВидВычетаИПН,
		|	ВычетыФизическихЛицИПНСрезПоследних.Основание КАК ДокументПодтверждающийПравоНаВычет,
		|	ВЫБОР
		|		КОГДА ВычетыФизическихЛицИПНСрезПоследних.ВидВычета.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.ПоПериодическимПлатежам)
		|				И ВычетыФизическихЛицИПНСрезПоследних.ПредоставлятьВычет
		|			ТОГДА ""Подробнее""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Расшифровка,
		|	ВычетыФизическихЛицИПНСрезПоследних.ДействуетПо
		|ИЗ
		|	РегистрСведений.ВычетыФизическихЛицИПН.СрезПоследних(&Дата, ФизическоеЛицо = &ФизическоеЛицо) КАК ВычетыФизическихЛицИПНСрезПоследних
		|ГДЕ
		|	ВычетыФизическихЛицИПНСрезПоследних.Период >= &ДатаОграниченияПолученияДанных
		|	И ВычетыФизическихЛицИПНСрезПоследних.Регистратор В
		|			(ВЫБРАТЬ
		|				Т.Регистратор
		|			ИЗ
		|				ВТ_Регистратор КАК Т)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВычетыФизическихЛицИПНСрезПоследних.ВидВычета,
		|	ВычетыФизическихЛицИПНСрезПоследних.ДействуетПо";
		
		Запрос = Новый Запрос(ТЗ);
		Запрос.УстановитьПараметр("ФизическоеЛицо",                 ФизическоеЛицо);
		Запрос.УстановитьПараметр("Дата",                           Дата);
		Запрос.УстановитьПараметр("ДатаОграниченияПолученияДанных", ДатаКонтроля);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		КлючиСтруктуры = "";
		
		Для Каждого Колонка Из МассивРезультатов[1].Колонки Цикл
			КлючиСтруктуры = КлючиСтруктуры + ?(ПустаяСтрока(КлючиСтруктуры), "", ",") + Колонка.Имя;
		КонецЦикла;
		
		ВыборкаРезультата = МассивРезультатов[1].Выбрать();
		
		Если ВыборкаРезультата.Следующий() Тогда
			
			СтруктураСтрокиВыборкаРезультата = Новый Структура(КлючиСтруктуры);
			ЗаполнитьЗначенияСвойств(СтруктураСтрокиВыборкаРезультата, ВыборкаРезультата);
		Иначе
			СтруктураСтрокиВыборкаРезультата = Неопределено;
		КонецЕсли;
		ВозвращаемыйМассив.Добавить(СтруктураСтрокиВыборкаРезультата);
		
		ВозвращаемыйМассив.Добавить(МассивРезультатов[2].Выгрузить());
		
	Иначе
		ТЗ =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ВычетыФизическихЛицИПН.Регистратор,
		|	ВычетыФизическихЛицИПН.Регистратор.Номер КАК Номер,
		|	ВычетыФизическихЛицИПН.Регистратор.Дата КАК Дата,
		|	ВычетыФизическихЛицИПН.Регистратор.Организация КАК Организация,
		|	ВычетыФизическихЛицИПН.Регистратор.Сотрудник КАК Сотрудник,
		|	ВычетыФизическихЛицИПН.ПредоставлятьВычет
		|ИЗ
		|	РегистрСведений.ВычетыФизическихЛицИПН.СрезПоследних(&Дата, ФизическоеЛицо = &ФизическоеЛицо) КАК ВычетыФизическихЛицИПН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПрочиеВычетыФизическихЛицИПН.Регистратор,
		|	ПрочиеВычетыФизическихЛицИПН.Регистратор.Номер КАК Номер,
		|	ПрочиеВычетыФизическихЛицИПН.Регистратор.Дата КАК Дата,
		|	ПрочиеВычетыФизическихЛицИПН.Регистратор.Организация КАК Организация,
		|	ПрочиеВычетыФизическихЛицИПН.Регистратор.Сотрудник КАК Сотрудник,
		|	ПрочиеВычетыФизическихЛицИПН.ВидВычета КАК ВидВычетаИПН,
		|	ПрочиеВычетыФизическихЛицИПН.Размер,
		|	ПрочиеВычетыФизическихЛицИПН.ДействуетПо,
		|	ПрочиеВычетыФизическихЛицИПН.Основание КАК ДокументПодтверждающийПравоНаВычет
		|ИЗ
		|	РегистрСведений.ПрочиеВычетыФизическихЛицИПН.СрезПоследних(&Дата, ФизическоеЛицо = &ФизическоеЛицо) КАК ПрочиеВычетыФизическихЛицИПН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЛьготыФизическихЛицИПН.Регистратор,
		|	ЛьготыФизическихЛицИПН.Регистратор.Номер КАК Номер,
		|	ЛьготыФизическихЛицИПН.Регистратор.Дата КАК Дата,
		|	ЛьготыФизическихЛицИПН.Регистратор.Организация КАК Организация,
		|	ЛьготыФизическихЛицИПН.Регистратор.Сотрудник КАК Сотрудник,
		|	ЛьготыФизическихЛицИПН.Основание КАК ДокументПодтверждающийПравоНаЛьготу,
		|	ЛьготыФизическихЛицИПН.ПредоставлятьЛьготу,
		|	ЛьготыФизическихЛицИПН.ДействуетДо,
		|	ЛьготыФизическихЛицИПН.КатегорияЛицаПолучателяЛьготы
		|ИЗ
		|	РегистрСведений.ЛьготыФизическихЛицИПН.СрезПоследних(&Дата, ФизическоеЛицо = &ФизическоеЛицо) КАК ЛьготыФизическихЛицИПН";
		
		Запрос = Новый Запрос(ТЗ);
		Запрос.УстановитьПараметр("ФизическоеЛицо",                 ФизическоеЛицо);
		Запрос.УстановитьПараметр("Дата",                           Дата);
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Для ИндексРезультата = 0 По 2 Цикл
			
			КлючиСтруктуры = "";
			
			Для Каждого Колонка Из МассивРезультатов[ИндексРезультата].Колонки Цикл
				КлючиСтруктуры = КлючиСтруктуры + ?(ПустаяСтрока(КлючиСтруктуры), "", ",") + Колонка.Имя;
			КонецЦикла;
			
			МассивСтруктур = Новый Массив;
			
			ВыборкаРезультата = МассивРезультатов[ИндексРезультата].Выбрать();
			
			Пока ВыборкаРезультата.Следующий() Цикл
				
				СтруктураСтрокиВыборкаРезультата = Новый Структура(КлючиСтруктуры);
				ЗаполнитьЗначенияСвойств(СтруктураСтрокиВыборкаРезультата, ВыборкаРезультата);
				
				МассивСтруктур.Добавить(СтруктураСтрокиВыборкаРезультата);
				
			КонецЦикла;
			
			ВозвращаемыйМассив.Добавить(МассивСтруктур);
			
		КонецЦикла;
		
	КонецЕсли;

	Возврат ВозвращаемыйМассив;
	
КонецФункции

#КонецОбласти

Функция ВТСуществует(МенеджерВременныхТаблиц, ИмяВТ)
	
	Возврат ЗарплатаКадры.ВТСуществует(МенеджерВременныхТаблиц, ИмяВТ);
	
КонецФункции

#Область РезервОтпусков

Функция НоваяТаблицаНалогиВзносыОтчисления() Экспорт
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний"));
	МассивТипов.Добавить(Тип("ПланВидовРасчетаСсылка.Начисления"));
	ОтражениеЗарплатыВУчетеВнутренний.ДополнитьМассивТиповНачисления(МассивТипов);
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Таблица.Колонки.Добавить("Сотрудник",  Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Таблица.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"), НСтр("ru = 'Сотрудник'"));
	Таблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	Таблица.Колонки.Добавить("ВидОперации", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийПоЗарплате"));
	Таблица.Колонки.Добавить("Начисление", Новый ОписаниеТипов(МассивТипов));
	Таблица.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	Таблица.Колонки.Добавить("ОблагаетсяЕНВД", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	Таблица.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7, 0)));
	
	Возврат Таблица;
	
КонецФункции

Функция ДанныеДляОтражениеВУчетеВзносовПоТаблице(НалогиВзносыОтчисления) Экспорт
	
	Если НалогиВзносыОтчисления.Количество() = 0 Тогда
		Возврат НоваяТаблицаНалогиВзносыОтчисления();
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("НалогиВзносыОтчисления", НалогиВзносыОтчисления);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НалогиВзносыОтчисления.Организация,
		|	НалогиВзносыОтчисления.ФизическоеЛицо,
		|	НалогиВзносыОтчисления.Сотрудник,
		|	НалогиВзносыОтчисления.Подразделение,
		|	НалогиВзносыОтчисления.Начисление,
		|	НалогиВзносыОтчисления.СО,
		|	НалогиВзносыОтчисления.СН,
		|	НалогиВзносыОтчисления.ОППВ,
		|	НалогиВзносыОтчисления.ООСМС,
		|	ЛОЖЬ КАК ОблагаетсяЕНВД,
		|	НАЧАЛОПЕРИОДА(НалогиВзносыОтчисления.Период, МЕСЯЦ) КАК ДатаНачала
		|ПОМЕСТИТЬ ВТНалогиВзносыОтчисления
		|ИЗ
		|	&НалогиВзносыОтчисления КАК НалогиВзносыОтчисления";
		Запрос.Выполнить();
		
		Возврат ТаблицаВзносовДляОтражениеВУчете(Запрос.МенеджерВременныхТаблиц);
		
	КонецЕсли;
	
КонецФункции

Функция ТаблицаВзносовДляОтражениеВУчете(МенеджерВременныхТаблиц)
	
	ТаблицаВзносов = НоваяТаблицаНалогиВзносыОтчисления();
	
	ВидыОпераций = Новый Массив;
	ВидыОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.СН);
	ВидыОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.СО);
	ВидыОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ОППВ);
	ВидыОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ООСМС);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ВидыОпераций", ВидыОпераций);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НалогиВзносыОтчисления.Организация,
	|	НалогиВзносыОтчисления.ФизическоеЛицо,
	|	НалогиВзносыОтчисления.Сотрудник,
	|	НалогиВзносыОтчисления.Подразделение,
	|	НалогиВзносыОтчисления.Начисление,
	|	НалогиВзносыОтчисления.ОблагаетсяЕНВД,
	|	НалогиВзносыОтчисления.ДатаНачала,
	|	ВидыОперацийПоЗарплате.Ссылка КАК ВидОперации,
	|	СУММА(ВЫБОР
	|			КОГДА ВидыОперацийПоЗарплате.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.СН)
	|				ТОГДА НалогиВзносыОтчисления.СН
	|			КОГДА ВидыОперацийПоЗарплате.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.СО)
	|				ТОГДА НалогиВзносыОтчисления.СО
	|			КОГДА ВидыОперацийПоЗарплате.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОППВ)
	|				ТОГДА НалогиВзносыОтчисления.ОППВ
	|			КОГДА ВидыОперацийПоЗарплате.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ООСМС)
	|				ТОГДА НалогиВзносыОтчисления.ООСМС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма
	|ИЗ
	|	ВТНалогиВзносыОтчисления КАК НалогиВзносыОтчисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Перечисление.ВидыОперацийПоЗарплате КАК ВидыОперацийПоЗарплате
	|		ПО (ВидыОперацийПоЗарплате.Ссылка В (&ВидыОпераций))
	|
	|СГРУППИРОВАТЬ ПО
	|	НалогиВзносыОтчисления.Организация,
	|	НалогиВзносыОтчисления.ФизическоеЛицо,
	|	НалогиВзносыОтчисления.Сотрудник,
	|	НалогиВзносыОтчисления.Подразделение,
	|	НалогиВзносыОтчисления.Начисление,
	|	НалогиВзносыОтчисления.ОблагаетсяЕНВД,
	|	НалогиВзносыОтчисления.ДатаНачала,
	|	ВидыОперацийПоЗарплате.Ссылка
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА ВидыОперацийПоЗарплате.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.СН)
	|				ТОГДА НалогиВзносыОтчисления.СН
	|			КОГДА ВидыОперацийПоЗарплате.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.СО)
	|				ТОГДА НалогиВзносыОтчисления.СО
	|			КОГДА ВидыОперацийПоЗарплате.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОППВ)
	|				ТОГДА НалогиВзносыОтчисления.ОППВ
	|			КОГДА ВидыОперацийПоЗарплате.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ООСМС)
	|				ТОГДА НалогиВзносыОтчисления.ООСМС
	|			ИНАЧЕ 0
	|		КОНЕЦ) <> 0";
	
	Результат = Запрос.Выполнить().Выгрузить();
	ОтражениеЗарплатыВУчете.ДобавитьКолонкуИдентификаторСтроки(Результат);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Результат, ТаблицаВзносов);
	
	Возврат ТаблицаВзносов;
	
КонецФункции

Процедура ДополнитьТаблицуНачисленныеОтпуска(НачисленныеОтпуска) Экспорт
	
	Если ТипЗнч(НачисленныеОтпуска) <> Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	НачисленныеОтпуска.Колонки.Добавить("СН", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	НачисленныеОтпуска.Колонки.Добавить("СО", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	НачисленныеОтпуска.Колонки.Добавить("ОППВ", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	НачисленныеОтпуска.Колонки.Добавить("ООСМС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	
КонецПроцедуры

#КонецОбласти

// Расчет ОПВ

Процедура СоздатьВТИсключаемыеФизическиеЛицаПриРасчетеОПВ(МенеджерВременныхТаблиц, МесяцНачисления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КонецМесяцаРасчета", КонецМесяца(МесяцНачисления));
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОПенсионномОбеспеченииФизическихЛиц.ФизическоеЛицо
		|ПОМЕСТИТЬ ВТИсключаемыеФизическиеЛицаПриРасчетеОПВ
		|ИЗ
		|	РегистрСведений.СведенияОПенсионномОбеспеченииФизическихЛиц.СрезПоследних(
		|			&КонецМесяцаРасчета,
		|			ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					СписокСотрудников.ФизическоеЛицо
		|				ИЗ
		|					ВТФизическиеЛица КАК СписокСотрудников)) КАК СведенияОПенсионномОбеспеченииФизическихЛиц
		|ГДЕ
		|	(СведенияОПенсионномОбеспеченииФизическихЛиц.ПенсионерПоВозрасту
		|			ИЛИ СведенияОПенсионномОбеспеченииФизическихЛиц.ПенсионерПоВыслугеЛет)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОбИнвалидностиФизическихЛицСрезПоследних.ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.СведенияОбИнвалидностиФизическихЛиц.СрезПоследних(
		|			&КонецМесяцаРасчета,
		|			ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					СписокСотрудников.ФизическоеЛицо
		|				ИЗ
		|					ВТФизическиеЛица КАК СписокСотрудников)) КАК СведенияОбИнвалидностиФизическихЛицСрезПоследних
		|ГДЕ
		|	СведенияОбИнвалидностиФизическихЛицСрезПоследних.ОтношениеКИнвалидности = ЗНАЧЕНИЕ(Перечисление.ОтношениеКИнвалидности.Инвалид)
		|	И СведенияОбИнвалидностиФизическихЛицСрезПоследних.ГруппаИнвалидности В (ЗНАЧЕНИЕ(Перечисление.ГруппыИнвалидностиФизическихЛиц.I), ЗНАЧЕНИЕ(Перечисление.ГруппыИнвалидностиФизическихЛиц.II))
		|	И СведенияОбИнвалидностиФизическихЛицСрезПоследних.ДействуетДо = ДАТАВРЕМЯ(1, 1, 1)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтатусФизическихЛицКакНалогоплательщиков.ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.СтатусФизическихЛицКакНалогоплательщиков.СрезПоследних(
		|			&КонецМесяцаРасчета,
		|			ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					СписокСотрудников.ФизическоеЛицо
		|				ИЗ
		|					ВТФизическиеЛица КАК СписокСотрудников)) КАК СтатусФизическихЛицКакНалогоплательщиков
		|ГДЕ
		|	НЕ СтатусФизическихЛицКакНалогоплательщиков.ИмеетПравоНаПенсионноеОбеспечение";
		
	Запрос.Выполнить();

КонецПроцедуры

// Расчет ИПН

Процедура СоздатьВТСтавкиИПН(Организация, МенеджерВременныхТаблиц) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	1 КАК Приоритет,
		|	МАКСИМУМ(ЕСТЬNULL(СведенияОСтавкахИПН.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК ПериодСтавки,
		|	ПериодыРасчета.Период КАК МесяцНалоговогоПериода,
		|	СведенияОСтавкахИПН.Организация КАК Организация,
		|	СведенияОСтавкахИПН.ВидДохода КАК ВидДохода
		|ПОМЕСТИТЬ ВТПериодыСтавокИПН
		|ИЗ
		|	ВТДатыПоМесяцам КАК ПериодыРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахИПН КАК СведенияОСтавкахИПН
		|		ПО ПериодыРасчета.Период >= СведенияОСтавкахИПН.Период
		|ГДЕ
		|	СведенияОСтавкахИПН.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	ПериодыРасчета.Период,
		|	СведенияОСтавкахИПН.Организация,
		|	СведенияОСтавкахИПН.ВидДохода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	МАКСИМУМ(ЕСТЬNULL(СведенияОСтавкахИПН.Период, ДАТАВРЕМЯ(1, 1, 1))),
		|	ПериодыРасчета.Период,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка),
		|	СведенияОСтавкахИПН.ВидДохода
		|ИЗ
		|	ВТДатыПоМесяцам КАК ПериодыРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахИПН КАК СведенияОСтавкахИПН
		|		ПО ПериодыРасчета.Период >= СведенияОСтавкахИПН.Период
		|ГДЕ
		|	СведенияОСтавкахИПН.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПериодыРасчета.Период,
		|	СведенияОСтавкахИПН.ВидДохода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПериодСтавки,
		|	Организация,
		|	ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыСтавокИПН.Приоритет КАК Приоритет,
		|	ПериодыСтавокИПН.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ПериодыСтавокИПН.ПериодСтавки КАК ПериодСтавки,
		|	ПериодыСтавокИПН.ВидДохода КАК ВидДохода,
		|	ЕСТЬNULL(СведенияОСтавкахИПН.Ставка, 0) / 100 КАК СтавкаРезиденты,
		|	ЕСТЬNULL(СведенияОСтавкахИПН.СтавкаНерезиденты, 0) / 100 КАК СтавкаНерезиденты
		|ПОМЕСТИТЬ ВТСтавкиИПНПоПриоритетам
		|ИЗ
		|	ВТПериодыСтавокИПН КАК ПериодыСтавокИПН
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахИПН КАК СведенияОСтавкахИПН
		|		ПО ПериодыСтавокИПН.ПериодСтавки = СведенияОСтавкахИПН.Период
		|			И ПериодыСтавокИПН.Организация = СведенияОСтавкахИПН.Организация
		|			И ПериодыСтавокИПН.ВидДохода = СведенияОСтавкахИПН.ВидДохода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПериодСтавки,
		|	ВидДохода,
		|	МесяцНалоговогоПериода,
		|	Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСтавкиПоПриоритетам.Приоритет КАК Приоритет,
		|	МаксимумСтавок.ПериодСтавки КАК ПериодСтавки,
		|	МаксимумСтавок.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	МаксимумСтавок.ВидДохода КАК ВидДохода
		|ПОМЕСТИТЬ ВТ_МаксимумыСтавокПоПериоду
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ПриоритетСтавок.ПериодСтавки) КАК ПериодСтавки,
		|		ПриоритетСтавок.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		ПриоритетСтавок.ВидДохода КАК ВидДохода
		|	ИЗ
		|		ВТСтавкиИПНПоПриоритетам КАК ПриоритетСтавок
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПриоритетСтавок.МесяцНалоговогоПериода,
		|		ПриоритетСтавок.ВидДохода) КАК МаксимумСтавок
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиИПНПоПриоритетам КАК ВТСтавкиПоПриоритетам
		|		ПО МаксимумСтавок.ПериодСтавки = ВТСтавкиПоПриоритетам.ПериодСтавки
		|			И МаксимумСтавок.МесяцНалоговогоПериода = ВТСтавкиПоПриоритетам.МесяцНалоговогоПериода
		|			И МаксимумСтавок.ВидДохода = ВТСтавкиПоПриоритетам.ВидДохода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	МесяцНалоговогоПериода,
		|	ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриоритетСтавок.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ПриоритетСтавок.ВидДохода КАК ВидДохода,
		|	ВТСтавкиПоПриоритетам.СтавкаРезиденты КАК СтавкаРезиденты,
		|	ВТСтавкиПоПриоритетам.СтавкаНерезиденты КАК СтавкаНерезиденты
		|ПОМЕСТИТЬ ВТСтавкиИПН
		|ИЗ
		|	(ВЫБРАТЬ
		|		МИНИМУМ(ПриоритетСтавок.Приоритет) КАК Приоритет,
		|		ПриоритетСтавок.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		ПриоритетСтавок.ВидДохода КАК ВидДохода
		|	ИЗ
		|		ВТ_МаксимумыСтавокПоПериоду КАК ПриоритетСтавок
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПриоритетСтавок.МесяцНалоговогоПериода,
		|		ПриоритетСтавок.ВидДохода) КАК ПриоритетСтавок
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиИПНПоПриоритетам КАК ВТСтавкиПоПриоритетам
		|		ПО ПриоритетСтавок.Приоритет = ВТСтавкиПоПриоритетам.Приоритет
		|			И ПриоритетСтавок.МесяцНалоговогоПериода = ВТСтавкиПоПриоритетам.МесяцНалоговогоПериода
		|			И ПриоритетСтавок.ВидДохода = ВТСтавкиПоПриоритетам.ВидДохода";
		
	Запрос.Выполнить();
	
	УничтожитьВТ.Добавить("ВТПериодыСтавокИПН");
	УничтожитьВТ.Добавить("ВТСтавкиИПНПоПриоритетам");
	УничтожитьВТ.Добавить("ВТ_МаксимумыСтавокПоПериоду");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);

КонецПроцедуры

Процедура СоздатьВТСтатусыФизическихЛицКакНалогоплательщиков(МенеджерВременныхТаблиц) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(СтатусФизическихЛицКакНалогоплательщиков.Период) КАК ПериодСтатуса,
		|	СтатусФизическихЛицКакНалогоплательщиков.ФизическоеЛицо,
		|	ПериодыРасчета.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТПериодыСтатусов
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ПериодыРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизическихЛицКакНалогоплательщиков КАК СтатусФизическихЛицКакНалогоплательщиков
		|		ПО ПериодыРасчета.МесяцНалоговогоПериода >= СтатусФизическихЛицКакНалогоплательщиков.Период
		|			И ПериодыРасчета.ФизическоеЛицо = СтатусФизическихЛицКакНалогоплательщиков.ФизическоеЛицо
		|
		|СГРУППИРОВАТЬ ПО
		|	СтатусФизическихЛицКакНалогоплательщиков.ФизическоеЛицо,
		|	ПериодыРасчета.МесяцНалоговогоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыСтатусов.МесяцНалоговогоПериода,
		|	ПериодыСтатусов.ФизическоеЛицо,
		|	СтатусФизическихЛицКакНалогоплательщиков.Статус
		|ПОМЕСТИТЬ ВТСтатусыФизическихЛицКакНалогоплательщиков
		|ИЗ
		|	ВТПериодыСтатусов КАК ПериодыСтатусов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизическихЛицКакНалогоплательщиков КАК СтатусФизическихЛицКакНалогоплательщиков
		|		ПО ПериодыСтатусов.ПериодСтатуса = СтатусФизическихЛицКакНалогоплательщиков.Период
		|			И ПериодыСтатусов.ФизическоеЛицо = СтатусФизическихЛицКакНалогоплательщиков.ФизическоеЛицо";
	
	Запрос.Выполнить();
	
	УничтожитьВТ.Добавить("ВТПериодыСтатусов");
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// РАСЧЕТ НАЛОГОВ, ВЗНОСОВ И ОТЧИСЛЕНИЙ
////////////////////////////////////////////////////////////////////////////////

Функция РассчитатьОПВДо2019(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ?(ИсключатьДоходыРегистратора, Регистратор, Неопределено));
	
	// Исключаемые физические лица
	СоздатьВТИсключаемыеФизическиеЛицаПриРасчетеОПВ(МенеджерВременныхТаблиц, МесяцНачисления);
	УничтожитьВТ.Добавить("ВТИсключаемыеФизическиеЛицаПриРасчетеОПВ");
	
	ВидНалогаВзносаОПВ =  Перечисления.ВидыНалоговВзносовОтчислений.ОПВ;
	
	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаОПВ);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);

	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаОПВ, "ВТИсключаемыеФизическиеЛицаПриРасчетеОПВ");
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");   
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленных ОПВ
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаОПВ);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");

	// - Размер органичения доходов, облагаемых ОПВ по периодам
	// - Исчисленные ОПВ
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмерыМЗППоПериодам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	РазмерыМЗППоПериодам.РазмерМЗП * 75 КАК МаксимальныйРазмерОрганиченияДохода
		|ПОМЕСТИТЬ ВТРазмерыОграниченийПоДоходам
		|ИЗ
		|	ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода КАК МаксимальныйРазмерОрганиченияДохода,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход < 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход < РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА ЕСТЬNULL(Доходы.ОблагаемыйДоход, 0)
		|		ИНАЧЕ ЕСТЬNULL(РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода, 0)
		|	КОНЕЦ КАК ОбъектИсчисленияОПВ,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход < 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход < РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА ЕСТЬNULL(Доходы.ОблагаемыйДоход, 0)
		|		ИНАЧЕ ЕСТЬNULL(РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода, 0)
		|	КОНЕЦ * ЕСТЬNULL(СтавкиОПВ.Ставка, 0) КАК ИсчисленныеОПВ
		|ПОМЕСТИТЬ ВТИсчисленныеОПВВЦеломЗаПериод
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавки КАК СтавкиОПВ
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиОПВ.МесяцНалоговогоПериода
		|			И (СтавкиОПВ.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОПВ))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеОПВ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ВТИсчисленныеОПВ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТИсчисленныеОПВ.ВидДохода КАК ВидДохода,
		|	ВТИсчисленныеОПВ.МаксимальныйРазмерОрганиченияДохода КАК МаксимальныйРазмерОрганиченияДохода,
		|	ВТИсчисленныеОПВ.ОбъектИсчисленияОПВ КАК ОбъектИсчисленияОПВ,
		|	ВТИсчисленныеОПВ.ИсчисленныеОПВ КАК ИсчисленныеОПВ
		|ИЗ
		|	ВТИсчисленныеОПВВЦеломЗаПериод КАК ВТИсчисленныеОПВ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	МесяцНалоговогоПериода,
		|	ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеОПВПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныеОПВПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныеОПВПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныеОПВПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныеОПВПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеОПВПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеОПВПоПодразделениям.ОбъектИсчисления КАК ОбъектОПВИсчисленныйРанее,
		|	ИсчисленныеОПВПоПодразделениям.НалогВзнос КАК РанееИсчисленныеОПВ,
		|	-ИсчисленныеОПВПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныеОПВПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныеОПВПоПодразделениям.НалогВзнос КАК ИсчисленныеОПВ,
		|	-ИсчисленныеОПВПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияОПВ
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныеОПВПоПодразделениям
		|ГДЕ
		|	(ИсчисленныеОПВПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеОПВПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеОПВПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныеОПВПоПодразделениям.НалогВзнос <> 0)";
		
	Результат = Запрос.ВыполнитьПакет();
	УничтожитьВТ.Добавить("ВТРазмерыОграниченийПоДоходам");
	УничтожитьВТ.Добавить("ВТИсчисленныеОПВВЦеломЗаПериод");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеОПВПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	
	РезультатЗапроса = Новый ТаблицаЗначений;
	РезультатЗапроса.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	РезультатЗапроса.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	РезультатЗапроса.Колонки.Добавить("ВидДохода", Новый ОписаниеТипов("СправочникСсылка.ВидыДоходов"));
	РезультатЗапроса.Колонки.Добавить("МаксимальныйРазмерОрганиченияДохода", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатЗапроса.Колонки.Добавить("ОбъектИсчисленияОПВ", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатЗапроса.Колонки.Добавить("ИсчисленныеОПВ", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Результат[ВсегоРезультатов - 3].Выгрузить(), РезультатЗапроса);
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныеОПВВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияОПВВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектОПВИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныеОПВ", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияОПВ,ИсчисленныеОПВ");
	КонецЦикла;
	
	Для Каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		СтрокаТЗ.ИсчисленныеОПВ = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныеОПВ, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ИсчисленныеОПВ", РезультатыРасчетов.Скопировать());

	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеОПВПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияОПВВЦеломЗаПериод, 	ИсчисленныеОПВВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектОПВИсчисленныйРанее, 			РанееИсчисленныеОПВ,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход, 					ОбъектИсчисленияОПВ, 				ИсчисленныеОПВ");
								
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	Для Каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
	КонецЦикла; 

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаОПВ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ТаблицаОПВ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ТаблицаОПВ.Подразделение КАК Подразделение,
		|	ТаблицаОПВ.ВидДохода КАК ВидДохода,
		|	ТаблицаОПВ.ОбъектИсчисленияОПВ КАК ОбъектИсчисленияОПВ,
		|	ТаблицаОПВ.ИсчисленныеОПВ КАК ИсчисленныеОПВ
		|ПОМЕСТИТЬ ВТИсчисленныеОПВПоПодразделениям
		|ИЗ
		|	&ИсчисленныеОПВ КАК ТаблицаОПВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеОПВПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеОПВПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеОПВПоПодразделениям.ВидДохода,
		|	СУММА(ВТИсчисленныеОПВПоПодразделениям.ОбъектИсчисленияОПВ) КАК ОбъектИсчисленияОПВ,
		|	СУММА(ВТИсчисленныеОПВПоПодразделениям.ИсчисленныеОПВ) КАК ИсчисленныеОПВ
		|ПОМЕСТИТЬ ВТИсчисленныеОПВ
		|ИЗ
		|	ВТИсчисленныеОПВПоПодразделениям КАК ВТИсчисленныеОПВПоПодразделениям
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТИсчисленныеОПВПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеОПВПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеОПВПоПодразделениям.ВидДохода";
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТИсчисленныеОПВПоПодразделениям");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьОПВПосле2019(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ?(ИсключатьДоходыРегистратора, Регистратор, Неопределено));
	
	// Исключаемые физические лица
	СоздатьВТИсключаемыеФизическиеЛицаПриРасчетеОПВ(МенеджерВременныхТаблиц, МесяцНачисления);
	УничтожитьВТ.Добавить("ВТИсключаемыеФизическиеЛицаПриРасчетеОПВ");
	
	ВидНалогаВзносаОПВ =  Перечисления.ВидыНалоговВзносовОтчислений.ОПВ;
	
	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаОПВ);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);

	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаОПВ, "ВТИсключаемыеФизическиеЛицаПриРасчетеОПВ");
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");   
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленных ОПВ
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаОПВ);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");

	// - Размер органичения доходов, облагаемых ОПВ по периодам
	// - Исчисленные ОПВ
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмерыМЗППоПериодам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	РазмерыМЗППоПериодам.РазмерМЗП КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыМЗППоПериодам.РазмерМЗП * 50 КАК МаксимальныйРазмерОрганиченияДохода
		|ПОМЕСТИТЬ ВТРазмерыОграниченийПоДоходам
		|ИЗ
		|	ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода КАК МаксимальныйРазмерОрганиченияДохода,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход < 0
		|			ТОГДА 0
		|		КОГДА Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
		|			И Доходы.ОблагаемыйДоход < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА ЕСТЬNULL(РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода, Доходы.ОблагаемыйДоход)
		|		КОГДА Доходы.ОблагаемыйДоход < РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА ЕСТЬNULL(Доходы.ОблагаемыйДоход, 0)
		|		ИНАЧЕ ЕСТЬNULL(РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода, 0)
		|	КОНЕЦ КАК ОбъектИсчисленияОПВ,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход < 0
		|			ТОГДА 0
		|		КОГДА Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
		|			И Доходы.ОблагаемыйДоход < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА ЕСТЬNULL(РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода, Доходы.ОблагаемыйДоход)
		|		КОГДА Доходы.ОблагаемыйДоход < РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА ЕСТЬNULL(Доходы.ОблагаемыйДоход, 0)
		|		ИНАЧЕ ЕСТЬNULL(РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода, 0)
		|	КОНЕЦ * ЕСТЬNULL(СтавкиОПВ.Ставка, 0) КАК ИсчисленныеОПВ
		|ПОМЕСТИТЬ ВТИсчисленныеОПВВЦеломЗаПериод
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавки КАК СтавкиОПВ
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиОПВ.МесяцНалоговогоПериода
		|			И (СтавкиОПВ.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОПВ))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеОПВ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ВТИсчисленныеОПВ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТИсчисленныеОПВ.ВидДохода КАК ВидДохода,
		|	ВТИсчисленныеОПВ.МаксимальныйРазмерОрганиченияДохода КАК МаксимальныйРазмерОрганиченияДохода,
		|	ВТИсчисленныеОПВ.ОбъектИсчисленияОПВ КАК ОбъектИсчисленияОПВ,
		|	ВТИсчисленныеОПВ.ИсчисленныеОПВ КАК ИсчисленныеОПВ
		|ИЗ
		|	ВТИсчисленныеОПВВЦеломЗаПериод КАК ВТИсчисленныеОПВ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	МесяцНалоговогоПериода,
		|	ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеОПВПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныеОПВПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныеОПВПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныеОПВПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныеОПВПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеОПВПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеОПВПоПодразделениям.ОбъектИсчисления КАК ОбъектОПВИсчисленныйРанее,
		|	ИсчисленныеОПВПоПодразделениям.НалогВзнос КАК РанееИсчисленныеОПВ,
		|	-ИсчисленныеОПВПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныеОПВПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныеОПВПоПодразделениям.НалогВзнос КАК ИсчисленныеОПВ,
		|	-ИсчисленныеОПВПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияОПВ
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныеОПВПоПодразделениям
		|ГДЕ
		|	(ИсчисленныеОПВПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеОПВПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеОПВПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныеОПВПоПодразделениям.НалогВзнос <> 0)";
		
	Результат = Запрос.ВыполнитьПакет();
	УничтожитьВТ.Добавить("ВТРазмерыОграниченийПоДоходам");
	УничтожитьВТ.Добавить("ВТИсчисленныеОПВВЦеломЗаПериод");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеОПВПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	
	РезультатЗапроса = Новый ТаблицаЗначений;
	РезультатЗапроса.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	РезультатЗапроса.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	РезультатЗапроса.Колонки.Добавить("ВидДохода", Новый ОписаниеТипов("СправочникСсылка.ВидыДоходов"));
	РезультатЗапроса.Колонки.Добавить("МаксимальныйРазмерОрганиченияДохода", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатЗапроса.Колонки.Добавить("ОбъектИсчисленияОПВ", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатЗапроса.Колонки.Добавить("ИсчисленныеОПВ", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Результат[ВсегоРезультатов - 3].Выгрузить(), РезультатЗапроса);
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныеОПВВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияОПВВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектОПВИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныеОПВ", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияОПВ,ИсчисленныеОПВ");
	КонецЦикла;
	
	Для Каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		СтрокаТЗ.ИсчисленныеОПВ = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныеОПВ, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ИсчисленныеОПВ", РезультатыРасчетов.Скопировать());

	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеОПВПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияОПВВЦеломЗаПериод, 	ИсчисленныеОПВВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектОПВИсчисленныйРанее, 			РанееИсчисленныеОПВ,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход, 					ОбъектИсчисленияОПВ, 				ИсчисленныеОПВ");
								
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	Для Каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
	КонецЦикла; 

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаОПВ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ТаблицаОПВ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ТаблицаОПВ.Подразделение КАК Подразделение,
		|	ТаблицаОПВ.ВидДохода КАК ВидДохода,
		|	ТаблицаОПВ.ОбъектИсчисленияОПВ КАК ОбъектИсчисленияОПВ,
		|	ТаблицаОПВ.ИсчисленныеОПВ КАК ИсчисленныеОПВ
		|ПОМЕСТИТЬ ВТИсчисленныеОПВПоПодразделениям
		|ИЗ
		|	&ИсчисленныеОПВ КАК ТаблицаОПВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеОПВПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеОПВПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеОПВПоПодразделениям.ВидДохода,
		|	СУММА(ВТИсчисленныеОПВПоПодразделениям.ОбъектИсчисленияОПВ) КАК ОбъектИсчисленияОПВ,
		|	СУММА(ВТИсчисленныеОПВПоПодразделениям.ИсчисленныеОПВ) КАК ИсчисленныеОПВ
		|ПОМЕСТИТЬ ВТИсчисленныеОПВ
		|ИЗ
		|	ВТИсчисленныеОПВПоПодразделениям КАК ВТИсчисленныеОПВПоПодразделениям
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТИсчисленныеОПВПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеОПВПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеОПВПоПодразделениям.ВидДохода";
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТИсчисленныеОПВПоПодразделениям");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьОПВПосле2020(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ?(ИсключатьДоходыРегистратора, Регистратор, Неопределено));
	
	// Исключаемые физические лица
	СоздатьВТИсключаемыеФизическиеЛицаПриРасчетеОПВ(МенеджерВременныхТаблиц, МесяцНачисления);
	УничтожитьВТ.Добавить("ВТИсключаемыеФизическиеЛицаПриРасчетеОПВ");
	
	ВидНалогаВзносаОПВ =  Перечисления.ВидыНалоговВзносовОтчислений.ОПВ;
	
	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаОПВ);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);

	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаОПВ, "ВТИсключаемыеФизическиеЛицаПриРасчетеОПВ");
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");   
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленных ОПВ
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаОПВ);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");

	// - Размер органичения доходов, облагаемых ОПВ по периодам
	// - Исчисленные ОПВ
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмерыМЗППоПериодам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	РазмерыМЗППоПериодам.РазмерМЗП * 50 КАК МаксимальныйРазмерОрганиченияДохода
		|ПОМЕСТИТЬ ВТРазмерыОграниченийПоДоходам
		|ИЗ
		|	ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	ЕСТЬNULL(СтавкиОПВ.Ставка, 0) КАК Ставка,
		|	МАКСИМУМ(ЕСТЬNULL(РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода, 0)) КАК МаксимальныйРазмерОрганиченияДохода,
		|	МАКСИМУМ(Доходы.ОблагаемыйДоход) КАК ОблагаемыйДоход,
		|	МАКСИМУМ(ВЫБОР КОГДА ДругиеВидыДоходов.ВидДохода ЕСТЬ NULL ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ) КАК ЕстьНесколькоВидовДоходов,
		|	0 КАК ОбъектИсчисленияОПВ,
		|	0 КАК ИсчисленныеОПВ
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходы КАК ДругиеВидыДоходов
		|		ПО ДругиеВидыДоходов.МесяцНалоговогоПериода = Доходы.МесяцНалоговогоПериода
		|			И ДругиеВидыДоходов.ФизическоеЛицо = Доходы.ФизическоеЛицо
		|			И НЕ ДругиеВидыДоходов.ВидДохода = Доходы.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавки КАК СтавкиОПВ
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиОПВ.МесяцНалоговогоПериода
		|			И (СтавкиОПВ.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОПВ))
		|			И Доходы.ВидДохода = СтавкиОПВ.ВидДохода
		|	
		|СГРУППИРОВАТЬ ПО
		|	Доходы.МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо,
		|	Доходы.ВидДохода,
		|	ЕСТЬNULL(СтавкиОПВ.Ставка, 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Доходы.ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеОПВПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныеОПВПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныеОПВПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныеОПВПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныеОПВПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеОПВПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеОПВПоПодразделениям.ОбъектИсчисления КАК ОбъектОПВИсчисленныйРанее,
		|	ИсчисленныеОПВПоПодразделениям.НалогВзнос КАК РанееИсчисленныеОПВ,
		|	-ИсчисленныеОПВПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныеОПВПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныеОПВПоПодразделениям.НалогВзнос КАК ИсчисленныеОПВ,
		|	-ИсчисленныеОПВПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияОПВ
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныеОПВПоПодразделениям
		|ГДЕ
		|	(ИсчисленныеОПВПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеОПВПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеОПВПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныеОПВПоПодразделениям.НалогВзнос <> 0)";
		
	Результат = Запрос.ВыполнитьПакет();
	УничтожитьВТ.Добавить("ВТРазмерыОграниченийПоДоходам");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеОПВПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	
	РезультатЗапроса = Новый ТаблицаЗначений;
	РезультатЗапроса.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	РезультатЗапроса.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	РезультатЗапроса.Колонки.Добавить("ВидДохода", Новый ОписаниеТипов("СправочникСсылка.ВидыДоходов"));
	РезультатЗапроса.Колонки.Добавить("МаксимальныйРазмерОрганиченияДохода", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатЗапроса.Колонки.Добавить("ОбъектИсчисленияОПВ", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатЗапроса.Колонки.Добавить("ИсчисленныеОПВ", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ТаблицаДляОбработки = Результат[ВсегоРезультатов - 3].Выгрузить();
	
	ТаблицаВзносовПоФизЛицамПоДругимДоходам = Новый ТаблицаЗначений;
	ТаблицаВзносовПоФизЛицамПоДругимДоходам.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаВзносовПоФизЛицамПоДругимДоходам.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаВзносовПоФизЛицамПоДругимДоходам.Колонки.Добавить("ОбъектИсчисления", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ТаблицаВзносовПоФизЛицамПоДругимДоходам.Индексы.Добавить("ФизическоеЛицо, МесяцНалоговогоПериода");
	
	СтруктураПоискаПоФизЛицам = Новый Структура("ФизическоеЛицо, МесяцНалоговогоПериода");

	Для Каждого СтрокаТаблицы Из ТаблицаДляОбработки Цикл
		
		ОбъектИсчисленияПоДругимВидамВДанномРасчете = 0;
		
		// корректируем максимальный доход только в окончательном расчете, если есть несколько видов дохода в месяце начисления
		НеобходимаКорректировкаМакисмальногоОграничения = ОкончательныйРасчет И СтрокаТаблицы.ЕстьНесколькоВидовДоходов;
		
		Если НеобходимаКорректировкаМакисмальногоОграничения Тогда
			
			ЗаполнитьЗначенияСвойств(СтруктураПоискаПоФизЛицам, СтрокаТаблицы);

			// сумма взносов исчисленная
			МассивВзносов = ТаблицаВзносовПоФизЛицамПоДругимДоходам.НайтиСтроки(СтруктураПоискаПоФизЛицам);
			
			Если МассивВзносов.Количество() > 0 Тогда
				ОбъектИсчисленияПоДругимВидамВДанномРасчете = МассивВзносов[0].ОбъектИсчисления;
			Иначе
				ОбъектИсчисленияПоДругимВидамВДанномРасчете = 0;
			КонецЕсли;
			
		Иначе
			
			ОбъектИсчисленияПоДругимВидамВДанномРасчете = 0;
			
		КонецЕсли;
		
		МаксимальныйРазмерОрганиченияДохода = СтрокаТаблицы.МаксимальныйРазмерОрганиченияДохода - ОбъектИсчисленияПоДругимВидамВДанномРасчете;
	
		Если СтрокаТаблицы.ОблагаемыйДоход < 0 Тогда
			
			СтрокаТаблицы.ОбъектИсчисленияОПВ = 0;
			
		ИначеЕсли СтрокаТаблицы.ОблагаемыйДоход < МаксимальныйРазмерОрганиченияДохода Тогда
			
			СтрокаТаблицы.ОбъектИсчисленияОПВ = СтрокаТаблицы.ОблагаемыйДоход;
			
		Иначе
			
			СтрокаТаблицы.ОбъектИсчисленияОПВ = МаксимальныйРазмерОрганиченияДохода;
			
		КонецЕсли;
		
		СтрокаТаблицы.ИсчисленныеОПВ = СтрокаТаблицы.ОбъектИсчисленияОПВ * СтрокаТаблицы.Ставка;
		
		Если НеобходимаКорректировкаМакисмальногоОграничения Тогда
			
			МассивВзносов = ТаблицаВзносовПоФизЛицамПоДругимДоходам.НайтиСтроки(СтруктураПоискаПоФизЛицам);
			Если МассивВзносов.Количество() > 0 Тогда
				СтрокаВзносовТаблицаВзносовПоФизЛицам = МассивВзносов[0];
				СтрокаВзносовТаблицаВзносовПоФизЛицам.ОбъектИсчисления = СтрокаВзносовТаблицаВзносовПоФизЛицам.ОбъектИсчисления + СтрокаТаблицы.ОбъектИсчисленияОПВ;
			Иначе
				СтрокаВзносовТаблицаВзносовПоФизЛицам = ТаблицаВзносовПоФизЛицамПоДругимДоходам.Добавить();
				СтрокаВзносовТаблицаВзносовПоФизЛицам.МесяцНалоговогоПериода = СтрокаТаблицы.МесяцНалоговогоПериода;
				СтрокаВзносовТаблицаВзносовПоФизЛицам.ФизическоеЛицо = СтрокаТаблицы.ФизическоеЛицо;
				СтрокаВзносовТаблицаВзносовПоФизЛицам.ОбъектИсчисления = СтрокаТаблицы.ОбъектИсчисленияОПВ;
			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаДляОбработки, РезультатЗапроса);
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныеОПВВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияОПВВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектОПВИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныеОПВ", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	// для корректного округления после распределения при достижении суммы максимального предела необходима точность 0
	ТочностьОкругления = ОписаниеСпособаОкругления.Точность - Цел(ОписаниеСпособаОкругления.Точность);
	
	Если ТочностьОкругления = 0 Тогда
		ТочностьРаспределения = 0;
	ИначеЕсли ТочностьОкругления <= 0.1 Тогда
		ТочностьРаспределения = 2;
	Иначе
		ТочностьРаспределения = 1;
	КонецЕсли;
			
	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияОПВ,ИсчисленныеОПВ", ТочностьРаспределения);
	КонецЦикла;
	
	// для вычетов ИПН передаем общую таблицу округленных сумм
	ТаблицаДляВычетовИПН = РезультатыРасчетов.Скопировать();
	
	Для каждого СтрокаТЗ Из ТаблицаДляВычетовИПН Цикл
		СтрокаТЗ.ИсчисленныеОПВ = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныеОПВ, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("ИсчисленныеОПВ", ТаблицаДляВычетовИПН);

	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеОПВПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияОПВВЦеломЗаПериод, 	ИсчисленныеОПВВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектОПВИсчисленныйРанее, 			РанееИсчисленныеОПВ,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход, 					ОбъектИсчисленияОПВ, 				ИсчисленныеОПВ");
								
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	
	Для Каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
		
		// спишем возникшую погрешность округления при межрасчете или исправлении или перераспределении сумм по подразделениям
		Если СтрокаТЗ.ОблагаемыйДоход = 0 
			И НЕ ОписаниеСпособаОкругления.ПравилоОкругления = Перечисления.ПравилаОкругленияПриРасчетеЗарплаты.Авто
			И (СтрокаТЗ.ИсчисленныеОПВ < 1 И СтрокаТЗ.ИсчисленныеОПВ > 0
				ИЛИ СтрокаТЗ.ИсчисленныеОПВ > -1 И СтрокаТЗ.ИсчисленныеОПВ < 0) Тогда
				
			СтрокаТЗ.ИсчисленныеОПВ = 0;
			
		// исчисление взносов производятся в тенге с учетом округления тиын
		Иначе
			
			СтрокаТЗ.ИсчисленныеОПВ = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныеОПВ, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
			
		КонецЕсли;
		
	КонецЦикла; 

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаОПВ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ТаблицаОПВ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ТаблицаОПВ.Подразделение КАК Подразделение,
		|	ТаблицаОПВ.ВидДохода КАК ВидДохода,
		|	ТаблицаОПВ.ОбъектИсчисленияОПВ КАК ОбъектИсчисленияОПВ,
		|	ТаблицаОПВ.ИсчисленныеОПВ КАК ИсчисленныеОПВ
		|ПОМЕСТИТЬ ВТИсчисленныеОПВПоПодразделениям
		|ИЗ
		|	&ИсчисленныеОПВ КАК ТаблицаОПВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеОПВПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеОПВПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеОПВПоПодразделениям.ВидДохода,
		|	СУММА(ВТИсчисленныеОПВПоПодразделениям.ОбъектИсчисленияОПВ) КАК ОбъектИсчисленияОПВ,
		|	СУММА(ВТИсчисленныеОПВПоПодразделениям.ИсчисленныеОПВ) КАК ИсчисленныеОПВ
		|ПОМЕСТИТЬ ВТИсчисленныеОПВ
		|ИЗ
		|	ВТИсчисленныеОПВПоПодразделениям КАК ВТИсчисленныеОПВПоПодразделениям
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТИсчисленныеОПВПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеОПВПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеОПВПоПодразделениям.ВидДохода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВТИсчисленныеОПВПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеОПВПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеОПВПоПодразделениям.ВидДохода";
	
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТИсчисленныеОПВПоПодразделениям");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьОПВПосле2021(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ?(ИсключатьДоходыРегистратора, Регистратор, Неопределено));
	
	// Исключаемые физические лица
	СоздатьВТИсключаемыеФизическиеЛицаПриРасчетеОПВ(МенеджерВременныхТаблиц, МесяцНачисления);
	УничтожитьВТ.Добавить("ВТИсключаемыеФизическиеЛицаПриРасчетеОПВ");
	
	ВидНалогаВзносаОПВ =  Перечисления.ВидыНалоговВзносовОтчислений.ОПВ;
	
	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаОПВ);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);

	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаОПВ, "ВТИсключаемыеФизическиеЛицаПриРасчетеОПВ");
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");   
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленных ОПВ
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаОПВ);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");

	// - Размер органичения доходов, облагаемых ОПВ по периодам
	// - Исчисленные ОПВ
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмерыМЗППоПериодам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	РазмерыМЗППоПериодам.РазмерМЗП КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыМЗППоПериодам.РазмерМЗП * 50 КАК МаксимальныйРазмерОрганиченияДохода
		|ПОМЕСТИТЬ ВТРазмерыОграниченийПоДоходам
		|ИЗ
		|	ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	ЕСТЬNULL(СтавкиОПВ.Ставка, 0) КАК Ставка,
		|	ВЫБОР
		|		КОГДА Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства)
		|			ТОГДА МАКСИМУМ(ЕСТЬNULL(РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода, 0))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК МинимальныйРазмерОрганиченияДохода,
		|	МАКСИМУМ(ЕСТЬNULL(РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода, 0)) КАК МаксимальныйРазмерОрганиченияДохода,
		|	МАКСИМУМ(Доходы.ОблагаемыйДоход) КАК ОблагаемыйДоход,
		|	МАКСИМУМ(ВЫБОР КОГДА ДругиеВидыДоходов.ВидДохода ЕСТЬ NULL ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ) КАК ЕстьНесколькоВидовДоходов,
		|	0 КАК ОбъектИсчисленияОПВ,
		|	0 КАК ИсчисленныеОПВ
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходы КАК ДругиеВидыДоходов
		|		ПО ДругиеВидыДоходов.МесяцНалоговогоПериода = Доходы.МесяцНалоговогоПериода
		|			И ДругиеВидыДоходов.ФизическоеЛицо = Доходы.ФизическоеЛицо
		|			И НЕ ДругиеВидыДоходов.ВидДохода = Доходы.ВидДохода
		|			И НЕ ДругиеВидыДоходов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавки КАК СтавкиОПВ
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиОПВ.МесяцНалоговогоПериода
		|			И (СтавкиОПВ.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОПВ))
		|			И Доходы.ВидДохода = СтавкиОПВ.ВидДохода
		|	
		|СГРУППИРОВАТЬ ПО
		|	Доходы.МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо,
		|	Доходы.ВидДохода,
		|	ЕСТЬNULL(СтавкиОПВ.Ставка, 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Доходы.ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеОПВПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныеОПВПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныеОПВПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныеОПВПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныеОПВПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеОПВПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеОПВПоПодразделениям.ОбъектИсчисления КАК ОбъектОПВИсчисленныйРанее,
		|	ИсчисленныеОПВПоПодразделениям.НалогВзнос КАК РанееИсчисленныеОПВ,
		|	-ИсчисленныеОПВПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныеОПВПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныеОПВПоПодразделениям.НалогВзнос КАК ИсчисленныеОПВ,
		|	-ИсчисленныеОПВПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияОПВ
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныеОПВПоПодразделениям
		|ГДЕ
		|	(ИсчисленныеОПВПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеОПВПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеОПВПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныеОПВПоПодразделениям.НалогВзнос <> 0)
		|	И НЕ ИсчисленныеОПВПоПодразделениям.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства)";
		
	Результат = Запрос.ВыполнитьПакет();
	УничтожитьВТ.Добавить("ВТРазмерыОграниченийПоДоходам");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеОПВПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	
	РезультатЗапроса = Новый ТаблицаЗначений;
	РезультатЗапроса.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	РезультатЗапроса.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	РезультатЗапроса.Колонки.Добавить("ВидДохода", Новый ОписаниеТипов("СправочникСсылка.ВидыДоходов"));
	РезультатЗапроса.Колонки.Добавить("МаксимальныйРазмерОрганиченияДохода", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатЗапроса.Колонки.Добавить("ОбъектИсчисленияОПВ", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатЗапроса.Колонки.Добавить("ИсчисленныеОПВ", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ТаблицаДляОбработки = Результат[ВсегоРезультатов - 3].Выгрузить();
	
	ТаблицаВзносовПоФизЛицамПоДругимДоходам = Новый ТаблицаЗначений;
	ТаблицаВзносовПоФизЛицамПоДругимДоходам.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаВзносовПоФизЛицамПоДругимДоходам.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаВзносовПоФизЛицамПоДругимДоходам.Колонки.Добавить("ОбъектИсчисления", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ТаблицаВзносовПоФизЛицамПоДругимДоходам.Индексы.Добавить("ФизическоеЛицо, МесяцНалоговогоПериода");
	
	СтруктураПоискаПоФизЛицам = Новый Структура("ФизическоеЛицо, МесяцНалоговогоПериода");

	Для Каждого СтрокаТаблицы Из ТаблицаДляОбработки Цикл
		
		ОбъектИсчисленияПоДругимВидамВДанномРасчете = 0;
		
		// корректируем максимальный доход только в окончательном расчете, если есть несколько видов дохода в месяце начисления
		НеобходимаКорректировкаМакисмальногоОграничения = ОкончательныйРасчет И СтрокаТаблицы.ЕстьНесколькоВидовДоходов;
		
		Если НеобходимаКорректировкаМакисмальногоОграничения Тогда
			
			ЗаполнитьЗначенияСвойств(СтруктураПоискаПоФизЛицам, СтрокаТаблицы);

			// сумма взносов исчисленная
			МассивВзносов = ТаблицаВзносовПоФизЛицамПоДругимДоходам.НайтиСтроки(СтруктураПоискаПоФизЛицам);
			
			Если МассивВзносов.Количество() > 0 Тогда
				ОбъектИсчисленияПоДругимВидамВДанномРасчете = МассивВзносов[0].ОбъектИсчисления;
			Иначе
				ОбъектИсчисленияПоДругимВидамВДанномРасчете = 0;
			КонецЕсли;
			
		Иначе
			
			ОбъектИсчисленияПоДругимВидамВДанномРасчете = 0;
			
		КонецЕсли;
		
		МаксимальныйРазмерОрганиченияДохода = СтрокаТаблицы.МаксимальныйРазмерОрганиченияДохода - ОбъектИсчисленияПоДругимВидамВДанномРасчете;
		МинимальныйРазмерОрганиченияДохода = СтрокаТаблицы.МинимальныйРазмерОрганиченияДохода;
	
		Если СтрокаТаблицы.ОблагаемыйДоход < 0 Тогда
			
			СтрокаТаблицы.ОбъектИсчисленияОПВ = 0;
			
		ИначеЕсли СтрокаТаблицы.ОблагаемыйДоход < МинимальныйРазмерОрганиченияДохода Тогда
			
			СтрокаТаблицы.ОбъектИсчисленияОПВ = МинимальныйРазмерОрганиченияДохода;
			
		ИначеЕсли СтрокаТаблицы.ОблагаемыйДоход < МаксимальныйРазмерОрганиченияДохода Тогда
			
			СтрокаТаблицы.ОбъектИсчисленияОПВ = СтрокаТаблицы.ОблагаемыйДоход;
			
		Иначе
			
			СтрокаТаблицы.ОбъектИсчисленияОПВ = МаксимальныйРазмерОрганиченияДохода;
			
		КонецЕсли;
		
		СтрокаТаблицы.ИсчисленныеОПВ = СтрокаТаблицы.ОбъектИсчисленияОПВ * СтрокаТаблицы.Ставка;
		
		Если НеобходимаКорректировкаМакисмальногоОграничения Тогда
			
			МассивВзносов = ТаблицаВзносовПоФизЛицамПоДругимДоходам.НайтиСтроки(СтруктураПоискаПоФизЛицам);
			Если МассивВзносов.Количество() > 0 Тогда
				СтрокаВзносовТаблицаВзносовПоФизЛицам = МассивВзносов[0];
				СтрокаВзносовТаблицаВзносовПоФизЛицам.ОбъектИсчисления = СтрокаВзносовТаблицаВзносовПоФизЛицам.ОбъектИсчисления + СтрокаТаблицы.ОбъектИсчисленияОПВ;
			Иначе
				СтрокаВзносовТаблицаВзносовПоФизЛицам = ТаблицаВзносовПоФизЛицамПоДругимДоходам.Добавить();
				СтрокаВзносовТаблицаВзносовПоФизЛицам.МесяцНалоговогоПериода = СтрокаТаблицы.МесяцНалоговогоПериода;
				СтрокаВзносовТаблицаВзносовПоФизЛицам.ФизическоеЛицо = СтрокаТаблицы.ФизическоеЛицо;
				СтрокаВзносовТаблицаВзносовПоФизЛицам.ОбъектИсчисления = СтрокаТаблицы.ОбъектИсчисленияОПВ;
			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаДляОбработки, РезультатЗапроса);
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныеОПВВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияОПВВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектОПВИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныеОПВ", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	// для корректного округления после распределения при достижении суммы максимального предела необходима точность 0
	ТочностьОкругления = ОписаниеСпособаОкругления.Точность - Цел(ОписаниеСпособаОкругления.Точность);
	
	Если ТочностьОкругления = 0 Тогда
		ТочностьРаспределения = 0;
	ИначеЕсли ТочностьОкругления <= 0.1 Тогда
		ТочностьРаспределения = 2;
	Иначе
		ТочностьРаспределения = 1;
	КонецЕсли;
			
	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияОПВ,ИсчисленныеОПВ", ТочностьРаспределения);
	КонецЦикла;
	
	// для вычетов ИПН передаем общую таблицу округленных сумм
	ТаблицаДляВычетовИПН = РезультатыРасчетов.Скопировать();
	
	Для каждого СтрокаТЗ Из ТаблицаДляВычетовИПН Цикл
		СтрокаТЗ.ИсчисленныеОПВ = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныеОПВ, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("ИсчисленныеОПВ", ТаблицаДляВычетовИПН);

	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеОПВПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияОПВВЦеломЗаПериод, 	ИсчисленныеОПВВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектОПВИсчисленныйРанее, 			РанееИсчисленныеОПВ,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход, 					ОбъектИсчисленияОПВ, 				ИсчисленныеОПВ");
								
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	
	Для Каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
		
		// спишем возникшую погрешность округления при межрасчете или исправлении или перераспределении сумм по подразделениям
		Если СтрокаТЗ.ОблагаемыйДоход = 0 
			И НЕ ОписаниеСпособаОкругления.ПравилоОкругления = Перечисления.ПравилаОкругленияПриРасчетеЗарплаты.Авто
			И (СтрокаТЗ.ИсчисленныеОПВ < 1 И СтрокаТЗ.ИсчисленныеОПВ > 0
				ИЛИ СтрокаТЗ.ИсчисленныеОПВ > -1 И СтрокаТЗ.ИсчисленныеОПВ < 0) Тогда
				
			СтрокаТЗ.ИсчисленныеОПВ = 0;
			
		// исчисление взносов производятся в тенге с учетом округления тиын
		Иначе
			
			СтрокаТЗ.ИсчисленныеОПВ = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныеОПВ, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
			
		КонецЕсли;
		
	КонецЦикла; 

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаОПВ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ТаблицаОПВ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ТаблицаОПВ.Подразделение КАК Подразделение,
		|	ТаблицаОПВ.ВидДохода КАК ВидДохода,
		|	ТаблицаОПВ.ОбъектИсчисленияОПВ КАК ОбъектИсчисленияОПВ,
		|	ТаблицаОПВ.ИсчисленныеОПВ КАК ИсчисленныеОПВ
		|ПОМЕСТИТЬ ВТИсчисленныеОПВПоПодразделениям
		|ИЗ
		|	&ИсчисленныеОПВ КАК ТаблицаОПВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеОПВПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеОПВПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеОПВПоПодразделениям.ВидДохода,
		|	СУММА(ВТИсчисленныеОПВПоПодразделениям.ОбъектИсчисленияОПВ) КАК ОбъектИсчисленияОПВ,
		|	СУММА(ВТИсчисленныеОПВПоПодразделениям.ИсчисленныеОПВ) КАК ИсчисленныеОПВ
		|ПОМЕСТИТЬ ВТИсчисленныеОПВ
		|ИЗ
		|	ВТИсчисленныеОПВПоПодразделениям КАК ВТИсчисленныеОПВПоПодразделениям
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТИсчисленныеОПВПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеОПВПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеОПВПоПодразделениям.ВидДохода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВТИсчисленныеОПВПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеОПВПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеОПВПоПодразделениям.ВидДохода";
	
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТИсчисленныеОПВПоПодразделениям");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьИПН(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт

	Если МесяцНачисления >= Дата(2021,1,1) Тогда
		РезультатыРасчетов = РассчитатьИПНПосле2021(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет, ИсключатьДоходыРегистратора);
	ИначеЕсли МесяцНачисления >= Дата(2020,1,1) Тогда
		РезультатыРасчетов = РассчитатьИПНПосле2020(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет, ИсключатьДоходыРегистратора);
	ИначеЕсли МесяцНачисления >= Дата(2019,1,1) Тогда
		РезультатыРасчетов = РассчитатьИПНПосле2019(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет, ИсключатьДоходыРегистратора);
	ИначеЕсли МесяцНачисления >= Дата(2018,1,1) Тогда
		РезультатыРасчетов = РассчитатьИПНПосле2018(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет, ИсключатьДоходыРегистратора);
	Иначе
		РезультатыРасчетов = РассчитатьИПНДо2018(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет, ИсключатьДоходыРегистратора);
	КонецЕсли;
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьИПНДо2018(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	ВидНалогаВзносаИПН =  Перечисления.ВидыНалоговВзносовОтчислений.ИПН;
	ПрименятьКорректировкуПрочихНалоговВзносовОтчислений = ЗарплатаКадрыРКПовтИсп.ПрименятьКорректировкуПрочихНалоговВзносовОтчислений(ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(Организация), МесяцНачисления);
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаИПН);
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");   
	
	// Таблица ВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленного ИПН
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаИПН);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");   

	// Таблица ВТЛьготыФизическихЛиц
	СоздатьВТЛьготыФизическихЛиц(МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТЛьготыФизическихЛиц");   
	
	// Таблица ВТПредоставлениеВычетовФизическимЛицам ВТПрименениеВычетов
	СоздатьВТПредоставлениеВычетовФизическимЛицам(МенеджерВременныхТаблиц, Организация);
	УничтожитьВТ.Добавить("ВТПредоставлениеВычетовФизическимЛицам");   
	УничтожитьВТ.Добавить("ВТПрименениеВычетов");   
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.ВидДохода,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.ОблагаемыйДоход) КАК ОблагаемыйДоход,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.НеоблагаемыйДоход) КАК НеоблагаемыйДоход,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.НалогВзнос) КАК НалогВзнос,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.ОбъектИсчисления) КАК ОбъектИсчисления,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.ПримененныйВычет) КАК ПримененныйВычет,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.РазрешенныйВычет) КАК РазрешенныйВычет,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.ПримененнаяЛьгота) КАК ПримененнаяЛьгота,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.ПрочиеВычеты) КАК ПрочиеВычеты,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.ПримененныйВычетСНачалаГода) КАК ПримененныйВычетСНачалаГода,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.РазрешенныйВычетСНачалаГода) КАК РазрешенныйВычетСНачалаГода,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.ПримененнаяЛьготаСНачалаГода) КАК ПримененнаяЛьготаСНачалаГода
		|ПОМЕСТИТЬ ВТИсчисленныеНалогиВзносы
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ВТИсчисленныеНалогиВзносыПоПодразделениям
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.ВидДохода";
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносы");   
	
	// Статусы физических лиц как налогоплательщиков по периодам
	СоздатьВТСтатусыФизическихЛицКакНалогоплательщиков(МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТСтатусыФизическихЛицКакНалогоплательщиков");
	
	// Ставки ИПН
	СоздатьВТСтавкиИПН(Организация, МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТСтавкиИПН");   

	// Прочие вычеты физических лиц
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Периоды.МесяцНалоговогоПериода,
		|	МАКСИМУМ(ПрочиеВычетыФизическихЛицИПН.Период) КАК Период,
		|	ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо,
		|	ПрочиеВычетыФизическихЛицИПН.ВидВычета
		|ПОМЕСТИТЬ ВТПериодыПрочихВычетов
		|ИЗ
		|	ВТПериодыПоФизлицам КАК Периоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрочиеВычетыФизическихЛицИПН КАК ПрочиеВычетыФизическихЛицИПН
		|		ПО Периоды.МесяцНалоговогоПериода >= ПрочиеВычетыФизическихЛицИПН.Период
		|			И Периоды.ФизическоеЛицо = ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо
		|
		|СГРУППИРОВАТЬ ПО
		|	Периоды.МесяцНалоговогоПериода,
		|	ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо,
		|	ПрочиеВычетыФизическихЛицИПН.ВидВычета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыПрочихВычетов.МесяцНалоговогоПериода,
		|	ПериодыПрочихВычетов.ФизическоеЛицо,
		|	СУММА(ПрочиеВычетыФизическихЛицИПН.Размер) КАК Размер
		|ПОМЕСТИТЬ ВТПрочиеВычетыФизическихЛиц
		|ИЗ
		|	ВТПериодыПрочихВычетов КАК ПериодыПрочихВычетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрочиеВычетыФизическихЛицИПН КАК ПрочиеВычетыФизическихЛицИПН
		|		ПО ПериодыПрочихВычетов.Период = ПрочиеВычетыФизическихЛицИПН.Период
		|			И ПериодыПрочихВычетов.ФизическоеЛицо = ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо
		|			И ПериодыПрочихВычетов.ВидВычета = ПрочиеВычетыФизическихЛицИПН.ВидВычета
		|			И ПрочиеВычетыФизическихЛицИПН.Активность
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПрименениеВычетов КАК ПрименениеВычетов
		|		ПО ПериодыПрочихВычетов.МесяцНалоговогоПериода = ПрименениеВычетов.МесяцНалоговогоПериода
		|			И ПериодыПрочихВычетов.ФизическоеЛицо = ПрименениеВычетов.ФизическоеЛицо
		|ГДЕ
		|	ПрочиеВычетыФизическихЛицИПН.ДействуетПо >= ПериодыПрочихВычетов.МесяцНалоговогоПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ПериодыПрочихВычетов.МесяцНалоговогоПериода,
		|	ПериодыПрочихВычетов.ФизическоеЛицо";
		
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТПериодыПрочихВычетов");   
	УничтожитьВТ.Добавить("ВТПрочиеВычетыФизическихЛиц");   
	
	Если НЕ ВТСуществует(МенеджерВременныхТаблиц,"ВТИсчисленныеОПВ") Тогда
		Запрос.Текст =
			"ВЫБРАТЬ
			|	NULL КАК МесяцНалоговогоПериода,
			|	NULL КАК ФизическоеЛицо,
			|	NULL КАК ВидДохода,
			|	0 КАК ОбъектИсчисленияОПВ,
			|	0 КАК ИсчисленныеОПВ
			|ПОМЕСТИТЬ ВТИсчисленныеОПВ";
		Запрос.Выполнить();
	КонецЕсли;
	
	Если НЕ ВТСуществует(МенеджерВременныхТаблиц,"ВТИсчисленныеВОСМС") 
		И НЕ ПрименятьКорректировкуПрочихНалоговВзносовОтчислений Тогда
		Запрос.Текст =
			"ВЫБРАТЬ
			|	NULL КАК МесяцНалоговогоПериода,
			|	NULL КАК ФизическоеЛицо,
			|	NULL КАК ВидДохода,
			|	0 КАК ИсчисленныеВОСМС
			|ПОМЕСТИТЬ ВТИсчисленныеВОСМС";
		Запрос.Выполнить();
	КонецЕсли;
	
	// Финальный запрос	
	Запрос.Текст = 	
		"ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СтатусыФизическихЛицКакНалогоплательщиков.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Резидент)
		|			ТОГДА ЕСТЬNULL(СтавкиИПН.СтавкаРезиденты, 0)
		|		ИНАЧЕ ЕСТЬNULL(СтавкиИПН.СтавкаНерезиденты, 0)
		|	КОНЕЦ КАК СтавкаИПН,
		|	Доходы.ОблагаемыйДоход КАК ОблагаемыйДоходВЦеломЗаПериод,
		|	Доходы.НеоблагаемыйДоход КАК НеоблагаемыйДоходВЦеломЗаПериод,
		|	// Корректировка облагаемого дохода
		|	ЕСТЬNULL(ПредоставлениеВычетовФизическимЛицам.РазмерСтандартногоВычета, 0) КАК РазмерСтандартногоВычета,
		|	ЕСТЬNULL(ПредоставлениеВычетовФизическимЛицам.ЕстьЗаявлениеНаВычет, ЛОЖЬ) КАК ЕстьЗаявлениеНаВычет,
		|	ЕСТЬNULL(ПредоставлениеВычетовФизическимЛицам.ПредоставлятьВычет, ЛОЖЬ) КАК ПредоставлятьВычет,
		|	ЕСТЬNULL(ПредоставлениеВычетовФизическимЛицам.КалендарныхДнейРаботы, 0) КАК КалендарныхДнейРаботы,
		|	ЕСТЬNULL(ЛьготыФизическихЛиц.РазмерЛьготы, 0) КАК РазмерЛьготы,
		|	ЕСТЬNULL(ЛьготыФизическихЛиц.КатегорияЛицаПолучателяЛьготы, ЗНАЧЕНИЕ(Справочник.КатегорииЛицПолучателейЛьготИПН.ПустаяСсылка)) КАК КатегорияЛицаПолучателяЛьготы,
		|	ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) КАК ИсчисленныеОПВ,
		|	" + ?(ПрименятьКорректировкуПрочихНалоговВзносовОтчислений, "0", "ЕСТЬNULL(ИсчисленныеВОСМСПоПериодам.ИсчисленныеВОСМС, 0)") + " КАК ИсчисленныеВОСМС,
		|	ЕСТЬNULL(ПрочиеВычетыФизическихЛиц.Размер, 0) КАК ПрочиеВычетыВЦеломЗаПериод,
		|	// Исчисленные ранее показатели
		|	ЕСТЬNULL(ИсчисленныйИПНРанее.ПримененныйВычет, 0) КАК ПримененныйВычетИсчисленныйРанее,
		|	ЕСТЬNULL(ИсчисленныйИПНРанее.РазрешенныйВычет, 0) КАК РазрешенныйВычетИсчисленныйРанее,
		|	ЕСТЬNULL(ИсчисленныйИПНРанее.ПримененнаяЛьгота, 0) КАК ПримененнаяЛьготаИсчисленнаяРанее,
		|	ЕСТЬNULL(ИсчисленныйИПНРанее.ПрочиеВычеты, 0) КАК ПрочиеВычетыИсчисленныеРанее,
		|	ЕСТЬNULL(ИсчисленныйИПНРанее.ПримененныйВычетСНачалаГода, 0) КАК ПримененныйВычетСНачалаГода,
		|	ЕСТЬNULL(ИсчисленныйИПНРанее.РазрешенныйВычетСНачалаГода, 0) КАК РазрешенныйВычетСНачалаГода,
		|	ЕСТЬNULL(ИсчисленныйИПНРанее.ПримененнаяЛьготаСНачалаГода, 0) КАК ПримененнаяЛьготаСНачалаГода
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиИПН КАК СтавкиИПН
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиИПН.МесяцНалоговогоПериода
		|			И Доходы.ВидДохода = СтавкиИПН.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизическихЛицКакНалогоплательщиков КАК СтатусыФизическихЛицКакНалогоплательщиков
		|		ПО Доходы.МесяцНалоговогоПериода = СтатусыФизическихЛицКакНалогоплательщиков.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = СтатусыФизическихЛицКакНалогоплательщиков.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленныеОПВ КАК ИсчисленныеОПВПоПериодам
		|		ПО Доходы.МесяцНалоговогоПериода = ИсчисленныеОПВПоПериодам.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ИсчисленныеОПВПоПериодам.ФизическоеЛицо
		|			И Доходы.ВидДохода = ИсчисленныеОПВПоПериодам.ВидДохода
		|" + ?(ПрименятьКорректировкуПрочихНалоговВзносовОтчислений, "", "
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленныеВОСМС КАК ИсчисленныеВОСМСПоПериодам
		|		ПО Доходы.МесяцНалоговогоПериода = ИсчисленныеВОСМСПоПериодам.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ИсчисленныеВОСМСПоПериодам.ФизическоеЛицо
		|			И Доходы.ВидДохода = ИсчисленныеВОСМСПоПериодам.ВидДохода") + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПредоставлениеВычетовФизическимЛицам КАК ПредоставлениеВычетовФизическимЛицам
		|		ПО Доходы.МесяцНалоговогоПериода = ПредоставлениеВычетовФизическимЛицам.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ПредоставлениеВычетовФизическимЛицам.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛьготыФизическихЛиц КАК ЛьготыФизическихЛиц
		|		ПО Доходы.МесяцНалоговогоПериода = ЛьготыФизическихЛиц.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ЛьготыФизическихЛиц.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПрочиеВычетыФизическихЛиц КАК ПрочиеВычетыФизическихЛиц
		|		ПО Доходы.МесяцНалоговогоПериода = ПрочиеВычетыФизическихЛиц.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ПрочиеВычетыФизическихЛиц.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленныеНалогиВзносы КАК ИсчисленныйИПНРанее
		|		ПО Доходы.МесяцНалоговогоПериода = ИсчисленныйИПНРанее.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ИсчисленныйИПНРанее.ФизическоеЛицо
		|			И Доходы.ВидДохода = ИсчисленныйИПНРанее.ВидДохода
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	МесяцНалоговогоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныйИПНПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныйИПНПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныйИПНПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныйИПНПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныйИПНПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныйИПНПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныйИПНПоПодразделениям.ОбъектИсчисления КАК ОбъектИПНВИсчисленныйРанее,
		|	ИсчисленныйИПНПоПодразделениям.НалогВзнос КАК ИПНИсчисленныйРанее,
		|	ИсчисленныйИПНПоПодразделениям.ПримененныйВычет КАК ПримененныйВычетИсчисленныйРанее,
		|	ИсчисленныйИПНПоПодразделениям.РазрешенныйВычет КАК РазрешенныйВычетИсчисленныйРанее,
		|	ИсчисленныйИПНПоПодразделениям.ПримененнаяЛьгота КАК ПримененнаяЛьготаИсчисленнаяРанее,
		|	ИсчисленныйИПНПоПодразделениям.ПрочиеВычеты КАК ПрочиеВычетыИсчисленныеРанее,
		|	-ИсчисленныйИПНПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныйИПНПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныйИПНПоПодразделениям.НалогВзнос КАК ИсчисленныйИПН,
		|	-ИсчисленныйИПНПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияИПН,
		|	-ИсчисленныйИПНПоПодразделениям.ПримененныйВычет КАК ПримененныйВычет,
		|	-ИсчисленныйИПНПоПодразделениям.РазрешенныйВычет КАК РазрешенныйВычет,
		|	-ИсчисленныйИПНПоПодразделениям.ПримененнаяЛьгота КАК ПримененнаяЛьгота,
		|	-ИсчисленныйИПНПоПодразделениям.ПрочиеВычеты КАК ПрочиеВычеты
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныйИПНПоПодразделениям";
		
	Результат = Запрос.ВыполнитьПакет();
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныйИПНПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	Выборка = Результат[ВсегоРезультатов - 3].Выбрать();

	КвалификаторЧисла = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2));
	ВспомогательнаяТаблицаРасчета = Новый ТаблицаЗначений;
	ВспомогательнаяТаблицаРасчета.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ВспомогательнаяТаблицаРасчета.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ВспомогательнаяТаблицаРасчета.Колонки.Добавить("ВидДохода", Новый ОписаниеТипов("СправочникСсылка.ВидыДоходов"));
	ВспомогательнаяТаблицаРасчета.Колонки.Добавить("ОбъектИсчисленияИПН", КвалификаторЧисла);
	ВспомогательнаяТаблицаРасчета.Колонки.Добавить("ИсчисленныйИПН", КвалификаторЧисла);
	ВспомогательнаяТаблицаРасчета.Колонки.Добавить("ПримененныйВычет", КвалификаторЧисла);
	ВспомогательнаяТаблицаРасчета.Колонки.Добавить("РазрешенныйВычет", КвалификаторЧисла);
	ВспомогательнаяТаблицаРасчета.Колонки.Добавить("ПримененнаяЛьгота", КвалификаторЧисла);
	ВспомогательнаяТаблицаРасчета.Колонки.Добавить("ПрочиеВычеты", КвалификаторЧисла);
	
	РезультатыРасчетов = ВспомогательнаяТаблицаРасчета.СкопироватьКолонки();
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", КвалификаторЧисла);      
	
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияИПНВЦеломЗаПериод", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныйИПНВЦеломЗаПериод", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("ПримененныйВычетВЦеломЗаПериод", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("РазрешенныйВычетВЦеломЗаПериод", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("ПримененнаяЛьготаВЦеломЗаПериод", КвалификаторЧисла);   
	РезультатыРасчетов.Колонки.Добавить("ПрочиеВычетыВЦеломЗаПериод", КвалификаторЧисла);
	
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("ОбъектИПНИсчисленныйРанее", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("ИПНИсчисленныйРанее", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("ПримененныйВычетИсчисленныйРанее", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("РазрешенныйВычетИсчисленныйРанее", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("ПримененнаяЛьготаИсчисленнаяРанее", КвалификаторЧисла);
	РезультатыРасчетов.Колонки.Добавить("ПрочиеВычетыИсчисленныеРанее", КвалификаторЧисла);

	ТекущееФизическоеЛицо = Неопределено;
	ПримененнаяЛьготаВТекущемРасчете = 0;
	ПримененныйВычетВТекущемРасчете = 0;
	РазрешенныйВычетВТекущемРасчете = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Если ТекущееФизическоеЛицо <> Выборка.ФизическоеЛицо Тогда
			ТекущееФизическоеЛицо = Выборка.ФизическоеЛицо;
			ПримененнаяЛьготаВТекущемРасчете = 0;
			ПримененныйВычетВТекущемРасчете = 0;
			РазрешенныйВычетВТекущемРасчете = 0;
		КонецЕсли;
		
		СтрокаРасчета = ВспомогательнаяТаблицаРасчета.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРасчета, Выборка, "ФизическоеЛицо, ВидДохода, МесяцНалоговогоПериода");
		// Льгота
		ОстатокЛьготы 					 = Выборка.РазмерЛьготы - Выборка.ПримененнаяЛьготаСНачалаГода + Выборка.ПримененнаяЛьготаИсчисленнаяРанее - ПримененнаяЛьготаВТекущемРасчете;
		Если ОстатокЛьготы > 0 И Выборка.ОблагаемыйДоходВЦеломЗаПериод > 0 Тогда
			СтрокаРасчета.ПримененнаяЛьгота	 = Мин(ОстатокЛьготы, Выборка.ОблагаемыйДоходВЦеломЗаПериод);
		Иначе
			СтрокаРасчета.ПримененнаяЛьгота = 0;
		КонецЕсли;
		
		ПримененнаяЛьготаВТекущемРасчете = ПримененнаяЛьготаВТекущемРасчете + СтрокаРасчета.ПримененнаяЛьгота - Выборка.ПримененнаяЛьготаИсчисленнаяРанее;
		
		Если Выборка.ВидДохода = Справочники.ВидыДоходов.ДоходыОтРаботодателя Тогда 
			// Стандартный вычет
			СтрокаРасчета.РазрешенныйВычет				 	= Выборка.РазмерСтандартногоВычета;
			ОстатокВычета 									= (Выборка.РазрешенныйВычетСНачалаГода - Выборка.РазрешенныйВычетИсчисленныйРанее) 
															- (Выборка.ПримененныйВычетСНачалаГода - Выборка.ПримененныйВычетИсчисленныйРанее) 
															+ (РазрешенныйВычетВТекущемРасчете + Выборка.РазмерСтандартногоВычета - ПримененныйВычетВТекущемРасчете);
			ОблагаемыйДоход 								= Макс(Выборка.ОблагаемыйДоходВЦеломЗаПериод - СтрокаРасчета.ПримененнаяЛьгота - Выборка.ИсчисленныеОПВ, 0);
			СтрокаРасчета.ПримененныйВычет				 	= Мин(ОстатокВычета, ОблагаемыйДоход);
			РазрешенныйВычетВТекущемРасчете					= РазрешенныйВычетВТекущемРасчете + СтрокаРасчета.РазрешенныйВычет;
			ПримененныйВычетВТекущемРасчете 				= ПримененныйВычетВТекущемРасчете + СтрокаРасчета.ПримененныйВычет;
			
			// Прочие вычеты                                
			СтрокаРасчета.ПрочиеВычеты						= Выборка.ПрочиеВычетыВЦеломЗаПериод;
			
			// ОбъектИсчисления
			СтрокаРасчета.ОбъектИсчисленияИПН				= Макс(Выборка.ОблагаемыйДоходВЦеломЗаПериод 
															- СтрокаРасчета.ПримененнаяЛьгота 
															- Выборка.ИсчисленныеОПВ 
															- СтрокаРасчета.ПримененныйВычет 
															- СтрокаРасчета.ПрочиеВычеты, 0);
		Иначе
			// ОбъектИсчисления
			СтрокаРасчета.ОбъектИсчисленияИПН				= Макс(Выборка.ОблагаемыйДоходВЦеломЗаПериод - СтрокаРасчета.ПримененнаяЛьгота, 0);
		КонецЕсли;
		// Корректировку на сумму взносов ОСМС выполняем последней
		СтрокаРасчета.ОбъектИсчисленияИПН					= Макс(СтрокаРасчета.ОбъектИсчисленияИПН - Выборка.ИсчисленныеВОСМС, 0);	
		
		// ИПН
		СтрокаРасчета.ИсчисленныйИПН			 			= СтрокаРасчета.ОбъектИсчисленияИПН * Выборка.СтавкаИПН;
		
	КонецЦикла;
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	Для Каждого СтрокаРасчета Из ВспомогательнаяТаблицаРасчета Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияИПН,ИсчисленныйИПН,ПримененнаяЛьгота,РазрешенныйВычет,ПримененныйВычет,ПрочиеВычеты");
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныйИПНПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод,   НеоблагаемыйДоходВЦеломЗаПериод, 	 ОбъектИсчисленияИПНВЦеломЗаПериод, ИсчисленныйИПНВЦеломЗаПериод, ПримененнаяЛьготаВЦеломЗаПериод,   РазрешенныйВычетВЦеломЗаПериод,   ПримененныйВычетВЦеломЗаПериод,   ПрочиеВычетыВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, НеоблагаемыйДоходИсчисленныйРанее, ОбъектИПНИсчисленныйРанее, 		ИПНИсчисленныйРанее, 		  ПримененнаяЛьготаИсчисленнаяРанее, РазрешенныйВычетИсчисленныйРанее, ПримененныйВычетИсчисленныйРанее, ПрочиеВычетыИсчисленныеРанее,
								|ОблагаемыйДоход, 				  НеоблагаемыйДоход, 				 ОбъектИсчисленияИПН, 				ИсчисленныйИПН, 			  ПримененнаяЛьгота, 			     РазрешенныйВычет, 		   ПримененныйВычет, 		     ПрочиеВычеты");

								
								
	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаИПН);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);

	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	Для Каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		НомерСтроки = НомерСтроки + 1;
		СтрокаТЗ.НомерСтроки = НомерСтроки;
		СтрокаТЗ.ИсчисленныйИПН = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныйИПН, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
	КонецЦикла;
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьИПНПосле2018(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт

	УдалитьВТ = Новый Массив;
	
	ВидНалогаВзносаИПН =  Перечисления.ВидыНалоговВзносовОтчислений.ИПН;
	
	// Получаем применение вычета в месяц отсутствия дохода
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(МесяцНачисления, Новый Структура("Организация", Организация));
	ПредоставлятьВычетВМесяцеОтсутствияДохода = Ложь;
	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		ПредоставлятьВычетВМесяцеОтсутствияДохода = УчетнаяПолитикаНУ[0].ПредоставлятьВычетВМесяцеОтсутствияДохода;
		//И ТипЗнч(Регистратор) = Тип("ДокументСсылка.НачислениеЗарплаты");
	КонецЕсли;
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаИПН);
	УдалитьВТ.Добавить("ВТДоходы");
	УдалитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленного ИПН
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаИПН, ПредоставлятьВычетВМесяцеОтсутствияДохода);
	УдалитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	// Таблица ВТДанныеДляРасчетаВычетовИПН
	СоздатьВТДанныеДляРасчетаВычетовИПН(МенеджерВременныхТаблиц, Организация, ПредоставлятьВычетВМесяцеОтсутствияДохода, МесяцНачисления);
	УдалитьВТ.Добавить("ВТДанныеДляРасчетаВычетовИПН");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст ="ВЫБРАТЬ
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	Доходы.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	Доходы.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ПОМЕСТИТЬ ВТДоходыОбъединенная
		|ИЗ
		|	ВТДоходы КАК Доходы
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТСотрудникиОрганизацииБезДохода.ФизическоеЛицо,
		|	ВТСотрудникиОрганизацииБезДохода.МесяцНалоговогоПериода,
		|	ВТСотрудникиОрганизацииБезДохода.ВидДохода,
		|	ВТСотрудникиОрганизацииБезДохода.ОблагаемыйДоход,
		|	ВТСотрудникиОрганизацииБезДохода.НеоблагаемыйДоход
		|ИЗ
		|	ВТСотрудникиОрганизацииБезДохода КАК ВТСотрудникиОрганизацииБезДохода";
		Запрос.Выполнить();
		УдалитьВТ.Добавить("ВТДоходыОбъединенная");
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.ВидДохода,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.ОблагаемыйДоход) КАК ОблагаемыйДоход,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.НеоблагаемыйДоход) КАК НеоблагаемыйДоход,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.НалогВзнос) КАК НалогВзнос,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.ОбъектИсчисления) КАК ОбъектИсчисления
		|ПОМЕСТИТЬ ВТИсчисленныеНалогиВзносы
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ВТИсчисленныеНалогиВзносыПоПодразделениям
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.ВидДохода";
	Запрос.Выполнить();
	УдалитьВТ.Добавить("ВТИсчисленныеНалогиВзносы");
	
	// Статусы физических лиц как налогоплательщиков по периодам
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(СтатусФизическихЛицКакНалогоплательщиков.Период) КАК ПериодСтатуса,
		|	СтатусФизическихЛицКакНалогоплательщиков.ФизическоеЛицо,
		|	ПериодыРасчета.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТПериодыСтатусов
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ПериодыРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизическихЛицКакНалогоплательщиков КАК СтатусФизическихЛицКакНалогоплательщиков
		|		ПО ПериодыРасчета.МесяцНалоговогоПериода >= СтатусФизическихЛицКакНалогоплательщиков.Период
		|			И ПериодыРасчета.ФизическоеЛицо = СтатусФизическихЛицКакНалогоплательщиков.ФизическоеЛицо
		|
		|СГРУППИРОВАТЬ ПО
		|	СтатусФизическихЛицКакНалогоплательщиков.ФизическоеЛицо,
		|	ПериодыРасчета.МесяцНалоговогоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыСтатусов.МесяцНалоговогоПериода,
		|	ПериодыСтатусов.ФизическоеЛицо,
		|	СтатусФизическихЛицКакНалогоплательщиков.Статус
		|ПОМЕСТИТЬ ВТСтатусыФизическихЛицКакНалогоплательщиков
		|ИЗ
		|	ВТПериодыСтатусов КАК ПериодыСтатусов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизическихЛицКакНалогоплательщиков КАК СтатусФизическихЛицКакНалогоплательщиков
		|		ПО ПериодыСтатусов.ПериодСтатуса = СтатусФизическихЛицКакНалогоплательщиков.Период
		|			И ПериодыСтатусов.ФизическоеЛицо = СтатусФизическихЛицКакНалогоплательщиков.ФизическоеЛицо";
	
	Запрос.Выполнить();
	УдалитьВТ.Добавить("ВТПериодыСтатусов");
	УдалитьВТ.Добавить("ВТСтатусыФизическихЛицКакНалогоплательщиков");
	
	// Ставки ИПН
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	1 КАК Приоритет,
		|	МАКСИМУМ(ЕСТЬNULL(СведенияОСтавкахИПН.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК ПериодСтавки,
		|	ПериодыРасчета.Период КАК МесяцНалоговогоПериода,
		|	СведенияОСтавкахИПН.Организация КАК Организация,
		|	СведенияОСтавкахИПН.ВидДохода
		|ПОМЕСТИТЬ ВТПериодыСтавокИПН
		|ИЗ
		|	ВТДатыПоМесяцам КАК ПериодыРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахИПН КАК СведенияОСтавкахИПН
		|		ПО ПериодыРасчета.Период >= СведенияОСтавкахИПН.Период
		|ГДЕ
		|	СведенияОСтавкахИПН.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	ПериодыРасчета.Период,
		|	СведенияОСтавкахИПН.Организация,
		|	СведенияОСтавкахИПН.ВидДохода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	МАКСИМУМ(ЕСТЬNULL(СведенияОСтавкахИПН.Период, ДАТАВРЕМЯ(1, 1, 1))),
		|	ПериодыРасчета.Период,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка),
		|	СведенияОСтавкахИПН.ВидДохода
		|ИЗ
		|	ВТДатыПоМесяцам КАК ПериодыРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахИПН КАК СведенияОСтавкахИПН
		|		ПО ПериодыРасчета.Период >= СведенияОСтавкахИПН.Период
		|ГДЕ
		|	СведенияОСтавкахИПН.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПериодыРасчета.Период,
		|	СведенияОСтавкахИПН.ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыСтавокИПН.Приоритет,
		|	ПериодыСтавокИПН.МесяцНалоговогоПериода,
		|	ПериодыСтавокИПН.ВидДохода,
		|	ЕСТЬNULL(СведенияОСтавкахИПН.Ставка, 0) / 100 КАК СтавкаРезиденты,
		|	ЕСТЬNULL(СведенияОСтавкахИПН.СтавкаНерезиденты, 0) / 100 КАК СтавкаНерезиденты
		|ПОМЕСТИТЬ ВТСтавкиИПНПоПриоритетам
		|ИЗ
		|	ВТПериодыСтавокИПН КАК ПериодыСтавокИПН
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахИПН КАК СведенияОСтавкахИПН
		|		ПО ПериодыСтавокИПН.ПериодСтавки = СведенияОСтавкахИПН.Период
		|			И ПериодыСтавокИПН.Организация = СведенияОСтавкахИПН.Организация
		|			И ПериодыСтавокИПН.ВидДохода = СведенияОСтавкахИПН.ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриоритетСтавок.МесяцНалоговогоПериода,
		|	ПриоритетСтавок.ВидДохода,
		|	ВТСтавкиПоПриоритетам.СтавкаРезиденты,
		|	ВТСтавкиПоПриоритетам.СтавкаНерезиденты
		|ПОМЕСТИТЬ ВТСтавкиИПН
		|ИЗ
		|	(ВЫБРАТЬ
		|		МИНИМУМ(ПриоритетСтавок.Приоритет) КАК Приоритет,
		|		ПриоритетСтавок.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		ПриоритетСтавок.ВидДохода КАК ВидДохода
		|	ИЗ
		|		ВТСтавкиИПНПоПриоритетам КАК ПриоритетСтавок
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПриоритетСтавок.МесяцНалоговогоПериода,
		|		ПриоритетСтавок.ВидДохода) КАК ПриоритетСтавок
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиИПНПоПриоритетам КАК ВТСтавкиПоПриоритетам
		|		ПО ПриоритетСтавок.Приоритет = ВТСтавкиПоПриоритетам.Приоритет
		|			И ПриоритетСтавок.МесяцНалоговогоПериода = ВТСтавкиПоПриоритетам.МесяцНалоговогоПериода
		|			И ПриоритетСтавок.ВидДохода = ВТСтавкиПоПриоритетам.ВидДохода";
		
	Запрос.Выполнить();
	УдалитьВТ.Добавить("ВТПериодыСтавокИПН");
	УдалитьВТ.Добавить("ВТСтавкиИПНПоПриоритетам");
	УдалитьВТ.Добавить("ВТСтавкиИПН");
	
	// Финальный запрос	
	Запрос.Текст = 	
		"ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СтатусыФизическихЛицКакНалогоплательщиков.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Резидент)
		|			ТОГДА ЕСТЬNULL(СтавкиИПН.СтавкаРезиденты, 0)
		|		ИНАЧЕ ЕСТЬNULL(СтавкиИПН.СтавкаНерезиденты, 0)
		|	КОНЕЦ КАК СтавкаИПН,
		|	Доходы.ОблагаемыйДоход КАК ОблагаемыйДоходВЦеломЗаПериод,
		|	Доходы.НеоблагаемыйДоход КАК НеоблагаемыйДоходВЦеломЗаПериод,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ВидВычета, ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ПустаяСсылка)) КАК ВидВычета,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.Приоритет, 0) КАК Приоритет,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ПредоставлениеВычета, ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.ПустаяСсылка)) КАК ПредоставлениеВычета,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ВидВзносов, ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ПустаяСсылка)) КАК ВидВзносов,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ПределВычета, 0) КАК ПределВычета,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ПериодПредоставления, ЗНАЧЕНИЕ(Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ПустаяСсылка)) КАК ПериодПредоставления,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.РазмерВычета, 0) КАК РазмерВычета,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.СуммовойПределВычета, 0) КАК СуммовойПределВычета,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.РазрешенныйВычетВТекущемПериоде, 0) КАК РазрешенныйВычетВТекущемПериоде,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ПримененныйВычетВТекущемПериоде, 0) КАК ПримененныйВычетВТекущемПериоде,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.РазрешенныйВычетСНачалаГода, 0) КАК РазрешенныйВычетСНачалаГода,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ПримененныйВычетСНачалаГода, 0) КАК ПримененныйВычетСНачалаГода
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиИПН КАК СтавкиИПН
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиИПН.МесяцНалоговогоПериода
		|			И Доходы.ВидДохода = СтавкиИПН.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизическихЛицКакНалогоплательщиков КАК СтатусыФизическихЛицКакНалогоплательщиков
		|		ПО Доходы.МесяцНалоговогоПериода = СтатусыФизическихЛицКакНалогоплательщиков.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = СтатусыФизическихЛицКакНалогоплательщиков.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеДляРасчетаВычетовИПН КАК ДанныеДляРасчетаВычетовИПН
		|		ПО Доходы.МесяцНалоговогоПериода = ДанныеДляРасчетаВычетовИПН.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ДанныеДляРасчетаВычетовИПН.ФизическоеЛицо
		|			И (ВЫБОР
		|				КОГДА ДанныеДляРасчетаВычетовИПН.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов)
		|					ТОГДА Доходы.ВидДохода = ДанныеДляРасчетаВычетовИПН.ВидДоходаВзносов
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ДанныеДляРасчетаВычетовИПН.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.Стандартный)
		|						И ДанныеДляРасчетаВычетовИПН.ПериодПредоставления = ЗНАЧЕНИЕ(Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода)
		|			КОНЕЦ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	МесяцНалоговогоПериода,
		|	Приоритет
		|ИТОГИ
		|	МАКСИМУМ(СтавкаИПН),
		|	МАКСИМУМ(ОблагаемыйДоходВЦеломЗаПериод),
		|	МАКСИМУМ(НеоблагаемыйДоходВЦеломЗаПериод)
		|ПО
		|	ФизическоеЛицо,
		|	МесяцНалоговогоПериода,
		|	ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныйИПНПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныйИПНПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныйИПНПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныйИПНПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныйИПНПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныйИПНПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныйИПНПоПодразделениям.ОбъектИсчисления КАК ОбъектИПНВИсчисленныйРанее,
		|	ИсчисленныйИПНПоПодразделениям.НалогВзнос КАК ИПНИсчисленныйРанее,
		|	-ИсчисленныйИПНПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныйИПНПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныйИПНПоПодразделениям.НалогВзнос КАК ИсчисленныйИПН,
		|	-ИсчисленныйИПНПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияИПН,
		|	ЕСТЬNULL(НакопленныеДанныеПоВычетам.ВидВычета, ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ПустаяСсылка)) КАК ВидВычета,
		|	ЕСТЬNULL(НакопленныеДанныеПоВычетам.ВидВычета.Приоритет, 0) КАК Приоритет,
		|	ЕСТЬNULL(НакопленныеДанныеПоВычетам.РазрешенныйВычетВТекущемПериоде, 0) КАК РазрешенныйВычетВТекущемПериоде,
		|	ЕСТЬNULL(НакопленныеДанныеПоВычетам.ПримененныйВычетВТекущемПериоде, 0) КАК ПримененныйВычетВТекущемПериоде
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныйИПНПоПодразделениям
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНакопленныеДанныеПоВычетам КАК НакопленныеДанныеПоВычетам
		|		ПО ИсчисленныйИПНПоПодразделениям.МесяцНалоговогоПериода = НакопленныеДанныеПоВычетам.МесяцНалоговогоПериода
		|			И ИсчисленныйИПНПоПодразделениям.ФизическоеЛицо = НакопленныеДанныеПоВычетам.ФизическоеЛицо
		|			И ИсчисленныйИПНПоПодразделениям.Подразделение = НакопленныеДанныеПоВычетам.Подразделение
		|			И ИсчисленныйИПНПоПодразделениям.ВидДохода = НакопленныеДанныеПоВычетам.ВидДохода
		|			И (ВЫБОР
		|				КОГДА ИсчисленныйИПНПоПодразделениям.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ НакопленныеДанныеПоВычетам.ВидВычета.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.Стандартный)
		|						И НакопленныеДанныеПоВычетам.ВидВычета.ПериодПредоставления = ЗНАЧЕНИЕ(Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода)
		|			КОНЕЦ)
		|ГДЕ
		|	(ИсчисленныйИПНПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныйИПНПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныйИПНПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныйИПНПоПодразделениям.НалогВзнос <> 0
		|			ИЛИ НакопленныеДанныеПоВычетам.РазрешенныйВычетВТекущемПериоде <> 0
		|			ИЛИ НакопленныеДанныеПоВычетам.ПримененныйВычетВТекущемПериоде <> 0)
		|ИТОГИ
		|	МАКСИМУМ(ОблагаемыйДоходИсчисленныйРанее),
		|	МАКСИМУМ(НеоблагаемыйДоходИсчисленныйРанее),
		|	МАКСИМУМ(ОбъектИПНВИсчисленныйРанее),
		|	МАКСИМУМ(ИПНИсчисленныйРанее),
		|	МАКСИМУМ(ОблагаемыйДоход),
		|	МАКСИМУМ(НеоблагаемыйДоход),
		|	МАКСИМУМ(ИсчисленныйИПН),
		|	МАКСИМУМ(ОбъектИсчисленияИПН)
		|ПО
		|	ФизическоеЛицо,
		|	МесяцНалоговогоПериода,
		|	Подразделение,
		|	ВидДохода";
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВТДоходы КАК Доходы", "ВТДоходыОбъединенная КАК Доходы");
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();
	УдалитьВТ.Добавить("ВТНакопленныеДанныеПоВычетам");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныйИПНВыборкаПоФизЛицам = Результат[ВсегоРезультатов - 1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ФизическоеЛицо");
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	ВыборкаПоФизЛицам = Результат[ВсегоРезультатов - 3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ФизическоеЛицо");

	СтруктураДанных = ПодготовитьСлужебныеДанныеДляРасчетаИПН();
	ВспомогательнаяТаблицаРасчета = СтруктураДанных.ВспомогательнаяТаблицаРасчета;
	РезультатыРасчетов = СтруктураДанных.РезультатыРасчетов;
	ИзмеренияРасчетаВычетов = СтруктураДанных.ИзмеренияРасчетаВычетов;
	РесурсыРасчетаВычетов = СтруктураДанных.РесурсыРасчетаВычетов;
	
	ВычетыПримененныеВДанномРасчете = Новый Соответствие;
	
	Пока ВыборкаПоФизЛицам.Следующий() Цикл
		ВычетыПримененныеВДанномРасчете.Очистить();
		ВыборкаПоПериодам = ВыборкаПоФизЛицам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "МесяцНалоговогоПериода");
		Пока ВыборкаПоПериодам.Следующий() Цикл
			ВыборкаПоВидамДохода = ВыборкаПоПериодам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидДохода");
			Пока ВыборкаПоВидамДохода.Следующий() Цикл
				
				СтрокаРасчета = ВспомогательнаяТаблицаРасчета.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРасчета, ВыборкаПоВидамДохода, "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода");
				
				ОбъектИсчисленияИПН = ВыборкаПоВидамДохода.ОблагаемыйДоходВЦеломЗаПериод;
				ВыборкаПоВидамВычетов = ВыборкаПоВидамДохода.Выбрать();
				РазрешенныйВычетВТекущемПериоде = 0;
				ПримененныйВычетВТекущемПериоде = 0;
				Пока ВыборкаПоВидамВычетов.Следующий() Цикл
					
					Если НЕ ЗначениеЗаполнено(ВыборкаПоВидамВычетов.ВидВычета) Тогда
						// Незачем считать, если вычеты не найдены
						Продолжить;
					КонецЕсли;
					
					// Соберем остатки за прошлые периоды в пределах года
					РазрешенныйВычетЗаПрошлыеМесяцы = ВыборкаПоВидамВычетов.РазрешенныйВычетСНачалаГода - ВыборкаПоВидамВычетов.РазрешенныйВычетВТекущемПериоде;
					ПримененныйВычетЗаПрошлыеМесяцы = ВыборкаПоВидамВычетов.ПримененныйВычетСНачалаГода - ВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде;
					ОстатокВычетаЗаПрошлыеМесяцы = РазрешенныйВычетЗаПрошлыеМесяцы - ПримененныйВычетЗаПрошлыеМесяцы;

					// Получим значения в текущем периоде
					Если ВыборкаПоВидамВычетов.ПредоставлениеВычета = Перечисления.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов Тогда
						РазрешенныйВычетВТекущемПериоде = ВыборкаПоВидамВычетов.РазмерВычета;
					ИначеЕсли ВыборкаПоВидамВычетов.ПредоставлениеВычета = Перечисления.ВидыПредоставленияВычетов.Стандартный 
						ИЛИ ВыборкаПоВидамВычетов.ПредоставлениеВычета = Перечисления.ВидыПредоставленияВычетов.ПоПериодическимПлатежам Тогда
						Если ВыборкаПоВидамВычетов.ПределВычета > 0 Тогда
							Если ВыборкаПоВидамВычетов.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца Тогда
								РазрешенныйВычетВТекущемПериоде = Мин(ВыборкаПоВидамВычетов.СуммовойПределВычета, ВыборкаПоВидамВычетов.РазмерВычета);
							ИначеЕсли ВыборкаПоВидамВычетов.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода Тогда
								РазрешенныйВычетВТекущемПериоде = Мин(ВыборкаПоВидамВычетов.СуммовойПределВычета - РазрешенныйВычетЗаПрошлыеМесяцы, ВыборкаПоВидамВычетов.РазмерВычета);
							Иначе 
								РазрешенныйВычетВТекущемПериоде = 0;
							КонецЕсли;
						Иначе 
							РазрешенныйВычетВТекущемПериоде = ВыборкаПоВидамВычетов.РазмерВычета;
						КонецЕсли;
					Иначе
						РазрешенныйВычетВТекущемПериоде = 0;
					КонецЕсли;
					
					ПримененныйВычетВТекущемПериоде = Мин(ОбъектИсчисленияИПН, ОстатокВычетаЗаПрошлыеМесяцы + РазрешенныйВычетВТекущемПериоде 
										- ?(ВычетыПримененныеВДанномРасчете.Получить(ВыборкаПоВидамВычетов.ВидВычета) <> Неопределено, ВычетыПримененныеВДанномРасчете.Получить(ВыборкаПоВидамВычетов.ВидВычета), 0));

					// Скорректируем остаток облагаемого дохода
					ОбъектИсчисленияИПН = Макс(0, ОбъектИсчисленияИПН - ПримененныйВычетВТекущемПериоде);

					// Получим значения в текущем расчете
					РазрешенныйВычетВТекущемРасчете = РазрешенныйВычетВТекущемПериоде - ВыборкаПоВидамВычетов.РазрешенныйВычетВТекущемПериоде;
					ПримененныйВычетВТекущемРасчете = ПримененныйВычетВТекущемПериоде - ВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде;
					
					// Зафиксируем результаты по значению текущего физлица расчета
					Если ВычетыПримененныеВДанномРасчете.Получить(ВыборкаПоВидамВычетов.ВидВычета) = Неопределено Тогда
						ВычетыПримененныеВДанномРасчете.Вставить(ВыборкаПоВидамВычетов.ВидВычета, ПримененныйВычетВТекущемРасчете + ВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде);
					Иначе 
						ВычетыПримененныеВДанномРасчете[ВыборкаПоВидамВычетов.ВидВычета] = ВычетыПримененныеВДанномРасчете[ВыборкаПоВидамВычетов.ВидВычета] + ПримененныйВычетВТекущемРасчете + ВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде;
					КонецЕсли;
					
					СтрокаРасчета["ВидВычета" + Строка(ВыборкаПоВидамВычетов.Приоритет)] = ВыборкаПоВидамВычетов.ВидВычета;
					СтрокаРасчета["ПримененныйВычет" + Строка(ВыборкаПоВидамВычетов.Приоритет)] = ПримененныйВычетВТекущемПериоде;
					СтрокаРасчета["РазрешенныйВычет" + Строка(ВыборкаПоВидамВычетов.Приоритет)] = РазрешенныйВычетВТекущемПериоде;
					
				КонецЦикла;
				
				СтрокаРасчета.ОбъектИсчисленияИПН 	= ОбъектИсчисленияИПН;
				СтрокаРасчета.ИсчисленныйИПН 		= ОбъектИсчисленияИПН * ВыборкаПоВидамДохода.СтавкаИПН; 

			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	Для Каждого СтрокаРасчета Из ВспомогательнаяТаблицаРасчета Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияИПН,ИсчисленныйИПН" + РесурсыРасчетаВычетов);
	КонецЦикла;
	
	Пока ИсчисленныйИПНВыборкаПоФизЛицам.Следующий() Цикл
		ИсчисленныйИПНВыборкаПоПериодам = ИсчисленныйИПНВыборкаПоФизЛицам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "МесяцНалоговогоПериода");
		Пока ИсчисленныйИПНВыборкаПоПериодам.Следующий() Цикл
			ИсчисленныйИПНВыборкаПоПодразделениям = ИсчисленныйИПНВыборкаПоПериодам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Подразделение");
			Пока ИсчисленныйИПНВыборкаПоПодразделениям.Следующий() Цикл
				ИсчисленныйИПНВыборкаПоВидамДохода = ИсчисленныйИПНВыборкаПоПодразделениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидДохода");
				Пока ИсчисленныйИПНВыборкаПоВидамДохода.Следующий() Цикл
					НоваяСтрока = РезультатыРасчетов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ИсчисленныйИПНВыборкаПоВидамДохода);
					ИсчисленныйИПНВыборкаПоВидамВычетов = ИсчисленныйИПНВыборкаПоВидамДохода.Выбрать();
					Пока ИсчисленныйИПНВыборкаПоВидамВычетов.Следующий() Цикл
						Если НЕ ЗначениеЗаполнено(ИсчисленныйИПНВыборкаПоВидамВычетов.ВидВычета) Тогда
							Продолжить;
						КонецЕсли;
						
						НоваяСтрока["ВидВычета" + Строка(ИсчисленныйИПНВыборкаПоВидамВычетов.Приоритет)] = ИсчисленныйИПНВыборкаПоВидамВычетов.ВидВычета;
						
						НоваяСтрока["ПримененныйВычет" + Строка(ИсчисленныйИПНВыборкаПоВидамВычетов.Приоритет)] = - ИсчисленныйИПНВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде;
						НоваяСтрока["РазрешенныйВычет" + Строка(ИсчисленныйИПНВыборкаПоВидамВычетов.Приоритет)] = - ИсчисленныйИПНВыборкаПоВидамВычетов.РазрешенныйВычетВТекущемПериоде;
						
						НоваяСтрока["ПримененныйВычет" + Строка(ИсчисленныйИПНВыборкаПоВидамВычетов.Приоритет) + "ИсчисленныйРанее"] = ИсчисленныйИПНВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде;
						НоваяСтрока["РазрешенныйВычет" + Строка(ИсчисленныйИПНВыборкаПоВидамВычетов.Приоритет) + "ИсчисленныйРанее"] = ИсчисленныйИПНВыборкаПоВидамВычетов.РазрешенныйВычетВТекущемПериоде;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиБезДохода.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СотрудникиБезДохода.Подразделение КАК Подразделение
		|ИЗ
		|	ВТСотрудникиОрганизацииБезДохода КАК СотрудникиБезДохода";
		
		ТаблицаФизЛиц = Запрос.Выполнить().Выгрузить();
		Для каждого СтрокаТаблицы Из ТаблицаФизЛиц Цикл
			ПараметрыОтбора = Новый Структура("ФизическоеЛицо", СтрокаТаблицы.ФизическоеЛицо);
			МассивСтрок = ВспомогательнаяТаблицаРасчета.НайтиСтроки(ПараметрыОтбора);
			Для каждого Строка Из МассивСтрок Цикл
				НоваяСтрока = РезультатыРасчетов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				НоваяСтрока.Подразделение = СтрокаТаблицы.Подразделение;
			КонецЦикла;
		КонецЦикла;
		УдалитьВТ.Добавить("ВТСотрудникиОрганизацииБезДохода");
		УдалитьВТ.Добавить("ВТПериодыПоФизлицамОбъединенная");
		УдалитьВТ.Добавить("ВТКадровыеДанныеСотрудниковПоПериодамОбъединенная");
		УдалитьВТ.Добавить("ВТРанееИсчисленныеНалогиВзносыОбъедененная");
	КонецЕсли;
	
	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода" + ИзмеренияРасчетаВычетов,
								"ОблагаемыйДоходВЦеломЗаПериод,   НеоблагаемыйДоходВЦеломЗаПериод, 	 ОбъектИсчисленияИПНВЦеломЗаПериод, ИсчисленныйИПНВЦеломЗаПериод, 
								|ОблагаемыйДоходИсчисленныйРанее, НеоблагаемыйДоходИсчисленныйРанее, ОбъектИПНИсчисленныйРанее, 		ИПНИсчисленныйРанее, 
								|ОблагаемыйДоход, 				  НеоблагаемыйДоход, 				 ОбъектИсчисленияИПН, 				ИсчисленныйИПН" 				+ РесурсыРасчетаВычетов);

	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаИПН);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);

	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	Для Каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		НомерСтроки = НомерСтроки + 1;
		СтрокаТЗ.НомерСтроки = НомерСтроки;
		СтрокаТЗ.ИсчисленныйИПН = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныйИПН, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
	КонецЦикла;
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УдалитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьИПНПосле2019(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт

	УничтожитьВТ = Новый Массив;
	
	ВидНалогаВзносаИПН =  Перечисления.ВидыНалоговВзносовОтчислений.ИПН;
	
	// Получаем применение вычета в месяц отсутствия дохода
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(МесяцНачисления, Новый Структура("Организация", Организация));
	ПредоставлятьВычетВМесяцеОтсутствияДохода = Ложь;
	ПрименятьВычетОПВДляГПХ = Ложь;
	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		ПредоставлятьВычетВМесяцеОтсутствияДохода = УчетнаяПолитикаНУ[0].ПредоставлятьВычетВМесяцеОтсутствияДохода;
		ПрименятьВычетОПВДляГПХ = УчетнаяПолитикаНУ[0].ПрименятьВычетВОСМСДляФизическихЛицИГПХ;
		//И ТипЗнч(Регистратор) = Тип("ДокументСсылка.НачислениеЗарплаты");
	КонецЕсли;
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаИПН);
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленного ИПН
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаИПН, ПредоставлятьВычетВМесяцеОтсутствияДохода);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	// Статусы физических лиц как налогоплательщиков по периодам
	СоздатьВТСтатусыФизическихЛицКакНалогоплательщиков(МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТСтатусыФизическихЛицКакНалогоплательщиков");
	
	// Таблица ВТДанныеДляРасчетаВычетовИПН
	СоздатьВТДанныеДляРасчетаВычетовИПН(МенеджерВременныхТаблиц, Организация, ПредоставлятьВычетВМесяцеОтсутствияДохода, МесяцНачисления);
	УничтожитьВТ.Добавить("ВТДанныеДляРасчетаВычетовИПН");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст ="ВЫБРАТЬ
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	Доходы.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	Доходы.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ПОМЕСТИТЬ ВТДоходыОбъединенная
		|ИЗ
		|	ВТДоходы КАК Доходы
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТСотрудникиОрганизацииБезДохода.ФизическоеЛицо,
		|	ВТСотрудникиОрганизацииБезДохода.МесяцНалоговогоПериода,
		|	ВТСотрудникиОрганизацииБезДохода.ВидДохода,
		|	ВТСотрудникиОрганизацииБезДохода.ОблагаемыйДоход,
		|	ВТСотрудникиОрганизацииБезДохода.НеоблагаемыйДоход
		|ИЗ
		|	ВТСотрудникиОрганизацииБезДохода КАК ВТСотрудникиОрганизацииБезДохода";
		Запрос.Выполнить();
		УничтожитьВТ.Добавить("ВТДоходыОбъединенная");
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.ВидДохода,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.ОблагаемыйДоход) КАК ОблагаемыйДоход,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.НеоблагаемыйДоход) КАК НеоблагаемыйДоход,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.НалогВзнос) КАК НалогВзнос,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.ПримененнаяЛьгота) КАК ПримененнаяЛьгота,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.ОбъектИсчисления) КАК ОбъектИсчисления
		|ПОМЕСТИТЬ ВТИсчисленныеНалогиВзносы
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ВТИсчисленныеНалогиВзносыПоПодразделениям
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.ВидДохода";
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносы");
	
	// Ставки ИПН
	СоздатьВТСтавкиИПН(Организация, МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТСтавкиИПН");
	
	// Финальный запрос	
	Запрос.Текст = 	
		"ВЫБРАТЬ
		|	НастройкиВычетовПоВидамДохода.МесяцНалоговогоПериода,
		|   НастройкиВычетовПоВидамДохода.ВидВычета,
		|   НастройкиВычетовПоВидамДохода.ВидДохода
		|ИЗ
		|	ВТНастройкиВычетовПоВидамДохода КАК НастройкиВычетовПоВидамДохода
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СтатусыФизическихЛицКакНалогоплательщиков.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Резидент)
		|			ТОГДА ЕСТЬNULL(СтавкиИПН.СтавкаРезиденты, 0)
		|		ИНАЧЕ ЕСТЬNULL(СтавкиИПН.СтавкаНерезиденты, 0)
		|	КОНЕЦ КАК СтавкаИПН,
		|	ЕСТЬNULL(СтатусыФизическихЛицКакНалогоплательщиков.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Резидент)) КАК СтатусНерезидента,
		|	ЕСТЬNULL(РазмерыМРП.РазмерМРПНаНачалоГода, 0) * 25 КАК ОграничениеКорректировкиДохода25МРП,
		|	Доходы.ОблагаемыйДоход КАК ОблагаемыйДоходВЦеломЗаПериод,
		|	Доходы.НеоблагаемыйДоход КАК НеоблагаемыйДоходВЦеломЗаПериод,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ВидВычета, ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ПустаяСсылка)) КАК ВидВычета,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.Приоритет, 0) КАК Приоритет,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ПредоставлениеВычета, ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.ПустаяСсылка)) КАК ПредоставлениеВычета,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ВидВзносов, ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ПустаяСсылка)) КАК ВидВзносов,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ИспользуетсяПоНесколькимВидамДохода, ЛОЖЬ) КАК ИспользуетсяПоНесколькимВидамДохода,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ПределВычета, 0) КАК ПределВычета,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ПериодПредоставления, ЗНАЧЕНИЕ(Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ПустаяСсылка)) КАК ПериодПредоставления,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.РазмерВычета, 0) КАК РазмерВычета,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.СуммовойПределВычета, 0) КАК СуммовойПределВычета,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.РазрешенныйВычетВТекущемПериоде, 0) КАК РазрешенныйВычетВТекущемПериоде,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ПримененныйВычетВТекущемПериоде, 0) КАК ПримененныйВычетВТекущемПериоде,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.РазрешенныйВычетСНачалаГода, 0) КАК РазрешенныйВычетСНачалаГода,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ПримененныйВычетСНачалаГода, 0) КАК ПримененныйВычетСНачалаГода
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиИПН КАК СтавкиИПН
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиИПН.МесяцНалоговогоПериода
		|			И Доходы.ВидДохода = СтавкиИПН.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыМРППоПериодам КАК РазмерыМРП
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыМРП.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизическихЛицКакНалогоплательщиков КАК СтатусыФизическихЛицКакНалогоплательщиков
		|		ПО Доходы.МесяцНалоговогоПериода = СтатусыФизическихЛицКакНалогоплательщиков.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = СтатусыФизическихЛицКакНалогоплательщиков.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеДляРасчетаВычетовИПН КАК ДанныеДляРасчетаВычетовИПН
		|		ПО Доходы.МесяцНалоговогоПериода = ДанныеДляРасчетаВычетовИПН.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ДанныеДляРасчетаВычетовИПН.ФизическоеЛицо
		|			И (ВЫБОР
		|				КОГДА ДанныеДляРасчетаВычетовИПН.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов)
		|					ТОГДА Доходы.ВидДохода = ДанныеДляРасчетаВычетовИПН.ВидДоходаВзносов
		|				КОГДА НЕ ДанныеДляРасчетаВычетовИПН.ВидДоходаВычета ЕСТЬ NULL
		|					ТОГДА Доходы.ВидДохода = ДанныеДляРасчетаВычетовИПН.ВидДоходаВычета
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
		|					ТОГДА ИСТИНА" + ?(ПрименятьВычетОПВДляГПХ, "
		|				ИНАЧЕ Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
		|						И ((ДанныеДляРасчетаВычетовИПН.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.Стандартный)
		|						И ДанныеДляРасчетаВычетовИПН.ПериодПредоставления = ЗНАЧЕНИЕ(Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода))
		|						ИЛИ ДанныеДляРасчетаВычетовИПН.ВидВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетОПВ))", "
		|				ИНАЧЕ ДанныеДляРасчетаВычетовИПН.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.Стандартный)
		|						И ДанныеДляРасчетаВычетовИПН.ПериодПредоставления = ЗНАЧЕНИЕ(Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода)") + "
		|			КОНЕЦ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	МесяцНалоговогоПериода,
		|	Приоритет
		|ИТОГИ
		|	МАКСИМУМ(СтавкаИПН),
		|	МАКСИМУМ(ОблагаемыйДоходВЦеломЗаПериод),
		|	МАКСИМУМ(НеоблагаемыйДоходВЦеломЗаПериод),
		|	МАКСИМУМ(ОграничениеКорректировкиДохода25МРП),
		|	МАКСИМУМ(СтатусНерезидента)
		|ПО
		|	ФизическоеЛицо,
		|	МесяцНалоговогоПериода,
		|	ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныйИПНПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныйИПНПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныйИПНПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныйИПНПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныйИПНПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныйИПНПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныйИПНПоПодразделениям.ОбъектИсчисления КАК ОбъектИПНВИсчисленныйРанее,
		|	ИсчисленныйИПНПоПодразделениям.НалогВзнос КАК ИПНИсчисленныйРанее,
		|	ИсчисленныйИПНПоПодразделениям.ПримененнаяЛьгота КАК ПримененнаяЛьготаИсчислннаяРанее,
		|	-ИсчисленныйИПНПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныйИПНПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныйИПНПоПодразделениям.НалогВзнос КАК ИсчисленныйИПН,
		|	-ИсчисленныйИПНПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияИПН,
		|	-ИсчисленныйИПНПоПодразделениям.ПримененнаяЛьгота КАК ПримененнаяЛьгота,
		|	ЕСТЬNULL(НакопленныеДанныеПоВычетам.ВидВычета, ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ПустаяСсылка)) КАК ВидВычета,
		|	ЕСТЬNULL(НакопленныеДанныеПоВычетам.ВидВычета.Приоритет, 0) КАК Приоритет,
		|	ЕСТЬNULL(НакопленныеДанныеПоВычетам.РазрешенныйВычетВТекущемПериоде, 0) КАК РазрешенныйВычетВТекущемПериоде,
		|	ЕСТЬNULL(НакопленныеДанныеПоВычетам.ПримененныйВычетВТекущемПериоде, 0) КАК ПримененныйВычетВТекущемПериоде
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныйИПНПоПодразделениям
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНакопленныеДанныеПоВычетам КАК НакопленныеДанныеПоВычетам
		|		ПО ИсчисленныйИПНПоПодразделениям.МесяцНалоговогоПериода = НакопленныеДанныеПоВычетам.МесяцНалоговогоПериода
		|			И ИсчисленныйИПНПоПодразделениям.ФизическоеЛицо = НакопленныеДанныеПоВычетам.ФизическоеЛицо
		|			И ИсчисленныйИПНПоПодразделениям.Подразделение = НакопленныеДанныеПоВычетам.Подразделение
		|			И ИсчисленныйИПНПоПодразделениям.ВидДохода = НакопленныеДанныеПоВычетам.ВидДохода
		|			И (ВЫБОР
		|				КОГДА ИсчисленныйИПНПоПодразделениям.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
		|					ТОГДА ИСТИНА
		|" + ?(ПрименятьВычетОПВДляГПХ, "
		|				ИНАЧЕ ИсчисленныйИПНПоПодразделениям.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
		|						И ((НакопленныеДанныеПоВычетам.ВидВычета.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.Стандартный)
		|						И НакопленныеДанныеПоВычетам.ВидВычета.ПериодПредоставления = ЗНАЧЕНИЕ(Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода))
		|						ИЛИ НакопленныеДанныеПоВычетам.ВидВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетОПВ))", "
		|				ИНАЧЕ НакопленныеДанныеПоВычетам.ВидВычета.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.Стандартный)
		|						И НакопленныеДанныеПоВычетам.ВидВычета.ПериодПредоставления = ЗНАЧЕНИЕ(Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода)") + "
		|			КОНЕЦ)
		|ГДЕ
		|	(ИсчисленныйИПНПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныйИПНПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныйИПНПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныйИПНПоПодразделениям.НалогВзнос <> 0
		|			ИЛИ НакопленныеДанныеПоВычетам.РазрешенныйВычетВТекущемПериоде <> 0
		|			ИЛИ НакопленныеДанныеПоВычетам.ПримененныйВычетВТекущемПериоде <> 0)
		|ИТОГИ
		|	МАКСИМУМ(ОблагаемыйДоходИсчисленныйРанее),
		|	МАКСИМУМ(НеоблагаемыйДоходИсчисленныйРанее),
		|	МАКСИМУМ(ОбъектИПНВИсчисленныйРанее),
		|	МАКСИМУМ(ИПНИсчисленныйРанее),
		|	МАКСИМУМ(ОблагаемыйДоход),
		|	МАКСИМУМ(НеоблагаемыйДоход),
		|	МАКСИМУМ(ИсчисленныйИПН),
		|	МАКСИМУМ(ОбъектИсчисленияИПН)
		|ПО
		|	ФизическоеЛицо,
		|	МесяцНалоговогоПериода,
		|	Подразделение,
		|	ВидДохода";
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВТДоходы КАК Доходы", "ВТДоходыОбъединенная КАК Доходы");
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();
	УничтожитьВТ.Добавить("ВТНакопленныеДанныеПоВычетам");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныйИПНВыборкаПоФизЛицам = Результат[ВсегоРезультатов - 1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ФизическоеЛицо");
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	ВыборкаПоФизЛицам = Результат[ВсегоРезультатов - 3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ФизическоеЛицо");
	НастройкиВидовВычетаПоВидамДохода = Результат[ВсегоРезультатов - 4].Выгрузить();
	НастройкиВидовВычетаПоВидамДохода.Индексы.Добавить("МесяцНалоговогоПериода");
	НастройкиВидовВычетаПоВидамДохода.Индексы.Добавить("ВидВычета");

	СтруктураДанных = ПодготовитьСлужебныеДанныеДляРасчетаИПН();
	ВспомогательнаяТаблицаРасчета = СтруктураДанных.ВспомогательнаяТаблицаРасчета;
	РезультатыРасчетов = СтруктураДанных.РезультатыРасчетов;
	ИзмеренияРасчетаВычетов = СтруктураДанных.ИзмеренияРасчетаВычетов;
	РесурсыРасчетаВычетов = СтруктураДанных.РесурсыРасчетаВычетов;
	
	ВычетыПримененныеВДанномРасчете = Новый Соответствие;
	ВычетыРазрешенныеВДанномРасчете = Новый Соответствие;
	Пока ВыборкаПоФизЛицам.Следующий() Цикл
		ВыборкаПоПериодам = ВыборкаПоФизЛицам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "МесяцНалоговогоПериода");
		Пока ВыборкаПоПериодам.Следующий() Цикл
			ВычетыПримененныеВДанномРасчете.Очистить();
			ВычетыРазрешенныеВДанномРасчете.Очистить();
			ВыборкаПоВидамДохода = ВыборкаПоПериодам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидДохода");
			Пока ВыборкаПоВидамДохода.Следующий() Цикл
				
				СтрокаРасчета = ВспомогательнаяТаблицаРасчета.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРасчета, ВыборкаПоВидамДохода, "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода");
				
				ОбъектИсчисленияИПН = ВыборкаПоВидамДохода.ОблагаемыйДоходВЦеломЗаПериод;
				ВыборкаПоВидамВычетов = ВыборкаПоВидамДохода.Выбрать();
				РазрешенныйВычетВТекущемПериоде = 0;
				ПримененныйВычетВТекущемПериоде = 0;
				// ВычетОПВ применяем для каждого вида дохода в отдельности по исчисленной сумме в рамках вида дохода 
				Если НЕ ВычетыПримененныеВДанномРасчете.Получить(Справочники.ВидыВычетовИПН.ВычетОПВ) = Неопределено Тогда
					ВычетыПримененныеВДанномРасчете.Удалить(Справочники.ВидыВычетовИПН.ВычетОПВ);
				КонецЕсли;
				Пока ВыборкаПоВидамВычетов.Следующий() Цикл
					
					Если НЕ ЗначениеЗаполнено(ВыборкаПоВидамВычетов.ВидВычета) Тогда
						// Незачем считать, если вычеты не найдены
						Продолжить;
					КонецЕсли;
					
					Если ВыборкаПоВидамВычетов.ИспользуетсяПоНесколькимВидамДохода Тогда
						
						СтруктураПоиска = Новый Структура("МесяцНалоговогоПериода, ВидВычета, ВидДохода");
						ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаПоВидамВычетов);
						
						Если НастройкиВидовВычетаПоВидамДохода.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
							// Незачем считать, если вычеты не найдены
							Продолжить;
						КонецЕсли;
						
					КонецЕсли;
					
					// если вид вычета используется по нескольким видам дохода, найдем какие суммы были использованы по другим видам дохода у данного вычета
					Если ВыборкаПоВидамВычетов.ИспользуетсяПоНесколькимВидамДохода Тогда
						
						РазрешенныйВычетПрочихВидовДоходаТекущегоРасчета = ?(ВычетыРазрешенныеВДанномРасчете.Получить(ВыборкаПоВидамВычетов.ВидВычета) <> Неопределено, ВычетыРазрешенныеВДанномРасчете.Получить(ВыборкаПоВидамВычетов.ВидВычета), 0);
						
					Иначе
						
						РазрешенныйВычетПрочихВидовДоходаТекущегоРасчета = 0;
						
					КонецЕсли;

					// Соберем остатки за прошлые периоды в пределах года
					РазрешенныйВычетЗаПрошлыеМесяцы = ВыборкаПоВидамВычетов.РазрешенныйВычетСНачалаГода - ВыборкаПоВидамВычетов.РазрешенныйВычетВТекущемПериоде;
					ПримененныйВычетЗаПрошлыеМесяцы = ВыборкаПоВидамВычетов.ПримененныйВычетСНачалаГода - ВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде;
					ОстатокВычетаЗаПрошлыеМесяцы = РазрешенныйВычетЗаПрошлыеМесяцы - ПримененныйВычетЗаПрошлыеМесяцы;

					// Получим значения в текущем периоде
					Если ВыборкаПоВидамВычетов.ПредоставлениеВычета = Перечисления.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов Тогда
						РазрешенныйВычетВТекущемПериоде = ВыборкаПоВидамВычетов.РазмерВычета;
					ИначеЕсли ВыборкаПоВидамВычетов.ПредоставлениеВычета = Перечисления.ВидыПредоставленияВычетов.Стандартный 
						ИЛИ ВыборкаПоВидамВычетов.ПредоставлениеВычета = Перечисления.ВидыПредоставленияВычетов.ПоПериодическимПлатежам Тогда
						Если ВыборкаПоВидамВычетов.ПределВычета > 0 Тогда
							Если ВыборкаПоВидамВычетов.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца Тогда
								РазрешенныйВычетВТекущемПериоде = Мин(ВыборкаПоВидамВычетов.СуммовойПределВычета, ВыборкаПоВидамВычетов.РазмерВычета);
							ИначеЕсли ВыборкаПоВидамВычетов.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода Тогда
								РазрешенныйВычетВТекущемПериоде = Мин(ВыборкаПоВидамВычетов.СуммовойПределВычета - РазрешенныйВычетЗаПрошлыеМесяцы, ВыборкаПоВидамВычетов.РазмерВычета);
							Иначе 
								РазрешенныйВычетВТекущемПериоде = 0;
							КонецЕсли;
						Иначе 
							РазрешенныйВычетВТекущемПериоде = ВыборкаПоВидамВычетов.РазмерВычета;
						КонецЕсли;
					Иначе
						РазрешенныйВычетВТекущемПериоде = 0;
					КонецЕсли;
					
					ПримененныйВычетВТекущемПериоде = Мин(ОбъектИсчисленияИПН, ОстатокВычетаЗаПрошлыеМесяцы + РазрешенныйВычетВТекущемПериоде 
										- ?(ВычетыПримененныеВДанномРасчете.Получить(ВыборкаПоВидамВычетов.ВидВычета) <> Неопределено, ВычетыПримененныеВДанномРасчете.Получить(ВыборкаПоВидамВычетов.ВидВычета), 0));

					// Скорректируем остаток облагаемого дохода
					ОбъектИсчисленияИПН = Макс(0, ОбъектИсчисленияИПН - ПримененныйВычетВТекущемПериоде);

					// Получим значения в текущем расчете
					РазрешенныйВычетВТекущемРасчете = РазрешенныйВычетВТекущемПериоде - ВыборкаПоВидамВычетов.РазрешенныйВычетВТекущемПериоде;
					ПримененныйВычетВТекущемРасчете = ПримененныйВычетВТекущемПериоде - ВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде;
					
					// Зафиксируем результаты по значению текущего физлица расчета
					Если ВычетыПримененныеВДанномРасчете.Получить(ВыборкаПоВидамВычетов.ВидВычета) = Неопределено Тогда
						ВычетыПримененныеВДанномРасчете.Вставить(ВыборкаПоВидамВычетов.ВидВычета, ПримененныйВычетВТекущемРасчете + ВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде);
					Иначе 
						ВычетыПримененныеВДанномРасчете[ВыборкаПоВидамВычетов.ВидВычета] = ВычетыПримененныеВДанномРасчете[ВыборкаПоВидамВычетов.ВидВычета] + ПримененныйВычетВТекущемРасчете + ВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде;
					КонецЕсли;
					
					СтрокаРасчета["ВидВычета" + Строка(ВыборкаПоВидамВычетов.Приоритет)] = ВыборкаПоВидамВычетов.ВидВычета;
					СтрокаРасчета["ПримененныйВычет" + Строка(ВыборкаПоВидамВычетов.Приоритет)] = ПримененныйВычетВТекущемПериоде;
					СтрокаРасчета["РазрешенныйВычет" + Строка(ВыборкаПоВидамВычетов.Приоритет)] = РазрешенныйВычетВТекущемПериоде;

					СтрокаРасчета["ИспользуетсяПоНесколькимВидамДохода" + Строка(ВыборкаПоВидамВычетов.Приоритет)] = ВыборкаПоВидамВычетов.ИспользуетсяПоНесколькимВидамДохода;
					
					Если ВыборкаПоВидамВычетов.ИспользуетсяПоНесколькимВидамДохода Тогда
							
						// Зафиксируем результаты по значению текущего физлица расчета
						Если ВычетыРазрешенныеВДанномРасчете.Получить(ВыборкаПоВидамВычетов.ВидВычета) = Неопределено Тогда
							ВычетыРазрешенныеВДанномРасчете.Вставить(ВыборкаПоВидамВычетов.ВидВычета, РазрешенныйВычетВТекущемРасчете);
						Иначе 
							// добавим разрешенные вычеты других документов текущего периода с прочим видом дохода
							ВычетыРазрешенныеВДанномРасчете[ВыборкаПоВидамВычетов.ВидВычета] = ВычетыРазрешенныеВДанномРасчете[ВыборкаПоВидамВычетов.ВидВычета] + РазрешенныйВычетВТекущемРасчете;
						КонецЕсли;
					
					КонецЕсли;
					
				КонецЦикла;
				
				// применим корректировку на объект исчисления (Доходы - Вычеты), 
				// если сумма всех начислений (ВыборкаПоПериодам.ОблагаемыйДоходВЦеломЗаПериод + ВыборкаПоПериодам.НеоблагаемыйДоходВЦеломЗаПериод) не более 25 МРП
				Если ОкончательныйРасчет
					И ЗначениеЗаполнено(ВыборкаПоПериодам.МесяцНалоговогоПериода)
					И ВыборкаПоПериодам.МесяцНалоговогоПериода >= Дата(2019, 1, 1)
					И ВыборкаПоПериодам.СтатусНеРезидента = Перечисления.СтатусыФизическихЛицНалогоплательщиков.Резидент
					И (ВыборкаПоВидамДохода.ОблагаемыйДоходВЦеломЗаПериод + ВыборкаПоВидамДохода.НеоблагаемыйДоходВЦеломЗаПериод) <= ВыборкаПоПериодам.ОграничениеКорректировкиДохода25МРП
					И ВыборкаПоВидамДохода.ВидДохода = Справочники.ВидыДоходов.ДоходыОтРаботодателя
					И ОбъектИсчисленияИПН > 0 Тогда
					
					ПримененнаяКорректировка = Окр(ОбъектИсчисленияИПН * 0.9, 2, РежимОкругления.Окр15как20);
					ОбъектИсчисленияИПН = ОбъектИсчисленияИПН - ПримененнаяКорректировка;
					СтрокаРасчета.ПримененнаяЛьгота = ПримененнаяКорректировка;
					
				КонецЕсли;
				
				СтрокаРасчета.ОбъектИсчисленияИПН 	= ОбъектИсчисленияИПН;
				СтрокаРасчета.ИсчисленныйИПН 		= ОбъектИсчисленияИПН * ВыборкаПоВидамДохода.СтавкаИПН; 

			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	ПоляПоискаВидаДохода = "ФизическоеЛицо, МесяцНалоговогоПериода";
	СтруктураПоискаВидаДохода = Новый Структура(ПоляПоискаВидаДохода);
	
	МесяцНалоговогоПериодаВЦикле = Неопределено;
	ПоляПоискаПоНастройкамВычетов = "МесяцНалоговогоПериода";
	СтруктураПоискаПоНастройкамВычетов = Новый Структура(ПоляПоискаПоНастройкамВычетов);
	
	Для Каждого СтрокаРасчета Из ВспомогательнаяТаблицаРасчета Цикл

		// ускорим работу цикла, если не меняется месяц начисления, нет необходимости искать по таблице НастройкиВидовВычетаПоВидамДоходаМесяца 
		Если МесяцНалоговогоПериодаВЦикле = Неопределено
			ИЛИ МесяцНалоговогоПериодаВЦикле <> СтрокаРасчета.МесяцНалоговогоПериода Тогда
			
			МесяцНалоговогоПериодаВЦикле = СтрокаРасчета.МесяцНалоговогоПериода;
			СтруктураПоискаПоНастройкамВычетов.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
			НастройкиВидовВычетаПоВидамДоходаМесяца = НастройкиВидовВычетаПоВидамДохода.Скопировать(СтруктураПоискаПоНастройкамВычетов, "ВидВычета, ВидДохода");
			
		КонецЕсли;
			
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяцаПоПодразделениям = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		
		СтруктураПоискаВидаДохода.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоискаВидаДохода.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		ДоходыПоВидамДохода = РаспределениеДоходовПоПодразделениям.Скопировать(СтруктураПоискаВидаДохода, "ВидДохода, ОблагаемыйДоход");
		ДоходыПоВидамДохода.Свернуть("ВидДохода", "ОблагаемыйДоход");
		
		РаспределитьНалогиВзносыПоПодразделениямИВидуДохода(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяцаПоПодразделениям, ДоходыПоВидамДохода, "ОбъектИсчисленияИПН,ИсчисленныйИПН,ПримененнаяЛьгота" + РесурсыРасчетаВычетов, НастройкиВидовВычетаПоВидамДоходаМесяца);
		
	КонецЦикла;
	
	Пока ИсчисленныйИПНВыборкаПоФизЛицам.Следующий() Цикл
		ИсчисленныйИПНВыборкаПоПериодам = ИсчисленныйИПНВыборкаПоФизЛицам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "МесяцНалоговогоПериода");
		Пока ИсчисленныйИПНВыборкаПоПериодам.Следующий() Цикл
			ИсчисленныйИПНВыборкаПоПодразделениям = ИсчисленныйИПНВыборкаПоПериодам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Подразделение");
			Пока ИсчисленныйИПНВыборкаПоПодразделениям.Следующий() Цикл
				ИсчисленныйИПНВыборкаПоВидамДохода = ИсчисленныйИПНВыборкаПоПодразделениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидДохода");
				Пока ИсчисленныйИПНВыборкаПоВидамДохода.Следующий() Цикл
					НоваяСтрока = РезультатыРасчетов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ИсчисленныйИПНВыборкаПоВидамДохода);
					ИсчисленныйИПНВыборкаПоВидамВычетов = ИсчисленныйИПНВыборкаПоВидамДохода.Выбрать();
					Пока ИсчисленныйИПНВыборкаПоВидамВычетов.Следующий() Цикл
						Если НЕ ЗначениеЗаполнено(ИсчисленныйИПНВыборкаПоВидамВычетов.ВидВычета) Тогда
							Продолжить;
						КонецЕсли;
						
						НоваяСтрока["ВидВычета" + Строка(ИсчисленныйИПНВыборкаПоВидамВычетов.Приоритет)] = ИсчисленныйИПНВыборкаПоВидамВычетов.ВидВычета;
						
						НоваяСтрока["ПримененныйВычет" + Строка(ИсчисленныйИПНВыборкаПоВидамВычетов.Приоритет)] = - ИсчисленныйИПНВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде;
						НоваяСтрока["РазрешенныйВычет" + Строка(ИсчисленныйИПНВыборкаПоВидамВычетов.Приоритет)] = - ИсчисленныйИПНВыборкаПоВидамВычетов.РазрешенныйВычетВТекущемПериоде;
						
						НоваяСтрока["ПримененныйВычет" + Строка(ИсчисленныйИПНВыборкаПоВидамВычетов.Приоритет) + "ИсчисленныйРанее"] = ИсчисленныйИПНВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде;
						НоваяСтрока["РазрешенныйВычет" + Строка(ИсчисленныйИПНВыборкаПоВидамВычетов.Приоритет) + "ИсчисленныйРанее"] = ИсчисленныйИПНВыборкаПоВидамВычетов.РазрешенныйВычетВТекущемПериоде;
						
						НоваяСтрока["ПримененнаяЛьгота"] = ИсчисленныйИПНВыборкаПоВидамВычетов.ПримененнаяЛьгота;
						
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиБезДохода.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СотрудникиБезДохода.Подразделение КАК Подразделение
		|ИЗ
		|	ВТСотрудникиОрганизацииБезДохода КАК СотрудникиБезДохода";
		
		ТаблицаФизЛиц = Запрос.Выполнить().Выгрузить();
		Для каждого СтрокаТаблицы Из ТаблицаФизЛиц Цикл
			ПараметрыОтбора = Новый Структура("ФизическоеЛицо", СтрокаТаблицы.ФизическоеЛицо);
			МассивСтрок = ВспомогательнаяТаблицаРасчета.НайтиСтроки(ПараметрыОтбора);
			Для каждого Строка Из МассивСтрок Цикл
				НоваяСтрока = РезультатыРасчетов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				НоваяСтрока.Подразделение = СтрокаТаблицы.Подразделение;
			КонецЦикла;
		КонецЦикла;
		УничтожитьВТ.Добавить("ВТСотрудникиОрганизацииБезДохода");
		УничтожитьВТ.Добавить("ВТПериодыПоФизлицамОбъединенная");
		УничтожитьВТ.Добавить("ВТКадровыеДанныеСотрудниковПоПериодамОбъединенная");
		УничтожитьВТ.Добавить("ВТРанееИсчисленныеНалогиВзносыОбъедененная");
	КонецЕсли;
	
	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода" + ИзмеренияРасчетаВычетов,
								"ОблагаемыйДоходВЦеломЗаПериод,   НеоблагаемыйДоходВЦеломЗаПериод, 	 ОбъектИсчисленияИПНВЦеломЗаПериод, ИсчисленныйИПНВЦеломЗаПериод, 
								|ОблагаемыйДоходИсчисленныйРанее, НеоблагаемыйДоходИсчисленныйРанее, ОбъектИПНИсчисленныйРанее, 		ИПНИсчисленныйРанее, 
								|ОблагаемыйДоход, 				  НеоблагаемыйДоход, 				 ОбъектИсчисленияИПН, 				ИсчисленныйИПН, 				ПримененнаяЛьгота" + РесурсыРасчетаВычетов);

	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаИПН);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);

	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	Для Каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		НомерСтроки = НомерСтроки + 1;
		СтрокаТЗ.НомерСтроки = НомерСтроки;
		СтрокаТЗ.ИсчисленныйИПН = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныйИПН, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ИсчисленныеИПН", РезультатыРасчетов.Скопировать());
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаИПН.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ТаблицаИПН.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ТаблицаИПН.ПримененнаяЛьгота КАК ПримененнаяКорректировка
		|ПОМЕСТИТЬ ВТИсчисленныйИПН
		|ИЗ
		|	&ИсчисленныеИПН КАК ТаблицаИПН";
	Запрос.Выполнить();
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьИПНПосле2020(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт

	УничтожитьВТ = Новый Массив;
	
	ВидНалогаВзносаИПН =  Перечисления.ВидыНалоговВзносовОтчислений.ИПН;
	
	// Получаем применение вычета в месяц отсутствия дохода
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(МесяцНачисления, Новый Структура("Организация", Организация));
	ПредоставлятьВычетВМесяцеОтсутствияДохода = Ложь;
	ПрименятьВычетОПВиВОСМСГПХ = Ложь;
	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		ПредоставлятьВычетВМесяцеОтсутствияДохода = УчетнаяПолитикаНУ[0].ПредоставлятьВычетВМесяцеОтсутствияДохода;
		ПрименятьВычетОПВиВОСМСГПХ = УчетнаяПолитикаНУ[0].ПрименятьВычетОПВиВОСМСДляГПХ;
		//И ТипЗнч(Регистратор) = Тип("ДокументСсылка.НачислениеЗарплаты");
	КонецЕсли;
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаИПН);
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленного ИПН
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаИПН, ПредоставлятьВычетВМесяцеОтсутствияДохода);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
    
   	// Статусы физических лиц как налогоплательщиков по периодам
	СоздатьВТСтатусыФизическихЛицКакНалогоплательщиков(МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТСтатусыФизическихЛицКакНалогоплательщиков");
	
	// Таблица ВТДанныеДляРасчетаВычетовИПН
	СоздатьВТДанныеДляРасчетаВычетовИПН(МенеджерВременныхТаблиц, Организация, ПредоставлятьВычетВМесяцеОтсутствияДохода, МесяцНачисления);
	УничтожитьВТ.Добавить("ВТДанныеДляРасчетаВычетовИПН");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст ="ВЫБРАТЬ
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	Доходы.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	Доходы.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ПОМЕСТИТЬ ВТДоходыОбъединенная
		|ИЗ
		|	ВТДоходы КАК Доходы
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТСотрудникиОрганизацииБезДохода.ФизическоеЛицо,
		|	ВТСотрудникиОрганизацииБезДохода.МесяцНалоговогоПериода,
		|	ВТСотрудникиОрганизацииБезДохода.ВидДохода,
		|	ВТСотрудникиОрганизацииБезДохода.ОблагаемыйДоход,
		|	ВТСотрудникиОрганизацииБезДохода.НеоблагаемыйДоход
		|ИЗ
		|	ВТСотрудникиОрганизацииБезДохода КАК ВТСотрудникиОрганизацииБезДохода";
		Запрос.Выполнить();
		УничтожитьВТ.Добавить("ВТДоходыОбъединенная");
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.ВидДохода,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.ОблагаемыйДоход) КАК ОблагаемыйДоход,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.НеоблагаемыйДоход) КАК НеоблагаемыйДоход,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.НалогВзнос) КАК НалогВзнос,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.ПримененнаяЛьгота) КАК ПримененнаяЛьгота,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.ОбъектИсчисления) КАК ОбъектИсчисления
		|ПОМЕСТИТЬ ВТИсчисленныеНалогиВзносы
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ВТИсчисленныеНалогиВзносыПоПодразделениям
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.ВидДохода";
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносы");
	
	// Ставки ИПН
	СоздатьВТСтавкиИПН(Организация, МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТСтавкиИПН");
	
	// Финальный запрос	
	Запрос.Текст = 	
		"ВЫБРАТЬ
		|	НастройкиВычетовПоВидамДохода.МесяцНалоговогоПериода,
		|   НастройкиВычетовПоВидамДохода.ВидВычета,
		|   НастройкиВычетовПоВидамДохода.ВидДохода
		|ИЗ
		|	ВТНастройкиВычетовПоВидамДохода КАК НастройкиВычетовПоВидамДохода
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СтатусыФизическихЛицКакНалогоплательщиков.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Резидент)
		|			ТОГДА ЕСТЬNULL(СтавкиИПН.СтавкаРезиденты, 0)
		|		ИНАЧЕ ЕСТЬNULL(СтавкиИПН.СтавкаНерезиденты, 0)
		|	КОНЕЦ КАК СтавкаИПН,
		|	ЕСТЬNULL(СтатусыФизическихЛицКакНалогоплательщиков.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Резидент)) КАК СтатусНерезидента,
		|	ЕСТЬNULL(РазмерыМРП.РазмерМРПНаНачалоГода, 0) * 25 КАК ОграничениеКорректировкиДохода25МРП,
		|	Доходы.ОблагаемыйДоход КАК ОблагаемыйДоходВЦеломЗаПериод,
		|	Доходы.НеоблагаемыйДоход КАК НеоблагаемыйДоходВЦеломЗаПериод,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ВидВычета, ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ПустаяСсылка)) КАК ВидВычета,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.Приоритет, 0) КАК Приоритет,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ПредоставлениеВычета, ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.ПустаяСсылка)) КАК ПредоставлениеВычета,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ВидВзносов, ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ПустаяСсылка)) КАК ВидВзносов,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ИспользуетсяПоНесколькимВидамДохода, ЛОЖЬ) КАК ИспользуетсяПоНесколькимВидамДохода,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ПределВычета, 0) КАК ПределВычета,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ПериодПредоставления, ЗНАЧЕНИЕ(Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ПустаяСсылка)) КАК ПериодПредоставления,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.РазмерВычета, 0) КАК РазмерВычета,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.СуммовойПределВычета, 0) КАК СуммовойПределВычета,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.РазрешенныйВычетВТекущемПериоде, 0) КАК РазрешенныйВычетВТекущемПериоде,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ПримененныйВычетВТекущемПериоде, 0) КАК ПримененныйВычетВТекущемПериоде,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.РазрешенныйВычетСНачалаГода, 0) КАК РазрешенныйВычетСНачалаГода,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ПримененныйВычетСНачалаГода, 0) КАК ПримененныйВычетСНачалаГода
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиИПН КАК СтавкиИПН
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиИПН.МесяцНалоговогоПериода
		|			И Доходы.ВидДохода = СтавкиИПН.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыМРППоПериодам КАК РазмерыМРП
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыМРП.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизическихЛицКакНалогоплательщиков КАК СтатусыФизическихЛицКакНалогоплательщиков
		|		ПО Доходы.МесяцНалоговогоПериода = СтатусыФизическихЛицКакНалогоплательщиков.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = СтатусыФизическихЛицКакНалогоплательщиков.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеДляРасчетаВычетовИПН КАК ДанныеДляРасчетаВычетовИПН
		|		ПО Доходы.МесяцНалоговогоПериода = ДанныеДляРасчетаВычетовИПН.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ДанныеДляРасчетаВычетовИПН.ФизическоеЛицо
		|			И (ВЫБОР
		|				КОГДА ДанныеДляРасчетаВычетовИПН.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов)
		|					ТОГДА Доходы.ВидДохода = ДанныеДляРасчетаВычетовИПН.ВидДоходаВзносов
		|				КОГДА НЕ ДанныеДляРасчетаВычетовИПН.ВидДоходаВычета ЕСТЬ NULL
		|					ТОГДА Доходы.ВидДохода = ДанныеДляРасчетаВычетовИПН.ВидДоходаВычета
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
		|					ТОГДА ИСТИНА" + ?(ПрименятьВычетОПВиВОСМСГПХ, "
		|				ИНАЧЕ Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
		|						И ((ДанныеДляРасчетаВычетовИПН.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.Стандартный)
		|						И ДанныеДляРасчетаВычетовИПН.ПериодПредоставления = ЗНАЧЕНИЕ(Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода))
		|						ИЛИ ДанныеДляРасчетаВычетовИПН.ВидВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетОПВ)
		|						ИЛИ ДанныеДляРасчетаВычетовИПН.ВидВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетВОСМС))", "
		|				ИНАЧЕ ДанныеДляРасчетаВычетовИПН.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.Стандартный)
		|						И ДанныеДляРасчетаВычетовИПН.ПериодПредоставления = ЗНАЧЕНИЕ(Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода)") + "
		|			КОНЕЦ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	МесяцНалоговогоПериода,
		|	Приоритет
		|ИТОГИ
		|	МАКСИМУМ(СтавкаИПН),
		|	МАКСИМУМ(ОблагаемыйДоходВЦеломЗаПериод),
		|	МАКСИМУМ(НеоблагаемыйДоходВЦеломЗаПериод),
		|	МАКСИМУМ(ОграничениеКорректировкиДохода25МРП),
		|	МАКСИМУМ(СтатусНерезидента)
		|ПО
		|	ФизическоеЛицо,
		|	МесяцНалоговогоПериода,
		|	ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныйИПНПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныйИПНПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныйИПНПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныйИПНПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныйИПНПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныйИПНПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныйИПНПоПодразделениям.ОбъектИсчисления КАК ОбъектИПНВИсчисленныйРанее,
		|	ИсчисленныйИПНПоПодразделениям.НалогВзнос КАК ИПНИсчисленныйРанее,
		|	ИсчисленныйИПНПоПодразделениям.ПримененнаяЛьгота КАК ПримененнаяЛьготаИсчислннаяРанее,
		|	-ИсчисленныйИПНПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныйИПНПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныйИПНПоПодразделениям.НалогВзнос КАК ИсчисленныйИПН,
		|	-ИсчисленныйИПНПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияИПН,
		|	-ИсчисленныйИПНПоПодразделениям.ПримененнаяЛьгота КАК ПримененнаяЛьгота,
		|	ЕСТЬNULL(НакопленныеДанныеПоВычетам.ВидВычета, ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ПустаяСсылка)) КАК ВидВычета,
		|	ЕСТЬNULL(НакопленныеДанныеПоВычетам.ВидВычета.Приоритет, 0) КАК Приоритет,
		|	ЕСТЬNULL(НакопленныеДанныеПоВычетам.РазрешенныйВычетВТекущемПериоде, 0) КАК РазрешенныйВычетВТекущемПериоде,
		|	ЕСТЬNULL(НакопленныеДанныеПоВычетам.ПримененныйВычетВТекущемПериоде, 0) КАК ПримененныйВычетВТекущемПериоде
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныйИПНПоПодразделениям
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНакопленныеДанныеПоВычетам КАК НакопленныеДанныеПоВычетам
		|		ПО ИсчисленныйИПНПоПодразделениям.МесяцНалоговогоПериода = НакопленныеДанныеПоВычетам.МесяцНалоговогоПериода
		|			И ИсчисленныйИПНПоПодразделениям.ФизическоеЛицо = НакопленныеДанныеПоВычетам.ФизическоеЛицо
		|			И ИсчисленныйИПНПоПодразделениям.Подразделение = НакопленныеДанныеПоВычетам.Подразделение
		|			И ИсчисленныйИПНПоПодразделениям.ВидДохода = НакопленныеДанныеПоВычетам.ВидДохода
		|			И (ВЫБОР
		|				КОГДА ИсчисленныйИПНПоПодразделениям.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
		|					ТОГДА ИСТИНА
		|" + ?(ПрименятьВычетОПВиВОСМСГПХ, "
		|				ИНАЧЕ ИсчисленныйИПНПоПодразделениям.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
		|						И ((НакопленныеДанныеПоВычетам.ВидВычета.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.Стандартный)
		|						И НакопленныеДанныеПоВычетам.ВидВычета.ПериодПредоставления = ЗНАЧЕНИЕ(Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода))
		|						ИЛИ НакопленныеДанныеПоВычетам.ВидВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетОПВ)
		|						ИЛИ НакопленныеДанныеПоВычетам.ВидВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетВОСМС))", "
		|				ИНАЧЕ НакопленныеДанныеПоВычетам.ВидВычета.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.Стандартный)
		|						И НакопленныеДанныеПоВычетам.ВидВычета.ПериодПредоставления = ЗНАЧЕНИЕ(Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода)") + "
		|			КОНЕЦ)
		|ГДЕ
		|	(ИсчисленныйИПНПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныйИПНПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныйИПНПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныйИПНПоПодразделениям.НалогВзнос <> 0
		|			ИЛИ НакопленныеДанныеПоВычетам.РазрешенныйВычетВТекущемПериоде <> 0
		|			ИЛИ НакопленныеДанныеПоВычетам.ПримененныйВычетВТекущемПериоде <> 0)
		|
		// учтем ситуации, когда у сотрудника не было в месяце начислений и сумма разрешенного вычета была предоставлена другим документом в месяце
		|" + ?(ПредоставлятьВычетВМесяцеОтсутствияДохода, "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НакопленныеДанныеПоВычетам.МесяцНалоговогоПериода,
		|	НакопленныеДанныеПоВычетам.Подразделение,
		|	НакопленныеДанныеПоВычетам.ФизическоеЛицо,
		|	НакопленныеДанныеПоВычетам.ВидДохода,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	НакопленныеДанныеПоВычетам.ВидВычета,
		|	НакопленныеДанныеПоВычетам.ВидВычета.Приоритет,
		|	НакопленныеДанныеПоВычетам.РазрешенныйВычетВТекущемПериоде,
		|	НакопленныеДанныеПоВычетам.ПримененныйВычетВТекущемПериоде
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям  КАК ИсчисленныйИПНПоПодразделениям
		|		ПРАВОЕ СОЕДИНЕНИЕ ВТНакопленныеДанныеПоВычетам КАК НакопленныеДанныеПоВычетам
		|		ПО ИсчисленныйИПНПоПодразделениям.МесяцНалоговогоПериода = НакопленныеДанныеПоВычетам.МесяцНалоговогоПериода
		|			И ИсчисленныйИПНПоПодразделениям.ФизическоеЛицо = НакопленныеДанныеПоВычетам.ФизическоеЛицо
		|			И ИсчисленныйИПНПоПодразделениям.Подразделение = НакопленныеДанныеПоВычетам.Подразделение
		|			И ИсчисленныйИПНПоПодразделениям.ВидДохода = НакопленныеДанныеПоВычетам.ВидДохода
		|			И (ВЫБОР
		|				КОГДА ИсчисленныйИПНПоПодразделениям.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
		|					ТОГДА ИСТИНА
		|" + ?(ПрименятьВычетОПВиВОСМСГПХ, "
		|				ИНАЧЕ ИсчисленныйИПНПоПодразделениям.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
		|						И ((НакопленныеДанныеПоВычетам.ВидВычета.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.Стандартный)
		|						И НакопленныеДанныеПоВычетам.ВидВычета.ПериодПредоставления = ЗНАЧЕНИЕ(Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода))
		|						ИЛИ НакопленныеДанныеПоВычетам.ВидВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетОПВ)
		|						ИЛИ НакопленныеДанныеПоВычетам.ВидВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетВОСМС))", "
		|				ИНАЧЕ НакопленныеДанныеПоВычетам.ВидВычета.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.Стандартный)
		|						И НакопленныеДанныеПоВычетам.ВидВычета.ПериодПредоставления = ЗНАЧЕНИЕ(Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода)") + "
		|			КОНЕЦ)
		|ГДЕ
		|	(ИсчисленныйИПНПоПодразделениям.ФизическоеЛицо ЕСТЬ NULL
		|			И (НакопленныеДанныеПоВычетам.РазрешенныйВычетВТекущемПериоде <> 0
		|			ИЛИ НакопленныеДанныеПоВычетам.ПримененныйВычетВТекущемПериоде <> 0))", "") + "
		|ИТОГИ
		|	МАКСИМУМ(ОблагаемыйДоходИсчисленныйРанее),
		|	МАКСИМУМ(НеоблагаемыйДоходИсчисленныйРанее),
		|	МАКСИМУМ(ОбъектИПНВИсчисленныйРанее),
		|	МАКСИМУМ(ИПНИсчисленныйРанее),
		|	МАКСИМУМ(ОблагаемыйДоход),
		|	МАКСИМУМ(НеоблагаемыйДоход),
		|	МАКСИМУМ(ИсчисленныйИПН),
		|	МАКСИМУМ(ОбъектИсчисленияИПН)
		|ПО
		|	ФизическоеЛицо,
		|	МесяцНалоговогоПериода,
		|	Подразделение,
		|	ВидДохода";
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВТДоходы КАК Доходы", "ВТДоходыОбъединенная КАК Доходы");
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();
	УничтожитьВТ.Добавить("ВТНакопленныеДанныеПоВычетам");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныйИПНВыборкаПоФизЛицам = Результат[ВсегоРезультатов - 1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ФизическоеЛицо");
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	ВыборкаПоФизЛицам = Результат[ВсегоРезультатов - 3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ФизическоеЛицо");
	НастройкиВидовВычетаПоВидамДохода = Результат[ВсегоРезультатов - 4].Выгрузить();
	НастройкиВидовВычетаПоВидамДохода.Индексы.Добавить("МесяцНалоговогоПериода");
	НастройкиВидовВычетаПоВидамДохода.Индексы.Добавить("ВидВычета");

	СтруктураДанных = ПодготовитьСлужебныеДанныеДляРасчетаИПН();
	ВспомогательнаяТаблицаРасчета = СтруктураДанных.ВспомогательнаяТаблицаРасчета;
	РезультатыРасчетов = СтруктураДанных.РезультатыРасчетов;
	ИзмеренияРасчетаВычетов = СтруктураДанных.ИзмеренияРасчетаВычетов;
	РесурсыРасчетаВычетов = СтруктураДанных.РесурсыРасчетаВычетов;
	
	ВычетыПримененныеВДанномРасчете = Новый Соответствие;
	ВычетыРазрешенныеВДанномРасчете = Новый Соответствие;
	Пока ВыборкаПоФизЛицам.Следующий() Цикл
		ВыборкаПоПериодам = ВыборкаПоФизЛицам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "МесяцНалоговогоПериода");
		Пока ВыборкаПоПериодам.Следующий() Цикл
			ВычетыПримененныеВДанномРасчете.Очистить();
			ВычетыРазрешенныеВДанномРасчете.Очистить();
			ВыборкаПоВидамДохода = ВыборкаПоПериодам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидДохода");
			Пока ВыборкаПоВидамДохода.Следующий() Цикл
				
				СтрокаРасчета = ВспомогательнаяТаблицаРасчета.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРасчета, ВыборкаПоВидамДохода, "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода");
				
				ОбъектИсчисленияИПН = ВыборкаПоВидамДохода.ОблагаемыйДоходВЦеломЗаПериод;
				ВыборкаПоВидамВычетов = ВыборкаПоВидамДохода.Выбрать();
				РазрешенныйВычетВТекущемПериоде = 0;
				ПримененныйВычетВТекущемПериоде = 0;
				// ВычетОПВ, ВычетВОСМС применяем для каждого вида дохода в отдельности по исчисленной сумме в рамках вида дохода 
				Если НЕ ВычетыПримененныеВДанномРасчете.Получить(Справочники.ВидыВычетовИПН.ВычетОПВ) = Неопределено Тогда
					ВычетыПримененныеВДанномРасчете.Удалить(Справочники.ВидыВычетовИПН.ВычетОПВ);
				КонецЕсли;
				Если НЕ ВычетыПримененныеВДанномРасчете.Получить(Справочники.ВидыВычетовИПН.ВычетВОСМС) = Неопределено Тогда
					ВычетыПримененныеВДанномРасчете.Удалить(Справочники.ВидыВычетовИПН.ВычетВОСМС);
				КонецЕсли;
				Пока ВыборкаПоВидамВычетов.Следующий() Цикл
					
					Если НЕ ЗначениеЗаполнено(ВыборкаПоВидамВычетов.ВидВычета) Тогда
						// Незачем считать, если вычеты не найдены
						Продолжить;
					КонецЕсли;
					
					Если ВыборкаПоВидамВычетов.ИспользуетсяПоНесколькимВидамДохода Тогда
						
						СтруктураПоиска = Новый Структура("МесяцНалоговогоПериода, ВидВычета, ВидДохода");
						ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаПоВидамВычетов);
						
						Если НастройкиВидовВычетаПоВидамДохода.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
							// Незачем считать, если вычеты не найдены
							Продолжить;
						КонецЕсли;
						
					КонецЕсли;
					
					// если вид вычета используется по нескольким видам дохода, найдем какие суммы были использованы по другим видам дохода у данного вычета
					Если ВыборкаПоВидамВычетов.ИспользуетсяПоНесколькимВидамДохода Тогда
						
						РазрешенныйВычетПрочихВидовДоходаТекущегоРасчета = ?(ВычетыРазрешенныеВДанномРасчете.Получить(ВыборкаПоВидамВычетов.ВидВычета) <> Неопределено, ВычетыРазрешенныеВДанномРасчете.Получить(ВыборкаПоВидамВычетов.ВидВычета), 0);
						
					Иначе
						
						РазрешенныйВычетПрочихВидовДоходаТекущегоРасчета = 0;
						
					КонецЕсли;

					// Соберем остатки за прошлые периоды в пределах года
					РазрешенныйВычетЗаПрошлыеМесяцы = ВыборкаПоВидамВычетов.РазрешенныйВычетСНачалаГода - ВыборкаПоВидамВычетов.РазрешенныйВычетВТекущемПериоде;
					ПримененныйВычетЗаПрошлыеМесяцы = ВыборкаПоВидамВычетов.ПримененныйВычетСНачалаГода - ВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде;
					ОстатокВычетаЗаПрошлыеМесяцы = РазрешенныйВычетЗаПрошлыеМесяцы - ПримененныйВычетЗаПрошлыеМесяцы;

					// Получим значения в текущем периоде
					Если ВыборкаПоВидамВычетов.ПредоставлениеВычета = Перечисления.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов Тогда
						РазрешенныйВычетВТекущемПериоде = ВыборкаПоВидамВычетов.РазмерВычета;
					ИначеЕсли ВыборкаПоВидамВычетов.ПредоставлениеВычета = Перечисления.ВидыПредоставленияВычетов.Стандартный 
						ИЛИ ВыборкаПоВидамВычетов.ПредоставлениеВычета = Перечисления.ВидыПредоставленияВычетов.ПоПериодическимПлатежам Тогда
						Если ВыборкаПоВидамВычетов.ПределВычета > 0 Тогда
							Если ВыборкаПоВидамВычетов.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца Тогда
								РазрешенныйВычетВТекущемПериоде = Мин(ВыборкаПоВидамВычетов.СуммовойПределВычета, ВыборкаПоВидамВычетов.РазмерВычета);
							ИначеЕсли ВыборкаПоВидамВычетов.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода Тогда
								РазрешенныйВычетВТекущемПериоде = Мин(ВыборкаПоВидамВычетов.СуммовойПределВычета - РазрешенныйВычетЗаПрошлыеМесяцы, ВыборкаПоВидамВычетов.РазмерВычета);
							Иначе 
								РазрешенныйВычетВТекущемПериоде = 0;
							КонецЕсли;
						Иначе 
							РазрешенныйВычетВТекущемПериоде = ВыборкаПоВидамВычетов.РазмерВычета;
						КонецЕсли;
					Иначе
						РазрешенныйВычетВТекущемПериоде = 0;
					КонецЕсли;
					
					ПримененныйВычетВТекущемПериоде = Мин(ОбъектИсчисленияИПН, ОстатокВычетаЗаПрошлыеМесяцы + РазрешенныйВычетВТекущемПериоде 
										- ?(ВычетыПримененныеВДанномРасчете.Получить(ВыборкаПоВидамВычетов.ВидВычета) <> Неопределено, ВычетыПримененныеВДанномРасчете.Получить(ВыборкаПоВидамВычетов.ВидВычета), 0));

					// Скорректируем остаток облагаемого дохода
					ОбъектИсчисленияИПН = Макс(0, ОбъектИсчисленияИПН - ПримененныйВычетВТекущемПериоде);

					// Получим значения в текущем расчете
					РазрешенныйВычетВТекущемРасчете = РазрешенныйВычетВТекущемПериоде - ВыборкаПоВидамВычетов.РазрешенныйВычетВТекущемПериоде;
					ПримененныйВычетВТекущемРасчете = ПримененныйВычетВТекущемПериоде - ВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде;
					
					// Зафиксируем результаты по значению текущего физлица расчета
					Если ВычетыПримененныеВДанномРасчете.Получить(ВыборкаПоВидамВычетов.ВидВычета) = Неопределено Тогда
						ВычетыПримененныеВДанномРасчете.Вставить(ВыборкаПоВидамВычетов.ВидВычета, ПримененныйВычетВТекущемРасчете + ВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде);
					Иначе 
						ВычетыПримененныеВДанномРасчете[ВыборкаПоВидамВычетов.ВидВычета] = ВычетыПримененныеВДанномРасчете[ВыборкаПоВидамВычетов.ВидВычета] + ПримененныйВычетВТекущемРасчете + ВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде;
					КонецЕсли;
					
					СтрокаРасчета["ВидВычета" + Строка(ВыборкаПоВидамВычетов.Приоритет)] = ВыборкаПоВидамВычетов.ВидВычета;
					СтрокаРасчета["ПримененныйВычет" + Строка(ВыборкаПоВидамВычетов.Приоритет)] = ПримененныйВычетВТекущемПериоде;
					СтрокаРасчета["РазрешенныйВычет" + Строка(ВыборкаПоВидамВычетов.Приоритет)] = РазрешенныйВычетВТекущемПериоде;

					СтрокаРасчета["ИспользуетсяПоНесколькимВидамДохода" + Строка(ВыборкаПоВидамВычетов.Приоритет)] = ВыборкаПоВидамВычетов.ИспользуетсяПоНесколькимВидамДохода;
					
					Если ВыборкаПоВидамВычетов.ИспользуетсяПоНесколькимВидамДохода Тогда
							
						// Зафиксируем результаты по значению текущего физлица расчета
						Если ВычетыРазрешенныеВДанномРасчете.Получить(ВыборкаПоВидамВычетов.ВидВычета) = Неопределено Тогда
							ВычетыРазрешенныеВДанномРасчете.Вставить(ВыборкаПоВидамВычетов.ВидВычета, РазрешенныйВычетВТекущемРасчете);
						Иначе 
							// добавим разрешенные вычеты других документов текущего периода с прочим видом дохода
							ВычетыРазрешенныеВДанномРасчете[ВыборкаПоВидамВычетов.ВидВычета] = ВычетыРазрешенныеВДанномРасчете[ВыборкаПоВидамВычетов.ВидВычета] + РазрешенныйВычетВТекущемРасчете;
						КонецЕсли;
					
					КонецЕсли;
					
				КонецЦикла;
				
				// применим корректировку на объект исчисления (Доходы - Вычеты), 
				// если сумма всех начислений (ВыборкаПоПериодам.ОблагаемыйДоходВЦеломЗаПериод + ВыборкаПоПериодам.НеоблагаемыйДоходВЦеломЗаПериод) не более 25 МРП
				Если ОкончательныйРасчет
					И ЗначениеЗаполнено(ВыборкаПоПериодам.МесяцНалоговогоПериода)
					И ВыборкаПоПериодам.МесяцНалоговогоПериода >= Дата(2019, 1, 1)
					И ВыборкаПоПериодам.СтатусНеРезидента = Перечисления.СтатусыФизическихЛицНалогоплательщиков.Резидент
					И (ВыборкаПоВидамДохода.ОблагаемыйДоходВЦеломЗаПериод + ВыборкаПоВидамДохода.НеоблагаемыйДоходВЦеломЗаПериод) <= ВыборкаПоПериодам.ОграничениеКорректировкиДохода25МРП
					И ВыборкаПоВидамДохода.ВидДохода = Справочники.ВидыДоходов.ДоходыОтРаботодателя
					И ОбъектИсчисленияИПН > 0 Тогда
					
					ПримененнаяКорректировка = Окр(ОбъектИсчисленияИПН * 0.9, 2, РежимОкругления.Окр15как20);
					ОбъектИсчисленияИПН = ОбъектИсчисленияИПН - ПримененнаяКорректировка;
					СтрокаРасчета.ПримененнаяЛьгота = ПримененнаяКорректировка;
					
				КонецЕсли;
				
				СтрокаРасчета.ОбъектИсчисленияИПН 	= ОбъектИсчисленияИПН;
				СтрокаРасчета.ИсчисленныйИПН 		= ОбъектИсчисленияИПН * ВыборкаПоВидамДохода.СтавкаИПН; 

			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	ПоляПоискаВидаДохода = "ФизическоеЛицо, МесяцНалоговогоПериода";
	СтруктураПоискаВидаДохода = Новый Структура(ПоляПоискаВидаДохода);
	
	МесяцНалоговогоПериодаВЦикле = Неопределено;
	ПоляПоискаПоНастройкамВычетов = "МесяцНалоговогоПериода";
	СтруктураПоискаПоНастройкамВычетов = Новый Структура(ПоляПоискаПоНастройкамВычетов);

	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаИПН);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);
	
	// для корректного округления после распределения при достижении суммы максимального предела необходима точность 0
	ТочностьОкругления = ОписаниеСпособаОкругления.Точность - Цел(ОписаниеСпособаОкругления.Точность);
	
	Если ТочностьОкругления = 0 Тогда
		ТочностьРаспределения = 0;
	ИначеЕсли ТочностьОкругления <= 0.1 Тогда
		ТочностьРаспределения = 2;
	Иначе
		ТочностьРаспределения = 1;
	КонецЕсли;
			
	Для Каждого СтрокаРасчета Из ВспомогательнаяТаблицаРасчета Цикл

		// ускорим работу цикла, если не меняется месяц начисления, нет необходимости искать по таблице НастройкиВидовВычетаПоВидамДоходаМесяца 
		Если МесяцНалоговогоПериодаВЦикле = Неопределено
			ИЛИ МесяцНалоговогоПериодаВЦикле <> СтрокаРасчета.МесяцНалоговогоПериода Тогда
			
			МесяцНалоговогоПериодаВЦикле = СтрокаРасчета.МесяцНалоговогоПериода;
			СтруктураПоискаПоНастройкамВычетов.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
			НастройкиВидовВычетаПоВидамДоходаМесяца = НастройкиВидовВычетаПоВидамДохода.Скопировать(СтруктураПоискаПоНастройкамВычетов, "ВидВычета, ВидДохода");
			
		КонецЕсли;
			
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяцаПоПодразделениям = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		
		СтруктураПоискаВидаДохода.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоискаВидаДохода.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		ДоходыПоВидамДохода = РаспределениеДоходовПоПодразделениям.Скопировать(СтруктураПоискаВидаДохода, "ВидДохода, ОблагаемыйДоход");
		ДоходыПоВидамДохода.Свернуть("ВидДохода", "ОблагаемыйДоход");
		
		РаспределитьНалогиВзносыПоПодразделениямИВидуДохода(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяцаПоПодразделениям, ДоходыПоВидамДохода, "ОбъектИсчисленияИПН,ИсчисленныйИПН,ПримененнаяЛьгота" + РесурсыРасчетаВычетов, НастройкиВидовВычетаПоВидамДоходаМесяца, ТочностьРаспределения);
		
	КонецЦикла;
	
	Пока ИсчисленныйИПНВыборкаПоФизЛицам.Следующий() Цикл
		ИсчисленныйИПНВыборкаПоПериодам = ИсчисленныйИПНВыборкаПоФизЛицам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "МесяцНалоговогоПериода");
		Пока ИсчисленныйИПНВыборкаПоПериодам.Следующий() Цикл
			ИсчисленныйИПНВыборкаПоПодразделениям = ИсчисленныйИПНВыборкаПоПериодам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Подразделение");
			Пока ИсчисленныйИПНВыборкаПоПодразделениям.Следующий() Цикл
				ИсчисленныйИПНВыборкаПоВидамДохода = ИсчисленныйИПНВыборкаПоПодразделениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидДохода");
				Пока ИсчисленныйИПНВыборкаПоВидамДохода.Следующий() Цикл
					НоваяСтрока = РезультатыРасчетов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ИсчисленныйИПНВыборкаПоВидамДохода);
					ИсчисленныйИПНВыборкаПоВидамВычетов = ИсчисленныйИПНВыборкаПоВидамДохода.Выбрать();
					Пока ИсчисленныйИПНВыборкаПоВидамВычетов.Следующий() Цикл
						Если НЕ ЗначениеЗаполнено(ИсчисленныйИПНВыборкаПоВидамВычетов.ВидВычета) Тогда
							Продолжить;
						КонецЕсли;
						
						ЭтоИсправлениеСтандартногоВычета = Ложь;
						
						Если ИсчисленныйИПНВыборкаПоВидамДохода.МесяцНалоговогоПериода < МесяцНачисления
							И (ИсчисленныйИПНВыборкаПоВидамВычетов.ВидВычета = Справочники.ВидыВычетовИПН.Стандартный1МЗП
								ИЛИ ИсчисленныйИПНВыборкаПоВидамВычетов.ВидВычета = Справочники.ВидыВычетовИПН.Стандартный75МЗПИнвалиды
								ИЛИ ИсчисленныйИПНВыборкаПоВидамВычетов.ВидВычета = Справочники.ВидыВычетовИПН.Стандартный75МЗПРодители)
								И НЕ (ИсчисленныйИПНВыборкаПоВидамВычетов.ОблагаемыйДоход + ИсчисленныйИПНВыборкаПоВидамВычетов.ОблагаемыйДоходИсчисленныйРанее = 0) Тогда
							
							ЭтоИсправлениеСтандартногоВычета = Истина;
							
						КонецЕсли;	
						
						НоваяСтрока["ВидВычета" + Строка(ИсчисленныйИПНВыборкаПоВидамВычетов.Приоритет)] = ИсчисленныйИПНВыборкаПоВидамВычетов.ВидВычета;
						
						НоваяСтрока["ПримененныйВычет" + Строка(ИсчисленныйИПНВыборкаПоВидамВычетов.Приоритет)] = - ИсчисленныйИПНВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде;
						НоваяСтрока["РазрешенныйВычет" + Строка(ИсчисленныйИПНВыборкаПоВидамВычетов.Приоритет)] = ?(ЭтоИсправлениеСтандартногоВычета, 0, - ИсчисленныйИПНВыборкаПоВидамВычетов.РазрешенныйВычетВТекущемПериоде);
						
						НоваяСтрока["ПримененныйВычет" + Строка(ИсчисленныйИПНВыборкаПоВидамВычетов.Приоритет) + "ИсчисленныйРанее"] = ИсчисленныйИПНВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде;
						НоваяСтрока["РазрешенныйВычет" + Строка(ИсчисленныйИПНВыборкаПоВидамВычетов.Приоритет) + "ИсчисленныйРанее"] = ИсчисленныйИПНВыборкаПоВидамВычетов.РазрешенныйВычетВТекущемПериоде;
						
						НоваяСтрока["ПримененнаяЛьгота"] = ИсчисленныйИПНВыборкаПоВидамВычетов.ПримененнаяЛьгота;
						
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиБезДохода.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СотрудникиБезДохода.Подразделение КАК Подразделение
		|ИЗ
		|	ВТСотрудникиОрганизацииБезДохода КАК СотрудникиБезДохода";
		
		ТаблицаФизЛиц = Запрос.Выполнить().Выгрузить();
		Для каждого СтрокаТаблицы Из ТаблицаФизЛиц Цикл
			ПараметрыОтбора = Новый Структура("ФизическоеЛицо", СтрокаТаблицы.ФизическоеЛицо);
			МассивСтрок = ВспомогательнаяТаблицаРасчета.НайтиСтроки(ПараметрыОтбора);
			Для каждого Строка Из МассивСтрок Цикл
				НоваяСтрока = РезультатыРасчетов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				НоваяСтрока.Подразделение = СтрокаТаблицы.Подразделение;
			КонецЦикла;
		КонецЦикла;
		УничтожитьВТ.Добавить("ВТСотрудникиОрганизацииБезДохода");
		УничтожитьВТ.Добавить("ВТПериодыПоФизлицамОбъединенная");
		УничтожитьВТ.Добавить("ВТКадровыеДанныеСотрудниковПоПериодамОбъединенная");
		УничтожитьВТ.Добавить("ВТРанееИсчисленныеНалогиВзносыОбъедененная");
	КонецЕсли;
	
	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода" + ИзмеренияРасчетаВычетов,
								"ОблагаемыйДоходВЦеломЗаПериод,   НеоблагаемыйДоходВЦеломЗаПериод, 	 ОбъектИсчисленияИПНВЦеломЗаПериод, ИсчисленныйИПНВЦеломЗаПериод, 
								|ОблагаемыйДоходИсчисленныйРанее, НеоблагаемыйДоходИсчисленныйРанее, ОбъектИПНИсчисленныйРанее, 		ИПНИсчисленныйРанее, 
								|ОблагаемыйДоход, 				  НеоблагаемыйДоход, 				 ОбъектИсчисленияИПН, 				ИсчисленныйИПН, 				ПримененнаяЛьгота" + РесурсыРасчетаВычетов);

	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	
	Для Каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		
		НомерСтроки = НомерСтроки + 1;
		СтрокаТЗ.НомерСтроки = НомерСтроки;
		
		// спишем возникшую погрешность округления при межрасчете или исправлении или перераспределении сумм по подразделениям
		Если СтрокаТЗ.ОблагаемыйДоход = 0
			И НЕ ОписаниеСпособаОкругления.ПравилоОкругления = Перечисления.ПравилаОкругленияПриРасчетеЗарплаты.Авто
			И (СтрокаТЗ.ИсчисленныйИПН < 1 И СтрокаТЗ.ИсчисленныйИПН > 0
				ИЛИ СтрокаТЗ.ИсчисленныйИПН > -1 И СтрокаТЗ.ИсчисленныйИПН < 0) Тогда
				
			СтрокаТЗ.ИсчисленныйИПН = 0;
			
		// исчисление взносов производятся в тенге с учетом округления тиын
		Иначе
			
			СтрокаТЗ.ИсчисленныйИПН = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныйИПН, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
			
		КонецЕсли;

	КонецЦикла;
	
	Запрос.УстановитьПараметр("ИсчисленныеИПН", РезультатыРасчетов.Скопировать());
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаИПН.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ТаблицаИПН.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ТаблицаИПН.ПримененнаяЛьгота КАК ПримененнаяКорректировка
		|ПОМЕСТИТЬ ВТИсчисленныйИПН
		|ИЗ
		|	&ИсчисленныеИПН КАК ТаблицаИПН";
	Запрос.Выполнить();
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьИПНПосле2021(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт

	УничтожитьВТ = Новый Массив;
	
	ВидНалогаВзносаИПН =  Перечисления.ВидыНалоговВзносовОтчислений.ИПН;
	
	// Получаем применение вычета в месяц отсутствия дохода
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(МесяцНачисления, Новый Структура("Организация", Организация));
	ПредоставлятьВычетВМесяцеОтсутствияДохода = Ложь;
	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		ПредоставлятьВычетВМесяцеОтсутствияДохода = УчетнаяПолитикаНУ[0].ПредоставлятьВычетВМесяцеОтсутствияДохода;
		//И ТипЗнч(Регистратор) = Тип("ДокументСсылка.НачислениеЗарплаты");
	КонецЕсли;
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаИПН);
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленного ИПН
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаИПН, ПредоставлятьВычетВМесяцеОтсутствияДохода);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	// Статусы физических лиц как налогоплательщиков по периодам
	СоздатьВТСтатусыФизическихЛицКакНалогоплательщиков(МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТСтатусыФизическихЛицКакНалогоплательщиков");

	// Таблица ВТДанныеДляРасчетаВычетовИПН
	СоздатьВТДанныеДляРасчетаВычетовИПН(МенеджерВременныхТаблиц, Организация, ПредоставлятьВычетВМесяцеОтсутствияДохода, МесяцНачисления);
	УничтожитьВТ.Добавить("ВТДанныеДляРасчетаВычетовИПН");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст ="ВЫБРАТЬ
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	Доходы.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	Доходы.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ПОМЕСТИТЬ ВТДоходыОбъединенная
		|ИЗ
		|	ВТДоходы КАК Доходы
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТСотрудникиОрганизацииБезДохода.ФизическоеЛицо,
		|	ВТСотрудникиОрганизацииБезДохода.МесяцНалоговогоПериода,
		|	ВТСотрудникиОрганизацииБезДохода.ВидДохода,
		|	ВТСотрудникиОрганизацииБезДохода.ОблагаемыйДоход,
		|	ВТСотрудникиОрганизацииБезДохода.НеоблагаемыйДоход
		|ИЗ
		|	ВТСотрудникиОрганизацииБезДохода КАК ВТСотрудникиОрганизацииБезДохода";
		Запрос.Выполнить();
		УничтожитьВТ.Добавить("ВТДоходыОбъединенная");
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.ВидДохода,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.ОблагаемыйДоход) КАК ОблагаемыйДоход,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.НеоблагаемыйДоход) КАК НеоблагаемыйДоход,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.НалогВзнос) КАК НалогВзнос,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.ПримененнаяЛьгота) КАК ПримененнаяЛьгота,
		|	СУММА(ВТИсчисленныеНалогиВзносыПоПодразделениям.ОбъектИсчисления) КАК ОбъектИсчисления
		|ПОМЕСТИТЬ ВТИсчисленныеНалогиВзносы
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ВТИсчисленныеНалогиВзносыПоПодразделениям
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям.ВидДохода";
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносы");
	
	// Ставки ИПН
	СоздатьВТСтавкиИПН(Организация, МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТСтавкиИПН");
	
	// Финальный запрос	
	Запрос.Текст = 	
		"ВЫБРАТЬ
		|	НастройкиВычетовПоВидамДохода.МесяцНалоговогоПериода,
		|   НастройкиВычетовПоВидамДохода.ВидВычета,
		|   НастройкиВычетовПоВидамДохода.ВидДохода
		|ИЗ
		|	ВТНастройкиВычетовПоВидамДохода КАК НастройкиВычетовПоВидамДохода
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СтатусыФизическихЛицКакНалогоплательщиков.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Резидент)
		|			ТОГДА ЕСТЬNULL(СтавкиИПН.СтавкаРезиденты, 0)
		|		ИНАЧЕ ЕСТЬNULL(СтавкиИПН.СтавкаНерезиденты, 0)
		|	КОНЕЦ КАК СтавкаИПН,
		|	ЕСТЬNULL(СтатусыФизическихЛицКакНалогоплательщиков.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Резидент)) КАК СтатусНерезидента,
		|	ЕСТЬNULL(РазмерыМРП.РазмерМРПНаНачалоГода, 0) * 25 КАК ОграничениеКорректировкиДохода25МРП,
		|	Доходы.ОблагаемыйДоход КАК ОблагаемыйДоходВЦеломЗаПериод,
		|	Доходы.НеоблагаемыйДоход КАК НеоблагаемыйДоходВЦеломЗаПериод,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ВидВычета, ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ПустаяСсылка)) КАК ВидВычета,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.Приоритет, 0) КАК Приоритет,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ПредоставлениеВычета, ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.ПустаяСсылка)) КАК ПредоставлениеВычета,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ВидВзносов, ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ПустаяСсылка)) КАК ВидВзносов,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ИспользуетсяПоНесколькимВидамДохода, ЛОЖЬ) КАК ИспользуетсяПоНесколькимВидамДохода,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ПределВычета, 0) КАК ПределВычета,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ПериодПредоставления, ЗНАЧЕНИЕ(Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ПустаяСсылка)) КАК ПериодПредоставления,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.РазмерВычета, 0) КАК РазмерВычета,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.СуммовойПределВычета, 0) КАК СуммовойПределВычета,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.РазрешенныйВычетВТекущемПериоде, 0) КАК РазрешенныйВычетВТекущемПериоде,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ПримененныйВычетВТекущемПериоде, 0) КАК ПримененныйВычетВТекущемПериоде,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.РазрешенныйВычетСНачалаГода, 0) КАК РазрешенныйВычетСНачалаГода,
		|	ЕСТЬNULL(ДанныеДляРасчетаВычетовИПН.ПримененныйВычетСНачалаГода, 0) КАК ПримененныйВычетСНачалаГода
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиИПН КАК СтавкиИПН
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиИПН.МесяцНалоговогоПериода
		|			И Доходы.ВидДохода = СтавкиИПН.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыМРППоПериодам КАК РазмерыМРП
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыМРП.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизическихЛицКакНалогоплательщиков КАК СтатусыФизическихЛицКакНалогоплательщиков
		|		ПО Доходы.МесяцНалоговогоПериода = СтатусыФизическихЛицКакНалогоплательщиков.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = СтатусыФизическихЛицКакНалогоплательщиков.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеДляРасчетаВычетовИПН КАК ДанныеДляРасчетаВычетовИПН
		|		ПО Доходы.МесяцНалоговогоПериода = ДанныеДляРасчетаВычетовИПН.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ДанныеДляРасчетаВычетовИПН.ФизическоеЛицо
		|			И (ВЫБОР
		|				КОГДА ДанныеДляРасчетаВычетовИПН.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов)
		|					ТОГДА Доходы.ВидДохода = ДанныеДляРасчетаВычетовИПН.ВидДоходаВзносов
		|				КОГДА НЕ ДанныеДляРасчетаВычетовИПН.ВидДоходаВычета ЕСТЬ NULL
		|					ТОГДА Доходы.ВидДохода = ДанныеДляРасчетаВычетовИПН.ВидДоходаВычета
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
		|						И ((ДанныеДляРасчетаВычетовИПН.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.Стандартный)
		|						И ДанныеДляРасчетаВычетовИПН.ПериодПредоставления = ЗНАЧЕНИЕ(Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода))
		|						ИЛИ ДанныеДляРасчетаВычетовИПН.ВидВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетОПВ)
		|						ИЛИ ДанныеДляРасчетаВычетовИПН.ВидВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетВОСМС))
		|			КОНЕЦ)
		|ГДЕ
		|	НЕ Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	МесяцНалоговогоПериода,
		|	Приоритет
		|ИТОГИ
		|	МАКСИМУМ(СтавкаИПН),
		|	МАКСИМУМ(ОблагаемыйДоходВЦеломЗаПериод),
		|	МАКСИМУМ(НеоблагаемыйДоходВЦеломЗаПериод),
		|	МАКСИМУМ(ОграничениеКорректировкиДохода25МРП),
		|	МАКСИМУМ(СтатусНерезидента)
		|ПО
		|	ФизическоеЛицо,
		|	МесяцНалоговогоПериода,
		|	ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|	И НЕ ДоходыПоПодразделениям.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныйИПНПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныйИПНПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныйИПНПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныйИПНПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныйИПНПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныйИПНПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныйИПНПоПодразделениям.ОбъектИсчисления КАК ОбъектИПНВИсчисленныйРанее,
		|	ИсчисленныйИПНПоПодразделениям.НалогВзнос КАК ИПНИсчисленныйРанее,
		|	ИсчисленныйИПНПоПодразделениям.ПримененнаяЛьгота КАК ПримененнаяЛьготаИсчислннаяРанее,
		|	-ИсчисленныйИПНПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныйИПНПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныйИПНПоПодразделениям.НалогВзнос КАК ИсчисленныйИПН,
		|	-ИсчисленныйИПНПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияИПН,
		|	-ИсчисленныйИПНПоПодразделениям.ПримененнаяЛьгота КАК ПримененнаяЛьгота,
		|	ЕСТЬNULL(НакопленныеДанныеПоВычетам.ВидВычета, ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ПустаяСсылка)) КАК ВидВычета,
		|	ЕСТЬNULL(НакопленныеДанныеПоВычетам.ВидВычета.Приоритет, 0) КАК Приоритет,
		|	ЕСТЬNULL(НакопленныеДанныеПоВычетам.РазрешенныйВычетВТекущемПериоде, 0) КАК РазрешенныйВычетВТекущемПериоде,
		|	ЕСТЬNULL(НакопленныеДанныеПоВычетам.ПримененныйВычетВТекущемПериоде, 0) КАК ПримененныйВычетВТекущемПериоде
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныйИПНПоПодразделениям
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНакопленныеДанныеПоВычетам КАК НакопленныеДанныеПоВычетам
		|		ПО ИсчисленныйИПНПоПодразделениям.МесяцНалоговогоПериода = НакопленныеДанныеПоВычетам.МесяцНалоговогоПериода
		|			И ИсчисленныйИПНПоПодразделениям.ФизическоеЛицо = НакопленныеДанныеПоВычетам.ФизическоеЛицо
		|			И ИсчисленныйИПНПоПодразделениям.Подразделение = НакопленныеДанныеПоВычетам.Подразделение
		|			И ИсчисленныйИПНПоПодразделениям.ВидДохода = НакопленныеДанныеПоВычетам.ВидДохода
		|			И (ВЫБОР
		|				КОГДА ИсчисленныйИПНПоПодразделениям.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ИсчисленныйИПНПоПодразделениям.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
		|						И ((НакопленныеДанныеПоВычетам.ВидВычета.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.Стандартный)
		|						И НакопленныеДанныеПоВычетам.ВидВычета.ПериодПредоставления = ЗНАЧЕНИЕ(Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода))
		|						ИЛИ НакопленныеДанныеПоВычетам.ВидВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетОПВ)
		|						ИЛИ НакопленныеДанныеПоВычетам.ВидВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетВОСМС))
		|			КОНЕЦ)
		|ГДЕ
		|	(ИсчисленныйИПНПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныйИПНПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныйИПНПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныйИПНПоПодразделениям.НалогВзнос <> 0
		|			ИЛИ НакопленныеДанныеПоВычетам.РазрешенныйВычетВТекущемПериоде <> 0
		|			ИЛИ НакопленныеДанныеПоВычетам.ПримененныйВычетВТекущемПериоде <> 0)
		|	И НЕ ИсчисленныйИПНПоПодразделениям.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства)
		|
		// учтем ситуации, когда у сотрудника не было в месяце начислений и сумма разрешенного вычета была предоставлена другим документом в месяце
		|" + ?(ПредоставлятьВычетВМесяцеОтсутствияДохода, "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НакопленныеДанныеПоВычетам.МесяцНалоговогоПериода,
		|	НакопленныеДанныеПоВычетам.Подразделение,
		|	НакопленныеДанныеПоВычетам.ФизическоеЛицо,
		|	НакопленныеДанныеПоВычетам.ВидДохода,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	НакопленныеДанныеПоВычетам.ВидВычета,
		|	НакопленныеДанныеПоВычетам.ВидВычета.Приоритет,
		|	НакопленныеДанныеПоВычетам.РазрешенныйВычетВТекущемПериоде,
		|	НакопленныеДанныеПоВычетам.ПримененныйВычетВТекущемПериоде
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям  КАК ИсчисленныйИПНПоПодразделениям
		|		ПРАВОЕ СОЕДИНЕНИЕ ВТНакопленныеДанныеПоВычетам КАК НакопленныеДанныеПоВычетам
		|		ПО ИсчисленныйИПНПоПодразделениям.МесяцНалоговогоПериода = НакопленныеДанныеПоВычетам.МесяцНалоговогоПериода
		|			И ИсчисленныйИПНПоПодразделениям.ФизическоеЛицо = НакопленныеДанныеПоВычетам.ФизическоеЛицо
		|			И ИсчисленныйИПНПоПодразделениям.Подразделение = НакопленныеДанныеПоВычетам.Подразделение
		|			И ИсчисленныйИПНПоПодразделениям.ВидДохода = НакопленныеДанныеПоВычетам.ВидДохода
		|			И (ВЫБОР
		|				КОГДА ИсчисленныйИПНПоПодразделениям.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ИсчисленныйИПНПоПодразделениям.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
		|						И ((НакопленныеДанныеПоВычетам.ВидВычета.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.Стандартный)
		|						И НакопленныеДанныеПоВычетам.ВидВычета.ПериодПредоставления = ЗНАЧЕНИЕ(Перечисление.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода))
		|						ИЛИ НакопленныеДанныеПоВычетам.ВидВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетОПВ)
		|						ИЛИ НакопленныеДанныеПоВычетам.ВидВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ВычетВОСМС))
        |			КОНЕЦ)
		|ГДЕ
		|	(ИсчисленныйИПНПоПодразделениям.ФизическоеЛицо ЕСТЬ NULL
		|			И (НакопленныеДанныеПоВычетам.РазрешенныйВычетВТекущемПериоде <> 0
		|			ИЛИ НакопленныеДанныеПоВычетам.ПримененныйВычетВТекущемПериоде <> 0))", "") + "
		|ИТОГИ
		|	МАКСИМУМ(ОблагаемыйДоходИсчисленныйРанее),
		|	МАКСИМУМ(НеоблагаемыйДоходИсчисленныйРанее),
		|	МАКСИМУМ(ОбъектИПНВИсчисленныйРанее),
		|	МАКСИМУМ(ИПНИсчисленныйРанее),
		|	МАКСИМУМ(ОблагаемыйДоход),
		|	МАКСИМУМ(НеоблагаемыйДоход),
		|	МАКСИМУМ(ИсчисленныйИПН),
		|	МАКСИМУМ(ОбъектИсчисленияИПН)
		|ПО
		|	ФизическоеЛицо,
		|	МесяцНалоговогоПериода,
		|	Подразделение,
		|	ВидДохода";
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВТДоходы КАК Доходы", "ВТДоходыОбъединенная КАК Доходы");
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();
	УничтожитьВТ.Добавить("ВТНакопленныеДанныеПоВычетам");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныйИПНВыборкаПоФизЛицам = Результат[ВсегоРезультатов - 1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ФизическоеЛицо");
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	ВыборкаПоФизЛицам = Результат[ВсегоРезультатов - 3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ФизическоеЛицо");
	НастройкиВидовВычетаПоВидамДохода = Результат[ВсегоРезультатов - 4].Выгрузить();
	НастройкиВидовВычетаПоВидамДохода.Индексы.Добавить("МесяцНалоговогоПериода");
	НастройкиВидовВычетаПоВидамДохода.Индексы.Добавить("ВидВычета");

	СтруктураДанных = ПодготовитьСлужебныеДанныеДляРасчетаИПН();
	ВспомогательнаяТаблицаРасчета = СтруктураДанных.ВспомогательнаяТаблицаРасчета;
	РезультатыРасчетов = СтруктураДанных.РезультатыРасчетов;
	ИзмеренияРасчетаВычетов = СтруктураДанных.ИзмеренияРасчетаВычетов;
	РесурсыРасчетаВычетов = СтруктураДанных.РесурсыРасчетаВычетов;
	
	ВычетыПримененныеВДанномРасчете = Новый Соответствие;
	ВычетыРазрешенныеВДанномРасчете = Новый Соответствие;
	Пока ВыборкаПоФизЛицам.Следующий() Цикл
		ВыборкаПоПериодам = ВыборкаПоФизЛицам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "МесяцНалоговогоПериода");
		Пока ВыборкаПоПериодам.Следующий() Цикл
			ВычетыПримененныеВДанномРасчете.Очистить();
			ВычетыРазрешенныеВДанномРасчете.Очистить();
			ВыборкаПоВидамДохода = ВыборкаПоПериодам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидДохода");
			Пока ВыборкаПоВидамДохода.Следующий() Цикл
				
				СтрокаРасчета = ВспомогательнаяТаблицаРасчета.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРасчета, ВыборкаПоВидамДохода, "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода");
				
				ОбъектИсчисленияИПН = ВыборкаПоВидамДохода.ОблагаемыйДоходВЦеломЗаПериод;
				ВыборкаПоВидамВычетов = ВыборкаПоВидамДохода.Выбрать();
				РазрешенныйВычетВТекущемПериоде = 0;
				ПримененныйВычетВТекущемПериоде = 0;
				// ВычетОПВ, ВычетВОСМС применяем для каждого вида дохода в отдельности по исчисленной сумме в рамках вида дохода 
				Если НЕ ВычетыПримененныеВДанномРасчете.Получить(Справочники.ВидыВычетовИПН.ВычетОПВ) = Неопределено Тогда
					ВычетыПримененныеВДанномРасчете.Удалить(Справочники.ВидыВычетовИПН.ВычетОПВ);
				КонецЕсли;
				Если НЕ ВычетыПримененныеВДанномРасчете.Получить(Справочники.ВидыВычетовИПН.ВычетВОСМС) = Неопределено Тогда
					ВычетыПримененныеВДанномРасчете.Удалить(Справочники.ВидыВычетовИПН.ВычетВОСМС);
				КонецЕсли;
				Пока ВыборкаПоВидамВычетов.Следующий() Цикл
					
					Если НЕ ЗначениеЗаполнено(ВыборкаПоВидамВычетов.ВидВычета) Тогда
						// Незачем считать, если вычеты не найдены
						Продолжить;
					КонецЕсли;
					
					Если ВыборкаПоВидамВычетов.ИспользуетсяПоНесколькимВидамДохода Тогда
						
						СтруктураПоиска = Новый Структура("МесяцНалоговогоПериода, ВидВычета, ВидДохода");
						ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаПоВидамВычетов);
						
						Если НастройкиВидовВычетаПоВидамДохода.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
							// Незачем считать, если вычеты не найдены
							Продолжить;
						КонецЕсли;
						
					КонецЕсли;
					
					// если вид вычета используется по нескольким видам дохода, найдем какие суммы были использованы по другим видам дохода у данного вычета
					Если ВыборкаПоВидамВычетов.ИспользуетсяПоНесколькимВидамДохода Тогда
						
						РазрешенныйВычетПрочихВидовДоходаТекущегоРасчета = ?(ВычетыРазрешенныеВДанномРасчете.Получить(ВыборкаПоВидамВычетов.ВидВычета) <> Неопределено, ВычетыРазрешенныеВДанномРасчете.Получить(ВыборкаПоВидамВычетов.ВидВычета), 0);
						
					Иначе
						
						РазрешенныйВычетПрочихВидовДоходаТекущегоРасчета = 0;
						
					КонецЕсли;

					// Соберем остатки за прошлые периоды в пределах года
					РазрешенныйВычетЗаПрошлыеМесяцы = ВыборкаПоВидамВычетов.РазрешенныйВычетСНачалаГода - ВыборкаПоВидамВычетов.РазрешенныйВычетВТекущемПериоде;
					ПримененныйВычетЗаПрошлыеМесяцы = ВыборкаПоВидамВычетов.ПримененныйВычетСНачалаГода - ВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде;
					ОстатокВычетаЗаПрошлыеМесяцы = РазрешенныйВычетЗаПрошлыеМесяцы - ПримененныйВычетЗаПрошлыеМесяцы;

					// Получим значения в текущем периоде
					Если ВыборкаПоВидамВычетов.ПредоставлениеВычета = Перечисления.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов Тогда
						РазрешенныйВычетВТекущемПериоде = ВыборкаПоВидамВычетов.РазмерВычета;
					ИначеЕсли ВыборкаПоВидамВычетов.ПредоставлениеВычета = Перечисления.ВидыПредоставленияВычетов.Стандартный 
						ИЛИ ВыборкаПоВидамВычетов.ПредоставлениеВычета = Перечисления.ВидыПредоставленияВычетов.ПоПериодическимПлатежам Тогда
						Если ВыборкаПоВидамВычетов.ПределВычета > 0 Тогда
							Если ВыборкаПоВидамВычетов.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца Тогда
								РазрешенныйВычетВТекущемПериоде = Мин(ВыборкаПоВидамВычетов.СуммовойПределВычета, ВыборкаПоВидамВычетов.РазмерВычета);
							ИначеЕсли ВыборкаПоВидамВычетов.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода Тогда
								РазрешенныйВычетВТекущемПериоде = Мин(ВыборкаПоВидамВычетов.СуммовойПределВычета - РазрешенныйВычетЗаПрошлыеМесяцы, ВыборкаПоВидамВычетов.РазмерВычета);
							Иначе 
								РазрешенныйВычетВТекущемПериоде = 0;
							КонецЕсли;
						Иначе 
							РазрешенныйВычетВТекущемПериоде = ВыборкаПоВидамВычетов.РазмерВычета;
						КонецЕсли;
					Иначе
						РазрешенныйВычетВТекущемПериоде = 0;
					КонецЕсли;
					
					ПримененныйВычетВТекущемПериоде = Мин(ОбъектИсчисленияИПН, ОстатокВычетаЗаПрошлыеМесяцы + РазрешенныйВычетВТекущемПериоде 
										- ?(ВычетыПримененныеВДанномРасчете.Получить(ВыборкаПоВидамВычетов.ВидВычета) <> Неопределено, ВычетыПримененныеВДанномРасчете.Получить(ВыборкаПоВидамВычетов.ВидВычета), 0));

					// Скорректируем остаток облагаемого дохода
					ОбъектИсчисленияИПН = Макс(0, ОбъектИсчисленияИПН - ПримененныйВычетВТекущемПериоде);

					// Получим значения в текущем расчете
					РазрешенныйВычетВТекущемРасчете = РазрешенныйВычетВТекущемПериоде - ВыборкаПоВидамВычетов.РазрешенныйВычетВТекущемПериоде;
					ПримененныйВычетВТекущемРасчете = ПримененныйВычетВТекущемПериоде - ВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде;
					
					// Зафиксируем результаты по значению текущего физлица расчета
					Если ВычетыПримененныеВДанномРасчете.Получить(ВыборкаПоВидамВычетов.ВидВычета) = Неопределено Тогда
						ВычетыПримененныеВДанномРасчете.Вставить(ВыборкаПоВидамВычетов.ВидВычета, ПримененныйВычетВТекущемРасчете + ВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде);
					Иначе 
						ВычетыПримененныеВДанномРасчете[ВыборкаПоВидамВычетов.ВидВычета] = ВычетыПримененныеВДанномРасчете[ВыборкаПоВидамВычетов.ВидВычета] + ПримененныйВычетВТекущемРасчете + ВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде;
					КонецЕсли;
					
					СтрокаРасчета["ВидВычета" + Строка(ВыборкаПоВидамВычетов.Приоритет)] = ВыборкаПоВидамВычетов.ВидВычета;
					СтрокаРасчета["ПримененныйВычет" + Строка(ВыборкаПоВидамВычетов.Приоритет)] = ПримененныйВычетВТекущемПериоде;
					СтрокаРасчета["РазрешенныйВычет" + Строка(ВыборкаПоВидамВычетов.Приоритет)] = РазрешенныйВычетВТекущемПериоде;

					СтрокаРасчета["ИспользуетсяПоНесколькимВидамДохода" + Строка(ВыборкаПоВидамВычетов.Приоритет)] = ВыборкаПоВидамВычетов.ИспользуетсяПоНесколькимВидамДохода;
					
					Если ВыборкаПоВидамВычетов.ИспользуетсяПоНесколькимВидамДохода Тогда
							
						// Зафиксируем результаты по значению текущего физлица расчета
						Если ВычетыРазрешенныеВДанномРасчете.Получить(ВыборкаПоВидамВычетов.ВидВычета) = Неопределено Тогда
							ВычетыРазрешенныеВДанномРасчете.Вставить(ВыборкаПоВидамВычетов.ВидВычета, РазрешенныйВычетВТекущемРасчете);
						Иначе 
							// добавим разрешенные вычеты других документов текущего периода с прочим видом дохода
							ВычетыРазрешенныеВДанномРасчете[ВыборкаПоВидамВычетов.ВидВычета] = ВычетыРазрешенныеВДанномРасчете[ВыборкаПоВидамВычетов.ВидВычета] + РазрешенныйВычетВТекущемРасчете;
						КонецЕсли;
					
					КонецЕсли;
					
				КонецЦикла;
				
				// применим корректировку на объект исчисления (Доходы - Вычеты), 
				// если сумма всех начислений (ВыборкаПоПериодам.ОблагаемыйДоходВЦеломЗаПериод + ВыборкаПоПериодам.НеоблагаемыйДоходВЦеломЗаПериод) не более 25 МРП
				Если ОкончательныйРасчет
					И ЗначениеЗаполнено(ВыборкаПоПериодам.МесяцНалоговогоПериода)
					И ВыборкаПоПериодам.МесяцНалоговогоПериода >= Дата(2019, 1, 1)
					И ВыборкаПоПериодам.СтатусНеРезидента = Перечисления.СтатусыФизическихЛицНалогоплательщиков.Резидент
					И (ВыборкаПоВидамДохода.ОблагаемыйДоходВЦеломЗаПериод + ВыборкаПоВидамДохода.НеоблагаемыйДоходВЦеломЗаПериод) <= ВыборкаПоПериодам.ОграничениеКорректировкиДохода25МРП
					И ВыборкаПоВидамДохода.ВидДохода = Справочники.ВидыДоходов.ДоходыОтРаботодателя
					И ОбъектИсчисленияИПН > 0 Тогда
					
					ПримененнаяКорректировка = Окр(ОбъектИсчисленияИПН * 0.9, 2, РежимОкругления.Окр15как20);
					ОбъектИсчисленияИПН = ОбъектИсчисленияИПН - ПримененнаяКорректировка;
					СтрокаРасчета.ПримененнаяЛьгота = ПримененнаяКорректировка;
					
				КонецЕсли;
				
				СтрокаРасчета.ОбъектИсчисленияИПН 	= ОбъектИсчисленияИПН;
				СтрокаРасчета.ИсчисленныйИПН 		= ОбъектИсчисленияИПН * ВыборкаПоВидамДохода.СтавкаИПН; 

			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	ПоляПоискаВидаДохода = "ФизическоеЛицо, МесяцНалоговогоПериода";
	СтруктураПоискаВидаДохода = Новый Структура(ПоляПоискаВидаДохода);
	
	МесяцНалоговогоПериодаВЦикле = Неопределено;
	ПоляПоискаПоНастройкамВычетов = "МесяцНалоговогоПериода";
	СтруктураПоискаПоНастройкамВычетов = Новый Структура(ПоляПоискаПоНастройкамВычетов);

	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаИПН);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);
	
	// для корректного округления после распределения при достижении суммы максимального предела необходима точность 0
	ТочностьОкругления = ОписаниеСпособаОкругления.Точность - Цел(ОписаниеСпособаОкругления.Точность);
	
	Если ТочностьОкругления = 0 Тогда
		ТочностьРаспределения = 0;
	ИначеЕсли ТочностьОкругления <= 0.1 Тогда
		ТочностьРаспределения = 2;
	Иначе
		ТочностьРаспределения = 1;
	КонецЕсли;
			
	Для Каждого СтрокаРасчета Из ВспомогательнаяТаблицаРасчета Цикл

		// ускорим работу цикла, если не меняется месяц начисления, нет необходимости искать по таблице НастройкиВидовВычетаПоВидамДоходаМесяца 
		Если МесяцНалоговогоПериодаВЦикле = Неопределено
			ИЛИ МесяцНалоговогоПериодаВЦикле <> СтрокаРасчета.МесяцНалоговогоПериода Тогда
			
			МесяцНалоговогоПериодаВЦикле = СтрокаРасчета.МесяцНалоговогоПериода;
			СтруктураПоискаПоНастройкамВычетов.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
			НастройкиВидовВычетаПоВидамДоходаМесяца = НастройкиВидовВычетаПоВидамДохода.Скопировать(СтруктураПоискаПоНастройкамВычетов, "ВидВычета, ВидДохода");
			
		КонецЕсли;
			
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяцаПоПодразделениям = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		
		СтруктураПоискаВидаДохода.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоискаВидаДохода.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		ДоходыПоВидамДохода = РаспределениеДоходовПоПодразделениям.Скопировать(СтруктураПоискаВидаДохода, "ВидДохода, ОблагаемыйДоход");
		ДоходыПоВидамДохода.Свернуть("ВидДохода", "ОблагаемыйДоход");
		
		РаспределитьНалогиВзносыПоПодразделениямИВидуДохода(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяцаПоПодразделениям, ДоходыПоВидамДохода, "ОбъектИсчисленияИПН,ИсчисленныйИПН,ПримененнаяЛьгота" + РесурсыРасчетаВычетов, НастройкиВидовВычетаПоВидамДоходаМесяца, ТочностьРаспределения);
		
	КонецЦикла;
	
	Пока ИсчисленныйИПНВыборкаПоФизЛицам.Следующий() Цикл
		ИсчисленныйИПНВыборкаПоПериодам = ИсчисленныйИПНВыборкаПоФизЛицам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "МесяцНалоговогоПериода");
		Пока ИсчисленныйИПНВыборкаПоПериодам.Следующий() Цикл
			ИсчисленныйИПНВыборкаПоПодразделениям = ИсчисленныйИПНВыборкаПоПериодам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Подразделение");
			Пока ИсчисленныйИПНВыборкаПоПодразделениям.Следующий() Цикл
				ИсчисленныйИПНВыборкаПоВидамДохода = ИсчисленныйИПНВыборкаПоПодразделениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидДохода");
				Пока ИсчисленныйИПНВыборкаПоВидамДохода.Следующий() Цикл
					НоваяСтрока = РезультатыРасчетов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ИсчисленныйИПНВыборкаПоВидамДохода);
					ИсчисленныйИПНВыборкаПоВидамВычетов = ИсчисленныйИПНВыборкаПоВидамДохода.Выбрать();
					Пока ИсчисленныйИПНВыборкаПоВидамВычетов.Следующий() Цикл
						Если НЕ ЗначениеЗаполнено(ИсчисленныйИПНВыборкаПоВидамВычетов.ВидВычета) Тогда
							Продолжить;
						КонецЕсли;
						
						ЭтоИсправлениеСтандартногоВычета = Ложь;
						
						Если ИсчисленныйИПНВыборкаПоВидамДохода.МесяцНалоговогоПериода < МесяцНачисления
							И (ИсчисленныйИПНВыборкаПоВидамВычетов.ВидВычета = Справочники.ВидыВычетовИПН.Стандартный1МЗП
								ИЛИ ИсчисленныйИПНВыборкаПоВидамВычетов.ВидВычета = Справочники.ВидыВычетовИПН.Стандартный75МЗПИнвалиды
								ИЛИ ИсчисленныйИПНВыборкаПоВидамВычетов.ВидВычета = Справочники.ВидыВычетовИПН.Стандартный75МЗПРодители)
								И НЕ (ИсчисленныйИПНВыборкаПоВидамВычетов.ОблагаемыйДоход + ИсчисленныйИПНВыборкаПоВидамВычетов.ОблагаемыйДоходИсчисленныйРанее = 0) Тогда
							
							ЭтоИсправлениеСтандартногоВычета = Истина;
							
						КонецЕсли;	
						
						НоваяСтрока["ВидВычета" + Строка(ИсчисленныйИПНВыборкаПоВидамВычетов.Приоритет)] = ИсчисленныйИПНВыборкаПоВидамВычетов.ВидВычета;
						
						НоваяСтрока["ПримененныйВычет" + Строка(ИсчисленныйИПНВыборкаПоВидамВычетов.Приоритет)] = - ИсчисленныйИПНВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде;
						НоваяСтрока["РазрешенныйВычет" + Строка(ИсчисленныйИПНВыборкаПоВидамВычетов.Приоритет)] = ?(ЭтоИсправлениеСтандартногоВычета, 0, - ИсчисленныйИПНВыборкаПоВидамВычетов.РазрешенныйВычетВТекущемПериоде);
						
						НоваяСтрока["ПримененныйВычет" + Строка(ИсчисленныйИПНВыборкаПоВидамВычетов.Приоритет) + "ИсчисленныйРанее"] = ИсчисленныйИПНВыборкаПоВидамВычетов.ПримененныйВычетВТекущемПериоде;
						НоваяСтрока["РазрешенныйВычет" + Строка(ИсчисленныйИПНВыборкаПоВидамВычетов.Приоритет) + "ИсчисленныйРанее"] = ИсчисленныйИПНВыборкаПоВидамВычетов.РазрешенныйВычетВТекущемПериоде;
						
						НоваяСтрока["ПримененнаяЛьгота"] = ИсчисленныйИПНВыборкаПоВидамВычетов.ПримененнаяЛьгота;
						
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Если ПредоставлятьВычетВМесяцеОтсутствияДохода Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиБезДохода.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СотрудникиБезДохода.Подразделение КАК Подразделение
		|ИЗ
		|	ВТСотрудникиОрганизацииБезДохода КАК СотрудникиБезДохода";
		
		ТаблицаФизЛиц = Запрос.Выполнить().Выгрузить();
		Для каждого СтрокаТаблицы Из ТаблицаФизЛиц Цикл
			ПараметрыОтбора = Новый Структура("ФизическоеЛицо", СтрокаТаблицы.ФизическоеЛицо);
			МассивСтрок = ВспомогательнаяТаблицаРасчета.НайтиСтроки(ПараметрыОтбора);
			Для каждого Строка Из МассивСтрок Цикл
				НоваяСтрока = РезультатыРасчетов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				НоваяСтрока.Подразделение = СтрокаТаблицы.Подразделение;
			КонецЦикла;
		КонецЦикла;
		УничтожитьВТ.Добавить("ВТСотрудникиОрганизацииБезДохода");
		УничтожитьВТ.Добавить("ВТПериодыПоФизлицамОбъединенная");
		УничтожитьВТ.Добавить("ВТКадровыеДанныеСотрудниковПоПериодамОбъединенная");
		УничтожитьВТ.Добавить("ВТРанееИсчисленныеНалогиВзносыОбъедененная");
	КонецЕсли;
	
	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода" + ИзмеренияРасчетаВычетов,
								"ОблагаемыйДоходВЦеломЗаПериод,   НеоблагаемыйДоходВЦеломЗаПериод, 	 ОбъектИсчисленияИПНВЦеломЗаПериод, ИсчисленныйИПНВЦеломЗаПериод, 
								|ОблагаемыйДоходИсчисленныйРанее, НеоблагаемыйДоходИсчисленныйРанее, ОбъектИПНИсчисленныйРанее, 		ИПНИсчисленныйРанее, 
								|ОблагаемыйДоход, 				  НеоблагаемыйДоход, 				 ОбъектИсчисленияИПН, 				ИсчисленныйИПН, 				ПримененнаяЛьгота" + РесурсыРасчетаВычетов);

	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	
	Для Каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		
		НомерСтроки = НомерСтроки + 1;
		СтрокаТЗ.НомерСтроки = НомерСтроки;
		
		// спишем возникшую погрешность округления при межрасчете или исправлении или перераспределении сумм по подразделениям
		Если СтрокаТЗ.ОблагаемыйДоход = 0
			И НЕ ОписаниеСпособаОкругления.ПравилоОкругления = Перечисления.ПравилаОкругленияПриРасчетеЗарплаты.Авто
			И (СтрокаТЗ.ИсчисленныйИПН < 1 И СтрокаТЗ.ИсчисленныйИПН > 0
				ИЛИ СтрокаТЗ.ИсчисленныйИПН > -1 И СтрокаТЗ.ИсчисленныйИПН < 0) Тогда
				
			СтрокаТЗ.ИсчисленныйИПН = 0;
			
		// исчисление взносов производятся в тенге с учетом округления тиын
		Иначе
			
			СтрокаТЗ.ИсчисленныйИПН = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныйИПН, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
			
		КонецЕсли;

	КонецЦикла;
	
	Запрос.УстановитьПараметр("ИсчисленныеИПН", РезультатыРасчетов.Скопировать());
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаИПН.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ТаблицаИПН.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ТаблицаИПН.ПримененнаяЛьгота КАК ПримененнаяКорректировка
		|ПОМЕСТИТЬ ВТИсчисленныйИПН
		|ИЗ
		|	&ИсчисленныеИПН КАК ТаблицаИПН";
	Запрос.Выполнить();
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьСОДо2019(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КонецМесяцаРасчета",КонецМесяца(МесяцНачисления));
	
	// Исключаемые лица
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОПенсионномОбеспеченииФизическихЛиц.ФизическоеЛицо
		|ПОМЕСТИТЬ ВТИсключаемыеФизическиеЛицаПриРасчетеСО
		|ИЗ
		|	РегистрСведений.СведенияОПенсионномОбеспеченииФизическихЛиц.СрезПоследних(
		|			&КонецМесяцаРасчета,
		|			ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					СписокСотрудников.ФизическоеЛицо
		|				ИЗ
		|					ВТФизическиеЛица КАК СписокСотрудников)) КАК СведенияОПенсионномОбеспеченииФизическихЛиц
		|ГДЕ
		|	СведенияОПенсионномОбеспеченииФизическихЛиц.ПенсионерПоВозрасту
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтатусФизическихЛицКакНалогоплательщиков.ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.СтатусФизическихЛицКакНалогоплательщиков.СрезПоследних(
		|			&КонецМесяцаРасчета,
		|			ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					СписокСотрудников.ФизическоеЛицо
		|				ИЗ
		|					ВТФизическиеЛица КАК СписокСотрудников)) КАК СтатусФизическихЛицКакНалогоплательщиков
		|ГДЕ
		|	НЕ СтатусФизическихЛицКакНалогоплательщиков.ПодлежитСоциальномуСтрахованию";
	
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТИсключаемыеФизическиеЛицаПриРасчетеСО");
	
	ВидНалогаВзносаСО =  Перечисления.ВидыНалоговВзносовОтчислений.СО;
	
	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаСО);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаСО, "ВТИсключаемыеФизическиеЛицаПриРасчетеСО");
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленных СО
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаСО);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	// - Размер ограничения доходов, облагаемых СО, по периодам
	// - Исчисленные СО
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмерыМЗППоПериодам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	РазмерыМЗППоПериодам.РазмерМЗП КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыМЗППоПериодам.РазмерМЗП * 10 КАК МаксимальныйРазмерОрганиченияДохода
		|ПОМЕСТИТЬ ВТРазмерыОграниченийПоДоходам
		|ИЗ
		|	ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода КАК МаксимальныйРазмерОрганиченияДохода,
		|	ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) КАК ИсчисленныеОПВ,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) >= РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0)
		|	КОНЕЦ КАК ОбъектИсчисленияСО,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) >= РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0)
		|	КОНЕЦ * ЕСТЬNULL(СтавкиСО.Ставка, 0) КАК ИсчисленныеСО
		|ПОМЕСТИТЬ ВТИсчисленныеСОВЦеломЗаПериод
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавки КАК СтавкиСО
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиСО.МесяцНалоговогоПериода
		|			И (СтавкиСО.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СО))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленныеОПВ КАК ИсчисленныеОПВПоПериодам
		|		ПО Доходы.МесяцНалоговогоПериода = ИсчисленныеОПВПоПериодам.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ИсчисленныеОПВПоПериодам.ФизическоеЛицо
		|			И Доходы.ВидДохода = ИсчисленныеОПВПоПериодам.ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеСО.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ВТИсчисленныеСО.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТИсчисленныеСО.ВидДохода КАК ВидДохода,
		|	ВТИсчисленныеСО.МинимальныйРазмерОрганиченияДохода КАК МинимальныйРазмерОрганиченияДохода,
		|	ВТИсчисленныеСО.МаксимальныйРазмерОрганиченияДохода КАК МаксимальныйРазмерОрганиченияДохода,
		|	ВТИсчисленныеСО.ИсчисленныеОПВ КАК ИсчисленныеОПВ,
		|	ВТИсчисленныеСО.ОбъектИсчисленияСО КАК ОбъектИсчисленияСО,
		|	ВТИсчисленныеСО.ИсчисленныеСО КАК ИсчисленныеСО
		|ИЗ
		|	ВТИсчисленныеСОВЦеломЗаПериод КАК ВТИсчисленныеСО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеСОПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныеСОПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныеСОПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныеСОПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныеСОПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеСОПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеСОПоПодразделениям.ОбъектИсчисления КАК ОбъектСОИсчисленныйРанее,
		|	ИсчисленныеСОПоПодразделениям.НалогВзнос КАК РанееИсчисленныеСО,
		|	-ИсчисленныеСОПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныеСОПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныеСОПоПодразделениям.НалогВзнос КАК ИсчисленныеСО,
		|	-ИсчисленныеСОПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияСО
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныеСОПоПодразделениям
		|ГДЕ
		|	(ИсчисленныеСОПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеСОПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеСОПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныеСОПоПодразделениям.НалогВзнос <> 0)";
	
	Результат = Запрос.ВыполнитьПакет();	
	УничтожитьВТ.Добавить("ВТРазмерыОграниченийПоДоходам");
	УничтожитьВТ.Добавить("ВТИсчисленныеСОВЦеломЗаПериод");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеСОПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	
	РезультатЗапроса = Новый ТаблицаЗначений;
	РезультатЗапроса.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	РезультатЗапроса.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	РезультатЗапроса.Колонки.Добавить("ВидДохода", Новый ОписаниеТипов("СправочникСсылка.ВидыДоходов"));
	РезультатЗапроса.Колонки.Добавить("МинимальныйРазмерОрганиченияДохода", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатЗапроса.Колонки.Добавить("МаксимальныйРазмерОрганиченияДохода", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатЗапроса.Колонки.Добавить("ОбъектИсчисленияСО", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатЗапроса.Колонки.Добавить("ИсчисленныеСО", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Результат[ВсегоРезультатов - 3].Выгрузить(), РезультатЗапроса);
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныеСОВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияСОВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектСОИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныеСО", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияСО,ИсчисленныеСО");
	КонецЦикла;
	
	Для каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		СтрокаТЗ.ИсчисленныеСО = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныеСО, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
	КонецЦикла; 

	Запрос.УстановитьПараметр("ИсчисленныеСО", РезультатыРасчетов.Скопировать());	
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеСОПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияСОВЦеломЗаПериод, 	ИсчисленныеСОВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектСОИсчисленныйРанее, 			РанееИсчисленныеСО,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход,					ОбъектИсчисленияСО, 				ИсчисленныеСО");
	
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	Для каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
	КонецЦикла; 

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаСО.МесяцНалоговогоПериода,
		|	ТаблицаСО.ФизическоеЛицо,
		|	ТаблицаСО.Подразделение,
		|	ТаблицаСО.ВидДохода,
		|	ТаблицаСО.ОбъектИсчисленияСО,
		|	ТаблицаСО.ИсчисленныеСО
		|ПОМЕСТИТЬ ВТИсчисленныеСОПоПодразделениям
		|ИЗ
		|	&ИсчисленныеСО КАК ТаблицаСО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеСОПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеСОПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеСОПоПодразделениям.ВидДохода,
		|	СУММА(ВТИсчисленныеСОПоПодразделениям.ОбъектИсчисленияСО) КАК ОбъектИсчисленияСО,
		|	СУММА(ВТИсчисленныеСОПоПодразделениям.ИсчисленныеСО) КАК ИсчисленныеСО
		|ПОМЕСТИТЬ ВТИсчисленныеСО
		|ИЗ
		|	ВТИсчисленныеСОПоПодразделениям КАК ВТИсчисленныеСОПоПодразделениям
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТИсчисленныеСОПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеСОПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеСОПоПодразделениям.ВидДохода";
		
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТИсчисленныеСОПоПодразделениям");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьСОПосле2019(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КонецМесяцаРасчета",КонецМесяца(МесяцНачисления));
	
	// Исключаемые лица
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОПенсионномОбеспеченииФизическихЛиц.ФизическоеЛицо
		|ПОМЕСТИТЬ ВТИсключаемыеФизическиеЛицаПриРасчетеСО
		|ИЗ
		|	РегистрСведений.СведенияОПенсионномОбеспеченииФизическихЛиц.СрезПоследних(
		|			&КонецМесяцаРасчета,
		|			ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					СписокСотрудников.ФизическоеЛицо
		|				ИЗ
		|					ВТФизическиеЛица КАК СписокСотрудников)) КАК СведенияОПенсионномОбеспеченииФизическихЛиц
		|ГДЕ
		|	СведенияОПенсионномОбеспеченииФизическихЛиц.ПенсионерПоВозрасту
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтатусФизическихЛицКакНалогоплательщиков.ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.СтатусФизическихЛицКакНалогоплательщиков.СрезПоследних(
		|			&КонецМесяцаРасчета,
		|			ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					СписокСотрудников.ФизическоеЛицо
		|				ИЗ
		|					ВТФизическиеЛица КАК СписокСотрудников)) КАК СтатусФизическихЛицКакНалогоплательщиков
		|ГДЕ
		|	НЕ СтатусФизическихЛицКакНалогоплательщиков.ПодлежитСоциальномуСтрахованию";
	
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТИсключаемыеФизическиеЛицаПриРасчетеСО");
	
	ВидНалогаВзносаСО =  Перечисления.ВидыНалоговВзносовОтчислений.СО;
	
	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаСО);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаСО, "ВТИсключаемыеФизическиеЛицаПриРасчетеСО");
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленных СО
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаСО);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	// Статусы физических лиц как налогоплательщиков по периодам
	СоздатьВТСтатусыФизическихЛицКакНалогоплательщиков(МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТСтатусыФизическихЛицКакНалогоплательщиков");
	
	// - Размер ограничения доходов, облагаемых СО, по периодам
	// - Исчисленные СО
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмерыМЗППоПериодам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	РазмерыМЗППоПериодам.РазмерМЗП КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыМЗППоПериодам.РазмерМЗП * 7 КАК МаксимальныйРазмерОрганиченияДохода
		|ПОМЕСТИТЬ ВТРазмерыОграниченийПоДоходам
		|ИЗ
		|	ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода КАК МаксимальныйРазмерОрганиченияДохода,
		|	ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) КАК ИсчисленныеОПВ,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) >= РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0)
		|	КОНЕЦ КАК ОбъектИсчисленияСО,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) >= РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0)
		|	КОНЕЦ * ЕСТЬNULL(СтавкиСО.Ставка, 0) КАК ИсчисленныеСО
		|ПОМЕСТИТЬ ВТИсчисленныеСОВЦеломЗаПериод
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавки КАК СтавкиСО
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиСО.МесяцНалоговогоПериода
		|			И (СтавкиСО.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СО))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленныеОПВ КАК ИсчисленныеОПВПоПериодам
		|		ПО Доходы.МесяцНалоговогоПериода = ИсчисленныеОПВПоПериодам.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ИсчисленныеОПВПоПериодам.ФизическоеЛицо
		|			И Доходы.ВидДохода = ИсчисленныеОПВПоПериодам.ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеСО.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ВТИсчисленныеСО.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТИсчисленныеСО.ВидДохода КАК ВидДохода,
		|	ВТИсчисленныеСО.МинимальныйРазмерОрганиченияДохода КАК МинимальныйРазмерОрганиченияДохода,
		|	ВТИсчисленныеСО.МаксимальныйРазмерОрганиченияДохода КАК МаксимальныйРазмерОрганиченияДохода,
		|	ВТИсчисленныеСО.ИсчисленныеОПВ КАК ИсчисленныеОПВ,
		|	ВТИсчисленныеСО.ОбъектИсчисленияСО КАК ОбъектИсчисленияСО,
		|	ВТИсчисленныеСО.ИсчисленныеСО КАК ИсчисленныеСО
		|ИЗ
		|	ВТИсчисленныеСОВЦеломЗаПериод КАК ВТИсчисленныеСО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеСОПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныеСОПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныеСОПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныеСОПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныеСОПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеСОПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеСОПоПодразделениям.ОбъектИсчисления КАК ОбъектСОИсчисленныйРанее,
		|	ИсчисленныеСОПоПодразделениям.НалогВзнос КАК РанееИсчисленныеСО,
		|	-ИсчисленныеСОПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныеСОПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныеСОПоПодразделениям.НалогВзнос КАК ИсчисленныеСО,
		|	-ИсчисленныеСОПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияСО
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныеСОПоПодразделениям
		|ГДЕ
		|	(ИсчисленныеСОПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеСОПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеСОПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныеСОПоПодразделениям.НалогВзнос <> 0)";
	
	Результат = Запрос.ВыполнитьПакет();	
	УничтожитьВТ.Добавить("ВТРазмерыОграниченийПоДоходам");
	УничтожитьВТ.Добавить("ВТИсчисленныеСОВЦеломЗаПериод");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеСОПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	
	РезультатЗапроса = Новый ТаблицаЗначений;
	РезультатЗапроса.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	РезультатЗапроса.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	РезультатЗапроса.Колонки.Добавить("ВидДохода", Новый ОписаниеТипов("СправочникСсылка.ВидыДоходов"));
	РезультатЗапроса.Колонки.Добавить("МинимальныйРазмерОрганиченияДохода", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатЗапроса.Колонки.Добавить("МаксимальныйРазмерОрганиченияДохода", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатЗапроса.Колонки.Добавить("ОбъектИсчисленияСО", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатЗапроса.Колонки.Добавить("ИсчисленныеСО", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Результат[ВсегоРезультатов - 3].Выгрузить(), РезультатЗапроса);
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныеСОВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияСОВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектСОИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныеСО", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	// для корректного округления после распределения при достижении суммы максимального предела необходима точность 0
	ТочностьОкругления = ОписаниеСпособаОкругления.Точность - Цел(ОписаниеСпособаОкругления.Точность);
	
	Если ТочностьОкругления = 0 Тогда
		ТочностьРаспределения = 0;
	ИначеЕсли ТочностьОкругления <= 0.1 Тогда
		ТочностьРаспределения = 2;
	Иначе
		ТочностьРаспределения = 1;
	КонецЕсли;
			
	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияСО,ИсчисленныеСО", ТочностьРаспределения);
	КонецЦикла;
	
	Для каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		СтрокаТЗ.ИсчисленныеСО = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныеСО, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
	КонецЦикла; 

	Запрос.УстановитьПараметр("ИсчисленныеСО", РезультатыРасчетов.Скопировать());	
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеСОПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияСОВЦеломЗаПериод, 	ИсчисленныеСОВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектСОИсчисленныйРанее, 			РанееИсчисленныеСО,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход,					ОбъектИсчисленияСО, 				ИсчисленныеСО");
	
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	Для каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
	КонецЦикла; 

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаСО.МесяцНалоговогоПериода,
		|	ТаблицаСО.ФизическоеЛицо,
		|	ТаблицаСО.Подразделение,
		|	ТаблицаСО.ВидДохода,
		|	ТаблицаСО.ОбъектИсчисленияСО,
		|	ТаблицаСО.ИсчисленныеСО
		|ПОМЕСТИТЬ ВТИсчисленныеСОПоПодразделениям
		|ИЗ
		|	&ИсчисленныеСО КАК ТаблицаСО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеСОПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеСОПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеСОПоПодразделениям.ВидДохода,
		|	СУММА(ВТИсчисленныеСОПоПодразделениям.ОбъектИсчисленияСО) КАК ОбъектИсчисленияСО,
		|	СУММА(ВТИсчисленныеСОПоПодразделениям.ИсчисленныеСО) КАК ИсчисленныеСО
		|ПОМЕСТИТЬ ВТИсчисленныеСО
		|ИЗ
		|	ВТИсчисленныеСОПоПодразделениям КАК ВТИсчисленныеСОПоПодразделениям
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТИсчисленныеСОПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеСОПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеСОПоПодразделениям.ВидДохода";
		
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТИсчисленныеСОПоПодразделениям");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьСОПосле2021(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КонецМесяцаРасчета",КонецМесяца(МесяцНачисления));
	
	// Исключаемые лица
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОПенсионномОбеспеченииФизическихЛиц.ФизическоеЛицо
		|ПОМЕСТИТЬ ВТИсключаемыеФизическиеЛицаПриРасчетеСО
		|ИЗ
		|	РегистрСведений.СведенияОПенсионномОбеспеченииФизическихЛиц.СрезПоследних(
		|			&КонецМесяцаРасчета,
		|			ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					СписокСотрудников.ФизическоеЛицо
		|				ИЗ
		|					ВТФизическиеЛица КАК СписокСотрудников)) КАК СведенияОПенсионномОбеспеченииФизическихЛиц
		|ГДЕ
		|	СведенияОПенсионномОбеспеченииФизическихЛиц.ПенсионерПоВозрасту
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтатусФизическихЛицКакНалогоплательщиков.ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.СтатусФизическихЛицКакНалогоплательщиков.СрезПоследних(
		|			&КонецМесяцаРасчета,
		|			ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					СписокСотрудников.ФизическоеЛицо
		|				ИЗ
		|					ВТФизическиеЛица КАК СписокСотрудников)) КАК СтатусФизическихЛицКакНалогоплательщиков
		|ГДЕ
		|	НЕ СтатусФизическихЛицКакНалогоплательщиков.ПодлежитСоциальномуСтрахованию";
	
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТИсключаемыеФизическиеЛицаПриРасчетеСО");
	
	ВидНалогаВзносаСО =  Перечисления.ВидыНалоговВзносовОтчислений.СО;
	
	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаСО);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаСО, "ВТИсключаемыеФизическиеЛицаПриРасчетеСО");
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленных СО
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаСО);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	// Статусы физических лиц как налогоплательщиков по периодам
	СоздатьВТСтатусыФизическихЛицКакНалогоплательщиков(МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТСтатусыФизическихЛицКакНалогоплательщиков");
	
	// - Размер ограничения доходов, облагаемых СО, по периодам
	// - Исчисленные СО
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмерыМЗППоПериодам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	РазмерыМЗППоПериодам.РазмерМЗП КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыМЗППоПериодам.РазмерМЗП * 7 КАК МаксимальныйРазмерОрганиченияДохода
		|ПОМЕСТИТЬ ВТРазмерыОграниченийПоДоходам
		|ИЗ
		|	ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода КАК МаксимальныйРазмерОрганиченияДохода,
		|	ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) КАК ИсчисленныеОПВ,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) >= РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0)
		|	КОНЕЦ КАК ОбъектИсчисленияСО,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) >= РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0)
		|	КОНЕЦ * ЕСТЬNULL(СтавкиСО.Ставка, 0) КАК ИсчисленныеСО
		|ПОМЕСТИТЬ ВТИсчисленныеСОВЦеломЗаПериод
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавки КАК СтавкиСО
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиСО.МесяцНалоговогоПериода
		|			И Доходы.ВидДохода = СтавкиСО.ВидДохода
		|			И (СтавкиСО.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СО))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленныеОПВ КАК ИсчисленныеОПВПоПериодам
		|		ПО Доходы.МесяцНалоговогоПериода = ИсчисленныеОПВПоПериодам.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ИсчисленныеОПВПоПериодам.ФизическоеЛицо
		|			И Доходы.ВидДохода = ИсчисленныеОПВПоПериодам.ВидДохода
		|			И НЕ Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеСО.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ВТИсчисленныеСО.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТИсчисленныеСО.ВидДохода КАК ВидДохода,
		|	ВТИсчисленныеСО.МинимальныйРазмерОрганиченияДохода КАК МинимальныйРазмерОрганиченияДохода,
		|	ВТИсчисленныеСО.МаксимальныйРазмерОрганиченияДохода КАК МаксимальныйРазмерОрганиченияДохода,
		|	ВТИсчисленныеСО.ИсчисленныеОПВ КАК ИсчисленныеОПВ,
		|	ВТИсчисленныеСО.ОбъектИсчисленияСО КАК ОбъектИсчисленияСО,
		|	ВТИсчисленныеСО.ИсчисленныеСО КАК ИсчисленныеСО
		|ИЗ
		|	ВТИсчисленныеСОВЦеломЗаПериод КАК ВТИсчисленныеСО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеСОПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныеСОПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныеСОПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныеСОПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныеСОПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеСОПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеСОПоПодразделениям.ОбъектИсчисления КАК ОбъектСОИсчисленныйРанее,
		|	ИсчисленныеСОПоПодразделениям.НалогВзнос КАК РанееИсчисленныеСО,
		|	-ИсчисленныеСОПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныеСОПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныеСОПоПодразделениям.НалогВзнос КАК ИсчисленныеСО,
		|	-ИсчисленныеСОПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияСО
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныеСОПоПодразделениям
		|ГДЕ
		|	(ИсчисленныеСОПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеСОПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеСОПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныеСОПоПодразделениям.НалогВзнос <> 0)
		|	И НЕ ИсчисленныеСОПоПодразделениям.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства)";
	
	Результат = Запрос.ВыполнитьПакет();	
	УничтожитьВТ.Добавить("ВТРазмерыОграниченийПоДоходам");
	УничтожитьВТ.Добавить("ВТИсчисленныеСОВЦеломЗаПериод");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеСОПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	
	РезультатЗапроса = Новый ТаблицаЗначений;
	РезультатЗапроса.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	РезультатЗапроса.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	РезультатЗапроса.Колонки.Добавить("ВидДохода", Новый ОписаниеТипов("СправочникСсылка.ВидыДоходов"));
	РезультатЗапроса.Колонки.Добавить("МинимальныйРазмерОрганиченияДохода", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатЗапроса.Колонки.Добавить("МаксимальныйРазмерОрганиченияДохода", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатЗапроса.Колонки.Добавить("ОбъектИсчисленияСО", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатЗапроса.Колонки.Добавить("ИсчисленныеСО", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Результат[ВсегоРезультатов - 3].Выгрузить(), РезультатЗапроса);
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныеСОВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияСОВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектСОИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныеСО", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	// для корректного округления после распределения при достижении суммы максимального предела необходима точность 0
	ТочностьОкругления = ОписаниеСпособаОкругления.Точность - Цел(ОписаниеСпособаОкругления.Точность);
	
	Если ТочностьОкругления = 0 Тогда
		ТочностьРаспределения = 0;
	ИначеЕсли ТочностьОкругления <= 0.1 Тогда
		ТочностьРаспределения = 2;
	Иначе
		ТочностьРаспределения = 1;
	КонецЕсли;
			
	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияСО,ИсчисленныеСО", ТочностьРаспределения);
	КонецЦикла;
	
	Для каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		СтрокаТЗ.ИсчисленныеСО = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныеСО, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
	КонецЦикла; 

	Запрос.УстановитьПараметр("ИсчисленныеСО", РезультатыРасчетов.Скопировать());	
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеСОПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияСОВЦеломЗаПериод, 	ИсчисленныеСОВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектСОИсчисленныйРанее, 			РанееИсчисленныеСО,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход,					ОбъектИсчисленияСО, 				ИсчисленныеСО");
	
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	Для каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
	КонецЦикла; 

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаСО.МесяцНалоговогоПериода,
		|	ТаблицаСО.ФизическоеЛицо,
		|	ТаблицаСО.Подразделение,
		|	ТаблицаСО.ВидДохода,
		|	ТаблицаСО.ОбъектИсчисленияСО,
		|	ТаблицаСО.ИсчисленныеСО
		|ПОМЕСТИТЬ ВТИсчисленныеСОПоПодразделениям
		|ИЗ
		|	&ИсчисленныеСО КАК ТаблицаСО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеСОПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеСОПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеСОПоПодразделениям.ВидДохода,
		|	СУММА(ВТИсчисленныеСОПоПодразделениям.ОбъектИсчисленияСО) КАК ОбъектИсчисленияСО,
		|	СУММА(ВТИсчисленныеСОПоПодразделениям.ИсчисленныеСО) КАК ИсчисленныеСО
		|ПОМЕСТИТЬ ВТИсчисленныеСО
		|ИЗ
		|	ВТИсчисленныеСОПоПодразделениям КАК ВТИсчисленныеСОПоПодразделениям
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТИсчисленныеСОПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеСОПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеСОПоПодразделениям.ВидДохода";
		
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТИсчисленныеСОПоПодразделениям");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьСОПосле2022(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КонецМесяцаРасчета",КонецМесяца(МесяцНачисления));
	
	// Исключаемые лица
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОПенсионномОбеспеченииФизическихЛиц.ФизическоеЛицо
		|ПОМЕСТИТЬ ВТИсключаемыеФизическиеЛицаПриРасчетеСО
		|ИЗ
		|	РегистрСведений.СведенияОПенсионномОбеспеченииФизическихЛиц.СрезПоследних(
		|			&КонецМесяцаРасчета,
		|			ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					СписокСотрудников.ФизическоеЛицо
		|				ИЗ
		|					ВТФизическиеЛица КАК СписокСотрудников)) КАК СведенияОПенсионномОбеспеченииФизическихЛиц
		|ГДЕ
		|	СведенияОПенсионномОбеспеченииФизическихЛиц.ПенсионерПоВозрасту
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтатусФизическихЛицКакНалогоплательщиков.ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.СтатусФизическихЛицКакНалогоплательщиков.СрезПоследних(
		|			&КонецМесяцаРасчета,
		|			ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					СписокСотрудников.ФизическоеЛицо
		|				ИЗ
		|					ВТФизическиеЛица КАК СписокСотрудников)) КАК СтатусФизическихЛицКакНалогоплательщиков
		|ГДЕ
		|	НЕ СтатусФизическихЛицКакНалогоплательщиков.ПодлежитСоциальномуСтрахованию";
	
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТИсключаемыеФизическиеЛицаПриРасчетеСО");
	
	ВидНалогаВзносаСО =  Перечисления.ВидыНалоговВзносовОтчислений.СО;
	
	ДанныеОкругления = ПолучитьСпособОкругленияСПериодом(МенеджерВременныхТаблиц, ВидНалогаВзносаСО);
	СпособОкругления = ДанныеОкругления.СпособОкругления;
	ПериодОкругления = ДанныеОкругления.Период;
	
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);
	
	Если ПериодОкругления >= '20220101' Тогда
		// для корректного округления после распределения при достижении суммы максимального предела необходима точность 0
		ТочностьОкругления = ОписаниеСпособаОкругления.Точность;
		ПравилоОкругления = ОписаниеСпособаОкругления.ПравилоОкругления;		
	Иначе
		ТочностьОкругления = 1;
		ПравилоОкругления = Перечисления.ПравилаОкругленияПриРасчетеЗарплаты.ВБольшуюСторону;		
	КонецЕсли;
	
	Если ТочностьОкругления = 0 Тогда
		ТочностьРаспределения = 0;
	ИначеЕсли ТочностьОкругления <= 0.1 Тогда
		ТочностьРаспределения = 2;
	Иначе
		ТочностьРаспределения = 1;
	КонецЕсли;
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаСО, "ВТИсключаемыеФизическиеЛицаПриРасчетеСО");
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленных СО
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаСО);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	// Статусы физических лиц как налогоплательщиков по периодам
	СоздатьВТСтатусыФизическихЛицКакНалогоплательщиков(МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТСтатусыФизическихЛицКакНалогоплательщиков");
	
	// - Размер ограничения доходов, облагаемых СО, по периодам
	// - Исчисленные СО
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмерыМЗППоПериодам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	РазмерыМЗППоПериодам.РазмерМЗП КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыМЗППоПериодам.РазмерМЗП * 7 КАК МаксимальныйРазмерОрганиченияДохода
		|ПОМЕСТИТЬ ВТРазмерыОграниченийПоДоходам
		|ИЗ
		|	ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода КАК МаксимальныйРазмерОрганиченияДохода,
		|	ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) КАК ИсчисленныеОПВ,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) >= РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0)
		|	КОНЕЦ КАК ОбъектИсчисленияСО,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) >= РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0)
		|	КОНЕЦ * ЕСТЬNULL(СтавкиСО.Ставка, 0) КАК ИсчисленныеСО
		|ПОМЕСТИТЬ ВТИсчисленныеСОВЦеломЗаПериод
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавки КАК СтавкиСО
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиСО.МесяцНалоговогоПериода
		|			И Доходы.ВидДохода = СтавкиСО.ВидДохода
		|			И (СтавкиСО.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СО))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленныеОПВ КАК ИсчисленныеОПВПоПериодам
		|		ПО Доходы.МесяцНалоговогоПериода = ИсчисленныеОПВПоПериодам.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ИсчисленныеОПВПоПериодам.ФизическоеЛицо
		|			И Доходы.ВидДохода = ИсчисленныеОПВПоПериодам.ВидДохода
		|			И НЕ Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеСО.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ВТИсчисленныеСО.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТИсчисленныеСО.ВидДохода КАК ВидДохода,
		|	ВТИсчисленныеСО.МинимальныйРазмерОрганиченияДохода КАК МинимальныйРазмерОрганиченияДохода,
		|	ВТИсчисленныеСО.МаксимальныйРазмерОрганиченияДохода КАК МаксимальныйРазмерОрганиченияДохода,
		|	ВТИсчисленныеСО.ИсчисленныеОПВ КАК ИсчисленныеОПВ,
		|	ВТИсчисленныеСО.ОбъектИсчисленияСО КАК ОбъектИсчисленияСО,
		|	ВТИсчисленныеСО.ИсчисленныеСО КАК ИсчисленныеСО
		|ИЗ
		|	ВТИсчисленныеСОВЦеломЗаПериод КАК ВТИсчисленныеСО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеСОПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныеСОПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныеСОПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныеСОПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныеСОПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеСОПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеСОПоПодразделениям.ОбъектИсчисления КАК ОбъектСОИсчисленныйРанее,
		|	ИсчисленныеСОПоПодразделениям.НалогВзнос КАК РанееИсчисленныеСО,
		|	-ИсчисленныеСОПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныеСОПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныеСОПоПодразделениям.НалогВзнос КАК ИсчисленныеСО,
		|	-ИсчисленныеСОПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияСО
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныеСОПоПодразделениям
		|ГДЕ
		|	(ИсчисленныеСОПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеСОПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеСОПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныеСОПоПодразделениям.НалогВзнос <> 0)
		|	И НЕ ИсчисленныеСОПоПодразделениям.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства)";
	
	Результат = Запрос.ВыполнитьПакет();	
	УничтожитьВТ.Добавить("ВТРазмерыОграниченийПоДоходам");
	УничтожитьВТ.Добавить("ВТИсчисленныеСОВЦеломЗаПериод");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеСОПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	
	РезультатЗапроса = Новый ТаблицаЗначений;
	РезультатЗапроса.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	РезультатЗапроса.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	РезультатЗапроса.Колонки.Добавить("ВидДохода", Новый ОписаниеТипов("СправочникСсылка.ВидыДоходов"));
	РезультатЗапроса.Колонки.Добавить("МинимальныйРазмерОрганиченияДохода", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатЗапроса.Колонки.Добавить("МаксимальныйРазмерОрганиченияДохода", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатЗапроса.Колонки.Добавить("ОбъектИсчисленияСО", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатЗапроса.Колонки.Добавить("ИсчисленныеСО", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Результат[ВсегоРезультатов - 3].Выгрузить(), РезультатЗапроса);
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныеСОВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияСОВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектСОИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныеСО", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияСО,ИсчисленныеСО", ТочностьРаспределения);
	КонецЦикла;
	
	Для каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		СтрокаТЗ.ИсчисленныеСО = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныеСО, ТочностьОкругления, ПравилоОкругления);
	КонецЦикла; 

	Запрос.УстановитьПараметр("ИсчисленныеСО", РезультатыРасчетов.Скопировать());	
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеСОПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияСОВЦеломЗаПериод, 	ИсчисленныеСОВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектСОИсчисленныйРанее, 			РанееИсчисленныеСО,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход,					ОбъектИсчисленияСО, 				ИсчисленныеСО");
	
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	Для каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
	КонецЦикла; 

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаСО.МесяцНалоговогоПериода,
		|	ТаблицаСО.ФизическоеЛицо,
		|	ТаблицаСО.Подразделение,
		|	ТаблицаСО.ВидДохода,
		|	ТаблицаСО.ОбъектИсчисленияСО,
		|	ТаблицаСО.ИсчисленныеСО
		|ПОМЕСТИТЬ ВТИсчисленныеСОПоПодразделениям
		|ИЗ
		|	&ИсчисленныеСО КАК ТаблицаСО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеСОПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеСОПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеСОПоПодразделениям.ВидДохода,
		|	СУММА(ВТИсчисленныеСОПоПодразделениям.ОбъектИсчисленияСО) КАК ОбъектИсчисленияСО,
		|	СУММА(ВТИсчисленныеСОПоПодразделениям.ИсчисленныеСО) КАК ИсчисленныеСО
		|ПОМЕСТИТЬ ВТИсчисленныеСО
		|ИЗ
		|	ВТИсчисленныеСОПоПодразделениям КАК ВТИсчисленныеСОПоПодразделениям
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТИсчисленныеСОПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеСОПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеСОПоПодразделениям.ВидДохода";
		
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТИсчисленныеСОПоПодразделениям");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьСНДо2019(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт

	УничтожитьВТ = Новый Массив;
	
	ВидНалогаВзносаСН =  Перечисления.ВидыНалоговВзносовОтчислений.СН;
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаСН);
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленного СН
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаСН);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмерыМЗППоПериодам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	РазмерыМЗППоПериодам.РазмерМЗП КАК МинимальныйРазмерОрганиченияДохода
		|ПОМЕСТИТЬ ВТРазмерыОграниченийПоДоходам
		|ИЗ
		|	ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода КАК МинимальныйРазмерОрганиченияДохода,
		|	ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) КАК ИсчисленныеОПВ,
		|	ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0) КАК ИсчисленныеСО,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0)
		|	КОНЕЦ КАК ОбъектИсчисленияСН,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|				И РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода * ЕСТЬNULL(СтавкиСН.Ставка, 0) >= ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода * ЕСТЬNULL(СтавкиСН.Ставка, 0) - ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|		КОГДА (Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0)) * ЕСТЬNULL(СтавкиСН.Ставка, 0) >= ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|			ТОГДА (Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0)) * ЕСТЬNULL(СтавкиСН.Ставка, 0) - ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ИсчисленныйСН
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавки КАК СтавкиСН
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиСН.МесяцНалоговогоПериода
		|			И (СтавкиСН.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СН))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленныеОПВ КАК ИсчисленныеОПВПоПериодам
		|		ПО Доходы.МесяцНалоговогоПериода = ИсчисленныеОПВПоПериодам.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ИсчисленныеОПВПоПериодам.ФизическоеЛицо
		|			И Доходы.ВидДохода = ИсчисленныеОПВПоПериодам.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленныеСО КАК ИсчисленныеСОПоПериодам
		|		ПО Доходы.МесяцНалоговогоПериода = ИсчисленныеСОПоПериодам.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ИсчисленныеСОПоПериодам.ФизическоеЛицо
		|			И Доходы.ВидДохода = ИсчисленныеСОПоПериодам.ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныйСНПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныйСНПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныйСНПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныйСНПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныйСНПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныйСНПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныйСНПоПодразделениям.ОбъектИсчисления КАК ОбъектСНИсчисленныйРанее,
		|	ИсчисленныйСНПоПодразделениям.НалогВзнос КАК РанееИсчисленныйСН,
		|	-ИсчисленныйСНПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныйСНПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныйСНПоПодразделениям.НалогВзнос КАК ИсчисленныйСН,
		|	-ИсчисленныйСНПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияСН
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныйСНПоПодразделениям
		|ГДЕ
		|	(ИсчисленныйСНПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныйСНПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныйСНПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныйСНПоПодразделениям.НалогВзнос <> 0)";
	
	Результат = Запрос.ВыполнитьПакет();	
	УничтожитьВТ.Добавить("ВТРазмерыОграниченийПоДоходам");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеСНПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	РезультатЗапроса = Результат[ВсегоРезультатов - 3].Выгрузить();
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныйСНВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияСНВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектСНИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныйСН", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияСН,ИсчисленныйСН");
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеСНПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияСНВЦеломЗаПериод, 	ИсчисленныйСНВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектСНИсчисленныйРанее, 			РанееИсчисленныйСН,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход,					ОбъектИсчисленияСН, 				ИсчисленныйСН");
	
	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаСН);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);
	
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	Для Каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
		СтрокаТЗ.ИсчисленныйСН = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныйСН, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
	КонецЦикла; 

	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьСНПосле2019(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт

	УничтожитьВТ = Новый Массив;
	
	ВидНалогаВзносаСН =  Перечисления.ВидыНалоговВзносовОтчислений.СН;
	ПрименятьКорректировкуПрочихНалоговВзносовОтчислений = ЗарплатаКадрыРКПовтИсп.ПрименятьКорректировкуПрочихНалоговВзносовОтчислений(ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(Организация), МесяцНачисления);	
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаСН);
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленного СН
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаСН);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	// Статусы физических лиц как налогоплательщиков по периодам
	СоздатьВТСтатусыФизическихЛицКакНалогоплательщиков(МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТСтатусыФизическихЛицКакНалогоплательщиков");
	
	СоздатьВТДанныеПоКорректировкеДоходаИПН(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет, ИсключатьДоходыРегистратора, ПрименятьКорректировкуПрочихНалоговВзносовОтчислений);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПрименятьКорректировкуПрочихНалоговВзносовОтчислений", ПрименятьКорректировкуПрочихНалоговВзносовОтчислений);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмерыМЗППоПериодам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	РазмерыМЗППоПериодам.РазмерМЗП КАК МинимальныйРазмерОрганиченияДохода
		|ПОМЕСТИТЬ ВТРазмерыОграниченийПоДоходам
		|ИЗ
		|	ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеИПН.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДанныеИПН.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(ДанныеИПН.СуммаКорректировки) КАК СуммаКорректировки
		|ПОМЕСТИТЬ ВТСуммыКорректировки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ИсчисленныйИПН.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		ИсчисленныйИПН.ФизическоеЛицо КАК ФизическоеЛицо,
		|		ЕСТЬNULL(ИсчисленныйИПН.ПримененнаяКорректировка, 0) КАК СуммаКорректировки
		|	ИЗ
		|		ВТИсчисленныйИПН КАК ИсчисленныйИПН
		|	ГДЕ	
		|		&ПрименятьКорректировкуПрочихНалоговВзносовОтчислений
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Доходы.МесяцНалоговогоПериода,
		|		Доходы.ФизическоеЛицо,
		|		ЕСТЬNULL(ДанныеПоКорректировкеДоходаИПН.ПримененнаяКорректировка, 0)
		|	ИЗ
		|		ВТДоходы КАК Доходы
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеПоКорректировкеДоходаИПН КАК ДанныеПоКорректировкеДоходаИПН
		|			ПО Доходы.МесяцНалоговогоПериода = ДанныеПоКорректировкеДоходаИПН.МесяцНалоговогоПериода
		|				И Доходы.ФизическоеЛицо = ДанныеПоКорректировкеДоходаИПН.ФизическоеЛицо) КАК ДанныеИПН
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеИПН.МесяцНалоговогоПериода,
		|	ДанныеИПН.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода КАК МинимальныйРазмерОрганиченияДохода,
		|	ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) КАК ИсчисленныеОПВ,
		|	ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0) КАК ИсчисленныеСО,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0) <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0) < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0)
		|	КОНЕЦ КАК ОбъектИсчисленияСН,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0) <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0) < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|				И РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода * ЕСТЬNULL(СтавкиСН.Ставка, 0) >= ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода * ЕСТЬNULL(СтавкиСН.Ставка, 0) - ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|		КОГДА (Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0)) * ЕСТЬNULL(СтавкиСН.Ставка, 0) >= ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|			ТОГДА (Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0)) * ЕСТЬNULL(СтавкиСН.Ставка, 0) - ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ИсчисленныйСН
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавки КАК СтавкиСН
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиСН.МесяцНалоговогоПериода
		|			И (СтавкиСН.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СН))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленныеОПВ КАК ИсчисленныеОПВПоПериодам
		|		ПО Доходы.МесяцНалоговогоПериода = ИсчисленныеОПВПоПериодам.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ИсчисленныеОПВПоПериодам.ФизическоеЛицо
		|			И Доходы.ВидДохода = ИсчисленныеОПВПоПериодам.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленныеСО КАК ИсчисленныеСОПоПериодам
		|		ПО Доходы.МесяцНалоговогоПериода = ИсчисленныеСОПоПериодам.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ИсчисленныеСОПоПериодам.ФизическоеЛицо
		|			И Доходы.ВидДохода = ИсчисленныеСОПоПериодам.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСуммыКорректировки КАК СуммыКорректировки
		|		ПО Доходы.МесяцНалоговогоПериода = СуммыКорректировки.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = СуммыКорректировки.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныйСНПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныйСНПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныйСНПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныйСНПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныйСНПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныйСНПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныйСНПоПодразделениям.ОбъектИсчисления КАК ОбъектСНИсчисленныйРанее,
		|	ИсчисленныйСНПоПодразделениям.НалогВзнос КАК РанееИсчисленныйСН,
		|	-ИсчисленныйСНПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныйСНПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныйСНПоПодразделениям.НалогВзнос КАК ИсчисленныйСН,
		|	-ИсчисленныйСНПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияСН
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныйСНПоПодразделениям
		|ГДЕ
		|	(ИсчисленныйСНПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныйСНПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныйСНПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныйСНПоПодразделениям.НалогВзнос <> 0)";
	
	Результат = Запрос.ВыполнитьПакет();	
	УничтожитьВТ.Добавить("ВТРазмерыОграниченийПоДоходам");
	УничтожитьВТ.Добавить("ВТДанныеПоКорректировкеДоходаИПН");
	УничтожитьВТ.Добавить("ВТСуммыКорректировки");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеСНПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	РезультатЗапроса = Результат[ВсегоРезультатов - 3].Выгрузить();
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныйСНВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияСНВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектСНИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныйСН", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияСН,ИсчисленныйСН");
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеСНПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияСНВЦеломЗаПериод, 	ИсчисленныйСНВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектСНИсчисленныйРанее, 			РанееИсчисленныйСН,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход,					ОбъектИсчисленияСН, 				ИсчисленныйСН");
	
	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаСН);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);
	
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	Для Каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
		СтрокаТЗ.ИсчисленныйСН = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныйСН, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
	КонецЦикла; 

	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьСНПосле2020(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт

	УничтожитьВТ = Новый Массив;
	
	ВидНалогаВзносаСН =  Перечисления.ВидыНалоговВзносовОтчислений.СН;
	ПрименятьКорректировкуПрочихНалоговВзносовОтчислений = ЗарплатаКадрыРКПовтИсп.ПрименятьКорректировкуПрочихНалоговВзносовОтчислений(ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(Организация), МесяцНачисления);	
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаСН);
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленного СН
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаСН);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	// Статусы физических лиц как налогоплательщиков по периодам
	СоздатьВТСтатусыФизическихЛицКакНалогоплательщиков(МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТСтатусыФизическихЛицКакНалогоплательщиков");
	
	СоздатьВТДанныеПоКорректировкеДоходаИПН(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет, ИсключатьДоходыРегистратора, ПрименятьКорректировкуПрочихНалоговВзносовОтчислений);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПрименятьКорректировкуПрочихНалоговВзносовОтчислений", ПрименятьКорректировкуПрочихНалоговВзносовОтчислений);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмерыМЗППоПериодам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	РазмерыМЗППоПериодам.РазмерМЗП КАК МинимальныйРазмерОрганиченияДохода
		|ПОМЕСТИТЬ ВТРазмерыОграниченийПоДоходам
		|ИЗ
		|	ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеИПН.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДанныеИПН.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(ДанныеИПН.СуммаКорректировки) КАК СуммаКорректировки
		|ПОМЕСТИТЬ ВТСуммыКорректировки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ИсчисленныйИПН.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		ИсчисленныйИПН.ФизическоеЛицо КАК ФизическоеЛицо,
		|		ЕСТЬNULL(ИсчисленныйИПН.ПримененнаяКорректировка, 0) КАК СуммаКорректировки
		|	ИЗ
		|		ВТИсчисленныйИПН КАК ИсчисленныйИПН
		|	ГДЕ	
		|		&ПрименятьКорректировкуПрочихНалоговВзносовОтчислений
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Доходы.МесяцНалоговогоПериода,
		|		Доходы.ФизическоеЛицо,
		|		ЕСТЬNULL(ДанныеПоКорректировкеДоходаИПН.ПримененнаяКорректировка, 0)
		|	ИЗ
		|		ВТДоходы КАК Доходы
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеПоКорректировкеДоходаИПН КАК ДанныеПоКорректировкеДоходаИПН
		|			ПО Доходы.МесяцНалоговогоПериода = ДанныеПоКорректировкеДоходаИПН.МесяцНалоговогоПериода
		|				И Доходы.ФизическоеЛицо = ДанныеПоКорректировкеДоходаИПН.ФизическоеЛицо) КАК ДанныеИПН
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеИПН.МесяцНалоговогоПериода,
		|	ДанныеИПН.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода КАК МинимальныйРазмерОрганиченияДохода,
		|	ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) КАК ИсчисленныеОПВ,
		|	ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0) КАК ИсчисленныеСО,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0) - ЕСТЬNULL(ИсчисленныеВОСМСПоПериодам.ИсчисленныеВОСМС, 0) <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0) - ЕСТЬNULL(ИсчисленныеВОСМСПоПериодам.ИсчисленныеВОСМС, 0) < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0) - ЕСТЬNULL(ИсчисленныеВОСМСПоПериодам.ИсчисленныеВОСМС, 0)
		|	КОНЕЦ КАК ОбъектИсчисленияСН,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0) - ЕСТЬNULL(ИсчисленныеВОСМСПоПериодам.ИсчисленныеВОСМС, 0) <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0) - ЕСТЬNULL(ИсчисленныеВОСМСПоПериодам.ИсчисленныеВОСМС, 0) < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|				И РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода * ЕСТЬNULL(СтавкиСН.Ставка, 0) >= ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода * ЕСТЬNULL(СтавкиСН.Ставка, 0) - ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|		КОГДА (Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0) - ЕСТЬNULL(ИсчисленныеВОСМСПоПериодам.ИсчисленныеВОСМС, 0)) * ЕСТЬNULL(СтавкиСН.Ставка, 0) >= ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|			ТОГДА (Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0) - ЕСТЬNULL(ИсчисленныеВОСМСПоПериодам.ИсчисленныеВОСМС, 0)) * ЕСТЬNULL(СтавкиСН.Ставка, 0) - ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ИсчисленныйСН
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавки КАК СтавкиСН
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиСН.МесяцНалоговогоПериода
		|			И (СтавкиСН.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СН))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленныеОПВ КАК ИсчисленныеОПВПоПериодам
		|		ПО Доходы.МесяцНалоговогоПериода = ИсчисленныеОПВПоПериодам.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ИсчисленныеОПВПоПериодам.ФизическоеЛицо
		|			И Доходы.ВидДохода = ИсчисленныеОПВПоПериодам.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленныеСО КАК ИсчисленныеСОПоПериодам
		|		ПО Доходы.МесяцНалоговогоПериода = ИсчисленныеСОПоПериодам.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ИсчисленныеСОПоПериодам.ФизическоеЛицо
		|			И Доходы.ВидДохода = ИсчисленныеСОПоПериодам.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСуммыКорректировки КАК СуммыКорректировки
		|		ПО Доходы.МесяцНалоговогоПериода = СуммыКорректировки.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = СуммыКорректировки.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленныеВОСМС КАК ИсчисленныеВОСМСПоПериодам
		|		ПО Доходы.МесяцНалоговогоПериода = ИсчисленныеВОСМСПоПериодам.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ИсчисленныеВОСМСПоПериодам.ФизическоеЛицо
		|			И Доходы.ВидДохода = ИсчисленныеВОСМСПоПериодам.ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныйСНПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныйСНПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныйСНПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныйСНПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныйСНПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныйСНПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныйСНПоПодразделениям.ОбъектИсчисления КАК ОбъектСНИсчисленныйРанее,
		|	ИсчисленныйСНПоПодразделениям.НалогВзнос КАК РанееИсчисленныйСН,
		|	-ИсчисленныйСНПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныйСНПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныйСНПоПодразделениям.НалогВзнос КАК ИсчисленныйСН,
		|	-ИсчисленныйСНПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияСН
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныйСНПоПодразделениям
		|ГДЕ
		|	(ИсчисленныйСНПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныйСНПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныйСНПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныйСНПоПодразделениям.НалогВзнос <> 0)";
	
	Результат = Запрос.ВыполнитьПакет();	
	УничтожитьВТ.Добавить("ВТРазмерыОграниченийПоДоходам");
	УничтожитьВТ.Добавить("ВТДанныеПоКорректировкеДоходаИПН");
	УничтожитьВТ.Добавить("ВТСуммыКорректировки");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеСНПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	РезультатЗапроса = Результат[ВсегоРезультатов - 3].Выгрузить();
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныйСНВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияСНВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектСНИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныйСН", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаСН);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);

	// для корректного округления после распределения при достижении суммы максимального предела необходима точность 0
	ТочностьОкругления = ОписаниеСпособаОкругления.Точность - Цел(ОписаниеСпособаОкругления.Точность);
	
	Если ТочностьОкругления = 0 Тогда
		ТочностьРаспределения = 0;
	ИначеЕсли ТочностьОкругления <= 0.1 Тогда
		ТочностьРаспределения = 2;
	Иначе
		ТочностьРаспределения = 1;
	КонецЕсли;
			
	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияСН,ИсчисленныйСН", ТочностьРаспределения);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеСНПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияСНВЦеломЗаПериод, 	ИсчисленныйСНВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектСНИсчисленныйРанее, 			РанееИсчисленныйСН,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход,					ОбъектИсчисленияСН, 				ИсчисленныйСН");
	
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	
	Для Каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
		
		// спишем возникшую погрешность округления при перераспределении сумм по подразделениям
		Если СтрокаТЗ.ОблагаемыйДоход = 0
			И НЕ ОписаниеСпособаОкругления.ПравилоОкругления = Перечисления.ПравилаОкругленияПриРасчетеЗарплаты.Авто
			И (СтрокаТЗ.ИсчисленныйСН < 1 И СтрокаТЗ.ИсчисленныйСН > 0
				ИЛИ СтрокаТЗ.ИсчисленныйСН > -1 И СтрокаТЗ.ИсчисленныйСН < 0) Тогда
				
			СтрокаТЗ.ИсчисленныйСН = 0;
			
		// исчисление взносов производятся в тенге с учетом округления тиын
		Иначе
			
			СтрокаТЗ.ИсчисленныйСН = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныйСН, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
			
		КонецЕсли;
		
	КонецЦикла; 

	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьСНПосле2021(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт

	УничтожитьВТ = Новый Массив;
	
	ВидНалогаВзносаСН =  Перечисления.ВидыНалоговВзносовОтчислений.СН;
	
	// Получаем применение вычета в месяц отсутствия дохода
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(МесяцНачисления, Новый Структура("Организация", Организация));
	ДанныеОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "ЮридическоеФизическоеЛицо, ИндивидуальныйПредприниматель");
	ОрганизацияЯвляетсяИП = (ДанныеОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
	ФизическоеЛицоИП = ДанныеОрганизации.ИндивидуальныйПредприниматель;
	
	РежимНалогообложения = Перечисления.СистемыНалогообложения.Общая;
	КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя = 0;
	КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника = 0;
	
	// в расчете учитываем все три возможные положения 
	// РежимНалогообложения = ПустаяСсылка
	// для ИП и юр лица считаем как раньше
	//
	// РежимНалогообложения = Общая
	// для ИП считаем СН с учетом Коэффициентов
	// для юр лица считаем как раньше
	//
	// РежимНалогообложения = Упрощенная
	// для ИП и юр лица не считаем СН
	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		
		РежимНалогообложения = УчетнаяПолитикаНУ[0].СистемаНалогообложения;
		
		Если ОрганизацияЯвляетсяИП Тогда
			
			КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя = УчетнаяПолитикаНУ[0].КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя;
			КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника = УчетнаяПолитикаНУ[0].КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника;
			
		КонецЕсли;
		
		// не плательщик СН, независимо что в регистре
		Если РежимНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная Тогда
			КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя = 0;
			КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника 			   = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	// поддержим расчеты, существовавшие до реализации расчетов за ИП
	// РежимНалогообложения = СпециальныйНалоговыйРежимНаОсновеУпрощеннойДекларации
	// для ИП и юр лица не считаем СН с обнуленными коэффициентами
	РасчетСНПоКоэффициентуМРП = (ОрганизацияЯвляетсяИП И НЕ РежимНалогообложения = Перечисления.СистемыНалогообложения.ПустаяСсылка())
								ИЛИ (НЕ ОрганизацияЯвляетсяИП И РежимНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная);
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаСН);
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленного СН
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаСН);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	// Статусы физических лиц как налогоплательщиков по периодам
	СоздатьВТСтатусыФизическихЛицКакНалогоплательщиков(МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТСтатусыФизическихЛицКакНалогоплательщиков");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ФизическоеЛицоИП", ФизическоеЛицоИП);
	Запрос.УстановитьПараметр("МесяцНалоговогоПериода", МесяцНачисления);
	Запрос.УстановитьПараметр("РасчетСНПоКоэффициентуМРП", РасчетСНПоКоэффициентуМРП);
	Запрос.УстановитьПараметр("КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя", КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя);
	Запрос.УстановитьПараметр("КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника", КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ?(ИсключатьДоходыРегистратора, Регистратор, Неопределено));
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмерыМЗППоПериодам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	РазмерыМЗППоПериодам.РазмерМЗП КАК МинимальныйРазмерОрганиченияДохода
		|ПОМЕСТИТЬ ВТРазмерыОграниченийПоДоходам
		|ИЗ
		|	ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода КАК МинимальныйРазмерОрганиченияДохода,
		|	ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) КАК ИсчисленныеОПВ,
		|	ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0) КАК ИсчисленныеСО,
		|	ВЫБОР
		|		КОГДА &РасчетСНПоКоэффициентуМРП
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(ИсчисленныеВОСМСПоПериодам.ИсчисленныеВОСМС, 0) <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(ИсчисленныеВОСМСПоПериодам.ИсчисленныеВОСМС, 0) < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(ИсчисленныеВОСМСПоПериодам.ИсчисленныеВОСМС, 0)
		|	КОНЕЦ КАК ОбъектИсчисленияСН,
		|	ВЫБОР
		|		КОГДА &РасчетСНПоКоэффициентуМРП
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫБОР
		|							КОГДА Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства)
		|								И Доходы.ФизическоеЛицо = &ФизическоеЛицоИП
		|								ТОГДА РазмерыМРППоПериодам.РазмерМРП * &КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя
		|							КОГДА Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
		|								ТОГДА РазмерыМРППоПериодам.РазмерМРП * &КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника
		|							ИНАЧЕ 0
		|						КОНЕЦ > ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|						ТОГДА ВЫБОР
		|								КОГДА Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства)
		|									И Доходы.ФизическоеЛицо = &ФизическоеЛицоИП
		|									ТОГДА РазмерыМРППоПериодам.РазмерМРП * &КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя
		|								КОГДА Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
		|									ТОГДА РазмерыМРППоПериодам.РазмерМРП * &КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника
		|								ИНАЧЕ 0
		|							КОНЕЦ - ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(ИсчисленныеВОСМСПоПериодам.ИсчисленныеВОСМС, 0) <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(ИсчисленныеВОСМСПоПериодам.ИсчисленныеВОСМС, 0) < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|				И РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода * ЕСТЬNULL(СтавкиСН.Ставка, 0) >= ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода * ЕСТЬNULL(СтавкиСН.Ставка, 0) - ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|		КОГДА (Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(ИсчисленныеВОСМСПоПериодам.ИсчисленныеВОСМС, 0)) * ЕСТЬNULL(СтавкиСН.Ставка, 0) >= ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|			ТОГДА (Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(ИсчисленныеВОСМСПоПериодам.ИсчисленныеВОСМС, 0)) * ЕСТЬNULL(СтавкиСН.Ставка, 0) - ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ИсчисленныйСН
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыМРППоПериодам КАК РазмерыМРППоПериодам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыМРППоПериодам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавки КАК СтавкиСН
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиСН.МесяцНалоговогоПериода
		|			И (СтавкиСН.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СН))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленныеОПВ КАК ИсчисленныеОПВПоПериодам
		|		ПО Доходы.МесяцНалоговогоПериода = ИсчисленныеОПВПоПериодам.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ИсчисленныеОПВПоПериодам.ФизическоеЛицо
		|			И Доходы.ВидДохода = ИсчисленныеОПВПоПериодам.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленныеСО КАК ИсчисленныеСОПоПериодам
		|		ПО Доходы.МесяцНалоговогоПериода = ИсчисленныеСОПоПериодам.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ИсчисленныеСОПоПериодам.ФизическоеЛицо
		|			И Доходы.ВидДохода = ИсчисленныеСОПоПериодам.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленныеВОСМС КАК ИсчисленныеВОСМСПоПериодам
		|		ПО Доходы.МесяцНалоговогоПериода = ИсчисленныеВОСМСПоПериодам.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ИсчисленныеВОСМСПоПериодам.ФизическоеЛицо
		|			И Доходы.ВидДохода = ИсчисленныеВОСМСПоПериодам.ВидДохода
		|ГДЕ
		|	НЕ Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства) 
		|	ИЛИ &РасчетСНПоКоэффициентуМРП
		|
		// добавим сотрудников без дохода в месяце начисления для ИП
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	КадровыеДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя) КАК ВидДохода,
		|	РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода КАК МинимальныйРазмерОрганиченияДохода,
		|	0 КАК ИсчисленныеОПВ,
		|	0 КАК ИсчисленныеСО,
		|	0 КАК ОбъектИсчисленияСН,
		|	РазмерыМРППоПериодам.РазмерМРП * &КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника КАК ИсчисленныйСН
		|ИЗ
		|	ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходы КАК Доходы
		|		ПО Доходы.ФизическоеЛицо = КадровыеДанныеСотрудников.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО &МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыМРППоПериодам КАК РазмерыМРППоПериодам
		|		ПО &МесяцНалоговогоПериода = РазмерыМРППоПериодам.МесяцНалоговогоПериода
		|ГДЕ
		|	&РасчетСНПоКоэффициентуМРП
		|   И Доходы.ФизическоеЛицо ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ВЫБОР КОГДА &РасчетСНПоКоэффициентуМРП ТОГДА 0 ИНАЧЕ ДоходыПоПодразделениям.ОблагаемыйДоход КОНЕЦ КАК ОблагаемыйДоход,
		|	ВЫБОР КОГДА &РасчетСНПоКоэффициентуМРП ТОГДА 0 ИНАЧЕ ДоходыПоПодразделениям.НеоблагаемыйДоход КОНЕЦ КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|	И НЕ ДоходыПоПодразделениям.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства) 
		|	ИЛИ &РасчетСНПоКоэффициентуМРП
		|
		// добавим сотрудников без дохода в месяце начисления для ИП
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДанныеСотрудников.ТекущееПодразделение,
		|	&МесяцНалоговогоПериода,
		|	КадровыеДанныеСотрудников.ФизическоеЛицо,
		|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя),
		|	0,
		|	0
		|ИЗ
		|	ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходы КАК Доходы
		|		ПО Доходы.ФизическоеЛицо = КадровыеДанныеСотрудников.ФизическоеЛицо
		|ГДЕ
		|	&РасчетСНПоКоэффициентуМРП
		|   И Доходы.ФизическоеЛицо ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныйСНПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныйСНПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныйСНПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныйСНПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныйСНПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныйСНПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныйСНПоПодразделениям.ОбъектИсчисления КАК ОбъектСНИсчисленныйРанее,
		|	ИсчисленныйСНПоПодразделениям.НалогВзнос КАК РанееИсчисленныйСН,
		|	-ИсчисленныйСНПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныйСНПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныйСНПоПодразделениям.НалогВзнос КАК ИсчисленныйСН,
		|	-ИсчисленныйСНПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияСН
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныйСНПоПодразделениям
		|ГДЕ
		|	(ИсчисленныйСНПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныйСНПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныйСНПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныйСНПоПодразделениям.НалогВзнос <> 0)
		|	И НЕ ИсчисленныйСНПоПодразделениям.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства)
		|	ИЛИ &РасчетСНПоКоэффициентуМРП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(СведенияОбИсчисленииНалоговВзносовОтчислений.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.Подразделение,
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.ФизическоеЛицо,
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.ВидДохода,
		|	0,
		|	0,
		|	0,
		|	0,
		|	-СУММА(СведенияОбИсчисленииНалоговВзносовОтчислений.ОблагаемыйДоходОборот),
		|	-СУММА(СведенияОбИсчисленииНалоговВзносовОтчислений.НеоблагаемыйДоходОборот),
		|	-СУММА(СведенияОбИсчисленииНалоговВзносовОтчислений.НалогВзносОборот),
		|	-СУММА(СведенияОбИсчисленииНалоговВзносовОтчислений.ОбъектИсчисленияОборот)
		|ИЗ
		|	РегистрНакопления.СведенияОбИсчисленииНалоговВзносовОтчислений.Обороты(
		|			&МесяцНалоговогоПериода,
		|			КОНЕЦПЕРИОДА(&МесяцНалоговогоПериода, МЕСЯЦ),
		|			Регистратор,
		|			Организация = &Организация
		|				И ФизическоеЛицо В
		|					(ВЫБРАТЬ
		|						КадровыеДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо
		|					ИЗ
		|						ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|							ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходы КАК Доходы
		|							ПО Доходы.ФизическоеЛицо = КадровыеДанныеСотрудников.ФизическоеЛицо
		|					ГДЕ
		|						&РасчетСНПоКоэффициентуМРП
		|   					И Доходы.ФизическоеЛицо ЕСТЬ NULL)) КАК СведенияОбИсчисленииНалоговВзносовОтчислений
		|ГДЕ
		|	&РасчетСНПоКоэффициентуМРП
		|	И СведенияОбИсчисленииНалоговВзносовОтчислений.Регистратор <> &ИсключаемыйРегистратор
		|	И СведенияОбИсчисленииНалоговВзносовОтчислений.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СН)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.ФизическоеЛицо,
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.ВидНалогаВзносаОтчисления,
		|	НАЧАЛОПЕРИОДА(СведенияОбИсчисленииНалоговВзносовОтчислений.Период, МЕСЯЦ),
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.ВидДохода,
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.Подразделение";
	
	Результат = Запрос.ВыполнитьПакет();	
	УничтожитьВТ.Добавить("ВТРазмерыОграниченийПоДоходам");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеСНПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	РезультатЗапроса = Результат[ВсегоРезультатов - 3].Выгрузить();
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныйСНВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияСНВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектСНИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныйСН", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаСН);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);

	// для корректного округления после распределения при достижении суммы максимального предела необходима точность 0
	ТочностьОкругления = ОписаниеСпособаОкругления.Точность - Цел(ОписаниеСпособаОкругления.Точность);
	
	Если ТочностьОкругления = 0 Тогда
		ТочностьРаспределения = 0;
	ИначеЕсли ТочностьОкругления <= 0.1 Тогда
		ТочностьРаспределения = 2;
	Иначе
		ТочностьРаспределения = 1;
	КонецЕсли;
			
	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияСН,ИсчисленныйСН", ТочностьРаспределения);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеСНПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияСНВЦеломЗаПериод, 	ИсчисленныйСНВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектСНИсчисленныйРанее, 			РанееИсчисленныйСН,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход,					ОбъектИсчисленияСН, 				ИсчисленныйСН");
	
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	
	Для Каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
		
		// спишем возникшую погрешность округления при перераспределении сумм по подразделениям
		Если СтрокаТЗ.ОблагаемыйДоход = 0
			И НЕ ОписаниеСпособаОкругления.ПравилоОкругления = Перечисления.ПравилаОкругленияПриРасчетеЗарплаты.Авто
			И (СтрокаТЗ.ИсчисленныйСН < 1 И СтрокаТЗ.ИсчисленныйСН > 0
				ИЛИ СтрокаТЗ.ИсчисленныйСН > -1 И СтрокаТЗ.ИсчисленныйСН < 0) Тогда
				
			СтрокаТЗ.ИсчисленныйСН = 0;
			
		// исчисление взносов производятся в тенге с учетом округления тиын
		Иначе
			
			СтрокаТЗ.ИсчисленныйСН = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныйСН, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
			
		КонецЕсли;
		
	КонецЦикла; 

	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьСНПосле2022(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт

	УничтожитьВТ = Новый Массив;
	
	ВидНалогаВзносаСН =  Перечисления.ВидыНалоговВзносовОтчислений.СН;
	
	// Получаем применение вычета в месяц отсутствия дохода
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(МесяцНачисления, Новый Структура("Организация", Организация));
	ДанныеОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "ЮридическоеФизическоеЛицо, ИндивидуальныйПредприниматель");
	ОрганизацияЯвляетсяИП = (ДанныеОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
	ФизическоеЛицоИП = ДанныеОрганизации.ИндивидуальныйПредприниматель;
	
	РежимНалогообложения = Перечисления.СистемыНалогообложения.Общая;
	КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя = 0;
	КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника = 0;
	
	// в расчете учитываем все три возможные положения 
	// РежимНалогообложения = ПустаяСсылка
	// для ИП и юр лица считаем как раньше
	//
	// РежимНалогообложения = Общая
	// для ИП считаем СН с учетом Коэффициентов
	// для юр лица считаем как раньше
	//
	// РежимНалогообложения = Упрощенная
	// для ИП и юр лица не считаем СН
	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		
		РежимНалогообложения = УчетнаяПолитикаНУ[0].СистемаНалогообложения;
		
		Если ОрганизацияЯвляетсяИП Тогда
			
			КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя = УчетнаяПолитикаНУ[0].КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя;
			КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника = УчетнаяПолитикаНУ[0].КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника;
			
		КонецЕсли;
		
		// не плательщик СН, независимо что в регистре
		Если РежимНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная Тогда
			КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя = 0;
			КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника 			   = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	// поддержим расчеты, существовавшие до реализации расчетов за ИП
	// РежимНалогообложения = СпециальныйНалоговыйРежимНаОсновеУпрощеннойДекларации
	// для ИП и юр лица не считаем СН с обнуленными коэффициентами
	РасчетСНПоКоэффициентуМРП = (ОрганизацияЯвляетсяИП И НЕ РежимНалогообложения = Перечисления.СистемыНалогообложения.ПустаяСсылка())
								ИЛИ (НЕ ОрганизацияЯвляетсяИП И РежимНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная);
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаСН);
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленного СН
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаСН);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	// Статусы физических лиц как налогоплательщиков по периодам
	СоздатьВТСтатусыФизическихЛицКакНалогоплательщиков(МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТСтатусыФизическихЛицКакНалогоплательщиков");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ФизическоеЛицоИП", ФизическоеЛицоИП);
	Запрос.УстановитьПараметр("МесяцНалоговогоПериода", МесяцНачисления);
	Запрос.УстановитьПараметр("РасчетСНПоКоэффициентуМРП", РасчетСНПоКоэффициентуМРП);
	Запрос.УстановитьПараметр("КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя", КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя);
	Запрос.УстановитьПараметр("КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника", КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ?(ИсключатьДоходыРегистратора, Регистратор, Неопределено));
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТРазмерыМРППоПериодам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ВТРазмерыМРППоПериодам.РазмерМРП * 14 КАК МинимальныйРазмерОрганиченияДохода
		|ПОМЕСТИТЬ ВТРазмерыОграниченийПоДоходам
		|ИЗ
		|	ВТРазмерыМРППоПериодам КАК ВТРазмерыМРППоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода КАК МинимальныйРазмерОрганиченияДохода,
		|	ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) КАК ИсчисленныеОПВ,
		|	ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0) КАК ИсчисленныеСО,
		|	ВЫБОР
		|		КОГДА &РасчетСНПоКоэффициентуМРП
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(ИсчисленныеВОСМСПоПериодам.ИсчисленныеВОСМС, 0) <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(ИсчисленныеВОСМСПоПериодам.ИсчисленныеВОСМС, 0) < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(ИсчисленныеВОСМСПоПериодам.ИсчисленныеВОСМС, 0)
		|	КОНЕЦ КАК ОбъектИсчисленияСН,
		|	ВЫБОР
		|		КОГДА &РасчетСНПоКоэффициентуМРП
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫБОР
		|							КОГДА Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства)
		|								И Доходы.ФизическоеЛицо = &ФизическоеЛицоИП
		|								ТОГДА РазмерыМРППоПериодам.РазмерМРП * &КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя
		|							КОГДА Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
		|								ТОГДА РазмерыМРППоПериодам.РазмерМРП * &КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника
		|							ИНАЧЕ 0
		|						КОНЕЦ > ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|						ТОГДА ВЫБОР
		|								КОГДА Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства)
		|									И Доходы.ФизическоеЛицо = &ФизическоеЛицоИП
		|									ТОГДА РазмерыМРППоПериодам.РазмерМРП * &КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя
		|								КОГДА Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
		|									ТОГДА РазмерыМРППоПериодам.РазмерМРП * &КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника
		|								ИНАЧЕ 0
		|							КОНЕЦ - ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(ИсчисленныеВОСМСПоПериодам.ИсчисленныеВОСМС, 0) <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(ИсчисленныеВОСМСПоПериодам.ИсчисленныеВОСМС, 0) < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|				И РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода * ЕСТЬNULL(СтавкиСН.Ставка, 0) >= ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода * ЕСТЬNULL(СтавкиСН.Ставка, 0) - ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|		КОГДА (Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(ИсчисленныеВОСМСПоПериодам.ИсчисленныеВОСМС, 0)) * ЕСТЬNULL(СтавкиСН.Ставка, 0) >= ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|			ТОГДА (Доходы.ОблагаемыйДоход - ЕСТЬNULL(ИсчисленныеОПВПоПериодам.ИсчисленныеОПВ, 0) - ЕСТЬNULL(ИсчисленныеВОСМСПоПериодам.ИсчисленныеВОСМС, 0)) * ЕСТЬNULL(СтавкиСН.Ставка, 0) - ЕСТЬNULL(ИсчисленныеСОПоПериодам.ИсчисленныеСО, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ИсчисленныйСН
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыМРППоПериодам КАК РазмерыМРППоПериодам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыМРППоПериодам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавки КАК СтавкиСН
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиСН.МесяцНалоговогоПериода
		|			И (СтавкиСН.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СН))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленныеОПВ КАК ИсчисленныеОПВПоПериодам
		|		ПО Доходы.МесяцНалоговогоПериода = ИсчисленныеОПВПоПериодам.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ИсчисленныеОПВПоПериодам.ФизическоеЛицо
		|			И Доходы.ВидДохода = ИсчисленныеОПВПоПериодам.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленныеСО КАК ИсчисленныеСОПоПериодам
		|		ПО Доходы.МесяцНалоговогоПериода = ИсчисленныеСОПоПериодам.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ИсчисленныеСОПоПериодам.ФизическоеЛицо
		|			И Доходы.ВидДохода = ИсчисленныеСОПоПериодам.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленныеВОСМС КАК ИсчисленныеВОСМСПоПериодам
		|		ПО Доходы.МесяцНалоговогоПериода = ИсчисленныеВОСМСПоПериодам.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = ИсчисленныеВОСМСПоПериодам.ФизическоеЛицо
		|			И Доходы.ВидДохода = ИсчисленныеВОСМСПоПериодам.ВидДохода
		|ГДЕ
		|	НЕ Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства) 
		|	ИЛИ &РасчетСНПоКоэффициентуМРП
		|
		// добавим сотрудников без дохода в месяце начисления для ИП
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	КадровыеДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя) КАК ВидДохода,
		|	РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода КАК МинимальныйРазмерОрганиченияДохода,
		|	0 КАК ИсчисленныеОПВ,
		|	0 КАК ИсчисленныеСО,
		|	0 КАК ОбъектИсчисленияСН,
		|	РазмерыМРППоПериодам.РазмерМРП * &КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника КАК ИсчисленныйСН
		|ИЗ
		|	ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходы КАК Доходы
		|		ПО Доходы.ФизическоеЛицо = КадровыеДанныеСотрудников.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО &МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыМРППоПериодам КАК РазмерыМРППоПериодам
		|		ПО &МесяцНалоговогоПериода = РазмерыМРППоПериодам.МесяцНалоговогоПериода
		|ГДЕ
		|	&РасчетСНПоКоэффициентуМРП
		|   И Доходы.ФизическоеЛицо ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ВЫБОР КОГДА &РасчетСНПоКоэффициентуМРП ТОГДА 0 ИНАЧЕ ДоходыПоПодразделениям.ОблагаемыйДоход КОНЕЦ КАК ОблагаемыйДоход,
		|	ВЫБОР КОГДА &РасчетСНПоКоэффициентуМРП ТОГДА 0 ИНАЧЕ ДоходыПоПодразделениям.НеоблагаемыйДоход КОНЕЦ КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|	И НЕ ДоходыПоПодразделениям.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства) 
		|	ИЛИ &РасчетСНПоКоэффициентуМРП
		|
		// добавим сотрудников без дохода в месяце начисления для ИП
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыеДанныеСотрудников.ТекущееПодразделение,
		|	&МесяцНалоговогоПериода,
		|	КадровыеДанныеСотрудников.ФизическоеЛицо,
		|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя),
		|	0,
		|	0
		|ИЗ
		|	ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходы КАК Доходы
		|		ПО Доходы.ФизическоеЛицо = КадровыеДанныеСотрудников.ФизическоеЛицо
		|ГДЕ
		|	&РасчетСНПоКоэффициентуМРП
		|   И Доходы.ФизическоеЛицо ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныйСНПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныйСНПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныйСНПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныйСНПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныйСНПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныйСНПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныйСНПоПодразделениям.ОбъектИсчисления КАК ОбъектСНИсчисленныйРанее,
		|	ИсчисленныйСНПоПодразделениям.НалогВзнос КАК РанееИсчисленныйСН,
		|	-ИсчисленныйСНПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныйСНПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныйСНПоПодразделениям.НалогВзнос КАК ИсчисленныйСН,
		|	-ИсчисленныйСНПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияСН
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныйСНПоПодразделениям
		|ГДЕ
		|	(ИсчисленныйСНПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныйСНПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныйСНПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныйСНПоПодразделениям.НалогВзнос <> 0)
		|	И НЕ ИсчисленныйСНПоПодразделениям.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства)
		|	ИЛИ &РасчетСНПоКоэффициентуМРП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(СведенияОбИсчисленииНалоговВзносовОтчислений.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.Подразделение,
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.ФизическоеЛицо,
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.ВидДохода,
		|	0,
		|	0,
		|	0,
		|	0,
		|	-СУММА(СведенияОбИсчисленииНалоговВзносовОтчислений.ОблагаемыйДоходОборот),
		|	-СУММА(СведенияОбИсчисленииНалоговВзносовОтчислений.НеоблагаемыйДоходОборот),
		|	-СУММА(СведенияОбИсчисленииНалоговВзносовОтчислений.НалогВзносОборот),
		|	-СУММА(СведенияОбИсчисленииНалоговВзносовОтчислений.ОбъектИсчисленияОборот)
		|ИЗ
		|	РегистрНакопления.СведенияОбИсчисленииНалоговВзносовОтчислений.Обороты(
		|			&МесяцНалоговогоПериода,
		|			КОНЕЦПЕРИОДА(&МесяцНалоговогоПериода, МЕСЯЦ),
		|			Регистратор,
		|			Организация = &Организация
		|				И ФизическоеЛицо В
		|					(ВЫБРАТЬ
		|						КадровыеДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо
		|					ИЗ
		|						ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|							ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходы КАК Доходы
		|							ПО Доходы.ФизическоеЛицо = КадровыеДанныеСотрудников.ФизическоеЛицо
		|					ГДЕ
		|						&РасчетСНПоКоэффициентуМРП
		|   					И Доходы.ФизическоеЛицо ЕСТЬ NULL)) КАК СведенияОбИсчисленииНалоговВзносовОтчислений
		|ГДЕ
		|	&РасчетСНПоКоэффициентуМРП
		|	И СведенияОбИсчисленииНалоговВзносовОтчислений.Регистратор <> &ИсключаемыйРегистратор
		|	И СведенияОбИсчисленииНалоговВзносовОтчислений.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СН)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.ФизическоеЛицо,
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.ВидНалогаВзносаОтчисления,
		|	НАЧАЛОПЕРИОДА(СведенияОбИсчисленииНалоговВзносовОтчислений.Период, МЕСЯЦ),
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.ВидДохода,
		|	СведенияОбИсчисленииНалоговВзносовОтчислений.Подразделение";
	
	Результат = Запрос.ВыполнитьПакет();	
	УничтожитьВТ.Добавить("ВТРазмерыОграниченийПоДоходам");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеСНПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	РезультатЗапроса = Результат[ВсегоРезультатов - 3].Выгрузить();
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныйСНВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияСНВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектСНИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныйСН", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаСН);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);

	// для корректного округления после распределения при достижении суммы максимального предела необходима точность 0
	ТочностьОкругления = ОписаниеСпособаОкругления.Точность - Цел(ОписаниеСпособаОкругления.Точность);
	
	Если ТочностьОкругления = 0 Тогда
		ТочностьРаспределения = 0;
	ИначеЕсли ТочностьОкругления <= 0.1 Тогда
		ТочностьРаспределения = 2;
	Иначе
		ТочностьРаспределения = 1;
	КонецЕсли;
			
	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияСН,ИсчисленныйСН", ТочностьРаспределения);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеСНПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияСНВЦеломЗаПериод, 	ИсчисленныйСНВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектСНИсчисленныйРанее, 			РанееИсчисленныйСН,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход,					ОбъектИсчисленияСН, 				ИсчисленныйСН");
	
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	
	Для Каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
		
		// спишем возникшую погрешность округления при перераспределении сумм по подразделениям
		Если СтрокаТЗ.ОблагаемыйДоход = 0
			И НЕ ОписаниеСпособаОкругления.ПравилоОкругления = Перечисления.ПравилаОкругленияПриРасчетеЗарплаты.Авто
			И (СтрокаТЗ.ИсчисленныйСН < 1 И СтрокаТЗ.ИсчисленныйСН > 0
				ИЛИ СтрокаТЗ.ИсчисленныйСН > -1 И СтрокаТЗ.ИсчисленныйСН < 0) Тогда
				
			СтрокаТЗ.ИсчисленныйСН = 0;
			
		// исчисление взносов производятся в тенге с учетом округления тиын
		Иначе
			
			СтрокаТЗ.ИсчисленныйСН = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныйСН, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
			
		КонецЕсли;
		
	КонецЦикла; 

	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьОППВДо2019(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	// Получение сведений по коэффициенту отработанного времени во вредных условиях
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ИспользоватьШтатноеРасписание", ПолучитьФункциональнуюОпцию("ИспользоватьШтатноеРасписание"));
	
	// Сведения о необходимости исчисления ОППВ
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПериодыУсловийТруда.МесяцНалоговогоПериода,
		|	ПериодыУсловийТруда.Должность,
		|	КлассыУсловийТрудаПоДолжностям.ОсуществляютсяОППВ
		|ПОМЕСТИТЬ ВТОсобенностиИсчисленияОППВ
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПериодыРасчета.Период КАК МесяцНалоговогоПериода,
		|		КлассыУсловийТрудаПоДолжностям.Должность КАК Должность,
		|		МАКСИМУМ(КлассыУсловийТрудаПоДолжностям.Период) КАК Период
		|	ИЗ
		|		ВТДатыПоМесяцам КАК ПериодыРасчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлассыУсловийТрудаПоДолжностям КАК КлассыУсловийТрудаПоДолжностям
		|			ПО ПериодыРасчета.Период >= КлассыУсловийТрудаПоДолжностям.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		КлассыУсловийТрудаПоДолжностям.Должность,
		|		ПериодыРасчета.Период) КАК ПериодыУсловийТруда
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлассыУсловийТрудаПоДолжностям КАК КлассыУсловийТрудаПоДолжностям
		|		ПО ПериодыУсловийТруда.Период = КлассыУсловийТрудаПоДолжностям.Период
		|			И ПериодыУсловийТруда.Должность = КлассыУсловийТрудаПоДолжностям.Должность";
		
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТОсобенностиИсчисленияОППВ");
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(НАЧАЛОПЕРИОДА(ПериодыПоСотрудникам.МесяцНалоговогоПериода, МЕСЯЦ)) КАК НачалоПериода,
		|	МАКСИМУМ(КОНЕЦПЕРИОДА(ПериодыПоСотрудникам.МесяцНалоговогоПериода, МЕСЯЦ)) КАК КонецПериода,
		|	ПериодыПоСотрудникам.Сотрудник,
		|	ПериодыПоСотрудникам.ФизическоеЛицо
		|ПОМЕСТИТЬ ВТПериодыКадровыхДанныхСотрудников
		|ИЗ
		|	ВТКадровыеДанныеСотрудниковПоПериодам КАК ПериодыПоСотрудникам
		|
		|СГРУППИРОВАТЬ ПО
		|	ПериодыПоСотрудникам.Сотрудник,
		|	ПериодыПоСотрудникам.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ПериодыКадровойИстории.Период, ДЕНЬ) КАК КадровыйПериод,
		|	ПериодыКадровойИстории.Сотрудник,
		|	КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию,
		|	КадроваяИсторияСотрудников.Должность
		|ПОМЕСТИТЬ ВТДанныеЗанимаемыхДолжностей
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(КадроваяИсторияСотрудников.Период) КАК Период,
		|		КадроваяИсторияСотрудников.Сотрудник КАК Сотрудник,
		|		ВТПериодыСотрудников.НачалоПериода КАК НачалоПериода
		|	ИЗ
		|		РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериодыКадровыхДанныхСотрудников КАК ВТПериодыСотрудников
		|			ПО КадроваяИсторияСотрудников.Сотрудник = ВТПериодыСотрудников.Сотрудник
		|				И КадроваяИсторияСотрудников.Период <= ВТПериодыСотрудников.НачалоПериода
		|	
		|	СГРУППИРОВАТЬ ПО
		|		КадроваяИсторияСотрудников.Сотрудник,
		|		ВТПериодыСотрудников.НачалоПериода) КАК ПериодыКадровойИстории
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
		|		ПО ПериодыКадровойИстории.Период = КадроваяИсторияСотрудников.Период
		|			И ПериодыКадровойИстории.Сотрудник = КадроваяИсторияСотрудников.Сотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(КадроваяИсторияСотрудников.Период, ДЕНЬ),
		|	КадроваяИсторияСотрудников.Сотрудник,
		|	КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию,
		|	КадроваяИсторияСотрудников.Должность
		|ИЗ
		|	РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериодыКадровыхДанныхСотрудников КАК ВТПериодыСотрудников
		|		ПО КадроваяИсторияСотрудников.Сотрудник = ВТПериодыСотрудников.Сотрудник
		|			И (КадроваяИсторияСотрудников.Период МЕЖДУ ВТПериодыСотрудников.НачалоПериода И ВТПериодыСотрудников.КонецПериода)";

	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТПериодыКадровыхДанныхСотрудников");
	УничтожитьВТ.Добавить("ВТДанныеЗанимаемыхДолжностей");
	
	Если ПолучитьФункциональнуюОпцию("ВестиУчетРабочегоВремениПоУсловиямТруда", Новый Структура("Организация", Организация)) Тогда
		
		// Расчет по данным Табеля	
		ТекстЗапроса = 	
			"ВЫБРАТЬ
			|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы КАК Сотрудник,
			|	КадровыеДанныеСотрудниковПоПериодам.ФизическоеЛицо,
			|	ГрафикиРаботыПоВидамВремени.УсловияТруда,
			|	КадровыеДанныеСотрудниковПоПериодам.МесяцНалоговогоПериода,
			|	СУММА(ВЫБОР
			|			КОГДА ГрафикиРаботыПоВидамВремени.ВремяВЧасах
			|				ТОГДА ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение
			|			ИНАЧЕ ГрафикиРаботыПоВидамВремени.ОсновноеЗначение
			|		КОНЕЦ) КАК ДнейОтработано,
			|	СУММА(ВЫБОР
			|			КОГДА ГрафикиРаботыПоВидамВремени.ВремяВЧасах
			|				ТОГДА ГрафикиРаботыПоВидамВремени.ОсновноеЗначение
			|			ИНАЧЕ ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение
			|		КОНЕЦ) КАК ЧасовОтработано,
			|	СУММА(ВЫБОР
			|			КОГДА ГрафикиРаботыПоВидамВремени.ВремяВЧасах
			|				ТОГДА ГрафикиРаботыПоВидамВремени.ДополнительноеЗначениеНорма
			|			ИНАЧЕ ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма
			|		КОНЕЦ) КАК ДнейНорма,
			|	СУММА(ВЫБОР
			|			КОГДА ГрафикиРаботыПоВидамВремени.ВремяВЧасах
			|				ТОГДА ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма
			|			ИНАЧЕ ГрафикиРаботыПоВидамВремени.ДополнительноеЗначениеНорма
			|		КОНЕЦ) КАК ЧасовНорма
			|ПОМЕСТИТЬ ВТОтработанноеВремяПоУсловиямТруда
			|ИЗ
			|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудниковПоПериодам КАК КадровыеДанныеСотрудниковПоПериодам
			|		ПО ГрафикиРаботыПоВидамВремени.ГрафикРаботы = КадровыеДанныеСотрудниковПоПериодам.Сотрудник
			|			И ГрафикиРаботыПоВидамВремени.Месяц = КадровыеДанныеСотрудниковПоПериодам.МесяцНалоговогоПериода
			|ГДЕ
			|	ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Справочник.ВидыИспользованияРабочегоВремени.РабочееВремя)
			|
			|СГРУППИРОВАТЬ ПО
			|	КадровыеДанныеСотрудниковПоПериодам.МесяцНалоговогоПериода,
			|	ГрафикиРаботыПоВидамВремени.УсловияТруда,
			|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
			|	КадровыеДанныеСотрудниковПоПериодам.ФизическоеЛицо";
		УничтожитьВТ.Добавить("ВТОтработанноеВремяПоУсловиямТруда");
	Иначе
		
		ОписаниеФильтраПолученияГрафиков = ЗарплатаКадрыПериодическиеРегистры.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТПериодыКадровыхДанныхСотрудников", "Сотрудник");				
		ОписаниеФильтраПолученияГрафиков.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("Сотрудник", "Сотрудник");
		ОписаниеФильтраПолученияГрафиков.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("ДатаНачала", "НачалоПериода");
		ОписаниеФильтраПолученияГрафиков.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("ДатаОкончания", "КонецПериода");
		
		ЗарплатаКадрыПериодическиеРегистры.СоздатьВТИмяРегистраПериоды("ГрафикРаботыСотрудников", МенеджерВременныхТаблиц, Ложь, ОписаниеФильтраПолученияГрафиков, , "ВТГрафикиРаботы");
		
		ТекстЗапроса = "
			|ВЫБРАТЬ
			|	ПериодыГрафиков.НачалоПериода КАК ПериодГрафика,
			|	ПериодыГрафиков.Сотрудник,
			|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ПериодыГрафиков.ГрафикРаботы
			|ПОМЕСТИТЬ ВТГрафикиРаботыСотрудников
			|ИЗ
			|	ВТГрафикиРаботы КАК ПериодыГрафиков
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
			|		ПО ПериодыГрафиков.Сотрудник = Сотрудники.Ссылка";
			
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		УничтожитьВТ.Добавить("ВТГрафикиРаботы");
		
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ГрафикиРаботыСотрудников.Сотрудник КАК Сотрудник,
			|	ГрафикиРаботыСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДанныеПроизводственногоКалендаря.Дата КАК Дата,
			|	МАКСИМУМ(ГрафикиРаботыСотрудников.ПериодГрафика) КАК ПериодГрафика
			|ПОМЕСТИТЬ ВТПериодыГрафиковРаботы
			|ИЗ
			|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТГрафикиРаботыСотрудников КАК ГрафикиРаботыСотрудников
			|		ПО ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = ГрафикиРаботыСотрудников.ГрафикРаботы.ПроизводственныйКалендарь
			|			И ДанныеПроизводственногоКалендаря.Дата >= ГрафикиРаботыСотрудников.ПериодГрафика
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериодыКадровыхДанныхСотрудников КАК ПериодыСотрудников
			|		ПО (ГрафикиРаботыСотрудников.Сотрудник = ПериодыСотрудников.Сотрудник)
			|			И (ДанныеПроизводственногоКалендаря.Дата МЕЖДУ ПериодыСотрудников.НачалоПериода И ПериодыСотрудников.КонецПериода)
			|
			|СГРУППИРОВАТЬ ПО
			|	ГрафикиРаботыСотрудников.Сотрудник,
			|	ГрафикиРаботыСотрудников.ФизическоеЛицо,
			|	ДанныеПроизводственногоКалендаря.Дата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПериодыГрафиковРаботы.Сотрудник,
			|	ПериодыГрафиковРаботы.ФизическоеЛицо,
			|	ПериодыГрафиковРаботы.Дата,
			|	ГрафикиРаботыСотрудников.ГрафикРаботы
			|ПОМЕСТИТЬ ВТРабочиеДатыСотрудников
			|ИЗ
			|	ВТПериодыГрафиковРаботы КАК ПериодыГрафиковРаботы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТГрафикиРаботыСотрудников КАК ГрафикиРаботыСотрудников
			|		ПО ПериодыГрафиковРаботы.Сотрудник = ГрафикиРаботыСотрудников.Сотрудник
			|			И ПериодыГрафиковРаботы.ПериодГрафика = ГрафикиРаботыСотрудников.ПериодГрафика
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РабочиеДатыСотрудников.Сотрудник,
			|	РабочиеДатыСотрудников.ФизическоеЛицо,
			|	ГрафикиРаботыПоВидамВремени.Месяц КАК МесяцНалоговогоПериода,
			|	РабочиеДатыСотрудников.Дата,
			|	РабочиеДатыСотрудников.ГрафикРаботы,
			|	СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначение) КАК ДнейОтработано,
			|	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК ЧасовОтработано,
			|	СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма) КАК ДнейНорма,
			|	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначениеНорма) КАК ЧасовНорма
			|ПОМЕСТИТЬ ВТОтработанноеВремяПоПлану
			|ИЗ
			|	ВТРабочиеДатыСотрудников КАК РабочиеДатыСотрудников
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
			|		ПО РабочиеДатыСотрудников.Дата = ГрафикиРаботыПоВидамВремени.Дата
			|			И РабочиеДатыСотрудников.ГрафикРаботы = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
			|			И (ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Справочник.ВидыИспользованияРабочегоВремени.РабочееВремя))
			|			И (НЕ ГрафикиРаботыПоВидамВремени.ВремяВЧасах)
			|
			|СГРУППИРОВАТЬ ПО
			|	РабочиеДатыСотрудников.Сотрудник,
			|	РабочиеДатыСотрудников.ФизическоеЛицо,
			|	РабочиеДатыСотрудников.Дата,
			|	РабочиеДатыСотрудников.ГрафикРаботы,
			|	ГрафикиРаботыПоВидамВремени.Месяц"; 
			
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		УничтожитьВТ.Добавить("ВТПериодыГрафиковРаботы");
		УничтожитьВТ.Добавить("ВТРабочиеДатыСотрудников");
		УничтожитьВТ.Добавить("ВТОтработанноеВремяПоПлану");
		
		// Вычисляем условия труда на каждый отработанный день
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДанныеОтработанногоВремени.Сотрудник,
			|	ДанныеОтработанногоВремени.ФизическоеЛицо,
			|	ДанныеОтработанногоВремени.МесяцНалоговогоПериода,
			|	ДанныеОтработанногоВремени.Дата
			|ПОМЕСТИТЬ ВТДатыОтработанногоВремени
			|ИЗ
			|	ВТОтработанноеВремяПоПлану КАК ДанныеОтработанногоВремени
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПериодыЗанимаемыхДолжностей.КадровыйПериод,
			|	ПериодыЗанимаемыхДолжностей.Сотрудник,
			|	ПериодыЗанимаемыхДолжностей.ФизическоеЛицо,
			|	ПериодыЗанимаемыхДолжностей.МесяцНалоговогоПериода,
			|	ПериодыЗанимаемыхДолжностей.Дата КАК ДатаГрафика,
			|	ДанныеЗанимаемыхДолжностей.ДолжностьПоШтатномуРасписанию,
			|	ДанныеЗанимаемыхДолжностей.Должность
			|ПОМЕСТИТЬ ВТКадровыеДанныеПоДатамГрафика
			|ИЗ
			|	(ВЫБРАТЬ
			|		МАКСИМУМ(ДанныеЗанимаемыхДолжностей.КадровыйПериод) КАК КадровыйПериод,
			|		ДанныеЗанимаемыхДолжностей.Сотрудник КАК Сотрудник,
			|		ДатыОтработанногоВремени.ФизическоеЛицо КАК ФизическоеЛицо,
			|		ДатыОтработанногоВремени.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
			|		ДатыОтработанногоВремени.Дата КАК Дата
			|	ИЗ
			|		ВТДанныеЗанимаемыхДолжностей КАК ДанныеЗанимаемыхДолжностей
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыОтработанногоВремени КАК ДатыОтработанногоВремени
			|			ПО ДанныеЗанимаемыхДолжностей.Сотрудник = ДатыОтработанногоВремени.Сотрудник
			|				И ДанныеЗанимаемыхДолжностей.КадровыйПериод <= ДатыОтработанногоВремени.Дата
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ДатыОтработанногоВремени.МесяцНалоговогоПериода,
			|		ДатыОтработанногоВремени.Дата,
			|		ДатыОтработанногоВремени.ФизическоеЛицо,
			|		ДанныеЗанимаемыхДолжностей.Сотрудник) КАК ПериодыЗанимаемыхДолжностей
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеЗанимаемыхДолжностей КАК ДанныеЗанимаемыхДолжностей
			|		ПО ПериодыЗанимаемыхДолжностей.Сотрудник = ДанныеЗанимаемыхДолжностей.Сотрудник
			|			И ПериодыЗанимаемыхДолжностей.КадровыйПериод = ДанныеЗанимаемыхДолжностей.КадровыйПериод
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДанныеОтработанногоВремени.Сотрудник,
			|	ДанныеОтработанногоВремени.ФизическоеЛицо,
			|	ДанныеОтработанногоВремени.МесяцНалоговогоПериода,
			|	ДанныеОтработанногоВремени.Дата,
			|	СУММА(ДанныеОтработанногоВремени.ДнейОтработано) КАК ДнейОтработано,
			|	СУММА(ДанныеОтработанногоВремени.ЧасовОтработано) КАК ЧасовОтработано,
			|	СУММА(ДанныеОтработанногоВремени.ДнейНорма) КАК ДнейНорма,
			|	СУММА(ДанныеОтработанногоВремени.ЧасовНорма) КАК ЧасовНорма,
			|	ВЫБОР
			|		КОГДА &ИспользоватьШтатноеРасписание
			|			ТОГДА КадровыеДанныеПоДатамГрафика.ДолжностьПоШтатномуРасписанию
			|		ИНАЧЕ КадровыеДанныеПоДатамГрафика.Должность
			|	КОНЕЦ КАК УсловияТруда
			|ПОМЕСТИТЬ ВТОтработанноеВремяПоУсловиямТруда
			|ИЗ
			|	ВТКадровыеДанныеПоДатамГрафика КАК КадровыеДанныеПоДатамГрафика
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтработанноеВремяПоПлану КАК ДанныеОтработанногоВремени
			|		ПО КадровыеДанныеПоДатамГрафика.Сотрудник = ДанныеОтработанногоВремени.Сотрудник
			|			И КадровыеДанныеПоДатамГрафика.МесяцНалоговогоПериода = ДанныеОтработанногоВремени.МесяцНалоговогоПериода
			|			И КадровыеДанныеПоДатамГрафика.ДатаГрафика = ДанныеОтработанногоВремени.Дата
			|
			|СГРУППИРОВАТЬ ПО
			|	ДанныеОтработанногоВремени.Сотрудник,
			|	ДанныеОтработанногоВремени.ФизическоеЛицо,
			|	ДанныеОтработанногоВремени.МесяцНалоговогоПериода,
			|	ДанныеОтработанногоВремени.Дата,
			|	ВЫБОР
			|		КОГДА &ИспользоватьШтатноеРасписание
			|			ТОГДА КадровыеДанныеПоДатамГрафика.ДолжностьПоШтатномуРасписанию
			|		ИНАЧЕ КадровыеДанныеПоДатамГрафика.Должность
			|	КОНЕЦ";
		УничтожитьВТ.Добавить("ВТДатыОтработанногоВремени");
		УничтожитьВТ.Добавить("ВТКадровыеДанныеПоДатамГрафика");
		УничтожитьВТ.Добавить("ВТОтработанноеВремяПоУсловиямТруда");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	// Получаем необходимость исчисления ОППВ,
	// если сотрудник отработал 80% во вредных условиях
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтработанноеВремя.ФизическоеЛицо,
		|	ОтработанноеВремя.МесяцНалоговогоПериода,
		|	СУММА(ОтработанноеВремя.ДнейНорма) КАК ДнейНорма,
		|	СУММА(ОтработанноеВремя.ЧасовНорма) КАК ЧасовНорма
		|ПОМЕСТИТЬ ВТНормаВремени
		|ИЗ
		|	ВТОтработанноеВремяПоУсловиямТруда КАК ОтработанноеВремя
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтработанноеВремя.МесяцНалоговогоПериода,
		|	ОтработанноеВремя.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОтработанноеВремяПоУсловиямТруда.ФизическоеЛицо,
		|	ВТОтработанноеВремяПоУсловиямТруда.МесяцНалоговогоПериода,
		|	СУММА(ВТОтработанноеВремяПоУсловиямТруда.ЧасовОтработано) КАК ЧасовОтработано,
		|	ЕСТЬNULL(ВТОсобенностиИсчисленияОППВ.ОсуществляютсяОППВ, ЛОЖЬ) КАК ОсуществляютсяОППВ
		|ПОМЕСТИТЬ ВТОтработанноеВремя
		|ИЗ
		|	ВТОтработанноеВремяПоУсловиямТруда КАК ВТОтработанноеВремяПоУсловиямТруда
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсобенностиИсчисленияОППВ КАК ВТОсобенностиИсчисленияОППВ
		|		ПО ВТОтработанноеВремяПоУсловиямТруда.УсловияТруда = ВТОсобенностиИсчисленияОППВ.Должность
		|			И ВТОтработанноеВремяПоУсловиямТруда.МесяцНалоговогоПериода = ВТОсобенностиИсчисленияОППВ.МесяцНалоговогоПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТОтработанноеВремяПоУсловиямТруда.МесяцНалоговогоПериода,
		|	ВТОтработанноеВремяПоУсловиямТруда.ФизическоеЛицо,
		|	ЕСТЬNULL(ВТОсобенностиИсчисленияОППВ.ОсуществляютсяОППВ, ЛОЖЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОтработанноеВремя.ФизическоеЛицо,
		|	ВТОтработанноеВремя.МесяцНалоговогоПериода,
		|	ВЫБОР
		|		КОГДА ВТНормаВремени.ЧасовНорма ЕСТЬ NULL 
		|				ИЛИ ВТНормаВремени.ЧасовНорма = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТОтработанноеВремя.ЧасовОтработано / ВТНормаВремени.ЧасовНорма
		|	КОНЕЦ КАК КоэффициентОтработанногоВремени,
		|	ВТОтработанноеВремя.ОсуществляютсяОППВ
		|ПОМЕСТИТЬ ВТОсуществлениеОППВ
		|ИЗ
		|	ВТОтработанноеВремя КАК ВТОтработанноеВремя
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНормаВремени КАК ВТНормаВремени
		|		ПО ВТОтработанноеВремя.ФизическоеЛицо = ВТНормаВремени.ФизическоеЛицо
		|			И ВТОтработанноеВремя.МесяцНалоговогоПериода = ВТНормаВремени.МесяцНалоговогоПериода
		|ГДЕ
		|	ВТОтработанноеВремя.ОсуществляютсяОППВ
		|	И ВЫБОР
		|			КОГДА ВТНормаВремени.ЧасовНорма ЕСТЬ NULL 
		|					ИЛИ ВТНормаВремени.ЧасовНорма = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВТОтработанноеВремя.ЧасовОтработано / ВТНормаВремени.ЧасовНорма
		|		КОНЕЦ >= 0.8";
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТНормаВремени");
	УничтожитьВТ.Добавить("ВТОтработанноеВремя");
	УничтожитьВТ.Добавить("ВТОсуществлениеОППВ");
	
	Запрос.УстановитьПараметр("КонецМесяцаРасчета",КонецМесяца(МесяцНачисления));
	
	// Исключаемые лица
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОПенсионномОбеспеченииФизическихЛиц.ФизическоеЛицо,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТИсключаемыеФизическиеЛицаПриРасчетеОППВ
		|ИЗ
		|	РегистрСведений.СведенияОПенсионномОбеспеченииФизическихЛиц.СрезПоследних(
		|			&КонецМесяцаРасчета,
		|			ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					СписокСотрудников.ФизическоеЛицо
		|				ИЗ
		|					ВТФизическиеЛица КАК СписокСотрудников)) КАК СведенияОПенсионномОбеспеченииФизическихЛиц
		|ГДЕ
		|	(СведенияОПенсионномОбеспеченииФизическихЛиц.ПенсионерПоВозрасту
		|			ИЛИ СведенияОПенсионномОбеспеченииФизическихЛиц.ПенсионерПоВыслугеЛет)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтатусФизическихЛицКакНалогоплательщиков.ФизическоеЛицо,
		|	ДАТАВРЕМЯ(1, 1, 1)
		|ИЗ
		|	РегистрСведений.СтатусФизическихЛицКакНалогоплательщиков.СрезПоследних(
		|			&КонецМесяцаРасчета,
		|			ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					СписокСотрудников.ФизическоеЛицо
		|				ИЗ
		|					ВТФизическиеЛица КАК СписокСотрудников)) КАК СтатусФизическихЛицКакНалогоплательщиков
		|ГДЕ
		|	НЕ СтатусФизическихЛицКакНалогоплательщиков.ИмеетПравоНаПенсионноеОбеспечение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПериодыПоФизлицам.ФизическоеЛицо,
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ПериодыПоФизлицам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсуществлениеОППВ КАК ОсуществлениеОППВ
		|		ПО ПериодыПоФизлицам.ФизическоеЛицо = ОсуществлениеОППВ.ФизическоеЛицо
		|			И ПериодыПоФизлицам.МесяцНалоговогоПериода = ОсуществлениеОППВ.МесяцНалоговогоПериода
		|ГДЕ
		|	ОсуществлениеОППВ.ФизическоеЛицо ЕСТЬ NULL ";
	
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТИсключаемыеФизическиеЛицаПриРасчетеОППВ");
	
	ВидНалогаВзносаОППВ =  Перечисления.ВидыНалоговВзносовОтчислений.ОППВ;
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаОППВ, "ВТИсключаемыеФизическиеЛицаПриРасчетеОППВ", Ложь);
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленных ОППВ
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаОППВ);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	// - Исчисленные ОППВ
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	Доходы.ОблагаемыйДоход КАК ОбъектИсчисленияОППВ,
		|	Доходы.ОблагаемыйДоход * ЕСТЬNULL(СтавкиОППВ.Ставка, 0) КАК ИсчисленныеОППВ
		|ПОМЕСТИТЬ ВТИсчисленныеОППВ
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавки КАК СтавкиОППВ
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиОППВ.МесяцНалоговогоПериода
		|			И (СтавкиОППВ.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОППВ))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеОППВ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ВТИсчисленныеОППВ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТИсчисленныеОППВ.ВидДохода КАК ВидДохода,
		|	ВТИсчисленныеОППВ.ОбъектИсчисленияОППВ КАК ОбъектИсчисленияОППВ,
		|	ВТИсчисленныеОППВ.ИсчисленныеОППВ КАК ИсчисленныеОППВ
		|ИЗ
		|	ВТИсчисленныеОППВ КАК ВТИсчисленныеОППВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеОППВПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныеОППВПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныеОППВПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныеОППВПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныеОППВПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеОППВПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеОППВПоПодразделениям.ОбъектИсчисления КАК ОбъектОППВИсчисленныйРанее,
		|	ИсчисленныеОППВПоПодразделениям.НалогВзнос КАК РанееИсчисленныеОППВ,
		|	-ИсчисленныеОППВПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныеОППВПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныеОППВПоПодразделениям.НалогВзнос КАК ИсчисленныеОППВ,
		|	-ИсчисленныеОППВПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияОППВ
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныеОППВПоПодразделениям
		|ГДЕ
		|	(ИсчисленныеОППВПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеОППВПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеОППВПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныеОППВПоПодразделениям.НалогВзнос <> 0)";
	
	Результат = Запрос.ВыполнитьПакет();	
	УничтожитьВТ.Добавить("ВТИсчисленныеОППВ");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеОППВПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	РезультатЗапроса = Результат[ВсегоРезультатов - 3].Выгрузить();
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныеОППВВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияОППВВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектОППВИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныеОППВ", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияОППВ,ИсчисленныеОППВ");
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеОППВПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияОППВВЦеломЗаПериод, ИсчисленныеОППВВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектОППВИсчисленныйРанее, 		РанееИсчисленныеОППВ,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход,					ОбъектИсчисленияОППВ, 				ИсчисленныеОППВ");
	
	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаОППВ);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);
	
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	Для каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
		СтрокаТЗ.ИсчисленныеОППВ = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныеОППВ, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
	КонецЦикла; 

	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьОППВПосле2019(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	// Получение сведений по коэффициенту отработанного времени во вредных условиях
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ИспользоватьШтатноеРасписание", ПолучитьФункциональнуюОпцию("ИспользоватьШтатноеРасписание"));
	
	// Сведения о необходимости исчисления ОППВ
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПериодыУсловийТруда.МесяцНалоговогоПериода,
		|	ПериодыУсловийТруда.Должность,
		|	КлассыУсловийТрудаПоДолжностям.ОсуществляютсяОППВ
		|ПОМЕСТИТЬ ВТОсобенностиИсчисленияОППВ
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПериодыРасчета.Период КАК МесяцНалоговогоПериода,
		|		КлассыУсловийТрудаПоДолжностям.Должность КАК Должность,
		|		МАКСИМУМ(КлассыУсловийТрудаПоДолжностям.Период) КАК Период
		|	ИЗ
		|		ВТДатыПоМесяцам КАК ПериодыРасчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлассыУсловийТрудаПоДолжностям КАК КлассыУсловийТрудаПоДолжностям
		|			ПО ПериодыРасчета.Период >= КлассыУсловийТрудаПоДолжностям.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		КлассыУсловийТрудаПоДолжностям.Должность,
		|		ПериодыРасчета.Период) КАК ПериодыУсловийТруда
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлассыУсловийТрудаПоДолжностям КАК КлассыУсловийТрудаПоДолжностям
		|		ПО ПериодыУсловийТруда.Период = КлассыУсловийТрудаПоДолжностям.Период
		|			И ПериодыУсловийТруда.Должность = КлассыУсловийТрудаПоДолжностям.Должность";
		
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТОсобенностиИсчисленияОППВ");
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(НАЧАЛОПЕРИОДА(ПериодыПоСотрудникам.МесяцНалоговогоПериода, МЕСЯЦ)) КАК НачалоПериода,
		|	МАКСИМУМ(КОНЕЦПЕРИОДА(ПериодыПоСотрудникам.МесяцНалоговогоПериода, МЕСЯЦ)) КАК КонецПериода,
		|	ПериодыПоСотрудникам.Сотрудник,
		|	ПериодыПоСотрудникам.ФизическоеЛицо
		|ПОМЕСТИТЬ ВТПериодыКадровыхДанныхСотрудников
		|ИЗ
		|	ВТКадровыеДанныеСотрудниковПоПериодам КАК ПериодыПоСотрудникам
		|
		|СГРУППИРОВАТЬ ПО
		|	ПериодыПоСотрудникам.Сотрудник,
		|	ПериодыПоСотрудникам.ФизическоеЛицо
		|";
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТПериодыКадровыхДанныхСотрудников");
	
	// Получим кадровые данные
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
		"ВТПериодыКадровыхДанныхСотрудников", 
		"Сотрудник");
		
	ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("ДатаНачала", "НачалоПериода");
	ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("ДатаОкончания", "КонецПериода");
	
	// не используем параметр ВключатьЗаписиНаНачалоПериода, тк он не используется в построении запроса для интервального регистра в СоздатьВТИмяРегистраПериоды
	//ПараметрыПостроения.ВключатьЗаписиНаНачалоПериода = Истина;
	ЗарплатаКадрыПериодическиеРегистры.СоздатьВТИмяРегистраПериоды(
		"КадроваяИсторияСотрудников",
		МенеджерВременныхТаблиц,
		Истина,
		ОписаниеФильтра,
		,
		"ВТКадровыеДанныеДляДолжностей");

	Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(КадроваяИсторияСотрудников.НачалоПериода, ДЕНЬ) КАК КадровыйПериод,
		|	КадроваяИсторияСотрудников.Сотрудник,
		|	КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию,
		|	КадроваяИсторияСотрудников.Должность
		|ПОМЕСТИТЬ ВТДанныеЗанимаемыхДолжностей
		|ИЗ
		|	ВТКадровыеДанныеДляДолжностей КАК КадроваяИсторияСотрудников";

	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТДанныеЗанимаемыхДолжностей");
	
	Если ПолучитьФункциональнуюОпцию("ВестиУчетРабочегоВремениПоУсловиямТруда", Новый Структура("Организация", Организация)) Тогда
		
		// Расчет по данным Табеля	
		ТекстЗапроса = 	
			"ВЫБРАТЬ
			|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы КАК Сотрудник,
			|	КадровыеДанныеСотрудниковПоПериодам.ФизическоеЛицо,
			|	ГрафикиРаботыПоВидамВремени.УсловияТруда,
			|	КадровыеДанныеСотрудниковПоПериодам.МесяцНалоговогоПериода,
			|	СУММА(ВЫБОР
			|			КОГДА ГрафикиРаботыПоВидамВремени.ВремяВЧасах
			|				ТОГДА ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение
			|			ИНАЧЕ ГрафикиРаботыПоВидамВремени.ОсновноеЗначение
			|		КОНЕЦ) КАК ДнейОтработано,
			|	СУММА(ВЫБОР
			|			КОГДА ГрафикиРаботыПоВидамВремени.ВремяВЧасах
			|				ТОГДА ГрафикиРаботыПоВидамВремени.ОсновноеЗначение
			|			ИНАЧЕ ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение
			|		КОНЕЦ) КАК ЧасовОтработано,
			|	СУММА(ВЫБОР
			|			КОГДА ГрафикиРаботыПоВидамВремени.ВремяВЧасах
			|				ТОГДА ГрафикиРаботыПоВидамВремени.ДополнительноеЗначениеНорма
			|			ИНАЧЕ ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма
			|		КОНЕЦ) КАК ДнейНорма,
			|	СУММА(ВЫБОР
			|			КОГДА ГрафикиРаботыПоВидамВремени.ВремяВЧасах
			|				ТОГДА ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма
			|			ИНАЧЕ ГрафикиРаботыПоВидамВремени.ДополнительноеЗначениеНорма
			|		КОНЕЦ) КАК ЧасовНорма
			|ПОМЕСТИТЬ ВТОтработанноеВремяПоУсловиямТруда
			|ИЗ
			|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудниковПоПериодам КАК КадровыеДанныеСотрудниковПоПериодам
			|		ПО ГрафикиРаботыПоВидамВремени.ГрафикРаботы = КадровыеДанныеСотрудниковПоПериодам.Сотрудник
			// исключим данные перерасчетов предыдущих месяцев
			|			И ГрафикиРаботыПоВидамВремени.Месяц = КадровыеДанныеСотрудниковПоПериодам.МесяцНалоговогоПериода
			|			И ГрафикиРаботыПоВидамВремени.ПериодРегистрации = КадровыеДанныеСотрудниковПоПериодам.МесяцНалоговогоПериода
			|ГДЕ
			|	ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Справочник.ВидыИспользованияРабочегоВремени.РабочееВремя)
			|
			|СГРУППИРОВАТЬ ПО
			|	КадровыеДанныеСотрудниковПоПериодам.МесяцНалоговогоПериода,
			|	ГрафикиРаботыПоВидамВремени.УсловияТруда,
			|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
			|	КадровыеДанныеСотрудниковПоПериодам.ФизическоеЛицо";
		УничтожитьВТ.Добавить("ВТОтработанноеВремяПоУсловиямТруда");
	Иначе
		
		ОписаниеФильтраПолученияГрафиков = ЗарплатаКадрыПериодическиеРегистры.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТПериодыКадровыхДанныхСотрудников", "Сотрудник");				
		ОписаниеФильтраПолученияГрафиков.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("Сотрудник", "Сотрудник");
		ОписаниеФильтраПолученияГрафиков.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("ДатаНачала", "НачалоПериода");
		ОписаниеФильтраПолученияГрафиков.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("ДатаОкончания", "КонецПериода");
		
		ЗарплатаКадрыПериодическиеРегистры.СоздатьВТИмяРегистраПериоды("ГрафикРаботыСотрудников", МенеджерВременныхТаблиц, Ложь, ОписаниеФильтраПолученияГрафиков, , "ВТГрафикиРаботы");
		
		ТекстЗапроса = "
			|ВЫБРАТЬ
			|	ПериодыГрафиков.НачалоПериода КАК ПериодГрафика,
			|	ПериодыГрафиков.Сотрудник,
			|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ПериодыГрафиков.ГрафикРаботы
			|ПОМЕСТИТЬ ВТГрафикиРаботыСотрудников
			|ИЗ
			|	ВТГрафикиРаботы КАК ПериодыГрафиков
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
			|		ПО ПериодыГрафиков.Сотрудник = Сотрудники.Ссылка";
			
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		УничтожитьВТ.Добавить("ВТГрафикиРаботы");
		
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ГрафикиРаботыСотрудников.Сотрудник КАК Сотрудник,
			|	ГрафикиРаботыСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДанныеПроизводственногоКалендаря.Дата КАК Дата,
			|	МАКСИМУМ(ГрафикиРаботыСотрудников.ПериодГрафика) КАК ПериодГрафика
			|ПОМЕСТИТЬ ВТПериодыГрафиковРаботы
			|ИЗ
			|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТГрафикиРаботыСотрудников КАК ГрафикиРаботыСотрудников
			|		ПО ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = ГрафикиРаботыСотрудников.ГрафикРаботы.ПроизводственныйКалендарь
			|			И ДанныеПроизводственногоКалендаря.Дата >= ГрафикиРаботыСотрудников.ПериодГрафика
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериодыКадровыхДанныхСотрудников КАК ПериодыСотрудников
			|		ПО (ГрафикиРаботыСотрудников.Сотрудник = ПериодыСотрудников.Сотрудник)
			|			И (ДанныеПроизводственногоКалендаря.Дата МЕЖДУ ПериодыСотрудников.НачалоПериода И ПериодыСотрудников.КонецПериода)
			|
			|СГРУППИРОВАТЬ ПО
			|	ГрафикиРаботыСотрудников.Сотрудник,
			|	ГрафикиРаботыСотрудников.ФизическоеЛицо,
			|	ДанныеПроизводственногоКалендаря.Дата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПериодыГрафиковРаботы.Сотрудник,
			|	ПериодыГрафиковРаботы.ФизическоеЛицо,
			|	ПериодыГрафиковРаботы.Дата,
			|	ГрафикиРаботыСотрудников.ГрафикРаботы
			|ПОМЕСТИТЬ ВТРабочиеДатыСотрудников
			|ИЗ
			|	ВТПериодыГрафиковРаботы КАК ПериодыГрафиковРаботы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТГрафикиРаботыСотрудников КАК ГрафикиРаботыСотрудников
			|		ПО ПериодыГрафиковРаботы.Сотрудник = ГрафикиРаботыСотрудников.Сотрудник
			|			И ПериодыГрафиковРаботы.ПериодГрафика = ГрафикиРаботыСотрудников.ПериодГрафика
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РабочиеДатыСотрудников.Сотрудник,
			|	РабочиеДатыСотрудников.ФизическоеЛицо,
			|	ГрафикиРаботыПоВидамВремени.Месяц КАК МесяцНалоговогоПериода,
			|	РабочиеДатыСотрудников.Дата,
			|	РабочиеДатыСотрудников.ГрафикРаботы,
			|	СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначение) КАК ДнейОтработано,
			|	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение) КАК ЧасовОтработано,
			|	СУММА(ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеНорма) КАК ДнейНорма,
			|	СУММА(ГрафикиРаботыПоВидамВремени.ДополнительноеЗначениеНорма) КАК ЧасовНорма
			|ПОМЕСТИТЬ ВТОтработанноеВремяПоПлану
			|ИЗ
			|	ВТРабочиеДатыСотрудников КАК РабочиеДатыСотрудников
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
			|		ПО РабочиеДатыСотрудников.Дата = ГрафикиРаботыПоВидамВремени.Дата
			|			И РабочиеДатыСотрудников.ГрафикРаботы = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
			|			И (ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Справочник.ВидыИспользованияРабочегоВремени.РабочееВремя))
			|			И (НЕ ГрафикиРаботыПоВидамВремени.ВремяВЧасах)
			|
			|СГРУППИРОВАТЬ ПО
			|	РабочиеДатыСотрудников.Сотрудник,
			|	РабочиеДатыСотрудников.ФизическоеЛицо,
			|	РабочиеДатыСотрудников.Дата,
			|	РабочиеДатыСотрудников.ГрафикРаботы,
			|	ГрафикиРаботыПоВидамВремени.Месяц"; 
			
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
		УничтожитьВТ.Добавить("ВТПериодыГрафиковРаботы");
		УничтожитьВТ.Добавить("ВТРабочиеДатыСотрудников");
		УничтожитьВТ.Добавить("ВТОтработанноеВремяПоПлану");
		
		// Вычисляем условия труда на каждый отработанный день
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДанныеОтработанногоВремени.Сотрудник,
			|	ДанныеОтработанногоВремени.ФизическоеЛицо,
			|	ДанныеОтработанногоВремени.МесяцНалоговогоПериода,
			|	ДанныеОтработанногоВремени.Дата
			|ПОМЕСТИТЬ ВТДатыОтработанногоВремени
			|ИЗ
			|	ВТОтработанноеВремяПоПлану КАК ДанныеОтработанногоВремени
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПериодыЗанимаемыхДолжностей.КадровыйПериод,
			|	ПериодыЗанимаемыхДолжностей.Сотрудник,
			|	ПериодыЗанимаемыхДолжностей.ФизическоеЛицо,
			|	ПериодыЗанимаемыхДолжностей.МесяцНалоговогоПериода,
			|	ПериодыЗанимаемыхДолжностей.Дата КАК ДатаГрафика,
			|	ДанныеЗанимаемыхДолжностей.ДолжностьПоШтатномуРасписанию,
			|	ДанныеЗанимаемыхДолжностей.Должность
			|ПОМЕСТИТЬ ВТКадровыеДанныеПоДатамГрафика
			|ИЗ
			|	(ВЫБРАТЬ
			|		МАКСИМУМ(ДанныеЗанимаемыхДолжностей.КадровыйПериод) КАК КадровыйПериод,
			|		ДанныеЗанимаемыхДолжностей.Сотрудник КАК Сотрудник,
			|		ДатыОтработанногоВремени.ФизическоеЛицо КАК ФизическоеЛицо,
			|		ДатыОтработанногоВремени.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
			|		ДатыОтработанногоВремени.Дата КАК Дата
			|	ИЗ
			|		ВТДанныеЗанимаемыхДолжностей КАК ДанныеЗанимаемыхДолжностей
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыОтработанногоВремени КАК ДатыОтработанногоВремени
			|			ПО ДанныеЗанимаемыхДолжностей.Сотрудник = ДатыОтработанногоВремени.Сотрудник
			|				И ДанныеЗанимаемыхДолжностей.КадровыйПериод <= ДатыОтработанногоВремени.Дата
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ДатыОтработанногоВремени.МесяцНалоговогоПериода,
			|		ДатыОтработанногоВремени.Дата,
			|		ДатыОтработанногоВремени.ФизическоеЛицо,
			|		ДанныеЗанимаемыхДолжностей.Сотрудник) КАК ПериодыЗанимаемыхДолжностей
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеЗанимаемыхДолжностей КАК ДанныеЗанимаемыхДолжностей
			|		ПО ПериодыЗанимаемыхДолжностей.Сотрудник = ДанныеЗанимаемыхДолжностей.Сотрудник
			|			И ПериодыЗанимаемыхДолжностей.КадровыйПериод = ДанныеЗанимаемыхДолжностей.КадровыйПериод
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДанныеОтработанногоВремени.Сотрудник,
			|	ДанныеОтработанногоВремени.ФизическоеЛицо,
			|	ДанныеОтработанногоВремени.МесяцНалоговогоПериода,
			|	ДанныеОтработанногоВремени.Дата,
			|	СУММА(ДанныеОтработанногоВремени.ДнейОтработано) КАК ДнейОтработано,
			|	СУММА(ДанныеОтработанногоВремени.ЧасовОтработано) КАК ЧасовОтработано,
			|	СУММА(ДанныеОтработанногоВремени.ДнейНорма) КАК ДнейНорма,
			|	СУММА(ДанныеОтработанногоВремени.ЧасовНорма) КАК ЧасовНорма,
			|	ВЫБОР
			|		КОГДА &ИспользоватьШтатноеРасписание
			|			ТОГДА КадровыеДанныеПоДатамГрафика.ДолжностьПоШтатномуРасписанию
			|		ИНАЧЕ КадровыеДанныеПоДатамГрафика.Должность
			|	КОНЕЦ КАК УсловияТруда
			|ПОМЕСТИТЬ ВТОтработанноеВремяПоУсловиямТруда
			|ИЗ
			|	ВТКадровыеДанныеПоДатамГрафика КАК КадровыеДанныеПоДатамГрафика
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтработанноеВремяПоПлану КАК ДанныеОтработанногоВремени
			|		ПО КадровыеДанныеПоДатамГрафика.Сотрудник = ДанныеОтработанногоВремени.Сотрудник
			|			И КадровыеДанныеПоДатамГрафика.МесяцНалоговогоПериода = ДанныеОтработанногоВремени.МесяцНалоговогоПериода
			|			И КадровыеДанныеПоДатамГрафика.ДатаГрафика = ДанныеОтработанногоВремени.Дата
			|
			|СГРУППИРОВАТЬ ПО
			|	ДанныеОтработанногоВремени.Сотрудник,
			|	ДанныеОтработанногоВремени.ФизическоеЛицо,
			|	ДанныеОтработанногоВремени.МесяцНалоговогоПериода,
			|	ДанныеОтработанногоВремени.Дата,
			|	ВЫБОР
			|		КОГДА &ИспользоватьШтатноеРасписание
			|			ТОГДА КадровыеДанныеПоДатамГрафика.ДолжностьПоШтатномуРасписанию
			|		ИНАЧЕ КадровыеДанныеПоДатамГрафика.Должность
			|	КОНЕЦ";
		УничтожитьВТ.Добавить("ВТДатыОтработанногоВремени");
		УничтожитьВТ.Добавить("ВТКадровыеДанныеПоДатамГрафика");
		УничтожитьВТ.Добавить("ВТОтработанноеВремяПоУсловиямТруда");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	// Получаем необходимость исчисления ОППВ,
	// если сотрудник отработал 80% во вредных условиях
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтработанноеВремя.ФизическоеЛицо,
		|	ОтработанноеВремя.МесяцНалоговогоПериода,
		|	СУММА(ОтработанноеВремя.ДнейНорма) КАК ДнейНорма,
		|	СУММА(ОтработанноеВремя.ЧасовНорма) КАК ЧасовНорма
		|ПОМЕСТИТЬ ВТНормаВремени
		|ИЗ
		|	ВТОтработанноеВремяПоУсловиямТруда КАК ОтработанноеВремя
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтработанноеВремя.МесяцНалоговогоПериода,
		|	ОтработанноеВремя.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОтработанноеВремяПоУсловиямТруда.ФизическоеЛицо,
		|	ВТОтработанноеВремяПоУсловиямТруда.МесяцНалоговогоПериода,
		|	СУММА(ВТОтработанноеВремяПоУсловиямТруда.ЧасовОтработано) КАК ЧасовОтработано,
		|	ЕСТЬNULL(ВТОсобенностиИсчисленияОППВ.ОсуществляютсяОППВ, ЛОЖЬ) КАК ОсуществляютсяОППВ
		|ПОМЕСТИТЬ ВТОтработанноеВремя
		|ИЗ
		|	ВТОтработанноеВремяПоУсловиямТруда КАК ВТОтработанноеВремяПоУсловиямТруда
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсобенностиИсчисленияОППВ КАК ВТОсобенностиИсчисленияОППВ
		|		ПО ВТОтработанноеВремяПоУсловиямТруда.УсловияТруда = ВТОсобенностиИсчисленияОППВ.Должность
		|			И ВТОтработанноеВремяПоУсловиямТруда.МесяцНалоговогоПериода = ВТОсобенностиИсчисленияОППВ.МесяцНалоговогоПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТОтработанноеВремяПоУсловиямТруда.МесяцНалоговогоПериода,
		|	ВТОтработанноеВремяПоУсловиямТруда.ФизическоеЛицо,
		|	ЕСТЬNULL(ВТОсобенностиИсчисленияОППВ.ОсуществляютсяОППВ, ЛОЖЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОтработанноеВремя.ФизическоеЛицо,
		|	ВТОтработанноеВремя.МесяцНалоговогоПериода,
		|	ВЫБОР
		|		КОГДА ВТНормаВремени.ЧасовНорма ЕСТЬ NULL 
		|				ИЛИ ВТНормаВремени.ЧасовНорма = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТОтработанноеВремя.ЧасовОтработано / ВТНормаВремени.ЧасовНорма
		|	КОНЕЦ КАК КоэффициентОтработанногоВремени,
		|	ВТОтработанноеВремя.ОсуществляютсяОППВ
		|ПОМЕСТИТЬ ВТОсуществлениеОППВ
		|ИЗ
		|	ВТОтработанноеВремя КАК ВТОтработанноеВремя
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНормаВремени КАК ВТНормаВремени
		|		ПО ВТОтработанноеВремя.ФизическоеЛицо = ВТНормаВремени.ФизическоеЛицо
		|			И ВТОтработанноеВремя.МесяцНалоговогоПериода = ВТНормаВремени.МесяцНалоговогоПериода
		|ГДЕ
		|	ВТОтработанноеВремя.ОсуществляютсяОППВ
		|	И ВЫБОР
		|			КОГДА ВТНормаВремени.ЧасовНорма ЕСТЬ NULL 
		|					ИЛИ ВТНормаВремени.ЧасовНорма = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВТОтработанноеВремя.ЧасовОтработано / ВТНормаВремени.ЧасовНорма
		|		КОНЕЦ >= 0.8";
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТНормаВремени");
	УничтожитьВТ.Добавить("ВТОтработанноеВремя");
	УничтожитьВТ.Добавить("ВТОсуществлениеОППВ");
	
	Запрос.УстановитьПараметр("КонецМесяцаРасчета",КонецМесяца(МесяцНачисления));
	
	// Исключаемые лица
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОПенсионномОбеспеченииФизическихЛиц.ФизическоеЛицо,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТИсключаемыеФизическиеЛицаПриРасчетеОППВ
		|ИЗ
		|	РегистрСведений.СведенияОПенсионномОбеспеченииФизическихЛиц.СрезПоследних(
		|			&КонецМесяцаРасчета,
		|			ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					СписокСотрудников.ФизическоеЛицо
		|				ИЗ
		|					ВТФизическиеЛица КАК СписокСотрудников)) КАК СведенияОПенсионномОбеспеченииФизическихЛиц
		|ГДЕ
		|	(СведенияОПенсионномОбеспеченииФизическихЛиц.ПенсионерПоВозрасту
		|			ИЛИ СведенияОПенсионномОбеспеченииФизическихЛиц.ПенсионерПоВыслугеЛет)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтатусФизическихЛицКакНалогоплательщиков.ФизическоеЛицо,
		|	ДАТАВРЕМЯ(1, 1, 1)
		|ИЗ
		|	РегистрСведений.СтатусФизическихЛицКакНалогоплательщиков.СрезПоследних(
		|			&КонецМесяцаРасчета,
		|			ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					СписокСотрудников.ФизическоеЛицо
		|				ИЗ
		|					ВТФизическиеЛица КАК СписокСотрудников)) КАК СтатусФизическихЛицКакНалогоплательщиков
		|ГДЕ
		|	НЕ СтатусФизическихЛицКакНалогоплательщиков.ИмеетПравоНаПенсионноеОбеспечение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПериодыПоФизлицам.ФизическоеЛицо,
		|	ПериодыПоФизлицам.МесяцНалоговогоПериода
		|ИЗ
		|	ВТПериодыПоФизлицам КАК ПериодыПоФизлицам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсуществлениеОППВ КАК ОсуществлениеОППВ
		|		ПО ПериодыПоФизлицам.ФизическоеЛицо = ОсуществлениеОППВ.ФизическоеЛицо
		|			И ПериодыПоФизлицам.МесяцНалоговогоПериода = ОсуществлениеОППВ.МесяцНалоговогоПериода
		|ГДЕ
		|	ОсуществлениеОППВ.ФизическоеЛицо ЕСТЬ NULL ";
	
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТИсключаемыеФизическиеЛицаПриРасчетеОППВ");
	
	ВидНалогаВзносаОППВ =  Перечисления.ВидыНалоговВзносовОтчислений.ОППВ;
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаОППВ, "ВТИсключаемыеФизическиеЛицаПриРасчетеОППВ", Ложь);
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленных ОППВ
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаОППВ);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	// - Исчисленные ОППВ
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	Доходы.ОблагаемыйДоход КАК ОбъектИсчисленияОППВ,
		|	Доходы.ОблагаемыйДоход * ЕСТЬNULL(СтавкиОППВ.Ставка, 0) КАК ИсчисленныеОППВ
		|ПОМЕСТИТЬ ВТИсчисленныеОППВ
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавки КАК СтавкиОППВ
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиОППВ.МесяцНалоговогоПериода
		|			И (СтавкиОППВ.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОППВ))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеОППВ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ВТИсчисленныеОППВ.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТИсчисленныеОППВ.ВидДохода КАК ВидДохода,
		|	ВТИсчисленныеОППВ.ОбъектИсчисленияОППВ КАК ОбъектИсчисленияОППВ,
		|	ВТИсчисленныеОППВ.ИсчисленныеОППВ КАК ИсчисленныеОППВ
		|ИЗ
		|	ВТИсчисленныеОППВ КАК ВТИсчисленныеОППВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеОППВПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныеОППВПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныеОППВПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныеОППВПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныеОППВПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеОППВПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеОППВПоПодразделениям.ОбъектИсчисления КАК ОбъектОППВИсчисленныйРанее,
		|	ИсчисленныеОППВПоПодразделениям.НалогВзнос КАК РанееИсчисленныеОППВ,
		|	-ИсчисленныеОППВПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныеОППВПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныеОППВПоПодразделениям.НалогВзнос КАК ИсчисленныеОППВ,
		|	-ИсчисленныеОППВПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияОППВ
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныеОППВПоПодразделениям
		|ГДЕ
		|	(ИсчисленныеОППВПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеОППВПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеОППВПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныеОППВПоПодразделениям.НалогВзнос <> 0)";
	
	Результат = Запрос.ВыполнитьПакет();	
	УничтожитьВТ.Добавить("ВТИсчисленныеОППВ");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеОППВПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	РезультатЗапроса = Результат[ВсегоРезультатов - 3].Выгрузить();
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныеОППВВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияОППВВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектОППВИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныеОППВ", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаОППВ);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);

	// для корректного округления после распределения при достижении суммы максимального предела необходима точность 0
	ТочностьОкругления = ОписаниеСпособаОкругления.Точность - Цел(ОписаниеСпособаОкругления.Точность);
	
	Если ТочностьОкругления = 0 Тогда
		ТочностьРаспределения = 0;
	ИначеЕсли ТочностьОкругления <= 0.1 Тогда
		ТочностьРаспределения = 2;
	Иначе
		ТочностьРаспределения = 1;
	КонецЕсли;
			
	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияОППВ,ИсчисленныеОППВ", ТочностьРаспределения);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеОППВПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияОППВВЦеломЗаПериод, ИсчисленныеОППВВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектОППВИсчисленныйРанее, 		РанееИсчисленныеОППВ,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход,					ОбъектИсчисленияОППВ, 				ИсчисленныеОППВ");
	
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	
	Для каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
		
		// спишем возникшую погрешность округления при перераспределении сумм по подразделениям
		Если СтрокаТЗ.ОблагаемыйДоход = 0
			И НЕ ОписаниеСпособаОкругления.ПравилоОкругления = Перечисления.ПравилаОкругленияПриРасчетеЗарплаты.Авто
			И (СтрокаТЗ.ИсчисленныеОППВ < 1 И СтрокаТЗ.ИсчисленныеОППВ > 0
				ИЛИ СтрокаТЗ.ИсчисленныеОППВ > -1 И СтрокаТЗ.ИсчисленныеОППВ < 0) Тогда
				
			СтрокаТЗ.ИсчисленныеОППВ = 0;
			
		// исчисление взносов производятся в тенге с учетом округления тиын
		Иначе
			
			СтрокаТЗ.ИсчисленныеОППВ = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныеОППВ, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
			
		КонецЕсли;
		
	КонецЦикла; 

	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьООСМС(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт
	
	Если МесяцНачисления >= Дата(2018,1,1) Тогда
		// С 1 января 2018 г исключен минимальный предел на объект исчисления
		РезультатыРасчетов = РассчитатьООСМСПосле2018(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет, ИсключатьДоходыРегистратора);
	Иначе
		// Расчет отчислений ОСМС по объекту в пределах от 1 до 15 МЗП
		РезультатыРасчетов = РассчитатьООСМСДо2018(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет, ИсключатьДоходыРегистратора);
	КонецЕсли;
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьООСМСДо2018(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) 
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	СоздатьВТИсключаемыеЛицаОСМС(МенеджерВременныхТаблиц, "ВТИсключаемыеФизическиеЛицаПриРасчетеООСМС", МесяцНачисления);
	УничтожитьВТ.Добавить("ВТИсключаемыеФизическиеЛицаПриРасчетеООСМС");
	
	ВидНалогаВзносаООСМС =  Перечисления.ВидыНалоговВзносовОтчислений.ООСМС;
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаООСМС, "ВТИсключаемыеФизическиеЛицаПриРасчетеООСМС", Ложь);
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленных ООСМС
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаООСМС);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	// - Исчисленные ООСМС
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмерыМЗППоПериодам.МесяцНалоговогоПериода,
		|	РазмерыМЗППоПериодам.РазмерМЗП КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыМЗППоПериодам.РазмерМЗП * 15 КАК МаксимальныйРазмерОрганиченияДохода
		|ПОМЕСТИТЬ ВТРазмерыОграниченийПоДоходам
		|ИЗ
		|	ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода, 
		|	РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		КОГДА Доходы.ОблагаемыйДоход >= РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход
		|	КОНЕЦ КАК ОбъектИсчисленияООСМС,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		КОГДА Доходы.ОблагаемыйДоход >= РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход
		|	КОНЕЦ * ЕСТЬNULL(СтавкиОСМС.СтавкаОтчисления, 0) КАК ИсчисленныеООСМС
		|ПОМЕСТИТЬ ВТИсчисленныеООСМС
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиОСМС КАК СтавкиОСМС
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиОСМС.МесяцНалоговогоПериода
		|			И Доходы.ВидДохода = СтавкиОСМС.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеООСМС.МесяцНалоговогоПериода,
		|	ВТИсчисленныеООСМС.ФизическоеЛицо,
		|	ВТИсчисленныеООСМС.ВидДохода,
		|	ВТИсчисленныеООСМС.ОбъектИсчисленияООСМС,
		|	ВТИсчисленныеООСМС.ИсчисленныеООСМС
		|ИЗ
		|	ВТИсчисленныеООСМС КАК ВТИсчисленныеООСМС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеООСМСПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныеООСМСПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныеООСМСПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныеООСМСПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныеООСМСПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеООСМСПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеООСМСПоПодразделениям.ОбъектИсчисления КАК ОбъектООСМСИсчисленныйРанее,
		|	ИсчисленныеООСМСПоПодразделениям.НалогВзнос КАК РанееИсчисленныеООСМС,
		|	-ИсчисленныеООСМСПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныеООСМСПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныеООСМСПоПодразделениям.НалогВзнос КАК ИсчисленныеООСМС,
		|	-ИсчисленныеООСМСПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияООСМС
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныеООСМСПоПодразделениям
		|";
	
	Результат = Запрос.ВыполнитьПакет();	
	УничтожитьВТ.Добавить("ВТРазмерыОграниченийПоДоходам");
	УничтожитьВТ.Добавить("ВТИсчисленныеООСМС");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеООСМСПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	РезультатЗапроса = Результат[ВсегоРезультатов - 3].Выгрузить();
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныеООСМСВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияООСМСВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектООСМСИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныеООСМС", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияООСМС,ИсчисленныеООСМС");
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеООСМСПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияООСМСВЦеломЗаПериод,	ИсчисленныеООСМСВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектООСМСИсчисленныйРанее, 		 	РанееИсчисленныеООСМС,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход,					ОбъектИсчисленияООСМС, 					ИсчисленныеООСМС");
	
	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаООСМС);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);
	
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	Для каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
		СтрокаТЗ.ИсчисленныеООСМС = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныеООСМС, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
	КонецЦикла; 

	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьООСМСПосле2018(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) 

	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	СоздатьВТИсключаемыеЛицаОСМС(МенеджерВременныхТаблиц, "ВТИсключаемыеФизическиеЛицаПриРасчетеООСМС", МесяцНачисления);
	УничтожитьВТ.Добавить("ВТИсключаемыеФизическиеЛицаПриРасчетеООСМС");
	
	ВидНалогаВзносаООСМС =  Перечисления.ВидыНалоговВзносовОтчислений.ООСМС;
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаООСМС, "ВТИсключаемыеФизическиеЛицаПриРасчетеООСМС", Ложь);
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленных ООСМС
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаООСМС);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	// Получаем применение минимального ограничения
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(МесяцНачисления, Новый Структура("Организация", Организация));
	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		ПрименятьОграничениеНаМинимальныйОбъектОСМС = УчетнаяПолитикаНУ[0].ПрименятьОграничениеНаМинимальныйОбъектОСМС;
	Иначе 
		ПрименятьОграничениеНаМинимальныйОбъектОСМС = Ложь;
	КонецЕсли;
	
	// - Исчисленные ООСМС
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмерыМЗППоПериодам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	0 КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыМЗППоПериодам.РазмерМЗП * 15 КАК МаксимальныйРазмерОрганиченияДохода
		|ПОМЕСТИТЬ ВТРазмерыОграниченийПоДоходам
		|ИЗ
		|	ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода КАК МаксимальныйРазмерОрганиченияДохода,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		КОГДА Доходы.ОблагаемыйДоход >= РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход
		|	КОНЕЦ КАК ОбъектИсчисленияООСМС,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		КОГДА Доходы.ОблагаемыйДоход >= РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход
		|	КОНЕЦ * ЕСТЬNULL(СтавкиОСМС.СтавкаОтчисления, 0) КАК ИсчисленныеООСМС
		|ПОМЕСТИТЬ ВТИсчисленныеООСМС
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиОСМС КАК СтавкиОСМС
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиОСМС.МесяцНалоговогоПериода
		|			И Доходы.ВидДохода = СтавкиОСМС.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеООСМС.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ВТИсчисленныеООСМС.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТИсчисленныеООСМС.ВидДохода КАК ВидДохода,
		|	ВТИсчисленныеООСМС.ОбъектИсчисленияООСМС КАК ОбъектИсчисленияООСМС,
		|	ВТИсчисленныеООСМС.ИсчисленныеООСМС КАК ИсчисленныеООСМС
		|ИЗ
		|	ВТИсчисленныеООСМС КАК ВТИсчисленныеООСМС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеООСМСПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныеООСМСПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныеООСМСПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныеООСМСПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныеООСМСПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеООСМСПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеООСМСПоПодразделениям.ОбъектИсчисления КАК ОбъектООСМСИсчисленныйРанее,
		|	ИсчисленныеООСМСПоПодразделениям.НалогВзнос КАК РанееИсчисленныеООСМС,
		|	-ИсчисленныеООСМСПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныеООСМСПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныеООСМСПоПодразделениям.НалогВзнос КАК ИсчисленныеООСМС,
		|	-ИсчисленныеООСМСПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияООСМС
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныеООСМСПоПодразделениям
		|ГДЕ
		|	(ИсчисленныеООСМСПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеООСМСПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеООСМСПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныеООСМСПоПодразделениям.НалогВзнос <> 0)";
		
	Если ПрименятьОграничениеНаМинимальныйОбъектОСМС Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "0 КАК МинимальныйРазмерОрганиченияДохода", "РазмерыМЗППоПериодам.РазмерМЗП КАК МинимальныйРазмерОрганиченияДохода");		
	КонецЕсли;
			
	Результат = Запрос.ВыполнитьПакет();	
	УничтожитьВТ.Добавить("ВТРазмерыОграниченийПоДоходам");
	УничтожитьВТ.Добавить("ВТИсчисленныеООСМС");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеООСМСПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	РезультатЗапроса = Результат[ВсегоРезультатов - 3].Выгрузить();
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныеООСМСВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияООСМСВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектООСМСИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныеООСМС", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияООСМС,ИсчисленныеООСМС");
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеООСМСПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияООСМСВЦеломЗаПериод,	ИсчисленныеООСМСВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектООСМСИсчисленныйРанее, 		 	РанееИсчисленныеООСМС,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход,					ОбъектИсчисленияООСМС, 					ИсчисленныеООСМС");
	
	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаООСМС);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);
	
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	Для каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
		СтрокаТЗ.ИсчисленныеООСМС = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныеООСМС, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
	КонецЦикла; 

	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьООСМСПосле2019(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) 

	УничтожитьВТ = Новый Массив;
	
	ПрименятьКорректировкуПрочихНалоговВзносовОтчислений = ЗарплатаКадрыРКПовтИсп.ПрименятьКорректировкуПрочихНалоговВзносовОтчислений(ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(Организация), МесяцНачисления);	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПрименятьКорректировкуПрочихНалоговВзносовОтчислений", ПрименятьКорректировкуПрочихНалоговВзносовОтчислений);
	
	СоздатьВТИсключаемыеЛицаОСМС(МенеджерВременныхТаблиц, "ВТИсключаемыеФизическиеЛицаПриРасчетеООСМС", МесяцНачисления);
	УничтожитьВТ.Добавить("ВТИсключаемыеФизическиеЛицаПриРасчетеООСМС");
	
	ВидНалогаВзносаООСМС =  Перечисления.ВидыНалоговВзносовОтчислений.ООСМС;
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаООСМС, "ВТИсключаемыеФизическиеЛицаПриРасчетеООСМС", Ложь);
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленных ООСМС
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаООСМС);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	// Статусы физических лиц как налогоплательщиков по периодам
	СоздатьВТСтатусыФизическихЛицКакНалогоплательщиков(МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТСтатусыФизическихЛицКакНалогоплательщиков");
	
	СоздатьВТДанныеПоКорректировкеДоходаИПН(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет, ИсключатьДоходыРегистратора, ПрименятьКорректировкуПрочихНалоговВзносовОтчислений);
	
	// Получаем применение минимального ограничения
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(МесяцНачисления, Новый Структура("Организация", Организация));
	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		ПрименятьОграничениеНаМинимальныйОбъектОСМС = УчетнаяПолитикаНУ[0].ПрименятьОграничениеНаМинимальныйОбъектОСМС;
	Иначе 
		ПрименятьОграничениеНаМинимальныйОбъектОСМС = Ложь;
	КонецЕсли;
	
	// - Исчисленные ООСМС
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмерыМЗППоПериодам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	0 КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыМЗППоПериодам.РазмерМЗП * 10 КАК МаксимальныйРазмерОрганиченияДохода
		|ПОМЕСТИТЬ ВТРазмерыОграниченийПоДоходам
		|ИЗ
		|	ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеИПН.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДанныеИПН.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(ДанныеИПН.СуммаКорректировки) КАК СуммаКорректировки
		|ПОМЕСТИТЬ ВТСуммыКорректировки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ИсчисленныйИПН.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		ИсчисленныйИПН.ФизическоеЛицо КАК ФизическоеЛицо,
		|		ЕСТЬNULL(ИсчисленныйИПН.ПримененнаяКорректировка, 0) КАК СуммаКорректировки
		|	ИЗ
		|		ВТИсчисленныйИПН КАК ИсчисленныйИПН
		|	ГДЕ	
		|		&ПрименятьКорректировкуПрочихНалоговВзносовОтчислений	
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Доходы.МесяцНалоговогоПериода,
		|		Доходы.ФизическоеЛицо,
		|		ЕСТЬNULL(ДанныеПоКорректировкеДоходаИПН.ПримененнаяКорректировка, 0)
		|	ИЗ
		|		ВТДоходы КАК Доходы
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеПоКорректировкеДоходаИПН КАК ДанныеПоКорректировкеДоходаИПН
		|			ПО Доходы.МесяцНалоговогоПериода = ДанныеПоКорректировкеДоходаИПН.МесяцНалоговогоПериода
		|				И Доходы.ФизическоеЛицо = ДанныеПоКорректировкеДоходаИПН.ФизическоеЛицо) КАК ДанныеИПН
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеИПН.МесяцНалоговогоПериода,
		|	ДанныеИПН.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода КАК МаксимальныйРазмерОрганиченияДохода,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0) < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0) >= РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0)
		|	КОНЕЦ КАК ОбъектИсчисленияООСМС,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0) < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0) >= РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0)
		|	КОНЕЦ * ЕСТЬNULL(СтавкиОСМС.СтавкаОтчисления, 0) КАК ИсчисленныеООСМС
		|ПОМЕСТИТЬ ВТИсчисленныеООСМС
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиОСМС КАК СтавкиОСМС
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиОСМС.МесяцНалоговогоПериода
		|			И Доходы.ВидДохода = СтавкиОСМС.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСуммыКорректировки КАК СуммыКорректировки
		|		ПО Доходы.МесяцНалоговогоПериода = СуммыКорректировки.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = СуммыКорректировки.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеООСМС.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ВТИсчисленныеООСМС.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТИсчисленныеООСМС.ВидДохода КАК ВидДохода,
		|	ВТИсчисленныеООСМС.ОбъектИсчисленияООСМС КАК ОбъектИсчисленияООСМС,
		|	ВТИсчисленныеООСМС.ИсчисленныеООСМС КАК ИсчисленныеООСМС
		|ИЗ
		|	ВТИсчисленныеООСМС КАК ВТИсчисленныеООСМС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеООСМСПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныеООСМСПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныеООСМСПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныеООСМСПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныеООСМСПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеООСМСПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеООСМСПоПодразделениям.ОбъектИсчисления КАК ОбъектООСМСИсчисленныйРанее,
		|	ИсчисленныеООСМСПоПодразделениям.НалогВзнос КАК РанееИсчисленныеООСМС,
		|	-ИсчисленныеООСМСПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныеООСМСПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныеООСМСПоПодразделениям.НалогВзнос КАК ИсчисленныеООСМС,
		|	-ИсчисленныеООСМСПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияООСМС
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныеООСМСПоПодразделениям
		|ГДЕ
		|	(ИсчисленныеООСМСПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеООСМСПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеООСМСПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныеООСМСПоПодразделениям.НалогВзнос <> 0)";
		
	Если ПрименятьОграничениеНаМинимальныйОбъектОСМС Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "0 КАК МинимальныйРазмерОрганиченияДохода", "РазмерыМЗППоПериодам.РазмерМЗП КАК МинимальныйРазмерОрганиченияДохода");		
	КонецЕсли;
			
	Результат = Запрос.ВыполнитьПакет();	
	УничтожитьВТ.Добавить("ВТРазмерыОграниченийПоДоходам");
	УничтожитьВТ.Добавить("ВТИсчисленныеООСМС");
	УничтожитьВТ.Добавить("ВТДанныеПоКорректировкеДоходаИПН");
	УничтожитьВТ.Добавить("ВТСуммыКорректировки");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеООСМСПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	РезультатЗапроса = Результат[ВсегоРезультатов - 3].Выгрузить();
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныеООСМСВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияООСМСВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектООСМСИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныеООСМС", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияООСМС,ИсчисленныеООСМС");
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеООСМСПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияООСМСВЦеломЗаПериод,	ИсчисленныеООСМСВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектООСМСИсчисленныйРанее, 		 	РанееИсчисленныеООСМС,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход,					ОбъектИсчисленияООСМС, 					ИсчисленныеООСМС");
	
	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаООСМС);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);
	
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	Для каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
		СтрокаТЗ.ИсчисленныеООСМС = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныеООСМС, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
	КонецЦикла; 

	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьООСМСПосле2020(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) 

	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	СоздатьВТИсключаемыеЛицаОСМС(МенеджерВременныхТаблиц, "ВТИсключаемыеФизическиеЛицаПриРасчетеООСМС", МесяцНачисления);
	УничтожитьВТ.Добавить("ВТИсключаемыеФизическиеЛицаПриРасчетеООСМС");
	
	ВидНалогаВзносаООСМС =  Перечисления.ВидыНалоговВзносовОтчислений.ООСМС;
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаООСМС, "ВТИсключаемыеФизическиеЛицаПриРасчетеООСМС", Ложь);
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленных ООСМС
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаООСМС);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	// Статусы физических лиц как налогоплательщиков по периодам
	СоздатьВТСтатусыФизическихЛицКакНалогоплательщиков(МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТСтатусыФизическихЛицКакНалогоплательщиков");
	
	ПрименятьКорректировкуПрочихНалоговВзносовОтчислений = ЗарплатаКадрыРКПовтИсп.ПрименятьКорректировкуПрочихНалоговВзносовОтчислений(Организация, МесяцНачисления);
	Запрос.УстановитьПараметр("ПрименятьКорректировкуПрочихНалоговВзносовОтчислений", ПрименятьКорректировкуПрочихНалоговВзносовОтчислений);
	
	СоздатьВТДанныеПоКорректировкеДоходаИПН(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет, ИсключатьДоходыРегистратора, ПрименятьКорректировкуПрочихНалоговВзносовОтчислений);
	
	// Получаем применение минимального ограничения
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(МесяцНачисления, Новый Структура("Организация", Организация));
	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		ПрименятьОграничениеНаМинимальныйОбъектОСМС = УчетнаяПолитикаНУ[0].ПрименятьОграничениеНаМинимальныйОбъектОСМС;
	Иначе 
		ПрименятьОграничениеНаМинимальныйОбъектОСМС = Ложь;
	КонецЕсли;
	
	// - Исчисленные ООСМС
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмерыМЗППоПериодам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	0 КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыМЗППоПериодам.РазмерМЗП * 10 КАК МаксимальныйРазмерОрганиченияДохода
		|ПОМЕСТИТЬ ВТРазмерыОграниченийПоДоходам
		|ИЗ
		|	ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеИПН.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДанныеИПН.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(ДанныеИПН.СуммаКорректировки) КАК СуммаКорректировки
		|ПОМЕСТИТЬ ВТСуммыКорректировки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ИсчисленныйИПН.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		ИсчисленныйИПН.ФизическоеЛицо КАК ФизическоеЛицо,
		|		ЕСТЬNULL(ИсчисленныйИПН.ПримененнаяКорректировка, 0) КАК СуммаКорректировки
		|	ИЗ
		|		ВТИсчисленныйИПН КАК ИсчисленныйИПН
		|ГДЕ	
		|		&ПрименятьКорректировкуПрочихНалоговВзносовОтчислений	
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Доходы.МесяцНалоговогоПериода,
		|		Доходы.ФизическоеЛицо,
		|		ЕСТЬNULL(ДанныеПоКорректировкеДоходаИПН.ПримененнаяКорректировка, 0)
		|	ИЗ
		|		ВТДоходы КАК Доходы
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеПоКорректировкеДоходаИПН КАК ДанныеПоКорректировкеДоходаИПН
		|			ПО Доходы.МесяцНалоговогоПериода = ДанныеПоКорректировкеДоходаИПН.МесяцНалоговогоПериода
		|				И Доходы.ФизическоеЛицо = ДанныеПоКорректировкеДоходаИПН.ФизическоеЛицо) КАК ДанныеИПН
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеИПН.МесяцНалоговогоПериода,
		|	ДанныеИПН.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода КАК МаксимальныйРазмерОрганиченияДохода,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0) < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0) >= РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0)
		|	КОНЕЦ КАК ОбъектИсчисленияООСМС,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0) < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		КОГДА Доходы.ОблагаемыйДоход - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0) >= РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход - ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0)
		|	КОНЕЦ * ЕСТЬNULL(СтавкиОСМС.СтавкаОтчисления, 0) КАК ИсчисленныеООСМС
		|ПОМЕСТИТЬ ВТИсчисленныеООСМС
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиОСМС КАК СтавкиОСМС
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиОСМС.МесяцНалоговогоПериода
		|			И Доходы.ВидДохода = СтавкиОСМС.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСуммыКорректировки КАК СуммыКорректировки
		|		ПО Доходы.МесяцНалоговогоПериода = СуммыКорректировки.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = СуммыКорректировки.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеООСМС.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ВТИсчисленныеООСМС.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТИсчисленныеООСМС.ВидДохода КАК ВидДохода,
		|	ВТИсчисленныеООСМС.ОбъектИсчисленияООСМС КАК ОбъектИсчисленияООСМС,
		|	ВТИсчисленныеООСМС.ИсчисленныеООСМС КАК ИсчисленныеООСМС
		|ИЗ
		|	ВТИсчисленныеООСМС КАК ВТИсчисленныеООСМС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеООСМСПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныеООСМСПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныеООСМСПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныеООСМСПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныеООСМСПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеООСМСПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеООСМСПоПодразделениям.ОбъектИсчисления КАК ОбъектООСМСИсчисленныйРанее,
		|	ИсчисленныеООСМСПоПодразделениям.НалогВзнос КАК РанееИсчисленныеООСМС,
		|	-ИсчисленныеООСМСПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныеООСМСПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныеООСМСПоПодразделениям.НалогВзнос КАК ИсчисленныеООСМС,
		|	-ИсчисленныеООСМСПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияООСМС
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныеООСМСПоПодразделениям
		|ГДЕ
		|	(ИсчисленныеООСМСПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеООСМСПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеООСМСПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныеООСМСПоПодразделениям.НалогВзнос <> 0)";
		
	Если ПрименятьОграничениеНаМинимальныйОбъектОСМС Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "0 КАК МинимальныйРазмерОрганиченияДохода", "РазмерыМЗППоПериодам.РазмерМЗП КАК МинимальныйРазмерОрганиченияДохода");		
	КонецЕсли;
			
	Результат = Запрос.ВыполнитьПакет();	
	УничтожитьВТ.Добавить("ВТРазмерыОграниченийПоДоходам");
	УничтожитьВТ.Добавить("ВТИсчисленныеООСМС");
	УничтожитьВТ.Добавить("ВТДанныеПоКорректировкеДоходаИПН");
	УничтожитьВТ.Добавить("ВТСуммыКорректировки");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеООСМСПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	РезультатЗапроса = Результат[ВсегоРезультатов - 3].Выгрузить();
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныеООСМСВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияООСМСВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектООСМСИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныеООСМС", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаООСМС);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);

	// для корректного округления после распределения при достижении суммы максимального предела необходима точность 0
	ТочностьОкругления = ОписаниеСпособаОкругления.Точность - Цел(ОписаниеСпособаОкругления.Точность);
	
	Если ТочностьОкругления = 0 Тогда
		ТочностьРаспределения = 0;
	ИначеЕсли ТочностьОкругления <= 0.1 Тогда
		ТочностьРаспределения = 2;
	Иначе
		ТочностьРаспределения = 1;
	КонецЕсли;
			
	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияООСМС,ИсчисленныеООСМС", ТочностьРаспределения);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеООСМСПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияООСМСВЦеломЗаПериод,	ИсчисленныеООСМСВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектООСМСИсчисленныйРанее, 		 	РанееИсчисленныеООСМС,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход,					ОбъектИсчисленияООСМС, 					ИсчисленныеООСМС");
	
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	
	Для каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
		
		// спишем возникшую погрешность округления при перераспределении сумм по подразделениям
		Если СтрокаТЗ.ОблагаемыйДоход = 0
			И НЕ ОписаниеСпособаОкругления.ПравилоОкругления = Перечисления.ПравилаОкругленияПриРасчетеЗарплаты.Авто
			И (СтрокаТЗ.ИсчисленныеООСМС < 1 И СтрокаТЗ.ИсчисленныеООСМС > 0
				ИЛИ СтрокаТЗ.ИсчисленныеООСМС > -1 И СтрокаТЗ.ИсчисленныеООСМС < 0) Тогда
				
			СтрокаТЗ.ИсчисленныеООСМС = 0;
			
		// исчисление взносов производятся в тенге с учетом округления тиын
		Иначе
			
			СтрокаТЗ.ИсчисленныеООСМС = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныеООСМС, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
			
		КонецЕсли;
		
	КонецЦикла; 

	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьООСМСПосле2021(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) 

	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	СоздатьВТИсключаемыеЛицаОСМС(МенеджерВременныхТаблиц, "ВТИсключаемыеФизическиеЛицаПриРасчетеООСМС", МесяцНачисления);
	УничтожитьВТ.Добавить("ВТИсключаемыеФизическиеЛицаПриРасчетеООСМС");
	
	ВидНалогаВзносаООСМС =  Перечисления.ВидыНалоговВзносовОтчислений.ООСМС;
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаООСМС, "ВТИсключаемыеФизическиеЛицаПриРасчетеООСМС", Ложь);
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленных ООСМС
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаООСМС);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	// Статусы физических лиц как налогоплательщиков по периодам
	СоздатьВТСтатусыФизическихЛицКакНалогоплательщиков(МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТСтатусыФизическихЛицКакНалогоплательщиков");
	
	// Получаем применение минимального ограничения
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(МесяцНачисления, Новый Структура("Организация", Организация));
	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		ПрименятьОграничениеНаМинимальныйОбъектОСМС = УчетнаяПолитикаНУ[0].ПрименятьОграничениеНаМинимальныйОбъектОСМС;
	Иначе 
		ПрименятьОграничениеНаМинимальныйОбъектОСМС = Ложь;
	КонецЕсли;
	
	// - Исчисленные ООСМС
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмерыМЗППоПериодам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	0 КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыМЗППоПериодам.РазмерМЗП * 10 КАК МаксимальныйРазмерОрганиченияДохода
		|ПОМЕСТИТЬ ВТРазмерыОграниченийПоДоходам
		|ИЗ
		|	ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода КАК МаксимальныйРазмерОрганиченияДохода,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		КОГДА Доходы.ОблагаемыйДоход >= РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход 
		|	КОНЕЦ КАК ОбъектИсчисленияООСМС,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		КОГДА Доходы.ОблагаемыйДоход >= РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход 
        |	КОНЕЦ * ЕСТЬNULL(СтавкиОСМС.СтавкаОтчисления, 0) КАК ИсчисленныеООСМС
		|ПОМЕСТИТЬ ВТИсчисленныеООСМС
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиОСМС КАК СтавкиОСМС
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиОСМС.МесяцНалоговогоПериода
		|			И Доходы.ВидДохода = СтавкиОСМС.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеООСМС.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ВТИсчисленныеООСМС.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТИсчисленныеООСМС.ВидДохода КАК ВидДохода,
		|	ВТИсчисленныеООСМС.ОбъектИсчисленияООСМС КАК ОбъектИсчисленияООСМС,
		|	ВТИсчисленныеООСМС.ИсчисленныеООСМС КАК ИсчисленныеООСМС
		|ИЗ
		|	ВТИсчисленныеООСМС КАК ВТИсчисленныеООСМС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеООСМСПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныеООСМСПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныеООСМСПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныеООСМСПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныеООСМСПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеООСМСПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеООСМСПоПодразделениям.ОбъектИсчисления КАК ОбъектООСМСИсчисленныйРанее,
		|	ИсчисленныеООСМСПоПодразделениям.НалогВзнос КАК РанееИсчисленныеООСМС,
		|	-ИсчисленныеООСМСПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныеООСМСПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныеООСМСПоПодразделениям.НалогВзнос КАК ИсчисленныеООСМС,
		|	-ИсчисленныеООСМСПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияООСМС
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныеООСМСПоПодразделениям
		|ГДЕ
		|	(ИсчисленныеООСМСПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеООСМСПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеООСМСПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныеООСМСПоПодразделениям.НалогВзнос <> 0)";
		
	Если ПрименятьОграничениеНаМинимальныйОбъектОСМС Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "0 КАК МинимальныйРазмерОрганиченияДохода", "РазмерыМЗППоПериодам.РазмерМЗП КАК МинимальныйРазмерОрганиченияДохода");		
	КонецЕсли;
			
	Результат = Запрос.ВыполнитьПакет();	
	УничтожитьВТ.Добавить("ВТРазмерыОграниченийПоДоходам");
	УничтожитьВТ.Добавить("ВТИсчисленныеООСМС");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеООСМСПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	РезультатЗапроса = Результат[ВсегоРезультатов - 3].Выгрузить();
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныеООСМСВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияООСМСВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектООСМСИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныеООСМС", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаООСМС);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);

	// для корректного округления после распределения при достижении суммы максимального предела необходима точность 0
	ТочностьОкругления = ОписаниеСпособаОкругления.Точность - Цел(ОписаниеСпособаОкругления.Точность);
	
	Если ТочностьОкругления = 0 Тогда
		ТочностьРаспределения = 0;
	ИначеЕсли ТочностьОкругления <= 0.1 Тогда
		ТочностьРаспределения = 2;
	Иначе
		ТочностьРаспределения = 1;
	КонецЕсли;
			
	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияООСМС,ИсчисленныеООСМС", ТочностьРаспределения);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеООСМСПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияООСМСВЦеломЗаПериод,	ИсчисленныеООСМСВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектООСМСИсчисленныйРанее, 		 	РанееИсчисленныеООСМС,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход,					ОбъектИсчисленияООСМС, 					ИсчисленныеООСМС");
	
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	
	Для каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
		
		// спишем возникшую погрешность округления при перераспределении сумм по подразделениям
		Если СтрокаТЗ.ОблагаемыйДоход = 0
			И НЕ ОписаниеСпособаОкругления.ПравилоОкругления = Перечисления.ПравилаОкругленияПриРасчетеЗарплаты.Авто
			И (СтрокаТЗ.ИсчисленныеООСМС < 1 И СтрокаТЗ.ИсчисленныеООСМС > 0
				ИЛИ СтрокаТЗ.ИсчисленныеООСМС > -1 И СтрокаТЗ.ИсчисленныеООСМС < 0) Тогда
				
			СтрокаТЗ.ИсчисленныеООСМС = 0;
			
		// исчисление взносов производятся в тенге с учетом округления тиын
		Иначе
			
			СтрокаТЗ.ИсчисленныеООСМС = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныеООСМС, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
			
		КонецЕсли;
		
	КонецЦикла; 

	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьООСМСПосле2022(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) 

	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	СоздатьВТИсключаемыеЛицаОСМС(МенеджерВременныхТаблиц, "ВТИсключаемыеФизическиеЛицаПриРасчетеООСМС", МесяцНачисления);
	УничтожитьВТ.Добавить("ВТИсключаемыеФизическиеЛицаПриРасчетеООСМС");
	
	ВидНалогаВзносаООСМС =  Перечисления.ВидыНалоговВзносовОтчислений.ООСМС;
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаООСМС, "ВТИсключаемыеФизическиеЛицаПриРасчетеООСМС", Ложь);
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленных ООСМС
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаООСМС);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	// Статусы физических лиц как налогоплательщиков по периодам
	СоздатьВТСтатусыФизическихЛицКакНалогоплательщиков(МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТСтатусыФизическихЛицКакНалогоплательщиков");
	
	// - Исчисленные ООСМС
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмерыМЗППоПериодам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	0 КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыМЗППоПериодам.РазмерМЗП * 10 КАК МаксимальныйРазмерОрганиченияДохода
		|ПОМЕСТИТЬ ВТРазмерыОграниченийПоДоходам
		|ИЗ
		|	ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода КАК МаксимальныйРазмерОрганиченияДохода,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		КОГДА Доходы.ОблагаемыйДоход >= РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход 
		|	КОНЕЦ КАК ОбъектИсчисленияООСМС,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		КОГДА Доходы.ОблагаемыйДоход >= РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход 
        |	КОНЕЦ * ЕСТЬNULL(СтавкиОСМС.СтавкаОтчисления, 0) КАК ИсчисленныеООСМС
		|ПОМЕСТИТЬ ВТИсчисленныеООСМС
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиОСМС КАК СтавкиОСМС
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиОСМС.МесяцНалоговогоПериода
		|			И Доходы.ВидДохода = СтавкиОСМС.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеООСМС.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ВТИсчисленныеООСМС.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТИсчисленныеООСМС.ВидДохода КАК ВидДохода,
		|	ВТИсчисленныеООСМС.ОбъектИсчисленияООСМС КАК ОбъектИсчисленияООСМС,
		|	ВТИсчисленныеООСМС.ИсчисленныеООСМС КАК ИсчисленныеООСМС
		|ИЗ
		|	ВТИсчисленныеООСМС КАК ВТИсчисленныеООСМС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеООСМСПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныеООСМСПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныеООСМСПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныеООСМСПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныеООСМСПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеООСМСПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеООСМСПоПодразделениям.ОбъектИсчисления КАК ОбъектООСМСИсчисленныйРанее,
		|	ИсчисленныеООСМСПоПодразделениям.НалогВзнос КАК РанееИсчисленныеООСМС,
		|	-ИсчисленныеООСМСПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныеООСМСПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныеООСМСПоПодразделениям.НалогВзнос КАК ИсчисленныеООСМС,
		|	-ИсчисленныеООСМСПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияООСМС
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныеООСМСПоПодразделениям
		|ГДЕ
		|	(ИсчисленныеООСМСПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеООСМСПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеООСМСПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныеООСМСПоПодразделениям.НалогВзнос <> 0)";
			
	Результат = Запрос.ВыполнитьПакет();	
	УничтожитьВТ.Добавить("ВТРазмерыОграниченийПоДоходам");
	УничтожитьВТ.Добавить("ВТИсчисленныеООСМС");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеООСМСПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	РезультатЗапроса = Результат[ВсегоРезультатов - 3].Выгрузить();
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныеООСМСВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияООСМСВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектООСМСИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныеООСМС", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	ДанныеОкругления = ПолучитьСпособОкругленияСПериодом(МенеджерВременныхТаблиц, ВидНалогаВзносаООСМС);
	СпособОкругления = ДанныеОкругления.СпособОкругления;
	ПериодОкругления = ДанныеОкругления.Период;
	
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);
	
	Если ПериодОкругления >= '20220101' Тогда
		// для корректного округления после распределения при достижении суммы максимального предела необходима точность 0
		ТочностьОкругления = ОписаниеСпособаОкругления.Точность - Цел(ОписаниеСпособаОкругления.Точность);
		ПравилоОкругления = ОписаниеСпособаОкругления.ПравилоОкругления;		
	Иначе
		ТочностьОкругления = 1;
		ПравилоОкругления = Перечисления.ПравилаОкругленияПриРасчетеЗарплаты.Авто;		
	КонецЕсли;
	
	Если ТочностьОкругления = 0 Тогда
		ТочностьРаспределения = 0;
	ИначеЕсли ТочностьОкругления <= 0.1 Тогда
		ТочностьРаспределения = 2;
	Иначе
		ТочностьРаспределения = 1;
	КонецЕсли;
			
	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияООСМС,ИсчисленныеООСМС", ТочностьРаспределения);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеООСМСПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияООСМСВЦеломЗаПериод,	ИсчисленныеООСМСВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектООСМСИсчисленныйРанее, 		 	РанееИсчисленныеООСМС,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход,					ОбъектИсчисленияООСМС, 					ИсчисленныеООСМС");
	
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	
	Для каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
		
		// спишем возникшую погрешность округления при перераспределении сумм по подразделениям
		Если СтрокаТЗ.ОблагаемыйДоход = 0
			И НЕ ОписаниеСпособаОкругления.ПравилоОкругления = Перечисления.ПравилаОкругленияПриРасчетеЗарплаты.Авто
			И (СтрокаТЗ.ИсчисленныеООСМС < 1 И СтрокаТЗ.ИсчисленныеООСМС > 0
				ИЛИ СтрокаТЗ.ИсчисленныеООСМС > -1 И СтрокаТЗ.ИсчисленныеООСМС < 0) Тогда
				
			СтрокаТЗ.ИсчисленныеООСМС = 0;
			
		// исчисление взносов производятся в тенге с учетом округления тиын
		Иначе
			
			СтрокаТЗ.ИсчисленныеООСМС = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныеООСМС, ТочностьОкругления, ПравилоОкругления);
			
		КонецЕсли;
		
	КонецЦикла; 

	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьВОСМСДо2019(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	СоздатьВТИсключаемыеЛицаОСМС(МенеджерВременныхТаблиц, "ВТИсключаемыеФизическиеЛицаПриРасчетеВОСМС", МесяцНачисления);
	УничтожитьВТ.Добавить("ВТИсключаемыеФизическиеЛицаПриРасчетеВОСМС");
	
	ВидНалогаВзносаВОСМС =  Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС;
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаВОСМС, "ВТИсключаемыеФизическиеЛицаПриРасчетеВОСМС", Ложь);
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленных ВОСМС
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаВОСМС);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	// Статусы физических лиц как налогоплательщиков по периодам
	СоздатьВТСтатусыФизическихЛицКакНалогоплательщиков(МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТСтатусыФизическихЛицКакНалогоплательщиков");
	
	// - Исчисленные ВОСМС
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмерыМЗППоПериодам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	РазмерыМЗППоПериодам.РазмерМЗП КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыМЗППоПериодам.РазмерМЗП * 15 КАК МаксимальныйРазмерОрганиченияДохода
		|ПОМЕСТИТЬ ВТРазмерыОграниченийПоДоходам
		|ИЗ
		|	ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода КАК МаксимальныйРазмерОрганиченияДохода,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		КОГДА Доходы.ОблагаемыйДоход >= РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход
		|	КОНЕЦ КАК ОбъектИсчисленияВОСМС,
		|	ВЫБОР
		|		КОГДА Доходы.ОблагаемыйДоход <= 0
		|			ТОГДА 0
		|		КОГДА Доходы.ОблагаемыйДоход < РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода
		|		КОГДА Доходы.ОблагаемыйДоход >= РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|			ТОГДА РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода
		|		ИНАЧЕ Доходы.ОблагаемыйДоход
		|	КОНЕЦ * ЕСТЬNULL(СтавкиОСМС.СтавкаВзносы, 0) КАК ИсчисленныеВОСМС
		|ПОМЕСТИТЬ ВТИсчисленныеВОСМС
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиОСМС КАК СтавкиОСМС
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиОСМС.МесяцНалоговогоПериода
		|			И Доходы.ВидДохода = СтавкиОСМС.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеВОСМС.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ВТИсчисленныеВОСМС.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТИсчисленныеВОСМС.ВидДохода КАК ВидДохода,
		|	ВТИсчисленныеВОСМС.ОбъектИсчисленияВОСМС КАК ОбъектИсчисленияВОСМС,
		|	ВТИсчисленныеВОСМС.ИсчисленныеВОСМС КАК ИсчисленныеВОСМС
		|ИЗ
		|	ВТИсчисленныеВОСМС КАК ВТИсчисленныеВОСМС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеВОСМСПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныеВОСМСПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныеВОСМСПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныеВОСМСПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныеВОСМСПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеВОСМСПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеВОСМСПоПодразделениям.ОбъектИсчисления КАК ОбъектВОСМСИсчисленныйРанее,
		|	ИсчисленныеВОСМСПоПодразделениям.НалогВзнос КАК РанееИсчисленныеВОСМС,
		|	-ИсчисленныеВОСМСПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныеВОСМСПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныеВОСМСПоПодразделениям.НалогВзнос КАК ИсчисленныеВОСМС,
		|	-ИсчисленныеВОСМСПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияВОСМС
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныеВОСМСПоПодразделениям
		|ГДЕ
		|	(ИсчисленныеВОСМСПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеВОСМСПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеВОСМСПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныеВОСМСПоПодразделениям.НалогВзнос <> 0)";
	
	Результат = Запрос.ВыполнитьПакет();	
	УничтожитьВТ.Добавить("ВТРазмерыОграниченийПоДоходам");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеВОСМСПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	РезультатЗапроса = Результат[ВсегоРезультатов - 3].Выгрузить();
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныеВОСМСВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияВОСМСВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектВОСМСИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныеВОСМС", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияВОСМС,ИсчисленныеВОСМС");
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеВОСМСПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияВОСМСВЦеломЗаПериод,	ИсчисленныеВОСМСВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектВОСМСИсчисленныйРанее, 		 	РанееИсчисленныеВОСМС,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход,					ОбъектИсчисленияВОСМС, 					ИсчисленныеВОСМС");
	
	СпособОкругления = ПолучитьСпособОкругления(МенеджерВременныхТаблиц, ВидНалогаВзносаВОСМС);
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);
	
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	Для каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
		СтрокаТЗ.ИсчисленныеВОСМС = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныеВОСМС, ОписаниеСпособаОкругления.Точность, ОписаниеСпособаОкругления.ПравилоОкругления);
	КонецЦикла; 

	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьВОСМСПосле2020(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина, ДополнительныеПараметры = Неопределено) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	Если ДополнительныеПараметры <> Неопределено Тогда
		Если ДополнительныеПараметры.Свойство("ТолькоДоходОтНалоговогоАгента") Тогда
			ТолькоДоходОтНалоговогоАгента = ДополнительныеПараметры.ТолькоДоходОтНалоговогоАгента;	
		КонецЕсли;
	Иначе
		ТолькоДоходОтНалоговогоАгента = Ложь;
	КонецЕсли;

	ПрименятьКорректировкуПрочихНалоговВзносовОтчислений = ЗарплатаКадрыРКПовтИсп.ПрименятьКорректировкуПрочихНалоговВзносовОтчислений(ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(Организация), МесяцНачисления);
	
	Если ТолькоДоходОтНалоговогоАгента Тогда
		ПрименятьКорректировкуПрочихНалоговВзносовОтчислений = Ложь;	
	КонецЕсли;
	
	Если ПрименятьКорректировкуПрочихНалоговВзносовОтчислений Тогда
		ПолеКорректировки = "- ЕСТЬNULL(СуммыКорректировки.СуммаКорректировки, 0)";
	Иначе
		ПолеКорректировки = "0";
	КонецЕсли;
	
	СоздатьВТИсключаемыеЛицаОСМС(МенеджерВременныхТаблиц, "ВТИсключаемыеФизическиеЛицаПриРасчетеВОСМС", МесяцНачисления);
	УничтожитьВТ.Добавить("ВТИсключаемыеФизическиеЛицаПриРасчетеВОСМС");
	
	ВидНалогаВзносаВОСМС =  Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС;
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаВОСМС, "ВТИсключаемыеФизическиеЛицаПриРасчетеВОСМС", Ложь);
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленных ВОСМС
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаВОСМС);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	// Статусы физических лиц как налогоплательщиков по периодам
	СоздатьВТСтатусыФизическихЛицКакНалогоплательщиков(МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТСтатусыФизическихЛицКакНалогоплательщиков");
	
	СоздатьВТДанныеПоКорректировкеДоходаИПН(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет, ИсключатьДоходыРегистратора, ПрименятьКорректировкуПрочихНалоговВзносовОтчислений);
		
	// - Исчисленные ВОСМС
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмерыМЗППоПериодам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	0 КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыМЗППоПериодам.РазмерМЗП * 10 КАК МаксимальныйРазмерОрганиченияДохода
		|ПОМЕСТИТЬ ВТРазмерыОграниченийПоДоходам
		|ИЗ
		|	ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|" + ?(ПрименятьКорректировкуПрочихНалоговВзносовОтчислений, "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеИПН.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДанныеИПН.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СУММА(ДанныеИПН.СуммаКорректировки) КАК СуммаКорректировки
		|ПОМЕСТИТЬ ВТСуммыКорректировки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ИсчисленныйИПН.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		ИсчисленныйИПН.ФизическоеЛицо КАК ФизическоеЛицо,
		|		ЕСТЬNULL(ИсчисленныйИПН.ПримененнаяКорректировка, 0) КАК СуммаКорректировки
		|	ИЗ
		|		ВТИсчисленныйИПН КАК ИсчисленныйИПН
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Доходы.МесяцНалоговогоПериода,
		|		Доходы.ФизическоеЛицо,
		|		ЕСТЬNULL(ДанныеПоКорректировкеДоходаИПН.ПримененнаяКорректировка, 0)
		|	ИЗ
		|		ВТДоходы КАК Доходы
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеПоКорректировкеДоходаИПН КАК ДанныеПоКорректировкеДоходаИПН
		|			ПО Доходы.МесяцНалоговогоПериода = ДанныеПоКорректировкеДоходаИПН.МесяцНалоговогоПериода
		|				И Доходы.ФизическоеЛицо = ДанныеПоКорректировкеДоходаИПН.ФизическоеЛицо) КАК ДанныеИПН
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеИПН.МесяцНалоговогоПериода,
		|	ДанныеИПН.ФизическоеЛицо", "") + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	МАКСИМУМ(Доходы.ОблагаемыйДоход) КАК ОблагаемыйДоход,
		|	МАКСИМУМ(ЕСТЬNULL(РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода, 0)) КАК МинимальныйРазмерОрганиченияДохода,
		|	МАКСИМУМ(ЕСТЬNULL(РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода, 0)) КАК МаксимальныйРазмерОрганиченияДохода,
		|	МАКСИМУМ(" + ПолеКорректировки + ") КАК СуммаКорректировки,
		|	ЕСТЬNULL(СтавкиОСМС.СтавкаВзносы, 0) КАК Ставка,
		|	МАКСИМУМ(ВЫБОР КОГДА ДругиеВидыДоходов.ВидДохода ЕСТЬ NULL ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ) КАК ЕстьНесколькоВидовДоходов,
		|	МАКСИМУМ(ВЫБОР КОГДА НЕ ДругиеВидыДоходов.ВидДохода ЕСТЬ NULL ИЛИ РанееИсчисленныеНалогиВзносы.ВОСМСПредыдущегоМестаРаботы ЕСТЬ NULL ТОГДА 0 ИНАЧЕ РанееИсчисленныеНалогиВзносы.ВОСМСПредыдущегоМестаРаботы КОНЕЦ) КАК ВОСМСПредыдущегоМестаРаботы,
		|	0 КАК ОбъектИсчисленияВОСМС,
		|	0 КАК ИсчисленныеВОСМС
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиОСМС КАК СтавкиОСМС
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиОСМС.МесяцНалоговогоПериода
		|			И Доходы.ВидДохода = СтавкиОСМС.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходы КАК ДругиеВидыДоходов
		|		ПО ДругиеВидыДоходов.МесяцНалоговогоПериода = Доходы.МесяцНалоговогоПериода
		|			И ДругиеВидыДоходов.ФизическоеЛицо = Доходы.ФизическоеЛицо
		|			И НЕ ДругиеВидыДоходов.ВидДохода = Доходы.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРанееИсчисленныеНалогиВзносы КАК РанееИсчисленныеНалогиВзносы
		|		ПО Доходы.МесяцНалоговогоПериода = РанееИсчисленныеНалогиВзносы.МесяцНалоговогоПериода
		|			И РанееИсчисленныеНалогиВзносы.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС)
		|			И Доходы.ФизическоеЛицо = РанееИсчисленныеНалогиВзносы.ФизическоеЛицо
		|" + ?(ПрименятьКорректировкуПрочихНалоговВзносовОтчислений, "
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСуммыКорректировки КАК СуммыКорректировки
		|		ПО Доходы.МесяцНалоговогоПериода = СуммыКорректировки.МесяцНалоговогоПериода
		|			И Доходы.ФизическоеЛицо = СуммыКорректировки.ФизическоеЛицо
		|			И Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)", "") + "
		|СГРУППИРОВАТЬ ПО
		|	Доходы.МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо,
		|	Доходы.ВидДохода,
		|	ЕСТЬNULL(СтавкиОСМС.СтавкаВзносы, 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Доходы.ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеВОСМСПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныеВОСМСПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныеВОСМСПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныеВОСМСПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныеВОСМСПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеВОСМСПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеВОСМСПоПодразделениям.ОбъектИсчисления КАК ОбъектВОСМСИсчисленныйРанее,
		|	ИсчисленныеВОСМСПоПодразделениям.НалогВзнос КАК РанееИсчисленныеВОСМС,
		|	-ИсчисленныеВОСМСПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныеВОСМСПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныеВОСМСПоПодразделениям.НалогВзнос КАК ИсчисленныеВОСМС,
		|	-ИсчисленныеВОСМСПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияВОСМС
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныеВОСМСПоПодразделениям
		|ГДЕ
		|	(ИсчисленныеВОСМСПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеВОСМСПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеВОСМСПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныеВОСМСПоПодразделениям.НалогВзнос <> 0)";
	
	Результат = Запрос.ВыполнитьПакет();	
	УничтожитьВТ.Добавить("ВТРазмерыОграниченийПоДоходам");
	УничтожитьВТ.Добавить("ВТДанныеПоКорректировкеДоходаИПН");
	
	Если ПрименятьКорректировкуПрочихНалоговВзносовОтчислений Тогда
		УничтожитьВТ.Добавить("ВТСуммыКорректировки");
	КонецЕсли;
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеВОСМСПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	
	РезультатЗапроса = Новый ТаблицаЗначений;
	РезультатЗапроса.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	РезультатЗапроса.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	РезультатЗапроса.Колонки.Добавить("ВидДохода", Новый ОписаниеТипов("СправочникСсылка.ВидыДоходов"));
	РезультатЗапроса.Колонки.Добавить("ОбъектИсчисленияВОСМС", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатЗапроса.Колонки.Добавить("ИсчисленныеВОСМС", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ТаблицаДляОбработки = Результат[ВсегоРезультатов - 3].Выгрузить();
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныеВОСМСВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияВОСМСВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектВОСМСИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ВОСМСПредыдущегоМестаРаботы", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныеВОСМС", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ТаблицаВзносовПоФизЛицамПоДругимДоходам = Новый ТаблицаЗначений;
	ТаблицаВзносовПоФизЛицамПоДругимДоходам.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаВзносовПоФизЛицамПоДругимДоходам.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаВзносовПоФизЛицамПоДругимДоходам.Колонки.Добавить("ОбъектИсчисления", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ТаблицаВзносовПоФизЛицамПоДругимДоходам.Индексы.Добавить("ФизическоеЛицо, МесяцНалоговогоПериода");
	
	СтруктураПоискаПоФизЛицам = Новый Структура("ФизическоеЛицо, МесяцНалоговогоПериода");
	
	Для Каждого СтрокаТаблицы Из ТаблицаДляОбработки Цикл
		
		ОбъектИсчисленияПоДругимВидамВДанномРасчете = 0;
		
		// корректируем максимальный доход только в окончательном расчете, если есть несколько видов дохода в месяце начисления
		НеобходимаКорректировкаМакисмальногоОграничения = ОкончательныйРасчет И СтрокаТаблицы.ЕстьНесколькоВидовДоходов;
		
		Если НеобходимаКорректировкаМакисмальногоОграничения Тогда
			
			ЗаполнитьЗначенияСвойств(СтруктураПоискаПоФизЛицам, СтрокаТаблицы);

			// сумма взносов исчисленная
			МассивВзносов = ТаблицаВзносовПоФизЛицамПоДругимДоходам.НайтиСтроки(СтруктураПоискаПоФизЛицам);
			
			Если МассивВзносов.Количество() > 0 Тогда
				ОбъектИсчисленияПоДругимВидамВДанномРасчете = МассивВзносов[0].ОбъектИсчисления;
			Иначе
				ОбъектИсчисленияПоДругимВидамВДанномРасчете = 0;
			КонецЕсли;
			
		Иначе
			
			ОбъектИсчисленияПоДругимВидамВДанномРасчете = 0;
			
		КонецЕсли;
		
		МаксимальныйРазмерОрганиченияДохода = СтрокаТаблицы.МаксимальныйРазмерОрганиченияДохода - ОбъектИсчисленияПоДругимВидамВДанномРасчете - ?(СтрокаТаблицы.Ставка = 0, 0, СтрокаТаблицы.ВОСМСПредыдущегоМестаРаботы / СтрокаТаблицы.Ставка);
		
		Если СтрокаТаблицы.ОблагаемыйДоход <= 0 Тогда
			
			СтрокаТаблицы.ОбъектИсчисленияВОСМС = 0;
			
		ИначеЕсли СтрокаТаблицы.ОблагаемыйДоход + СтрокаТаблицы.СуммаКорректировки < СтрокаТаблицы.МинимальныйРазмерОрганиченияДохода Тогда
			
			СтрокаТаблицы.ОбъектИсчисленияВОСМС = 0;
			
		ИначеЕсли СтрокаТаблицы.ОблагаемыйДоход + СтрокаТаблицы.СуммаКорректировки >= МаксимальныйРазмерОрганиченияДохода Тогда
			
			СтрокаТаблицы.ОбъектИсчисленияВОСМС = МаксимальныйРазмерОрганиченияДохода;
			
		Иначе
			
			СтрокаТаблицы.ОбъектИсчисленияВОСМС = СтрокаТаблицы.ОблагаемыйДоход + СтрокаТаблицы.СуммаКорректировки;
			
		КонецЕсли;
		
		СтрокаТаблицы.ИсчисленныеВОСМС = СтрокаТаблицы.ОбъектИсчисленияВОСМС * СтрокаТаблицы.Ставка;	
		
		Если НеобходимаКорректировкаМакисмальногоОграничения Тогда
			
			МассивВзносов = ТаблицаВзносовПоФизЛицамПоДругимДоходам.НайтиСтроки(СтруктураПоискаПоФизЛицам);
			Если МассивВзносов.Количество() > 0 Тогда
				СтрокаВзносовТаблицаВзносовПоФизЛицам = МассивВзносов[0];
				СтрокаВзносовТаблицаВзносовПоФизЛицам.ОбъектИсчисления = СтрокаВзносовТаблицаВзносовПоФизЛицам.ОбъектИсчисления + СтрокаТаблицы.ОбъектИсчисленияВОСМС;
			Иначе
				СтрокаВзносовТаблицаВзносовПоФизЛицам = ТаблицаВзносовПоФизЛицамПоДругимДоходам.Добавить();
				СтрокаВзносовТаблицаВзносовПоФизЛицам.МесяцНалоговогоПериода = СтрокаТаблицы.МесяцНалоговогоПериода;
				СтрокаВзносовТаблицаВзносовПоФизЛицам.ФизическоеЛицо = СтрокаТаблицы.ФизическоеЛицо;
				СтрокаВзносовТаблицаВзносовПоФизЛицам.ОбъектИсчисления = СтрокаТаблицы.ОбъектИсчисленияВОСМС;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаДляОбработки, РезультатЗапроса);
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияВОСМС,ИсчисленныеВОСМС", 0);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеВОСМСПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияВОСМСВЦеломЗаПериод,	ИсчисленныеВОСМСВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектВОСМСИсчисленныйРанее, 		 	РанееИсчисленныеВОСМС,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход,					ОбъектИсчисленияВОСМС, 					ИсчисленныеВОСМС");
	
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	
	Для каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
		
		// спишем возникшую погрешность округления при межрасчете или исправлении или перераспределении сумм по подразделениям
		Если СтрокаТЗ.ОблагаемыйДоход = 0 
			И (СтрокаТЗ.ИсчисленныеВОСМС < 1 И СтрокаТЗ.ИсчисленныеВОСМС > 0
				ИЛИ СтрокаТЗ.ИсчисленныеВОСМС > -1 И СтрокаТЗ.ИсчисленныеВОСМС < 0) Тогда
				
			СтрокаТЗ.ИсчисленныеВОСМС = 0;
			
		// исчисление взносов производятся в тенге с учетом округления тиын
		Иначе
			
			СтрокаТЗ.ИсчисленныеВОСМС = Окр(СтрокаТЗ.ИсчисленныеВОСМС, 0, РежимОкругления.Окр15как20);
			
		КонецЕсли;
		
	КонецЦикла; 

	// для вычетов ИПН передаем общую таблицу округленных сумм
	ТаблицаДляВычетовИПН = РезультатЗапроса.Скопировать();
	
	Для каждого СтрокаТЗ Из ТаблицаДляВычетовИПН Цикл
		СтрокаТЗ.ИсчисленныеВОСМС = Окр(СтрокаТЗ.ИсчисленныеВОСМС, 0, РежимОкругления.Окр15как20);
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("ИсчисленныеВОСМС", ТаблицаДляВычетовИПН);
	
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	ВТИсчисленныеВОСМС.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ВТИсчисленныеВОСМС.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТИсчисленныеВОСМС.ВидДохода КАК ВидДохода,
		|	ВТИсчисленныеВОСМС.ОбъектИсчисленияВОСМС КАК ОбъектИсчисленияВОСМС,
		|	ВТИсчисленныеВОСМС.ИсчисленныеВОСМС КАК ИсчисленныеВОСМС
		|ПОМЕСТИТЬ ВТИсчисленныеВОСМСПоПодразделениям
		|ИЗ
		|	&ИсчисленныеВОСМС КАК ВТИсчисленныеВОСМС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеВОСМСПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеВОСМСПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеВОСМСПоПодразделениям.ВидДохода,
		|	СУММА(ВТИсчисленныеВОСМСПоПодразделениям.ОбъектИсчисленияВОСМС) КАК ОбъектИсчисленияВОСМС,
		|	СУММА(ВТИсчисленныеВОСМСПоПодразделениям.ИсчисленныеВОСМС) КАК ИсчисленныеВОСМС
		|ПОМЕСТИТЬ ВТИсчисленныеВОСМС" + ?(ТолькоДоходОтНалоговогоАгента, "ДоходОтНалоговогоАгента", "") + "
		|ИЗ
		|	ВТИсчисленныеВОСМСПоПодразделениям КАК ВТИсчисленныеВОСМСПоПодразделениям
		|" + ?(ТолькоДоходОтНалоговогоАгента, "
		|ГДЕ
		|	ВТИсчисленныеВОСМСПоПодразделениям.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
		|", "") + "
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТИсчисленныеВОСМСПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеВОСМСПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеВОСМСПоПодразделениям.ВидДохода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВТИсчисленныеВОСМСПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеВОСМСПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеВОСМСПоПодразделениям.ВидДохода
		|";
	
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТИсчисленныеВОСМСПоПодразделениям");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьВОСМСПосле2021(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	СоздатьВТИсключаемыеЛицаОСМС(МенеджерВременныхТаблиц, "ВТИсключаемыеФизическиеЛицаПриРасчетеВОСМС", МесяцНачисления);
	УничтожитьВТ.Добавить("ВТИсключаемыеФизическиеЛицаПриРасчетеВОСМС");
	
	ВидНалогаВзносаВОСМС =  Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС;
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаВОСМС, "ВТИсключаемыеФизическиеЛицаПриРасчетеВОСМС", Ложь);
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленных ВОСМС
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаВОСМС);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	// Статусы физических лиц как налогоплательщиков по периодам
	СоздатьВТСтатусыФизическихЛицКакНалогоплательщиков(МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТСтатусыФизическихЛицКакНалогоплательщиков");
	
	// - Исчисленные ВОСМС
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмерыМЗППоПериодам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	0 КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыМЗППоПериодам.РазмерМЗП * 10 КАК МаксимальныйРазмерОрганиченияДохода,
		|	РазмерыМЗППоПериодам.РазмерМЗП * 1.4 КАК ОбъектИсчисленияДляИП
		|ПОМЕСТИТЬ ВТРазмерыОграниченийПоДоходам
		|ИЗ
		|	ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	МАКСИМУМ(ВЫБОР КОГДА Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства) ТОГДА ЕСТЬNULL(РазмерыОграниченийПоДоходам.ОбъектИсчисленияДляИП, 0) ИНАЧЕ Доходы.ОблагаемыйДоход КОНЕЦ) КАК ОблагаемыйДоход,
		|	МАКСИМУМ(ЕСТЬNULL(РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода, 0)) КАК МинимальныйРазмерОрганиченияДохода,
		|	МАКСИМУМ(ЕСТЬNULL(РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода, 0)) КАК МаксимальныйРазмерОрганиченияДохода,
		|	МАКСИМУМ(0) КАК СуммаКорректировки,
		|	ЕСТЬNULL(СтавкиОСМС.СтавкаВзносы, 0) КАК Ставка,
		|	МАКСИМУМ(ВЫБОР КОГДА ДругиеВидыДоходов.ВидДохода ЕСТЬ NULL ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ) КАК ЕстьНесколькоВидовДоходов,
		|	МАКСИМУМ(ВЫБОР КОГДА НЕ ДругиеВидыДоходов.ВидДохода ЕСТЬ NULL ИЛИ РанееИсчисленныеНалогиВзносы.ВОСМСПредыдущегоМестаРаботы ЕСТЬ NULL ТОГДА 0 ИНАЧЕ РанееИсчисленныеНалогиВзносы.ВОСМСПредыдущегоМестаРаботы КОНЕЦ) КАК ВОСМСПредыдущегоМестаРаботы,
		|	0 КАК ОбъектИсчисленияВОСМС,
		|	0 КАК ИсчисленныеВОСМС
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиОСМС КАК СтавкиОСМС
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиОСМС.МесяцНалоговогоПериода
		|			И Доходы.ВидДохода = СтавкиОСМС.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходы КАК ДругиеВидыДоходов
		|		ПО ДругиеВидыДоходов.МесяцНалоговогоПериода = Доходы.МесяцНалоговогоПериода
		|			И ДругиеВидыДоходов.ФизическоеЛицо = Доходы.ФизическоеЛицо
		|			И НЕ ДругиеВидыДоходов.ВидДохода = Доходы.ВидДохода
		|			И НЕ ДругиеВидыДоходов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРанееИсчисленныеНалогиВзносы КАК РанееИсчисленныеНалогиВзносы
		|		ПО Доходы.МесяцНалоговогоПериода = РанееИсчисленныеНалогиВзносы.МесяцНалоговогоПериода
		|			И РанееИсчисленныеНалогиВзносы.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС)
		|			И Доходы.ФизическоеЛицо = РанееИсчисленныеНалогиВзносы.ФизическоеЛицо
		|СГРУППИРОВАТЬ ПО
		|	Доходы.МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо,
		|	Доходы.ВидДохода,
		|	ЕСТЬNULL(СтавкиОСМС.СтавкаВзносы, 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Доходы.ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеВОСМСПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныеВОСМСПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныеВОСМСПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныеВОСМСПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныеВОСМСПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеВОСМСПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеВОСМСПоПодразделениям.ОбъектИсчисления КАК ОбъектВОСМСИсчисленныйРанее,
		|	ИсчисленныеВОСМСПоПодразделениям.НалогВзнос КАК РанееИсчисленныеВОСМС,
		|	-ИсчисленныеВОСМСПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныеВОСМСПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныеВОСМСПоПодразделениям.НалогВзнос КАК ИсчисленныеВОСМС,
		|	-ИсчисленныеВОСМСПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияВОСМС
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныеВОСМСПоПодразделениям
		|ГДЕ
		|	(ИсчисленныеВОСМСПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеВОСМСПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеВОСМСПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныеВОСМСПоПодразделениям.НалогВзнос <> 0)
		|	И НЕ ИсчисленныеВОСМСПоПодразделениям.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства)";
	
	Результат = Запрос.ВыполнитьПакет();	
	УничтожитьВТ.Добавить("ВТРазмерыОграниченийПоДоходам");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеВОСМСПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	
	РезультатЗапроса = Новый ТаблицаЗначений;
	РезультатЗапроса.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	РезультатЗапроса.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	РезультатЗапроса.Колонки.Добавить("ВидДохода", Новый ОписаниеТипов("СправочникСсылка.ВидыДоходов"));
	РезультатЗапроса.Колонки.Добавить("ОбъектИсчисленияВОСМС", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатЗапроса.Колонки.Добавить("ИсчисленныеВОСМС", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ТаблицаДляОбработки = Результат[ВсегоРезультатов - 3].Выгрузить();
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныеВОСМСВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияВОСМСВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектВОСМСИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ВОСМСПредыдущегоМестаРаботы", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныеВОСМС", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ТаблицаВзносовПоФизЛицамПоДругимДоходам = Новый ТаблицаЗначений;
	ТаблицаВзносовПоФизЛицамПоДругимДоходам.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаВзносовПоФизЛицамПоДругимДоходам.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаВзносовПоФизЛицамПоДругимДоходам.Колонки.Добавить("ОбъектИсчисления", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ТаблицаВзносовПоФизЛицамПоДругимДоходам.Индексы.Добавить("ФизическоеЛицо, МесяцНалоговогоПериода");
	
	СтруктураПоискаПоФизЛицам = Новый Структура("ФизическоеЛицо, МесяцНалоговогоПериода");
	
	Для Каждого СтрокаТаблицы Из ТаблицаДляОбработки Цикл
		
		ОбъектИсчисленияПоДругимВидамВДанномРасчете = 0;
		
		// корректируем максимальный доход только в окончательном расчете, если есть несколько видов дохода в месяце начисления
		НеобходимаКорректировкаМакисмальногоОграничения = ОкончательныйРасчет И СтрокаТаблицы.ЕстьНесколькоВидовДоходов;
		
		Если НеобходимаКорректировкаМакисмальногоОграничения Тогда
			
			ЗаполнитьЗначенияСвойств(СтруктураПоискаПоФизЛицам, СтрокаТаблицы);

			// сумма взносов исчисленная
			МассивВзносов = ТаблицаВзносовПоФизЛицамПоДругимДоходам.НайтиСтроки(СтруктураПоискаПоФизЛицам);
			
			Если МассивВзносов.Количество() > 0 Тогда
				ОбъектИсчисленияПоДругимВидамВДанномРасчете = МассивВзносов[0].ОбъектИсчисления;
			Иначе
				ОбъектИсчисленияПоДругимВидамВДанномРасчете = 0;
			КонецЕсли;
			
		Иначе
			
			ОбъектИсчисленияПоДругимВидамВДанномРасчете = 0;
			
		КонецЕсли;
		
		МаксимальныйРазмерОрганиченияДохода = СтрокаТаблицы.МаксимальныйРазмерОрганиченияДохода - ОбъектИсчисленияПоДругимВидамВДанномРасчете - ?(СтрокаТаблицы.Ставка = 0, 0, СтрокаТаблицы.ВОСМСПредыдущегоМестаРаботы / СтрокаТаблицы.Ставка);
		
		Если СтрокаТаблицы.ОблагаемыйДоход <= 0 Тогда
			
			СтрокаТаблицы.ОбъектИсчисленияВОСМС = 0;
			
		ИначеЕсли СтрокаТаблицы.ОблагаемыйДоход + СтрокаТаблицы.СуммаКорректировки < СтрокаТаблицы.МинимальныйРазмерОрганиченияДохода Тогда
			
			СтрокаТаблицы.ОбъектИсчисленияВОСМС = 0;
			
		ИначеЕсли СтрокаТаблицы.ОблагаемыйДоход + СтрокаТаблицы.СуммаКорректировки >= МаксимальныйРазмерОрганиченияДохода Тогда
			
			СтрокаТаблицы.ОбъектИсчисленияВОСМС = МаксимальныйРазмерОрганиченияДохода;
			
		Иначе
			
			СтрокаТаблицы.ОбъектИсчисленияВОСМС = СтрокаТаблицы.ОблагаемыйДоход + СтрокаТаблицы.СуммаКорректировки;
			
		КонецЕсли;
		
		СтрокаТаблицы.ИсчисленныеВОСМС = СтрокаТаблицы.ОбъектИсчисленияВОСМС * СтрокаТаблицы.Ставка;	
		
		Если НеобходимаКорректировкаМакисмальногоОграничения Тогда
			
			МассивВзносов = ТаблицаВзносовПоФизЛицамПоДругимДоходам.НайтиСтроки(СтруктураПоискаПоФизЛицам);
			Если МассивВзносов.Количество() > 0 Тогда
				СтрокаВзносовТаблицаВзносовПоФизЛицам = МассивВзносов[0];
				СтрокаВзносовТаблицаВзносовПоФизЛицам.ОбъектИсчисления = СтрокаВзносовТаблицаВзносовПоФизЛицам.ОбъектИсчисления + СтрокаТаблицы.ОбъектИсчисленияВОСМС;
			Иначе
				СтрокаВзносовТаблицаВзносовПоФизЛицам = ТаблицаВзносовПоФизЛицамПоДругимДоходам.Добавить();
				СтрокаВзносовТаблицаВзносовПоФизЛицам.МесяцНалоговогоПериода = СтрокаТаблицы.МесяцНалоговогоПериода;
				СтрокаВзносовТаблицаВзносовПоФизЛицам.ФизическоеЛицо = СтрокаТаблицы.ФизическоеЛицо;
				СтрокаВзносовТаблицаВзносовПоФизЛицам.ОбъектИсчисления = СтрокаТаблицы.ОбъектИсчисленияВОСМС;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаДляОбработки, РезультатЗапроса);
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияВОСМС,ИсчисленныеВОСМС", 0);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеВОСМСПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияВОСМСВЦеломЗаПериод,	ИсчисленныеВОСМСВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектВОСМСИсчисленныйРанее, 		 	РанееИсчисленныеВОСМС,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход,					ОбъектИсчисленияВОСМС, 					ИсчисленныеВОСМС");
	
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	
	Для каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
		
		// спишем возникшую погрешность округления при межрасчете или исправлении или перераспределении сумм по подразделениям
		Если СтрокаТЗ.ОблагаемыйДоход = 0 
			И (СтрокаТЗ.ИсчисленныеВОСМС < 1 И СтрокаТЗ.ИсчисленныеВОСМС > 0
				ИЛИ СтрокаТЗ.ИсчисленныеВОСМС > -1 И СтрокаТЗ.ИсчисленныеВОСМС < 0) Тогда
				
			СтрокаТЗ.ИсчисленныеВОСМС = 0;
			
		// исчисление взносов производятся в тенге с учетом округления тиын
		Иначе
			
			СтрокаТЗ.ИсчисленныеВОСМС = Окр(СтрокаТЗ.ИсчисленныеВОСМС, 0, РежимОкругления.Окр15как20);
			
		КонецЕсли;
		
	КонецЦикла; 

	// для вычетов ИПН передаем общую таблицу округленных сумм
	ТаблицаДляВычетовИПН = РезультатЗапроса.Скопировать();
	
	Для каждого СтрокаТЗ Из ТаблицаДляВычетовИПН Цикл
		СтрокаТЗ.ИсчисленныеВОСМС = Окр(СтрокаТЗ.ИсчисленныеВОСМС, 0, РежимОкругления.Окр15как20);
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("ИсчисленныеВОСМС", ТаблицаДляВычетовИПН);
	
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	ВТИсчисленныеВОСМС.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ВТИсчисленныеВОСМС.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТИсчисленныеВОСМС.ВидДохода КАК ВидДохода,
		|	ВТИсчисленныеВОСМС.ОбъектИсчисленияВОСМС КАК ОбъектИсчисленияВОСМС,
		|	ВТИсчисленныеВОСМС.ИсчисленныеВОСМС КАК ИсчисленныеВОСМС
		|ПОМЕСТИТЬ ВТИсчисленныеВОСМСПоПодразделениям
		|ИЗ
		|	&ИсчисленныеВОСМС КАК ВТИсчисленныеВОСМС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеВОСМСПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеВОСМСПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеВОСМСПоПодразделениям.ВидДохода,
		|	СУММА(ВТИсчисленныеВОСМСПоПодразделениям.ОбъектИсчисленияВОСМС) КАК ОбъектИсчисленияВОСМС,
		|	СУММА(ВТИсчисленныеВОСМСПоПодразделениям.ИсчисленныеВОСМС) КАК ИсчисленныеВОСМС
		|ПОМЕСТИТЬ ВТИсчисленныеВОСМС
		|ИЗ
		|	ВТИсчисленныеВОСМСПоПодразделениям КАК ВТИсчисленныеВОСМСПоПодразделениям
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТИсчисленныеВОСМСПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеВОСМСПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеВОСМСПоПодразделениям.ВидДохода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВТИсчисленныеВОСМСПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеВОСМСПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеВОСМСПоПодразделениям.ВидДохода
		|";
	
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТИсчисленныеВОСМСПоПодразделениям");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Функция РассчитатьВОСМСПосле2022(Организация, Регистратор, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчет = Истина, ИсключатьДоходыРегистратора = Истина) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	СоздатьВТИсключаемыеЛицаОСМС(МенеджерВременныхТаблиц, "ВТИсключаемыеФизическиеЛицаПриРасчетеВОСМС", МесяцНачисления);
	УничтожитьВТ.Добавить("ВТИсключаемыеФизическиеЛицаПриРасчетеВОСМС");
	
	ВидНалогаВзносаВОСМС =  Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС;
	
	// Таблица ВТДоходы: облагаемые и необлагаемые суммы доходов
	СоздатьВТДоходы(МенеджерВременныхТаблиц, ВидНалогаВзносаВОСМС, "ВТИсключаемыеФизическиеЛицаПриРасчетеВОСМС", Ложь);
	УничтожитьВТ.Добавить("ВТДоходы");
	УничтожитьВТ.Добавить("ВТДоходыПоПодразделениям");
	
	// Таблица ВТВТИсчисленныеНалогиВзносыПоПодразделениям: сведения о ранее исчисленных ВОСМС
	СоздатьВТИсчисленныеНалогиВзносыПоПодразделениям(МенеджерВременныхТаблиц, ВидНалогаВзносаВОСМС);
	УничтожитьВТ.Добавить("ВТИсчисленныеНалогиВзносыПоПодразделениям");
	
	// Статусы физических лиц как налогоплательщиков по периодам
	СоздатьВТСтатусыФизическихЛицКакНалогоплательщиков(МенеджерВременныхТаблиц);
	УничтожитьВТ.Добавить("ВТСтатусыФизическихЛицКакНалогоплательщиков");
	
	// - Исчисленные ВОСМС
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмерыМЗППоПериодам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	0 КАК МинимальныйРазмерОрганиченияДохода,
		|	РазмерыМЗППоПериодам.РазмерМЗП * 10 КАК МаксимальныйРазмерОрганиченияДохода,
		|	РазмерыМЗППоПериодам.РазмерМЗП * 1.4 КАК ОбъектИсчисленияДляИП
		|ПОМЕСТИТЬ ВТРазмерыОграниченийПоДоходам
		|ИЗ
		|	ВТРазмерыМЗППоПериодам КАК РазмерыМЗППоПериодам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Доходы.ВидДохода КАК ВидДохода,
		|	МАКСИМУМ(ВЫБОР КОГДА Доходы.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства) ТОГДА ЕСТЬNULL(РазмерыОграниченийПоДоходам.ОбъектИсчисленияДляИП, 0) ИНАЧЕ Доходы.ОблагаемыйДоход КОНЕЦ) КАК ОблагаемыйДоход,
		|	МАКСИМУМ(ЕСТЬNULL(РазмерыОграниченийПоДоходам.МинимальныйРазмерОрганиченияДохода, 0)) КАК МинимальныйРазмерОрганиченияДохода,
		|	МАКСИМУМ(ЕСТЬNULL(РазмерыОграниченийПоДоходам.МаксимальныйРазмерОрганиченияДохода, 0)) КАК МаксимальныйРазмерОрганиченияДохода,
		|	МАКСИМУМ(0) КАК СуммаКорректировки,
		|	ЕСТЬNULL(СтавкиОСМС.СтавкаВзносы, 0) КАК Ставка,
		|	МАКСИМУМ(ВЫБОР КОГДА ДругиеВидыДоходов.ВидДохода ЕСТЬ NULL ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ) КАК ЕстьНесколькоВидовДоходов,
		|	МАКСИМУМ(ВЫБОР КОГДА НЕ ДругиеВидыДоходов.ВидДохода ЕСТЬ NULL ИЛИ РанееИсчисленныеНалогиВзносы.ВОСМСПредыдущегоМестаРаботы ЕСТЬ NULL ТОГДА 0 ИНАЧЕ РанееИсчисленныеНалогиВзносы.ВОСМСПредыдущегоМестаРаботы КОНЕЦ) КАК ВОСМСПредыдущегоМестаРаботы,
		|	0 КАК ОбъектИсчисленияВОСМС,
		|	0 КАК ИсчисленныеВОСМС
		|ИЗ
		|	ВТДоходы КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиОСМС КАК СтавкиОСМС
		|		ПО Доходы.МесяцНалоговогоПериода = СтавкиОСМС.МесяцНалоговогоПериода
		|			И Доходы.ВидДохода = СтавкиОСМС.ВидДохода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходы КАК ДругиеВидыДоходов
		|		ПО ДругиеВидыДоходов.МесяцНалоговогоПериода = Доходы.МесяцНалоговогоПериода
		|			И ДругиеВидыДоходов.ФизическоеЛицо = Доходы.ФизическоеЛицо
		|			И НЕ ДругиеВидыДоходов.ВидДохода = Доходы.ВидДохода
		|			И НЕ ДругиеВидыДоходов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыОграниченийПоДоходам КАК РазмерыОграниченийПоДоходам
		|		ПО Доходы.МесяцНалоговогоПериода = РазмерыОграниченийПоДоходам.МесяцНалоговогоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРанееИсчисленныеНалогиВзносы КАК РанееИсчисленныеНалогиВзносы
		|		ПО Доходы.МесяцНалоговогоПериода = РанееИсчисленныеНалогиВзносы.МесяцНалоговогоПериода
		|			И РанееИсчисленныеНалогиВзносы.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС)
		|			И Доходы.ФизическоеЛицо = РанееИсчисленныеНалогиВзносы.ФизическоеЛицо
		|СГРУППИРОВАТЬ ПО
		|	Доходы.МесяцНалоговогоПериода,
		|	Доходы.ФизическоеЛицо,
		|	Доходы.ВидДохода,
		|	ЕСТЬNULL(СтавкиОСМС.СтавкаВзносы, 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Доходы.ВидДохода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыПоПодразделениям.Подразделение КАК Подразделение,
		|	ДоходыПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ДоходыПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДоходыПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ДоходыПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	ДоходыПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход
		|ИЗ
		|	ВТДоходыПоПодразделениям КАК ДоходыПоПодразделениям
		|ГДЕ
		|	(ДоходыПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ДоходыПоПодразделениям.НеоблагаемыйДоход <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеВОСМСПоПодразделениям.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ИсчисленныеВОСМСПоПодразделениям.Подразделение КАК Подразделение,
		|	ИсчисленныеВОСМСПоПодразделениям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсчисленныеВОСМСПоПодразделениям.ВидДохода КАК ВидДохода,
		|	ИсчисленныеВОСМСПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеВОСМСПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоходИсчисленныйРанее,
		|	ИсчисленныеВОСМСПоПодразделениям.ОбъектИсчисления КАК ОбъектВОСМСИсчисленныйРанее,
		|	ИсчисленныеВОСМСПоПодразделениям.НалогВзнос КАК РанееИсчисленныеВОСМС,
		|	-ИсчисленныеВОСМСПоПодразделениям.ОблагаемыйДоход КАК ОблагаемыйДоход,
		|	-ИсчисленныеВОСМСПоПодразделениям.НеоблагаемыйДоход КАК НеоблагаемыйДоход,
		|	-ИсчисленныеВОСМСПоПодразделениям.НалогВзнос КАК ИсчисленныеВОСМС,
		|	-ИсчисленныеВОСМСПоПодразделениям.ОбъектИсчисления КАК ОбъектИсчисленияВОСМС
		|ИЗ
		|	ВТИсчисленныеНалогиВзносыПоПодразделениям КАК ИсчисленныеВОСМСПоПодразделениям
		|ГДЕ
		|	(ИсчисленныеВОСМСПоПодразделениям.ОблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеВОСМСПоПодразделениям.НеоблагаемыйДоход <> 0
		|			ИЛИ ИсчисленныеВОСМСПоПодразделениям.ОбъектИсчисления <> 0
		|			ИЛИ ИсчисленныеВОСМСПоПодразделениям.НалогВзнос <> 0)
		|	И НЕ ИсчисленныеВОСМСПоПодразделениям.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства)";
	
	Результат = Запрос.ВыполнитьПакет();	
	УничтожитьВТ.Добавить("ВТРазмерыОграниченийПоДоходам");
	
	ВсегоРезультатов = Результат.Количество();
	ИсчисленныеВОСМСПоПодразделениям = Результат[ВсегоРезультатов - 1].Выгрузить();
	РаспределениеДоходовПоПодразделениям = Результат[ВсегоРезультатов - 2].Выгрузить();
	
	КвалификаторЧисла = Новый КвалификаторыЧисла(13,5);
	
	РезультатЗапроса = Новый ТаблицаЗначений;
	РезультатЗапроса.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	РезультатЗапроса.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	РезультатЗапроса.Колонки.Добавить("ВидДохода", Новый ОписаниеТипов("СправочникСсылка.ВидыДоходов"));
	РезультатЗапроса.Колонки.Добавить("ОбъектИсчисленияВОСМС", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатЗапроса.Колонки.Добавить("ИсчисленныеВОСМС", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ТаблицаДляОбработки = Результат[ВсегоРезультатов - 3].Выгрузить();
	
	РезультатыРасчетов = РезультатЗапроса.СкопироватьКолонки();
	РезультатыРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ИсчисленныеВОСМСВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектИсчисленияВОСМСВЦеломЗаПериод", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоходИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОбъектВОСМСИсчисленныйРанее", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ВОСМСПредыдущегоМестаРаботы", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("РанееИсчисленныеВОСМС", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("ОблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	РезультатыРасчетов.Колонки.Добавить("НеоблагаемыйДоход", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ТаблицаВзносовПоФизЛицамПоДругимДоходам = Новый ТаблицаЗначений;
	ТаблицаВзносовПоФизЛицамПоДругимДоходам.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаВзносовПоФизЛицамПоДругимДоходам.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаВзносовПоФизЛицамПоДругимДоходам.Колонки.Добавить("ОбъектИсчисления", Новый ОписаниеТипов("Число", КвалификаторЧисла));
	
	ТаблицаВзносовПоФизЛицамПоДругимДоходам.Индексы.Добавить("ФизическоеЛицо, МесяцНалоговогоПериода");
	
	СтруктураПоискаПоФизЛицам = Новый Структура("ФизическоеЛицо, МесяцНалоговогоПериода");
	
	Для Каждого СтрокаТаблицы Из ТаблицаДляОбработки Цикл
		
		ОбъектИсчисленияПоДругимВидамВДанномРасчете = 0;
		
		// корректируем максимальный доход только в окончательном расчете, если есть несколько видов дохода в месяце начисления
		НеобходимаКорректировкаМакисмальногоОграничения = ОкончательныйРасчет И СтрокаТаблицы.ЕстьНесколькоВидовДоходов;
		
		Если НеобходимаКорректировкаМакисмальногоОграничения Тогда
			
			ЗаполнитьЗначенияСвойств(СтруктураПоискаПоФизЛицам, СтрокаТаблицы);

			// сумма взносов исчисленная
			МассивВзносов = ТаблицаВзносовПоФизЛицамПоДругимДоходам.НайтиСтроки(СтруктураПоискаПоФизЛицам);
			
			Если МассивВзносов.Количество() > 0 Тогда
				ОбъектИсчисленияПоДругимВидамВДанномРасчете = МассивВзносов[0].ОбъектИсчисления;
			Иначе
				ОбъектИсчисленияПоДругимВидамВДанномРасчете = 0;
			КонецЕсли;
			
		Иначе
			
			ОбъектИсчисленияПоДругимВидамВДанномРасчете = 0;
			
		КонецЕсли;
		
		МаксимальныйРазмерОрганиченияДохода = СтрокаТаблицы.МаксимальныйРазмерОрганиченияДохода - ОбъектИсчисленияПоДругимВидамВДанномРасчете - ?(СтрокаТаблицы.Ставка = 0, 0, СтрокаТаблицы.ВОСМСПредыдущегоМестаРаботы / СтрокаТаблицы.Ставка);
		
		Если СтрокаТаблицы.ОблагаемыйДоход <= 0 Тогда
			
			СтрокаТаблицы.ОбъектИсчисленияВОСМС = 0;
			
		ИначеЕсли СтрокаТаблицы.ОблагаемыйДоход + СтрокаТаблицы.СуммаКорректировки < СтрокаТаблицы.МинимальныйРазмерОрганиченияДохода Тогда
			
			СтрокаТаблицы.ОбъектИсчисленияВОСМС = 0;
			
		ИначеЕсли СтрокаТаблицы.ОблагаемыйДоход + СтрокаТаблицы.СуммаКорректировки >= МаксимальныйРазмерОрганиченияДохода Тогда
			
			СтрокаТаблицы.ОбъектИсчисленияВОСМС = МаксимальныйРазмерОрганиченияДохода;
			
		Иначе
			
			СтрокаТаблицы.ОбъектИсчисленияВОСМС = СтрокаТаблицы.ОблагаемыйДоход + СтрокаТаблицы.СуммаКорректировки;
			
		КонецЕсли;
		
		СтрокаТаблицы.ИсчисленныеВОСМС = СтрокаТаблицы.ОбъектИсчисленияВОСМС * СтрокаТаблицы.Ставка;	
		
		Если НеобходимаКорректировкаМакисмальногоОграничения Тогда
			
			МассивВзносов = ТаблицаВзносовПоФизЛицамПоДругимДоходам.НайтиСтроки(СтруктураПоискаПоФизЛицам);
			Если МассивВзносов.Количество() > 0 Тогда
				СтрокаВзносовТаблицаВзносовПоФизЛицам = МассивВзносов[0];
				СтрокаВзносовТаблицаВзносовПоФизЛицам.ОбъектИсчисления = СтрокаВзносовТаблицаВзносовПоФизЛицам.ОбъектИсчисления + СтрокаТаблицы.ОбъектИсчисленияВОСМС;
			Иначе
				СтрокаВзносовТаблицаВзносовПоФизЛицам = ТаблицаВзносовПоФизЛицамПоДругимДоходам.Добавить();
				СтрокаВзносовТаблицаВзносовПоФизЛицам.МесяцНалоговогоПериода = СтрокаТаблицы.МесяцНалоговогоПериода;
				СтрокаВзносовТаблицаВзносовПоФизЛицам.ФизическоеЛицо = СтрокаТаблицы.ФизическоеЛицо;
				СтрокаВзносовТаблицаВзносовПоФизЛицам.ОбъектИсчисления = СтрокаТаблицы.ОбъектИсчисленияВОСМС;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаДляОбработки, РезультатЗапроса);
	
	ДанныеОкругления = ПолучитьСпособОкругленияСПериодом(МенеджерВременныхТаблиц, ВидНалогаВзносаВОСМС);
	СпособОкругления = ДанныеОкругления.СпособОкругления;
	ПериодОкругления = ДанныеОкругления.Период;
	
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);
	
	Если ПериодОкругления >= '20220101' Тогда
		// для корректного округления после распределения при достижении суммы максимального предела необходима точность 0
		ТочностьОкругления = ОписаниеСпособаОкругления.Точность - Цел(ОписаниеСпособаОкругления.Точность);
		ПравилоОкругления = ОписаниеСпособаОкругления.ПравилоОкругления;		
	Иначе
		ТочностьОкругления = 1;
		ПравилоОкругления = Перечисления.ПравилаОкругленияПриРасчетеЗарплаты.Авто;		
	КонецЕсли;
	
	Если ТочностьОкругления = 0 Тогда
		ТочностьРаспределения = 0;
	ИначеЕсли ТочностьОкругления <= 0.1 Тогда
		ТочностьРаспределения = 2;
	Иначе
		ТочностьРаспределения = 1;
	КонецЕсли;
	
	ПоляПоиска = "ФизическоеЛицо, МесяцНалоговогоПериода, ВидДохода";
	СтруктураПоиска = Новый Структура(ПоляПоиска);
	РаспределениеДоходовПоПодразделениям.Индексы.Добавить(ПоляПоиска);

	Для Каждого СтрокаРасчета Из РезультатЗапроса Цикл
		СтруктураПоиска.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		СтруктураПоиска.МесяцНалоговогоПериода = СтрокаРасчета.МесяцНалоговогоПериода;
		СтруктураПоиска.ВидДохода = СтрокаРасчета.ВидДохода;
		ДоходыМесяца = РаспределениеДоходовПоПодразделениям.НайтиСтроки(СтруктураПоиска);
		РаспределитьНалогиВзносыПоПодразделениям(РезультатыРасчетов, СтрокаРасчета, ДоходыМесяца, "ОбъектИсчисленияВОСМС,ИсчисленныеВОСМС", ТочностьРаспределения);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсчисленныеВОСМСПоПодразделениям, РезультатыРасчетов);

	РезультатыРасчетов.Свернуть("ФизическоеЛицо, Подразделение, МесяцНалоговогоПериода, ВидДохода",
								"ОблагаемыйДоходВЦеломЗаПериод, 	НеоблагаемыйДоходВЦеломЗаПериод, 	ОбъектИсчисленияВОСМСВЦеломЗаПериод,	ИсчисленныеВОСМСВЦеломЗаПериод,
								|ОблагаемыйДоходИсчисленныйРанее, 	НеоблагаемыйДоходИсчисленныйРанее, 	ОбъектВОСМСИсчисленныйРанее, 		 	РанееИсчисленныеВОСМС,
								|ОблагаемыйДоход, 					НеоблагаемыйДоход,					ОбъектИсчисленияВОСМС, 					ИсчисленныеВОСМС");
	
	РезультатыРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(13,0)));
	НомерСтроки = 0;
	
	Для каждого СтрокаТЗ Из РезультатыРасчетов Цикл
		
		НомерСтроки = НомерСтроки + 1;
	    СтрокаТЗ.НомерСтроки = НомерСтроки;
		
		// спишем возникшую погрешность округления при межрасчете или исправлении или перераспределении сумм по подразделениям
		Если СтрокаТЗ.ОблагаемыйДоход = 0 
			И (СтрокаТЗ.ИсчисленныеВОСМС < 1 И СтрокаТЗ.ИсчисленныеВОСМС > 0
				ИЛИ СтрокаТЗ.ИсчисленныеВОСМС > -1 И СтрокаТЗ.ИсчисленныеВОСМС < 0) Тогда
				
			СтрокаТЗ.ИсчисленныеВОСМС = 0;
			
		// исчисление взносов производятся в тенге с учетом округления тиын
		Иначе
			
			СтрокаТЗ.ИсчисленныеВОСМС = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныеВОСМС, ТочностьОкругления, ПравилоОкругления);
			
		КонецЕсли;
		
	КонецЦикла; 

	// для вычетов ИПН передаем общую таблицу округленных сумм
	ТаблицаДляВычетовИПН = РезультатЗапроса.Скопировать();
	
	Для каждого СтрокаТЗ Из ТаблицаДляВычетовИПН Цикл
		СтрокаТЗ.ИсчисленныеВОСМС = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаТЗ.ИсчисленныеВОСМС, ТочностьОкругления, ПравилоОкругления);
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("ИсчисленныеВОСМС", ТаблицаДляВычетовИПН);
	
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	ВТИсчисленныеВОСМС.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ВТИсчисленныеВОСМС.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТИсчисленныеВОСМС.ВидДохода КАК ВидДохода,
		|	ВТИсчисленныеВОСМС.ОбъектИсчисленияВОСМС КАК ОбъектИсчисленияВОСМС,
		|	ВТИсчисленныеВОСМС.ИсчисленныеВОСМС КАК ИсчисленныеВОСМС
		|ПОМЕСТИТЬ ВТИсчисленныеВОСМСПоПодразделениям
		|ИЗ
		|	&ИсчисленныеВОСМС КАК ВТИсчисленныеВОСМС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИсчисленныеВОСМСПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеВОСМСПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеВОСМСПоПодразделениям.ВидДохода,
		|	СУММА(ВТИсчисленныеВОСМСПоПодразделениям.ОбъектИсчисленияВОСМС) КАК ОбъектИсчисленияВОСМС,
		|	СУММА(ВТИсчисленныеВОСМСПоПодразделениям.ИсчисленныеВОСМС) КАК ИсчисленныеВОСМС
		|ПОМЕСТИТЬ ВТИсчисленныеВОСМС
		|ИЗ
		|	ВТИсчисленныеВОСМСПоПодразделениям КАК ВТИсчисленныеВОСМСПоПодразделениям
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТИсчисленныеВОСМСПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеВОСМСПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеВОСМСПоПодразделениям.ВидДохода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВТИсчисленныеВОСМСПоПодразделениям.ФизическоеЛицо,
		|	ВТИсчисленныеВОСМСПоПодразделениям.МесяцНалоговогоПериода,
		|	ВТИсчисленныеВОСМСПоПодразделениям.ВидДохода
		|";
	
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТИсчисленныеВОСМСПоПодразделениям");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
	Возврат РезультатыРасчетов;
	
КонецФункции

Процедура СоздатьВТРазмерыМРППоПериодам(МенеджерВременныхТаблиц) Экспорт
	
	УничтожитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(МесячныйРасчетныйПоказатель.Период) КАК ПериодМРП,
		|	МАКСИМУМ(МесячныйРасчетныйПоказательНаНачалоГода.Период) КАК ПериодМРПНаНачалоГода,
		|	ПериодыРасчета.Период КАК МесяцНалоговогоПериода
		|ПОМЕСТИТЬ ВТПериодыМРП
		|ИЗ
		|	ВТДатыПоМесяцам КАК ПериодыРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МесячныйРасчетныйПоказатель КАК МесячныйРасчетныйПоказатель
		|		ПО ПериодыРасчета.Период >= МесячныйРасчетныйПоказатель.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МесячныйРасчетныйПоказатель КАК МесячныйРасчетныйПоказательНаНачалоГода
		|		ПО НАЧАЛОПЕРИОДА(ПериодыРасчета.Период, ГОД) >= МесячныйРасчетныйПоказательНаНачалоГода.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ПериодыРасчета.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПериодыМРП.МесяцНалоговогоПериода,
		|	ЕСТЬNULL(МесячныйРасчетныйПоказатель.Размер, 0) КАК РазмерМРП,
		|	ЕСТЬNULL(МесячныйРасчетныйПоказательНаНачалоГода.Размер, 0) КАК РазмерМРПНаНачалоГода
		|ПОМЕСТИТЬ ВТРазмерыМРППоПериодам
		|ИЗ
		|	ВТПериодыМРП КАК ВТПериодыМРП
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МесячныйРасчетныйПоказатель КАК МесячныйРасчетныйПоказатель
		|		ПО ВТПериодыМРП.ПериодМРП = МесячныйРасчетныйПоказатель.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МесячныйРасчетныйПоказатель КАК МесячныйРасчетныйПоказательНаНачалоГода
		|		ПО ВТПериодыМРП.ПериодМРПНаНачалоГода = МесячныйРасчетныйПоказательНаНачалоГода.Период
		|";
		
	Запрос.Выполнить();
	УничтожитьВТ.Добавить("ВТПериодыМРП");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
КонецПроцедуры

#КонецОбласти