#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьСведенияОСтавкахИПН();
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОСтавкахИПН() Экспорт
	
	НаборЗаписей = РегистрыСведений.СведенияОСтавкахИПН.СоздатьНаборЗаписей();

	ДобавитьСведенияОСтавкахИПН(НаборЗаписей, '20150101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ДоходыОтРаботодателя, 	10.0, 10.0);
	ДобавитьСведенияОСтавкахИПН(НаборЗаписей, '20150101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.Вознаграждения,			10.0, 15.0);
	ДобавитьСведенияОСтавкахИПН(НаборЗаписей, '20150101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.Дивиденды,				5.0,  15.0);
	ДобавитьСведенияОСтавкахИПН(НаборЗаписей, '20150101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.Выигрыши,				 	10.0, 20.0);
	ДобавитьСведенияОСтавкахИПН(НаборЗаписей, '20150101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, 10.0, 20.0);
	ДобавитьСведенияОСтавкахИПН(НаборЗаписей, '20150101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ПрочиеДоходы,			 	10.0, 20.0);
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ДобавитьСведенияОСтавкахИПН(НаборЗаписей, Период, Организация, ВидДохода, Ставка, СтавкаНерезиденты)
	
   	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;  
	НоваяЗапись.Организация = Организация;  
	НоваяЗапись.ВидДохода = ВидДохода;
	НоваяЗапись.Ставка = Ставка;
	НоваяЗапись.СтавкаНерезиденты = СтавкаНерезиденты;
	
КонецПроцедуры	

Процедура ДобавитьСведенияОСтавкахИПНСПроверкой(Период, Организация, ВидДохода, Ставка, СтавкаНерезиденты) 
	
	НаборЗаписей = РегистрыСведений.СведенияОСтавкахИПН.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ВидДохода.Установить(ВидДохода, Истина);
	НаборЗаписей.Отбор.Организация.Установить(Организация, Истина);
	НаборЗаписей.Отбор.Период.Установить(Период, Истина);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Движение = НаборЗаписей.Добавить();
		// Свойства
		Движение.Период = Период;
		//Измерения
		Движение.Организация = Организация;
		Движение.ВидДохода = ВидДохода;
		// Ресурсы
		Движение.Ставка = Ставка;
		Движение.СтавкаНерезиденты = СтавкаНерезиденты;
		
		Попытка
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли