#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		
		Если СтрокаНабора.ВидДохода = Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства Тогда
				
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Для вида дохода ""Доход субъекта предпринимательства"" расчет ИПН происходит без указания ставки.'"), СтрокаНабора.ВидДохода);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
				
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецЕсли
