#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает пространство имен для документа ВетИС.
//
//Функция ПараметрыЗапросаВЕТИС(Операция, ФорматОбмена) Экспорт
//	
//	РезультатПоиска = ИнтеграцияВЕТИСПовтИсп.ПараметрыЗапросаВЕТИС(Операция, ФорматОбмена);
//	
//	Если РезультатПоиска = Неопределено Тогда
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	ВозвращаемоеЗначение = Новый Структура;
//	ВозвращаемоеЗначение.Вставить("ТипВЕТИС",         РезультатПоиска.ТипВЕТИС);
//	ВозвращаемоеЗначение.Вставить("ПространствоИмен", РезультатПоиска.ПространствоИмен);
//	ВозвращаемоеЗначение.Вставить("Операция",         РезультатПоиска.Операция);
//	ВозвращаемоеЗначение.Вставить("ФорматОбмена",     РезультатПоиска.ФорматОбмена);
//	ВозвращаемоеЗначение.Вставить("ТипСообщения",     РезультатПоиска.ТипСообщения);
//	ВозвращаемоеЗначение.Вставить("ОтветНаЗапрос");
//	
//	Если РезультатПоиска.ОтветНаЗапрос <> Неопределено Тогда
//		
//		ОтветНаЗапрос = Новый Структура;
//		ОтветНаЗапрос.Вставить("ТипВЕТИС",         РезультатПоиска.ОтветНаЗапрос.ТипВЕТИС);
//		ОтветНаЗапрос.Вставить("ПространствоИмен", РезультатПоиска.ОтветНаЗапрос.ПространствоИмен);
//		ОтветНаЗапрос.Вставить("Операция",         РезультатПоиска.ОтветНаЗапрос.Операция);
//		ОтветНаЗапрос.Вставить("ФорматОбмена",     РезультатПоиска.ОтветНаЗапрос.ФорматОбмена);
//		ОтветНаЗапрос.Вставить("ТипСообщения",     РезультатПоиска.ОтветНаЗапрос.ТипСообщения);
//		
//		ВозвращаемоеЗначение.ОтветНаЗапрос = ОтветНаЗапрос;
//		
//	КонецЕсли;
//	
//	Возврат ВозвращаемоеЗначение;
//	
//КонецФункции

Функция ОтветыНаЗапросы() Экспорт
	
	Результат = Новый Массив;
	
	Для Каждого ЗначениеПеречисления Из Метаданные.Перечисления.ВидыОперацийИСМП.ЗначенияПеречисления Цикл 
		Если СтрНачинаетсяС(ЗначениеПеречисления.Имя, "ОтветНаЗапрос") Тогда 
			Результат.Добавить(Перечисления.ВидыОперацийИСМП[ЗначениеПеречисления.Имя]);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолученныеРезультатыЗапросов() Экспорт
	
	Результат = Новый Массив;
	Для Каждого ЗначениеПеречисления Из Метаданные.Перечисления.ВидыОперацийИСМП.ЗначенияПеречисления Цикл 
		Если СтрНачинаетсяС(ЗначениеПеречисления.Имя, "Получение") Тогда 
			Результат.Добавить(Перечисления.ВидыОперацийИСМП[ЗначениеПеречисления.Имя]);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли