
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ФП_ДвиженияФондов Приход
	Движения.ФП_ДвиженияФондов.Записывать = Истина;
	Для Каждого ТекСтрокаРаспределение Из Распределение Цикл
		Движение = Движения.ФП_ДвиженияФондов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Фонд = ТекСтрокаРаспределение.Фонд;
		Движение.Сумма = ТекСтрокаРаспределение.Приход;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
