////////////////////////////////////////////////////////////////////////////////
// Процедуры подсистемы "Производство"
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область Трудозатраты

// Открывает форму выбора исполнителя трудозатрат в производстве. В зависимости от параметров переданного
// подразделения в форме могут быть выбраны бригады и/или физические лица.
//
// Параметры:
//  Организация			 - СправочникСсылка.Организации - значение для отбора исполнителей.
//  Подразделение		 - СправочникСсылка.СтруктураПредприятия - определяет состав исполнителей, доступных для выбора.
//  Исполнитель			 - СправочникСсылка.Бригады, СправочникСсылка.ФизическиеЛица - используется для позиционирования строки
//							на выбранном ранее значении.
//  ОписаниеОповещения	 - ОписаниеОповещения - содержит описание процедуры, которая будет вызвана при закрытии формы.
//
Процедура ОткрытьФормуВыбораИсполнителя(Организация, Подразделение, Исполнитель, ОписаниеОповещения) Экспорт
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("Подразделение", Подразделение);
	ПараметрыФормы.Вставить("Исполнитель", Исполнитель);
	
	ОткрытьФорму("ОбщаяФорма.ВыборИсполнителя", ПараметрыФормы,,,,,ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область РасчетДолейСтоимости

// Функция проверяет необходимость обновления процента распределения затрат на выходные изделия.
//
// Параметры:
//  ТаблицаФормы				 - ТаблицаФормы	 - таблица формы, отображающая ТЧ;
//  ПараметрыРаспределенияЗатрат - Структура	 - структура параметров расчета, см. ПроизводствоКлиентСервер.ПараметрыРаспределенияЗатратНаВыходныеИзделия()
//  КэшированныеЗначения		 - Структура	 - структура кеша реквизитов текущей строки.
//  ДобавлениеУдаление			 - Булево		 - признак, что проверка вызывается при добавлении/удалении строки ТЧ.
// 
// Возвращаемое значение:
//  Булево - истина, если нужно ли обновить служебные реквизиты.
//
Функция НеобходимоРассчитатьПроцентРаспределенияЗатратНаВыходныеИзделия(ТабличнаяЧасть, ПараметрыРаспределенияЗатрат, КэшированныеЗначения = Неопределено, ДобавлениеУдаление = Ложь) Экспорт
	
	ДанныеСтроки = ТабличнаяЧасть.ТекущиеДанные;
	
	Если ДобавлениеУдаление Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ПустаяСтрока(ПараметрыРаспределенияЗатрат.ИмяПоляСпособРаспределенияЗатратНаВыходныеИзделия) Тогда
		СпособРаспределенияЗатратНаВыходныеИзделия = ПараметрыРаспределенияЗатрат.СпособРаспределенияЗатратНаВыходныеИзделия;
	Иначе
		СпособРаспределенияЗатратНаВыходныеИзделия = ДанныеСтроки[ПараметрыРаспределенияЗатрат.ИмяПоляСпособРаспределенияЗатратНаВыходныеИзделия];
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СпособРаспределенияЗатратНаВыходныеИзделия) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПроверяемыеПоля = Новый Массив;
	ПроверяемыеПоля.Добавить("ДоляСтоимости");
	ПроверяемыеПоля.Добавить(ПараметрыРаспределенияЗатрат.ПоляСвязи);
	
	Если ЗначениеЗаполнено(ПараметрыРаспределенияЗатрат.ПолеГруппировкиЗатрат) Тогда
		ПроверяемыеПоля.Добавить(ПараметрыРаспределенияЗатрат.ПолеГруппировкиЗатрат);
	КонецЕсли;
	
	Если СпособРаспределенияЗатратНаВыходныеИзделия = ПредопределенноеЗначение("Перечисление.СпособыРаспределенияЗатратНаВыходныеИзделия.ПоДолямСтоимости")
		И ДанныеСтроки <> Неопределено
		И ДанныеСтроки.ДоляСтоимости = 0 Тогда
		ПроверяемыеПоля.Добавить("Количество");
	КонецЕсли;
	
	Если ПараметрыРаспределенияЗатрат.ЕстьПолеОтменено Тогда
		ПроверяемыеПоля.Добавить("Отменено");
	КонецЕсли;
	
	Если ДанныеСтроки <> Неопределено
		И КэшированныеЗначения <> Неопределено
		И ОбщегоНазначенияУТКлиентСервер.СтруктурыРавны(
			КэшированныеЗначения,
			ДанныеСтроки,
			СтрСоединить(ПроверяемыеПоля,",")) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Предназначена для проверки заполнения полей перед выполнением команды по вводу доли стоимости.
//
// Параметры:
//  ДанныеСтроки				 - ДанныеФормыСтруктура	 - данные строки, в которой осуществляется ввод доли стоимости.
//  ПараметрыРаспределенияЗатрат - Структура			 - структура параметров расчета, см. ПроизводствоКлиентСервер.ПараметрыРаспределенияЗатратНаВыходныеИзделия()
//  ИмяОбъекта					 - Строка				 - имя основного реквизита формы, связанного с редактируемым объектом.
// 
// Возвращаемое значение:
//  Булево - истина, если проверка заполнения выполнена успешно, ложь - в противном случае.
//
Функция ПроверитьЗаполнениеПередВводомДолиСтоимости(ДанныеСтроки, ПараметрыРаспределенияЗатрат, ИмяОбъекта = "Объект") Экспорт
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Ошибки = Новый Массив();
	
	Если Не ЗначениеЗаполнено(ДанныеСтроки.Номенклатура) Тогда
		Текст = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru = 'Номенклатура'"));
		Ошибка = Новый Структура("Поле, Текст", "Номенклатура", Текст);
		Ошибки.Добавить(Ошибка);
	КонецЕсли;
	
	Если ДанныеСтроки.КоличествоУпаковок = 0 ИЛИ ДанныеСтроки.Количество = 0 Тогда
		Текст = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru = 'Количество'"));
		Ошибка = Новый Структура("Поле, Текст", "КоличествоУпаковок", Текст);
		Ошибки.Добавить(Ошибка);
	КонецЕсли;
	
	Если Не ДоступнаРасшифровкаРасчетаДолиСтоимости(ДанныеСтроки, ПараметрыРаспределенияЗатрат) Тогда
		Текст = НСтр("ru = 'Недостаточно прав доступа для открытия формы расшифровки расчета доли стоимости.'");
		Ошибка = Новый Структура("Поле, Текст", "ДоляСтоимости", Текст);
		Ошибки.Добавить(Ошибка);
	КонецЕсли;
	
	ОшибкиПользователю = Неопределено;

	Для каждого Ошибка Из Ошибки Цикл
		Поле = СтрШаблон(ИмяОбъекта + ".%1[%2].%3", ПараметрыРаспределенияЗатрат.ИмяТЧ, Формат(ДанныеСтроки.НомерСтроки - 1, "ЧН=0; ЧГ=0"), Ошибка.Поле);
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(ОшибкиПользователю, Поле, Ошибка.Текст, "");
	КонецЦикла;

	ОчиститьСообщения();
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(ОшибкиПользователю);

	Возврат Ошибки.Количество() = 0;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РасчетДолейСтоимости

Функция ДоступнаРасшифровкаРасчетаДолиСтоимости(ДанныеСтроки, ПараметрыРаспределенияЗатрат) Экспорт
	
	Если ПустаяСтрока(ПараметрыРаспределенияЗатрат.ИмяПоляСпособРаспределенияЗатратНаВыходныеИзделия) Тогда
		СпособРаспределенияЗатратНаВыходныеИзделия = ПараметрыРаспределенияЗатрат.СпособРаспределенияЗатратНаВыходныеИзделия;
	Иначе
		СпособРаспределенияЗатратНаВыходныеИзделия = ДанныеСтроки[ПараметрыРаспределенияЗатрат.ИмяПоляСпособРаспределенияЗатратНаВыходныеИзделия];
	КонецЕсли;
	
	Если СпособРаспределенияЗатратНаВыходныеИзделия = ПредопределенноеЗначение("Перечисление.СпособыРаспределенияЗатратНаВыходныеИзделия.ПоПлановойСтоимости") Тогда
		ЕстьДоступ = ПроизводствоВызовСервера.ДоступнаРасшифровкаРасчетаДолиСтоимости(СпособРаспределенияЗатратНаВыходныеИзделия);
	Иначе
		ЕстьДоступ = Истина;
	КонецЕсли;
	
	Возврат ЕстьДоступ;
	
КонецФункции

#КонецОбласти

#Область ДвижениеПродукцииИМатериалов

// Обработчик команды ввода на основании "ПроизводствоСервер.ДобавитьКомандуСоздатьВыпускПродукцииНаОсновании".
//
Функция СоздатьПередачуПродукцииИзКладовойНаОсновании(МассивСсылок, ПараметрыВыполнения) Экспорт

	Массив = Новый Массив;
	Если НЕ ПараметрыВыполнения.ОписаниеКоманды.МножественныйВыбор Тогда
		Массив.Добавить(МассивСсылок);
	Иначе
		Массив = МассивСсылок;
	КонецЕсли;
	
	ПараметрыВыполнения.ОписаниеКоманды.Вставить("ОбъектыОснований", Массив);
	СоздатьДвижениеПродукцииИМатериаловНаОсновании(
		ПараметрыВыполнения.ОписаниеКоманды, 
		ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзКладовой"));
	
КонецФункции

// Обработчик команды ввода на основании "ПроизводствоСервер.ДобавитьКомандуСоздатьПередачуМатериаловНаОсновании".
//
Функция СоздатьПередачуМатериаловВКладовуюНаОсновании(МассивСсылок, ПараметрыВыполнения) Экспорт
	
	Массив = Новый Массив;
	Если НЕ ПараметрыВыполнения.ОписаниеКоманды.МножественныйВыбор Тогда
		Массив.Добавить(МассивСсылок);
	Иначе
		Массив = МассивСсылок;
	КонецЕсли;
	
	ПараметрыВыполнения.ОписаниеКоманды.Вставить("ОбъектыОснований", Массив);
	СоздатьДвижениеПродукцииИМатериаловНаОсновании(
		ПараметрыВыполнения.ОписаниеКоманды, 
		ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаМатериаловВКладовую"));
	
КонецФункции

Процедура СоздатьДвижениеПродукцииИМатериаловНаОсновании(ОписаниеКоманды, ХозяйственнаяОперация)
	
	ПараметрыОткрытия = ПроизводствоВызовСервера.ПараметрыСозданияДвиженияПродукцииИМатериаловНаОсновании(
		ОписаниеКоманды.ОбъектыОснований, ХозяйственнаяОперация);
	
	Если ПараметрыОткрытия.РезультатыПроверки.ЕстьОшибки Тогда
		
		НакладныеКлиент.СообщитьОбОшибкахЗаполненияВнутреннейНакладной(ПараметрыОткрытия.РезультатыПроверки.ТекстОшибки);
		
	Иначе
		
		ПараметрыВыполненияКоманды = Новый Структура("Источник,Уникальность,Окно,НавигационнаяСсылка");
		ЗаполнитьЗначенияСвойств(ПараметрыВыполненияКоманды, ОписаниеКоманды.ДополнительныеПараметры);
		
		ОткрытьФорму(
			"Документ.ДвижениеПродукцииИМатериалов.ФормаОбъекта",
			ПараметрыОткрытия,
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Уникальность,
			ПараметрыВыполненияКоманды.Окно,
			ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик команды ввода на основании "ПроизводствоСервер.ДобавитьКомандуСоздатьВыпускПродукцииБезЗаказаНаОсновании".
//
Функция СоздатьВыпускПродукцииБезЗаказаНаОсновании(МассивСсылок, ПараметрыВыполнения) Экспорт

	// СтандартныеПодсистемы.ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(,
		"ОбщийМодуль.ПроизводствоКлиент.СоздатьВыпускПродукцииБезЗаказаНаОсновании");
	// Конец СтандартныеПодсистемы.ЗамерПроизводительности
	
	Массив = Новый Массив;
	Если НЕ ПараметрыВыполнения.ОписаниеКоманды.МножественныйВыбор Тогда
		Массив.Добавить(МассивСсылок);
	Иначе
		Массив = МассивСсылок;
	КонецЕсли;
	
	ПараметрыВыполнения.ОписаниеКоманды.Вставить("ОбъектыОснований", Массив);
	ПараметрыДокументов = Новый Структура;
	ПараметрыДокументов.Вставить("ОбъектыОснований", Массив);
	
	ФормаДокумента = ПолучитьФорму("Документ.ДвижениеПродукцииИМатериалов.ФормаОбъекта",,, ПараметрыВыполнения.Форма,);
	ПараметрыДокументов.Вставить("ОбъектФормы", ФормаДокумента.Объект);
	
	ИдентификаторФормы = Строка(ПараметрыВыполнения.Форма.УникальныйИдентификатор);
	ПараметрыДокументов.Вставить("ИдентификаторФормы", ИдентификаторФормы);
	
	Результат = ПроизводствоВызовСервера.ДокументыДвиженияПродукцииИМатериаловПоПараметрам(ПараметрыДокументов);
	
	Если Результат.Свойство("ОткрытьФормуНового") Тогда
		
		КопироватьДанныеФормы(ПараметрыДокументов.ОбъектФормы, ФормаДокумента.Объект);
		ФормаДокумента.ОбновитьПриОткрытии = Истина;
		ФормаДокумента.Модифицированность = Истина;
		ФормаДокумента.Открыть();
		
	ИначеЕсли Результат.КоличествоСозданныхДокументов > 1 Тогда
		
		НакладныеКлиент.ОткрытьФормуСозданныхДокументов(Результат, ПараметрыВыполнения.Форма);
		
	Иначе
		
		ПоказатьПредупреждение(,НСтр("ru = 'Не сформировано ни одного документа. Отсутствует продукция, требующая передачи на склад.'"));
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

// Обработчик команды ввода на основании "Документ.АктВыполненныхВнутреннихРабот.СозданиеАктаВыполненныхВнутреннихРабот".
Функция СоздатьАктВыполненныхВнутреннихРаботНаОсновании(МассивСсылок, ПараметрыВыполнения) Экспорт
	
	// СтандартныеПодсистемы.ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(,
		"ОбщийМодуль.ПроизводствоКлиент.СоздатьАктВыполненныхВнутреннихРаботНаОсновании");
	// Конец СтандартныеПодсистемы.ЗамерПроизводительности
	
	РезультатПроверки = ПроизводствоВызовСервера.СоздатьАктВыполненныхВнутреннихРаботПроверкаОснований(МассивСсылок);
	Если РезультатПроверки.Свойство("ЕстьОшибки") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатПроверки.ТекстОшибки);
	Иначе
		ПараметрыОснование = Новый Структура;
		ПараметрыОснование.Вставить("ОбъектыОснований",	МассивСсылок);
		ПараметрыОснование.Вставить("РеквизитыШапки",	РезультатПроверки.РеквизитыШапки);
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Основание", ПараметрыОснование);
		
		ПараметрыВыполненияКоманды = Новый Структура("Источник,Уникальность,Окно,НавигационнаяСсылка");
		ЗаполнитьЗначенияСвойств(ПараметрыВыполненияКоманды, ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры);
		
		ИмяФормы = "Документ.АктВыполненныхВнутреннихРабот.ФормаОбъекта";
		ОткрытьФорму(
				ИмяФормы,
				ПараметрыОткрытия,
				ПараметрыВыполненияКоманды.Источник,
				ПараметрыВыполненияКоманды.Уникальность,
				ПараметрыВыполненияКоманды.Окно,
				ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;
	
КонецФункции

#КонецОбласти
