
&После("ПередДобавлениемКомандЗаполнения")
Процедура игр_ПередДобавлениемКомандЗаполнения(КомандыЗаполнения, Параметры, СтандартнаяОбработка)
	
	Если Параметры.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда
		игр_ДобавитьКомандыЗаказКлиента(КомандыЗаполнения, Параметры, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры 

Процедура игр_ДобавитьКомандыЗаказКлиента(КомандыЗаполнения, Параметры, СтандартнаяОбработка)
	
	Команда	= КомандыЗаполнения.Добавить();
	
	Команда.Идентификатор	= "игр_ВыдатьЗаказКаспи";
	Команда.Представление	= "Выдать заказ в Каспи";
	
	Команда.ТипПараметра	= Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента");
	Команда.ИзменяетВыбранныеОбъекты	= Ложь;  
	
	Команда.МножественныйВыбор	= Ложь;
	
	Команда.ИмяФормы	= "ОбщаяФорма.игр_ВыдатьЗаказКаспи";
		
КонецПроцедуры

