
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("ДляЗаданийКЗакрытиюМесяца") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	// В форме списка регистра заданий к закрытию месяца для выбора доступны только те значения перечисления,
	// которые поддерживаются в механизме закрытия месяца.
	// см. использование функции ЗакрытиеМесяцаСервер.ПроверитьНаличиеЗаданийКЗакрытиюМесяца().
	ДанныеВыбора = Новый СписокЗначений;
	
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.ПереоценкаДенежныхСредствКредитовДепозитовЗаймов);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.РаспределениеНДС);
	//++ НЕ УТ
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.ПризнаниеВНалоговомУчетеЛизинговыхПлатежей);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.ПогашениеСтоимостиТМЦВЭксплуатации);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.РасчетНалогаНаИмущество);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.РасчетТранспортногоНалога);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.РасчетЗемельногоНалога);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.СторноДоходовКУДиР);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.ПризнаниеРасходовПриУСН);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.РасчетНалогаУСН);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.ФормированиеРезервовПоСомнительнымДолгам);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.ФормированиеФинансовогоРезультата);
	//-- НЕ УТ
	
КонецПроцедуры

#КонецОбласти
