
&НаСервере
&После("ПриСозданииНаСервере")
Процедура игр_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Дата.ТолькоПросмотр		= Ложь;
	Элементы.КассаККМ.ПараметрыВыбора	= Новый ФиксированныйМассив(Новый Массив);
	Элементы.КассаККМ.ТолькоПросмотр 	= Ложь;
	Элементы.ПодарочныеСертификаты.ТолькоПросмотр = Ложь;
	Элементы.ОплатаПлатежнымиКартами.ТолькоПросмотр = Ложь;
	Элементы.Статус.ТолькоПросмотр		= Ложь;
	
	НовыйЭлемент		= Элементы.Вставить("Организация", Тип("ПолеФормы"), ЭтотОбъект, Элементы.КассаККМ);
	НовыйЭлемент.Вид	= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным	= "Объект.Организация";
	
КонецПроцедуры
