#Область ОписаниеПеременных

&НаКлиенте
Перем СтарыеЗначенияКонтролируемыхПолей;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	 	
	Организация = Параметры.Организация;
	МесяцНачисления = Параметры.МесяцНачисления;
	ВидНалогаВзносаОтчисления = Параметры.ВидНалогаВзносаОтчисления;
	ЭтоКонфигурацияЗарплатногоУчета = ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета();
	ЭтоЮридическоеЛицо = ЗарплатаКадрыПовтИсп.ЭтоЮридическоеЛицо(Организация);
	// для УПК доходы субъекта предпринимательства для ТОО
	ВозможностьРасчетаКПН = ЭтоЮридическоеЛицо И НЕ ЭтоКонфигурацияЗарплатногоУчета;
	
	Если ВозможностьРасчетаКПН И Параметры.Свойство("Объект") Тогда
		
		Если НЕ ТипЗнч(Параметры.Объект.Ссылка) = Тип("ДокументСсылка.РегистрацияПрочихДоходов") Тогда
			ВозможностьРасчетаКПН = Ложь;	
		КонецЕсли;
	
	КонецЕсли;
	
	ПараметрВычетыИПН = ?(Параметры.Свойство("ВычетыИПН"), Параметры.ВычетыИПН, Неопределено);	
	ПараметрДоходыНеПодлежащиеНалогообложению = ?(Параметры.Свойство("ДоходыНеПодлежащиеНалогообложению"), Параметры.ДоходыНеПодлежащиеНалогообложению, Неопределено);
	
	ЗаполнитьФизическоеЛицо(Параметры.СотрудникФизическоеЛицо);
	ЗаполнитьФормуНаСервере(Параметры.НалогиВзносыОтчисления, ПараметрВычетыИПН, ПараметрДоходыНеПодлежащиеНалогообложению, Истина);
	Заголовок = ФизическоеЛицо;
	
	Если ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ОПВ Тогда
		Элементы.НалогиВзносыОтчисленияНалогВзнос.Заголовок = НСтр("ru = 'ОПВ'");
	ИначеЕсли ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС Тогда
		Элементы.НалогиВзносыОтчисленияНалогВзнос.Заголовок = НСтр("ru = 'ВОСМС'");
	ИначеЕсли ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.СН Тогда
		Элементы.НалогиВзносыОтчисленияНалогВзнос.Заголовок = НСтр("ru = 'СН'");
	ИначеЕсли ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.СО Тогда
		Элементы.НалогиВзносыОтчисленияНалогВзнос.Заголовок = НСтр("ru = 'СО'");
	ИначеЕсли ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ООСМС Тогда
		Элементы.НалогиВзносыОтчисленияНалогВзнос.Заголовок = НСтр("ru = 'ООСМС'");
	ИначеЕсли ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ОППВ Тогда
		Элементы.НалогиВзносыОтчисленияНалогВзнос.Заголовок = НСтр("ru = 'ОППВ'");
	ИначеЕсли ВозможностьРасчетаКПН Тогда
		Элементы.НалогиВзносыОтчисленияНалогВзнос.Заголовок = НСтр("ru = 'ИПН (КПН)'");
	КонецЕсли;	
		
	УстановитьНастройкиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыНалогиВзносыОтчисления

&НаКлиенте
Процедура НалогиВзносыОтчисленияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НалогиВзносыОтчисления.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.ФиксСтрока = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НалогиВзносыОтчисленияПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.НалогиВзносыОтчисления.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый ФиксированнаяСтруктура(Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", ТекущиеДанные.ИдентификаторСтрокиНалогиВзносыОтчисления));
	Элементы.ВычетыИПН.ОтборСтрок = Отбор;
	
	Отбор = Новый ФиксированнаяСтруктура(Новый Структура("ФизическоеЛицо", ТекущиеДанные.ФизическоеЛицо));
	Элементы.ДоходыНеПодлежащиеНалогообложению.ОтборСтрок = Отбор;
	
КонецПроцедуры

&НаКлиенте
Процедура НалогиВзносыОтчисленияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.НалогиВзносыОтчисления.ТекущиеДанные;
	
	Если Копирование Тогда
	
		ТекущиеДанные.ИдентификаторСтрокиНалогиВзносыОтчисления = 0;
		
	ИначеЕсли НоваяСтрока Тогда	
		
		ЗаполнитьНовуюСтроку();
		
	КонецЕсли;
	
	//РасчетЗарплатыКлиент.СтрокаРасчетаПриНачалеРедактирования(ЭтаФорма, "НалогиВзносыОтчисления", ТекущиеДанные, НоваяСтрока, Копирование);
	УчетНалоговВзносовОтчисленийРасширенныйКлиентСервер.НазначитьИдентификаторСтрокеНалогиВзносыОтчисления(ТекущиеДанные, МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления, НоваяСтрока);
	
	Если НоваяСтрока ИЛИ Копирование Тогда
		
		Отбор = Новый ФиксированнаяСтруктура(Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", ТекущиеДанные.ИдентификаторСтрокиНалогиВзносыОтчисления));
		Элементы.ВычетыИПН.ОтборСтрок = Отбор;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НалогиВзносыОтчисленияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	//РасчетЗарплатыКлиент.СтрокаРасчетаПриОкончанииРедактирования(
	//	ЭтаФорма, УчетНДФЛКлиентСервер.ФормаПодробнееОРасчетеНДФЛОписаниеТаблицыНДФЛ(), Ложь, Ложь);
		
КонецПроцедуры

&НаКлиенте
Процедура НалогиВзносыОтчисленияПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.НалогиВзносыОтчисления.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ИдентификаторУдаляемойСтрокиСтрокиНалогиВзносыОтчисления = ТекущиеДанные.ИдентификаторСтрокиНалогиВзносыОтчисления;
	
КонецПроцедуры

&НаКлиенте
Процедура НалогиВзносыОтчисленияПослеУдаления(Элемент)
	
	УдалитьВычетыИПН(ЭтаФорма, ИдентификаторУдаляемойСтрокиСтрокиНалогиВзносыОтчисления);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыВычетыИПН

&НаКлиенте
Процедура ВычетыИПНПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НалогиВзносыОтчисления.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.ФиксСтрока = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВычетыИПНПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекущиеДанныеНалогаВзносаОтчисления = Элементы.НалогиВзносыОтчисления.ТекущиеДанные;
		
	Если ТекущиеДанныеНалогаВзносаОтчисления = Неопределено Тогда
		
		ВызватьИсключение  НСтр("ru='Не выбрана основная строка начисления ИПН, к которой применяются вычеты'");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВычетыИПНПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанныеВычетыИПН = Элементы.ВычетыИПН.ТекущиеДанные;
		
	Если НоваяСтрока И НЕ Копирование Тогда
		
		ТекущиеДанныеНалогаВзносаОтчисления = Элементы.НалогиВзносыОтчисления.ТекущиеДанные;
		
		Если НЕ ТекущиеДанныеНалогаВзносаОтчисления = Неопределено
			И НЕ ТекущиеДанныеВычетыИПН = Неопределено Тогда
			
			ТекущиеДанныеВычетыИПН.ИдентификаторСтрокиНалогиВзносыОтчисления = ТекущиеДанныеНалогаВзносаОтчисления.ИдентификаторСтрокиНалогиВзносыОтчисления;
			
		КонецЕсли;
			
	КонецЕсли;
	
	Если НоваяСтрока ИЛИ Копирование Тогда
		
		Если НЕ ТекущиеДанныеВычетыИПН = Неопределено Тогда
			ТекущиеДанныеВычетыИПН.ФиксСтрока = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыДоходыНеПодлежащиеНалогообложению

&НаКлиенте
Процедура ДоходыНеПодлежащиеНалогообложениюПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДоходыНеПодлежащиеНалогообложению.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.ФиксСтрока = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыНеПодлежащиеНалогообложениюПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		
		ТекущиеДанныеДоходыНеПодлежащиеНалогообложению = Элементы.ДоходыНеПодлежащиеНалогообложению.ТекущиеДанные;
		ТекущиеДанныеНалогаВзносаОтчисления = Элементы.НалогиВзносыОтчисления.ТекущиеДанные;
		
		Если НЕ ТекущиеДанныеНалогаВзносаОтчисления = Неопределено
			И НЕ ТекущиеДанныеДоходыНеПодлежащиеНалогообложению = Неопределено Тогда
			
			ЗаполнитьЗначенияСвойств(ТекущиеДанныеДоходыНеПодлежащиеНалогообложению, ТекущиеДанныеНалогаВзносаОтчисления);
			
		Иначе
			
			ТекущиеДанныеДоходыНеПодлежащиеНалогообложению.ВидНалогаВзносаОтчисления = ВидНалогаВзносаОтчисления;
			ТекущиеДанныеДоходыНеПодлежащиеНалогообложению.МесяцНалоговогоПериода = МесяцНачисления;
			ТекущиеДанныеДоходыНеПодлежащиеНалогообложению.ФизическоеЛицо = ФизическоеЛицо;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьНастройкиФормы()
	
	ДатаКонтроля = '2018-01-01';
	ДатаИспользованияКорректировки = '2019-01-01';
	ДатаУменьшенияОблагаемогоДохода = '2021-01-01';
	ВидимостьВычетов = МесяцНачисления >= ДатаКонтроля;
	ВидимостьКорректировкиДохода = МесяцНачисления >= ДатаИспользованияКорректировки;
	ВидимостьУменьшениеОблагаемогоДохода = МесяцНачисления >= ДатаУменьшенияОблагаемогоДохода;
	
	ВозможностьРедактированияНалоговВзносовОтчислений = НЕ ТолькоПросмотр;
	
	ЭтоИПН = (ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ИПН);
	
	Элементы.НалогиВзносыОтчисленияРазрешенныйВычет.Видимость  = ЭтоИПН И НЕ ВидимостьВычетов;
	Элементы.НалогиВзносыОтчисленияПримененныйВычет.Видимость  = ЭтоИПН И НЕ ВидимостьВычетов;
	Элементы.НалогиВзносыОтчисленияПримененнаяЛьгота.Видимость = ЭтоИПН И (НЕ ВидимостьВычетов ИЛИ ВидимостьКорректировкиДохода ИЛИ ВидимостьУменьшениеОблагаемогоДохода);
	Элементы.ГруппаВычетыИПН.Видимость = ЭтоИПН И ВидимостьВычетов;
	
	СтрокиНеоблагаемыхДоходовПоФизическомуЛицу = ДоходыНеПодлежащиеНалогообложению.НайтиСтроки(Новый Структура("ФизическоеЛицо", ФизическоеЛицо));
	 
	ЕстьНеоблагаемыеДоходыПоФизическомуЛица = СтрокиНеоблагаемыхДоходовПоФизическомуЛицу.Количество() > 0;
	
	Элементы.ГруппаДоходыНеПодлежащиеНалогообложению.Видимость = ЕстьНеоблагаемыеДоходыПоФизическомуЛица;
	
	Если НЕ Элементы.ГруппаДоходыНеПодлежащиеНалогообложению.Видимость Тогда
		Элементы.ОбщаяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;	
	КонецЕсли;
	
	Элементы.ГруппаКнопокПросмотр.Видимость			= НЕ ВозможностьРедактированияНалоговВзносовОтчислений;
	Элементы.ГруппаКнопокРедактирование.Видимость	= ВозможностьРедактированияНалоговВзносовОтчислений;
	Если ВозможностьРедактированияНалоговВзносовОтчислений Тогда
		Элементы.ФормаОК.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.ФормаЗакрыть.КнопкаПоУмолчанию = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуНаСервере(Знач СведенияНалогиВзносыОтчисления, Знач СведенияВычетыИПН, Знач СведенияДоходыНеПодлежащиеНалогообложению, Знач ПервичноеЗаполнение)
	
	ТабличныеЧастиНалогиВзносыОтчисления = ПолучитьИзВременногоХранилища(СведенияНалогиВзносыОтчисления);
	ТабличныеЧастиНалогиВзносыОтчисления.Свойство("АдресРаспределенияРезультатовВХранилище", АдресРаспределенияРезультатовВХранилище);
	
	Если ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ИПН Тогда
		
		ТабличныеЧастиВычетыИПН = ПолучитьИзВременногоХранилища(СведенияВычетыИПН);
		
	КонецЕсли; 
	
	ТабличныеЧастиДоходыНеПодлежащиеНалогообложению = ПолучитьИзВременногоХранилища(СведенияДоходыНеПодлежащиеНалогообложению);

	Если ТолькоПросмотр И ТабличныеЧастиНалогиВзносыОтчисления.НалогиВзносыОтчисления.Количество() = 0 Тогда
		
		ВызватьИсключение  НСтр("ru='Нет сведений о расчете налогов, взносов и отчислений'");
		
	КонецЕсли; 

	Если ПервичноеЗаполнение Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"НалогиВзносыОтчисленияФизическоеЛицо",
			"ПараметрыВыбора",
			Новый ФиксированныйМассив(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Новый ПараметрВыбора("Отбор.Ссылка", ФизическоеЛицо))));
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"НалогиВзносыОтчисленияПодразделение",
			"ПараметрыВыбора",
			Новый ФиксированныйМассив(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Новый ПараметрВыбора("Отбор.Владелец", Организация))));
		
		Элементы.НалогиВзносыОтчисления.ТекущаяСтрока	= 0;
		
		Если ТолькоПросмотр Тогда
			
			Элементы.НалогиВзносыОтчисления.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
			Элементы.НалогиВзносыОтчисления.ИзменятьСоставСтрок = Ложь;
			
			Элементы.ВычетыИПН.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
			Элементы.ВычетыИПН.ИзменятьСоставСтрок = Ложь;
			
			Элементы.ДоходыНеПодлежащиеНалогообложению.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
			Элементы.ДоходыНеПодлежащиеНалогообложению.ИзменятьСоставСтрок = Ложь;
			
		КонецЕсли;
			
	КонецЕсли; 
	
	// Инициализация табличных частей
	НалогиВзносыОтчисления.Загрузить(ТабличныеЧастиНалогиВзносыОтчисления.НалогиВзносыОтчисления);
	
	Если ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ИПН Тогда
		ВычетыИПН.Загрузить(ТабличныеЧастиВычетыИПН.ВычетыИПН);
	КонецЕсли; 
	
	ДоходыНеПодлежащиеНалогообложению.Загрузить(ТабличныеЧастиДоходыНеПодлежащиеНалогообложению.ДоходыНеПодлежащиеНалогообложению);
	
	Элементы.НалогиВзносыОтчисления.ОтборСтрок = Новый ФиксированнаяСтруктура("ФизическоеЛицо", ФизическоеЛицо);
	Элементы.ДоходыНеПодлежащиеНалогообложению.ОтборСтрок = Новый ФиксированнаяСтруктура("ФизическоеЛицо, ВидНалогаВзносаОтчисления", ФизическоеЛицо, ВидНалогаВзносаОтчисления);
	
	МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления = УчетНалоговВзносовОтчислений.МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления(НалогиВзносыОтчисления);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФизическоеЛицо(СотрудникФизическоеЛицо)
	
	Если ТипЗнч(СотрудникФизическоеЛицо) = Тип("СправочникСсылка.ФизическиеЛица") Тогда 
		ФизическоеЛицо = СотрудникФизическоеЛицо;
		Возврат;
	КонецЕсли;
	
	ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СотрудникФизическоеЛицо, "ФизическоеЛицо");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеОбязательныхПолей(ФормаЗаполненаНекорректно)
	
	Для Каждого СтрокаНалогиВзносыОтчисления Из НалогиВзносыОтчисления Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаНалогиВзносыОтчисления.ВидДохода) Тогда
			
			ФормаЗаполненаНекорректно = Истина;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнен вид дохода'"),,, "НалогиВзносыОтчисления");
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаНалогиВзносыОтчисления.ОблагаемыйДоход) 
			И НЕ ЗначениеЗаполнено(СтрокаНалогиВзносыОтчисления.НеоблагаемыйДоход)
			И НЕ ЗначениеЗаполнено(СтрокаНалогиВзносыОтчисления.НалогВзнос)
			И НЕ ЗначениеЗаполнено(СтрокаНалогиВзносыОтчисления.ОбъектИсчисления) Тогда
			
			ФормаЗаполненаНекорректно = Истина;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнены суммовые данные'"),,, "НалогиВзносыОтчисления");
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаВычетыИПН Из ВычетыИПН Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаВычетыИПН.ВидВычетаИПН) Тогда
			
			ФормаЗаполненаНекорректно = Истина;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнен вид вычета ИПН'"),,, "ВычетыИПН");
			
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаВычетыИПН.РазрешенныйВычет) 
			И НЕ ЗначениеЗаполнено(СтрокаВычетыИПН.ПримененныйВычет) Тогда
			
			ФормаЗаполненаНекорректно = Истина;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнены суммовые данные вычетов ИПН'"),,, "ВычетыИПН");
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаДоходыНеПодлежащиеНалогообложению Из ДоходыНеПодлежащиеНалогообложению Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаДоходыНеПодлежащиеНалогообложению.Начисление) Тогда
			
			ФормаЗаполненаНекорректно = Истина;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнено начисление, по которому не облагаются данные'"),,, "ДоходыНеПодлежащиеНалогообложению");
			
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаДоходыНеПодлежащиеНалогообложению.СуммаДохода) 
			И НЕ ЗначениеЗаполнено(СтрокаДоходыНеПодлежащиеНалогообложению.НеоблагаемыйДоход) Тогда
			
			ФормаЗаполненаНекорректно = Истина;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнены суммовые данные'"),,, "ДоходыНеПодлежащиеНалогообложению");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиИзмененияВОбъектФормыВладельца()
	
	Если Модифицированность Тогда
		Оповестить("ИзмененыРезультатыРасчетаНалогиВзносыОтчисления", ПоместитьИзмененныеДанныеВоВременноеХранилище(), ЭтаФорма);
		Модифицированность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьИзмененныеДанныеВоВременноеХранилище()
	
	ВозвращаемыеСведения = Новый Структура;
	
	ВозвращаемыеСведения.Вставить("НалогиВзносыОтчисления", НалогиВзносыОтчисления.Выгрузить());
	ВозвращаемыеСведения.Вставить("ВычетыИПН", ВычетыИПН.Выгрузить());
	ВозвращаемыеСведения.Вставить("ДоходыНеПодлежащиеНалогообложению", ДоходыНеПодлежащиеНалогообложению.Выгрузить());
	ВозвращаемыеСведения.Вставить("ФизическоеЛицо", ФизическоеЛицо);
	ВозвращаемыеСведения.Вставить("ВидНалогаВзносаОтчисления", ВидНалогаВзносаОтчисления);
	
	ИзмененныеДанные.Очистить();
	НоваяСтрока = ИзмененныеДанные.Добавить();
	НоваяСтрока.ИмяТаблицы = "НалогиВзносыОтчисления";
	НоваяСтрока.ФизическоеЛицо = ФизическоеЛицо;
	ВозвращаемыеСведения.Вставить("ИзмененныеДанные", ИзмененныеДанные.Выгрузить());
	
	Возврат ПоместитьВоВременноеХранилище(ВозвращаемыеСведения, Новый УникальныйИдентификатор);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьВычетыИПН(Форма, ИдентификаторСтрокиНалогиВзносыОтчисления)
	
	Если НЕ Форма.ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ИПН") Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", ИдентификаторСтрокиНалогиВзносыОтчисления);
	НайденныеВычетыИПН = Форма.ВычетыИПН.НайтиСтроки(Отбор);
	Для Каждого СтрокаВычетов Из НайденныеВычетыИПН Цикл
		Форма.ВычетыИПН.Удалить(СтрокаВычетов);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНовуюСтроку()
	
	НоваяСтрока = НалогиВзносыОтчисления.НайтиПоИдентификатору(Элементы.НалогиВзносыОтчисления.ТекущаяСтрока);
	
	НоваяСтрока.ФиксСтрока = Истина;
	НоваяСтрока.ФизическоеЛицо = ФизическоеЛицо;
	НоваяСтрока.ВидНалогаВзносаОтчисления = ВидНалогаВзносаОтчисления;
	
	Если ЗначениеЗаполнено(НоваяСтрока.ФизическоеЛицо) Тогда
		
		СтрокиНалогиВзносыОтчисления = НалогиВзносыОтчисления.НайтиСтроки(Новый Структура("ФизическоеЛицо", НоваяСтрока.ФизическоеЛицо));
		Для Каждого СтрокаНалогиВзносыОтчисления Из СтрокиНалогиВзносыОтчисления Цикл
			Если ЗначениеЗаполнено(СтрокаНалогиВзносыОтчисления.Подразделение) Тогда
				НоваяСтрока.Подразделение = СтрокаНалогиВзносыОтчисления.Подразделение;
				Прервать;
			КонецЕсли; 
		КонецЦикла;
		
		Если Не ЗначениеЗаполнено(НоваяСтрока.Подразделение) Тогда
			ДанныеПодразделения = ПодходящееПодразделение(НоваяСтрока.ФизическоеЛицо, Организация, МесяцНачисления);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеПодразделения);
		КонецЕсли; 
		
	КонецЕсли; 
	
	НоваяСтрока.МесяцНалоговогоПериода = НачалоМесяца(МесяцНачисления);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодходящееПодразделение(ФизическоеЛицо, Организация, МесяцНачисления)
	
	Подразделение = Неопределено;
	Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		
		ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
		ПараметрыПолученияСотрудников.Организация = Организация;
		ПараметрыПолученияСотрудников.НачалоПериода = МесяцНачисления;
		ПараметрыПолученияСотрудников.ОкончаниеПериода = КонецМесяца(МесяцНачисления);
		ПараметрыПолученияСотрудников.СписокФизическихЛиц = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическоеЛицо);
		ПараметрыПолученияСотрудников.КадровыеДанные = "Подразделение";
		
		СотрудникиОрганизации = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолученияСотрудников);
		Если СотрудникиОрганизации.Количество() > 0 Тогда
			Подразделение = СотрудникиОрганизации[0].Подразделение;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Структура("Подразделение", Подразделение);
	
КонецФункции

&НаСервере
Функция ПолучитьКонтролируемыеПоля() Экспорт
	
	КонтролируемыеПоля = Новый Структура("НалогиВзносыОтчисления", УчетНалоговВзносовОтчислений.КонтролируемыеПоляДляФиксацииРезультатов());
	Возврат КонтролируемыеПоля;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСтарыеЗначенияКонтролируемыхПолей() Экспорт
	
	Возврат СтарыеЗначенияКонтролируемыхПолей;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ФормаЗаполненаНекорректно = Ложь;
	
	ПроверитьЗаполнениеОбязательныхПолей(ФормаЗаполненаНекорректно);
	
	Если ФормаЗаполненаНекорректно Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПеренестиИзмененияВОбъектФормыВладельца();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

СтарыеЗначенияКонтролируемыхПолей = Новый Соответствие;

#КонецОбласти
