#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

Функция ПолучитьТекстЗапросаПоЭлементамСправочника(УсловиеОтбора)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВидыРеализации.Ссылка,
	|	ВЫБОР
	|		КОГДА ВидыРеализации.Ссылка В (&Корректировка)
	|				ИЛИ ВидыРеализации.ПризнакКорректировки
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПризнакКорректировки,
	|	ВЫБОР
	|		КОГДА ВидыРеализации.ПолноеНаименование = &ПустаяСтрока
	|			ТОГДА ВидыРеализации.Наименование
	|		ИНАЧЕ ВидыРеализации.ПолноеНаименование
	|	КОНЕЦ КАК ПолноеНаименование,
	|	ВЫБОР
	|		КОГДА ВидыРеализации.Ссылка В (&ВидНДС_НДС)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДС)
	|		КОГДА ВидыРеализации.Ссылка В (&ВидНДС_МетодомЗачета)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДСУплачиваемыйПриИмпортеМетодомЗачета)
	|		КОГДА ВидыРеализации.Ссылка В (&ВидНДС_НалоговымАгентом)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДСУплачиваемыйНалоговымАгентом)
	|		КОГДА ВидыРеализации.Ссылка В (&ВидНДС_НалоговымАгентом)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДСУплачиваемыйПриИмпортеИзТаможенногоСоюза)
	|		КОГДА ВидыРеализации.Ссылка В (&ВидНДС_ТаможеннымОрганам)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДСуплачиваемыйТаможеннымОрганам)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыНДС.НДС)
	|	КОНЕЦ КАК ВидНДС
	|ИЗ
	|	Справочник.ВидыРеализации КАК ВидыРеализации" + УсловиеОтбора);
	
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	
	МассивКорректировок = Новый Массив;
	МассивКорректировок.Добавить(Справочники.ВидыРеализации.ВозвратТМЗ);
	МассивКорректировок.Добавить(Справочники.ВидыРеализации.ИзменениеУсловийСделки);
	МассивКорректировок.Добавить(Справочники.ВидыРеализации.КорректировкаРеализацииНаЭкспорт);
	
	МассивВидНДС_НДС = Новый Массив;
	МассивВидНДС_НДС.Добавить(Справочники.ВидыРеализации.ВозвратТМЗ);
	МассивВидНДС_НДС.Добавить(Справочники.ВидыРеализации.ИзменениеУсловийСделки);
	МассивВидНДС_НДС.Добавить(Справочники.ВидыРеализации.РеализацияТМЗ);
	МассивВидНДС_НДС.Добавить(Справочники.ВидыРеализации.УслугиПоКомиссионнойТорговле);
	МассивВидНДС_НДС.Добавить(Справочники.ВидыРеализации.РеализацияНаЭкспорт);
	
	МассивВидНДС_МетодомЗачета = Новый Массив;
	МассивВидНДС_МетодомЗачета.Добавить(Справочники.ВидыРеализации.ИмпортТМЗМетодомЗачета);

	МассивВидНДС_НалоговымАгентом = Новый Массив;
	МассивВидНДС_НалоговымАгентом.Добавить(Справочники.ВидыРеализации.НДСЗаНерезидента);

	МассивВидНДС_ТаможенногоСоюза = Новый Массив;
	МассивВидНДС_ТаможенногоСоюза.Добавить(Справочники.ВидыРеализации.НДСПриИмпортеИзТаможенногоСоюза);

	МассивВидНДС_ТаможеннымОрганам = Новый Массив;
	МассивВидНДС_ТаможеннымОрганам.Добавить(Справочники.ВидыРеализации.ПрочийОблагаемыйИмпорт);

	
	Запрос.УстановитьПараметр("Корректировка", МассивКорректировок);
	Запрос.УстановитьПараметр("ВидНДС_НДС", МассивВидНДС_НДС);
	Запрос.УстановитьПараметр("ВидНДС_МетодомЗачета", МассивВидНДС_МетодомЗачета);
	Запрос.УстановитьПараметр("ВидНДС_НалоговымАгентом", МассивВидНДС_НалоговымАгентом);
	Запрос.УстановитьПараметр("ВидНДС_ТаможенногоСоюза", МассивВидНДС_ТаможенногоСоюза);
	Запрос.УстановитьПараметр("ВидНДС_ТаможеннымОрганам", МассивВидНДС_ТаможеннымОрганам);
	
	Возврат Запрос;
	
КонецФункции

// Обработчик первоначального заполнения
// Заполняет реквизит "ПолноеНаименование" по реквизиту "Наименование" и реквизит "ПризнакКорректировки" для ряда элементов.
//
Процедура ЗаполнитьПредопределенныеВидыРеализаций() Экспорт
	
	УсловиеОтбора = "
	|ГДЕ
	|	ВидыРеализации.ПолноеНаименование = &ПустаяСтрока
	|	ИЛИ ВидыРеализации.Предопределенный";
	
	Запрос = ПолучитьТекстЗапросаПоЭлементамСправочника(УсловиеОтбора);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(СправочникОбъект, Выборка);
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура обновления ИБ для 2.1.2.12.
// Заполняет предопределённые данные.
//
Процедура ЗаполнитьВидНДС() Экспорт

	УсловиеОтбора = "";
	
	Запрос = ПолучитьТекстЗапросаПоЭлементамСправочника(УсловиеОтбора);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Ссылка.ВидНДС) Тогда
			
			НачатьТранзакцию();
			Попытка
				СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
				Если СправочникОбъект.Ссылка = Справочники.ВидыРеализации.НДСЗаНерезидента
					Или СправочникОбъект.Ссылка = Справочники.ВидыРеализации.НДСПриИмпортеИзТаможенногоСоюза Тогда
					
					ЗаполнитьЗначенияСвойств(СправочникОбъект, Выборка);
				Иначе
					СправочникОбъект.ВидНДС = Выборка.ВидНДС;
				КонецЕсли;
				
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
				
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				ВызватьИсключение;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура обновления ИБ для 2.1.2.50
// Заполняет предопределённые данные.
//
Процедура ЗаполнитьВидНДСПоЭкспорту() Экспорт
	
	УсловиеОтбора = "
	|ГДЕ
	|	ВидыРеализации.Предопределенный
	|	И ВидыРеализации.Ссылка В (&СписокЭкспорт)";
	
	Запрос = ПолучитьТекстЗапросаПоЭлементамСправочника(УсловиеОтбора);
	СписокЭкспорт = Новый Массив;
	СписокЭкспорт.Добавить(Справочники.ВидыРеализации.РеализацияНаЭкспорт);
	СписокЭкспорт.Добавить(Справочники.ВидыРеализации.КорректировкаРеализацииНаЭкспорт);
	
	Запрос.УстановитьПараметр("СписокЭкспорт",СписокЭкспорт);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(СправочникОбъект, Выборка);
			СправочникОбъект.УстановитьНовыйКод();
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
