Функция ЭЦП_ПолучитьСертификатыКриптографииНаКлиенте(Знач АлгоритмПодписи, Знач ТолькоЛичные, Знач ТолькоДействующиеСертификаты = Истина, ОбъектКомпоненты, МассивЛогаСобытий) Экспорт
	
	СписокСертификатовВсего = Новый Массив;
	МассивСтрокОтпечатков   = Новый Массив;
    
    ОписаниеУказанногоАлгоритмаПодписи = ?(ЗначениеЗаполнено(АлгоритмПодписи), АлгоритмПодписи, "алгоритм подписи не заполнен");
      
    ОписаниеОперации = "Получение [МенеджерКриптографии] для чтения всех сертификатов НаКлиенте с алгоритмом подписи [" + ОписаниеУказанногоАлгоритмаПодписи + "]";
    
    Если ЗначениеЗаполнено(АлгоритмПодписи) Тогда
        ТекущийАлгоритмПодписи = АлгоритмПодписи;
    Иначе
        ВсеПоддерживаемыеАлгоритмыПодписей = ЭКОМ_ОбщегоНазначения.ВсеАлгоритмыПодписей();
        ТекущийАлгоритмПодписи = ВсеПоддерживаемыеАлгоритмыПодписей[0]; //алгоритм можно брать любой 1с возвращает все равно все сертификаты вне зависимости от алгоритма создания МенеджерКриптографии
    КонецЕсли;
    
    МенеджерКриптографии = ЭЦП_ПолучитьМенеджерКриптографииНаКлиенте(ТекущийАлгоритмПодписи, МассивЛогаСобытий);
	
	Если НЕ МенеджерКриптографии = Неопределено Тогда
			
		СписокСертификатов = ЭЦП_ПолучитьВсеСертификатыСтруктурами(МенеджерКриптографии, АлгоритмПодписи, ТолькоЛичные, МассивСтрокОтпечатков, ОбъектКомпоненты, МассивЛогаСобытий);	
        Для каждого ТекущийСертификатИзВсехСертификатов  Из СписокСертификатов Цикл	
            Если НЕ ПодходитАлгоритмСрокДействияСертификата(ТекущийСертификатИзВсехСертификатов, ТолькоДействующиеСертификаты) Тогда
                Продолжить;
            КонецЕсли;
			СписокСертификатовВсего.Добавить(ТекущийСертификатИзВсехСертификатов);	
		КонецЦикла;
    Иначе
        Возврат Новый Массив;
	КонецЕсли;
	
	Возврат СписокСертификатовВсего;		

КонецФункции	

// Возвращает созданный МенеджерКриптографии
//
// Параметры:
//  Параметры   - Структура - Создается функцией ПараметрыМенеджераКриптографииПоАлгоритмуПодписи() на основе переданного параметра АлгоритмПодписи
//  МассивЛогаСобытий  - Строка - Сюда будет дописано описание в случае ошибки
// 
// Возвращаемое значение:
// Неопределено, МенеджерКриптографии - если МенеджерКриптографии не создан возвращается Неопределено
//
Функция СоздатьМенеджерКриптографии(Параметры, МассивЛогаСобытий) Экспорт
	
	Результат = Неопределено;
    Попытка
    	Результат = Новый МенеджерКриптографии(Параметры.ИмяМодуляКриптографии, Параметры.ПутьМодуляКриптографии, Параметры.ТипМодуляКриптографии);
	Исключение
		ТекстЛогаСобытий = "Проверьте установлена ли программа криптопровайдера [" + Параметры.ИмяМодуляКриптографии + "] на компьютер
		| с алгоритмом подписи [" + Параметры.АлгоритмПодписи + "]" + Символы.ПС + Символы.ПС + ОписаниеОшибки();
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), "Создать менеджер криптографии на клиенте");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

    КонецПопытки;
    
    Возврат Результат;
	
КонецФункции 

Функция ЭЦП_ПолучитьМенеджерКриптографииНаКлиенте(АлгоритмПодписи, МассивЛогаСобытий) Экспорт
    	
    ЭКОМ_МенеджерКриптографии  = Неопределено;
	
    Параметры = ЭКОМ_ОбщегоНазначения.ЭЦП_ПараметрыМенеджераКриптографииПоАлгоритмуПодписи(АлгоритмПодписи);    
	Если Параметры.АлгоритмПодписи = "" Тогда
		ТекстЛогаСобытий = "Менеджер криптографии не создан, проверьте поддержку алгоритма подписи [" + АлгоритмПодписи + "] в программе
		| криптопровайдера [" + Параметры.ИмяМодуляКриптографии + "]";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), "Получить менеджер криптографии на клиенте");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

	Иначе
		 ЭКОМ_МенеджерКриптографии = СоздатьМенеджерКриптографии(Параметры, МассивЛогаСобытий);
	КонецЕсли;
	
    Возврат ЭКОМ_МенеджерКриптографии;
	
КонецФункции

Функция ПодходитАлгоритмСрокДействияСертификата(Знач Сертификат, Знач ТолькоДействующиеСертификаты = Истина)
    Перем ДатаОкончания;
    
    Если Сертификат.Свойство("ДействителенДо", ДатаОкончания) = Неопределено Тогда //нет поля ДействителенДо
        Возврат Истина;
    КонецЕсли;
    
    Если ТолькоДействующиеСертификаты = Истина И ДатаОкончания < ТекущаяДата() Тогда // отфильтровываем истекшие сертификаты. Сертификат уже не подходит дальше продолжать нет смысла
        Возврат Ложь;
    Иначе
        Результат = Истина;
    КонецЕсли;
    
    Результат = ЭКОМ_ОбщегоНазначения.ЭтоПоддерживаемыйАлгоритмПодписи(Сертификат.АлгоритмПодписи);
    
    Возврат Результат;
КонецФункции

Функция ЭЦП_ПолучитьВсеСертификатыСтруктурами(МенеджерКриптографии, АлгоритмПодписи, ТолькоЛичные, МассивСтрокОтпечатков, ОбъектКомпоненты, МассивЛогаСобытий)
	Сертификаты = Новый Массив;
    
	ЭЦП_ЗаполнитьМассивСертификатовПоТипуХранилищаСертификатов(АлгоритмПодписи, МассивЛогаСобытий, МенеджерКриптографии, ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты, Сертификаты, ОбъектКомпоненты);
	
    Если НЕ ТолькоЛичные Тогда
        ЭЦП_ЗаполнитьМассивСертификатовПоТипуХранилищаСертификатов(АлгоритмПодписи, МассивЛогаСобытий, МенеджерКриптографии, ТипХранилищаСертификатовКриптографии.КорневыеСертификаты, Сертификаты, ОбъектКомпоненты);
	КонецЕсли;
	
	Возврат Сертификаты;		

КонецФункции

Процедура ЭЦП_ЗаполнитьМассивСертификатовПоТипуХранилищаСертификатов(Знач АлгоритмПодписи, МассивЛогаСобытий, Знач МенеджерКриптографии, ТипХранилища, Сертификаты, ОбъектКомпоненты)
       		
    Хранилище = МенеджерКриптографии.ПолучитьХранилищеСертификатов(ТипХранилища);
    СертификатыХранилища = Хранилище.ПолучитьВсе(); 
	СписокСертификатов   = ПолучитьДанныеОСертификатах();
	
	АлгоритмыПодписиСертификата    = ИдентификаторыАлгоритмовПодписи(Истина);
	АлгоритмыСформированнойПодписи = ИдентификаторыАлгоритмовПодписи(Ложь);
	
	Для Каждого Сертификат Из СертификатыХранилища Цикл
		
		Если НЕ ОбъектКомпоненты = Неопределено Тогда
			OIDАлгоритмаПодписи         = РезультатGetSignOIDFromCert(ОбъектКомпоненты, Сертификат, МассивЛогаСобытий);  
			МассивАлгоритмовСертификата = АлгоритмыСформированнойПодписи.Получить(OIDАлгоритмаПодписи);
			
			Если МассивАлгоритмовСертификата = Неопределено Тогда
				Продолжить;
				
			КонецЕсли;
			
			// Меняем алгоритм подписи на корректный
			Индекс = МассивАлгоритмовСертификата.Найти(АлгоритмПодписи);
			Если Индекс = Неопределено Тогда
				 АлгоритмПодписи = МассивАлгоритмовСертификата[0];
				
			КонецЕсли;
		КонецЕсли;
		
		ДвоичныйОтпечатокСертификата = Строка(Сертификат.Отпечаток);
		ДвоичныйОтпечатокСертификата = СтрЗаменить(ДвоичныйОтпечатокСертификата, " ", "");
        АлгоритмаПодписиСертификата = СписокСертификатов.Получить(ДвоичныйОтпечатокСертификата);
		МассивАлгоритмовСертификата = АлгоритмыПодписиСертификата.Получить(АлгоритмаПодписиСертификата);
		Если НЕ МассивАлгоритмовСертификата = Неопределено Тогда
			// Меняем алгоритм подписи на корректный
			Индекс = МассивАлгоритмовСертификата.Найти(АлгоритмПодписи);
			Если Индекс = Неопределено Тогда
				АлгоритмПодписи = МассивАлгоритмовСертификата[0];
				
			КонецЕсли;	
		КонецЕсли;
		
		СтруктураСертификата = ЭЦП_ЗаполнитьСтруктуруСертификата(Сертификат, АлгоритмПодписи, МассивЛогаСобытий); //есть реквизиты дата окончания, кому выдан и т.п.
        Если СтруктураСертификата = Неопределено Тогда
            Продолжить;
        КонецЕсли;
					 
        Сертификаты.Добавить(СтруктураСертификата);
	   
    КонецЦикла;
	      
КонецПроцедуры	

Функция ОбъектВнешнейКомпонентыXMLDSigПрямойСпособ(МассивЛогаСобытий) Экспорт
	
	ИмяСобытия = "Объект внешней компоненты XMLDSig";
	ОбъектКомпоненты = Неопределено;
	Если ПодключитьВнешнююКомпоненту("Справочник.ЭКОМ_Сертификаты.Макет.КомпонентаXMLDSIG", "XMLDSignAddInSymbolicName", ТипВнешнейКомпоненты.Native) Тогда
        Попытка
            ОбъектКомпоненты = Новый("AddIn.XMLDSignAddInSymbolicName.XMLDSignAddIn");
		Исключение
            ТекстЛогаСобытий = "Не удалось подключить внешнюю компоненту XMLDSig." + СокрЛП(ИнформацияОбОшибке());
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

        КонецПопытки;        
    КонецЕсли;
	
	Если ОбъектКомпоненты = Неопределено Тогда 
		ТекстЛогаСобытий = "Оператор Новый вернул Неопределено";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

	Иначе
		ОбъектКомпоненты.ПутьККриптопровайдеру = "";
	КонецЕсли;
	    
    Возврат ОбъектКомпоненты;
	
КонецФункции

Процедура ОбъектВнешнейКомпонентыXMLDSig(Контекст) Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ПослеПодключения", ЭКОМ_ОбщегоНазначенияКлиент, Контекст);
	НачатьПодключениеВнешнейКомпоненты(Оповещение, "Справочник.ЭКОМ_Сертификаты.Макет.КомпонентаXMLDSIG", "XMLDSignAddInSymbolicName");
	
КонецПроцедуры

Процедура ПослеПодключения(Подключено, Контекст) Экспорт
	
	Если Подключено Тогда
        Попытка
            Контекст.ОбъектКомпоненты = Новый("AddIn.XMLDSignAddInSymbolicName.XMLDSignAddIn");
		Исключение		
			ТекстЛогаСобытий = "Не удалось подключить внешнюю компоненту XMLDSig." + СокрЛП(ИнформацияОбОшибке());
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), "Подлючение к компоненте");
			Контекст.МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

		КонецПопытки;  
		
	ИначеЕсли Контекст.УстановитьЕслиНеПодключено Тогда
		Контекст.УстановитьЕслиНеПодключено = Ложь;//Docrobot 1.20.0 MOD-1918
        НачатьУстановкуВнешнейКомпоненты(Новый ОписаниеОповещения("ОбъектВнешнейКомпонентыXMLDSig", ЭКОМ_ОбщегоНазначенияКлиент, Контекст),
		"Справочник.ЭКОМ_Сертификаты.Макет.КомпонентаXMLDSIG");	
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЭЦП_ЗаполнитьСтруктуруСертификата(Сертификат, АлгоритмПодписи, МассивЛогаСобытий, ПустойАлгоритмПодписиЕслиНетБиблиотеки = Истина) Экспорт
	
    КомуВыдан = ЭЦП_ПолучитьПредставлениеПользователяНаКлиенте(Сертификат.Субъект);
    КемВыдан  = ЭЦП_ПолучитьПредставлениеПользователяНаКлиенте(Сертификат.Издатель);
    ДействителенДо = Сертификат.ДатаОкончания;
     
    ОтпечатокСертификата = Base64Строка(Сертификат.Отпечаток);
 
	ЭЦП_ЗаменитьНедопустимыеСимволы(КомуВыдан);
    ЭЦП_ЗаменитьНедопустимыеСимволы(КемВыдан);

    ИНН = "";
	Сертификат.Субъект.Свойство("OID1_2_643_100_4", ИНН);
	Если ИНН = Неопределено Тогда
		Сертификат.Субъект.Свойство("OID1_2_643_3_131_1_1", ИНН);
	КонецЕсли;
	ИНН_Число = ЭКОМ_ПреобразоватьВЧислоОбщегоНазначения(ИНН); 
		
	ДолжностьПодписанта = "";
	Сертификат.Субъект.Свойство("T", ДолжностьПодписанта);
	
	ФамилияПодписанта = "";
	Сертификат.Субъект.Свойство("SN", ФамилияПодписанта);
	
	ИмяОтчествоПодписанта = "";
	Сертификат.Субъект.Свойство("OID2_5_4_42", ИмяОтчествоПодписанта);
	ПерваяПозиция      = Найти(ИмяОтчествоПодписанта, " "); 
    ИмяПодписанта      = Лев(ИмяОтчествоПодписанта, ПерваяПозиция - 1);
	ОтчествоПодписанта = Прав(ИмяОтчествоПодписанта, СтрДлина(ИмяОтчествоПодписанта) - ПерваяПозиция);
	
	ИмяСертификата = Формат(ДействителенДо,"ДФ=dd.MM.yyyy") + " " + КомуВыдан;
	
	ИНН_Строка = Формат(ИНН_Число, "ЧГ=0");
	ЭЦП_ЗаменитьНедопустимыеСимволы(ИНН_Строка);
	ЭЦП_ЗаменитьНедопустимыеСимволы(ДолжностьПодписанта);
	ЭЦП_ЗаменитьНедопустимыеСимволы(ФамилияПодписанта);
	ЭЦП_ЗаменитьНедопустимыеСимволы(ИмяПодписанта);
	ЭЦП_ЗаменитьНедопустимыеСимволы(ОтчествоПодписанта);
	ЭЦП_ЗаменитьНедопустимыеСимволы(ОтпечатокСертификата);
	ЭЦП_ЗаменитьНедопустимыеСимволы(ИмяСертификата);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("КомуВыдан"              , КомуВыдан);
	СтруктураДанных.Вставить("КемВыдан"               , КемВыдан);
	СтруктураДанных.Вставить("ДействителенДо"         , ДействителенДо);
	СтруктураДанных.Вставить("ИНН"                    , ИНН_Строка);	
	СтруктураДанных.Вставить("ДолжностьПодписанта"     , ДолжностьПодписанта);
	СтруктураДанных.Вставить("ФамилияПодписанта"       , ФамилияПодписанта);
	СтруктураДанных.Вставить("ИмяПодписанта"           , ИмяПодписанта);
	СтруктураДанных.Вставить("ОтчествоПодписанта"      , ОтчествоПодписанта); 
	СтруктураДанных.Вставить("ОтпечатокСертификата"    , ОтпечатокСертификата);   
	СтруктураДанных.Вставить("ИмяСертификата"          , ИмяСертификата);
    
    ИздательСертификата = "";
    Если Сертификат.Издатель.Свойство("O", ИздательСертификата) = Ложь Тогда
        Сертификат.Издатель.Свойство("CN", ИздательСертификата);
    КонецЕсли;
    
    СтруктураДанных.Вставить("ИздательСертификата", ИздательСертификата);	    
    СтруктураДанных.Вставить("АлгоритмПодписи", АлгоритмПодписи);
    СтруктураДанных.Вставить("СертификатЭКОМ", Сертификат);
    СтруктураДанных.Вставить("СертификатОтпечаток", Сертификат.Отпечаток);
    
	Возврат СтруктураДанных;
КонецФункции

Функция ЭЦП_ПолучитьПредставлениеПользователяНаКлиенте(СтруктураПользователя) Экспорт
    
    Представление = "";
    CN = "";
    Если СтруктураПользователя.Свойство("CN", CN) Тогда
        Представление = Представление + CN;
    КонецЕсли;	
    O = "";
    Если СтруктураПользователя.Свойство("O", O) Тогда
        Представление = Представление + ", " + O;
    КонецЕсли;	
    OU = "";
    Если СтруктураПользователя.Свойство("OU", OU) Тогда
        Представление = Представление + ", " + OU;
    КонецЕсли;	
    
    Возврат Представление;
    
КонецФункции

Функция ИдентификаторыАлгоритмовПодписи(ТолькоАлгоритмыОткрытогоКлюча)
	
	ИдентификаторыАлгоритмов = Новый Соответствие;
	
	ИдентификаторыАлгоритмов.Вставить("1.2.643.2.2.20",    ИменаАлгоритмовПодписиГОСТ_34_10_94());
	ИдентификаторыАлгоритмов.Вставить("1.2.643.2.2.19",    ИменаАлгоритмовПодписиГОСТ_34_10_2001());
	ИдентификаторыАлгоритмов.Вставить("1.2.643.7.1.1.1.1", ИменаАлгоритмовПодписиГОСТ_34_10_2012_256());
	ИдентификаторыАлгоритмов.Вставить("1.2.643.7.1.1.1.2", ИменаАлгоритмовПодписиГОСТ_34_10_2012_512());
	ИдентификаторыАлгоритмов.Вставить("1.2.840.113549.1.1.1", ИменаАлгоритмовПодписиRSA_SIGN()); // RSAEncryption.
	
	Если Не ТолькоАлгоритмыОткрытогоКлюча Тогда
		ИдентификаторыАлгоритмов.Вставить("1.2.643.2.2.4",     ИменаАлгоритмовПодписиГОСТ_34_10_94());
		ИдентификаторыАлгоритмов.Вставить("1.2.643.2.2.3",     ИменаАлгоритмовПодписиГОСТ_34_10_2001());
		ИдентификаторыАлгоритмов.Вставить("1.2.643.7.1.1.3.2", ИменаАлгоритмовПодписиГОСТ_34_10_2012_256());
		ИдентификаторыАлгоритмов.Вставить("1.2.643.7.1.1.3.3", ИменаАлгоритмовПодписиГОСТ_34_10_2012_512());
		ИдентификаторыАлгоритмов.Вставить("1.2.840.113549.1.1.2", ИменаАлгоритмовПодписиRSA_SIGN()); // md2WithRSAEncryption.
		ИдентификаторыАлгоритмов.Вставить("1.2.840.113549.1.1.3", ИменаАлгоритмовПодписиRSA_SIGN()); // md4withRSAEncryption.
		ИдентификаторыАлгоритмов.Вставить("1.2.840.113549.1.1.4", ИменаАлгоритмовПодписиRSA_SIGN()); // md5WithRSAEncryption.
		ИдентификаторыАлгоритмов.Вставить("1.2.840.113549.1.1.5", ИменаАлгоритмовПодписиRSA_SIGN()); // sha1WithRSAEncryption.
	КонецЕсли;
	
	Возврат ИдентификаторыАлгоритмов;
	
КонецФункции

Функция ИменаАлгоритмовПодписиRSA_SIGN()
	
	Имена = Новый Массив;
	Имена.Добавить("RSA_SIGN"); 
		
	Возврат Имена;
	
КонецФункции

Функция ИменаАлгоритмовПодписиГОСТ_34_10_94()
	
	Имена = Новый Массив;
	Имена.Добавить("ГОСТ 34.10-94"); // Представление.
	Имена.Добавить("GOST R 34.10-94");
		
	Возврат Имена;
	
КонецФункции

Функция ИменаАлгоритмовПодписиГОСТ_34_10_2001()
	
	Имена = Новый Массив;
	Имена.Добавить("ГОСТ Р 34.10-2001"); // Представление.
	Имена.Добавить("ГОСТ 34.10-2001"); 
	Имена.Добавить("GOST R 34.10-2001");
	Имена.Добавить("ECR3410-CP");
	
	Возврат Имена;
	
КонецФункции

Функция ИменаАлгоритмовПодписиГОСТ_34_10_2012_256()
	
	Имена = Новый Массив;
	Имена.Добавить("ГОСТ Р 34.10-2012 256 бит"); // Представление.
	Имена.Добавить("ГОСТ 34.10-2012 256 бит");    
	Имена.Добавить("GR 34.10-2012 256");
	Имена.Добавить("GOST 34.10-2012 256");
	Имена.Добавить("GOST R 34.10-12 256");
	Имена.Добавить("GOST3410-12-256");
		
	Возврат Имена;
	
КонецФункции

Функция ИменаАлгоритмовПодписиГОСТ_34_10_2012_512()
	
	Имена = Новый Массив;
	Имена.Добавить("ГОСТ Р 34.10-2012 512 бит"); // Представление.
	Имена.Добавить("ГОСТ 34.10-2012 512 бит"); 
	Имена.Добавить("GR 34.10-2012 512");
	Имена.Добавить("GOST 34.10-2012 512");
		
	Возврат Имена;
	
КонецФункции

Функция ПолучитьДанныеОСертификатах()
	
	СписокСертификатов = Новый Соответствие;
	
	Попытка
		OSertificats = Новый COMОбъект("CAdESCOM.Store");
	Исключение
		Сообщить("Объект CAdESCOM.Store не создан: " + ОписаниеОшибки());
		Возврат СписокСертификатов;
	КонецПопытки;
	
	CURRENT_USER_STORE = 2;
	MY_STORE = "My";
	STORE_OPEN_READ_ONLY = 0;
		
	OSertificats.Open(CURRENT_USER_STORE, MY_STORE, STORE_OPEN_READ_ONLY);
	
	Для каждого ТекущийСертификат Из OSertificats.Certificates Цикл
		АлгоритмПодписиСертификата = "";
		ОтпечатокСертификата       = ТекущийСертификат.Thumbprint;
		Попытка
			ОткрытыйКлюч = ТекущийСертификат.PublicKey();
			АлгоритмПодписиСертификата = ОткрытыйКлюч.Algorithm.Value;
		Исключение  // Если что-то не так возвращет
			АлгоритмПодписиСертификата = "ГОСТ Р 34.10-2012 256 бит";          
		КонецПопытки; 
		
		СписокСертификатов.Вставить(ОтпечатокСертификата, АлгоритмПодписиСертификата);
	КонецЦикла;
	
	Возврат СписокСертификатов;
	
КонецФункции 

Функция РезультатGetSignOIDFromCert(ОбъектКомпоненты, СертификатКриптографии, МассивЛогаСобытий)
	
	ИмяСобытия = "Компонента GetSignOIDF";
	Попытка
		OIDАлгоритмаПодписи = ОбъектКомпоненты.GetSignOIDFromCert(СертификатКриптографииBase64(СертификатКриптографии.Выгрузить()));
	Исключение
		ТекстЛогаСобытий = "Ошибка вызова метода GetSignOIDFromCert компоненты XMLDSIG." + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
	КонецПопытки;
	
	Если OIDАлгоритмаПодписи = Неопределено Тогда
		ТекстЛогаСобытий = "Ошибка вызова метода GetSignOIDFromCert компоненты XMLDSIG." + Символы.ПС + ОбъектКомпоненты.GetLastError();
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

	КонецЕсли;
	
	Возврат OIDАлгоритмаПодписи;
	
КонецФункции

Функция РезультатCMSSign(ОбъектКомпоненты, ДанныеДляПодписания, ПараметрыКомпоненты, СертификатКриптографии, ПарольДоступаКЗакрытомуКлючу, МассивЛогаСобытий) Экспорт
	
	ИмяСобытия = "Компонента CMSSign";
	АтрибутSignatureValue = Неопределено;
	Попытка
		АтрибутSignatureValue = ОбъектКомпоненты.CMSSign(
			ДанныеДляПодписания,
			СертификатКриптографииBase64(СертификатКриптографии.Выгрузить()),
			ПарольДоступаКЗакрытомуКлючу,
			ПараметрыКомпоненты.ТипПодписи,
			ПараметрыКомпоненты.Открепленная,
			ПараметрыКомпоненты.ВключениеСертификатовВПодпись);
	Исключение
		ТекстЛогаСобытий = "Ошибка вызова метода CMSSign компоненты XMLDSig." + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(АтрибутSignatureValue) Тогда
		ТекстЛогаСобытий = "Ошибка вызова метода CMSSign компоненты XMLDSig." + Символы.ПС + ОбъектКомпоненты.GetLastError();
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

	КонецЕсли;
	
	Возврат АтрибутSignatureValue;
	
КонецФункции

Функция СертификатКриптографииBase64(ДвоичныеДанныеСертификата)
	
	СтрокаBase64 = Base64Строка(ДвоичныеДанныеСертификата);
	
	Значение = СтрЗаменить(СтрокаBase64, Символы.ВК, "");
	Значение = СтрЗаменить(Значение, Символы.ПС, "");
	
	Возврат Значение;
	
КонецФункции

//*******************************************************
//сервисы для проверки сертификатов

Функция СоздатьТестовыйФайл() Экспорт
    ВременныйКаталог = ПолучитьКаталогВременныхФайлов();
    
    // Создаем файл
    ФайлXMLПолноеИмя = ВременныйКаталог + "test.xml";
    Файл = Новый ЗаписьТекста(ФайлXMLПолноеИмя, КодировкаТекста.ANSI);		
    Файл.ЗаписатьСтроку("Это тестовый файл");
    Файл.Закрыть();
    
    Возврат ФайлXMLПолноеИмя;
КонецФункции //ФайлXMLПолноеИмя() 

//Выдает строкой полный путь до каталога временных файлов типа ("C:\temp\") на сервере т.к. это серверый общий модуль
Функция ПолучитьКаталогВременныхФайлов() Экспорт
	
	РазделительПути = ЭКОМ_Общее_ПолучитьРазделительПутиНаКлиенте();
	
	Результат = "";
    Результат = КаталогВременныхФайлов();
    Если НЕ Прав(Результат, 1) = РазделительПути Тогда
    	Результат = Результат + РазделительПути;
    КонецЕсли;
    
    Возврат Результат;
	
КонецФункции // КаталогВременныхФайлов()

Функция ВерсияПлатформыНаКлиенте() Экспорт
	
	// # Пример: 8.3.11.3034 - 83110 (версия по трем позициям) и до 4 знаков 
    // # Пример: 8.3.5.6565  - 8350 (версия по трем позициям) и до 4 знаков 	
	// # Пример: 8.2.19.4342 - 8219 (версия по трем позициям) и до 4 знаков 
    // # Пример: 8.3.10.4342 - 83100(версия по трем позициям) и до 4 знаков
	// # Пример: 8.3.9.4342  - 8390 (версия по трем позициям) и до 4 знаков
	// # Пример: 8.3.12.4342 - 83120(версия по трем позициям) и до 4 знаков
	// # Пример: 8.3.1.00    - 8310(версия по трем позициям) и до 4 знаков
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ТекущаяВерсия = СистемнаяИнформация.ВерсияПриложения;
	
	Версия  = "";
	Для н = 1  По 3 Цикл
		ПозицияТочки  = Найти(ТекущаяВерсия, ".");
		Символ        = Лев(ТекущаяВерсия , ПозицияТочки - 1);
		ТекущаяВерсия = Сред(ТекущаяВерсия, ПозицияТочки + 1);
		Версия        = Версия + Символ;
	КонецЦикла;
	
	Если СтрДлина(Версия) < 4 
		 ИЛИ (Сред(Версия, 2, 1) = "3" И СтрДлина(Версия) = 4) Тогда
	    Версия = Версия + "0";	
	КонецЕсли;
	
	ВерсияЧисло = ЭКОМ_ПреобразоватьВЧислоОбщегоНазначения(Версия);
	
	Возврат ВерсияЧисло;
	
КонецФункции

Функция ЭКОМ_Общее_ПолучитьРазделительПутиНаКлиенте() Экспорт 
		
	РазделительПути = "";

	Если ВерсияПлатформыНаКлиенте() >= 8330 Тогда
		Выполнить("РазделительПути = ПолучитьРазделительПутиКлиента();");
	Иначе
		
		СистемнаяИнформация = Новый СистемнаяИнформация;	
		ЭтоLinuxКлиент = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 
		ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;
		
		Если ЭтоLinuxКлиент Тогда 
			РазделительПути = "/"; // Linux
		Иначе
			РазделительПути = "\";  // Windows
		КонецЕсли;
		
	КонецЕсли;
			
    Возврат РазделительПути;

КонецФункции

Функция ПроверитьСертификат(ЭКОМ_СправочникСертификат, МассивЛогаСобытий) Экспорт
	СертификатПроверен = Ложь;
	
	ФайлXMLПолноеИмя = СоздатьТестовыйФайл();
	ДвоичныеДанныеФайлаXML = Новый ДвоичныеДанные(ФайлXMLПолноеИмя);
	
	НоваяПодписьДвоичныеДанные = ЭЦП_СформироватьПодписьФайлаОбщегоНазначения(ДвоичныеДанныеФайлаXML, ЭКОМ_СправочникСертификат, МассивЛогаСобытий);
	Если НоваяПодписьДвоичныеДанные = Неопределено Тогда
		ТекстЛогаСобытий = "Подпись не сформирована - проверьте пароль, алгоритм подписи, срок действия сертификата.";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), "Проверка сертификата");
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

	Иначе
		СертификатПроверен = Истина;
	КонецЕсли;
	
	УдалитьФайлы(ФайлXMLПолноеИмя);
    
    Возврат СертификатПроверен;
КонецФункции //ПроверитьСертификат() 

Функция ЭЦП_СформироватьПодписьФайлаОбщегоНазначения(ДвоичныеДанныеФайлаXML, СертификатЭКОМ, МассивЛогаСобытий) Экспорт
	
	ИмяСобытия = "Сформировать подпись на клиенте";
	ДанныеСертификатаЭКОМ = ЭКОМ_ОбщегоНазначения.ПолучитьДанныеСертификатаЭКОМ(СертификатЭКОМ);
	
	МенеджерКриптографии  = ЭЦП_ПолучитьМенеджерКриптографииНаКлиенте(ДанныеСертификатаЭКОМ.АлгоритмПодписи, МассивЛогаСобытий);	
	Если МенеджерКриптографии = Неопределено Тогда
        Возврат Неопределено;
    КонецЕсли;
    
	// Получаем сертификат
	Сертификат = ЭЦП_ПолучитьСертификатПоОтпечатку(МенеджерКриптографии, ДанныеСертификатаЭКОМ, ДанныеСертификатаЭКОМ.УстановленВЛичномХранилище);	
	Если Сертификат = Неопределено Тогда
		ТекстЛогаСобытий = ЭКОМ_ОбщегоНазначения.ОписаниеСертификата(ДанныеСертификатаЭКОМ) + " не найден в настройках [ЭКОМ_Сертификаты] в указанном хранилище сертификатов." + Символы.ПС + "Сертификат не определен (На клиенте)."; 
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);	

		Возврат Неопределено;
	//Docrobot 1.19.1 MOD-1637	
	ИначеЕсли Сертификат.ДатаОкончания < ТекущаяДата() Тогда 
		ТекстЛогаСобытий = "У сертификата " + ЭКОМ_ОбщегоНазначения.ОписаниеСертификата(ДанныеСертификатаЭКОМ) + " истек срок действия.";
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		Возврат Неопределено;
	КонецЕсли;
	
	СертификатПодходит = СертификатПодходит(Сертификат, ДанныеСертификатаЭКОМ, МассивЛогаСобытий);	
	Если НЕ СертификатПодходит Тогда
        Возврат Неопределено;
    КонецЕсли;
			
	МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = ДанныеСертификатаЭКОМ.ПарольСертификата;
	ДатаПодписи = ТекущаяДата();
	
	Попытка
		ДвоичныеДанныеПодписи = МенеджерКриптографии.Подписать(ДвоичныеДанныеФайлаXML, Сертификат);
				
	Исключение
		Если ПустаяСтрока(ДанныеСертификатаЭКОМ.ПарольСертификата) Тогда
			ТекстЛогаСобытий = "Обратите внимание, у Вас в справочнике ЭКОМ_Сертификаты не указан пароль. Неправильный/пустой пароль может быть причиной ошибки подписания."; 
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);	
		КонецЕсли;
		Возврат Неопределено;
	КонецПопытки;
    				  	
	Возврат ДвоичныеДанныеПодписи;
	
КонецФункции

Функция ЭЦП_ПолучитьСертификатПоОтпечатку(МенеджерКриптографии, ДанныеСертификатаЭКОМ, ТолькоВЛичномХранилище) Экспорт
	
	ЗначениеХранилищеСертификатов = Неопределено;
	Если ТолькоВЛичномХранилище Тогда
		ЗначениеХранилищеСертификатов = МенеджерКриптографии.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
	Иначе	
		ЗначениеХранилищеСертификатов = МенеджерКриптографии.ПолучитьХранилищеСертификатов();
	КонецЕсли;
	
	ДвоичныеДанныеОтпечатка = Base64Значение(ДанныеСертификатаЭКОМ.ОтпечатокСертификата);
	Сертификат = ЗначениеХранилищеСертификатов.НайтиПоОтпечатку(ДвоичныеДанныеОтпечатка);
	
	Возврат Сертификат;
    
КонецФункции

Функция СертификатПодходит(СертификатМенеджераКриптографии, ДанныеСертификатаЭКОМ, МассивЛогаСобытий) Экспорт
	
	ЭтотСертификатПодходит = Ложь;
    
    Организация        = ДанныеСертификатаЭКОМ.Организация;
    СубъектСертификата = СертификатМенеджераКриптографии.Субъект;
    
    ИНН_Юл_ИзСертификата = "";
	СубъектСертификата.Свойство("OID1_2_643_100_4", ИНН_Юл_ИзСертификата);
	Если ИНН_Юл_ИзСертификата = Неопределено Тогда
		СубъектСертификата.Свойство("OID1_2_643_3_131_1_1", ИНН_Юл_ИзСертификата);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИНН_Юл_ИзСертификата) Тогда
		
		ИННОрганизации = ЭКОМ_ОбщегоНазначения.ОпределитьИННОрганизации(Организация); 

		ИННСертификатаПодписи = ЭКОМ_ПреобразоватьВЧислоОбщегоНазначения(ИНН_Юл_ИзСертификата);
		ИННОрганизации        = ЭКОМ_ПреобразоватьВЧислоОбщегоНазначения(ИННОрганизации);
		
		ЭтотСертификатПодходит = (ИННОрганизации = ИННСертификатаПодписи);
		
		Если ЭтотСертификатПодходит = Ложь Тогда
			ОрганизацияСертификата = ?(ЗначениеЗаполнено(Организация)
			, "организации [" + Строка(Организация) + "]"
			, "в справочнике ЭКОМ_Сертификаты, не заполнена организация. ИНН по пустой организации"
			);
			
			ТекстЛогаСобытий = "ИНН [" + Формат(ИННОрганизации, "ЧГ=0") + "] " + ОрганизацияСертификата + " отличается от ИНН [" + Формат(ИННСертификатаПодписи, "ЧГ=0") + "] сертификата, указанного для этой организации.";
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), "Проверка сертификата на клиенте");
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);	
		КонецЕсли;
			
	Иначе
		
		ЭтотСертификатПодходит = Истина;
		
	КонецЕсли;
        
    Возврат ЭтотСертификатПодходит;
	
КонецФункции 

Функция ЭКОМ_ПреобразоватьВЧислоОбщегоНазначения(ЧислоСтрока) Экспорт
	
	Если ТипЗнч(ЧислоСтрока) = Тип("Число") Тогда
		Возврат ЧислоСтрока;
	КонецЕсли;
	
	ЧислоСтрокаПреобразование = СокрЛП(Строка(ЧислоСтрока));
	ЧислоСтрокаПреобразование = СтрЗаменить(ЧислоСтрокаПреобразование, " ", "");
	ЧислоСтрокаПреобразование = СтрЗаменить(ЧислоСтрокаПреобразование, Символы.НПП, "");
	
	НомерРазделителяДробнойЧасти = 0;    
	ЧислоСтрокаРезультат         = "";
	КоличествоСимволов           = СтрДлина(ЧислоСтрокаПреобразование);
	Для НомерСимвола = 1 По КоличествоСимволов Цикл
		
		// 0 в кодировке Unicode это 48
		// 9 в кодировке Unicode это 57
		СимволЧисла = Сред(ЧислоСтрокаПреобразование, НомерСимвола, 1);
		Если (КодСимвола(СимволЧисла) >= 48) 
			И (КодСимвола(СимволЧисла) <= 57) Тогда
			ЧислоСтрокаРезультат = ЧислоСтрокаРезультат + СимволЧисла;
			
		ИначеЕсли (НомерСимвола = 1) 
			И ((СимволЧисла = "-") 
			ИЛИ (СимволЧисла = "+" )) Тогда
			ЧислоСтрокаРезультат = ЧислоСтрокаРезультат + СимволЧисла;
			
		ИначеЕсли (СимволЧисла = ",") 
			ИЛИ (СимволЧисла = ".") Тогда
			НомерРазделителяДробнойЧасти = НомерРазделителяДробнойЧасти + 1;
			
			Если НомерРазделителяДробнойЧасти > 1 Тогда
				Прервать;
			КонецЕсли;
			ЧислоСтрокаРезультат = ЧислоСтрокаРезультат + ".";
			
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	ЧислоРезультат = 0;
	
	Если НЕ ЧислоСтрокаРезультат = "" Тогда	
		ЧислоРезультат = Число(ЧислоСтрокаРезультат);
	КонецЕсли;
	
	Возврат ЧислоРезультат;
	
КонецФункции

Функция ПолучитьИмяСохраняемогоФайла(ВерсияОбработки, ИмяТранзакции, ИмяТабличногоПоля) Экспорт
	
	Если ИмяТабличногоПоля = "СтруктураФайлаXMLИсходящие" Тогда
		СоответствиеТипуОперации = ЭКОМ_ОбщегоНазначения.ПолучитьТипыОпераций("ТипТразакций");
		ТипОбмена           = СокрЛП(СоответствиеТипуОперации.Получить(ИмяТранзакции));
	ИначеЕсли ИмяТабличногоПоля = "СтруктураФайлаXMLВходящие" Тогда
		СоответствиеТипуОперации = ЭКОМ_ОбщегоНазначения.ПолучитьТипыОпераций("ТипТразакцийВходящий");
		ТипОбмена           = СокрЛП(СоответствиеТипуОперации.Получить(ИмяТранзакции));
	ИначеЕсли Найти(ИмяТабличногоПоля, "СлужебныйЗапрос") > 0 Тогда
		СоответствиеТипуОперации = ЭКОМ_ОбщегоНазначения.ПолучитьТипыОпераций("Прочие настройки");
		ТипОбмена           = СокрЛП(СоответствиеТипуОперации.Получить(ИмяТранзакции));
	Иначе
		СоответствиеТипуОперации = ЭКОМ_ОбщегоНазначения.ПолучитьТипыОпераций("Документы");
		ТипОбмена           = СокрЛП(СоответствиеТипуОперации.Получить(ИмяТранзакции));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипОбмена) Тогда
	     ТипОбмена = "Общий";
	КонецЕсли;
	
	КраткаяИнформацияОКонфигурации = ЭКОМ_ОбщегоНазначения.ПолучитьКраткуюИнформацияОКонфигурации();	 
    ДатаЗаписи          = Формат(ТекущаяДата(), "ДФ=dd.MM.yy");	
	ИмяФайла            = ИмяТранзакции + "_" + ВерсияОбработки + "_" + ДатаЗаписи + "_" + КраткаяИнформацияОКонфигурации + "_" + ТипОбмена; 
	
	МассивИсключений = Новый Массив;
	МассивИсключений.Добавить(".");
	МассивИсключений.Добавить("(");
	МассивИсключений.Добавить(")");
	МассивИсключений.Добавить("-");
	ИмяФайлаПоУмолчанию = ЗаменитьНеРазрешенныеСимволы(ИмяФайла, МассивИсключений, "_");
	
	Возврат ИмяФайлаПоУмолчанию;
	
КонецФункции

Функция ЗаменитьНеРазрешенныеСимволы(Знач Источник, МассивИсключений, СимволЗамены = "_")
    
    СимволыДляЗамены = Новый Массив;
    СимволыДляЗамены.Добавить(".");
    СимволыДляЗамены.Добавить(",");
    СимволыДляЗамены.Добавить("{");
    СимволыДляЗамены.Добавить("}");
    СимволыДляЗамены.Добавить("<");
    СимволыДляЗамены.Добавить(">");
    СимволыДляЗамены.Добавить("+");
    СимволыДляЗамены.Добавить("$");
    СимволыДляЗамены.Добавить(":");
    СимволыДляЗамены.Добавить("&");
    СимволыДляЗамены.Добавить("(");
    СимволыДляЗамены.Добавить(")");
	
    Результат = Источник;
	Для каждого Символ Из СимволыДляЗамены Цикл
		Если МассивИсключений.Найти(Символ) = Неопределено Тогда
		     Результат = СтрЗаменить(Результат, Символ, СимволЗамены);
		КонецЕсли;  
    КонецЦикла;
    
    Возврат Результат;
	
КонецФункции

Процедура ЭЦП_ЗаменитьНедопустимыеСимволы(Текст) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Текст) Тогда
		Текст = "";
		Возврат;
	КонецЕсли;
	
	#Если НЕ ВебКлиент Тогда	
        Позиция = 1;
        Пока Позиция <> 0 Цикл
            
            Позиция = НайтиНедопустимыеСимволыXML(Текст, Позиция);
            
            Если Позиция <> 0 Тогда
                НоваяСтрока = Лев(Текст, Позиция - 1) + " " + Сред(Текст, Позиция + 1);
                Текст = НоваяСтрока;
            КонецЕсли;	
            
        КонецЦикла;	
    #КонецЕсли
КонецПроцедуры

Функция ЭЦП_ОперацииПроверкиПодписиНаКлиенте(ДвоичныеДанныеBIN, СертификатЭКОМ, МассивЛогаСобытий) Экспорт
	
	ДанныеСертификатаЭКОМ = ЭКОМ_ОбщегоНазначения.ПолучитьДанныеСертификатаЭКОМ(СертификатЭКОМ);
	
	МенеджерКриптографии = ЭЦП_ПолучитьМенеджерКриптографииНаКлиенте(ДанныеСертификатаЭКОМ.АлгоритмПодписи, МассивЛогаСобытий);
	Если МенеджерКриптографии = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяФайлаBIN = ПолучитьИмяВременногоФайла("bin");
	ДвоичныеДанныеBIN.Записать(ИмяФайлаBIN);
	
	ПодписьBIN = Новый ТекстовыйДокумент;
	ПодписьBIN.Прочитать(ИмяФайлаBIN);
    СтрокаBase64 = ПодписьBIN.ПолучитьТекст();
	СтрокаBase64 = СтрЗаменить(СтрокаBase64, Символы.ПС, "");
	СтрокаBase64 = СтрЗаменить(СтрокаBase64, Символы.ВК, "");
	
	ИмяФайлаSGN = ПолучитьИмяВременногоФайла("sgn");
	ДвоичныеДанныеSGN = Base64Значение(СтрокаBase64);
	Если ДвоичныеДанныеSGN = Неопределено Тогда
	     ДвоичныеДанныеBIN.Записать(ИмяФайлаSGN);
	Иначе	
	     ДвоичныеДанныеSGN.Записать(ИмяФайлаSGN);
	КонецЕсли;
	
	СертификатСовпадает = Ложь;
	
	МассивДанных = МенеджерКриптографии.ПолучитьСертификатыИзПодписи(ИмяФайлаSGN);		
	Для каждого Эл Из МассивДанных Цикл
		Если Base64Строка(Эл.Отпечаток) = ДанныеСертификатаЭКОМ.ОтпечатокСертификата Тогда
			СертификатСовпадает = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат СертификатСовпадает;
	
КонецФункции

// Возвращает стандартную структуру сообщения об ошибке
Функция ПолучитьСтруктуруЛогаНаКлиенте() Экспорт
	Структура = Новый Структура;
	// Флаг ставиться в значение "Истина" если в ходе выполнения операции произошла ошибка. 
	//Если после выполнения команды в флаг сброшен, операция считается успешно выполненой
	Структура.Вставить("БлокировкаОперации" , Ложь);
	Структура.Вставить("ЕстьОшибка"         , Ложь); 
	Структура.Вставить("ТекстОшибки"        , "");
	Возврат Структура;
КонецФункции

// Возвращает стандартную структуру сообщения об ошибке
Функция ЗаписьСтруктурыЛогаНаКлиенте()
	Структура = Новый Структура;	
	Структура.Вставить("УровеньЛогирования" , "");
	Структура.Вставить("ИмяСобытия"         , "");
	Структура.Вставить("Комментарий"        , "");
	Структура.Вставить("НачалоВыполнения"   , Дата(0001, 01, 01));

	Возврат Структура;
КонецФункции

Функция ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, УровеньЛогирования, ИмяСобытия) Экспорт		
	ЗаписьСтруктурыЛога = ЗаписьСтруктурыЛогаНаКлиенте();
	ЗаписьСтруктурыЛога.Комментарий        = ТекстЛогаСобытий;
	ЗаписьСтруктурыЛога.УровеньЛогирования = УровеньЛогирования;
	ЗаписьСтруктурыЛога.ИмяСобытия         = ИмяСобытия;
	ЗаписьСтруктурыЛога.НачалоВыполнения   = ТекущаяДата();
	
	Возврат ЗаписьСтруктурыЛога;
	
КонецФункции

// Функция преобразовывает имя реквизита (колонки табличной части) в его представление (текст шапки табличной части)
//
// Параметры:
//  ИмяРеквизита  - Строка - имя реквизита, используемое в коде
//
// Возможные проблемы:
//	Функция не понимает аббревиатуры, состоящие из нескольких заглавных букв. Для нее это будут отдельные слова.
//	По условиям функция возвращает строку с первой заглавной буквой, остальные прописные.
//
// Возвращаемое значение:
//   Строка   - представление реквизита для пользователя (с пробелами)
//
Функция ТекстШапкиИзДанных(Знач ИмяРеквизита) Экспорт

	ИмяРеквизита 			= СтрЗаменить(ИмяРеквизита, "_", " ");
	
	Если Найти(ИмяРеквизита, " ") = 0 Тогда
		
		ПозицииБудущихПробелов 	= Новый Массив;
		
		// Поиск позиции для вставки пробелов.
		Для Позиция = 1 По СтрДлина(ИмяРеквизита) Цикл
			Символ 	= Сред(ИмяРеквизита, Позиция, 1);
			Если НЕ Позиция = 1 И ВРег(Символ) = Символ Тогда
				ПозицииБудущихПробелов.Добавить(Позиция);
			КонецЕсли;
		КонецЦикла;
		
		// Вставка пробелов.
		Для Вычитаемое = 0 По ПозицииБудущихПробелов.ВГраница() Цикл
			Индекс 	= ПозицииБудущихПробелов.ВГраница() - Вычитаемое;
			Позиция = ПозицииБудущихПробелов.Получить(Индекс);
			
			ИмяРеквизита = Лев(ИмяРеквизита, Позиция - 1) + " " + Прав(ИмяРеквизита, СтрДлина(ИмяРеквизита) - Позиция + 1); 
		КонецЦикла;
		
		ИмяРеквизита = СокрЛП(ИмяРеквизита);
		ИмяРеквизита = Лев(ИмяРеквизита, 1) + НРег(Прав(ИмяРеквизита, СтрДлина(ИмяРеквизита) - 1));
		
	КонецЕсли;
	
	Возврат ИмяРеквизита;
	
КонецФункции // ТекстШапкиИзДанных()

// Преобразует массив лога в строковое значение 
// МассивЛогаСобытий - Массив
Функция ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий, ТекстСообщения = "") Экспорт
    
  	Для каждого Запись Из МассивЛогаСобытий Цикл
		Если ЗначениеЗаполнено(Запись.Комментарий) Тогда
			ТекстСообщения = ТекстСообщения + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "") + Запись.Комментарий;
		КонецЕсли;		
	КонецЦикла;

	Возврат ТекстСообщения;
	
КонецФункции

Функция ЭКОМ_ПолучитьРазделительПутиОСКлиента() Экспорт
	
	// По умолчнию Windows
	РазделительПути = "\";
	Диск            = "C:\";
	ОС              = "Windows";
	
	СистемнаяИнформация = Новый СистемнаяИнформация;	
	ЭтоLinuxКлиент = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;		
	Если ЭтоLinuxКлиент Тогда
		РазделительПути = "/";
		Диск = "/home/";
		ОС   = "Linux";
	КонецЕсли;

	РазделительПути = ЭКОМ_Общее_ПолучитьРазделительПутиНаКлиенте();
	Если ВерсияПлатформыНаКлиенте() >= 8310 Тогда	
		Выполнить("Диск = КаталогДокументов();");
	КонецЕсли;
		
	Данные = Новый Соответствие;
	Данные.Вставить("РазделительПути", РазделительПути);
	Данные.Вставить("Диск"           , Диск);
	Данные.Вставить("ОС"             , ОС);
	Данные.Вставить("РазделительПутиWindows", "\");
	Данные.Вставить("РазделительПутиLinux"  , "/");
	
    Возврат Данные;

КонецФункции

Функция ОпределитьКаталогПоУмолчанию(Диск, РазделительПути) Экспорт
	
	РабочийКаталогПоУмолчанию = "Диск_EDI_ECOM@";
			
	ПутьКаталога = СтрЗаменить(РабочийКаталогПоУмолчанию, "@", РазделительПути);
	ПутьКаталога = СтрЗаменить(ПутьКаталога, "Диск_", Диск);
	
	 Если НЕ Прав(ПутьКаталога, 1) = РазделительПути Тогда
        Возврат ПутьКаталога + РазделительПути;
    Иначе
        Возврат ПутьКаталога;
	КонецЕсли;
	
    Возврат ПутьКаталога;

КонецФункции

Процедура ПроверитьЛокальныйКаталог(ЛокальныйКаталог, РазделительПути) Экспорт
	
	// Проверка каталога
	Если НЕ Прав(ЛокальныйКаталог, 1) = РазделительПути Тогда	
		ЛокальныйКаталог = ЛокальныйКаталог + РазделительПути; 
	КонецЕсли;
	
КонецПроцедуры

Функция ЭКОМ_СоздатьКаталогПроверитьНаЗапись(ПолныйПутьКаталога, МассивЛогаСобытий) Экспорт
	
	ИмяСобытия = "Проверка каталога на запись на клиенте";
	Каталог = Неопределено;
	Если ЗначениеЗаполнено(ПолныйПутьКаталога) 
		 И ТипЗнч(ПолныйПутьКаталога) = Тип("Строка") Тогда

		 // Создаем каталог 
		 Каталог = Новый Файл(ПолныйПутьКаталога);
		 Если НЕ Каталог.Существует() Тогда
			 Попытка
				 СоздатьКаталог(ПолныйПутьКаталога);
				 Каталог = Новый Файл(ПолныйПутьКаталога);
			 Исключение
				 ТекстЛогаСобытий = "Каталог, указанный в настройках модуля отсутствует. 
				 |Ошибка создания каталога по настройке [" + ПолныйПутьКаталога + "] Текст ошибки платформы: " + ОписаниеОшибки();
				 ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
				 МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);	

				 Возврат Неопределено;
				 
			 КонецПопытки;
			 
		 КонецЕсли;
		 
		 // Проверка на запись
		 Если Не КаталогДоступенНаЗапись(ПолныйПутьКаталога, МассивЛогаСобытий) Тогда
			 Возврат Неопределено;
		 КонецЕсли;		 
		 
	КонецЕсли;

    Возврат Каталог;

КонецФункции

Функция КаталогДоступенНаЗапись(ПолныйПутьКаталога, МассивЛогаСобытий) Экспорт
	
	ИмяСобытия = "Проверка каталога на запись на клиенте";
	Результат = Ложь;
	
	Попытка
		Текст = Новый ЗаписьТекста(ПолныйПутьКаталога + "ТестНаЗапись.txt", КодировкаТекста.ANSI);    
		Текст.ЗаписатьСтроку("Проверка на запись файлов!");
		Текст.Закрыть();
		
		Результат = Истина;
		
		Попытка
			ФайлПроверкиЗаписи = Новый Файл(ПолныйПутьКаталога + "ТестНаЗапись.txt");
			Если ФайлПроверкиЗаписи.Существует() Тогда
				УдалитьФайлы(ФайлПроверкиЗаписи.ПолноеИмя);
			КонецЕсли;
		Исключение
			ТекстЛогаСобытий = "Нет прав на удаление файлов. Текст ошибки платформы: " + ОписаниеОшибки();
			ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
			МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);			
		КонецПопытки;			 
		
	Исключение
		ТекстЛогаСобытий = "Нет прав на запись файлов. Текст ошибки платформы: " + ОписаниеОшибки();
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);			
	КонецПопытки; 	
	
	Возврат Результат;

КонецФункции


Процедура ОтправитьДокументыНаКлиенте(МассивЛогаСобытий, ВидДокумента, ДокументДляОтправки) Экспорт	              
	
	ИмяСобытия = "Отправить документы на клиенте";
	НачалоВыполнения = ТекущаяДата();
	СоответсвиеСтатусов = Новый Соответствие;
	КлючиСтруктуры = "Статус, НужнаПодпись";
	// Поставщик
	СоответсвиеСтатусов.Вставить("RETORD"       , Новый Структура(КлючиСтруктуры, "Статус_RETORD", Ложь)); // обратный заказ
	СоответсвиеСтатусов.Вставить("ORDRSP"       , Новый Структура(КлючиСтруктуры, "Статус_ORDRSP", Ложь));
	СоответсвиеСтатусов.Вставить("DESADV"       , Новый Структура(КлючиСтруктуры, "Статус_DESADV", Ложь));
	СоответсвиеСтатусов.Вставить("DESSCC"       , Новый Структура(КлючиСтруктуры, "Статус_DESSCC", Ложь));
	СоответсвиеСтатусов.Вставить("RETINS"       , Новый Структура(КлючиСтруктуры, "Статус_RETINS", Ложь)); // инструкция о возврате
	СоответсвиеСтатусов.Вставить("INVOICE"      , Новый Структура(КлючиСтруктуры, "Статус_INVOICE", Ложь));
	СоответсвиеСтатусов.Вставить("ON_SCHFDOPPR" , Новый Структура(КлючиСтруктуры, "Статус_УПД", Истина));
	СоответсвиеСтатусов.Вставить("ON_NSCHFDOPPR", Новый Структура(КлючиСтруктуры, "Статус_УПД", Истина));
	
	// Покупатель
	СоответсвиеСтатусов.Вставить("ORDER" , Новый Структура(КлючиСтруктуры,"Статус_ORDER", Ложь));
	СоответсвиеСтатусов.Вставить("RECADV", Новый Структура(КлючиСтруктуры,"Статус_RECADV", Ложь));
	СоответсвиеСтатусов.Вставить("RETANN", Новый Структура(КлючиСтруктуры,"Статус_RETANN", Ложь)); // уведомление о возврате
	СоответсвиеСтатусов.Вставить("STATUS", Новый Структура(КлючиСтруктуры,"Статус_STATUS", Ложь)); // служебный документ
	
	// Аннулирование
	СоответсвиеСтатусов.Вставить("DP_PRANNUL"   , Новый Структура(КлючиСтруктуры,"Статус_УПД", Истина));
	СоответсвиеСтатусов.Вставить("DP_IZVPOL_23" , Новый Структура(КлючиСтруктуры,"Статус_УПД", Истина)); // подтверждение аннулирования
	СоответсвиеСтатусов.Вставить("DP_UVUTOCH_24", Новый Структура(КлючиСтруктуры,"Статус_УПД", Истина)); // отклонение аннулирования
	
	// ЭТРН
	// Отправитель
	СоответсвиеСтатусов.Вставить("WHGOV_01", Новый Структура(КлючиСтруктуры,"Статус_WHGOV_01", Ложь));
	СоответсвиеСтатусов.Вставить("WHGOU_04", Новый Структура(КлючиСтруктуры,"Статус_WHGOU_04", Истина));	
	// Получатель
	СоответсвиеСтатусов.Вставить("WHGPV_05", Новый Структура(КлючиСтруктуры,"Статус_WHGPV_05", Ложь));
	СоответсвиеСтатусов.Вставить("WHGPU_08", Новый Структура(КлючиСтруктуры,"Статус_WHGPU_08", Истина));
	
	// Прочие
	СоответсвиеСтатусов.Вставить("CONDRA"          , Новый Структура(КлючиСтруктуры,"Статус", Истина));
	СоответсвиеСтатусов.Вставить("CONDRA_ПРИНЯТЬ"  , Новый Структура(КлючиСтруктуры,"Статус", Истина));
	СоответсвиеСтатусов.Вставить("CONDRA_ОТКЛОНИТЬ", Новый Структура(КлючиСтруктуры,"Статус", Истина));
	СоответсвиеСтатусов.Вставить("CONDRA_ОТПРАВИТЬ"  , Новый Структура(КлючиСтруктуры,"Статус", Истина));
	СоответсвиеСтатусов.Вставить("DP_REZRUISP"     , Новый Структура(КлючиСтруктуры,"Статус_УПД", Истина));
	
	ЭКОМ_ПодписыватьПрайсЛист = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_ПодписыватьПрайсЛист", Ложь);
	Если ЭКОМ_ПодписыватьПрайсЛист = Истина Тогда
		СоответсвиеСтатусов.Вставить("PRICAT"          , Новый Структура(КлючиСтруктуры,"СтатусОбработкиДокумента", Истина));   
	Иначе	
		СоответсвиеСтатусов.Вставить("PRICAT"          , Новый Структура(КлючиСтруктуры,"СтатусОбработкиДокумента", Ложь));
	КонецЕсли;
	
	ТипДокумента = СтрЗаменить(ВРег(ВидДокумента), "ИСХОДЯЩИЙ", "");
	ТипДокумента = СокрЛП(ТипДокумента);
	
	ДанныеПоОперации = СоответсвиеСтатусов.Получить(ТипДокумента);
	Если ДанныеПоОперации = Неопределено Тогда
		 Сообщение = Новый СообщениеПользователю;
		 Сообщение.Текст = "Ошибка отправки документа! - имя операции " + ТипДокумента;
		 Сообщение.Сообщить();
	     Возврат;
	КонецЕсли;
	 
	НужнаПодпись = ДанныеПоОперации.НужнаПодпись;
	ИмяСтатуса   = ДанныеПоОперации.Статус;
	Если Найти(ТипДокумента, "ON_SCHFDOPPR") > 0 
		ИЛИ Найти(ТипДокумента, "ON_NSCHFDOPPR") > 0
		ИЛИ Найти(ТипДокумента, "DP_REZRUISP") > 0 Тогда
		
		ИмяСтатуса 		= ИмяСтатуса 	+ "_Исходящий";
				
	ИначеЕсли Найти(ИмяСтатуса, "WHGOV_01") > 0
		ИЛИ Найти(ИмяСтатуса, "WHGOU_04") > 0  
		ИЛИ Найти(ИмяСтатуса, "WHGPV_05") > 0
		ИЛИ Найти(ИмяСтатуса, "WHGPU_08") > 0 Тогда
	
		ТипДокумента = ТипДокумента + "_Исходящий";
		
	ИначеЕсли ТипДокумента = "DP_PRANNUL" Тогда
		
		ТипДокумента = ТипДокумента;                                
				
	КонецЕсли;
	
	
	МассивСтрок = Новый Массив;
	
	ДетальнаяЗапись = Новый Структура;
    ДетальнаяЗапись.Вставить(ТипДокумента, ДокументДляОтправки);
	
	СтрокаМассива = Новый Структура;
	СтрокаМассива.Вставить("ОтправитьПовторно", Истина);
	СтрокаМассива.Вставить("Строка", ДетальнаяЗапись);
	
	МассивСтрок.Добавить(СтрокаМассива);
	
	НомерИсправления = "";
	ЭтоРегламентноеЗадание = Ложь;
	СтруктураЛога = ЭКОМ_ОбщегоНазначения.ПолучитьСтруктуруЛогаНаСервере();
	МассивСтруктур = ЭКОМ_ОбщегоНазначения.ОтправитьВсеФайлы(МассивСтрок, ТипДокумента, МассивЛогаСобытий, НомерИсправления, ЭтоРегламентноеЗадание, НужнаПодпись, СтруктураЛога);
	Если НЕ МассивСтруктур.Количество() = 0 Тогда
		ЛокальныйКаталогOUTBOX       = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_Локальный_Каталог_OUTBOX",,, Истина);
		ЛокальныйКаталогOUTBOX_Архив = ЭКОМ_ОбщегоНазначения.НастройкиПрочитатьНаСервере("ЭКОМ_Локальный_Каталог_OUTBOX_Архив",,,Истина);
		
		ДанныеОС = ЭКОМ_ОбщегоНазначенияКлиент.ЭКОМ_ПолучитьРазделительПутиОСКлиента();
		РазделительПути = ДанныеОС.Получить("РазделительПути");
		
		ЭКОМ_ОбщегоНазначенияКлиент.ПроверитьЛокальныйКаталог(ЛокальныйКаталогOUTBOX, РазделительПути);
		ЭКОМ_ОбщегоНазначенияКлиент.ПроверитьЛокальныйКаталог(ЛокальныйКаталогOUTBOX_Архив, РазделительПути);
		
		КаталогСохранения = ЛокальныйКаталогOUTBOX_Архив + ТипДокумента + РазделительПути + Формат(ТекущаяДата(), "ДФ=yyyyMMdd") + РазделительПути;
		Каталог = ЭКОМ_ОбщегоНазначенияКлиент.ЭКОМ_СоздатьКаталогПроверитьНаЗапись(КаталогСохранения, МассивЛогаСобытий);	
		
		Если НЕ Каталог = Неопределено Тогда		
			МассивОшибочных = Новый Массив;
			Для каждого СтруктураEDI Из МассивСтруктур Цикл
				
				СтруктураEDI.Вставить("Отправлен", Ложь);
				СтруктураEDI.Вставить("Сообщение", "");
				
				// Проверка чтобы вся цепочка была подписана одним сертификатом для поставщика
				Если ТипДокумента = "DP_IZVPOL_04"
					ИЛИ ТипДокумента = "DP_IZVPOL_10"
					ИЛИ ТипДокумента = "DP_PTORG1" Тогда
					
					// Получаю из хранилища двоичные данные		
					Если НЕ ЗначениеЗаполнено(СтруктураEDI.ЭЦПотЮЗД) Тогда
						ТекстЛогаСобытий = "ЭЦП неопрелен для " + СтруктураEDI.ПредставлениеДок;
						ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
						МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
						
						Продолжить;
					КонецЕсли;
					
					Если СтруктураEDI.СертификатНаСервере = Истина Тогда		
						СертификатСовпадает = Вычислить("ЭКОМ_ОбщегоНазначения.ЭЦП_ОперацииПроверкиПодписиНаСервере(СтруктураEDI.ЭЦПотЮЗД, СтруктураEDI.ДанныеСертификатаЭКОМ, МассивЛогаСобытий)");
					Иначе
						СертификатСовпадает = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ЭЦП_ОперацииПроверкиПодписиНаКлиенте(СтруктураEDI.ЭЦПотЮЗД, СтруктураEDI.ДанныеСертификатаЭКОМ, МассивЛогаСобытий)");		
					КонецЕсли;
					
					Если НЕ СертификатСовпадает Тогда
						ТекстЛогаСобытий = "УПД подписан другим сертификатом, " + ТипДокумента + " на " + Строка(СтруктураEDI.ВидДокумента) + " отправлен не будет! (1852) - " + СтруктураEDI.ПредставлениеДок;
						ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
						МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

						Продолжить;
					КонецЕсли;		
					
				КонецЕсли;
				
				// Получем файл 
				ФайлXML = ПолучитьФайлДокументаНаКлиенте(СтруктураEDI.ИмяФайлаXML, СтруктураEDI.СтрокаXML, СтруктураEDI.КодировкаФайла, КаталогСохранения);
				Если НЕ ФайлXML.Существует() Тогда
					Продолжить;
				КонецЕсли; 
				
				Если НужнаПодпись Тогда
					ФайлBINПолноеИмя = КаталогСохранения + ФайлXML.ИмяБезРасширения + ".bin";
					ДвоичныеДанныеФайлаXML = Новый ДвоичныеДанные(ФайлXML.ПолноеИмя);
					
					// Создаем подпись
					Если СтруктураEDI.СертификатНаСервере = Истина Тогда              
						ДвоичныеДанныеФайлаBIN = Вычислить("ЭКОМ_ОбщегоНазначения.ЭЦП_СформироватьПодписьФайлаОбщегоНазначения(ДвоичныеДанныеФайлаXML, СтруктураEDI.ДанныеСертификатаЭКОМ, МассивЛогаСобытий)");								
						ТипПодписи = "на сервере";
						
					Иначе
						
						ДвоичныеДанныеФайлаBIN = Вычислить("ЭКОМ_ОбщегоНазначенияКлиент.ЭЦП_СформироватьПодписьФайлаОбщегоНазначения(ДвоичныеДанныеФайлаXML, СтруктураEDI.ДанныеСертификатаЭКОМ, МассивЛогаСобытий)");								
						ТипПодписи = "на клиенте"; 				
					КонецЕсли;
					
					Если ДвоичныеДанныеФайлаBIN = Неопределено Тогда
						ТекстЛогаСобытий = ТипДокумента + " - Документ не подписан! (" + ТипПодписи + ") - " + ФайлXML.Имя + " // " + СтруктураEDI.Организация;
						ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
						МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

						МассивОшибочных.Добавить(СтруктураEDI);
						Продолжить;
					Иначе
						// Файл подписи необходимо закодировать в Base64
						ФайлПодписи = Новый ЗаписьТекста(ФайлBINПолноеИмя, КодировкаТекста.ANSI);		
						ФайлПодписи.Записать(Base64Строка(ДвоичныеДанныеФайлаBIN));
						ФайлПодписи.Закрыть();
						
					КонецЕсли;
					
					СтруктураEDI.Вставить("ИмяФайлаBIN"           , ФайлXML.ИмяБезРасширения + ".bin");
					СтруктураEDI.Вставить("ДвоичныеДанныеФайлаBIN", ДвоичныеДанныеФайлаBIN);
					
				КонецЕсли;
				
			КонецЦикла;
			
			// Удаляем 
			Для каждого ЭлМассивОшибочных Из МассивОшибочных Цикл
				Для каждого СтруктураEDI Из МассивСтруктур  Цикл
					Если СтруктураEDI.ИмяФайлаXML = ЭлМассивОшибочных.ИмяФайлаXML Тогда
						МассивСтруктур.Удалить(МассивСтруктур.Найти(СтруктураEDI));	
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
			ЭКОМ_ОбщегоНазначения.ОтправитьФайлы(МассивСтруктур, ТипДокумента, МассивЛогаСобытий, ЭтоРегламентноеЗадание, СтруктураЛога); 
			
		КонецЕсли;		
	КонецЕсли;
	
	ВремяОкончания = ТекущаяДата();
	Длительность   = ВремяОкончания - НачалоВыполнения;
	ТекстЛогаСобытий = "Конец отправки документов типа " + "[" + ТипДокумента + "]" + " (длительность: " + Длительность + " сек.)";
	ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Информация"), ИмяСобытия);
	МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

КонецПроцедуры

Функция ПолучитьФайлДокументаНаКлиенте(ИмяФайлаXML, ТекстXML, КодировкаФайла, ВременныйКаталог)
	
	ПолноеИмяФайлаXML = ВременныйКаталог + ИмяФайлаXML;
	Текст = Новый ТекстовыйДокумент; 
	Текст.УстановитьТекст(ТекстXML); 
	Текст.Записать(ПолноеИмяФайлаXML, КодировкаФайла); 
	
	ФайлXML = Новый Файл(ПолноеИмяФайлаXML);
	
	Возврат ФайлXML;			
		
КонецФункции

// Преобразовывает числовое значение в секундах во время в часах, минутах, секундах
//
// Параметры:
//  Значение  - Число - значение в секундах
//
// Возвращаемое значение:
//   Структура   - преобразованное значение (часы, минуты, секунды, строковое представление)
//
Функция СекундыВоВремяНаКлиенте(Значение) Экспорт

	Результат = Новый Структура("Часы, Минуты, Секунды, Строка", 0, 0, 0, "");
	
	Если Значение = 0 Тогда
		Результат.Строка	= "менее одной секунды";
	Иначе
		Результат.Секунды	= Значение % 60;
		Результат.Минуты 	= (Значение - Результат.Секунды)/60;
		Результат.Минуты 	= Результат.Минуты % 60;
		Результат.Часы 		= (Значение - Результат.Секунды - Результат.Минуты * 60) / 3600;
		Результат.Строка	= ?(Результат.Часы = 0, "", Формат(Результат.Часы, "ЧГ=0") + " ч. ")
			+ ?(Результат.Минуты = 0, "", Формат(Результат.Минуты, "ЧГ=0") + " мин. ")
			+ ?(Результат.Секунды = 0, "", Формат(Результат.Секунды, "ЧГ=0") + " сек.");
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции // СекундыВВремя()

// /!Процедура из БСП!/Формирует и выводит сообщение, которое может быть связано с элементом управления формы.
//
// См. ОбщегоНазначения.СообщитьПользователю
//
// Параметры:
//  ТекстСообщенияПользователю - Строка - текст сообщения.
//  КлючДанных - ЛюбаяСсылка - объект или ключ записи информационной базы, к которому это сообщение относится.
//  Поле - Строка - наименование реквизита формы.
//  ПутьКДанным - Строка - путь к данным (путь к реквизиту формы).
//  Отказ - Булево - выходной параметр, всегда устанавливается в значение Истина.
//
// Пример:
//
//  1. Для вывода сообщения у поля управляемой формы, связанного с реквизитом объекта:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "ПолеВРеквизитеФормыОбъект",
//   "Объект");
//
//  Альтернативный вариант использования в форме объекта:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "Объект.ПолеВРеквизитеФормыОбъект");
//
//  2. Для вывода сообщения рядом с полем управляемой формы, связанным с реквизитом формы:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ,
//   "ИмяРеквизитаФормы");
//
//  3. Для вывода сообщения связанного с объектом информационной базы:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), ОбъектИнформационнойБазы, "Ответственный",,Отказ);
//
//  4. Для вывода сообщения по ссылке на объект информационной базы:
//  ОбщегоНазначенияКлиент.СообщитьПользователю(
//   НСтр("ru = 'Сообщение об ошибке.'"), Ссылка, , , Отказ);
//
//  Случаи некорректного использования:
//   1. Передача одновременно параметров КлючДанных и ПутьКДанным.
//   2. Передача в параметре КлючДанных значения типа отличного от допустимого.
//   3. Установка ссылки без установки поля (и/или пути к данным).
//
Процедура СообщитьПользователю(
	Знач ТекстСообщенияПользователю,
	Знач КлючДанных = Неопределено,
	Знач Поле = "",
	Знач ПутьКДанным = "",
	Отказ = Ложь) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Поле  = Поле;
	Сообщение.КлючДанных = КлючДанных;
	
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
	
	Сообщение.Сообщить();
	
	Отказ = Истина;
	
КонецПроцедуры

//Docrobot 1.21.1 MOD-2127 [Подпись Казахстан. Для работы с KalkanCryptCOM]
//ТекстДляПодписи - Base64
Функция ПодписатьТекстKalkanCryptCOM(ТекстДляПодписи, МассивЛогаСобытий) Экспорт
	Перем BASE64ДанныеФайлаBIN; //outSign
	ошибки = "";
	ИмяСобытия = "Сформировать подпись на клиенте";
	
	KC_SIGN_CMS         = 2;
	KC_IN_BASE64         = 16;
	//KC_WITH_TIMESTAMP     = 256;
	KC_OUT_BASE64         = 2048;
	KalkanFlags = KC_SIGN_CMS + KC_IN_BASE64 + KC_OUT_BASE64;  
	
	Попытка
		KalkanCryptCOM = Новый COMОбъект("KalkanCryptCOMLib.KalkanCryptCOM");
	Исключение
		ВызватьИсключение "Не установлен KalkanCryptCOM!";
	КонецПопытки;
	
	KalkanCryptCOM.Init();
	
	ПутьДоСертификата = ЭКОМ_ОбщегоНазначения.Настройка_Параметр_Прочитать("ПутьДоСертификатаПодписи");
	ПарольСертификата = ЭКОМ_ОбщегоНазначения.Настройка_Параметр_Прочитать("ПарольСертификатаПодписи");
	
	УИД = новый УникальныйИдентификатор;
	KalkanCryptCOM.LoadKeyStore(1, ПарольСертификата, ПутьДоСертификата, Строка(УИД));

	//серты = "";
	//колич = 0;
	//
	//KalkanCryptCOM.GetCertAliases(серты, колич);
		
	inData = Base64Строка(ТекстДляПодписи);
	
	alias = Строка(УИД);
	
	Ответ = KalkanCryptCOM.signData(alias, KalkanFlags, inData, BASE64ДанныеФайлаBIN);
	
	KalkanCryptCOM.GetLastError(ошибки);
	
	Если Не ошибки = "" Тогда
		ТекстЛогаСобытий = "Ошибка подписи файла XML" + ошибки;
		ЗаписьСтруктурыЛога = ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), ИмяСобытия);
		МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);
		
		Возврат Неопределено;
	КонецЕсли;
	
	возврат BASE64ДанныеФайлаBIN;
	
КонецФункции
