#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает массив счетов с видами субконто заданными в качестве параметра.
//
// Параметры:
// 	ВидыСубконто - Массив - Массив ссылок или ссылка на вид субконто, по которому необходимо получить счета.
//	ИсключаемыеСсылки - Массив - Массив счетов, которые необходимо исключить.
//
// Возвращаемое значение:
// 	Массив - Массив ссылок ПланСчетовСсылка.Хозрасчетный, поддерживающих субконто заданные параметром функции.
//
Функция СчетаСНаборомСубконто(ВидыСубконто, ИсключаемыеСсылки=Неопределено) Экспорт
	
	ТипПараметра = ТипЗнч(ВидыСубконто);
	НесколькоСубконто = ((ТипПараметра = Тип("Массив")
		Или ТипПараметра = Тип("ФиксированныйМассив")
		Или ТипПараметра = Тип("СписокЗначений"))
			И ВидыСубконто.Количество()>1);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПланСчетовВидыСубконто.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Счета
	|ИЗ
	|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ПланСчетовВидыСубконто
	|ГДЕ
	|	ПланСчетовВидыСубконто.ВидСубконто В(&ВидыСубконто)
	|	И НЕ ПланСчетовВидыСубконто.Ссылка В (&ИсключаемыеСсылки)
	|	И НЕ ПланСчетовВидыСубконто.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СчетаРоссийскойФедерации))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПланСчетовВидыСубконто.Ссылка КАК Ссылка
	|ИЗ
	|	Счета КАК Счета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ПланСчетовВидыСубконто
	|		ПО Счета.Ссылка = ПланСчетовВидыСубконто.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланСчетовВидыСубконто.Ссылка
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ПланСчетовВидыСубконто.Ссылка) = &КоличествоВидовСубконто И
	|	СУММА(ВЫБОР
	|			КОГДА ПланСчетовВидыСубконто.ВидСубконто В (&ВидыСубконто)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) = &КоличествоВидовСубконто";
	
	Запрос.УстановитьПараметр("КоличествоВидовСубконто", ?(НесколькоСубконто, ВидыСубконто.Количество(), 1));
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	Запрос.УстановитьПараметр("ИсключаемыеСсылки", ИсключаемыеСсылки);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Возвращает массив счетов-исключений, настройки которых не редактируются пользователем.
//
// Возвращаемое значение:
//	ФиксированныйМассив - Массив счетов.
//
Функция ПолучитьСчетаИсключения() Экспорт
	
	МассивСчетовИсключений = Новый Массив;
	
	МассивСчетовИсключений.Добавить(ПланыСчетов.Хозрасчетный.ВекселяВыданные); 											// 60.03
	МассивСчетовИсключений.Добавить(ПланыСчетов.Хозрасчетный.ВекселяПолученные); 										// 62.03
	МассивСчетовИсключений.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоИмущественномуЛичномуИДобровольномуСтрахованию);	// 76.01
	МассивСчетовИсключений.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоПричитающимсяДивидендам); 						// 76.03
	МассивСчетовИсключений.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоИмущественномуИЛичномуСтрахованиюВал);      		// 76.21
	МассивСчетовИсключений.Добавить(ПланыСчетов.Хозрасчетный.СпецоснасткаИСпецодеждаВЭксплуатации);                     // 10.11
	МассивСчетовИсключений.Добавить(ПланыСчетов.Хозрасчетный.ДопРасходыМатериалы);										// 10.ДР
	МассивСчетовИсключений.Добавить(ПланыСчетов.Хозрасчетный.ДопРасходыТовары);											// 41.ДР
	
	Возврат Новый ФиксированныйМассив(МассивСчетовИсключений);
	
КонецФункции

// Обработка переименования счета 68.12.
//
Процедура ПереименоватьСчетНалогаУСН() Экспорт

	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда // В подчиненных узлах РИБ не выполняется
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
	
		СчетСсылка = ПланыСчетов.Хозрасчетный.ЕНприУСН;

		РеквизитыСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетСсылка,
			"Код, Наименование, ЗапретитьИспользоватьВПроводках, Забалансовый");
			
		Если НЕ РеквизитыСчета.ЗапретитьИспользоватьВПроводках
			И НЕ РеквизитыСчета.Забалансовый
			И РеквизитыСчета.Код = "68.12"
			И СокрЛП(РеквизитыСчета.Наименование) = НСтр("ru = 'Единый налог при применении упрощенной системы налогообложения'") Тогда

			// Счет не модифицировался пользователем
			// Можно менять наименование
			
			СчетОбъект = СчетСсылка.ПолучитьОбъект();
			СчетОбъект.Наименование = НСтр("ru = 'Налог при упрощенной системе налогообложения'");
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СчетОбъект, Истина);
		
		КонецЕсли;
		
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось установить новое наименование
			|для счета 68.12 ""Единый налог при применении упрощенной системы налогообложения"".
			|
			|%1'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление информационной базы'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// При вводе кода счета с цифровой клавиатуры заменяем запятую на точку
	Если ТипЗнч(Параметры.СтрокаПоиска) = Тип("Строка") Тогда
		Параметры.СтрокаПоиска = СтрЗаменить(Параметры.СтрокаПоиска, ",", ".");
	КонецЕсли;
	
	Если Параметры.Свойство("ВидыСубконто") Тогда
		ОбщегоНазначенияУТВызовСервера.ОбработкаПолученияДанныхВыбораПланСчетовХозрасчетный(ДанныеВыбора, Параметры, СтандартнаяОбработка);
	КонецЕсли;
	
	Если Не Параметры.Отбор.Свойство("Ссылка") Тогда
		// При вводе кода счета запрещаем выбор счетов РФ
		Параметры.Отбор.Вставить("Ссылка", РаботаСПланомСчетовСерверПовтИсп.ПолучитьСписокДоступныхСчетов());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Простой список
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПростойСписок";
	КомандаПечати.Представление = НСтр("ru = 'Простой список'");
	КомандаПечати.ЗаголовокФормы= НСтр("ru = 'План счетов'");
	КомандаПечати.СписокФорм    = "ФормаСписка, ФормаВыбора";
	
	// С подробными описаниями
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СПодробнымиОписаниями";
	КомандаПечати.Представление = НСтр("ru = 'С подробными описаниями'");
	КомандаПечати.ЗаголовокФормы= НСтр("ru = 'План счетов (с подробными описаниями)'");
	КомандаПечати.СписокФорм    = "ФормаСписка, ФормаВыбора";
	
КонецПроцедуры

Функция ПечатьПланаСчетов(ВыводитьОписания = Ложь)
	
	Макет = ПланыСчетов.Хозрасчетный.ПолучитьМакет("Описание");
	
	Шапка  = Макет.ПолучитьОбласть("Шапка");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.Вывести(Шапка);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИспользоватьВалютныйУчет", БухгалтерскийУчетПереопределяемый.ИспользоватьВалютныйУчет());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланСчетов1.Ссылка КАК Ссылка,
	|	КОЛИЧЕСТВО(ПланСчетов2.Ссылка) КАК КоличествоДочерних
	|ПОМЕСТИТЬ ВТ_ГруппыСчетов
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК ПланСчетов1
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный КАК ПланСчетов2
	|		ПО ПланСчетов1.Ссылка = ПланСчетов2.Родитель
	|ГДЕ
	|	ПланСчетов1.ПометкаУдаления = ЛОЖЬ
	|	И НЕ ПланСчетов1.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СчетаРоссийскойФедерации))
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланСчетов1.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПланСчетов1.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПланаСчетов.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ВТ_ГруппыСчетов.КоличествоДочерних > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоГруппа,
	|	ТаблицаПланаСчетов.Код КАК Код,
	|	ТаблицаПланаСчетов.Порядок КАК Порядок,
	|	ТаблицаПланаСчетов.Наименование КАК Наименование,
	|	ТаблицаПланаСчетов.Валютный КАК Валютный,
	|	ТаблицаПланаСчетов.Количественный КАК Количественный,
	|	ТаблицаПланаСчетов.Забалансовый КАК Забалансовый,
	|	ТаблицаПланаСчетов.Вид КАК Вид,
	|	ТаблицаПланаСчетов.ВидыСубконто.(
	|		НомерСтроки КАК НомерСтроки,
	|		ВидСубконто.Наименование КАК Наименование,
	|		ТолькоОбороты КАК ТолькоОбороты
	|	) КАК ВидыСубконто
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК ТаблицаПланаСчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГруппыСчетов КАК ВТ_ГруппыСчетов
	|		ПО ТаблицаПланаСчетов.Ссылка = ВТ_ГруппыСчетов.Ссылка
	|ГДЕ
	|	НЕ ТаблицаПланаСчетов.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СчетаРоссийскойФедерации))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаПланаСчетов.Порядок";
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтоГруппа Тогда
			Строка = Макет.ПолучитьОбласть("Группа");
		Иначе
			Строка = Макет.ПолучитьОбласть("Строка");
		КонецЕсли;
			
		Строка.Параметры.Заполнить(Выборка);
			
		Если Выборка.Вид = ВидСчета.Активный Тогда
			Строка.Параметры.Активность = "А";
		ИначеЕсли Выборка.Вид = ВидСчета.Пассивный Тогда
			Строка.Параметры.Активность = "П";
		Иначе
			Строка.Параметры.Активность = "АП";
		КонецЕсли;
		
		ВидыСубконто = Выборка.ВидыСубконто.Выбрать();
		Пока ВидыСубконто.Следующий() Цикл
			Строка.Параметры["Субконто" + ВидыСубконто.НомерСтроки] = ?(ВидыСубконто.ТолькоОбороты, "(об) ", "") + ВидыСубконто.Наименование;
		КонецЦикла;
			
		ТабДокумент.Вывести(Строка);
		
		Если ВыводитьОписания Тогда
		
			Попытка
				Описание = Макет.ПолучитьОбласть(ПланыСчетов[Выборка.Ссылка.Метаданные().Имя].ПолучитьИмяПредопределенного(Выборка.Ссылка));
				ТабДокумент.Вывести(Описание);
			Исключение
				// Для счета отсутствует описание, не прерывает из-за этого работу.
			    ЗаписьЖурналаРегистрации(НСтр("ru = 'Печать плана счетов ""Хозрасчетный""'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			       УровеньЖурналаРегистрации.Ошибка,,,
			       ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));				
			КонецПопытки;
		
		КонецЕсли;
		
	КонецЦикла;
	
	ТабДокумент.ФиксацияСверху = 2;
	
	Возврат ТабДокумент;
	
КонецФункции

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПростойСписок") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПростойСписок", НСтр("ru = 'Простой список'"), ПечатьПланаСчетов());                                            
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СПодробнымиОписаниями") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СПодробнымиОписаниями", НСтр("ru = 'С подробными описаниями'"), ПечатьПланаСчетов(Истина));                                            
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СчетаУчета.Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК СчетаУчета
	|ГДЕ
	|	СчетаУчета.ИсключитьСуммуБУИзПереоценкиПоПлануСчетов
	|	И НЕ СчетаУчета.ИсключитьСуммуУУИзПереоценкиПоПлануСчетов
	|");
	
	СписокСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, СписокСсылок);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "ПланСчетов.Хозрасчетный";
	МетаданныеОбъекта = Метаданные.ПланыСчетов.Хозрасчетный;
	
	ОбъектыДляОбработки = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
	Пока ОбъектыДляОбработки.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			// Устанавливаем управляемую блокировку, чтобы провести ответственное чтение объекта
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ОбъектыДляОбработки.Ссылка);
			
			Блокировка.Заблокировать();
			
			Объект = ОбъектыДляОбработки.Ссылка.ПолучитьОбъект();
			
			Если Объект = Неопределено Тогда
				ОтменитьТранзакцию();
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ОбъектыДляОбработки.Ссылка);
				Продолжить;
			КонецЕсли;
			
			Объект.ИсключитьСуммуУУИзПереоценкиПоПлануСчетов = Истина;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(Объект);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъекта);
			
			ТекстСообщения = НСтр("ru = 'Не удалось обработать %ИмяОбъекта%: %Ссылка% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяОбъекта%", ПолноеИмяОбъекта);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%",     ОбъектыДляОбработки.Ссылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%",    ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
										УровеньЖурналаРегистрации.Предупреждение,
										МетаданныеОбъекта,
										ОбъектыДляОбработки.Ссылка,
										ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

Процедура ОбновлениеПланаСчетов_ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	ПОДСТРОКА(Хозрасчетный.Код, 1, 4) <> ПОДСТРОКА(Хозрасчетный.КодБыстрогоВыбора, 1, 4)
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|	И НЕ Хозрасчетный.Родитель В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СчетаРоссийскойФедерации))
	|	И НЕ Хозрасчетный.Ссылка = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СчетаРоссийскойФедерации)
	|	И ПОДСТРОКА(Хозрасчетный.Код, 1, 4) <> ""Я""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|	И НЕ Хозрасчетный.Родитель В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СчетаРоссийскойФедерации))
	|	И НЕ Хозрасчетный.Ссылка = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СчетаРоссийскойФедерации)
	|	И ПОДСТРОКА(Хозрасчетный.Код, 1, 4) = ""Я""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	НЕ Хозрасчетный.Родитель В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СчетаРоссийскойФедерации))
	|	И Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендованноеИмущество_),
	|							 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияАрендованногоИмущества_))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	НЕ Хозрасчетный.Родитель В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СчетаРоссийскойФедерации))
	|	И Хозрасчетный.Ссылка В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДополнительноОплаченныйКапитал),
	|							 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КраткосрочныеБиологическиеАктивы),
	|							 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваНаКорреспондентскихСчетах),
	|							 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваОграниченныеВИспользовании),
	|							 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УчетЭлектронныхДенежныхСредств),
	|							 &МассивИзмененныхСчетов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	НЕ Хозрасчетный.Родитель В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СчетаРоссийскойФедерации))
	|	И НЕ Хозрасчетный.Код = Хозрасчетный.Порядок";
	
	МассивИзмененныхСчетов = Новый Массив;
	МакетОбновленияПС = ПланыСчетов.Хозрасчетный.ПолучитьМакет("ПФ_MXL_ИзменяемыеСчета2019");
	СчетаДляОбновления = МакетОбновленияПС.Области.Найти("СписокИзмененныхСчетов");
	
	Если НЕ СчетаДляОбновления = Неопределено Тогда
		
		Для НомерСтр = СчетаДляОбновления.Верх По СчетаДляОбновления.Низ Цикл
			
			ИмяСчета = СокрП(МакетОбновленияПС.Область(НомерСтр, 2).Текст);
			ИзмененныйСчет = ПланыСчетов.Хозрасчетный[ИмяСчета];
			
			МассивИзмененныхСчетов.Добавить(ИзмененныйСчет);
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивИзмененныхСчетов", МассивИзмененныхСчетов); 
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбновлениеПланаСчетов_ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "ПланСчетов.Хозрасчетный";
	
	ОбъектыДляОбработки = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
	МакетОбновленияПС = ПланыСчетов.Хозрасчетный.ПолучитьМакет("ПФ_MXL_ИзменяемыеСчета2019");
	ОбластьИзмененныхСчетов = МакетОбновленияПС.Области.Найти("СписокИзмененныхСчетов");
	
	Пока ОбъектыДляОбработки.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			// Устанавливаем управляемую блокировку, чтобы провести ответственное чтение объекта.
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ОбъектыДляОбработки.Ссылка);
			
			Блокировка.Заблокировать();
			
			Объект = ОбъектыДляОбработки.Ссылка.ПолучитьОбъект();
			
			Если Объект = Неопределено Тогда
				ОтменитьТранзакцию();
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ОбъектыДляОбработки.Ссылка);
				Продолжить;
			КонецЕсли;
			
			ОбъектИзменен = Ложь;
			
			Если Лев(Объект.Код, 1) = "Я" Тогда
				Объект.ЗапретитьИспользоватьВПроводках = Истина;
				Объект.КодБыстрогоВыбора = "";
				ОбъектИзменен = Истина;
			КонецЕсли;
			
			Если НЕ СокрЛП(Объект.КодБыстрогоВыбора) = СокрЛП(СтрЗаменить(Объект.Код, ".", "")) Тогда
				Объект.КодБыстрогоВыбора = СокрЛП(СтрЗаменить(Объект.Код, ".", ""));
				ОбъектИзменен = Истина;
			КонецЕсли;
			
			Если ОбъектыДляОбработки.Ссылка = ПланыСчетов.Хозрасчетный.АрендованноеИмущество_ 
				ИЛИ ОбъектыДляОбработки.Ссылка = ПланыСчетов.Хозрасчетный.АмортизацияАрендованногоИмущества_
				ИЛИ ОбъектыДляОбработки.Ссылка = ПланыСчетов.Хозрасчетный.КраткосрочныеБиологическиеАктивы
				ИЛИ ОбъектыДляОбработки.Ссылка = ПланыСчетов.Хозрасчетный.ДополнительноОплаченныйКапитал Тогда
				Объект.ЗапретитьИспользоватьВПроводках = Истина;
				ОбъектИзменен = Истина;
			КонецЕсли;
			
			Если ОбъектыДляОбработки.Ссылка = ПланыСчетов.Хозрасчетный.АрендованноеИмущество 
				ИЛИ ОбъектыДляОбработки.Ссылка = ПланыСчетов.Хозрасчетный.АмортизацияАрендованногоИмущества Тогда
				Объект.ЗапретитьИспользоватьВПроводках = Ложь;
				ОбъектИзменен = Истина;
			КонецЕсли;
			
			Если НЕ Объект.Порядок = Объект.ПолучитьПорядокКода() Тогда
				Объект.Порядок = Объект.ПолучитьПорядокКода();
				ОбъектИзменен = Истина;                           
			КонецЕсли;
			
			ОбластьИзмененногоСчета = МакетОбновленияПС.НайтиТекст(Объект.ИмяПредопределенныхДанных, , ОбластьИзмененныхСчетов, , Истина);
			Если НЕ ОбластьИзмененногоСчета = Неопределено Тогда
				КодСчета = СокрЛП(МакетОбновленияПС.Область(ОбластьИзмененногоСчета.Верх, 3).Текст);
				Объект.Код = КодСчета;
				Объект.КодБыстрогоВыбора = СокрЛП(СтрЗаменить(КодСчета, ".", ""));
				Объект.Порядок = Объект.ПолучитьПорядокКода();
				Объект.Наименование = СокрЛП(МакетОбновленияПС.Область(ОбластьИзмененногоСчета.Верх, 4).Текст);
				ОбъектИзменен = Истина;
			КонецЕсли;
			
			Субконто      = Объект.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДвиженияДенежныхСредств, "ВидСубконто");
			НетСтатьиДДС = (Субконто = Неопределено);
			ВсегоСубконто = Объект.ВидыСубконто.Количество();
			Если ОбъектыДляОбработки.Ссылка.Родитель = ПланыСчетов.Хозрасчетный.ДенежныеСредства И НЕ ОбъектыДляОбработки.Ссылка = ПланыСчетов.Хозрасчетный.ОценочныйРезервПодУбыткиОтОбесцененияДенежныхСредств 
				И НетСтатьиДДС И ВсегоСубконто < 3 Тогда
				НовыйВид = Объект.ВидыСубконто.Добавить();

				НовыйВид.ВидСубконто    = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДвиженияДенежныхСредств;
				НовыйВид.ТолькоОбороты  = Истина;
				НовыйВид.Суммовой       = Истина;
				НовыйВид.Валютный       = Истина;
				НовыйВид.Количественный = Истина;

				ОбъектИзменен = Истина;
			КонецЕсли;
			
			Если ОбъектИзменен Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(Объект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Объект);
			КонецЕсли;
			
		    ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъекта);
			
			ТекстСообщения = НСтр("ru = 'Не удалось обработать %ИмяОбъекта%: %Ссылка% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяОбъекта%", ПолноеИмяОбъекта);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", ОбъектыДляОбработки.Ссылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
										УровеньЖурналаРегистрации.Предупреждение,
										МетаданныеОбъекта,
										ОбъектыДляОбработки.Ссылка,
										ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;	
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

Процедура ОбновлениеПланаСчетовПоИзмененнымСчетам_ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	НЕ Хозрасчетный.Родитель В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СчетаРоссийскойФедерации))
	|	И Хозрасчетный.Ссылка В (&МассивИзмененныхСчетов)";
	
	МассивИзмененныхСчетов = Новый Массив;
	МакетОбновленияПС = ПланыСчетов.Хозрасчетный.ПолучитьМакет("ПФ_MXL_ИзменяемыеСчета2019");
	СчетаДляОбновления = МакетОбновленияПС.Области.Найти("СписокИзмененныхСчетов");
	
	Если НЕ СчетаДляОбновления = Неопределено Тогда
		
		Для НомерСтр = СчетаДляОбновления.Верх По СчетаДляОбновления.Низ Цикл
			
			ИмяСчета = СокрП(МакетОбновленияПС.Область(НомерСтр, 2).Текст);
			ИзмененныйСчет = ПланыСчетов.Хозрасчетный[ИмяСчета];
			
			МассивИзмененныхСчетов.Добавить(ИзмененныйСчет);
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивИзмененныхСчетов", МассивИзмененныхСчетов); 
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбновлениеПланаСчетовПоИзмененнымСчетам_ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "ПланСчетов.Хозрасчетный";
	
	ОбъектыДляОбработки = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
	МакетОбновленияПС = ПланыСчетов.Хозрасчетный.ПолучитьМакет("ПФ_MXL_ИзменяемыеСчета2019");
	ОбластьИзмененныхСчетов = МакетОбновленияПС.Области.Найти("СписокИзмененныхСчетов");
	
	Пока ОбъектыДляОбработки.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			// Устанавливаем управляемую блокировку, чтобы провести ответственное чтение объекта.
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ОбъектыДляОбработки.Ссылка);
			
			Блокировка.Заблокировать();
			
			Объект = ОбъектыДляОбработки.Ссылка.ПолучитьОбъект();
			
			Если Объект = Неопределено Тогда
				ОтменитьТранзакцию();
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ОбъектыДляОбработки.Ссылка);
				Продолжить;
			КонецЕсли;
			
			ОбъектИзменен = Ложь;
			
			ОбластьИзмененногоСчета = МакетОбновленияПС.НайтиТекст(Объект.ИмяПредопределенныхДанных, , ОбластьИзмененныхСчетов, , Истина);
			Если ОбластьИзмененногоСчета = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			КодСчета = СокрЛП(МакетОбновленияПС.Область(ОбластьИзмененногоСчета.Верх, 3).Текст);
			НаименованиеСчета = СокрЛП(МакетОбновленияПС.Область(ОбластьИзмененногоСчета.Верх, 4).Текст);
			
			Если НЕ КодСчета = СокрЛП(Объект.Код) ИЛИ НЕ НаименованиеСчета = СокрЛП(Объект.Наименование) Тогда
				Объект.Код = КодСчета;
				Объект.КодБыстрогоВыбора = СокрЛП(СтрЗаменить(КодСчета, ".", ""));;
				Объект.Порядок = Объект.ПолучитьПорядокКода();
				Объект.Наименование = НаименованиеСчета;
				ОбъектИзменен = Истина;
			КонецЕсли;
		
			Если ОбъектИзменен Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(Объект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Объект);
			КонецЕсли;
			
		    ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъекта);
			
			ТекстСообщения = НСтр("ru = 'Не удалось обработать %ИмяОбъекта%: %Ссылка% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяОбъекта%", ПолноеИмяОбъекта);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", ОбъектыДляОбработки.Ссылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
										УровеньЖурналаРегистрации.Предупреждение,
										МетаданныеОбъекта,
										ОбъектыДляОбработки.Ссылка,
										ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;	
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

Процедура ЗаполнитьПредопределенныеНастройки() Экспорт
	
	ПС = ПланыСчетов.Хозрасчетный;
	
	ЗначенияРеквизитов = Новый Структура;
	ЗначенияРеквизитов.Вставить("ИсключитьСуммуБУИзПереоценкиПоПлануСчетов", Истина);
	ЗначенияРеквизитов.Вставить("ИсключитьСуммуУУИзПереоценкиПоПлануСчетов", Истина);
	
	УстановитьРеквизитыСчета(ПС.РасчетыПоАвансамВыданнымВал, ЗначенияРеквизитов);
	УстановитьРеквизитыСчета(ПС.РасчетыПоАвансамВыданнымУЕ, ЗначенияРеквизитов);
	УстановитьРеквизитыСчета(ПС.РасчетыПоАвансамПолученнымВал, ЗначенияРеквизитов);
	УстановитьРеквизитыСчета(ПС.РасчетыПоАвансамПолученнымУЕ, ЗначенияРеквизитов);
	
КонецПроцедуры

Процедура УстановитьРеквизитыСчета(Счет, ЗначенияРеквизитов)
	
	ОбъектСчета = Счет.ПолучитьОбъект();
	
	Для каждого КлючИЗначение Из ЗначенияРеквизитов Цикл
		ОбъектСчета[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
	КонецЦикла;
	
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектСчета);
	
КонецПроцедуры

Процедура ЗаменитьУдаленныйСчет68_52() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.ПометкаУдаления
	|	И Хозрасчетный.Код = ""68.52""";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	УдаленныйСчет = Выборка.Ссылка;
	
	СчетОбъект = УдаленныйСчет.ПолучитьОбъект();
	СчетОбъект.Код = "Я68.52";
	СчетОбъект.Наименование = "не используется";
	СчетОбъект.КодБыстрогоВыбора = СокрЛП(СтрЗаменить(СчетОбъект.Код, ".", ""));
	СчетОбъект.ЗапретитьИспользоватьВПроводках = Истина;
	СчетОбъект.Порядок = "Я";
	
	НачатьТранзакцию();
	
	Попытка
		СчетОбъект.ОбменДанными.Загрузка = Истина;
		СчетОбъект.ДополнительныеСвойства.Вставить("РегистрироватьНаУзлахПлановОбменаПриОбновленииИБ", Истина);
		СчетОбъект.Записать();
		СчетОбъект.УстановитьПометкуУдаления(Ложь);
	Исключение
		ОтменитьТранзакцию();
		ШаблонСообщения = НСтр("ru = 'Не удалось обновить реквизиты удаленного счета 68.52
                               |%1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.ПланыСчетов.Хозрасчетный,
			СчетОбъект.Ссылка, 
			ТекстСообщения);
		Возврат;
	КонецПопытки;
	
	Попытка
		НовыйСчет = ПланыСчетов.Хозрасчетный.НДСНалоговогоАгентаПоОтдельнымВидамТоваров;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Счет", УдаленныйСчет);
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Хозрасчетный.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	(Хозрасчетный.СчетДт = &Счет
		|			ИЛИ Хозрасчетный.СчетКт = &Счет)";
		
		Результат = Запрос.Выполнить();
		Рег = РегистрыБухгалтерии.Хозрасчетный;
		
		Проводки = Рег.СоздатьНаборЗаписей();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Исключение
		ОтменитьТранзакцию();
		ШаблонСообщения = НСтр("ru = 'Не удалось обработать изменения счета 68.52
								|%1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
			УровеньЖурналаРегистрации.Ошибка,
			,
			, 
			ТекстСообщения);
		Возврат;
	КонецПопытки;
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Попытка
			ТекДок = ВыборкаДетальныеЗаписи.Регистратор;
			Если ЗначениеЗаполнено(ТекДок) Тогда
				Проводки.Отбор.Регистратор.Значение = ТекДок;
				Проводки.Прочитать();
				
				Для Каждого Проводка ИЗ Проводки Цикл
					Если Проводка.СчетДт = УдаленныйСчет Тогда
						Проводка.СчетДт = НовыйСчет;
					КонецЕсли;
					Если Проводка.СчетКт = УдаленныйСчет Тогда
						Проводка.СчетКт = НовыйСчет;
					КонецЕсли;
				КонецЦикла;
				
				Проводки.ОбменДанными.Загрузка = Истина;
				Проводки.ДополнительныеСвойства.Вставить("РегистрироватьНаУзлахПлановОбменаПриОбновленииИБ", Истина);
				Проводки.Записать();
			КонецЕсли;
		Исключение
			ОтменитьТранзакцию();
			ШаблонСообщения = НСтр("ru = 'Не удалось обновить проводки по документу
									|%1'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
				УровеньЖурналаРегистрации.Ошибка,
				ТекДок.Метаданные(),
				ТекДок, 
				ТекстСообщения);
			Возврат;
		КонецПопытки;
	КонецЦикла;
	
	Попытка
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа
		|ГДЕ
		|	(ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.СчетУчета = &Счет
		|			ИЛИ ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.СчетУчета = &Счет)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка
		|ИЗ
		|	Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа
		|ГДЕ
		|	(СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.СчетУчета = &Счет
		|			ИЛИ СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.СчетУчета = &Счет)";
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Исключение
		ОтменитьТранзакцию();
		ШаблонСообщения = НСтр("ru = 'Не удалось обработать изменения счета 68.52
								|%1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
			УровеньЖурналаРегистрации.Ошибка,
			,
			, 
			ТекстСообщения);
		Возврат;
	КонецПопытки;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Попытка
			ПлатежныйДокумент = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ДанныеИзменены = Ложь;
			Если ПлатежныйДокумент.СчетУчета = УдаленныйСчет Тогда
				ПлатежныйДокумент.СчетУчета = НовыйСчет;
				ДанныеИзменены = Истина;
			КонецЕсли;
			Для Каждого СтрокаРасшифровки ИЗ ПлатежныйДокумент.РасшифровкаПлатежа Цикл
				Если СтрокаРасшифровки.СчетУчета = УдаленныйСчет Тогда
					СтрокаРасшифровки.СчетУчета = НовыйСчет;
					ДанныеИзменены = Истина;
				КонецЕсли;
			КонецЦикла;
			Если ДанныеИзменены Тогда
				ПлатежныйДокумент.ОбменДанными.Загрузка = Истина;
				ПлатежныйДокумент.ДополнительныеСвойства.Вставить("РегистрироватьНаУзлахПлановОбменаПриОбновленииИБ", Истина);
				ПлатежныйДокумент.Записать();
			КонецЕсли;
		Исключение
			ОтменитьТранзакцию();
			ШаблонСообщения = НСтр("ru = 'Не удалось изменить счета учета в документе
									|%1'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
				УровеньЖурналаРегистрации.Ошибка,
				ВыборкаДетальныеЗаписи.Ссылка.Метаданные(),
				ВыборкаДетальныеЗаписи.Ссылка, 
				ТекстСообщения);
			Возврат;
		КонецПопытки;
	
	КонецЦикла;
	
	Попытка
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ШаблонСообщения = НСтр("ru = 'Не удалось обработать изменения счета 68.52
								|%1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
			УровеньЖурналаРегистрации.Ошибка,
			,
			, 
			ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

Процедура ПолучениеСсылокНаНовыйОбъект(СписокЗаменяемыхОбъектов, СписокНовыхОбъектов, Ссылка, ТипСсылки, НоваяСсылка)
	
	// Получение ссылки на новый объект
	ТипСсылки = ТипЗнч(Ссылка.Ссылка);
	ИсходныйОбъект = СписокЗаменяемыхОбъектов.НайтиПоЗначению(Ссылка.Ссылка);
	ИндексОбъектаВСписке = СписокЗаменяемыхОбъектов.Индекс(ИсходныйОбъект);
	НоваяСсылка = СписокНовыхОбъектов[ИндексОбъектаВСписке].Значение;
	
КонецПроцедуры

Процедура ОчиститьНеиспользуемыеСубконто(Объект, Субконто, ЗаменяемаяСсылка, НоваяСсылка, ОбъектИзменен)
	
	ВидыСубконтоДоИзменения = ЗаменяемаяСсылка.ВидыСубконто;
	ВидыСубконтоНовые       = НоваяСсылка.ВидыСубконто;
	
	Для каждого ВидСубконтоИсходный Из ВидыСубконтоДоИзменения Цикл
	
		Если ВидыСубконтоНовые.Найти(ВидСубконтоИсходный.ВидСубконто) = Неопределено Тогда
			Объект[Субконто][ВидСубконтоИсходный.ВидСубконто] = Неопределено;
			ОбъектИзменен = Истина;
		КонецЕсли;
	
	КонецЦикла; 
	
КонецПроцедуры

Процедура ЗаменаСсылкиНаОбъект(Объект, ИмяСвойства, ТипСсылки, ЗаменяемаяСсылка, НоваяСсылка, ОбъектИзменен, ОбъектыПоиска = Неопределено)
	
	Если ТипЗнч(Объект[ИмяСвойства]) = ТипСсылки Тогда
		Если Объект[ИмяСвойства] = ЗаменяемаяСсылка Тогда
			Объект[ИмяСвойства] = НоваяСсылка;
			ОбъектИзменен = Истина;
			Если ОбъектыПоиска <> Неопределено И (Найти(ИмяСвойства, "Счет") <> Неопределено) Тогда
				НаименованиеСубконтоСчетСПрефиксом = СтрЗаменить(ИмяСвойства,"Счет","Субконто1");
				НаименованиеСубконтоСчетУчетаСПрефиксом = СтрЗаменить(ИмяСвойства,"СчетУчета","Субконто1");
				НаименованиеСубконто_БезПрефикса = "Субконто1";
				
				ВидыСубконтоДоИзменения = ЗаменяемаяСсылка.ВидыСубконто;
				ВидыСубконтоНовые       = НоваяСсылка.ВидыСубконто;
				
				КоличествоСубконто_Старых = ЗаменяемаяСсылка.ВидыСубконто.Количество();
				КоличествоСубконто_Новых = НоваяСсылка.ВидыСубконто.Количество();
				МассивЗаполненныхСубконто = Новый Массив;				
				
				//проверим, есть ли субконто с таким именем
				Если ОбъектыПоиска.Найти(НаименованиеСубконто_БезПрефикса) <> Неопределено Тогда
					НаименованиеСубконто = НаименованиеСубконто_БезПрефикса;
				ИначеЕсли ОбъектыПоиска.Найти(НаименованиеСубконтоСчетСПрефиксом) <> Неопределено Тогда
					НаименованиеСубконто = НаименованиеСубконтоСчетСПрефиксом;
				ИначеЕсли ОбъектыПоиска.Найти(НаименованиеСубконтоСчетУчетаСПрефиксом) <> Неопределено Тогда
					НаименованиеСубконто = НаименованиеСубконтоСчетУчетаСПрефиксом;	
				Иначе //если не подошел не один вариант субконто, то их
					НаименованиеСубконто = "";
					Возврат;
				КонецЕсли;
				
				Для Ном = 1 По КоличествоСубконто_Новых Цикл
					СтрокаПоискаНовогоСубконто = ВидыСубконтоДоИзменения.Найти(ВидыСубконтоНовые[Ном-1].ВидСубконто);
					ЗначениеСубконто = Неопределено;
					Если НЕ СтрокаПоискаНовогоСубконто = Неопределено Тогда
						//Записываем значения субконто в новой последовательности в массив
						НайденРеквизитСубконто = НЕ (ОбъектыПоиска.Найти(СтрЗаменить(НаименованиеСубконто, "1", СтрокаПоискаНовогоСубконто.НомерСтроки)) = Неопределено);
						Если НЕ ОбъектыПоиска.Найти(СтрЗаменить(НаименованиеСубконто, "1", СтрокаПоискаНовогоСубконто.НомерСтроки)) = Неопределено Тогда
							ЗначениеСубконто = Объект[СтрЗаменить(НаименованиеСубконто, 1, СтрокаПоискаНовогоСубконто.НомерСтроки)];
					    КонецЕсли;
					КонецЕсли; 
					МассивЗаполненныхСубконто.Добавить(ЗначениеСубконто);
				КонецЦикла; 
				
				МаксКоличествоСубконто = Макс(КоличествоСубконто_Старых, КоличествоСубконто_Новых);
				Пока МассивЗаполненныхСубконто.Количество() < МаксКоличествоСубконто Цикл
					 МассивЗаполненныхСубконто.Добавить(Неопределено);
				КонецЦикла;
				
				//Записываем значения субконто из массива в объект
				Если ЗначениеЗаполнено(НаименованиеСубконто) Тогда
					Для Ном = 1 По МаксКоличествоСубконто Цикл
						Объект[СтрЗаменить(НаименованиеСубконто, "1", Ном)] = МассивЗаполненныхСубконто[Ном-1];
					КонецЦикла;
				КонецЕсли; 	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ЗаменаСсылкиНаОбъект()

Функция СобытиеЖурналаРегистрацииЗаменаСчетов(ОбновлениеИнформационнойБазы = Ложь) Экспорт
	
	Если НЕ ОбновлениеИнформационнойБазы Тогда
		СобытиеЖурналаРегистрации = НСтр("ru = 'Замена ссылок на счета регламентированного учета в данных'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	Иначе
		СобытиеЖурналаРегистрации = НСтр("ru = 'Обновление информационной базы. Замена ссылок на счета'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	КонецЕсли;
	 
	Возврат СобытиеЖурналаРегистрации; 
	
КонецФункции

Процедура ОпределитьЗаменуДанныхПоОрганизацииВСтрокеОбъекта(СтрокаДанных, Организация)
	
	ПолноеИмяОбъектаМД = СтрокаДанных.Метаданные.ПолноеИмя();
	ПозицияТочки = СтрНайти(ПолноеИмяОбъектаМД, ".");
	ИмяКоллекцииОбъектовМД = Лев(ПолноеИмяОбъектаМД, ПозицияТочки - 1);
	ДанныеОбъекта 	  = СтрокаДанных.Данные;
	МетаданныеОбъекта = СтрокаДанных.Метаданные;
	
	Если ИмяКоллекцииОбъектовМД = "Справочник" Тогда
		Если НЕ ДанныеОбъекта.Владелец = Неопределено И ТипЗнч(ДанныеОбъекта.Владелец) = Тип("СправочникСсылка.Организации")
			И ДанныеОбъекта.Владелец = Организация Тогда
			СтрокаДанных.ЗаменаПоОрганизации = Истина;
		ИначеЕсли НЕ МетаданныеОбъекта.Реквизиты.Найти("Организация") = Неопределено
			И ДанныеОбъекта.Организация = Организация Тогда
			СтрокаДанных.ЗаменаПоОрганизации = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяКоллекцииОбъектовМД = "РегистрСведений" Тогда
		Если НЕ МетаданныеОбъекта.Измерения.Найти("Организация") = Неопределено
			И ДанныеОбъекта.Организация = Организация Тогда
			СтрокаДанных.ЗаменаПоОрганизации = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяКоллекцииОбъектовМД = "Документ" Тогда
		Если НЕ МетаданныеОбъекта.Реквизиты.Найти("Организация") = Неопределено
			И ДанныеОбъекта.Организация = Организация Тогда
			СтрокаДанных.ЗаменаПоОрганизации = Истина;
		КонецЕсли;	
		Если НЕ МетаданныеОбъекта.Реквизиты.Найти("ОрганизацияПолучатель") = Неопределено
			И ДанныеОбъекта.ОрганизацияПолучатель = Организация Тогда
			СтрокаДанных.ЗаменаПоОрганизации = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаменитьСчетаПриОбновленииПланаСчетов(СтруктураСчетовДляЗамены, АдресРезультата = Неопределено) Экспорт
	
	Если СтруктураСчетовДляЗамены.Свойство("Параметры") Тогда
		Параметры = СтруктураСчетовДляЗамены.Параметры;
		СобытиеЖурналаРегистрации = СобытиеЖурналаРегистрацииЗаменаСчетов(Истина);
	Иначе
		Параметры = Новый Структура;
		Параметры.Вставить("ОбработкаЗавершена", Ложь);
		СобытиеЖурналаРегистрации = СобытиеЖурналаРегистрацииЗаменаСчетов();
	КонецЕсли;
	
	СписокЗаменяемыхОбъектов = СтруктураСчетовДляЗамены.СписокЗаменяемыхОбъектов;
	СписокНовыхОбъектов		 = СтруктураСчетовДляЗамены.СписокНовыхОбъектов;
	Если СтруктураСчетовДляЗамены.Свойство("Организация") Тогда
		Организация = СтруктураСчетовДляЗамены.Организация;
	Иначе
		Организация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
	МассивИсходныхОбъектов = СписокЗаменяемыхОбъектов.ВыгрузитьЗначения();
	МассивНезамененныхСчетов = Новый Массив;
	Ссылки = НайтиПоСсылкам(МассивИсходныхОбъектов);
	
	Если Ссылки.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Ссылки.Сортировать("Данные Возр");

	ТаблицаОбъектов = Ссылки.СкопироватьКолонки();
	ТаблицаОбъектов.Колонки.Добавить("ЗаменаПоОрганизации", Новый ОписаниеТипов("Булево"));
	
	ТекущийОбъект = Неопределено;
	НовыйОбъект   = Неопределено;
	
	ТребуетсяОбработка = Ложь;

	Для Каждого Ссылка из Ссылки Цикл
		
		// Получение имени коллекции объектов метаданных
		ПолноеИмяОбъектаМД = Ссылка.Метаданные.ПолноеИмя();
		ПозицияТочки = СтрНайти(ПолноеИмяОбъектаМД, ".");
		ИмяКоллекцииОбъектовМД = Лев(ПолноеИмяОбъектаМД, ПозицияТочки - 1);
		
		Если ИмяКоллекцииОбъектовМД <> "Справочник"
			И ИмяКоллекцииОбъектовМД <> "Документ"
			И ИмяКоллекцииОбъектовМД <> "РегистрСведений"
			И ИмяКоллекцииОбъектовМД <> "ПланВидовХарактеристик" Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйОбъект = Ссылка.Данные;
		Если НовыйОбъект <> ТекущийОбъект Тогда
			НоваяСтрока = ТаблицаОбъектов.Добавить();
			НоваяСтрока.Данные = Ссылка.Данные;
			НоваяСтрока.Метаданные = Ссылка.Метаданные;
			СписокСсылокНаСчет = Новый СписокЗначений;
			СписокСсылокНаСчет.Добавить(Ссылка.Ссылка);			
			НоваяСтрока.Ссылка = СписокСсылокНаСчет;
			//заполняем организацию в таблице
			Если ЗначениеЗаполнено(Организация) Тогда
				ОпределитьЗаменуДанныхПоОрганизацииВСтрокеОбъекта(НоваяСтрока, Организация);
			КонецЕсли;
		Иначе // добавляем в список счетов наш счет
			СписокСсылокНаСчет = НоваяСтрока.Ссылка;
			СписокСсылокНаСчет.Добавить(Ссылка.Ссылка);			
		КонецЕсли;
		 	
		ТекущийОбъект = Ссылка.Данные;
		ТребуетсяОбработка = Истина;
		
	КонецЦикла;

	Если НЕ ТребуетсяОбработка Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	КоличествоДокументовВОднойИтерации = 1000;
	
	Счетчик = 0;
	
	УдаляемыеЗаписи = Новый Массив;
	
	Для Каждого Ссылка Из ТаблицаОбъектов Цикл
		
		//Отберем объекты по организации в случае его использования
		Если ЗначениеЗаполнено(Организация) И НЕ Ссылка.ЗаменаПоОрганизации Тогда
			Продолжить;
		КонецЕсли;
		
		// Получение имени коллекции объектов метаданных
		ПолноеИмяОбъектаМД = Ссылка.Метаданные.ПолноеИмя();
		ПозицияТочки = СтрНайти(ПолноеИмяОбъектаМД, ".");
		ИмяКоллекцииОбъектовМД = Лев(ПолноеИмяОбъектаМД, ПозицияТочки - 1);
		
		Если ИмяКоллекцииОбъектовМД <> "Справочник"
			И ИмяКоллекцииОбъектовМД <> "Документ"
			И ИмяКоллекцииОбъектовМД <> "РегистрСведений"
			И ИмяКоллекцииОбъектовМД <> "ПланВидовХарактеристик" Тогда
			Продолжить;
		КонецЕсли;
		
		Если Счетчик >= КоличествоДокументовВОднойИтерации Тогда
			Если ТранзакцияАктивна() Тогда
				Попытка
					ЗафиксироватьТранзакцию();
				Исключение
					ОтменитьТранзакцию();
					Инфо = ИнформацияОбОшибке();
					ЗаписьЖурналаРегистрации(
						СобытиеЖурналаРегистрации,
						УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(Инфо));				
				КонецПопытки;
			КонецЕсли;
			Счетчик = 0;
		КонецЕсли;
		
		НачатьТранзакцию();
		Счетчик = Счетчик + 1;
		
		// Получение ссылки на новый объект
		ТипСсылки   = Неопределено;
		НоваяСсылка = Неопределено;
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъектаМД);
		
		// Обработка независимых регистров сведений
		Если ИмяКоллекцииОбъектовМД = "РегистрСведений" Тогда
			
			Измерения = Ссылка.Метаданные["Измерения"];
			Реквизиты = Ссылка.Метаданные["Реквизиты"];
			Ресурсы   = Ссылка.Метаданные["Ресурсы"];
			
			ОбъектИзмененияВИзмерении = Ложь;
			Для Каждого СсылкаНаСчет Из Ссылка.Ссылка Цикл
				Для Каждого Измерение из Измерения Цикл
					Если Ссылка.Данные[Измерение.Имя] = СсылкаНаСчет.Значение Тогда 
						//отбор по изменяемым полям не построим
						ОбъектИзмененияВИзмерении = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
			Если НЕ ОбъектИзмененияВИзмерении Тогда 
				
				НаборЗаписей = РегистрыСведений[Ссылка.Метаданные.Имя].СоздатьНаборЗаписей(); 
				ОбъектИзменен = Ложь;
				
				Для каждого Измерение из Измерения Цикл
					НаборЗаписей.Отбор[Измерение.Имя].Значение 		= Ссылка.Данные[Измерение.Имя];
					НаборЗаписей.Отбор[Измерение.Имя].Использование = Истина;
					НаборЗаписей.Отбор[Измерение.Имя].ВидСравнения  = ВидСравнения.Равно;
					
					ЭлементБлокировки.УстановитьЗначение(Измерение.Имя, Ссылка.Данные[Измерение.Имя]);
				КонецЦикла;
				
				Если НаборЗаписей.Отбор.Найти("Период") <> Неопределено Тогда 
					НаборЗаписей.Отбор.Период.Значение 		= Ссылка.Данные.Период;
					НаборЗаписей.Отбор.Период.Использование = Истина;
					НаборЗаписей.Отбор.Период.ВидСравнения  = ВидСравнения.Равно;
					
					ЭлементБлокировки.УстановитьЗначение("Период", Ссылка.Данные.Период);
				КонецЕсли;	
	
				НаборЗаписей.Прочитать();
				Если НаборЗаписей.Выбран() Тогда
					
					Блокировка.Заблокировать();
					
					Для каждого ЗаписьРегистра Из НаборЗаписей Цикл
						
						Для Каждого СсылкаНаСчет Из Ссылка.Ссылка Цикл
							ПолучениеСсылокНаНовыйОбъект(СписокЗаменяемыхОбъектов, СписокНовыхОбъектов, СсылкаНаСчет.Значение, ТипСсылки, НоваяСсылка);
							Для каждого Реквизит из Реквизиты Цикл
								ЗаменаСсылкиНаОбъект(ЗаписьРегистра, Реквизит.Имя, ТипСсылки, СсылкаНаСчет.Значение, НоваяСсылка, ОбъектИзменен, Реквизиты);
							КонецЦикла;
						КонецЦикла;
						
						Для Каждого СсылкаНаСчет Из Ссылка.Ссылка Цикл
							ПолучениеСсылокНаНовыйОбъект(СписокЗаменяемыхОбъектов, СписокНовыхОбъектов, СсылкаНаСчет.Значение, ТипСсылки, НоваяСсылка);
							Для каждого Ресурс из Ресурсы Цикл
								ЗаменаСсылкиНаОбъект(ЗаписьРегистра, Ресурс.Имя, ТипСсылки, СсылкаНаСчет.Значение, НоваяСсылка, ОбъектИзменен, Ресурсы);
							КонецЦикла;
						КонецЦикла;
						
					КонецЦикла;
					
					Попытка
						НаборЗаписей.ОбменДанными.Загрузка = Истина;
						НаборЗаписей.Записать();
						
						ЗафиксироватьТранзакцию();
						
						Комментарий = НСтр("ru = 'Обработан объект <%1>.'");
						Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Комментарий, Ссылка.Данные);
						
						ЗаписьЖурналаРегистрации(
							СобытиеЖурналаРегистрации,
							УровеньЖурналаРегистрации.Информация,,, Комментарий);				
					Исключение
						ОтменитьТранзакцию();
						
						Комментарий = НСтр("ru = 'Объект не обработан автоматически: %1 <%2> <%3>.
						                         |	Необходимо вручную заменить значение <%4> на <%5>.'");
						Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							Комментарий, ИмяКоллекцииОбъектовМД, Ссылка.Метаданные.Синоним, Ссылка.Данные, Ссылка.Ссылка, НоваяСсылка);
							
						ЗаписьЖурналаРегистрации(
							СобытиеЖурналаРегистрации,
							УровеньЖурналаРегистрации.Ошибка,,, Комментарий + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));				
					КонецПопытки;
					
				КонецЕсли;
				
			Иначе  // если ОбъектИзмененияВИзмерении 
				
				Объект = РегистрыСведений[Ссылка.Метаданные.Имя].СоздатьМенеджерЗаписи();
				ОбъектИзменен = Ложь;
				
				Объект.Период = Ссылка.Данные.Период;
				
				Для каждого Измерение из Измерения Цикл
					Объект[Измерение.Имя] = Ссылка.Данные[Измерение.Имя];
					
					ЭлементБлокировки.УстановитьЗначение(Измерение.Имя, Ссылка.Данные[Измерение.Имя]);
				КонецЦикла;
				
				Объект.Прочитать();
				
				Если Объект.Выбран() Тогда
					
					Блокировка.Заблокировать();
					
					Для Каждого СсылкаНаСчет Из Ссылка.Ссылка Цикл
						ПолучениеСсылокНаНовыйОбъект(СписокЗаменяемыхОбъектов, СписокНовыхОбъектов, СсылкаНаСчет.Значение, ТипСсылки, НоваяСсылка);
						Для каждого Измерение из Измерения Цикл
							ЗаменаСсылкиНаОбъект(Объект, Измерение.Имя, ТипСсылки, СсылкаНаСчет.Значение, НоваяСсылка, ОбъектИзменен, Измерения);
						КонецЦикла;
					КонецЦикла;
					
					Для Каждого СсылкаНаСчет Из Ссылка.Ссылка Цикл
						ПолучениеСсылокНаНовыйОбъект(СписокЗаменяемыхОбъектов, СписокНовыхОбъектов, СсылкаНаСчет.Значение, ТипСсылки, НоваяСсылка);
						Для каждого Реквизит из Реквизиты Цикл
							ЗаменаСсылкиНаОбъект(Объект, Реквизит.Имя, ТипСсылки, СсылкаНаСчет.Значение, НоваяСсылка, ОбъектИзменен, Реквизиты);
						КонецЦикла;
					КонецЦикла;
					
					Для Каждого СсылкаНаСчет Из Ссылка.Ссылка Цикл
						ПолучениеСсылокНаНовыйОбъект(СписокЗаменяемыхОбъектов, СписокНовыхОбъектов, СсылкаНаСчет.Значение, ТипСсылки, НоваяСсылка);
						Для каждого Ресурс из Ресурсы Цикл
							ЗаменаСсылкиНаОбъект(Объект, Ресурс.Имя, ТипСсылки, СсылкаНаСчет.Значение, НоваяСсылка, ОбъектИзменен, Ресурсы);
						КонецЦикла;
					КонецЦикла;
					
					Попытка
						Объект.Записать();
						
						ЗафиксироватьТранзакцию();
						
						Комментарий = НСтр("ru = 'Обработан объект <%1>.'");
						Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Комментарий, Ссылка.Данные);
						
						ЗаписьЖурналаРегистрации(
							СобытиеЖурналаРегистрации,
							УровеньЖурналаРегистрации.Информация,,, Комментарий);				
					Исключение
						
						ОтменитьТранзакцию();
						
						Комментарий = НСтр("ru = 'Объект не обработан автоматически: %1 <%2> <%3>.
						                         |	Необходимо вручную перевыбрать значение <%4>.'");
						Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							Комментарий, ИмяКоллекцииОбъектовМД, Ссылка.Метаданные.Синоним, Ссылка.Данные, "1422/1422Н");
							
						ЗаписьЖурналаРегистрации(
							СобытиеЖурналаРегистрации,
							УровеньЖурналаРегистрации.Ошибка,,, Комментарий + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));				
					КонецПопытки;
				КонецЕсли;
				
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		Объект = Ссылка.Данные.ПолучитьОбъект();
		ОбъектИзменен = Ложь;
		
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Ссылка.Данные);
		Блокировка.Заблокировать();
		
		СубконтоРеквизит  = Ложь;

		Если ИмяКоллекцииОбъектовМД = "Справочник" ИЛИ ИмяКоллекцииОбъектовМД = "ПланВидовХарактеристик" Тогда
			
			Реквизиты = Ссылка.Метаданные["Реквизиты"];
			
			Для Каждого СсылкаНаСчет Из Ссылка.Ссылка Цикл
				ПолучениеСсылокНаНовыйОбъект(СписокЗаменяемыхОбъектов, СписокНовыхОбъектов, СсылкаНаСчет.Значение, ТипСсылки, НоваяСсылка);
				Для каждого Реквизит из Реквизиты Цикл
					ЗаменаСсылкиНаОбъект(Объект, Реквизит.Имя, ТипСсылки, СсылкаНаСчет.Значение, НоваяСсылка, ОбъектИзменен, Реквизиты);
				КонецЦикла;
			КонецЦикла;
			
			// Обработка табличных частей
			ТабличныеЧасти = Ссылка.Метаданные["ТабличныеЧасти"];
			Для Каждого СсылкаНаСчет Из Ссылка.Ссылка Цикл
				ПолучениеСсылокНаНовыйОбъект(СписокЗаменяемыхОбъектов, СписокНовыхОбъектов, СсылкаНаСчет.Значение, ТипСсылки, НоваяСсылка);
				Для каждого ТабличнаяЧасть из ТабличныеЧасти Цикл
					Реквизиты = ТабличнаяЧасть["Реквизиты"];
					
					ТЧ = Объект[ТабличнаяЧасть.Имя];
					Для каждого СтрокаТЧ из ТЧ Цикл
						Для каждого Реквизит из Реквизиты Цикл
							ЗаменаСсылкиНаОбъект(СтрокаТЧ, Реквизит.Имя, ТипСсылки, СсылкаНаСчет.Значение, НоваяСсылка, ОбъектИзменен, Реквизиты);
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
			
		КонецЕсли;
		
		Если ИмяКоллекцииОбъектовМД = "Документ" Тогда

			Реквизиты = Ссылка.Метаданные["Реквизиты"];
			Для Каждого СсылкаНаСчет Из Ссылка.Ссылка Цикл
				ПолучениеСсылокНаНовыйОбъект(СписокЗаменяемыхОбъектов, СписокНовыхОбъектов, СсылкаНаСчет.Значение, ТипСсылки, НоваяСсылка);
				Для каждого Реквизит из Реквизиты Цикл
					ЗаменаСсылкиНаОбъект(Объект, Реквизит.Имя, ТипСсылки, СсылкаНаСчет.Значение, НоваяСсылка, ОбъектИзменен, Реквизиты);
				КонецЦикла;
			КонецЦикла;
			
			// Обработка табличных частей
			ТабличныеЧасти = Ссылка.Метаданные["ТабличныеЧасти"];
			Для Каждого СсылкаНаСчет Из Ссылка.Ссылка Цикл
				ПолучениеСсылокНаНовыйОбъект(СписокЗаменяемыхОбъектов, СписокНовыхОбъектов, СсылкаНаСчет.Значение, ТипСсылки, НоваяСсылка);
				Для каждого ТабличнаяЧасть из ТабличныеЧасти Цикл
					Реквизиты = ТабличнаяЧасть["Реквизиты"];
					ТЧ = Объект[ТабличнаяЧасть.Имя];
					Для каждого СтрокаТЧ из ТЧ Цикл
						Для каждого Реквизит из Реквизиты Цикл
							ЗаменаСсылкиНаОбъект(СтрокаТЧ, Реквизит.Имя, ТипСсылки, СсылкаНаСчет.Значение, НоваяСсылка, ОбъектИзменен, Реквизиты);
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
			
		КонецЕсли;
		
		// Обработка движений документов
		Если ИмяКоллекцииОбъектовМД = "Документ" Тогда
			
			Реквизиты = Ссылка.Метаданные["Реквизиты"];

			ДвиженияИзменены = Ложь;
			
			Для Каждого Регистр из Ссылка.Метаданные.Движения Цикл
				
				// Получение имени коллекции объектов метаданных
				ПолноеИмяРегистра = Регистр.ПолноеИмя();
				ПозицияТочки = Найти(ПолноеИмяРегистра, ".");
				ИмяКоллекцииРегистров = Лев(ПолноеИмяРегистра, ПозицияТочки - 1);
				
				Если ИмяКоллекцииРегистров = "РегистрНакопления" Тогда
					Менеджер = РегистрыНакопления[Регистр.Имя];
					
				ИначеЕсли ИмяКоллекцииРегистров = "РегистрСведений" Тогда
					Менеджер = РегистрыСведений[Регистр.Имя];
					
				ИначеЕсли ИмяКоллекцииРегистров = "РегистрБухгалтерии" Тогда
					Менеджер = РегистрыБухгалтерии[Регистр.Имя];
					
				Иначе
					Продолжить;
				КонецЕсли;
				
				Измерения = Регистр["Измерения"];
				Реквизиты = Регистр["Реквизиты"];
				Ресурсы   = Регистр["Ресурсы"];
				
				НаборЗаписей = Менеджер.СоздатьНаборЗаписей();
				
				Регистратор = Ссылка.Данные;
				НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Количество() > 0 Тогда
					БлокировкаЗаписей = Новый БлокировкаДанных;
					ЭлементБлокировки = БлокировкаЗаписей.Добавить(ПолноеИмяРегистра + ".НаборЗаписей");
					ЭлементБлокировки.УстановитьЗначение("Регистратор", Ссылка.Данные);
					БлокировкаЗаписей.Заблокировать();
				КонецЕсли;
				
				НаборЗаписейИзменен = Ложь;
				
				Для Каждого СсылкаНаСчет Из Ссылка.Ссылка Цикл
					ПолучениеСсылокНаНовыйОбъект(СписокЗаменяемыхОбъектов, СписокНовыхОбъектов, СсылкаНаСчет.Значение, ТипСсылки, НоваяСсылка);
					
					Для каждого Запись из НаборЗаписей Цикл
						
						Если ИмяКоллекцииРегистров = "РегистрБухгалтерии" И ЗначениеЗаполнено(Организация) И НЕ Запись.Организация = Организация Тогда
							Продолжить;
						КонецЕсли;
						
						Для каждого Измерение из Измерения Цикл
							Если ИмяКоллекцииРегистров = "РегистрБухгалтерии" Тогда
								Балансовый = Измерение.Балансовый;
							Иначе
								Балансовый = Истина;
							КонецЕсли;
							
							Если Балансовый Тогда
								ЗаменаСсылкиНаОбъект(Запись, Измерение.Имя, ТипСсылки, СсылкаНаСчет.Значение, НоваяСсылка, НаборЗаписейИзменен, Измерения);
							Иначе
								ЗаменаСсылкиНаОбъект(Запись, Измерение.Имя+"Дт", ТипСсылки, СсылкаНаСчет.Значение, НоваяСсылка, НаборЗаписейИзменен);
								ЗаменаСсылкиНаОбъект(Запись, Измерение.Имя+"Кт", ТипСсылки, СсылкаНаСчет.Значение, НоваяСсылка, НаборЗаписейИзменен);
							КонецЕсли;
						КонецЦикла;
						
						Для каждого Реквизит из Реквизиты Цикл
							ЗаменаСсылкиНаОбъект(Запись, Реквизит.Имя, ТипСсылки, СсылкаНаСчет.Значение, НоваяСсылка, НаборЗаписейИзменен, Реквизиты);
						КонецЦикла;
						
						Для каждого Ресурс из Ресурсы Цикл
							Если ИмяКоллекцииРегистров = "РегистрБухгалтерии" Тогда
								Балансовый = Ресурс.Балансовый;
							Иначе
								Балансовый = Истина;
							КонецЕсли;
							
							Если Балансовый Тогда
								ЗаменаСсылкиНаОбъект(Запись, Ресурс.Имя, ТипСсылки, СсылкаНаСчет.Значение, НоваяСсылка, НаборЗаписейИзменен, Ресурсы);
							Иначе
								ЗаменаСсылкиНаОбъект(Запись, Ресурс.Имя+"Дт", ТипСсылки, СсылкаНаСчет.Значение, НоваяСсылка, НаборЗаписейИзменен);
								ЗаменаСсылкиНаОбъект(Запись, Ресурс.Имя+"Кт", ТипСсылки, СсылкаНаСчет.Значение, НоваяСсылка, НаборЗаписейИзменен);
							КонецЕсли;
						КонецЦикла;
						
						Если ИмяКоллекцииРегистров = "РегистрБухгалтерии" Тогда
							Если Регистр.Корреспонденция Тогда
								
								ЗаменаСсылкиНаОбъект(Запись, "СчетДт", ТипСсылки, СсылкаНаСчет.Значение, НоваяСсылка, НаборЗаписейИзменен);
								ОчиститьНеиспользуемыеСубконто(Запись, "СубконтоДт", СсылкаНаСчет.Значение, НоваяСсылка, НаборЗаписейИзменен);
								ЗаменаСсылкиНаОбъект(Запись, "СчетКт", ТипСсылки, СсылкаНаСчет.Значение, НоваяСсылка, НаборЗаписейИзменен);
								ОчиститьНеиспользуемыеСубконто(Запись, "СубконтоКт", СсылкаНаСчет.Значение, НоваяСсылка, НаборЗаписейИзменен);
								
							Иначе
								ЗаменаСсылкиНаОбъект(Запись, "Счет", ТипСсылки, СсылкаНаСчет.Значение, НоваяСсылка, НаборЗаписейИзменен);
								ОчиститьНеиспользуемыеСубконто(Запись, "Субконто", СсылкаНаСчет.Значение, НоваяСсылка, НаборЗаписейИзменен);
							КонецЕсли;
							
							Если НаборЗаписейИзменен Тогда
								Если Регистр.Корреспонденция И Запись.СчетДт = НоваяСсылка И Запись.СчетДт.Валютный 
									И НЕ ЗначениеЗаполнено(Запись.ВалютаДт) Тогда
									Запись.ВалютнаяСуммаДт  = Запись.Сумма;
									Запись.ВалютаДт 		= ВалютаРегл;
								ИначеЕсли Регистр.Корреспонденция И Запись.СчетКт = НоваяСсылка И Запись.СчетКт.Валютный 
									И НЕ ЗначениеЗаполнено(Запись.ВалютаКт) Тогда	
									Запись.ВалютнаяСуммаКт  = Запись.Сумма;
									Запись.ВалютаКт 		= ВалютаРегл;
								ИначеЕсли Регистр.Корреспонденция И Запись.СчетДт = НоваяСсылка И НЕ Запись.СчетДт.Валютный 
									И ЗначениеЗаполнено(Запись.ВалютаДт) Тогда
									Запись.ВалютнаяСуммаДт  = 0;
									Запись.ВалютаДт 		= Справочники.Валюты.ПустаяСсылка();
								ИначеЕсли Регистр.Корреспонденция И Запись.СчетКт = НоваяСсылка И НЕ Запись.СчетКт.Валютный 
									И ЗначениеЗаполнено(Запись.ВалютаКт) Тогда	
									Запись.ВалютнаяСуммаКт  = 0;
									Запись.ВалютаКт 		= Справочники.Валюты.ПустаяСсылка();	
								ИначеЕсли НЕ Регистр.Корреспонденция И Запись.Счет = НоваяСсылка И Запись.Счет.Валютный 
									И НЕ ЗначениеЗаполнено(Запись.Валюта) Тогда	
									Запись.ВалютнаяСумма  = Запись.Сумма;
									Запись.Валюта   	  = ВалютаРегл;
								ИначеЕсли НЕ Регистр.Корреспонденция И Запись.Счет = НоваяСсылка И НЕ Запись.Счет.Валютный 
									И ЗначениеЗаполнено(Запись.Валюта) Тогда	
									Запись.ВалютнаяСумма  = 0;
									Запись.Валюта   	  = Справочники.Валюты.ПустаяСсылка();
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла; // Для каждого Запись из НаборЗаписей Цикл
					
				КонецЦикла; // Для Каждого СсылкаНаСчет Из Ссылка.Ссылка Цикл
				
				Если НаборЗаписейИзменен Тогда
							
					Попытка
						НаборЗаписей.ОбменДанными.Загрузка = Истина;
						НаборЗаписей.Записать();
						
						ДвиженияИзменены = Истина;
						
						Комментарий = НСтр("ru = 'Обработаны движения документа <%1> по <%2>'");
						Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Комментарий, Ссылка.Данные, ПолноеИмяРегистра);
						
						ЗаписьЖурналаРегистрации(
							СобытиеЖурналаРегистрации,
							УровеньЖурналаРегистрации.Информация,Ссылка.Метаданные,Ссылка.Данные, Комментарий);				
					Исключение
					
						Комментарий = НСтр("ru = 'Движения документа <%1> по <%2> не обработаны.
						                         |	Необходимо заменить значение <%3> на <%4>.'");
						Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							Комментарий, Ссылка.Данные, ПолноеИмяРегистра, Ссылка.Ссылка);
							
						ЗаписьЖурналаРегистрации(
							СобытиеЖурналаРегистрации,
							УровеньЖурналаРегистрации.Ошибка,Ссылка.Метаданные,Ссылка.Данные, Комментарий + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));				
					КонецПопытки;
							
				КонецЕсли;
				
			КонецЦикла; // Для Каждого Регистр из Ссылка.Метаданные.Движения Цикл
			
		КонецЕсли;
			
		Если ОбъектИзменен Тогда
			Попытка
				Объект.ОбменДанными.Загрузка = Истина;
				Объект.Записать();
				
				Комментарий = НСтр("ru = 'Обработан объект <%1>'");
				Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Комментарий, Ссылка.Данные);
				
				ЗаписьЖурналаРегистрации(
					СобытиеЖурналаРегистрации,
					УровеньЖурналаРегистрации.Информация,Ссылка.Метаданные,Ссылка.Данные, Комментарий);				
				
				ЗафиксироватьТранзакцию();
			Исключение

				Комментарий = НСтр("ru = 'Объект не обработан автоматически: %1 <%2> <%3>.
				                         |	Необходимо вручную перевыбрать счет <%4>.'");
				Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					Комментарий, ИмяКоллекцииОбъектовМД, Ссылка.Метаданные.Синоним, Ссылка.Данные);

				ЗаписьЖурналаРегистрации(
					СобытиеЖурналаРегистрации,
					УровеньЖурналаРегистрации.Ошибка,Ссылка.Метаданные,Ссылка.Данные, Комментарий + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));				
				
				ОтменитьТранзакцию();
			КонецПопытки;
			
		ИначеЕсли ДвиженияИзменены И ТранзакцияАктивна() Тогда
			Попытка
				ЗафиксироватьТранзакцию();
			Исключение
				Инфо = ИнформацияОбОшибке();
				ЗаписьЖурналаРегистрации(
					СобытиеЖурналаРегистрации,
					УровеньЖурналаРегистрации.Ошибка,Ссылка.Метаданные,Ссылка.Данные, ПодробноеПредставлениеОшибки(Инфо));				
				ОтменитьТранзакцию();
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла; // Для Каждого Ссылка Из ТаблицаОбъектов Цикл	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
