&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НачалоЗапуска = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ПодключитьОбработчикОжидания("Запуск", 1, Истина);
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  Форма  - Форма - основная форма клиентского приложения
//  Отказ  - Булево - признак прерывания запуска обработки
//
&НаКлиенте
Процедура Запуск() Экспорт

	ЗадержкаПередЗапуском = 3; // В секундах
	
	Пока ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоЗапуска < ЗадержкаПередЗапуском * 1000 Цикл
		// Пустой цикл
	КонецЦикла;
	
	ОтключитьОбработчикОжидания("Запуск");
	Закрыть();

КонецПроцедуры // ОткрытьОкноОсновнойФормы()



