
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьРеквизитыПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	МассивНепроверяемыхРеквизитов.Добавить("ФизическиеЛица.Контрагент");
	
	НайденныеСтроки = ФизическиеЛица.НайтиСтроки(Новый Структура("ПрочийАкционер, Контрагент", Истина, Справочники.Контрагенты.ПустаяСсылка()));
	
	Для Каждого Строка Из НайденныеСтроки Цикл
		
		ТекстСообщения = НСтр("ru = 'Не заполнен акционер в строке %1 списка ""Физические лица""'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка.НомерСтроки),
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ФизическиеЛица", Строка.НомерСтроки, "Контрагент"),
			,
			Отказ);

	КонецЦикла;
	
	Если ФизическиеЛица.Количество() = 0 И ЮридическиеЛица.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не указаны акционеры в списках получателей дивидендов'"),
			ЭтотОбъект,
			"ФизическиеЛица",
			,
			Отказ);
		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(
		ПроверяемыеРеквизиты,
		МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	СуммаДокумента = ФизическиеЛица.Итог("Начислено") + ЮридическиеЛица.Итог("Начислено");
	ПериодУчетнойПолитики = ?(ЗначениеЗаполнено(Дата), КонецМесяца(Дата), КонецМесяца(ТекущаяДатаСеанса()));
	ПараметрыУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаОрганизаций.ПараметрыУчетнойПолитики(Организация, ПериодУчетнойПолитики);
	Если ПараметрыУчетнойПолитики <> Неопределено Тогда
		ПроводкиПоРаботникам = ПараметрыУчетнойПолитики.ПроводкиПоРаботникам
	КонецЕсли;
	
	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	// ЗУПК
	Если НЕ ЗначениеЗаполнено(ДатаВыплаты)
		ИЛИ ЗначениеЗаполнено(ДатаВыплаты) <> НачалоМесяца(Дата) Тогда
		ДатаВыплаты = НачалоМесяца(Дата);
	КонецЕсли;
	// ЗУПК
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ФизическиеЛица Цикл
		Строка.РегистрацияВНалоговомОргане = Справочники.РегистрацииВНалоговомОргане.РегистрацияВНалоговомОргане(Организация, Дата);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.НачислениеДивидендов.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Движения
	ДоходыИРасходыСервер.ОтразитьПрочиеАктивыПассивы(ДополнительныеСвойства, Движения, Отказ);
	УправленческийУчетПроведениеСервер.ОтразитьДвиженияДоходыРасходыПрочиеАктивыПассивы(ДополнительныеСвойства, Движения, Отказ);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНачислениеЗарплаты") Тогда
		Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
			УчетНДФЛРасширенный.СформироватьДоходыИНДФЛСДивидендов(
				Ссылка,
				Движения,
				Отказ,
				Организация,
				ДатаВыплаты,
				ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДивиденды,
				ВключатьВДекларациюПоНалогуНаПрибыль,
				Истина,
				ДатаВыплаты);
			
			УчетНачисленнойЗарплаты.ПодготовитьДанныеНДФЛКРегистрации(ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДивиденды, Организация, ДатаВыплаты);
			
			УчетНачисленнойЗарплатыРасширенный.ЗарегистрироватьНачисленияУдержанияПоКонтрагентамАкционерам(
				Движения,
				Отказ,
				Организация,
				ДатаВыплаты,
				ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНачисления,
				,
				ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДивиденды);
		Иначе
			ПодготовитьДанныеДляПроведенияРегламентированныхУдержаний(ДополнительныеСвойства.ТаблицыДляДвижений);
			
			УчетНачисленнойЗарплатыРасширенный.ЗарегистрироватьНачисленияУдержанияПоКонтрагентамАкционерам(
				Движения,
				Отказ,
				Организация,
				Дата,
				ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНачисления,
				ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРегламентированныеУдержания);
				
			// Сведения о доходах физических лиц
			УчетНалоговВзносовОтчислений.СформироватьСведенияОДоходахПоНачислениям(Движения, Отказ, Организация, ДополнительныеСвойства.ТаблицыДляДвижений.МенеджерВременныхТаблиц, НачалоМесяца(Дата),, Ложь,"ВТНачисленияДокумента",,,Истина); 
			
			// Сведения о необлагаемых доходах физических лиц
			УчетНалоговВзносовОтчислений.СформироватьСведенияОНеоблагаемыхДоходахПоНачислениям(ДополнительныеСвойства.ТаблицыДляДвижений, Движения, Отказ, Организация,, Ложь); 
			
			// Сведения об исчислении налогов взносов отчислений
			УчетНалоговВзносовОтчислений.СформироватьСведенияОбИсчисленииНалоговВзносовОтчислений(ДополнительныеСвойства.ТаблицыДляДвижений, Движения, Отказ, Организация, НачалоМесяца(Дата), Ложь);
			
			// Налоги, взносы и отчисления - расчеты с бюджетом и фондами
			УчетНалоговВзносовОтчислений.СформироватьНалогиВзносыОтчисленияРасчетыСБюджетом(ДополнительныеСвойства.ТаблицыДляДвижений, Движения, Отказ, Организация, НачалоМесяца(Дата));
	
			УчетНалоговВзносовОтчислений.СформироватьНалогиВзносыРасчетыНалогоплательщиков(ДополнительныеСвойства.ТаблицыДляДвижений, Движения, Отказ, Организация, НачалоМесяца(Дата));
	
			// Сведения об исчислении вычетов ИПН
			УчетНалоговВзносовОтчислений.СформироватьСведенияОбИсчисленииВычетовИПН(ДополнительныеСвойства.ТаблицыДляДвижений, Движения, Отказ, Организация, НачалоМесяца(Дата), Ложь);

		КонецЕсли;
			
	КонецЕсли;
	
	РеглУчетПроведениеСервер.ЗарегистрироватьКОтражению(ЭтотОбъект, ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);
	
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьРеквизитыПоУмолчанию()
	
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию();
	Ответственный = Пользователи.ТекущийПользователь();
	Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	
КонецПроцедуры

Процедура РассчитатьРегламентированныеУдержанияДокумента(СписокФизическихЛиц = Неопределено) Экспорт
	
	НачатьТранзакцию();
	
	Записать(РежимЗаписиДокумента.Запись);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Документы.НачислениеДивидендов.СоздатьВТНачисленияДокумента(Запрос.МенеджерВременныхТаблиц, Ссылка, СписокФизическихЛиц);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеДокумента.ФизическоеЛицо
		|ПОМЕСТИТЬ ВТФизическиеЛица
		|ИЗ
		|	ВТНачисленияДокумента КАК ДанныеДокумента";
	
	Запрос.Выполнить();
	

	ВременнаяСсылка = Документы.НачислениеДивидендов.ПолучитьСсылку();
 	НаборыЗаписей = ЗарплатаКадры.НаборыЗаписейРегистратора(Метаданные.Документы.НачислениеДивидендов, ВременнаяСсылка);
	
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТНачисленияДокумента КАК ВТНачисленияДокумента";
	ТЗ = Запрос.Выполнить().Выгрузить();

	УчетНалоговВзносовОтчислений.СформироватьСведенияОДоходахПоНачислениям(
			НаборыЗаписей, Ложь, Организация, Запрос.МенеджерВременныхТаблиц, Дата, Истина, Ложь, "ВТНачисленияДокумента",,,Истина);
	ЗарплатаКадры.СоздатьВТПоНаборуЗаписей(Запрос.МенеджерВременныхТаблиц, НаборыЗаписей.СведенияОбИсчисленииВычетовИПН,, "ВТ_ВычетыДокументаИсправления");
	ЗарплатаКадры.СоздатьВТПоНаборуЗаписей(Запрос.МенеджерВременныхТаблиц, НаборыЗаписей.СведенияОбИсчисленииНалоговВзносовОтчислений,, "ВТ_СведенияОбИсчисленииНалоговВзносовОтчисленийДокументаИсправления");
	
	УчетНалоговВзносовОтчислений.ПодготовитьДанныеДляРасчетаНалоговВзносов(Организация, Ссылка, Запрос.МенеджерВременныхТаблиц, Дата, Ложь);
	НеоблагаемыеДоходы = УчетНалоговВзносовОтчислений.РассчитатьНеоблагаемыеДоходы(Организация, Ссылка, Запрос.МенеджерВременныхТаблиц, Дата, Ложь);
	
	РезультатРасчетаИПН = УчетНалоговВзносовОтчислений.РезультатРасчетаИПН(Организация, Ссылка, Запрос.МенеджерВременныхТаблиц, Дата, Ложь);
	
	ОтменитьТранзакцию();
	
	ЗаполнитьВычеты = Ложь;
	Если РезультатРасчетаИПН.ВычетыИПН.Колонки.Найти("ИдентификаторСтрокиНалогиВзносыОтчисления") <> Неопределено Тогда
		ЗаполнитьВычеты = Истина;
	КонецЕсли;
	
	// Перенос в документ результатов расчета
	
	ФизическиеЛицаПоКоторымОчищалисьДанные = Новый Соответствие;
	МаксимальныйИдентификатор = УчетНалоговВзносовОтчислений.МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления(НалогиВзносыОтчисления);
	Для Каждого СтрокаРезультатаРасчетаИПН Из РезультатРасчетаИПН.ИПН Цикл
		
		Если ФизическиеЛицаПоКоторымОчищалисьДанные.Получить(СтрокаРезультатаРасчетаИПН.ФизическоеЛицо) = Неопределено Тогда
			УчетНалоговВзносовОтчисленийРасширенный.УдалитьДанныеПоНалогамВзносамОтчислениямФизическоголица(ЭтотОбъект, СтрокаРезультатаРасчетаИПН.ФизическоеЛицо);
			ФизическиеЛицаПоКоторымОчищалисьДанные.Вставить(СтрокаРезультатаРасчетаИПН.ФизическоеЛицо, Истина);
		КонецЕсли; 
		
		МаксимальныйИдентификатор = МаксимальныйИдентификатор + 1;
		
		НоваяСтрокаНалогиВзносыОтчисления = НалогиВзносыОтчисления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаНалогиВзносыОтчисления, СтрокаРезультатаРасчетаИПН);
		НоваяСтрокаНалогиВзносыОтчисления.ИдентификаторСтрокиНалогиВзносыОтчисления = МаксимальныйИдентификатор;
		
		Если НЕ ЗаполнитьВычеты Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиВычетов = РезультатРасчетаИПН.ВычетыИПН.НайтиСтроки(
			Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", СтрокаРезультатаРасчетаИПН.ИдентификаторСтрокиНалогиВзносыОтчисления));
			
		Для Каждого СтрокаВычетов Из СтрокиВычетов Цикл
			НоваяСтрокаВычетов = ВычетыИПН.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаВычетов, СтрокаВычетов);
			НоваяСтрокаВычетов.ИдентификаторСтрокиНалогиВзносыОтчисления = НоваяСтрокаНалогиВзносыОтчисления.ИдентификаторСтрокиНалогиВзносыОтчисления;
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого СтрокаНеоблагаемыеДоходы Из НеоблагаемыеДоходы Цикл
		
		УдаляемыеСтрокиНеоблагаемыеДоходы = ДоходыНеПодлежащиеНалогообложению.НайтиСтроки(Новый Структура("ФизическоеЛицо, ВидНалогаВзносаОтчисления, МесяцНалоговогоПериода", 
																							СтрокаНеоблагаемыеДоходы.ФизическоеЛицо,
																							СтрокаНеоблагаемыеДоходы.ВидНалогаВзносаОтчисления,
																							СтрокаНеоблагаемыеДоходы.МесяцНалоговогоПериода));
																							
		Для Каждого УдаляемаяСтрока Из УдаляемыеСтрокиНеоблагаемыеДоходы Цикл
			ДоходыНеПодлежащиеНалогообложению.Удалить(УдаляемаяСтрока);
		КонецЦикла;
		
		НоваяСтрока = ДоходыНеПодлежащиеНалогообложению.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНеоблагаемыеДоходы);
	КонецЦикла;
	
КонецПроцедуры

Функция ПодготовитьДанныеДляПроведенияРегламентированныхУдержаний(ТаблицыДляДвижений) Экспорт
	
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	//Документы.НачислениеДивидендов.СоздатьВТДанныеДокумента(Запрос.МенеджерВременныхТаблиц, Ссылка);
	//Документы.НачислениеДивидендов.СоздатьВТНачисленияУдержанияДокумента(Запрос.МенеджерВременныхТаблиц, ЭтотОбъект, Организация, Дата);
	Документы.НачислениеДивидендов.СоздатьВТНачисленияДокумента(Запрос.МенеджерВременныхТаблиц, Ссылка);
	
	ТаблицыДляДвижений.Вставить("МенеджерВременныхТаблиц", Запрос.МенеджерВременныхТаблиц);
	
	ТаблицыДляДвижений.Вставить("РегламентированныеУдержания", ТаблицыДляДвижений.ТаблицаРегламентированныеУдержания);
	
	ТаблицыДляДвижений.Вставить("НалогиВзносыОтчисления");
	ТаблицыДляДвижений.Вставить("ДоходыНеПодлежащиеНалогообложению");
	ТаблицыДляДвижений.Вставить("ВычетыИПН");
	УчетНалоговВзносовОтчислений.ЗаполнитьДанныеДляПроведенияПоНалогамВзносамОтчислениям(ТаблицыДляДвижений, Ссылка, "Ссылка.Дата");
	УчетНалоговВзносовОтчислений.ЗаполнитьДанныеДляПроведенияПоДоходамНеПодлежащимНалогообложению(ТаблицыДляДвижений, Ссылка, "Ссылка.Дата");
	УчетНалоговВзносовОтчислений.ЗаполнитьДанныеДляПроведенияСведенияОбИсчисленииВычетовИПН(ТаблицыДляДвижений, Ссылка, "Ссылка.Дата");

	Возврат ТаблицыДляДвижений;
	
КонецФункции

#КонецОбласти

#КонецЕсли