
#Область ПрограммныйИнтерфейс

// Процедура открывает общую форму, показывающую, какие вычеты были применены при расчете ИПН в документе.
//
// Параметры:
//	Объект					- ДанныеФормаСтруктура, основной реквизит формы документа.
//	ИмяДокумента			- Строка, имя документа.
//	Владелец				- УправляемаяФорма, элемент, в который необходимо возвратить результат оповещения.
//	ОписаниеДокумента		- Структура
//	УчитываемыеСотрудники	- СправочникСсылка.Сотрудники
//							- СправочникСсылка.ФизическиеЛица
//							- Массив
//
// Возвращаемое значение
//	Форма при закрытии отправляет оповещение владельцу, с которым передается содержимое ТЧ НалогиВзносыОтчисления по ИПН
//
Процедура ОткрытьФормуРасчетаНалогаВзносаОтчисления(Объект, Владелец, ВидНалогаВзносаОтчисления, ОписаниеДокумента, СотрудникФизическоеЛицо, ТолькоПросмотр = Истина) Экспорт
	
	МесяцНачисления = Объект[ОписаниеДокумента.МесяцНачисленияИмя];
	ВидыНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений." + ВидНалогаВзносаОтчисления);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("Объект", Объект);
	ПараметрыФормы.Вставить("ВидНалогаВзносаОтчисления", ВидыНалогаВзносаОтчисления);
	ПараметрыФормы.Вставить("НалогиВзносыОтчисления", Владелец.СведенияОНалогахВзносахОтчислениях(ВидыНалогаВзносаОтчисления));
	Если ВидНалогаВзносаОтчисления = "ИПН" Тогда
		ПараметрыФормы.Вставить("ВычетыИПН", Владелец.ВычетыИПН());
	КонецЕсли;
	ПараметрыФормы.Вставить("ДоходыНеПодлежащиеНалогообложению", Владелец.ДоходыНеПодлежащиеНалогообложению(ВидыНалогаВзносаОтчисления));
	ПараметрыФормы.Вставить("ОписаниеДокумента", ОписаниеДокумента);
	ПараметрыФормы.Вставить("МесяцНачисления", Объект[ОписаниеДокумента.МесяцНачисленияИмя]);
	ПараметрыФормы.Вставить("СотрудникФизическоеЛицо", СотрудникФизическоеЛицо);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр ИЛИ Владелец.ТолькоПросмотр);
	
	ОткрытьФорму("ОбщаяФорма.ПодробнееОРасчетеНалогаВзносаОтчисления", ПараметрыФормы, Владелец);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

//Процедура обработки события "ПередУдалением" табличной части "НалогиВзносыОтчисления"
//
Процедура НалогиВзносыОтчисленияПередУдалением(Форма, НалогиВзносыОтчисленияТекущиеДанные, Отказ) Экспорт
	
	Форма.УдаляемыйИдентификаторСтрокиНалогиВзносыОтчисления = НалогиВзносыОтчисленияТекущиеДанные.ИдентификаторСтрокиНалогиВзносыОтчисления;
	
КонецПроцедуры

//Процедура обработки события "ПослеУдаления" табличной части "НалогиВзносыОтчисления"
//
Процедура НалогиВзносыОтчисленияПослеУдаления(Форма) Экспорт
	
	МассивСтрок = Форма.Объект.ВычетыИПН.НайтиСтроки(
		Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления",Форма.УдаляемыйИдентификаторСтрокиНалогиВзносыОтчисления));
	
	Для каждого Строка Из МассивСтрок Цикл
		Форма.Объект.ВычетыИПН.Удалить(Строка);
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти
