
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Параметры.Свойство("ИмяСписка"   , ЭтаФорма.ИмяСписка);
	ЭтаФорма.Параметры.Свойство("ТипОбмена"   , ЭтаФорма.ТипОбмена);
	ЭтаФорма.Параметры.Свойство("ОтборНаФорме", ЭтаФорма.ОтборНаФорме);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяСписка"   , ЭтаФорма.ИмяСписка);
	Структура.Вставить("ТипОбмена"   , ЭтаФорма.ТипОбмена);
	Структура.Вставить("ОтборНаФорме", ЭтаФорма.ОтборНаФорме);

	Закрыть(Структура);
КонецПроцедуры
