
&НаКлиенте
Процедура РолиРольНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Значения = Новый Массив;
	Для Каждого Строка Из Объект.Роли Цикл
		Значения.Добавить(Строка.Роль);
	КонецЦикла;
	
	ФиксированныеНастройки 	= Новый НастройкиКомпоновкиДанных;
	Отбор = ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка");
	Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.НеВСписке;
	Отбор.ПравоеЗначение 	= Значения;
	Отбор.Использование 	= Истина;
	Отбор.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ПараметрыФормы 			= Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", ФиксированныеНастройки);
	 
	ОткрытьФорму("Справочник.ЭКОМ_Роли.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры
