////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");	
    ЗаполнитьЗначенияСвойств(ЭтаФорма, ЭтаФорма.Параметры, "ТочкаДоставки, Копирование");
	
	ДоступностьAPI = ОбработкаОбъект.ПолучитьДоступностьApiПоСтране();
	Если Не ДоступностьAPI Тогда 
		Элементы.ЗаполнитьИзВебПлатформы.Видимость = Ложь;	
	КонецЕсли;
	
    ЭлементДляОтбораВРегистре = "ТочкаДоставки";
    ЭтаФорма.Заголовок = ?(ЭтаФорма.Копирование = Истина Или ЗначениеЗаполнено(ЭтаФорма[ЭлементДляОтбораВРегистре]), "Редактирование точки доставки", "Новая точка доставки");
    Если НЕ ЗначениеЗаполнено(ЭтаФорма[ЭлементДляОтбораВРегистре]) Тогда
        Элементы[ЭлементДляОтбораВРегистре].ТолькоПросмотр = Ложь;
        Элементы[ЭлементДляОтбораВРегистре].Доступность    = Истина;
        Элементы[ЭлементДляОтбораВРегистре].ЦветФона       = WebЦвета.Роса;
	    Возврат;
	КонецЕсли;
    
    ЭтаФорма.Параметры.Свойство("ТочкаДоставки", ЭтаФорма[ЭлементДляОтбораВРегистре]);
	ДанныеТочкаДоставки = ОбработкаОбъект.ЭКОМ_ТочкиДоставки_Прочитать(ЭтаФорма[ЭлементДляОтбораВРегистре]);	
	Если ДанныеТочкаДоставки.СведенияЕсть Тогда					
		ЭтаФорма.GLN                 = ДанныеТочкаДоставки.GLN;			
		ЭтаФорма.Комментарий         = ДанныеТочкаДоставки.Комментарий;
		ЭтаФорма.Владелец            = ДанныеТочкаДоставки.Владелец;
		ЭтаФорма.Наименование        = ДанныеТочкаДоставки.Наименование;
		ЭтаФорма.КПП                 = ДанныеТочкаДоставки.КПП;
		ЭтаФорма.ИНН                 = ДанныеТочкаДоставки.ИНН;
		
		ЭтаФорма.Адрес                = ДанныеТочкаДоставки.Адрес;
		ЭтаФорма.АдресКодРегиона      = ДанныеТочкаДоставки.Адр_КодРегиона;
		ЭтаФорма.АдресИндекс          = ДанныеТочкаДоставки.Адр_Индекс;
		ЭтаФорма.АдресГород           = ДанныеТочкаДоставки.Адр_Город;
		ЭтаФорма.АдресНаселенныйПункт = ДанныеТочкаДоставки.Адр_НаселПункт;
		ЭтаФорма.АдресРайон           = ДанныеТочкаДоставки.Адр_Район;
		ЭтаФорма.АдресУлица           = ДанныеТочкаДоставки.Адр_Улица;
		ЭтаФорма.АдресДом             = ДанныеТочкаДоставки.Адр_Дом;
		ЭтаФорма.АдресКорпус          = ДанныеТочкаДоставки.Адр_Корпус;
		ЭтаФорма.АдресКвартира        = ДанныеТочкаДоставки.Адр_Кварт;
		ЭтаФорма.АдресИностранный     = ДанныеТочкаДоставки.Адр_Иностранный;
		ЭтаФорма.АдресЕстьИностранный = ДанныеТочкаДоставки.Адр_ЯвляетсяИностранным;
	КонецЕсли;
    
    Если ЭтаФорма.Копирование Тогда
        Элементы[ЭлементДляОтбораВРегистре].ЦветФона       = WebЦвета.Роса;
        Элементы[ЭлементДляОтбораВРегистре].ТолькоПросмотр = Ложь;
        Элементы[ЭлементДляОтбораВРегистре].Доступность    = Истина;
        ЭтаФорма.Заголовок = "Новая точка доставки (скопирован) из " + Строка(ЭтаФорма[ЭлементДляОтбораВРегистре]);
        ЭтаФорма[ЭлементДляОтбораВРегистре] = "";
    КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ЭКОМ_ЗначениеДополнительныхКонстант.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ДополнительнаяКонстанта = "ЭКОМ_ИспользоватьАдресаИзРегистраТочкиДоставкиGLN";
	МенеджерЗаписи.Измерение = Неопределено; 
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.ЗначениеДополнительнойКонстанты = Истина Тогда
		Элементы.ГруппаАдрес.Видимость = Истина;
	Иначе	
		Элементы.ГруппаАдрес.Видимость = Ложь;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	//СохранитьНаСервере();
КонецПроцедуры

#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

#Область ОбработчикиКомандФормы

&НаСервере
Процедура СохранитьНаСервере()
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");	
	Если Не ЗначениеЗаполнено(ЭтаФорма.ТочкаДоставки) Тогда
		Сообщить( "Точка доставки не выбрана.", СтатусСообщения.Важное );
		Возврат;
	КонецЕсли;
	
	СтруктураЭКОМ_GLN = Новый Структура;
	СтруктураЭКОМ_GLN.Вставить("GLN"                    , СокрЛП(ЭтаФорма.GLN));
	СтруктураЭКОМ_GLN.Вставить("Владелец"               , ЭтаФорма.Владелец);
	СтруктураЭКОМ_GLN.Вставить("Адрес"                  , СокрЛП(ЭтаФорма.Адрес));
	СтруктураЭКОМ_GLN.Вставить("КПП"                    , СокрЛП(ЭтаФорма.КПП));
	СтруктураЭКОМ_GLN.Вставить("ИНН"                    , СокрЛП(ЭтаФорма.ИНН));
	СтруктураЭКОМ_GLN.Вставить("Адр_Город"              , СокрЛП(ЭтаФорма.АдресГород));
	СтруктураЭКОМ_GLN.Вставить("Адр_Дом"                , СокрЛП(ЭтаФорма.АдресДом));
	СтруктураЭКОМ_GLN.Вставить("Адр_Индекс"             , СокрЛП(ЭтаФорма.АдресИндекс));
	СтруктураЭКОМ_GLN.Вставить("Адр_КодРегиона"         , СокрЛП(ЭтаФорма.АдресКодРегиона));
	СтруктураЭКОМ_GLN.Вставить("Адр_Улица"              , СокрЛП(ЭтаФорма.АдресУлица));
	СтруктураЭКОМ_GLN.Вставить("Адр_Район"              , СокрЛП(ЭтаФорма.АдресРайон));
	СтруктураЭКОМ_GLN.Вставить("Адр_НаселПункт"         , СокрЛП(ЭтаФорма.АдресНаселенныйПункт));
	СтруктураЭКОМ_GLN.Вставить("Адр_Корпус"             , СокрЛП(ЭтаФорма.АдресКорпус));
	СтруктураЭКОМ_GLN.Вставить("Адр_Кварт"              , СокрЛП(ЭтаФорма.АдресКвартира));
	СтруктураЭКОМ_GLN.Вставить("Адр_Иностранный"        , СокрЛП(ЭтаФорма.АдресИностранный));
	СтруктураЭКОМ_GLN.Вставить("Адр_ЯвляетсяИностранным", СокрЛП(ЭтаФорма.АдресЕстьИностранный));
	СтруктураЭКОМ_GLN.Вставить("Комментарий"            , СокрЛП(ЭтаФорма.Комментарий));
    СтруктураЭКОМ_GLN.Вставить("Наименование"           , СокрЛП(ЭтаФорма.Наименование));
	
	ОбработкаОбъект.ЭКОМ_ТочкиДоставки_Запись(ЭтаФорма.ТочкаДоставки, СтруктураЭКОМ_GLN);
    
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Функция ЗаполнитьИзВебПлатформыНаСервере(GLN, МассивЛогаСобытий)
		   
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ДанныеКонтрагентаПоAPI(GLN, МассивЛогаСобытий);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьИзВебПлатформы(Команда)
	
	МассивЛогаСобытий = Новый Массив;
	
	ДанныеМассив = ЗаполнитьИзВебПлатформыНаСервере(ЭтаФорма.GLN, МассивЛогаСобытий);
	Если ТипЗнч(ДанныеМассив) = Тип("Массив") Тогда
		Для Каждого Данные Из ДанныеМассив Цикл
			
			ЭтаФорма.АдресКодРегиона      = ?(Данные.Регион       = "null", "", Данные.Регион);
			ЭтаФорма.АдресИндекс          = ?(Данные.Индекс       = "null", "", Данные.Индекс);
			ЭтаФорма.АдресГород           = ?(Данные.Город        = "null", "", Данные.Город);
			ЭтаФорма.АдресНаселенныйПункт = ?(Данные.Население    = "null", "", Данные.Население);
            ЭтаФорма.АдресРайон           = ?(Данные.Район        = "null", "", Данные.Район);
            ЭтаФорма.АдресУлица           = ?(Данные.Улица        = "null", "", Данные.Улица);
            ЭтаФорма.АдресДом             = ?(Данные.НомерДома    = "null", "", Данные.НомерДома);
            ЭтаФорма.АдресКорпус          = ?(Данные.Корпус       = "null", "", Данные.Корпус);
			ЭтаФорма.АдресКвартира        = ?(Данные.Квартира     = "null", "", Данные.Квартира);
			ЭтаФорма.Наименование         = ?(Данные.Наименование = "null", "", Данные.Наименование);
			
			//Docrobot 1.20.0 MOD-1749[перенесено в отдельную процедуру ОбновитьАдресНаФорме]
			ОбновитьАдресНаФорме();
			
			Если НЕ ЗначениеЗаполнено(ЭтаФорма.КПП) Тогда
				ЭтаФорма.КПП = ?(Данные.КПП = "null", "", Данные.КПП);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ЭтаФорма.ИНН) Тогда
				ЭтаФорма.ИНН = ?(Данные.ИНН = "null", "", Данные.ИНН);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если МассивЛогаСобытий.Количество() > 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий);
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

//Docrobot 1.20.0 MOD-1749
&НаКлиенте
Процедура ОбновитьАдресНаФорме()

	ЭтаФорма.Адрес = ЭтаФорма.АдресКодРегиона + ", "
	+ ЭтаФорма.АдресИндекс			+ ", "
	+ ЭтаФорма.АдресГород			+ ", "
	+ ЭтаФорма.АдресНаселенныйПункт	+ ", "
	+ ЭтаФорма.АдресРайон			+ ", "
	+ ЭтаФорма.АдресУлица			+ ", "
	+ ЭтаФорма.АдресДом				+ ", "
	+ ЭтаФорма.АдресКорпус			+ ", "
	+ ЭтаФорма.АдресКвартира;
	
КонецПроцедуры

//Docrobot 1.20.0 MOD-1749
&НаКлиенте
Процедура ЭлементАдресаПриИзменении(Элемент)
	ОбновитьАдресНаФорме();
КонецПроцедуры

&НаКлиенте
Процедура GLNОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СтрокаРазрешенных = "0123456789";
	Для Сч = 1 По СтрДлина(Текст) Цикл 
		Символ = Сред(Текст,Сч,1);
		Если Найти(СтрокаРазрешенных,Символ) <= 0 Тогда
			ЭтаФорма.GLN = "";
			Сообщить("Введен некорректный GLN! Введите GLN состоящий из 13 чисел без пробелов");
			Прервать;
		КонецЕсли;	 
	КонецЦикла;
КонецПроцедуры


#КонецОбласти






