#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция предназначена для получения данных о месячном расчетном показателе.
// Данные включают в себя сам размер и дату, с которой он действует.
//
// Параметры:
//	ДатаАктуальности - дата, на которую нужно получить размер МРП (необязательный), 
//						если не заполнен, возвращается последнее действующее значение.
//
// Возвращаемое значение - структура, полями которой являются Размер и Период.
//
Функция ДанныеРазмераМесячногоРасчетногоПоказателя(ДатаАктуальности = Неопределено) Экспорт
	
	ДанныеМРП = Новый Структура("Размер, Период");
	
	СрезПоследних = РегистрыСведений.МесячныйРасчетныйПоказатель.СрезПоследних(ДатаАктуальности);
	Если СрезПоследних.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Сведения о месячном расчетном показателе не заполнены'");
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДанныеМРП, СрезПоследних[0]);
	
	Возврат ДанныеМРП;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Начальное заполнение и обновление информационной базы 
Процедура НачальноеЗаполнение() Экспорт
	
	Если ОбменДаннымиПовтИсп.ЭтоАвтономноеРабочееМесто() Тогда
		Возврат;
	КонецЕсли;
	
	Обновить(ПолучитьМакет("ПредопределенныеЗначения").ПолучитьТекст());
	
КонецПроцедуры

// Заполняет ставки месячного расчетного показателя.
Процедура Обновить(ТекстXML) Экспорт
	ЗарплатаКадры.ОбновитьКлассификатор(ТекстXML);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет заполненность данных о месячном расчетном показателе.
//
// Возвращаемое значение - булево, Истина - если есть хотя бы одно значение.
//
Функция МесячныйРасчетныйПоказательЗаполнен() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	РегистрСведений.МесячныйРасчетныйПоказатель КАК МесячныйРасчетныйПоказатель");
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует использовать процедуру НачальноеЗаполнение.
//
Процедура ЗаполнитьМРП() Экспорт

	НачальноеЗаполнение()

КонецПроцедуры

#КонецОбласти

#КонецЕсли