#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ = РегистрыСведений.КодыСтрокДекларацииПоНалогуНаПрибыль.ПустойКлюч() Тогда
		Запись.ТипРасходов = Перечисления.ТипыЗатратРегл.Прочее;
	КонецЕсли;

	МакетКодовСтрок = ПолучитьОбщийМакет("КодыСтрокНалоговыхДеклараций");
	НастроитьСписокВыбораВидаДоходовРасходов();
	УправлениеФормой(ЭтаФорма);
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег("ОбщаяФорма.ФормаВыбораИзКлассификатора") Тогда
		
		Если ТипЗнч(ВыбранноеЗначение) <> Тип("Структура") Тогда 
			Запись.КодСтроки = ВыбранноеЗначение;
		Иначе
			Запись.КодСтроки = ВыбранноеЗначение.КодСтроки;
			Запись.НаименованиеКодаСтроки = ВыбранноеЗначение.Наименование;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КодСтрокиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Запись.ВидДоходаРасхода) И ТипЗнч(Запись.ВидДоходаРасхода) = Тип("ПланВидовХарактеристикСсылка.СтатьиДоходов") Тогда
		ИмяСекции = "НалогНаПрибыль_Доходы";
	ИначеЕсли ЗначениеЗаполнено(Запись.ВидДоходаРасхода) И ТипЗнч(Запись.ВидДоходаРасхода) = Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов") Тогда
		ИмяСекции = "НалогНаПрибыль_Расходы";
	Иначе
		ИмяСекции = "НалогНаПрибыль";
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяМакета"			  , "КодыСтрокНалоговыхДеклараций");
	ПараметрыФормы.Вставить("ИмяСекции"			  ,	ИмяСекции);
	ПараметрыФормы.Вставить("ПолучатьПолныеДанные", Истина);
	ПараметрыФормы.Вставить("ТекущийКодСтроки"	  , ?(НЕ ЗначениеЗаполнено(Запись.КодСтроки), Неопределено, СокрЛП(Запись.КодСтроки)));
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораИзКлассификатора", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КодСтрокиПриИзменении(Элемент)
	
	Запись.КодСтроки = РегламентированнаяОтчетностьКлиентСервер.ОбрезатьКодСтроки(Запись.КодСтроки);
	ОбновитьПредставлениеЭлемента("КодСтрокиДекларации");

КонецПроцедуры

&НаКлиенте
Процедура ТипРасходовПриИзменении(Элемент)
	
	НастроитьСписокВыбораВидаДоходовРасходов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьПредставлениеЭлемента(ИмяОбновляемогоЭлемента)
	
	Если ИмяОбновляемогоЭлемента = "КодСтрокиДекларации" Тогда
		
		Если ПустаяСтрока(СтрЗаменить(Запись.КодСтроки, ".", "")) Тогда
			Запись.НаименованиеКодаСтроки = НСтр("ru ='<не указано>'");
		Иначе
			
			Если НЕ МакетКодовСтрок.ВысотаТаблицы = 0 Тогда
				
				мОбластьСтрок = МакетКодовСтрок.Области.Найти("НалогНаПрибыль");
				
				НаименованиеСтроки = РегламентированнаяОтчетностьКлиентСервер.ПолучитьНаименованиеСтрокиКлассификатораПоКоду(МакетКодовСтрок, мОбластьСтрок, Запись.КодСтроки);
				Если ПустаяСтрока(НаименованиеСтроки) Тогда
					Запись.НаименованиеКодаСтроки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'строка с кодом  %1 не найдена.'"), СокрЛП(Запись.КодСтроки));
				Иначе
					Запись.НаименованиеКодаСтроки = НаименованиеСтроки;
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокВыбораВидаДоходовРасходов()
	
	СписокВыбора = Элементы.ВидДоходаРасхода.СписокВыбора;
	СписокВыбора.Очистить();
	Элементы.ВидДоходаРасхода.РежимВыбораИзСписка = Ложь;
	
	Если Запись.ТипРасходов = Перечисления.ТипыЗатратРегл.СдельнаяОплатаТруда Тогда
		Элементы.ВидДоходаРасхода.ОграничениеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНалогов");
		
		СписокВыбора.Добавить(Перечисления.ТипыНалогов.СН);    
		СписокВыбора.Добавить(Перечисления.ТипыНалогов.СО);    
		СписокВыбора.Добавить(Перечисления.ТипыНалогов.ОППВ); 
		СписокВыбора.Добавить(Перечисления.ТипыНалогов.ВОСМС); 
		Элементы.ВидДоходаРасхода.РежимВыбораИзСписка = Истина;
	ИначеЕсли Запись.ТипРасходов = Перечисления.ТипыЗатратРегл.МатериальныеЗатраты Тогда 
		Запись.ВидДоходаРасхода = Неопределено;
	Иначе
		Элементы.ВидДоходаРасхода.ОграничениеТипа = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиДоходов, ПланВидовХарактеристикСсылка.СтатьиРасходов");
	КонецЕсли;
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Форма.Элементы.ВидДоходаРасхода.Доступность = НЕ (Форма.Запись.ТипРасходов = ПредопределенноеЗначение("Перечисление.ТипыЗатратРегл.МатериальныеЗатраты"));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВидДоходаРасхода.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Запись.ТипРасходов");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыЗатратРегл.Прочее;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
КонецПроцедуры


#КонецОбласти