&НаКлиенте
Перем ОбработкаКС Экспорт;

&НаКлиенте
Перем ФормаДлительнойОперации;

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Обход ошибки платформы "Параметр сеанса отсутствует или удален".
	ТабличныйДокумент.Очистить();
	
	СформироватьСтруктуруРеквизитовФормы();
	СформироватьСтруктуруСоответствияКодовСтрок();
	
	СоответствиеЕдиницыИзмеренияДелителю = Новый Структура;
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1", 1);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000", 1000);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000000", 1000000);
	
	// ОПИСАНИЕ ПАРАМЕТРОВ МНОГОСТРОЧНЫХ ГРУПП
	// Идентификаторы многострочных групп
	СтруктураРеквизитовФормы.мИдГруппы11  = "П0001100001";
	СтруктураРеквизитовФормы.мИдГруппы12  = "П0001200002";
	
	
	//100.01
	КолИсхСтрокИдГруппы11  = 1;
	КолИсхСтрокИдГруппы12  = 1;
	
	//100.01
	КолКолонокИдГруппы11 = 5;
	КолКолонокИдГруппы12 = 3;
	
	СтруктураДанныхФорма100Страница1        = Новый Структура;
	СтруктураДанныхФорма100Страница2        = Новый Структура;
	СтруктураДанныхФорма100Страница3        = Новый Структура;
	СтруктураДанныхФорма100Страница4        = Новый Структура;
	СтруктураДанныхФорма100_01Страница1     = Новый Структура;
	СтруктураДанныхФорма100_01Страница2     = Новый Структура;
	СтруктураДанныхФорма100_02Страница1     = Новый Структура;
	СтруктураДанныхФорма100_02Страница2     = Новый Структура;
	СтруктураДанныхФорма100_02Страница3     = Новый Структура;
	СтруктураДанныхФорма100_07Страница1     = Новый Структура;
	СтруктураДанныхФорма100_07Страница2     = Новый Структура;
	СтруктураДанныхФорма100_07Страница3     = Новый Структура;
	
	// структура многострочных разделов формы
	мСтруктураМногострочныхРазделов = Новый Структура;
	//100.01
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы11, СтруктураРеквизитовФормы.мИдГруппы11);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы12, СтруктураРеквизитовФормы.мИдГруппы12);
	
	// Структура содержит данные дополнительных страниц
	мСтруктураМногостраничныхРазделов = Новый Структура;
	
	// структура исходных строк (минимального кол-ва) многострочных разделов формы
	мСтруктураИсхКолвоСтрокРазделов = Новый Структура;
	//100.01
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы11, КолИсхСтрокИдГруппы11);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы12, КолИсхСтрокИдГруппы12);
	
	
	мСтруктураКолвоКолонокРазделов = Новый Структура;
	//100.03
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы11, КолКолонокИдГруппы11);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы12, КолКолонокИдГруппы12);
	
	
	СтруктураРеквизитовФормы.СписокПечатаемыхЛистов = Новый СписокЗначений;
	СтруктураРеквизитовФормы.мПечатныеформы = Новый СписокЗначений;
	
	СтруктураРеквизитовФормы.мВыбраннаяФорма          = Параметры.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета  = Параметры.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета = Параметры.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мПериодичность           = Параметры.мПериодичность;
	СтруктураРеквизитовФормы.мСкопированаФорма        = Параметры.мСкопированаФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок          = Параметры.мСохраненныйДок;
	СтруктураРеквизитовФормы.Организация              = Параметры.Организация;
	СтруктураРеквизитовФормы.ВидДокумента = 0;
	СтруктураРеквизитовФормы.НомерСтраницыПриложений  = "001";
	
	НалоговыйКомитет = СтруктураРеквизитовФормы.Организация.РегистрацияВНалоговомОргане;
	СтруктураРеквизитовФормы.НалоговыйКомитет = ?(ЗначениеЗаполнено(НалоговыйКомитет),НалоговыйКомитет,Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка());
	
	ИмяРаздела = "Форма100Страница1";
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(
	ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяРаздела));
	
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	
	//индивидуальные ключи формы
	СтруктураРеквизитовФормы.КодСтрокиДоходОтКурсовойРазницы   = "100.00.004.K";
	СтруктураРеквизитовФормы.КодСтрокиРасходыПоКурсовойРазнице = "100.00.020.K";
	СтруктураРеквизитовФормы.ГруппаОрганизаций = ПолучитьСписокСтруктурныхЕдиниц(Параметры.Организация);
	
	СформироватьОтчетныйПериод();
	
	Инициализация(Параметры.БезОткрытияФормы);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруРеквизитовФормы()
	
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("Организация");
	СтруктураРеквизитовФормы.Вставить("ЕдиницаИзмерения");
	СтруктураРеквизитовФормы.Вставить("ТочностьЕдиницыИзмерения");
	СтруктураРеквизитовФормы.Вставить("мГод");
	СтруктураРеквизитовФормы.Вставить("мДатаНачалаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мДатаКонцаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мПериодичность");
	СтруктураРеквизитовФормы.Вставить("мСкопированаФорма");
	СтруктураРеквизитовФормы.Вставить("мСохраненныйДок");
	СтруктураРеквизитовФормы.Вставить("мВыбраннаяФорма");
	СтруктураРеквизитовФормы.Вставить("мЗаписываетсяНовыйДокумент");
	СтруктураРеквизитовФормы.Вставить("мВариант");
	СтруктураРеквизитовФормы.Вставить("мПроверятьСоотношенияПриПечатиИВыгрузки");
	СтруктураРеквизитовФормы.Вставить("СписокПечатаемыхЛистов");
	СтруктураРеквизитовФормы.Вставить("мРежимПечати");
	СтруктураРеквизитовФормы.Вставить("мСчетчикСтраниц");
	СтруктураРеквизитовФормы.Вставить("мПечатныеФормы");
	СтруктураРеквизитовФормы.Вставить("НаимТекущегоРаздела");
	СтруктураРеквизитовФормы.Вставить("ВидДокумента");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы11");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы12");
	СтруктураРеквизитовФормы.Вставить("АдресВоВременномХранилище");
	СтруктураРеквизитовФормы.Вставить("АдресВременногоХранилищаРасшифровки");
	СтруктураРеквизитовФормы.Вставить("ГруппаОрганизаций", Новый СписокЗначений);
	СтруктураРеквизитовФормы.Вставить("ИдентификаторЗадания");
	СтруктураРеквизитовФормы.Вставить("УспешноеАвтозаполнение");
	СтруктураРеквизитовФормы.Вставить("ВерсияАвтозаполнения");
	СтруктураРеквизитовФормы.Вставить("ВыводитьСтраницуВТаблДокНаСервере");
	СтруктураРеквизитовФормы.Вставить("НалоговыйКомитет");
	СтруктураРеквизитовФормы.Вставить("НомерСтраницыПриложений");
	
	// индивидуальные параметры формы
	СтруктураРеквизитовФормы.Вставить("КодСтрокиДоходОтКурсовойРазницы");		
	СтруктураРеквизитовФормы.Вставить("КодСтрокиРасходыПоКурсовойРазнице");		
	
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСтраницОтчета() 
	
	// Дерево содержит коллекцию страниц отчета.
	мДеревоСтраницОтчета.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма100Страница1";
	СтрокаУровня1.Представление            = "Форма 100.00 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма100Страница2";
	СтрокаУровня1.Представление            = "Форма 100.00 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма100Страница3";
	СтрокаУровня1.Представление            = "Форма 100.00 Страница 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма100Страница4";
	СтрокаУровня1.Представление            = "Форма 100.00 Страница 4";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма100_01Страница1";
	СтрокаУровня1.Представление            = "Форма 100.01 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма100_01Страница2";
	СтрокаУровня1.Представление            = "Форма 100.01 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма100_02Страница1";
	СтрокаУровня1.Представление            = "Форма 100.02 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма100_02Страница2";
	СтрокаУровня1.Представление            = "Форма 100.02 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма100_02Страница3";
	СтрокаУровня1.Представление            = "Форма 100.02 Страница 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма100_07Страница1";
	СтрокаУровня1.Представление            = "Форма 100.07 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма100_07Страница2";
	СтрокаУровня1.Представление            = "Форма 100.07 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма100_07Страница3";
	СтрокаУровня1.Представление            = "Форма 100.07 Страница 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСвойствСтраниц() Экспорт
	
	мСвойстваРазделовДекларации.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	
	СтрокаУровня1.ИмяСтраницы                          = "Форма100Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма100Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма100Страница3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма100Страница4";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма100_01Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы11;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма100_01Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы12;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма100_02Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма100_02Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма100_02Страница3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма100_07Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма100_07Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма100_07Страница3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПустыеСтруктурыДанных()
	
	СохрТабличныйДокумент = Новый ТабличныйДокумент;
	
	СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		ИмяГруппы = ЭлементСтруктуры.Ключ;
		СтруктураГруппы = ЭтаФорма[ЭлементСтруктуры.Значение];
		СтруктураГруппы.Очистить();
	КонецЦикла;
	
	Для Каждого Раздел Из мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
		
		ТабличныйДокумент.Очистить();
		ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + Раздел.ИмяСтраницы));
		
		СохранитьДанныеРаздела(Раздел.ИмяСтраницы);
		
	КонецЦикла;
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоРазделовОтчетаНаСервере() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДеревоРазделовОтчетаНаКлиенте() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьДеревоРазделовОтчета(Форма)
	
	Форма["РазделыОтчета"].ПолучитьЭлементы().Очистить();
	МассивНаименований = Новый Массив;
	
	Для Каждого ЭлементДереваСтраницОтчета Из Форма["мДеревоСтраницОтчета"].ПолучитьЭлементы() Цикл
		
		Если ЭлементДереваСтраницОтчета.ПоказатьСтраницу = 1 Тогда
			
			Если МассивНаименований.Найти(ЭлементДереваСтраницОтчета.ИмяСтраницы) = Неопределено Тогда 
				
				ЭлементРазделовОтчета = Форма["РазделыОтчета"].ПолучитьЭлементы().Добавить();
				ЭлементРазделовОтчета.КолонкаРазделыОтчета = Лев(ЭлементДереваСтраницОтчета.Представление,12);
				ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим = ЭлементДереваСтраницОтчета.ИмяСтраницы;
				МассивНаименований.Добавить(ЭлементДереваСтраницОтчета.ИмяСтраницы);
				ЭлементРазделовОтчета.РазделМногострочный = МногострочныйРаздел(ЭлементДереваСтраницОтчета.ИмяСтраницы);
				
				Если ЭтоРазделРодитель(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим) Тогда
					
					Для НомерПодраздела = 1 По ПолучитьКоличествоПодразделовПоРодителю(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим) Цикл
						
						СтраницаРазделаОтчета = ЭлементРазделовОтчета.ПолучитьЭлементы().Добавить();
						
						СтраницаРазделаОтчета.КолонкаРазделыОтчета              = Лев(ЭлементДереваСтраницОтчета.Представление,СтрДлина(ЭлементДереваСтраницОтчета.Представление)-1) + НомерПодраздела;
						СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим      = Лев(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим, СтрДлина(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим)-1) + НомерПодраздела;
						МассивНаименований.Добавить(СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим);
						СтраницаРазделаОтчета.РазделМногострочный               = ЭлементРазделовОтчета.РазделМногострочный;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоРазделРодитель(ИмяРаздела)
	
	Возврат (ИмяРаздела = "Форма100Страница1")
	ИЛИ (ИмяРаздела = "Форма100_01Страница1")
	ИЛИ (ИмяРаздела = "Форма100_02Страница1")
	ИЛИ (ИмяРаздела = "Форма100_07Страница1")
	;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МногострочныйРаздел(ИмяРаздела)
	
	Возврат (ИмяРаздела = "Форма100_01Страница1")
			ИЛИ (ИмяРаздела = "Форма100_02Страница2")
	;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьКоличествоПодразделовПоРодителю(Родитель)
	
	Если Родитель = "Форма100Страница1" Тогда
		Возврат 4;
	ИначеЕсли Родитель = "Форма100_01Страница1" Тогда
		Возврат 2;
	ИначеЕсли Родитель = "Форма100_02Страница1" Тогда
		Возврат 3;
	ИначеЕсли Родитель = "Форма100_07Страница1" Тогда
		Возврат 3;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура СформироватьОтчетныйПериод()
	
	СтрПериодОтчета = ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета,СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ФП = истина");
	
	СтруктураРеквизитовФормы.мГод = Лев(Прав(СтрПериодОтчета,7),4);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета()
	
	СтруктураЗависимыхЯчеекДляАвторасчета = Новый Структура;
	//100.00
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("ВидДекларации", "Первоначальная;Очередная;Дополнительная;ПоУведомлению;Ликвидационная");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("КатегорияНалПл", "КатегорияA;КатегорияB;КатегорияC");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("НаличиеПриложений", "Приложение01;Приложение02;Приложение03;Приложение04;Приложение05;Приложение06;Приложение07;Приложение08");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("РезидентУчереждение", "РезидентРК;НерезидентРК;ПостоянноеУчереждениеЗаРК");
	
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010003001", "П000010003101;П000010003001");  //сложная зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010005001", "П000010001001;П000010002001;П000010003001;П000010004001;П000010003001_Рекурсия");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010008001", "П000010007001;П000010006001;П000010005001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020009301", "П000020009311;П000020009321;П000020009331;П000020009341;П000020009351;П000020009361;П000020009371;П000020009381");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020009001", "П000020009101;П000020009201;П000020009301;П000020009401;П000020009501;П000020009601;П000020009701;П000020009801;П000020009901");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020017001", "П000230011001;П000230012001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020019001", "П000020019101;П000020019001");  //сложная зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030021101", "П000020009001;П000020010001;П000020011001;П000020012001;П000020013001;П000020014001;П000020015001;П000020016001;П000020017001;П000020018001;П000020019001;П000020020001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030022001", "П000030022101;П000030022201");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030025001", "П000010008001;П000030021001;П000030022001;П000030023001;П000030024001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030026001", "П000030026101;П000030026001");  //сложная зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030028001", "П000030025001;П000030026101;П000030027001;П000030026101_Рекурсия");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030029001", "П000030028001;П000220008101");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030030001", "П000030030101;П000030030201;П000030030001");  //сложная зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030031001", "П000030028001;П000030030001_Рекурсия");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030033001", "П000030031001;П000030032001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030035001", "П000030033001;П000030034001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000040036001", "П000030035001;П000040036101;П000040036201;П000040036301;П000040036401;П000040036501");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000040037001", "П000040036001;П000040037101");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000040038001", "П000030033001;П000030035001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000040040001", "П000040037001;П000040039101;П000040039202");
	
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010004001", "П000010006001;П000010004001");  //сложная зависимость самой от себя
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030006001", "П000030040001_Рекурсия");
	
	//100.01
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000110000101_1", "П000110000102_1;П000110000103_1;П000110000104_1;П000110000105_1");//Заполнение 1й строки в многострочной форме
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000120000201_1", "П000120000202_1;П000120000203_1");//Заполнение 1й строки в многострочной форме
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000120000102", "П000120000202");
	
	//100.02
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000210001001","П000210001101;П000210001201;П000210001301;П000210001401");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000210002001","П000210002101;П000210002201;П000210002301;П000210002401");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000210003001","П000210003101;П000210003201;П000210003301;П000210003401");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000210004001","П000210004101;П000210004201;П000210004301;П000210004401");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000220005001","П000220005101;П000220005201;П000220005301;П000220005401");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000220006001","П000220006101;П000220006201;П000220006301;П000220006401");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000220007001","П000220007101;П000220007201;П000220007301;П000220007401");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000220008001","П000220008101;П000220008201;П000220008301;П000220008401");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000220009001","П000220009101;П000220009201;П000220009301;П000220009401");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000220005101","П000210001101;П000210002101;П000210003101;П000210004101");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000220005201","П000210001201;П000210002201;П000210003201;П000210004201");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000220005301","П000210001301;П000210002301;П000210003301;П000210004301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000220005401","П000210001401;П000210002401;П000210003401;П000210004401");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000230010001","П000230010101;П000230010201;П000230010301;П000230010401");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000230011001","П000230011101;П000230011201;П000230011301;П000230011401");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000230011101","П000220006101;П000220007101;П000220009101;П000230010101");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000230011201","П000220006201;П000220007201;П000220008201;П000220009201;П000230010201");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000230011301","П000220006301;П000220007301;П000220008301;П000220009301;П000230010301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000230011401","П000220006401;П000220007401;П000220008401;П000220009401;П000230010401");
	
	//100.07
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000720018001","П000710001001;П000710002001;П000710003001;П000710004001;П000710005001;П000710006001;П000710007001;П000710008001;П000710009001;П000710010001;П000710011001;П000710012001;П000710013001;П000720014001;П000720015001;П000720016001;П000720017001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000720018002","П000710001002;П000710002002;П000710003002;П000710004002;П000710005002;П000710006002;П000710007002;П000710008002;П000710009002;П000710010002;П000710011002;П000710012002;П000710013002;П000720014002;П000720015002;П000720016002;П000720017002");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000720030001","П000720019001;П000720020001;П000720021001;П000720022001;П000720023001;П000720024001;П000720025001;П000720026001;П000720027001;П000720028001;П000720029001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000720030002","П000720019002;П000720020002;П000720021002;П000720022002;П000720023002;П000720024002;П000720025002;П000720026002;П000720027002;П000720028002;П000720029002");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000730038001","П000730031001;П000730032001;П000730033001;П000730034001;П000730035001;П000730036001;П000730037001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000730038002","П000730031002;П000730032002;П000730033002;П000730034002;П000730035002;П000730036002;П000730037002");
	
	
КонецПроцедуры

&НаСервере
Процедура Инициализация(БезОткрытияФормы = Ложь) Экспорт
	
	ФормироватьСтруктуруСтраницОтчета();
	ФормироватьСтруктуруСвойствСтраниц();
	СформироватьДеревоРазделовОтчетаНаСервере();
	ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета();
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
	Если СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		ЗаполнитьПустыеСтруктурыДанных();
		ЗаполнитьСведенияОбОрганизацииНаСервере();
		НачальныеОперацииСМногострочнымиБлоками();
		СтруктураРеквизитовФормы.ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
		СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 0;
		КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
		РасчетНаСервере("Форма100Страница1","Очередная");
	Иначе
		ВосстановитьСохраненныеДанные();
		ВывестиМакетВТаблДокНаСервере("Форма100Страница1");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизацииНаСервере()
	
	ЗаполнитьСведенияОбОрганизации(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизации(Форма)
	
	СтрокаСведений = "ИННЮЛ, НаимЮЛПол, ФИОРук, КБЕ";
	СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(СтруктураРеквизитовФормы.Организация,,СтрокаСведений);
	
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ИИН_БИН"].Значение) Тогда
		ТабличныйДокумент.Области["ИИН_БИН"].Значение = СведенияОбОрганизации.ИННЮЛ;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Год"].Значение) Тогда
		ТабличныйДокумент.Области["Год"].Значение = СтруктураРеквизитовФормы.мГод;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ОргНазв") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ОргНазв"].Значение) Тогда
		ТабличныйДокумент.Области["ОргНазв"].Значение = СведенияОбОрганизации.НаимЮЛПол;
		Если ТабличныйДокумент.Области.Найти("ОргНазв3") <> Неопределено Тогда
			КонецШага = 3;
		Иначе
			КонецШага = 2;
		КонецЕсли;
		НачПозиция = 1;
		Для Шаг = 1 По КонецШага Цикл
			ДлинаСтроки = ТабличныйДокумент.Области["ОргНазв" + Шаг].ТипЗначения.КвалификаторыСтроки.Длина;
			НазОрганизации = Сред(СведенияОбОрганизации.НаимЮЛПол, НачПозиция, ДлинаСтроки); 
			ТабличныйДокумент.Области["ОргНазв" + Шаг].Значение = НазОрганизации;
			НачПозиция =НачПозиция + ДлинаСтроки;
		КонецЦикла;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("Руководитель") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Руководитель"].Значение) Тогда
		ТабличныйДокумент.Области["Руководитель"].Значение = СведенияОбОрганизации.ФИОРук;
	КонецЕсли;
	
	РезидентРК = ?(Лев(СведенияОбОрганизации.КБе,1) = "2", Ложь, Истина);
	
	Если ТабличныйДокумент.Области.Найти("РезидентРК") <> Неопределено Тогда
		ТабличныйДокумент.Области["РезидентРК"].Значение = ?(РезидентРК,    "Х", "");
	КонецЕсли;
	Если ТабличныйДокумент.Области.Найти("НерезидентРК") <> Неопределено Тогда
		ТабличныйДокумент.Области["НерезидентРК"].Значение = ?(НЕ РезидентРК, "Х", "");
	КонецЕсли;

	Если ТабличныйДокумент.Области.Найти("КодСтраныРезеденства") <> Неопределено Тогда
		Если РезидентРК Тогда
			ТабличныйДокумент.Области["КодСтраныРезеденства"].Значение = "";
		КонецЕсли;	
		//ТабличныйДокумент.Области["КодСтраныРезеденства"].Защита = РезидентРК;
	КонецЕсли;
	Если ТабличныйДокумент.Области.Найти("НомерНалоговойРегСтраныРезеденства") <> Неопределено Тогда
		Если РезидентРК Тогда
			ТабличныйДокумент.Области["НомерНалоговойРегСтраныРезеденства"].Значение = "";
		КонецЕсли;	
		//ТабличныйДокумент.Области["НомерНалоговойРегСтраныРезеденства"].Защита = РезидентРК;
	КонецЕсли;
		
	Если ТабличныйДокумент.Области.Найти("КодНалоговогоОргана") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["КодНалоговогоОргана"].Значение) Тогда
		КодНалоговогоОргана = ?(СтруктураРеквизитовФормы.НалоговыйКомитет = Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка(),"",СтруктураРеквизитовФормы.НалоговыйКомитет.Код);
		ТабличныйДокумент.Области["КодНалоговогоОргана"].Значение = КодНалоговогоОргана;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("КодВалюты") <> Неопределено Тогда
		ТабличныйДокумент.Области["КодВалюты"].Значение = "KZT";
	КонецЕсли;
		
	Если ТабличныйДокумент.Области.Найти("НомерСтраницыПриложений") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["НомерСтраницыПриложений"].Значение) Тогда
		ТабличныйДокумент.Области["НомерСтраницыПриложений"].Значение = СтруктураРеквизитовФормы.НомерСтраницыПриложений;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ПоУведомлению") <> Неопределено Тогда
		
		Если ТабличныйДокумент.Области["ПоУведомлению"].Значение = "Х" Тогда
			ТабличныйДокумент.Области.НомерУведомления.Защита = Ложь;
			ТабличныйДокумент.Области.ДатаУведомления.Защита = Ложь;
		ИначеЕсли ТабличныйДокумент.Области["Очередная"].Значение = "" И
			ТабличныйДокумент.Области["Дополнительная"].Значение = "" И 
			ТабличныйДокумент.Области["Ликвидационная"].Значение = "" И
			ТабличныйДокумент.Области["Первоначальная"].Значение = "" Тогда
			
			ТабличныйДокумент.Области["Очередная"].Значение = "Х";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьСохраненныеДанные()
	
	Перем ДанныеМногострочныхРазделов;
	Перем ПоказателиОтчета;
	Перем НалоговыйКомитет;
	
	// восстанавливаем сохраненные данные отчета
	СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	
	// восстановим сохраненные данные редактируемых ячеек
	СписокСохранения.Свойство("ПоказателиОтчета", ПоказателиОтчета);
	СписокСохранения.Свойство("НалоговыйКомитет", НалоговыйКомитет);
	
	Если СписокСохранения.Свойство( "ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов) Тогда
		
		Для Каждого ЭлементСтруктуры Из ДанныеМногострочныхРазделов Цикл
			
			НайденноеЗначение = Неопределено;
			мСтруктураМногострочныхРазделов.Свойство(ЭлементСтруктуры.Ключ, НайденноеЗначение);
			
			Если НЕ НайденноеЗначение = Неопределено Тогда
				ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, ЭтаФорма[НайденноеЗначение]);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы] = ПоказателиОтчета[Префикс + Раздел.ИмяСтраницы];
	КонецЦикла;
	
	Комментарий = СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий;
	СтруктураРеквизитовФормы.НалоговыйКомитет = НалоговыйКомитет;
	СтруктураРеквизитовФормы.ЕдиницаИзмерения = СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения;
	
	РегламентированнаяОтчетность.ОперацииПриВосстановленииРегламентированногоОтчета(ЭтаФорма);
	КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
	
КонецПроцедуры

&НаСервере
Процедура НачальныеОперацииСМногострочнымиБлоками()
	Перем ИсходноеКоличествоСтрокГруппы;
	
	// создаем исходную структуру многострочных разделов
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		ИмяГруппы = ЭлементСтруктуры.Ключ;
		СтруктураГруппы = ЭтаФорма[ЭлементСтруктуры.Значение];
		
		мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
		
		Если ИсходноеКоличествоСтрокГруппы > СтруктураГруппы.Количество() Тогда 
			Для НСтр = 1 По ИсходноеКоличествоСтрокГруппы Цикл
				СтруктураГруппы.Добавить();
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазделыОтчетаПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ОчиститьТекущуюСтраницу.Видимость = НЕ Элемент.ТекущиеДанные.РазделМногострочный;
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, 1);
	
	ЗаполнитьСведенияОбОрганизацииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетСтраницыВТабличныйДокументНаСервере(ИмяТекРаздела)
	
	ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела);
	СтруктураРеквизитовФормы.НаимТекущегоРаздела  = ИмяТекРаздела;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела)
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(
	ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяТекРаздела));
	
	//многострочные разделы
	Если ИмяТекРаздела = "Форма100_01Страница1"
		 ИЛИ ИмяТекРаздела = "Форма100_01Страница2" Тогда
		
		СтруктураДанныхРаздела = ЭтаФорма["СтруктураДанных" + ИмяТекРаздела];
		
		Для Каждого ЭлСтруктуры Из СтруктураДанныхРаздела Цикл
			Попытка
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
		ТекТабличноеПоле = ЭтаФорма.ТабличныйДокумент;
		
		ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяТекРаздела);
		
		СтруктураГруппы = Неопределено;
		
		мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
		
		СтруктураГруппы = ЭтаФорма[СтруктураГруппы];
		
		ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
		
		ЕстьДопСтроки = Ложь;
		
		Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
			Если СтрЧислоВхождений(ОбластьТД.Имя, "_2") > 0 Тогда
				ЕстьДопСтроки = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьДопСтроки Тогда
			Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
				Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
					ОбластьТД.Гиперссылка = Истина;
					ОбластьТД.Текст = "х";
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
				Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
					ОбластьТД.Гиперссылка = Ложь;
					ОбластьТД.Текст = "";
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//обычные разделы
	ИначеЕсли ЭтаФорма["СтруктураДанных" + ИмяТекРаздела]<> Неопределено Тогда
		
		Для Каждого ЭлСтруктуры Из ЭтаФорма["СтруктураДанных" + ИмяТекРаздела] Цикл
			Попытка
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиРазделВТабличныйДокумент(Форма, ИмяГруппы, СтруктураГруппы)
	Перем ИсходноеКоличествоСтрокГруппы;
	
	#Если НаКлиенте Тогда
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИмяГруппы);
	#Иначе
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИмяГруппы);
	#КонецЕсли
	
	// определим исходное колво строк многострочного раздела,
	// соответствующее бумажной форме отчета
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
	
	// реальное кол-во строк (колво заполненных строк)
	ТекущееКоличествоСтрокГруппы = СтруктураГруппы.Количество();
	
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	ПерерисоватьСтроки = (НЕ ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы);
	
	Раздел = Форма[ТекТабличноеПолеИмя];
	
	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// При восстановлении сохраненных данных отчета сравниваем исходное кол-во
	// отображаемых в форме строк многострочного раздела с реальным количеством
	// созданных строк в сохраненном отчете.
	Если ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы Тогда
		
		// При превышении реального кол-ва строк над исходным кол-вом (по шаблону),
		// автоматически добавляем необходимое колво строк.
		Форма.ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки);
		
		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
	КонецЕсли;
	
	// выводим значения строк
	Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
		НомерСтрокиВТаблице      = СтруктураГруппы.Индекс(СтрокаТаблицы);
		НомерСтрокиВФормеТаблицыСтр = Формат(НомерСтрокиВТаблице + 1, "ЧГ=");
		
		Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
			
			КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
			
			Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
				
				ЗначениеЯчейки = СтрокаТаблицы[КолонкаТаблицыИмя];
				ИмяЯчейки      = КолонкаТаблицыИмя + "_" + НомерСтрокиВФормеТаблицыСтр;
				
				ОбластьЯчейкиТаблицы = ТекТабличноеПоле.Области[ИмяЯчейки];
				
				Если ОбластьЯчейкиТаблицы.СодержитЗначение = Истина Тогда
					ОбластьЯчейкиТаблицы.Значение = ЗначениеЯчейки;
				Иначе
					ОбластьЯчейкиТаблицы.Текст = ЗначениеЯчейки;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки) Экспорт
	
	ОбластьДопСтроки = ТекТабличноеПоле.ПолучитьОбласть("МногострочнаяЧасть");
	
	КоординатыОбластей = Новый Структура();
	
	Для Каждого Область Из ТекТабличноеПоле.Области Цикл
		
		Если СтрНайти(Область.Имя, "_") Тогда
			
			КоординатыОбластей.Вставить(Область.Имя, Область.Верх);
			
		КонецЕсли;
		
	КонецЦикла;
	
	МногострочнаяЧастьВерх = ТекТабличноеПоле.Области.МногострочнаяЧасть.Верх;
	
	МногострочнаяЧастьНиз = ТекТабличноеПоле.Области.МногострочнаяЧасть.Низ;
	
	ТекТабличноеПоле.ВставитьОбласть(ОбластьДопСтроки.Область(), ТекТабличноеПоле.Область(МногострочнаяЧастьНиз + 1, , МногострочнаяЧастьНиз + (ТекущееКоличествоСтрокГруппы - 1) * ВысотаСтроки), ТипСмещенияТабличногоДокумента.ПоВертикали);
	
	Для НомНовойСтроки = ИсходноеКоличествоСтрокГруппы По ТекущееКоличествоСтрокГруппы Цикл
		
		Постфикс = Формат(ТекущееКоличествоСтрокГруппы - НомНовойСтроки + 1, "ЧГ=");
		
		Для Каждого Область Из ОбластьДопСтроки.Области Цикл
			
			Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
				
				ОбластьТаблДок = ТекТабличноеПоле.Область(КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Лево, КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Право);
				
				Если ОбластьТаблДок.СодержитЗначение Тогда
					ОбластьТаблДок.Очистить();
				КонецЕсли;
				
				ОбластьТаблДок.Имя = Лев(Область.Имя, СтрНайти(Область.Имя, "_")) + Постфикс;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;	
	
	ТекТабличноеПоле.Область(ТекТабличноеПоле.Области.МногострочнаяЧасть.Верх, , ТекТабличноеПоле.Области.МногострочнаяЧасть.Низ).Имя = "";
	
	ТекТабличноеПоле.Область(МногострочнаяЧастьВерх, , МногострочнаяЧастьНиз).Имя = "МногострочнаяЧасть";
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеРаздела(НаимРаздела)
	
	// Многострочные разделы.
	Если НаимРаздела = "Форма100_01Страница1"
		ИЛИ НаимРаздела = "Форма100_01Страница2" Тогда
		
		ЭтаФорма["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");
		
		ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(НаимРаздела);
		
		ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппы);
		
		// Обычные разделы.
	Иначе
		
		ЭтаФорма["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СобратьДанныеТекущегоТаблПоля(Форма, ТабличноеПоле) Экспорт
	
	СтруктураДанныхПоля = Новый Структура;
	Для Каждого ТекущаяОбласть Из Форма[ТабличноеПоле].Области Цикл
		Если СтрЧислоВхождений(Тип(ТекущаяОбласть), "Рисунок") = 0 И ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник И ТекущаяОбласть.СодержитЗначение = Истина Тогда
			СтруктураДанныхПоля.Вставить(ТекущаяОбласть.Имя, ТекущаяОбласть.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураДанныхПоля;
	
КонецФункции

&НаСервере
Процедура ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппы) Экспорт
	
	Перем СтруктураГруппы;
	
	РегламентированнаяОтчетностьКлиентСервер.ОбновитьСтруктуруМногострочногоРаздела(ЭтаФорма, ИмяГруппы);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область)
	Модифицированность = Истина;
	
	ИмяРаздела = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
	
	РасчетНаКлиенте(ИмяРаздела,Область.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетНаКлиенте(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт
	
	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);
	
КонецПроцедуры

&НаСервере
Процедура РасчетНаСервере(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт
	
	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура Расчет(Форма, ИмяСтраницыПанели = "", ОбластьИмя = "")
	
	Если Форма.СтруктураРеквизитовФормы.мРежимПечати Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСтраницыПанели = "Форма100Страница1" Тогда
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.ВидДекларации, ОбластьИмя) > 0 Тогда
			
			Первоначальная = "";
			Очередная =      "";
			Дополнительная = "";
			ПоУведомлению =  "";
			Ликвидационная = "";
			
			
			Если ОбластьИмя = "Первоначальная" Тогда
				Первоначальная = "Х";
			ИначеЕсли ОбластьИмя = "Очередная" Тогда
				Очередная = "Х";
			ИначеЕсли ОбластьИмя = "Дополнительная" Тогда
				Дополнительная = "Х";
			ИначеЕсли ОбластьИмя = "ПоУведомлению" Тогда
				ПоУведомлению = "Х";
			ИначеЕсли ОбластьИмя = "Ликвидационная" Тогда
				Ликвидационная = "Х";
			Иначе
				Очередная = "Х";
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма100Страница1.Вставить("Первоначальная", Первоначальная);
			Форма.СтруктураДанныхФорма100Страница1.Вставить("Очередная",           Очередная);
			Форма.СтруктураДанныхФорма100Страница1.Вставить("Дополнительная", Дополнительная);
			Форма.СтруктураДанныхФорма100Страница1.Вставить("ПоУведомлению",   ПоУведомлению);
			Форма.СтруктураДанныхФорма100Страница1.Вставить("Ликвидационная", Ликвидационная);
			Если Не ПоУведомлению = "Х" Тогда
				Форма.СтруктураДанныхФорма100Страница1.Вставить("НомерУведомления", "");
				Форма.СтруктураДанныхФорма100Страница1.Вставить("ДатаУведомления", "");
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
				Форма.ТабличныйДокумент.Области.Первоначальная.Значение = Первоначальная;
				Форма.ТабличныйДокумент.Области.Очередная.Значение = Очередная;
				Форма.ТабличныйДокумент.Области.Дополнительная.Значение = Дополнительная;
				Форма.ТабличныйДокумент.Области.ПоУведомлению.Значение = ПоУведомлению;
				Форма.ТабличныйДокумент.Области.Ликвидационная.Значение = Ликвидационная;
				Если ПоУведомлению = "Х" Тогда
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Ложь;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Ложь;
				Иначе
					Форма.ТабличныйДокумент.Области.НомерУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Истина;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Истина;
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.НаличиеПриложений, ОбластьИмя) > 0 Тогда
			
			Приложение01 = "";
			Приложение02 = "";
			Приложение03 = "";
			Приложение04 = "";
			Приложение05 = "";
			Приложение06 = "";
			Приложение07 = "";
			Приложение08 = "";
			
			Если ОбластьИмя = "Приложение01" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Приложение01 = Форма.ТабличныйДокумент.Области.Приложение01.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("Приложение01") Тогда
					Приложение01 = Форма.СтруктураДанныхФорма100Страница1.Приложение01;
				КонецЕсли;
				
				Приложение01 = ?(Приложение01 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("Приложение01", Приложение01);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение01.Значение = Приложение01;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение02" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Приложение02 = Форма.ТабличныйДокумент.Области.Приложение02.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("Приложение02") Тогда
					Приложение02 = Форма.СтруктураДанныхФорма100Страница1.Приложение02;
				КонецЕсли;
				
				Приложение02 = ?(Приложение02 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("Приложение02", Приложение02);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение02.Значение = Приложение02;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение03" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Приложение03 = Форма.ТабличныйДокумент.Области.Приложение03.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("Приложение03") Тогда
					Приложение03 = Форма.СтруктураДанныхФорма100Страница1.Приложение03;
				КонецЕсли;
				
				Приложение03 = ?(Приложение03 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("Приложение03", Приложение03);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение03.Значение = Приложение03;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение04" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Приложение04 = Форма.ТабличныйДокумент.Области.Приложение04.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("Приложение04") Тогда
					Приложение04 = Форма.СтруктураДанныхФорма100Страница1.Приложение04;
				КонецЕсли;
				
				Приложение04 = ?(Приложение04 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("Приложение04", Приложение04);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение04.Значение = Приложение04;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение05" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Приложение05 = Форма.ТабличныйДокумент.Области.Приложение05.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("Приложение05") Тогда
					Приложение05 = Форма.СтруктураДанныхФорма100Страница1.Приложение05;
				КонецЕсли;
				
				Приложение05 = ?(Приложение05 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("Приложение05", Приложение05);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение05.Значение = Приложение05;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение06" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Приложение06 = Форма.ТабличныйДокумент.Области.Приложение06.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("Приложение06") Тогда
					Приложение06 = Форма.СтруктураДанныхФорма100Страница1.Приложение06;
				КонецЕсли;
				
				Приложение06 = ?(Приложение06 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("Приложение06", Приложение06);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение06.Значение = Приложение06;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение07" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Приложение07 = Форма.ТабличныйДокумент.Области.Приложение07.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("Приложение07") Тогда
					Приложение07 = Форма.СтруктураДанныхФорма100Страница1.Приложение07;
				КонецЕсли;
				
				Приложение07 = ?(Приложение07 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("Приложение07", Приложение07);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение07.Значение = Приложение07;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение08" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Приложение08 = Форма.ТабличныйДокумент.Области.Приложение08.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("Приложение08") Тогда
					Приложение08 = Форма.СтруктураДанныхФорма100Страница1.Приложение08;
				КонецЕсли;
				
				Приложение08 = ?(Приложение08 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("Приложение08", Приложение08);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение08.Значение = Приложение08;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.КатегорияНалПл, ОбластьИмя) > 0 Тогда
			
			КатегорияA = "";
			КатегорияB = "";
			КатегорияC = "";
			
			Если ОбластьИмя = "КатегорияA" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					КатегорияA = Форма.ТабличныйДокумент.Области.КатегорияA.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("КатегорияA") Тогда
					КатегорияA = Форма.СтруктураДанныхФорма100Страница1.КатегорияA;
				КонецЕсли;
				
				КатегорияA = ?(КатегорияA = "Х","","Х");
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("КатегорияA", КатегорияA);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.КатегорияA.Значение = КатегорияA;
				КонецЕсли;
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("КатегорияB", "");
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.КатегорияB.Значение = "";
				КонецЕсли;
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("КатегорияC", "");
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.КатегорияC.Значение = "";
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "КатегорияB" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					КатегорияB = Форма.ТабличныйДокумент.Области.КатегорияB.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("КатегорияB") Тогда
					КатегорияB = Форма.СтруктураДанныхФорма100Страница1.КатегорияB;
				КонецЕсли;
				
				КатегорияB = ?(КатегорияB = "Х","","Х");
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("КатегорияB", КатегорияB);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.КатегорияB.Значение = КатегорияB;
				КонецЕсли;
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("КатегорияA", "");
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.КатегорияA.Значение = "";
				КонецЕсли;
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("КатегорияC", "");
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.КатегорияC.Значение = "";
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "КатегорияC" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					КатегорияC = Форма.ТабличныйДокумент.Области.КатегорияC.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("КатегорияC") Тогда
					КатегорияC = Форма.СтруктураДанныхФорма100Страница1.КатегорияC;
				КонецЕсли;
				
				КатегорияC = ?(КатегорияC = "Х","","Х");
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("КатегорияC", КатегорияC);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.КатегорияC.Значение = КатегорияC;
				КонецЕсли;
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("КатегорияA", "");
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.КатегорияA.Значение = "";
				КонецЕсли;
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("КатегорияB", "");
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.КатегорияB.Значение = "";
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.РезидентУчереждение, ОбластьИмя) > 0 Тогда
		
			РезидентРК                = "";
			НерезидентРК              = "";
			ПостоянноеУчереждениеЗаРК = "";
			
			Если ОбластьИмя = "РезидентРК" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					РезидентРК = Форма.ТабличныйДокумент.Области.РезидентРК.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("РезидентРК") Тогда
					РезидентРК = Форма.СтруктураДанныхФорма100Страница1.РезидентРК;
				КонецЕсли;
				
				РезидентРК = ?(РезидентРК = "Х","","Х");
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("РезидентРК", РезидентРК);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.РезидентРК.Значение = РезидентРК;
				КонецЕсли;
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("НерезидентРК", "");
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.НерезидентРК.Значение = "";
				КонецЕсли;
				
				
			ИначеЕсли ОбластьИмя = "НерезидентРК" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					НерезидентРК = Форма.ТабличныйДокумент.Области.НерезидентРК.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("НерезидентРК") Тогда
					НерезидентРК = Форма.СтруктураДанныхФорма100Страница1.НерезидентРК;
				КонецЕсли;
				
				НерезидентРК = ?(НерезидентРК = "Х","","Х");
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("НерезидентРК", НерезидентРК);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.НерезидентРК.Значение = НерезидентРК;
				КонецЕсли;
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("РезидентРК", "");
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.РезидентРК.Значение = "";
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "ПостоянноеУчереждениеЗаРК" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					ПостоянноеУчереждениеЗаРК = Форма.ТабличныйДокумент.Области.ПостоянноеУчереждениеЗаРК.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("ПостоянноеУчереждениеЗаРК") Тогда
					ПостоянноеУчереждениеЗаРК = Форма.СтруктураДанныхФорма100Страница1.ПостоянноеУчереждениеЗаРК;
				КонецЕсли;
				
				ПостоянноеУчереждениеЗаРК = ?(ПостоянноеУчереждениеЗаРК = "Х","","Х");
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("ПостоянноеУчереждениеЗаРК", ПостоянноеУчереждениеЗаРК);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.ПостоянноеУчереждениеЗаРК.Значение = ПостоянноеУчереждениеЗаРК;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//100.00.003
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010003001, ОбластьИмя) > 0 Тогда
			
			ОкрП000010003001 = 0;
			ОкрП000010003101 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
				ОкрП000010003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010003001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("П000010003001") Тогда
				ОкрП000010003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница1.П000010003001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
				ОкрП000010003101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010003101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("П000010003101") Тогда
				ОкрП000010003101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница1.П000010003101);
			КонецЕсли;
			
			СуммаДляП000010003001 = ОкрП000010003101;
			
			Если ОбластьИмя = "П000010003001" Тогда //Изменили итоговую строку
			
				Форма.СтруктураДанныхФорма100Страница1.Вставить("П000010003001", ОкрП000010003001);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.П000010003001.Значение = ОкрП000010003001;
				КонецЕсли;
				
				Если СуммаДляП000010003001 > ОкрП000010003001 Тогда
					Форма.СтруктураДанныхФорма100Страница1.Вставить("П000010003101", 0);
					
					Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
						Форма.ТабличныйДокумент.Области.П000010003101.Значение = 0;
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "П000010003101" Тогда //Изменили подстроку I
				
				Если Форма.СтруктураДанныхФорма100Страница1.Свойство("П000010003101") Тогда
					П000010003101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница1.П000010003101);
				Иначе
					П000010003101 = 0;
				КонецЕсли;
				
				П000010003001= СуммаДляП000010003001 + ОкрП000010003001 - П000010003101;
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("П000010003001", П000010003001);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.П000010003001.Значение = П000010003001;
				КонецЕсли;
				
				//Дозапишем данные в структуру по изменяемой ячейке.
				ЗначениеИзСтруктуры = ?(Форма.СтруктураДанныхФорма100Страница1.Свойство(ОбластьИмя),
					РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница1[ОбластьИмя]),0);
				Форма.СтруктураДанныхФорма100Страница1.Вставить("П000010003101",ЗначениеИзСтруктуры +(П000010003001 - ОкрП000010003001));
				
			КонецЕсли;
			
			Расчет(Форма, "Форма100Страница1", "П000010003001_Рекурсия");  //перерасчет 1й стр. форма 100.00
			
		КонецЕсли;
		
		//100.00.004
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010004001, ОбластьИмя) > 0 Тогда
			
			ОкрП000010004001 = 0;
			ОкрП000010006001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
				ОкрП000010004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010004001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("П000010004001") Тогда
				ОкрП000010004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница1.П000010004001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
				ОкрП000010006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010006001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("П000010006001") Тогда
				ОкрП000010006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница1.П000010006001);
			КонецЕсли;
			
			СуммаДляП000010004001 = ОкрП000010006001;
			
			Если ОбластьИмя = "П000010004001" Тогда //Изменили итоговую строку
			
				Форма.СтруктураДанныхФорма100Страница1.Вставить("П000010004001", ОкрП000010004001);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.П000010004001.Значение = ОкрП000010004001;
				КонецЕсли;
				
				Если СуммаДляП000010004001 > ОкрП000010004001 Тогда
					Форма.СтруктураДанныхФорма100Страница1.Вставить("П000010006001", 0);
					
					Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
						Форма.ТабличныйДокумент.Области.П000010006001.Значение = 0;
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "П000010006001" Тогда //Изменили строку 100.00.006
				
				Если Форма.СтруктураДанныхФорма100Страница1.Свойство("П000010006001") Тогда
					П000010006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница1.П000010006001);
				Иначе
					П000010006001 = 0;
				КонецЕсли;
				
				П000010004001= СуммаДляП000010004001 + ОкрП000010004001 - П000010006001;
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить("П000010004001", П000010004001);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
					Форма.ТабличныйДокумент.Области.П000010004001.Значение = П000010004001;
				КонецЕсли;
				
				//Дозапишем данные в структуру по изменяемой ячейке.
				ЗначениеИзСтруктуры = ?(Форма.СтруктураДанныхФорма100Страница1.Свойство(ОбластьИмя),
					РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница1[ОбластьИмя]),0);
				
				Форма.СтруктураДанныхФорма100Страница1.Вставить(ОбластьИмя,ЗначениеИзСтруктуры +(П000010004001 - ОкрП000010004001));
				
			КонецЕсли;
			
			Расчет(Форма, "Форма100Страница1", "П000010004001_Рекурсия");  //перерасчет 1й стр. форма 100.00
			
		КонецЕсли;
		
		//100.00.005
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010005001, ОбластьИмя) > 0 Тогда
			
			ОкрП000010001001 = 0;
			ОкрП000010002001 = 0;
			ОкрП000010003001 = 0;
			ОкрП000010004001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
				ОкрП000010001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("П000010001001") Тогда
				ОкрП000010001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница1.П000010001001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
				ОкрП000010002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010002001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("П000010002001") Тогда
				ОкрП000010002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница1.П000010002001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
				ОкрП000010003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010003001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("П000010003001") Тогда
				ОкрП000010003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница1.П000010003001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
				ОкрП000010004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010004001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("П000010004001") Тогда
				ОкрП000010004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница1.П000010004001);
			КонецЕсли;
			
			П000010005001 = ОкрП000010001001 + ОкрП000010002001 + ОкрП000010003001 + ОкрП000010004001;
			
			Форма.СтруктураДанныхФорма100Страница1.Вставить("П000010005001", П000010005001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010005001.Значение = П000010005001;
			КонецЕсли;
			
			Расчет(Форма, "Форма100Страница1", "П000010005001");  //перерасчет 1й стр. форма 100.00
			
		КонецЕсли;
		
		//100.00.008
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010008001, ОбластьИмя) > 0 Тогда
			
			ОкрП000010005001 = 0;
			ОкрП000010006001 = 0;
			ОкрП000010007001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
				ОкрП000010005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010005001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("П000010005001") Тогда
				ОкрП000010005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница1.П000010005001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
				ОкрП000010006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010006001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("П000010006001") Тогда
				ОкрП000010006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница1.П000010006001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
				ОкрП000010007001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010007001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("П000010007001") Тогда
				ОкрП000010007001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница1.П000010007001);
			КонецЕсли;
			
			П000010008001 = ОкрП000010005001 - ОкрП000010006001 + ОкрП000010007001;
			
			Форма.СтруктураДанныхФорма100Страница1.Вставить("П000010008001", П000010008001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010008001.Значение = П000010008001;
			КонецЕсли;
			
			Расчет(Форма, "Форма100Страница3", "П000010008001");  //перерасчет 3й стр. форма 100.00
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма100Страница2" Тогда
		
		//100.00.009 III
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020009301, ОбластьИмя) > 0 Тогда
			
			ОкрП000020009311 = 0;
			ОкрП000020009321 = 0;
			ОкрП000020009331 = 0;
			ОкрП000020009341 = 0;
			ОкрП000020009351 = 0;
			ОкрП000020009361 = 0;
			ОкрП000020009371 = 0;
			ОкрП000020009381 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020009311 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009311.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020009311") Тогда
				ОкрП000020009311 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020009311);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020009321 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009321.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020009321") Тогда
				ОкрП000020009321 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020009321);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020009331 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009331.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020009331") Тогда
				ОкрП000020009331 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020009331);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020009341 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009341.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020009341") Тогда
				ОкрП000020009341 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020009341);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020009351 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009351.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020009351") Тогда
				ОкрП000020009351 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020009351);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020009361 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009361.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020009361") Тогда
				ОкрП000020009361 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020009361);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020009371 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009371.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020009371") Тогда
				ОкрП000020009371 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020009371);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020009381 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009381.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020009381") Тогда
				ОкрП000020009381 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020009381);
			КонецЕсли;
			
			П000020009301 = ОкрП000020009311 + ОкрП000020009321 + ОкрП000020009331 + ОкрП000020009341 + ОкрП000020009351 + ОкрП000020009361 + ОкрП000020009371 + ОкрП000020009381;
			
			Форма.СтруктураДанныхФорма100Страница2.Вставить("П000020009301", П000020009301);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020009301.Значение = П000020009301;
			КонецЕсли;
			
			Расчет(Форма, "Форма100Страница2", "П000020009301");  //перерасчет 2й стр. форма 100.00
			
		КонецЕсли;
		
		//100.00.009
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020009001, ОбластьИмя) > 0 Тогда
			
			ОкрП000020009101 = 0;
			ОкрП000020009201 = 0;
			ОкрП000020009301 = 0;
			ОкрП000020009401 = 0;
			ОкрП000020009501 = 0;
			ОкрП000020009601 = 0;
			ОкрП000020009701 = 0;
			ОкрП000020009801 = 0;
			ОкрП000020009901 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020009101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020009101") Тогда
				ОкрП000020009101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020009101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020009201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020009201") Тогда
				ОкрП000020009201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020009201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020009301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020009301") Тогда
				ОкрП000020009301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020009301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020009401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020009401") Тогда
				ОкрП000020009401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020009401);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020009501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009501.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020009501") Тогда
				ОкрП000020009501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020009501);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020009601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009601.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020009601") Тогда
				ОкрП000020009601 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020009601);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020009701 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009701.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020009701") Тогда
				ОкрП000020009701 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020009701);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020009801 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009801.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020009801") Тогда
				ОкрП000020009801 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020009801);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020009901 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009901.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020009901") Тогда
				ОкрП000020009901 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020009901);
			КонецЕсли;
			
			П000020009001 = ОкрП000020009101 - ОкрП000020009201 + ОкрП000020009301 + ОкрП000020009401 + ОкрП000020009501 - ОкрП000020009601 - ОкрП000020009701 - ОкрП000020009801 - ОкрП000020009901;
			
			Форма.СтруктураДанныхФорма100Страница2.Вставить("П000020009001", П000020009001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020009001.Значение = П000020009001;
			КонецЕсли;
			
			Расчет(Форма, "Форма100Страница3", "П000030021101");  //перерасчет 3й стр. форма 100.00
			
		КонецЕсли;
		
		//100.00.017
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020017001, ОбластьИмя) > 0 Тогда
			
			ОкрП000230011001 = 0;
			ОкрП000230012001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница3" Тогда
				ОкрП000230011001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000230011001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница3.Свойство("П000230011001") Тогда
				ОкрП000230011001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница3.П000230011001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница3" Тогда
				ОкрП000230012001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000230012001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница3.Свойство("П000230012001") Тогда
				ОкрП000230012001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница3.П000230012001);
			КонецЕсли;
			
			П000020017001 = ОкрП000230011001 + ОкрП000230012001;
			
			Форма.СтруктураДанныхФорма100Страница2.Вставить("П000020017001", П000020017001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020017001.Значение = П000020017001;
			КонецЕсли;
			
			Расчет(Форма, "Форма100Страница3", "П000020017001");  //перерасчет 3й стр. форма 100.00
			
		КонецЕсли;
		
		//100.00.019
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020019001, ОбластьИмя) > 0 Тогда
			
			ОкрП000020019001 = 0;
			ОкрП000020019101 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020019001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020019001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("П000020019001") Тогда
				ОкрП000020019001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница1.П000020019001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020019101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020019101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("П000020019101") Тогда
				ОкрП000020019101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница1.П000020019101);
			КонецЕсли;
			
			СуммаДляП000020019001 = ОкрП000020019101;
			
			Если ОбластьИмя = "П000020019001" Тогда //Изменили итоговую строку
			
				Форма.СтруктураДанныхФорма100Страница2.Вставить("П000020019001", ОкрП000020019001);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
					Форма.ТабличныйДокумент.Области.П000020019001.Значение = ОкрП000020019001;
				КонецЕсли;
				
				Если СуммаДляП000020019001 > ОкрП000020019001 Тогда
					Форма.СтруктураДанныхФорма100Страница2.Вставить("П000020019101", 0);
					
					Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
						Форма.ТабличныйДокумент.Области.П000020019101.Значение = 0;
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе //Изменили подстроку I
				
				Если Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020019101") Тогда
					П000020019101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020019101);
				Иначе
					П000020019101 = 0;
				КонецЕсли;
				
				П000020019001= СуммаДляП000020019001 + ОкрП000020019001 - П000020019101;
				
				Форма.СтруктураДанныхФорма100Страница2.Вставить("П000020019001", П000020019001);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
					Форма.ТабличныйДокумент.Области.П000020019001.Значение = П000020019001;
				КонецЕсли;
				
				//Дозапишем данные в структуру по изменяемой ячейке.
				ЗначениеИзСтруктуры = ?(Форма.СтруктураДанныхФорма100Страница2.Свойство(ОбластьИмя),
					РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2[ОбластьИмя]),0);
				
				Форма.СтруктураДанныхФорма100Страница2.Вставить(ОбластьИмя,ЗначениеИзСтруктуры +(П000020019001 - ОкрП000020019001));
				
			КонецЕсли;
			
			Расчет(Форма, "Форма100Страница3", "П000020019001");  //перерасчет 3й стр. форма 100.00
			
		КонецЕсли;
		
		Если    "П000020010001" = ОбластьИмя 
			ИЛИ "П000020011001" = ОбластьИмя 
			ИЛИ "П000020012001" = ОбластьИмя 
			ИЛИ "П000020013001" = ОбластьИмя 
			ИЛИ "П000020014001" = ОбластьИмя 
			ИЛИ "П000020015001" = ОбластьИмя 
			ИЛИ "П000020016001" = ОбластьИмя 
			ИЛИ "П000020018001" = ОбластьИмя 
			ИЛИ "П000020020001" = ОбластьИмя  Тогда
			
			//Расчет(Форма, "Форма100Страница3", "П000030021101");  //перерасчет 3й стр. форма 100.00
			Расчет(Форма, "Форма100Страница3", ОбластьИмя);  //перерасчет 3й стр. форма 100.00
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма100Страница3" Тогда
		
		//100.00.021 100.00.021 I
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030021101, ОбластьИмя) > 0 Тогда
			
			ОкрП000020009001 = 0;
			ОкрП000020010001 = 0;
			ОкрП000020011001 = 0;
			ОкрП000020012001 = 0;
			ОкрП000020013001 = 0;
			ОкрП000020014001 = 0;
			ОкрП000020015001 = 0;
			ОкрП000020016001 = 0;
			ОкрП000020017001 = 0;
			ОкрП000020018001 = 0;
			ОкрП000020019001 = 0;
			ОкрП000020020001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020009001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020009001") Тогда
				ОкрП000020009001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020009001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020010001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020010001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020010001") Тогда
				ОкрП000020010001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020010001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020011001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020011001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020011001") Тогда
				ОкрП000020011001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020011001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020012001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020012001") Тогда
				ОкрП000020012001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020012001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020013001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020013001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020013001") Тогда
				ОкрП000020013001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020013001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020014001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020014001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020014001") Тогда
				ОкрП000020014001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020014001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020015001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020015001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020015001") Тогда
				ОкрП000020015001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020015001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020016001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020016001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020016001") Тогда
				ОкрП000020016001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020016001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020017001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020017001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020017001") Тогда
				ОкрП000020017001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020017001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020018001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020018001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020018001") Тогда
				ОкрП000020018001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020018001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020019001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020019001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020019001") Тогда
				ОкрП000020019001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020019001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница2" Тогда
				ОкрП000020020001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020020001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница2.Свойство("П000020020001") Тогда
				ОкрП000020020001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница2.П000020020001);
			КонецЕсли;
			
			П000030021101 = ОкрП000020009001 + ОкрП000020010001 + ОкрП000020011001 + ОкрП000020012001 + ОкрП000020013001 + ОкрП000020014001 + ОкрП000020015001 + ОкрП000020016001 + ОкрП000020017001 + ОкрП000020018001 + ОкрП000020019001 + ОкрП000020020001;
			
			Форма.СтруктураДанныхФорма100Страница3.Вставить("П000030021101", П000030021101);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030021101.Значение = П000030021101;
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма100Страница3.Вставить("П000030021001", П000030021101);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030021001.Значение = П000030021101;
			КонецЕсли;
			
		КонецЕсли;
		
		//100.00.022
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030022001, ОбластьИмя) > 0 Тогда
			
			ОкрП000030022101 = 0;
			ОкрП000030022201 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030022101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030022101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030022101") Тогда
				ОкрП000030022101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030022101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030022201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030022201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030022201") Тогда
				ОкрП000030022201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030022201);
			КонецЕсли;
			
			П000030022001 = ОкрП000030022101 - ОкрП000030022201;
			
			Форма.СтруктураДанныхФорма100Страница3.Вставить("П000030022001", П000030022001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030022001.Значение = П000030022001;
			КонецЕсли;
			
		КонецЕсли;
		
		//100.00.025
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030025001, ОбластьИмя) > 0 Тогда
			
			ОкрП000010008001 = 0;
			ОкрП000030021001 = 0;
			ОкрП000030022001 = 0;
			ОкрП000030023001 = 0;
			ОкрП000030024001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
				ОкрП000010008001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010008001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница1.Свойство("П000010008001") Тогда
				ОкрП000010008001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница1.П000010008001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030021001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030021001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030021001") Тогда
				ОкрП000030021001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030021001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030022001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030022001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030022001") Тогда
				ОкрП000030022001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030022001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030023001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030023001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030023001") Тогда
				ОкрП000030023001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030023001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030024001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030024001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030024001") Тогда
				ОкрП000030024001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030024001);
			КонецЕсли;
			
			П000030025001 = ОкрП000010008001 - ОкрП000030021001 + ОкрП000030022001 + ОкрП000030023001 - ОкрП000030024001;
			
			Форма.СтруктураДанныхФорма100Страница3.Вставить("П000030025001", П000030025001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030025001.Значение = П000030025001;
			КонецЕсли;
			
		КонецЕсли;
		
		//100.00.026
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030026001, ОбластьИмя) > 0 Тогда
			
			ОкрП000030026001 = 0;
			ОкрП000030026101 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030026001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030026001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030026001") Тогда
				ОкрП000030026001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030026001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030026101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030026101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030026101") Тогда
				ОкрП000030026101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030026101);
			КонецЕсли;
			
			СуммаДляП000030026001 = ОкрП000030026101;
			
			Если ОбластьИмя = "П000030026001" Тогда //Изменили итоговую строку
			
				Форма.СтруктураДанныхФорма100Страница3.Вставить("П000030026001", ОкрП000030026001);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
					Форма.ТабличныйДокумент.Области.П000030026001.Значение = ОкрП000030026001;
				КонецЕсли;
				
				Если СуммаДляП000030026001 > ОкрП000030026001 Тогда
					Форма.СтруктураДанныхФорма100Страница2.Вставить("П000030026101", 0);
					
					Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
						Форма.ТабличныйДокумент.Области.П000030026101.Значение = 0;
					КонецЕсли;
					
					Расчет(Форма, "Форма100Страница3", "П000030026101_Рекурсия");  //перерасчет 3й стр. форма 100.00
					
				КонецЕсли;
				
			Иначе //Изменили подстроку I
				
				Если Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030026101") Тогда
					П000030026101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030026101);
				Иначе
					П000030026101 = 0;
				КонецЕсли;
				
				П000030026001= СуммаДляП000030026001 + ОкрП000030026001 - П000030026101;
				
				Форма.СтруктураДанныхФорма100Страница3.Вставить("П000030026001", П000030026001);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
					Форма.ТабличныйДокумент.Области.П000030026001.Значение = П000030026001;
				КонецЕсли;
				
				//Дозапишем данные в структуру по изменяемой ячейке.
				ЗначениеИзСтруктуры = ?(Форма.СтруктураДанныхФорма100Страница3.Свойство(ОбластьИмя),
					РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3[ОбластьИмя]),0);
				
				Форма.СтруктураДанныхФорма100Страница3.Вставить(ОбластьИмя,ЗначениеИзСтруктуры +(П000030026001 - ОкрП000030026001));
				
			КонецЕсли;
			
		КонецЕсли;
		
		//100.00.028
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030028001, ОбластьИмя) > 0 Тогда
			
			ОкрП000030025001 = 0;
			ОкрП000030026101 = 0;
			ОкрП000030027001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030025001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030025001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030025001") Тогда
				ОкрП000030025001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030025001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030026101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030026101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030026101") Тогда
				ОкрП000030026101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030026101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030027001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030027001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030027001") Тогда
				ОкрП000030027001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030027001);
			КонецЕсли;
			
			П000030028001 = ОкрП000030025001 + ОкрП000030026101 - ОкрП000030027001;
			
			Форма.СтруктураДанныхФорма100Страница3.Вставить("П000030028001", П000030028001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030028001.Значение = П000030028001;
			КонецЕсли;
			
			Расчет(Форма, "Форма100Страница3", "П000030028001");  //перерасчет 3й стр. форма 100.00
			
		КонецЕсли;
		
		//100.00.029
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030029001, ОбластьИмя) > 0 Тогда
			
			ОкрП000030028001 = 0;
			ОкрП000220008101 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030028001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030028001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030028001") Тогда
				ОкрП000030028001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030028001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220008101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220008101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220008101") Тогда
				ОкрП000220008101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220008101);
			КонецЕсли;
			
			П000030029001 = ОкрП000220008101 + ?(ОкрП000030028001 < 0, -ОкрП000030028001,0);
			
			Форма.СтруктураДанныхФорма100Страница3.Вставить("П000030029001", П000030029001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030029001.Значение = П000030029001;
			КонецЕсли;
			
		КонецЕсли;
		
		//100.00.030
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030030001, ОбластьИмя) > 0 Тогда
			
			ОкрП000030030001 = 0;
			ОкрП000030030101 = 0;
			ОкрП000030030201 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030030001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030030001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030030001") Тогда
				ОкрП000030030001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030030001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030030101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030030101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030030101") Тогда
				ОкрП000030030101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030030101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030030201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030030201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030030201") Тогда
				ОкрП000030030201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030030201);
			КонецЕсли;
			
			СуммаДляП000030030001 = ОкрП000030030101 + ОкрП000030030201;
			
			Если ОбластьИмя = "П000030030001" Тогда //Изменили итоговую строку
			
				Форма.СтруктураДанныхФорма100Страница3.Вставить("П000030030001", ОкрП000030030001);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
					Форма.ТабличныйДокумент.Области.П000030030001.Значение = ОкрП000030030001;
				КонецЕсли;
				
				Если СуммаДляП000030030001 > ОкрП000030030001 Тогда
					Форма.СтруктураДанныхФорма100Страница3.Вставить("П000030030101", 0);
					Форма.СтруктураДанныхФорма100Страница3.Вставить("П000030030201", 0);
					
					Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
						Форма.ТабличныйДокумент.Области.П000030030101.Значение = 0;
						Форма.ТабличныйДокумент.Области.П000030030201.Значение = 0;
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе //Изменили подстроки I II
				
				Если Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030030101") Тогда
					П000030030101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030030101);
				Иначе
					П000030030101 = 0;
				КонецЕсли;
				
				Если Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030030201") Тогда
					П000030030201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030030201);
				Иначе
					П000030030201 = 0;
				КонецЕсли;
				
				П000030030001 = СуммаДляП000030030001 + ОкрП000030030001 - (П000030030101 + П000030030201);
				
				Форма.СтруктураДанныхФорма100Страница3.Вставить("П000030030001", П000030030001);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
					Форма.ТабличныйДокумент.Области.П000030030001.Значение = П000030030001;
				КонецЕсли;
				
				//Дозапишем данные в структуру по изменяемой ячейке.
				ЗначениеИзСтруктуры = ?(Форма.СтруктураДанныхФорма100Страница3.Свойство(ОбластьИмя),
					РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3[ОбластьИмя]),0);
				
				Форма.СтруктураДанныхФорма100Страница3.Вставить(ОбластьИмя,ЗначениеИзСтруктуры +(П000030030001 - ОкрП000030030001));
				
			КонецЕсли;
			
			Расчет(Форма, "Форма100Страница3", "П000030030001_Рекурсия");  //перерасчет 3й стр. форма 100.00
			
		КонецЕсли;
		
		//100.00.031
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030031001, ОбластьИмя) > 0 Тогда
			
			ОкрП000030028001 = 0;
			ОкрП000030030001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030028001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030028001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030028001") Тогда
				ОкрП000030028001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030028001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030030001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030030001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030030001") Тогда
				ОкрП000030030001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030030001);
			КонецЕсли;
			
			Разность = ОкрП000030028001 - ОкрП000030030001;
			
			П000030031001 =?(Разность < 0,0,Разность);
			
			Форма.СтруктураДанныхФорма100Страница3.Вставить("П000030031001", П000030031001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030031001.Значение = П000030031001;
			КонецЕсли;
			
			Расчет(Форма, "Форма100Страница3", "П000030031001");  //перерасчет 3й стр. форма 100.00
			
		КонецЕсли;
		
		//100.00.033
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030033001, ОбластьИмя) > 0 Тогда
			
			ОкрП000030031001 = 0;
			ОкрП000030032001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030031001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030031001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030031001") Тогда
				ОкрП000030031001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030031001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030032001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030032001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030032001") Тогда
				ОкрП000030032001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030032001);
			КонецЕсли;
			
			Разность = ОкрП000030031001 - ОкрП000030032001;
			
			П000030033001 =?(Разность < 0,0,Разность);
			
			Форма.СтруктураДанныхФорма100Страница3.Вставить("П000030033001", П000030033001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030033001.Значение = П000030033001;
			КонецЕсли;
			
			Расчет(Форма, "Форма100Страница3", "П000030033001");  //перерасчет 3й стр. форма 100.00
			Расчет(Форма, "Форма100Страница4", "П000030033001");  //перерасчет 3й стр. форма 100.00
			
		КонецЕсли;
		
		//100.00.035
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030035001, ОбластьИмя) > 0 Тогда
			
			ОкрП000030033001 = 0;
			ОкрП000030034001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030033001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030033001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030033001") Тогда
				ОкрП000030033001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030033001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030034001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030034001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030034001") Тогда
				ОкрП000030034001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030034001);
			КонецЕсли;
			
			П000030035001 = Окр(ОкрП000030033001 * ОкрП000030034001 / 100);
			
			Форма.СтруктураДанныхФорма100Страница3.Вставить("П000030035001", П000030035001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030035001.Значение = П000030035001;
			КонецЕсли;
			
			Расчет(Форма, "Форма100Страница4", "П000030035001");  //перерасчет 4й стр. форма 100.00
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма100Страница4" Тогда
		
		//100.00.036
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000040036001, ОбластьИмя) > 0 Тогда
			
			ОкрП000030035001 = 0;
			ОкрП000040036101 = 0;
			ОкрП000040036201 = 0;
			ОкрП000040036301 = 0;
			ОкрП000040036401 = 0;
			ОкрП000040036501 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030035001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030035001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030035001") Тогда
				ОкрП000030035001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030035001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница4" Тогда
				ОкрП000040036101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040036101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница4.Свойство("П000040036101") Тогда
				ОкрП000040036101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница4.П000040036101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница4" Тогда
				ОкрП000040036201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040036201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница4.Свойство("П000040036201") Тогда
				ОкрП000040036201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница4.П000040036201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница4" Тогда
				ОкрП000040036301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040036301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница4.Свойство("П000040036301") Тогда
				ОкрП000040036301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница4.П000040036301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница4" Тогда
				ОкрП000040036401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040036401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница4.Свойство("П000040036401") Тогда
				ОкрП000040036401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница4.П000040036401);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница4" Тогда
				ОкрП000040036501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040036501.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница4.Свойство("П000040036501") Тогда
				ОкрП000040036501 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница4.П000040036501);
			КонецЕсли;
			
			Разность = ОкрП000030035001 - ОкрП000040036101 - ОкрП000040036201 - ОкрП000040036301 - ОкрП000040036401 - ОкрП000040036501;
			
			П000040036001 = ?(Разность < 0,0,Разность);
			
			Форма.СтруктураДанныхФорма100Страница4.Вставить("П000040036001", П000040036001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница4" Тогда
				Форма.ТабличныйДокумент.Области.П000040036001.Значение = П000040036001;
			КонецЕсли;
			
			Расчет(Форма, "Форма100Страница4", "П000040036001");  //перерасчет 4й стр. форма 100.00
			
		КонецЕсли;
		
		//100.00.037
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000040037001, ОбластьИмя) > 0 Тогда
			
			ОкрП000040036001 = 0;
			ОкрП000040037101 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница4" Тогда
				ОкрП000040036001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040036001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница4.Свойство("П000040036001") Тогда
				ОкрП000040036001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница4.П000040036001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница4" Тогда
				ОкрП000040037101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040037101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница4.Свойство("П000040037101") Тогда
				ОкрП000040037101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница4.П000040037101);
			КонецЕсли;
			
			П000040037001 = ОкрП000040036001 - ОкрП000040037101;
			
			Форма.СтруктураДанныхФорма100Страница4.Вставить("П000040037001", П000040037001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница4" Тогда
				Форма.ТабличныйДокумент.Области.П000040037001.Значение = П000040037001;
			КонецЕсли;
			
			Расчет(Форма, "Форма100Страница4", "П000040037001");  //перерасчет 4й стр. форма 100.00
			
		КонецЕсли;
		
		//100.00.038
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000040038001, ОбластьИмя) > 0 Тогда
			
			ОкрП000030033001 = 0;
			ОкрП000030035001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030033001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030033001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030033001") Тогда
				ОкрП000030033001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030033001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница3" Тогда
				ОкрП000030035001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030035001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница3.Свойство("П000030035001") Тогда
				ОкрП000030035001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница3.П000030035001);
			КонецЕсли;
			
			П000040038001 = ОкрП000030033001 - ОкрП000030035001;
			
			Форма.СтруктураДанныхФорма100Страница4.Вставить("П000040038001", П000040038001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница4" Тогда
				Форма.ТабличныйДокумент.Области.П000040038001.Значение = П000040038001;
			КонецЕсли;
			
		КонецЕсли;
		
		//100.00.040
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000040040001, ОбластьИмя) > 0 Тогда
			
			ОкрП000040037001 = 0;
			ОкрП000040039101 = 0;
			ОкрП000040039202 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница4" Тогда
				ОкрП000040037001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040037001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница4.Свойство("П000040037001") Тогда
				ОкрП000040037001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница4.П000040037001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница4" Тогда
				ОкрП000040039101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040039101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница4.Свойство("П000040039101") Тогда
				ОкрП000040039101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница4.П000040039101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница4" Тогда
				ОкрП000040039202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040039202.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100Страница4.Свойство("П000040039202") Тогда
				ОкрП000040039202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100Страница4.П000040039202);
			КонецЕсли;
			
			П000040040001 = ОкрП000040037001 + ОкрП000040039101 + ОкрП000040039202;
			
			Форма.СтруктураДанныхФорма100Страница4.Вставить("П000040040001", П000040040001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница4" Тогда
				Форма.ТабличныйДокумент.Области.П000040040001.Значение = П000040040001;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма100_01Страница1" Тогда
		
		Форма.СтруктураДанныхФорма100Страница1.Вставить("Приложение01", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение01.Значение = "Х";
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000110000101_1, ОбластьИмя)> 0 Тогда 
			
			НомерСтроки = 2;
			Форма.СтруктураДанныхФорма100_01Страница1.Вставить("П000110000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма100_01Страница2.Вставить("П000120000201_1", НомерСтроки);
			
			Форма.П0001100001[0].П000110000101 = НомерСтроки;
			Форма.П0001200002[0].П000120000201 = НомерСтроки;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000110000101_1.Значение = 2;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) Тогда
			Расчет(Форма, "Форма100_01Страница2");  //перерасчет 2й стр. форма 100.01
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма100_01Страница2" Тогда
		
		Форма.СтруктураДанныхФорма100Страница1.Вставить("Приложение01", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение01.Значение = "Х";
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000120000201_1, ОбластьИмя)> 0 Тогда 
			
			НомерСтроки = 2;
			Форма.СтруктураДанныхФорма100_01Страница1.Вставить("П000110000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма100_01Страница2.Вставить("П000120000201_1", НомерСтроки);
			
			Форма.П0001100001[0].П000110000101 = НомерСтроки;
			Форма.П0001200002[0].П000120000201 = НомерСтроки;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000120000201_1.Значение = 2;
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001F
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000120000102, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000120000102 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы12]].Количество() Цикл
					СуммаП000120000102 = СуммаП000120000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000120000202_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000120000102.Значение = СуммаП000120000102;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы12]].Количество() Цикл
					СуммаП000120000102 = СуммаП000120000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы12]][Ном - 1].П000120000202);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма100_01Страница2.Вставить("П000120000102", СуммаП000120000102);
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма100_02Страница1" Тогда
		
		Форма.СтруктураДанныхФорма100Страница1.Вставить("Приложение02", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение02.Значение = "Х";
		КонецЕсли;
		
		//100.02.001
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210001001, ОбластьИмя) > 0 Тогда
			
			ОкрП000210001101 = 0;
			ОкрП000210001201 = 0;
			ОкрП000210001301 = 0;
			ОкрП000210001401 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210001101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210001101") Тогда
				ОкрП000210001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210001101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210001201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210001201") Тогда
				ОкрП000210001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210001201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210001301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210001301") Тогда
				ОкрП000210001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210001301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210001401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210001401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210001401") Тогда
				ОкрП000210001401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210001401);
			КонецЕсли;
			
			
			П000210001001 = ОкрП000210001101 + ОкрП000210001201 + ОкрП000210001301 + ОкрП000210001401;
			
			Форма.СтруктураДанныхФорма100_02Страница1.Вставить("П000210001001", П000210001001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000210001001.Значение = П000210001001;
			КонецЕсли;
			
			Расчет(Форма, "Форма100_02Страница2",ОбластьИмя); //перерасчет 2й стр. форма 100.02
			
		КонецЕсли;
		
		//100.02.002
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210002001, ОбластьИмя) > 0 Тогда
			
			ОкрП000210002101 = 0;
			ОкрП000210002201 = 0;
			ОкрП000210002301 = 0;
			ОкрП000210002401 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210002101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210002101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210002101") Тогда
				ОкрП000210002101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210002101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210002201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210002201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210002201") Тогда
				ОкрП000210002201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210002201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210002301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210002301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210002301") Тогда
				ОкрП000210002301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210002301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210002401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210002401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210002401") Тогда
				ОкрП000210002401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210002401);
			КонецЕсли;
			
			
			П000210002001 = ОкрП000210002101 + ОкрП000210002201 + ОкрП000210002301 + ОкрП000210002401;
			
			Форма.СтруктураДанныхФорма100_02Страница1.Вставить("П000210002001", П000210002001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000210002001.Значение = П000210002001;
			КонецЕсли;
			
			Расчет(Форма, "Форма100_02Страница2",ОбластьИмя);  //перерасчет 2й стр. форма 100.02
			
		КонецЕсли;
		
		//100.02.003
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210003001, ОбластьИмя) > 0 Тогда
			
			ОкрП000210003101 = 0;
			ОкрП000210003201 = 0;
			ОкрП000210003301 = 0;
			ОкрП000210003401 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210003101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210003101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210003101") Тогда
				ОкрП000210003101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210003101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210003201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210003201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210003201") Тогда
				ОкрП000210003201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210003201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210003301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210003301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210003301") Тогда
				ОкрП000210003301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210003301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210003401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210003401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210003401") Тогда
				ОкрП000210003401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210003401);
			КонецЕсли;
			
			
			П000210003001 = ОкрП000210003101 + ОкрП000210003201 + ОкрП000210003301 + ОкрП000210003401;
			
			Форма.СтруктураДанныхФорма100_02Страница1.Вставить("П000210003001", П000210003001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000210003001.Значение = П000210003001;
			КонецЕсли;
			
			Расчет(Форма, "Форма100_02Страница2",ОбластьИмя); //перерасчет 2й стр. форма 100.02
			
		КонецЕсли;
		
		//100.02.004
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210004001, ОбластьИмя) > 0 Тогда
			
			ОкрП000210004101 = 0;
			ОкрП000210004201 = 0;
			ОкрП000210004301 = 0;
			ОкрП000210004401 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210004101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210004101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210004101") Тогда
				ОкрП000210004101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210004101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210004201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210004201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210004201") Тогда
				ОкрП000210004201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210004201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210004301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210004301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210004301") Тогда
				ОкрП000210004301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210004301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210004401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210004401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210004401") Тогда
				ОкрП000210004401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210004401);
			КонецЕсли;
			
			
			П000210004001 = ОкрП000210004101 + ОкрП000210004201 + ОкрП000210004301 + ОкрП000210004401;
			
			Форма.СтруктураДанныхФорма100_02Страница1.Вставить("П000210004001", П000210004001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000210004001.Значение = П000210004001;
			КонецЕсли;
			
			Расчет(Форма, "Форма100_02Страница2",ОбластьИмя);  //перерасчет 2й стр. форма 100.02
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма100_02Страница2" Тогда
		
		Форма.СтруктураДанныхФорма100Страница1.Вставить("Приложение02", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение02.Значение = "Х";
		КонецЕсли;
		
		//100.02.005
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000220005001, ОбластьИмя) > 0 Тогда
			
			ОкрП000220005101 = 0;
			ОкрП000220005201 = 0;
			ОкрП000220005301 = 0;
			ОкрП000220005401 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220005101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220005101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220005101") Тогда
				ОкрП000220005101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220005101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220005201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220005201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220005201") Тогда
				ОкрП000220005201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220005201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220005301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220005301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220005301") Тогда
				ОкрП000220005301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220005301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220005401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220005401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220005401") Тогда
				ОкрП000220005401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220005401);
			КонецЕсли;
			
			
			П000220005001 = ОкрП000220005101 + ОкрП000220005201 + ОкрП000220005301 + ОкрП000220005401;
			
			Форма.СтруктураДанныхФорма100_02Страница2.Вставить("П000220005001", П000220005001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000220005001.Значение = П000220005001;
			КонецЕсли;
			
		КонецЕсли;
		
		//100.02.006
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000220006001, ОбластьИмя) > 0 Тогда
			
			ОкрП000220006101 = 0;
			ОкрП000220006201 = 0;
			ОкрП000220006301 = 0;
			ОкрП000220006401 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220006101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220006101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220006101") Тогда
				ОкрП000220006101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220006101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220006201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220006201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220006201") Тогда
				ОкрП000220006201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220006201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220006301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220006301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220006301") Тогда
				ОкрП000220006301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220006301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220006401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220006401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220006401") Тогда
				ОкрП000220006401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220006401);
			КонецЕсли;
			
			
			П000220006001 = ОкрП000220006101 + ОкрП000220006201 + ОкрП000220006301 + ОкрП000220006401;
			
			Форма.СтруктураДанныхФорма100_02Страница2.Вставить("П000220006001", П000220006001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000220006001.Значение = П000220006001;
			КонецЕсли;
			
			Расчет(Форма, "Форма100_02Страница3",ОбластьИмя); //перерасчет 3й стр. форма 100.02
			
		КонецЕсли;
		
		//100.02.007
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000220007001, ОбластьИмя) > 0 Тогда
			
			ОкрП000220007101 = 0;
			ОкрП000220007201 = 0;
			ОкрП000220007301 = 0;
			ОкрП000220007401 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220007101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220007101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220007101") Тогда
				ОкрП000220007101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220007101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220007201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220007201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220007201") Тогда
				ОкрП000220007201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220007201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220007301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220007301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220007301") Тогда
				ОкрП000220007301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220007301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220007401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220007401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220007401") Тогда
				ОкрП000220007401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220007401);
			КонецЕсли;
			
			
			П000220007001 = ОкрП000220007101 + ОкрП000220007201 + ОкрП000220007301 + ОкрП000220007401;
			
			Форма.СтруктураДанныхФорма100_02Страница2.Вставить("П000220007001", П000220007001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000220007001.Значение = П000220007001;
			КонецЕсли;
			
			Расчет(Форма, "Форма100_02Страница3",ОбластьИмя); //перерасчет 3й стр. форма 100.02
			
		КонецЕсли;
		
		//100.02.008
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000220008001, ОбластьИмя) > 0 Тогда
			
			ОкрП000220008101 = 0;
			ОкрП000220008201 = 0;
			ОкрП000220008301 = 0;
			ОкрП000220008401 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220008101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220008101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220008101") Тогда
				ОкрП000220008101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220008101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220008201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220008201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220008201") Тогда
				ОкрП000220008201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220008201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220008301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220008301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220005301") Тогда
				ОкрП000220008301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220008301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220008401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220008401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220008401") Тогда
				ОкрП000220008401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220008401);
			КонецЕсли;
			
			
			П000220008001 = ОкрП000220008101 + ОкрП000220008201 + ОкрП000220008301 + ОкрП000220008401;
			
			Форма.СтруктураДанныхФорма100_02Страница2.Вставить("П000220008001", П000220008001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000220008001.Значение = П000220008001;
			КонецЕсли;
			
			Расчет(Форма, "Форма100_02Страница3",ОбластьИмя); //перерасчет 3й стр. форма 100.02
			
		КонецЕсли;
		
		//100.02.009
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000220009001, ОбластьИмя) > 0 Тогда
			
			ОкрП000220009101 = 0;
			ОкрП000220009201 = 0;
			ОкрП000220009301 = 0;
			ОкрП000220009401 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220009101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220009101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220009101") Тогда
				ОкрП000220009101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220009101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220009201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220009201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220009201") Тогда
				ОкрП000220009201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220009201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220009301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220009301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220009301") Тогда
				ОкрП000220009301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220009301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220009401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220009401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220009401") Тогда
				ОкрП000220009401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220009401);
			КонецЕсли;
			
			
			П000220009001 = ОкрП000220009101 + ОкрП000220009201 + ОкрП000220009301 + ОкрП000220009401;
			
			Форма.СтруктураДанныхФорма100_02Страница2.Вставить("П000220009001", П000220009001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000220009001.Значение = П000220009001;
			КонецЕсли;
			
			Расчет(Форма, "Форма100_02Страница3",ОбластьИмя); //перерасчет 3й стр. форма 100.02
			
		КонецЕсли;
		
		//100.02.005 I
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000220005101, ОбластьИмя) > 0 Тогда
			
			ОкрП000210001101 = 0;
			ОкрП000210002101 = 0;
			ОкрП000210003101 = 0;
			ОкрП000210004101 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210001101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210001101") Тогда
				ОкрП000210001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210001101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210002101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210002101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210002101") Тогда
				ОкрП000210002101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210002101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210003101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210003101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210003101") Тогда
				ОкрП000210003101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210003101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210004101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210004101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210004101") Тогда
				ОкрП000210004101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210004101);
			КонецЕсли;
			
			
			П000220005101 = ОкрП000210001101 + ОкрП000210002101 - ОкрП000210003101 + ОкрП000210004101;
			
			Форма.СтруктураДанныхФорма100_02Страница2.Вставить("П000220005101", П000220005101);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000220005101.Значение = П000220005101;
			КонецЕсли;
			
			Расчет(Форма, "Форма100_02Страница2","П000220005101"); //перерасчет 2й стр. форма 100.02
			
		КонецЕсли;
		
		//100.02.005 II
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000220005201, ОбластьИмя) > 0 Тогда
			
			ОкрП000210001201 = 0;
			ОкрП000210002201 = 0;
			ОкрП000210003201 = 0;
			ОкрП000210004201 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210001201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210001201") Тогда
				ОкрП000210001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210001201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210002201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210002201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210002201") Тогда
				ОкрП000210002201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210002201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210003201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210003201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210003201") Тогда
				ОкрП000210003201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210003201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210004201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210004201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210004201") Тогда
				ОкрП000210004201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210004201);
			КонецЕсли;
			
			
			П000220005201 = ОкрП000210001201 + ОкрП000210002201 - ОкрП000210003201 + ОкрП000210004201;
			
			Форма.СтруктураДанныхФорма100_02Страница2.Вставить("П000220005201", П000220005201);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000220005201.Значение = П000220005201;
			КонецЕсли;
			
			Расчет(Форма, "Форма100_02Страница2","П000220005201"); //перерасчет 2й стр. форма 100.02
			
		КонецЕсли;
		
		//100.02.005 III
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000220005301, ОбластьИмя) > 0 Тогда
			
			ОкрП000210001301 = 0;
			ОкрП000210002301 = 0;
			ОкрП000210003301 = 0;
			ОкрП000210004301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210001301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210001301") Тогда
				ОкрП000210001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210001301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210002301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210002301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210002301") Тогда
				ОкрП000210002301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210002301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210003301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210003301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210003301") Тогда
				ОкрП000210003301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210003301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210004301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210004301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210004301") Тогда
				ОкрП000210004301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210004301);
			КонецЕсли;
			
			
			П000220005301 = ОкрП000210001301 + ОкрП000210002301 - ОкрП000210003301 + ОкрП000210004301;
			
			Форма.СтруктураДанныхФорма100_02Страница2.Вставить("П000220005301", П000220005301);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000220005301.Значение = П000220005301;
			КонецЕсли;
			
			Расчет(Форма, "Форма100_02Страница2","П000220005301"); //перерасчет 2й стр. форма 100.02
			
		КонецЕсли;
		
		//100.02.005 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000220005401, ОбластьИмя) > 0 Тогда
			
			ОкрП000210001401 = 0;
			ОкрП000210002401 = 0;
			ОкрП000210003401 = 0;
			ОкрП000210004401 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210001401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210001401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210001401") Тогда
				ОкрП000210001401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210001401);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210002401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210002401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210002401") Тогда
				ОкрП000210002401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210002401);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210003401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210003401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210003401") Тогда
				ОкрП000210003401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210003401);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница1" Тогда
				ОкрП000210004401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210004401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница1.Свойство("П000210004401") Тогда
				ОкрП000210004401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница1.П000210004401);
			КонецЕсли;
			
			
			П000220005401 = ОкрП000210001401 + ОкрП000210002401 - ОкрП000210003401 + ОкрП000210004401;
			
			Форма.СтруктураДанныхФорма100_02Страница2.Вставить("П000220005401", П000220005401);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000220005401.Значение = П000220005401;
			КонецЕсли;
			
			Расчет(Форма, "Форма100_02Страница2","П000220005401"); //перерасчет 2й стр. форма 100.02
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ "П000220008101" = ОбластьИмя Тогда
			
			Расчет(Форма, "Форма100Страница3", ОбластьИмя);  //перерасчет 3й стр. форма 100.00
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма100_02Страница3" Тогда
		
		Форма.СтруктураДанныхФорма100Страница1.Вставить("Приложение02", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение02.Значение = "Х";
		КонецЕсли;
		
		//100.02.010
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000230010001, ОбластьИмя) > 0 Тогда
			
			ОкрП000230010101 = 0;
			ОкрП000230010201 = 0;
			ОкрП000230010301 = 0;
			ОкрП000230010401 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница3" Тогда
				ОкрП000230010101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000230010101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница3.Свойство("П000230010101") Тогда
				ОкрП000230010101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница3.П000230010101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница3" Тогда
				ОкрП000230010201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000230010201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница3.Свойство("П000230010201") Тогда
				ОкрП000230010201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница3.П000230010201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница3" Тогда
				ОкрП000230010301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000230010301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница3.Свойство("П000230010301") Тогда
				ОкрП000230010301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница3.П000230010301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница3" Тогда
				ОкрП000230010401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000230010401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница3.Свойство("П000230010401") Тогда
				ОкрП000230010401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница3.П000230010401);
			КонецЕсли;
			
			
			П000230010001 = ОкрП000230010101 + ОкрП000230010201 + ОкрП000230010301 + ОкрП000230010401;
			
			Форма.СтруктураДанныхФорма100_02Страница3.Вставить("П000230010001", П000230010001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000230010001.Значение = П000230010001;
			КонецЕсли;
			
		КонецЕсли;
		
		//100.02.011
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000230011001, ОбластьИмя) > 0 Тогда
			
			ОкрП000230011101 = 0;
			ОкрП000230011201 = 0;
			ОкрП000230011301 = 0;
			ОкрП000230011401 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница3" Тогда
				ОкрП000230011101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000230011101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница3.Свойство("П000230011101") Тогда
				ОкрП000230011101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница3.П000230011101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница3" Тогда
				ОкрП000230011201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000230011201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница3.Свойство("П000230011201") Тогда
				ОкрП000230011201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница3.П000230011201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница3" Тогда
				ОкрП000230011301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000230011301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница3.Свойство("П000230011301") Тогда
				ОкрП000230011301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница3.П000230011301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница3" Тогда
				ОкрП000230011401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000230011401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница3.Свойство("П000230011401") Тогда
				ОкрП000230011401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница3.П000230011401);
			КонецЕсли;
			
			
			П000230011001 = ОкрП000230011101 + ОкрП000230011201 + ОкрП000230011301 + ОкрП000230011401;
			
			Форма.СтруктураДанныхФорма100_02Страница3.Вставить("П000230011001", П000230011001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000230011001.Значение = П000230011001;
			КонецЕсли;
			
			Расчет(Форма, "Форма100Страница2","П000230011001"); //перерасчет 2й стр. форма 100.00
			
		КонецЕсли;
		
		//100.02.011 I
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000230011101, ОбластьИмя) > 0 Тогда
			
			ОкрП000220006101 = 0;
			ОкрП000220007101 = 0;
			ОкрП000220009101 = 0;
			ОкрП000230010101 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220006101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220006101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220006101") Тогда
				ОкрП000220006101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220006101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220007101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220007101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220007101") Тогда
				ОкрП000220007101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220007101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220009101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220009101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220009101") Тогда
				ОкрП000220009101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220009101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница3" Тогда
				ОкрП000230010101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000230010101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница3.Свойство("П000230010101") Тогда
				ОкрП000230010101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница3.П000230010101);
			КонецЕсли;
			
			П000230011101 = ОкрП000220006101 + ОкрП000220007101 + ОкрП000220009101 + ОкрП000230010101;
			
			Форма.СтруктураДанныхФорма100_02Страница3.Вставить("П000230011101", П000230011101);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000230011101.Значение = П000230011101;
			КонецЕсли;
			
			Расчет(Форма, "Форма100_02Страница3","П000230011101"); //перерасчет 3й стр. форма 100.02
			
		КонецЕсли;
		
		//100.02.011 II
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000230011201, ОбластьИмя) > 0 Тогда
			
			ОкрП000220006201 = 0;
			ОкрП000220007201 = 0;
			ОкрП000220008201 = 0;
			ОкрП000220009201 = 0;
			ОкрП000230010201 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220006201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220006201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220006201") Тогда
				ОкрП000220006201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220006201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220007201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220007201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220007201") Тогда
				ОкрП000220007201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220007201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220008201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220008201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220008201") Тогда
				ОкрП000220008201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220008201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220009201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220009201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220009201") Тогда
				ОкрП000220009201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220009201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница3" Тогда
				ОкрП000230010201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000230010201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница3.Свойство("П000230010201") Тогда
				ОкрП000230010201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница3.П000230010201);
			КонецЕсли;
			
			П000230011201 = ОкрП000220006201 + ОкрП000220007201 + ОкрП000220008201 + ОкрП000220009201 + ОкрП000230010201;
			
			Форма.СтруктураДанныхФорма100_02Страница3.Вставить("П000230011201", П000230011201);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000230011201.Значение = П000230011201;
			КонецЕсли;
			
			Расчет(Форма, "Форма100_02Страница3","П000230011201"); //перерасчет 3й стр. форма 100.02
			
		КонецЕсли;
		
		//100.02.011 III
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000230011301, ОбластьИмя) > 0 Тогда
			
			ОкрП000220006301 = 0;
			ОкрП000220007301 = 0;
			ОкрП000220008301 = 0;
			ОкрП000220009301 = 0;
			ОкрП000230010301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220006301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220006301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220006301") Тогда
				ОкрП000220006301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220006301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220007301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220007301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220007301") Тогда
				ОкрП000220007301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220007301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220008301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220008301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220008301") Тогда
				ОкрП000220008301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220008301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220009301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220009301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220009301") Тогда
				ОкрП000220009301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220009301);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница3" Тогда
				ОкрП000230010301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000230010301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница3.Свойство("П000230010301") Тогда
				ОкрП000230010301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница3.П000230010301);
			КонецЕсли;
			
			П000230011301 = ОкрП000220006301 + ОкрП000220007301 + ОкрП000220008301 + ОкрП000220009301 + ОкрП000230010301;
			
			Форма.СтруктураДанныхФорма100_02Страница3.Вставить("П000230011301", П000230011301);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000230011301.Значение = П000230011301;
			КонецЕсли;
			
			Расчет(Форма, "Форма100_02Страница3","П000230011301"); //перерасчет 3й стр. форма 100.02
			
		КонецЕсли;
		
		//100.02.011 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000230011401, ОбластьИмя) > 0 Тогда
			
			ОкрП000220006401 = 0;
			ОкрП000220007401 = 0;
			ОкрП000220008401 = 0;
			ОкрП000220009401 = 0;
			ОкрП000230010401 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220006401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220006401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220006401") Тогда
				ОкрП000220006401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220006401);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220007401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220007401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220007401") Тогда
				ОкрП000220007401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220007401);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220008401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220008401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220008401") Тогда
				ОкрП000220008401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220008401);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница2" Тогда
				ОкрП000220009401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220009401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница2.Свойство("П000220009401") Тогда
				ОкрП000220009401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница2.П000220009401);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница3" Тогда
				ОкрП000230010401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000230010401.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_02Страница3.Свойство("П000230010401") Тогда
				ОкрП000230010401 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_02Страница3.П000230010401);
			КонецЕсли;
			
			П000230011401 = ОкрП000220006401 + ОкрП000220007401 + ОкрП000220008401 + ОкрП000220009401 + ОкрП000230010401;
			
			Форма.СтруктураДанныхФорма100_02Страница3.Вставить("П000230011401", П000230011401);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_02Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000230011401.Значение = П000230011401;
			КонецЕсли;
			
			Расчет(Форма, "Форма100_02Страница3","П000230011401"); //перерасчет 3й стр. форма 100.02
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ "П000230012001" = ОбластьИмя Тогда
			
			Расчет(Форма, "Форма100Страница2", ОбластьИмя);  //перерасчет 2й стр. форма 100.00
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма100_07Страница1" Тогда
		
		Форма.СтруктураДанныхФорма100Страница1.Вставить("Приложение07", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение07.Значение = "Х";
		КонецЕсли;
		
		Расчет(Форма, "Форма100_07Страница2", ОбластьИмя);  //перерасчет 2й стр. форма 100.07
		
	ИначеЕсли ИмяСтраницыПанели = "Форма100_07Страница2" Тогда
		
		Форма.СтруктураДанныхФорма100Страница1.Вставить("Приложение07", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение07.Значение = "Х";
		КонецЕсли;
		
		//100.07.018 I
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000720018001, ОбластьИмя) > 0 Тогда
			
			ОкрП000710001001 = 0;
			ОкрП000710002001 = 0;
			ОкрП000710003001 = 0;
			ОкрП000710004001 = 0;
			ОкрП000710005001 = 0;
			ОкрП000710006001 = 0;
			ОкрП000710007001 = 0;
			ОкрП000710008001 = 0;
			ОкрП000710009001 = 0;
			ОкрП000710010001 = 0;
			ОкрП000710011001 = 0;
			ОкрП000710012001 = 0;
			ОкрП000710013001 = 0;
			ОкрП000720014001 = 0;
			ОкрП000720015001 = 0;
			ОкрП000720016001 = 0;
			ОкрП000720017001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710001001") Тогда
				ОкрП000710001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710001001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710002001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710002001") Тогда
				ОкрП000710002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710002001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710003001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710003001") Тогда
				ОкрП000710003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710003001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710004001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710004001") Тогда
				ОкрП000710004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710004001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710005001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710005001") Тогда
				ОкрП000710005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710005001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710006001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710006001") Тогда
				ОкрП000710006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710006001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710007001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710007001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710007001") Тогда
				ОкрП000710007001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710007001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710008001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710008001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710008001") Тогда
				ОкрП000710008001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710008001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710009001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710009001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710009001") Тогда
				ОкрП000710009001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710009001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710010001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710010001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710010001") Тогда
				ОкрП000710010001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710010001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710011001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710011001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710011001") Тогда
				ОкрП000710011001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710011001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710012001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710012001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710012001") Тогда
				ОкрП000710012001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710012001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710013001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710013001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710013001") Тогда
				ОкрП000710013001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710013001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720014001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720014001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720014001") Тогда
				ОкрП000720014001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720014001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720015001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720015001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720015001") Тогда
				ОкрП000720015001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720015001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720016001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720016001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720016001") Тогда
				ОкрП000720016001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720016001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720017001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720017001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720017001") Тогда
				ОкрП000720017001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720017001);
			КонецЕсли;
			
			
			П000720018001 = ОкрП000710001001 + ОкрП000710002001 + ОкрП000710003001 + ОкрП000710004001 + ОкрП000710005001 + ОкрП000710006001 + ОкрП000710007001 + ОкрП000710008001
							 + ОкрП000710009001 + ОкрП000710010001 + ОкрП000710011001 + ОкрП000710012001 + ОкрП000710013001 + ОкрП000720014001 + ОкрП000720015001 + ОкрП000720016001 + ОкрП000720017001;
			
			Форма.СтруктураДанныхФорма100_07Страница2.Вставить("П000720018001", П000720018001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000720018001.Значение = П000720018001;
			КонецЕсли;
			
		КонецЕсли;
		
		//100.07.018 II
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000720018002, ОбластьИмя) > 0 Тогда
			
			ОкрП000710001002 = 0;
			ОкрП000710002002 = 0;
			ОкрП000710003002 = 0;
			ОкрП000710004002 = 0;
			ОкрП000710005002 = 0;
			ОкрП000710006002 = 0;
			ОкрП000710007002 = 0;
			ОкрП000710008002 = 0;
			ОкрП000710009002 = 0;
			ОкрП000710010002 = 0;
			ОкрП000710011002 = 0;
			ОкрП000710012002 = 0;
			ОкрП000710013002 = 0;
			ОкрП000720014002 = 0;
			ОкрП000720015002 = 0;
			ОкрП000720016002 = 0;
			ОкрП000720017002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710001002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710001002") Тогда
				ОкрП000710001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710001002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710002002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710002002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710002002") Тогда
				ОкрП000710002002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710002002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710003002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710003002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710003002") Тогда
				ОкрП000710003002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710003002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710004002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710004002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710004002") Тогда
				ОкрП000710004002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710004002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710005002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710005002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710005002") Тогда
				ОкрП000710005002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710005002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710006002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710006002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710006002") Тогда
				ОкрП000710006002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710006002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710007002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710007002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710007002") Тогда
				ОкрП000710007002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710007002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710008002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710008002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710008002") Тогда
				ОкрП000710008002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710008002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710009002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710009002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710009002") Тогда
				ОкрП000710009002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710009002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710010002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710010002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710010002") Тогда
				ОкрП000710010002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710010002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710011002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710011002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710011002") Тогда
				ОкрП000710011002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710011002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710012002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710012002") Тогда
				ОкрП000710012002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710012002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница1" Тогда
				ОкрП000710013002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000710013002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница1.Свойство("П000710013002") Тогда
				ОкрП000710013002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница1.П000710013002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720014002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720014002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720014002") Тогда
				ОкрП000720014002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720014002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720015002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720015002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720015002") Тогда
				ОкрП000720015002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720015002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720016002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720016002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720016002") Тогда
				ОкрП000720016002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720016002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720017002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720017002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720017002") Тогда
				ОкрП000720017002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720017002);
			КонецЕсли;
			
			
			П000720018002 = ОкрП000710001002 + ОкрП000710002002 + ОкрП000710003002 + ОкрП000710004002 + ОкрП000710005002 + ОкрП000710006002 + ОкрП000710007002 + ОкрП000710008002
							 + ОкрП000710009002 + ОкрП000710010002 + ОкрП000710011002 + ОкрП000710012002 + ОкрП000710013002 + ОкрП000720014002 + ОкрП000720015002 + ОкрП000720016002 + ОкрП000720017002;
			
			Форма.СтруктураДанныхФорма100_07Страница2.Вставить("П000720018002", П000720018002);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000720018002.Значение = П000720018002;
			КонецЕсли;
			
		КонецЕсли;
		
		//100.07.030 I
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000720030001, ОбластьИмя) > 0 Тогда
			
			ОкрП000720019001 = 0;
			ОкрП000720020001 = 0;
			ОкрП000720021001 = 0;
			ОкрП000720022001 = 0;
			ОкрП000720023001 = 0;
			ОкрП000720024001 = 0;
			ОкрП000720025001 = 0;
			ОкрП000720026001 = 0;
			ОкрП000720027001 = 0;
			ОкрП000720028001 = 0;
			ОкрП000720029001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720019001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720019001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720019001") Тогда
				ОкрП000720019001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720019001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720020001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720020001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720020001") Тогда
				ОкрП000720020001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720020001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720021001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720021001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720021001") Тогда
				ОкрП000720021001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720021001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720022001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720022001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720022001") Тогда
				ОкрП000720022001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720022001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720023001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720023001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720023001") Тогда
				ОкрП000720023001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720023001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720024001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720024001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720024001") Тогда
				ОкрП000720024001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720024001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720025001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720025001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720025001") Тогда
				ОкрП000720025001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720025001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720026001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720026001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720026001") Тогда
				ОкрП000720026001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720026001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720027001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720027001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720027001") Тогда
				ОкрП000720027001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720027001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720028001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720028001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720028001") Тогда
				ОкрП000720028001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720028001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720029001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720029001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720029001") Тогда
				ОкрП000720029001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720029001);
			КонецЕсли;
			
			
			П000720030001 = ОкрП000720019001 + ОкрП000720020001 + ОкрП000720021001 + ОкрП000720022001 + ОкрП000720023001 + ОкрП000720024001 + ОкрП000720025001 + ОкрП000720026001
							 + ОкрП000720027001 + ОкрП000720028001 + ОкрП000720029001;
			
			Форма.СтруктураДанныхФорма100_07Страница2.Вставить("П000720030001", П000720030001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000720030001.Значение = П000720030001;
			КонецЕсли;
			
		КонецЕсли;
		
		//100.07.030 II
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000720030002, ОбластьИмя) > 0 Тогда
			
			ОкрП000720019002 = 0;
			ОкрП000720020002 = 0;
			ОкрП000720021002 = 0;
			ОкрП000720022002 = 0;
			ОкрП000720023002 = 0;
			ОкрП000720024002 = 0;
			ОкрП000720025002 = 0;
			ОкрП000720026002 = 0;
			ОкрП000720027002 = 0;
			ОкрП000720028002 = 0;
			ОкрП000720029002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720019002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720019002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720019002") Тогда
				ОкрП000720019002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720019002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720020002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720020002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720020002") Тогда
				ОкрП000720020002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720020002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720021002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720021002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720021002") Тогда
				ОкрП000720021002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720021002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720022002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720022002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720022002") Тогда
				ОкрП000720022002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720022002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720023002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720023002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720023002") Тогда
				ОкрП000720023002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720023002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720024002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720024002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720024002") Тогда
				ОкрП000720024002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720024002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720025002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720025002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720025002") Тогда
				ОкрП000720025002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720025002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720026002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720026002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720026002") Тогда
				ОкрП000720026002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720026002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720027002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720027002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720027002") Тогда
				ОкрП000720027002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720027002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720028002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720028002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720028002") Тогда
				ОкрП000720028002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720028002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				ОкрП000720029002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000720029002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница2.Свойство("П000720029002") Тогда
				ОкрП000720029002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница2.П000720029002);
			КонецЕсли;
			
			
			П000720030002 = ОкрП000720019002 + ОкрП000720020002 + ОкрП000720021002 + ОкрП000720022002 + ОкрП000720023002 + ОкрП000720024002 + ОкрП000720025002 + ОкрП000720026002
							 + ОкрП000720027002 + ОкрП000720028002 + ОкрП000720029002;
			
			Форма.СтруктураДанныхФорма100_07Страница2.Вставить("П000720030002", П000720030002);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000720030002.Значение = П000720030002;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма100_07Страница3" Тогда
		
		Форма.СтруктураДанныхФорма100Страница1.Вставить("Приложение07", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение07.Значение = "Х";
		КонецЕсли;
		
		//100.07.038 I
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000730038001, ОбластьИмя) > 0 Тогда
			
			ОкрП000730031001 = 0;
			ОкрП000730032001 = 0;
			ОкрП000730033001 = 0;
			ОкрП000730034001 = 0;
			ОкрП000730035001 = 0;
			ОкрП000730036001 = 0;
			ОкрП000730037001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница3" Тогда
				ОкрП000730031001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000730037001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница3.Свойство("П000730031001") Тогда
				ОкрП000730031001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница3.П000730037001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница3" Тогда
				ОкрП000730032001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000730032001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница3.Свойство("П000730032001") Тогда
				ОкрП000730032001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница3.П000730032001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница3" Тогда
				ОкрП000730033001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000730033001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница3.Свойство("П000730033001") Тогда
				ОкрП000730033001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница3.П000730033001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница3" Тогда
				ОкрП000730034001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000730034001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница3.Свойство("П000730034001") Тогда
				ОкрП000730034001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница3.П000730034001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница3" Тогда
				ОкрП000730035001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000730035001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница3.Свойство("П000730035001") Тогда
				ОкрП000730035001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница3.П000730035001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница3" Тогда
				ОкрП000730036001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000730036001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница3.Свойство("П000730036001") Тогда
				ОкрП000730036001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница3.П000730036001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница3" Тогда
				ОкрП000730037001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000730037001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница3.Свойство("П000730037001") Тогда
				ОкрП000730037001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница3.П000730037001);
			КонецЕсли;
			
			
			П000730038001 = ОкрП000730031001 + ОкрП000730032001 + ОкрП000730033001 + ОкрП000730034001 + ОкрП000730035001 + ОкрП000730036001 + ОкрП000730037001;
			
			Форма.СтруктураДанныхФорма100_07Страница3.Вставить("П000730038001", П000730038001);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000730038001.Значение = П000730038001;
			КонецЕсли;
			
		КонецЕсли;
		
		//100.07.038 II
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000730038002, ОбластьИмя) > 0 Тогда
			
			ОкрП000730031002 = 0;
			ОкрП000730032002 = 0;
			ОкрП000730033002 = 0;
			ОкрП000730034002 = 0;
			ОкрП000730035002 = 0;
			ОкрП000730036002 = 0;
			ОкрП000730037002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница3" Тогда
				ОкрП000730031002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000730037002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница3.Свойство("П000730031002") Тогда
				ОкрП000730031002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница3.П000730037002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница3" Тогда
				ОкрП000730032002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000730032002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница3.Свойство("П000730032002") Тогда
				ОкрП000730032002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница3.П000730032002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница3" Тогда
				ОкрП000730033002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000730033002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница3.Свойство("П000730033002") Тогда
				ОкрП000730033002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница3.П000730033002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница3" Тогда
				ОкрП000730034002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000730034002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница3.Свойство("П000730034002") Тогда
				ОкрП000730034002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница3.П000730034002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница3" Тогда
				ОкрП000730035002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000730035002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница3.Свойство("П000730035002") Тогда
				ОкрП000730035002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница3.П000730035002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница3" Тогда
				ОкрП000730036002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000730036002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница3.Свойство("П000730036002") Тогда
				ОкрП000730036002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница3.П000730036002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница3" Тогда
				ОкрП000730037002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000730037002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма100_07Страница3.Свойство("П000730037002") Тогда
				ОкрП000730037002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма100_07Страница3.П000730037002);
			КонецЕсли;
			
			
			П000730038002 = ОкрП000730031002 + ОкрП000730032002 + ОкрП000730033002 + ОкрП000730034002 + ОкрП000730035002 + ОкрП000730036002 + ОкрП000730037002;
			
			Форма.СтруктураДанныхФорма100_07Страница3.Вставить("П000730038002", П000730038002);
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма100_07Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000730038002.Значение = П000730038002;
			КонецЕсли;
			
		КонецЕсли;
		
	//Авторасчет
	ИначеЕсли ИмяСтраницыПанели = "" Тогда
		
		Расчет(Форма,"Форма100Страница1", "");
		Расчет(Форма,"Форма100Страница2", "");
		Расчет(Форма,"Форма100Страница3", "");
		Расчет(Форма,"Форма100Страница4", "");
		
		Расчет(Форма,"Форма100_01Страница1", "");
		Расчет(Форма,"Форма100_01Страница2", "");
		
		Расчет(Форма,"Форма100_02Страница1", "");
		Расчет(Форма,"Форма100_02Страница2", "");
		Расчет(Форма,"Форма100_02Страница3", "");
		
		Расчет(Форма,"Форма100_07Страница1", "");
		Расчет(Форма,"Форма100_07Страница2", "");
		Расчет(Форма,"Форма100_07Страница3", "");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьЗавершение", ЭтотОбъект);

	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВыгрузитьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчет() Экспорт
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьОтчетЗавершение", ЭтотОбъект);
	
	Если Модифицированность Тогда
		СохранитьНаКлиенте(,ОписаниеОповещения);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчетЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ФормаВыгрузкиРеглОтчета = ПолучитьФорму("Документ.ВыгрузкаРегламентированныхОтчетов.Форма.ФормаДокумента", , ЭтаФорма);
	
	СпДокОсн = Новый СписокЗначений;
	СпДокОсн.Добавить(СтруктураРеквизитовФормы.мСохраненныйДок);
	
	ФормаВыгрузкиРеглОтчета.СформироватьИЗаписать(СпДокОсн);
	
КонецПроцедуры

&НаКлиенте
Функция УниверсальнаяВыгрузка (ТекстВыгрузки = Неопределено, ПроверятьБлокировки = Истина, ИмяФайлаВыгрузки = "", ВыгружатьСОшибками = Ложь) Экспорт
	
	ИмяФайлаВыгрузки = СформироватьИмяФайла();
	
	СформироватьСписокФормБезИерархии();
	
	ТекстВыгрузки = УниверсальнаяВыгрузкаНаСервере();
	
	Если ТекстВыгрузки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция СформироватьИмяФайла()
	
	Перем ПолученноеЗначение;
	
	ИмяФайлаXML = "Форма100_"+ Прав(Этаформа.ИмяФормы,7)+ "_" + СтрЗаменить(СтрЗаменить(Строка(ТекущаяДата())," ","_"),":","-") + ".xml";
	
	Возврат ИмяФайлаXML;
	
КонецФункции

&НаСервере
Функция  УниверсальнаяВыгрузкаНаСервере()
	Возврат РегламентированнаяОтчетностьРК.ВыгрузитьОтчетВXMLДляСОНО(ЭтотОбъект);
КонецФункции

&НаСервере
Процедура СформироватьСписокФормБезИерархии()
	
	мСписокФормБезИерархии.ПолучитьЭлементы().Очистить();
	
	МакетПоказателей = Отчеты[Сред(Лев(ЭтотОбъект.ИмяФормы, СтрНайти(ЭтотОбъект.ИмяФормы, ".Форма.") - 1), 7)].ПолучитьМакет("Показатели");
	Префикс = Прав(ЭтаФорма.СтруктураРеквизитовФормы.мВыбраннаяФорма,7);
	
	ОбластьПоказателей = МакетПоказателей.Область("Форма100_" + Префикс);
	
	Для Ном = ОбластьПоказателей.Верх По ОбластьПоказателей.Низ Цикл
		
		НоваяСтрока = мСписокФормБезИерархии.ПолучитьЭлементы().Добавить();
		НоваяСтрока.ИмяФормы			= СокрП(МакетПоказателей.Область(Ном, 1).Текст);
		НоваяСтрока.Выгружать			= ?(СокрП(МакетПоказателей.Область(Ном, 2).Текст)= "1",Истина,Ложь);
		НоваяСтрока.Многострочность		= ?(СокрП(МакетПоказателей.Область(Ном, 3).Текст)= "1",Истина,Ложь);
		НоваяСтрока.КодФормы			= СокрП(МакетПоказателей.Область(Ном, 4).Текст);
		НоваяСтрока.КоличествоНаЛисте	= Число(СокрП(МакетПоказателей.Область(Ном, 5).Текст));
		НоваяСтрока.КоличествоСтраницПриложения = Число(СокрП(МакетПоказателей.Область(Ном, 6).Текст));
		
		Если НоваяСтрока.Многострочность <> Истина Тогда
			Для КолСтр = 1 По НоваяСтрока.КоличествоСтраницПриложения  Цикл
				Для Каждого Элемент Из ЭтаФорма["СтруктураДанных"+ НоваяСтрока.КодФормы + "Страница" + КолСтр] Цикл
					НовыйЭлемент = НоваяСтрока.Значение.Добавить();
					НовыйЭлемент.ИмяОбласти = Элемент.Ключ;
					НовыйЭлемент.Значение = Элемент.Значение;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьМногострочнуюСтруктуруДляВыгрузки (ТекущееИмяФормы, ТаблицаМногострочнойФормы = Неопределено) Экспорт
	
	Возврат СформироватьМногострочнуюСтруктуруДляВыгрузкиНаСервере(ТекущееИмяФормы, ТаблицаМногострочнойФормы);
	
КонецФункции

&НаСервере
Функция СформироватьМногострочнуюСтруктуруДляВыгрузкиНаСервере(ТекущееИмяФормы, ТаблицаМногострочнойФормы = Неопределено) Экспорт
	
	Перем ТаблицаСтраницРаздела;
	
	Если ТекущееИмяФормы = Неопределено тогда
		ТекущееИмяФормы = "Форма100_01";
	КонецЕсли;
	
	МногострочнаяСтруктура = Новый Структура;
	
	ТекущийЛист = Неопределено;
	НомерСтроки = 0;
	КоличествоСтрок = ТаблицаМногострочнойФормы.Количество();
	
	Пока Истина Цикл 
		
		Если НомерСтроки >= КоличествоСтрок Тогда 
			Прервать;
		КонецЕсли;
		
		СтрокаТЗ = ТаблицаМногострочнойФормы[НомерСтроки];
		
		Если Не СтрокаТЗ.ИмяЛиста = ТекущийЛист Тогда
			
			МногострочнаяСтруктура.Вставить(СтрокаТЗ.ИмяЛиста, Новый Структура);
			МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста].Вставить("Строки", Новый ТаблицаЗначений);
			МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста].Вставить("ШапкаИПодвал", Новый ТаблицаЗначений);
			
			МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("Значение");
			МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("ИмяОбласти");
			МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("ИмяПараметра");
			МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("Итог");
			
			
			ТекущийЛист = СтрокаТЗ.ИмяЛиста;
			
		КонецЕсли;
		
		Если СтрокаТЗ.КоличествоROW = "0" Тогда
			//Заполняем таблицу значений параметров шапки
			Если ЗначениеЗаполнено(СтрокаТЗ.ИмяЯчейки) Тогда
				//Добавим новую строку в ТЗ значений шапки таблицы
				НоваяСтрока = МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Добавить();
				
				//Получим значение параметра из структуры формы
				ЗначениеПараметра = ЭтаФорма["СтруктураДанных" + СтрокаТЗ.КодФормы + ?(СтрокаТЗ.КодФормы = "Форма100_01", СтрокаТЗ.ИмяЛиста, "Страница1")][СтрокаТЗ.ИмяЯчейки];
				
				НоваяСтрока.Значение 		= ЗначениеПараметра;
				НоваяСтрока.ИмяПараметра 	= СтрокаТЗ.ИмяЯчейки;
				НоваяСтрока.ИмяОбласти 		= СтрокаТЗ.ИмяЯчейки;
				НоваяСтрока.Итог 			= Ложь;
			КонецЕсли;
		Иначе 
			//А это уже строки таблицы
			//Определим состав колонок многострочной формы
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ИмяЛиста", СтрокаТЗ.ИмяЛиста);
			СтруктураПоиска.Вставить("КоличествоROW", "10");
			СтрокиТаблицы = ТаблицаМногострочнойФормы.НайтиСтроки(СтруктураПоиска);
			
			ИмяТаблицы = Сред(СтрокаТЗ.ИмяЯчейки, 1, 11);
			
			//Проверям есть ли у нас вообще записи в многострочной форме
			//И формируем набор колонок таблицы значений
			ЕстьЗаписи = Ложь;
			Если Не ЭтотОбъект[ИмяТаблицы].Количество() = 0 Тогда
				Для Каждого Строка Из СтрокиТаблицы Цикл
					ИмяЯчейки = Сред(Строка.ИмяЯчейки, 1, 13);
					МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["Строки"].Колонки.Добавить(ИмяЯчейки);
					Если ЗначениеЗаполнено(ЭтотОбъект[ИмяТаблицы][0][ИмяЯчейки]) Тогда 
						ЕстьЗаписи = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если ЕстьЗаписи Тогда
				//Если записи обнаружены то заполняем таблицу значений
				Для Каждого СтрокаТаблицы Из ЭтотОбъект[ИмяТаблицы] Цикл 
					НоваяСтрока = МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["Строки"].Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				КонецЦикла;
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + СтрокиТаблицы.Количество() - 1;
			
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	
	Возврат МногострочнаяСтруктура;
	
КонецФункции

&НаСервере
Функция ПроверитьПоказатели() Экспорт
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура Расшифровать(Команда)
	
	Попытка
		ИмяЯчейки = ЭтотОбъект.ТекущийЭлемент.ТекущаяОбласть.Имя;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Активизируйте нужную ячейку отчета для расшифровки.'"));
		Возврат;
	КонецПопытки;

	Если (Найти(ИмяЯчейки , "П0000100") > 0)
		ИЛИ (Найти(ИмяЯчейки , "П0000200") > 0)
		ИЛИ (Найти(ИмяЯчейки , "П0000300") > 0) Тогда 
		МетодРасшифровки = Ложь;
		Форма100РасшифровкаСКД(ИмяЯчейки, МетодРасшифровки);		
	//ИначеЕсли (Найти(ИмяЯчейки , "П0001") > 0) И Не ИмяЯчейки = "Ф100_01_F" Тогда //  И Не (Найти(ИмяЯчейки , "П000120000202_") > 0)
	//	МетодРасшифровки = Ложь; 
	//	Форма100_01Расшифровка(ИмяЯчейки, МетодРасшифровки);
	Иначе	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Расшифровка данной ячейки не поддерживается.'"));
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекущуюСтраницу(Команда)
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьТекущийЭкземплярМногостраничногоРаздела" + Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекущийРаздел(Команда)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтчет(Команда)
	
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьВесьОтчет");
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(ВыполняемоеОповещение = Неопределено) Экспорт
	
	РегламентированнаяОтчетностьКлиент.Очистить(ЭтаФорма, ВыполняемоеОповещение);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере() Экспорт
	
	СтруктураДанныхФорма100Страница1.Очистить();
	СтруктураДанныхФорма100Страница2.Очистить();
	СтруктураДанныхФорма100Страница3.Очистить();
	СтруктураДанныхФорма100Страница4.Очистить();
	СтруктураДанныхФорма100_01Страница1.Очистить();
	СтруктураДанныхФорма100_01Страница2.Очистить();
	СтруктураДанныхФорма100_02Страница1.Очистить();
	СтруктураДанныхФорма100_02Страница2.Очистить();
	СтруктураДанныхФорма100_02Страница3.Очистить();
	СтруктураДанныхФорма100_07Страница1.Очистить();
	СтруктураДанныхФорма100_07Страница2.Очистить();
	СтруктураДанныхФорма100_07Страница3.Очистить();
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	ОчиститьТабличноеПолеНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма100Страница1");
	
	НачальныеОперацииСМногострочнымиБлоками();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОчисткаРегламентированногоОтчетаНаСервере(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаСервере(ИмяСтраницы);
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаРегламентированногоОтчетаНаКлиенте(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаКлиенте(ИмяСтраницы);
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьТабличноеПолеНаКлиенте(ВыбТабличноеПолеИмя) Экспорт
	
	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличноеПолеНаСервере(ВыбТабличноеПолеИмя) Экспорт
	
	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьТабличноеПоле(Форма, ВыбТабличноеПолеИмя)
	
	ВыбТабличноеПоле = Форма.ТабличныйДокумент;
	
	// Непосредственно очищаем ячейки табличного документа.
	Для Инд = 0 По ВыбТабличноеПоле.Области.Количество() - 1 Цикл
		ТекущаяОбласть = ВыбТабличноеПоле.Области[Инд];
		
		Если Не ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;
	
		Если ТекущаяОбласть.СодержитЗначение <> Истина Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекущаяОбласть.Защита Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущаяОбласть.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
	ОткрытьФормуВыбораСтраниц("ВыбратьДляНастройки");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраниц(ВариантВыбора)
	Перем ТекущийРазделОтчетаСокрНаим;
	Перем НомерСтраницыРазделаОтчета;
	
	// Запоминаем текущий раздел, установленный в дереве разделов отчета.
	Если НЕ Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		ТекущийРазделОтчетаСокрНаим = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
		НомерСтраницыРазделаОтчета  = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	КонецЕсли;
	
	мПараметры = Новый Структура;
	мПараметры.Вставить("Автосохранение", Ложь);
	мПараметры.Вставить("мАвтоВыборКодов", Ложь);
	мПараметры.Вставить("ЗначенияИзСписка", Ложь);
	мПараметры.Вставить("ОтключитьАвтоРасчет", Ложь);
	мПараметры.Вставить("СчетчикСтраниц", Ложь);
	мПараметры.Вставить("ПараметрыОтображенияСумм", Ложь);
	мПараметры.Вставить("ИмеетсяРеквизитДеревоВыбранныхСтраниц", Истина);
	мПараметры.Вставить("Выгрузка", Истина);
	мПараметры.Вставить("ИмяОтчета", ИмяОтчета(ЭтаФорма.ИмяФормы));
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("мПараметры",                              мПараметры);
	
	ФормаНастройкиОтчета = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("НастройкиОтчета", ПараметрыФормы, ЭтаФорма);
	
	ПодготовитьДеревоСтраницДляНастройки();
	
	КопироватьДанныеФормы(мДеревоВыбранныхСтраниц, ФормаНастройкиОтчета.Дерево);
	
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
	
	ЗначениеЕдИзм       = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	ЗначениеЗпт         = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;
	
	ДополнительныеПараметры = Новый Структура("ЗначениеАвторасчета, ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим", , ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуВыбораСтраницЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ФормаНастройкиОтчета.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаНастройкиОтчета.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаНастройкиОтчета.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьДеревоСтраницДляНастройки()
	
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
	ДеревоСтраниц = РеквизитФормыВЗначение("мДеревоСтраницОтчета");
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма100Страница1";
	СтрокаУровня1.Представление            = "Форма 100.00";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма100Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма100_01Страница1";
	СтрокаУровня1.Представление            = "Форма 100.01";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма100_01Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма100_02Страница1";
	СтрокаУровня1.Представление            = "Форма 100.02";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма100_02Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма100_07Страница1";
	СтрокаУровня1.Представление            = "Форма 100.07";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма100_07Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраницЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	//ЗначениеАвторасчета = ДополнительныеПараметры.ЗначениеАвторасчета;
	ЗначениеЕдИзм = ДополнительныеПараметры.ЗначениеЕдИзм;
	ЗначениеЗпт = ДополнительныеПараметры.ЗначениеЗпт;
	НомерСтраницыРазделаОтчета = ДополнительныеПараметры.НомерСтраницыРазделаОтчета;
	ТекущийРазделОтчетаСокрНаим = ДополнительныеПараметры.ТекущийРазделОтчетаСокрНаим;
	
	//СформироватьПодменюПечать(ЭтаФорма);
	Модифицированность = Истина;
	
	флЗначенияИдентичны = Истина;
	
	флЗначенияИдентичны = ПеренестиДанныеДереваСтраниц();
	
	Если НЕ флЗначенияИдентичны Тогда
		
		СформироватьДеревоРазделовОтчетаНаКлиенте();
		
		Если НЕ ТекущийРазделОтчетаСокрНаим = Неопределено Тогда
			
			// Пытаемся найти ранее запомненный раздел.
			НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(РазделыОтчета.ПолучитьЭлементы(), "КолонкаРазделыОтчетаСокрНаим", ТекущийРазделОтчетаСокрНаим);
			
			Если НЕ НайденнаяСтрока = Неопределено 
				И НЕ НомерСтраницыРазделаОтчета = Неопределено 
				И НайденнаяСтрока.ПолучитьЭлементы().Количество() > 0 Тогда
				
				НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(НайденнаяСтрока.ПолучитьЭлементы(), "КолонкаНомерСтраницыРазделаОтчета", НомерСтраницыРазделаОтчета);
				
			КонецЕсли;
			
			// В случае успешного поиска, устанавливаем курсор на найденный раздел.
			Если НЕ НайденнаяСтрока = Неопределено Тогда
				Элементы.РазделыОтчета.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПеренестиДанныеДереваСтраниц()
	
	флЗначенияИдентичны = Истина;
	
	ДеревоВыбСтраниц = РеквизитФормыВЗначение("мДеревоВыбранныхСтраниц");
	
	Для Каждого ЭлементДерева Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		
		Если  Сред(ЭлементДерева.Представление,13,1) = "_" Тогда
			Строка = ДеревоВыбСтраниц.Строки.Найти(Лев(ЭлементДерева.Представление,15),"Представление");
		Иначе
			Строка = ДеревоВыбСтраниц.Строки.Найти(Лев(ЭлементДерева.Представление,12),"Представление");
		КонецЕсли;
		
		Если ЭлементДерева.ПоказатьСтраницу <> ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1) Тогда
			
			флЗначенияИдентичны = Ложь;
			
		КонецЕсли;
		
		ЭлементДерева.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
		ЭлементДерева.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
		ЭлементДерева.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
		
	КонецЦикла;
	
	Возврат флЗначенияИдентичны;
	
КонецФункции

&НаКлиенте
Процедура Обновить(Команда)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПериодЗаполнения(Команда)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвто(Команда) Экспорт
	
	Отказ = Ложь;
	
	ОчиститьСообщения();
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоПредупредитьОСохранении", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередЗаполнениемРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоПредупредитьОСохранении(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоСохранениеОтчета", ЭтотОбъект, ДополнительныеПараметры);
	
	ТекстВопроса = НСтр("ru = 'Автоматическое заполнение приведет к сохранению отчета с новыми данными. Заполнить отчет?'");
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Заполнить", "Заполнить и сохранить");
	Кнопки.Добавить("НеЗаполнять", "Не заполнять");
	
	КнопкаПоУмолчанию = "НеЗаполнять";
	
	ЗаголовокВопроса = НСтр("ru = 'Автоматическое заполнение отчета'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , КнопкаПоУмолчанию, ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоСохранениеОтчета(ОтветПользователя, ДополнительныеПараметры) Экспорт
	
	Если ОтветПользователя <> "Заполнить" Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураРеквизитовФормы.УспешноеАвтозаполнение = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
	"ЗаполнитьАвтоПослеСохранениеОтчета", 
	ЭтотОбъект, 
	ДополнительныеПараметры); 
	
	СохранитьНаКлиенте(,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоПослеСохранениеОтчета(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаданиеВыполнено = ЗаполнитьАвтоНаСервере();
	
	Если ЗаданиеВыполнено Тогда
		СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
		
		РегламентированнаяОтчетностьКлиент.ОбновитьДеревоРазделовВФормеОтчета(ЭтаФорма);
		
		Если НЕ Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
			Элементы.РазделыОтчета.ТекущаяСтрока = Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы()[0].ПолучитьИдентификатор();
		КонецЕсли;
		
		Если Элементы.Расшифровать.Видимость Тогда
			Элементы.Расшифровать.Доступность = Истина;
			//	Элементы.ТабличныйДокументКонтекстноеМенюРасшифровать.Доступность = Истина;
		КонецЕсли;
		
		//ЗапуститьПроверки();
		
	Иначе
		
		// Операция еще не завершена, выполняется с помощью фонового задания (асинхронно).
		ПараметрыОбработчикаОжидания = Новый Структура;
		ПараметрыОбработчикаОжидания.Вставить("МинимальныйИнтервал", 1);
		ПараметрыОбработчикаОжидания.Вставить("МаксимальныйИнтервал", 15);
		ПараметрыОбработчикаОжидания.Вставить("ТекущийИнтервал", 1);
		ПараметрыОбработчикаОжидания.Вставить("КоэффициентУвеличенияИнтервала", 1.4);
		
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		
		ФормаДлительнойОперации = ОткрытьФорму("ОбщаяФорма.ДлительнаяОперация", Новый Структура("ИдентификаторЗадания", СтруктураРеквизитовФормы.ИдентификаторЗадания), ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		
		Если ПроверитьВыполнениеЗадания() Тогда 
			
			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			
			СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
			
			РегламентированнаяОтчетностьКлиент.ОбновитьДеревоРазделовВФормеОтчета(ЭтаФорма);
			
			Если НЕ Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
				Элементы.РазделыОтчета.ТекущаяСтрока = Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы()[0].ПолучитьИдентификатор();
			КонецЕсли;
			
			Если Элементы.Расшифровать.Видимость Тогда
				Элементы.Расшифровать.Доступность = Истина;
				//Элементы.ТабличныйДокументКонтекстноеМенюРасшифровать.Доступность = Истина;
			КонецЕсли;
			
			//ЗапуститьПроверки();
			
			Возврат;
			
		КонецЕсли;
		
	Исключение
		
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение;
		
	КонецПопытки;
	
	ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.ТекущийИнтервал * ПараметрыОбработчикаОжидания.КоэффициентУвеличенияИнтервала;
	
	Если ПараметрыОбработчикаОжидания.ТекущийИнтервал > ПараметрыОбработчикаОжидания.МаксимальныйИнтервал Тогда
		ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.МаксимальныйИнтервал;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВыполнениеЗадания()
	
	Если ДлительныеОперации.ЗаданиеВыполнено(СтруктураРеквизитовФормы.ИдентификаторЗадания) Тогда 
		
		РегламентированнаяОтчетностьУПК.ФоновыеСообщенияПользователю(СтруктураРеквизитовФормы.ИдентификаторЗадания, ЭтаФорма.УникальныйИдентификатор);
		
		ЗагрузитьПодготовленныеДанные();
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗаполнитьАвтоНаСервере()
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	СтруктураРеквизитовФормы.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	СтруктураРеквизитовФормы.АдресВременногоХранилищаРасшифровки = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("Организация",              СтруктураРеквизитовФормы.Организация);
	ПараметрыОтчета.Вставить("ГруппаОрганизаций",        СтруктураРеквизитовФормы.ГруппаОрганизаций);
	ПараметрыОтчета.Вставить("мДатаНачалаПериодаОтчета", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	ПараметрыОтчета.Вставить("мДатаКонцаПериодаОтчета",  СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	ПараметрыОтчета.Вставить("УникальныйИдентификаторФормы", ЭтаФорма.УникальныйИдентификатор);
	ПараметрыОтчета.Вставить("АдресВоВременномХранилище", СтруктураРеквизитовФормы.АдресВоВременномХранилище);
	ПараметрыОтчета.Вставить("АдресВременногоХранилищаРасшифровки", СтруктураРеквизитовФормы.АдресВременногоХранилищаРасшифровки);
	ПараметрыОтчета.Вставить("Декларация", СтруктураРеквизитовФормы.мСохраненныйДок);
	
	ПараметрыОтчета.Вставить("КодСтрокиДоходОтКурсовойРазницы", "100.00.004.K");
	ПараметрыОтчета.Вставить("КодСтрокиРасходыПоКурсовойРазнице", "100.00.020.K");
	
	Контейнер = Новый Структура();
	Контейнер.Вставить("Форма100Страница1", СтруктураДанныхФорма100Страница1);
	Контейнер.Вставить("Форма100Страница2", СтруктураДанныхФорма100Страница2);
	Контейнер.Вставить("Форма100Страница3", СтруктураДанныхФорма100Страница3);
	Контейнер.Вставить("Форма100Страница4", СтруктураДанныхФорма100Страница4);
	
	Контейнер.Вставить("Форма100_01Страница1", СтруктураДанныхФорма100_01Страница1);
	//Контейнер.Вставить("Форма100_01Страница1_ДанныеДопСтрок", ДанныеФормыВЗначение(П0007100001, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма100_01Страница2", СтруктураДанныхФорма100_01Страница2);
	//Контейнер.Вставить("Форма100_01Страница2_ДанныеДопСтрок", ДанныеФормыВЗначение(П0007100001, Тип("ТаблицаЗначений")));
	
	Контейнер.Вставить("Форма100_02Страница1", СтруктураДанныхФорма100_02Страница1);
	Контейнер.Вставить("Форма100_02Страница2", СтруктураДанныхФорма100_02Страница2);
	Контейнер.Вставить("Форма100_02Страница3", СтруктураДанныхФорма100_02Страница3);
	
	Контейнер.Вставить("Форма100_07Страница1", СтруктураДанныхФорма100_07Страница1);
	Контейнер.Вставить("Форма100_07Страница2", СтруктураДанныхФорма100_07Страница2);
	Контейнер.Вставить("Форма100_07Страница3", СтруктураДанныхФорма100_07Страница3);
	
	ЗаданиеВыполнено = Ложь;
	
	НаименованиеЗадания = НСтр("ru = 'Автоматическое заполнение по данным информационной базы'");
	
	ПараметрыЗаполнения = Новый Массив;
	ПараметрыЗаполнения.Добавить(ИмяОтчета(ЭтаФорма.ИмяФормы));
	ПараметрыЗаполнения.Добавить(ИмяФормыОтчета(ЭтаФорма.ИмяФормы));
	ПараметрыЗаполнения.Добавить(ПараметрыОтчета);
	ПараметрыЗаполнения.Добавить(Контейнер);
	
	Если ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая Тогда
		ВремяОжидания = 4;
	Иначе
		ВремяОжидания = 2;
	КонецЕсли;
	
	Задание = ФоновыеЗадания.Выполнить("РегламентированнаяОтчетностьПереопределяемый.ЗаполнитьОтчет", ПараметрыЗаполнения, , НаименованиеЗадания);
	
	Попытка
		Задание.ОжидатьЗавершения(ВремяОжидания);
	Исключение
		// Специальная обработка не требуется. Предположительно, исключение вызвано истечением времени ожидания.
	КонецПопытки;
	
	СтруктураРеквизитовФормы.ИдентификаторЗадания = Задание.УникальныйИдентификатор;
	
	// Если операция уже завершилась, то сразу обрабатываем результат.
	Если ДлительныеОперации.ЗаданиеВыполнено(Задание.УникальныйИдентификатор) Тогда
		
		РегламентированнаяОтчетностьУПК.ФоновыеСообщенияПользователю(Задание.УникальныйИдентификатор, ЭтаФорма.УникальныйИдентификатор);
		
		ЗаданиеВыполнено = Истина;
		
		ЗагрузитьПодготовленныеДанные();
		
	КонецЕсли;
	
	ЗаполнитьСведенияОбОрганизацииНаСервере();
	НачальныеОперацииСМногострочнымиБлоками();
	
	//РасчетНаСервере();
	//Модифицированность = Истина;

	Возврат ЗаданиеВыполнено;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()
	
	СтруктураРеквизитовФормы.УспешноеАвтозаполнение = Истина;
	СтруктураРеквизитовФормы.ВерсияАвтозаполнения = "2017кв4";
	
	Контейнер = ПолучитьИзВременногоХранилища(СтруктураРеквизитовФормы.АдресВоВременномХранилище);
	
	Если ТипЗнч(Контейнер) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементСтруктуры Из Контейнер Цикл
		ИмяЭлемента = ЭлементСтруктуры.Ключ;
		
		//Если ИмяЭлемента = "Форма300_07Страница1_ДанныеДопСтрок" Тогда
		//	ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0007100001);
		//	
		//ИначеЕсли ИмяЭлемента = "Форма300_07Страница2_ДанныеДопСтрок" Тогда
		//	ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0007200001);
		//	
		//ИначеЕсли ИмяЭлемента = "Форма300_07Страница3_ДанныеДопСтрок" Тогда
		//	ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0007300002);
		//	
		//ИначеЕсли ИмяЭлемента = "Форма300_07Страница4_ДанныеДопСтрок" Тогда
		//	ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0007400001);
		//	
		//ИначеЕсли ИмяЭлемента = "Форма300_08Страница1_ДанныеДопСтрок" Тогда
		//	ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0008100001);
		//	
		//ИначеЕсли ИмяЭлемента = "Форма300_08Страница2_ДанныеДопСтрок" Тогда
		//	ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0008200001);
		//	
		//ИначеЕсли ИмяЭлемента = "Форма300_08Страница3_ДанныеДопСтрок" Тогда
		//	ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0008300002);
		//	
		//ИначеЕсли ИмяЭлемента = "Форма300_08Страница4_ДанныеДопСтрок" Тогда
		//	ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, П0008400001);
			
		//ИначеЕсли ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ТаблицаЗначений") Тогда
		Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ТаблицаЗначений") Тогда
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, ЭтаФорма["СтруктураДанных" + ИмяЭлемента]);
			
		Иначе
			ЭтаФорма["СтруктураДанных" + ИмяЭлемента] = ЭлементСтруктуры.Значение;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВывестиМакетВТаблДокНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	РасчетНаСервере("Форма100Страница1", "");
	РасчетНаСервере("Форма100Страница2", "");
	РасчетНаСервере("Форма100Страница3", "");
	РасчетНаСервере("Форма100Страница4", "");
	
	РасчетНаСервере("Форма100_01Страница1", "");
	//РасчетНаСервере("Форма100_01Страница2", "");
	РасчетНаСервере("Форма100_02Страница1", "");
	РасчетНаСервере("Форма100_02Страница2", "");
	РасчетНаСервере("Форма100_02Страница3", "");
	
	РасчетНаСервере("Форма100_07Страница2", "");
	РасчетНаСервере("Форма100_07Страница3", "");
	
	Модифицированность = Ложь;
	
	Сохранить();
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Если Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	Оповещение = Новый ОписаниеОповещения("ПослеСохраненияФормыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	СохранитьНаКлиенте(, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиенте(Автосохранение = Ложь, ВыполняемоеОповещение = Неопределено) Экспорт
	
	
	Вариант = СтруктураРеквизитовФормы.ВидДокумента;
	
	Если НЕ РегламентированнаяОтчетностьКлиент.ПриЗаписиРегламентированногоОтчетаНаКлиенте(ЭтаФорма, , Автосохранение, Вариант) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатСохранения = ПередСохранением();
	
	ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения);
	
КонецПроцедуры

&НаСервере
Функция ПередСохранением()
	
	Возврат Сохранить();
	
КонецФункции

&НаСервере
Функция Сохранить()
	
	Если НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.ПолучитьОбъект();
	КонецЕсли;
	
	Если НЕ РегламентированнаяОтчетность.ПриЗаписиРегламентированногоОтчетаНаСервере(ЭтаФорма, , ,СтруктураРеквизитовФормы.ВидДокумента, , СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ИсточникОтчета           = Метаданные.Отчеты[Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7)].Имя;
	СтруктураРеквизитовФормы.мСохраненныйДок.НаименованиеОтчета       = Метаданные.Отчеты[Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7)].ОсновнаяФорма.Синоним;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаНачала               = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаОкончания            = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.Периодичность            = СтруктураРеквизитовФормы.мПериодичность;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВыбраннаяФорма           = СтруктураРеквизитовФормы.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок.Организация              = СтруктураРеквизитовФормы.Организация;
	СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий              = Комментарий;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаПодписи              = ТекущаяДата(); 
	СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения         = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВидОтчетности            = Перечисления.ВидыОтчетности.РегламентированнаяОтчетность;
	СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий              = Комментарий;
	СтруктураРеквизитовФормы.мСохраненныйДок.КодНалоговогоОргана      = ?(СтруктураРеквизитовФормы.Налоговыйкомитет = Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка(),"",СтруктураРеквизитовФормы.Налоговыйкомитет.Код);
	СтруктураРеквизитовФормы.мСохраненныйДок.КПП                      = "";
	СтруктураРеквизитовФормы.мСохраненныйДок.Вид                      = СтруктураРеквизитовФормы.ВидДокумента;
	СтруктураРеквизитовФормы.мСохраненныйДок.ПредставлениеВида        = РегламентированнаяОтчетность.ПредставлениеВидаДокумента(СтруктураРеквизитовФормы.мСохраненныйДок.Вид);
	СтруктураРеквизитовФормы.мВариант                                 = СтруктураРеквизитовФормы.ВидДокумента;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ФорматВыгрузки = "Автоматически";
	//сохранение данных текущего раздела
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	// формируем данные редактируемых ячеек таблицы
	ПоказателиОтчета = Новый Структура();
	
	ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета);
	// формируем список сохранения
	СписокСохранения = Новый Структура();
	
	// вставляем данные редактируемых ячеек таблицы
	СписокСохранения.Вставить("ПоказателиОтчета", ПоказателиОтчета);
	СписокСохранения.Вставить("НалоговыйКомитет", СтруктураРеквизитовФормы.НалоговыйКомитет);
	
	ДанныеМногострочныхРазделов = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		
		ДанныеМногострочныхРазделов.Вставить(ЭлементСтруктуры.Ключ, ДанныеФормыВЗначение(ЭтаФорма[ЭлементСтруктуры.Значение], Тип("ТаблицаЗначений")));
		
	КонецЦикла;
	
	СписокСохранения.Вставить("ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов);
	
	ДанныеМногостраничныхРазделов = Новый Структура;
	
	МассивТиповНеопределено = Новый Массив; 
	МассивТиповНеопределено.Добавить(Тип("Неопределено"));
	ОписаниеТиповНеопределено = Новый ОписаниеТипов(МассивТиповНеопределено);
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногостраничныхРазделов Цикл
		ИмяРаздела = ЭлементСтруктуры.Ключ;
		ИмяСтруктурыДанных = ЭлементСтруктуры.Значение;
		ДанныеВТаблицеЗначений = СведенияМногостраничногоРазделаВТаблице(ИмяСтруктурыДанных);
		Если ДанныеВТаблицеЗначений <> Неопределено Тогда
			ДанныеМногостраничныхРазделов.Вставить(ИмяРаздела, ДанныеВТаблицеЗначений);
		КонецЕсли;
	КонецЦикла;
	
	ХранилищеДанных = Новый ХранилищеЗначения(СписокСохранения);
	СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета = ХранилищеДанных;
	
	Попытка
		СтруктураРеквизитовФормы.мСохраненныйДок.Записать();
	Исключение
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецПопытки;
	Модифицированность = Ложь;
	
	СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения)
	
	КлючУникальности = СтруктураРеквизитовФормы.мСохраненныйДок;
	
	Если РезультатСохранения Тогда
		
		РегламентированнаяОтчетностьКлиент.ПослеЗаписиРегламентированногоОтчета(ЭтаФорма);
		
		Если ВыполняемоеОповещение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ВыполняемоеОповещение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСохраненияФормыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.Форма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета)
	
	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		ПоказателиОтчета.Вставить(Префикс + Раздел.ИмяСтраницы, ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы]);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СведенияМногостраничногоРазделаВТаблице(ИмяСтруктурыДанных)
	
	ОписаниеТиповНеопределено = Новый ОписаниеТипов("Неопределено");
	
	ТаблицаЗначенийСДанными = ДанныеФормыВЗначение(ЭтаФорма[ИмяСтруктурыДанных], Тип("ТаблицаЗначений"));
	
	Если ТаблицаЗначенийСДанными <> Неопределено Тогда
		
		Если ТаблицаЗначенийСДанными.Колонки.Найти("Данные") <> Неопределено Тогда
			ТаблицаЗначенийСДанными.Колонки.Удалить("Данные");
			ТаблицаЗначенийСДанными.Колонки.Добавить("Данные", ОписаниеТиповНеопределено);
			
			Ном = 0;
			Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначенийСДанными Цикл
				СтрокаТаблицыЗначений.Данные = ЭтаФорма[ИмяСтруктурыДанных][Ном].Данные[0].Значение;
				Ном = Ном + 1;
			КонецЦикла;
		КонецЕсли;
		
		Если ТаблицаЗначенийСДанными.Колонки.Найти("ДанныеДопСтрок") <> Неопределено Тогда
			ТаблицаЗначенийСДанными.Колонки.Удалить("ДанныеДопСтрок");
			ТаблицаЗначенийСДанными.Колонки.Добавить("ДанныеДопСтрок", ОписаниеТиповНеопределено);
			
			Ном = 0;
			Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначенийСДанными Цикл
				
				Если ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок.Количество() > 0
					И ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок[0].Представление = "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела" Тогда
					СтрокаТаблицыЗначений.ДанныеДопСтрок = ДанныеФормыВЗначение(ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок[0].Значение, Тип("ТаблицаЗначений"));
					
					Ном = Ном + 1;
					Продолжить;
				КонецЕсли;
				
				СтруктураДанныхДопСтрок = Новый Структура;
				
				Для Каждого ЭлСтруктуры Из ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок Цикл
					СтруктураДанныхДопСтрок.Вставить(ДанныеФормыВЗначение(ЭлСтруктуры.Значение, Тип("ТаблицаЗначений")));
				КонецЦикла;
				
				СтрокаТаблицыЗначений.ДанныеДопСтрок = СтруктураДанныхДопСтрок;
				
				Ном = Ном + 1;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаЗначенийСДанными;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьБланк(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБланкЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Команда = ДополнительныеПараметры.Команда;
	
	ДополнительныеПараметрыПечати = Новый Структура;
	ДополнительныеПараметрыПечати.Вставить("ВидПечати", Команда.Имя);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПечатьЗавершение", ЭтотОбъект, ДополнительныеПараметрыПечати);
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
						
	Иначе
		
		СохранитьНаКлиенте(, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьСразу(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьСразуЗавершение (Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Команда = ДополнительныеПараметры.Команда;
	
	Если Команда <> Неопределено Тогда
		Печать(Команда.Имя);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(ВидПечати, НеИзФормыОтчета = Ложь) Экспорт
	
	Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1. Формируется печатная форма...'"), ЭтаФорма.Заголовок), , , БиблиотекаКартинок.Печать);
	
	Если СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки <> Неопределено И СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки Тогда
		РегламентированнаяОтчетностьКлиент.ПроверитьКонтрольныеСоотношения(ЭтаФорма, ОбработкаКС);
	КонецЕсли;
	
	Если НЕ ПечатьНаСервере(ВидПечати) Тогда
		Возврат;
	КонецЕсли;
	
	
	ОбщиеРеквизитыРазделов = Новый Структура;
	
	
	РегламентированнаяОтчетностьКлиент.ОткрытьФормуПредварительногоПросмотра(ЭтаФорма, ВидПечати, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере(ВидПечати)
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	Раздел = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	СтруктураРеквизитовФормы.мПечатныеФормы.Очистить();
	СтруктураРеквизитовФормы.мРежимПечати = Истина;
	
	Для Каждого ЭлеменетДерева Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		Если ЭлеменетДерева.ВыводНаПечать = 1 Тогда
			ВывестиМакетСтраницыВТабличныйДокументНаСервере(ЭлеменетДерева.ИмяСтраницы);
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("НаименованиеЛиста",  ЭлеменетДерева.Представление);
			СтруктураПараметров.Вставить("ОриентацияЛиста",    ЭлеменетДерева.ОриентацияСтраницы);
			СтруктураПараметров.Вставить("ИмяСтраницы",        ЭлеменетДерева.ИмяСтраницы);
			Структурапараметров.Вставить("ИмяОбластиТаблПоля", "ТабличныйДокумент");
			СтруктураПараметров.Вставить("ВидПечати",          ВидПечати);
			
			РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, СтруктураПараметров, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(Раздел);
	
	РегламентированнаяОтчетностьКлиентСервер.ПроставлениеНомеровЛистов(ЭтаФорма, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	РегламентированнаяОтчетностьКлиент.ПередЗакрытиемРегламентированногоОтчета(ЭтаФорма, Отказ, СтандартнаяОбработка,ЗавершениеРаботы, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПриЗакрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	РегламентированнаяОтчетность.ПриЗакрытииРегламентированногоОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка);
	
	Если СтрЧислоВхождений(Область.Имя, "ДобавитьСтроку") > 0 Тогда
		ДобавитьСтроку("");
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "УдалитьСтроку") > 0 И Область.Гиперссылка Тогда
		УдалитьСтроку("");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка)
	
	//Если РегламентированнаяОтчетностьКлиент.ВыбраннаяОбластьРегламентированногоОтчетаНеВерна(ЭтаФорма, Область, СтандартнаяОбработка) Тогда
	//	Возврат;
	//КонецЕсли;
	
	ИмяЯчейки = Область.Имя;
	
	Если (Найти(ИмяЯчейки, "Первоначальная") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Очередная") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Дополнительная") > 0)
		ИЛИ (Найти(ИмяЯчейки, "ПоУведомлению") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Ликвидационная") > 0) 
		ИЛИ (Найти(ИмяЯчейки, "Приложение01") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Приложение02") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Приложение03") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Приложение04") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Приложение05") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Приложение06") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Приложение07") > 0)
		ИЛИ (Найти(ИмяЯчейки, "Приложение08") > 0)
		ИЛИ (Найти(ИмяЯчейки, "КатегорияA") > 0)
		ИЛИ (Найти(ИмяЯчейки, "КатегорияB") > 0)
		ИЛИ (Найти(ИмяЯчейки, "КатегорияC") > 0)
		ИЛИ (Найти(ИмяЯчейки, "РезидентРК") > 0)
		ИЛИ (Найти(ИмяЯчейки, "НерезидентРК") > 0)
		ИЛИ (Найти(ИмяЯчейки, "ПостоянноеУчереждениеЗаРК") > 0) Тогда
		РасчетНаКлиенте("Форма100Страница1",ИмяЯчейки);
	КонецЕсли;
	
	
	Если (Найти(ИмяЯчейки, "КодНалоговогоОргана") > 0) Тогда 
		
		ЗначенияОтборов = Новый Структура;
		ЗначенияОтборов.Вставить("Владелец", СтруктураРеквизитовФормы.Организация);
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", ЗначенияОтборов);
		ОповещениеВыбора = Новый ОписаниеОповещения("ПослеВыбораНалоговогоКомитета", ЭтаФорма);
		ОткрытьФорму("Справочник.РегистрацииВНалоговомОргане.Форма.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОповещениеВыбора,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНалоговогоКомитета(ВыбЭлемент, Параметры) Экспорт
	
	ПоменялсяНалоговыйКомитет = Ложь;
	
	Если ЗначениеЗаполнено(ВыбЭлемент) Тогда
		ПоменялсяНалоговыйКомитет = НЕ(СтруктураРеквизитовФормы.НалоговыйКомитет = ВыбЭлемент);
		СтруктураРеквизитовФормы.НалоговыйКомитет = ВыбЭлемент;
	КонецЕсли;
	
	Если ПоменялсяНалоговыйКомитет Тогда
		ЗаполнитьСведенияОбОрганизацииНаСервере();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	#Если ВебКлиент Тогда
		ВставитьДополнительнуюСтрокуНаСервере();
	#Иначе
		ВставитьДополнительнуюСтрокуНаКлиенте();
	#КонецЕсли
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура ВставитьДополнительнуюСтрокуНаСервере()
	
	ВставитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьДополнительнуюСтрокуНаКлиенте()
	
	ВставитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВставитьДополнительнуюСтроку(Форма, ИмяГруппыБлока = Неопределено, СпециальноеДобавление = Ложь, ИмяКолонкиНомера = Неопределено) Экспорт
	
	Перем СтруктураГруппы;
	Перем МаксимальноеКоличествоСтрокГруппы;
	
	Если ИмяГруппыБлока = Неопределено Тогда
		// Сначала выполним проверку на активную страницу панели формы,
		// которая содержит многострочный раздел
		#Если НаКлиенте Тогда
			ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		#Иначе
			ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		#КонецЕсли
		
		Если ИмяГруппы = Неопределено Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Не выбран многострочный раздел, в который необходимо добавить строку.'");
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли;
		
	Иначе
		ИмяГруппы = ИмяГруппыБлока;
	КонецЕсли;
	
	// Исходное количество строк группы
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, МаксимальноеКоличествоСтрокГруппы);
	
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = Форма[СтруктураГруппы];
	
	// определяем последнюю строку многострочной группы
	КолСтрок = СтруктураГруппы.Количество();
	КолСтрокСтр = Формат(КолСтрок, "ЧГ=");
	
	
	ИмяПервойЯчейкиПоследнейСтроки = ИмяГруппы + "01_" + КолСтрокСтр;
	
	// область первой ячейки последней строки многострочного раздела
	ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяПервойЯчейкиПоследнейСтроки];
	
	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// номера строк исходной области
	НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;
	НомерНижнЯчейкиОбласти = ОбластьЯчейки.Верх + ВысотаСтроки - 1;
	
	СдвигСтрок = НомерНижнЯчейкиОбласти - НомерВерхЯчейкиОбласти + 1;
	
	// номера строк вставляемой области
	НомерВерхЯчейкиНовойОбласти = НомерВерхЯчейкиОбласти + СдвигСтрок;
	НомерНижнЯчейкиНовойОбласти = НомерНижнЯчейкиОбласти + СдвигСтрок;
	
	НазначитьИмяОбластиМЧ = Ложь;
	ВставляемаяОбласть = ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, );
	Если СтрНайти(ВставляемаяОбласть.Имя, "МногострочнаяЧасть") Тогда
		НазначитьИмяОбластиМЧ = Истина;
		ИмяМногострочнойЧасти = ВставляемаяОбласть.Имя;
	КонецЕсли;
	
	Если НЕ СпециальноеДобавление Тогда
		
		РегламентированнаяОтчетностьВызовСервера.ВставитьОбластьВТабличныйДокумент(ТекТабличноеПоле, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
		
		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
	КонецЕсли;
	
	Если НазначитьИмяОбластиМЧ Тогда
		ТекТабличноеПоле.Область(НомерНижнЯчейкиОбласти + 1, , НомерНижнЯчейкиОбласти + (НомерНижнЯчейкиОбласти - НомерВерхЯчейкиОбласти) + 1, ).Имя = "";
		ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, ).Имя = ИмяМногострочнойЧасти;
	КонецЕсли;
	
	КолСтрокСтр1 = Формат(КолСтрок + 1, "ЧГ=");
	
	Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
		
		ИмяКолонки = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
		
		
		// переопределяем имена вставленной области
		Если СтруктураГруппы[0].Свойство(ИмяКолонки) Тогда
			
			ИмяОбластиЯчейки    = ИмяКолонки + "_" + КолСтрокСтр;
			ИмяНовОбластиЯчейки = ИмяКолонки + "_" + КолСтрокСтр1;
			
			ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяОбластиЯчейки];
			ОбластьЯчейки.Имя = ИмяНовОбластиЯчейки;
			
			Если (НомерГрафы = 1) Тогда
				ТекТабличноеПоле.Области["УдалитьСтроку" + ИмяОбластиЯчейки].Имя = "УдалитьСтроку" + ИмяНовОбластиЯчейки;
			КонецЕсли;
			
			// определяем границы ячейки исходной области
			НомерВерхСтрокиЯчейки  = ОбластьЯчейки.Верх - СдвигСтрок;
			НомерНижнСтрокиЯчейки  = ОбластьЯчейки.Низ  - СдвигСтрок;
			НомерЛевоКолонкиЯчейки = ОбластьЯчейки.Лево;
			НомерПравКолонкиЯчейки = ОбластьЯчейки.Право;
			
			// Назначаем имя ячейки исходной области,
			// (т.к. в результате вставки новой области оно было очищено)
			ОбластьЯчейкиИсходнойОбласти = ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки, НомерНижнСтрокиЯчейки, НомерПравКолонкиЯчейки);
			ОбластьЯчейкиИсходнойОбласти.Имя = ИмяОбластиЯчейки;
			
			Если (НомерГрафы = 1) Тогда
				
				ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки - 1, НомерНижнСтрокиЯчейки, НомерЛевоКолонкиЯчейки - 1).Имя  = "УдалитьСтроку" + ИмяОбластиЯчейки;
				
			КонецЕсли;
			
			// очищаем значения ячеек вставленной области
			Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
				ОбластьЯчейки.Очистить();
			КонецЕсли;
			
			Если ИмяКолонкиНомера <> Неопределено Тогда
				Если ИмяКолонкиНомера = ИмяКолонки Тогда
					Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
						ОбластьЯчейки.Значение = КолСтрокСтр1;
					Иначе
						ОбластьЯчейки.Текст = КолСтрокСтр1;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИмяГруппыБлока = Неопределено Тогда
		
		
		ИмяТекущейОбласти = ИмяГруппы + "01_" + КолСтрокСтр1;
		
		Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];
		
		// установим фокус на поле табличн. документа
		ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
		
	КонецЕсли;
	
	// добавляем в структуру многострочной группы новую строку
	ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,Форма);
	
	//ПрописатьФункцию добавления по всем страницам приложения
	
	Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
		Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
			ОбластьТД.Гиперссылка = Истина;
			ОбластьТД.Текст = "х";
		КонецЕсли;
	КонецЦикла;
	
	Форма.Модифицированность = Истина;
	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	
	ТекТабличноеПоле = ЭтаФорма["ТабличныйДокумент"];
	
	ТекущаяОбласть = ТекТабличноеПоле.ТекущаяОбласть;
	
	ИмяГруппы = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(ЭтаФорма, ТекущаяОбласть);
	
	Если ИмяГруппы = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не выбрана удаляемая строка многострочного раздела.'");
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьСтрокуЗавершение", ЭтотОбъект);
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Удалить выбранную строку?'"), Символы.ПС);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	#Если ВебКлиент Тогда
		УдалитьДополнительнуюСтрокуНаСервере();
	#Иначе
		УдалитьДополнительнуюСтрокуНаКлиенте();
	#КонецЕсли
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДополнительнуюСтрокуНаСервере()
	
	УдалитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДополнительнуюСтрокуНаКлиенте()
	
	УдалитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьДополнительнуюСтроку(Форма, СпециальноеДобавление = Ложь, ИмяКолонкиНомера = Неопределено) Экспорт
	
	Перем ИсходноеКоличествоСтрокГруппы;
	Перем СтруктураГруппы;
	
	ТекущаяСтраница = Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	ТекТабличноеПоле = Форма.ТабличныйДокумент;
	
	ТекущаяОбласть = Форма.Элементы["ТабличныйДокумент"].ТекущаяОбласть;
	
	#Если НаКлиенте ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		ИмяГруппы = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(Форма, ТекущаяОбласть);
	#Иначе
		ИмяГруппы = РегламентированнаяОтчетностьВызовСервера.РазделТекущейОбластиНаСервере(Форма, ТекущаяОбласть);
	#КонецЕсли
	
	// исходное количество строк группы
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
	
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = Форма[СтруктураГруппы];
	
	// Выполним также проверку вхождения текущей (выделенной) ячейки в многострочный раздел
	ТекущаяОбласть = Форма.Элементы["ТабличныйДокумент"].ТекущаяОбласть;
	
	ИмяЯчейки = ТекущаяОбласть.Имя;
	
	// номер строки многострочного раздела определим
	// по имени выделенной ячейки
	НомУдаляемойСтроки = Число(Сред(ИмяЯчейки, СтрНайти(ИмяЯчейки, "_") + 1));
	НомерСтрокиТаблицы = НомУдаляемойСтроки - 1; // нумерация строк в таблице значений начинается с нуля
	
	Если СтруктураГруппы.Количество() > ИсходноеКоличествоСтрокГруппы Тогда
		
		ИмяПервойЯчейкиУдаляемойСтроки = "УдалитьСтроку" + ИмяГруппы + "01_" + Формат(НомУдаляемойСтроки, "ЧГ=0");
		
		// область первой ячейки удаляемой строки многострочного раздела
		ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяПервойЯчейкиУдаляемойСтроки];
		
		НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
		ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
		
		НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;
		НомерНижнЯчейкиОбласти = ОбластьЯчейки.Верх + ВысотаСтроки - 1;
		
		МногострочностьВРазделе = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе");
		МногострочностьВРазделеТип = ТипЗнч(МногострочностьВРазделе);
		Если МногострочностьВРазделеТип = Тип("Число") Тогда
			ИмяОбластиМнгЧ = "МногострочнаяЧасть";
		ИначеЕсли МногострочностьВРазделеТип = Тип("ДанныеФормыКоллекция") Тогда
			ИмяОбластиМнгЧ = МногострочностьВРазделе.НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0].Область;
		КонецЕсли;
		// Найдем координаты области, для последующего восстановления.
		
		Если ТекТабличноеПоле.Области.Найти(ИмяОбластиМнгЧ) <> Неопределено Тогда
			ОбластьВерх = ТекТабличноеПоле.Области[ИмяОбластиМнгЧ].Верх;
			ОбластьНиз = ТекТабличноеПоле.Области[ИмяОбластиМнгЧ].Низ;
		КонецЕсли;
		
		Если СпециальноеДобавление Тогда
			
		Иначе
			
			РегламентированнаяОтчетностьВызовСервера.УдалитьОбластьИзТабличногоДокумента(ТекТабличноеПоле, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
			
			Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
			
		КонецЕсли;
		// Восстановим область.
		ТекТабличноеПоле.Область(ОбластьВерх, 0, ОбластьНиз, 0).Имя = ИмяОбластиМнгЧ;
		
		КолвоСдвигаемыхСтрок = СтруктураГруппы.Количество() - НомУдаляемойСтроки;
		
		// обновим имена ячеек сдвинутых строк
		Если КолвоСдвигаемыхСтрок > 0 Тогда
			
			Для НСтр = НомУдаляемойСтроки + 1 По СтруктураГруппы.Количество() Цикл
				
				ТекСтрока = СтруктураГруппы[НСтр - 1];
				
				НСтрСтр = Формат(НСтр, "ЧГ=0");
				НСтрСтр1 = Формат(НСтр - 1, "ЧГ=0");
				
				Для НомерГрафы = 0 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
					
					Если НомерГрафы = 0 Тогда
						
						КолонкаИмя = "УдалитьСтроку" + ИмяГруппы + Формат( 1, "ЧЦ=2; ЧВН=");
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ИмяКолонкиНомера <> Неопределено Тогда
							Если ИмяКолонкиНомера = КолонкаИмя Тогда
								// обновляем порядковый номер строки
								
								СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
								НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
								ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер;
								
								// обновляем значение элемента таблицы значений
								ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
					КолонкаИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
					
					Если СтруктураГруппы[0].Свойство(КолонкаИмя) Тогда
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ИмяКолонкиНомера <> Неопределено Тогда
							Если ИмяКолонкиНомера = КолонкаИмя Тогда
								// обновляем порядковый номер строки
								
								СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
								НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
								ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер;
								
								// обновляем значение элемента таблицы значений
								ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
		КонецЕсли;
		// обновляем структуру многострочного раздела
		
		//Процедура удаления по всем страницам приложения
		УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма);
		
	Иначе
		// строка не удаляется в форме табличного документа,
		// а должна осуществляться сдвиг строк
		
		// обновляем структуру многострочного раздела
		// методом удаления выбранной строки и добавления пустой строки
		
		//Процедура удаления по всем страницам приложения
		УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма);
		
		//Процедура удаления по всем страницам приложения
		ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,Форма);
		
		// обновляем порядковые номера строк, выводимых в табличный документ
		Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
			
			НомерСтрокиВТаблице = СтруктураГруппы.Индекс(СтрокаТаблицы);
			НомерСтрокиВФормеТаблицы = Формат(НомерСтрокиВТаблице + 1, "ЧГ=0");
			
			Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
				
				КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
				
				Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
					
					Если ИмяКолонкиНомера <> Неопределено Тогда
						Если ИмяКолонкиНомера = КолонкаТаблицыИмя Тогда
							// обновляем порядковый номер строки
							СтрокаТаблицы[КолонкаТаблицыИмя] = НомерСтрокиВФормеТаблицы;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;	
				
			КонецЦикла;
			
		КонецЦикла;
		
		// Данные в многострочном блоке обновляются в декларациях!
		// Форма.ОбновитьСтруктуруМногострочногоРаздела(ИмяГруппы);
		// Обновляем экранную форму табличного документа
		#Если НаКлиенте Тогда
			Форма.ВывестиРазделВТабличныйДокументНаКлиенте(ИмяГруппы, СтруктураГруппы);
		#Иначе
			Форма.ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппы, СтруктураГруппы);
		#КонецЕсли
		
	КонецЕсли;
	
	// назначим текущей областью таблицы первую редактируемую ячейку
	// удаленной строки, если ее порядковый номер меньше кол-ва строк
	// многострочного раздела, или последней строки раздела в противном случае
	
	// определяем текущую область таблицы
	НомТекущейСтроки = Мин(НомУдаляемойСтроки, СтруктураГруппы.Количество());
	
	ИмяТекущейОбласти = "УдалитьСтроку" + ИмяГруппы + "01_" + Формат(НомТекущейСтроки, "ЧГ=0");
	
	Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];
	
	// установим фокус на поле табличн. документа
	ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
	
	ЕстьДопСтроки = Ложь;
	
	Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
		Если СтрЧислоВхождений(ОбластьТД.Имя, "_2") > 0 Тогда
			ЕстьДопСтроки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьДопСтроки Тогда
		Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
			Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
				ОбластьТД.Гиперссылка = Ложь;
				ОбластьТД.Текст = "";
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Форма.Модифицированность = Истина;
	
	#Если НаКлиенте Тогда
		Форма.РасчетНаКлиенте(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	#Иначе
		Форма.РасчетНаСервере(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы11", СтруктураРеквизитовФормы.мИдГруппы11);
	ИдГрупп.Вставить("мИдГруппы12", СтруктураРеквизитовФормы.мИдГруппы12);
	
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста, , ИдГрупп);
	
КонецФункции

&НаКлиенте
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы11", СтруктураРеквизитовФормы.мИдГруппы11);
	ИдГрупп.Вставить("мИдГруппы12", СтруктураРеквизитовФормы.мИдГруппы12);
	
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста, , ИдГрупп);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста = Неопределено, ТекущаяСтраница, ИдГрупп)
	
	Перем ИмяГруппы;
	
	Если ИмяЛиста = Неопределено Тогда
		ИмяТекущейСтраницыПанели = ТекущаяСтраница.Имя;
	Иначе
		ИмяТекущейСтраницыПанели = ИмяЛиста;
	КонецЕсли;
	
	Если ИмяТекущейСтраницыПанели = "Форма100_01Страница1" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы11;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма100_01Страница2" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы12;
	КонецЕсли;
	
	Возврат ИмяГруппы;
	
КонецФункции

&НаКлиенте
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы11", СтруктураРеквизитовФормы.мИдГруппы11);
	ИдГрупп.Вставить("мИдГруппы12", СтруктураРеквизитовФормы.мИдГруппы12);
	
	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

&НаСервере
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы11", СтруктураРеквизитовФормы.мИдГруппы11);
	ИдГрупп.Вставить("мИдГруппы12", СтруктураРеквизитовФормы.мИдГруппы12);
	
	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп) Экспорт
	
	Перем ТекТабличноеПоле;
	
	Если ИдГруппы = ИдГрупп.мИдГруппы11 Тогда
		
		ТекТабличноеПоле = "Форма100_01Страница1";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы12 Тогда
		
		ТекТабличноеПоле = "Форма100_01Страница2";
		
	КонецЕсли;
	
	Возврат ТекТабличноеПоле;
	
КонецФункции

&НаКлиенте
Процедура ВывестиРазделВТабличныйДокументНаКлиенте(ИмяГруппы, СтруктураГруппы) Экспорт
	ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
КонецПроцедуры

&НаСервере
Процедура ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппы, СтруктураГруппы) Экспорт
	ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма)
	
	Если Число(Сред(ИмяГруппы,5,1)) = 1 Тогда
		
		СтруктураГруппы = Форма["П0001100001"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0001200002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
	КонецЕсли;
	
	ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма,НомерСтрокиТаблицы, Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы, Форма)
	
	
	Если Число(Сред(ИмяГруппы,5,1)) = 1 Тогда
		
		СтруктураГруппы = Форма["П0001100001"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0001200002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
	КонецЕсли;
	
	ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма, СтруктураГруппы.Количество(), Ложь);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма, НомерСтроки, УдалитьСтроку)
	
	
	Если УдалитьСтроку = Ложь Тогда
		ИндексПересчета = НомерСтроки - 2
	Иначе
		ИндексПересчета = НомерСтроки;
	КонецЕсли;
	
	Если Число(Сред(ИмяГруппы,5,1)) = 1 Тогда
		
		СтруктураГруппы = Форма["П0001100001"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000110000101 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0001200002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000120000201 = Индекс + 2;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокСтруктурныхЕдиниц(Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	(Организации.ГоловнаяОрганизация = &Организация
	|			ИЛИ Организации.Ссылка = &Организация)
	|";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Результат = Запрос.Выполнить().Выгрузить();
	СписокОрганизаций = Результат.ВыгрузитьКолонку("Ссылка");
	
	Возврат СписокОрганизаций;
	
КонецФункции
	
#Область СлужебныеПроцедурыИМетоды_Расшифровка

&НаКлиентеНаСервереБезКонтекста
Функция Форма100ПолучитьСписокКодовСтрокБезРасшифровки()
	
	СписокКодовДляИсключения = Новый СписокЗначений;
	СписокКодовДляИсключения.Добавить("s_100_00_005");
	СписокКодовДляИсключения.Добавить("s_100_00_008");
	
	СписокКодовДляИсключения.Добавить("s_100_00_009");
	СписокКодовДляИсключения.Добавить("s_100_00_009_1");
	СписокКодовДляИсключения.Добавить("s_100_00_009_2");
	СписокКодовДляИсключения.Добавить("s_100_00_009_3");
	
	СписокКодовДляИсключения.Добавить("s_100_00_017");
	СписокКодовДляИсключения.Добавить("s_100_00_021");
	СписокКодовДляИсключения.Добавить("s_100_00_021_1");
	СписокКодовДляИсключения.Добавить("s_100_00_021_2");
	СписокКодовДляИсключения.Добавить("s_100_00_021_3");
	СписокКодовДляИсключения.Добавить("s_100_00_022");
	СписокКодовДляИсключения.Добавить("s_100_00_036");
	
	Для Н = 31 По 40 Цикл
		СписокКодовДляИсключения.Добавить("s_100_00_0" + Н);
	КонецЦикла;
	
	СписокКодовДляИсключения.Добавить("s_100_00_030"); // Итоговая. Арифметически расчитываемая
	СписокКодовДляИсключения.Добавить("s_100_00_030_1"); 	
	СписокКодовДляИсключения.Добавить("s_100_00_030_2"); 	
	
	СписокКодовДляИсключения.Добавить("s_100_00_025"); // НОД. арифметически расчитываемая
	СписокКодовДляИсключения.Добавить("s_100_00_028"); // НОД с учетом иностранного дохода. арифметически расчитываемая
	СписокКодовДляИсключения.Добавить("s_100_00_029"); // Убыток, подлежащий переносу.арифметически расчитываемая
	СписокКодовДляИсключения.Добавить("s_100_00_036_1"); 
	СписокКодовДляИсключения.Добавить("s_100_00_036_2"); 
	СписокКодовДляИсключения.Добавить("s_100_00_036_3"); 
	СписокКодовДляИсключения.Добавить("s_100_00_036_4"); 
	СписокКодовДляИсключения.Добавить("s_100_00_036_5"); 
	
	СписокКодовДляИсключения.Добавить("s_100_00_037_1"); 
	СписокКодовДляИсключения.Добавить("s_100_00_037_2"); 
	СписокКодовДляИсключения.Добавить("s_100_00_037_3"); 
	СписокКодовДляИсключения.Добавить("s_100_00_037_4"); 
	СписокКодовДляИсключения.Добавить("s_100_00_037_5"); 
	СписокКодовДляИсключения.Добавить("s_100_00_037_6"); 
	
	СписокКодовДляИсключения.Добавить("s_100_00_039_1"); 
	СписокКодовДляИсключения.Добавить("s_100_00_039_2_2"); 
	СписокКодовДляИсключения.Добавить("s_100_00_039_3"); 
	СписокКодовДляИсключения.Добавить("s_100_00_039_4_1"); 
	СписокКодовДляИсключения.Добавить("s_100_00_039_5"); 
	
	Возврат СписокКодовДляИсключения;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Форма100ПолучитьСписокКодовСтрокВключаемыхВРасшифровку(ИмяЯчейки)
	
	КодыСтрокРасшифровки = Новый СписокЗначений;

	Если ИмяЯчейки = "100.00.009.VIII" Тогда 
		КодыСтрокРасшифровки.Добавить("100.00.009.VIII");
	    КодыСтрокРасшифровки.Добавить("100.00.009.IIIA");
		КодыСтрокРасшифровки.Добавить("100.00.009.IIIB");
		КодыСтрокРасшифровки.Добавить("100.00.009.IIIC");
		КодыСтрокРасшифровки.Добавить("100.00.009.IIID");
		КодыСтрокРасшифровки.Добавить("100.00.009.IIIE");
		КодыСтрокРасшифровки.Добавить("100.00.009.IIIF");
		КодыСтрокРасшифровки.Добавить("100.00.009.IIIG");
		КодыСтрокРасшифровки.Добавить("100.00.009.IIIH");
	
	ИначеЕсли ИмяЯчейки = "100.00.026" Тогда
		КодыСтрокРасшифровки.Добавить("100.00.026");
	    КодыСтрокРасшифровки.Добавить("100.00.026.I");
		
    ИначеЕсли ИмяЯчейки = "100.00.030" Тогда 
		КодыСтрокРасшифровки.Добавить("100.00.030.I");
	    КодыСтрокРасшифровки.Добавить("100.00.030.II");
		
	ИначеЕсли ИмяЯчейки = "100.00.004" ИЛИ ИмяЯчейки = "100.00.020" Тогда
		КодыСтрокРасшифровки.Добавить("100.00.004");
		КодыСтрокРасшифровки.Добавить("100.00.020");
		
		Если ИмяЯчейки = "100.00.004" Тогда
			КодыСтрокРасшифровки.Добавить("100.00.006");
		КонецЕсли;
		
	ИначеЕсли ИмяЯчейки = "100.00.003" Тогда
		КодыСтрокРасшифровки.Добавить("100.00.003");
		КодыСтрокРасшифровки.Добавить("100.00.003.I");
		
	ИначеЕсли ИмяЯчейки = "100.00.019" Тогда
		КодыСтрокРасшифровки.Добавить("100.00.019");
	    КодыСтрокРасшифровки.Добавить("100.00.019.I");

	Иначе 	
		КодыСтрокРасшифровки.Добавить(ИмяЯчейки);
		
	КонецЕсли;
	
	Возврат КодыСтрокРасшифровки;
	
КонецФункции //Форма100ПолучитьСписокКодовСтрокВключаемыхВРасшифровку

&НаКлиенте
Процедура Форма100РасшифровкаСКД(ИмяЯчейки, МетодРасшифровки)
	
	Если СтруктураСоответствияКодовСтрок.Свойство(ИмяЯчейки) <> Ложь Тогда
		ИмяЯчейки = СтруктураСоответствияКодовСтрок[ИмяЯчейки];
	Иначе
		Возврат;
	КонецЕсли;
	
	СписокКодовДляИсключения = Форма100ПолучитьСписокКодовСтрокБезРасшифровки();
	ИмяЯчейкиПроверкаИскл    = "s_" + СтрЗаменить(ПреобразоватьРимскиеЦифрыВКодеСтроки(ИмяЯчейки), ".", "_");
	
	Если СписокКодовДляИсключения.НайтиПоЗначению(ИмяЯчейкиПроверкаИскл) <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Расшифровка данной ячейки не поддерживается.'"));
	    Возврат;
	КонецЕсли;

	СписокДохКодовСтрок = Форма100ПолучитьСписокКодовДоходов();
	СписокРасКодовСтрок = Форма100ПолучитьСписокКодовРасходов();
	
	ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
	
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("НачалоПериода", 	СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("КонецПериода",  	СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ТипДанных", 		"РегистрыБухгалтерии");
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ИмяОбъекта", 	"Хозрасчетный");
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ИмяТаблицы", 	"Обороты");
	
	// ПР включаются только в строку 100.00.009
	ВключатьПР = Ложь;
	ИмяРазделаРасшифровки = "Декларация по КПН:" + СтруктураРеквизитовФормы.мГод;  // для сохранения однотипных настроек раздела
	Если СокрЛП(ИмяЯчейки)	 = "100.00.009.IV" Тогда		
		ИмяСхемыКомпоновкиДанных = "РасшифровкаВычетаПоРеализованнымТоварам_ЗаработнаяПлата";
		ИмяРазделаРасшифровки = ИмяРазделаРасшифровки + ", Заработная плата";
	ИначеЕсли СокрЛП(ИмяЯчейки)	 = "100.00.009.V" Тогда		
		ИмяСхемыКомпоновкиДанных = "РасшифровкаВычетаПоРеализованнымТоварам_РБП";
		ИмяРазделаРасшифровки = ИмяРазделаРасшифровки + ", Вычеты по реализованным товарам";
	ИначеЕсли СокрЛП(ИмяЯчейки)	 = "100.00.009.VI" Тогда				
		ИмяСхемыКомпоновкиДанных = "РасшифровкаВычетаПоРеализованнымТоварам_РемонтВА";
		ИмяРазделаРасшифровки = ИмяРазделаРасшифровки + ", Вычеты по реализованным товарам (ремонт)";
	ИначеЕсли СокрЛП(ИмяЯчейки)	 = "100.00.009.VII" Тогда		
		ИмяСхемыКомпоновкиДанных = "РасшифровкаВычетаПоРеализованнымТоварам_ВключеноВСтоимостьВА";
		ИмяРазделаРасшифровки = ИмяРазделаРасшифровки + ", Вычеты по реализованным товарам (ВА)";
	ИначеЕсли СокрЛП(ИмяЯчейки)	 = "100.00.009.VIII" Тогда		
		ИмяСхемыКомпоновкиДанных = "РасшифровкаВычетаПоРеализованнымТоварам_ПР";
		ИмяРазделаРасшифровки = ИмяРазделаРасшифровки + ", Вычеты по реализованным товарам (ПР)";
	ИначеЕсли СокрЛП(ИмяЯчейки)	 = "100.00.009.IX" Тогда
		ИмяСхемыКомпоновкиДанных = "РасшифровкаВычетаПоРеализованнымТоварам_РБПОстатки";
	ИначеЕсли СокрЛП(ИмяЯчейки)	 = "100.00.009.IIIA" Тогда		
		ИмяСхемыКомпоновкиДанных = "РасшифровкаВычетаПоРеализованнымТоварам_ПриобретениеТМЗ";
		ИмяРазделаРасшифровки = ИмяРазделаРасшифровки + ", Вычеты по реализованным товарам";	
	ИначеЕсли Лев(ИмяЯчейки,10)	 = "100.00.009" Тогда
		ИмяСхемыКомпоновкиДанных = "РасшифровкаВычетаПоРеализованнымТоварам_ПриобретениеУслуг";
		ИмяРазделаРасшифровки = ИмяРазделаРасшифровки + ", Вычеты по реализованным товарам";
	ИначеЕсли СокрЛП(ИмяЯчейки)	 = "100.00.018" Тогда  // Примечание: проверить расшифровку преференций
	
		ИмяСхемыКомпоновкиДанных = "РасшифровкаЗатрат";
		ИмяРазделаРасшифровки = ИмяРазделаРасшифровки + ", Вычеты";
			
	ИначеЕсли СокрЛП(ИмяЯчейки)	 = "100.00.004" Тогда
		ИмяСхемыКомпоновкиДанных = "РасшифровкаДоходовПрочих";
		ИмяРазделаРасшифровки = "Декларация по КПН:" + СтруктураРеквизитовФормы.мГод + ", Доходы";
		
	ИначеЕсли СокрЛП(ИмяЯчейки)	 = "100.00.020" Тогда
		ИмяСхемыКомпоновкиДанных = "РасшифровкаЗатратПрочих";
		ИмяРазделаРасшифровки = ИмяРазделаРасшифровки + ", Вычеты";
	
	ИначеЕсли СписокДохКодовСтрок.НайтиПоЗначению(ИмяЯчейки) = Неопределено Тогда		
		ИмяСхемыКомпоновкиДанных = "РасшифровкаЗатрат";
		ИмяРазделаРасшифровки = ИмяРазделаРасшифровки + ", Вычеты";
	Иначе
		ИмяСхемыКомпоновкиДанных = Неопределено;
		ИмяРазделаРасшифровки = "Декларация по КПН:" + СтруктураРеквизитовФормы.мГод + ", Доходы";
	КонецЕсли;	
	
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СхемаКомпоновкиДанных", ПолучитьАдресМакетаСКД(ИмяСхемыКомпоновкиДанных));
	
	// Группировки	
	МассивГруппировок = Новый Массив();
	МассивГруппировок.Добавить(Новый Структура("Использование, Поле, Представление, ТипГруппировки", Истина, "КодСтроки", НСтр("ru = 'Код строки'"), 3));	
		
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Группировка",  МассивГруппировок);
	
	// Сортировка
	ПользовательскиеСортировки = ПользовательскиеНастройки.Элементы.Добавить(Тип("ПорядокКомпоновкиДанных"));
	ПользовательскиеСортировки.ИдентификаторПользовательскойНастройки = "Порядок";
	
	НовыйЭлементПорядка = ПользовательскиеСортировки.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	НовыйЭлементПорядка.Использование  = Истина;
	НовыйЭлементПорядка.Поле  = новый ПолеКомпоновкиДанных("Регистратор");

	//Параметры
	МассивПараметровДанных = Новый Массив();   
	
	КодыСтрокРасшифровки = Форма100ПолучитьСписокКодовСтрокВключаемыхВРасшифровку(ИмяЯчейки);
	ДобавитьПараметр(МассивПараметровДанных, "КодСтрокиРасшифровки",   КодыСтрокРасшифровки);
   
	ДобавитьПараметр(МассивПараметровДанных, "КодСтрокиДоходОтКурсовойРазницы",   СтруктураРеквизитовФормы.КодСтрокиДоходОтКурсовойРазницы);
	ДобавитьПараметр(МассивПараметровДанных, "КодСтрокиРасходыПоКурсовойРазнице", СтруктураРеквизитовФормы.КодСтрокиРасходыПоКурсовойРазнице);

	// так как в 100.00.009 не включается НЗС
	СчетаРасходов = Новый СписокЗначений;
	СчетаРасходов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Расходы"));    					
	СчетаРасходов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.СчетаПроизводственногоУчета"));
	ДобавитьПараметр(МассивПараметровДанных, "СчетаРасходов", СчетаРасходов);
	
	СчетаРасходовИНезавершенногоСтроительства = Новый СписокЗначений;
	СчетаРасходовИНезавершенногоСтроительства.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.НезавершенноеСтроительство"));
	СчетаРасходовИНезавершенногоСтроительства.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Расходы"));
	СчетаРасходовИНезавершенногоСтроительства.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.СчетаПроизводственногоУчета"));
	ДобавитьПараметр(МассивПараметровДанных, "СчетаРасходовИНезавершенногоСтроительства", СчетаРасходовИНезавершенногоСтроительства);
	
	СписокСчетовСтрокиA = Новый СписокЗначений;
	СписокСчетовСтрокиA.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Товары"));
	СписокСчетовСтрокиA.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.СырьеИМатериалы"));
	СписокСчетовСтрокиA.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПрочиеЗапасы"));
	СписокСчетовСтрокиA.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.РезервыПодСнижениеСтоимостиМЦ"));
	СписокСчетовСтрокиA.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.МонтажОборудования"));
	
	ДобавитьПараметр(МассивПараметровДанных, "СписокСчетовСтрокиA", СписокСчетовСтрокиA);
	
	КодыДляИсключенияИзОсновногоЗапроса = Новый СписокЗначений;
	КодыДляИсключенияИзОсновногоЗапроса.Добавить(СтруктураРеквизитовФормы.КодСтрокиДоходОтКурсовойРазницы);
	КодыДляИсключенияИзОсновногоЗапроса.Добавить(СтруктураРеквизитовФормы.КодСтрокиРасходыПоКурсовойРазнице);
	КодыДляИсключенияИзОсновногоЗапроса.Добавить("100.00.009.IIIA"); 					
	КодыДляИсключенияИзОсновногоЗапроса.Добавить("100.00.009.IIIB"); 					
	КодыДляИсключенияИзОсновногоЗапроса.Добавить("100.00.009.IIIC"); 					
	КодыДляИсключенияИзОсновногоЗапроса.Добавить("100.00.009.IIID"); 					
	КодыДляИсключенияИзОсновногоЗапроса.Добавить("100.00.009.IIIE"); 					
	КодыДляИсключенияИзОсновногоЗапроса.Добавить("100.00.009.IIIF"); 					
	КодыДляИсключенияИзОсновногоЗапроса.Добавить("100.00.009.IIIG"); 					
	КодыДляИсключенияИзОсновногоЗапроса.Добавить("100.00.009.IIIH");
	КодыДляИсключенияИзОсновногоЗапроса.Добавить("100.00.009.IV");
	КодыДляИсключенияИзОсновногоЗапроса.Добавить("100.00.009.V");
	КодыДляИсключенияИзОсновногоЗапроса.Добавить("100.00.009.VI");
	КодыДляИсключенияИзОсновногоЗапроса.Добавить("100.00.009.VII");
	КодыДляИсключенияИзОсновногоЗапроса.Добавить("100.00.009.VIII");
	КодыДляИсключенияИзОсновногоЗапроса.Добавить("100.00.009.IX");
	КодыДляИсключенияИзОсновногоЗапроса.Добавить("100.00.009%");
	
	СписокОрганизаций = Новый СписокЗначений;
	Для Каждого СтрокаМассива Из СтруктураРеквизитовФормы.ГруппаОрганизаций ЦИкл
		СписокОрганизаций.Добавить(СтрокаМассива);
	КонецЦикла;	
	
	ДобавитьПараметр(МассивПараметровДанных, "КодыДляИсключенияИзОсновногоЗапроса", КодыДляИсключенияИзОсновногоЗапроса);
	ДобавитьПараметр(МассивПараметровДанных, "СписокОрганизаций", 					СписокОрганизаций);//СтруктураРеквизитовФормы.ГруппаОрганизаций);
	ДобавитьПараметр(МассивПараметровДанных, "КодСтроки", 							"100.00%");
	
	ДобавитьПараметр(МассивПараметровДанных, "НачалоПериода", 				НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета));
	ДобавитьПараметр(МассивПараметровДанных, "КонецПериода", 				КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));
	ДобавитьПараметр(МассивПараметровДанных, "НачПериода", 					СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	ДобавитьПараметр(МассивПараметровДанных, "КонПериода", 					СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	ДобавитьПараметр(МассивПараметровДанных, "НачГраница", 					СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	ДобавитьПараметр(МассивПараметровДанных, "КонГраница", 					КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета) + 1);
	ДобавитьПараметр(МассивПараметровДанных, "Организация", 				СтруктураРеквизитовФормы.Организация);
	ДобавитьПараметр(МассивПараметровДанных, "ПустаяОрганизация", 			ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));
	ДобавитьПараметр(МассивПараметровДанных, "ПустоеЗначение", 				Неопределено);
	ДобавитьПараметр(МассивПараметровДанных, "ВидСубконтоЗатрат", 			ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат"));
	ДобавитьПараметр(МассивПараметровДанных, "ВидСубконтоДоходов", 			ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы"));
	ДобавитьПараметр(МассивПараметровДанных, "ПустоеРБП", 					ПредопределенноеЗначение("ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка"));
	ДобавитьПараметр(МассивПараметровДанных, "СчетНЗС", 					ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.НезавершенноеСтроительство"));
	ДобавитьПараметр(МассивПараметровДанных, "СчетаДоходов", 				ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Доходы"));
	ДобавитьПараметр(МассивПараметровДанных,  "ВидСубконтоСтатьиДДС", 		ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДвиженияДенежныхСредств"));
	
	ДобавитьПараметр(МассивПараметровДанных, "Счет000", 					ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Вспомогательный"));
	ДобавитьПараметр(МассивПараметровДанных, "КодСтроки", 					"100.00%");
      
	СписокСчетовАктивов = Новый СписокЗначений;
	СписокСчетовАктивов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Запасы")); 		  			  	
	СписокСчетовАктивов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.КраткосрочныеРасходыБудущихПериодов")); //1620
	СписокСчетовАктивов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПрочиеКраткосрочныеАктивы")); // 1630
	СписокСчетовАктивов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ДолгосрочныеРасходыБудущихПериодов"));  //2920
	СписокСчетовАктивов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ДолгосрочныеАктивыДляПродажи_"));
	СписокСчетовАктивов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.МонтажОборудования")); //2932
	
	ДобавитьПараметр(МассивПараметровДанных, "СписокСчетовАктивов", СписокСчетовАктивов);
	
	КорСчетаИсключенияИзСтрокиА = Новый СписокЗначений;
	КорСчетаИсключенияИзСтрокиА.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ГотоваяПродукция"));
	КорСчетаИсключенияИзСтрокиА.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Расходы"));
	КорСчетаИсключенияИзСтрокиА.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.СчетаПроизводственногоУчета"));
	КорСчетаИсключенияИзСтрокиА.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Вспомогательный"));
	
	ДобавитьПараметр(МассивПараметровДанных, "КорСчетаИсключенияИзСтрокиА", КорСчетаИсключенияИзСтрокиА);
	
	СчетаРасчетов = Новый СписокЗначений;
	СчетаРасчетов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.КраткосрочнаяДебиторскаяЗадолженность"));
	СчетаРасчетов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПрочиеКраткосрочныеАктивы_"));
	СчетаРасчетов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ДолгосрочнаяДебиторскаяЗадолженность"));
	СчетаРасчетов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ДолгосрочныеАвансыВыданные"));
	СчетаРасчетов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.КраткосрочнаяКредиторскаяЗадолженность"));
	СчетаРасчетов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.КраткосрочныеОценочныеОбязательства"));
	СчетаРасчетов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПрочиеКраткосрочныеОбязательства_"));
	СчетаРасчетов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ДолгосрочнаяКредиторскаяЗадолженность"));
	СчетаРасчетов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ДолгосрочныеОценочныеОбязательства"));
	СчетаРасчетов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПрочиеДолгосрочныеОбязательства_"));
	
	ДобавитьПараметр(МассивПараметровДанных, "СчетаРасчетовСКонтрагентом", СчетаРасчетов);
		
	СчетаИсклюючения = Новый СписокЗначений;
	СчетаИсклюючения.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.КраткосрочнаяЗадолженностьПоВыплаченнойЗаработнойПлате")); //1253
	СчетаИсклюючения.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ДолгосрочнаяЗадолженностьПоВыплаченнойЗаработнойПлате")); //2152
	СчетаИсклюючения.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда")); //3350
	СчетаИсклюючения.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.РасчетыПоДепонированнымСуммам")); //3394
	СчетаИсклюючения.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ДолгосрочнаяЗадолженностьПоДепонированнойЗаработнойПлате")); //4174
	
	ДобавитьПараметр(МассивПараметровДанных, "ИсключаемыеСчетаРасчетов", СчетаИсклюючения);

	СчетаРБП = новый СписокЗначений;
	СчетаРБП.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.КраткосрочныеРасходыБудущихПериодов")); //1620
	СчетаРБП.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ДолгосрочныеРасходыБудущихПериодов"));  //2920
	ДобавитьПараметр(МассивПараметровДанных, "СчетаРБП", СчетаРБП);

	СчетаВА = Новый СписокЗначений;
	СчетаВА.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПодготовкаКВводуВЭксплуатациюИнвестицийВНедвижимость")); //2311
	СчетаВА.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПодготовкаКВводуВЭксплуатацию")); //2411
	//СчетаВА.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПодготовкаКВводуВЭксплуатациюАрендованногоИмущества")); //2441 с 2019 года
	СчетаВА.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.БиологическиеАктивы")); //2500
	СчетаВА.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.РазведочныеИОценочныеАктивы")); //2610
	СчетаВА.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Гудвилл")); //2710
	СчетаВА.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.НематериальныеАктивыОрганизации")); //2730
	
	ДобавитьПараметр(МассивПараметровДанных, "СчетаВА", СчетаВА);
	ДобавитьПараметр(МассивПараметровДанных, "СчетаУчетаДенежныхСредств", ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ДенежныеСредства"));
	
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПараметрыДанных", МассивПараметровДанных);
	
	ПользовательскиеПоля = ПользовательскиеНастройки.Элементы.Добавить(Тип("ВыбранныеПоляКомпоновкиДанных"));	
	ПользовательскиеПоля.ИдентификаторПользовательскойНастройки = "Выбор";	

	БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "КорСубконто1", 	"Кор субконто 1");
	БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "СуммаВДекларации", "Сумма в декларации");
	БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "СуммаНУ", 			"Сумма НУ");
	БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "СуммаПР", 			"Сумма ПР");
	БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "СуммаВР", 			"Сумма ВР");
	
	БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПользовательскиеПоля, "Регистратор", "Документ движения");		
	
	// Прочие настройки
	ТекстЗаголовка = НСтр("ru = 'Регистр налогового учета к строке %1 для Декларации по КПН'");	
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Заголовок", 	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗаголовка, ИмяЯчейки));
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ВыводитьЗаголовок", Истина);	
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ВыводитьПодписи", Истина); 	
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидРасшифровки", 2);
	ПараметрыФормы.Вставить("РежимРасшифровки", Истина);
	ПараметрыФормы.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);	
	ПараметрыФормы.Вставить("ВыводитьЗаголовок", Истина);	
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", ИмяРазделаРасшифровки);
	
	ОткрытьФорму("Отчет.РасшифровкаРегламентированныхОтчетов.Форма.ФормаОтчета", ПараметрыФормы,, Истина);

КонецПроцедуры

&НаСервере
Функция ПолучитьАдресМакетаСКД(Знач ИмяРаздела, ТекстЗапроса = "", СписокСчетов = Неопределено, СписокКодовСтрок = Неопределено)
	
	//Если КодФормы = "Форма100" Тогда 
		ОбщаяСКД = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("МакетСКДФорма1002017Кв4");
		Если ИмяРаздела = Неопределено Тогда
			СхемаКомпоновкиДанных = ОбщаяСКД;
		Иначе
			СхемаКомпоновкиДанных = ОбщаяСКД.ВложенныеСхемыКомпоновкиДанных.Найти(ИмяРаздела).Схема;
		КонецЕсли;

	//ИначеЕсли КодФормы = "Форма100_01" Тогда
	//	
	//	СхемаКомпоновкиДанных = РеквизитФормыВЗначение("ОтчетОбъект").ПолучитьМакет("РасшифровкаФормыНаСКД");
	//	
	//    ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных[0];
	//    НаборДанных = БухгалтерскиеОтчетыВызовСервера.ДобавитьНаборДанныхЗапрос(СхемаКомпоновкиДанных.НаборыДанных, ИсточникДанных, "НаборДанныхИсточникДанных");
	//	    
	//	НаборДанных.Запрос = ТекстЗапроса;
	//	ДобавитьПоляНабораДанных(НаборДанных, СхемаКомпоновкиДанных);
	//	
	//	ПараметрыСКД = СхемаКомпоновкиДанных.Параметры.Добавить();
	//	ПараметрыСКД.ДоступенСписокЗначений = Истина;
	//	ПараметрыСКД.Заголовок = "СписокСчетов";
	//	ПараметрыСКД.Имя = "СписокСчетов"; 
	//	ПараметрыСКД.Значение = СписокСчетов;
	//	ПараметрыСКД.ВключатьВДоступныеПоля = Ложь;
	//	ПараметрыСКД.ОграничениеИспользования = Истина;
	//	
	//	ПараметрыСКД = СхемаКомпоновкиДанных.Параметры.Добавить();
	//	ПараметрыСКД.ДоступенСписокЗначений = Истина;
	//	ПараметрыСКД.Заголовок = "СписокОрганизаций";
	//	ПараметрыСКД.Имя = "СписокОрганизаций"; 
	//	ПараметрыСКД.Значение = мСписокСтруктурныхЕдиниц;
	//	ПараметрыСКД.ВключатьВДоступныеПоля = Ложь;
	//	ПараметрыСКД.ОграничениеИспользования = Истина;
	//	
	//	ПараметрыСКД = СхемаКомпоновкиДанных.Параметры.Добавить();
	//	ПараметрыСКД.ДоступенСписокЗначений = Истина;
	//	ПараметрыСКД.Заголовок = "КодСтроки";
	//	ПараметрыСКД.Имя = "КодСтроки"; 
	//	ПараметрыСКД.Значение = СписокКодовСтрок;
	//	ПараметрыСКД.ВключатьВДоступныеПоля = Ложь;
	//	ПараметрыСКД.ОграничениеИспользования = Истина;

	//КонецЕсли;
	//	
	Возврат ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ДобавитьПараметр(ЭлементСтруктуры, Знач Поле, Значение, Использовать = Истина) Экспорт
	
	Если ТипЗнч(Поле) = Тип("Строка") Тогда
		Поле = Новый ПараметрКомпоновкиДанных(Поле);
	КонецЕсли;
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("Массив") Тогда
		СтруктураПараметра = Новый Структура("Параметр, Значение, Использование", Поле, Значение, Истина);
		ЭлементСтруктуры.Добавить(СтруктураПараметра);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция Форма100ПолучитьСписокКодовДоходов()
			
	СписокДохКодовСтрок = Новый СписокЗначений;
	
	Для Н = 1 По 4 Цикл
		Номер = Формат(Н,"ЧЦ=2; ЧВН=");
		СписокДохКодовСтрок.Добавить("100.00.0" + Номер);	
	КонецЦикла;
	
	СписокДохКодовСтрок.Добавить("100.00.003.I");
	СписокДохКодовСтрок.Добавить("100.00.006");
	СписокДохКодовСтрок.Добавить("100.00.007");
	СписокДохКодовСтрок.Добавить("100.00.022.I");
	СписокДохКодовСтрок.Добавить("100.00.023");
	СписокДохКодовСтрок.Добавить("100.00.026");
	СписокДохКодовСтрок.Добавить("100.00.026.I");
	СписокДохКодовСтрок.Добавить("100.00.027");	 		
	СписокДохКодовСтрок.Добавить("100.00.030.I"); 	
	СписокДохКодовСтрок.Добавить("100.00.030.II"); 	

	Возврат СписокДохКодовСтрок;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Форма100ПолучитьСписокКодовРасходов()
			
	СписокРасКодовСтрок = Новый СписокЗначений;
	
	Для Н = 10 По 20 Цикл
		Номер = Формат(Н,"ЧЦ=2; ЧВН=");
		СписокРасКодовСтрок.Добавить("100.00.0" + Номер);	
	КонецЦикла;
	
	СписокРасКодовСтрок.Добавить("100.00.009.VI");
	СписокРасКодовСтрок.Добавить("100.00.009.VII");
	СписокРасКодовСтрок.Добавить("100.00.009.VIII");
	СписокРасКодовСтрок.Добавить("100.00.019.I");	
	СписокРасКодовСтрок.Добавить("100.00.022.II");	
	СписокРасКодовСтрок.Добавить("100.00.024");	
	СписокРасКодовСтрок.Добавить("100.00.030.I"); 	
	СписокРасКодовСтрок.Добавить("100.00.030.II"); 	
	СписокРасКодовСтрок.Добавить("100.00.048.I");
	
	Возврат СписокРасКодовСтрок;

КонецФункции

Процедура СформироватьСтруктуруСоответствияКодовСтрок()
	
	СтруктураСоответствияКодовСтрок = Новый Структура;
	
	Для Н = 1 По 4 Цикл
		Номер = Формат(Н,"ЧЦ=2; ЧВН=");
		СтруктураСоответствияКодовСтрок.Вставить("П0000100" + Номер + "001", "100.00.0" + Номер);
	КонецЦикла;
	
	СтруктураСоответствияКодовСтрок.Вставить("П000010003101", "100.00.003.I");
	СтруктураСоответствияКодовСтрок.Вставить("П000010006001", "100.00.006");
	СтруктураСоответствияКодовСтрок.Вставить("П000010007001", "100.00.007");
	СтруктураСоответствияКодовСтрок.Вставить("П000030022101", "100.00.022.I");
	СтруктураСоответствияКодовСтрок.Вставить("П000030023001", "100.00.023");
	СтруктураСоответствияКодовСтрок.Вставить("П000030026001", "100.00.026");
	СтруктураСоответствияКодовСтрок.Вставить("П000030026101", "100.00.026.I");
	СтруктураСоответствияКодовСтрок.Вставить("П000030027001", "100.00.027");	 		
	СтруктураСоответствияКодовСтрок.Вставить("П000030030101", "100.00.030.I"); 	
	СтруктураСоответствияКодовСтрок.Вставить("П000030030201", "100.00.030.II");
	
	СтруктураСоответствияКодовСтрок.Вставить("П000020009311", "100.00.009.IIIA");
	СтруктураСоответствияКодовСтрок.Вставить("П000020009321", "100.00.009.IIIB");
	СтруктураСоответствияКодовСтрок.Вставить("П000020009331", "100.00.009.IIIC");
	СтруктураСоответствияКодовСтрок.Вставить("П000020009341", "100.00.009.IIID");
	СтруктураСоответствияКодовСтрок.Вставить("П000020009351", "100.00.009.IIIE");
	СтруктураСоответствияКодовСтрок.Вставить("П000020009361", "100.00.009.IIIF");
	СтруктураСоответствияКодовСтрок.Вставить("П000020009371", "100.00.009.IIIG");
	СтруктураСоответствияКодовСтрок.Вставить("П000020009381", "100.00.009.IIIH");
	
	СтруктураСоответствияКодовСтрок.Вставить("П000020009401", "100.00.009.IV");
	СтруктураСоответствияКодовСтрок.Вставить("П000020009501", "100.00.009.V");
	СтруктураСоответствияКодовСтрок.Вставить("П000020009601", "100.00.009.VI");
	СтруктураСоответствияКодовСтрок.Вставить("П000020009701", "100.00.009.VII");
	СтруктураСоответствияКодовСтрок.Вставить("П000020009801", "100.00.009.VIII");
	СтруктураСоответствияКодовСтрок.Вставить("П000020009901", "100.00.009.IX");
	
	СтруктураСоответствияКодовСтрок.Вставить("П000020010001", "100.00.010");
	СтруктураСоответствияКодовСтрок.Вставить("П000020011001", "100.00.011");
	СтруктураСоответствияКодовСтрок.Вставить("П000020012001", "100.00.012");
	СтруктураСоответствияКодовСтрок.Вставить("П000020013001", "100.00.013");
	СтруктураСоответствияКодовСтрок.Вставить("П000020014001", "100.00.014");
	СтруктураСоответствияКодовСтрок.Вставить("П000020015001", "100.00.015");
	СтруктураСоответствияКодовСтрок.Вставить("П000020016001", "100.00.016");
	СтруктураСоответствияКодовСтрок.Вставить("П000020017001", "100.00.017");
	СтруктураСоответствияКодовСтрок.Вставить("П000020018001", "100.00.018");
	СтруктураСоответствияКодовСтрок.Вставить("П000020019001", "100.00.019");
	
	СтруктураСоответствияКодовСтрок.Вставить("П000020019001", "100.00.019");
	СтруктураСоответствияКодовСтрок.Вставить("П000020019101", "100.00.019.I");	
	
	СтруктураСоответствияКодовСтрок.Вставить("П000020020001", "100.00.020");
	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Преобразовывает римский номер строки в арабский
// Органичение - только для цифр меньше 12
Функция ПреобразоватьРимскиеЦифрыВКодеСтроки(ОбластьОтчета)
	
	КодСтроки = Врег(ОбластьОтчета);
	
	КодСтроки = СтрЗаменить(КодСтроки, "XII",  "12");
	КодСтроки = СтрЗаменить(КодСтроки, "XI",   "11");
	КодСтроки = СтрЗаменить(КодСтроки, "IX",   "9");
	КодСтроки = СтрЗаменить(КодСтроки, "X",    "10");
		
	КодСтроки = СтрЗаменить(КодСтроки, "VIII", "8");
	КодСтроки = СтрЗаменить(КодСтроки, "VII",  "7");
	КодСтроки = СтрЗаменить(КодСтроки, "VI",   "6");	
	КодСтроки = СтрЗаменить(КодСтроки, "IV",   "4");
	КодСтроки = СтрЗаменить(КодСтроки, "V",    "5");
	
	КодСтроки = СтрЗаменить(КодСтроки, "III",  "3");
	КодСтроки = СтрЗаменить(КодСтроки, "II",   "2");
	КодСтроки = СтрЗаменить(КодСтроки, "I",    "1");
	
	Возврат КодСтроки;

КонецФункции // ПреобразоватьРимскиеЦифрыВКодеСтроки

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Функция ИмяОтчета(ЭтаФормаИмя)
	Форма_Имя = СтрЗаменить(ЭтаФормаИмя, "Внешний", "");
	Возврат Сред(Лев(Форма_Имя, СтрНайти(Форма_Имя, ".Форма.") - 1), 7);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяФормыОтчета(ЭтаФормаИмя)
	Возврат Сред(ЭтаФормаИмя, СтрНайти(ЭтаФормаИмя, ".Форма.") + 7);
КонецФункции

&НаКлиенте
Процедура ПечатьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Печать(ДополнительныеПараметры.ВидПечати);
	
КонецПроцедуры
