
&НаСервере
&После("ПриСозданииНаСервере")
Процедура игр_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	игр_УстановитьТекстЗапросаСписка(); 
	игр_ДобавитьИзменитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура игр_ДобавитьИзменитьЭлементыФормы()
	
	НовыйЭлемент	= Элементы.Вставить("Список_игр_КОтгрузке", Тип("ПолеФормы"), Элементы.Список, Элементы.СписокДатаСобытия);
	НовыйЭлемент.Вид	= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным	= "Список.КОтгрузке";
	НовыйЭлемент.Заголовок		= "К отгрузке";
	
КонецПроцедуры

&НаСервере
Процедура игр_УстановитьТекстЗапросаСписка()
	
	Список.ТекстЗапроса	= игр_ПолучитьТекстЗапросаСписка();
	
КонецПроцедуры

&НаСервере
Функция игр_ПолучитьТекстЗапросаСписка()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	100 КАК игр_ПроцентОтгрузкиСоСклада,
	|	ДокументЗаказКлиента.Ссылка КАК Ссылка,
	|	ДокументЗаказКлиента.ПометкаУдаления КАК ПометкаУдаления,
	|	ДокументЗаказКлиента.Номер КАК Номер,
	|	ДокументЗаказКлиента.Дата КАК Дата,
	|	ДокументЗаказКлиента.НомерПоДаннымКлиента КАК НомерПоДаннымКлиента,
	|	ДокументЗаказКлиента.ДатаПоДаннымКлиента КАК ДатаПоДаннымКлиента,
	|	ДокументЗаказКлиента.Проведен КАК Проведен,
	|	ДокументЗаказКлиента.Приоритет КАК Приоритет,
	|	ДокументЗаказКлиента.Партнер КАК Партнер,
	|	ДокументЗаказКлиента.Контрагент КАК Контрагент,
	|	ДокументЗаказКлиента.Организация КАК Организация,
	|	ДокументЗаказКлиента.Соглашение КАК Соглашение,
	|	ДокументЗаказКлиента.Договор КАК Договор,
	|	ДокументЗаказКлиента.Сделка КАК Сделка,
	|	ДокументЗаказКлиента.Валюта КАК Валюта,
	|	ДокументЗаказКлиента.СуммаДокумента КАК СуммаДокумента,
	|	ДокументЗаказКлиента.СуммаВозвратнойТары КАК СуммаВозвратнойТары,
	|	ДокументЗаказКлиента.ГрафикОплаты КАК ГрафикОплаты,
	|	ДокументЗаказКлиента.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
	|	ДокументЗаказКлиента.Склад КАК Склад,
	|	ДокументЗаказКлиента.Статус КАК Статус,
	|	ДокументЗаказКлиента.Менеджер КАК Менеджер,
	|	ДокументЗаказКлиента.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	ДокументЗаказКлиента.СуммаАвансаДоОбеспечения КАК СуммаАвансаДоОбеспечения,
	|	ДокументЗаказКлиента.СуммаПредоплатыДоОтгрузки КАК СуммаПредоплатыДоОтгрузки,
	|	ДокументЗаказКлиента.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ДокументЗаказКлиента.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДокументЗаказКлиента.ПорядокРасчетов КАК ПорядокРасчетов,
	|	ДокументЗаказКлиента.Комментарий КАК Комментарий,
	|	ВЫБОР
	|		КОГДА НЕ ДокументЗаказКлиента.Проведен
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ПустаяСсылка)
	|		ИНАЧЕ ЕСТЬNULL(СостоянияЗаказовКлиентов.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.Закрыт))
	|	КОНЕЦ КАК Состояние,
	|	ВЫБОР
	|		КОГДА НЕ ДокументЗаказКлиента.Проведен
	|			ТОГДА ЛОЖЬ
	|		КОГДА СостоянияЗаказовКлиентов.ДатаСобытия <> ДАТАВРЕМЯ(1, 1, 1)
	|				И &ДатаАктуальности > СостоянияЗаказовКлиентов.ДатаСобытия
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Просрочен,
	|	ВЫБОР
	|		КОГДА ДокументЗаказКлиента.Приоритет В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					Приоритеты.Ссылка КАК Приоритет
	|				ИЗ
	|					Справочник.Приоритеты КАК Приоритеты
	|				УПОРЯДОЧИТЬ ПО
	|					Приоритеты.РеквизитДопУпорядочивания)
	|			ТОГДА 0
	|		КОГДА ДокументЗаказКлиента.Приоритет В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					Приоритеты.Ссылка КАК Приоритет
	|				ИЗ
	|					Справочник.Приоритеты КАК Приоритеты
	|				УПОРЯДОЧИТЬ ПО
	|					Приоритеты.РеквизитДопУпорядочивания УБЫВ)
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КартинкаПриоритета,
	|	ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаОплаты, 0) КАК СуммаОплаты,
	|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентОплаты, 0) КАК ПроцентОплаты,
	|	ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаОтгрузки, 0) КАК СуммаОтгрузки,
	|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентОтгрузки, 0) КАК ПроцентОтгрузки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаДолга, 0) < 0
	|			ТОГДА ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаДолга, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НашДолг,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаДолга, 0) > 0
	|			ТОГДА ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаДолга, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДолгКлиента,
	|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентДолга, 0) КАК ПроцентДолга,
	|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ДатаСобытия, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСобытия,
	|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ЕстьРасхожденияОрдерНакладная, ЛОЖЬ) КАК ЕстьРасхожденияОрдерНакладная,
	|	СостоянияЭД.СостояниеВерсииЭД КАК СостояниеВерсииЭД,
	|	ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток, 0) КАК КОтгрузке
	|ИЗ
	|	Документ.ЗаказКлиента КАК ДокументЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|		ПО (СостоянияЗаказовКлиентов.Заказ = ДокументЗаказКлиента.Ссылка)
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЭД КАК СостоянияЭД
	|		ПО (СостоянияЭД.СсылкаНаОбъект = ДокументЗаказКлиента.Ссылка)}
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки КАК ТоварыКОтгрузкеОстатки
	|		ПО ДокументЗаказКлиента.Ссылка = ТоварыКОтгрузкеОстатки.ДокументОтгрузки"	
	;
	
	Возврат ТекстЗапроса;
	
КонецФункции