#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Процедура СоздатьНалогообложениеНачисленийПоНастройкам() Экспорт
	
	ВидДохода 			= ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтРаботодателя"); 
	Облагается 			= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом");
	НеОблагается 		= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом");
	НеОблагаетсяЧатично = ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично");
	
	ДоходНеПодлежащийНалогообложениюМатериальнаяПомощь = НСтр("ru = 'Пп. 18 п. 1) ст. 156 (выплаты для оплаты медицинских услуг, при рождении ребенка, на погребение)'"); 
	ДоходНеПодлежащийНалогообложению = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию(ДоходНеПодлежащийНалогообложениюМатериальнаяПомощь);
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Начисления.Ссылка КАК Начисление,
	|	Начисления.Наименование,
	|	Начисления.ВидОтпуска,
	|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени
	|ИЗ                                                                               
	|	ПланВидовРасчета.Начисления КАК Начисления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОтпускПоБеременностиИРодамБезОплаты
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПособиеПоУходуЗаРебенкомДоТрехЛет
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Прогул                                   
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.НеявкаПоНевыясненнымПричинам
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОтпускБезОплаты
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Отгул
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПростойПоВинеРаботника 
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаПредыдущимиДокументами	Тогда
			
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление, ВидДохода, '19000101', НеОблагается, НеОблагается, НеОблагается, НеОблагается, НеОблагается, Неопределено, Неопределено);
			
			// Отчисления на ОСМС за счет работодателя вводятся с 1 июля 2017 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление, ВидДохода, '20170701', НеОблагается, НеОблагается, НеОблагается, НеОблагается, НеОблагается, Неопределено, НеОблагается);
			
			// Отчисления на ОСМС за счет работодателя вводятся с 1 января 2019 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление, ВидДохода, '20190101', НеОблагается, НеОблагается, НеОблагается, НеОблагается, НеОблагается, НеОблагается, НеОблагается);
			
		ИначеЕсли Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие Тогда 
			
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'19000101',Облагается,НеОблагается,НеОблагается,НеОблагается,НеОблагается, Неопределено, Неопределено);
			
			// Отчисления на ОСМС за счет работодателя вводятся с 1 июля 2017 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'20170701',Облагается,НеОблагается,НеОблагается,НеОблагается,НеОблагается, Неопределено, Облагается);
			
			// Отчисления на ОСМС за счет работодателя вводятся с 1 января 2018 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'20180101', Облагается, Облагается, Облагается, Облагается, Облагается, Облагается, Облагается);
			
			// Отчисления на ОСМС за счет работодателя вводятся с 1 января 2019 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'20190101', Облагается, Облагается, Облагается, Облагается, Облагается, Облагается, Облагается);
			
		ИначеЕсли Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаПоДоговорамПодряда Тогда 
			
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,
						ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента"),
						'19000101',
						Облагается,НеОблагается,НеОблагается,НеОблагается,НеОблагается, Неопределено, Неопределено);

			// Взносы на ОСМС за счет работников по доховорам ГПХ вводятся с 1 июля 2017 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,
						ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента"),
						'20170701',
						Облагается,НеОблагается,НеОблагается,НеОблагается,НеОблагается, Облагается, Неопределено);
						
			// Взносы на ОСМС за счет работников по доховорам ГПХ отменены с 1 января 2018 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,
						ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента"),
						'20180101',
						Облагается,НеОблагается,НеОблагается,НеОблагается,НеОблагается, Неопределено, Неопределено);
			
			// Взносы на ОСМС за счет работников по доховорам ГПХ отменены с 1 января 2019 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,
						ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента"),
						'20190101',
						Облагается,Облагается,Неопределено,Неопределено,Неопределено, Неопределено, Неопределено);
			
			// Взносы на ОСМС за счет работников по доховорам ГПХ отменены с 1 января 2020 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,
						ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента"),
						'20200101',
						Облагается,Облагается,,Неопределено,Неопределено, Облагается, Неопределено);
			
			
		ИначеЕсли Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.МатериальнаяПомощь Тогда
			
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'19000101',НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично, Неопределено, Неопределено,
														ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению, ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению);
														
			// Отчисления на ОСМС за счет работодателя вводятся с 1 июля 2017 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'20170701',НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично, Неопределено, НеОблагаетсяЧатично,
														ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению, ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению, Неопределено, ДоходНеПодлежащийНалогообложению);
														
			// Отчисления на ОСМС за счет работодателя вводятся с 1 января 2019 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'20190101',НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично, НеОблагаетсяЧатично, НеОблагаетсяЧатично,
														ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению, ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению, ДоходНеПодлежащийНалогообложению, ДоходНеПодлежащийНалогообложению);
														
		ИначеЕсли Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаОтпуска 
			И ЗначениеЗаполнено(Выборка.ВидОтпуска)
			И (Выборка.ВидОтпуска = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.ОтпускДляПрохожденияСкрининговыхИсследований")
				ИЛИ Выборка.ВидОтпуска = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.ОтпускНаПостановкуНаМедицинскийУчетПоБеременностиДоДвенадцатиНедель")) Тогда
														
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление, ВидДохода, '20200701', Облагается, Облагается, Облагается, Облагается, Облагается, Облагается, Облагается);
			
		Иначе
			
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'19000101',Облагается,Облагается,Облагается,Облагается,Облагается, Неопределено, Неопределено);
			
			// Отчисления на ОСМС за счет работодателя вводятся с 1 июля 2017 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'20170701',Облагается,Облагается,Облагается,Облагается,Облагается, Неопределено, Облагается);
			
			// Отчисления на ОСМС за счет работодателя вводятся с 1 января 2019 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'20190101',Облагается,Облагается,Облагается,Облагается,Облагается, Облагается, Облагается);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСведенияОНалогообложениеНачислений(Начисление,
													ВидДохода,
													Период,
													СпособОбложенияИПН,
													СпособОбложенияОПВ,
													СпособОбложенияСН,
													СпособОбложенияСО,
													СпособОбложенияОППВ,
													СпособОбложенияВОСМС,
													СпособОбложенияООСМС,
													ДоходНеПодлежащийНалогообложениюИПН = Неопределено,
													ДоходНеПодлежащийНалогообложениюОПВ = Неопределено,
													ДоходНеПодлежащийНалогообложениюСН = Неопределено,
													ДоходНеПодлежащийНалогообложениюСО = Неопределено,
													ДоходНеПодлежащийНалогообложениюОППВ = Неопределено,
													ДоходНеПодлежащийНалогообложениюВОСМС = Неопределено,
													ДоходНеПодлежащийНалогообложениюООСМС = Неопределено) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.НалогообложениеНачислений.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Начисление 							= Начисление; 
	МенеджерЗаписи.ВидДохода 							= ВидДохода;
	МенеджерЗаписи.Период 								= Период;
	МенеджерЗаписи.СпособОбложенияИПН 					= СпособОбложенияИПН;
	МенеджерЗаписи.СпособОбложенияОПВ					= СпособОбложенияОПВ;
	МенеджерЗаписи.СпособОбложенияСН 					= СпособОбложенияСН;
	МенеджерЗаписи.СпособОбложенияСО 					= СпособОбложенияСО;
	МенеджерЗаписи.СпособОбложенияОППВ 					= СпособОбложенияОППВ;
	МенеджерЗаписи.СпособОбложенияВОСМС 				= СпособОбложенияВОСМС;
	МенеджерЗаписи.СпособОбложенияООСМС 				= СпособОбложенияООСМС;
	МенеджерЗаписи.ДоходНеПодлежащийНалогообложениюИПН 	= ДоходНеПодлежащийНалогообложениюИПН;
	МенеджерЗаписи.ДоходНеПодлежащийНалогообложениюОПВ 	= ДоходНеПодлежащийНалогообложениюОПВ;
	МенеджерЗаписи.ДоходНеПодлежащийНалогообложениюСН 	= ДоходНеПодлежащийНалогообложениюСН;
	МенеджерЗаписи.ДоходНеПодлежащийНалогообложениюСО 	= ДоходНеПодлежащийНалогообложениюСО;
	МенеджерЗаписи.ДоходНеПодлежащийНалогообложениюОППВ = ДоходНеПодлежащийНалогообложениюОППВ;
	МенеджерЗаписи.ДоходНеПодлежащийНалогообложениюВОСМС = ДоходНеПодлежащийНалогообложениюВОСМС;
	МенеджерЗаписи.ДоходНеПодлежащийНалогообложениюООСМС = ДоходНеПодлежащийНалогообложениюООСМС;

	МенеджерЗаписи.Записать();

КонецПроцедуры	

Процедура ЗаполнитьНалогообложениеНачисленийПоКатегориям20170701() Экспорт
	
	ДатаЗаписи2017 	= Дата(2017, 7, 1);
	ДатаЗаписи2019 	= Дата(2019, 1, 1);
	Облагается 		= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом");
	НеОблагается 	= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаАктуальности", Дата(2017, 6, 1));
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Начисления.Ссылка,
		|	Начисления.Наименование,
		|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени,
		|	НалогообложениеНачисленийСрезПоследних.ВидДохода,
		|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияИПН,
		|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюИПН,
		|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияОПВ,
		|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюОПВ,
		|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияСН,
		|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюСН,
		|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияСО,
		|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюСО,
		|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияОППВ,
		|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюОППВ
		|ИЗ
		|	ПланВидовРасчета.Начисления КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(&ДатаАктуальности, ) КАК НалогообложениеНачисленийСрезПоследних
		|		ПО (НалогообложениеНачисленийСрезПоследних.Начисление = Начисления.Ссылка)
		|ГДЕ
		|	НалогообложениеНачисленийСрезПоследних.ВидДохода В (ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя), ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента))";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если 	Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОтпускПоБеременностиИРодамБезОплаты
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПособиеПоУходуЗаРебенкомДоТрехЛет
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Прогул                                   
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.НеявкаПоНевыясненнымПричинам
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОтпускБезОплаты
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Отгул
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПростойПоВинеРаботника 
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаПредыдущимиДокументами Тогда
		
			// Отчисления на ОСМС за счет работодателя вводятся с 1 июля 2017 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Ссылка, Выборка.ВидДохода, ДатаЗаписи2017, 
														Выборка.СпособОбложенияИПН, 
														Выборка.СпособОбложенияОПВ, 
														Выборка.СпособОбложенияСН, 
														Выборка.СпособОбложенияСО, 
														Выборка.СпособОбложенияОППВ, 
														Неопределено, 
														НеОблагается,
														Выборка.ДоходНеПодлежащийНалогообложениюИПН,
														Выборка.ДоходНеПодлежащийНалогообложениюОПВ,
														Выборка.ДоходНеПодлежащийНалогообложениюСН,
														Выборка.ДоходНеПодлежащийНалогообложениюСО,
														Выборка.ДоходНеПодлежащийНалогообложениюОППВ);
														
			// Взносы на ОСМС за счет работников вводятся с 1 января 2019 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Ссылка, Выборка.ВидДохода, ДатаЗаписи2019, 
														Выборка.СпособОбложенияИПН, 
														Выборка.СпособОбложенияОПВ, 
														Выборка.СпособОбложенияСН, 
														Выборка.СпособОбложенияСО, 
														Выборка.СпособОбложенияОППВ, 
														НеОблагается, 
														НеОблагается,
														Выборка.ДоходНеПодлежащийНалогообложениюИПН,
														Выборка.ДоходНеПодлежащийНалогообложениюОПВ,
														Выборка.ДоходНеПодлежащийНалогообложениюСН,
														Выборка.ДоходНеПодлежащийНалогообложениюСО,
														Выборка.ДоходНеПодлежащийНалогообложениюОППВ);
			
		ИначеЕсли Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска Тогда
														
			// Отчисления на ОСМС за счет работодателя вводятся с 1 июля 2017 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Ссылка, Выборка.ВидДохода, ДатаЗаписи2017,
														Выборка.СпособОбложенияИПН, 
														Выборка.СпособОбложенияОПВ, 
														Выборка.СпособОбложенияСН, 
														Выборка.СпособОбложенияСО, 
														Выборка.СпособОбложенияОППВ, 
														Неопределено, 
														Облагается,
														Выборка.ДоходНеПодлежащийНалогообложениюИПН,
														Выборка.ДоходНеПодлежащийНалогообложениюОПВ,
														Выборка.ДоходНеПодлежащийНалогообложениюСН,
														Выборка.ДоходНеПодлежащийНалогообложениюСО,
														Выборка.ДоходНеПодлежащийНалогообложениюОППВ);
														
			// Взносы на ОСМС за счет работников вводятся с 1 января 2019 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Ссылка, Выборка.ВидДохода, ДатаЗаписи2019,
														Выборка.СпособОбложенияИПН, 
														Выборка.СпособОбложенияОПВ, 
														Выборка.СпособОбложенияСН, 
														Выборка.СпособОбложенияСО, 
														Выборка.СпособОбложенияОППВ, 
														Облагается, 
														Облагается,
														Выборка.ДоходНеПодлежащийНалогообложениюИПН,
														Выборка.ДоходНеПодлежащийНалогообложениюОПВ,
														Выборка.ДоходНеПодлежащийНалогообложениюСН,
														Выборка.ДоходНеПодлежащийНалогообложениюСО,
														Выборка.ДоходНеПодлежащийНалогообложениюОППВ);
														
														
		ИначеЕсли Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие Тогда
			
			// Отчисления на ОСМС за счет работодателя вводятся с 1 июля 2017 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Ссылка, Выборка.ВидДохода, ДатаЗаписи2017,
														Выборка.СпособОбложенияИПН, 
														Выборка.СпособОбложенияОПВ, 
														Выборка.СпособОбложенияСН, 
														Выборка.СпособОбложенияСО, 
														Выборка.СпособОбложенияОППВ, 
														Неопределено, 
														НеОблагается,
														Выборка.ДоходНеПодлежащийНалогообложениюИПН,
														Выборка.ДоходНеПодлежащийНалогообложениюОПВ,
														Выборка.ДоходНеПодлежащийНалогообложениюСН,
														Выборка.ДоходНеПодлежащийНалогообложениюСО,
														Выборка.ДоходНеПодлежащийНалогообложениюОППВ);
														
			// Взносы на ОСМС за счет работников вводятся с 1 января 2019 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Ссылка, Выборка.ВидДохода, ДатаЗаписи2019,
														Выборка.СпособОбложенияИПН, 
														Выборка.СпособОбложенияОПВ, 
														Выборка.СпособОбложенияСН, 
														Выборка.СпособОбложенияСО, 
														Выборка.СпособОбложенияОППВ, 
														НеОблагается, 
														НеОблагается,
														Выборка.ДоходНеПодлежащийНалогообложениюИПН,
														Выборка.ДоходНеПодлежащийНалогообложениюОПВ,
														Выборка.ДоходНеПодлежащийНалогообложениюСН,
														Выборка.ДоходНеПодлежащийНалогообложениюСО,
														Выборка.ДоходНеПодлежащийНалогообложениюОППВ);
			
		ИначеЕсли Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.МатериальнаяПомощь Тогда
			// Отчисления на ОСМС за счет работодателя вводятся с 1 июля 2017 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Ссылка, Выборка.ВидДохода, ДатаЗаписи2017,
														Выборка.СпособОбложенияИПН,
														Выборка.СпособОбложенияОПВ, 
														Выборка.СпособОбложенияСН, 
														Выборка.СпособОбложенияСО, 
														Выборка.СпособОбложенияОППВ, 
														Неопределено, 
														Выборка.СпособОбложенияСО,
														Выборка.ДоходНеПодлежащийНалогообложениюИПН,
														Выборка.ДоходНеПодлежащийНалогообложениюОПВ,
														Выборка.ДоходНеПодлежащийНалогообложениюСН,
														Выборка.ДоходНеПодлежащийНалогообложениюСО,
														Выборка.ДоходНеПодлежащийНалогообложениюОППВ,
														Неопределено,
														Выборка.ДоходНеПодлежащийНалогообложениюСО);
			
			// Взносы на ОСМС за счет работников вводятся с 1 января 2019 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Ссылка, Выборка.ВидДохода, ДатаЗаписи2019,
														Выборка.СпособОбложенияИПН,
														Выборка.СпособОбложенияОПВ, 
														Выборка.СпособОбложенияСН, 
														Выборка.СпособОбложенияСО, 
														Выборка.СпособОбложенияОППВ, 
														Выборка.СпособОбложенияСО, 
														Выборка.СпособОбложенияСО,
														Выборка.ДоходНеПодлежащийНалогообложениюИПН,
														Выборка.ДоходНеПодлежащийНалогообложениюОПВ,
														Выборка.ДоходНеПодлежащийНалогообложениюСН,
														Выборка.ДоходНеПодлежащийНалогообложениюСО,
														Выборка.ДоходНеПодлежащийНалогообложениюОППВ,
														Выборка.ДоходНеПодлежащийНалогообложениюСО,
														Выборка.ДоходНеПодлежащийНалогообложениюСО);
		ИначеЕсли Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаПоДоговорамПодряда Тогда
			
			// Взносы на ОСМС за счет работников по доховорам ГПХ вводятся с 1 июля 2017 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Ссылка, Выборка.ВидДохода, ДатаЗаписи2017,
														Выборка.СпособОбложенияИПН,
														Выборка.СпособОбложенияОПВ, 
														Выборка.СпособОбложенияСН, 
														Выборка.СпособОбложенияСО, 
														Выборка.СпособОбложенияОППВ, 
														Облагается,
														Неопределено, 
														Выборка.ДоходНеПодлежащийНалогообложениюИПН,
														Выборка.ДоходНеПодлежащийНалогообложениюОПВ,
														Выборка.ДоходНеПодлежащийНалогообложениюСН,
														Выборка.ДоходНеПодлежащийНалогообложениюСО,
														Выборка.ДоходНеПодлежащийНалогообложениюОППВ);
														
		ИначеЕсли Выборка.ВидДохода = Справочники.ВидыДоходов.ДоходыОтРаботодателя Тогда
			
			// Отчисления на ОСМС за счет работодателя вводятся с 1 июля 2017 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Ссылка, Выборка.ВидДохода, ДатаЗаписи2017,
														Выборка.СпособОбложенияИПН,
														Выборка.СпособОбложенияОПВ, 
														Выборка.СпособОбложенияСН, 
														Выборка.СпособОбложенияСО, 
														Выборка.СпособОбложенияОППВ, 
														Неопределено, 
														Облагается,
														Выборка.ДоходНеПодлежащийНалогообложениюИПН,
														Выборка.ДоходНеПодлежащийНалогообложениюОПВ,
														Выборка.ДоходНеПодлежащийНалогообложениюСН,
														Выборка.ДоходНеПодлежащийНалогообложениюСО,
														Выборка.ДоходНеПодлежащийНалогообложениюОППВ);
														
			// Взносы на ОСМС за счет работников вводятся с 1 января 2019 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Ссылка, Выборка.ВидДохода, ДатаЗаписи2019,
														Выборка.СпособОбложенияИПН,
														Выборка.СпособОбложенияОПВ, 
														Выборка.СпособОбложенияСН, 
														Выборка.СпособОбложенияСО, 
														Выборка.СпособОбложенияОППВ, 
														Облагается, 
														Облагается,
														Выборка.ДоходНеПодлежащийНалогообложениюИПН,
														Выборка.ДоходНеПодлежащийНалогообложениюОПВ,
														Выборка.ДоходНеПодлежащийНалогообложениюСН,
														Выборка.ДоходНеПодлежащийНалогообложениюСО,
														Выборка.ДоходНеПодлежащийНалогообложениюОППВ);
						
		ИначеЕсли Выборка.ВидДохода = Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента Тогда
			
			// Взносы на ОСМС за счет работников по доховорам ГПХ вводятся с 1 июля 2017 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Ссылка, Выборка.ВидДохода, ДатаЗаписи2017,
														Выборка.СпособОбложенияИПН,
														Выборка.СпособОбложенияОПВ, 
														Выборка.СпособОбложенияСН, 
														Выборка.СпособОбложенияСО, 
														Выборка.СпособОбложенияОППВ, 
														Облагается, 
														Неопределено,
														Выборка.ДоходНеПодлежащийНалогообложениюИПН,
														Выборка.ДоходНеПодлежащийНалогообложениюОПВ,
														Выборка.ДоходНеПодлежащийНалогообложениюСН,
														Выборка.ДоходНеПодлежащийНалогообложениюСО,
														Выборка.ДоходНеПодлежащийНалогообложениюОППВ);
		КонецЕсли;
													
	КонецЦикла;

	
КонецПроцедуры

Процедура ЗаполнитьНалогообложениеНачисленийПоКатегориям20180101() Экспорт
	
	ДатаЗаписи2018 	= Дата(2018, 1, 1);
	Облагается 		= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом");
	НеОблагается 	= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаАктуальности", Дата(2017, 12, 1));
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Начисления.Ссылка,
		|	Начисления.Наименование,
		|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени,
		|	НалогообложениеНачислений.ВидДохода,
		|	НалогообложениеНачислений.СпособОбложенияИПН,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюИПН,
		|	НалогообложениеНачислений.СпособОбложенияОПВ,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюОПВ,
		|	НалогообложениеНачислений.СпособОбложенияСН,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюСН,
		|	НалогообложениеНачислений.СпособОбложенияСО,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюСО,
		|	НалогообложениеНачислений.СпособОбложенияОППВ,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюОППВ,
		|	НалогообложениеНачислений.СпособОбложенияВОСМС,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюВОСМС,
		|	НалогообложениеНачислений.СпособОбложенияООСМС,
		|	НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюООСМС
		|ИЗ
		|	ПланВидовРасчета.Начисления КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(&ДатаАктуальности, ) КАК НалогообложениеНачислений
		|		ПО (НалогообложениеНачислений.Начисление = Начисления.Ссылка)
		|ГДЕ
		|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска), ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие))";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		// Компенсация отпуска и выходное пособие 1 января 2018 г облагается СН
		ДобавитьСведенияОНалогообложениеНачислений(Выборка.Ссылка, Выборка.ВидДохода, ДатаЗаписи2018,
													Выборка.СпособОбложенияИПН, 
													Выборка.СпособОбложенияОПВ, 
													Облагается, 
													Выборка.СпособОбложенияСО, 
													Выборка.СпособОбложенияОППВ, 
													Выборка.СпособОбложенияВОСМС, 
													Выборка.СпособОбложенияООСМС,
													Выборка.ДоходНеПодлежащийНалогообложениюИПН,
													Выборка.ДоходНеПодлежащийНалогообложениюОПВ,
													Неопределено,
													Выборка.ДоходНеПодлежащийНалогообложениюСО,
													Выборка.ДоходНеПодлежащийНалогообложениюОППВ,
													Выборка.ДоходНеПодлежащийНалогообложениюВОСМС,
													Выборка.ДоходНеПодлежащийНалогообложениюООСМС);
	КонецЦикла;

	// Взносы ОСМС отложены с 1 января 2018 года до 2020 года
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Начисления.Ссылка,
		|	Начисления.Наименование,
		|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени,
		|	НалогообложениеНачисленийСрезПоследних.ВидДохода,
		|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияИПН,
		|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюИПН,
		|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияОПВ,
		|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюОПВ,
		|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияСН,
		|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюСН,
		|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияСО,
		|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюСО,
		|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияОППВ,
		|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюОППВ
		|ИЗ
		|	ПланВидовРасчета.Начисления КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(&ДатаАктуальности, ) КАК НалогообложениеНачисленийСрезПоследних
		|		ПО (НалогообложениеНачисленийСрезПоследних.Начисление = Начисления.Ссылка)
		|ГДЕ
		|	НалогообложениеНачисленийСрезПоследних.ВидДохода В (ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента))";	
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		// Взносы на ОСМС за счет работников по доховорам ГПХ отложены с 1 января 2018 г
		ДобавитьСведенияОНалогообложениеНачислений(Выборка.Ссылка, Выборка.ВидДохода, ДатаЗаписи2018,
													Выборка.СпособОбложенияИПН,
													Выборка.СпособОбложенияОПВ, 
													Выборка.СпособОбложенияСН, 
													Выборка.СпособОбложенияСО, 
													Выборка.СпособОбложенияОППВ, 
													Неопределено, 
													Неопределено,
													Выборка.ДоходНеПодлежащийНалогообложениюИПН,
													Выборка.ДоходНеПодлежащийНалогообложениюОПВ,
													Выборка.ДоходНеПодлежащийНалогообложениюСН,
													Выборка.ДоходНеПодлежащийНалогообложениюСО,
													Выборка.ДоходНеПодлежащийНалогообложениюОППВ);

	КонецЦикла;
	

	// Взносы ОСМС по доходам от работодателя отложены с 1 января 2019 года до 2020 года
	// удаляем записи, действующие на 2019 г.	
	Выборка = РегистрыСведений.НалогообложениеНачислений.Выбрать(Дата(2018,2,1));
	Пока Выборка.Следующий() Цикл 
        Выборка.ПолучитьМенеджерЗаписи().Удалить();		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьНалогообложениеНачисленийПоКатегориям20190101() Экспорт
	
	ВидДохода 			= ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтРаботодателя"); 
	Облагается 			= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом");
	НеОблагается 		= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом");
	НеОблагаетсяЧатично = ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично");
	
	ДоходНеПодлежащийНалогообложениюМатериальнаяПомощь = НСтр("ru = 'Пп. 18 п. 1) ст. 156 (выплаты для оплаты медицинских услуг, при рождении ребенка, на погребение)'"); 
	ДоходНеПодлежащийНалогообложению = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию(ДоходНеПодлежащийНалогообложениюМатериальнаяПомощь);
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Начисления.Ссылка КАК Начисление,
	|	Начисления.Наименование,
	|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени
	|ИЗ                                                                               
	|	ПланВидовРасчета.Начисления КАК Начисления
	|ГДЕ
	|	НЕ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаПоДоговорамПодряда)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОтпускПоБеременностиИРодамБезОплаты
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПособиеПоУходуЗаРебенкомДоТрехЛет
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Прогул                                   
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.НеявкаПоНевыясненнымПричинам
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОтпускБезОплаты
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Отгул
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПростойПоВинеРаботника 
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаПредыдущимиДокументами	Тогда
			
			// Отчисления на ОСМС за счет работодателя вводятся с 1 января 2019 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление, ВидДохода, '20190101', НеОблагается, НеОблагается, НеОблагается, НеОблагается, НеОблагается, НеОблагается, НеОблагается);
			
		ИначеЕсли Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска
			ИЛИ Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие Тогда 
			
			// Отчисления на ОСМС за счет работодателя вводятся с 1 января 2019 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'20190101', Облагается, Облагается, Облагается, Облагается, Облагается, Облагается, Облагается);
			
		ИначеЕсли Выборка.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.МатериальнаяПомощь Тогда
			
			// Отчисления на ОСМС за счет работодателя вводятся с 1 января 2019 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'20190101',НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично,НеОблагаетсяЧатично, НеОблагаетсяЧатично, НеОблагаетсяЧатично,
														ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению, ДоходНеПодлежащийНалогообложению,ДоходНеПодлежащийНалогообложению, ДоходНеПодлежащийНалогообложению, ДоходНеПодлежащийНалогообложению);
														
		Иначе
			
			// Отчисления на ОСМС за счет работодателя вводятся с 1 января 2019 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,ВидДохода,'20190101',Облагается,Облагается,Облагается,Облагается,Облагается, Облагается, Облагается);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьНалогообложениеНачисленийГПХ20190101() Экспорт
	
	ВидДохода  = ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента"); 
	Облагается = ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом");
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(НалогообложениеНачислений.Период) КАК Период,
	|	НалогообложениеНачислений.Начисление КАК Начисление
	|ПОМЕСТИТЬ ВТ_НачисленияГПХ
	|ИЗ
	|	РегистрСведений.НалогообложениеНачислений КАК НалогообложениеНачислений
	|ГДЕ
	|	НалогообложениеНачислений.Начисление.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаПоДоговорамПодряда)
	|	И НалогообложениеНачислений.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
	|СГРУППИРОВАТЬ ПО
	|	НалогообложениеНачислений.Начисление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Начисления.Ссылка КАК Начисление
	|ИЗ
	|	ВТ_НачисленияГПХ КАК ВТ_НачисленияГПХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
	|		ПО ВТ_НачисленияГПХ.Начисление = Начисления.Ссылка
	|ГДЕ
	|	ВТ_НачисленияГПХ.Период < ДАТАВРЕМЯ(2019, 1, 1)
	|	ИЛИ (ВТ_НачисленияГПХ.Период ЕСТЬ NULL
	|	И Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаПоДоговорамПодряда))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление, ВидДохода, '20190101', Облагается, Облагается, Неопределено, Неопределено, Неопределено, Неопределено, Неопределено);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьНалогообложениеКомпенсацияВыходноеПособие20190101() Экспорт
	
	Облагается 		= ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаАктуальности", Дата(2017, 12, 1));
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Начисления.Ссылка,
		|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени,
		|	НалогообложениеНачислений.ВидДохода
		|ИЗ
		|	ПланВидовРасчета.Начисления КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(&ДатаАктуальности, ) КАК НалогообложениеНачислений
		|		ПО (НалогообложениеНачислений.Начисление = Начисления.Ссылка)
		|ГДЕ
		|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска), ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ВыходноеПособие))";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Компенсация отпуска и выходное пособие 1 января 2018 г облагается всеми налогами
		ДобавитьСведенияОНалогообложениеНачислений(Выборка.Ссылка, Выборка.ВидДохода, Дата(2019, 1, 1),
													Облагается, 
													Облагается, 
													Облагается, 
													Облагается, 
													Облагается, 
													Облагается, 
													Облагается);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьНалогообложениеНачисленийПоКатегориям20200101() Экспорт
	
	Облагается = ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом");
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Начисления.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ВидыНачислений
		|ИЗ
		|	ПланВидовРасчета.Начисления КАК Начисления
		|ГДЕ
		|	НЕ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОтпускПоБеременностиИРодамБезОплаты), ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ПособиеПоУходуЗаРебенкомДоТрехЛет), ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.Прогул), ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.НеявкаПоНевыясненнымПричинам), ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОтпускБезОплаты), ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.Отгул), ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ПростойПоВинеРаботника), ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаПредыдущимиДокументами), ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.МатериальнаяПомощь))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеНачисленийСрезПоследних.Начисление КАК Начисление,
		|	НалогообложениеНачисленийСрезПоследних.ВидДохода КАК ВидДохода,
		|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияИПН,
		|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюИПН,
		|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияОПВ,
		|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюОПВ,
		|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияСН,
		|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюСН,
		|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияСО,
		|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюСО,
		|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияОППВ,
		|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюОППВ,
		|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияВОСМС,
		|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюВОСМС,
		|	НалогообложениеНачисленийСрезПоследних.СпособОбложенияООСМС,
		|	НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюООСМС
		|ИЗ
		|	РегистрСведений.НалогообложениеНачислений.СрезПоследних КАК НалогообложениеНачисленийСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВидыНачислений КАК ВТ_ВидыНачислений
		|		ПО НалогообложениеНачисленийСрезПоследних.Начисление = ВТ_ВидыНачислений.Ссылка
		|		ИЛИ ТИПЗНАЧЕНИЯ(НалогообложениеНачисленийСрезПоследних.Начисление) = ТИП(Справочник.ВидыПрочихДоходовФизическихЛиц)
		|		ИЛИ ТИПЗНАЧЕНИЯ(НалогообложениеНачисленийСрезПоследних.Начисление) = ТИП(Справочник.ВидыВыплатБывшимСотрудникам)
		|ГДЕ
		|	НалогообложениеНачисленийСрезПоследних.ВидДохода В (ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя), ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ВидДохода = Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента Тогда
			
			// Взносы на ОСМС за счет работников по доховорам ГПХ отменены с 1 января 2020 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,
						ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента"),
						'20200101',
						Выборка.СпособОбложенияИПН, Выборка.СпособОбложенияОПВ, Выборка.СпособОбложенияСН, Выборка.СпособОбложенияСО, Выборка.СпособОбложенияОППВ, Облагается, Выборка.СпособОбложенияООСМС,
						Выборка.ДоходНеПодлежащийНалогообложениюИПН, Выборка.ДоходНеПодлежащийНалогообложениюОПВ, Выборка.ДоходНеПодлежащийНалогообложениюСН, Выборка.ДоходНеПодлежащийНалогообложениюСО, Выборка.ДоходНеПодлежащийНалогообложениюОППВ, Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка(), Выборка.ДоходНеПодлежащийНалогообложениюООСМС);
						
		Иначе
			
			// Взносы на ОСМС за счет работников по доховорам ГПХ отменены с 1 января 2020 г
			ДобавитьСведенияОНалогообложениеНачислений(Выборка.Начисление,
						ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтРаботодателя"),
						'20200101',
						Выборка.СпособОбложенияИПН, Выборка.СпособОбложенияОПВ, Выборка.СпособОбложенияСН, Выборка.СпособОбложенияСО, Выборка.СпособОбложенияОППВ, Облагается, Выборка.СпособОбложенияООСМС,
						Выборка.ДоходНеПодлежащийНалогообложениюИПН, Выборка.ДоходНеПодлежащийНалогообложениюОПВ, Выборка.ДоходНеПодлежащийНалогообложениюСН, Выборка.ДоходНеПодлежащийНалогообложениюСО, Выборка.ДоходНеПодлежащийНалогообложениюОППВ, Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка(), Выборка.ДоходНеПодлежащийНалогообложениюООСМС);
						
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли