#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		
		Если СтрокаНабора.ВидДохода = Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства
			И НЕ ТипЗнч(СтрокаНабора.Начисление) = Тип("СправочникСсылка.ВидыПрочихДоходовФизическихЛиц") Тогда
			
			ВызватьИсключение НСтр("ru = 'Расчет по виду дохода ""Доход субъекта предпринимательства"" производится через элементы справочника ""Виды прочих доходов"".'");
			
		КонецЕсли;
		
		Если СтрокаНабора.Период < Дата('20210101') Тогда
			
			Если СтрокаНабора.ВидДохода = Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства Тогда
				
				ВызватьИсключение НСтр("ru = 'Расчет по виду дохода ""Доход субъекта предпринимательства"" доступен с 2021 года.'");
				
			КонецЕсли;
				
		КонецЕсли;

	КонецЦикла;
	
	// Обновляем кэш платформы для зачитывания актуальных настроек
	// используется в ОтражениеЗарплатыВУчетеПовтИсп.ТаблицаНачислениеУдержаниеВидОперации.
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецЕсли