////////////////////////////////////////////////////////////////////////////////
// Отражение зарплаты в учете
// Переопределяемое в пределах библиотеки поведение.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьВТУдержанияПоСотрудникамКонтрагент(МенеджерВременныхТаблиц, ИмяТаблицы = "ВТУдержанияПоСотрудникам") Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УдержанияПоСотрудникам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	УдержанияПоСотрудникам.Удержание,
	|	УдержанияПоСотрудникам.ДокументОснование КАК ДокументОснование,
	|	ПолучателиУдержаний.Контрагент
	|ПОМЕСТИТЬ ВТУдержанияПоСотрудникамКонтрагент
	|ИЗ
	|	#ИмяТаблицы КАК УдержанияПоСотрудникам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолучателиУдержаний КАК ПолучателиУдержаний
	|		ПО УдержанияПоСотрудникам.ДокументОснование = ПолучателиУдержаний.ДокументОснование
	|			И УдержанияПоСотрудникам.ФизическоеЛицо = ПолучателиУдержаний.ФизическоеЛицо
	|			И УдержанияПоСотрудникам.Удержание = ПолучателиУдержаний.Удержание
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование,
	|	ФизическоеЛицо";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ИмяТаблицы", ИмяТаблицы);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ДополнитьТаблицуНДФЛ(ПериодРегистрации, Организация, МенеджерВременныхТаблиц) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодРегистрации));
	
	ВидыОпераций = ОтражениеЗарплатыВУчете.ВидыОсобыхНачисленийИУдержанийНДФЛ(Истина);

	Запрос.УстановитьПараметр("ВидыОпераций", ВидыОпераций);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачисленияУдержания.Организация КАК Организация,
	|	НачисленияУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НачисленияУдержания.Сотрудник КАК Сотрудник,
	|	НачисленияУдержания.НачислениеУдержание КАК НачислениеУдержание,
	|	НачисленияУдержания.Подразделение КАК Подразделение,
	|	СУММА(НачисленияУдержания.Сумма) КАК Сумма,
	|	НачисленияУдержания.ТерриторияВыполненияРаботВОрганизации КАК ТерриторияВыполненияРаботВОрганизации,
	|	НачисленияУдержания.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	0 КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТВременнаяТаблица
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам КАК НачисленияУдержания
	|ГДЕ
	|	НачисленияУдержания.Организация = &Организация
	|	И НачисленияУдержания.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НачисленияУдержания.НачислениеУдержание В(&ВидыОпераций)
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленияУдержания.Организация,
	|	НачисленияУдержания.ФизическоеЛицо,
	|	НачисленияУдержания.Сотрудник,
	|	НачисленияУдержания.НачислениеУдержание,
	|	НачисленияУдержания.Подразделение,
	|	НачисленияУдержания.ТерриторияВыполненияРаботВОрганизации,
	|	НачисленияУдержания.РегистрацияВНалоговомОргане
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаНДФЛ.Организация,
	|	ТаблицаНДФЛ.ФизическоеЛицо,
	|	ТаблицаНДФЛ.Сотрудник,
	|	ТаблицаНДФЛ.НачислениеУдержание,
	|	ТаблицаНДФЛ.Подразделение,
	|	ТаблицаНДФЛ.Сумма,
	|	ТаблицаНДФЛ.ТерриторияВыполненияРаботВОрганизации,
	|	ТаблицаНДФЛ.РегистрацияВНалоговомОргане,
	|	ТаблицаНДФЛ.ИдентификаторСтроки
	|ИЗ
	|	ВТТаблицаНДФЛ КАК ТаблицаНДФЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТТаблицаНДФЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.Организация КАК Организация,
	|	ВременнаяТаблица.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВременнаяТаблица.Сотрудник КАК Сотрудник,
	|	ВременнаяТаблица.НачислениеУдержание КАК НачислениеУдержание,
	|	ВременнаяТаблица.Подразделение КАК Подразделение,
	|	ВременнаяТаблица.Сумма КАК Сумма,
	|	ВременнаяТаблица.ТерриторияВыполненияРаботВОрганизации КАК ТерриторияВыполненияРаботВОрганизации,
	|	ВременнаяТаблица.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ВременнаяТаблица.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТТаблицаНДФЛ
	|ИЗ
	|	ВТВременнаяТаблица КАК ВременнаяТаблица
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НачислениеУдержание";
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ДополнитьТаблицуНачислений(ПериодРегистрации, Организация, МенеджерВременныхТаблиц) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.Организация КАК Организация,
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Начисления.Подразделение КАК Подразделение,
	|	Начисления.ТерриторияВыполненияРаботВОрганизации КАК ТерриторияВыполненияРаботВОрганизации,
	|	&ПериодРегистрации КАК ДатаНачала,
	|	&ПериодРегистрации КАК ДатаОкончания,
	|	&ПериодРегистрации КАК ПериодДействия,
	|	Начисления.НачислениеУдержание КАК НачислениеУдержание,
	|	Начисления.Сумма КАК Сумма,
	|	Начисления.ДокументОснование КАК ДокументОснование,
	|	0 КАК ИдентификаторСтроки,
	|	ЛОЖЬ КАК Сторно,
	|	ЛОЖЬ КАК ФиксСторно
	|ПОМЕСТИТЬ ВТВременнаяТаблица
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам КАК Начисления
	|ГДЕ
	|	Начисления.Организация = &Организация
	|	И Начисления.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Начисления.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Начисления.Организация,
	|	Начисления.Сотрудник,
	|	Начисления.ФизическоеЛицо,
	|	Начисления.Подразделение,
	|	Начисления.ТерриторияВыполненияРаботВОрганизации,
	|	Начисления.ДатаНачала,
	|	Начисления.ДатаОкончания,
	|	Начисления.ПериодДействия,
	|	Начисления.НачислениеУдержание,
	|	Начисления.Сумма,
	|	Начисления.ДокументОснование,
	|	Начисления.ИдентификаторСтроки,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	ВТНачисления КАК Начисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.Организация КАК Организация,
	|	ВременнаяТаблица.Сотрудник КАК Сотрудник,
	|	ВременнаяТаблица.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВременнаяТаблица.Подразделение КАК Подразделение,
	|	ВременнаяТаблица.ТерриторияВыполненияРаботВОрганизации КАК ТерриторияВыполненияРаботВОрганизации,
	|	ВременнаяТаблица.ДатаНачала КАК ДатаНачала,
	|	ВременнаяТаблица.ДатаОкончания КАК ДатаОкончания,
	|	ВременнаяТаблица.ПериодДействия КАК ПериодДействия,
	|	ВременнаяТаблица.НачислениеУдержание КАК НачислениеУдержание,
	|	ВременнаяТаблица.Сумма КАК Сумма,
	|	ВременнаяТаблица.ДокументОснование КАК ДокументОснование,
	|	ВременнаяТаблица.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВременнаяТаблица.Сторно КАК Сторно,
	|	ВременнаяТаблица.ФиксСторно КАК ФиксСторно
	|ПОМЕСТИТЬ ВТНачисления
	|ИЗ
	|	ВТВременнаяТаблица КАК ВременнаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТВременнаяТаблица";
	
	Запрос.Выполнить();

КонецПроцедуры

Процедура ДополнитьТаблицуУдержаний(ПериодРегистрации, Организация, МенеджерВременныхТаблиц) Экспорт

	ВидыОсобыхНачисленийИУдержанийНДФЛ = ОтражениеЗарплатыВУчете.ВидыОсобыхНачисленийИУдержанийНДФЛ();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("ВидыОсобыхНачисленийИУдержанийНДФЛ", ВидыОсобыхНачисленийИУдержанийНДФЛ);
	
	ВидыОсобыхНачисленийИУдержаний = Новый Массив;
	ВидыОсобыхНачисленийИУдержаний.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ИПНДоходыКонтрагентов);
	ВидыОсобыхНачисленийИУдержаний.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ИПНРасчетыСБывшимиСотрудниками);
	ВидыОсобыхНачисленийИУдержаний.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ИПНДивиденды);
	ВидыОсобыхНачисленийИУдержаний.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ИПНДоходыСубъектаПредпринимательства);
	ВидыОсобыхНачисленийИУдержаний.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ОПВДоходыКонтрагентов);
	ВидыОсобыхНачисленийИУдержаний.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ОПВРасчетыСБывшимиСотрудниками);
	ВидыОсобыхНачисленийИУдержаний.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ОПВДоходыСубъектаПредпринимательства);
	ВидыОсобыхНачисленийИУдержаний.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ВОСМСДоходыКонтрагентов);
	ВидыОсобыхНачисленийИУдержаний.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ВОСМСРасчетыСБывшимиСотрудниками);
	ВидыОсобыхНачисленийИУдержаний.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ВОСМСДоходыСубъектаПредпринимательства);
	Запрос.УстановитьПараметр("ВидыОсобыхНачисленийИУдержаний", ВидыОсобыхНачисленийИУдержаний);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УдержанияПоСотрудникам.Организация КАК Организация,
	|	УдержанияПоСотрудникам.Сотрудник КАК Сотрудник,
	|	УдержанияПоСотрудникам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	УдержанияПоСотрудникам.Подразделение КАК Подразделение,
	|	УдержанияПоСотрудникам.ДатаНачала КАК ДатаНачала,
	|	УдержанияПоСотрудникам.Удержание КАК Удержание,
	|	УдержанияПоСотрудникам.Сумма КАК Сумма,
	|	УдержанияПоСотрудникам.ДокументОснование КАК ДокументОснование,
	|	УдержанияПоСотрудникам.Контрагент КАК Контрагент,
	|	УдержанияПоСотрудникам.ВидОперации КАК ВидОперации,
	|	УдержанияПоСотрудникам.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТВременнаяТаблица
	|ИЗ
	|	ВТУдержанияПоСотрудникам КАК УдержанияПоСотрудникам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачисленияУдержания.Организация,
	|	НачисленияУдержания.Сотрудник,
	|	НачисленияУдержания.ФизическоеЛицо,
	|	НачисленияУдержания.Подразделение,
	|	НАЧАЛОПЕРИОДА(НачисленияУдержания.Период, МЕСЯЦ),
	|	НачисленияУдержания.НачислениеУдержание,
	|	НачисленияУдержания.Сумма,
	|	НачисленияУдержания.ДокументОснование,
	|	НачисленияУдержания.Контрагент,
	|	ВЫБОР
	|		КОГДА УдержаниеВидОперации.ВидОперации ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПустаяСсылка)
	|		КОГДА УдержаниеВидОперации.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛисты)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты)
	|		КОГДА УдержаниеВидОперации.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгента)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты)
	|		ИНАЧЕ УдержаниеВидОперации.ВидОперации
	|	КОНЕЦ,
	|	0
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам КАК НачисленияУдержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачислениеУдержаниеВидОперации КАК УдержаниеВидОперации
	|		ПО НачисленияУдержания.НачислениеУдержание = УдержаниеВидОперации.НачислениеУдержание
	|ГДЕ
	|	НачисленияУдержания.Организация = &Организация
	|	И НачисленияУдержания.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НачисленияУдержания.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Удержано)
	|	И НЕ НачисленияУдержания.НачислениеУдержание В (&ВидыОсобыхНачисленийИУдержанийНДФЛ)
	|	И НЕ НачисленияУдержания.НачислениеУдержание В (&ВидыОсобыхНачисленийИУдержаний)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТУдержанияПоСотрудникам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.Организация КАК Организация,
	|	ВременнаяТаблица.Сотрудник КАК Сотрудник,
	|	ВременнаяТаблица.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВременнаяТаблица.Подразделение КАК Подразделение,
	|	ВременнаяТаблица.ДатаНачала КАК ДатаНачала,
	|	ВременнаяТаблица.Удержание КАК Удержание,
	|	ВременнаяТаблица.Сумма КАК Сумма,
	|	ВременнаяТаблица.ДокументОснование КАК ДокументОснование,
	|	ВременнаяТаблица.Контрагент КАК Контрагент,
	|	ВременнаяТаблица.ВидОперации КАК ВидОперации,
	|	ВременнаяТаблица.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТУдержанияПоСотрудникам
	|ИЗ
	|	ВТВременнаяТаблица КАК ВременнаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТВременнаяТаблица";
	
	Запрос.Выполнить();

КонецПроцедуры

Процедура ДополнитьТаблицуРегламентированныеУдержания(ПериодРегистрации, Организация, МенеджерВременныхТаблиц) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("Организация", Организация);
		
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НачисленииУдержания.Организация,
	|	НачисленииУдержания.ФизическоеЛицо,
	|	НачисленииУдержания.Сотрудник,
	|	ВЫБОР
	|		КОГДА НачисленииУдержания.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ИПНРасчетыСБывшимиСотрудниками)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНРасчетыСБывшимиСотрудниками)
	|		КОГДА НачисленииУдержания.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ИПНДоходыКонтрагентов)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНДоходыКонтрагентов)
	|		КОГДА НачисленииУдержания.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ИПНДивиденды)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНДивиденды)
	|		КОГДА НачисленииУдержания.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ИПНДоходыСубъектаПредпринимательства)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНДоходыСубъектаПредпринимательства)
	|		КОГДА НачисленииУдержания.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ОПВДоходыКонтрагентов)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыКонтрагентов)
	|		КОГДА НачисленииУдержания.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ОПВРасчетыСБывшимиСотрудниками)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВРасчетыСБывшимиСотрудниками)
	|		КОГДА НачисленииУдержания.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ОПВДоходыСубъектаПредпринимательства)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыСубъектаПредпринимательства)
	|		КОГДА НачисленииУдержания.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ВОСМСРасчетыСБывшимиСотрудниками)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСРасчетыСБывшимиСотрудниками)
	|		КОГДА НачисленииУдержания.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ВОСМСДоходыКонтрагентов)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыКонтрагентов)
	|		КОГДА НачисленииУдержания.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ВОСМСДоходыСубъектаПредпринимательства)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства)
	|	КОНЕЦ КАК ВидОперацииНалогиВзносы,
	|	НачисленииУдержания.Подразделение,
	|	НАЧАЛОПЕРИОДА(НачисленииУдержания.Период, МЕСЯЦ) КАК ДатаНачала,
	|	СУММА(НачисленииУдержания.Сумма) КАК СуммаНалогаВзноса
	|ПОМЕСТИТЬ ВТВременнаяТаблица
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам КАК НачисленииУдержания
	|ГДЕ
	|	НачисленииУдержания.Организация = &Организация
	|	И НачисленииУдержания.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НачисленииУдержания.НачислениеУдержание В (ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ИПНДоходыКонтрагентов), 
	|												 ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ИПНРасчетыСБывшимиСотрудниками),
	|												 ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ИПНДивиденды),
	|												 ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ИПНДоходыСубъектаПредпринимательства),
	|												 ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ОПВДоходыКонтрагентов),
	|												 ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ОПВРасчетыСБывшимиСотрудниками),
	|												 ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ОПВДоходыСубъектаПредпринимательства),
	|												 ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ВОСМСРасчетыСБывшимиСотрудниками),
	|												 ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ВОСМСДоходыКонтрагентов),
	|												 ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ВОСМСДоходыСубъектаПредпринимательства))
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленииУдержания.Организация,
	|	НачисленииУдержания.ФизическоеЛицо,
	|	НачисленииУдержания.Сотрудник,
	|	ВЫБОР
	|		КОГДА НачисленииУдержания.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ИПНРасчетыСБывшимиСотрудниками)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНРасчетыСБывшимиСотрудниками)
	|		КОГДА НачисленииУдержания.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ИПНДоходыКонтрагентов)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНДоходыКонтрагентов)
	|		КОГДА НачисленииУдержания.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ИПНДивиденды)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНДивиденды)
	|		КОГДА НачисленииУдержания.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ИПНДоходыСубъектаПредпринимательства)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ИПНДоходыСубъектаПредпринимательства)
	|		КОГДА НачисленииУдержания.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ОПВДоходыКонтрагентов)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыКонтрагентов)
	|		КОГДА НачисленииУдержания.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ОПВРасчетыСБывшимиСотрудниками)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВРасчетыСБывшимиСотрудниками)
	|		КОГДА НачисленииУдержания.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ОПВДоходыСубъектаПредпринимательства)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыСубъектаПредпринимательства)
	|		КОГДА НачисленииУдержания.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ВОСМСРасчетыСБывшимиСотрудниками)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСРасчетыСБывшимиСотрудниками)
	|		КОГДА НачисленииУдержания.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ВОСМСДоходыКонтрагентов)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыКонтрагентов)
	|		КОГДА НачисленииУдержания.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ВОСМСДоходыСубъектаПредпринимательства)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства)
	|	КОНЕЦ,
	|	НачисленииУдержания.Подразделение,
	|	НАЧАЛОПЕРИОДА(НачисленииУдержания.Период, МЕСЯЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРегламентированныеУдержания.Организация,
	|	ТаблицаРегламентированныеУдержания.ФизическоеЛицо,
	|	ТаблицаРегламентированныеУдержания.Сотрудник,
	|	ТаблицаРегламентированныеУдержания.ВидОперацииНалогиВзносы,
	|	ТаблицаРегламентированныеУдержания.Подразделение,
	|	ТаблицаРегламентированныеУдержания.ДатаНачала,
	|	ТаблицаРегламентированныеУдержания.СуммаНалогаВзноса
	|ИЗ
	|	ВТТаблицаРегламентированныеУдержания КАК ТаблицаРегламентированныеУдержания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТТаблицаРегламентированныеУдержания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.Организация,
	|	ВременнаяТаблица.ФизическоеЛицо,
	|	ВременнаяТаблица.Сотрудник,
	|	ВременнаяТаблица.ВидОперацииНалогиВзносы,
	|	ВременнаяТаблица.Подразделение,
	|	ВременнаяТаблица.ДатаНачала,
	|	ВременнаяТаблица.СуммаНалогаВзноса
	|ПОМЕСТИТЬ ВТТаблицаРегламентированныеУдержания
	|ИЗ
	|	ВТВременнаяТаблица КАК ВременнаяТаблица";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ДополнитьТаблицуНачислениеУдержаниеВидОперации(Таблица, ПериодРегистрации = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДополняемаяТаблица", Таблица);
	
	Если НЕ ПериодРегистрации = Неопределено Тогда
		Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Иначе
		Запрос.УстановитьПараметр("ПериодРегистрации", ТекущаяДатаСеанса());
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.НачислениеУдержание,
	|	Таблица.ВидОперации
	|ПОМЕСТИТЬ ВТДополняемаяТаблица
	|ИЗ
	|	&ДополняемаяТаблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополняемаяТаблица.НачислениеУдержание КАК НачислениеУдержание,
	|	ДополняемаяТаблица.ВидОперации КАК ВидОперации
	|ИЗ
	|	ВТДополняемаяТаблица КАК ДополняемаяТаблица
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыВыплатБывшимСотрудникам.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВыплатыБывшимСотрудникам)
	|ИЗ
	|	Справочник.ВидыВыплатБывшимСотрудникам КАК ВидыВыплатБывшимСотрудникам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыПрочихДоходовФизическихЛиц.Ссылка,
	|	ВЫБОР
	|		КОГДА НалогообложениеНачислений.ВидДохода ЕСТЬ NULL
	|			ИЛИ НалогообложениеНачислений.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ДоходыКонтрагентов)
	|		КОГДА НалогообложениеНачислений.ВидДохода ЕСТЬ NULL
	|			ИЛИ НалогообложениеНачислений.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ДоходыСубъектаПредпринимательства)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ДоходыКонтрагентов)
	|	КОНЕЦ
	|ИЗ
	|	Справочник.ВидыПрочихДоходовФизическихЛиц КАК ВидыПрочихДоходовФизическихЛиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(&ПериодРегистрации) КАК НалогообложениеНачислений
	|		ПО ВидыПрочихДоходовФизическихЛиц.Ссылка = НалогообложениеНачислений.Начисление";
	
	Таблица = Запрос.Выполнить().Выгрузить();

КонецПроцедуры

Процедура ДополнитьМассивТиповНачисления(МассивТипов) Экспорт

	МассивТипов.Добавить(Тип("СправочникСсылка.ВидыВыплатБывшимСотрудникам"));
	МассивТипов.Добавить(Тип("СправочникСсылка.ВидыПрочихДоходовФизическихЛиц"));
	
КонецПроцедуры

Функция ТипыПоляДокументОснование() Экспорт
	
	МассивТипов = Метаданные.ОпределяемыеТипы.ОснованиеНачисленияУдержания.Тип.Типы();
	МассивТиповКА = Метаданные.ОпределяемыеТипы.ОснованиеНачисленияУдержанияПоКонтрагентамАкционерам.Тип.Типы();
	
	Для каждого Значение Из МассивТиповКА Цикл
		МассивТипов.Добавить(Значение);
	КонецЦикла;
		
	Возврат МассивТипов;
	
КонецФункции

#КонецОбласти
