
&НаСервереБезКонтекста
Функция ПроверитьПодключениеFTPSOAPНаСервере(ПараметрыОбъекта, ТипОбменаЭТРН, ТипОбменаПоSOAP)
	
	ТекстСообщения = "";
	НовыйОбъект = Справочники.ЭКОМ_ПрофилиОбмена.СоздатьЭлемент();
	Если ТипОбменаПоSOAP Тогда
		ТекстСообщения = НовыйОбъект.ПодключениеПодключитьсяSOAPНаСервере(ПараметрыОбъекта);
	Иначе
		ТекстСообщения = НовыйОбъект.ПодключениеПодключитьсяFTPНаСервере(ПараметрыОбъекта, ТипОбменаЭТРН);
	КонецЕсли;
	
	Возврат ТекстСообщения;

КонецФункции

&НаКлиенте
Процедура ПроверитьПодключениеFTPSOAP(Команда)
	ПараметрыОбъекта = ПолучитьПараметрыОбъекта();     	
	ТипПодключения   = ПолучитьСпособОбмена();
	Если ТипПодключения = "REST" Тогда
		ПоказатьПредупреждение(, "Для проверки доступности FTP/SOAP выберите соответствующий способ обмена",, "Проверка подключения");
		Возврат;
	КонецЕсли; 	
	ТипОбменаПоSOAP = ПолучитьСпособОбмена() = "SOAP";
	
	ТипОбменаЭТРН  = Ложь;
	ТекстСообщения = ПроверитьПодключениеFTPSOAPНаСервере(ПараметрыОбъекта, ТипОбменаЭТРН, ТипОбменаПоSOAP);
	ПоказатьПредупреждение(,ТекстСообщения,, "Проверка подключения по " + ?(Объект.ОбменПоSOAP, "SOAP", "FTP"));
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСпособОбмена()
	Результат = "FTP";
	Если СпособОбменаФайлами = 2 Тогда
		Результат = "REST";
	ИначеЕсли СпособОбменаФайлами = 1 Тогда
		Результат = "SOAP";
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

&НаКлиенте
Функция  ПолучитьПараметрыОбъекта()
	
	ПараметрыОбъекта = Новый Структура; 
	ПараметрыОбъекта.Вставить("СерверFTP"              , Объект.СерверFTP);
	ПараметрыОбъекта.Вставить("ИмяПользователяFTP"     , Объект.ИмяПользователяFTP);
	ПараметрыОбъекта.Вставить("ПарольПользователяFTP"  , Объект.ПарольПользователяFTP);
	ПараметрыОбъекта.Вставить("ВходящийПутьFTP"        , Объект.ВходящийПутьFTP);
	ПараметрыОбъекта.Вставить("ИсходящийПутьFTP"       , Объект.ИсходящийПутьFTP);
	ПараметрыОбъекта.Вставить("ОбменПоSOAP"            , Объект.ОбменПоSOAP);
	ПараметрыОбъекта.Вставить("СерверAPI"              , Объект.СерверAPI);
	ПараметрыОбъекта.Вставить("СерверREST"             , Объект.СерверREST);
	ПараметрыОбъекта.Вставить("Порт"                   , Объект.Порт);
	ПараметрыОбъекта.Вставить("ПарольПользователяAPI"  , Объект.ПарольПользователяAPI);
	ПараметрыОбъекта.Вставить("ЭТРН_Сервер"            , Объект.ЭТРН_Сервер);
	ПараметрыОбъекта.Вставить("ЭТРН_ИмяПользователя"   , Объект.ЭТРН_ИмяПользователя);
	ПараметрыОбъекта.Вставить("ЭТРН_ПарольПользователя", Объект.ЭТРН_ПарольПользователя);
	ПараметрыОбъекта.Вставить("ЭТРН_ОбменПоSOAP"       , Объект.ЭТРН_ОбменПоSOAP);
	ПараметрыОбъекта.Вставить("ПроверятьФайлыЛокально" , Объект.ПроверятьФайлыЛокально);
	ПараметрыОбъекта.Вставить("ОставитьФайлыНаПлатформеПослеЗагрузки", Объект.ОставитьФайлыНаПлатформеПослеЗагрузки);
	ПараметрыОбъекта.Вставить("Страна", Объект.Страна);
	
	Возврат ПараметрыОбъекта; 
	
КонецФункции

&НаКлиенте
Процедура ПроверитьПодключениеЭТРН(Команда)
	
	ПараметрыОбъекта = ПолучитьПараметрыОбъекта();

	ТипОбменаЭТРН = Истина;
	ТекстСообщения = ПроверитьПодключениеFTPSOAPНаСервере(ПараметрыОбъекта, ТипОбменаЭТРН, Объект.ЭТРН_ОбменПоSOAP);
	ПоказатьПредупреждение(,ТекстСообщения,, "Проверка подключения по " + ?(Объект.ЭТРН_ОбменПоSOAP, "SOAP", "FTP"));

КонецПроцедуры

&НаСервере
Функция ПолучитьТокенАвторизацииНаСервере(ПараметрыОбъекта, МассивЛогаСобытий)

	Ошибка = Новый Структура;
	Ошибка.Вставить("ЕстьОшибка" , Ложь);
	Ошибка.Вставить("КодОшибки"  , "");
	Ошибка.Вставить("ТекстОшибки", "");

	ЭКОМ_ОбщегоНазначения.ПолучитьТокенАвторизации(ПараметрыОбъекта, Ошибка, МассивЛогаСобытий);

	Если Ошибка.ЕстьОшибка Тогда
		ТекстПредупреждения = "Ошибка подключения по API. (" + ?(ПустаяСтрока(Ошибка.КодОшибки), "", Ошибка.КодОшибки + ": ") + Ошибка.ТекстОшибки + ")";

	Иначе
		ТекстПредупреждения = "Подключение по API успешно";
		
	КонецЕсли;
	
	Возврат ТекстПредупреждения;
	
КонецФункции 

&НаКлиенте
Процедура ПроверитьПодключениеAPI(Команда)
	
	МассивЛогаСобытий = Новый Массив;
	ПараметрыОбъекта = ПолучитьПараметрыОбъекта();
	ТекстПредупреждения = ПолучитьТокенАвторизацииНаСервере(ПараметрыОбъекта, МассивЛогаСобытий);	
	//Если МассивЛогаСобытий.Количество() > 0  Тогда
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий);
	//	Сообщение.Сообщить();
	//КонецЕсли;
	
	ПоказатьПредупреждение(, ТекстПредупреждения,, "Проверка подключения по API");

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолучатьИдентификаторы = ЭКОМ_ОбщегоНазначения.Настройка_Параметр_Прочитать("ЭКОМ_ПолучатьИдентификаторыЦепочек", Ложь);
	Если ПолучатьИдентификаторы Тогда
		Элементы.СерверREST.Видимость 				  = Истина;
		Элементы.СерверREST.Доступность				  = Истина;
		Элементы.Декорация2.Видимость			      = Истина;
		Элементы.Декорация2.Доступность 		      = Истина;
		Элементы.ПроверитьПодключениеREST.Видимость   = Истина;
		Элементы.ПроверитьПодключениеREST.Доступность = Истина;
	КонецЕсли;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СписокСтран  = ОбработкаОбъект.ПолучитьСписокСтран();
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	    НастройкиПоУмолчанию = ОбработкаОбъект.ПолучитьНастройкиПоУмолчанию();
		ЗаполнитьЗначенияСвойств(Объект, НастройкиПоУмолчанию);
	КонецЕсли;
	
	Если Объект.Страна = "kz" Тогда 
		УстановитьВидимостьApi();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИмяПользователяFTPПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
	     Объект.Наименование = Объект.ИмяПользователяFTP;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтранаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элементы.Страна.СписокВыбора.Очистить();	
	Элементы.Страна.СписокВыбора.ЗагрузитьЗначения(СписокСтран.ВыгрузитьЗначения());				
	Элементы.Страна.СписокВыбора.СортироватьПоЗначению();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Страна.СписокВыбора.ЗагрузитьЗначения(СписокСтран.ВыгрузитьЗначения());
	НайденноеЗначение = СписокСтран.НайтиПоЗначению(Объект.Страна);
	Если НЕ НайденноеЗначение = Неопределено Тогда
		Объект.Страна = НайденноеЗначение.Значение;
	КонецЕсли;	
	
	Если Объект.КоличествоФайловВПакете = 0 Тогда
		Объект.КоличествоФайловВПакете = 500;
	КонецЕсли;
	
	Если Объект.ОбменREST Тогда
		СпособОбменаФайлами = 2;
	ИначеЕсли Объект.ОбменПоSOAP Тогда
		СпособОбменаФайлами = 1;
	Иначе
		СпособОбменаФайлами = 0;
	КонецЕсли;	

	ТекущийСпособОбмена = ПолучитьСпособОбмена();  
	
	СтранаПриИзменении(Истина);	
КонецПроцедуры

&НаКлиенте
Процедура СпособОбменаФайламиПриИзменении(Элемент)
	Если Не ДоступноИспользованиеREST(Объект.Страна, ПолучитьСпособОбмена()) Тогда
		СпособОбменаФайлами = ТекущийСпособОбмена;
	Иначе
		ТекущийСпособОбмена = СпособОбменаФайлами;
		Модифицированность = Истина; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключениеREST(Команда)
	ДанныеПодключения = Новый Структура("Сервер, ИмяПользователя, ПарольПользователя", Объект.СерверREST, Объект.ИмяПользователяFTP, Объект.ПарольПользователяAPI);
	ДанныеАвторизации = ЭКОМ_ВзаимодействиеREST_API.ВыполнитьАвторизациюАтолл_БезДанных(ДанныеПодключения);
	Если ДанныеАвторизации.Получены Тогда
		ТекстСообщения = "Обмен REST доступен";
	Иначе
		ТекстСообщения = "Обмен REST не доступен";
		Если ДанныеАвторизации.РезультатAPI.КодСостояния = 0 Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС + "проверьте значение поля ""Сервер (обмен)"""; 
		Иначе
			ТекстСообщения = ТекстСообщения + Символы.ПС + "Текст ошибки сервера: " + ДанныеАвторизации.РезультатAPI.ОтветТекст; 
		КонецЕсли;
	КонецЕсли;
	
	ПоказатьПредупреждение(, ТекстСообщения,, "Проверка доступности обмена REST");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Модифицированность Тогда
		Если СпособОбменаФайлами = 2 Тогда
			Объект.ОбменREST   = Истина;
			Объект.ОбменПоSOAP = Ложь;
		ИначеЕсли СпособОбменаФайлами = 1 Тогда
			Объект.ОбменREST   = Ложь;
			Объект.ОбменПоSOAP = Истина;
		Иначе
			Объект.ОбменREST   = Ложь;
			Объект.ОбменПоSOAP = Ложь;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтранаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ДоступноИспользованиеREST(ВыбранноеЗначение, ПолучитьСпособОбмена()) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ДоступноИспользованиеREST(Регион, СпособОбменаДокументами)
	Результат = Истина;
	Если СпособОбменаДокументами = "REST" И Не Регион = "ru" Тогда
		ПоказатьПредупреждение(,"Использование обмена через REST доступно только для региона - ru");
		Результат = Ложь;
	КонецЕсли;
	Возврат Результат;
КонецФункции


&НаКлиенте
Процедура СтранаПриИзменении(Элемент)
    Элементы.ГруппаПутьПарольЭЦП.Видимость = (Объект.Страна = "kz");
	УстановитьВидимостьApi();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьApi()
	
	ОставитьApi = Объект.Страна = "ru";
	
	Элементы.СпособОбменаФайлами.СписокВыбора.Очистить();
	Элементы.СпособОбменаФайлами.СписокВыбора.Добавить(0,"FTP");
	Если ОставитьApi Тогда
		Элементы.СпособОбменаФайлами.СписокВыбора.Добавить(1,"SOAP");
		Объект.СерверFTP = "ftpex.e-vo.ru";
	Иначе
		СпособОбменаФайлами = 0;
		Объект.СерверFTP = "dp-ftp.e-vo.kz";
	КонецЕсли;
	
	Элементы.ГруппаAPI.Видимость = ОставитьApi;	
	Элементы.ГруппаЭТРН.Видимость = ОставитьApi;	
	Элементы.ПарольПользователяAPI.Видимость = ОставитьApi;	
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновленПрофильОбмена");
КонецПроцедуры


&НаКлиенте
Процедура ПутьДоСертификатаПодписиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОписаниеОповещения 	= Новый ОписаниеОповещения("КаталогНачалоВыбораФайлаЗавершение", ЭтаФорма, Элемент.Имя);
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.Каталог  = Элемент.ТекстРедактирования;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Путь к файлу";
	
	ДиалогОткрытияФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбораФайлаЗавершение(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт

    Если ПомещенныеФайлы = Неопределено Тогда
        Возврат;
    КонецЕсли;

	Объект.ПутьДоСертификатаПодписи = ПомещенныеФайлы[0];
    
КонецПроцедуры
