#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Команда = ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		Команда.ВидимостьВФормах = "ФормаСписка";
	КонецЕсли;
	
КонецПроцедуры

// Добавляет команду создания документа "Списание НМА".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.СписаниеНМА2_4) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.СписаниеНМА2_4.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.СписаниеНМА2_4);
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьВнеоборотныеАктивы2_4";
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// ДА-3 (Акт на списание долгосрочных активов)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.ПечатьОС1";
	КомандаПечати.Идентификатор = "ДА3";
	КомандаПечати.Представление = НСтр("ru = 'ДА-3 (Акт на списание ДА)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Формирует таблицы движений при отложенном проведении.
//
// Параметры:
//  ДокументСсылка			 - ДокументСсылка.СписаниеНМА2_4 - Документ, для которого формируются движения
//  МенеджерВременныхТаблиц	 - МенеджерВременныхТаблиц - Содержит вспомогательные временные таблицы, которые могут использоваться для формирования движений.
//
Функция ТаблицыОтложенногоФормированияДвижений(ДокументСсылка, МенеджерВременныхТаблиц) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	ТекстыЗапроса = Новый СписокЗначений;
	УчетФиксированныхАктивов.ТекстЗапросаВТОтраженияВНалУчетеНМА("СписаниеНМА2_4", "Выбытие", ТекстыЗапроса, "НМА");
	ТекстыЗапроса.Добавить(УчетФиксированныхАктивов.ТекстЗапросаВТАналитикаУчетаВАНМА("СписаниеНакопленнойАмортизации"));
	ТекстЗапросаТаблицаСтоимостьНМА(ТекстыЗапроса);
	ТекстЗапросаТаблицаАмортизацияНМА(ТекстыЗапроса);
	ТекстЗапросаТаблицаПрочиеРасходы(ТекстыЗапроса);
	ТекстЗапросаТаблицаПартииПрочихРасходов(ТекстыЗапроса);
	ТекстЗапросаПрочиеДоходы(ТекстыЗапроса);
	ТекстЗапросаПрочиеАктивыПассивы(ТекстыЗапроса);
	ТекстЗапросаДвиженияДоходыРасходыПрочиеАктивыПассивы(ТекстыЗапроса);
	
	ТаблицыДляДвижений = Новый Структура;
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ТаблицыДляДвижений, Истина);
	
	Возврат ТаблицыДляДвижений;
	
КонецФункции
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

Функция АдаптированныйТекстЗапросаДвиженийПоРегистру(ИмяРегистра) Экспорт

	Запрос = Новый Запрос;
	ТекстыЗапроса = Новый СписокЗначений;
	
	ПолноеИмяДокумента = "Документ.СписаниеНМА2_4";
	
	ЗначенияПараметров = ЗначенияПараметровПроведения();
	ПереопределениеРасчетаПараметров = Новый Структура;
	ПереопределениеРасчетаПараметров.Вставить("НомерНаПечать", """""");
	
	ВЗапросеЕстьИсточник = Истина;
	
	Если ИмяРегистра = "РеестрДокументов" Тогда
		
		ТекстЗапроса = ТекстЗапросаТаблицаРеестрДокументов(ТекстыЗапроса, ИмяРегистра);
		СинонимТаблицыДокумента = "";
		ВЗапросеЕстьИсточник = Ложь;
		
	Иначе
		ТекстИсключения = НСтр("ru = 'В документе %ПолноеИмяДокумента% не реализована адаптация текста запроса формирования движений по регистру %ИмяРегистра%.'");
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ПолноеИмяДокумента%", ПолноеИмяДокумента);
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ИмяРегистра%", ИмяРегистра);
		
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Если ИмяРегистра = "РеестрДокументов" Тогда
		
		ТекстЗапроса = ОбновлениеИнформационнойБазыУТ.АдаптироватьЗапросПроведенияПоНезависимомуРегистру(
										ТекстЗапроса,
										ПолноеИмяДокумента,
										СинонимТаблицыДокумента,
										ВЗапросеЕстьИсточник,
										ПереопределениеРасчетаПараметров);
	Иначе	
		
		ТекстЗапроса = ОбновлениеИнформационнойБазыУТ.АдаптироватьЗапросМеханизмаПроведения(
										ТекстЗапроса,
										ПолноеИмяДокумента,
										СинонимТаблицыДокумента,
										ПереопределениеРасчетаПараметров);
	КонецЕсли; 

	Результат = ОбновлениеИнформационнойБазыУТ.РезультатАдаптацииЗапроса();
	Результат.ЗначенияПараметров = ЗначенияПараметров;
	Результат.ТекстЗапроса = ТекстЗапроса;
	
	Возврат Результат;
	
КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаДокументыПоНМА(ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаРеестрДокументов(ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаПервоначальныеСведенияНМА(ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаПорядокУчетаНМАУУ(ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаПорядокУчетаНМАБУ(ТекстыЗапроса, Регистры);
	
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                     КАК Ссылка,
	|	ДанныеДокумента.Дата                       КАК Период,
	|	ДанныеДокумента.Дата                       КАК Дата,
	|	ДанныеДокумента.Номер                      КАК Номер,
	|	ДанныеДокумента.Проведен                   КАК Проведен,
	|	ДанныеДокумента.ПометкаУдаления            КАК ПометкаУдаления,
	|	ДанныеДокумента.ОтражатьВРеглУчете         КАК ОтражатьВРеглУчете,
	|	ДанныеДокумента.ОтражатьВУпрУчете          КАК ОтражатьВУпрУчете,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНМА)            КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеСтоимостиНМА)   КАК ХозяйственнаяОперацияСтоимость,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеАмортизацииНМА) КАК ХозяйственнаяОперацияАмортизация,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРезерваПереоценкиСтоимостиНМА)   КАК ХозяйственнаяОперацияРезервСтоимость,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРезерваПереоценкиАмортизацииНМА) КАК ХозяйственнаяОперацияРезервАмортизация,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.НематериальныеАктивы) КАК СтатьяАП_НМА,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПрибылиИУбытки) КАК СтатьяАП_ПрибыльУбытки,
	|	ДанныеДокумента.Организация                КАК Организация,
	|	ДанныеДокумента.Подразделение              КАК Подразделение,
	|	ДанныеДокумента.ЧастичнаяЛиквидация        КАК ЧастичнаяЛиквидация,
	|	ДанныеДокумента.СтатьяРасходов             КАК СтатьяРасходов,
	|	ДанныеДокумента.АналитикаРасходов          КАК АналитикаРасходов,
	|	ДанныеДокумента.АналитикаАктивовПассивов   КАК АналитикаАктивовПассивов,
	|	ДанныеДокумента.Ответственный              КАК Ответственный,
	|	ДанныеДокумента.Комментарий                КАК Комментарий
	|,	ДанныеДокумента.СнятьСУчетаПоНалогам	   КАК СнятьСУчетаПоНалогам,
	|	ДанныеДокумента.СписыватьПоБалансовойСтоимости КАК СписыватьПоБалансовойСтоимости
	|ИЗ
	|	Документ.СписаниеНМА2_4 КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|";
	
	Результат = Запрос.Выполнить();
	Реквизиты = Результат.Выбрать();
	Реквизиты.Следующий();
	
	Для каждого Колонка Из Результат.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[Колонка.Имя]);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("КонецДня", Новый Граница(КонецДня(Реквизиты.Период),ВидГраницы.Включая));
	
	ЗначенияПараметровПроведения = ЗначенияПараметровПроведения(Реквизиты);
	Для каждого КлючИЗначение Из ЗначенияПараметровПроведения Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла; 
	
	УниверсальныеМеханизмыПартийИСебестоимости.ЗаполнитьПараметрыИнициализации(Запрос, Реквизиты);
	
КонецПроцедуры

Функция ЗначенияПараметровПроведения(Реквизиты = Неопределено)
	
	ЗначенияПараметровПроведения = Новый Структура;
	ЗначенияПараметровПроведения.Вставить("ИдентификаторМетаданных", ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.СписаниеНМА2_4"));
	ЗначенияПараметровПроведения.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.СписаниеНМА);
	ЗначенияПараметровПроведения.Вставить("НазваниеДокумента", НСтр("ru='Списание НМА'"));
	ЗначенияПараметровПроведения.Вставить("ИспользоватьУчетПрочихДоходовРасходов", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПрочихДоходовРасходов"));
	
	Если Реквизиты <> Неопределено Тогда
		ЗначенияПараметровПроведения.Вставить("НомерНаПечать", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Реквизиты.Номер));
	КонецЕсли;
	
	Возврат ЗначенияПараметровПроведения;
	
КонецФункции

Функция ТекстЗапросаТаблицаДокументыПоНМА(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ДокументыПоНМА";
	
	Если Не ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТаблицаНМА.НомерСтроки-1, 0) КАК НомерЗаписи,
	|	&Ссылка                          КАК Ссылка,
	|	ТаблицаНМА.НематериальныйАктив   КАК НематериальныйАктив,
	|	&ХозяйственнаяОперация           КАК ХозяйственнаяОперация,
	|	&Организация                     КАК Организация,
	|	&Подразделение                   КАК Подразделение,
	|	&Период                          КАК Дата,
	|	&ИдентификаторМетаданных         КАК ТипСсылки,
	|	&Проведен                        КАК Проведен,
	|	&ОтражатьВУпрУчете               КАК ОтражатьВУпрУчете,
	|	&ОтражатьВРеглУчете              КАК ОтражатьВРеглУчете
	|ИЗ
	|	Документ.СписаниеНМА2_4 КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			Документ.СписаниеНМА2_4.НМА КАК ТаблицаНМА
	|		ПО
	|			ТаблицаНМА.Ссылка = ДанныеДокумента.Ссылка
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаРеестрДокументов(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "РеестрДокументов";
	
	Если Не ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Ссылка                        КАК Ссылка,
	|	&Период                        КАК ДатаДокументаИБ,
	|	&Номер                         КАК НомерДокументаИБ,
	|	&ИдентификаторМетаданных       КАК ТипСсылки,
	|	&Организация                   КАК Организация,
	|	&ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО                   КАК НаправлениеДеятельности,
	|	&Подразделение                 КАК Подразделение,
	|	&Ответственный                 КАК Ответственный,
	|	&Комментарий                   КАК Комментарий,
	|	&Проведен                      КАК Проведен,
	|	&ПометкаУдаления               КАК ПометкаУдаления,
	|	ЛОЖЬ                           КАК ДополнительнаяЗапись,
	|	&Период                        КАК ДатаПервичногоДокумента,
	|	&НомерНаПечать                 КАК НомерПервичногоДокумента,
	|	&Период   КАК ДатаОтраженияВУчете
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаПервоначальныеСведенияНМА(ТекстыЗапроса, Регистры)

	ИмяРегистра = "ПервоначальныеСведенияНМА";
	
	Если Не ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ВнеоборотныеАктивыСлужебный.ТекстЗапросаТаблицаВтСписокНМА(ТекстыЗапроса, ПолноеИмяОбъекта());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период                                                            КАК Период,
	|	&Организация                                                       КАК Организация,
	|	ТаблицаНМА.НематериальныйАктив                                     КАК НематериальныйАктив,
	|	ПервоначальныеСведенияНМА.СпособПоступления                        КАК СпособПоступления,
	|	ВЫБОР
	|		КОГДА &ЧастичнаяЛиквидация
	|			ТОГДА ПервоначальныеСведенияНМА.ПервоначальнаяСтоимостьУУ - ТаблицаНМА.СуммаСписанияУУ                
	|		ИНАЧЕ ПервоначальныеСведенияНМА.ПервоначальнаяСтоимостьУУ
	|	КОНЕЦ                                                              КАК ПервоначальнаяСтоимостьУУ,
	|	ВЫБОР
	|		КОГДА &ЧастичнаяЛиквидация
	|			ТОГДА ПервоначальныеСведенияНМА.ПервоначальнаяСтоимостьБУ - ТаблицаНМА.СуммаСписанияБУ                
	|		ИНАЧЕ ПервоначальныеСведенияНМА.ПервоначальнаяСтоимостьБУ
	|	КОНЕЦ                                                              КАК ПервоначальнаяСтоимостьБУ,
	|	ВЫБОР
	|		КОГДА &ЧастичнаяЛиквидация
	|			ТОГДА ПервоначальныеСведенияНМА.ПервоначальнаяСтоимостьНУ - ТаблицаНМА.СуммаСписанияНУ                
	|		ИНАЧЕ ПервоначальныеСведенияНМА.ПервоначальнаяСтоимостьНУ
	|	КОНЕЦ                                                              КАК ПервоначальнаяСтоимостьНУ,
	|	ВЫБОР
	|		КОГДА &ЧастичнаяЛиквидация
	|			ТОГДА ПервоначальныеСведенияНМА.ПервоначальнаяСтоимостьПР - ТаблицаНМА.СуммаСписанияПР                
	|		ИНАЧЕ ПервоначальныеСведенияНМА.ПервоначальнаяСтоимостьПР
	|	КОНЕЦ                                                              КАК ПервоначальнаяСтоимостьПР,
	|	ВЫБОР
	|		КОГДА &ЧастичнаяЛиквидация
	|			ТОГДА ПервоначальныеСведенияНМА.ПервоначальнаяСтоимостьВР - ТаблицаНМА.СуммаСписанияВР                
	|		ИНАЧЕ ПервоначальныеСведенияНМА.ПервоначальнаяСтоимостьВР
	|	КОНЕЦ                                                              КАК ПервоначальнаяСтоимостьВР,
	|	ПервоначальныеСведенияНМА.МетодНачисленияАмортизацииБУ             КАК МетодНачисленияАмортизацииБУ,
	|	ПервоначальныеСведенияНМА.МетодНачисленияАмортизацииНУ             КАК МетодНачисленияАмортизацииНУ,
	|	ПервоначальныеСведенияНМА.Коэффициент                              КАК Коэффициент,
	|	ПервоначальныеСведенияНМА.АмортизацияДо2002                        КАК АмортизацияДо2002,
	|	ПервоначальныеСведенияНМА.АмортизацияДо2009                        КАК АмортизацияДо2009,
	|	ПервоначальныеСведенияНМА.СтоимостьДо2002                          КАК СтоимостьДо2002,
	|	ПервоначальныеСведенияНМА.ФактическийСрокИспользованияДо2009       КАК ФактическийСрокИспользованияДо2009,
	|	ПервоначальныеСведенияНМА.ДатаПриобретения                         КАК ДатаПриобретения,
	|	ПервоначальныеСведенияНМА.ДатаПринятияКУчетуУУ                     КАК ДатаПринятияКУчетуУУ,
	|	ПервоначальныеСведенияНМА.ДатаПринятияКУчетуБУ                     КАК ДатаПринятияКУчетуБУ,
	|	ПервоначальныеСведенияНМА.ДокументПринятияКУчетуУУ                 КАК ДокументПринятияКУчетуУУ,
	|	ПервоначальныеСведенияНМА.ДокументПринятияКУчетуБУ                 КАК ДокументПринятияКУчетуБУ,
	|	ПервоначальныеСведенияНМА.ПорядокУчетаНУ			               КАК ПорядокУчетаНУ,
	|	ВЫБОР
	|		КОГДА НЕ &ЧастичнаяЛиквидация
	|			ТОГДА &Ссылка                
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ                                                              КАК ДокументСписания
	|,	ПервоначальныеСведенияНМА.АмортизационнаяГруппа		               КАК АмортизационнаяГруппа
	|ИЗ
	|	Документ.СписаниеНМА2_4.НМА КАК ТаблицаНМА
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ПервоначальныеСведенияНМА.СрезПоследних(
	|			&КонецДня,
	|			Регистратор <> &Ссылка
	|				И Организация = &Организация
	|				И НематериальныйАктив В (ВЫБРАТЬ Т.НематериальныйАктив ИЗ втСписокНМА КАК Т)
	|		) КАК ПервоначальныеСведенияНМА
	|	ПО
	|		ПервоначальныеСведенияНМА.НематериальныйАктив = ТаблицаНМА.НематериальныйАктив
	|ГДЕ
	|	ТаблицаНМА.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ТекстЗапросаТаблицаПорядокУчетаНМАУУ(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ПорядокУчетаНМАУУ";
	
	Если Не ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Период                    КАК Период,
	|	&Организация               КАК Организация,
	|	ТаблицаДокумента.НематериальныйАктив КАК НематериальныйАктив,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийНМА.Списан) КАК Состояние
	|ИЗ
	|	Документ.СписаниеНМА2_4.НМА КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И &ОтражатьВУпрУчете
	|	И НЕ &ЧастичнаяЛиквидация
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

Процедура ТекстЗапросаТаблицаПорядокУчетаНМАБУ(ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ПорядокУчетаНМАБУ";
	
	Если Не ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	&Период                    КАК Период,
	|	&Организация               КАК Организация,
	|	ТаблицаДокумента.НематериальныйАктив КАК НематериальныйАктив,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийНМА.Списан) КАК Состояние,
	|	ЛОЖЬ                       КАК НачислятьАмортизациюБУ,
	|	ЛОЖЬ                       КАК НачислятьАмортизациюНУ
	|ИЗ
	|	Документ.СписаниеНМА2_4.НМА КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|	И &ОтражатьВРеглУчете
	|	И НЕ &ЧастичнаяЛиквидация
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

Процедура ТекстЗапросаТаблицаАмортизацияНМА(ТекстыЗапроса)

	ИмяРегистра = "АмортизацияНМА";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяРегистра, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаТаблицаВтОстаточнаяСтоимостьНМА(ТекстыЗапроса);
	
	ТекстЗапроса =
	"//Списание амортизации
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)     КАК ВидДвижения,
	|	&Ссылка                                    КАК Регистратор,
	|	&Период                                    КАК Период,
	|	&Организация                               КАК Организация,
	|	&Подразделение                             КАК Подразделение,
	|	ТаблицаНМА.НематериальныйАктив             КАК НематериальныйАктив,
	|
	|	ТаблицаНМА.Амортизация                     КАК Амортизация,
	|	ТаблицаНМА.АмортизацияРегл                 КАК АмортизацияРегл,
	|	ТаблицаНМА.АмортизацияНУ                   КАК АмортизацияНУ,
	|	ТаблицаНМА.АмортизацияПР                   КАК АмортизацияПР,
	|	ТаблицаНМА.АмортизацияВР                   КАК АмортизацияВР,
	|	ТаблицаНМА.АмортизацияЦФ                   КАК АмортизацияЦФ,
	|	ТаблицаНМА.АмортизацияНУЦФ                 КАК АмортизацияНУЦФ,
	|	ТаблицаНМА.АмортизацияПРЦФ                 КАК АмортизацияПРЦФ,
	|	ТаблицаНМА.АмортизацияВРЦФ                 КАК АмортизацияВРЦФ,
	|	0                                          КАК РезервПереоценкиАмортизации,
	|	0                                          КАК РезервПереоценкиАмортизацииРегл,
	|
	|	ТаблицаНМА.ГруппаФинансовогоУчета          КАК ГруппаФинансовогоУчета,
	|	ТаблицаНМА.НаправлениеДеятельности         КАК НаправлениеДеятельности,
	|	&СтатьяРасходов                            КАК КорСтатьяРасходов,
	|	&АналитикаРасходов                         КАК КорАналитикаРасходов,
	|	&ХозяйственнаяОперацияАмортизация          КАК ХозяйственнаяОперация
	|,	АналитикаУчетаВА.КлючАналитики 		   	   КАК ВидАктиваИДвиженияСтоимостиНУ
	|ИЗ
	|	втАмортизцияСписанияНМА КАК ТаблицаНМА
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикаУчетаВАСписаниеНакопленнойАмортизации КАК АналитикаУчетаВА
	|	ПО ТаблицаНМА.НематериальныйАктив = АналитикаУчетаВА.ОбъектУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|//Списание резерва переоценки
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)     КАК ВидДвижения,
	|	&Ссылка                                    КАК Регистратор,
	|	&Период                                    КАК Период,
	|	&Организация                               КАК Организация,
	|	&Подразделение                             КАК Подразделение,
	|	ТаблицаНМА.НематериальныйАктив             КАК НематериальныйАктив,
	|
	|	0                                          КАК Амортизация,
	|	0                                          КАК АмортизацияРегл,
	|	0                                          КАК АмортизацияНУ,
	|	0                                          КАК АмортизацияПР,
	|	0                                          КАК АмортизацияВР,
	|	0                                          КАК АмортизацияЦФ,
	|	0                                          КАК АмортизацияНУЦФ,
	|	0                                          КАК АмортизацияПРЦФ,
	|	0                                          КАК АмортизацияВРЦФ,
	|	ТаблицаНМА.РезервПереоценкиАмортизации     КАК РезервПереоценкиАмортизации,
	|	ТаблицаНМА.РезервПереоценкиАмортизацииРегл КАК РезервПереоценкиАмортизацииРегл,
	|
	|	ТаблицаНМА.ГруппаФинансовогоУчета          КАК ГруппаФинансовогоУчета,
	|	ТаблицаНМА.НаправлениеДеятельности         КАК НаправлениеДеятельности,
	|	&СтатьяРасходов                            КАК КорСтатьяРасходов,
	|	&АналитикаРасходов                         КАК КорАналитикаРасходов,
	|	&ХозяйственнаяОперацияРезервАмортизация    КАК ХозяйственнаяОперация
	|, 	НЕОПРЕДЕЛЕНО						   	   КАК ВидАктиваИДвиженияСтоимостиНУ
	|ИЗ
	|	втАмортизцияСписанияНМА КАК ТаблицаНМА
	|ГДЕ
	|	ТаблицаНМА.РезервПереоценкиАмортизации <> 0
	|		ИЛИ ТаблицаНМА.РезервПереоценкиАмортизацииРегл <> 0";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

Процедура ТекстЗапросаТаблицаСтоимостьНМА(ТекстыЗапроса)

	ИмяРегистра = "СтоимостьНМА";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяРегистра, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаТаблицаВтАмортизацияСписанияНМА(ТекстыЗапроса);
	ТекстЗапросаТаблицаВтОстаточнаяСтоимостьНМА(ТекстыЗапроса);
	ТекстЗапросаТаблицаВтСтоимостьСписанияНМА(ТекстыЗапроса);
	
	ТекстЗапроса =
	"//Списание амортизации
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период                                КАК Период,
	|	&Организация                           КАК Организация,
	|	&Подразделение                         КАК Подразделение,
	|	ТаблицаНМА.НематериальныйАктив         КАК НематериальныйАктив,
	|
	|	ТаблицаНМА.Амортизация                 КАК Стоимость,
	|	ТаблицаНМА.АмортизацияРегл             КАК СтоимостьРегл,
	|	ТаблицаНМА.АмортизацияНУ               КАК СтоимостьНУ,
	|	ТаблицаНМА.АмортизацияПР               КАК СтоимостьПР,
	|	ТаблицаНМА.АмортизацияВР               КАК СтоимостьВР,
	|	ТаблицаНМА.АмортизацияЦФ               КАК СтоимостьЦФ,
	|	ТаблицаНМА.АмортизацияНУЦФ             КАК СтоимостьНУЦФ,
	|	ТаблицаНМА.АмортизацияПРЦФ             КАК СтоимостьПРЦФ,
	|	ТаблицаНМА.АмортизацияВРЦФ             КАК СтоимостьВРЦФ,
	|	0                                      КАК ПредварительнаяСтоимость,
	|	0                                      КАК ПредварительнаяСтоимостьРегл,
	|	0                                      КАК РезервПереоценкиСтоимости,
	|	0                                      КАК РезервПереоценкиСтоимостиРегл,
	|	
	|	ТаблицаНМА.ГруппаФинансовогоУчета      КАК ГруппаФинансовогоУчета,
	|	ТаблицаНМА.НаправлениеДеятельности     КАК НаправлениеДеятельности,
	|	&ХозяйственнаяОперацияАмортизация      КАК ХозяйственнаяОперация,
	|	&СтатьяРасходов                        КАК КорСтатьяРасходов,
	|	&АналитикаРасходов                     КАК КорАналитикаРасходов,
	|	&ОтражатьВРеглУчете                    КАК ОтражатьВРеглУчете,
	|	&ОтражатьВУпрУчете                     КАК ОтражатьВУпрУчете
	|,	АналитикаУчетаВА.КлючАналитики 		   КАК ВидАктиваИДвиженияСтоимостиНУ
	|ИЗ
	|	втАмортизцияСписанияНМА КАК ТаблицаНМА
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикаУчетаВАСписаниеНакопленнойАмортизации КАК АналитикаУчетаВА
	|	ПО ТаблицаНМА.НематериальныйАктив = АналитикаУчетаВА.ОбъектУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|//Списание остаточной стоимости
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Период                                КАК Период,
	|	&Организация                           КАК Организация,
	|	&Подразделение                         КАК Подразделение,
	|	ТаблицаНМА.НематериальныйАктив         КАК НематериальныйАктив,
	|
	|	ТаблицаНМА.Стоимость                   КАК Стоимость,
	|	ТаблицаНМА.СтоимостьРегл               КАК СтоимостьРегл,
	|	ВЫБОР КОГДА ВидыАктиваНУ.ВидАктиваНУ <> ЗНАЧЕНИЕ(Перечисление.ВидАктиваНУ.НеФиксированныйАктив) И &СнятьСУчетаПоНалогам
	|		ТОГДА 
	|			ВЫБОР КОГДА &СписыватьПоБалансовойСтоимости
	|				ТОГДА 
	|					ТаблицаНМА.СтоимостьРегл
	|				ИНАЧЕ
	|                   ТаблицаНМА.СтоимостьСписанияНУ
	|			КОНЕЦ
	|		ИНАЧЕ 0	
	| 	КОНЕЦ КАК СтоимостьНУ,
	|	ВЫБОР КОГДА ВидыАктиваНУ.ВидАктиваНУ = ЗНАЧЕНИЕ(Перечисление.ВидАктиваНУ.НеФиксированныйАктив)
	|		ТОГДА ТаблицаНМА.СтоимостьПР
	|				+ ТаблицаНМА.СтоимостьНУ
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &СнятьСУчетаПоНалогам
	|	           ТОГДА ТаблицаНМА.СтоимостьПР
	|			ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СтоимостьПР,
	|	ВЫБОР КОГДА ВидыАктиваНУ.ВидАктиваНУ = ЗНАЧЕНИЕ(Перечисление.ВидАктиваНУ.НеФиксированныйАктив)
	|		ТОГДА 
	|			ТаблицаНМА.СтоимостьВР
	|		ИНАЧЕ ВЫБОР КОГДА &СнятьСУчетаПоНалогам
	|			ТОГДА 
	|				ВЫБОР КОГДА &СписыватьПоБалансовойСтоимости
	|					ТОГДА ТаблицаНМА.СтоимостьВР
	|							- ТаблицаНМА.СтоимостьРегл
	|							+ ТаблицаНМА.СтоимостьНУ
	|	        	ИНАЧЕ ТаблицаНМА.СтоимостьРегл - ТаблицаНМА.СтоимостьСписанияНУ
	|						- ТаблицаНМА.СтоимостьПР
	|				КОНЕЦ
	|			ИНАЧЕ (ТаблицаНМА.СтоимостьРегл + ТаблицаНМА.СтоимостьЦФ)
	|		КОНЕЦ
	|	КОНЕЦ КАК СтоимостьВР,
	|	ТаблицаНМА.СтоимостьЦФ                 КАК СтоимостьЦФ,
	|	ТаблицаНМА.СтоимостьНУЦФ               КАК СтоимостьНУЦФ,
	|	ТаблицаНМА.СтоимостьПРЦФ               КАК СтоимостьПРЦФ,
	|	ТаблицаНМА.СтоимостьВРЦФ               КАК СтоимостьВРЦФ,
	|	0                                      КАК ПредварительнаяСтоимость,
	|	0                                      КАК ПредварительнаяСтоимостьРегл,
	|	0                                      КАК РезервПереоценкиСтоимости,
	|	0                                      КАК РезервПереоценкиСтоимостиРегл,
	|	
	|	ТаблицаНМА.ГруппаФинансовогоУчета      КАК ГруппаФинансовогоУчета,
	|	ТаблицаНМА.НаправлениеДеятельности     КАК НаправлениеДеятельности,
	|	&ХозяйственнаяОперацияСтоимость        КАК ХозяйственнаяОперация,
	|	&СтатьяРасходов                        КАК КорСтатьяРасходов,
	|	&АналитикаРасходов                     КАК КорАналитикаРасходов,
	|	&ОтражатьВРеглУчете                    КАК ОтражатьВРеглУчете,
	|	&ОтражатьВУпрУчете                     КАК ОтражатьВУпрУчете
	|,  АналитикаУчетаВА.КлючАналитики 		   КАК ВидАктиваИДвиженияСтоимостиНУ
	|ИЗ
	|	втОстаточнаяСтоимостьНМА КАК ТаблицаНМА
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТАналитикаУчетаВАВыбытие КАК АналитикаУчетаВА
	|		ПО ТаблицаНМА.НематериальныйАктив = АналитикаУчетаВА.ОбъектУчета
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыАктива КАК ВидыАктиваНУ
	|		ПО ТаблицаНМА.НематериальныйАктив = ВидыАктиваНУ.ОбъектУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|//Списание резерва переоценки
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)   КАК ВидДвижения,
	|	&Период                                  КАК Период,
	|	&Организация                             КАК Организация,
	|	&Подразделение                           КАК Подразделение,
	|	ТаблицаНМА.НематериальныйАктив           КАК НематериальныйАктив,
	|
	|	0                                        КАК Стоимость,
	|	0                                        КАК СтоимостьРегл,
	|	0                                        КАК СтоимостьНУ,
	|	0                                        КАК СтоимостьПР,
	|	0                                        КАК СтоимостьВР,
	|	0                                        КАК СтоимостьЦФ,
	|	0                                        КАК СтоимостьНУЦФ,
	|	0                                        КАК СтоимостьПРЦФ,
	|	0                                        КАК СтоимостьВРЦФ,
	|	0                                        КАК ПредварительнаяСтоимость,
	|	0                                        КАК ПредварительнаяСтоимостьРегл,
	|	ТаблицаНМА.РезервПереоценкиСтоимости     КАК РезервПереоценкиСтоимости,
	|	ТаблицаНМА.РезервПереоценкиСтоимостиРегл КАК РезервПереоценкиСтоимостиРегл,
	|	
	|	ТаблицаНМА.ГруппаФинансовогоУчета        КАК ГруппаФинансовогоУчета,
	|	ТаблицаНМА.НаправлениеДеятельности       КАК НаправлениеДеятельности,
	|	&ХозяйственнаяОперацияРезервСтоимость    КАК ХозяйственнаяОперация,
	|	&СтатьяРасходов                          КАК КорСтатьяРасходов,
	|	&АналитикаРасходов                       КАК КорАналитикаРасходов,
	|	&ОтражатьВРеглУчете                      КАК ОтражатьВРеглУчете,
	|	&ОтражатьВУпрУчете                       КАК ОтражатьВУпрУчете
	|, 	НЕОПРЕДЕЛЕНО						     КАК ВидАктиваИДвиженияСтоимостиНУ
	|ИЗ
	|	втСтоимостьСписанияНМА КАК ТаблицаНМА
	|ГДЕ
	|	ТаблицаНМА.РезервПереоценкиСтоимости <> 0
	|		ИЛИ ТаблицаНМА.РезервПереоценкиСтоимостиРегл <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|//Списание предварительной стоимости
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)    КАК ВидДвижения,
	|	&Период                                   КАК Период,
	|	&Организация                              КАК Организация,
	|	&Подразделение                            КАК Подразделение,
	|	ТаблицаНМА.НематериальныйАктив            КАК НематериальныйАктив,
	|
	|	0                                         КАК Стоимость,
	|	0                                         КАК СтоимостьРегл,
	|	0                                         КАК СтоимостьНУ,
	|	0                                         КАК СтоимостьПР,
	|	0                                         КАК СтоимостьВР,
	|	0                                         КАК СтоимостьЦФ,
	|	0                                         КАК СтоимостьНУЦФ,
	|	0                                         КАК СтоимостьПРЦФ,
	|	0                                         КАК СтоимостьВРЦФ,
	|	СтоимостьНМА.ПредварительнаяСтоимость     КАК ПредварительнаяСтоимость,
	|	СтоимостьНМА.ПредварительнаяСтоимостьРегл КАК ПредварительнаяСтоимостьРегл,
	|	0                                         КАК РезервПереоценкиСтоимости,
	|	0                                         КАК РезервПереоценкиСтоимостиРегл,
	|	
	|	ТаблицаНМА.ГруппаФинансовогоУчета         КАК ГруппаФинансовогоУчета,
	|	ТаблицаНМА.НаправлениеДеятельности        КАК НаправлениеДеятельности,
	|	&ХозяйственнаяОперация                    КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО                              КАК КорСтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО                              КАК КорАналитикаРасходов,
	|	&ОтражатьВРеглУчете                       КАК ОтражатьВРеглУчете,
	|	&ОтражатьВУпрУчете                        КАК ОтражатьВУпрУчете
	|, 	НЕОПРЕДЕЛЕНО                              КАК ВидАктиваИДвиженияСтоимостиНУ
	|ИЗ
	|	втТаблицаНМА КАК ТаблицаНМА
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтоимостьВНА КАК СтоимостьНМА
	|		ПО ТаблицаНМА.НематериальныйАктив = СтоимостьНМА.ОбъектУчета
	|			И СтоимостьНМА.Ссылка = &Ссылка
	|ГДЕ
	|	НЕ &ЧастичнаяЛиквидация
	|	И (СтоимостьНМА.ПредварительнаяСтоимость <> 0 ИЛИ СтоимостьНМА.ПредварительнаяСтоимостьРегл <> 0)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаВтИсходныеПрочиеРасходы(ТекстыЗапроса)
	
	ИмяРегистра = "ВтИсходныеПрочиеРасходы";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяРегистра, ТекстыЗапроса) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапросаТаблицаВтОстаточнаяСтоимостьНМА(ТекстыЗапроса);
	
	ТекстЗапроса = РегистрыНакопления.ПрочиеРасходы.ТекстОписаниеВтИсходныеПрочиеРасходы();
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() +
	"ВЫБРАТЬ
	|	&Период                                           КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)            КАК ВидДвижения,
	|	&Организация                                      КАК Организация,
	|	&Подразделение                                    КАК Подразделение,
	|	&СтатьяРасходов                                   КАК СтатьяРасходов,
	|	ДанныеДокумента.АналитикаРасходов                 КАК АналитикаРасходов,
	|	ТаблицаНМА.НаправлениеДеятельности                КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО                                      КАК ВидДеятельностиНДС,
	|	
	|	ТаблицаНМА.Стоимость                              КАК СуммаСНДС,
	|	ТаблицаНМА.Стоимость                              КАК СуммаБезНДС,
	|	ТаблицаНМА.Стоимость                              КАК СуммаБезНДСУпр,
	|	ТаблицаНМА.СтоимостьРегл + ТаблицаНМА.СтоимостьЦФ КАК СуммаСНДСРегл,
	|	ТаблицаНМА.СтоимостьРегл + ТаблицаНМА.СтоимостьЦФ КАК СуммаБезНДСРегл,
	|	ТаблицаНМА.СтоимостьПР + ТаблицаНМА.СтоимостьПРЦФ КАК ПостояннаяРазница,
	|	ТаблицаНМА.СтоимостьВР + ТаблицаНМА.СтоимостьВРЦФ КАК ВременнаяРазница,
	|	
	|	&ХозяйственнаяОперацияСтоимость                   КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО                                      КАК АналитикаУчетаНоменклатуры
	|
	|ИЗ
	|	втОстаточнаяСтоимостьНМА КАК ТаблицаНМА
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК ПВХСтатьиРасходов
	|		ПО &СтатьяРасходов = ПВХСтатьиРасходов.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеНМА2_4 КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = &Ссылка
	|ГДЕ
	|	ПВХСтатьиРасходов.ПринятиеКНалоговомуУчету = ИСТИНА
	|	И НЕ ПВХСтатьиРасходов.ВариантРаспределенияРасходовРегл В (
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|	)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период                                           КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)            КАК ВидДвижения,
	|	&Организация                                      КАК Организация,
	|	&Подразделение                                    КАК Подразделение,
	|	&СтатьяРасходов                                   КАК СтатьяРасходов,
	|	ДанныеДокумента.АналитикаРасходов                 КАК АналитикаРасходов,
	|	ТаблицаНМА.НаправлениеДеятельности                КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО                                      КАК ВидДеятельностиНДС,
	|
	|	ТаблицаНМА.Стоимость                              КАК СуммаСНДС,
	|	ТаблицаНМА.Стоимость                              КАК СуммаБезНДС,
	|	ТаблицаНМА.Стоимость                              КАК СуммаБезНДСУпр,
	|	ТаблицаНМА.СтоимостьРегл + ТаблицаНМА.СтоимостьЦФ КАК СуммаСНДСРегл,
	|	ТаблицаНМА.СтоимостьРегл + ТаблицаНМА.СтоимостьЦФ КАК СуммаБезНДСРегл,
	|	ТаблицаНМА.СтоимостьПР + ТаблицаНМА.СтоимостьПРЦФ КАК ПостояннаяРазница,
	|	0                                                 КАК ВременнаяРазница,
	|	
	|	&ХозяйственнаяОперацияСтоимость                   КАК ХозяйственнаяОперация,
	|	НЕОПРЕДЕЛЕНО                                      КАК АналитикаУчетаНоменклатуры
	|
	|ИЗ
	|	втОстаточнаяСтоимостьНМА КАК ТаблицаНМА
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК ПВХСтатьиРасходов
	|		ПО &СтатьяРасходов = ПВХСтатьиРасходов.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеНМА2_4 КАК ДанныеДокумента
	|		ПО ДанныеДокумента.Ссылка = &Ссылка
	|ГДЕ
	|	ПВХСтатьиРасходов.ПринятиеКНалоговомуУчету = ЛОЖЬ
	|	И НЕ ПВХСтатьиРасходов.ВариантРаспределенияРасходовРегл В (
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|	)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаВтПрочиеРасходы(ТекстыЗапроса)
	
	ИмяРегистра = "ВтПрочиеРасходы";
	
	Если Не ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВтИсходныеПрочиеРасходы", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтИсходныеПрочиеРасходы(ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = РегистрыНакопления.ПрочиеРасходы.ТекстЗапросаТаблицаВтПрочиеРасходы();
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаПрочиеРасходы(ТекстыЗапроса, Регистры = Неопределено)
	
	ИмяРегистра = "ПрочиеРасходы";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВтПрочиеРасходы", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтПрочиеРасходы(ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = РегистрыНакопления.ПрочиеРасходы.ТекстЗапросаТаблицаПрочиеРасходы();
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаВтИсходныеПартииПрочихРасходов(ТекстыЗапроса)
	
	ИмяРегистра = "ВтИсходныеПартииПрочихРасходов";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяРегистра, ТекстыЗапроса) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапросаТаблицаВтОстаточнаяСтоимостьНМА(ТекстыЗапроса);
	
	ТекстЗапроса = РегистрыНакопления.ПартииПрочихРасходов.ТекстОписаниеВтИсходныеПартииПрочихРасходов();
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении() +
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Организация КАК Организация,
	|	&Подразделение КАК Подразделение,
	|	&СтатьяРасходов КАК СтатьяРасходов,
	|	&АналитикаРасходов КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	&Ссылка КАК ДокументПоступленияРасходов,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка) КАК АналитикаУчетаПартий,
	|	ТаблицаРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ВидДеятельностиНДС,
	|	0 КАК Стоимость,
	|	0 КАК СтоимостьБезНДС,
	|	0 КАК НДСУпр,
	|	ТаблицаРасходы.СтоимостьРегл + ТаблицаРасходы.СтоимостьЦФ КАК СтоимостьРегл,
	|	0 КАК НДСРегл,
	|	0 КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ИЗ
	|	втОстаточнаяСтоимостьНМА КАК ТаблицаРасходы";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаВтПартииПрочихРасходов(ТекстыЗапроса)
	
	ИмяРегистра = "ВтПартииПрочихРасходов";
	
	Если Не ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВтИсходныеПартииПрочихРасходов", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтИсходныеПартииПрочихРасходов(ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = РегистрыНакопления.ПартииПрочихРасходов.ТекстЗапросаТаблицаВтПартииПрочихРасходов();
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаПартииПрочихРасходов(ТекстыЗапроса, Регистры = Неопределено)
	
	ИмяРегистра = "ПартииПрочихРасходов";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не ПроведениеСерверУТ.ЕстьТаблицаЗапроса("ВтПартииПрочихРасходов", ТекстыЗапроса) Тогда
		ТекстЗапросаТаблицаВтПартииПрочихРасходов(ТекстыЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = РегистрыНакопления.ПартииПрочихРасходов.ТекстЗапросаТаблицаПартииПрочихРасходов();
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ТекстЗапросаПрочиеДоходы(ТекстыЗапроса)

	ИмяРегистра = "ПрочиеДоходы";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяРегистра, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаТаблицаВтОстаточнаяСтоимостьНМА(ТекстыЗапроса);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Период                                КАК Период,
	|	&ХозяйственнаяОперацияСтоимость        КАК ХозяйственнаяОперация,
	|	&Организация                           КАК Организация,
	|	&Подразделение                         КАК Подразделение,
	|	ТаблицаНМА.НаправлениеДеятельности     КАК НаправлениеДеятельности,
	|
	|	ТаблицаНМА.СтатьяДоходов               КАК СтатьяДоходов,
	|	ТаблицаНМА.АналитикаДоходов            КАК АналитикаДоходов,
	|	
	|	ВЫБОР КОГДА ТаблицаНМА.СтоимостьЦФ = 0
	|		ТОГДА 1
	|		ИНАЧЕ ТаблицаНМА.Стоимость * ТаблицаНМА.СтоимостьРегл / ТаблицаНМА.СтоимостьЦФ
	|	КОНЕЦ                                   КАК Сумма,
	|	ТаблицаНМА.СтоимостьЦФ                  КАК СуммаРегл
	|
	|ИЗ
	|	втОстаточнаяСтоимостьНМА КАК ТаблицаНМА
	|ГДЕ
	|	&ИспользоватьУчетПрочихДоходовРасходов
	|	И ТаблицаНМА.СтоимостьЦФ <> 0";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

Процедура ТекстЗапросаПрочиеАктивыПассивы(ТекстыЗапроса)

	ИмяРегистра = "ПрочиеАктивыПассивы";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяРегистра, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаТаблицаВтОстаточнаяСтоимостьНМА(ТекстыЗапроса);
	ТекстЗапросаТаблицаВтАмортизацияСписанияНМА(ТекстыЗапроса);
	ТекстЗапросаТаблицаВтСтоимостьСписанияНМА(ТекстыЗапроса);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)  КАК ВидДвижения,
	|	&Период                                 КАК Период,
	|	&ХозяйственнаяОперацияСтоимость         КАК ХозяйственнаяОперация,
	|	&Организация                            КАК Организация,
	|	&Подразделение                          КАК Подразделение,
	|	ТаблицаНМА.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|
	|	&СтатьяРасходов                         КАК Статья,
	|	&АналитикаАктивовПассивов               КАК Аналитика,
	|
	|	ТаблицаНМА.Стоимость                    КАК Сумма
	|ИЗ
	|	втОстаточнаяСтоимостьНМА КАК ТаблицаНМА
	|ГДЕ
	|	ТаблицаНМА.Стоимость <> 0
	|	И ТИПЗНАЧЕНИЯ(&СтатьяРасходов) = ТИП(ПланВидовХарактеристик.СтатьиАктивовПассивов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Доходы от целевого финансирования
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)  КАК ВидДвижения,
	|	&Период                                 КАК Период,
	|	&ХозяйственнаяОперацияСтоимость         КАК ХозяйственнаяОперация,
	|	&Организация                            КАК Организация,
	|	&Подразделение                          КАК Подразделение,
	|	ТаблицаНМА.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|
	|	&СтатьяАП_НМА                           КАК Статья,
	|	ТаблицаНМА.НематериальныйАктив          КАК Аналитика,
	|
	|	ТаблицаНМА.АмортизацияЦФ                КАК Сумма
	|ИЗ
	|	втАмортизцияСписанияНМА КАК ТаблицаНМА
	|ГДЕ
	|	ТаблицаНМА.АмортизацияЦФ <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Резерв переоценки амортизации
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)  КАК ВидДвижения,
	|	&Период                                 КАК Период,
	|	&ХозяйственнаяОперацияРезервАмортизация КАК ХозяйственнаяОперация,
	|	&Организация                            КАК Организация,
	|	&Подразделение                          КАК Подразделение,
	|	ТаблицаНМА.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|
	|	&СтатьяАП_НМА                           КАК Статья,
	|	ТаблицаНМА.НематериальныйАктив          КАК Аналитика,
	|
	|	ТаблицаНМА.РезервПереоценкиАмортизации  КАК Сумма
	|ИЗ
	|	втАмортизцияСписанияНМА КАК ТаблицаНМА
	|ГДЕ
	|	ТаблицаНМА.РезервПереоценкиАмортизации <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Резерв переоценки стоимости
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)  КАК ВидДвижения,
	|	&Период                                 КАК Период,
	|	&ХозяйственнаяОперацияРезервСтоимость   КАК ХозяйственнаяОперация,
	|	&Организация                            КАК Организация,
	|	&Подразделение                          КАК Подразделение,
	|	ТаблицаНМА.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|
	|	&СтатьяАП_НМА                           КАК Статья,
	|	ТаблицаНМА.НематериальныйАктив          КАК Аналитика,
	|
	|	ТаблицаНМА.РезервПереоценкиСтоимости    КАК Сумма
	|ИЗ
	|	втСтоимостьСписанияНМА КАК ТаблицаНМА
	|ГДЕ
	|	ТаблицаНМА.РезервПереоценкиСтоимости <> 0";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

Процедура ТекстЗапросаДвиженияДоходыРасходыПрочиеАктивыПассивы(ТекстыЗапроса)

	ИмяРегистра = "ДвиженияДоходыРасходыПрочиеАктивыПассивы";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяРегистра, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаТаблицаВтОстаточнаяСтоимостьНМА(ТекстыЗапроса);
	
	ТекстЗапроса =
	"// Списание амортизации
	|ВЫБРАТЬ
	|	&Период                            КАК Период,
	|	&ХозяйственнаяОперацияАмортизация  КАК ХозяйственнаяОперация,
	|	&Организация                       КАК Организация,
	|
	|	&Подразделение                     КАК Подразделение,
	|	ТаблицаНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	&СтатьяАП_НМА                      КАК Статья,
	|	НЕОПРЕДЕЛЕНО                       КАК АналитикаДоходов,
	|	НЕОПРЕДЕЛЕНО                       КАК АналитикаРасходов,
	|	ТаблицаНМА.НематериальныйАктив     КАК АналитикаАктивовПассивов,
	|	ТаблицаНМА.ГруппаФинансовогоУчета  КАК ГруппаФинансовогоУчета,
	|
	|	&Подразделение                     КАК КорПодразделение,
	|	ТаблицаНМА.НаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	&СтатьяАП_НМА                      КАК КорСтатья,
	|	НЕОПРЕДЕЛЕНО                       КАК КорАналитикаДоходов,
	|	НЕОПРЕДЕЛЕНО                       КАК КорАналитикаРасходов,
	|	ТаблицаНМА.НематериальныйАктив     КАК КорАналитикаАктивовПассивов,
	|	ТаблицаНМА.ГруппаФинансовогоУчета  КАК КорГруппаФинансовогоУчета,
	|
	|	ТаблицаНМА.Амортизация             КАК Сумма,
	|	ТаблицаНМА.Амортизация             КАК СуммаУпр,
	|	ТаблицаНМА.АмортизацияРегл + ТаблицаНМА.АмортизацияЦФ КАК СуммаРегл
	|ИЗ
	|	втАмортизцияСписанияНМА КАК ТаблицаНМА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Списание остаточной стоимости
	|ВЫБРАТЬ
	|	&Период                            КАК Период,
	|	&ХозяйственнаяОперацияСтоимость    КАК ХозяйственнаяОперация,
	|	&Организация                       КАК Организация,
	|
	|	&Подразделение                     КАК Подразделение,
	|	ТаблицаНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	&СтатьяАП_НМА                      КАК Статья,
	|	НЕОПРЕДЕЛЕНО                       КАК АналитикаДоходов,
	|	НЕОПРЕДЕЛЕНО                       КАК АналитикаРасходов,
	|	ТаблицаНМА.НематериальныйАктив     КАК АналитикаАктивовПассивов,
	|	ТаблицаНМА.ГруппаФинансовогоУчета  КАК ГруппаФинансовогоУчета,
	|
	|	&Подразделение                     КАК КорПодразделение,
	|	ТаблицаНМА.НаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	&СтатьяРасходов                    КАК КорСтатья,
	|	НЕОПРЕДЕЛЕНО                       КАК КорАналитикаДоходов,
	|	&АналитикаРасходов                 КАК КорАналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО                       КАК КорАналитикаАктивовПассивов,
	|	ТаблицаНМА.ГруппаФинансовогоУчета  КАК КорГруппаФинансовогоУчета,
	|
	|	ТаблицаНМА.Стоимость               КАК Сумма,
	|	ТаблицаНМА.Стоимость               КАК СуммаУпр,
	|	ТаблицаНМА.СтоимостьРегл + ТаблицаНМА.СтоимостьЦФ КАК СуммаРегл
	|ИЗ
	|	втОстаточнаяСтоимостьНМА КАК ТаблицаНМА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Признание доходов от целевого финансирования
	|ВЫБРАТЬ
	|	&Период                            КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ДвижениеДоходовЗаСчетАктивовПассивов) КАК ХозяйственнаяОперация,
	|	&Организация                       КАК Организация,
	|
	|	&Подразделение                     КАК Подразделение,
	|	ТаблицаНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаНМА.СтатьяДоходов           КАК Статья,
	|	ТаблицаНМА.АналитикаДоходов        КАК АналитикаДоходов,
	|	НЕОПРЕДЕЛЕНО                       КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО                       КАК АналитикаАктивовПассивов,
	|	ТаблицаНМА.ГруппаФинансовогоУчета  КАК ГруппаФинансовогоУчета,
	|
	|	&Подразделение                     КАК КорПодразделение,
	|	ТаблицаНМА.НаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	&СтатьяАП_НМА                      КАК КорСтатья,
	|	НЕОПРЕДЕЛЕНО                       КАК КорАналитикаДоходов,
	|	НЕОПРЕДЕЛЕНО                       КАК КорАналитикаРасходов,
	|	ТаблицаНМА.НематериальныйАктив     КАК КорАналитикаАктивовПассивов,
	|	ТаблицаНМА.ГруппаФинансовогоУчета  КАК КорГруппаФинансовогоУчета,
	|
	|	ВЫБОР КОГДА ТаблицаНМА.СтоимостьЦФ = 0
	|		ТОГДА 1
	|		ИНАЧЕ ТаблицаНМА.Стоимость * ТаблицаНМА.СтоимостьРегл / ТаблицаНМА.СтоимостьЦФ
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР КОГДА ТаблицаНМА.СтоимостьЦФ = 0
	|		ТОГДА 1
	|		ИНАЧЕ ТаблицаНМА.Стоимость * ТаблицаНМА.СтоимостьРегл / ТаблицаНМА.СтоимостьЦФ
	|	КОНЕЦ КАК СуммаУпр,
	|	ТаблицаНМА.СтоимостьЦФ             КАК СуммаРегл
	|ИЗ
	|	втОстаточнаяСтоимостьНМА КАК ТаблицаНМА
	|ГДЕ
	|	ТаблицаНМА.СтоимостьЦФ <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Списание резерва переоценки амортизации НМА
	|ВЫБРАТЬ
	|	&Период                                 КАК Период,
	|	&ХозяйственнаяОперацияРезервАмортизация КАК ХозяйственнаяОперация,
	|	&Организация                            КАК Организация,
	|
	|	&Подразделение                          КАК Подразделение,
	|	ТаблицаНМА.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|	&СтатьяАП_НМА                           КАК Статья,
	|	НЕОПРЕДЕЛЕНО                            КАК АналитикаДоходов,
	|	НЕОПРЕДЕЛЕНО                            КАК АналитикаРасходов,
	|	ТаблицаНМА.НематериальныйАктив          КАК АналитикаАктивовПассивов,
	|	ТаблицаНМА.ГруппаФинансовогоУчета       КАК ГруппаФинансовогоУчета,
	|
	|	&Подразделение                          КАК КорПодразделение,
	|	ТаблицаНМА.НаправлениеДеятельности      КАК КорНаправлениеДеятельности,
	|	&СтатьяАП_ПрибыльУбытки                 КАК КорСтатья,
	|	НЕОПРЕДЕЛЕНО                            КАК КорАналитикаДоходов,
	|	НЕОПРЕДЕЛЕНО                            КАК КорАналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО                            КАК КорАналитикаАктивовПассивов,
	|	ТаблицаНМА.ГруппаФинансовогоУчета       КАК КорГруппаФинансовогоУчета,
	|
	|	ТаблицаНМА.РезервПереоценкиАмортизации  КАК Сумма,
	|	ТаблицаНМА.РезервПереоценкиАмортизации  КАК СуммаУпр,
	|	0                                       КАК СуммаРегл
	|ИЗ
	|	втАмортизцияСписанияНМА КАК ТаблицаНМА
	|ГДЕ
	|	ТаблицаНМА.РезервПереоценкиАмортизации <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Списание резерва переоценки стоимости НМА
	|ВЫБРАТЬ
	|	&Период                               КАК Период,
	|	&ХозяйственнаяОперацияРезервСтоимость КАК ХозяйственнаяОперация,
	|	&Организация                          КАК Организация,
	|
	|	&Подразделение                        КАК Подразделение,
	|	ТаблицаНМА.НаправлениеДеятельности    КАК НаправлениеДеятельности,
	|	&СтатьяАП_ПрибыльУбытки               КАК Статья,
	|	НЕОПРЕДЕЛЕНО                          КАК АналитикаДоходов,
	|	НЕОПРЕДЕЛЕНО                          КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО                          КАК АналитикаАктивовПассивов,
	|	ТаблицаНМА.ГруппаФинансовогоУчета     КАК ГруппаФинансовогоУчета,
	|
	|	&Подразделение                        КАК КорПодразделение,
	|	ТаблицаНМА.НаправлениеДеятельности    КАК КорНаправлениеДеятельности,
	|	&СтатьяАП_НМА                         КАК КорСтатья,
	|	НЕОПРЕДЕЛЕНО                          КАК КорАналитикаДоходов,
	|	НЕОПРЕДЕЛЕНО                          КАК КорАналитикаРасходов,
	|	ТаблицаНМА.НематериальныйАктив        КАК КорАналитикаАктивовПассивов,
	|	ТаблицаНМА.ГруппаФинансовогоУчета     КАК КорГруппаФинансовогоУчета,
	|
	|	ТаблицаНМА.РезервПереоценкиСтоимости  КАК Сумма,
	|	ТаблицаНМА.РезервПереоценкиСтоимости  КАК СуммаУпр,
	|	0                                     КАК СуммаРегл
	|ИЗ
	|	втСтоимостьСписанияНМА КАК ТаблицаНМА
	|ГДЕ
	|	ТаблицаНМА.РезервПереоценкиСтоимости <> 0";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

Процедура ТекстЗапросаТаблицаВтСтоимостьСписанияНМА(ТекстыЗапроса)

	ИмяТаблицы = "СтоимостьСписанияНМА";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаТаблицаВтТаблицаНМА(ТекстыЗапроса);
	
	ТекстЗапроса =
	"//Списание амортизации
	|ВЫБРАТЬ
	|	&Ссылка                                    КАК Ссылка,
	|	ТаблицаНМА.НематериальныйАктив             КАК НематериальныйАктив,
	|
	|	АмортизацияНМА.Амортизация                 КАК Стоимость,
	|	АмортизацияНМА.АмортизацияРегл             КАК СтоимостьРегл,
	|	АмортизацияНМА.АмортизацияНУ               КАК СтоимостьНУ,
	|	АмортизацияНМА.АмортизацияПР               КАК СтоимостьПР,
	|	АмортизацияНМА.АмортизацияВР               КАК СтоимостьВР,
	|	АмортизацияНМА.АмортизацияЦФ               КАК СтоимостьЦФ,
	|	АмортизацияНМА.АмортизацияНУЦФ             КАК СтоимостьНУЦФ,
	|	АмортизацияНМА.АмортизацияПРЦФ             КАК СтоимостьПРЦФ,
	|	АмортизацияНМА.АмортизацияВРЦФ             КАК СтоимостьВРЦФ,
	|	СтоимостьНМА.РезервПереоценкиСтоимости     КАК РезервПереоценкиСтоимости,
	|	СтоимостьНМА.РезервПереоценкиСтоимостиРегл КАК РезервПереоценкиСтоимостиРегл,
	|
	|	1                                          КАК ДоляСписания,
	|	1                                          КАК ДоляСписанияБУ,
	|	1                                          КАК ДоляСписанияНУ,
	|	
	|	ТаблицаНМА.ГруппаФинансовогоУчета          КАК ГруппаФинансовогоУчета,
	|	ТаблицаНМА.НаправлениеДеятельности         КАК НаправлениеДеятельности,
	|	ТаблицаНМА.СтатьяДоходов                   КАК СтатьяДоходов,
	|	ТаблицаНМА.АналитикаДоходов                КАК АналитикаДоходов
	|,	ТаблицаНМА.СтоимостьСписанияНУ		       КАК СтоимостьСписанияНУ
	|
	|ПОМЕСТИТЬ втСтоимостьСписанияНМА
	|ИЗ
	|	втТаблицаНМА КАК ТаблицаНМА
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтоимостьВНА КАК СтоимостьНМА
	|		ПО ТаблицаНМА.НематериальныйАктив = СтоимостьНМА.ОбъектУчета
	|		И СтоимостьНМА.Ссылка = &Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АмортизацияВНА КАК АмортизацияНМА
	|		ПО ТаблицаНМА.НематериальныйАктив = АмортизацияНМА.ОбъектУчета
	|		И АмортизацияНМА.Ссылка = &Ссылка
	|ГДЕ
	|	НЕ &ЧастичнаяЛиквидация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|//Списание частичной стоимости
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&Ссылка                    КАК Ссылка,
	|	ТаблицаНМА.НематериальныйАктив КАК НематериальныйАктив,
	|
	|	ТаблицаНМА.СуммаСписанияУУ  КАК Стоимость,
	|	ТаблицаНМА.СуммаСписанияБУ - ТаблицаНМА.СуммаСписанияБУ * СтоимостьНМА.ДоляЦФБУ КАК СтоимостьРегл,
	|	ТаблицаНМА.СуммаСписанияНУ - ТаблицаНМА.СуммаСписанияНУ * СтоимостьНМА.ДоляЦФНУ КАК СтоимостьНУ,
	|	ТаблицаНМА.СуммаСписанияПР - ТаблицаНМА.СуммаСписанияПР * СтоимостьНМА.ДоляЦФНУ КАК СтоимостьПР,
	|	(ТаблицаНМА.СуммаСписанияБУ - ТаблицаНМА.СуммаСписанияБУ * СтоимостьНМА.ДоляЦФБУ)
	|	- (ТаблицаНМА.СуммаСписанияНУ - ТаблицаНМА.СуммаСписанияНУ * СтоимостьНМА.ДоляЦФНУ)
	|	- (ТаблицаНМА.СуммаСписанияПР - ТаблицаНМА.СуммаСписанияПР * СтоимостьНМА.ДоляЦФНУ) КАК СтоимостьВР,
	|	ТаблицаНМА.СуммаСписанияБУ * СтоимостьНМА.ДоляЦФБУ КАК СтоимостьЦФ,
	|	ТаблицаНМА.СуммаСписанияНУ * СтоимостьНМА.ДоляЦФНУ КАК СтоимостьНУЦФ,
	|	ТаблицаНМА.СуммаСписанияПР * СтоимостьНМА.ДоляЦФНУ КАК СтоимостьПРЦФ,
	|	(ТаблицаНМА.СуммаСписанияБУ * СтоимостьНМА.ДоляЦФБУ)
	|	- (ТаблицаНМА.СуммаСписанияНУ * СтоимостьНМА.ДоляЦФНУ)
	|	- (ТаблицаНМА.СуммаСписанияПР * СтоимостьНМА.ДоляЦФНУ) КАК СтоимостьВРЦФ,
	|	
	|	СтоимостьНМА.РезервПереоценкиСтоимости
	|	* ВЫБОР КОГДА СтоимостьНМА.Стоимость ЕСТЬ NULL ИЛИ СтоимостьНМА.Стоимость = 0
	|		ТОГДА 1
	|		ИНАЧЕ ТаблицаНМА.СуммаСписанияУУ / СтоимостьНМА.Стоимость
	|	КОНЕЦ КАК РезервПереоценкиСтоимости,
	|	СтоимостьНМА.РезервПереоценкиСтоимостиРегл
	|	* ВЫБОР КОГДА СтоимостьНМА.Стоимость ЕСТЬ NULL ИЛИ СтоимостьНМА.Стоимость = 0
	|		ТОГДА 1
	|		ИНАЧЕ ТаблицаНМА.СуммаСписанияУУ / СтоимостьНМА.Стоимость
	|	КОНЕЦ КАК РезервПереоценкиСтоимостиРегл,
	|
	|	ВЫБОР КОГДА СтоимостьНМА.Стоимость ЕСТЬ NULL ИЛИ СтоимостьНМА.Стоимость = 0
	|		ТОГДА 1
	|		ИНАЧЕ ТаблицаНМА.СуммаСписанияУУ / СтоимостьНМА.Стоимость
	|	КОНЕЦ КАК ДоляСписания,
	|
	|	ВЫБОР КОГДА СтоимостьНМА.СтоимостьРегл ЕСТЬ NULL ИЛИ СтоимостьНМА.СтоимостьРегл = 0
	|		ТОГДА 1
	|		ИНАЧЕ (ТаблицаНМА.СуммаСписанияБУ - ТаблицаНМА.СуммаСписанияБУ * СтоимостьНМА.ДоляЦФБУ) / СтоимостьНМА.СтоимостьРегл
	|	КОНЕЦ КАК ДоляСписанияБУ,
	|
	|	ВЫБОР КОГДА СтоимостьНМА.СтоимостьНУ ЕСТЬ NULL ИЛИ СтоимостьНМА.СтоимостьНУ = 0
	|		ТОГДА 1
	|		ИНАЧЕ (ТаблицаНМА.СуммаСписанияНУ - ТаблицаНМА.СуммаСписанияНУ * СтоимостьНМА.ДоляЦФНУ) / СтоимостьНМА.СтоимостьНУ
	|	КОНЕЦ КАК ДоляСписанияНУ,
	|
	|	ТаблицаНМА.ГруппаФинансовогоУчета  КАК ГруппаФинансовогоУчета,
	|	ТаблицаНМА.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаНМА.СтатьяДоходов               КАК СтатьяДоходов,
	|	ТаблицаНМА.АналитикаДоходов            КАК АналитикаДоходов
	|,	ТаблицаНМА.СтоимостьСписанияНУ - ТаблицаНМА.СтоимостьСписанияНУ * СтоимостьНМА.ДоляЦФНУ КАК СтоимостьСписанияНУ
	|ИЗ
	|	втТаблицаНМА КАК ТаблицаНМА
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтоимостьВНА КАК СтоимостьНМА
	|		ПО ТаблицаНМА.НематериальныйАктив = СтоимостьНМА.ОбъектУчета
	|			И СтоимостьНМА.Ссылка = &Ссылка
	|ГДЕ
	|	&ЧастичнаяЛиквидация";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ТекстЗапросаТаблицаВтАмортизацияСписанияНМА(ТекстыЗапроса)

	ИмяТаблицы = "АмортизцияСписанияНМА";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаТаблицаВтСтоимостьСписанияНМА(ТекстыЗапроса);
	
	ТекстЗапроса =
	"//Списание амортизации
	|ВЫБРАТЬ
	|	&Ссылка                                        КАК Ссылка,
	|	ТаблицаНМА.НематериальныйАктив                 КАК НематериальныйАктив,
	|
	|	АмортизацияНМА.Амортизация                     КАК Амортизация,
	|	АмортизацияНМА.АмортизацияРегл                 КАК АмортизацияРегл,
	|	АмортизацияНМА.АмортизацияНУ                   КАК АмортизацияНУ,
	|	АмортизацияНМА.АмортизацияПР                   КАК АмортизацияПР,
	|	АмортизацияНМА.АмортизацияВР                   КАК АмортизацияВР,
	|	АмортизацияНМА.АмортизацияЦФ                   КАК АмортизацияЦФ,
	|	АмортизацияНМА.АмортизацияНУЦФ                 КАК АмортизацияНУЦФ,
	|	АмортизацияНМА.АмортизацияПРЦФ                 КАК АмортизацияПРЦФ,
	|	АмортизацияНМА.АмортизацияВРЦФ                 КАК АмортизацияВРЦФ,
	|	АмортизацияНМА.РезервПереоценкиАмортизации     КАК РезервПереоценкиАмортизации,
	|	АмортизацияНМА.РезервПереоценкиАмортизацииРегл КАК РезервПереоценкиАмортизацииРегл,
	|
	|	ТаблицаНМА.ГруппаФинансовогоУчета              КАК ГруппаФинансовогоУчета,
	|	ТаблицаНМА.НаправлениеДеятельности             КАК НаправлениеДеятельности,
	|	&ХозяйственнаяОперацияАмортизация              КАК ХозяйственнаяОперация
	|
	|ПОМЕСТИТЬ втАмортизцияСписанияНМА
	|ИЗ
	|	втТаблицаНМА КАК ТаблицаНМА
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АмортизацияВНА КАК АмортизацияНМА
	|		ПО АмортизацияНМА.ОбъектУчета = ТаблицаНМА.НематериальныйАктив
	|			И АмортизацияНМА.Ссылка = &Ссылка
	|ГДЕ
	|	НЕ &ЧастичнаяЛиквидация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|//Списание частичной амортизации
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&Ссылка                                                      КАК Ссылка,
	|	ТаблицаНМА.НематериальныйАктив                               КАК НематериальныйАктив,
	|
	|	АмортизацияНМА.Амортизация * ТаблицаНМА.ДоляСписания         КАК Амортизация,
	|	АмортизацияНМА.АмортизацияРегл * ТаблицаНМА.ДоляСписанияБУ   КАК АмортизацияРегл,
	|	АмортизацияНМА.АмортизацияНУ * ТаблицаНМА.ДоляСписанияНУ     КАК АмортизацияНУ,
	|	АмортизацияНМА.АмортизацияПР * ТаблицаНМА.ДоляСписанияНУ     КАК АмортизацияПР,
	|	АмортизацияНМА.АмортизацияРегл * ТаблицаНМА.ДоляСписанияБУ
	|	- АмортизацияНМА.АмортизацияНУ * ТаблицаНМА.ДоляСписанияНУ
	|	- АмортизацияНМА.АмортизацияПР * ТаблицаНМА.ДоляСписанияНУ   КАК АмортизацияВР,
	|	АмортизацияНМА.АмортизацияЦФ * ТаблицаНМА.ДоляСписанияБУ     КАК АмортизацияЦФ,
	|	АмортизацияНМА.АмортизацияНУЦФ * ТаблицаНМА.ДоляСписанияНУ   КАК АмортизацияНУЦФ,
	|	АмортизацияНМА.АмортизацияПРЦФ * ТаблицаНМА.ДоляСписанияНУ   КАК АмортизацияПРЦФ,
	|	АмортизацияНМА.АмортизацияЦФ * ТаблицаНМА.ДоляСписанияБУ
	|	- АмортизацияНМА.АмортизацияНУЦФ * ТаблицаНМА.ДоляСписанияНУ
	|	- АмортизацияНМА.АмортизацияПРЦФ * ТаблицаНМА.ДоляСписанияНУ КАК АмортизацияВРЦФ,
	|	АмортизацияНМА.РезервПереоценкиАмортизации                   КАК РезервПереоценкиАмортизации,
	|	АмортизацияНМА.РезервПереоценкиАмортизацииРегл               КАК РезервПереоценкиАмортизацииРегл,
	|
	|	ТаблицаНМА.ГруппаФинансовогоУчета                            КАК ГруппаФинансовогоУчета,
	|	ТаблицаНМА.НаправлениеДеятельности                           КАК НаправлениеДеятельности,
	|	&ХозяйственнаяОперацияАмортизация                            КАК ХозяйственнаяОперация
	|ИЗ
	|	ВТ_АмортизацияВНА КАК АмортизацияНМА
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСтоимостьСписанияНМА КАК ТаблицаНМА
	|		ПО АмортизацияНМА.ОбъектУчета = ТаблицаНМА.НематериальныйАктив
	|		И АмортизацияНМА.Ссылка = ТаблицаНМА.Ссылка
	|ГДЕ
	|	&ЧастичнаяЛиквидация";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ТекстЗапросаТаблицаВтОстаточнаяСтоимостьНМА(ТекстыЗапроса)

	ИмяТаблицы = "втОстаточнаяСтоимостьНМА";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаТаблицаВтАмортизацияСписанияНМА(ТекстыЗапроса);
	
	ТекстЗапроса =
	"//Списание остаточной стоимости
	|ВЫБРАТЬ
	|	&Ссылка                                                     КАК Ссылка,
	|	ТаблицаНМА.НематериальныйАктив                              КАК НематериальныйАктив,
	|
	|	ЕСТЬNULL(СтоимостьНМА.Стоимость, 0) - ЕСТЬNULL(АмортизацияНМА.Амортизация, 0)         КАК Стоимость,
	|	ЕСТЬNULL(СтоимостьНМА.СтоимостьРегл, 0) - ЕСТЬNULL(АмортизацияНМА.АмортизацияРегл, 0) КАК СтоимостьРегл,
	|	ЕСТЬNULL(СтоимостьНМА.СтоимостьНУ, 0) - ЕСТЬNULL(АмортизацияНМА.АмортизацияНУ, 0)     КАК СтоимостьНУ,
	|	ЕСТЬNULL(СтоимостьНМА.СтоимостьПР, 0) - ЕСТЬNULL(АмортизацияНМА.АмортизацияПР, 0)     КАК СтоимостьПР,
	|	ЕСТЬNULL(СтоимостьНМА.СтоимостьВР, 0) - ЕСТЬNULL(АмортизацияНМА.АмортизацияВР, 0)     КАК СтоимостьВР,
	|	ЕСТЬNULL(СтоимостьНМА.СтоимостьЦФ, 0) - ЕСТЬNULL(АмортизацияНМА.АмортизацияЦФ, 0)     КАК СтоимостьЦФ,
	|	ЕСТЬNULL(СтоимостьНМА.СтоимостьНУЦФ, 0) - ЕСТЬNULL(АмортизацияНМА.АмортизацияНУЦФ, 0) КАК СтоимостьНУЦФ,
	|	ЕСТЬNULL(СтоимостьНМА.СтоимостьПРЦФ, 0) - ЕСТЬNULL(АмортизацияНМА.АмортизацияПРЦФ, 0) КАК СтоимостьПРЦФ,
	|	ЕСТЬNULL(СтоимостьНМА.СтоимостьВРЦФ, 0) - ЕСТЬNULL(АмортизацияНМА.АмортизацияВРЦФ, 0) КАК СтоимостьВРЦФ,
	|
	|	ТаблицаНМА.ГруппаФинансовогоУчета                           КАК ГруппаФинансовогоУчета,
	|	ТаблицаНМА.НаправлениеДеятельности                          КАК НаправлениеДеятельности,
	|	ТаблицаНМА.СтатьяДоходов                                    КАК СтатьяДоходов,
	|	ТаблицаНМА.АналитикаДоходов                                 КАК АналитикаДоходов
	|,	ТаблицаНМА.СтоимостьСписанияНУ								КАК СтоимостьСписанияНУ
	|
	|ПОМЕСТИТЬ втОстаточнаяСтоимостьНМА
	|ИЗ
	|	втТаблицаНМА КАК ТаблицаНМА
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтоимостьВНА КАК СтоимостьНМА
	|		ПО ТаблицаНМА.НематериальныйАктив = СтоимостьНМА.ОбъектУчета
	|		И СтоимостьНМА.Ссылка = &Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АмортизацияВНА КАК АмортизацияНМА
	|		ПО ТаблицаНМА.НематериальныйАктив = АмортизацияНМА.ОбъектУчета
	|		И АмортизацияНМА.Ссылка = &Ссылка
	|ГДЕ
	|	НЕ &ЧастичнаяЛиквидация
	|	И (ЕСТЬNULL(СтоимостьНМА.Стоимость, 0) - ЕСТЬNULL(АмортизацияНМА.Амортизация, 0) <> 0
	|		ИЛИ ЕСТЬNULL(СтоимостьНМА.СтоимостьРегл, 0) - ЕСТЬNULL(АмортизацияНМА.АмортизацияРегл, 0) <> 0
	|		ИЛИ ЕСТЬNULL(СтоимостьНМА.СтоимостьНУ, 0) - ЕСТЬNULL(АмортизацияНМА.АмортизацияНУ, 0) <> 0
	|		ИЛИ ЕСТЬNULL(СтоимостьНМА.СтоимостьПР, 0) - ЕСТЬNULL(АмортизацияНМА.АмортизацияПР, 0) <> 0
	|		ИЛИ ЕСТЬNULL(СтоимостьНМА.СтоимостьВР, 0) - ЕСТЬNULL(АмортизацияНМА.АмортизацияВР, 0) <> 0
	|		ИЛИ ЕСТЬNULL(СтоимостьНМА.СтоимостьЦФ, 0) - ЕСТЬNULL(АмортизацияНМА.АмортизацияЦФ, 0) <> 0
	|		ИЛИ ЕСТЬNULL(СтоимостьНМА.СтоимостьНУЦФ, 0) - ЕСТЬNULL(АмортизацияНМА.АмортизацияНУЦФ, 0) <> 0
	|		ИЛИ ЕСТЬNULL(СтоимостьНМА.СтоимостьПРЦФ, 0) - ЕСТЬNULL(АмортизацияНМА.АмортизацияПРЦФ, 0) <> 0
	|		ИЛИ ЕСТЬNULL(СтоимостьНМА.СтоимостьВРЦФ, 0) - ЕСТЬNULL(АмортизацияНМА.АмортизацияВРЦФ, 0) <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|//Частичное списание остаточной стоимости
	|ВЫБРАТЬ
	|	&Ссылка                                                   КАК Ссылка,
	|	ТаблицаНМА.НематериальныйАктив                            КАК НематериальныйАктив,
	|
	|	ТаблицаНМА.Стоимость - ЕСТЬNULL(АмортизацияНМА.Амортизация, 0)         КАК Стоимость,
	|	ТаблицаНМА.СтоимостьРегл - ЕСТЬNULL(АмортизацияНМА.АмортизацияРегл, 0) КАК СтоимостьРегл,
	|	ТаблицаНМА.СтоимостьНУ - ЕСТЬNULL(АмортизацияНМА.АмортизацияНУ, 0)     КАК СтоимостьНУ,
	|	ТаблицаНМА.СтоимостьПР - ЕСТЬNULL(АмортизацияНМА.АмортизацияПР, 0)     КАК СтоимостьПР,
	|	ТаблицаНМА.СтоимостьВР - ЕСТЬNULL(АмортизацияНМА.АмортизацияВР, 0)     КАК СтоимостьВР,
	|	ТаблицаНМА.СтоимостьЦФ - ЕСТЬNULL(АмортизацияНМА.АмортизацияЦФ, 0)     КАК СтоимостьЦФ,
	|	ТаблицаНМА.СтоимостьНУЦФ - ЕСТЬNULL(АмортизацияНМА.АмортизацияНУЦФ, 0) КАК СтоимостьНУЦФ,
	|	ТаблицаНМА.СтоимостьПРЦФ - ЕСТЬNULL(АмортизацияНМА.АмортизацияПРЦФ, 0) КАК СтоимостьПРЦФ,
	|	ТаблицаНМА.СтоимостьВРЦФ - ЕСТЬNULL(АмортизацияНМА.АмортизацияВРЦФ, 0) КАК СтоимостьВРЦФ,
	|
	|	ТаблицаНМА.ГруппаФинансовогоУчета                         КАК ГруппаФинансовогоУчета,
	|	ТаблицаНМА.НаправлениеДеятельности                        КАК НаправлениеДеятельности,
	|	ТаблицаНМА.СтатьяДоходов                                  КАК СтатьяДоходов,
	|	ТаблицаНМА.АналитикаДоходов                               КАК АналитикаДоходов
	|,	ТаблицаНМА.СтоимостьСписанияНУ								КАК СтоимостьСписанияНУ
	|ИЗ
	|	втСтоимостьСписанияНМА КАК ТаблицаНМА
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ втАмортизцияСписанияНМА КАК АмортизацияНМА
	|		ПО ТаблицаНМА.НематериальныйАктив = АмортизацияНМА.НематериальныйАктив
	|ГДЕ
	|	&ЧастичнаяЛиквидация
	|	И (ТаблицаНМА.Стоимость - ЕСТЬNULL(АмортизацияНМА.Амортизация, 0) <> 0
	|		ИЛИ ТаблицаНМА.СтоимостьРегл - ЕСТЬNULL(АмортизацияНМА.АмортизацияРегл, 0) <> 0
	|		ИЛИ ТаблицаНМА.СтоимостьНУ - ЕСТЬNULL(АмортизацияНМА.АмортизацияНУ, 0) <> 0
	|		ИЛИ ТаблицаНМА.СтоимостьПР - ЕСТЬNULL(АмортизацияНМА.АмортизацияПР, 0) <> 0
	|		ИЛИ ТаблицаНМА.СтоимостьВР - ЕСТЬNULL(АмортизацияНМА.АмортизацияВР, 0) <> 0
	|		ИЛИ ТаблицаНМА.СтоимостьЦФ - ЕСТЬNULL(АмортизацияНМА.АмортизацияЦФ, 0) <> 0
	|		ИЛИ ТаблицаНМА.СтоимостьНУЦФ - ЕСТЬNULL(АмортизацияНМА.АмортизацияНУЦФ, 0) <> 0
	|		ИЛИ ТаблицаНМА.СтоимостьПРЦФ - ЕСТЬNULL(АмортизацияНМА.АмортизацияПРЦФ, 0) <> 0
	|		ИЛИ ТаблицаНМА.СтоимостьВРЦФ - ЕСТЬNULL(АмортизацияНМА.АмортизацияВРЦФ, 0) <> 0)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Процедура ТекстЗапросаТаблицаВтТаблицаНМА(ТекстыЗапроса)
	
	ИмяТаблицы = "ТаблицаНМА";
	
	Если ПроведениеСерверУТ.ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВнеоборотныеАктивыСлужебный.ТекстЗапросаТаблицаВтСписокНМА(ТекстыЗапроса, ПолноеИмяОбъекта());
	
	Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// Временная таблица ТаблицаНМА
	|"+
	"ВЫБРАТЬ
	|	ТаблицаНМА.НомерСтроки                 КАК НомерСтроки,
	|	ТаблицаНМА.НематериальныйАктив         КАК НематериальныйАктив,
	|
	|	ПорядокУчета.ГруппаФинансовогоУчета    КАК ГруппаФинансовогоУчета,
	|	ПорядокУчета.НаправлениеДеятельности   КАК НаправлениеДеятельности,
	|	ПорядокУчета.ОбъемНаработки            КАК ОбъемНаработки,
	|
	|	МестоУчетаНМА.Организация              КАК Организация,
	|	МестоУчетаНМА.Подразделение            КАК Подразделение,
	|
	|	ПараметрыЦелевогоФинансированияНМА.СтатьяДоходов    КАК СтатьяДоходов,
	|	ПараметрыЦелевогоФинансированияНМА.АналитикаДоходов КАК АналитикаДоходов,
	|
	|	ТаблицаНМА.СуммаСписанияУУ             КАК СуммаСписанияУУ,
	|	ТаблицаНМА.СуммаСписанияБУ             КАК СуммаСписанияБУ,
	|	ТаблицаНМА.СуммаСписанияНУ             КАК СуммаСписанияНУ,
	|	ТаблицаНМА.СуммаСписанияПР             КАК СуммаСписанияПР,
	|	ТаблицаНМА.СуммаСписанияВР             КАК СуммаСписанияВР
	|,	ТаблицаНМА.СтоимостьСписанияНУ         КАК СтоимостьСписанияНУ
	|	
	|ПОМЕСТИТЬ втТаблицаНМА
	|ИЗ
	|	Документ.СписаниеНМА2_4.НМА КАК ТаблицаНМА
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаНМА.СрезПоследних(
	|				&Период, 
	|				Организация = &Организация 
	|					И НематериальныйАктив В (ВЫБРАТЬ Т.НематериальныйАктив ИЗ втСписокНМА КАК Т)
	|		) КАК ПорядокУчета
	|		ПО ТаблицаНМА.НематериальныйАктив = ПорядокУчета.НематериальныйАктив
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоУчетаНМА.СрезПоследних(
	|				&Период,
	|				Регистратор <> &Ссылка
	|					И Организация = &Организация
	|					И НематериальныйАктив В (ВЫБРАТЬ Т.НематериальныйАктив ИЗ втСписокНМА КАК Т)
	|		) КАК МестоУчетаНМА
	|		ПО ТаблицаНМА.НематериальныйАктив = МестоУчетаНМА.НематериальныйАктив
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииНМАУУ.СрезПоследних(
	|				&Период,
	|				Регистратор <> &Ссылка
	|					И Организация = &Организация
	|					И НематериальныйАктив В (ВЫБРАТЬ Т.НематериальныйАктив ИЗ втСписокНМА КАК Т)
	|		) КАК ПараметрыАмортизацииУУ
	|		ПО ТаблицаНМА.НематериальныйАктив = ПараметрыАмортизацииУУ.НематериальныйАктив
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЦелевогоФинансированияНМА.СрезПоследних(
	|				&Период,
	|				Регистратор <> &Ссылка
	|					И НематериальныйАктив В (ВЫБРАТЬ Т.НематериальныйАктив ИЗ втСписокНМА КАК Т)
	|		) КАК ПараметрыЦелевогоФинансированияНМА
	|		ПО ТаблицаНМА.НематериальныйАктив = ПараметрыЦелевогоФинансированияНМА.НематериальныйАктив
	|ГДЕ
	|	ТаблицаНМА.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(Текст, ИмяТаблицы, Ложь);
	
КонецПроцедуры

Функция ПолноеИмяОбъекта()

	Возврат "Документ.СписаниеНМА2_4";

КонецФункции

Процедура СоздатьКлючиАналитикиУчетаВА() Экспорт
	
	//создадим ключи в видом движения стоимости "Выбытие", "СписаниеНакопленнойАмортизации" для каждого вида актива
	ВидыАктива = Новый Массив;
	
	ВидыАктива.Добавить(Перечисления.ВидАктиваНУ.ФиксированныйАктив);
	ВидыАктива.Добавить(Перечисления.ВидАктиваНУ.НеФиксированныйАктив);
	ВидыАктива.Добавить(Перечисления.ВидАктиваНУ.ФиксированныйАктивУчитываемыйОтдельно);
	
	ВидыДвижений = Новый Массив;
	ВидыДвижений.Добавить(Перечисления.ВидыДвиженияСтоимостиФА.Выбытие);
	ВидыДвижений.Добавить(Перечисления.ВидыДвиженияСтоимостиФА.СписаниеНакопленнойАмортизации);
	
	УчетФиксированныхАктивов.СоздатьКлючиАналитикиУчетаВА(ВидыАктива, ВидыДвижений);
	
КонецПроцедуры

#КонецОбласти

#Область ПроведениеПоРеглУчету

Функция ТекстЗапросаВТОтраженияВРеглУчете() Экспорт
	
	Возврат "";
	
КонецФункции

Функция ТекстОтраженияВРеглУчете() Экспорт
	
	ТекстыЗапроса = Новый Массив;
	
	#Область СписаниеСтоимостиНаРасходы
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Списание остаточной стоимости НМА \ Частичная ликвидация остаточной стоимости НМА (Дт СчетРасходов:: Кт СчетУчета)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьРегл КАК Сумма,
	|	Строки.Стоимость КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ВЫБОР КОГДА СтатьиСтроительства.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	КОНЕЦ КАК ВидСчетаДт,
	|	Строки.КорСтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	
	|	Строки.НематериальныйАктив КАК СубконтоДт1,
	|	Строки.ВидАктиваИДвиженияСтоимостиНУ КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СтоимостьНУ КАК СуммаНУДт,
	|	Строки.СтоимостьПР КАК СуммаПРДт,
	|	Строки.СтоимостьВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	
	|	Строки.НематериальныйАктив КАК СубконтоКт1,
	|	Строки.ВидАктиваИДвиженияСтоимостиНУ КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.СтоимостьНУ КАК СуммаНУКт,
	|	Строки.СтоимостьПР КАК СуммаПРКт,
	|	Строки.СтоимостьВР КАК СуммаВРКт,
	|	
	|	ВЫБОР КОГДА Операция.ЧастичнаяЛиквидация
	|		ТОГДА ""Частичная ликвидация остаточной стоимости НМА""
	|		ИНАЧЕ ""Списание остаточной стоимости НМА""
	|	КОНЕЦ КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеНМА2_4 КАК Операция
	|		ПО Операция.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьНМА КАК Строки
	|		ПО ДокументыКОтражению.Ссылка = Строки.Регистратор
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО Строки.КорСтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	
	|ГДЕ
	|	Строки.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеСтоимостиНМА)
	|	И Строки.КорСтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	И (Строки.Стоимость <> 0
	|		ИЛИ Строки.СтоимостьРегл <> 0
	|		ИЛИ Строки.СтоимостьНУ <> 0
	|		ИЛИ Строки.СтоимостьПР <> 0
	|		ИЛИ Строки.СтоимостьВР <> 0)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область СписаниеСтоимостиНаСтатьиАктивовПассивов
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Списание остаточной стоимости НМА \ Частичная ликвидация остаточной стоимости НМА (Дт СчетРасходов:: Кт СчетУчета)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьРегл КАК Сумма,
	|	Строки.Стоимость КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	Операция.СчетУчета КАК СчетДт,
	|
	|	Операция.Субконто1 КАК СубконтоДт1,
	|	Операция.Субконто2 КАК СубконтоДт2,
	|	Операция.Субконто3 КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СтоимостьНУ КАК СуммаНУДт,
	|	Строки.СтоимостьПР КАК СуммаПРДт,
	|	Строки.СтоимостьВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	
	|	Строки.НематериальныйАктив КАК СубконтоКт1,
	|	Строки.ВидАктиваИДвиженияСтоимостиНУ КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.СтоимостьНУ КАК СуммаНУКт,
	|	Строки.СтоимостьПР КАК СуммаПРКт,
	|	Строки.СтоимостьВР КАК СуммаВРКт,
	|	
	|	ВЫБОР КОГДА Операция.ЧастичнаяЛиквидация
	|		ТОГДА ""Частичная ликвидация остаточной стоимости НМА""
	|		ИНАЧЕ ""Списание остаточной стоимости НМА""
	|	КОНЕЦ КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеНМА2_4 КАК Операция
	|		ПО Операция.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьНМА КАК Строки
	|		ПО ДокументыКОтражению.Ссылка = Строки.Регистратор
	|	
	|ГДЕ
	|	Строки.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеСтоимостиНМА)
	|	И Операция.СтатьяРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|	И (Строки.Стоимость <> 0
	|		ИЛИ Строки.СтоимостьРегл <> 0
	|		ИЛИ Строки.СтоимостьНУ <> 0
	|		ИЛИ Строки.СтоимостьПР <> 0
	|		ИЛИ Строки.СтоимостьВР <> 0)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область СписаниеСтоимостиЦФНаРасходы
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Списание остаточной стоимости НМА \ Частичная ликвидация остаточной стоимости НМА (Дт СчетРасходов:: Кт СчетУчета)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ВЫБОР КОГДА СтатьиСтроительства.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеОперации)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы)
	|	КОНЕЦ КАК ВидСчетаДт,
	|	Строки.КорСтатьяРасходов КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	
	|	Строки.НематериальныйАктив КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СтоимостьНУЦФ КАК СуммаНУДт,
	|	Строки.СтоимостьПРЦФ КАК СуммаПРДт,
	|	Строки.СтоимостьВРЦФ КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА_ЦФ) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	
	|	Строки.НематериальныйАктив КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.СтоимостьНУЦФ КАК СуммаНУКт,
	|	Строки.СтоимостьПРЦФ КАК СуммаПРКт,
	|	Строки.СтоимостьВРЦФ КАК СуммаВРКт,
	|	
	|	ВЫБОР КОГДА Операция.ЧастичнаяЛиквидация
	|		ТОГДА ""Частичная ликвидация целевых средств в остаточной стоимости НМА""
	|		ИНАЧЕ ""Списание целевых средств в остаточной стоимости НМА на расходы""
	|	КОНЕЦ КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеНМА2_4 КАК Операция
	|		ПО Операция.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьНМА КАК Строки
	|		ПО ДокументыКОтражению.Ссылка = Строки.Регистратор
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиСтроительства
	|	ПО Строки.КорСтатьяРасходов = СтатьиСтроительства.Ссылка
	|		И СтатьиСтроительства.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПрочиеАктивы)
	|	
	|ГДЕ
	|	Строки.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеСтоимостиНМА)
	|	И Строки.КорСтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	И (Строки.СтоимостьЦФ <> 0
	|		ИЛИ Строки.СтоимостьНУЦФ <> 0
	|		ИЛИ Строки.СтоимостьПРЦФ <> 0
	|		ИЛИ Строки.СтоимостьВРЦФ <> 0)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область СписаниеСтоимостиЦФНаСтатьиАктивовПассивов
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Списание остаточной стоимости НМА \ Частичная ликвидация остаточной стоимости НМА (Дт СчетРасходов:: Кт СчетУчета)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПрочиеАктивыПассивы) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	Операция.СчетУчета КАК СчетДт,
	|
	|	Операция.Субконто1 КАК СубконтоДт1,
	|	Операция.Субконто2 КАК СубконтоДт2,
	|	Операция.Субконто3 КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СтоимостьНУЦФ КАК СуммаНУДт,
	|	Строки.СтоимостьПРЦФ КАК СуммаПРДт,
	|	Строки.СтоимостьВРЦФ КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА_ЦФ) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	
	|	Строки.НематериальныйАктив КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.СтоимостьНУЦФ КАК СуммаНУКт,
	|	Строки.СтоимостьПРЦФ КАК СуммаПРКт,
	|	Строки.СтоимостьВРЦФ КАК СуммаВРКт,
	|	
	|	ВЫБОР КОГДА Операция.ЧастичнаяЛиквидация
	|		ТОГДА ""Частичная ликвидация целевых средств в остаточной стоимости НМА""
	|		ИНАЧЕ ""Списание целевых средств в остаточной стоимости НМА на расходы""
	|	КОНЕЦ КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеНМА2_4 КАК Операция
	|		ПО Операция.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьНМА КАК Строки
	|		ПО ДокументыКОтражению.Ссылка = Строки.Регистратор
	|	
	|ГДЕ
	|	Строки.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеСтоимостиНМА)
	|	И Операция.СтатьяРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|	И (Строки.СтоимостьЦФ <> 0
	|		ИЛИ Строки.СтоимостьНУЦФ <> 0
	|		ИЛИ Строки.СтоимостьПРЦФ <> 0
	|		ИЛИ Строки.СтоимостьВРЦФ <> 0)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область СписаниеНакопленнойАмортизации
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Списание накопленной амортизации НМА (Дт СчетНачисленияАмортизации:: Кт СчетУчета)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.АмортизацияРегл КАК Сумма,
	|	Строки.Амортизация КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АмортизацияВНА) КАК ВидСчетаДт,
	|	Строки.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	
	|	Строки.НематериальныйАктив КАК СубконтоДт1,
	|	Строки.ВидАктиваИДвиженияСтоимостиНУ КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.АмортизацияНУ КАК СуммаНУДт,
	|	Строки.АмортизацияПР КАК СуммаПРДт,
	|	Строки.АмортизацияВР КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	
	|	Строки.НематериальныйАктив КАК СубконтоКт1,
	|	Строки.ВидАктиваИДвиженияСтоимостиНУ КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.АмортизацияНУ КАК СуммаНУКт,
	|	Строки.АмортизацияПР КАК СуммаПРКт,
	|	Строки.АмортизацияВР КАК СуммаВРКт,
	|	
	|	ВЫБОР КОГДА Операция.ЧастичнаяЛиквидация
	|		ТОГДА ""Частичная ликвидация накопленной амортизации""
	|		ИНАЧЕ ""Списание начисленной амортизации""
	|	КОНЕЦ КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеНМА2_4 КАК Операция
	|		ПО Операция.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияНМА КАК Строки
	|		ПО ДокументыКОтражению.Ссылка = Строки.Регистратор
	|	
	|ГДЕ
	|	(Строки.Амортизация <> 0
	|		ИЛИ Строки.АмортизацияРегл <> 0
	|		ИЛИ Строки.АмортизацияНУ <> 0
	|		ИЛИ Строки.АмортизацияПР <> 0
	|		ИЛИ Строки.АмортизацияВР <> 0)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область СписаниеНакопленнойАмортизацииЦФ
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Списание накопленной амортизации НМА (Дт СчетНачисленияАмортизации:: Кт СчетУчета)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	Строки.АмортизацияЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АмортизацияВНА_ЦФ) КАК ВидСчетаДт,
	|	Строки.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	
	|	Строки.НематериальныйАктив КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.АмортизацияНУЦФ КАК СуммаНУДт,
	|	Строки.АмортизацияПРЦФ КАК СуммаПРДт,
	|	Строки.АмортизацияВРЦФ КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.СтоимостьВНА_ЦФ) КАК ВидСчетаКт,
	|	Строки.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	
	|	Строки.НематериальныйАктив КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.АмортизацияНУЦФ КАК СуммаНУКт,
	|	Строки.АмортизацияПРЦФ КАК СуммаПРКт,
	|	Строки.АмортизацияВРЦФ КАК СуммаВРКт,
	|	
	|	ВЫБОР КОГДА Операция.ЧастичнаяЛиквидация
	|		ТОГДА ""Частичная ликвидация накопленной амортизации""
	|		ИНАЧЕ ""Списание начисленной амортизации""
	|	КОНЕЦ КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеНМА2_4 КАК Операция
	|		ПО Операция.Ссылка = ДокументыКОтражению.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияНМА КАК Строки
	|		ПО ДокументыКОтражению.Ссылка = Строки.Регистратор
	|	
	|ГДЕ
	|	(Строки.АмортизацияЦФ <> 0
	|		ИЛИ Строки.АмортизацияНУЦФ <> 0
	|		ИЛИ Строки.АмортизацияПРЦФ <> 0
	|		ИЛИ Строки.АмортизацияВРЦФ <> 0)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область СписаниеДоходыОтЦелевогоФинансирования
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Признание доходов от целевого финансирования (Дт 98 :: Кт 91)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	"""" КАК ИдентификаторСтроки,
	|	
	|	Строки.СтоимостьЦФ КАК Сумма,
	|	0 КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходыБудущихПериодовОтЦелевогоФинансированияНМА) КАК СчетДт,
	|	Строки.НематериальныйАктив КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	Строки.СтоимостьНУЦФ + Строки.СтоимостьПРЦФ + Строки.СтоимостьВРЦФ КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Доходы) КАК ВидСчетаКт,
	|	ПараметрыЦФ.СтатьяДоходов КАК АналитикаУчетаКт,
	|	Строки.КорПодразделение КАК МестоУчетаКт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ПараметрыЦФ.СтатьяДоходов КАК СубконтоКт1,
	|	ПараметрыЦФ.АналитикаДоходов КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	Строки.СтоимостьНУЦФ + Строки.СтоимостьПРЦФ + Строки.СтоимостьВРЦФ КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	/////////////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	""Признание доходов от целевого финансирования при списании остаточной стоимости"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьНМА КАК Строки
	|		ПО ДокументыКОтражению.Ссылка = Строки.Регистратор
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЦелевогоФинансированияНМА КАК ПараметрыЦФ
	|		ПО Строки.НематериальныйАктив = ПараметрыЦФ.НематериальныйАктив
	|ГДЕ
	|	Строки.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеСтоимостиНМА)
	|	И (Строки.СтоимостьЦФ <> 0
	|		ИЛИ Строки.СтоимостьНУЦФ <> 0
	|		ИЛИ Строки.СтоимостьПРЦФ <> 0
	|		ИЛИ Строки.СтоимостьВРЦФ <> 0)";

	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	#Область СписаниеРезерваДооценки
	
	ТекстЗапроса =
	"////////////////////////////////////////////////////////////////////////////////////////////////////
	|// Списание резерва доценки (Дт 83.01 :: Кт 84.01)
	|ВЫБРАТЬ
	|	
	|	Строки.Регистратор КАК Ссылка,
	|	Строки.Период КАК Период,
	|	Строки.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|	
	|	ВЫБОР 
	|		КОГДА Строки.РезервПереоценкиСтоимостиРегл > 0
	|			ТОГДА Строки.РезервПереоценкиСтоимостиРегл - ЕСТЬNULL(АмортизацияНМА.РезервПереоценкиАмортизацииРегл, 0)
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР 
	|		КОГДА Строки.РезервПереоценкиСтоимости > 0
	|			ТОГДА Строки.РезервПереоценкиСтоимости - ЕСТЬNULL(АмортизацияНМА.РезервПереоценкиАмортизации, 0)
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК СуммаУУ,
	|	
	|	// Дт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РезервДоОценкиВНА) КАК ВидСчетаДт,
	|	Строки.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	Строки.Подразделение КАК МестоУчетаДт,
	|	
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Строки.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.НематериальныйАктив КАК СубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	ВЫБОР 
	|		КОГДА Строки.РезервПереоценкиСтоимостиРегл > 0
	|			ТОГДА Строки.РезервПереоценкиСтоимостиРегл - ЕСТЬNULL(АмортизацияНМА.РезервПереоценкиАмортизацииРегл, 0)
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	// Кт ///////////////////////////////////////////////////////////////////////////////////////////
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	Строки.Подразделение КАК ПодразделениеКт,
	|	Строки.НематериальныйАктив.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НераспределеннаяПрибыльНепокрытыйУбытокОтчетногоГода) КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	ВЫБОР 
	|		КОГДА Строки.РезервПереоценкиСтоимостиРегл > 0
	|			ТОГДА Строки.РезервПереоценкиСтоимостиРегл - ЕСТЬNULL(АмортизацияНМА.РезервПереоценкиАмортизацииРегл, 0)
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	
	|	""Списание резерва по переоценке"" КАК Содержание
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьНМА КАК Строки
	|		ПО ДокументыКОтражению.Ссылка = Строки.Регистратор
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияНМА КАК АмортизацияНМА
	|	ПО АмортизацияНМА.Регистратор = Строки.Регистратор
	|		И АмортизацияНМА.НематериальныйАктив = Строки.НематериальныйАктив
	|		И (АмортизацияНМА.РезервПереоценкиАмортизацииРегл > 0
	|			ИЛИ АмортизацияНМА.РезервПереоценкиАмортизации > 0)
	|ГДЕ
	|	Строки.РезервПереоценкиСтоимости > 0
	|		ИЛИ Строки.РезервПереоценкиСтоимостиРегл > 0";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	#КонецОбласти
	
	Возврат СтрСоединить(ТекстыЗапроса, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
КонецФункции

#КонецОбласти

#Область Печать

Процедура СоздатьВременныеТаблицыРегистров(МВТ, МассивОбъектов)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// 1. Определим "границы" регистров сведений - список организаций, ОС, период, ...
	//    чтобы ограничить выборку из регистров сведений
	Запрос = Новый Запрос(
		"
		|// 1. Период дат
		|ВЫБРАТЬ
		|	МИНИМУМ(Док.Дата)  КАК ДатаОТ,
		|	МАКСИМУМ(Док.Дата) КАК ДатаДО
		|ИЗ
		|	Документ.СписаниеНМА2_4 КАК Док
		|ГДЕ
		|	Док.Ссылка В (&МассивОбъектов)
		|;
		|
		|// 2. Список организаций
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Док.Организация КАК Организация
		|ИЗ
		|	Документ.СписаниеНМА2_4 КАК Док
		|ГДЕ
		|	Док.Ссылка В (&МассивОбъектов)
		|;
		|
		|// 3. Список НМА
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Док.НематериальныйАктив КАК НематериальныйАктив
		|ИЗ
		|	Документ.СписаниеНМА2_4.НМА КАК Док
		|ГДЕ
		|	Док.Ссылка В (&МассивОбъектов)
		|
		|");
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Результат = Запрос.ВыполнитьПакет();
	// 1.1. Интервал дат
	Выборка = Результат[0].Выбрать(ОбходРезультатаЗапроса.Прямой);
	Выборка.Следующий();
	ДатаОТ = Выборка.ДатаОТ;
	ДатаДО = Выборка.ДатаДО;
	
	// 1.2. Список организаций
	МассивОрганизаций = Результат[1].Выгрузить(ОбходРезультатаЗапроса.Прямой).ВыгрузитьКолонку("Организация");
	
	// 1.3. Список НМА
	МассивНМА = Результат[2].Выгрузить(ОбходРезультатаЗапроса.Прямой).ВыгрузитьКолонку("НематериальныйАктив");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаНМА.Ссылка КАК Ссылка,
	|	ТаблицаНМА.НематериальныйАктив КАК НематериальныйАктив
	|ПОМЕСТИТЬ ВТ_ВсеНМА
	|ИЗ
	|	Документ.СписаниеНМА2_4.НМА КАК ТаблицаНМА
	|ГДЕ
	|	ТаблицаНМА.Ссылка В(&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Рег1.Период КАК Период,
	|	МИНИМУМ(Рег2.Период) КАК ПервыйПериод,
	|	Рег1.НематериальныйАктив КАК НематериальныйАктив
	|ПОМЕСТИТЬ ВТ_ПервоначальныеСведенияНМА_Рег2
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияНМА КАК Рег1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияНМА КАК Рег2
	|		ПО Рег1.НематериальныйАктив = Рег2.НематериальныйАктив
	|			И Рег1.Период < Рег2.Период
	|ГДЕ
	|	Рег1.Период <= &ДатаДО
	|	И Рег1.НематериальныйАктив В(&МассивНМА)
	|	И Рег2.Период <= &ДатаДО
	|	И Рег2.НематериальныйАктив В(&МассивНМА)
	|
	|СГРУППИРОВАТЬ ПО
	|	Рег1.Период,
	|	Рег1.НематериальныйАктив
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Рег1.Период,
	|	Рег1.НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Рег2.ПервыйПериод ЕСТЬ NULL 
	|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(Рег2.ПервыйПериод, СЕКУНДА, -1)
	|	КОНЕЦ КАК ДатаОкончания,
	|	Рег1.Период КАК ДатаНачала,
	|	Рег1.НематериальныйАктив КАК НематериальныйАктив,
	|	Рег1.Организация КАК Организация,
	|	"""" КАК ИнвентарныйНомер,
	|	Рег1.СпособПоступления КАК СпособПоступления,
	|	Рег1.ПервоначальнаяСтоимостьБУ КАК ПервоначальнаяСтоимость,
	|	Рег1.МетодНачисленияАмортизацииБУ КАК СпособНачисленияАмортизации,
	|	0 КАК ПоказательНаработки,
	|	0 КАК ПорядокПогашенияСтоимости
	|ПОМЕСТИТЬ ВТ_ПервоначальныеСведенияНМА
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияНМА КАК Рег1
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервоначальныеСведенияНМА_Рег2 КАК Рег2
	|		ПО Рег1.НематериальныйАктив = Рег2.НематериальныйАктив
	|			И Рег1.Период = Рег2.Период
	|ГДЕ
	|	Рег1.Период <= &ДатаДО
	|	И Рег1.НематериальныйАктив В(&МассивНМА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДатаНачала,
	|	ДатаОкончания,
	|	НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Рег1.Период КАК Период,
	|	МИНИМУМ(Рег2.Период) КАК ПервыйПериод,
	|	Рег1.Организация КАК Организация,
	|	Рег1.НематериальныйАктив КАК НематериальныйАктив
	|ПОМЕСТИТЬ ВТ_ПорядокУчетаНМА_Рег2
	|ИЗ
	|	РегистрСведений.ПорядокУчетаНМА КАК Рег1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаНМА КАК Рег2
	|		ПО Рег1.НематериальныйАктив = Рег2.НематериальныйАктив
	|			И Рег1.Организация = Рег2.Организация
	|			И Рег1.Период < Рег2.Период
	|ГДЕ
	|	Рег1.Период <= &ДатаДО
	|	И Рег1.Организация В(&МассивОрганизаций)
	|	И Рег1.НематериальныйАктив В(&МассивНМА)
	|	И Рег2.Период <= &ДатаДО
	|	И Рег2.Организация В(&МассивОрганизаций)
	|	И Рег2.НематериальныйАктив В(&МассивНМА)
	|
	|СГРУППИРОВАТЬ ПО
	|	Рег1.Период,
	|	Рег1.Организация,
	|	Рег1.НематериальныйАктив
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Рег1.Период,
	|	Рег1.Организация,
	|	Рег1.НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Рег2.ПервыйПериод ЕСТЬ NULL 
	|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(Рег2.ПервыйПериод, СЕКУНДА, -1)
	|	КОНЕЦ КАК ДатаОкончания,
	|	Рег1.Период КАК ДатаНачала,
	|	Рег1.Организация КАК Организация,
	|	Рег1.НематериальныйАктив КАК НематериальныйАктив,
	|	Рег1.ГруппаФинансовогоУчета.СчетУчета КАК СчетУчета,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетНачисленияИзноса,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетНачисленияАмортизации,
	|	Рег1.ГруппаФинансовогоУчета.СчетУчетаАмортизации КАК СчетНачисленияИзносаАмортизации
	|ПОМЕСТИТЬ ВТ_ПорядокУчетаНМА
	|ИЗ
	|	РегистрСведений.ПорядокУчетаНМА КАК Рег1
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокУчетаНМА_Рег2 КАК Рег2
	|		ПО Рег1.НематериальныйАктив = Рег2.НематериальныйАктив
	|			И Рег1.Организация = Рег2.Организация
	|			И Рег1.Период = Рег2.Период
	|ГДЕ
	|	Рег1.Период <= &ДатаДО
	|	И Рег1.Организация В(&МассивОрганизаций)
	|	И Рег1.НематериальныйАктив В(&МассивНМА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДатаНачала,
	|	ДатаОкончания,
	|	Организация,
	|	НематериальныйАктив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор,
	|	ХозрасчетныйОборотыДтКт.СчетКт КАК СчетКт,
	|	ХозрасчетныйОборотыДтКт.СубконтоКт1 КАК СубконтоКт1,
	|	ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаОборот
	|ПОМЕСТИТЬ ВТ_СтоимостьНМА
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(ДОБАВИТЬКДАТЕ(&ДатаОТ, СЕКУНДА, -1), ДОБАВИТЬКДАТЕ(&ДатаДО, СЕКУНДА, 1), Регистратор, , , , ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НематериальныеАктивы), Организация В (&МассивОрганизаций)) КАК ХозрасчетныйОборотыДтКт
	|ГДЕ
	|	ХозрасчетныйОборотыДтКт.Регистратор В(&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	СчетКт,
	|	СубконтоКт1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор,
	|	ХозрасчетныйОборотыДтКт.СчетДт КАК СчетДт,
	|	ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК СубконтоДт1,
	|	ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаОборот
	|ПОМЕСТИТЬ ВТ_АмортизацияНМА
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(ДОБАВИТЬКДАТЕ(&ДатаОТ, СЕКУНДА, -1), ДОБАВИТЬКДАТЕ(&ДатаДО, СЕКУНДА, 1), Регистратор, , ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НематериальныеАктивы), , , Организация В (&МассивОрганизаций)) КАК ХозрасчетныйОборотыДтКт
	|ГДЕ
	|	ХозрасчетныйОборотыДтКт.Регистратор В(&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	СчетДт,
	|	СубконтоДт1
	|;
	|";

	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.УстановитьПараметр("ДатаОТ", ДатаОТ);
	Запрос.УстановитьПараметр("ДатаДО", ДатаДО);
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("МассивОрганизаций", МассивОрганизаций);
	Запрос.УстановитьПараметр("МассивНМА", МассивНМА);
	
	Запрос.Выполнить();
		
КонецПроцедуры

Функция ДанныеПечатнойФормыОС4(МассивОбъектов) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	СоздатьВременныеТаблицыРегистров(МенеджерВременныхТаблиц, МассивОбъектов);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНМА.Ссылка КАК Ссылка,
	|	ТаблицаНМА.Ссылка.Номер КАК Номер,
	|	ТаблицаНМА.Ссылка.Дата КАК Дата,
	|	"""" КАК Состояние,
	|	"""" КАК ПричинаСписания,
	|	ТаблицаНМА.Ссылка.Организация КАК Организация,
	|	ТаблицаНМА.Ссылка.Подразделение КАК ПодразделениеОрганизации,
	|	ТаблицаНМА.Ссылка.МоментВремени КАК МоментВремени,
	|	1 КАК НомерСтроки,
	|	ТаблицаНМА.НематериальныйАктив КАК ОС,
	|	"""" КАК ЗаводскойНомер,
	|	ЛОЖЬ КАК Автотранспорт,
	|	"""" КАК ГодВыпуска,
	|	ВЫБОР
	|		КОГДА ТаблицаНМА.НематериальныйАктив.НаименованиеПолное = """"
	|			ТОГДА ТаблицаНМА.НематериальныйАктив.Наименование
	|		ИНАЧЕ ТаблицаНМА.НематериальныйАктив.НаименованиеПолное
	|	КОНЕЦ КАК НаимОС,
	|	ВТ_ПервоначальныеСведенияНМА.ПервоначальнаяСтоимость КАК НачСтоимость,
	|	"""" КАК ИнвНомер,
	|	0 КАК ПорядокПогашенияСтоимости,
	|	"""" КАК Подразделение,
	|	ТаблицаНМА.Ссылка.Ответственный КАК МОЛ,
	|	ЕСТЬNULL(ВТ_СтоимостьНМА.СуммаОборот, 0) - ЕСТЬNULL(ВТ_АмортизацияНМА.СуммаОборот, 0) КАК БалансоваяСтоимость,
	|	ЕСТЬNULL(ВТ_АмортизацияНМА.СуммаОборот, 0) КАК НачАмортизация,
	|	NULL КАК ДрагоценныеМатериалы,
	|	ВТ_ПервоначальныеСведенияНМА.ДатаНачала КАК ДатаВводаВЭксплуатацию
	|ИЗ
	|	Документ.СписаниеНМА2_4.НМА КАК ТаблицаНМА
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПервоначальныеСведенияНМА КАК ВТ_ПервоначальныеСведенияНМА
	|		ПО (ТаблицаНМА.Ссылка.Дата МЕЖДУ ВТ_ПервоначальныеСведенияНМА.ДатаНачала И ВТ_ПервоначальныеСведенияНМА.ДатаОкончания)
	|			И ТаблицаНМА.НематериальныйАктив = ВТ_ПервоначальныеСведенияНМА.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокУчетаНМА КАК ВТ_ПорядокУчетаНМА
	|		ПО (ТаблицаНМА.Ссылка.Дата МЕЖДУ ВТ_ПорядокУчетаНМА.ДатаНачала И ВТ_ПорядокУчетаНМА.ДатаОкончания)
	|			И ТаблицаНМА.Ссылка.Организация = ВТ_ПорядокУчетаНМА.Организация
	|			И ТаблицаНМА.НематериальныйАктив = ВТ_ПорядокУчетаНМА.НематериальныйАктив
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтоимостьНМА КАК ВТ_СтоимостьНМА
	|		ПО (ВТ_ПорядокУчетаНМА.СчетУчета = ВТ_СтоимостьНМА.СчетКт)
	|			И ТаблицаНМА.Ссылка = ВТ_СтоимостьНМА.Регистратор
	|			И ТаблицаНМА.НематериальныйАктив = ВТ_СтоимостьНМА.СубконтоКт1
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АмортизацияНМА КАК ВТ_АмортизацияНМА
	|		ПО (ВТ_ПорядокУчетаНМА.СчетНачисленияИзносаАмортизации = ВТ_АмортизацияНМА.СчетДт)
	|			И ТаблицаНМА.Ссылка = ВТ_АмортизацияНМА.Регистратор
	|			И ТаблицаНМА.НематериальныйАктив = ВТ_АмортизацияНМА.СубконтоДт1
	|ГДЕ
	|	ТаблицаНМА.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаНМА.Ссылка.Дата,
	|	ТаблицаНМА.Ссылка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	
	Пакет = Запрос.ВыполнитьПакет();
	
	Возврат Новый Структура(
		"ПоДокументам, ПоПрочимОприходованиям",		
		Пакет[0],  
		Неопределено);

	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли