
Функция ВерсияФорматаВыгрузки(Знач НаДату = Неопределено, ВыбраннаяФорма = Неопределено) Экспорт
	
	Возврат Перечисления.ВерсииФорматовВыгрузки.ВерсияРПН;//Версия500;
	
КонецФункции

Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(254));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  	20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 	5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 	5);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета1002016Кв4";
	НоваяФорма.ОписаниеОтчета     = "Декларация по корпоративному подоходному налогу. Версия шаблона ФНО для ИС СОНО: 100.00.v25.r87 от 24.12.2015 г.";
	НоваяФорма.ДатаНачалоДействия = '20160101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20161231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета1002017Кв4";
	НоваяФорма.ОписаниеОтчета     = "Декларация по корпоративному подоходному налогу. Версия шаблона ФНО для ИС СОНО: 100.00.v26.r88 от 29.12.2016 г.";
	НоваяФорма.ДатаНачалоДействия = '20170101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20171231';

	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета1002018Кв4";
	НоваяФорма.ОписаниеОтчета     = "Декларация по корпоративному подоходному налогу. Версия шаблона ФНО для ИС СОНО: 100.00.v27.r90 от 28.06.2018 г.";
	НоваяФорма.ДатаНачалоДействия = '20180101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20181231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета1002019Кв4";
	НоваяФорма.ОписаниеОтчета     = "Декларация по корпоративному подоходному налогу. Версия шаблона ФНО для ИС СОНО: 100.00.v28.r103 от 15.09.2020 г.";
	НоваяФорма.ДатаНачалоДействия = '20190101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20191231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета1002020Кв4";
	НоваяФорма.ОписаниеОтчета     = "Декларация по корпоративному подоходному налогу. Версия шаблона ФНО для ИС СОНО: 100.00.v28.r104 от 21.12.2020 г.";
	НоваяФорма.ДатаНачалоДействия = '20200101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));

	Возврат ТаблицаФормОтчета;
	
КонецФункции