#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВариантыОтчетов

// Настройки вариантов этого отчета.
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//   	подробнее см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
// 	 ОписаниеОтчета - СтрокаДереваЗначений - Настройки отчета и настройки "по умолчанию".
//	 	подробнее см. ВариантыОтчетов.ОписаниеОтчета().
//
Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт
	
	ВариантыОтчетовУТПереопределяемый.ОтключитьОтчет(ОписаниеОтчета);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

// Формирует отчет, результат помещается во врменное хранилище
Процедура СформироватьОтчет(ПараметрыОтчета, АдресХранилища) Экспорт
	
	Результат = Новый ТабличныйДокумент;
	
	Если ПараметрыОтчета.ВариантФормирования = 0 Тогда
		НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности[0];
		ЦелевыеПараметры = Справочники.НаправленияДеятельности.ЦелевыеПараметрыКонтрактаГОЗ(НаправлениеДеятельности);
		ПараметрыОтчета.Вставить("ЦелевыеПараметры", ЦелевыеПараметры);
	КонецЕсли;
	
	ЕстьЦелевыеПараметры = Ложь;
	Если ПараметрыОтчета.ВариантФормирования = 0 Тогда
		ЕстьЦелевыеПараметры = Истина
	КонецЕсли;
	ПараметрыОтчета.Вставить("ЕстьЦелевыеПараметры", ЕстьЦелевыеПараметры);
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.Период) Тогда
		ПараметрыОтчета.Период = КонецДня(ПараметрыОтчета.Период);
	КонецЕсли;
	
	ЕстьДанныеНаДатуЗавершения = Ложь;
	ДатаПроверки = ?(ЗначениеЗаполнено(ПараметрыОтчета.Период), ПараметрыОтчета.Период, ТекущаяДатаСеанса());
	Если ЕстьЦелевыеПараметры 
		 И ЗначениеЗаполнено(ЦелевыеПараметры.ДатаЗавершения) 
		 И ДатаПроверки > ЦелевыеПараметры.ДатаЗавершения Тогда
		ЕстьДанныеНаДатуЗавершения = Истина;
	КонецЕсли;
	ПараметрыОтчета.Вставить("ЕстьДанныеНаДатуЗавершения", ЕстьДанныеНаДатуЗавершения);
	
	Колонки = Новый Структура;
	Если ЕстьЦелевыеПараметры Тогда
		Колонки.Вставить("ЦелевыеПараметры", 0);
		Если ЕстьДанныеНаДатуЗавершения Тогда
			Колонки.Вставить("ПроцентВыполненияНаДатуЗавершения", 0);
			Колонки.Вставить("СальдоНаДатуЗавершения", 0);
		КонецЕсли;
		Колонки.Вставить("ПроцентВыполненияНаТекущуюДату", 0);
	КонецЕсли;
	Колонки.Вставить("СальдоНаТекущуюДату", 0);
	Колонки.Вставить("Обороты", 0);
	ПараметрыОтчета.Вставить("Колонки", Колонки);
	
	Если ПараметрыОтчета.ПредставлениеСумм = Перечисления.ВидыПредставленияЧисел.БезИзменений Тогда
		Формат = "ЧДЦ=2";
	Иначе
		Формат = "ЧДЦ=0";
	КонецЕсли;
	ПараметрыОтчета.Вставить("ФорматСумм", Формат);
	
	// Получение макета
	Макет = Отчеты.ИсполнениеКонтрактовГОЗ.ПолучитьМакет("ИсполнениеКонтрактов");
	
	ВывестиШапкуОтчета(Результат, ПараметрыОтчета, Макет);
	ВывестиШапкуТаблицы(Результат, ПараметрыОтчета, Макет);
	ВывестиСтрокиТаблицы(Результат, ПараметрыОтчета, Макет);
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища)
	
КонецПроцедуры

Процедура ВывестиШапкуОтчета(Результат, ПараметрыОтчета, Макет)
	
	Область = Макет.ПолучитьОбласть("Шапка");
	
	Область.Параметры.НаправленияДеятельности = СтрСоединить(ПараметрыОтчета.ОтборНаправленияДеятельности, ", ");
	
	Период = ?(ЗначениеЗаполнено(ПараметрыОтчета.Период), ПараметрыОтчета.Период, ТекущаяДатаСеанса());
	Область.Параметры.Период = Формат(Период, "ДЛФ=D");
	Результат.Вывести(Область);
	
КонецПроцедуры

Процедура ВывестиШапкуТаблицы(Результат, ПараметрыОтчета, Макет)
	
	Область = Макет.ПолучитьОбласть("ТаблицаШапка|Показатели");
	Результат.Вывести(Область, 0);
	Для каждого Колонка Из ПараметрыОтчета.Колонки Цикл
		Область = Макет.ПолучитьОбласть("ТаблицаШапка|" + Колонка.Ключ);
		ПараметрыОбласти = Новый Структура;
		Если ПараметрыОтчета.ПредставлениеСумм = Перечисления.ВидыПредставленияЧисел.БезИзменений Тогда
			ПараметрыОбласти.Вставить("ПредставлениеСумм", "руб.");
		ИначеЕсли ПараметрыОтчета.ПредставлениеСумм = Перечисления.ВидыПредставленияЧисел.ВТысячах Тогда
			ПараметрыОбласти.Вставить("ПредставлениеСумм", "тыс. руб.");
		ИначеЕсли ПараметрыОтчета.ПредставлениеСумм = Перечисления.ВидыПредставленияЧисел.ВМиллионах Тогда
			ПараметрыОбласти.Вставить("ПредставлениеСумм", "млн. руб.");
		КонецЕсли;
		Область.Параметры.Заполнить(ПараметрыОбласти);
		Результат.Присоединить(Область, Колонка.Значение);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиСтрокиТаблицы(Результат, ПараметрыОтчета, Макет)
	
	ОбластьТаблицаСтроки = Макет.ПолучитьОбласть("ТаблицаСтроки");
	
	// Получение данных
	ПравилаРасчетаПоказателей = ТаблицаПравилРасчетаПоказателей(ПараметрыОтчета);
	ДанныеПоказателей = ПолучениеДанных(ПараметрыОтчета, ПравилаРасчетаПоказателей);
	
	Результат.НачатьАвтогруппировкуСтрок();
	Для каждого ОбластьСтрока Из ОбластьТаблицаСтроки.Области Цикл
		
		Если СтрДлина(ОбластьСтрока.Имя) <> 4 Тогда
			Продолжить;
		КонецЕсли;
		
		КодСтроки = Прав(ОбластьСтрока.Имя, 3);
		// Определим уровень группировки исходя из кода ячейки
		Если Прав(КодСтроки, 2) = "00" Тогда
			Уровень = 1;
		ИначеЕсли Прав(КодСтроки, 1) = "0" Тогда 
			Уровень = 2;
		Иначе
			Уровень = 3;
		КонецЕсли;
		
		Раздел = Лев(КодСтроки, 1);
		Если Раздел = "1" ИЛИ Раздел = "2" ИЛИ Раздел = "3" ИЛИ Раздел = "5" Тогда 
			Ресурсы = ДанныеЗаполнениеСрокОсновныхРазделов(КодСтроки, ПараметрыОтчета, ПравилаРасчетаПоказателей, ДанныеПоказателей);
		ИначеЕсли Раздел = "4" Тогда
			Ресурсы = ДанныеЗаполнениеСтрокиВводаВыводаСредств(ПараметрыОтчета, ДанныеПоказателей);
		КонецЕсли;
		
		#Область СтрокаПоказатель
		ПараметрыРасшифровки = Новый Структура;
		ПараметрыРасшифровки.Вставить("РасшифровкаЦелевыеПараметры", "ЦелевыеПараметры");
		
		Область = Макет.ПолучитьОбласть(ОбластьСтрока.Имя + "|Показатели"); 
		Область.ТекущаяОбласть.Расшифровка = КодСтроки;
		Результат.Вывести(Область, Уровень);
		Для каждого Колонка Из ПараметрыОтчета.Колонки Цикл
			Область = Макет.ПолучитьОбласть(ОбластьСтрока.Имя + "|" + Колонка.Ключ);
			УстановитьСвойстваЯчеек(Область, ПараметрыОтчета);
			Область.Параметры.Заполнить(Ресурсы);
			Область.Параметры.Заполнить(ПараметрыРасшифровки);
			Результат.Присоединить(Область, Колонка.Значение);
		КонецЦикла;
		
		#КонецОбласти
		
		#Область Детализация
		
		Если НЕ (ПараметрыОтчета.Детализация = "ДоРегистратора" ИЛИ ПараметрыОтчета.Детализация = "ДоОборотов") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Уровень <> 3 ИЛИ НЕ (Раздел = "1" ИЛИ Раздел = "2" ИЛИ Раздел = "3") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПараметрыОтчета.Детализация = "ДоРегистратора" Тогда
			Ресурсы.ТаблицаПоПоказателю.Индексы.Добавить("Период, Регистратор");
			Ресурсы.ТаблицаПоПоказателю.Сортировать("Период, Регистратор");
		КонецЕсли;
		
		Для каждого Строка Из Ресурсы.ТаблицаПоПоказателю Цикл
			
			ИмяОбласти = ПараметрыОтчета.Детализация;
			Если ПараметрыОтчета.ЕстьДанныеНаДатуЗавершения Тогда
				ИмяОбласти = ИмяОбласти + "ЕстьДанныеНаДатуЗавершения"; 
			ИначеЕсли ПараметрыОтчета.ЕстьЦелевыеПараметры Тогда
				ИмяОбласти = ИмяОбласти + "ЕстьЦелевыеПараметры"; 
			КонецЕсли;
			
			Область = Макет.ПолучитьОбласть(ИмяОбласти); 
		
			Правило = ПравилаРасчетаПоказателей.Найти(Строка.КодПоказателя, "КодПоказателя");
			
			Область.Параметры.Заполнить(Строка);
			
			ПараметрыРасшифровки = ПараметрыРасшифровки(ПараметрыОтчета.Детализация, Правило, Строка);
			Область.Параметры.Заполнить(ПараметрыРасшифровки);
			
			Результат.Вывести(Область, Уровень + 1);
			
		КонецЦикла;
		
		#КонецОбласти
	
	КонецЦикла;
	
	Результат.ЗакончитьАвтогруппировкуСтрок();
	
КонецПроцедуры

#КонецОбласти

Функция ДанныеЗаполнениеСрокОсновныхРазделов(КодСтроки, ПараметрыОтчета, ПравилаРасчетаПоказателей, ДанныеПоказателей)
	
	Ресурсы = Новый Структура;
	
	Ресурсы.Вставить("ЦелевоеЗначение", 0);
	
	Ресурсы.Вставить("ОборотДт_НД", 0);
	Ресурсы.Вставить("ОборотДт_ГОЗ", 0);
	Ресурсы.Вставить("ОборотДт_Ввод", 0);
	
	Ресурсы.Вставить("ОборотКт_НД", 0);
	Ресурсы.Вставить("ОборотКт_ГОЗ", 0);
	Ресурсы.Вставить("ОборотКт_Вывод", 0);
	
	Ресурсы.Вставить("СальдоНаТекущуюДату", 0);
	Ресурсы.Вставить("ВыполнениеНаТекущуюДату", 0);
	Ресурсы.Вставить("СальдоНаДатуЗавершения", 0);
	Ресурсы.Вставить("ВыполнениеНаДатуЗавершения", 0);
	
	// Определим уровень группировки исходя из кода ячейки
	Если Прав(КодСтроки, 2) = "00" Тогда
		ПолеГруппировки = "ГруппаПоказателей1";
	ИначеЕсли Прав(КодСтроки, 1) = "0" Тогда 
		ПолеГруппировки = "ГруппаПоказателей2";
	Иначе
		ПолеГруппировки = "КодПоказателя";
	КонецЕсли;
	
	Если ПараметрыОтчета.ЕстьЦелевыеПараметры Тогда
		ПравилоЗаполненияСтроки = ПравилаРасчетаПоказателей.Найти(КодСтроки, "КодПоказателя");
		Если ПравилоЗаполненияСтроки <> Неопределено 
			И ЗначениеЗаполнено(ПравилоЗаполненияСтроки.ЦелевойПараметр) Тогда
			Ресурсы.ЦелевоеЗначение = ПараметрыОтчета.ЦелевыеПараметры[ПравилоЗаполненияСтроки.ЦелевойПараметр];
		КонецЕсли;
	КонецЕсли;
	
	ОтборДанных = Новый Структура;
	ОтборДанных.Вставить(ПолеГруппировки, КодСтроки);
	ТаблицаПоПоказателю = ДанныеПоказателей.Скопировать(ОтборДанных);
	
	Для каждого СтрокаТаблицы Из ТаблицаПоПоказателю Цикл
		
		Ресурсы.ОборотДт_НД = Ресурсы.ОборотДт_НД + СтрокаТаблицы.ОборотДт_НД;
		Ресурсы.ОборотДт_ГОЗ = Ресурсы.ОборотДт_ГОЗ + СтрокаТаблицы.ОборотДт_ГОЗ;
		Ресурсы.ОборотДт_Ввод = Ресурсы.ОборотДт_Ввод + СтрокаТаблицы.ОборотДт_Ввод;
		
		Ресурсы.ОборотКт_НД = Ресурсы.ОборотКт_НД + СтрокаТаблицы.ОборотКт_НД;
		Ресурсы.ОборотКт_ГОЗ = Ресурсы.ОборотКт_ГОЗ + СтрокаТаблицы.ОборотКт_ГОЗ;
		Ресурсы.ОборотКт_Вывод = Ресурсы.ОборотКт_Вывод + СтрокаТаблицы.ОборотКт_Вывод;
		
		Коэффициент = ?(СтрокаТаблицы.Пассивный, -1, 1);
		
		Если СтрокаТаблицы.СальдоНаДатуЗавершения = 0 Тогда
		Ресурсы.СальдоНаДатуЗавершения = Ресурсы.СальдоНаДатуЗавершения
			+ (Коэффициент 
				* (СтрокаТаблицы.ОборотДт_НаДатуЗавершения_НД + СтрокаТаблицы.ОборотДт_НаДатуЗавершения_ГОЗ + СтрокаТаблицы.ОборотДт_НаДатуЗавершения_Ввод
						- СтрокаТаблицы.ОборотКт_НаДатуЗавершения_НД - СтрокаТаблицы.ОборотКт_НаДатуЗавершения_ГОЗ - СтрокаТаблицы.ОборотКт_НаДатуЗавершения_Вывод));
		Иначе
			Ресурсы.СальдоНаДатуЗавершения = Ресурсы.СальдоНаДатуЗавершения + СтрокаТаблицы.СальдоНаДатуЗавершения;
		КонецЕсли;
		
		Если СтрокаТаблицы.СальдоНаТекущуюДату = 0 Тогда
			Ресурсы.СальдоНаТекущуюДату = Ресурсы.СальдоНаТекущуюДату
				+ (Коэффициент 
					* (СтрокаТаблицы.ОборотДт_НД + СтрокаТаблицы.ОборотДт_ГОЗ + СтрокаТаблицы.ОборотДт_Ввод
							- СтрокаТаблицы.ОборотКт_НД - СтрокаТаблицы.ОборотКт_ГОЗ  - СтрокаТаблицы.ОборотКт_Вывод));
		Иначе
			Ресурсы.СальдоНаТекущуюДату = Ресурсы.СальдоНаТекущуюДату + СтрокаТаблицы.СальдоНаТекущуюДату;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Ресурсы.ЦелевоеЗначение <> 0 Тогда
		Ресурсы.ВыполнениеНаТекущуюДату = Окр(Ресурсы.СальдоНаТекущуюДату / Ресурсы.ЦелевоеЗначение * 100, 2);
		Ресурсы.ВыполнениеНаДатуЗавершения = Окр(Ресурсы.СальдоНаДатуЗавершения / Ресурсы.ЦелевоеЗначение * 100, 2);
	КонецЕсли;
	
	ПривестиРесурсыКФорматуВывода(Ресурсы, ПараметрыОтчета);
	
	Ресурсы.Вставить("ТаблицаПоПоказателю", ТаблицаПоПоказателю);
	
	Возврат Ресурсы;
	
КонецФункции

Функция ДанныеЗаполнениеСтрокиВводаВыводаСредств(ПараметрыОтчета, ДанныеПоказателей)
	
	Ресурсы = Новый Структура;
	
	Ресурсы.Вставить("ОборотДт_ГОЗ", 0);
	Ресурсы.Вставить("ОборотДт_Ввод", 0);
	
	Ресурсы.Вставить("ОборотКт_ГОЗ", 0);
	Ресурсы.Вставить("ОборотКт_Вывод", 0);
	
	Ресурсы.Вставить("СальдоНаТекущуюДату", 0);
	Ресурсы.Вставить("СальдоНаДатуЗавершения", 0);
	
	Для каждого СтрокаТаблицы Из ДанныеПоказателей Цикл
		
		Если СтрокаТаблицы.ГруппаПоказателей1 <> "100" 
			И СтрокаТаблицы.ГруппаПоказателей1 <> "200"
			И СтрокаТаблицы.ГруппаПоказателей1 <> "300" Тогда
			Продолжить;
		КонецЕсли;
		
		Ресурсы.ОборотДт_ГОЗ = Ресурсы.ОборотДт_ГОЗ + СтрокаТаблицы.ОборотДт_ГОЗ;
		Ресурсы.ОборотДт_Ввод = Ресурсы.ОборотДт_Ввод + СтрокаТаблицы.ОборотДт_Ввод;
		
		Ресурсы.ОборотКт_ГОЗ = Ресурсы.ОборотКт_ГОЗ + СтрокаТаблицы.ОборотКт_ГОЗ;
		Ресурсы.ОборотКт_Вывод = Ресурсы.ОборотКт_Вывод + СтрокаТаблицы.ОборотКт_Вывод;
		
		Коэффициент = ?(СтрокаТаблицы.Пассивный, -1, 1);
		Ресурсы.СальдоНаТекущуюДату = Ресурсы.СальдоНаТекущуюДату
			+ (СтрокаТаблицы.ОборотКт_ГОЗ + СтрокаТаблицы.ОборотКт_Вывод
				- СтрокаТаблицы.ОборотДт_ГОЗ  - СтрокаТаблицы.ОборотДт_Ввод);
		
		Ресурсы.СальдоНаДатуЗавершения = Ресурсы.СальдоНаДатуЗавершения
			+ (СтрокаТаблицы.ОборотКт_НаДатуЗавершения_ГОЗ + СтрокаТаблицы.ОборотКт_НаДатуЗавершения_Вывод
				- СтрокаТаблицы.ОборотДт_НаДатуЗавершения_ГОЗ - СтрокаТаблицы.ОборотДт_НаДатуЗавершения_Ввод);
				
	КонецЦикла;
	
	ПривестиРесурсыКФорматуВывода(Ресурсы, ПараметрыОтчета);
	
	Возврат Ресурсы;
	
КонецФункции

Функция СтруктураОборотов() 
	
	СтруктураОборотов = Новый Структура;
	СтруктураОборотов.Вставить("ОборотДт_НД");
	СтруктураОборотов.Вставить("ОборотДт_ГОЗ");
	СтруктураОборотов.Вставить("ОборотДт_Ввод");
	
	СтруктураОборотов.Вставить("ОборотКт_НД");
	СтруктураОборотов.Вставить("ОборотКт_ГОЗ");
	СтруктураОборотов.Вставить("ОборотКт_Вывод");
	
	Возврат СтруктураОборотов;
	
КонецФункции

Функция ПараметрыРасшифровки(Детализация, Правило, СтрокаДанных)
	
	СтруктураПараметровРасшифровки = Новый Структура;
	
	Если Детализация = "ДоРегистратора" Тогда
		СтруктураПараметровРасшифровки.Вставить("Регистратор", СтрокаДанных.Регистратор);
	Иначе
		Оборот = Правило.Обороты.Получить(СтрокаДанных.ИндексОборота);
		Для каждого ПоляДвижений Из СтруктураОборотов() Цикл
			
			ЗначенияПарамеров = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Оборот.Значение);
			ЗначенияПарамеров.Вставить("РесурсОборотов", ПоляДвижений.Ключ);
			
			СтруктураПараметровРасшифровки.Вставить(ПоляДвижений.Ключ + "_Расшифровка", ЗначенияПарамеров);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтруктураПараметровРасшифровки;
	
КонецФункции

Функция ПолучениеДанных(ПараметрыОтчета, ПравилаРасчетаПоказателей)
	
	ДанныеПоказателей = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Регистратор КАК Регистратор,
	|	ХозрасчетныйОбороты.Период КАК Период,
	|	ХозрасчетныйОбороты.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ХозрасчетныйОбороты.Счет КАК Счет,
	|	ХозрасчетныйОбороты.КорСчет КАК КорСчет,
	|	ХозрасчетныйОбороты.НаправлениеДеятельностиКор КАК КорНаправлениеДеятельности,
	|	СУММА(ХозрасчетныйОбороты.СуммаОборотДт) КАК ОборотДт,
	|	СУММА(ХозрасчетныйОбороты.СуммаОборотКт) КАК ОборотКт,
	|	СУММА(ВЫБОР 
	|			КОГДА ХозрасчетныйОбороты.Период <= &ДатаЗавершения 
	|				ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОборотДт_НаДатуЗавершения,
	|	СУММА(ВЫБОР 
	|			КОГДА ХозрасчетныйОбороты.Период <= &ДатаЗавершения 
	|				ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОборотКт_НаДатуЗавершения
	|ПОМЕСТИТЬ ХозрасчетныйОборотыПредварительная
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			,
	|			&Период,
	|			Запись,
	|			,
	|			,
	|			Организация = &Организация
	|			И (НаправлениеДеятельности В (&ОтборНаправленияДеятельности)
	|				ИЛИ НаправлениеДеятельностиКор В (&ОтборНаправленияДеятельности))
	|			,
	|			) КАК ХозрасчетныйОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Регистратор,
	|	ХозрасчетныйОбороты.Период,
	|	ХозрасчетныйОбороты.Счет,
	|	ХозрасчетныйОбороты.КорСчет,
	|	ХозрасчетныйОбороты.НаправлениеДеятельности,
	|	ХозрасчетныйОбороты.НаправлениеДеятельностиКор
	|;
	|
	|/////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Регистратор КАК Регистратор,
	|	ХозрасчетныйОбороты.Период КАК Период,
	|	ВЫБОР 
	|		КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСпоПриобретеннымЦенностям))
	|			ТОГДА ЕСТЬNULL(ХозрасчетныйОбороты.КорНаправлениеДеятельности, &ПустоеНД)
	|		ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОбороты.НаправлениеДеятельности, &ПустоеНД) 
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ХозрасчетныйОбороты.Счет КАК Счет,
	|	ХозрасчетныйОбороты.КорСчет КАК КорСчет,
	|	ВЫБОР 
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСпоПриобретеннымЦенностям))
	|			ТОГДА ЕСТЬNULL(ХозрасчетныйОбороты.НаправлениеДеятельности, &ПустоеНД)
	|		ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОбороты.КорНаправлениеДеятельности, &ПустоеНД) 
	|	КОНЕЦ КАК КорНаправлениеДеятельности,
	|	ВЫБОР 
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСпоПриобретеннымЦенностям))
	|			ТОГДА ЕСТЬNULL(ХозрасчетныйОбороты.НаправлениеДеятельности.ТипНаправленияДеятельности, &ПустойТипНаправления)
	|		ИНАЧЕ ЕСТЬNULL(ХозрасчетныйОбороты.КорНаправлениеДеятельности.ТипНаправленияДеятельности, &ПустойТипНаправления) 
	|	КОНЕЦ КАК ТипКорНаправлениеДеятельности,
	|	ХозрасчетныйОбороты.ОборотДт КАК ОборотДт,
	|	ХозрасчетныйОбороты.ОборотКт КАК ОборотКт,
	|	ХозрасчетныйОбороты.ОборотДт_НаДатуЗавершения КАК ОборотДт_НаДатуЗавершения,
	|	ХозрасчетныйОбороты.ОборотКт_НаДатуЗавершения КАК ОборотКт_НаДатуЗавершения
	|ПОМЕСТИТЬ ХозрасчетныйОбороты
	|ИЗ
	|	ХозрасчетныйОборотыПредварительная КАК ХозрасчетныйОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счет,
	|	КорСчет,
	|	КорНаправлениеДеятельности
	|";
	
	Если ПараметрыОтчета.Детализация = "ДоРегистратора" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Авто", "Регистратор");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ХозрасчетныйОбороты.Регистратор", "НЕОПРЕДЕЛЕНО");
	КонецЕсли;
	Если ПараметрыОтчета.ЕстьДанныеНаДатуЗавершения Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Авто", "Период");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ХозрасчетныйОбороты.Период", "ДАТАВРЕМЯ(1,1,1)");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПустоеНД",                       Справочники.НаправленияДеятельности.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойТипНаправления",           Перечисления.ТипыНаправленийДеятельности.ПустаяСсылка());
	Запрос.УстановитьПараметр("Организация",                    ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("Период",                         ПараметрыОтчета.Период);
	Запрос.УстановитьПараметр("ВариантФормирования",            ПараметрыОтчета.ВариантФормирования);
	Запрос.УстановитьПараметр("ОтборНаправленияДеятельности",   ПараметрыОтчета.ОтборНаправленияДеятельности);
	Запрос.УстановитьПараметр("ОтборНаправленияДеятельностиДругиеКонтрактыГОЗ", ПараметрыОтчета.ОтборНаправленияДеятельностиДругиеКонтрактыГОЗ);
	Если ПараметрыОтчета.ЕстьДанныеНаДатуЗавершения Тогда
		Запрос.УстановитьПараметр("ДатаЗавершения",             ПараметрыОтчета.ЦелевыеПараметры.ДатаЗавершения);
	Иначе
		Запрос.УстановитьПараметр("ДатаЗавершения",             Дата(1,1,1,0,0,0));
	КонецЕсли;
	
	МассивОбъединений = Новый Массив;;
	Для каждого Правило Из ПравилаРасчетаПоказателей Цикл
		ТекстЗапросаПоПравилу = ТекстЗапросаПоПравилу(Правило, Запрос);
		Если ТекстЗапросаПоПравилу <> "" Тогда
			МассивОбъединений.Добавить(ТекстЗапросаПоПравилу);
		КонецЕсли;
	КонецЦикла;
	ТекстОбъединение = СтрСоединить(МассивОбъединений, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	Запрос.Текст = 
		Запрос.Текст
		+ ОбщегоНазначенияУТ.РазделительЗапросовВПакете()
		+ ТекстОбъединение;
		
	УстановитьПривилегированныйРежим(Истина);
	ДанныеПоказателей = Запрос.Выполнить().Выгрузить();
	
	КолонкиСуммирования = 
		"СальдоНаТекущуюДату, СальдоНаДатуЗавершения,
		|ОборотДт_НД, ОборотДт_ГОЗ, ОборотДт_Ввод, 
		|ОборотКт_НД, ОборотКт_ГОЗ, ОборотКт_Вывод, 
		|ОборотДт_НаДатуЗавершения_НД, ОборотДт_НаДатуЗавершения_ГОЗ, ОборотДт_НаДатуЗавершения_Ввод, 
		|ОборотКт_НаДатуЗавершения_НД, ОборотКт_НаДатуЗавершения_ГОЗ, ОборотКт_НаДатуЗавершения_Вывод";
	
	Если ПараметрыОтчета.Детализация = "ДоРегистратора" Тогда
		ДанныеПоказателей.Свернуть("ГруппаПоказателей1, ГруппаПоказателей2, КодПоказателя, Пассивный, Период, Регистратор", КолонкиСуммирования);
	ИначеЕсли ПараметрыОтчета.Детализация = "ДоОборотов" Тогда
		ДанныеПоказателей.Свернуть("ГруппаПоказателей1, ГруппаПоказателей2, КодПоказателя, Пассивный, Оборот, ИндексОборота", КолонкиСуммирования);
	Иначе
		ДанныеПоказателей.Свернуть("ГруппаПоказателей1, ГруппаПоказателей2, КодПоказателя, Пассивный", КолонкиСуммирования);
	КонецЕсли;
	
	Для каждого Строка Из ДанныеПоказателей Цикл
		Если Строка.КодПоказателя = "222" Тогда
			// Учета входящего НДС в разрезе направлений нет,
			// поэтому сразу отражаем вывод из контракта.
			Строка.ОборотКт_Вывод = Строка.ОборотДт_НД;
		КонецЕсли
	КонецЦикла;
	
	ДанныеПоказателей.Индексы.Добавить("ГруппаПоказателей1");
	ДанныеПоказателей.Индексы.Добавить("ГруппаПоказателей2");
	ДанныеПоказателей.Индексы.Добавить("КодПоказателя");
	
	Возврат ДанныеПоказателей;
	
КонецФункции

Функция ТаблицаПравилРасчетаПоказателей(ПараметрыОтчета)
	
	ПравилаРасчетаПоказателей = Новый ТаблицаЗначений;
	ПравилаРасчетаПоказателей.Колонки.Добавить("ГруппаПоказателей1", Новый ОписаниеТипов("Строка"));
	ПравилаРасчетаПоказателей.Колонки.Добавить("ГруппаПоказателей2", Новый ОписаниеТипов("Строка"));
	ПравилаРасчетаПоказателей.Колонки.Добавить("Пассивный",          Новый ОписаниеТипов("Булево"));
	ПравилаРасчетаПоказателей.Колонки.Добавить("КодПоказателя",      Новый ОписаниеТипов("Строка"));
	ПравилаРасчетаПоказателей.Колонки.Добавить("Заголовок",          Новый ОписаниеТипов("Строка"));
	ПравилаРасчетаПоказателей.Колонки.Добавить("ЦелевойПараметр",    Новый ОписаниеТипов("Строка"));
	ПравилаРасчетаПоказателей.Колонки.Добавить("Обороты",            Новый ОписаниеТипов("СписокЗначений"));
	
	// Счета учета финансирования
	СчетаУчетаРасчетыСКлиентами = СчетаУчетаРасчетыСКлиентами();
	СчетаУчетаКредитыИЗаймы = СчетаУчетаКредитыИЗаймы();
	СчетаУчетаЗадолженностьПередПоставщиками = СчетаУчетаЗадолженностьПередПоставщиками();
	
	// Счета учета денежных средств
	СчетаУчетаДенеженыеСредстваНаСчетах = СчетаУчетаДенеженыеСредстваНаСчетах();
	СчетаУчетаДепозиты = СчетаУчетаДепозиты();
	СчетаУчетаАвансыВыданныеПоставщикам = СчетаУчетаАвансыВыданныеПоставщикам();
	
	// Счета учета запасов
	СчетаУчетаМатериалыНаСкадах = СчетаУчетаМатериалыНаСкадах();
	СчетаУчетаНДСВходящий = СчетаУчетаНДСВходящий();
	СчетаУчетаПолуфабрикатыНаСкладах = СчетаУчетаПолуфабрикатыНаСкладах();
	СчетаУчетаМатериалыВПереработчике = СчетаУчетаМатериалыВПереработчике();
	СчетаУчетаРасходыБудущихПериодов = СчетаУчетаРасходыБудущихПериодов();
	СчетаУчетаСредстваПроизводства = СчетаУчетаСредстваПроизводства();
	
	// Счета учета производства
	СчетаУчетаПроизводство = СчетаУчетаПроизводство();
	СчетаУчетаОбщепроизводственныеЗатраты = СчетаУчетаОбщепроизводственныеЗатраты();
	СчетаУчетаОбщехозяйственныеЗатраты = СчетаУчетаОбщехозяйственныеЗатраты();
	
	СчетаУчетаРасчетыПоОплатеТруда = СчетаУчетаРасчетыПоОплатеТруда();
	СчетаУчетаГотоваяПродукция = СчетаУчетаГотоваяПродукция();
	
	КорСчетаУчетаПрочихПроизводственныхЗатрат = КорСчетаУчетаПрочихПроизводственныхЗатрат();
	
	// Продажи
	СчетаУчетаНДССПродаж = СчетаУчетаНДССПродаж();
	СчетаУчетаУправленческихРасходов = СчетаУчетаУправленческихРасходов();
	СчетаУчетаКоммерческиеРасходы = СчетаУчетаКоммерческиеРасходы();
	СчетаУчетаВыручкаОтПродаж = СчетаУчетаВыручкаОтПродаж();
	СчетаУчетаСебестоимостьПродаж = СчетаУчетаСебестоимостьПродаж();
	
#Область ФинансированиеКонтракта
	
	// C101 "Средства, полученные от заказчика"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "100";
	НовоеПравило.ГруппаПоказателей2 = "";
	НовоеПравило.КодПоказателя      = "101";
	НовоеПравило.Пассивный          = Истина;
	НовоеПравило.Заголовок = НСтр("ru = 'Средства, полученные от заказчика'");
	НовоеПравило.ЦелевойПараметр = "ОбъемФинансированияКонтракта";
	
	Для каждого СчетУчета Из СчетаУчетаРасчетыСКлиентами Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Кт Оборот %1 / %2'"), 
			СчетУчета,
			СтрСоединить(СчетаУчетаДенеженыеСредстваНаСчетах, ", "));
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		ОтборОборота.КорСчет = СчетаУчетаДенеженыеСредстваНаСчетах;
		ОтборОборота.ТипИтогов = Перечисления.ТипыИтогов.ОборотКт;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	// C102 "Кредиты банка"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "100";
	НовоеПравило.ГруппаПоказателей2 = "";
	НовоеПравило.КодПоказателя = "102";
	НовоеПравило.Пассивный     = Истина;
	НовоеПравило.Заголовок = НСтр("ru = 'Кредиты банка'");
	НовоеПравило.ЦелевойПараметр = "";
	
	Для каждого СчетУчета Из СчетаУчетаКредитыИЗаймы Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Оборот %1'"), СчетУчета);
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	// C103 "Задолженность перед поставщиками"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "100";
	НовоеПравило.ГруппаПоказателей2 = "";
	НовоеПравило.КодПоказателя = "103";
	НовоеПравило.Пассивный     = Истина;
	НовоеПравило.Заголовок = НСтр("ru = 'Задолженность перед поставщиками'");
	НовоеПравило.ЦелевойПараметр = "";
	
	Для каждого СчетУчета Из СчетаУчетаЗадолженностьПередПоставщиками Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Оборот %1'"), СчетУчета);
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
#КонецОбласти
	
#Область РаспределениеСредствКонтракта

	#Область ДенежныеСредства
	
	// 211 "Денежные средства на отдельных счетах"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "210";
	НовоеПравило.КодПоказателя = "211";
	НовоеПравило.Заголовок = НСтр("ru = 'Денежные средства на отдельных счетах'");
	НовоеПравило.ЦелевойПараметр = "";
	
	Для каждого СчетУчета Из СчетаУчетаДенеженыеСредстваНаСчетах Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Оборот %1'"), СчетУчета);
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	// 212 "Денежные средства на депозитах в банке"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "210";
	НовоеПравило.КодПоказателя = "212";
	НовоеПравило.Заголовок = НСтр("ru = 'Денежные средства на депозитах в банке'");
	НовоеПравило.ЦелевойПараметр = "";
	
	Для каждого СчетУчета Из СчетаУчетаДепозиты Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Оборот %1'"), СчетУчета);
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	// 213 "Авансы, выданные поставщикам"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "210";
	НовоеПравило.КодПоказателя = "213";
	НовоеПравило.Заголовок = НСтр("ru = 'Авансы, выданные поставщикам'");
	НовоеПравило.ЦелевойПараметр = "";
	
	Для каждого СчетУчета Из СчетаУчетаАвансыВыданныеПоставщикам Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Оборот %1'"), СчетУчета);
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	#КонецОбласти
	
	#Область Запасы
	
	// 221 "Покупные материалы на складах"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "220";
	НовоеПравило.КодПоказателя = "221";
	НовоеПравило.Заголовок = НСтр("ru = 'Покупные материалы на складах'");
	НовоеПравило.ЦелевойПараметр = "";
	
	Для каждого СчетУчета Из СчетаУчетаМатериалыНаСкадах Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Оборот %1'"), СчетУчета);
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	// 222 "НДС входящий"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "220";
	НовоеПравило.КодПоказателя = "222";
	НовоеПравило.Заголовок = НСтр("ru = 'НДС входящий'");
	НовоеПравило.ЦелевойПараметр = "";
	
	Для каждого СчетУчета Из СчетаУчетаНДСВходящий Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Оборот %1'"), СчетУчета);
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.КорНаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		ОтборОборота.ТипИтогов = Перечисления.ТипыИтогов.ОборотДт;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	// 223 "Полуфабрикаты собственного производства на складах"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "220";
	НовоеПравило.КодПоказателя = "223";
	НовоеПравило.Заголовок = НСтр("ru = 'Полуфабрикаты собственного производства на складах'");
	НовоеПравило.ЦелевойПараметр = "";
	
	Для каждого СчетУчета Из СчетаУчетаПолуфабрикатыНаСкладах Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Оборот %1'"), СчетУчета);
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	// 224 "Материалы и полуфабрикаты, переданные в переработку"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "220";
	НовоеПравило.КодПоказателя = "224";
	НовоеПравило.Заголовок = НСтр("ru = 'Материалы и полуфабрикаты, переданные в переработку'");
	НовоеПравило.ЦелевойПараметр = "";
	
	Для каждого СчетУчета Из СчетаУчетаМатериалыВПереработчике Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Оборот %1'"), СчетУчета);
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	// 225 "Расходы будущих периодов"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "220";
	НовоеПравило.КодПоказателя = "225";
	НовоеПравило.Заголовок = НСтр("ru = 'Расходы будущих периодов'");
	НовоеПравило.ЦелевойПараметр = "";
	
	Для каждого СчетУчета Из СчетаУчетаРасходыБудущихПериодов Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Оборот %1'"), СчетУчета);
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	// 226 "Средства производства"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "220";
	НовоеПравило.КодПоказателя = "226";
	НовоеПравило.Заголовок = НСтр("ru = 'Средства производства'");
	НовоеПравило.ЦелевойПараметр = "";
	
	Для каждого СчетУчета Из СчетаУчетаСредстваПроизводства Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Оборот %1'"), СчетУчета);
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	#КонецОбласти
	
	#Область Производство

	// 231 "Затраты на материалы"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "230";
	НовоеПравило.КодПоказателя = "231";
	НовоеПравило.Заголовок = НСтр("ru = 'Затраты на материалы'");
	НовоеПравило.ЦелевойПараметр = "ЗатратыНаМатериалы";
	
	СтруктураСчетаТМЦ = Новый Структура;
	СтруктураСчетаТМЦ.Вставить("СчетаУчетаМатериалыНаСкадах", СчетаУчетаМатериалыНаСкадах);
	СтруктураСчетаТМЦ.Вставить("СчетаУчетаМатериалыВПереработчике", СчетаУчетаМатериалыВПереработчике);
	СтруктураСчетаТМЦ.Вставить("СчетаУчетаГотоваяПродукция", СчетаУчетаГотоваяПродукция);
	
	Для каждого СчетУчета Из СчетаУчетаПроизводство Цикл
		Для каждого КлючИЗначение Из СтруктураСчетаТМЦ Цикл
			Для каждого СчетМатериалов Из КлючИЗначение.Значение Цикл 
				Заголовок = СтрШаблон(НСтр("ru = 'Дт Оборот %1 / %2'"), 
				    СчетУчета,
					СчетМатериалов);
				
				ОтборОборота = ОтборОборота();
				ОтборОборота.Счет = СчетУчета;
				ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
				ОтборОборота.КорСчет   = СчетМатериалов;
				ОтборОборота.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
				
				ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	// 232 "Затраты на оплату труда"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "230";
	НовоеПравило.КодПоказателя = "232";
	НовоеПравило.Заголовок = НСтр("ru = 'Затраты на оплату труда'");
	НовоеПравило.ЦелевойПараметр = "ЗатратыНаОплатуТруда";
	
	Для каждого СчетУчета Из СчетаУчетаПроизводство Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Дт Оборот %1 / %2'"), СчетУчета, СтрСоединить(СчетаУчетаРасчетыПоОплатеТруда, ", "));
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		ОтборОборота.КорСчет = СчетаУчетаРасчетыПоОплатеТруда;
		ОтборОборота.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
	КонецЦикла;
	
	// 233 "Прочие производственные затраты"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "230";
	НовоеПравило.КодПоказателя = "233";
	НовоеПравило.Заголовок = НСтр("ru = 'Прочие производственные затраты'");
	НовоеПравило.ЦелевойПараметр = "ПрочиеПроизводственныеЗатраты";
	
	Для каждого СчетУчета Из СчетаУчетаПроизводство Цикл
		
		Для каждого КорСчет Из КорСчетаУчетаПрочихПроизводственныхЗатрат Цикл 
		
			Заголовок = СтрШаблон(НСтр("ru = 'Дт Оборот %1 / %2'"), СчетУчета, КорСчет);
			ОтборОборота = ОтборОборота();
			ОтборОборота.Счет = СчетУчета;
			ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
			ОтборОборота.КорСчет = КорСчет;
			ОтборОборота.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
			ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
			
		КонецЦикла;
		
		Заголовок = СтрШаблон(НСтр("ru = 'Дт Оборот %1 / %2 (другие контракты ГОЗ)'"), СчетУчета, СтрСоединить(СчетаУчетаПроизводство, ", "));
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		ОтборОборота.КорСчет = СчетаУчетаПроизводство;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельностиДругиеКонтрактыГОЗ;
		ОтборОборота.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
		Заголовок = СтрШаблон(НСтр("ru = 'Дт Оборот %1 / %2 (иная деятельность)'"), СчетУчета, СтрСоединить(СчетаУчетаПроизводство, ", "));
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		ОтборОборота.КорСчет = СчетаУчетаПроизводство;
		ТипыНаправленийДеятельности = Новый Массив;
		ТипыНаправленийДеятельности.Добавить(Перечисления.ТипыНаправленийДеятельности.ИнаяДеятельность);
		ТипыНаправленийДеятельности.Добавить(Перечисления.ТипыНаправленийДеятельности.ПустаяСсылка());
		ОтборОборота.ТипКорНаправлениеДеятельности = ТипыНаправленийДеятельности;
		ОтборОборота.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
	
	КонецЦикла;

	// 234 "Общепроизводственные затраты"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "230";
	НовоеПравило.КодПоказателя = "234";
	НовоеПравило.Заголовок = НСтр("ru = 'Общепроизводственные затраты'");
	НовоеПравило.ЦелевойПараметр = "ОбщепроизводственныеЗатраты";
	
	Для каждого СчетУчета Из СчетаУчетаПроизводство Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Дт Оборот %1 / %2'"), 
			    СчетУчета,
				СтрСоединить(СчетаУчетаОбщепроизводственныеЗатраты, ", "));
			
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		ОтборОборота.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
		ОтборОборота.КорСчет = СчетаУчетаОбщепроизводственныеЗатраты;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	// 235 "Общехозяйственные затраты"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "230";
	НовоеПравило.КодПоказателя = "235";
	НовоеПравило.Заголовок = НСтр("ru = 'Общехозяйственные затраты'");
	НовоеПравило.ЦелевойПараметр = "ОбщехозяйственныеЗатраты";
	
	Для каждого СчетУчета Из СчетаУчетаПроизводство Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Дт Оборот %1 / %2'"), 
			    СчетУчета,
				СтрСоединить(СчетаУчетаОбщехозяйственныеЗатраты, ", "));
			
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		ОтборОборота.КорСчет = СчетаУчетаОбщехозяйственныеЗатраты;
		ОтборОборота.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	// 236 "Полуфабрикаты собственного производства, внутренние работы"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "230";
	НовоеПравило.КодПоказателя = "236";
	НовоеПравило.Заголовок = НСтр("ru = 'Полуфабрикаты собственного производства, внутренние работы'");
	НовоеПравило.ЦелевойПараметр = "";
	
	Для каждого СчетУчета Из СчетаУчетаПроизводство Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Дт Оборот %1 / %2'"), 
			    СчетУчета,
				СтрСоединить(СчетаУчетаПолуфабрикатыНаСкладах, ", "));
			
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		ОтборОборота.КорСчет = СчетаУчетаПолуфабрикатыНаСкладах;
		ОтборОборота.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	Для каждого СчетУчета Из СчетаУчетаПроизводство Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Дт Оборот %1 / %2 (в рамках контракта)'"), 
			    СчетУчета,
				СтрСоединить(СчетаУчетаПроизводство, ", "));
			
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		ОтборОборота.КорСчет = СчетаУчетаПроизводство;
		ОтборОборота.КорНаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		ОтборОборота.ТипИтогов =  Перечисления.ТипыИтогов.ОборотДт;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	// 237 "Полуфабрикаты собственного производства, внутренние работы"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "230";
	НовоеПравило.КодПоказателя = "237";
	НовоеПравило.Заголовок = НСтр("ru = 'Выпуск полуфабрикатов, внутренних работ'");
	НовоеПравило.ЦелевойПараметр = "";
	
	Для каждого СчетУчета Из СчетаУчетаПроизводство Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Кт Оборот %1 / %2'"), СчетУчета, СтрСоединить(СчетаУчетаПолуфабрикатыНаСкладах, ","));
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		ОтборОборота.КорСчет = СчетаУчетаПолуфабрикатыНаСкладах;
		ОтборОборота.ТипИтогов =  Перечисления.ТипыИтогов.ОборотКт;
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
		Заголовок = СтрШаблон(НСтр("ru = 'Кт Оборот %1 / %2 (в рамках контракта)'"), СчетУчета, СтрСоединить(СчетаУчетаПроизводство, ","));
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		ОтборОборота.КорСчет = СчетаУчетаПроизводство;
		ОтборОборота.КорНаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		ОтборОборота.ТипИтогов =  Перечисления.ТипыИтогов.ОборотКт;
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);

		Заголовок = СтрШаблон(НСтр("ru = 'Кт Оборот %1 / %2'"), СчетУчета, ПланыСчетов.Хозрасчетный.ПрочиеРасходы);
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		ОтборОборота.КорСчет = ПланыСчетов.Хозрасчетный.ПрочиеРасходы;
		ОтборОборота.ТипИтогов =  Перечисления.ТипыИтогов.ОборотКт;
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	// 238 "Выпуск продукции"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "230";
	НовоеПравило.КодПоказателя = "238";
	НовоеПравило.Заголовок = НСтр("ru = 'Выпуск продукции'");
	НовоеПравило.ЦелевойПараметр = "";
	
	Для каждого СчетУчета Из СчетаУчетаПроизводство Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Кт Оборот %1 / %2'"), 
			    СчетУчета,
				СтрСоединить(СчетаУчетаГотоваяПродукция, ","));
			
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		ОтборОборота.КорСчет = СчетаУчетаГотоваяПродукция;
		ОтборОборота.ТипИтогов =  Перечисления.ТипыИтогов.ОборотКт;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	#КонецОбласти
	
	#Область ГотоваяПродукцияНаСкладе
	
	// 240 "Готовая продукция на складе"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "200";
	НовоеПравило.ГруппаПоказателей2 = "240";
	НовоеПравило.КодПоказателя = "241";
	НовоеПравило.Заголовок = НСтр("ru = 'Готовая продукция на складе'");
	НовоеПравило.ЦелевойПараметр = "";
	
	Для каждого СчетУчета Из СчетаУчетаГотоваяПродукция Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Оборот %1'"), СчетУчета);
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	#КонецОбласти
	
#КонецОбласти

#Область ОтгрузкаПродукцииВыполнениеРабот

	// 300 Отгрузка продукции, выполнение работ"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "300";
	НовоеПравило.ГруппаПоказателей2 = "300";
	НовоеПравило.КодПоказателя = "300";
	НовоеПравило.Заголовок = НСтр("ru = 'Отгрузка продукции, выполнение работ'");
	НовоеПравило.ЦелевойПараметр = "ОбъемФинансированияКонтракта";
	
	// 301 "Себестоимость реализованной продукции"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "300";
	НовоеПравило.ГруппаПоказателей2 = "301";
	НовоеПравило.КодПоказателя = "301";
	НовоеПравило.Заголовок = НСтр("ru = 'Себестоимость реализованной продукции'");
	НовоеПравило.ЦелевойПараметр = "Затраты";
	
	Для каждого СчетУчета Из СчетаУчетаСебестоимостьПродаж Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Дт Оборот %1'"), СчетУчета);
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	// 302 "Управленческие расходы"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "300";
	НовоеПравило.ГруппаПоказателей2 = "302";
	НовоеПравило.КодПоказателя = "302";
	НовоеПравило.Заголовок = НСтр("ru = 'Управленческие расходы'");
	НовоеПравило.ЦелевойПараметр = "УправленческиеРасходы";
	
	Для каждого СчетУчета Из СчетаУчетаУправленческихРасходов Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Дт Оборот %1'"), СчетУчета);
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	// 303 "Коммерческие расходы"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "300";
	НовоеПравило.ГруппаПоказателей2 = "303";
	НовоеПравило.КодПоказателя = "303";
	НовоеПравило.Заголовок = НСтр("ru = 'Коммерческие расходы'");
	НовоеПравило.ЦелевойПараметр = "КоммерческиеРасходы";
	
	Для каждого СчетУчета Из СчетаУчетаКоммерческиеРасходы Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Дт Оборот %1'"), СчетУчета);
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	// 304 "НДС с выручки от продаж"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "300";
	НовоеПравило.ГруппаПоказателей2 = "304";
	НовоеПравило.КодПоказателя = "304";
	НовоеПравило.Заголовок = НСтр("ru = 'НДС с выручки от продаж'");
	НовоеПравило.ЦелевойПараметр = "СуммаНДС";
	
	Для каждого СчетУчета Из СчетаУчетаНДССПродаж Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Дт Оборот %1'"), СчетУчета);
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	// 305 "Прибыль контракта"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "300";
	НовоеПравило.ГруппаПоказателей2 = "305";
	НовоеПравило.КодПоказателя = "305";
	НовоеПравило.Пассивный     = Истина;
	НовоеПравило.Заголовок = НСтр("ru = 'Прибыль контракта'");
	НовоеПравило.ЦелевойПараметр = "ПрибыльКонтракта";
	
	Для каждого СчетУчета Из СчетаУчетаВыручкаОтПродаж Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Кт Сальдо %1'"), СчетУчета);
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		ОтборОборота.ТипИтогов = Перечисления.ТипыИтогов.СальдоКт;
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	Для каждого СчетУчета Из СчетаУчетаСебестоимостьПродаж Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = '(-) Дт Сальдо %1'"), СчетУчета);
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		ОтборОборота.ТипИтогов = Перечисления.ТипыИтогов.СальдоДт;
		ОтборОборота.Множитель = -1;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	Для каждого СчетУчета Из СчетаУчетаУправленческихРасходов Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = '(-) Дт Сальдо %1'"), СчетУчета);
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		ОтборОборота.ТипИтогов = Перечисления.ТипыИтогов.СальдоДт;
		ОтборОборота.Множитель = -1;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;

	Для каждого СчетУчета Из СчетаУчетаКоммерческиеРасходы Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = '(-) Дт Сальдо %1'"), СчетУчета);
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		ОтборОборота.ТипИтогов = Перечисления.ТипыИтогов.СальдоДт;
		ОтборОборота.Множитель = -1;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	Для каждого СчетУчета Из СчетаУчетаНДССПродаж Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = '(-) Дт Сальдо %1'"), СчетУчета);
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности = ПараметрыОтчета.ОтборНаправленияДеятельности;
		ОтборОборота.ТипИтогов = Перечисления.ТипыИтогов.СальдоДт;
		ОтборОборота.Множитель = -1;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;
	
	#КонецОбласти
	
	// 500 "Средства, списанные в счет прибыли контракта"
	НовоеПравило = ПравилаРасчетаПоказателей.Добавить(); 
	НовоеПравило.ГруппаПоказателей1 = "500";
	НовоеПравило.ГруппаПоказателей2 = "500";
	НовоеПравило.КодПоказателя = "500";
	НовоеПравило.Заголовок = НСтр("ru = 'Средства, списанные в счет прибыли контракта'");
	НовоеПравило.ЦелевойПараметр = "ПрибыльКонтракта";
	
	Для каждого СчетУчета Из СчетаУчетаДенеженыеСредстваНаСчетах Цикл
		
		Заголовок = СтрШаблон(НСтр("ru = 'Кт Оборот %1 / %2'"), 
			СчетУчета,
			СтрСоединить(СчетаУчетаДенеженыеСредстваНаСчетах, ", "));
		
		ОтборОборота = ОтборОборота();
		ОтборОборота.Счет = СчетУчета;
		ОтборОборота.НаправлениеДеятельности    = ПараметрыОтчета.ОтборНаправленияДеятельности;
		ОтборОборота.КорСчет = СчетаУчетаДенеженыеСредстваНаСчетах;
		
		ТипыНаправленийДеятельности = Новый Массив;
		ТипыНаправленийДеятельности.Добавить(Перечисления.ТипыНаправленийДеятельности.ИнаяДеятельность);
		ТипыНаправленийДеятельности.Добавить(Перечисления.ТипыНаправленийДеятельности.ПустаяСсылка());
		ОтборОборота.ТипКорНаправлениеДеятельности = ТипыНаправленийДеятельности;
		
		ДобавитьОборот(НовоеПравило, Заголовок, ОтборОборота);
		
	КонецЦикла;

	Возврат ПравилаРасчетаПоказателей;
	
КонецФункции

Функция ДобавитьОборот(Правило, Заголовок, ОтборОборота)
	
	Оборот = Новый Структура;
	
	Оборот.Вставить("Счет",      ОтборОборота.Счет);
	
	МассивНаправленийДеятельности = Новый СписокЗначений;
	Если ТипЗнч(ОтборОборота.НаправлениеДеятельности) = Тип("Массив") Тогда
		МассивНаправленийДеятельности = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(ОтборОборота.НаправлениеДеятельности);
	ИначеЕсли ТипЗнч(ОтборОборота.НаправлениеДеятельности) = Тип("ПланСчетовСсылка.Хозрасчетный") Тогда
		МассивНаправленийДеятельности.Добавить(ОтборОборота.НаправлениеДеятельности);
	КонецЕсли;
	Оборот.Вставить("НаправлениеДеятельности", МассивНаправленийДеятельности);
	
	МассивКорСчетов = Новый Массив;
	Если ТипЗнч(ОтборОборота.КорСчет) = Тип("Массив") Тогда
		МассивКорСчетов = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(ОтборОборота.КорСчет);
	ИначеЕсли ТипЗнч(ОтборОборота.КорСчет) = Тип("ПланСчетовСсылка.Хозрасчетный") Тогда
		МассивКорСчетов.Добавить(ОтборОборота.КорСчет);
	КонецЕсли;
	Оборот.Вставить("КорСчет", МассивКорСчетов);
	
	МассивНаправленийДеятельности = Новый Массив;
	Если ТипЗнч(ОтборОборота.КорНаправлениеДеятельности) = Тип("Массив") Тогда
		МассивНаправленийДеятельности = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(ОтборОборота.КорНаправлениеДеятельности);
	ИначеЕсли ТипЗнч(ОтборОборота.КорНаправлениеДеятельности) = Тип("ПланСчетовСсылка.Хозрасчетный") Тогда
		МассивНаправленийДеятельности.Добавить(ОтборОборота.КорНаправлениеДеятельности);
	КонецЕсли;
	Оборот.Вставить("КорНаправлениеДеятельности", МассивНаправленийДеятельности);
	
	МассивКорТипыНаправленийДеятельности = Новый Массив;
	Если ТипЗнч(ОтборОборота.ТипКорНаправлениеДеятельности) = Тип("Массив") Тогда
		МассивКорТипыНаправленийДеятельности = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(ОтборОборота.ТипКорНаправлениеДеятельности);
	ИначеЕсли ТипЗнч(ОтборОборота.КорНаправлениеДеятельности) = Тип("ПланСчетовСсылка.Хозрасчетный") Тогда
		МассивКорТипыНаправленийДеятельности.Добавить(ОтборОборота.ТипКорНаправлениеДеятельности);
	КонецЕсли;
	Оборот.Вставить("ТипКорНаправлениеДеятельности", МассивКорТипыНаправленийДеятельности);
	
	Оборот.Вставить("ТипИтогов", ОтборОборота.ТипИтогов);
	Оборот.Вставить("Множитель", ОтборОборота.Множитель);
	
	НовоеОборот = Правило.Обороты.Добавить(Оборот, Заголовок);
	
	Возврат Оборот;
	
КонецФункции

Функция ОтборОборота()
	
	ОтборОборота = Новый Структура();
	ОтборОборота.Вставить("Счет");
	ОтборОборота.Вставить("НаправлениеДеятельности");
	ОтборОборота.Вставить("КорСчет");
	ОтборОборота.Вставить("КорНаправлениеДеятельности");
	ОтборОборота.Вставить("ТипКорНаправлениеДеятельности");
	ОтборОборота.Вставить("ТипИтогов", Перечисления.ТипыИтогов.Оборот);
	ОтборОборота.Вставить("Множитель", 1);
	
	Возврат ОтборОборота;
	
КонецФункции

Функция ТекстЗапросаПоПравилу(Правило, Запрос)
	
	Фрагменты = Новый Массив;
	
	Шаблон =
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Регистратор     КАК Регистратор,
	|	ХозрасчетныйОбороты.Период          КАК Период,
	|	""%ГруппаПоказателей1%""            КАК ГруппаПоказателей1,
	|	""%ГруппаПоказателей2%""            КАК ГруппаПоказателей2,
	|	""%КодПоказателя%""                 КАК КодПоказателя,
	|	&Пассивный                          КАК Пассивный,
	|	&ИндексОборота                      КАК ИндексОборота,
	|	&ЗаголовокОборот                    КАК Оборот,
	|	&Множитель                          КАК Множитель,
	|	СУММА(
	|		ВЫБОР 
	|			КОГДА &ТипИтогов = ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.СальдоКт) 
	|				ТОГДА &Множитель * (ХозрасчетныйОбороты.ОборотКт - ХозрасчетныйОбороты.ОборотДт)
	|			КОГДА &ТипИтогов = ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.СальдоДт) 
	|				ТОГДА &Множитель * (ХозрасчетныйОбороты.ОборотДт - ХозрасчетныйОбороты.ОборотКт)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СальдоНаТекущуюДату,
	|	СУММА(
	|		ВЫБОР 
	|			КОГДА &ТипИтогов = ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.СальдоКт) 
	|				ТОГДА &Множитель * (ХозрасчетныйОбороты.ОборотКт_НаДатуЗавершения - ХозрасчетныйОбороты.ОборотДт_НаДатуЗавершения)
	|			КОГДА &ТипИтогов = ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.СальдоДт) 
	|				ТОГДА &Множитель * (ХозрасчетныйОбороты.ОборотДт_НаДатуЗавершения - ХозрасчетныйОбороты.ОборотКт_НаДатуЗавершения)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СальдоНаДатуЗавершения,
	|	СУММА(
	|		ВЫБОР 
	|			КОГДА &ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотДт)) 
	|				И ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельности) 
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотДт 
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОборотДт_НД,
	|	СУММА(
	|		ВЫБОР 
	|			КОГДА &ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотДт)) 
	|				И ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельностиДругиеКонтрактыГОЗ)
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотДт 
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОборотДт_ГОЗ,
	|	СУММА(
	|		ВЫБОР 
	|			КОГДА &ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотДт)) 
	|				И НЕ ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельности) 
	|				И НЕ ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельностиДругиеКонтрактыГОЗ) 
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотДт 
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОборотДт_Ввод,
	|	СУММА(
	|		ВЫБОР 
	|			КОГДА &ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотКт)) 
	|				И ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельности)
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотКт 
	|		ИНАЧЕ 0
	|		КОНЕЦ) КАК ОборотКт_НД,
	|	СУММА(
	|		ВЫБОР 
	|			КОГДА
	|				&ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотКт)) 
	|				И ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельностиДругиеКонтрактыГОЗ)
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотКт 
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОборотКт_ГОЗ,
	|	СУММА(
	|		ВЫБОР 
	|			КОГДА
	|				&ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотКт)) 
	|				И НЕ ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельности) 
	|				И НЕ ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельностиДругиеКонтрактыГОЗ) 
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотКт 
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОборотКт_Вывод,
	|	СУММА(
	|		ВЫБОР 
	|			КОГДА &ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотДт)) 
	|				И ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельности) 
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотДт_НаДатуЗавершения 
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОборотДт_НаДатуЗавершения_НД,
	|	СУММА(
	|		ВЫБОР 
	|			КОГДА &ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотДт)) 
	|				И ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельностиДругиеКонтрактыГОЗ)
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотДт_НаДатуЗавершения 
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОборотДт_НаДатуЗавершения_ГОЗ,
	|	СУММА(
	|		ВЫБОР 
	|			КОГДА &ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотДт)) 
	|				И НЕ ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельности) 
	|				И НЕ ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельностиДругиеКонтрактыГОЗ) 
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотДт_НаДатуЗавершения 
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОборотДт_НаДатуЗавершения_Ввод,
	|	СУММА(
	|		ВЫБОР 
	|			КОГДА &ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотКт)) 
	|				И ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельности)
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотКт_НаДатуЗавершения 
	|		ИНАЧЕ 0
	|		КОНЕЦ) КАК ОборотКт_НаДатуЗавершения_НД,
	|	СУММА(
	|		ВЫБОР 
	|			КОГДА
	|				&ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотКт)) 
	|				И ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельностиДругиеКонтрактыГОЗ)
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотКт_НаДатуЗавершения 
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОборотКт_НаДатуЗавершения_ГОЗ,
	|	СУММА(
	|		ВЫБОР 
	|			КОГДА
	|				&ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотКт)) 
	|				И НЕ ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельности) 
	|				И НЕ ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельностиДругиеКонтрактыГОЗ) 
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотКт_НаДатуЗавершения 
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОборотКт_НаДатуЗавершения_Вывод
	|ИЗ
	|	ХозрасчетныйОбороты КАК ХозрасчетныйОбороты
	|ГДЕ
	|	ХозрасчетныйОбороты.Счет В (&Счет)
	|	И (ХозрасчетныйОбороты.НаправлениеДеятельности В (&НаправлениеДеятельности) 
	|			ИЛИ &ВсеНаправлениеДеятельности)
	|	И (ХозрасчетныйОбороты.КорСчет В (&КорСчет) 
	|			ИЛИ &ВсеКорСчета)
	|	И (ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&КорНаправлениеДеятельности) 
	|			ИЛИ &ВсеКорНаправлениеДеятельности)
	|	И (ХозрасчетныйОбороты.ТипКорНаправлениеДеятельности В (&ТипКорНаправлениеДеятельности) 
	|			ИЛИ &ВсеТипыКорНаправлениеДеятельности)
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Период,
	|	ХозрасчетныйОбороты.Регистратор
	|
	|ИМЕЮЩИЕ
	|	СУММА(
	|		ВЫБОР 
	|			КОГДА &ТипИтогов = ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.СальдоКт) 
	|				ТОГДА &Множитель * (ХозрасчетныйОбороты.ОборотКт - ХозрасчетныйОбороты.ОборотДт)
	|			КОГДА &ТипИтогов = ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.СальдоДт) 
	|				ТОГДА &Множитель * (ХозрасчетныйОбороты.ОборотДт - ХозрасчетныйОбороты.ОборотКт)
	|			ИНАЧЕ 0
	|		КОНЕЦ) <> 0
	|	ИЛИ СУММА(
	|		ВЫБОР 
	|			КОГДА &ТипИтогов = ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.СальдоКт) 
	|				ТОГДА &Множитель * (ХозрасчетныйОбороты.ОборотКт_НаДатуЗавершения - ХозрасчетныйОбороты.ОборотДт_НаДатуЗавершения)
	|			КОГДА &ТипИтогов = ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.СальдоДт) 
	|				ТОГДА &Множитель * (ХозрасчетныйОбороты.ОборотДт_НаДатуЗавершения - ХозрасчетныйОбороты.ОборотКт_НаДатуЗавершения)
	|			ИНАЧЕ 0
	|		КОНЕЦ) <> 0
	|	ИЛИ СУММА(
	|		ВЫБОР 
	|			КОГДА &ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотДт)) 
	|				И ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельности) 
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотДт 
	|			ИНАЧЕ 0
	|		КОНЕЦ) <> 0
	|	ИЛИ СУММА(
	|		ВЫБОР 
	|			КОГДА &ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), 
	|									  ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотДт)) 
	|				И ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельностиДругиеКонтрактыГОЗ)
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотДт 
	|			ИНАЧЕ 0
	|		КОНЕЦ) <> 0
	|	ИЛИ СУММА(
	|		ВЫБОР 
	|			КОГДА &ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотДт)) 
	|				И НЕ ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельности) 
	|				И НЕ ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельностиДругиеКонтрактыГОЗ) 
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотДт 
	|			ИНАЧЕ 0
	|		КОНЕЦ) <> 0
	|	ИЛИ СУММА(
	|		ВЫБОР 
	|			КОГДА &ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотКт)) 
	|				И ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельности)
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотКт 
	|		ИНАЧЕ 0
	|		КОНЕЦ) <> 0
	|	ИЛИ СУММА(
	|		ВЫБОР 
	|			КОГДА
	|				&ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотКт)) 
	|				И ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельностиДругиеКонтрактыГОЗ)
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотКт 
	|			ИНАЧЕ 0
	|		КОНЕЦ) <> 0
	|	ИЛИ СУММА(
	|		ВЫБОР 
	|			КОГДА
	|				&ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотКт)) 
	|				И НЕ ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельности) 
	|				И НЕ ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельностиДругиеКонтрактыГОЗ) 
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотКт 
	|			ИНАЧЕ 0
	|		КОНЕЦ) <> 0
	|	ИЛИ СУММА(
	|		ВЫБОР 
	|			КОГДА &ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотДт)) 
	|				И ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельности) 
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотДт_НаДатуЗавершения 
	|			ИНАЧЕ 0
	|		КОНЕЦ) <> 0
	|	ИЛИ СУММА(
	|		ВЫБОР 
	|			КОГДА &ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотДт)) 
	|				И ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельностиДругиеКонтрактыГОЗ)
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотДт_НаДатуЗавершения 
	|			ИНАЧЕ 0
	|		КОНЕЦ) <> 0
	|	ИЛИ СУММА(
	|		ВЫБОР 
	|			КОГДА &ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотДт)) 
	|				И НЕ ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельности) 
	|				И НЕ ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельностиДругиеКонтрактыГОЗ) 
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотДт_НаДатуЗавершения 
	|			ИНАЧЕ 0
	|		КОНЕЦ) <> 0
	|	ИЛИ СУММА(
	|		ВЫБОР 
	|			КОГДА &ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотКт)) 
	|				И ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельности)
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотКт_НаДатуЗавершения 
	|		ИНАЧЕ 0
	|		КОНЕЦ) <> 0
	|	ИЛИ СУММА(
	|		ВЫБОР 
	|			КОГДА
	|				&ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотКт)) 
	|				И ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельностиДругиеКонтрактыГОЗ)
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотКт_НаДатуЗавершения 
	|			ИНАЧЕ 0
	|		КОНЕЦ) <> 0
	|	ИЛИ СУММА(
	|		ВЫБОР 
	|			КОГДА
	|				&ТипИтогов В (ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.Оборот), ЗНАЧЕНИЕ(Перечисление.ТипыИтогов.ОборотКт)) 
	|				И НЕ ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельности) 
	|				И НЕ ХозрасчетныйОбороты.КорНаправлениеДеятельности В (&ОтборНаправленияДеятельностиДругиеКонтрактыГОЗ) 
	|				ТОГДА &Множитель * ХозрасчетныйОбороты.ОборотКт_НаДатуЗавершения 
	|			ИНАЧЕ 0
	|		КОНЕЦ) <> 0
	|";
	
	КодПоказателя = Правило.КодПоказателя;

	Шаблон = СтрЗаменить(Шаблон, "%КодПоказателя%",     КодПоказателя);
	Шаблон = СтрЗаменить(Шаблон, "%ГруппаПоказателей1%", Правило.ГруппаПоказателей1);
	Шаблон = СтрЗаменить(Шаблон, "%ГруппаПоказателей2%", Правило.ГруппаПоказателей2);
	
	Параметр = СтрШаблон("Пассивный_%1", КодПоказателя);
	Шаблон = СтрЗаменить(Шаблон, "&Пассивный", "&" + Параметр);
	Запрос.УстановитьПараметр(Параметр, Правило.Пассивный);
	
	Для каждого Оборот Из Правило.Обороты Цикл
		
		ТекстОборот = Шаблон;
		
		ИндексОборота = Правило.Обороты.Индекс(Оборот);
		
		Параметр = СтрШаблон("ИндексОборота_%1_%2", КодПоказателя, ИндексОборота);
		ТекстОборот = СтрЗаменить(ТекстОборот, "&ИндексОборота", "&" + Параметр);
		Запрос.УстановитьПараметр(Параметр, ИндексОборота);
		
		Параметр = СтрШаблон("Cчет_%1_%2", КодПоказателя, ИндексОборота);
		ТекстОборот = СтрЗаменить(ТекстОборот, "&Счет", "&" + Параметр);
		Запрос.УстановитьПараметр(Параметр, Оборот.Значение.Счет);
			
		Параметр = СтрШаблон("НаправлениеДеятельности_%1_%2", КодПоказателя, ИндексОборота);
		ТекстОборот = СтрЗаменить(ТекстОборот, "&НаправлениеДеятельности", "&" + Параметр);
		Запрос.УстановитьПараметр(Параметр, Оборот.Значение.НаправлениеДеятельности);
		
		Параметр = СтрШаблон("ВсеНаправлениеДеятельности_%1_%2", КодПоказателя, ИндексОборота);
		ТекстОборот = СтрЗаменить(ТекстОборот, "&ВсеНаправлениеДеятельности", "&" + Параметр);
		Запрос.УстановитьПараметр(Параметр, НЕ ЗначениеЗаполнено(Оборот.Значение.НаправлениеДеятельности));
		
		Параметр = СтрШаблон("КорСчет_%1_%2", КодПоказателя, ИндексОборота);
		ТекстОборот = СтрЗаменить(ТекстОборот, "&КорСчет", "&" +Параметр);
		Запрос.УстановитьПараметр(Параметр, БухгалтерскийУчет.СформироватьМассивСубсчетов(Оборот.Значение.КорСчет));
		
		Параметр = СтрШаблон("ВсеКорСчета_%1_%2", КодПоказателя, ИндексОборота);
		ТекстОборот = СтрЗаменить(ТекстОборот, "&ВсеКорСчета", "&" + Параметр);
		Запрос.УстановитьПараметр(Параметр, НЕ ЗначениеЗаполнено(Оборот.Значение.КорСчет));
			
		Параметр = СтрШаблон("КорНаправлениеДеятельности_%1_%2", КодПоказателя, ИндексОборота);
		ТекстОборот = СтрЗаменить(ТекстОборот, "&КорНаправлениеДеятельности", "&" + Параметр);
		Запрос.УстановитьПараметр(Параметр, Оборот.Значение.КорНаправлениеДеятельности);
		
		Параметр = СтрШаблон("ВсеКорНаправлениеДеятельности_%1_%2", КодПоказателя, ИндексОборота);
		ТекстОборот = СтрЗаменить(ТекстОборот, "&ВсеКорНаправлениеДеятельности", "&" + Параметр);
		Запрос.УстановитьПараметр(Параметр, НЕ ЗначениеЗаполнено(Оборот.Значение.КорНаправлениеДеятельности));
		
		Параметр = СтрШаблон("ТипКорНаправлениеДеятельности_%1_%2", КодПоказателя, ИндексОборота);
		ТекстОборот = СтрЗаменить(ТекстОборот, "&ТипКорНаправлениеДеятельности", "&" + Параметр);
		Запрос.УстановитьПараметр(Параметр, Оборот.Значение.ТипКорНаправлениеДеятельности);
		
		Параметр = СтрШаблон("ВсеТипыКорНаправлениеДеятельности_%1_%2", КодПоказателя, ИндексОборота);
		ТекстОборот = СтрЗаменить(ТекстОборот, "&ВсеТипыКорНаправлениеДеятельности", "&" + Параметр);
		Запрос.УстановитьПараметр(Параметр, НЕ ЗначениеЗаполнено(Оборот.Значение.ТипКорНаправлениеДеятельности));
		
		Параметр = СтрШаблон("Множитель_%1_%2", КодПоказателя, ИндексОборота);
		ТекстОборот = СтрЗаменить(ТекстОборот, "&Множитель", "&" + Параметр);
		Запрос.УстановитьПараметр(Параметр, Оборот.Значение.Множитель); 
		
		Параметр = СтрШаблон("ТипИтогов_%1_%2", КодПоказателя, ИндексОборота);
		ТекстОборот = СтрЗаменить(ТекстОборот, "&ТипИтогов", "&" + Параметр);
		Запрос.УстановитьПараметр(Параметр, Оборот.Значение.ТипИтогов); 
		
		Параметр = СтрШаблон("ЗаголовокОборот_%1_%2", КодПоказателя, ИндексОборота);
		ТекстОборот = СтрЗаменить(ТекстОборот, "&ЗаголовокОборот", "&" + Параметр);
		Запрос.УстановитьПараметр(Параметр, Оборот.Представление);
		
		Фрагменты.Добавить(ТекстОборот);
		
	КонецЦикла;
	
	ТекстЗапроса = СтрСоединить(Фрагменты, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура УстановитьСвойстваЯчеек(Область, ПараметрыОтчета)
	
	Для СтрокаСтрока = 1 По Область.ПолучитьРазмерОбластиДанныхПоВертикали() Цикл
		Для КолонкаОбласти = 1 По Область.ПолучитьРазмерОбластиДанныхПоГоризонтали() Цикл
			ТекущаяОбласть = Область.Область(СтрокаСтрока, КолонкаОбласти, СтрокаСтрока, КолонкаОбласти);
			ТекущаяОбласть.Формат = ПараметрыОтчета.ФорматСумм;
			Если ПараметрыОтчета.ВариантФормирования = 2
				И (ТекущаяОбласть.Параметр = "ОборотДт_ГОЗ"
					ИЛИ ТекущаяОбласть.Параметр = "ОборотКт_ГОЗ") Тогда
				
				ТекущаяОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
				ТекущаяОбласть.Текст = "Х";
				ТекущаяОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПривестиРесурсыКФорматуВывода(Ресурсы, ПараметрыОтчета)
	
	Если ПараметрыОтчета.ПредставлениеСумм = Перечисления.ВидыПредставленияЧисел.БезИзменений Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыОтчета.ПредставлениеСумм = Перечисления.ВидыПредставленияЧисел.ВМиллионах Тогда
		Знаменатель = 1000000;
	ИначеЕсли ПараметрыОтчета.ПредставлениеСумм = Перечисления.ВидыПредставленияЧисел.ВТысячах Тогда
		Знаменатель = 1000;
	Иначе
		Знаменатель = 1;
	КонецЕсли;
	
	Для каждого Ресурс Из Ресурсы Цикл
		Ресурсы[Ресурс.Ключ] = Ресурс.Значение / Знаменатель;
	КонецЦикла;
	
КонецПроцедуры

#Область СчетаУчетаФинансированиеКонтракта

Функция СчетаУчетаРасчетыСКлиентами()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Возврат Результат;
	
КонецФункции

Функция СчетаУчетаКредитыИЗаймы()
	
	Результат = Новый Массив;
	Результат.Добавить(ПланыСчетов.Хозрасчетный.КраткосрочныеКредиты);
	Результат.Добавить(ПланыСчетов.Хозрасчетный.КраткосрочныеЗаймы);
	Результат.Добавить(ПланыСчетов.Хозрасчетный.КраткосрочныеКредитыВал);
	Результат.Добавить(ПланыСчетов.Хозрасчетный.КраткосрочныеЗаймыВал);
	
	Результат.Добавить(ПланыСчетов.Хозрасчетный.ДолгосрочныеКредиты);
	Результат.Добавить(ПланыСчетов.Хозрасчетный.ДолгосрочныеЗаймы);
	Результат.Добавить(ПланыСчетов.Хозрасчетный.ДолгосрочныеКредитыВал);
	Результат.Добавить(ПланыСчетов.Хозрасчетный.ДолгосрочныеЗаймыВал);
	
	Возврат Результат;
	
КонецФункции

Функция СчетаУчетаЗадолженностьПередПоставщиками()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|	И Хозрасчетный.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СчетаУчетаДенежныхСредств

Функция СчетаУчетаДенеженыеСредстваНаСчетах()
	
	Результат = Новый Массив;
	Результат.Добавить(ПланыСчетов.Хозрасчетный.РасчетныеСчета);
	
	Возврат Результат;
	
КонецФункции

Функция СчетаУчетаДепозиты()
	
	Результат = Новый Массив;
	Результат.Добавить(ПланыСчетов.Хозрасчетный.ДепозитныеСчета);
	
	Возврат Результат;
	
КонецФункции

Функция СчетаУчетаАвансыВыданныеПоставщикам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|	И Хозрасчетный.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СчетаУчетаЗапасы

Функция СчетаУчетаМатериалыНаСкадах()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы))
	|	И (Хозрасчетный.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура)
	|		И Хозрасчетный.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Товары))
	|	И (Хозрасчетный.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура)
	|		И Хозрасчетный.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗаготовлениеИПриобретениеМЦ))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОтклонениеВСтоимостиМЦ))
	|	И (Хозрасчетный.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура)
	|		И Хозрасчетный.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Возврат Результат;
	
	
КонецФункции

Функция СчетаУчетаНДСВходящий()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСпоПриобретеннымЦенностям))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Возврат Результат;
	
КонецФункции

Функция СчетаУчетаПолуфабрикатыНаСкладах()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Возврат Результат;
	
КонецФункции

Функция СчетаУчетаМатериалыВПереработчике()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы))
	|	И (Хозрасчетный.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура)
	|		И Хозрасчетный.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Возврат Результат;

КонецФункции

Функция СчетаУчетаРасходыБудущихПериодов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Возврат Результат;

КонецФункции

Функция СчетаУчетаСредстваПроизводства()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СпецоснасткаИСпецодеждаВЭксплуатации))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Производство

Функция СчетаУчетаПроизводство()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Возврат Результат;
	
КонецФункции

Функция СчетаУчетаРасчетыПоОплатеТруда()
	
	Результат = Новый Массив;
	Результат.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию);
	Результат.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда);
	
	Возврат Результат;
	
КонецФункции

Функция СчетаУчетаГотоваяПродукция()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Возврат Результат;
	
КонецФункции

Функция СчетаУчетаОбщепроизводственныеЗатраты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Возврат Результат;
	
КонецФункции

Функция СчетаУчетаОбщехозяйственныеЗатраты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Возврат Результат
КонецФункции

Функция КорСчетаУчетаПрочихПроизводственныхЗатрат()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияОсновныхСредств);
	Результат.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов);
	Результат.Добавить(ПланыСчетов.Хозрасчетный.СпецоснасткаИСпецодеждаВЭксплуатации);
	Результат.Добавить(ПланыСчетов.Хозрасчетный.НДСпоПриобретеннымЦенностям);
	Результат.Добавить(ПланыСчетов.Хозрасчетный.БракВПроизводстве);
	Результат.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками);
	Результат.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами);
	Результат.Добавить(ПланыСчетов.Хозрасчетный.РезервыПредстоящихРасходов);
	
	Возврат Результат;
	
КонецФункции


#КонецОбласти

#Область Продажи

Функция СчетаУчетаНДССПродаж()
	
	Результат = Новый Массив;
	Результат.Добавить(ПланыСчетов.Хозрасчетный.Продажи_НДС);
	
	Возврат Результат

КонецФункции

Функция СчетаУчетаКоммерческиеРасходы()
	
	Результат = Новый Массив;
	Результат.Добавить(ПланыСчетов.Хозрасчетный.Продажи_РасходыНаПродажу);
	
	Возврат Результат

КонецФункции

Функция СчетаУчетаУправленческихРасходов()
	
	Результат = Новый Массив;
	Результат.Добавить(ПланыСчетов.Хозрасчетный.Продажи_УправленческиеРасходы);
	
	Возврат Результат

КонецФункции

Функция СчетаУчетаВыручкаОтПродаж()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Выручка))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Возврат Результат
	
КонецФункции

Функция СчетаУчетаСебестоимостьПродаж()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродаж))
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Возврат Результат
	
КонецФункции

#КонецОбласти

#КонецЕсли