////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    ЗаполнитьЗначенияСвойств(ЭтаФорма, ЭтаФорма.Параметры, "Контрагент, Копирование");
	
	ДоступностьAPI = ОбработкаОбъект.ПолучитьДоступностьApiПоСтране();
	Если Не ДоступностьAPI Тогда 
		Элементы.ФормаЗаполнитьИзВебПлатформы.Видимость = Ложь;		
		Элементы.ФормаПолучениеСпискаGLNРозничнойСети.Видимость = Ложь;		
	КонецЕсли;
	
    ЭлементДляОтбораВРегистре = "Контрагент";
    ЭтаФорма.Заголовок = ?(ЭтаФорма.Копирование = Истина Или ЗначениеЗаполнено(ЭтаФорма[ЭлементДляОтбораВРегистре]), "Редактирование контрагента", "Новый контрагент");
	
	ФорматыУПД  = ОбработкаОбъект.ПолучитьФорматыУПД();
	ФорматыУПД.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	Элементы.Контрагент_ФорматЭСФ.СписокВыбора.Очистить();
	Для каждого Эл Из ФорматыУПД Цикл
		Элементы.Контрагент_ФорматЭСФ.СписокВыбора.Добавить(Эл.Значение, Эл.Представление);
	КонецЦикла;
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Контрагент_ФорматЭСФ) Тогда
	     ЭтаФорма.Контрагент_ФорматЭСФ = "УПД по умолчанию"; 
	ИначеЕсли ФорматыУПД.НайтиПоЗначению(ЭтаФорма.Контрагент_ФорматЭСФ) = Неопределено Тогда  	
		 Сообщение = Новый СообщениеПользователю;
		 Сообщение.Текст = "Формат  - " + ЭтаФорма.Контрагент_ФорматЭСФ + " не найден! Заполните справочник ЭКОМ Инфо поля.";
		 Сообщение.Сообщить();	
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ЭтаФорма[ЭлементДляОтбораВРегистре]) Тогда
        Элементы[ЭлементДляОтбораВРегистре].ТолькоПросмотр = Ложь;
        Элементы[ЭлементДляОтбораВРегистре].Доступность    = Истина;
        Элементы[ЭлементДляОтбораВРегистре].ЦветФона       = WebЦвета.Роса;
	    Возврат;
	КонецЕсли;
    ДанныеКонтрагента = ОбработкаОбъект.ЭКОМ_GLN_Прочитать(ЭтаФорма[ЭлементДляОтбораВРегистре]);	
    
	Если ДанныеКонтрагента.СведенияЕсть Тогда					
			
		ЭтаФорма.ОператорЭДО        = ДанныеКонтрагента.Партнер;		
		ЭтаФорма.АдресКодРегиона      = ДанныеКонтрагента.eXiteАдр_КодРегиона;
		ЭтаФорма.АдресИндекс          = ДанныеКонтрагента.eXiteАдр_Индекс;
		ЭтаФорма.АдресГород           = ДанныеКонтрагента.eXiteАдр_Город;
		ЭтаФорма.АдресУлица           = ДанныеКонтрагента.eXiteАдр_Улица;
		ЭтаФорма.АдресДом             = ДанныеКонтрагента.eXiteАдр_Дом;
		ЭтаФорма.АдресКорпус          = ДанныеКонтрагента.eXiteАдр_Корпус;
		ЭтаФорма.АдресКвартира        = ДанныеКонтрагента.eXiteАдр_Кварт;
		ЭтаФорма.АдресИностранный     = ДанныеКонтрагента.eXiteАдр_ИностранныйАдрес;
		ЭтаФорма.АдресЕстьИностранный = ДанныеКонтрагента.eXiteАдр_ЯвляетсяИностранным;
			
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ДанныеКонтрагента);

	КонецЕсли;
	
	Если ЭтаФорма.Копирование Тогда
        Элементы[ЭлементДляОтбораВРегистре].ЦветФона       = WebЦвета.Роса;
        Элементы[ЭлементДляОтбораВРегистре].ТолькоПросмотр = Ложь;
        Элементы[ЭлементДляОтбораВРегистре].Доступность    = Истина;
        ЭтаФорма.Заголовок = "Новый контрагент (скопирован) из " + Строка(ЭтаФорма[ЭлементДляОтбораВРегистре]);
        ЭтаФорма[ЭлементДляОтбораВРегистре] = "";
    КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ЭКОМ_ЗначениеДополнительныхКонстант.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ДополнительнаяКонстанта = "ЭКОМ_ИспользоватьАдресаИзРегистраGLN";
	МенеджерЗаписи.Измерение = Неопределено; 
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.ЗначениеДополнительнойКонстанты = Истина Тогда
	     Элементы.ГруппаАдрес.Видимость = Истина;
	Иначе	
	     Элементы.ГруппаАдрес.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	//СохранитьНаСервере();
КонецПроцедуры

#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНД ВКЛАДКИ НАСТРОЙКИ

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Контрагент) Тогда
		Сообщить( "Контрагент не выбран.", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	СтруктураЭКОМ_GLN = Новый Структура;
	СтруктураЭКОМ_GLN.Вставить("GLN"                , ЭтаФорма.GLN);
	СтруктураЭКОМ_GLN.Вставить("Ид_ОЭД"             , ЭтаФорма.Ид_ОЭД);
	СтруктураЭКОМ_GLN.Вставить("SAPкод"             , ЭтаФорма.SAPкод);
	СтруктураЭКОМ_GLN.Вставить("Партнер"            , ЭтаФорма.ОператорЭДО);
	СтруктураЭКОМ_GLN.Вставить("Комментарий"        , ЭтаФорма.Комментарий);

	СтруктураЭКОМ_GLN.Вставить("eXiteАдр_КодРегиона", СокрЛП(ЭтаФорма.АдресКодРегиона));
	СтруктураЭКОМ_GLN.Вставить("eXiteАдр_Индекс"    , СокрЛП(ЭтаФорма.АдресИндекс));
	СтруктураЭКОМ_GLN.Вставить("eXiteАдр_Город"     , СокрЛП(ЭтаФорма.АдресГород));
	СтруктураЭКОМ_GLN.Вставить("eXiteАдр_Улица"     , СокрЛП(ЭтаФорма.АдресУлица));
	СтруктураЭКОМ_GLN.Вставить("eXiteАдр_Дом"       , СокрЛП(ЭтаФорма.АдресДом));
	СтруктураЭКОМ_GLN.Вставить("eXiteАдр_Корпус"    , СокрЛП(ЭтаФорма.АдресКорпус));
	СтруктураЭКОМ_GLN.Вставить("eXiteАдр_Кварт"     , СокрЛП(ЭтаФорма.АдресКвартира));	
	СтруктураЭКОМ_GLN.Вставить("Контрагент_ЭСФБезИнфПоля"   ,  ЭтаФорма.Контрагент_ЭСФБезИнфПоля);
	СтруктураЭКОМ_GLN.Вставить("Контрагент_ФорматЭСФ"       ,  СокрЛП(ЭтаФорма.Контрагент_ФорматЭСФ));
	СтруктураЭКОМ_GLN.Вставить("Контрагент_ЦеныИз1С"        ,  ЭтаФорма.Контрагент_ЦеныИз1С);	
	СтруктураЭКОМ_GLN.Вставить("Контрагент_ЦенаЗаказа_с_НДС",  ЭтаФорма.Контрагент_ЦенаЗаказа_с_НДС);
	СтруктураЭКОМ_GLN.Вставить("Контрагент_ОтправитьНовыйЮЗД", ЭтаФорма.Контрагент_ОтправитьНовыйЮЗД);
	СтруктураЭКОМ_GLN.Вставить("Контрагент_ПодтвЗаказа"     ,  ЭтаФорма.Контрагент_ПодтвЗаказа);
	СтруктураЭКОМ_GLN.Вставить("Контрагент_ОтчетОбОтгрузке" ,  ЭтаФорма.Контрагент_ОтчетОбОтгрузке);
	СтруктураЭКОМ_GLN.Вставить("Контрагент_Счет"            ,  ЭтаФорма.Контрагент_Счет);
	СтруктураЭКОМ_GLN.Вставить("Контрагент_ЮЗД"             ,  ЭтаФорма.Контрагент_ЮЗД);

	Если ЭтаФорма.АдресЕстьИностранный Тогда
		СтруктураЭКОМ_GLN.Вставить("eXiteАдр_ЯвляетсяИностранным", Истина);
		СтруктураЭКОМ_GLN.Вставить("eXiteАдр_ИностранныйАдрес"   , СокрЛП(ЭтаФорма.АдресИностранный));
	Иначе
		СтруктураЭКОМ_GLN.Вставить("eXiteАдр_ЯвляетсяИностранным", Ложь);
		СтруктураЭКОМ_GLN.Вставить("eXiteАдр_ИностранныйАдрес"   , "");   
	КонецЕсли;	
	
	ОбработкаОбъект.ЭКОМ_GLN_Запись(ЭтаФорма.Контрагент, СтруктураЭКОМ_GLN);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьИзВебПлатформыНаСервере(GLN, МассивЛогаСобытий)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ДанныеКонтрагентаПоAPI(GLN, МассивЛогаСобытий);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьИзВебПлатформы(Команда)
		
	МассивЛогаСобытий = Новый Массив;

	ДанныеМассив = ЗаполнитьИзВебПлатформыНаСервере(ЭтаФорма.GLN, МассивЛогаСобытий);
	Если ТипЗнч(ДанныеМассив) = Тип("Массив") Тогда
		Для Каждого Данные Из ДанныеМассив Цикл			
			
			ЭтаФорма.АдресКодРегиона      = ?(Данные.Регион       = "null", "", Данные.Регион);
			ЭтаФорма.АдресИндекс          = ?(Данные.Индекс       = "null", "", Данные.Индекс);
			ЭтаФорма.АдресГород           = ?(Данные.Город        = "null", "", Данные.Город);
            ЭтаФорма.АдресУлица           = ?(Данные.Улица        = "null", "", Данные.Улица);
            ЭтаФорма.АдресДом             = ?(Данные.НомерДома    = "null", "", Данные.НомерДома);
            ЭтаФорма.АдресКорпус          = ?(Данные.Корпус       = "null", "", Данные.Корпус);
			ЭтаФорма.АдресКвартира        = ?(Данные.Квартира     = "null", "", Данные.Квартира);
			
			Если ЗначениеЗаполнено(Данные.GUID) Тогда
				ЭтаФорма.Ид_ОЭД      = Данные.GUID;
				ЭтаФорма.ОператорЭДО = Данные.Оператор;
				ЭтаФорма.SAPкод		 = Данные.SAPкод;
			Иначе
				Если ЗначениеЗаполнено(ЭтаФорма.ОператорЭДО) Тогда
					Для каждого Стр Из Данные.МассивGUIDS Цикл
						Если Стр.varPrefix = ЭтаФорма.ОператорЭДО.Идентификатор Тогда
							ЭтаФорма.Ид_ОЭД = Стр.varGUID;
							Прервать;
						КонецЕсли;				
					КонецЦикла;	
				Иначе
					ТекстЛогаСобытий = "Заполните оператора ЭДО!";
					ЗаписьСтруктурыЛога = ЭКОМ_ОбщегоНазначенияКлиент.ЗаполненнаяЗаписьЛога(ТекстЛогаСобытий, ПредопределенноеЗначение("Перечисление.ЭКОМ_УровниЛогирования.Ошибка"), "Заполнение контрагента по API");
					МассивЛогаСобытий.Добавить(ЗаписьСтруктурыЛога);

				КонецЕсли;						
			КонецЕсли;

		КонецЦикла;
	КонецЕсли;

	Если МассивЛогаСобытий.Количество() > 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ЭКОМ_ОбщегоНазначенияКлиент.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий);
		Сообщение.Сообщить();		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПолучениеСпискаGLNРозничнойСетиНаСервере()
	
	МассивЛогаСобытий = Новый Массив;    
    ОбъектЭтаОбработка = РеквизитФормыВЗначение("Объект");
	
	ПрофильОбмена = ОбъектЭтаОбработка.ОсновнойПрофильОбмена(Неопределено, МассивЛогаСобытий);
	
	ДобавленоЗаписей = ОбъектЭтаОбработка.ЗагрузкаТочекДоставкиПоGLNРозничнойСети(ПрофильОбмена, ЭтаФорма.Контрагент, GLN, МассивЛогаСобытий);
    	
	ТекстСообщения = ЭКОМ_ОбщегоНазначения.ПолучитьТекстовыйЛогСобытий(МассивЛогаСобытий);
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПолучениеСпискаGLNРозничнойСети(Команда)
    ПолучениеСпискаGLNРозничнойСетиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура GLNОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СтрокаРазрешенных = "0123456789";
	Для Сч = 1 По СтрДлина(Текст) Цикл 
		Символ = Сред(Текст,Сч,1);
		Если Найти(СтрокаРазрешенных,Символ) <= 0 Тогда
			ЭтаФорма.GLN = "";
			Сообщить("Введен некорректный GLN! Введите GLN состоящий из 13 чисел без пробелов");
			Прервать;
		КонецЕсли;	 
	КонецЦикла;
КонецПроцедуры

#КонецОбласти







