
#Область НастройкаРасписанияРегламентногоЗадания

&НаКлиенте
Процедура НастроитьРасписание(Команда)
	
	ДиалогРасписания = Новый ДиалогРасписанияРегламентногоЗадания(ПолучитьРасписаниеРегламетногоЗаданияОнлайнОбмена());
	ДиалогРасписания.Показать(Новый ОписаниеОповещения("ЗаписатьРасписаниеРегламетногоЗаданияОнлайнОбмена",ЭтотОбъект));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасписаниеРегламетногоЗаданияОнлайнОбмена()
	
	Возврат РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.TRP_S_ОбменССелло).Расписание;

КонецФункции


//Второй параметр нужен из-за особенностей объекта ОписаниеОповещения. Он передает два параметра.
&НаСервере
Процедура ЗаписатьРасписаниеРегламетногоЗаданияОнлайнОбмена(Расписание, ДополнительныйПараметр)
	
	Если Не Расписание = Неопределено Тогда
		Задание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.TRP_S_ОбменССелло);
		Задание.Расписание = Расписание;
		Задание.Записать();
	Конецесли;

КонецПроцедуры
	
#КонецОбласти


&НаСервере
Процедура ВыполнитьОтправкуНаСервере()
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьОтправку(Команда)
	ВыполнитьОтправкуНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПутьКФайлуОбменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Укажите путь для сохранения файла";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Каталог = "";
	
	Если Диалог.Выбрать() Тогда
		Объект.ПутьКФайлуОбмена = Диалог.Каталог;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ОбновитьЛинкКартинок(Команда)
	ОбновитьЛинкКартинокНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьЛинкКартинокНаСервере()
КонецПроцедуры

&НаСервере
Процедура ВыгрКартНаСерв()
	ВыгрузкаКаспи.ВыгрузитьНаСервКаспи(); 
КонецПроцедуры
&НаКлиенте
Процедура ВыгрузитьКарточкиТоваровНаКаспи(Команда)
	ВыгрКартНаСерв() 
КонецПроцедуры

&НаСервере
Процедура ВыгрПрайсНаСерв()
	ВыгрузкаКаспи.ОтправитьПрайсНаСервере(); 
КонецПроцедуры
&НаКлиенте
Процедура ВыгрузитьПрайсНаКаспи(Команда)
	ВыгрПрайсНаСерв();
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаТоваров(Команда)
	
	МассивТоваров	= ПроверкаТоваровНаСервере();
	
	СписокТоваров	= Новый СписокЗначений;
	Для Каждого Элемент Из МассивТоваров Цикл
		Если ЗначениеЗаполнено(Элемент.Фото) Тогда
			СписокТоваров.Добавить(Элемент.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	ПоказатьЗначение(, СписокТоваров);
	
КонецПроцедуры

&НаСервере
Функция  ПроверкаТоваровНаСервере()
Запрос = Новый Запрос;
	Запрос.Текст = 
	
	
	"ВЫБРАТЬ
	|	НоменклатураХарактеристикиТовараКаспи.Ссылка КАК Ссылка,
	|	КОЛИЧЕСТВО(ЕСТЬNULL(НоменклатураХарактеристикиТовараКаспи.Значение, 0)) КАК ЕстьДанные,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(НоменклатураХарактеристикиТовараКаспи.Значение, 0) <> """"
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК заполн
	|ПОМЕСТИТЬ втДанные
	|ИЗ
	|	Справочник.Номенклатура.ХарактеристикиТовараКаспи КАК НоменклатураХарактеристикиТовараКаспи
	|ГДЕ
	|	НоменклатураХарактеристикиТовараКаспи.Обязательный
	|	И НЕ НоменклатураХарактеристикиТовараКаспи.Ссылка.ВыгруженНаКаспи
	|	И НоменклатураХарактеристикиТовараКаспи.Ссылка.Марка <> &Марка
	|
	|СГРУППИРОВАТЬ ПО
	|	НоменклатураХарактеристикиТовараКаспи.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанные.Ссылка КАК Номенклатура
	|ПОМЕСТИТЬ втЗаполненаяНоменклатура
	|ИЗ
	|	втДанные КАК втДанные
	|ГДЕ
	|	втДанные.ЕстьДанные - втДанные.заполн = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура.КатегорияТовара КАК КатегорияКаспи,
	|	ТоварыНаСкладахОстатки.Номенклатура.Артикул КАК артикул,
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика1,
	|	ПОДСТРОКА(ТоварыНаСкладахОстатки.Номенклатура.Описание, 1, 200) КАК описание,
	|	ПОДСТРОКА(ТоварыНаСкладахОстатки.Номенклатура.Описание, 1, 1024) КАК описаниеZM,
	|	"""" КАК цвет,
	|	"""" КАК размер,
	|	выбор когда линкиФото.Ссылка="""" тогда """" иначе ""фото"" конец КАК фото,
	|	"""" КАК ЦветКаспи,
	|	"""" КАК РазмерКаспи
	|ИЗ
	|	втЗаполненаяНоменклатура КАК втЗаполненаяНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураПрисоединенныеФайлы КАК линкиФото
	|			ПО ТоварыНаСкладахОстатки.Номенклатура = линкиФото.ВладелецФайла
	|		ПО (ТоварыНаСкладахОстатки.Номенклатура = втЗаполненаяНоменклатура.Номенклатура)
	|ГДЕ
	|	ТоварыНаСкладахОстатки.Склад В ИЕРАРХИИ(&Склад)
	|	И НЕ линкиФото.Ссылка ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Номенклатура,
	|	ТоварыНаСкладахОстатки.Характеристика,
	|	ТоварыНаСкладахОстатки.Номенклатура.Артикул,
	|	ПОДСТРОКА(ТоварыНаСкладахОстатки.Номенклатура.Описание, 1, 200),
	|	ПОДСТРОКА(ТоварыНаСкладахОстатки.Номенклатура.Описание, 1, 1024),
	|	линкиФото.Ссылка,
	|	ТоварыНаСкладахОстатки.Номенклатура.КатегорияТовара
	|ИТОГИ ПО
	|	Номенклатура,
	|	Характеристика1";
	
	
	настр=Справочники.TRP_S_НастройкиМаркетплейса.НастройкиКаспи;
	
	списВидНом=настр.НеВыгружатьКатегории.ВыгрузитьКолонку("ВидНоменклатуры");
	списСклад=настр.СкладыКаспи.ВыгрузитьКолонку("Склад");

	Запрос.УстановитьПараметр("ВидНоменклатуры", списВидНом);
	Запрос.УстановитьПараметр("ВидНоменклатуры", списВидНом);
	Запрос.УстановитьПараметр("Свойство", настр.ХарактеристикаЦвет);
	Запрос.УстановитьПараметр("Свойство2", настр.ХарактеристикаРазмер);
	Запрос.УстановитьПараметр("Склад", списСклад);
	Запрос.УстановитьПараметр("Марка", Справочники.Марки.ПустаяСсылка());
	
	данныеПоТоварам = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	
	данныепотоварам.свернуть("номенклатура,фото","");
	
	
	возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(данныеПоТоварам);
	//возврат д1;
КонецФункции

Функция ПолучитьКодВыгрузки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛогОтравкиКарточекТовараКаспиСрезПоследних.Период КАК Период,
		|	ЛогОтравкиКарточекТовараКаспиСрезПоследних.КодОтправки КАК КодОтправки
		|ИЗ
		|	РегистрСведений.ЛогОтравкиКарточекТовараКаспи.СрезПоследних КАК ЛогОтравкиКарточекТовараКаспиСрезПоследних
		|ГДЕ
		|	ЛогОтравкиКарточекТовараКаспиСрезПоследних.КодОтправки <> """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	рез = Запрос.Выполнить().Выгрузить();
	

	если рез.Количество()<>0 тогда
		возврат рез[0].КодОтправки;
	иначе
		возврат "";
	КонецЕсли;
КонецФункции
&НаСервере
Функция ТоварОтгружен(арт)
	спр=Справочники.Номенклатура.НайтиПоРеквизиту("артикул",арт); 
	фл=ложь;
	если ЗначениеЗаполнено(спр) тогда  
		если не спр.ВыгруженНаКаспи тогда
			о=спр.ПолучитьОбъект();
			о.ВыгруженНаКаспи=Истина;
			о.Записать();
		КонецЕсли;
		фл=истина;
	КонецЕсли;
	
	если фл тогда  
		возврат "ОК";
	иначе
		возврат "НЕ НАЙДЕН";
	КонецЕсли;
	
КонецФункции
&НаСервере
Функция  сформДерев(текст)   
	Чтение = Новый ЧтениеJSON;   
	///ТекстОтвета=СтрЗаменить(ТекстОтвета,"$","");
	чтение.УстановитьСтроку(текст);
	//Структура = ПрочитатьJSON(Чтение); 
	д=Неопределено;
	СформироватьДерево(Чтение,д);
	Чтение.Закрыть(); 
	
	
	возврат д;
КонецФункции
&НаСервере
Процедура СформироватьДерево(ЧтениеJSON, Дерево)
    
    ИмяСвойства = Неопределено;
    
    Пока ЧтениеJSON.Прочитать() Цикл
        TипJSON = ЧтениеJSON.ТипТекущегоЗначения;
        
        Если TипJSON = ТипЗначенияJSON.НачалоОбъекта 
        ИЛИ TипJSON = ТипЗначенияJSON.НачалоМассива Тогда
            НовыйОбъект = ?(TипJSON = ТипЗначенияJSON.НачалоОбъекта, Новый Соответствие, Новый Массив);
            
            Если ТипЗнч(Дерево) = Тип("Массив") Тогда
                Дерево.Добавить(НовыйОбъект);
            ИначеЕсли ТипЗнч(Дерево) = Тип("Соответствие") И ЗначениеЗаполнено(ИмяСвойства) Тогда
                Дерево.Вставить(ИмяСвойства, НовыйОбъект);
            КонецЕсли;
            
            СформироватьДерево(ЧтениеJSON, НовыйОбъект);
            
            Если Дерево = Неопределено Тогда
                Дерево = НовыйОбъект;
            КонецЕсли;
        ИначеЕсли TипJSON = ТипЗначенияJSON.ИмяСвойства Тогда
            ИмяСвойства = ЧтениеJSON.ТекущееЗначение;
        ИначеЕсли TипJSON = ТипЗначенияJSON.Число 
        ИЛИ TипJSON = ТипЗначенияJSON.Строка 
        ИЛИ TипJSON = ТипЗначенияJSON.Булево 
        ИЛИ TипJSON = ТипЗначенияJSON.Null Тогда
            Если ТипЗнч(Дерево) = Тип("Массив") Тогда
                Дерево.Добавить(ЧтениеJSON.ТекущееЗначение);
            ИначеЕсли ТипЗнч(Дерево) = Тип("Соответствие") Тогда
                Дерево.Вставить(ИмяСвойства, ЧтениеJSON.ТекущееЗначение);
            КонецЕсли;
        Иначе
            Возврат;
        КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры


&НаКлиенте
Процедура ПроверкаСтатусаОтправки(Команда)
	кк=получитьКодВыгрузки();
	объект.ккк=кк;
	
	ОчиститьСообщения();
	
		
	WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
	
	WinHttp.Open("GET","https://kaspi.kz/shop/api/products/import?i="+объект.ккк,0);   

	WinHttp.setRequestHeader("Content-Type", "application/json");
	WinHttp.setRequestHeader("X-Auth-Token", "Ku7Z94wIKPRZ5BYlyBrNuG2FGTMkr16SFUAxf12lERY=");  
	WinHttp.Send();
	ТекстОтвета = WinHttp.ResponseText();
	
	если не WinHttp.Status=200 тогда
		Сообщить("Соединение с сервером не установлено ("+WinHttp.StatusText+")");
		
		возврат 
	КонецЕсли;
	
	Чтение = Новый ЧтениеJSON;   
	ТекстОтвета=СтрЗаменить(ТекстОтвета,"$","");
	чтение.УстановитьСтроку(ТекстОтвета);
	Структура = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();   
	
	
	фл=ложь;
	попытка
		сообщить("code-"+Структура.code);
	Исключение КонецПопытки;    
	
	попытка
		сообщить("description-"+Структура.description);
	Исключение КонецПопытки;    
	
	попытка
		сообщить("message-"+Структура.message);
	Исключение КонецПопытки;
	попытка
		сообщить("status-"+Структура.status);  
		если Структура.status="FINISHED" тогда
			фл=истина;
		КонецЕсли;
	Исключение КонецПопытки;   
	
	
	
	//если не фл тогда возврат КонецЕсли;
	
	сообщить("---------------------------------------");
	
	
	
	
	
	WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
	
	WinHttp.Open("GET","https://kaspi.kz/shop/api/products/import/result?i="+объект.ккк,0);   
	

	WinHttp.setRequestHeader("Content-Type", "application/json");
	WinHttp.setRequestHeader("X-Auth-Token", "Ku7Z94wIKPRZ5BYlyBrNuG2FGTMkr16SFUAxf12lERY=");  
	WinHttp.Send();
	ТекстОтвета = WinHttp.ResponseText();
	
	//сообщить(ТекстОтвета);
	если не WinHttp.Status=200 тогда
		Сообщить("Соединение с сервером не установлено ("+WinHttp.StatusText+")");
		
		возврат 
	КонецЕсли;
	
	м=сформДерев(ТекстОтвета);  
	
	для каждого ст из м["result"] цикл   
		если ст.значение["state"]="FINISHED" тогда
			мм=СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ст.Ключ,"_");
			если мм.количество()<>0 тогда
				рез=ТоварОтгружен(мм[0]); 
				
				сообщить(""+ст.Ключ+"		"+ст.значение["state"]+"		"+рез);
			КонецЕсли; 
			
		иначеесли ст.Значение["state"]="ERRORS" тогда     
			
			мВ=ст.Значение["warnings"];
			сообщить("warnings");
			для к=0 по мВ.количество()-1 цикл
				сообщить("warnings "+мВ[к]);
			КонецЦикла;
			
			сообщить("");
			сообщить("");
			
			мВ=ст.Значение["errors"];
			сообщить("errors");
			для к=0 по мВ.количество()-1 цикл
				сообщить("errors "+мВ[к]);
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
