#Область ПрограммныйИнтерфейс

// Возвращает строку пустого глобального уникального идентификатора GUID.
//
// Возвращаемое значение:
//  Строка - строка, содержащая пустой уникальный идентификатор.
//
Функция ПустойУникальныйИдентификатор() Экспорт
	Возврат "00000000-0000-0000-0000-000000000000" // Не локализуется
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает  строку на части по указанным символам-разделителям..
// Сравнивает указанные реквизиты объекта с их значениями в информационной базе
//
// Параметры:
//	СписокСвойств - Строка -  список имен свойств, указанных через запятую. 
//
// Возвращаемое значение:
//	Булево - Массив, строки, которые получились в результате разделения списка свойств.
// 
Функция РазделитьИменаСвойств(СписокСвойств) Экспорт
	ИменаСвойств = Новый Массив;
	Для Каждого Свойство Из Новый Структура(СписокСвойств) Цикл
	    ИменаСвойств.Добавить(Свойство.Ключ)
	КонецЦикла;	
	Возврат ИменаСвойств
КонецФункции

#КонецОбласти
