#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	КлючВарианта = ЗарплатаКадрыОтчеты.КлючВарианта(КомпоновщикНастроек);
	
	ЭтоВариантОтчетаТ2ГСМС = Ложь;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		
		МодульГосударственнаяСлужба = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужба");
		ЭтоВариантОтчетаТ2ГСМС = МодульГосударственнаяСлужба.ЭтоВариантОтчетаТ2ГСМС(КлючВарианта);
		
	КонецЕсли;
	
	Если КлючВарианта = "Т2" Или ЭтоВариантОтчетаТ2ГСМС Тогда
		
		Данные = Новый ДеревоЗначений;
		
		Попытка
			
			СтандартнаяОбработка = Ложь;
			
			Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("ОбъектыПечати") Тогда
				ОбъектыПечати = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.ОбъектыПечати;
			Иначе
				ОбъектыПечати = Новый СписокЗначений;
			КонецЕсли;
			
			// Параметры документа
			ДокументРезультат.ТолькоПросмотр = Истина;
			ДокументРезультат.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УнифицированнаяФормаТ2";
			ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
			ДокументРезультат.Очистить();
			ДокументРезультат.АвтоМасштаб = Истина;
			ДокументРезультат.НачатьАвтогруппировкуСтрок();
			
			НастройкиОтчета = ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();
			НастройкиОтчета.Выбор.Элементы.Очистить();
			СоответствиеПользовательскихПолей = ЗарплатаКадрыОтчеты.СоответствиеПользовательскихПолей(НастройкиОтчета);
			ПроверитьЗначенияПараметров(НастройкиОтчета, Истина);
			
			ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
			Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("СтандартнаяДатаНачала") Тогда
				ДатаОтчета = ЗначениеПараметра.Значение.Дата;
			Иначе
				ДатаОтчета = ЗначениеПараметра.Значение;
			КонецЕсли;
			
			РаботникКадровойСлужбыРасшифровкаПодписи = "";
			ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РаботникКадровойСлужбы"));
			Если ЗначениеПараметра <> Неопределено
				И ЗначениеЗаполнено(ЗначениеПараметра.Значение) Тогда
				
				КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, ЗначениеПараметра.Значение, "ИОФамилия", ДатаОтчета);
				Если КадровыеДанные.Количество() > 0 Тогда
					РаботникКадровойСлужбыРасшифровкаПодписи = КадровыеДанные[0].ИОФамилия;
				КонецЕсли;
				
			КонецЕсли;
			
			КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
			МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных, НастройкиОтчета,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
			
			// Создадим и инициализируем процессор компоновки.
			ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
			
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
			ПроцессорВывода.УстановитьОбъект(Данные);
			
			// Обозначим начало вывода
			ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
			
			Группировки = ЗарплатаКадрыОтчеты.ПолучитьПоляГруппировок(ЭтотОбъект.КомпоновщикНастроек);
			
			ВывестиМакетыСГруппировкамиT2(ДокументРезультат, Данные, Группировки, ДатаОтчета, СоответствиеПользовательскихПолей, РаботникКадровойСлужбыРасшифровкаПодписи, КлючВарианта, ОбъектыПечати);
			
			ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
			
		Исключение
			ВызватьИсключение НСтр("ru = 'В настройку отчета внесены критичные изменения. Отчет не будет сформирован.'") + " " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
		ДопСвойства = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;
		ДопСвойства.Вставить("ОтчетПустой", Данные.Строки.Количество() = 0);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьОтчет() Экспорт
	
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаполнитьОбщиеИсточникиДанныхОтчета(ЭтотОбъект);
	
КонецПроцедуры

// Для общей формы "Форма отчета" подсистемы "Варианты отчетов".
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	
КонецПроцедуры

// Вызывается перед загрузкой новых настроек. Используется для изменения схемы компоновки.
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	
	Если КлючСхемы <> "СхемаИнициализирована" Тогда
		
		ИнициализироватьОтчет();
		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКомпоновкиДанных, КлючСхемы);
		
		КлючСхемы = "СхемаИнициализирована";
		
	КонецЕсли;
	
КонецПроцедуры

// Унифицированная форма Т-2

Процедура ВывестиМакетыСГруппировкамиT2(ДокументРезультат, Данные, Группировки, ДатаОтчета, СоответствиеПользовательскихПолей, РаботникКадровойСлужбыРасшифровкаПодписи, КлючВарианта, ОбъектыПечати)
	
	Если Группировки.Количество() > 0 Тогда
	
		Для Каждого СтрокаДанных Из Данные.Строки Цикл
		
			ПолеДанных = Группировки[0].Значение;
			ВывестиГруппировкуT2(ДокументРезультат, СтрокаДанных, ПолеДанных, 0, СоответствиеПользовательскихПолей);
			ВывестиВложенныеГруппировкиСМакетамиT2(ДокументРезультат, СтрокаДанных, Группировки, 1, ДатаОтчета, СоответствиеПользовательскихПолей, РаботникКадровойСлужбыРасшифровкаПодписи, КлючВарианта, ОбъектыПечати);
		
		КонецЦикла;
		
	Иначе
		
		ДополнительныеСведения = КадровыйУчет.ДополнительныеСведенияУнифицированнойФормыТ2(Данные.Строки, ДатаОтчета, КлючВарианта);
		
		Для Каждого СтрокаДанных Из Данные.Строки Цикл
			
			ВывестиМакетT2(ДокументРезультат, СтрокаДанных, 0, ДатаОтчета, ДополнительныеСведения, СоответствиеПользовательскихПолей, РаботникКадровойСлужбыРасшифровкаПодписи, КлючВарианта, ОбъектыПечати);
			
			Если СтрокаДанных <> Данные.Строки.Получить(Данные.Строки.Количество() - 1) Тогда
				ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиВложенныеГруппировкиСМакетамиT2(ДокументРезультат, Данные, Группировки, Уровень, ДатаОтчета, СоответствиеПользовательскихПолей, РаботникКадровойСлужбыРасшифровкаПодписи, КлючВарианта, ОбъектыПечати)
	
	Если Группировки.Количество() > Уровень Тогда 
		
		Для Каждого СтрокаДанных Из Данные.Строки Цикл
		
			ПолеДанных = Группировки[Уровень].Значение;
			ВывестиГруппировкуT2(ДокументРезультат, СтрокаДанных, ПолеДанных, Уровень,  СоответствиеПользовательскихПолей);
			ВывестиВложенныеГруппировкиСМакетамиT2(ДокументРезультат, СтрокаДанных, Группировки, Уровень + 1, ДатаОтчета,  СоответствиеПользовательскихПолей, РаботникКадровойСлужбыРасшифровкаПодписи, КлючВарианта, ОбъектыПечати);
		
		КонецЦикла;
		
	Иначе
		
		ДополнительныеСведения = КадровыйУчет.ДополнительныеСведенияУнифицированнойФормыТ2(Данные.Строки, ДатаОтчета, КлючВарианта);
		
		Для Каждого СтрокаДанных Из Данные.Строки Цикл
			
			ВывестиМакетT2(ДокументРезультат, СтрокаДанных, Уровень, ДатаОтчета, ДополнительныеСведения,  СоответствиеПользовательскихПолей, РаботникКадровойСлужбыРасшифровкаПодписи, КлючВарианта, ОбъектыПечати);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиГруппировкуT2(ДокументРезультат, СтрокаДанных, Поле, Уровень, СоответствиеПользовательскихПолей)
	
	МакетГруппировки  = УправлениеПечатью.МакетПечатнойФормы("Отчет.УнифицированнаяФормаТ2.ПФ_MXL_Т2");
	ОбластьГруппировки = МакетГруппировки.ПолучитьОбласть("Группировка");
	
	ДоступноеПоле = КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(Новый ПолеКомпоновкиДанных(Поле));
	
	ОбластьГруппировки.Параметры.НазваниеПараметра = ДоступноеПоле.Заголовок;
	ОбластьГруппировки.Параметры.Значение = СтрокаДанных[СтрЗаменить(Поле, ".", "")];
	
	ДокументРезультат.Вывести(ОбластьГруппировки, Уровень);
	
КонецПроцедуры 

Процедура ВывестиМакетT2(ДокументРезультат, СтрокаДанных, Уровень, ДатаОтчета, ДополнительныеСведения, СоответствиеПользовательскихПолей, РаботникКадровойСлужбыРасшифровкаПодписи, КлючВарианта, ОбъектыПечати) 
	
	ПерваяСтрокаФормы = ДокументРезультат.ВысотаТаблицы + 1;
	
	НастройкиПечатныхФорм = ЗарплатаКадрыПовтИсп.НастройкиПечатныхФорм();
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.УнифицированнаяФормаТ2.ПФ_MXL_Т2");
	
	ПерваяСтраницаТ2						= Макет.ПолучитьОбласть("ПерваяСтраницаТ2");
	ВоинскийУчет 							= Макет.ПолучитьОбласть("ВоинскийУчет");
	ШапкаНазначения 						= Макет.ПолучитьОбласть("ШапкаНазначения");
	СтрокаНазначения 						= Макет.ПолучитьОбласть("СтрокаНазначения");
	НазначенияКоличествоСтрок		        = 5;
	ШапкаОтпуска							= Макет.ПолучитьОбласть("ШапкаОтпуска");
	СтрокаОтпуска							= Макет.ПолучитьОбласть("СтрокаОтпуска");
	ОбластьДополнительныеСведения			= Макет.ПолучитьОбласть("ДополнительныеСведения");
	
	ПерваяСтраницаТ2.Параметры.Заполнить(СтрокаДанных);
	
	ПерваяСтраницаТ2.Параметры.МестоРождения = ПерсонифицированныйУчетКлиентСервер.ПредставлениеМестаРождения("0, " + СтрокаДанных.ЛичныеДанныеМестоРождения);
	ПерваяСтраницаТ2.Параметры.ДатаАктуальности = ДатаОтчета;
	ПерваяСтраницаТ2.Параметры.ТабельныйНомер = СтрокаДанных.РабочееМестоТабельныйНомер;
	ЗарплатаКадрыОтчеты.ЗаполнитьПараметрыПользовательскихПолей(ПерваяСтраницаТ2, СтрокаДанных, СоответствиеПользовательскихПолей);
	
	ПерваяСтраницаТ2.Параметры.ГодРождения = Год(СтрокаДанных.ЛичныеДанныеДатаРождения);
	ПерваяСтраницаТ2.Параметры.МесяцРождения = Месяц(СтрокаДанных.ЛичныеДанныеДатаРождения);
	ПерваяСтраницаТ2.Параметры.ЧислоРождения = День(СтрокаДанных.ЛичныеДанныеДатаРождения);
	
	ПерваяСтраницаТ2.Параметры.ДокументНомер = Строка(СтрокаДанных.ЛичныеДанныеУдостоверениеДокументНомер);
	ПерваяСтраницаТ2.Параметры.ВидДокумента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Документ, удостоверяющий личность: %1'"), СтрокаДанных.ЛичныеДанныеУдостоверениеДокументВид);
	//Образование
	ДанныеЗаполнения = ДополнительныеСведения.Получить("ДанныеЗаполненияОбразования");

	Если ДанныеЗаполнения = Неопределено Тогда
		ДанныеЗаполненияПоСотруднику = Новый Массив;
	Иначе
		ДанныеЗаполненияПоСотруднику = ДанныеЗаполнения.Получить(СтрокаДанных.ЛичныеДанныеФизическоеЛицо);
		Если ДанныеЗаполненияПоСотруднику = Неопределено Тогда
			ДанныеЗаполненияПоСотруднику = Новый Массив;
		КонецЕсли;
	КонецЕсли;
	
	ПерваяСтраницаТ2.Параметры.Образование 			 	= "";
	ПерваяСтраницаТ2.Параметры.НазваниеВУЗа 			= "";
	ПерваяСтраницаТ2.Параметры.ГодОкончанияВУЗа		 	= "";
	ПерваяСтраницаТ2.Параметры.НазваниеУчилища 			= "";
	ПерваяСтраницаТ2.Параметры.ГодОкончанияУчилища	 	= "";
	ПерваяСтраницаТ2.Параметры.ЛичныеДанныеКвалификация = "";
	ПерваяСтраницаТ2.Параметры.Специальность 			= "";
	ПерваяСтраницаТ2.Параметры.НомерДиплома 			= "";
	ПерваяСтраницаТ2.Параметры.ДатаДиплома 				= "";

	ОчноеОбучение	 = Ложь;
	ЗаочноеОбучение	 = Ложь;
	ВечернееОбучение = Ложь;
	
	Для Каждого ДанныеОбразование ИЗ ДанныеЗаполненияПоСотруднику Цикл
		ПерваяСтраницаТ2.Параметры.Образование 			 	= ?(ПерваяСтраницаТ2.Параметры.Образование <> "", ПерваяСтраницаТ2.Параметры.Образование + "; ", "") + ДанныеОбразование.Образование;
		ПерваяСтраницаТ2.Параметры.НазваниеВУЗа				= ?(ПерваяСтраницаТ2.Параметры.НазваниеВУЗа  <> "", ПерваяСтраницаТ2.Параметры.НазваниеВУЗа + "; ", "") + ДанныеОбразование.УчебноеЗаведениеВУЗ;
		ПерваяСтраницаТ2.Параметры.ГодОкончанияВУЗа		 	= ?(ПерваяСтраницаТ2.Параметры.ГодОкончанияВУЗа <> "", ПерваяСтраницаТ2.Параметры.ГодОкончанияВУЗа + "; ", "") + ДанныеОбразование.ОкончаниеВУЗ;
		ПерваяСтраницаТ2.Параметры.НазваниеУчилища 			= ?(ПерваяСтраницаТ2.Параметры.НазваниеУчилища  <> "", ПерваяСтраницаТ2.Параметры.НазваниеУчилища + "; ", "") + ДанныеОбразование.УчебноеЗаведениеУчилище;
		ПерваяСтраницаТ2.Параметры.ГодОкончанияУчилища	 	= ?(ПерваяСтраницаТ2.Параметры.ГодОкончанияУчилища <> "", ПерваяСтраницаТ2.Параметры.ГодОкончанияУчилища + "; ", "") + ДанныеОбразование.ОкончаниеУчилище;
		ПерваяСтраницаТ2.Параметры.ЛичныеДанныеКвалификация = ?(ПерваяСтраницаТ2.Параметры.ЛичныеДанныеКвалификация <> "", ПерваяСтраницаТ2.Параметры.ЛичныеДанныеКвалификация + "; ", "") + ДанныеОбразование.Квалификация;
		ПерваяСтраницаТ2.Параметры.Специальность 			= ?(ПерваяСтраницаТ2.Параметры.Специальность <> "", ПерваяСтраницаТ2.Параметры.Специальность + "; ", "") + ДанныеОбразование.Специальность;
		ПерваяСтраницаТ2.Параметры.НомерДиплома 			= ?(ПерваяСтраницаТ2.Параметры.НомерДиплома <> "", ПерваяСтраницаТ2.Параметры.НомерДиплома + "; ", "") + ДанныеОбразование.Номер;
		ПерваяСтраницаТ2.Параметры.ДатаДиплома 			 	= ?(ПерваяСтраницаТ2.Параметры.ДатаДиплома <> "", ПерваяСтраницаТ2.Параметры.ДатаДиплома + "; ", "") + ?(ЗначениеЗаполнено(ДанныеОбразование.ДатаВыдачи),"«"+ Строка(Формат(ДанныеОбразование.ДатаВыдачи, "ДФ=дд"))
																		+"» " + Формат(ДанныеОбразование.ДатаВыдачи, "ДФ=ММММ")+" «"+Формат(ДанныеОбразование.ДатаВыдачи, "ДФ=гггг")+НСтр("ru = '»'"), НСтр("ru = '«____» ____________ «________»'"));
																		
		Если ДанныеОбразование.ФормаОбучения = Перечисления.ФормыОбученияФизическихЛиц.ОчноеОбучение Тогда
			ОчноеОбучение = Истина;
		ИначеЕсли ДанныеОбразование.ФормаОбучения = Перечисления.ФормыОбученияФизическихЛиц.ЗаочноеОбучение 
			ИЛИ ДанныеОбразование.ФормаОбучения = Перечисления.ФормыОбученияФизическихЛиц.ДистанционноеОбучение
			ИЛИ ДанныеОбразование.ФормаОбучения = Перечисления.ФормыОбученияФизическихЛиц.Экстернат Тогда
			ЗаочноеОбучение = Истина;
		ИначеЕсли ДанныеОбразование.ФормаОбучения = Перечисления.ФормыОбученияФизическихЛиц.ВечернееОбучение Тогда 
			ВечернееОбучение = Истина;
		КонецЕсли;
			
	КонецЦикла;
	
	Если НЕ ОчноеОбучение Тогда
		ПерваяСтраницаТ2.Области.Дневное.Шрифт = Новый Шрифт("Arial", 9,,,, Истина);	
	КонецЕсли;
	
	Если НЕ ЗаочноеОбучение Тогда
		ПерваяСтраницаТ2.Области.Заочное.Шрифт = Новый Шрифт("Arial", 9,,,, Истина);	
	КонецЕсли;
	
	Если НЕ ВечернееОбучение Тогда
		ПерваяСтраницаТ2.Области.Вечернее.Шрифт = Новый Шрифт("Arial", 9,,,, Истина);	
	КонецЕсли;
	
	//Стажи
	ДанныеЗаполнения = ДополнительныеСведения.Получить("ДанныеЗаполненияСтажи");
	Если Не ДанныеЗаполнения = Неопределено Тогда
		ДанныеЗаполненияПоСотруднику = ДанныеЗаполнения.Получить(СтрокаДанных.ЛичныеДанныеФизическоеЛицо);
		
		Если Не ДанныеЗаполненияПоСотруднику = Неопределено Тогда
			Для Каждого ТекСтрока Из ДанныеЗаполненияПоСотруднику Цикл
				
				СтрокаСтажа = "";
				Если ТекСтрока.СтажЛет <> 0 Тогда
					СтрокаСтажа = "" + ТекСтрока.СтажЛет + ?(ТекСтрока.СтажЛет <= 4, НСтр("ru = ' г.'"),  НСтр("ru = ' л.'"));
				КонецЕсли;
				
				Если ТекСтрока.СтажМесяцев <> 0 Тогда
					Если СтрокаСтажа <> "" Тогда
						СтрокаСтажа = СтрокаСтажа + " ";
					КонецЕсли;
					
					СтрокаСтажа = СтрокаСтажа + ТекСтрока.СтажМесяцев + НСтр("ru = ' м.'");
				КонецЕсли;
				
				Если ТекСтрока.СтажДней <> 0 Тогда
					Если СтрокаСтажа <> "" Тогда
						СтрокаСтажа = СтрокаСтажа + " ";
					КонецЕсли;
					
					СтрокаСтажа = СтрокаСтажа + ТекСтрока.СтажДней + НСтр("ru = ' дн.'");
				КонецЕсли;
				
				Если ТекСтрока.СтажВид = Справочники.ВидыСтажа.СтажНаНадбавкуЗаВыслугуЛет Тогда
					ПерваяСтраницаТ2.Параметры.СтажРаботыПоСпециальности = СтрокаСтажа; 
				ИначеЕсли ТекСтрока.СтажВид = Справочники.ВидыСтажа.ОбщийСтаж Тогда
					ПерваяСтраницаТ2.Параметры.ОбщийСтажРаботы = СтрокаСтажа; 
				ИначеЕсли ТекСтрока.СтажВид = Справочники.ВидыСтажа.НепрерывныйСтаж Тогда
					ПерваяСтраницаТ2.Параметры.НепрерывныйСтаж = СтрокаСтажа; 
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
	
	КонецЕсли;
	
	//Последнее место работы
	
	ПерваяСтраницаТ2.Параметры.ПоследнееМестоРаботы = ?(ЗначениеЗаполнено(СтрокаДанных.ЛичныеДанныеПоследнееМестоРаботыОрганизация), СтрокаДанных.ЛичныеДанныеПоследнееМестоРаботыОрганизация+", "+ СтрокаДанных.ЛичныеДанныеПоследнееМестоРаботыДолжность, ""); 
	
	// Состав семьи
	ДанныеЗаполнения = ДополнительныеСведения.Получить("ДанныеЗаполненияСоставСемьи");
	Если Не ДанныеЗаполнения = Неопределено Тогда
		ДанныеЗаполненияПоСотруднику = ДанныеЗаполнения.Получить(СтрокаДанных.ЛичныеДанныеФизическоеЛицо);
		НомерСтроки = 1;
		
		Если Не ДанныеЗаполненияПоСотруднику = Неопределено Тогда
			Для Каждого ТекСтрока Из ДанныеЗаполненияПоСотруднику Цикл
				ПерваяСтраницаТ2.Параметры["ЧленСемьи"+НомерСтроки] = Строка(ТекСтрока.СтепеньРодства) +" "+ТекСтрока.ФИОРодственника+","+ТекСтрока.ГодРожденияРодственника;
				НомерСтроки = НомерСтроки + 1;
				Если НомерСтроки > 5 Тогда
					// В отчете выводятся только первые 5 членов семьи
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	
	КонецЕсли;
	
	//АДРЕСА
	
	Если ЗначениеЗаполнено(СтрокаДанных.ЛичныеДанныеКонтактнаяИнформацияАдресМестаПроживанияПредставление) Тогда
		ПерваяСтраницаТ2.Параметры.ДомашнийАдрес1 = Сред(СтрокаДанных.ЛичныеДанныеКонтактнаяИнформацияАдресМестаПроживанияПредставление, 1, 26);
		ПерваяСтраницаТ2.Параметры.ДомашнийАдрес2 = Сред(СтрокаДанных.ЛичныеДанныеКонтактнаяИнформацияАдресМестаПроживанияПредставление, 27);
	КонецЕсли;
	
	ДокументРезультат.Вывести(ПерваяСтраницаТ2);
	ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	
	ВоинскийУчет.Параметры.Заполнить(СтрокаДанных);
	ДокументРезультат.Вывести(ВоинскийУчет);
	
	// Прием на работу и переводы на другую работу.
	ДокументРезультат.Вывести(ШапкаНазначения, Уровень+1);
	ДанныеЗаполнения = ДополнительныеСведения.Получить("ДанныеЗаполненияКадровойИстории");
	Если ДанныеЗаполнения = Неопределено Тогда
		ДанныеЗаполненияПоСотруднику = Новый Массив;
	Иначе
		ДанныеЗаполненияПоСотруднику = ДанныеЗаполнения.Получить(СтрокаДанных.РабочееМестоСотрудник);
		Если ДанныеЗаполненияПоСотруднику = Неопределено Тогда
			ДанныеЗаполненияПоСотруднику = Новый Массив;
		КонецЕсли;
	КонецЕсли;
	ЗарплатаКадры.СформироватьОбластьТабличногоДокументаСОграниченнымНаборомСтрок(ДокументРезультат, ДанныеЗаполненияПоСотруднику,
		?(ДанныеЗаполненияПоСотруднику.Количество() = 0, 1, ДанныеЗаполненияПоСотруднику.Количество()), , ШапкаНазначения, СтрокаНазначения, , );
		
		
	// Отпуск
	ДокументРезультат.Вывести(ШапкаОтпуска, Уровень+1);
	ДанныеЗаполнения = ДополнительныеСведения.Получить("ДанныеЗаполненияОтпуска");
	Если ДанныеЗаполнения = Неопределено Тогда
		ДанныеЗаполненияПоСотруднику = Новый Массив;
	Иначе
		ДанныеЗаполненияПоСотруднику = ДанныеЗаполнения.Получить(СтрокаДанных.РабочееМестоСотрудник);
		Если ДанныеЗаполненияПоСотруднику = Неопределено Тогда
			ДанныеЗаполненияПоСотруднику = Новый Массив;
		КонецЕсли;
	КонецЕсли;
	ЗарплатаКадры.СформироватьОбластьТабличногоДокументаСОграниченнымНаборомСтрок(ДокументРезультат, ДанныеЗаполненияПоСотруднику,
		?(ДанныеЗаполненияПоСотруднику.Количество() = 0, 1, ДанныеЗаполненияПоСотруднику.Количество()), , ШапкаОтпуска, СтрокаОтпуска, , );
		
			
	Если ЗначениеЗаполнено(СтрокаДанных.РабочееМестоПриказОбУвольненииДата) ИЛИ ЗначениеЗаполнено(СтрокаДанных.РабочееМестоДатаУвольнения) Тогда
		
		ОбластьДополнительныеСведения.Параметры.ДатаИПричинаУвольнения	= Формат(СтрокаДанных.РабочееМестоДатаУвольнения, "ДЛФ=D") + ", "
					+ СокрЛП(СтрокаДанных.РабочееМестоПриказОбУвольненииСтатьяТКРФ) + НСтр("ru = ', приказ (распоряжение) №'") + СокрЛП(СтрокаДанных.РабочееМестоПриказОбУвольненииНомер) 
					+ НСтр("ru = ' от '") + Формат(СтрокаДанных.РабочееМестоПриказОбУвольненииДата, "ДФ=дд.ММ.гггг");

	КонецЕсли;

	ДокументРезультат.Вывести(ОбластьДополнительныеСведения, Уровень+1);
	ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();

	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ДокументРезультат, ПерваяСтрокаФормы, ОбъектыПечати, СтрокаДанных.РабочееМестоСотрудник);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Универсальные процедуры и Функции.

Процедура ПроверитьЗначенияПараметров(НастройкиОтчета, ВыводитьПодписантов = Ложь)
	
	ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	
	Если ЗначениеПараметра <> Неопределено Тогда
		
		УстановитьДатуОтчета = Ложь;
		Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("Неопределено") Тогда
			УстановитьДатуОтчета = Истина;
		КонецЕсли;
		
		Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("Дата")
			И ЗначениеПараметра.Значение = '00010101' Тогда
			УстановитьДатуОтчета = Истина;
		КонецЕсли;
		
		Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("СтандартнаяДатаНачала")
			И Дата(ЗначениеПараметра.Значение) = '00010101' Тогда
			УстановитьДатуОтчета = Истина;
		КонецЕсли;
		
		Если УстановитьДатуОтчета Тогда
			ЗначениеПараметра.Значение = ТекущаяДатаСеанса();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВыводитьПодписантов Тогда
		
		ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РаботникКадровойСлужбы"));
		Если НЕ ЗначениеПараметра.Использование Тогда
			ЗначениеПараметра.Значение = Неопределено;
		КонецЕсли;
		
		ЗначениеПараметра.Использование = Истина;
		
		ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДолжностьРаботникаКадровойСлужбы"));
		Если НЕ ЗначениеПараметра.Использование Тогда
			ЗначениеПараметра.Значение = Неопределено;
		КонецЕсли;
		
		ЗначениеПараметра.Использование = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли